{
    "title": "How to Make a Top Knot Bun",
    "url": "https://www.wikihow.com/Make-a-Top-Knot-Bun",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Hairstyles",
        "Updos",
        "Hair Buns",
        "Top Knots"
    ],
    "methods": [
        {
            "name": "Doing a Neat Top Knot Bun",
            "steps": [
                {
                    "headline": "Pull your hair into a high ponytail.",
                    "description": "Comb back your hair away from your forehead, then take your hair and pull it into a high ponytail near the top of your head, securing it tightly with a hairband. It's easier to do a top knot bun on second or third day hair rather than clean hair. If you have curly or textured hair, begin by blow drying your hair straight. This way, you'll have a smooth, neat ponytail. If you have frizzy hair, add a small amount of gel or serum around your hairline before brushing the hair into a ponytail. Doing so will ensure your ponytail is sleek."
                },
                {
                    "headline": "Divide your ponytail into two sections.",
                    "description": "Take the hair of your ponytail and divide it into two equal sized sections. Add a small amount of mousse or styling cream to each section to make the hair extra smooth."
                },
                {
                    "headline": "Wrap each section around each other.",
                    "description": "Take one section of hair in each hand and twist them together all the way down to make them into one piece. Twisting your hair like this will make your top knot even more smooth and prevents flyaways. This method is done most easily with longer hair."
                },
                {
                    "headline": "Wrap your hair around the hair tie.",
                    "description": "Take your twisted hair and wrap it in a clockwise direction around your hair tie."
                },
                {
                    "headline": "Pin the top knot in place.",
                    "description": "Once you finish wrapping use several bobby pins the same color as your hair to pin the top knot in place, both at the top and bottom of the bun. Spray with hairspray to give the style extra hold."
                }
            ]
        },
        {
            "name": "Making a Voluminous Top Knot Bun",
            "steps": [
                {
                    "headline": "Comb your hair into a ponytail.",
                    "description": "Work with second or third day hair or spray your hair with dry shampoo to give it some texture. Then comb your hair into a high ponytail near the top of your head, securing it with a hair tie. This style is especially good for those with curly or wavy hair, since curly hair gives you a more voluminous look."
                },
                {
                    "headline": "Backcomb your hair.",
                    "description": "Take about a quarter of your hair from the ponytail and hold it straight up above your head. Use a comb to backcomb through the hair, starting at the midpoint of the hair and combing down to the base of the ponytail. Repeat until you have lightly backcombed each section of hair. Backcombing your hair makes it more voluminous and textured so that your top knot is fuller."
                },
                {
                    "headline": "Smooth the top of the ponytail.",
                    "description": "After backcombing your hair, take the comb and lightly brush the very top layer of hair in the ponytail, brushing from the base of the ponytail down to the tips of the hair. Comb very gently with a brush rather than a comb, which will be easier to work with on backcombed hair. Smoothing this very top layer of the ponytail will keep the top knot looking smooth, even if the hair in the center of the top knot is full and textured."
                },
                {
                    "headline": "Wrap your hair in a bun around the base of the ponytail.",
                    "description": "Take the hair of your ponytail and wrap it clockwise around the base of the ponytail. When you reach the tips of your hair, tuck the hair underneath the hair tie."
                },
                {
                    "headline": "Pin the bun in place with bobby pins.",
                    "description": "After you twist your hair into the top knot, pin your hair in place with several bobby pins. Use your fingers to pull the bun out if you wish to give it more volume and then spray lightly with hairspray to give it better hold."
                }
            ]
        },
        {
            "name": "Making a Top Knot Bun with a Hair Donut",
            "steps": [
                {
                    "headline": "Put your hair in a high ponytail.",
                    "description": "Pull back your hair into a high ponytail. If it helps, you can brush your hair back so that your hair is smooth and bump-free. Remove all tangles from your hair with a brush before styling. If you have unruly hair, start with a blow out to create a smooth ponytail."
                },
                {
                    "headline": "Put a hair donut around the base of your ponytail.",
                    "description": "Poke your hair through a hair donut and pull it all the way to the base of your ponytail. If you don't have a hair donut, you can also take a clean tube sock, cut off the top of the tube sock so you get a three inch or so (7.62 cm or so) band of sock, then pull the loop of sock through your ponytail until it reaches the base. You should be able to find a hair donut at beauty supply stores or online retailers."
                },
                {
                    "headline": "Tease your hair.",
                    "description": "Take your ponytail and hold it straight up in the air with one hand. With the other, take a comb and backcomb through your hair, starting at the midsection of your hair and combing down to the base. Teasing your hair gives it the volume to completely cover the donut. If your hair is already extra thick, skip teasing."
                },
                {
                    "headline": "Wrap your hair around the donut.",
                    "description": "Take your teased hair and start to wrap it clockwise around the hair donut to completely cover it. When you reach the tips of your hair, tuck the tips under the donut."
                },
                {
                    "headline": "Pin your bun in place.",
                    "description": "Use several bobby pins to pin your hair around the hair donut and secure it in place. Spritz the bun with hairspray to prevent flyaways and to give the style extra hold."
                }
            ]
        },
        {
            "name": "Doing a Half Down Top Knot",
            "steps": [
                {
                    "headline": "Make a horizontal part.",
                    "description": "To do this half-up top knot, do a horizontal part that divides the top of your hair from the bottom, starting at about ear level on one side and parting over to the other side. Since this is a laid back look, you don't have to precisely part your hair on each side, as long as each side is roughly symmetrical. This look can work either on short or long hair."
                },
                {
                    "headline": "Hold your hair in a ponytail.",
                    "description": "Take the top section of hair and gather it into a high ponytail on the top of your head. Hold it in a ponytail using one hand."
                },
                {
                    "headline": "Wrap your hair into a bun.",
                    "description": "Hold your hair in a ponytail with the fingers of one hand and use the other to wind your hair clockwise around the base of your ponytail that you are holding with your fingers. If you have short hair, make a small loop and hold it in place with your fingers instead of wrapping your hair around."
                },
                {
                    "headline": "Secure your hair with a hair elastic.",
                    "description": "After you have wrapped the hair around until you reach the tips, or have made a small loop if you have short hair, use a hair tie to secure the bun. If you want a fuller looking top knot, pull the bun gently with your fingers to make it bigger."
                }
            ]
        }
    ],
    "tyn": [
        "Hair Ties",
        "Mousse or Curling Cream",
        "Comb",
        "Hair Donut",
        "Hairspray"
    ],
    "text": " Doing a Neat Top Knot Bun Pull your hair into a high ponytail. Comb back your hair away from your forehead, then take your hair and pull it into a high ponytail near the top of your head, securing it tightly with a hairband. It's easier to do a top knot bun on second or third day hair rather than clean hair. If you have curly or textured hair, begin by blow drying your hair straight. This way, you'll have a smooth, neat ponytail. If you have frizzy hair, add a small amount of gel or serum around your hairline before brushing the hair into a ponytail. Doing so will ensure your ponytail is sleek. Divide your ponytail into two sections. Take the hair of your ponytail and divide it into two equal sized sections. Add a small amount of mousse or styling cream to each section to make the hair extra smooth. Wrap each section around each other. Take one section of hair in each hand and twist them together all the way down to make them into one piece. Twisting your hair like this will make your top knot even more smooth and prevents flyaways. This method is done most easily with longer hair. Wrap your hair around the hair tie. Take your twisted hair and wrap it in a clockwise direction around your hair tie. Pin the top knot in place. Once you finish wrapping use several bobby pins the same color as your hair to pin the top knot in place, both at the top and bottom of the bun. Spray with hairspray to give the style extra hold. Making a Voluminous Top Knot Bun Comb your hair into a ponytail. Work with second or third day hair or spray your hair with dry shampoo to give it some texture. Then comb your hair into a high ponytail near the top of your head, securing it with a hair tie. This style is especially good for those with curly or wavy hair, since curly hair gives you a more voluminous look. Backcomb your hair. Take about a quarter of your hair from the ponytail and hold it straight up above your head. Use a comb to backcomb through the hair, starting at the midpoint of the hair and combing down to the base of the ponytail. Repeat until you have lightly backcombed each section of hair. Backcombing your hair makes it more voluminous and textured so that your top knot is fuller. Smooth the top of the ponytail. After backcombing your hair, take the comb and lightly brush the very top layer of hair in the ponytail, brushing from the base of the ponytail down to the tips of the hair. Comb very gently with a brush rather than a comb, which will be easier to work with on backcombed hair. Smoothing this very top layer of the ponytail will keep the top knot looking smooth, even if the hair in the center of the top knot is full and textured. Wrap your hair in a bun around the base of the ponytail. Take the hair of your ponytail and wrap it clockwise around the base of the ponytail. When you reach the tips of your hair, tuck the hair underneath the hair tie. Pin the bun in place with bobby pins. After you twist your hair into the top knot, pin your hair in place with several bobby pins. Use your fingers to pull the bun out if you wish to give it more volume and then spray lightly with hairspray to give it better hold. Making a Top Knot Bun with a Hair Donut Put your hair in a high ponytail. Pull back your hair into a high ponytail. If it helps, you can brush your hair back so that your hair is smooth and bump-free. Remove all tangles from your hair with a brush before styling. If you have unruly hair, start with a blow out to create a smooth ponytail. Put a hair donut around the base of your ponytail. Poke your hair through a hair donut and pull it all the way to the base of your ponytail. If you don't have a hair donut, you can also take a clean tube sock, cut off the top of the tube sock so you get a three inch or so (7.62 cm or so) band of sock, then pull the loop of sock through your ponytail until it reaches the base. You should be able to find a hair donut at beauty supply stores or online retailers. Tease your hair. Take your ponytail and hold it straight up in the air with one hand. With the other, take a comb and backcomb through your hair, starting at the midsection of your hair and combing down to the base. Teasing your hair gives it the volume to completely cover the donut. If your hair is already extra thick, skip teasing. Wrap your hair around the donut. Take your teased hair and start to wrap it clockwise around the hair donut to completely cover it. When you reach the tips of your hair, tuck the tips under the donut. Pin your bun in place. Use several bobby pins to pin your hair around the hair donut and secure it in place. Spritz the bun with hairspray to prevent flyaways and to give the style extra hold. Doing a Half Down Top Knot Make a horizontal part. To do this half-up top knot, do a horizontal part that divides the top of your hair from the bottom, starting at about ear level on one side and parting over to the other side. Since this is a laid back look, you don't have to precisely part your hair on each side, as long as each side is roughly symmetrical. This look can work either on short or long hair. Hold your hair in a ponytail. Take the top section of hair and gather it into a high ponytail on the top of your head. Hold it in a ponytail using one hand. Wrap your hair into a bun. Hold your hair in a ponytail with the fingers of one hand and use the other to wind your hair clockwise around the base of your ponytail that you are holding with your fingers. If you have short hair, make a small loop and hold it in place with your fingers instead of wrapping your hair around. Secure your hair with a hair elastic. After you have wrapped the hair around until you reach the tips, or have made a small loop if you have short hair, use a hair tie to secure the bun. If you want a fuller looking top knot, pull the bun gently with your fingers to make it bigger.",
    "sentences": [
        " Doing a Neat Top Knot Bun Pull your hair into a high ponytail.",
        "Comb back your hair away from your forehead, then take your hair and pull it into a high ponytail near the top of your head, securing it tightly with a hairband.",
        "It's easier to do a top knot bun on second or third day hair rather than clean hair.",
        "If you have curly or textured hair, begin by blow drying your hair straight.",
        "This way, you'll have a smooth, neat ponytail.",
        "If you have frizzy hair, add a small amount of gel or serum around your hairline before brushing the hair into a ponytail.",
        "Doing so will ensure your ponytail is sleek.",
        "Divide your ponytail into two sections.",
        "Take the hair of your ponytail and divide it into two equal sized sections.",
        "Add a small amount of mousse or styling cream to each section to make the hair extra smooth.",
        "Wrap each section around each other.",
        "Take one section of hair in each hand and twist them together all the way down to make them into one piece.",
        "Twisting your hair like this will make your top knot even more smooth and prevents flyaways.",
        "This method is done most easily with longer hair.",
        "Wrap your hair around the hair tie.",
        "Take your twisted hair and wrap it in a clockwise direction around your hair tie.",
        "Pin the top knot in place.",
        "Once you finish wrapping use several bobby pins the same color as your hair to pin the top knot in place, both at the top and bottom of the bun.",
        "Spray with hairspray to give the style extra hold.",
        "Making a Voluminous Top Knot Bun Comb your hair into a ponytail.",
        "Work with second or third day hair or spray your hair with dry shampoo to give it some texture.",
        "Then comb your hair into a high ponytail near the top of your head, securing it with a hair tie.",
        "This style is especially good for those with curly or wavy hair, since curly hair gives you a more voluminous look.",
        "Backcomb your hair.",
        "Take about a quarter of your hair from the ponytail and hold it straight up above your head.",
        "Use a comb to backcomb through the hair, starting at the midpoint of the hair and combing down to the base of the ponytail.",
        "Repeat until you have lightly backcombed each section of hair.",
        "Backcombing your hair makes it more voluminous and textured so that your top knot is fuller.",
        "Smooth the top of the ponytail.",
        "After backcombing your hair, take the comb and lightly brush the very top layer of hair in the ponytail, brushing from the base of the ponytail down to the tips of the hair.",
        "Comb very gently with a brush rather than a comb, which will be easier to work with on backcombed hair.",
        "Smoothing this very top layer of the ponytail will keep the top knot looking smooth, even if the hair in the center of the top knot is full and textured.",
        "Wrap your hair in a bun around the base of the ponytail.",
        "Take the hair of your ponytail and wrap it clockwise around the base of the ponytail.",
        "When you reach the tips of your hair, tuck the hair underneath the hair tie.",
        "Pin the bun in place with bobby pins.",
        "After you twist your hair into the top knot, pin your hair in place with several bobby pins.",
        "Use your fingers to pull the bun out if you wish to give it more volume and then spray lightly with hairspray to give it better hold.",
        "Making a Top Knot Bun with a Hair Donut Put your hair in a high ponytail.",
        "Pull back your hair into a high ponytail.",
        "If it helps, you can brush your hair back so that your hair is smooth and bump-free.",
        "Remove all tangles from your hair with a brush before styling.",
        "If you have unruly hair, start with a blow out to create a smooth ponytail.",
        "Put a hair donut around the base of your ponytail.",
        "Poke your hair through a hair donut and pull it all the way to the base of your ponytail.",
        "If you don't have a hair donut, you can also take a clean tube sock, cut off the top of the tube sock so you get a three inch or so (7.62 cm or so) band of sock, then pull the loop of sock through your ponytail until it reaches the base.",
        "You should be able to find a hair donut at beauty supply stores or online retailers.",
        "Tease your hair.",
        "Take your ponytail and hold it straight up in the air with one hand.",
        "With the other, take a comb and backcomb through your hair, starting at the midsection of your hair and combing down to the base.",
        "Teasing your hair gives it the volume to completely cover the donut.",
        "If your hair is already extra thick, skip teasing.",
        "Wrap your hair around the donut.",
        "Take your teased hair and start to wrap it clockwise around the hair donut to completely cover it.",
        "When you reach the tips of your hair, tuck the tips under the donut.",
        "Pin your bun in place.",
        "Use several bobby pins to pin your hair around the hair donut and secure it in place.",
        "Spritz the bun with hairspray to prevent flyaways and to give the style extra hold.",
        "Doing a Half Down Top Knot Make a horizontal part.",
        "To do this half-up top knot, do a horizontal part that divides the top of your hair from the bottom, starting at about ear level on one side and parting over to the other side.",
        "Since this is a laid back look, you don't have to precisely part your hair on each side, as long as each side is roughly symmetrical.",
        "This look can work either on short or long hair.",
        "Hold your hair in a ponytail.",
        "Take the top section of hair and gather it into a high ponytail on the top of your head.",
        "Hold it in a ponytail using one hand.",
        "Wrap your hair into a bun.",
        "Hold your hair in a ponytail with the fingers of one hand and use the other to wind your hair clockwise around the base of your ponytail that you are holding with your fingers.",
        "If you have short hair, make a small loop and hold it in place with your fingers instead of wrapping your hair around.",
        "Secure your hair with a hair elastic.",
        "After you have wrapped the hair around until you reach the tips, or have made a small loop if you have short hair, use a hair tie to secure the bun.",
        "If you want a fuller looking top knot, pull the bun gently with your fingers to make it bigger."
    ]
}