{
    "title": "How to Make Tomato Paste",
    "url": "https://www.wikihow.com/Make-Tomato-Paste",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments",
        "Sauces",
        "Tomato Sauces"
    ],
    "parts": [
        {
            "name": "Preparing the Tomatoes",
            "steps": [
                {
                    "headline": "Cut the tomatoes into rough small pieces.",
                    "description": "Rinse the tomatoes first. With a sharp kitchen knife, cut off the stems at either end of the tomato before slicing it in half vertically. Lay each half down on its side and slice them in half again, this time horizontally. Cut them one more time into even lengthwise strips before chopping them up into small ⁄2 in (1.3 cm) pieces for sautéing. Plum tomatoes work well for this recipe, but any variety of summer tomato can be used. Smaller tomatoes generally have a sweeter, lighter taste, while larger varieties have a richer flavor. For the most complex flavor to your paste, use several varieties of tomatoes. For a smoother paste, try seeding your tomatoes before finely chopping them. If you don’t have a food mill to separate out the skins and seeds, you can easily remove the skins by blanching your tomatoes. After skinning them, chop them up as you would normally, and either manually remove the seeds as you go along, or push the pulp through a fine-mesh strainer to remove the seeds."
                },
                {
                    "headline": "Begin heating oil in a large skillet.",
                    "description": "On a high heat, allow the skillet to get adequately hot. Hold the back of your hand over the pan, and if you feel the heat rising, add ⁄4 cup (59 mL) of extra-virgin olive oil to a skillet at least 12 inches (30 cm) across. Let the oil heat for a few minutes before adding the chopped tomatoes. For the best flavor, use extra-virgin olive oil, though other grades of olive oil also work. If you don’t have olive oil, you can substitute with canola oil, or a flavorless vegetable oil."
                },
                {
                    "headline": "Cook the tomatoes down to a soft paste in the pan for 10 minutes.",
                    "description": "Still on a high heat, add your chopped tomatoes to the skillet, seasoning them with salt to your taste. Bring them to a boil, stirring often, but letting them sit and reduce in the pan each time you stir. Cook until they’re thoroughly softened, almost like a slurry. This should take around 10 minutes on a high heat. The tomatoes may splatter when you add them to the pan or as they’re cooking. To avoid splattering, use a skillet with tall sides, or a pot. The amount of salt you add depends on your own taste. As a rule of thumb, add about ⁄2 teaspoon (2.5 mL) of salt for every 5 plum tomatoes or 2 beefsteak tomatoes. For a different flavor, you could also add 3 cloves of peeled, smashed garlic and 2 bay leaves to the tomatoes as they soften. Just make sure to use the tomato paste in recipes that complement the strong flavor of garlic. For a unique flavor twist, you can skip the salt altogether and add 1 tablespoon (15 mL) of soy sauce instead."
                },
                {
                    "headline": "Steam the tomatoes in the pan for 30 minutes.",
                    "description": "After you’ve reduced the tomatoes, turn off the heat on your stove. Place the lid back on your skillet or pot, and allow the tomatoes to continue to smoke in the pan for an additional half hour. This will allow them to soften enough to push through a food mill."
                },
                {
                    "headline": "Strain the tomatoes through a food mill.",
                    "description": "After the tomatoes have cooled down in the pans, begin passing them through a food mill. You don’t want seeds in your paste, so use its finest plate (with the smallest holes) to separate the skin and seeds from the usable tomato pulp. Strain the tomato flesh until you’re left with a thin tomato liquid."
                }
            ]
        },
        {
            "name": "Reducing the Strained Tomatoes Further",
            "steps": [
                {
                    "headline": "Pour the strained tomato liquid back into the pan.",
                    "description": "Transfer the pulpy tomato liquid back into the skillet you reduced them in. Make sure it covers 1 inch (2.5 cm) of the bottom of the pan. If it’s not high enough the tomatoes can burn, but if it’s too high, it will take too long to reduce. If necessary, transfer the pulpy tomatoes into a smaller or larger pan so that they are closer to 1 inch (2.5 cm) deep in the pan."
                },
                {
                    "headline": "Cook the tomatoes for 2 to 3 hours to thicken them to paste.",
                    "description": "On a medium-low heat, continue to cook the tomatoes so they can reduce down even further. Leave the lid off the pan so excess steam and moisture can evaporate and allow the paste to thicken. Steam the tomatoes in the pan, but don’t allow them to boil or simmer. If you see bubbles beginning to surface, reduce the heat down to low."
                },
                {
                    "headline": "Run the tomatoes through a food processor to get an even consistency.",
                    "description": "If the tomatoes are not breaking down evenly, puree them in a food processor or blender. Wait to blend or process the tomatoes until they all reach a thick, sauce-like consistency, rather than blending them while they're still rather thin and liquidy. Cook the tomato sauce evenly throughout before you puree it. There shouldn’t be cooked and uncooked parts blending together."
                }
            ]
        },
        {
            "name": "Finishing Them off in the Oven",
            "steps": [
                {
                    "headline": "Coat a rimmed baking sheet with oil.",
                    "description": "Find a baking sheet at least 13 inches (33 cm) by 18 inches (46 cm). Make sure it has a rim, or the tomato puree might cook over the sides while in the oven. Coat the entire surface of the baking sheet with the remaining 2 tablespoons (30 mL) of olive oil. If desired, you could also use a large Dutch oven instead of a baking sheet. Just leave the lid off as you bake the tomatoes. Again, any olive oil will also work, as well as canola oil or a flavorless vegetable oil."
                },
                {
                    "headline": "Pour the tomato puree onto the baking sheet.",
                    "description": "Spread it evenly around with a spatula, or gently shake the sheet from side to side while its flat on the counter to move it around."
                },
                {
                    "headline": "Preheat the oven to 300 °F (149 °C) and bake the puree for at least 3 hours.",
                    "description": "Once it’s warmed up, place the baking sheet in the oven to let it cook. Take out the sheet every 30 minutes and stir the mixture with the spatula to help any remaining moisture in the paste evaporate. This will ensure the tomatoes reduce to an even consistency. You can tell if the moisture is properly evaporating by seeing if the surface of the paste deepens in color. After 3 hours, check to see if it’s reached a thick, sauce-like state. If not, keep checking every 15-minutes to see if it’s done."
                },
                {
                    "headline": "Reduce the oven heat and continue to bake for 20 to 25 minutes.",
                    "description": "Turn down the oven temperature to 250 °F (121 °C) and continue to cook your tomatoes. Leave it alone, and don’t bother stirring it anymore as it finishes thickening. Check to see if your tomatoes reduced down properly to an even thicker paste. The color should be a deep brick red."
                },
                {
                    "headline": "Store your tomato paste in a glass jar for up to 1 year.",
                    "description": "Choose a jar with a secure, tight lid. Drizzle a small amount of olive oil on the lid, and allow it to fall over the side and coat it completely to keep air out. Then, wipe the excess off the jar. You don’t have to keep the jarred tomato paste in the refrigerator, but can store it at room temperature for up to 1 year or more. Reapply the olive oil between each use for keeping it fresh longer."
                }
            ]
        }
    ],
    "tyn": [
        "Kitchen knife",
        "Cutting board",
        "A 12 in (30 cm) skillet",
        "Strainer",
        "Heat-resistant spatula",
        "A 13 in (33 cm) by 18 in (46 cm) baking sheet",
        "Food processor (optional)",
        "Glass jars or ice cube trays (for storage)"
    ],
    "text": " Preparing the Tomatoes Cut the tomatoes into rough small pieces. Rinse the tomatoes first. With a sharp kitchen knife, cut off the stems at either end of the tomato before slicing it in half vertically. Lay each half down on its side and slice them in half again, this time horizontally. Cut them one more time into even lengthwise strips before chopping them up into small ⁄2 in (1.3 cm) pieces for sautéing. Plum tomatoes work well for this recipe, but any variety of summer tomato can be used. Smaller tomatoes generally have a sweeter, lighter taste, while larger varieties have a richer flavor. For the most complex flavor to your paste, use several varieties of tomatoes. For a smoother paste, try seeding your tomatoes before finely chopping them. If you don’t have a food mill to separate out the skins and seeds, you can easily remove the skins by blanching your tomatoes. After skinning them, chop them up as you would normally, and either manually remove the seeds as you go along, or push the pulp through a fine-mesh strainer to remove the seeds. Begin heating oil in a large skillet. On a high heat, allow the skillet to get adequately hot. Hold the back of your hand over the pan, and if you feel the heat rising, add ⁄4 cup (59 mL) of extra-virgin olive oil to a skillet at least 12 inches (30 cm) across. Let the oil heat for a few minutes before adding the chopped tomatoes. For the best flavor, use extra-virgin olive oil, though other grades of olive oil also work. If you don’t have olive oil, you can substitute with canola oil, or a flavorless vegetable oil. Cook the tomatoes down to a soft paste in the pan for 10 minutes. Still on a high heat, add your chopped tomatoes to the skillet, seasoning them with salt to your taste. Bring them to a boil, stirring often, but letting them sit and reduce in the pan each time you stir. Cook until they’re thoroughly softened, almost like a slurry. This should take around 10 minutes on a high heat. The tomatoes may splatter when you add them to the pan or as they’re cooking. To avoid splattering, use a skillet with tall sides, or a pot. The amount of salt you add depends on your own taste. As a rule of thumb, add about ⁄2 teaspoon (2.5 mL) of salt for every 5 plum tomatoes or 2 beefsteak tomatoes. For a different flavor, you could also add 3 cloves of peeled, smashed garlic and 2 bay leaves to the tomatoes as they soften. Just make sure to use the tomato paste in recipes that complement the strong flavor of garlic. For a unique flavor twist, you can skip the salt altogether and add 1 tablespoon (15 mL) of soy sauce instead. Steam the tomatoes in the pan for 30 minutes. After you’ve reduced the tomatoes, turn off the heat on your stove. Place the lid back on your skillet or pot, and allow the tomatoes to continue to smoke in the pan for an additional half hour. This will allow them to soften enough to push through a food mill. Strain the tomatoes through a food mill. After the tomatoes have cooled down in the pans, begin passing them through a food mill. You don’t want seeds in your paste, so use its finest plate (with the smallest holes) to separate the skin and seeds from the usable tomato pulp. Strain the tomato flesh until you’re left with a thin tomato liquid. Reducing the Strained Tomatoes Further Pour the strained tomato liquid back into the pan. Transfer the pulpy tomato liquid back into the skillet you reduced them in. Make sure it covers 1 inch (2.5 cm) of the bottom of the pan. If it’s not high enough the tomatoes can burn, but if it’s too high, it will take too long to reduce. If necessary, transfer the pulpy tomatoes into a smaller or larger pan so that they are closer to 1 inch (2.5 cm) deep in the pan. Cook the tomatoes for 2 to 3 hours to thicken them to paste. On a medium-low heat, continue to cook the tomatoes so they can reduce down even further. Leave the lid off the pan so excess steam and moisture can evaporate and allow the paste to thicken. Steam the tomatoes in the pan, but don’t allow them to boil or simmer. If you see bubbles beginning to surface, reduce the heat down to low. Run the tomatoes through a food processor to get an even consistency. If the tomatoes are not breaking down evenly, puree them in a food processor or blender. Wait to blend or process the tomatoes until they all reach a thick, sauce-like consistency, rather than blending them while they're still rather thin and liquidy. Cook the tomato sauce evenly throughout before you puree it. There shouldn’t be cooked and uncooked parts blending together. Finishing Them off in the Oven Coat a rimmed baking sheet with oil. Find a baking sheet at least 13 inches (33 cm) by 18 inches (46 cm). Make sure it has a rim, or the tomato puree might cook over the sides while in the oven. Coat the entire surface of the baking sheet with the remaining 2 tablespoons (30 mL) of olive oil. If desired, you could also use a large Dutch oven instead of a baking sheet. Just leave the lid off as you bake the tomatoes. Again, any olive oil will also work, as well as canola oil or a flavorless vegetable oil. Pour the tomato puree onto the baking sheet. Spread it evenly around with a spatula, or gently shake the sheet from side to side while its flat on the counter to move it around. Preheat the oven to 300 °F (149 °C) and bake the puree for at least 3 hours. Once it’s warmed up, place the baking sheet in the oven to let it cook. Take out the sheet every 30 minutes and stir the mixture with the spatula to help any remaining moisture in the paste evaporate. This will ensure the tomatoes reduce to an even consistency. You can tell if the moisture is properly evaporating by seeing if the surface of the paste deepens in color. After 3 hours, check to see if it’s reached a thick, sauce-like state. If not, keep checking every 15-minutes to see if it’s done. Reduce the oven heat and continue to bake for 20 to 25 minutes. Turn down the oven temperature to 250 °F (121 °C) and continue to cook your tomatoes. Leave it alone, and don’t bother stirring it anymore as it finishes thickening. Check to see if your tomatoes reduced down properly to an even thicker paste. The color should be a deep brick red. Store your tomato paste in a glass jar for up to 1 year. Choose a jar with a secure, tight lid. Drizzle a small amount of olive oil on the lid, and allow it to fall over the side and coat it completely to keep air out. Then, wipe the excess off the jar. You don’t have to keep the jarred tomato paste in the refrigerator, but can store it at room temperature for up to 1 year or more. Reapply the olive oil between each use for keeping it fresh longer.",
    "sentences": [
        " Preparing the Tomatoes Cut the tomatoes into rough small pieces.",
        "Rinse the tomatoes first.",
        "With a sharp kitchen knife, cut off the stems at either end of the tomato before slicing it in half vertically.",
        "Lay each half down on its side and slice them in half again, this time horizontally.",
        "Cut them one more time into even lengthwise strips before chopping them up into small ⁄2 in (1.3 cm) pieces for sautéing.",
        "Plum tomatoes work well for this recipe, but any variety of summer tomato can be used.",
        "Smaller tomatoes generally have a sweeter, lighter taste, while larger varieties have a richer flavor.",
        "For the most complex flavor to your paste, use several varieties of tomatoes.",
        "For a smoother paste, try seeding your tomatoes before finely chopping them.",
        "If you don’t have a food mill to separate out the skins and seeds, you can easily remove the skins by blanching your tomatoes.",
        "After skinning them, chop them up as you would normally, and either manually remove the seeds as you go along, or push the pulp through a fine-mesh strainer to remove the seeds.",
        "Begin heating oil in a large skillet.",
        "On a high heat, allow the skillet to get adequately hot.",
        "Hold the back of your hand over the pan, and if you feel the heat rising, add ⁄4 cup (59 mL) of extra-virgin olive oil to a skillet at least 12 inches (30 cm) across.",
        "Let the oil heat for a few minutes before adding the chopped tomatoes.",
        "For the best flavor, use extra-virgin olive oil, though other grades of olive oil also work.",
        "If you don’t have olive oil, you can substitute with canola oil, or a flavorless vegetable oil.",
        "Cook the tomatoes down to a soft paste in the pan for 10 minutes.",
        "Still on a high heat, add your chopped tomatoes to the skillet, seasoning them with salt to your taste.",
        "Bring them to a boil, stirring often, but letting them sit and reduce in the pan each time you stir.",
        "Cook until they’re thoroughly softened, almost like a slurry.",
        "This should take around 10 minutes on a high heat.",
        "The tomatoes may splatter when you add them to the pan or as they’re cooking.",
        "To avoid splattering, use a skillet with tall sides, or a pot.",
        "The amount of salt you add depends on your own taste.",
        "As a rule of thumb, add about ⁄2 teaspoon (2.5 mL) of salt for every 5 plum tomatoes or 2 beefsteak tomatoes.",
        "For a different flavor, you could also add 3 cloves of peeled, smashed garlic and 2 bay leaves to the tomatoes as they soften.",
        "Just make sure to use the tomato paste in recipes that complement the strong flavor of garlic.",
        "For a unique flavor twist, you can skip the salt altogether and add 1 tablespoon (15 mL) of soy sauce instead.",
        "Steam the tomatoes in the pan for 30 minutes.",
        "After you’ve reduced the tomatoes, turn off the heat on your stove.",
        "Place the lid back on your skillet or pot, and allow the tomatoes to continue to smoke in the pan for an additional half hour.",
        "This will allow them to soften enough to push through a food mill.",
        "Strain the tomatoes through a food mill.",
        "After the tomatoes have cooled down in the pans, begin passing them through a food mill.",
        "You don’t want seeds in your paste, so use its finest plate (with the smallest holes) to separate the skin and seeds from the usable tomato pulp.",
        "Strain the tomato flesh until you’re left with a thin tomato liquid.",
        "Reducing the Strained Tomatoes Further Pour the strained tomato liquid back into the pan.",
        "Transfer the pulpy tomato liquid back into the skillet you reduced them in.",
        "Make sure it covers 1 inch (2.5 cm) of the bottom of the pan.",
        "If it’s not high enough the tomatoes can burn, but if it’s too high, it will take too long to reduce.",
        "If necessary, transfer the pulpy tomatoes into a smaller or larger pan so that they are closer to 1 inch (2.5 cm) deep in the pan.",
        "Cook the tomatoes for 2 to 3 hours to thicken them to paste.",
        "On a medium-low heat, continue to cook the tomatoes so they can reduce down even further.",
        "Leave the lid off the pan so excess steam and moisture can evaporate and allow the paste to thicken.",
        "Steam the tomatoes in the pan, but don’t allow them to boil or simmer.",
        "If you see bubbles beginning to surface, reduce the heat down to low.",
        "Run the tomatoes through a food processor to get an even consistency.",
        "If the tomatoes are not breaking down evenly, puree them in a food processor or blender.",
        "Wait to blend or process the tomatoes until they all reach a thick, sauce-like consistency, rather than blending them while they're still rather thin and liquidy.",
        "Cook the tomato sauce evenly throughout before you puree it.",
        "There shouldn’t be cooked and uncooked parts blending together.",
        "Finishing Them off in the Oven Coat a rimmed baking sheet with oil.",
        "Find a baking sheet at least 13 inches (33 cm) by 18 inches (46 cm).",
        "Make sure it has a rim, or the tomato puree might cook over the sides while in the oven.",
        "Coat the entire surface of the baking sheet with the remaining 2 tablespoons (30 mL) of olive oil.",
        "If desired, you could also use a large Dutch oven instead of a baking sheet.",
        "Just leave the lid off as you bake the tomatoes.",
        "Again, any olive oil will also work, as well as canola oil or a flavorless vegetable oil.",
        "Pour the tomato puree onto the baking sheet.",
        "Spread it evenly around with a spatula, or gently shake the sheet from side to side while its flat on the counter to move it around.",
        "Preheat the oven to 300 °F (149 °C) and bake the puree for at least 3 hours.",
        "Once it’s warmed up, place the baking sheet in the oven to let it cook.",
        "Take out the sheet every 30 minutes and stir the mixture with the spatula to help any remaining moisture in the paste evaporate.",
        "This will ensure the tomatoes reduce to an even consistency.",
        "You can tell if the moisture is properly evaporating by seeing if the surface of the paste deepens in color.",
        "After 3 hours, check to see if it’s reached a thick, sauce-like state.",
        "If not, keep checking every 15-minutes to see if it’s done.",
        "Reduce the oven heat and continue to bake for 20 to 25 minutes.",
        "Turn down the oven temperature to 250 °F (121 °C) and continue to cook your tomatoes.",
        "Leave it alone, and don’t bother stirring it anymore as it finishes thickening.",
        "Check to see if your tomatoes reduced down properly to an even thicker paste.",
        "The color should be a deep brick red.",
        "Store your tomato paste in a glass jar for up to 1 year.",
        "Choose a jar with a secure, tight lid.",
        "Drizzle a small amount of olive oil on the lid, and allow it to fall over the side and coat it completely to keep air out.",
        "Then, wipe the excess off the jar.",
        "You don’t have to keep the jarred tomato paste in the refrigerator, but can store it at room temperature for up to 1 year or more.",
        "Reapply the olive oil between each use for keeping it fresh longer."
    ]
}