{
    "title": "How to Define Curly Hair",
    "url": "https://www.wikihow.com/Define-Curly-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Hair Texture",
        "Curly Hair"
    ],
    "parts": [
        {
            "name": "Washing Your Hair and Applying Products",
            "steps": [
                {
                    "headline": "Omit the shampoo and “co-wash” your hair.",
                    "description": "Also called the Curly Girl Method, omitting the shampoo and washing the hair with only conditioner works best for overly dry hair, as shampoo might do more harm than good."
                },
                {
                    "headline": "Use a sulfate-free shampoo if you want to use one.",
                    "description": "If you do choose to use shampoo, it is very important that you use a gentle one that does not contain sodium lauryl sulfate (SLS) which can be too harsh and damaging for curly hair and can cause frizz. Choose a shampoo that contains natural oils like grape-seed or sage oil, which will clarify and maintain moisture in the hair. Apply a little bit of shampoo on the top of your head and massage it onto your scalp. Focus on the roots since they form the most oily part of your hair. Let it rinse towards the ends of your curls. Expert Answer\t\t\t\t\t\tQ\t\t\t\tWhen asked, \"What are sulfates?\" Nine Morrison\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBeauty Consultant\t\t\t\t\t\t\t\t\t\tNine Morrison is the owner of WedLocks Bridal Hair & Makeup, the largest bridal beauty company in Colorado. She has been in the beauty industry for over 10 years, and also travels as a beauty educator and business consultant. EXPERT ADVICE\t\t\t\tBridal beauty expert Nine Morrison answered: \"Sulfates are harsh cleansers that are found in products like laundry detergents. They're harsh and drying for your hair, and they rough up the outer layer, or the cuticle. Luckily, a lot of hair companies have taken most of the sulfates out of their products and replaced them with other lathering products that are much less harsh.\""
                },
                {
                    "headline": "Condition your hair after shampooing.",
                    "description": "Be generous with the amount of conditioner you use. Apply it on the top of your head, and massage it onto your scalp, just like you did with shampoo if you used one. Concentrate the conditioner towards the ends of your curls. This way, your hair won’t lose its natural oils and get dry. Make sure to use a conditioner designed for dry and damaged hair, even if the label does not specifically say “for curly hair.”"
                },
                {
                    "headline": "Detangle your hair in the shower with a wide-toothed comb.",
                    "description": "Make sure to do so gently and when your hair has a good amount of conditioner in it. For a little added moisture try adding honey to your conditioner, but be sure to rinse most of it out."
                },
                {
                    "headline": "Rinse your hair with cool or cold water.",
                    "description": "For the last part of your shower, omit warm water for cool or cold water to shine to your hair and prevent frizz. For a little extra root volume try rinsing with your head upside down."
                },
                {
                    "headline": "Use deep conditioner once or twice a week.",
                    "description": "Before you shower, you can apply a deep conditioner like coconut oil to your hair once or twice a week. Before showering, apply it to your hair, focusing on the ends of your curls, and wear a shower cap. Leave the deep conditioner in for at least 10 minutes. The steam will soften and moisturize your hair as you wash your body first."
                },
                {
                    "headline": "Apply a leave-in conditioner or cream by smoothing it onto your hair.",
                    "description": "After you step out of the shower, apply a leave-in conditioner or cream onto your hair to make sure it stays moisturized, and frizz free throughout the day. At this point, make sure your hair has no tangles left. If it does, gently untangle your hair with your fingers and then give it another rinse in the sink, making sure to reapply your conditioner."
                }
            ]
        },
        {
            "name": "Shaping Your Curls",
            "steps": [
                {
                    "headline": "Get a holding product such as a gel or mousse.",
                    "description": "In order to help your hair hold the curls for a long time, you should use a holding gel or mousse on your curls before shaping them. Try to get water-soluble products rather than alcohol-based ones, that don’t feel sticky on the skin. Experiment with products and amounts of products until you get the right combination for your hair."
                },
                {
                    "headline": "Scrunch your hair.",
                    "description": "After applying a holding product, cup your hair in your hands and scrunch in an upwards motion, holding it a few seconds each time. The more you scrunch, the curlier your hair will be. Keep doing it until no more water is dripping from your hair."
                },
                {
                    "headline": "Twirl your hair for ringlets.",
                    "description": "Take a section of your hair, ranging from 0.5 inches (1.3 cm) to 3 inches (7.6 cm) in diameter. Apply a holding gel or mousse, and twist the section around your finger, making sure to go with the natural curl of the section. This method will produce perfect ringlets. Take a larger section for looser curls, or keep it small for tighter curls."
                },
                {
                    "headline": "Twist your hair in two sections as opposed to one.",
                    "description": "If you want even better defined curls, try the twirling method except in two sections instead of one. Finger comb each section of your hair, apply the holding gel or mousse, then divide one into two parts, and start twisting them around each other. You can add some coconut oil or coconut butter to the ends to make them softer."
                },
                {
                    "headline": "Smooth your curls for a faster solution.",
                    "description": "Instead of scrunching or twirling, try simply smoothing your curls to save time. Start with one section of your hair and apply a holding product. Run your hands down you hair with open fingers, smoothing the curls vertically. When you’re done, switch to the next section. The smaller your section is, the tighter your curls will be. The bigger your section is, the bigger your curls will be."
                },
                {
                    "headline": "Smooth your curls with conditioner as an alternative.",
                    "description": "Also called the shingling method, this technique uses a big amount of conditioner on each hair strand to keep the curls moisturized and defined. Section your hair into four parts. Pick one and make a smaller section. Apply conditioner on your fingertips and run them through the section, smoothing the curl on the way. Lay it down and continue with the next small section."
                }
            ]
        },
        {
            "name": "Drying Your Hair",
            "steps": [
                {
                    "headline": "Remove water from your hair using paper towels or t-shirts.",
                    "description": "Generic towels are made of terry cloth, and the little loops that make up the cloth tend to catch on curly hair and cause frizz. Use paper towels or clothes such as t-shirts to remove the water from you hair. Afterwards, plop your hair to help dry it faster."
                },
                {
                    "headline": "Air-dry your hair.",
                    "description": "Air-drying leads to the least amount of frizz, as blow-drying tends to make curly hair frizzy. However, if you don't have much time, make sure to blow-dry with a diffuser attachment. Make sure you leave drying until after you are done shaping your curls."
                },
                {
                    "headline": "Avoid touching your hair until it is completely dry.",
                    "description": "Manhandling your hair will ruffle the cuticle and cause frizziness. If you want to have perfectly defined curls and a smooth-looking hair, try not to touch your hair at all until it is completely dry. Once it’s dry, you can now enjoy your frizz-free spirals!"
                }
            ]
        }
    ],
    "tyn": [
        "Sulfate-free shampoo",
        "Conditioner for dry and damaged or curly hair",
        "Leave-in conditioner or cream",
        "Deep conditioner",
        "Mousse or holding gel",
        "Paper towels or a t-shirt",
        "Blow dryer and diffuser (optional)"
    ],
    "text": " Washing Your Hair and Applying Products Omit the shampoo and “co-wash” your hair. Also called the Curly Girl Method, omitting the shampoo and washing the hair with only conditioner works best for overly dry hair, as shampoo might do more harm than good. Use a sulfate-free shampoo if you want to use one. If you do choose to use shampoo, it is very important that you use a gentle one that does not contain sodium lauryl sulfate (SLS) which can be too harsh and damaging for curly hair and can cause frizz. Choose a shampoo that contains natural oils like grape-seed or sage oil, which will clarify and maintain moisture in the hair. Apply a little bit of shampoo on the top of your head and massage it onto your scalp. Focus on the roots since they form the most oily part of your hair. Let it rinse towards the ends of your curls. Expert Answer\t\t\t\t\t\tQ\t\t\t\tWhen asked, \"What are sulfates?\" Nine Morrison\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBeauty Consultant\t\t\t\t\t\t\t\t\t\tNine Morrison is the owner of WedLocks Bridal Hair & Makeup, the largest bridal beauty company in Colorado. She has been in the beauty industry for over 10 years, and also travels as a beauty educator and business consultant. EXPERT ADVICE\t\t\t\tBridal beauty expert Nine Morrison answered: \"Sulfates are harsh cleansers that are found in products like laundry detergents. They're harsh and drying for your hair, and they rough up the outer layer, or the cuticle. Luckily, a lot of hair companies have taken most of the sulfates out of their products and replaced them with other lathering products that are much less harsh.\" Condition your hair after shampooing. Be generous with the amount of conditioner you use. Apply it on the top of your head, and massage it onto your scalp, just like you did with shampoo if you used one. Concentrate the conditioner towards the ends of your curls. This way, your hair won’t lose its natural oils and get dry. Make sure to use a conditioner designed for dry and damaged hair, even if the label does not specifically say “for curly hair.” Detangle your hair in the shower with a wide-toothed comb. Make sure to do so gently and when your hair has a good amount of conditioner in it. For a little added moisture try adding honey to your conditioner, but be sure to rinse most of it out. Rinse your hair with cool or cold water. For the last part of your shower, omit warm water for cool or cold water to shine to your hair and prevent frizz. For a little extra root volume try rinsing with your head upside down. Use deep conditioner once or twice a week. Before you shower, you can apply a deep conditioner like coconut oil to your hair once or twice a week. Before showering, apply it to your hair, focusing on the ends of your curls, and wear a shower cap. Leave the deep conditioner in for at least 10 minutes. The steam will soften and moisturize your hair as you wash your body first. Apply a leave-in conditioner or cream by smoothing it onto your hair. After you step out of the shower, apply a leave-in conditioner or cream onto your hair to make sure it stays moisturized, and frizz free throughout the day. At this point, make sure your hair has no tangles left. If it does, gently untangle your hair with your fingers and then give it another rinse in the sink, making sure to reapply your conditioner. Shaping Your Curls Get a holding product such as a gel or mousse. In order to help your hair hold the curls for a long time, you should use a holding gel or mousse on your curls before shaping them. Try to get water-soluble products rather than alcohol-based ones, that don’t feel sticky on the skin. Experiment with products and amounts of products until you get the right combination for your hair. Scrunch your hair. After applying a holding product, cup your hair in your hands and scrunch in an upwards motion, holding it a few seconds each time. The more you scrunch, the curlier your hair will be. Keep doing it until no more water is dripping from your hair. Twirl your hair for ringlets. Take a section of your hair, ranging from 0.5 inches (1.3 cm) to 3 inches (7.6 cm) in diameter. Apply a holding gel or mousse, and twist the section around your finger, making sure to go with the natural curl of the section. This method will produce perfect ringlets. Take a larger section for looser curls, or keep it small for tighter curls. Twist your hair in two sections as opposed to one. If you want even better defined curls, try the twirling method except in two sections instead of one. Finger comb each section of your hair, apply the holding gel or mousse, then divide one into two parts, and start twisting them around each other. You can add some coconut oil or coconut butter to the ends to make them softer. Smooth your curls for a faster solution. Instead of scrunching or twirling, try simply smoothing your curls to save time. Start with one section of your hair and apply a holding product. Run your hands down you hair with open fingers, smoothing the curls vertically. When you’re done, switch to the next section. The smaller your section is, the tighter your curls will be. The bigger your section is, the bigger your curls will be. Smooth your curls with conditioner as an alternative. Also called the shingling method, this technique uses a big amount of conditioner on each hair strand to keep the curls moisturized and defined. Section your hair into four parts. Pick one and make a smaller section. Apply conditioner on your fingertips and run them through the section, smoothing the curl on the way. Lay it down and continue with the next small section. Drying Your Hair Remove water from your hair using paper towels or t-shirts. Generic towels are made of terry cloth, and the little loops that make up the cloth tend to catch on curly hair and cause frizz. Use paper towels or clothes such as t-shirts to remove the water from you hair. Afterwards, plop your hair to help dry it faster. Air-dry your hair. Air-drying leads to the least amount of frizz, as blow-drying tends to make curly hair frizzy. However, if you don't have much time, make sure to blow-dry with a diffuser attachment. Make sure you leave drying until after you are done shaping your curls. Avoid touching your hair until it is completely dry. Manhandling your hair will ruffle the cuticle and cause frizziness. If you want to have perfectly defined curls and a smooth-looking hair, try not to touch your hair at all until it is completely dry. Once it’s dry, you can now enjoy your frizz-free spirals!",
    "sentences": [
        " Washing Your Hair and Applying Products Omit the shampoo and “co-wash” your hair.",
        "Also called the Curly Girl Method, omitting the shampoo and washing the hair with only conditioner works best for overly dry hair, as shampoo might do more harm than good.",
        "Use a sulfate-free shampoo if you want to use one.",
        "If you do choose to use shampoo, it is very important that you use a gentle one that does not contain sodium lauryl sulfate (SLS) which can be too harsh and damaging for curly hair and can cause frizz.",
        "Choose a shampoo that contains natural oils like grape-seed or sage oil, which will clarify and maintain moisture in the hair.",
        "Apply a little bit of shampoo on the top of your head and massage it onto your scalp.",
        "Focus on the roots since they form the most oily part of your hair.",
        "Let it rinse towards the ends of your curls.",
        "Expert Answer\t\t\t\t\t\tQ\t\t\t\tWhen asked, \"What are sulfates?\"",
        "Nine Morrison\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBeauty Consultant\t\t\t\t\t\t\t\t\t\tNine Morrison is the owner of WedLocks Bridal Hair & Makeup, the largest bridal beauty company in Colorado.",
        "She has been in the beauty industry for over 10 years, and also travels as a beauty educator and business consultant.",
        "EXPERT ADVICE\t\t\t\tBridal beauty expert Nine Morrison answered: \"Sulfates are harsh cleansers that are found in products like laundry detergents.",
        "They're harsh and drying for your hair, and they rough up the outer layer, or the cuticle.",
        "Luckily, a lot of hair companies have taken most of the sulfates out of their products and replaced them with other lathering products that are much less harsh.\"",
        "Condition your hair after shampooing.",
        "Be generous with the amount of conditioner you use.",
        "Apply it on the top of your head, and massage it onto your scalp, just like you did with shampoo if you used one.",
        "Concentrate the conditioner towards the ends of your curls.",
        "This way, your hair won’t lose its natural oils and get dry.",
        "Make sure to use a conditioner designed for dry and damaged hair, even if the label does not specifically say “for curly hair.” Detangle your hair in the shower with a wide-toothed comb.",
        "Make sure to do so gently and when your hair has a good amount of conditioner in it.",
        "For a little added moisture try adding honey to your conditioner, but be sure to rinse most of it out.",
        "Rinse your hair with cool or cold water.",
        "For the last part of your shower, omit warm water for cool or cold water to shine to your hair and prevent frizz.",
        "For a little extra root volume try rinsing with your head upside down.",
        "Use deep conditioner once or twice a week.",
        "Before you shower, you can apply a deep conditioner like coconut oil to your hair once or twice a week.",
        "Before showering, apply it to your hair, focusing on the ends of your curls, and wear a shower cap.",
        "Leave the deep conditioner in for at least 10 minutes.",
        "The steam will soften and moisturize your hair as you wash your body first.",
        "Apply a leave-in conditioner or cream by smoothing it onto your hair.",
        "After you step out of the shower, apply a leave-in conditioner or cream onto your hair to make sure it stays moisturized, and frizz free throughout the day.",
        "At this point, make sure your hair has no tangles left.",
        "If it does, gently untangle your hair with your fingers and then give it another rinse in the sink, making sure to reapply your conditioner.",
        "Shaping Your Curls Get a holding product such as a gel or mousse.",
        "In order to help your hair hold the curls for a long time, you should use a holding gel or mousse on your curls before shaping them.",
        "Try to get water-soluble products rather than alcohol-based ones, that don’t feel sticky on the skin.",
        "Experiment with products and amounts of products until you get the right combination for your hair.",
        "Scrunch your hair.",
        "After applying a holding product, cup your hair in your hands and scrunch in an upwards motion, holding it a few seconds each time.",
        "The more you scrunch, the curlier your hair will be.",
        "Keep doing it until no more water is dripping from your hair.",
        "Twirl your hair for ringlets.",
        "Take a section of your hair, ranging from 0.5 inches (1.3 cm) to 3 inches (7.6 cm) in diameter.",
        "Apply a holding gel or mousse, and twist the section around your finger, making sure to go with the natural curl of the section.",
        "This method will produce perfect ringlets.",
        "Take a larger section for looser curls, or keep it small for tighter curls.",
        "Twist your hair in two sections as opposed to one.",
        "If you want even better defined curls, try the twirling method except in two sections instead of one.",
        "Finger comb each section of your hair, apply the holding gel or mousse, then divide one into two parts, and start twisting them around each other.",
        "You can add some coconut oil or coconut butter to the ends to make them softer.",
        "Smooth your curls for a faster solution.",
        "Instead of scrunching or twirling, try simply smoothing your curls to save time.",
        "Start with one section of your hair and apply a holding product.",
        "Run your hands down you hair with open fingers, smoothing the curls vertically.",
        "When you’re done, switch to the next section.",
        "The smaller your section is, the tighter your curls will be.",
        "The bigger your section is, the bigger your curls will be.",
        "Smooth your curls with conditioner as an alternative.",
        "Also called the shingling method, this technique uses a big amount of conditioner on each hair strand to keep the curls moisturized and defined.",
        "Section your hair into four parts.",
        "Pick one and make a smaller section.",
        "Apply conditioner on your fingertips and run them through the section, smoothing the curl on the way.",
        "Lay it down and continue with the next small section.",
        "Drying Your Hair Remove water from your hair using paper towels or t-shirts.",
        "Generic towels are made of terry cloth, and the little loops that make up the cloth tend to catch on curly hair and cause frizz.",
        "Use paper towels or clothes such as t-shirts to remove the water from you hair.",
        "Afterwards, plop your hair to help dry it faster.",
        "Air-dry your hair.",
        "Air-drying leads to the least amount of frizz, as blow-drying tends to make curly hair frizzy.",
        "However, if you don't have much time, make sure to blow-dry with a diffuser attachment.",
        "Make sure you leave drying until after you are done shaping your curls.",
        "Avoid touching your hair until it is completely dry.",
        "Manhandling your hair will ruffle the cuticle and cause frizziness.",
        "If you want to have perfectly defined curls and a smooth-looking hair, try not to touch your hair at all until it is completely dry.",
        "Once it’s dry, you can now enjoy your frizz-free spirals!"
    ]
}