{
    "title": "How to Cook Snow Crab Legs",
    "url": "https://www.wikihow.com/Cook-Snow-Crab-Legs",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fish and Seafood",
        "Crab"
    ],
    "methods": [
        {
            "name": "Boiling Snow Crab Legs",
            "steps": [
                {
                    "headline": "Keep the size of your largest pot in mind when buying crab legs.",
                    "description": "They only bend at the joints, and you will want to place them in the pot while they are whole."
                },
                {
                    "headline": "Thaw the crab legs thoroughly.",
                    "description": "Place them in the refrigerator overnight. Cover them. Most crab legs are bought pre-cooked, so you do not need to cook them very long. However, they are also usually frozen to keep them fresh. If they did not thaw fully in the refrigerator overnight, place them in a large bowl. Put the bowl in the sink and run cold water over the legs until they are fully thawed."
                },
                {
                    "headline": "Fill your largest pot with cold water.",
                    "description": "It should be 2/3 full."
                },
                {
                    "headline": "Add approximately 1 tsp.",
                    "description": "(6g) of salt to the water."
                },
                {
                    "headline": "Turn the burner up to high heat.",
                    "description": "Allow the water to boil."
                },
                {
                    "headline": "Tuck the legs.",
                    "description": "Place them in the boiling water. Be careful not to burn yourself as you drop them in the water. If the water stops boiling, bring it back up to a boil once all the crab legs are inside the pot."
                },
                {
                    "headline": "Boil the legs for between 4 and 5 minutes.",
                    "description": ""
                },
                {
                    "headline": "Remove the snow crab legs with long metal tongs.",
                    "description": "Place them in a bowl to drain."
                },
                {
                    "headline": "Split each crab leg lengthwise with kitchen shears.",
                    "description": "Serve a leg to each guest. You will want to have seafood forks for each person so that they can dig into the shell to get the meat."
                },
                {
                    "headline": "Melt 1 tbsp.",
                    "description": "(15ml) of butter for each dinner guest. Serve them a few slices of lemon so that they can season and dip to their taste. You may choose to serve clarified butter instead of melted butter. When you melt the butter, allow it to stand for 4 minutes. Drain it through a cheesecloth to remove the more solid parts of the butter. Serve the butter that drips through the cloth to your guests."
                }
            ]
        },
        {
            "name": "Steaming Snow Crab Legs",
            "steps": [
                {
                    "headline": "Find a large pot that has a strainer and a lid for steaming.",
                    "description": "It may be more difficult to ensure you can fit all the legs in at once, if your strainer basket is small."
                },
                {
                    "headline": "Thaw the crab legs.",
                    "description": "Rinse them."
                },
                {
                    "headline": "Fill the pot approximately half full with cold water.",
                    "description": "Sprinkle the water with salt. Cover the steamer basket with the pot lid."
                },
                {
                    "headline": "Turn the burner to high in order to bring the water to a boil.",
                    "description": ""
                },
                {
                    "headline": "Open the pot when it has reached a boil.",
                    "description": "Bend the joints of the crab legs and place them in the steamer basket."
                },
                {
                    "headline": "Place the lid back on the strainer basket.",
                    "description": "Let the legs steam for 6 minutes."
                },
                {
                    "headline": "Remove from the strainer and serve immediately.",
                    "description": "Serve with lemon wedges and clarified butter."
                }
            ]
        },
        {
            "name": "Baking Snow Crab Legs",
            "steps": [
                {
                    "headline": "Preheat your oven to 350 degrees Fahrenheit (177 degrees Celsius).",
                    "description": "Place a baking rack in the center of the oven."
                },
                {
                    "headline": "Rinse your thawed snow crab legs.",
                    "description": ""
                },
                {
                    "headline": "Crack the crab legs with your kitchen shears.",
                    "description": "Cut them lengthwise to help your guests more effectively use their seafood forks to eat them."
                },
                {
                    "headline": "Place your crab legs on a large baking tray.",
                    "description": ""
                },
                {
                    "headline": "Brush the legs with melted butter or olive oil.",
                    "description": ""
                },
                {
                    "headline": "Sprinkle them with lemon juice.",
                    "description": "Season them with salt, pepper and any other spices you desire."
                },
                {
                    "headline": "Place them in the oven for approximately 8 to 9 minutes.",
                    "description": ""
                },
                {
                    "headline": "Remove them and serve them immediately.",
                    "description": "You can give dinner guests clarified butter and lemon, but since the legs are already seasoned, it is not necessary."
                }
            ]
        }
    ],
    "tyn": [
        "Large pot",
        "Water",
        "Salt",
        "Strainer basket",
        "Metal tongs",
        "Kitchen shears",
        "Seafood forks",
        "Lemon wedges",
        "Butter",
        "Cheesecloth",
        "Baking sheet"
    ],
    "text": " Boiling Snow Crab Legs Keep the size of your largest pot in mind when buying crab legs. They only bend at the joints, and you will want to place them in the pot while they are whole. Thaw the crab legs thoroughly. Place them in the refrigerator overnight. Cover them. Most crab legs are bought pre-cooked, so you do not need to cook them very long. However, they are also usually frozen to keep them fresh. If they did not thaw fully in the refrigerator overnight, place them in a large bowl. Put the bowl in the sink and run cold water over the legs until they are fully thawed. Fill your largest pot with cold water. It should be 2/3 full. Add approximately 1 tsp. (6g) of salt to the water. Turn the burner up to high heat. Allow the water to boil. Tuck the legs. Place them in the boiling water. Be careful not to burn yourself as you drop them in the water. If the water stops boiling, bring it back up to a boil once all the crab legs are inside the pot. Boil the legs for between 4 and 5 minutes.  Remove the snow crab legs with long metal tongs. Place them in a bowl to drain. Split each crab leg lengthwise with kitchen shears. Serve a leg to each guest. You will want to have seafood forks for each person so that they can dig into the shell to get the meat. Melt 1 tbsp. (15ml) of butter for each dinner guest. Serve them a few slices of lemon so that they can season and dip to their taste. You may choose to serve clarified butter instead of melted butter. When you melt the butter, allow it to stand for 4 minutes. Drain it through a cheesecloth to remove the more solid parts of the butter. Serve the butter that drips through the cloth to your guests. Steaming Snow Crab Legs Find a large pot that has a strainer and a lid for steaming. It may be more difficult to ensure you can fit all the legs in at once, if your strainer basket is small. Thaw the crab legs. Rinse them. Fill the pot approximately half full with cold water. Sprinkle the water with salt. Cover the steamer basket with the pot lid. Turn the burner to high in order to bring the water to a boil.  Open the pot when it has reached a boil. Bend the joints of the crab legs and place them in the steamer basket. Place the lid back on the strainer basket. Let the legs steam for 6 minutes. Remove from the strainer and serve immediately. Serve with lemon wedges and clarified butter. Baking Snow Crab Legs Preheat your oven to 350 degrees Fahrenheit (177 degrees Celsius). Place a baking rack in the center of the oven. Rinse your thawed snow crab legs.  Crack the crab legs with your kitchen shears. Cut them lengthwise to help your guests more effectively use their seafood forks to eat them. Place your crab legs on a large baking tray.  Brush the legs with melted butter or olive oil.  Sprinkle them with lemon juice. Season them with salt, pepper and any other spices you desire. Place them in the oven for approximately 8 to 9 minutes.  Remove them and serve them immediately. You can give dinner guests clarified butter and lemon, but since the legs are already seasoned, it is not necessary.",
    "sentences": [
        " Boiling Snow Crab Legs Keep the size of your largest pot in mind when buying crab legs.",
        "They only bend at the joints, and you will want to place them in the pot while they are whole.",
        "Thaw the crab legs thoroughly.",
        "Place them in the refrigerator overnight.",
        "Cover them.",
        "Most crab legs are bought pre-cooked, so you do not need to cook them very long.",
        "However, they are also usually frozen to keep them fresh.",
        "If they did not thaw fully in the refrigerator overnight, place them in a large bowl.",
        "Put the bowl in the sink and run cold water over the legs until they are fully thawed.",
        "Fill your largest pot with cold water.",
        "It should be 2/3 full.",
        "Add approximately 1 tsp.",
        "(6g) of salt to the water.",
        "Turn the burner up to high heat.",
        "Allow the water to boil.",
        "Tuck the legs.",
        "Place them in the boiling water.",
        "Be careful not to burn yourself as you drop them in the water.",
        "If the water stops boiling, bring it back up to a boil once all the crab legs are inside the pot.",
        "Boil the legs for between 4 and 5 minutes.",
        "Remove the snow crab legs with long metal tongs.",
        "Place them in a bowl to drain.",
        "Split each crab leg lengthwise with kitchen shears.",
        "Serve a leg to each guest.",
        "You will want to have seafood forks for each person so that they can dig into the shell to get the meat.",
        "Melt 1 tbsp.",
        "(15ml) of butter for each dinner guest.",
        "Serve them a few slices of lemon so that they can season and dip to their taste.",
        "You may choose to serve clarified butter instead of melted butter.",
        "When you melt the butter, allow it to stand for 4 minutes.",
        "Drain it through a cheesecloth to remove the more solid parts of the butter.",
        "Serve the butter that drips through the cloth to your guests.",
        "Steaming Snow Crab Legs Find a large pot that has a strainer and a lid for steaming.",
        "It may be more difficult to ensure you can fit all the legs in at once, if your strainer basket is small.",
        "Thaw the crab legs.",
        "Rinse them.",
        "Fill the pot approximately half full with cold water.",
        "Sprinkle the water with salt.",
        "Cover the steamer basket with the pot lid.",
        "Turn the burner to high in order to bring the water to a boil.",
        "Open the pot when it has reached a boil.",
        "Bend the joints of the crab legs and place them in the steamer basket.",
        "Place the lid back on the strainer basket.",
        "Let the legs steam for 6 minutes.",
        "Remove from the strainer and serve immediately.",
        "Serve with lemon wedges and clarified butter.",
        "Baking Snow Crab Legs Preheat your oven to 350 degrees Fahrenheit (177 degrees Celsius).",
        "Place a baking rack in the center of the oven.",
        "Rinse your thawed snow crab legs.",
        "Crack the crab legs with your kitchen shears.",
        "Cut them lengthwise to help your guests more effectively use their seafood forks to eat them.",
        "Place your crab legs on a large baking tray.",
        "Brush the legs with melted butter or olive oil.",
        "Sprinkle them with lemon juice.",
        "Season them with salt, pepper and any other spices you desire.",
        "Place them in the oven for approximately 8 to 9 minutes.",
        "Remove them and serve them immediately.",
        "You can give dinner guests clarified butter and lemon, but since the legs are already seasoned, it is not necessary."
    ]
}