{
    "title": "How to Fill Out a Moneygram Money Order",
    "url": "https://www.wikihow.com/Fill-Out-a-Moneygram-Money-Order",
    "category_hierarchy": [
        "Finance and Business",
        "Banks and Financial Institutions"
    ],
    "methods": [
        {
            "name": "Acquiring a MoneyGram Money Order",
            "steps": [
                {
                    "headline": "Check that you can make your payment with money order.",
                    "description": "Money orders are a method of payment that gives the recipient a guarantee that they will receive payment. Because you pay for the money order up front when purchasing it, you cannot void the payment like you could with a credit card charge, and the amount cannot bounce like a bad check. Though it’s a very secure method of payment, not all companies or people will accept money orders as a form of payment. Before securing your money order, ask the person you’re paying to whether or not it’s an acceptable form of payment. Money orders are commonly required for governmental agencies — for example, if you’re paying a speeding ticket or a court processing fee."
                },
                {
                    "headline": "Understand your options.",
                    "description": "Money orders can be purchased from many different locations, including post office locations, banks, local businesses like grocery stores, Western Union branches, and MoneyGram branches. If you don’t have a MoneyGram branch nearby, be aware that you can likely purchase a money order from many other locations in your area."
                },
                {
                    "headline": "Locate a MoneyGram branch.",
                    "description": "If you don’t know where to find one in your area, you can use the search option on the company’s website. Just enter your address and check the box that matches your service needs to find a branch that can give you what you need. Depending on why you need your money order, you should check either “Send Money” or “Pay a Bill.”\nThe website will provide you with a list of MoneyGram locations nearby. You can see the location on a map or even follow the directions the website provides to reach your nearest MoneyGram branch."
                },
                {
                    "headline": "Consider sending your money order online.",
                    "description": "If you can’t find a convenient location, or if you just don’t have time to visit the branch in person, MoneyGram offers an online money order option. Again, you should check with the recipient to make sure they will accept this form of payment instead of a physical money order."
                }
            ]
        },
        {
            "name": "Filling out a MoneyGram Money Order",
            "steps": [
                {
                    "headline": "Ask the teller for a money order.",
                    "description": "You will need to purchase the money order before you fill it out. You should know exactly how much money you need to send the recipient before you go to the MoneyGram location. MoneyGram will charge you a small fee for the transaction, so be able to cover that cost as well. MoneyGram accepts cash, debit card, credit card, or check for the purchase of money orders."
                },
                {
                    "headline": "Fill out the money order as soon as you purchase it.",
                    "description": "Once you’ve paid for the money order, it’s as good as cash. If you leave the fields blank, then lose the money order, anyone who picks it up can make it out to him or herself and keep your money. To prevent this, make sure to fill out the form immediately upon purchase."
                },
                {
                    "headline": "Enter the recipient’s name in the “Pay to the Order Of” line.",
                    "description": "This is the first line on the money order, and it is clearly marked as “Pay to the Order Of/Pagar de la Orden De.” The money order labels its various fields in both English and Spanish for the benefit of MoneyGram customers. On this line, you should write the name of the person or company who will receive the money order. Always ask the recipient what name should be provided on the money order, as you must use a legal name rather than a nickname. For example, you may know your landlord as “Jane,” but she may need to deposit the money order as her corporate name, which might be “Smith Properties, Inc.”"
                },
                {
                    "headline": "Sign the money order.",
                    "description": "Underneath the “Pay to the Order Of” line, you’ll find the “Purchaser, Signer for Drawer” line. Write your signature on that line. You don’t need to print your name legibly. You should use your official signature — the one found on your license and on the back of your credit cards, and the one you use to sign checks."
                },
                {
                    "headline": "Include your address.",
                    "description": "Beneath the signature line is a line labeled “Address.” You may not be able to tell, from the money order, whether the address should be yours or that of the recipient. However, the address you include should be for the person who purchased the money order. Fill it out completely and accurately, including your street address, city, state, and postal code."
                },
                {
                    "headline": "Separate the money order from its receipt.",
                    "description": "On the side of the money order, you will find a detachable stub that serves as your receipt. Bend along the perforated line to make sure you can remove the receipt stub without tearing the actual money order. Be sure to save the stub until you’re sure that the money order has been received and processed by the person you’re sending payment to. In the event that your money order is stolen or lost, the information on the receipt can be used as proof of purchase, or to track the status of the money order."
                }
            ]
        },
        {
            "name": "Sending a Money Order Online",
            "steps": [
                {
                    "headline": "Enter your basic money order information on the MoneyGram website.",
                    "description": "The first screen will show two drop-down menus and a text field. From the first drop-down menu, labeled “Send To,” select the country in which the recipient will be receiving and processing the money order. Under “Receive Option,” choose “Pick Up Any Agent – USD.” In the third field, labeled “Amount,” enter the amount to be paid to the recipient. Even if you’re sending an even dollar amount, like $25, include a decimal and two zeroes to indicate that no cents should be paid: 25.00."
                },
                {
                    "headline": "Select a transfer speed.",
                    "description": "The amount of the transfer fee you have to pay will depend on how fast you want them to process and send your payment. If you use a debit or credit card to make your payment, MoneyGram can process your money order within about 10 minutes. However, if you want to use your bank account to pay for the money order, it will take them 3 business days to process it."
                },
                {
                    "headline": "Sign up for a MoneyGram account.",
                    "description": "If you already have an account, enter your email address and password to log in to their system. If you’re new to MoneyGram, you will need to sign up for an account by entering your email address. On the next screen, enter your name, phone number, billing address, date of birth, and the last 4 digits of your Social Security number. Uncheck the box that says “Yes, I would like to receive promotions and special offers from MoneyGram” if you don’t want to get emails from them. Create a password for your account. Click the button that says “No, thank you. Do not enroll me in MoneyGram Plus” if you want to opt out of that program."
                },
                {
                    "headline": "Fill in the recipient’s information.",
                    "description": "On the same screen where you sign up for your MoneyGram account, you will enter your recipient’s contact information. Include their first and last name, as well as the state in which they live. Note that you can only send up to $499.99 to the state of Arizona. Click the “Yes” or the “No” button to answer the question “Are you sending money for the purchase of goods or services.”\nIf you would like to send the recipient a message, you can type one of up to 40 characters."
                },
                {
                    "headline": "Enter your payment information.",
                    "description": "At the bottom of the screen, you will be prompted for you payment information. If paying by card, you will need to provide your card type — MoneyGram only accepts Visa, Mastercard, and Discover cards. Then, fill in your card number, the expiration date, and the CVV number. If paying with your bank account, you will need to provide the name of your bank, your account type (checking or savings), your routing number, and your account number. Regardless of which bank issues it, all checks format their routing and account numbers the same way. At the bottom of your check, you will see a long string of numbers. The first set of numbers is your routing number. The second set is your account number. The third set is the number for that specific check. Once you’ve confirmed all your information, you can complete your money order!"
                }
            ]
        }
    ],
    "tyn": [
        "Blue or black ballpoint pen"
    ],
    "text": " Acquiring a MoneyGram Money Order Check that you can make your payment with money order. Money orders are a method of payment that gives the recipient a guarantee that they will receive payment. Because you pay for the money order up front when purchasing it, you cannot void the payment like you could with a credit card charge, and the amount cannot bounce like a bad check. Though it’s a very secure method of payment, not all companies or people will accept money orders as a form of payment. Before securing your money order, ask the person you’re paying to whether or not it’s an acceptable form of payment. Money orders are commonly required for governmental agencies — for example, if you’re paying a speeding ticket or a court processing fee. Understand your options. Money orders can be purchased from many different locations, including post office locations, banks, local businesses like grocery stores, Western Union branches, and MoneyGram branches. If you don’t have a MoneyGram branch nearby, be aware that you can likely purchase a money order from many other locations in your area. Locate a MoneyGram branch. If you don’t know where to find one in your area, you can use the search option on the company’s website. Just enter your address and check the box that matches your service needs to find a branch that can give you what you need. Depending on why you need your money order, you should check either “Send Money” or “Pay a Bill.”\nThe website will provide you with a list of MoneyGram locations nearby. You can see the location on a map or even follow the directions the website provides to reach your nearest MoneyGram branch. Consider sending your money order online. If you can’t find a convenient location, or if you just don’t have time to visit the branch in person, MoneyGram offers an online money order option. Again, you should check with the recipient to make sure they will accept this form of payment instead of a physical money order. Filling out a MoneyGram Money Order Ask the teller for a money order. You will need to purchase the money order before you fill it out. You should know exactly how much money you need to send the recipient before you go to the MoneyGram location. MoneyGram will charge you a small fee for the transaction, so be able to cover that cost as well. MoneyGram accepts cash, debit card, credit card, or check for the purchase of money orders. Fill out the money order as soon as you purchase it. Once you’ve paid for the money order, it’s as good as cash. If you leave the fields blank, then lose the money order, anyone who picks it up can make it out to him or herself and keep your money. To prevent this, make sure to fill out the form immediately upon purchase. Enter the recipient’s name in the “Pay to the Order Of” line. This is the first line on the money order, and it is clearly marked as “Pay to the Order Of/Pagar de la Orden De.” The money order labels its various fields in both English and Spanish for the benefit of MoneyGram customers. On this line, you should write the name of the person or company who will receive the money order. Always ask the recipient what name should be provided on the money order, as you must use a legal name rather than a nickname. For example, you may know your landlord as “Jane,” but she may need to deposit the money order as her corporate name, which might be “Smith Properties, Inc.” Sign the money order. Underneath the “Pay to the Order Of” line, you’ll find the “Purchaser, Signer for Drawer” line. Write your signature on that line. You don’t need to print your name legibly. You should use your official signature — the one found on your license and on the back of your credit cards, and the one you use to sign checks. Include your address. Beneath the signature line is a line labeled “Address.” You may not be able to tell, from the money order, whether the address should be yours or that of the recipient. However, the address you include should be for the person who purchased the money order. Fill it out completely and accurately, including your street address, city, state, and postal code. Separate the money order from its receipt. On the side of the money order, you will find a detachable stub that serves as your receipt. Bend along the perforated line to make sure you can remove the receipt stub without tearing the actual money order. Be sure to save the stub until you’re sure that the money order has been received and processed by the person you’re sending payment to. In the event that your money order is stolen or lost, the information on the receipt can be used as proof of purchase, or to track the status of the money order. Sending a Money Order Online Enter your basic money order information on the MoneyGram website. The first screen will show two drop-down menus and a text field. From the first drop-down menu, labeled “Send To,” select the country in which the recipient will be receiving and processing the money order. Under “Receive Option,” choose “Pick Up Any Agent – USD.” In the third field, labeled “Amount,” enter the amount to be paid to the recipient. Even if you’re sending an even dollar amount, like $25, include a decimal and two zeroes to indicate that no cents should be paid: 25.00. Select a transfer speed. The amount of the transfer fee you have to pay will depend on how fast you want them to process and send your payment. If you use a debit or credit card to make your payment, MoneyGram can process your money order within about 10 minutes. However, if you want to use your bank account to pay for the money order, it will take them 3 business days to process it. Sign up for a MoneyGram account. If you already have an account, enter your email address and password to log in to their system. If you’re new to MoneyGram, you will need to sign up for an account by entering your email address. On the next screen, enter your name, phone number, billing address, date of birth, and the last 4 digits of your Social Security number. Uncheck the box that says “Yes, I would like to receive promotions and special offers from MoneyGram” if you don’t want to get emails from them. Create a password for your account. Click the button that says “No, thank you. Do not enroll me in MoneyGram Plus” if you want to opt out of that program. Fill in the recipient’s information. On the same screen where you sign up for your MoneyGram account, you will enter your recipient’s contact information. Include their first and last name, as well as the state in which they live. Note that you can only send up to $499.99 to the state of Arizona. Click the “Yes” or the “No” button to answer the question “Are you sending money for the purchase of goods or services.”\nIf you would like to send the recipient a message, you can type one of up to 40 characters. Enter your payment information. At the bottom of the screen, you will be prompted for you payment information. If paying by card, you will need to provide your card type — MoneyGram only accepts Visa, Mastercard, and Discover cards. Then, fill in your card number, the expiration date, and the CVV number. If paying with your bank account, you will need to provide the name of your bank, your account type (checking or savings), your routing number, and your account number. Regardless of which bank issues it, all checks format their routing and account numbers the same way. At the bottom of your check, you will see a long string of numbers. The first set of numbers is your routing number. The second set is your account number. The third set is the number for that specific check. Once you’ve confirmed all your information, you can complete your money order!",
    "sentences": [
        " Acquiring a MoneyGram Money Order Check that you can make your payment with money order.",
        "Money orders are a method of payment that gives the recipient a guarantee that they will receive payment.",
        "Because you pay for the money order up front when purchasing it, you cannot void the payment like you could with a credit card charge, and the amount cannot bounce like a bad check.",
        "Though it’s a very secure method of payment, not all companies or people will accept money orders as a form of payment.",
        "Before securing your money order, ask the person you’re paying to whether or not it’s an acceptable form of payment.",
        "Money orders are commonly required for governmental agencies — for example, if you’re paying a speeding ticket or a court processing fee.",
        "Understand your options.",
        "Money orders can be purchased from many different locations, including post office locations, banks, local businesses like grocery stores, Western Union branches, and MoneyGram branches.",
        "If you don’t have a MoneyGram branch nearby, be aware that you can likely purchase a money order from many other locations in your area.",
        "Locate a MoneyGram branch.",
        "If you don’t know where to find one in your area, you can use the search option on the company’s website.",
        "Just enter your address and check the box that matches your service needs to find a branch that can give you what you need.",
        "Depending on why you need your money order, you should check either “Send Money” or “Pay a Bill.”\nThe website will provide you with a list of MoneyGram locations nearby.",
        "You can see the location on a map or even follow the directions the website provides to reach your nearest MoneyGram branch.",
        "Consider sending your money order online.",
        "If you can’t find a convenient location, or if you just don’t have time to visit the branch in person, MoneyGram offers an online money order option.",
        "Again, you should check with the recipient to make sure they will accept this form of payment instead of a physical money order.",
        "Filling out a MoneyGram Money Order Ask the teller for a money order.",
        "You will need to purchase the money order before you fill it out.",
        "You should know exactly how much money you need to send the recipient before you go to the MoneyGram location.",
        "MoneyGram will charge you a small fee for the transaction, so be able to cover that cost as well.",
        "MoneyGram accepts cash, debit card, credit card, or check for the purchase of money orders.",
        "Fill out the money order as soon as you purchase it.",
        "Once you’ve paid for the money order, it’s as good as cash.",
        "If you leave the fields blank, then lose the money order, anyone who picks it up can make it out to him or herself and keep your money.",
        "To prevent this, make sure to fill out the form immediately upon purchase.",
        "Enter the recipient’s name in the “Pay to the Order Of” line.",
        "This is the first line on the money order, and it is clearly marked as “Pay to the Order Of/Pagar de la Orden De.” The money order labels its various fields in both English and Spanish for the benefit of MoneyGram customers.",
        "On this line, you should write the name of the person or company who will receive the money order.",
        "Always ask the recipient what name should be provided on the money order, as you must use a legal name rather than a nickname.",
        "For example, you may know your landlord as “Jane,” but she may need to deposit the money order as her corporate name, which might be “Smith Properties, Inc.” Sign the money order.",
        "Underneath the “Pay to the Order Of” line, you’ll find the “Purchaser, Signer for Drawer” line.",
        "Write your signature on that line.",
        "You don’t need to print your name legibly.",
        "You should use your official signature — the one found on your license and on the back of your credit cards, and the one you use to sign checks.",
        "Include your address.",
        "Beneath the signature line is a line labeled “Address.” You may not be able to tell, from the money order, whether the address should be yours or that of the recipient.",
        "However, the address you include should be for the person who purchased the money order.",
        "Fill it out completely and accurately, including your street address, city, state, and postal code.",
        "Separate the money order from its receipt.",
        "On the side of the money order, you will find a detachable stub that serves as your receipt.",
        "Bend along the perforated line to make sure you can remove the receipt stub without tearing the actual money order.",
        "Be sure to save the stub until you’re sure that the money order has been received and processed by the person you’re sending payment to.",
        "In the event that your money order is stolen or lost, the information on the receipt can be used as proof of purchase, or to track the status of the money order.",
        "Sending a Money Order Online Enter your basic money order information on the MoneyGram website.",
        "The first screen will show two drop-down menus and a text field.",
        "From the first drop-down menu, labeled “Send To,” select the country in which the recipient will be receiving and processing the money order.",
        "Under “Receive Option,” choose “Pick Up Any Agent – USD.” In the third field, labeled “Amount,” enter the amount to be paid to the recipient.",
        "Even if you’re sending an even dollar amount, like $25, include a decimal and two zeroes to indicate that no cents should be paid: 25.00.",
        "Select a transfer speed.",
        "The amount of the transfer fee you have to pay will depend on how fast you want them to process and send your payment.",
        "If you use a debit or credit card to make your payment, MoneyGram can process your money order within about 10 minutes.",
        "However, if you want to use your bank account to pay for the money order, it will take them 3 business days to process it.",
        "Sign up for a MoneyGram account.",
        "If you already have an account, enter your email address and password to log in to their system.",
        "If you’re new to MoneyGram, you will need to sign up for an account by entering your email address.",
        "On the next screen, enter your name, phone number, billing address, date of birth, and the last 4 digits of your Social Security number.",
        "Uncheck the box that says “Yes, I would like to receive promotions and special offers from MoneyGram” if you don’t want to get emails from them.",
        "Create a password for your account.",
        "Click the button that says “No, thank you.",
        "Do not enroll me in MoneyGram Plus” if you want to opt out of that program.",
        "Fill in the recipient’s information.",
        "On the same screen where you sign up for your MoneyGram account, you will enter your recipient’s contact information.",
        "Include their first and last name, as well as the state in which they live.",
        "Note that you can only send up to $499.99 to the state of Arizona.",
        "Click the “Yes” or the “No” button to answer the question “Are you sending money for the purchase of goods or services.”\nIf you would like to send the recipient a message, you can type one of up to 40 characters.",
        "Enter your payment information.",
        "At the bottom of the screen, you will be prompted for you payment information.",
        "If paying by card, you will need to provide your card type — MoneyGram only accepts Visa, Mastercard, and Discover cards.",
        "Then, fill in your card number, the expiration date, and the CVV number.",
        "If paying with your bank account, you will need to provide the name of your bank, your account type (checking or savings), your routing number, and your account number.",
        "Regardless of which bank issues it, all checks format their routing and account numbers the same way.",
        "At the bottom of your check, you will see a long string of numbers.",
        "The first set of numbers is your routing number.",
        "The second set is your account number.",
        "The third set is the number for that specific check.",
        "Once you’ve confirmed all your information, you can complete your money order!"
    ]
}