{
    "title": "How to Color in Adobe Illustrator",
    "url": "https://www.wikihow.com/Color-in-Adobe-Illustrator",
    "category_hierarchy": [
        "Computers and Electronics",
        "Software",
        "Adobe Software",
        "Adobe Illustrator"
    ],
    "steps": [
        {
            "headline": "Open your document in Adobe Illustrator.",
            "description": "Save it under the name and file type you would like to use. When you open a new document in Adobe Illustrator by clicking the \"File\" menu and \"New,\" select the \"Advanced\" settings tab. Choose whether you want your vector graphics to be in RGB or CMYK."
        },
        {
            "headline": "Create several shapes using your \"Shapes\" tool on the left panel.",
            "description": "Having a few objects on your artboard will allow you to experiment with the coloring process."
        },
        {
            "headline": "Click on the squares at the bottom of the left panel.",
            "description": "The left hand box indicates the color of the interior of a shape. The right hand box indicates the border color. Click on these boxes to change the color. You can either change it using your Illustrator color panel on the right hand side or in the editing bar at the top. A box with a red line through it indicates that there isn't any color in the box or there isn't a border."
        },
        {
            "headline": "Double click the fill box to gain access to the Illustrator \"Color Picker\" dialog box.",
            "description": "This will give you access to the color spectrum with similar shades of your chosen color. Click on any point in the box to change your color according to your preference."
        },
        {
            "headline": "Find the \"Color\" palette on the right side panel.",
            "description": "Click on the top of the panel box and drag it out into your artboard. This will allow you to expand the box and find more choices. The Color palette icon looks like a painter's palette. You can also make it appear by going to the \"Window\" menu and choosing \"Color.\""
        },
        {
            "headline": "Find the Illustrator \"Color Guide\" on the right side panel.",
            "description": "Click on the icon and drag it onto your artboard. The Color Guide icon looks like a small triangle. When you hover over it  goes from gray to rainbow colors. You can also make it appear by going to the \"Window\" menu and choosing \"Color Guide.\""
        },
        {
            "headline": "Use the Color palette to choose basic colors.",
            "description": "Use the color guide to achieve more specific shades and gradients of that color."
        },
        {
            "headline": "Click on the downward arrow in the top right corner of the Color Guide.",
            "description": "This will show you options for changing the colors that appear on the guide. Color Guide options will allow you to decide how many steps or shades of colors are available to you in the Color Guide panel. These shades and tints are useful because they have the color you have selected and similar colors with black or white added to them, appearing in a gradient. The standard setting has 4 different steps of colors in both black and white; however, you can expand this to get very specific and subtle color shades. Instead of changing the Color Guide with the downward arrow, you can also change the tint of the color. Choose \"Warm/Cool\" to show a Color Guide with more red in the shades on the left and more blue in the shades on the right. You can choose a similar option with \"Vivid/Muted that show more or less color saturation.\""
        },
        {
            "headline": "Experiment with your swatches.",
            "description": "The table in the lower left corner of the Color Guide holds your swatches. Click on it and select \"Document Swatches\" to load the swatches that are pre-made or already used for your illustration. Notice the drop down menu on the Swatch button. You should see dozens of different types of swatches, including \"Art History,\" \"Foods,\" \"Metal\" and \"Skin tones.\" These preset colors are specially formulated to apply to documents that use these styles. For instance, if you are working with images of people, you may want to use the \"Skin tones\" swatch to color their skin."
        },
        {
            "headline": "Select the object that you want to color.",
            "description": "You can select similar objects in the top panel by clicking the icon with two boxes and an arrow. This is called the \"Select Similar Objects\" box and you can scroll down to the \"Fill Color\" box to select all objects with the same fill color."
        },
        {
            "headline": "Click on the shade of your choice in the Color Guide.",
            "description": "The selected objects will take on a new color."
        },
        {
            "headline": "Match your colors to existing colors by using the \"Eyedropper\" tool.",
            "description": "This eyedropper icon is in the left panel. Click on the eyedropper and then click the object that has the color you want to match. The same color will appear in the swatches on your color guide. This is especially useful if you are editing a pre-made document."
        }
    ],
    "tyn": [
        "Mouse",
        "Adobe Creative Suite",
        "Illustrator document"
    ],
    "text": " Open your document in Adobe Illustrator. Save it under the name and file type you would like to use. When you open a new document in Adobe Illustrator by clicking the \"File\" menu and \"New,\" select the \"Advanced\" settings tab. Choose whether you want your vector graphics to be in RGB or CMYK. Create several shapes using your \"Shapes\" tool on the left panel. Having a few objects on your artboard will allow you to experiment with the coloring process. Click on the squares at the bottom of the left panel. The left hand box indicates the color of the interior of a shape. The right hand box indicates the border color. Click on these boxes to change the color. You can either change it using your Illustrator color panel on the right hand side or in the editing bar at the top. A box with a red line through it indicates that there isn't any color in the box or there isn't a border. Double click the fill box to gain access to the Illustrator \"Color Picker\" dialog box. This will give you access to the color spectrum with similar shades of your chosen color. Click on any point in the box to change your color according to your preference. Find the \"Color\" palette on the right side panel. Click on the top of the panel box and drag it out into your artboard. This will allow you to expand the box and find more choices. The Color palette icon looks like a painter's palette. You can also make it appear by going to the \"Window\" menu and choosing \"Color.\" Find the Illustrator \"Color Guide\" on the right side panel. Click on the icon and drag it onto your artboard. The Color Guide icon looks like a small triangle. When you hover over it  goes from gray to rainbow colors. You can also make it appear by going to the \"Window\" menu and choosing \"Color Guide.\" Use the Color palette to choose basic colors. Use the color guide to achieve more specific shades and gradients of that color. Click on the downward arrow in the top right corner of the Color Guide. This will show you options for changing the colors that appear on the guide. Color Guide options will allow you to decide how many steps or shades of colors are available to you in the Color Guide panel. These shades and tints are useful because they have the color you have selected and similar colors with black or white added to them, appearing in a gradient. The standard setting has 4 different steps of colors in both black and white; however, you can expand this to get very specific and subtle color shades. Instead of changing the Color Guide with the downward arrow, you can also change the tint of the color. Choose \"Warm/Cool\" to show a Color Guide with more red in the shades on the left and more blue in the shades on the right. You can choose a similar option with \"Vivid/Muted that show more or less color saturation.\" Experiment with your swatches. The table in the lower left corner of the Color Guide holds your swatches. Click on it and select \"Document Swatches\" to load the swatches that are pre-made or already used for your illustration. Notice the drop down menu on the Swatch button. You should see dozens of different types of swatches, including \"Art History,\" \"Foods,\" \"Metal\" and \"Skin tones.\" These preset colors are specially formulated to apply to documents that use these styles. For instance, if you are working with images of people, you may want to use the \"Skin tones\" swatch to color their skin. Select the object that you want to color. You can select similar objects in the top panel by clicking the icon with two boxes and an arrow. This is called the \"Select Similar Objects\" box and you can scroll down to the \"Fill Color\" box to select all objects with the same fill color. Click on the shade of your choice in the Color Guide. The selected objects will take on a new color. Match your colors to existing colors by using the \"Eyedropper\" tool. This eyedropper icon is in the left panel. Click on the eyedropper and then click the object that has the color you want to match. The same color will appear in the swatches on your color guide. This is especially useful if you are editing a pre-made document.",
    "sentences": [
        " Open your document in Adobe Illustrator.",
        "Save it under the name and file type you would like to use.",
        "When you open a new document in Adobe Illustrator by clicking the \"File\" menu and \"New,\" select the \"Advanced\" settings tab.",
        "Choose whether you want your vector graphics to be in RGB or CMYK.",
        "Create several shapes using your \"Shapes\" tool on the left panel.",
        "Having a few objects on your artboard will allow you to experiment with the coloring process.",
        "Click on the squares at the bottom of the left panel.",
        "The left hand box indicates the color of the interior of a shape.",
        "The right hand box indicates the border color.",
        "Click on these boxes to change the color.",
        "You can either change it using your Illustrator color panel on the right hand side or in the editing bar at the top.",
        "A box with a red line through it indicates that there isn't any color in the box or there isn't a border.",
        "Double click the fill box to gain access to the Illustrator \"Color Picker\" dialog box.",
        "This will give you access to the color spectrum with similar shades of your chosen color.",
        "Click on any point in the box to change your color according to your preference.",
        "Find the \"Color\" palette on the right side panel.",
        "Click on the top of the panel box and drag it out into your artboard.",
        "This will allow you to expand the box and find more choices.",
        "The Color palette icon looks like a painter's palette.",
        "You can also make it appear by going to the \"Window\" menu and choosing \"Color.\"",
        "Find the Illustrator \"Color Guide\" on the right side panel.",
        "Click on the icon and drag it onto your artboard.",
        "The Color Guide icon looks like a small triangle.",
        "When you hover over it  goes from gray to rainbow colors.",
        "You can also make it appear by going to the \"Window\" menu and choosing \"Color Guide.\"",
        "Use the Color palette to choose basic colors.",
        "Use the color guide to achieve more specific shades and gradients of that color.",
        "Click on the downward arrow in the top right corner of the Color Guide.",
        "This will show you options for changing the colors that appear on the guide.",
        "Color Guide options will allow you to decide how many steps or shades of colors are available to you in the Color Guide panel.",
        "These shades and tints are useful because they have the color you have selected and similar colors with black or white added to them, appearing in a gradient.",
        "The standard setting has 4 different steps of colors in both black and white; however, you can expand this to get very specific and subtle color shades.",
        "Instead of changing the Color Guide with the downward arrow, you can also change the tint of the color.",
        "Choose \"Warm/Cool\" to show a Color Guide with more red in the shades on the left and more blue in the shades on the right.",
        "You can choose a similar option with \"Vivid/Muted that show more or less color saturation.\"",
        "Experiment with your swatches.",
        "The table in the lower left corner of the Color Guide holds your swatches.",
        "Click on it and select \"Document Swatches\" to load the swatches that are pre-made or already used for your illustration.",
        "Notice the drop down menu on the Swatch button.",
        "You should see dozens of different types of swatches, including \"Art History,\" \"Foods,\" \"Metal\" and \"Skin tones.\"",
        "These preset colors are specially formulated to apply to documents that use these styles.",
        "For instance, if you are working with images of people, you may want to use the \"Skin tones\" swatch to color their skin.",
        "Select the object that you want to color.",
        "You can select similar objects in the top panel by clicking the icon with two boxes and an arrow.",
        "This is called the \"Select Similar Objects\" box and you can scroll down to the \"Fill Color\" box to select all objects with the same fill color.",
        "Click on the shade of your choice in the Color Guide.",
        "The selected objects will take on a new color.",
        "Match your colors to existing colors by using the \"Eyedropper\" tool.",
        "This eyedropper icon is in the left panel.",
        "Click on the eyedropper and then click the object that has the color you want to match.",
        "The same color will appear in the swatches on your color guide.",
        "This is especially useful if you are editing a pre-made document."
    ]
}