{
    "title": "How to Synchronize Outlook Data with Yahoo",
    "url": "https://www.wikihow.com/Synchronize-Outlook-Data-with-Yahoo",
    "category_hierarchy": [
        "Computers and Electronics",
        "Internet",
        "Online Communications",
        "Email",
        "Email Service Providers",
        "Yahoo! Mail"
    ],
    "methods": [
        {
            "name": "Syncing Email Accounts",
            "steps": [
                {
                    "headline": "Install Microsoft (MS) Outlook onto your computer if you have not already.",
                    "description": "Make sure it is Outlook and not Outlook Express. Yahoo cannot sync with Outlook Express. In order to download MS Office obtain the original Microsoft Office disk. Insert it and follow the installation prompts on the screen. Outlook is sold in combination with the MS Office Suite. If you do not have the original disk, you can also download the software program for a network or single computer from office.microsoft.com."
                },
                {
                    "headline": "Sign into your Yahoo email account.",
                    "description": "Make sure you know what your email address and password are, so that you can type them into Outlook."
                },
                {
                    "headline": "Make sure your Point-of-Presence (POP) number is activated on your account.",
                    "description": "Go to \"Mail Options\" in your Yahoo Mail account. Look for a button that will enable your POP number to be accessed. The POP number, also known as Post Office Protocol, allows the other email program to track your IP address and location on the server so that it can sync your data. In some older Outlook programs, you may need to configure your mail settings automatically and enter the POP number when you type your Yahoo information into Outlook."
                },
                {
                    "headline": "Open Microsoft Outlook on your computer.",
                    "description": ""
                },
                {
                    "headline": "Click \"Tools\" on the top toolbar.",
                    "description": "Scroll down to the \"Account Settings\" option in the drop down menu."
                },
                {
                    "headline": "Select \"New\" in the menu options.",
                    "description": ""
                },
                {
                    "headline": "Enter your yahoo email address, password and name.",
                    "description": "Press the \"Next\" button when you are finished entering information."
                },
                {
                    "headline": "Click the \"Finish\" button.",
                    "description": "This should sync your data and allow you to access your Yahoo account in Outlook. If it does not work, you may need to enter your POP number into the \"Configure Settings Manually\" portion of the new account menu."
                }
            ]
        },
        {
            "name": "Synchronizing Separate Data",
            "steps": [
                {
                    "headline": "Close the Microsoft Outlook program.",
                    "description": ""
                },
                {
                    "headline": "Sign into your Yahoo account.",
                    "description": ""
                },
                {
                    "headline": "Go to info.yahoo.com/legal/us/yahoo/sync/.",
                    "description": "Agree to the terms and conditions and download the Yahoo Sync program."
                },
                {
                    "headline": "Open the Yahoo Sync program when you are finished installing.",
                    "description": "Select your synchronization preferences. Click on the circle to select your preference. You can choose to sync in both directions, from Yahoo to Outlook and vice versa, or you can choose to sync it in a single direction."
                },
                {
                    "headline": "Decide if you want it to sync every 30 minutes, or if you want to manually sync it.",
                    "description": "If this is a 1-time sync of the data, then choose the manual option. Click the \"Next\" button."
                },
                {
                    "headline": "Type in your Yahoo account email and password.",
                    "description": ""
                },
                {
                    "headline": "Click on the \"Finish\" button.",
                    "description": "The Yahoo Sync application will complete the synchronization. Open either account to use the shared data."
                }
            ]
        }
    ],
    "tyn": [
        "Yahoo Mail account",
        "Microsoft Office Suite",
        "POP number",
        "Yahoo Sync application"
    ],
    "text": " Syncing Email Accounts Install Microsoft (MS) Outlook onto your computer if you have not already. Make sure it is Outlook and not Outlook Express. Yahoo cannot sync with Outlook Express. In order to download MS Office obtain the original Microsoft Office disk. Insert it and follow the installation prompts on the screen. Outlook is sold in combination with the MS Office Suite. If you do not have the original disk, you can also download the software program for a network or single computer from office.microsoft.com. Sign into your Yahoo email account. Make sure you know what your email address and password are, so that you can type them into Outlook. Make sure your Point-of-Presence (POP) number is activated on your account. Go to \"Mail Options\" in your Yahoo Mail account. Look for a button that will enable your POP number to be accessed. The POP number, also known as Post Office Protocol, allows the other email program to track your IP address and location on the server so that it can sync your data. In some older Outlook programs, you may need to configure your mail settings automatically and enter the POP number when you type your Yahoo information into Outlook. Open Microsoft Outlook on your computer.  Click \"Tools\" on the top toolbar. Scroll down to the \"Account Settings\" option in the drop down menu. Select \"New\" in the menu options.  Enter your yahoo email address, password and name. Press the \"Next\" button when you are finished entering information. Click the \"Finish\" button. This should sync your data and allow you to access your Yahoo account in Outlook. If it does not work, you may need to enter your POP number into the \"Configure Settings Manually\" portion of the new account menu. Synchronizing Separate Data Close the Microsoft Outlook program.  Sign into your Yahoo account.  Go to info.yahoo.com/legal/us/yahoo/sync/. Agree to the terms and conditions and download the Yahoo Sync program. Open the Yahoo Sync program when you are finished installing. Select your synchronization preferences. Click on the circle to select your preference. You can choose to sync in both directions, from Yahoo to Outlook and vice versa, or you can choose to sync it in a single direction. Decide if you want it to sync every 30 minutes, or if you want to manually sync it. If this is a 1-time sync of the data, then choose the manual option. Click the \"Next\" button. Type in your Yahoo account email and password.  Click on the \"Finish\" button. The Yahoo Sync application will complete the synchronization. Open either account to use the shared data.",
    "sentences": [
        " Syncing Email Accounts Install Microsoft (MS) Outlook onto your computer if you have not already.",
        "Make sure it is Outlook and not Outlook Express.",
        "Yahoo cannot sync with Outlook Express.",
        "In order to download MS Office obtain the original Microsoft Office disk.",
        "Insert it and follow the installation prompts on the screen.",
        "Outlook is sold in combination with the MS Office Suite.",
        "If you do not have the original disk, you can also download the software program for a network or single computer from office.microsoft.com.",
        "Sign into your Yahoo email account.",
        "Make sure you know what your email address and password are, so that you can type them into Outlook.",
        "Make sure your Point-of-Presence (POP) number is activated on your account.",
        "Go to \"Mail Options\" in your Yahoo Mail account.",
        "Look for a button that will enable your POP number to be accessed.",
        "The POP number, also known as Post Office Protocol, allows the other email program to track your IP address and location on the server so that it can sync your data.",
        "In some older Outlook programs, you may need to configure your mail settings automatically and enter the POP number when you type your Yahoo information into Outlook.",
        "Open Microsoft Outlook on your computer.",
        "Click \"Tools\" on the top toolbar.",
        "Scroll down to the \"Account Settings\" option in the drop down menu.",
        "Select \"New\" in the menu options.",
        "Enter your yahoo email address, password and name.",
        "Press the \"Next\" button when you are finished entering information.",
        "Click the \"Finish\" button.",
        "This should sync your data and allow you to access your Yahoo account in Outlook.",
        "If it does not work, you may need to enter your POP number into the \"Configure Settings Manually\" portion of the new account menu.",
        "Synchronizing Separate Data Close the Microsoft Outlook program.",
        "Sign into your Yahoo account.",
        "Go to info.yahoo.com/legal/us/yahoo/sync/.",
        "Agree to the terms and conditions and download the Yahoo Sync program.",
        "Open the Yahoo Sync program when you are finished installing.",
        "Select your synchronization preferences.",
        "Click on the circle to select your preference.",
        "You can choose to sync in both directions, from Yahoo to Outlook and vice versa, or you can choose to sync it in a single direction.",
        "Decide if you want it to sync every 30 minutes, or if you want to manually sync it.",
        "If this is a 1-time sync of the data, then choose the manual option.",
        "Click the \"Next\" button.",
        "Type in your Yahoo account email and password.",
        "Click on the \"Finish\" button.",
        "The Yahoo Sync application will complete the synchronization.",
        "Open either account to use the shared data."
    ]
}