{
    "title": "How to Play Wall Ball",
    "url": "https://www.wikihow.com/Play-Wall-Ball",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Backyard Games",
        "Backyard Ball Games",
        "Wallball"
    ],
    "methods": [
        {
            "name": "Knowing the Gameplay",
            "steps": [
                {
                    "headline": "Throw the ball against the wall.",
                    "description": "Find a large, flat wall with no windows and a hard floor, and decide who will start the game. Establish the parameters of the court by either marking lines or using ready made boundaries like bushes or lines on the concrete. The game starts once the first player serves the ball, or throws the ball, at the wall. Ensure that the ball must bounces once before it reaches the wall. You may play with just 2 players or with multiple players at once. Decide the order of players to keep things organized. Depending on the size of the court and the variations of the rules, players must determine how far they are allowed to stand from the wall prior to the serve. For example, some rules indicate that everyone must stand back behind the throwing line prior to the first serve, in line with the server. Other rules state that only the thrower must stand behind the line. Do not choose a wall that you may damage or is close to items that you can damage like windows or cars. It also is ideal to find a wall where the ground has a slight decline towards the players."
                },
                {
                    "headline": "Allow the next player to receive the ball.",
                    "description": "As a receiving player, allow the ball to bounce once after it has hit the wall and then return it. Return the ball by hitting it with your hand and letting it reach the wall directly, without bouncing on the ground. Follow your order. If you’re first, that means you're the server! Serve the ball. If your turn is second, third, or fourth, but you play the ball out of order, you are out."
                },
                {
                    "headline": "Play until the ball is out.",
                    "description": "The ball is out when it bounces on a boundary line or outside of the boundaries completely, hits the ground before it hits the wall, bounces twice before a player is able to return it, or if a receiving player doesn’t let the ball bounce after it has hit the wall."
                },
                {
                    "headline": "Throw a fumbling receiving player out.",
                    "description": "If a receiving player fumbles the ball in an attempt to return it, she must run to the wall. Another player may then go for the ball in an attempt to throw it at the wall before the fumbling player reaches it. If the fumbling player does not touch the wall before the ball gets there, she is out of the game. If the fumbling player touches the wall before another player can throw the ball, she is still in the game. If the fumbling player reaches the wall first, she gets to serve again. If she is out, the next player takes her turn and serves to begin the game again."
                },
                {
                    "headline": "Continue the game after someone is out.",
                    "description": "Depending on the rules, players may be eliminated in a variety of ways. Once someone is out, play is continued dependent on the rules that you and the other players have established. Common ways to continue play are:\nIf the thrower is out because another player catches the ball, play continues with the catcher as the new person serving the ball. If the thrower is out because she has fumbled the ball and someone has thrown her out before she has had a chance to reach the wall, play continues with the person who threw her out as the new person serving the ball. If a person who is not a thrower tries to field the ball but fumbles it, he must then try to reach the wall before someone throws him out. If he is thrown out, the same server still continues to serve. For younger or less skilled players, play continues by establishing a throwing order at the beginning of the game. This gives everyone a chance to throw."
                }
            ]
        },
        {
            "name": "Playing Variations",
            "steps": [
                {
                    "headline": "Using baseball rules to give each player 3 strikes.",
                    "description": "When a receiving player fumbles the ball, the player must still touch the wall before another player is able to throw the ball, however, if the ball gets to the wall before he does, he gets a strike and continues playing until he gets her third strike. Allowing each player to have 3 strikes extends the game if you play until everyone is out except for the winner."
                },
                {
                    "headline": "Adding a butts up rule to the 3 strikes process.",
                    "description": "When a person receives a strike, you may penalize him by making him place his hands on the wall while the other players each get a turn at throwing the ball at his butt. Only allow one throw per person and only allow players to throw at the butt because it’s very unlikely the player will get injured."
                },
                {
                    "headline": "Create rules for throwing.",
                    "description": "For advanced players, you can add bonus points or penalties for things like one handed catches, one footed catches, using your left hand to throw or catch, etc. If a rule is broken you can penalize a person or reward a player for pulling off a difficult trick. For example, you can evoke the rule of only catching with your left hand. If your opponent uses his right hand to catch then he gets penalized with a strike or butts up."
                },
                {
                    "headline": "Evoke a no bouncing rule.",
                    "description": "Speed up the game by removing any bounces. Players must move closer to the wall and be ready for the fast pace of back and forth. Be careful as the quickened play can become dangerous as players try to cover their ground."
                }
            ]
        },
        {
            "name": "Developing Strategies",
            "steps": [
                {
                    "headline": "Psych out other players.",
                    "description": "Strategize ways to get your opponents out including using dodgeball rules to be able to direct the ball at an opponent instead of the wall so that she drops it and is then out. You may also distract your opponents before he tries to receive the ball so that he fumbles it and is penalized with a strike. You may throw at the direction of players you know are scared to catch the ball to build on the nerves and increase the likelihood that they will fumble and be out of the game. Dare a bad thrower to throw in your direction if you know you can catch it and get him out."
                },
                {
                    "headline": "Think about how to get quick strikes on other players.",
                    "description": "Use the rules to your advantage. For example, if you are playing with rules like “left handsies” where everyone must only catch with their left hand, aim at player’s right hand so that it makes it difficult for them to reach over and catch it with there left. You may also throw the ball close to the end line so that a receiving player may be forced to step out of bounds if she attempts to catch it."
                },
                {
                    "headline": "Look to be the thrower.",
                    "description": "The thrower has an automatic advantage because only she knows where the ball will go. If you have good aim and timing you will be able to continue your turn as the thrower as you get other players out. However, this may be difficult if you do not start as the thrower. Look to catch the ball if the server fumbles or for similar opportunities to establish yourself as the new thrower."
                }
            ]
        }
    ],
    "tyn": [
        "A Wall",
        "A Rubber Ball that is bouncy, such as a tennis ball",
        "At least 2 players to play the game"
    ],
    "text": " Knowing the Gameplay Throw the ball against the wall. Find a large, flat wall with no windows and a hard floor, and decide who will start the game. Establish the parameters of the court by either marking lines or using ready made boundaries like bushes or lines on the concrete. The game starts once the first player serves the ball, or throws the ball, at the wall. Ensure that the ball must bounces once before it reaches the wall. You may play with just 2 players or with multiple players at once. Decide the order of players to keep things organized. Depending on the size of the court and the variations of the rules, players must determine how far they are allowed to stand from the wall prior to the serve. For example, some rules indicate that everyone must stand back behind the throwing line prior to the first serve, in line with the server. Other rules state that only the thrower must stand behind the line. Do not choose a wall that you may damage or is close to items that you can damage like windows or cars. It also is ideal to find a wall where the ground has a slight decline towards the players. Allow the next player to receive the ball. As a receiving player, allow the ball to bounce once after it has hit the wall and then return it. Return the ball by hitting it with your hand and letting it reach the wall directly, without bouncing on the ground. Follow your order. If you’re first, that means you're the server! Serve the ball. If your turn is second, third, or fourth, but you play the ball out of order, you are out. Play until the ball is out. The ball is out when it bounces on a boundary line or outside of the boundaries completely, hits the ground before it hits the wall, bounces twice before a player is able to return it, or if a receiving player doesn’t let the ball bounce after it has hit the wall. Throw a fumbling receiving player out. If a receiving player fumbles the ball in an attempt to return it, she must run to the wall. Another player may then go for the ball in an attempt to throw it at the wall before the fumbling player reaches it. If the fumbling player does not touch the wall before the ball gets there, she is out of the game. If the fumbling player touches the wall before another player can throw the ball, she is still in the game. If the fumbling player reaches the wall first, she gets to serve again. If she is out, the next player takes her turn and serves to begin the game again. Continue the game after someone is out. Depending on the rules, players may be eliminated in a variety of ways. Once someone is out, play is continued dependent on the rules that you and the other players have established. Common ways to continue play are:\nIf the thrower is out because another player catches the ball, play continues with the catcher as the new person serving the ball. If the thrower is out because she has fumbled the ball and someone has thrown her out before she has had a chance to reach the wall, play continues with the person who threw her out as the new person serving the ball. If a person who is not a thrower tries to field the ball but fumbles it, he must then try to reach the wall before someone throws him out. If he is thrown out, the same server still continues to serve. For younger or less skilled players, play continues by establishing a throwing order at the beginning of the game. This gives everyone a chance to throw. Playing Variations Using baseball rules to give each player 3 strikes. When a receiving player fumbles the ball, the player must still touch the wall before another player is able to throw the ball, however, if the ball gets to the wall before he does, he gets a strike and continues playing until he gets her third strike. Allowing each player to have 3 strikes extends the game if you play until everyone is out except for the winner. Adding a butts up rule to the 3 strikes process. When a person receives a strike, you may penalize him by making him place his hands on the wall while the other players each get a turn at throwing the ball at his butt. Only allow one throw per person and only allow players to throw at the butt because it’s very unlikely the player will get injured. Create rules for throwing. For advanced players, you can add bonus points or penalties for things like one handed catches, one footed catches, using your left hand to throw or catch, etc. If a rule is broken you can penalize a person or reward a player for pulling off a difficult trick. For example, you can evoke the rule of only catching with your left hand. If your opponent uses his right hand to catch then he gets penalized with a strike or butts up. Evoke a no bouncing rule. Speed up the game by removing any bounces. Players must move closer to the wall and be ready for the fast pace of back and forth. Be careful as the quickened play can become dangerous as players try to cover their ground. Developing Strategies Psych out other players. Strategize ways to get your opponents out including using dodgeball rules to be able to direct the ball at an opponent instead of the wall so that she drops it and is then out. You may also distract your opponents before he tries to receive the ball so that he fumbles it and is penalized with a strike. You may throw at the direction of players you know are scared to catch the ball to build on the nerves and increase the likelihood that they will fumble and be out of the game. Dare a bad thrower to throw in your direction if you know you can catch it and get him out. Think about how to get quick strikes on other players. Use the rules to your advantage. For example, if you are playing with rules like “left handsies” where everyone must only catch with their left hand, aim at player’s right hand so that it makes it difficult for them to reach over and catch it with there left. You may also throw the ball close to the end line so that a receiving player may be forced to step out of bounds if she attempts to catch it. Look to be the thrower. The thrower has an automatic advantage because only she knows where the ball will go. If you have good aim and timing you will be able to continue your turn as the thrower as you get other players out. However, this may be difficult if you do not start as the thrower. Look to catch the ball if the server fumbles or for similar opportunities to establish yourself as the new thrower.",
    "sentences": [
        " Knowing the Gameplay Throw the ball against the wall.",
        "Find a large, flat wall with no windows and a hard floor, and decide who will start the game.",
        "Establish the parameters of the court by either marking lines or using ready made boundaries like bushes or lines on the concrete.",
        "The game starts once the first player serves the ball, or throws the ball, at the wall.",
        "Ensure that the ball must bounces once before it reaches the wall.",
        "You may play with just 2 players or with multiple players at once.",
        "Decide the order of players to keep things organized.",
        "Depending on the size of the court and the variations of the rules, players must determine how far they are allowed to stand from the wall prior to the serve.",
        "For example, some rules indicate that everyone must stand back behind the throwing line prior to the first serve, in line with the server.",
        "Other rules state that only the thrower must stand behind the line.",
        "Do not choose a wall that you may damage or is close to items that you can damage like windows or cars.",
        "It also is ideal to find a wall where the ground has a slight decline towards the players.",
        "Allow the next player to receive the ball.",
        "As a receiving player, allow the ball to bounce once after it has hit the wall and then return it.",
        "Return the ball by hitting it with your hand and letting it reach the wall directly, without bouncing on the ground.",
        "Follow your order.",
        "If you’re first, that means you're the server!",
        "Serve the ball.",
        "If your turn is second, third, or fourth, but you play the ball out of order, you are out.",
        "Play until the ball is out.",
        "The ball is out when it bounces on a boundary line or outside of the boundaries completely, hits the ground before it hits the wall, bounces twice before a player is able to return it, or if a receiving player doesn’t let the ball bounce after it has hit the wall.",
        "Throw a fumbling receiving player out.",
        "If a receiving player fumbles the ball in an attempt to return it, she must run to the wall.",
        "Another player may then go for the ball in an attempt to throw it at the wall before the fumbling player reaches it.",
        "If the fumbling player does not touch the wall before the ball gets there, she is out of the game.",
        "If the fumbling player touches the wall before another player can throw the ball, she is still in the game.",
        "If the fumbling player reaches the wall first, she gets to serve again.",
        "If she is out, the next player takes her turn and serves to begin the game again.",
        "Continue the game after someone is out.",
        "Depending on the rules, players may be eliminated in a variety of ways.",
        "Once someone is out, play is continued dependent on the rules that you and the other players have established.",
        "Common ways to continue play are:\nIf the thrower is out because another player catches the ball, play continues with the catcher as the new person serving the ball.",
        "If the thrower is out because she has fumbled the ball and someone has thrown her out before she has had a chance to reach the wall, play continues with the person who threw her out as the new person serving the ball.",
        "If a person who is not a thrower tries to field the ball but fumbles it, he must then try to reach the wall before someone throws him out.",
        "If he is thrown out, the same server still continues to serve.",
        "For younger or less skilled players, play continues by establishing a throwing order at the beginning of the game.",
        "This gives everyone a chance to throw.",
        "Playing Variations Using baseball rules to give each player 3 strikes.",
        "When a receiving player fumbles the ball, the player must still touch the wall before another player is able to throw the ball, however, if the ball gets to the wall before he does, he gets a strike and continues playing until he gets her third strike.",
        "Allowing each player to have 3 strikes extends the game if you play until everyone is out except for the winner.",
        "Adding a butts up rule to the 3 strikes process.",
        "When a person receives a strike, you may penalize him by making him place his hands on the wall while the other players each get a turn at throwing the ball at his butt.",
        "Only allow one throw per person and only allow players to throw at the butt because it’s very unlikely the player will get injured.",
        "Create rules for throwing.",
        "For advanced players, you can add bonus points or penalties for things like one handed catches, one footed catches, using your left hand to throw or catch, etc.",
        "If a rule is broken you can penalize a person or reward a player for pulling off a difficult trick.",
        "For example, you can evoke the rule of only catching with your left hand.",
        "If your opponent uses his right hand to catch then he gets penalized with a strike or butts up.",
        "Evoke a no bouncing rule.",
        "Speed up the game by removing any bounces.",
        "Players must move closer to the wall and be ready for the fast pace of back and forth.",
        "Be careful as the quickened play can become dangerous as players try to cover their ground.",
        "Developing Strategies Psych out other players.",
        "Strategize ways to get your opponents out including using dodgeball rules to be able to direct the ball at an opponent instead of the wall so that she drops it and is then out.",
        "You may also distract your opponents before he tries to receive the ball so that he fumbles it and is penalized with a strike.",
        "You may throw at the direction of players you know are scared to catch the ball to build on the nerves and increase the likelihood that they will fumble and be out of the game.",
        "Dare a bad thrower to throw in your direction if you know you can catch it and get him out.",
        "Think about how to get quick strikes on other players.",
        "Use the rules to your advantage.",
        "For example, if you are playing with rules like “left handsies” where everyone must only catch with their left hand, aim at player’s right hand so that it makes it difficult for them to reach over and catch it with there left.",
        "You may also throw the ball close to the end line so that a receiving player may be forced to step out of bounds if she attempts to catch it.",
        "Look to be the thrower.",
        "The thrower has an automatic advantage because only she knows where the ball will go.",
        "If you have good aim and timing you will be able to continue your turn as the thrower as you get other players out.",
        "However, this may be difficult if you do not start as the thrower.",
        "Look to catch the ball if the server fumbles or for similar opportunities to establish yourself as the new thrower."
    ]
}