{
    "title": "How to Save Money for Something Big As a Teen",
    "url": "https://www.wikihow.com/Save-Money-for-Something-Big-As-a-Teen",
    "category_hierarchy": [
        "Youth",
        "Money Management for Young People",
        "Money Saving Hints for Young People"
    ],
    "steps": [
        {
            "headline": "Decide on what you want to get.",
            "description": "Find out the pricing and taxes. The best idea is to do a little research and compare prices online so that you get the best deal possible."
        },
        {
            "headline": "Set aside half of all funds received.",
            "description": "Open a savings account or put it in a money box. Save all change you have received from your purchases."
        },
        {
            "headline": "Get a job (if you are old enough).",
            "description": "Depending on location, most teens can start working If they are 14 (16 in some places) or older. Not only will this help save up for the big purchase but the job will give a reference on a resume."
        },
        {
            "headline": "Budget wisely.",
            "description": "Don't make a purchase because it was on sale. Stay true to the dream of buying what is really wanted. Envision the desired object, and don't spend any of your savings on some other purchase. Keep the dream."
        },
        {
            "headline": "Avoid buying on impulse.",
            "description": "This can very quickly chip away at your savings without you even noticing it. If you feel that you will buy on impulse, set a little bit of money aside or get more bang for your buck by buying it at a grocery store instead of at a vending machine as you get more for less. (Example: You have to pay for a sugar free drink at a vending machine for a dollar while you can get a six pack of drinks that you want for 2.50.)"
        },
        {
            "headline": "Sell handmade or craft items at school, if this is allowed.",
            "description": "Check with the school's administrators to see if selling at school is allowed."
        },
        {
            "headline": "Research prices and shop around, once 95 percent of the money is tucked away.",
            "description": "Try to purchase the item on sale."
        },
        {
            "headline": "Get a big jar or tin and put every coin, note and whatever cash you find laying in your wallet, your table, etc.",
            "description": "Don't open it for 30 days. Just open it to put in more money, and if you are able to put a special hole in the lid, even better! If you can do this, make sure you seal the lid to the tin with heavy duty tape. You never know when you'll want money for something stupid. If you want, write something on the tin with Sharpie or other permanent marker like \"Don't you dare open this!\""
        }
    ],
    "tyn": [
        "Savings account",
        "Piggy bank",
        "Safe place to hide your savings"
    ],
    "text": " Decide on what you want to get. Find out the pricing and taxes. The best idea is to do a little research and compare prices online so that you get the best deal possible. Set aside half of all funds received. Open a savings account or put it in a money box. Save all change you have received from your purchases. Get a job (if you are old enough). Depending on location, most teens can start working If they are 14 (16 in some places) or older. Not only will this help save up for the big purchase but the job will give a reference on a resume. Budget wisely. Don't make a purchase because it was on sale. Stay true to the dream of buying what is really wanted. Envision the desired object, and don't spend any of your savings on some other purchase. Keep the dream. Avoid buying on impulse. This can very quickly chip away at your savings without you even noticing it. If you feel that you will buy on impulse, set a little bit of money aside or get more bang for your buck by buying it at a grocery store instead of at a vending machine as you get more for less. (Example: You have to pay for a sugar free drink at a vending machine for a dollar while you can get a six pack of drinks that you want for 2.50.) Sell handmade or craft items at school, if this is allowed. Check with the school's administrators to see if selling at school is allowed. Research prices and shop around, once 95 percent of the money is tucked away. Try to purchase the item on sale. Get a big jar or tin and put every coin, note and whatever cash you find laying in your wallet, your table, etc. Don't open it for 30 days. Just open it to put in more money, and if you are able to put a special hole in the lid, even better! If you can do this, make sure you seal the lid to the tin with heavy duty tape. You never know when you'll want money for something stupid. If you want, write something on the tin with Sharpie or other permanent marker like \"Don't you dare open this!\"",
    "sentences": [
        " Decide on what you want to get.",
        "Find out the pricing and taxes.",
        "The best idea is to do a little research and compare prices online so that you get the best deal possible.",
        "Set aside half of all funds received.",
        "Open a savings account or put it in a money box.",
        "Save all change you have received from your purchases.",
        "Get a job (if you are old enough).",
        "Depending on location, most teens can start working If they are 14 (16 in some places) or older.",
        "Not only will this help save up for the big purchase but the job will give a reference on a resume.",
        "Budget wisely.",
        "Don't make a purchase because it was on sale.",
        "Stay true to the dream of buying what is really wanted.",
        "Envision the desired object, and don't spend any of your savings on some other purchase.",
        "Keep the dream.",
        "Avoid buying on impulse.",
        "This can very quickly chip away at your savings without you even noticing it.",
        "If you feel that you will buy on impulse, set a little bit of money aside or get more bang for your buck by buying it at a grocery store instead of at a vending machine as you get more for less.",
        "(Example: You have to pay for a sugar free drink at a vending machine for a dollar while you can get a six pack of drinks that you want for 2.50.)",
        "Sell handmade or craft items at school, if this is allowed.",
        "Check with the school's administrators to see if selling at school is allowed.",
        "Research prices and shop around, once 95 percent of the money is tucked away.",
        "Try to purchase the item on sale.",
        "Get a big jar or tin and put every coin, note and whatever cash you find laying in your wallet, your table, etc.",
        "Don't open it for 30 days.",
        "Just open it to put in more money, and if you are able to put a special hole in the lid, even better!",
        "If you can do this, make sure you seal the lid to the tin with heavy duty tape.",
        "You never know when you'll want money for something stupid.",
        "If you want, write something on the tin with Sharpie or other permanent marker like \"Don't you dare open this!\""
    ]
}