{
    "title": "How to Make a Pillow Stand for iPad",
    "url": "https://www.wikihow.com/Make-a-Pillow-Stand-for-iPad",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Sewing",
        "Sewing Crafts"
    ],
    "methods": [
        {
            "name": "Cutting the Fabric",
            "steps": [
                {
                    "headline": "Place the paper pattern cutouts onto the fabric you're using.",
                    "description": "Trace around the shapes with a fabric pencil or tailor's chalk."
                },
                {
                    "headline": "Cut out the pieces from the fabric.",
                    "description": "You will end up with three fabric cutouts––one long rectangle piece and two chisel-like shapes."
                }
            ]
        },
        {
            "name": "Sewing the Fabric",
            "steps": [
                {
                    "headline": "With a sewing machine, sew the chisel shapes onto the rectangular shape.",
                    "description": "Follow the pattern to guide you as to where to join the pieces."
                },
                {
                    "headline": "When you’ve sewn all three fabric cutouts together, you’ll have the basic shape of the iPad pillow stand.",
                    "description": "There will also be a hole in the back to allow you to stuff the foam inside the fabric stand."
                }
            ]
        },
        {
            "name": "Preparing the Carving Foam",
            "steps": [
                {
                    "headline": "Cut the first piece of carving foam using a ruler and razor knife.",
                    "description": "This smaller piece should measure 12.6 x 9.1 x 1.6 inches (32 x 23 x 4cm)."
                },
                {
                    "headline": "Shave down one side of the foam piece to form a semi-triangular shape rather than leaving it as a simple rectangle.",
                    "description": ""
                },
                {
                    "headline": "Cut the second triangular piece of foam.",
                    "description": "This larger piece should measure 6.3 x 5.7 x 12.6 inches (16 x 14 x 32cm ), where 6.3 inches is the base of the triangle, 5.7 inches is the height, and 12.6 inches is the length."
                }
            ]
        },
        {
            "name": "Adding the Foam to the Fabric Cover",
            "steps": [
                {
                    "headline": "Carefully stuff the foam pieces into the fabric cover.",
                    "description": "Add them one at a time, pushing them in through the opening of the sewn-together fabric cover."
                },
                {
                    "headline": "Try folding the two foam sections together.",
                    "description": "If either piece of foam doesn’t fit neatly, you’ll need to remove the foam pieces and trim them for a better fit."
                },
                {
                    "headline": "Done!",
                    "description": "Enjoy your very own homemade iPad pillow stand. It’s perfect for holding your iPad or eBook readers in your lap or anywhere else."
                }
            ]
        }
    ],
    "tyn": [
        "A large piece of sturdy cloth for the pillow's exterior, measuring 0.45 yards (about 16 inches) long and 45 inches wide––a tough material like denim works best, but you can experiment with other fabrics",
        "Scissors",
        "Fabric pencil",
        "Sewing needle and thread",
        "Sewing machine",
        "Razor knife",
        "Ruler",
        "Small piece of leather",
        "Large chunk of carving foam (from art supply stores/specialty stores) for the soft body of the pillow"
    ],
    "text": " Cutting the Fabric Place the paper pattern cutouts onto the fabric you're using. Trace around the shapes with a fabric pencil or tailor's chalk. Cut out the pieces from the fabric. You will end up with three fabric cutouts––one long rectangle piece and two chisel-like shapes. Sewing the Fabric With a sewing machine, sew the chisel shapes onto the rectangular shape. Follow the pattern to guide you as to where to join the pieces. When you’ve sewn all three fabric cutouts together, you’ll have the basic shape of the iPad pillow stand. There will also be a hole in the back to allow you to stuff the foam inside the fabric stand. Preparing the Carving Foam Cut the first piece of carving foam using a ruler and razor knife. This smaller piece should measure 12.6 x 9.1 x 1.6 inches (32 x 23 x 4cm). Shave down one side of the foam piece to form a semi-triangular shape rather than leaving it as a simple rectangle.  Cut the second triangular piece of foam. This larger piece should measure 6.3 x 5.7 x 12.6 inches (16 x 14 x 32cm ), where 6.3 inches is the base of the triangle, 5.7 inches is the height, and 12.6 inches is the length. Adding the Foam to the Fabric Cover Carefully stuff the foam pieces into the fabric cover. Add them one at a time, pushing them in through the opening of the sewn-together fabric cover. Try folding the two foam sections together. If either piece of foam doesn’t fit neatly, you’ll need to remove the foam pieces and trim them for a better fit. Done! Enjoy your very own homemade iPad pillow stand. It’s perfect for holding your iPad or eBook readers in your lap or anywhere else.",
    "sentences": [
        " Cutting the Fabric Place the paper pattern cutouts onto the fabric you're using.",
        "Trace around the shapes with a fabric pencil or tailor's chalk.",
        "Cut out the pieces from the fabric.",
        "You will end up with three fabric cutouts––one long rectangle piece and two chisel-like shapes.",
        "Sewing the Fabric With a sewing machine, sew the chisel shapes onto the rectangular shape.",
        "Follow the pattern to guide you as to where to join the pieces.",
        "When you’ve sewn all three fabric cutouts together, you’ll have the basic shape of the iPad pillow stand.",
        "There will also be a hole in the back to allow you to stuff the foam inside the fabric stand.",
        "Preparing the Carving Foam Cut the first piece of carving foam using a ruler and razor knife.",
        "This smaller piece should measure 12.6 x 9.1 x 1.6 inches (32 x 23 x 4cm).",
        "Shave down one side of the foam piece to form a semi-triangular shape rather than leaving it as a simple rectangle.",
        "Cut the second triangular piece of foam.",
        "This larger piece should measure 6.3 x 5.7 x 12.6 inches (16 x 14 x 32cm ), where 6.3 inches is the base of the triangle, 5.7 inches is the height, and 12.6 inches is the length.",
        "Adding the Foam to the Fabric Cover Carefully stuff the foam pieces into the fabric cover.",
        "Add them one at a time, pushing them in through the opening of the sewn-together fabric cover.",
        "Try folding the two foam sections together.",
        "If either piece of foam doesn’t fit neatly, you’ll need to remove the foam pieces and trim them for a better fit.",
        "Done!",
        "Enjoy your very own homemade iPad pillow stand.",
        "It’s perfect for holding your iPad or eBook readers in your lap or anywhere else."
    ]
}