{
    "title": "How to Make Mason Jar Candles",
    "url": "https://www.wikihow.com/Make-Mason-Jar-Candles",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Glass and Stained Glass Projects",
        "Jar Projects"
    ],
    "methods": [
        {
            "name": "Making Basic Mason Jar Candles",
            "steps": [
                {
                    "headline": "Secure the wick to the bottom of your jar.",
                    "description": "You can do this by putting a drop of hot glue onto the bottom of the wick tab, then pressing the tab against the bottom of the jar. You can also use some melted wax or a piece of double-sided tape instead. If your wick doesn't have a tab at the bottom, you can buy a wick tab separately, and secure it to the wick using a pair of pliers. You can also tie a paper clip to the end of the wick instead. You can reuse jars from jams and baby food as well, but make sure that the walls are thick. If the glass is too thin, it may shatter."
                },
                {
                    "headline": "Place two pencils over the mouth of the jar, to either side of the wick.",
                    "description": "Alternatively, you can wrap the excess wick around a pencil, and place the pencil over the mouth of the jar. This will help hold the wick in place. You can also use pens, chopsticks, short dowels, or even popsicle sticks. If the mouth of your jar is small enough, you can even use a clothespin, and slide the wick through the spring hole."
                },
                {
                    "headline": "Fill a saucepan with 1 to 2 inches (2.54 to 5.08 centimeters) of water, and place a candle-making pouring pot into it.",
                    "description": "If you don't own a candle-making pouring pot, you can use a large, glass measuring cut instead. To ensure that the heat is distributed evenly, consider placing a cookie cutter or jar lid under the pouring pot/measuring cup."
                },
                {
                    "headline": "Add the wax into the pouring pot, and let it melt over medium heat.",
                    "description": "Heat the wax to about 170 to 180°F (77 to 83°C). Stir the wax often as it heats to help it melt evenly. Do not leave the wax unattended at this time, as hot wax is flammable. You will need about 1 pound (455 grams) of wax for a pint (475-milliliter) sized mason jar."
                },
                {
                    "headline": "Consider adding some color and/or fragrance.",
                    "description": "Let the wax cool to 140°F (60°C) before adding any color or fragrance. Once you have the dyes and/or fragrances added, give the wax a final stir to blend everything together. You can add color with liquid or solid dyes meant for candle-making. Add a little bit at a time, and keep in mind that the color will lighten once the wax hardens. You will need about ½ to 1 ounce of fragrance oil for 1 pound (455 grams) of wax. If you can't find dyes or fragrances meant for candle-making, you can use a broken crayon and essential oil instead."
                },
                {
                    "headline": "Let the wax cool to about 130 to 140°F (55 to 60°C).",
                    "description": "This is very important. If the wax is too hot, it may cause sink holes or cracks as it sets. Use a thermometer to test the temperature. If you don't own a thermometer, wait until the wax starts to thicken and resemble a slushie. This will take about 20 to 30 minutes."
                },
                {
                    "headline": "Fill the jar to the neck, or until you have 1 inch (2.54 centimeters) of space left.",
                    "description": "Pour the wax into the jar slowly. If you pour too quickly, you risk the wax splashing or forming air pockets. Make sure that the wick is centered as you pour."
                },
                {
                    "headline": "Let the wax set for 24 to 48 hours.",
                    "description": "The bigger your jar is, the longer it will take to set. If you are in a hurry, however, you can let the wax set partway, then stick the jar into fridge for 20 to 60 minutes."
                },
                {
                    "headline": "Trim the wick down to ¼ inch (0.64 centimeters) before using the candle.",
                    "description": "This will help keep the wax from smoking as it burns and help the wick last longer. Always keep something under the candle, such as a dish or candle charger; even through your candle is inside a mason jar, the jar itself can get hot."
                }
            ]
        },
        {
            "name": "Making an Oil Mason Jar Candle",
            "steps": [
                {
                    "headline": "Fill your mason jar with natural, decorative items, such as cinnamon sticks and pinecones.",
                    "description": "Use a pencil, dowel, stick, or chopstick to push the items about until they are positioned the way you want. Be careful not to overfill it, however. Also, note that these items won't add fragrance to your candle. If you want, consider matching the decorations to the season. For example:\nFall: orange slices, cinnamon sticks, star anise, or brightly colored leaves. Winter: mini pinecones, twigs, pine branches, or holly leaves and berries. Summer: orange, lemon, and lime slices. Spring: Whole flowers, such as dahlia or daisies."
                },
                {
                    "headline": "Fill the jar with water until it is 1 to 2 inches (2.54 to 5.08 centimeters) from the rim.",
                    "description": "If you want, you can add a few drops of food coloring into the water for a special effect."
                },
                {
                    "headline": "Pour in a ¼-inch (0.64-centimeter) layer of vegetable oil.",
                    "description": "Light olive oil and sunflower seed oil are great, because they burn clean. You can also use just about any other type of oil meant for cooking or burning in lamps. Consider mixing some essential oils into your vegetable oil first. Lemon, rosemary, and sweet orange are all great choices."
                },
                {
                    "headline": "Assemble your floating wick.",
                    "description": "Purchase your floating wick from a store or online. Next, take one of the wicks, and push it half-way through one of the waxed disks."
                },
                {
                    "headline": "Place the floating wick on top of the oil layer, and light it.",
                    "description": "The candle will burn for about 2 hours. When you want to extinguish it, simply place the jar lid on top. Eventually, the wick will burn completely. When that happens, simply insert a new one; the waxed disks can last much longer, and do not need to be replaced as often. Fresh fruit and flowers will last about 1 week in the water. If you want something that lasts longer, use fake flowers. Some craft stores also sell fake fruit."
                }
            ]
        }
    ],
    "tyn": [
        "Making Basic Mason Jar Candles",
        "Beeswax",
        "Mason jar",
        "Tabbed candlewick",
        "Saucepan",
        "Candle-making pouring pot or glass measuring cup",
        "Popsicles sticks, chopsticks, dowels, or pencils (to hold wick)",
        "Wax dye (optional)",
        "Fragrance oil (optional)",
        "Making an Oil Mason Jar Candle",
        "Large floating wick",
        "Water",
        "Vegetable oil",
        "Natural items, such as herbs, spices, greenery, citrus slices, etc.",
        "Stick (for placing natural items)",
        "Essential oil (optional)",
        "Food coloring (optional)"
    ],
    "text": " Making Basic Mason Jar Candles Secure the wick to the bottom of your jar. You can do this by putting a drop of hot glue onto the bottom of the wick tab, then pressing the tab against the bottom of the jar. You can also use some melted wax or a piece of double-sided tape instead. If your wick doesn't have a tab at the bottom, you can buy a wick tab separately, and secure it to the wick using a pair of pliers. You can also tie a paper clip to the end of the wick instead. You can reuse jars from jams and baby food as well, but make sure that the walls are thick. If the glass is too thin, it may shatter. Place two pencils over the mouth of the jar, to either side of the wick. Alternatively, you can wrap the excess wick around a pencil, and place the pencil over the mouth of the jar. This will help hold the wick in place. You can also use pens, chopsticks, short dowels, or even popsicle sticks. If the mouth of your jar is small enough, you can even use a clothespin, and slide the wick through the spring hole. Fill a saucepan with 1 to 2 inches (2.54 to 5.08 centimeters) of water, and place a candle-making pouring pot into it. If you don't own a candle-making pouring pot, you can use a large, glass measuring cut instead. To ensure that the heat is distributed evenly, consider placing a cookie cutter or jar lid under the pouring pot/measuring cup. Add the wax into the pouring pot, and let it melt over medium heat. Heat the wax to about 170 to 180°F (77 to 83°C). Stir the wax often as it heats to help it melt evenly. Do not leave the wax unattended at this time, as hot wax is flammable. You will need about 1 pound (455 grams) of wax for a pint (475-milliliter) sized mason jar. Consider adding some color and/or fragrance. Let the wax cool to 140°F (60°C) before adding any color or fragrance. Once you have the dyes and/or fragrances added, give the wax a final stir to blend everything together. You can add color with liquid or solid dyes meant for candle-making. Add a little bit at a time, and keep in mind that the color will lighten once the wax hardens. You will need about ½ to 1 ounce of fragrance oil for 1 pound (455 grams) of wax. If you can't find dyes or fragrances meant for candle-making, you can use a broken crayon and essential oil instead. Let the wax cool to about 130 to 140°F (55 to 60°C). This is very important. If the wax is too hot, it may cause sink holes or cracks as it sets. Use a thermometer to test the temperature. If you don't own a thermometer, wait until the wax starts to thicken and resemble a slushie. This will take about 20 to 30 minutes. Fill the jar to the neck, or until you have 1 inch (2.54 centimeters) of space left. Pour the wax into the jar slowly. If you pour too quickly, you risk the wax splashing or forming air pockets. Make sure that the wick is centered as you pour. Let the wax set for 24 to 48 hours. The bigger your jar is, the longer it will take to set. If you are in a hurry, however, you can let the wax set partway, then stick the jar into fridge for 20 to 60 minutes. Trim the wick down to ¼ inch (0.64 centimeters) before using the candle. This will help keep the wax from smoking as it burns and help the wick last longer. Always keep something under the candle, such as a dish or candle charger; even through your candle is inside a mason jar, the jar itself can get hot. Making an Oil Mason Jar Candle Fill your mason jar with natural, decorative items, such as cinnamon sticks and pinecones. Use a pencil, dowel, stick, or chopstick to push the items about until they are positioned the way you want. Be careful not to overfill it, however. Also, note that these items won't add fragrance to your candle. If you want, consider matching the decorations to the season. For example:\nFall: orange slices, cinnamon sticks, star anise, or brightly colored leaves. Winter: mini pinecones, twigs, pine branches, or holly leaves and berries. Summer: orange, lemon, and lime slices. Spring: Whole flowers, such as dahlia or daisies. Fill the jar with water until it is 1 to 2 inches (2.54 to 5.08 centimeters) from the rim. If you want, you can add a few drops of food coloring into the water for a special effect. Pour in a ¼-inch (0.64-centimeter) layer of vegetable oil. Light olive oil and sunflower seed oil are great, because they burn clean. You can also use just about any other type of oil meant for cooking or burning in lamps. Consider mixing some essential oils into your vegetable oil first. Lemon, rosemary, and sweet orange are all great choices. Assemble your floating wick. Purchase your floating wick from a store or online. Next, take one of the wicks, and push it half-way through one of the waxed disks. Place the floating wick on top of the oil layer, and light it. The candle will burn for about 2 hours. When you want to extinguish it, simply place the jar lid on top. Eventually, the wick will burn completely. When that happens, simply insert a new one; the waxed disks can last much longer, and do not need to be replaced as often. Fresh fruit and flowers will last about 1 week in the water. If you want something that lasts longer, use fake flowers. Some craft stores also sell fake fruit.",
    "sentences": [
        " Making Basic Mason Jar Candles Secure the wick to the bottom of your jar.",
        "You can do this by putting a drop of hot glue onto the bottom of the wick tab, then pressing the tab against the bottom of the jar.",
        "You can also use some melted wax or a piece of double-sided tape instead.",
        "If your wick doesn't have a tab at the bottom, you can buy a wick tab separately, and secure it to the wick using a pair of pliers.",
        "You can also tie a paper clip to the end of the wick instead.",
        "You can reuse jars from jams and baby food as well, but make sure that the walls are thick.",
        "If the glass is too thin, it may shatter.",
        "Place two pencils over the mouth of the jar, to either side of the wick.",
        "Alternatively, you can wrap the excess wick around a pencil, and place the pencil over the mouth of the jar.",
        "This will help hold the wick in place.",
        "You can also use pens, chopsticks, short dowels, or even popsicle sticks.",
        "If the mouth of your jar is small enough, you can even use a clothespin, and slide the wick through the spring hole.",
        "Fill a saucepan with 1 to 2 inches (2.54 to 5.08 centimeters) of water, and place a candle-making pouring pot into it.",
        "If you don't own a candle-making pouring pot, you can use a large, glass measuring cut instead.",
        "To ensure that the heat is distributed evenly, consider placing a cookie cutter or jar lid under the pouring pot/measuring cup.",
        "Add the wax into the pouring pot, and let it melt over medium heat.",
        "Heat the wax to about 170 to 180°F (77 to 83°C).",
        "Stir the wax often as it heats to help it melt evenly.",
        "Do not leave the wax unattended at this time, as hot wax is flammable.",
        "You will need about 1 pound (455 grams) of wax for a pint (475-milliliter) sized mason jar.",
        "Consider adding some color and/or fragrance.",
        "Let the wax cool to 140°F (60°C) before adding any color or fragrance.",
        "Once you have the dyes and/or fragrances added, give the wax a final stir to blend everything together.",
        "You can add color with liquid or solid dyes meant for candle-making.",
        "Add a little bit at a time, and keep in mind that the color will lighten once the wax hardens.",
        "You will need about ½ to 1 ounce of fragrance oil for 1 pound (455 grams) of wax.",
        "If you can't find dyes or fragrances meant for candle-making, you can use a broken crayon and essential oil instead.",
        "Let the wax cool to about 130 to 140°F (55 to 60°C).",
        "This is very important.",
        "If the wax is too hot, it may cause sink holes or cracks as it sets.",
        "Use a thermometer to test the temperature.",
        "If you don't own a thermometer, wait until the wax starts to thicken and resemble a slushie.",
        "This will take about 20 to 30 minutes.",
        "Fill the jar to the neck, or until you have 1 inch (2.54 centimeters) of space left.",
        "Pour the wax into the jar slowly.",
        "If you pour too quickly, you risk the wax splashing or forming air pockets.",
        "Make sure that the wick is centered as you pour.",
        "Let the wax set for 24 to 48 hours.",
        "The bigger your jar is, the longer it will take to set.",
        "If you are in a hurry, however, you can let the wax set partway, then stick the jar into fridge for 20 to 60 minutes.",
        "Trim the wick down to ¼ inch (0.64 centimeters) before using the candle.",
        "This will help keep the wax from smoking as it burns and help the wick last longer.",
        "Always keep something under the candle, such as a dish or candle charger; even through your candle is inside a mason jar, the jar itself can get hot.",
        "Making an Oil Mason Jar Candle Fill your mason jar with natural, decorative items, such as cinnamon sticks and pinecones.",
        "Use a pencil, dowel, stick, or chopstick to push the items about until they are positioned the way you want.",
        "Be careful not to overfill it, however.",
        "Also, note that these items won't add fragrance to your candle.",
        "If you want, consider matching the decorations to the season.",
        "For example:\nFall: orange slices, cinnamon sticks, star anise, or brightly colored leaves.",
        "Winter: mini pinecones, twigs, pine branches, or holly leaves and berries.",
        "Summer: orange, lemon, and lime slices.",
        "Spring: Whole flowers, such as dahlia or daisies.",
        "Fill the jar with water until it is 1 to 2 inches (2.54 to 5.08 centimeters) from the rim.",
        "If you want, you can add a few drops of food coloring into the water for a special effect.",
        "Pour in a ¼-inch (0.64-centimeter) layer of vegetable oil.",
        "Light olive oil and sunflower seed oil are great, because they burn clean.",
        "You can also use just about any other type of oil meant for cooking or burning in lamps.",
        "Consider mixing some essential oils into your vegetable oil first.",
        "Lemon, rosemary, and sweet orange are all great choices.",
        "Assemble your floating wick.",
        "Purchase your floating wick from a store or online.",
        "Next, take one of the wicks, and push it half-way through one of the waxed disks.",
        "Place the floating wick on top of the oil layer, and light it.",
        "The candle will burn for about 2 hours.",
        "When you want to extinguish it, simply place the jar lid on top.",
        "Eventually, the wick will burn completely.",
        "When that happens, simply insert a new one; the waxed disks can last much longer, and do not need to be replaced as often.",
        "Fresh fruit and flowers will last about 1 week in the water.",
        "If you want something that lasts longer, use fake flowers.",
        "Some craft stores also sell fake fruit."
    ]
}