{
    "title": "How to Make Peach Cobbler",
    "url": "https://www.wikihow.com/Make-Peach-Cobbler",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Desserts and Sweets",
        "Fruit Desserts"
    ],
    "methods": [
        {
            "name": "Making a Traditional Peach Cobbler",
            "steps": [
                {
                    "headline": "Preheat your oven to 425°F (220°C).",
                    "description": ""
                },
                {
                    "headline": "Peel, pit, and slice the peaches.",
                    "description": "Some people find it easier to cut the peaches into edges first, then peel the skins off using a knife. Once you have the peaches cut into wedges, you can slice them up thinner."
                },
                {
                    "headline": "Put the peaches into a large bowl, then stir in the white sugar, brown sugar, cinnamon, nutmeg, lemon juice, and cornstarch.",
                    "description": "You can use a wooden spoon or a rubber spatula to do this. Make sure that you are only using ¼ cup (55 grams) of white sugar and ¼ cup (50 grams) of brown sugar; you'll using the rest later. Toss everything together until the peaches are evenly coated with sugar and spices."
                },
                {
                    "headline": "Transfer the peach mixture into a 2-quart (2-liter) baking dish, and bake in the preheated oven for 10 minutes.",
                    "description": "If you want, you can grease the inside of the baking dish with some butter or cooking spray first; this will prevent the cobbler from sticking."
                },
                {
                    "headline": "Combine the flour, white sugar, brown sugar, baking powder, and salt in a separate bowl.",
                    "description": "Put the flour into a large mixing bowl, then add ¼ cup (55 grams) of white sugar and ¼ cup (50 grams) of brown sugar. Add the baking powder and salt, and stir to combine."
                },
                {
                    "headline": "Cut the butter into the flour mixture until you get a coarse mixture.",
                    "description": "You can do this using a pastry blender, a food processor, two knives, or even your fingertips. You want the \"grains\" to be about the size of small peas."
                },
                {
                    "headline": "Pour in the water, and stir it with a whisk until it is just combined.",
                    "description": "Do not over-stir the batter. You just want it to be evenly soaked so that it holds together."
                },
                {
                    "headline": "Spoon the batter over the peaches.",
                    "description": "Using a pair of oven mitts, take the baking dish out of the oven, and set it down on a heat-safe surface. Drop the batter evenly across the peaches with a large spoon."
                },
                {
                    "headline": "Make some cinnamon sugar to sprinkle on top.",
                    "description": "Stir together 3 tablespoons (45 grams) of white sugar and 1 teaspoon of ground cinnamon in a small bowl until the cinnamon is evenly distributed throughout the sugar."
                },
                {
                    "headline": "Sprinkle the cinnamon-sugar evenly over the cobbler.",
                    "description": "Use a small teaspoon to do this. This way, you'll have better control over how much cinnamon-sugar you are sprinkling."
                },
                {
                    "headline": "Bake the cobbler for about 30 minutes.",
                    "description": "It is ready when the top turns golden-brown. If it is still not done, bake it for another 15 minutes or so."
                },
                {
                    "headline": "Let the cobbler cool for a few minutes, then serve warm.",
                    "description": "You can serve it as it is or you can add some cream or vanilla ice cream."
                }
            ]
        },
        {
            "name": "Making an Easy Peach Cobbler",
            "steps": [
                {
                    "headline": "Preheat your oven to 350°F (180°C).",
                    "description": ""
                },
                {
                    "headline": "Melt the butter in a 9 by 13-inch (22.86 by 33.02-centimeter) baking dish.",
                    "description": "You can do this by cutting the butter into small cubes, placing them into the baking dish, and then leaving the dish in the oven as it heats up. The heat of the oven will melt the butter while you prepare the rest of the ingredients."
                },
                {
                    "headline": "Combine the peaches, sugar, cinnamon, and nutmeg in a large bowl.",
                    "description": "If you cannot find any canned peaches, you can use 3½ cups (790 grams) of fresh, peeled and sliced peaches instead. Set the peaches aside when you are done. If you do end up using the canned peaches, make sure that you drain them well. Save the juice for another recipe, or discard it."
                },
                {
                    "headline": "Mix the flour, sugar, baking powder, and salt together in a separate bowl.",
                    "description": "Pour everything into a large mixing bowl, then stir briskly until evenly combined."
                },
                {
                    "headline": "Stir in the milk and the egg using a whisk.",
                    "description": "Keep stirring until the yolk breaks, and everything is evenly mixed together. There should be no streaks or swirls of milk, egg white, or egg yolk."
                },
                {
                    "headline": "Pour the batter evenly over the melted butter.",
                    "description": "Using some oven mitts, take the baking dish out of the oven, and set it down on a heat-safe surface. Pour the batter over it, but do not stir."
                },
                {
                    "headline": "Pour the peach mixture over the batter, and do not stir.",
                    "description": "Keep the bowl close to the baking dish, so that the peaches don't splatter when they drop. Once again, do not stir the cobbler. For extra texture, sprinkle 1 tablespoon (15 grams) of sugar over the top of the cobbler. The sugar will caramelize, and give the cobbler a nice, crispy texture."
                },
                {
                    "headline": "Bake the cobbler for 35 to 45 minutes.",
                    "description": "The cobbler is ready when the batter rises and turns golden-brown at top. If the cobbler still is not ready, continue to bake it for 10 more minutes."
                },
                {
                    "headline": "Let the cobbler cool for a few minutes, then serve it warm.",
                    "description": "It tastes great on its own, or alongside some cream or vanilla ice cream."
                }
            ]
        },
        {
            "name": "Making a Stovetop Peach Cobbler",
            "steps": [
                {
                    "headline": "Wash, peel, and slice the peaches.",
                    "description": "Some people find it easier to cut the peaches into quarters before peeling them. Cut each peach into 10 slices."
                },
                {
                    "headline": "Put the sliced peaches into a large bowl, then stir in the sugar and salt.",
                    "description": "You can do this using a wooden spoon or a rubber spatula."
                },
                {
                    "headline": "Place the peach mixture into a skillet, and cook over medium heat for 10 minutes, stirring occasionally.",
                    "description": "You can use any type of pan or skillet, but something that is made from cast-iron would be best. Be sure to stir the peaches from time to time so that they don't burn. While the peaches are cooking, you can start preparing the biscuit topping."
                },
                {
                    "headline": "Place the flour into a large bowl, then stir in the sugar and salt.",
                    "description": "Keep stirring until everything is evenly combined. For a more flavorful cobbler, add ½ teaspoon of ground cinnamon and ½ teaspoon of ground cardamom."
                },
                {
                    "headline": "Cut the butter into the flour mixture.",
                    "description": "If you have not already done so, cut the butter into small cubes first, then add it to the flour mixture. Use your fingers, a pastry blender, a food processor, or two knives to cut the butter into the flour mixture. Keep cutting the butter until the mixture becomes coarse, with pea-sized crumbs."
                },
                {
                    "headline": "Stir in the buttermilk until the dough just holds together.",
                    "description": "Do not over-stir the dough. It will be wet, and there will be some clumps of flour. If you over-mix the dough, it may not rise properly."
                },
                {
                    "headline": "Pat the dough into a disk, then use a glass or a 2½-inch (6.35-centimeter) biscuit cutter to cut out 8 to 12 biscuits.",
                    "description": "Lightly dust your work surface with flour, then turn the dough onto it. Use your hands to pat it into a flat disk, about ½-inch (1.27 centimeters) thick. Next, use a drinking glass or a 2½-inch (6.35-centimeter) biscuit cutter to cut out 8 to 12 biscuits."
                },
                {
                    "headline": "Place the biscuits on top of the peaches.",
                    "description": "Try to arrange them as best as you can in your pan. If you cannot fit all of the biscuits, don't try to cram them. Instead, bake them in the oven at 425°F (220°C) for about 12 minutes, and serve them alongside the cobbler."
                },
                {
                    "headline": "Cover the cobbler with a tight-fitting lid, and cook it over medium heat for about 20 minutes.",
                    "description": "The cobbler is ready when the biscuits have puffed up and cooked through. If you want a more crust-like topping, stick the cobbler under the broiler in your oven for a few minutes. Only do this if your skillet is oven-safe, however."
                },
                {
                    "headline": "Let the cobbler cool for 15 to 30 minutes before serving.",
                    "description": "You can serve it as it is, or you can garnish it with some ice cream or whipped cream."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Making a Traditional Peach Cobbler",
        "2-quart (2-liter) baking dish",
        "2 large mixing bowls",
        "Small mixing bowl",
        "Whisk",
        "Wooden spoon or rubber spatula",
        "Pastry blender, two knives, or food processor (optional)",
        "Oven mitts or pot holders",
        "Making an Easy Peach Cobbler",
        "9 by 13-inch (22.86 by 33.02-centimeter) baking dish",
        "Making a Stovetop Peach Cobbler",
        "Skillet, preferably cast-iron"
    ],
    "text": " Making a Traditional Peach Cobbler Preheat your oven to 425°F (220°C).  Peel, pit, and slice the peaches. Some people find it easier to cut the peaches into edges first, then peel the skins off using a knife. Once you have the peaches cut into wedges, you can slice them up thinner. Put the peaches into a large bowl, then stir in the white sugar, brown sugar, cinnamon, nutmeg, lemon juice, and cornstarch. You can use a wooden spoon or a rubber spatula to do this. Make sure that you are only using ¼ cup (55 grams) of white sugar and ¼ cup (50 grams) of brown sugar; you'll using the rest later. Toss everything together until the peaches are evenly coated with sugar and spices. Transfer the peach mixture into a 2-quart (2-liter) baking dish, and bake in the preheated oven for 10 minutes. If you want, you can grease the inside of the baking dish with some butter or cooking spray first; this will prevent the cobbler from sticking. Combine the flour, white sugar, brown sugar, baking powder, and salt in a separate bowl. Put the flour into a large mixing bowl, then add ¼ cup (55 grams) of white sugar and ¼ cup (50 grams) of brown sugar. Add the baking powder and salt, and stir to combine. Cut the butter into the flour mixture until you get a coarse mixture. You can do this using a pastry blender, a food processor, two knives, or even your fingertips. You want the \"grains\" to be about the size of small peas. Pour in the water, and stir it with a whisk until it is just combined. Do not over-stir the batter. You just want it to be evenly soaked so that it holds together. Spoon the batter over the peaches. Using a pair of oven mitts, take the baking dish out of the oven, and set it down on a heat-safe surface. Drop the batter evenly across the peaches with a large spoon. Make some cinnamon sugar to sprinkle on top. Stir together 3 tablespoons (45 grams) of white sugar and 1 teaspoon of ground cinnamon in a small bowl until the cinnamon is evenly distributed throughout the sugar. Sprinkle the cinnamon-sugar evenly over the cobbler. Use a small teaspoon to do this. This way, you'll have better control over how much cinnamon-sugar you are sprinkling. Bake the cobbler for about 30 minutes. It is ready when the top turns golden-brown. If it is still not done, bake it for another 15 minutes or so. Let the cobbler cool for a few minutes, then serve warm. You can serve it as it is or you can add some cream or vanilla ice cream. Making an Easy Peach Cobbler Preheat your oven to 350°F (180°C).  Melt the butter in a 9 by 13-inch (22.86 by 33.02-centimeter) baking dish. You can do this by cutting the butter into small cubes, placing them into the baking dish, and then leaving the dish in the oven as it heats up. The heat of the oven will melt the butter while you prepare the rest of the ingredients. Combine the peaches, sugar, cinnamon, and nutmeg in a large bowl. If you cannot find any canned peaches, you can use 3½ cups (790 grams) of fresh, peeled and sliced peaches instead. Set the peaches aside when you are done. If you do end up using the canned peaches, make sure that you drain them well. Save the juice for another recipe, or discard it. Mix the flour, sugar, baking powder, and salt together in a separate bowl. Pour everything into a large mixing bowl, then stir briskly until evenly combined. Stir in the milk and the egg using a whisk. Keep stirring until the yolk breaks, and everything is evenly mixed together. There should be no streaks or swirls of milk, egg white, or egg yolk. Pour the batter evenly over the melted butter. Using some oven mitts, take the baking dish out of the oven, and set it down on a heat-safe surface. Pour the batter over it, but do not stir. Pour the peach mixture over the batter, and do not stir. Keep the bowl close to the baking dish, so that the peaches don't splatter when they drop. Once again, do not stir the cobbler. For extra texture, sprinkle 1 tablespoon (15 grams) of sugar over the top of the cobbler. The sugar will caramelize, and give the cobbler a nice, crispy texture. Bake the cobbler for 35 to 45 minutes. The cobbler is ready when the batter rises and turns golden-brown at top. If the cobbler still is not ready, continue to bake it for 10 more minutes. Let the cobbler cool for a few minutes, then serve it warm. It tastes great on its own, or alongside some cream or vanilla ice cream. Making a Stovetop Peach Cobbler Wash, peel, and slice the peaches. Some people find it easier to cut the peaches into quarters before peeling them. Cut each peach into 10 slices. Put the sliced peaches into a large bowl, then stir in the sugar and salt. You can do this using a wooden spoon or a rubber spatula. Place the peach mixture into a skillet, and cook over medium heat for 10 minutes, stirring occasionally. You can use any type of pan or skillet, but something that is made from cast-iron would be best. Be sure to stir the peaches from time to time so that they don't burn. While the peaches are cooking, you can start preparing the biscuit topping. Place the flour into a large bowl, then stir in the sugar and salt. Keep stirring until everything is evenly combined. For a more flavorful cobbler, add ½ teaspoon of ground cinnamon and ½ teaspoon of ground cardamom. Cut the butter into the flour mixture. If you have not already done so, cut the butter into small cubes first, then add it to the flour mixture. Use your fingers, a pastry blender, a food processor, or two knives to cut the butter into the flour mixture. Keep cutting the butter until the mixture becomes coarse, with pea-sized crumbs. Stir in the buttermilk until the dough just holds together. Do not over-stir the dough. It will be wet, and there will be some clumps of flour. If you over-mix the dough, it may not rise properly. Pat the dough into a disk, then use a glass or a 2½-inch (6.35-centimeter) biscuit cutter to cut out 8 to 12 biscuits. Lightly dust your work surface with flour, then turn the dough onto it. Use your hands to pat it into a flat disk, about ½-inch (1.27 centimeters) thick. Next, use a drinking glass or a 2½-inch (6.35-centimeter) biscuit cutter to cut out 8 to 12 biscuits. Place the biscuits on top of the peaches. Try to arrange them as best as you can in your pan. If you cannot fit all of the biscuits, don't try to cram them. Instead, bake them in the oven at 425°F (220°C) for about 12 minutes, and serve them alongside the cobbler. Cover the cobbler with a tight-fitting lid, and cook it over medium heat for about 20 minutes. The cobbler is ready when the biscuits have puffed up and cooked through. If you want a more crust-like topping, stick the cobbler under the broiler in your oven for a few minutes. Only do this if your skillet is oven-safe, however. Let the cobbler cool for 15 to 30 minutes before serving. You can serve it as it is, or you can garnish it with some ice cream or whipped cream. Finished. ",
    "sentences": [
        " Making a Traditional Peach Cobbler Preheat your oven to 425°F (220°C).",
        "Peel, pit, and slice the peaches.",
        "Some people find it easier to cut the peaches into edges first, then peel the skins off using a knife.",
        "Once you have the peaches cut into wedges, you can slice them up thinner.",
        "Put the peaches into a large bowl, then stir in the white sugar, brown sugar, cinnamon, nutmeg, lemon juice, and cornstarch.",
        "You can use a wooden spoon or a rubber spatula to do this.",
        "Make sure that you are only using ¼ cup (55 grams) of white sugar and ¼ cup (50 grams) of brown sugar; you'll using the rest later.",
        "Toss everything together until the peaches are evenly coated with sugar and spices.",
        "Transfer the peach mixture into a 2-quart (2-liter) baking dish, and bake in the preheated oven for 10 minutes.",
        "If you want, you can grease the inside of the baking dish with some butter or cooking spray first; this will prevent the cobbler from sticking.",
        "Combine the flour, white sugar, brown sugar, baking powder, and salt in a separate bowl.",
        "Put the flour into a large mixing bowl, then add ¼ cup (55 grams) of white sugar and ¼ cup (50 grams) of brown sugar.",
        "Add the baking powder and salt, and stir to combine.",
        "Cut the butter into the flour mixture until you get a coarse mixture.",
        "You can do this using a pastry blender, a food processor, two knives, or even your fingertips.",
        "You want the \"grains\" to be about the size of small peas.",
        "Pour in the water, and stir it with a whisk until it is just combined.",
        "Do not over-stir the batter.",
        "You just want it to be evenly soaked so that it holds together.",
        "Spoon the batter over the peaches.",
        "Using a pair of oven mitts, take the baking dish out of the oven, and set it down on a heat-safe surface.",
        "Drop the batter evenly across the peaches with a large spoon.",
        "Make some cinnamon sugar to sprinkle on top.",
        "Stir together 3 tablespoons (45 grams) of white sugar and 1 teaspoon of ground cinnamon in a small bowl until the cinnamon is evenly distributed throughout the sugar.",
        "Sprinkle the cinnamon-sugar evenly over the cobbler.",
        "Use a small teaspoon to do this.",
        "This way, you'll have better control over how much cinnamon-sugar you are sprinkling.",
        "Bake the cobbler for about 30 minutes.",
        "It is ready when the top turns golden-brown.",
        "If it is still not done, bake it for another 15 minutes or so.",
        "Let the cobbler cool for a few minutes, then serve warm.",
        "You can serve it as it is or you can add some cream or vanilla ice cream.",
        "Making an Easy Peach Cobbler Preheat your oven to 350°F (180°C).",
        "Melt the butter in a 9 by 13-inch (22.86 by 33.02-centimeter) baking dish.",
        "You can do this by cutting the butter into small cubes, placing them into the baking dish, and then leaving the dish in the oven as it heats up.",
        "The heat of the oven will melt the butter while you prepare the rest of the ingredients.",
        "Combine the peaches, sugar, cinnamon, and nutmeg in a large bowl.",
        "If you cannot find any canned peaches, you can use 3½ cups (790 grams) of fresh, peeled and sliced peaches instead.",
        "Set the peaches aside when you are done.",
        "If you do end up using the canned peaches, make sure that you drain them well.",
        "Save the juice for another recipe, or discard it.",
        "Mix the flour, sugar, baking powder, and salt together in a separate bowl.",
        "Pour everything into a large mixing bowl, then stir briskly until evenly combined.",
        "Stir in the milk and the egg using a whisk.",
        "Keep stirring until the yolk breaks, and everything is evenly mixed together.",
        "There should be no streaks or swirls of milk, egg white, or egg yolk.",
        "Pour the batter evenly over the melted butter.",
        "Using some oven mitts, take the baking dish out of the oven, and set it down on a heat-safe surface.",
        "Pour the batter over it, but do not stir.",
        "Pour the peach mixture over the batter, and do not stir.",
        "Keep the bowl close to the baking dish, so that the peaches don't splatter when they drop.",
        "Once again, do not stir the cobbler.",
        "For extra texture, sprinkle 1 tablespoon (15 grams) of sugar over the top of the cobbler.",
        "The sugar will caramelize, and give the cobbler a nice, crispy texture.",
        "Bake the cobbler for 35 to 45 minutes.",
        "The cobbler is ready when the batter rises and turns golden-brown at top.",
        "If the cobbler still is not ready, continue to bake it for 10 more minutes.",
        "Let the cobbler cool for a few minutes, then serve it warm.",
        "It tastes great on its own, or alongside some cream or vanilla ice cream.",
        "Making a Stovetop Peach Cobbler Wash, peel, and slice the peaches.",
        "Some people find it easier to cut the peaches into quarters before peeling them.",
        "Cut each peach into 10 slices.",
        "Put the sliced peaches into a large bowl, then stir in the sugar and salt.",
        "You can do this using a wooden spoon or a rubber spatula.",
        "Place the peach mixture into a skillet, and cook over medium heat for 10 minutes, stirring occasionally.",
        "You can use any type of pan or skillet, but something that is made from cast-iron would be best.",
        "Be sure to stir the peaches from time to time so that they don't burn.",
        "While the peaches are cooking, you can start preparing the biscuit topping.",
        "Place the flour into a large bowl, then stir in the sugar and salt.",
        "Keep stirring until everything is evenly combined.",
        "For a more flavorful cobbler, add ½ teaspoon of ground cinnamon and ½ teaspoon of ground cardamom.",
        "Cut the butter into the flour mixture.",
        "If you have not already done so, cut the butter into small cubes first, then add it to the flour mixture.",
        "Use your fingers, a pastry blender, a food processor, or two knives to cut the butter into the flour mixture.",
        "Keep cutting the butter until the mixture becomes coarse, with pea-sized crumbs.",
        "Stir in the buttermilk until the dough just holds together.",
        "Do not over-stir the dough.",
        "It will be wet, and there will be some clumps of flour.",
        "If you over-mix the dough, it may not rise properly.",
        "Pat the dough into a disk, then use a glass or a 2½-inch (6.35-centimeter) biscuit cutter to cut out 8 to 12 biscuits.",
        "Lightly dust your work surface with flour, then turn the dough onto it.",
        "Use your hands to pat it into a flat disk, about ½-inch (1.27 centimeters) thick.",
        "Next, use a drinking glass or a 2½-inch (6.35-centimeter) biscuit cutter to cut out 8 to 12 biscuits.",
        "Place the biscuits on top of the peaches.",
        "Try to arrange them as best as you can in your pan.",
        "If you cannot fit all of the biscuits, don't try to cram them.",
        "Instead, bake them in the oven at 425°F (220°C) for about 12 minutes, and serve them alongside the cobbler.",
        "Cover the cobbler with a tight-fitting lid, and cook it over medium heat for about 20 minutes.",
        "The cobbler is ready when the biscuits have puffed up and cooked through.",
        "If you want a more crust-like topping, stick the cobbler under the broiler in your oven for a few minutes.",
        "Only do this if your skillet is oven-safe, however.",
        "Let the cobbler cool for 15 to 30 minutes before serving.",
        "You can serve it as it is, or you can garnish it with some ice cream or whipped cream.",
        "Finished."
    ]
}