{
    "title": "How to Make a Concrete Stool",
    "url": "https://www.wikihow.com/Make-a-Concrete-Stool",
    "category_hierarchy": [
        "Home and Garden",
        "DIY",
        "Concrete"
    ],
    "methods": [
        {
            "name": "Mixing the Concrete",
            "steps": [
                {
                    "headline": "Scoop some concrete mix from the bag into the bucket mold.",
                    "description": "To open the bag, Cut with scissors along the top of the paper. Keep the thickness in mind as you pour in the concrete mix––the stool cannot be too thick or it may be top heavy and topple over (especially if you're making a tall stool). Filling to about a third or quarter of the bucket should be ample for a good stool. Unused powdered concrete mixture should be tightly sealed and kept in a dry, cool place where moisture cannot get to it."
                },
                {
                    "headline": "Fill a large pitcher with water to mix with the concrete.",
                    "description": "It’s better to slowly add and mix water into concrete, so if hosing in the water, use a carefully controlled nozzle to ensure a slow addition of water rather than a fierce blast."
                },
                {
                    "headline": "Slowly pour the water into the dry concrete.",
                    "description": "As you pour the water into the concrete, use a sturdy stick or paint stirrer to combine the mixture into a smooth paste. Also follow any instructions provided on the concrete packaging."
                }
            ]
        },
        {
            "name": "Smoothing and Adding Legs",
            "steps": [
                {
                    "headline": "Use the garden hoe bottom to smooth and level the bottom of the stool, if necessary.",
                    "description": "The concrete will most likely be smoothed already but use the tool if needed."
                },
                {
                    "headline": "Add the stool legs.",
                    "description": "Strategically place the legs inside the concrete, making sure you add the legs while the concrete is still wet and can absorb the legs. If necessary, hold the legs in place while the concrete sets. Check that the leg ends are all aligned evenly, to avoid a wobbly stool!"
                },
                {
                    "headline": "Allow the concrete to set.",
                    "description": "This can take up to 20 hours (see the packaging instructions). The concrete must be completely set before you remove the stool structure from the bucket."
                }
            ]
        },
        {
            "name": "Removing the Stool from the  Bucket",
            "steps": [
                {
                    "headline": "Tear the bucket away from the dried concrete.",
                    "description": "Bend the sides of the bucket outwards so that the concrete begins to loosen."
                },
                {
                    "headline": "Turn the stool right side up so that it stands on its legs.",
                    "description": "Now you can see how it works."
                },
                {
                    "headline": "Make any adjustments if needed (such as cutting down uneven legs, etc.).",
                    "description": "You might also like to add non-slip bases to the bottom of the legs. Ask at the hardware store for appropriate additions."
                },
                {
                    "headline": "Sand around the concrete base of the stool with the sandpaper.",
                    "description": "This will smooth and shape the seat."
                },
                {
                    "headline": "You now have a chic concrete stool.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Safety supplies––gear to protect your skin and eyes (to avoid burns)",
        "Concrete, bucket and three heavy, long poles that will be used as the stool's legs––ask the hardware store employee where to purchase chair legs",
        "A wheelbarrow and a basic garden hoe to mix the concrete and a large shovel to move the concrete from the wheelbarrow to your bucket",
        "Heavy sandpaper to sand down the concrete seat before using"
    ],
    "text": " Mixing the Concrete Scoop some concrete mix from the bag into the bucket mold. To open the bag, Cut with scissors along the top of the paper. Keep the thickness in mind as you pour in the concrete mix––the stool cannot be too thick or it may be top heavy and topple over (especially if you're making a tall stool). Filling to about a third or quarter of the bucket should be ample for a good stool. Unused powdered concrete mixture should be tightly sealed and kept in a dry, cool place where moisture cannot get to it. Fill a large pitcher with water to mix with the concrete. It’s better to slowly add and mix water into concrete, so if hosing in the water, use a carefully controlled nozzle to ensure a slow addition of water rather than a fierce blast. Slowly pour the water into the dry concrete. As you pour the water into the concrete, use a sturdy stick or paint stirrer to combine the mixture into a smooth paste. Also follow any instructions provided on the concrete packaging. Smoothing and Adding Legs Use the garden hoe bottom to smooth and level the bottom of the stool, if necessary. The concrete will most likely be smoothed already but use the tool if needed. Add the stool legs. Strategically place the legs inside the concrete, making sure you add the legs while the concrete is still wet and can absorb the legs. If necessary, hold the legs in place while the concrete sets. Check that the leg ends are all aligned evenly, to avoid a wobbly stool! Allow the concrete to set. This can take up to 20 hours (see the packaging instructions). The concrete must be completely set before you remove the stool structure from the bucket. Removing the Stool from the  Bucket Tear the bucket away from the dried concrete. Bend the sides of the bucket outwards so that the concrete begins to loosen. Turn the stool right side up so that it stands on its legs. Now you can see how it works. Make any adjustments if needed (such as cutting down uneven legs, etc.). You might also like to add non-slip bases to the bottom of the legs. Ask at the hardware store for appropriate additions. Sand around the concrete base of the stool with the sandpaper. This will smooth and shape the seat. You now have a chic concrete stool. ",
    "sentences": [
        " Mixing the Concrete Scoop some concrete mix from the bag into the bucket mold.",
        "To open the bag, Cut with scissors along the top of the paper.",
        "Keep the thickness in mind as you pour in the concrete mix––the stool cannot be too thick or it may be top heavy and topple over (especially if you're making a tall stool).",
        "Filling to about a third or quarter of the bucket should be ample for a good stool.",
        "Unused powdered concrete mixture should be tightly sealed and kept in a dry, cool place where moisture cannot get to it.",
        "Fill a large pitcher with water to mix with the concrete.",
        "It’s better to slowly add and mix water into concrete, so if hosing in the water, use a carefully controlled nozzle to ensure a slow addition of water rather than a fierce blast.",
        "Slowly pour the water into the dry concrete.",
        "As you pour the water into the concrete, use a sturdy stick or paint stirrer to combine the mixture into a smooth paste.",
        "Also follow any instructions provided on the concrete packaging.",
        "Smoothing and Adding Legs Use the garden hoe bottom to smooth and level the bottom of the stool, if necessary.",
        "The concrete will most likely be smoothed already but use the tool if needed.",
        "Add the stool legs.",
        "Strategically place the legs inside the concrete, making sure you add the legs while the concrete is still wet and can absorb the legs.",
        "If necessary, hold the legs in place while the concrete sets.",
        "Check that the leg ends are all aligned evenly, to avoid a wobbly stool!",
        "Allow the concrete to set.",
        "This can take up to 20 hours (see the packaging instructions).",
        "The concrete must be completely set before you remove the stool structure from the bucket.",
        "Removing the Stool from the  Bucket Tear the bucket away from the dried concrete.",
        "Bend the sides of the bucket outwards so that the concrete begins to loosen.",
        "Turn the stool right side up so that it stands on its legs.",
        "Now you can see how it works.",
        "Make any adjustments if needed (such as cutting down uneven legs, etc.).",
        "You might also like to add non-slip bases to the bottom of the legs.",
        "Ask at the hardware store for appropriate additions.",
        "Sand around the concrete base of the stool with the sandpaper.",
        "This will smooth and shape the seat.",
        "You now have a chic concrete stool."
    ]
}