{
    "title": "How to Make Syrup",
    "url": "https://www.wikihow.com/Make-Syrup",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments",
        "Syrups"
    ],
    "methods": [
        {
            "name": "Basic Syrup[1]\n\tX\n\t\tResearch source\n\t\t\n[2]\n\tX\n\t\tResearch source",
            "steps": [
                {
                    "headline": "Combine the water and sugar.",
                    "description": "Stir the water and sugar together in a small saucepan with tall sides. Place the saucepan on a stove over medium-high heat. Start with cold water. The ratio in this recipe will create a thick syrup suitable for cold fruit drinks, cocktails, and candied fruits. To create a syrup with medium thickness for use in iced tea and warm beverages, increase the ratio to two parts water and one part sugar. For a thin syrup suitable for use as a dessert glaze, change the ratio to three parts water and one part sugar."
                },
                {
                    "headline": "Bring the mixture to a boil.",
                    "description": "Stir the mixture as it comes to a boil in order to dissolve the sugar. Use medium-high to high heat and stir with a wooden or plastic mixing spoon. It may take 3 to 5 minutes before the mixture reaches a rolling boil. Check to see if the sugar has dissolved by scooping up a small amount in your spoon. If you see sugar crystals, continue to boil the syrup longer."
                },
                {
                    "headline": "Reduce the mixture to a simmer.",
                    "description": "Reduce the heat to low and let it simmer steadily for 10 minutes, stirring occasionally. If you want to create a flavored syrup, add the flavorings while the syrup simmers. Liquid ingredients, like fresh lime or lemon juice, can be added directly to the syrup and stirred in. Solid ingredients, like orange peels, mint springs, or cinnamon sticks, should be tied into a bundle with cheesecloth an twine and steeped in the syrup as it simmers."
                },
                {
                    "headline": "Let cool.",
                    "description": "Remove the syrup from the heat and let it cool to room temperature. Do not place the syrup in the refrigerator during this cooling stage. Instead, let it come to temperature on the counter at room temperature."
                },
                {
                    "headline": "Use immediately or save.",
                    "description": "You can add the syrup to your recipe immediately or pour it into a container to cover and refrigerate for later. The syrup should last in the refrigerator anywhere from one to six months."
                }
            ]
        },
        {
            "name": "Flavored Milk Syrup[3]\n\tX\n\t\tResearch source",
            "steps": [
                {
                    "headline": "Combine the sugar and water.",
                    "description": "Stir the sugar and water together in a small saucepan. Set it over medium-high heat. Start with cold water for best results. Make sure that the saucepan has tall sides to prevent the syrup from bubbling over."
                },
                {
                    "headline": "Boil the mixture for 30 to 60 seconds.",
                    "description": "Let the mixture reach a boil. After it boils, let it boil steadily for up to 1 minute. Boil the mixture over medium-high heat, stirring frequently to help dissolve the sugar. Make sure that the sugar has dissolved before you remove the syrup from the heat. If you can still see sugar crystals in the syrup, it needs to boil for a longer amount of time."
                },
                {
                    "headline": "Let cool.",
                    "description": "Remove the syrup base from the heat and let it cool to room temperature. Let it sit out at room temperature as it cools. Do not transfer it to the refrigerator yet."
                },
                {
                    "headline": "Stir in the drink powder.",
                    "description": "Once the syrup has cooled to room temperature, stir in the package of unsweetened fruit-flavored soft drink mix until fully blended. You can use any flavor you desire. Since the powder is designed to dissolve in drinks, you should have little to no problem getting it to dissolve in the syrup."
                },
                {
                    "headline": "Add to milk.",
                    "description": "Stir 1 Tbsp (15 ml) of flavored syrup into 8 oz (250 ml) cold milk. Add more or less as desired. Any remaining syrup can be saved in a sealed jar and refrigerated for roughly one month."
                }
            ]
        },
        {
            "name": "Corn Syrup[4]\n\tX\n\t\tResearch source",
            "steps": [
                {
                    "headline": "Cut the corn into slices.",
                    "description": "Use a sharp kitchen knife to cut the fresh corn cobs into 1-inch (2.5-cm) slices. This can be somewhat difficult, and you will need to use a heavy, sharp knife in order to accomplish the task. When cutting, lean over the knife to put more of your weight and more pressure into the cut. Just be careful not to accidentally cut yourself in the process. The corn flavor is only optional. Store-bought corn syrup does not taste like corn, so if you want something closer to the store-bought kind, skip the steps dealing with corn and use 1.25 (310 ml) of water instead of the full amount. The rest of the ingredients and steps will remain the same."
                },
                {
                    "headline": "Boil the corn and water over medium-high to high heat.",
                    "description": "Add the corn and cold water to a medium-size saucepan. Bring it to a boil. Begin with cold water for best results."
                },
                {
                    "headline": "Reduce the heat and let simmer.",
                    "description": "As soon as the water starts to boil, drop the heat down to medium and allow the water to calm to a simmer. Let boil for roughly 30 minutes. Leave the lid off the saucepan. When finished, the water level should drop to half its original amount."
                },
                {
                    "headline": "Strain out the water.",
                    "description": "Pour the water and corn through a colander. Save the corn-flavored water and return it to the saucepan. You can use the corn in other recipes or discard it."
                },
                {
                    "headline": "Add the sugar and salt to the corn-flavored water.",
                    "description": "Stir the sugar and salt into the water until dissolved."
                },
                {
                    "headline": "Add the vanilla to the mixture.",
                    "description": "Scrape the vanilla seeds out of the bean and add them to the saucepan. For an even stronger vanilla taste, add the pod to the syrup mixture, as well. If you do not have any vanilla beans, you can substitute 1 tsp (5 ml) of vanilla extract, instead."
                },
                {
                    "headline": "Simmer the mixture for 30 to 60 minutes.",
                    "description": "Let the mixture simmer over medium to medium-low heat until all the sugar is dissolved and the mixture thickens. The mixture should be thick enough to stick to the back of your mixing spoon when done."
                },
                {
                    "headline": "Let cool.",
                    "description": "Let the corn syrup sit out at room temperature until the temperature of the corn syrup itself drops to room temperature. Do not cool the corn syrup in your refrigerator at this stage."
                },
                {
                    "headline": "Use immediately or let cool.",
                    "description": "You can use the corn syrup immediately, or you can refrigerate it in a sealed container for several months. Store the corn syrup with the vanilla bean. If sugar crystals start to develop over time, you can microwave the syrup with a splash of water until warm. Stir to dissolve the crystals, then use as normal."
                }
            ]
        },
        {
            "name": "Additional Syrup Recipes",
            "steps": [
                {
                    "headline": "Flavor a basic syrup with vanilla.",
                    "description": "You can add a vanilla bean or vanilla extract to your basic syrup recipe in order to create a syrup suitable to serve over dessert dishes."
                },
                {
                    "headline": "Prepare ginger-flavored syrup.",
                    "description": "Adding freshly sliced ginger to a simple syrup recipe can create a delicious, zesty syrup worth adding to club soda or hot tea."
                },
                {
                    "headline": "Make a fruit syrup.",
                    "description": "Most fruit syrups are fairly simple to prepare. Add fruit juice or fruit preserves to the recipe as you simmer the syrup mixture. Try a sweet strawberry syrup. Fresh strawberries, water, and sugar are combined to form a syrup worth adding to pancakes, waffles, ice cream, and a variety of other treats. Make a lemon syrup to add to drinks or food. Lemon syrup can be prepared with fresh lemons, sugar, and water. You can also prepare a version using tartaric acid. Opt for a lime syrup, instead. For another citrus alternative to the standard lemon syrup, add freshly squeeze lime juice to your simple syrup recipe. Prepare blueberry syrup. Add blueberries to your simple syrup recipe for a syrup you can drizzle over breakfast dishes and desserts. Mix things up with an apricot syrup. Ripe apricots, cointreau, lemon juice, and sugar can be combined to form a rich, elegant syrup that can be used for baking, cooking, and drink preparation. Try cherry syrup. A sweet, tangy cherry syrup can be prepared using sugar, lemon juice, orange juice, vanilla beans, and fresh cherries. Create a flavorful, unique fig syrup. Simmer figs in brandy or sherry long enough to cook off the alcohol. Blend the thick syrup before using it. Make a great grape syrup. Concord grapes can be combined with light corn syrup and sugar for an unusual syrup made with familiar flavors."
                },
                {
                    "headline": "Use edible flowers to create a sweet, fragrant syrup.",
                    "description": "There are several flowers you can add to syrup. Try a rose syrup or a rose and cardamom syrup. These syrups can be made with rosewater, rose essence, and organic rose petals. You could also make violet syrup from fresh, organic violets."
                },
                {
                    "headline": "Tap authentic maple syrup from nearby maple trees.",
                    "description": "The process requires you to collect and filter maple sap. This sap then goes through a boiling process to turn it into syrup. Alternatively, prepare a batch of imitation maple syrup using maple flavoring or extract."
                },
                {
                    "headline": "Try mixing up some coffee-flavored syrup.",
                    "description": "By adding strong brewed coffee and rum or orange juice to a basic syrup recipe, you can create a syrup with a rich, deep flavor that makes a perfect addition for cake or milk."
                },
                {
                    "headline": "Prepare chocolate syrup.",
                    "description": "Unsweetened cocoa can turn a simple syrup into a delightful addition to milk or ice cream."
                },
                {
                    "headline": "Use tea leaves to create a syrup for your iced tea.",
                    "description": "By adding tea leaves into your syrup, you can create a sweet iced tea without diluting the flavor of the tea."
                },
                {
                    "headline": "Make orgeat syrup.",
                    "description": "This specialized syrup is a key component of a drink known as \"mai tai,\" and can be made with almond meal, sugar, vodka, water, and rose water."
                },
                {
                    "headline": "Serve homemade spiced cider syrup.",
                    "description": "This syrup makes an interesting alternative to maple syrup and can be served with French toast, pancakes, or waffles. It gets its flavor from apple cider, sugar, cinnamon, and nutmeg."
                }
            ]
        }
    ],
    "tyn": [
        "Mixing spoon",
        "Small to medium saucepan",
        "Stove",
        "Colander or strainer",
        "Cheesecloth",
        "Resealable container"
    ],
    "text": " Basic Syrup[1]\n\tX\n\t\tResearch source\n\t\t\n[2]\n\tX\n\t\tResearch source Combine the water and sugar. Stir the water and sugar together in a small saucepan with tall sides. Place the saucepan on a stove over medium-high heat. Start with cold water. The ratio in this recipe will create a thick syrup suitable for cold fruit drinks, cocktails, and candied fruits. To create a syrup with medium thickness for use in iced tea and warm beverages, increase the ratio to two parts water and one part sugar. For a thin syrup suitable for use as a dessert glaze, change the ratio to three parts water and one part sugar. Bring the mixture to a boil. Stir the mixture as it comes to a boil in order to dissolve the sugar. Use medium-high to high heat and stir with a wooden or plastic mixing spoon. It may take 3 to 5 minutes before the mixture reaches a rolling boil. Check to see if the sugar has dissolved by scooping up a small amount in your spoon. If you see sugar crystals, continue to boil the syrup longer. Reduce the mixture to a simmer. Reduce the heat to low and let it simmer steadily for 10 minutes, stirring occasionally. If you want to create a flavored syrup, add the flavorings while the syrup simmers. Liquid ingredients, like fresh lime or lemon juice, can be added directly to the syrup and stirred in. Solid ingredients, like orange peels, mint springs, or cinnamon sticks, should be tied into a bundle with cheesecloth an twine and steeped in the syrup as it simmers. Let cool. Remove the syrup from the heat and let it cool to room temperature. Do not place the syrup in the refrigerator during this cooling stage. Instead, let it come to temperature on the counter at room temperature. Use immediately or save. You can add the syrup to your recipe immediately or pour it into a container to cover and refrigerate for later. The syrup should last in the refrigerator anywhere from one to six months. Flavored Milk Syrup[3]\n\tX\n\t\tResearch source Combine the sugar and water. Stir the sugar and water together in a small saucepan. Set it over medium-high heat. Start with cold water for best results. Make sure that the saucepan has tall sides to prevent the syrup from bubbling over. Boil the mixture for 30 to 60 seconds. Let the mixture reach a boil. After it boils, let it boil steadily for up to 1 minute. Boil the mixture over medium-high heat, stirring frequently to help dissolve the sugar. Make sure that the sugar has dissolved before you remove the syrup from the heat. If you can still see sugar crystals in the syrup, it needs to boil for a longer amount of time. Let cool. Remove the syrup base from the heat and let it cool to room temperature. Let it sit out at room temperature as it cools. Do not transfer it to the refrigerator yet. Stir in the drink powder. Once the syrup has cooled to room temperature, stir in the package of unsweetened fruit-flavored soft drink mix until fully blended. You can use any flavor you desire. Since the powder is designed to dissolve in drinks, you should have little to no problem getting it to dissolve in the syrup. Add to milk. Stir 1 Tbsp (15 ml) of flavored syrup into 8 oz (250 ml) cold milk. Add more or less as desired. Any remaining syrup can be saved in a sealed jar and refrigerated for roughly one month. Corn Syrup[4]\n\tX\n\t\tResearch source Cut the corn into slices. Use a sharp kitchen knife to cut the fresh corn cobs into 1-inch (2.5-cm) slices. This can be somewhat difficult, and you will need to use a heavy, sharp knife in order to accomplish the task. When cutting, lean over the knife to put more of your weight and more pressure into the cut. Just be careful not to accidentally cut yourself in the process. The corn flavor is only optional. Store-bought corn syrup does not taste like corn, so if you want something closer to the store-bought kind, skip the steps dealing with corn and use 1.25 (310 ml) of water instead of the full amount. The rest of the ingredients and steps will remain the same. Boil the corn and water over medium-high to high heat. Add the corn and cold water to a medium-size saucepan. Bring it to a boil. Begin with cold water for best results. Reduce the heat and let simmer. As soon as the water starts to boil, drop the heat down to medium and allow the water to calm to a simmer. Let boil for roughly 30 minutes. Leave the lid off the saucepan. When finished, the water level should drop to half its original amount. Strain out the water. Pour the water and corn through a colander. Save the corn-flavored water and return it to the saucepan. You can use the corn in other recipes or discard it. Add the sugar and salt to the corn-flavored water. Stir the sugar and salt into the water until dissolved. Add the vanilla to the mixture. Scrape the vanilla seeds out of the bean and add them to the saucepan. For an even stronger vanilla taste, add the pod to the syrup mixture, as well. If you do not have any vanilla beans, you can substitute 1 tsp (5 ml) of vanilla extract, instead. Simmer the mixture for 30 to 60 minutes. Let the mixture simmer over medium to medium-low heat until all the sugar is dissolved and the mixture thickens. The mixture should be thick enough to stick to the back of your mixing spoon when done. Let cool. Let the corn syrup sit out at room temperature until the temperature of the corn syrup itself drops to room temperature. Do not cool the corn syrup in your refrigerator at this stage. Use immediately or let cool. You can use the corn syrup immediately, or you can refrigerate it in a sealed container for several months. Store the corn syrup with the vanilla bean. If sugar crystals start to develop over time, you can microwave the syrup with a splash of water until warm. Stir to dissolve the crystals, then use as normal. Additional Syrup Recipes Flavor a basic syrup with vanilla. You can add a vanilla bean or vanilla extract to your basic syrup recipe in order to create a syrup suitable to serve over dessert dishes. Prepare ginger-flavored syrup. Adding freshly sliced ginger to a simple syrup recipe can create a delicious, zesty syrup worth adding to club soda or hot tea. Make a fruit syrup. Most fruit syrups are fairly simple to prepare. Add fruit juice or fruit preserves to the recipe as you simmer the syrup mixture. Try a sweet strawberry syrup. Fresh strawberries, water, and sugar are combined to form a syrup worth adding to pancakes, waffles, ice cream, and a variety of other treats. Make a lemon syrup to add to drinks or food. Lemon syrup can be prepared with fresh lemons, sugar, and water. You can also prepare a version using tartaric acid. Opt for a lime syrup, instead. For another citrus alternative to the standard lemon syrup, add freshly squeeze lime juice to your simple syrup recipe. Prepare blueberry syrup. Add blueberries to your simple syrup recipe for a syrup you can drizzle over breakfast dishes and desserts. Mix things up with an apricot syrup. Ripe apricots, cointreau, lemon juice, and sugar can be combined to form a rich, elegant syrup that can be used for baking, cooking, and drink preparation. Try cherry syrup. A sweet, tangy cherry syrup can be prepared using sugar, lemon juice, orange juice, vanilla beans, and fresh cherries. Create a flavorful, unique fig syrup. Simmer figs in brandy or sherry long enough to cook off the alcohol. Blend the thick syrup before using it. Make a great grape syrup. Concord grapes can be combined with light corn syrup and sugar for an unusual syrup made with familiar flavors. Use edible flowers to create a sweet, fragrant syrup. There are several flowers you can add to syrup. Try a rose syrup or a rose and cardamom syrup. These syrups can be made with rosewater, rose essence, and organic rose petals. You could also make violet syrup from fresh, organic violets. Tap authentic maple syrup from nearby maple trees. The process requires you to collect and filter maple sap. This sap then goes through a boiling process to turn it into syrup. Alternatively, prepare a batch of imitation maple syrup using maple flavoring or extract. Try mixing up some coffee-flavored syrup. By adding strong brewed coffee and rum or orange juice to a basic syrup recipe, you can create a syrup with a rich, deep flavor that makes a perfect addition for cake or milk. Prepare chocolate syrup. Unsweetened cocoa can turn a simple syrup into a delightful addition to milk or ice cream. Use tea leaves to create a syrup for your iced tea. By adding tea leaves into your syrup, you can create a sweet iced tea without diluting the flavor of the tea. Make orgeat syrup. This specialized syrup is a key component of a drink known as \"mai tai,\" and can be made with almond meal, sugar, vodka, water, and rose water. Serve homemade spiced cider syrup. This syrup makes an interesting alternative to maple syrup and can be served with French toast, pancakes, or waffles. It gets its flavor from apple cider, sugar, cinnamon, and nutmeg.",
    "sentences": [
        " Basic Syrup[1]\n\tX\n\t\tResearch source\n\t\t\n[2]\n\tX\n\t\tResearch source Combine the water and sugar.",
        "Stir the water and sugar together in a small saucepan with tall sides.",
        "Place the saucepan on a stove over medium-high heat.",
        "Start with cold water.",
        "The ratio in this recipe will create a thick syrup suitable for cold fruit drinks, cocktails, and candied fruits.",
        "To create a syrup with medium thickness for use in iced tea and warm beverages, increase the ratio to two parts water and one part sugar.",
        "For a thin syrup suitable for use as a dessert glaze, change the ratio to three parts water and one part sugar.",
        "Bring the mixture to a boil.",
        "Stir the mixture as it comes to a boil in order to dissolve the sugar.",
        "Use medium-high to high heat and stir with a wooden or plastic mixing spoon.",
        "It may take 3 to 5 minutes before the mixture reaches a rolling boil.",
        "Check to see if the sugar has dissolved by scooping up a small amount in your spoon.",
        "If you see sugar crystals, continue to boil the syrup longer.",
        "Reduce the mixture to a simmer.",
        "Reduce the heat to low and let it simmer steadily for 10 minutes, stirring occasionally.",
        "If you want to create a flavored syrup, add the flavorings while the syrup simmers.",
        "Liquid ingredients, like fresh lime or lemon juice, can be added directly to the syrup and stirred in.",
        "Solid ingredients, like orange peels, mint springs, or cinnamon sticks, should be tied into a bundle with cheesecloth an twine and steeped in the syrup as it simmers.",
        "Let cool.",
        "Remove the syrup from the heat and let it cool to room temperature.",
        "Do not place the syrup in the refrigerator during this cooling stage.",
        "Instead, let it come to temperature on the counter at room temperature.",
        "Use immediately or save.",
        "You can add the syrup to your recipe immediately or pour it into a container to cover and refrigerate for later.",
        "The syrup should last in the refrigerator anywhere from one to six months.",
        "Flavored Milk Syrup[3]\n\tX\n\t\tResearch source Combine the sugar and water.",
        "Stir the sugar and water together in a small saucepan.",
        "Set it over medium-high heat.",
        "Start with cold water for best results.",
        "Make sure that the saucepan has tall sides to prevent the syrup from bubbling over.",
        "Boil the mixture for 30 to 60 seconds.",
        "Let the mixture reach a boil.",
        "After it boils, let it boil steadily for up to 1 minute.",
        "Boil the mixture over medium-high heat, stirring frequently to help dissolve the sugar.",
        "Make sure that the sugar has dissolved before you remove the syrup from the heat.",
        "If you can still see sugar crystals in the syrup, it needs to boil for a longer amount of time.",
        "Let cool.",
        "Remove the syrup base from the heat and let it cool to room temperature.",
        "Let it sit out at room temperature as it cools.",
        "Do not transfer it to the refrigerator yet.",
        "Stir in the drink powder.",
        "Once the syrup has cooled to room temperature, stir in the package of unsweetened fruit-flavored soft drink mix until fully blended.",
        "You can use any flavor you desire.",
        "Since the powder is designed to dissolve in drinks, you should have little to no problem getting it to dissolve in the syrup.",
        "Add to milk.",
        "Stir 1 Tbsp (15 ml) of flavored syrup into 8 oz (250 ml) cold milk.",
        "Add more or less as desired.",
        "Any remaining syrup can be saved in a sealed jar and refrigerated for roughly one month.",
        "Corn Syrup[4]\n\tX\n\t\tResearch source Cut the corn into slices.",
        "Use a sharp kitchen knife to cut the fresh corn cobs into 1-inch (2.5-cm) slices.",
        "This can be somewhat difficult, and you will need to use a heavy, sharp knife in order to accomplish the task.",
        "When cutting, lean over the knife to put more of your weight and more pressure into the cut.",
        "Just be careful not to accidentally cut yourself in the process.",
        "The corn flavor is only optional.",
        "Store-bought corn syrup does not taste like corn, so if you want something closer to the store-bought kind, skip the steps dealing with corn and use 1.25 (310 ml) of water instead of the full amount.",
        "The rest of the ingredients and steps will remain the same.",
        "Boil the corn and water over medium-high to high heat.",
        "Add the corn and cold water to a medium-size saucepan.",
        "Bring it to a boil.",
        "Begin with cold water for best results.",
        "Reduce the heat and let simmer.",
        "As soon as the water starts to boil, drop the heat down to medium and allow the water to calm to a simmer.",
        "Let boil for roughly 30 minutes.",
        "Leave the lid off the saucepan.",
        "When finished, the water level should drop to half its original amount.",
        "Strain out the water.",
        "Pour the water and corn through a colander.",
        "Save the corn-flavored water and return it to the saucepan.",
        "You can use the corn in other recipes or discard it.",
        "Add the sugar and salt to the corn-flavored water.",
        "Stir the sugar and salt into the water until dissolved.",
        "Add the vanilla to the mixture.",
        "Scrape the vanilla seeds out of the bean and add them to the saucepan.",
        "For an even stronger vanilla taste, add the pod to the syrup mixture, as well.",
        "If you do not have any vanilla beans, you can substitute 1 tsp (5 ml) of vanilla extract, instead.",
        "Simmer the mixture for 30 to 60 minutes.",
        "Let the mixture simmer over medium to medium-low heat until all the sugar is dissolved and the mixture thickens.",
        "The mixture should be thick enough to stick to the back of your mixing spoon when done.",
        "Let cool.",
        "Let the corn syrup sit out at room temperature until the temperature of the corn syrup itself drops to room temperature.",
        "Do not cool the corn syrup in your refrigerator at this stage.",
        "Use immediately or let cool.",
        "You can use the corn syrup immediately, or you can refrigerate it in a sealed container for several months.",
        "Store the corn syrup with the vanilla bean.",
        "If sugar crystals start to develop over time, you can microwave the syrup with a splash of water until warm.",
        "Stir to dissolve the crystals, then use as normal.",
        "Additional Syrup Recipes Flavor a basic syrup with vanilla.",
        "You can add a vanilla bean or vanilla extract to your basic syrup recipe in order to create a syrup suitable to serve over dessert dishes.",
        "Prepare ginger-flavored syrup.",
        "Adding freshly sliced ginger to a simple syrup recipe can create a delicious, zesty syrup worth adding to club soda or hot tea.",
        "Make a fruit syrup.",
        "Most fruit syrups are fairly simple to prepare.",
        "Add fruit juice or fruit preserves to the recipe as you simmer the syrup mixture.",
        "Try a sweet strawberry syrup.",
        "Fresh strawberries, water, and sugar are combined to form a syrup worth adding to pancakes, waffles, ice cream, and a variety of other treats.",
        "Make a lemon syrup to add to drinks or food.",
        "Lemon syrup can be prepared with fresh lemons, sugar, and water.",
        "You can also prepare a version using tartaric acid.",
        "Opt for a lime syrup, instead.",
        "For another citrus alternative to the standard lemon syrup, add freshly squeeze lime juice to your simple syrup recipe.",
        "Prepare blueberry syrup.",
        "Add blueberries to your simple syrup recipe for a syrup you can drizzle over breakfast dishes and desserts.",
        "Mix things up with an apricot syrup.",
        "Ripe apricots, cointreau, lemon juice, and sugar can be combined to form a rich, elegant syrup that can be used for baking, cooking, and drink preparation.",
        "Try cherry syrup.",
        "A sweet, tangy cherry syrup can be prepared using sugar, lemon juice, orange juice, vanilla beans, and fresh cherries.",
        "Create a flavorful, unique fig syrup.",
        "Simmer figs in brandy or sherry long enough to cook off the alcohol.",
        "Blend the thick syrup before using it.",
        "Make a great grape syrup.",
        "Concord grapes can be combined with light corn syrup and sugar for an unusual syrup made with familiar flavors.",
        "Use edible flowers to create a sweet, fragrant syrup.",
        "There are several flowers you can add to syrup.",
        "Try a rose syrup or a rose and cardamom syrup.",
        "These syrups can be made with rosewater, rose essence, and organic rose petals.",
        "You could also make violet syrup from fresh, organic violets.",
        "Tap authentic maple syrup from nearby maple trees.",
        "The process requires you to collect and filter maple sap.",
        "This sap then goes through a boiling process to turn it into syrup.",
        "Alternatively, prepare a batch of imitation maple syrup using maple flavoring or extract.",
        "Try mixing up some coffee-flavored syrup.",
        "By adding strong brewed coffee and rum or orange juice to a basic syrup recipe, you can create a syrup with a rich, deep flavor that makes a perfect addition for cake or milk.",
        "Prepare chocolate syrup.",
        "Unsweetened cocoa can turn a simple syrup into a delightful addition to milk or ice cream.",
        "Use tea leaves to create a syrup for your iced tea.",
        "By adding tea leaves into your syrup, you can create a sweet iced tea without diluting the flavor of the tea.",
        "Make orgeat syrup.",
        "This specialized syrup is a key component of a drink known as \"mai tai,\" and can be made with almond meal, sugar, vodka, water, and rose water.",
        "Serve homemade spiced cider syrup.",
        "This syrup makes an interesting alternative to maple syrup and can be served with French toast, pancakes, or waffles.",
        "It gets its flavor from apple cider, sugar, cinnamon, and nutmeg."
    ]
}