{
    "title": "How to Make Migajon (Craft Dough)",
    "url": "https://www.wikihow.com/Make-Migajon-(Craft-Dough)",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "steps": [
        {
            "headline": "Peel the crust off.",
            "description": "Discard. If you are losing too much white bread, then cut        with a knife."
        },
        {
            "headline": "Crumble all the bread into the bowl.",
            "description": ""
        },
        {
            "headline": "Add the 3 tablespoons of glue.",
            "description": ""
        },
        {
            "headline": "Add the 3 tablespoons of glycerin",
            "description": "Optional: you can add here the 3 tablespoons (44.4 ml) of lemon juice as well."
        },
        {
            "headline": "Mix thoroughly with your hands until all the ingredients are well mixed.",
            "description": ""
        },
        {
            "headline": "Knead the mix into a ball.",
            "description": "The longer you knead the dough, the more clay-like it will become."
        }
    ],
    "tyn": [
        "The materials here make about a baseball-size dough. The number of decorations you can make from this dough depends on the size of your decorations. Making the dough will take less than 30min. What you make with the dough and the painting of the dough will vary and so will the additional time.",
        "10 pieces of white bread",
        "3 tablespoons of liquid white glue",
        "3 tablespoons of liquid glycerin",
        "Oil-based paint or nail polish",
        "A medium-size bowl",
        "Optional: 3 tablespoons (44.4 ml) of lemon juice freshly squeezed. This makes your dough last longer if you want to store it. If you will use all the dough then it is not necessary.",
        "Note on Materials:",
        "Any white bread will work. It does not matter if it is fresh or days old.",
        "Glycerin is available at your local drugstore. CVS has it in the digestive health section as a “liquid glycerin suppository” solution. DO NOT confuse it for “Vegetable Glycerin”. It should state liquid glycerin only. Other names for it are glycerine and glycerol. It is a colorless liquid.",
        "The paint that you choose depends on what you want to make. Oil paint is the best; however, you can use nail polish for small decorations and it works great."
    ],
    "text": " Peel the crust off. Discard. If you are losing too much white bread, then cut        with a knife. Crumble all the bread into the bowl.  Add the 3 tablespoons of glue.  Add the 3 tablespoons of glycerin Optional: you can add here the 3 tablespoons (44.4 ml) of lemon juice as well. Mix thoroughly with your hands until all the ingredients are well mixed.  Knead the mix into a ball. The longer you knead the dough, the more clay-like it will become.",
    "sentences": [
        " Peel the crust off.",
        "Discard.",
        "If you are losing too much white bread, then cut        with a knife.",
        "Crumble all the bread into the bowl.",
        "Add the 3 tablespoons of glue.",
        "Add the 3 tablespoons of glycerin Optional: you can add here the 3 tablespoons (44.4 ml) of lemon juice as well.",
        "Mix thoroughly with your hands until all the ingredients are well mixed.",
        "Knead the mix into a ball.",
        "The longer you knead the dough, the more clay-like it will become."
    ]
}