{
    "title": "How to Make Strawberry Cheesecake",
    "url": "https://www.wikihow.com/Make-Strawberry-Cheesecake",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Desserts and Sweets",
        "Dessert Pies",
        "Cheesecake"
    ],
    "methods": [
        {
            "name": "Making a Fancy Strawberry Cheesecake",
            "steps": [
                {
                    "headline": "Preheat your oven to 350 °F (177 °C).",
                    "description": ""
                },
                {
                    "headline": "Mix together the graham cracker crumbs, ground pecans, and melted butter in a large mixing bowl.",
                    "description": "Make sure that the graham crackers are finely ground first; they should be the same texture as the ground pecans. Stir everything together with a rubber spatula until the mixture is damp and evenly combined. You can easily grind the graham crackers in a blender or food processor. You can also put them into a plastic bag and smash them with a rolling pin."
                },
                {
                    "headline": "Spread the crust mixture across the bottom of a 10-inch (25.4 centimeters) springform pan.",
                    "description": "Pack the crust down using your fingers. When you are done, place the pan into the fridge so that it can set while you prepare the filling."
                },
                {
                    "headline": "Beat the cream cheese until it is light and fluffy.",
                    "description": "You can do this by hand in a mixing bowl, but a food processor or electric mixer will speed up the process."
                },
                {
                    "headline": "Gradually add the eggs, vanilla, lemon juice, and sugar.",
                    "description": "Keep mixing until everything is blended together. There should be no streaks or swirls of egg yolk."
                },
                {
                    "headline": "Take the springform pan out of the fridge, and add the filling into it.",
                    "description": "Use a large spoon to scoop the filling into the crust. Gently smooth the top down with a spoon or spatula when you are done."
                },
                {
                    "headline": "Bake the cheesecake for 50 minutes, then let it cool for 15 minutes.",
                    "description": "Once the cake is set, take it out of the oven and place it on a cooling rack. Let it cool in the pan for 15 minutes; do not open the pan yet. You can save time by starting to prepare the cheesecake topping while the cake cools. Don't turn off the oven yet! You will need to bake the cake for another 5 minutes."
                },
                {
                    "headline": "Mix together the sugar, sour cream, and vanilla.",
                    "description": "In a large mixing bowl, briskly whisk together the sugar, sour cream, and vanilla until everything is evenly combined. This will create a creamy topping for your cheese cake."
                },
                {
                    "headline": "Pour the sour cream mixture over the top of the cheese cake.",
                    "description": "Use a rubber spatula to help spread it across the top of the cake evenly, if necessary."
                },
                {
                    "headline": "Bake the cheesecake for another 5 minutes, then let it cool to room temperature before refrigerating it overnight.",
                    "description": "Once the cake has finished baking, take it out of the even and let it cool for 10 minutes. Run a knife around the inside edge of the pan to loosen the cake, but don't open the pan yet. Let the cake cool for about 1 hour, then chill it in the fridge for 24 hours."
                },
                {
                    "headline": "Stir together the water and cornstarch in a saucepan, then add the jelly and cook over medium-high heat.",
                    "description": "Place a saucepan on the stove, and stir together the water and cornstarch. Add the jelly, and cook it over medium-high heat, stirring constantly, until the mixture has thickened. Start preparing the glaze just before you are ready to serve the cheesecake."
                },
                {
                    "headline": "Take the mixture off the heat, then stir in the liqueur or juice and let it cool to room temperature.",
                    "description": "You should notice the glaze thickening even more as it cools. If you'd like to add a hint of color to your glaze, you can add in a few drops of red food coloring as well."
                },
                {
                    "headline": "Take the cheesecake out of the fridge, loosen the springform pan, and arrange the strawberries on top.",
                    "description": "Cut the stems off of the strawberries, and arrange them neatly on top of the cheesecake, with the pointed ends facing upward."
                },
                {
                    "headline": "Pour the glaze over the top of the cheesecake, then serve immediately.",
                    "description": "Let some of it drip down the sides for the cake for an added touch. Refrigerate any leftovers."
                }
            ]
        },
        {
            "name": "Making a Strawberry Swirl Cheesecake",
            "steps": [
                {
                    "headline": "Preheat the oven to 325°F (162°C).",
                    "description": ""
                },
                {
                    "headline": "Stir together the crushed graham crackers, melted butter, and sugar in a large bowl using a rubber spatula.",
                    "description": "Make sure that the graham crackers are finely crushed first. They should resemble coarse sand or coffee grounds. You can do this in a blender or food processor. Keep stirring the mixture until the ingredients come together. This will make your crust."
                },
                {
                    "headline": "Press the crust mixture into a springform pan and refrigerate it for 30 minutes.",
                    "description": "Using your fingers or a spatula, spread the crust mixture across the bottom of an un-greased, 9-inch (22.86 centimeter) springform pan. Make sure it covers the entire bottom of the pan, then pack it down with your hands. Put it into the fridge when you are done, and leave it there for 30 minutes."
                },
                {
                    "headline": "Combine the strawberries and cornstarch in a food processor until smooth.",
                    "description": "Thaw the strawberries first, then add them to the food processor. Add in the cornstarch, and blend until the mixture is smooth. From time to time, you may have to pause the food processor, and scrape any unblended mixture down the sides with a spatula. If you don't have a food processor, you can use a blender."
                },
                {
                    "headline": "Boil the strawberry mixture for 2 minutes.",
                    "description": "Once the mixture is smooth, pour it into a saucepan, and bring it to a boil over medium heat, stirring constantly. Let it boil for 2 minutes, then remove it from heat."
                },
                {
                    "headline": "Set aside ⅓ cup (80 milliliters) of the strawberry mixture to cool, and refrigerate the rest.",
                    "description": "Measure out ⅓ cup (80 milliliters) of the strawberry mixture, and set it aside to cool. You will be using this in your cheesecake. Cover the rest of the mixture, and put it into the fridge. You will be using that for serving."
                },
                {
                    "headline": "Beat the cream cheese until fluffy, then slowly pour in the milk and lemon juice.",
                    "description": "You can use a food processor or an electric mixer for this; set it to medium or high speed. Beat the cream cheese first, until it turns light and fluffy, then slowly mix in the milk. Finish off with the lemon juice."
                },
                {
                    "headline": "Add the eggs, one at a time, using a low speed setting.",
                    "description": "Once the cream cheese, milk, and lemon juice are all combined, reduce the speed on your food processor or electric mixer to low. Add the eggs in one at a time. Keep mixing until everything is combined. There should be no streaks or swirls of egg yolk."
                },
                {
                    "headline": "Take the springform pan out of the fridge, and pour half of the cream cheese mixture into it.",
                    "description": "Spread it evenly across the graham cracker crust. Save the rest of the cream cheese mixture for the upper layer."
                },
                {
                    "headline": "Drop half of the cooled strawberry mixture onto the cream cheese, ½ teaspoon at a time.",
                    "description": "Don't clump all of the drops together. Instead, try to space them out. You will be swirling them together to create a marbled design. Save the rest of the strawberry mixture for the upper layer."
                },
                {
                    "headline": "Repeat the cream cheese and strawberry layers.",
                    "description": "Spoon the rest of the cream cheese mixture into the pan. Top it off with the rest of the strawberry mixture. Remember to drop the strawberry mixture onto the cake ½ teaspoon at a time."
                },
                {
                    "headline": "Use a knife to swirl the two together.",
                    "description": "Dip the point of a knife into the mixture, far enough to go past all the layers, but not far enough to touch the crust. Swirl it towards the center of the cake until it has pass through all of the strawberry drops. Do not completely blend the two together. You want to see streaks and swirls. If you don't want to dirty up a knife, use a toothpick instead."
                },
                {
                    "headline": "Bake the cheesecake for 55 to 65 minutes, then let it cool for 10 minutes.",
                    "description": "When the center of the cake is almost set, take it out of the oven, and place it onto a wire rack to cool. Do not take the cake out of its pan yet."
                },
                {
                    "headline": "Loosen the edges of the cake with a knife, then cool it for 1 hour.",
                    "description": "Run a knife around the inside edge of the pan to loosen the cake, then let the cake finish cooling, about 1 hour. Do not remove the side of the pan, or the cake will fall apart."
                },
                {
                    "headline": "Refrigerate the cake overnight, then remove the side of the pan before serving.",
                    "description": "Once you have the cake out of the pan, you can drizzle the remaining strawberry sauce over the top. Refrigerate any leftovers."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Making a Fancy Strawberry Cheesecake",
        "Mixing bowl",
        "Rubber spatula",
        "10-inch (25.4 centimeters) springform pan.",
        "Food processor or electric mixer (optional)",
        "Saucepan",
        "Wire cooling rack",
        "Whisk",
        "Making a Strawberry Swirl Cheesecake",
        "9-inch (22.86 centimeters) springform pan",
        "Food processor"
    ],
    "text": " Making a Fancy Strawberry Cheesecake Preheat your oven to 350 °F (177 °C).  Mix together the graham cracker crumbs, ground pecans, and melted butter in a large mixing bowl. Make sure that the graham crackers are finely ground first; they should be the same texture as the ground pecans. Stir everything together with a rubber spatula until the mixture is damp and evenly combined. You can easily grind the graham crackers in a blender or food processor. You can also put them into a plastic bag and smash them with a rolling pin. Spread the crust mixture across the bottom of a 10-inch (25.4 centimeters) springform pan. Pack the crust down using your fingers. When you are done, place the pan into the fridge so that it can set while you prepare the filling. Beat the cream cheese until it is light and fluffy. You can do this by hand in a mixing bowl, but a food processor or electric mixer will speed up the process. Gradually add the eggs, vanilla, lemon juice, and sugar. Keep mixing until everything is blended together. There should be no streaks or swirls of egg yolk. Take the springform pan out of the fridge, and add the filling into it. Use a large spoon to scoop the filling into the crust. Gently smooth the top down with a spoon or spatula when you are done. Bake the cheesecake for 50 minutes, then let it cool for 15 minutes. Once the cake is set, take it out of the oven and place it on a cooling rack. Let it cool in the pan for 15 minutes; do not open the pan yet. You can save time by starting to prepare the cheesecake topping while the cake cools. Don't turn off the oven yet! You will need to bake the cake for another 5 minutes. Mix together the sugar, sour cream, and vanilla. In a large mixing bowl, briskly whisk together the sugar, sour cream, and vanilla until everything is evenly combined. This will create a creamy topping for your cheese cake. Pour the sour cream mixture over the top of the cheese cake. Use a rubber spatula to help spread it across the top of the cake evenly, if necessary. Bake the cheesecake for another 5 minutes, then let it cool to room temperature before refrigerating it overnight. Once the cake has finished baking, take it out of the even and let it cool for 10 minutes. Run a knife around the inside edge of the pan to loosen the cake, but don't open the pan yet. Let the cake cool for about 1 hour, then chill it in the fridge for 24 hours. Stir together the water and cornstarch in a saucepan, then add the jelly and cook over medium-high heat. Place a saucepan on the stove, and stir together the water and cornstarch. Add the jelly, and cook it over medium-high heat, stirring constantly, until the mixture has thickened. Start preparing the glaze just before you are ready to serve the cheesecake. Take the mixture off the heat, then stir in the liqueur or juice and let it cool to room temperature. You should notice the glaze thickening even more as it cools. If you'd like to add a hint of color to your glaze, you can add in a few drops of red food coloring as well. Take the cheesecake out of the fridge, loosen the springform pan, and arrange the strawberries on top. Cut the stems off of the strawberries, and arrange them neatly on top of the cheesecake, with the pointed ends facing upward. Pour the glaze over the top of the cheesecake, then serve immediately. Let some of it drip down the sides for the cake for an added touch. Refrigerate any leftovers. Making a Strawberry Swirl Cheesecake Preheat the oven to 325°F (162°C).  Stir together the crushed graham crackers, melted butter, and sugar in a large bowl using a rubber spatula. Make sure that the graham crackers are finely crushed first. They should resemble coarse sand or coffee grounds. You can do this in a blender or food processor. Keep stirring the mixture until the ingredients come together. This will make your crust. Press the crust mixture into a springform pan and refrigerate it for 30 minutes. Using your fingers or a spatula, spread the crust mixture across the bottom of an un-greased, 9-inch (22.86 centimeter) springform pan. Make sure it covers the entire bottom of the pan, then pack it down with your hands. Put it into the fridge when you are done, and leave it there for 30 minutes. Combine the strawberries and cornstarch in a food processor until smooth. Thaw the strawberries first, then add them to the food processor. Add in the cornstarch, and blend until the mixture is smooth. From time to time, you may have to pause the food processor, and scrape any unblended mixture down the sides with a spatula. If you don't have a food processor, you can use a blender. Boil the strawberry mixture for 2 minutes. Once the mixture is smooth, pour it into a saucepan, and bring it to a boil over medium heat, stirring constantly. Let it boil for 2 minutes, then remove it from heat. Set aside ⅓ cup (80 milliliters) of the strawberry mixture to cool, and refrigerate the rest. Measure out ⅓ cup (80 milliliters) of the strawberry mixture, and set it aside to cool. You will be using this in your cheesecake. Cover the rest of the mixture, and put it into the fridge. You will be using that for serving. Beat the cream cheese until fluffy, then slowly pour in the milk and lemon juice. You can use a food processor or an electric mixer for this; set it to medium or high speed. Beat the cream cheese first, until it turns light and fluffy, then slowly mix in the milk. Finish off with the lemon juice. Add the eggs, one at a time, using a low speed setting. Once the cream cheese, milk, and lemon juice are all combined, reduce the speed on your food processor or electric mixer to low. Add the eggs in one at a time. Keep mixing until everything is combined. There should be no streaks or swirls of egg yolk. Take the springform pan out of the fridge, and pour half of the cream cheese mixture into it. Spread it evenly across the graham cracker crust. Save the rest of the cream cheese mixture for the upper layer. Drop half of the cooled strawberry mixture onto the cream cheese, ½ teaspoon at a time. Don't clump all of the drops together. Instead, try to space them out. You will be swirling them together to create a marbled design. Save the rest of the strawberry mixture for the upper layer. Repeat the cream cheese and strawberry layers. Spoon the rest of the cream cheese mixture into the pan. Top it off with the rest of the strawberry mixture. Remember to drop the strawberry mixture onto the cake ½ teaspoon at a time. Use a knife to swirl the two together. Dip the point of a knife into the mixture, far enough to go past all the layers, but not far enough to touch the crust. Swirl it towards the center of the cake until it has pass through all of the strawberry drops. Do not completely blend the two together. You want to see streaks and swirls. If you don't want to dirty up a knife, use a toothpick instead. Bake the cheesecake for 55 to 65 minutes, then let it cool for 10 minutes. When the center of the cake is almost set, take it out of the oven, and place it onto a wire rack to cool. Do not take the cake out of its pan yet. Loosen the edges of the cake with a knife, then cool it for 1 hour. Run a knife around the inside edge of the pan to loosen the cake, then let the cake finish cooling, about 1 hour. Do not remove the side of the pan, or the cake will fall apart. Refrigerate the cake overnight, then remove the side of the pan before serving. Once you have the cake out of the pan, you can drizzle the remaining strawberry sauce over the top. Refrigerate any leftovers. Finished. ",
    "sentences": [
        " Making a Fancy Strawberry Cheesecake Preheat your oven to 350 °F (177 °C).",
        "Mix together the graham cracker crumbs, ground pecans, and melted butter in a large mixing bowl.",
        "Make sure that the graham crackers are finely ground first; they should be the same texture as the ground pecans.",
        "Stir everything together with a rubber spatula until the mixture is damp and evenly combined.",
        "You can easily grind the graham crackers in a blender or food processor.",
        "You can also put them into a plastic bag and smash them with a rolling pin.",
        "Spread the crust mixture across the bottom of a 10-inch (25.4 centimeters) springform pan.",
        "Pack the crust down using your fingers.",
        "When you are done, place the pan into the fridge so that it can set while you prepare the filling.",
        "Beat the cream cheese until it is light and fluffy.",
        "You can do this by hand in a mixing bowl, but a food processor or electric mixer will speed up the process.",
        "Gradually add the eggs, vanilla, lemon juice, and sugar.",
        "Keep mixing until everything is blended together.",
        "There should be no streaks or swirls of egg yolk.",
        "Take the springform pan out of the fridge, and add the filling into it.",
        "Use a large spoon to scoop the filling into the crust.",
        "Gently smooth the top down with a spoon or spatula when you are done.",
        "Bake the cheesecake for 50 minutes, then let it cool for 15 minutes.",
        "Once the cake is set, take it out of the oven and place it on a cooling rack.",
        "Let it cool in the pan for 15 minutes; do not open the pan yet.",
        "You can save time by starting to prepare the cheesecake topping while the cake cools.",
        "Don't turn off the oven yet!",
        "You will need to bake the cake for another 5 minutes.",
        "Mix together the sugar, sour cream, and vanilla.",
        "In a large mixing bowl, briskly whisk together the sugar, sour cream, and vanilla until everything is evenly combined.",
        "This will create a creamy topping for your cheese cake.",
        "Pour the sour cream mixture over the top of the cheese cake.",
        "Use a rubber spatula to help spread it across the top of the cake evenly, if necessary.",
        "Bake the cheesecake for another 5 minutes, then let it cool to room temperature before refrigerating it overnight.",
        "Once the cake has finished baking, take it out of the even and let it cool for 10 minutes.",
        "Run a knife around the inside edge of the pan to loosen the cake, but don't open the pan yet.",
        "Let the cake cool for about 1 hour, then chill it in the fridge for 24 hours.",
        "Stir together the water and cornstarch in a saucepan, then add the jelly and cook over medium-high heat.",
        "Place a saucepan on the stove, and stir together the water and cornstarch.",
        "Add the jelly, and cook it over medium-high heat, stirring constantly, until the mixture has thickened.",
        "Start preparing the glaze just before you are ready to serve the cheesecake.",
        "Take the mixture off the heat, then stir in the liqueur or juice and let it cool to room temperature.",
        "You should notice the glaze thickening even more as it cools.",
        "If you'd like to add a hint of color to your glaze, you can add in a few drops of red food coloring as well.",
        "Take the cheesecake out of the fridge, loosen the springform pan, and arrange the strawberries on top.",
        "Cut the stems off of the strawberries, and arrange them neatly on top of the cheesecake, with the pointed ends facing upward.",
        "Pour the glaze over the top of the cheesecake, then serve immediately.",
        "Let some of it drip down the sides for the cake for an added touch.",
        "Refrigerate any leftovers.",
        "Making a Strawberry Swirl Cheesecake Preheat the oven to 325°F (162°C).",
        "Stir together the crushed graham crackers, melted butter, and sugar in a large bowl using a rubber spatula.",
        "Make sure that the graham crackers are finely crushed first.",
        "They should resemble coarse sand or coffee grounds.",
        "You can do this in a blender or food processor.",
        "Keep stirring the mixture until the ingredients come together.",
        "This will make your crust.",
        "Press the crust mixture into a springform pan and refrigerate it for 30 minutes.",
        "Using your fingers or a spatula, spread the crust mixture across the bottom of an un-greased, 9-inch (22.86 centimeter) springform pan.",
        "Make sure it covers the entire bottom of the pan, then pack it down with your hands.",
        "Put it into the fridge when you are done, and leave it there for 30 minutes.",
        "Combine the strawberries and cornstarch in a food processor until smooth.",
        "Thaw the strawberries first, then add them to the food processor.",
        "Add in the cornstarch, and blend until the mixture is smooth.",
        "From time to time, you may have to pause the food processor, and scrape any unblended mixture down the sides with a spatula.",
        "If you don't have a food processor, you can use a blender.",
        "Boil the strawberry mixture for 2 minutes.",
        "Once the mixture is smooth, pour it into a saucepan, and bring it to a boil over medium heat, stirring constantly.",
        "Let it boil for 2 minutes, then remove it from heat.",
        "Set aside ⅓ cup (80 milliliters) of the strawberry mixture to cool, and refrigerate the rest.",
        "Measure out ⅓ cup (80 milliliters) of the strawberry mixture, and set it aside to cool.",
        "You will be using this in your cheesecake.",
        "Cover the rest of the mixture, and put it into the fridge.",
        "You will be using that for serving.",
        "Beat the cream cheese until fluffy, then slowly pour in the milk and lemon juice.",
        "You can use a food processor or an electric mixer for this; set it to medium or high speed.",
        "Beat the cream cheese first, until it turns light and fluffy, then slowly mix in the milk.",
        "Finish off with the lemon juice.",
        "Add the eggs, one at a time, using a low speed setting.",
        "Once the cream cheese, milk, and lemon juice are all combined, reduce the speed on your food processor or electric mixer to low.",
        "Add the eggs in one at a time.",
        "Keep mixing until everything is combined.",
        "There should be no streaks or swirls of egg yolk.",
        "Take the springform pan out of the fridge, and pour half of the cream cheese mixture into it.",
        "Spread it evenly across the graham cracker crust.",
        "Save the rest of the cream cheese mixture for the upper layer.",
        "Drop half of the cooled strawberry mixture onto the cream cheese, ½ teaspoon at a time.",
        "Don't clump all of the drops together.",
        "Instead, try to space them out.",
        "You will be swirling them together to create a marbled design.",
        "Save the rest of the strawberry mixture for the upper layer.",
        "Repeat the cream cheese and strawberry layers.",
        "Spoon the rest of the cream cheese mixture into the pan.",
        "Top it off with the rest of the strawberry mixture.",
        "Remember to drop the strawberry mixture onto the cake ½ teaspoon at a time.",
        "Use a knife to swirl the two together.",
        "Dip the point of a knife into the mixture, far enough to go past all the layers, but not far enough to touch the crust.",
        "Swirl it towards the center of the cake until it has pass through all of the strawberry drops.",
        "Do not completely blend the two together.",
        "You want to see streaks and swirls.",
        "If you don't want to dirty up a knife, use a toothpick instead.",
        "Bake the cheesecake for 55 to 65 minutes, then let it cool for 10 minutes.",
        "When the center of the cake is almost set, take it out of the oven, and place it onto a wire rack to cool.",
        "Do not take the cake out of its pan yet.",
        "Loosen the edges of the cake with a knife, then cool it for 1 hour.",
        "Run a knife around the inside edge of the pan to loosen the cake, then let the cake finish cooling, about 1 hour.",
        "Do not remove the side of the pan, or the cake will fall apart.",
        "Refrigerate the cake overnight, then remove the side of the pan before serving.",
        "Once you have the cake out of the pan, you can drizzle the remaining strawberry sauce over the top.",
        "Refrigerate any leftovers.",
        "Finished."
    ]
}