{
    "title": "How to Discharge a CRT Monitor",
    "url": "https://www.wikihow.com/Discharge-a-CRT-Monitor",
    "category_hierarchy": [
        "Computers and Electronics",
        "Computer Peripherals",
        "Computer Monitors"
    ],
    "steps": [
        {
            "headline": "Unplug the monitor.",
            "description": ""
        },
        {
            "headline": "Leave it alone for a few hours.",
            "description": "If you can afford to waste a lot of time, twenty-four hours would be better."
        },
        {
            "headline": "Wear rubber-soled shoes (no steel toes) and safety goggles.",
            "description": "Take off all your jewelry, especially rings and watches. You don't want to be grounded in any way."
        },
        {
            "headline": "Find a heavy flat-bladed screwdriver with good insulation.",
            "description": "A Swiss Army knife is not acceptable."
        },
        {
            "headline": "Find a heavy-gauge wire with alligator clips on the end.",
            "description": ""
        },
        {
            "headline": "Take the monitor's case off -- and don't forget where the screws go in.",
            "description": "This could lead to embarrassment."
        },
        {
            "headline": "Attach one alligator clamp to an unpainted portion of the metal frame.",
            "description": ""
        },
        {
            "headline": "Attach the other alligator clip to the screwdriver's metal shaft.",
            "description": ""
        },
        {
            "headline": "Make sure that neither you or the screwdriver are in contact with anything metal.",
            "description": ""
        },
        {
            "headline": "The anode is a wire covered by a suction cup.",
            "description": "Slide the screwdriver blade under the suction cup until you hear a loud pop and see a blue flash."
        },
        {
            "headline": "Wait for about 30 minutes and repeat.",
            "description": ""
        }
    ],
    "tyn": [
        "CRT Monitor",
        "Flat-bladed screwdriver",
        "Heavy-gauge wire with alligator clips",
        "Safety goggles",
        "Rubber-soled shoes",
        "Nerves of steel."
    ],
    "text": " Unplug the monitor.  Leave it alone for a few hours. If you can afford to waste a lot of time, twenty-four hours would be better. Wear rubber-soled shoes (no steel toes) and safety goggles. Take off all your jewelry, especially rings and watches. You don't want to be grounded in any way. Find a heavy flat-bladed screwdriver with good insulation. A Swiss Army knife is not acceptable. Find a heavy-gauge wire with alligator clips on the end.  Take the monitor's case off -- and don't forget where the screws go in. This could lead to embarrassment. Attach one alligator clamp to an unpainted portion of the metal frame.  Attach the other alligator clip to the screwdriver's metal shaft.  Make sure that neither you or the screwdriver are in contact with anything metal.  The anode is a wire covered by a suction cup. Slide the screwdriver blade under the suction cup until you hear a loud pop and see a blue flash. Wait for about 30 minutes and repeat. ",
    "sentences": [
        " Unplug the monitor.",
        "Leave it alone for a few hours.",
        "If you can afford to waste a lot of time, twenty-four hours would be better.",
        "Wear rubber-soled shoes (no steel toes) and safety goggles.",
        "Take off all your jewelry, especially rings and watches.",
        "You don't want to be grounded in any way.",
        "Find a heavy flat-bladed screwdriver with good insulation.",
        "A Swiss Army knife is not acceptable.",
        "Find a heavy-gauge wire with alligator clips on the end.",
        "Take the monitor's case off -- and don't forget where the screws go in.",
        "This could lead to embarrassment.",
        "Attach one alligator clamp to an unpainted portion of the metal frame.",
        "Attach the other alligator clip to the screwdriver's metal shaft.",
        "Make sure that neither you or the screwdriver are in contact with anything metal.",
        "The anode is a wire covered by a suction cup.",
        "Slide the screwdriver blade under the suction cup until you hear a loud pop and see a blue flash.",
        "Wait for about 30 minutes and repeat."
    ]
}