{
    "title": "How to Play Lightning Mode in Bejeweled 3",
    "url": "https://www.wikihow.com/Play-Lightning-Mode-in-Bejeweled-3",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Video Games",
        "PC Games"
    ],
    "steps": [
        {
            "headline": "From the mode menu, select Lightning Mode.",
            "description": ""
        },
        {
            "headline": "Find your first match and start playing.",
            "description": "It is very important to match three gems."
        },
        {
            "headline": "Look for Time Gems with a +5 and a +10 on it.",
            "description": "They add time to your next round."
        },
        {
            "headline": "Keep matching gems for a Speed Bonus.",
            "description": "This is very helpful to get a high score."
        },
        {
            "headline": "When the Speed Bonus meter is full, then it will activate Blazing Speed.",
            "description": ""
        },
        {
            "headline": "When the round is over, the combined time gets carried over to the next round, \"+5\" and \"+10\" time gems on the board are turned into flame and star gems respectively, and the multiplier increases by one.",
            "description": ""
        },
        {
            "headline": "Repeat the steps above and keep going.",
            "description": ""
        },
        {
            "headline": "When the timer hits zero and there is no time in the meter below the score, then a Time Up message will appear.",
            "description": "This signals the end of the game."
        },
        {
            "headline": "When the game ends, there will be a Last Hurrah bonus.",
            "description": "All the time gems on screen will transform into normal gems, and any special gems still on the board will automatically activate, as will any others that are created due to a cascade."
        }
    ],
    "tyn": [
        "Bejeweled 3"
    ],
    "text": " From the mode menu, select Lightning Mode.  Find your first match and start playing. It is very important to match three gems. Look for Time Gems with a +5 and a +10 on it. They add time to your next round. Keep matching gems for a Speed Bonus. This is very helpful to get a high score. When the Speed Bonus meter is full, then it will activate Blazing Speed.  When the round is over, the combined time gets carried over to the next round, \"+5\" and \"+10\" time gems on the board are turned into flame and star gems respectively, and the multiplier increases by one.  Repeat the steps above and keep going.  When the timer hits zero and there is no time in the meter below the score, then a Time Up message will appear. This signals the end of the game. When the game ends, there will be a Last Hurrah bonus. All the time gems on screen will transform into normal gems, and any special gems still on the board will automatically activate, as will any others that are created due to a cascade.",
    "sentences": [
        " From the mode menu, select Lightning Mode.",
        "Find your first match and start playing.",
        "It is very important to match three gems.",
        "Look for Time Gems with a +5 and a +10 on it.",
        "They add time to your next round.",
        "Keep matching gems for a Speed Bonus.",
        "This is very helpful to get a high score.",
        "When the Speed Bonus meter is full, then it will activate Blazing Speed.",
        "When the round is over, the combined time gets carried over to the next round, \"+5\" and \"+10\" time gems on the board are turned into flame and star gems respectively, and the multiplier increases by one.",
        "Repeat the steps above and keep going.",
        "When the timer hits zero and there is no time in the meter below the score, then a Time Up message will appear.",
        "This signals the end of the game.",
        "When the game ends, there will be a Last Hurrah bonus.",
        "All the time gems on screen will transform into normal gems, and any special gems still on the board will automatically activate, as will any others that are created due to a cascade."
    ]
}