{
    "title": "How to Shut a Garage Door when the Sun Is Shining on the Electronic Eyes",
    "url": "https://www.wikihow.com/Shut-a-Garage-Door-when-the-Sun-Is-Shining-on-the-Electronic-Eyes",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Doors and Windows",
        "Door Types"
    ],
    "steps": [
        {
            "headline": "Use the inside tube from an empty roll of toilet paper, holiday wrapping paper, plastic wrap, or any cardboard tube that is large enough in diameter and flexible enough so you can bend it to the shape of the electric eye.",
            "description": "You may have to experiment with several size tubes until you find one that fits snug enough so it won't fall off."
        },
        {
            "headline": "Cut the tube to be at least 2–4 inches (5.1–10.2 cm) long.",
            "description": "Remember, if it's too long you can always cut it shorter. Once you cut it, you can't make it longer."
        },
        {
            "headline": "Squeeze the tube so it makes an oval shape instead of it's normal round shape and slip it over the body of the electric eye unit so it extends about 2–3 inches (5.1–7.6 cm) past the end of the electric eye.",
            "description": ""
        },
        {
            "headline": "Put a tube on the electric eye on each side of the garage door (one side for mornings, the other side for evenings)",
            "description": ""
        },
        {
            "headline": "Make sure the tube is extending straight out from the electric eye.",
            "description": "If it isn't, it could get in the way of the electronic beam and prevent the garage door from closing because the cardboard tube is breaking the beam."
        },
        {
            "headline": "Once you've determined the proper length of tube to block the sun from the electric eye you may want to go to a hardware store and invest in some plastic or rubber tubing that would be more durable and weatherproof for those rainy or snowy days.",
            "description": ""
        }
    ],
    "tyn": [
        "Cardboard Tube",
        "Cardboard tube",
        "Knife",
        "Duct tape",
        "PVC Pipe",
        "PVC pipe",
        "Hacksaw",
        "Drill",
        "Zip ties",
        "Sun Shield",
        "Garage door sensor sun shield"
    ],
    "text": " Use the inside tube from an empty roll of toilet paper, holiday wrapping paper, plastic wrap, or any cardboard tube that is large enough in diameter and flexible enough so you can bend it to the shape of the electric eye. You may have to experiment with several size tubes until you find one that fits snug enough so it won't fall off. Cut the tube to be at least 2–4 inches (5.1–10.2 cm) long. Remember, if it's too long you can always cut it shorter. Once you cut it, you can't make it longer. Squeeze the tube so it makes an oval shape instead of it's normal round shape and slip it over the body of the electric eye unit so it extends about 2–3 inches (5.1–7.6 cm) past the end of the electric eye.  Put a tube on the electric eye on each side of the garage door (one side for mornings, the other side for evenings)  Make sure the tube is extending straight out from the electric eye. If it isn't, it could get in the way of the electronic beam and prevent the garage door from closing because the cardboard tube is breaking the beam. Once you've determined the proper length of tube to block the sun from the electric eye you may want to go to a hardware store and invest in some plastic or rubber tubing that would be more durable and weatherproof for those rainy or snowy days. ",
    "sentences": [
        " Use the inside tube from an empty roll of toilet paper, holiday wrapping paper, plastic wrap, or any cardboard tube that is large enough in diameter and flexible enough so you can bend it to the shape of the electric eye.",
        "You may have to experiment with several size tubes until you find one that fits snug enough so it won't fall off.",
        "Cut the tube to be at least 2–4 inches (5.1–10.2 cm) long.",
        "Remember, if it's too long you can always cut it shorter.",
        "Once you cut it, you can't make it longer.",
        "Squeeze the tube so it makes an oval shape instead of it's normal round shape and slip it over the body of the electric eye unit so it extends about 2–3 inches (5.1–7.6 cm) past the end of the electric eye.",
        "Put a tube on the electric eye on each side of the garage door (one side for mornings, the other side for evenings)  Make sure the tube is extending straight out from the electric eye.",
        "If it isn't, it could get in the way of the electronic beam and prevent the garage door from closing because the cardboard tube is breaking the beam.",
        "Once you've determined the proper length of tube to block the sun from the electric eye you may want to go to a hardware store and invest in some plastic or rubber tubing that would be more durable and weatherproof for those rainy or snowy days."
    ]
}