{
    "title": "How to Get Rid of Warts",
    "url": "https://www.wikihow.com/Get-Rid-of-Warts",
    "category_hierarchy": [
        "Health",
        "Integumentary System Health",
        "Skin Health",
        "Skin Conditions",
        "Warts"
    ],
    "methods": [
        {
            "name": "Using Medically Verified Remedies",
            "steps": [
                {
                    "headline": "Be patient.",
                    "description": "Warts are caused by HPV (human papillomavirus) and as such, can take quite a bit of time to eliminate naturally by one's immune system. Some warts will disappear over time, without treatment. However, \"time\" could mean anywhere from a couple weeks to a couple of years, so you may wish to choose a more active method. Whichever method you choose, allow it time to work. Some methods are faster acting than others. The fastest method to removing warts permanently is using 100% TCA. With this method results are often seen in less than 10 days and are permanent. It is also the cheapest and is discussed later."
                },
                {
                    "headline": "Use salicylic acid or 100% Trichloroacetic Acid (TCA).",
                    "description": "Salicylic acid is the ingredient of most over-the-counter wart removers, including Compound W and Occlusal. It's effectiveness varies and it can take weeks for it work. Soak the skin in water for 5 minutes or longer, apply the acid liberally using the brush and let it dry. Leave it for a day. You can either peel or file it off and then file remaining dead skin. Do this every two or three days."
                },
                {
                    "headline": "Use duct tape.",
                    "description": "Several studies have tried to assess the effectiveness of duct tape in removing warts. Duct tape occlusion therapy (DTOT) is supposed to localize medication in the general wart area as well as \"choke\" the wart itself. One study found that duct tape following the application of imiquimod 5% cream was an effective treatment against the common wart. However it takes a long time (can take up to 6 months) and usually people don't see success with this."
                },
                {
                    "headline": "Apply cantharidin.",
                    "description": "Ask your doctor about using cantharidin, a fast-acting chemical that will burn away the wart. Unfortunately,  It can be really expensive, upwards of $500. There is some pain involved, but you may see results in just a day. The doctor applies cantharidin directly on the wart, then applies a bandage. The next day, the bandage is taken off and the dead skin is removed. If it doesn't work in one treatment, you may need another method—your doctor will make appropriate recommendations."
                },
                {
                    "headline": "Try liquid nitrogen.",
                    "description": "Another remedy your doctor may try is liquid nitrogen—or cryotherapy—to freeze the wart. It may cause some discomfort, and can take a few treatments to completely remove a wart, but can be very effective. If it's not then the wart will usually come back bigger with bigger blood vessels and be almost impossible to remove. Alternately, many drug stores carry OTC freeze treatments to zap the wart. If using an OTC wart freeze treatment, keep the following tips in mind:\nFollow the direction on the wart removal package. Your skin should turn from white to red in a matter of minutes, and a blister should begin to form underneath the wart. Small black dots should appear beneath the wart after a few days. This is a sign that the treatment is working. Resist the urge to pull the wart off. The wart should fall off on its own. If it doesn't, treat again after two weeks. Do not treat a wart that has been unsuccessfully treated three times; see a doctor."
                },
                {
                    "headline": "Burn the wart off.",
                    "description": "When other methods fail, burning the wart off may be what's needed. There will be some pain involved, and burning can lead to scarring, so the best recommendation it to let your doctor handle it. However, you can try this at home, if you're brave enough. See your doctor. They can use a laser to burn the wart away. This is sometimes effective, but best recommended after other methods have failed. Try it at home. Light a match, blow it out, and while the match head is still hot, touch it to the wart. This causes blistering that initiates a healing response. Peel the layer of infected skin off, and cover with aloe and a strip bandage. Repeat as necessary. Try this at your own risk. Very dangerous."
                },
                {
                    "headline": "Have your doctor cut it out.",
                    "description": "When in doubt, have your doctor remove the wart by cutting it out surgically. This is something best left to a doctor, to prevent infection, and so that a local anesthetic can be used to mitigate the pain. A doctor will either do this by:\n\nElectrosurgery and curettage. This is where the doctor burns the wart with an electrical current and cuts it out afterward. The wart may still return because the blood vessels are still intact. Laser surgery. This is where the doctor burns the wart with an intense beam of light."
                },
                {
                    "headline": "Consider immunotherapy.",
                    "description": "Your doctor will be able to counsel you on this treatment, which uses your body's own defenses to attack the wart."
                },
                {
                    "headline": "Ask your doctor about Veregen.",
                    "description": "This is a new medication that is used to treat genital warts as well as other warts."
                },
                {
                    "headline": "Use imiquimod.",
                    "description": "This is a topical cream that is used to treat some types of warts and skin cancers by stimulating an immune response. It does not cure warts, but it may help, in concert with other treatments. Ask your doctor for guidance."
                }
            ]
        },
        {
            "name": "Using Unverified Home Remedies",
            "steps": [
                {
                    "headline": "Encourage antibodies.",
                    "description": "Ice the wart, then sterilize a needle and poke deep into the wart several times, taking care to penetrate every layer of skin in the wart. By introducing the virus to your bloodstream, you help your body see the wart and fight against it, which can lead to its disappearance from your body. This method is very effective for some people, especially for those with several warts, as even the poking of one wart on your body can help your body discover the others and destroy the warts naturally."
                },
                {
                    "headline": "Cover it in vitamin C. Crush a vitamin C tablet and add water to make a thick paste.",
                    "description": "Apply it to the wart and then cover it with a bandage.Leave it on for the day then at night let it breathe (take off bandage)"
                },
                {
                    "headline": "Wrap it in vitamin E. Break a vitamin E capsule and rub a little of the oil on the wart.",
                    "description": "Cover it with an adhesive bandage. Remove the bandage at night to let it breathe, then start over with the oil in the morning. Repeat three times a day."
                },
                {
                    "headline": "Use hot water and pumice.",
                    "description": "Soak the wart in hot water until it softens. Scrape it down with a piece of coarse exfoliating pumice until you reach level with the skin. Take bleach on a cotton swab and hold it against the wart for 15 minutes (this may sting a bit). You must wash the area well after applying bleach."
                },
                {
                    "headline": "Apply tea tree oil.",
                    "description": "Dab a little on the wart and cover with a strip bandage. Do this for up to three weeks."
                },
                {
                    "headline": "Try castor oil.",
                    "description": "The acid in castor oil irritates the wart and works best on small, flat warts on the face and back of hands. Apply castor oil to the wart with a cotton swab twice a day."
                },
                {
                    "headline": "Use aspirin.",
                    "description": "Take a few aspirins and crunch them up, adding a few drops of water. Take the mixture and put it onto the effected wart areas, then apply an adhesive bandage.. Leave on overnight. Aspirin is the ingestible form of salicylic acid, but much cheaper than most commercial lotions."
                },
                {
                    "headline": "Try some Betadine (iodine).",
                    "description": "Also called iodine, apply the Betadine to the wart and cover with a bandage and leave for one or two days then refresh bandage."
                },
                {
                    "headline": "Put toothpaste on the wart and apply an adhesive bandage.",
                    "description": "Leave for a day and repeat until the wart is gone."
                }
            ]
        },
        {
            "name": "Using Unverified Food Remedies",
            "steps": [
                {
                    "headline": "Use a citrus peel.",
                    "description": "Cut a section of lemon or lime peel slightly larger than the wart and tape it over with an adhesive bandage or tape. Refresh the peel every day or so and keep the wart covered for as long as possible. After about a week or so, the entire wart will come out completely."
                },
                {
                    "headline": "Use basil.",
                    "description": "Tape crushed, fresh basil to your wart using waterproof first-aid tape. Do this daily for up to a week. The virus-killing compound in the basil leaf will kill your wart."
                },
                {
                    "headline": "Take garlic capsules.",
                    "description": "Do this twice a day for at least several weeks. Warts should start peeling off in one or two weeks, but take the garlic until the wart disappears. You can also cover the wart with garlic oil once or twice daily for a month."
                },
                {
                    "headline": "Eat immune system-strengthening foods.",
                    "description": "Garlic, sweet potatoes, whole-grain breads, sunflower seeds and rice are all examples of this."
                },
                {
                    "headline": "Cut up carrots.",
                    "description": "Finely grate a carrot and add enough olive oil to it to make a paste. Dab the paste on your wart twice daily for 30 minutes. Do this for two to three weeks."
                },
                {
                    "headline": "Make a fig mask.",
                    "description": "Mash up a fresh fig and place some on your wart for 30 minutes. Do this daily for two to three weeks."
                },
                {
                    "headline": "Use lemon juice.",
                    "description": "Squeeze lemon juice on your wart, then cover it with fresh, chopped onions. Do this for 30 minutes once a day for two to three weeks."
                },
                {
                    "headline": "Put it in pineapple juice.",
                    "description": "Soak your wart in pineapple juice. It has a dissolving enzyme."
                },
                {
                    "headline": "Rub daily with the inside of a banana peel.",
                    "description": "The potassium may help speed the disappearance of the wart."
                },
                {
                    "headline": "Bind your wart with a banana peel.",
                    "description": "Cut out a section of the peel so it's slightly smaller than the tape you'll be using. Rub the inside of a banana peel onto the wart and then secure with duct tape. Keep it on the wart for a day before removing. Repeat until wart is fully removed."
                },
                {
                    "headline": "Create a preparation of curcumin.",
                    "description": "Curcumin is a turmeric extract that can be found in health food stores. Combine curcumin, papaya extract (Papain. It may have to be purchased in pill form and crushed into powder), and vitamin E oil. Dab the wart and surrounding area with alcoholic extract of golden seal. This will stimulate local immune activity. Take a sharp needle or pin and dip it into the curcumin paste. Press the needle as deep into the wart as possible. Continue injecting more of the paste into the wart, poking several holes if necessary. Spread the remaining paste over the wart area and cover with medical tape. This technique is effective against flat warts, which are found on the face and hands. Flat warts are notoriously stubborn and will often remain on the skin after the body has acquired resistance to the virus. This will finish the warts off in lieu of freezing."
                },
                {
                    "headline": "Use apple cider vinegar.",
                    "description": "Take a cotton ball (only enough to cover the wart) and soak it in the vinegar. Secure with a band aid overnight. Keep in mind that this might be very painful. Change the cotton pad daily and keep it on every night if you can. After one week, the body of the wart will start to peel off and you can gently scrape it away to reveal healthy flesh beneath. Let the area heal once this is done."
                }
            ]
        },
        {
            "name": "Trying Gentler Methods for Removal",
            "steps": [
                {
                    "headline": "Use warm water and sea salt.",
                    "description": "Soak the wart for 10 to 15 minutes in warm salt water to moisten the skin. Scrape the dead skin layers off the wart using a nail file, pumice stone or mild sandpaper. You could also use your fingers, but wash them thoroughly before and after, as warts can easily spread. Moisten the wart and apply a large flake of sea salt to it. Put a band-aid or tape over the wart to hold the salt in place and observe for several days, replacing it after you shower or if it falls off."
                },
                {
                    "headline": "Mix up baking powder.",
                    "description": "Mix baking powder and castor oil into a paste, then apply it to the wart at night by covering it with a bandage. Remove the bandage the next morning. Repeat as necessary."
                },
                {
                    "headline": "Use hot water.",
                    "description": "Soaking plantar warts in very hot water is helpful because it softens the wart and may kill the virus. Make sure the water is not hot enough to cause burns—keep it under 140°F (60°C)."
                },
                {
                    "headline": "Apply dandelion sap.",
                    "description": "Pick a fresh dandelion and Break the stem. Apply the milky sap that oozes from the stem onto the wart. Repeat this three or four times a day. Scrape the wart with pumice to remove dead layers of skin. Continue doing this until the wart fades away."
                }
            ]
        },
        {
            "name": "Causes and Types of Warts",
            "steps": [
                {
                    "headline": "Avoid touching warts as much as possible.",
                    "description": "Warts are small growths on the body, and are caused by the human papilloma virus (HPV), and can spread to other parts of your body. It's also possible to spread the HPV virus to others through cuts, open sores, or sexual activities."
                },
                {
                    "headline": "Learn the different wart types.",
                    "description": "They come in various shapes and sizes, and usually present themselves as a raised round or oval growth on the skin. Common warts. These can appear anywhere on the body. Most often they are seen on the hands. They are rough in appearance, rounded, and are grayish-brown. Flat warts. These are usually found on the face, legs, and arms. They are small, flat (as the name implies), and can be spread by shaving. Plantar warts. These grow on the soles of your feet, and look like thick patches of skin with dark speckles. They can be extremely painful. Genital warts. These are found on and around the genital region, between the thighs, and can also appear in the vagina and anus. Subungual and periungual warts. These appear under fingernails and toenails. They are rough bumps with an uneven surface. Filiform warts. These generally appear around the mouth and nose. They are skin-colored, and have thready growths sticking out of them."
                }
            ]
        }
    ],
    "tyn": [
        "Sea salt",
        "Wart remover",
        "Duct tape",
        "Garlic capsules",
        "Banana peel",
        "Apple cider vinegar",
        "Cotton wool/swab",
        "Adhesive strip bandages",
        "Book of matches",
        "Alcohol or vinegar"
    ],
    "text": " Using Medically Verified Remedies Be patient. Warts are caused by HPV (human papillomavirus) and as such, can take quite a bit of time to eliminate naturally by one's immune system. Some warts will disappear over time, without treatment. However, \"time\" could mean anywhere from a couple weeks to a couple of years, so you may wish to choose a more active method. Whichever method you choose, allow it time to work. Some methods are faster acting than others. The fastest method to removing warts permanently is using 100% TCA. With this method results are often seen in less than 10 days and are permanent. It is also the cheapest and is discussed later. Use salicylic acid or 100% Trichloroacetic Acid (TCA). Salicylic acid is the ingredient of most over-the-counter wart removers, including Compound W and Occlusal. It's effectiveness varies and it can take weeks for it work. Soak the skin in water for 5 minutes or longer, apply the acid liberally using the brush and let it dry. Leave it for a day. You can either peel or file it off and then file remaining dead skin. Do this every two or three days. Use duct tape. Several studies have tried to assess the effectiveness of duct tape in removing warts. Duct tape occlusion therapy (DTOT) is supposed to localize medication in the general wart area as well as \"choke\" the wart itself. One study found that duct tape following the application of imiquimod 5% cream was an effective treatment against the common wart. However it takes a long time (can take up to 6 months) and usually people don't see success with this. Apply cantharidin. Ask your doctor about using cantharidin, a fast-acting chemical that will burn away the wart. Unfortunately,  It can be really expensive, upwards of $500. There is some pain involved, but you may see results in just a day. The doctor applies cantharidin directly on the wart, then applies a bandage. The next day, the bandage is taken off and the dead skin is removed. If it doesn't work in one treatment, you may need another method—your doctor will make appropriate recommendations. Try liquid nitrogen. Another remedy your doctor may try is liquid nitrogen—or cryotherapy—to freeze the wart. It may cause some discomfort, and can take a few treatments to completely remove a wart, but can be very effective. If it's not then the wart will usually come back bigger with bigger blood vessels and be almost impossible to remove. Alternately, many drug stores carry OTC freeze treatments to zap the wart. If using an OTC wart freeze treatment, keep the following tips in mind:\nFollow the direction on the wart removal package. Your skin should turn from white to red in a matter of minutes, and a blister should begin to form underneath the wart. Small black dots should appear beneath the wart after a few days. This is a sign that the treatment is working. Resist the urge to pull the wart off. The wart should fall off on its own. If it doesn't, treat again after two weeks. Do not treat a wart that has been unsuccessfully treated three times; see a doctor. Burn the wart off. When other methods fail, burning the wart off may be what's needed. There will be some pain involved, and burning can lead to scarring, so the best recommendation it to let your doctor handle it. However, you can try this at home, if you're brave enough. See your doctor. They can use a laser to burn the wart away. This is sometimes effective, but best recommended after other methods have failed. Try it at home. Light a match, blow it out, and while the match head is still hot, touch it to the wart. This causes blistering that initiates a healing response. Peel the layer of infected skin off, and cover with aloe and a strip bandage. Repeat as necessary. Try this at your own risk. Very dangerous. Have your doctor cut it out. When in doubt, have your doctor remove the wart by cutting it out surgically. This is something best left to a doctor, to prevent infection, and so that a local anesthetic can be used to mitigate the pain. A doctor will either do this by:\n\nElectrosurgery and curettage. This is where the doctor burns the wart with an electrical current and cuts it out afterward. The wart may still return because the blood vessels are still intact. Laser surgery. This is where the doctor burns the wart with an intense beam of light. Consider immunotherapy. Your doctor will be able to counsel you on this treatment, which uses your body's own defenses to attack the wart. Ask your doctor about Veregen. This is a new medication that is used to treat genital warts as well as other warts. Use imiquimod. This is a topical cream that is used to treat some types of warts and skin cancers by stimulating an immune response. It does not cure warts, but it may help, in concert with other treatments. Ask your doctor for guidance. Using Unverified Home Remedies Encourage antibodies. Ice the wart, then sterilize a needle and poke deep into the wart several times, taking care to penetrate every layer of skin in the wart. By introducing the virus to your bloodstream, you help your body see the wart and fight against it, which can lead to its disappearance from your body. This method is very effective for some people, especially for those with several warts, as even the poking of one wart on your body can help your body discover the others and destroy the warts naturally. Cover it in vitamin C. Crush a vitamin C tablet and add water to make a thick paste. Apply it to the wart and then cover it with a bandage.Leave it on for the day then at night let it breathe (take off bandage) Wrap it in vitamin E. Break a vitamin E capsule and rub a little of the oil on the wart. Cover it with an adhesive bandage. Remove the bandage at night to let it breathe, then start over with the oil in the morning. Repeat three times a day. Use hot water and pumice. Soak the wart in hot water until it softens. Scrape it down with a piece of coarse exfoliating pumice until you reach level with the skin. Take bleach on a cotton swab and hold it against the wart for 15 minutes (this may sting a bit). You must wash the area well after applying bleach. Apply tea tree oil. Dab a little on the wart and cover with a strip bandage. Do this for up to three weeks. Try castor oil. The acid in castor oil irritates the wart and works best on small, flat warts on the face and back of hands. Apply castor oil to the wart with a cotton swab twice a day. Use aspirin. Take a few aspirins and crunch them up, adding a few drops of water. Take the mixture and put it onto the effected wart areas, then apply an adhesive bandage.. Leave on overnight. Aspirin is the ingestible form of salicylic acid, but much cheaper than most commercial lotions. Try some Betadine (iodine). Also called iodine, apply the Betadine to the wart and cover with a bandage and leave for one or two days then refresh bandage. Put toothpaste on the wart and apply an adhesive bandage. Leave for a day and repeat until the wart is gone. Using Unverified Food Remedies Use a citrus peel. Cut a section of lemon or lime peel slightly larger than the wart and tape it over with an adhesive bandage or tape. Refresh the peel every day or so and keep the wart covered for as long as possible. After about a week or so, the entire wart will come out completely. Use basil. Tape crushed, fresh basil to your wart using waterproof first-aid tape. Do this daily for up to a week. The virus-killing compound in the basil leaf will kill your wart. Take garlic capsules. Do this twice a day for at least several weeks. Warts should start peeling off in one or two weeks, but take the garlic until the wart disappears. You can also cover the wart with garlic oil once or twice daily for a month. Eat immune system-strengthening foods. Garlic, sweet potatoes, whole-grain breads, sunflower seeds and rice are all examples of this. Cut up carrots. Finely grate a carrot and add enough olive oil to it to make a paste. Dab the paste on your wart twice daily for 30 minutes. Do this for two to three weeks. Make a fig mask. Mash up a fresh fig and place some on your wart for 30 minutes. Do this daily for two to three weeks. Use lemon juice. Squeeze lemon juice on your wart, then cover it with fresh, chopped onions. Do this for 30 minutes once a day for two to three weeks. Put it in pineapple juice. Soak your wart in pineapple juice. It has a dissolving enzyme. Rub daily with the inside of a banana peel. The potassium may help speed the disappearance of the wart. Bind your wart with a banana peel. Cut out a section of the peel so it's slightly smaller than the tape you'll be using. Rub the inside of a banana peel onto the wart and then secure with duct tape. Keep it on the wart for a day before removing. Repeat until wart is fully removed. Create a preparation of curcumin. Curcumin is a turmeric extract that can be found in health food stores. Combine curcumin, papaya extract (Papain. It may have to be purchased in pill form and crushed into powder), and vitamin E oil. Dab the wart and surrounding area with alcoholic extract of golden seal. This will stimulate local immune activity. Take a sharp needle or pin and dip it into the curcumin paste. Press the needle as deep into the wart as possible. Continue injecting more of the paste into the wart, poking several holes if necessary. Spread the remaining paste over the wart area and cover with medical tape. This technique is effective against flat warts, which are found on the face and hands. Flat warts are notoriously stubborn and will often remain on the skin after the body has acquired resistance to the virus. This will finish the warts off in lieu of freezing. Use apple cider vinegar. Take a cotton ball (only enough to cover the wart) and soak it in the vinegar. Secure with a band aid overnight. Keep in mind that this might be very painful. Change the cotton pad daily and keep it on every night if you can. After one week, the body of the wart will start to peel off and you can gently scrape it away to reveal healthy flesh beneath. Let the area heal once this is done. Trying Gentler Methods for Removal Use warm water and sea salt. Soak the wart for 10 to 15 minutes in warm salt water to moisten the skin. Scrape the dead skin layers off the wart using a nail file, pumice stone or mild sandpaper. You could also use your fingers, but wash them thoroughly before and after, as warts can easily spread. Moisten the wart and apply a large flake of sea salt to it. Put a band-aid or tape over the wart to hold the salt in place and observe for several days, replacing it after you shower or if it falls off. Mix up baking powder. Mix baking powder and castor oil into a paste, then apply it to the wart at night by covering it with a bandage. Remove the bandage the next morning. Repeat as necessary. Use hot water. Soaking plantar warts in very hot water is helpful because it softens the wart and may kill the virus. Make sure the water is not hot enough to cause burns—keep it under 140°F (60°C). Apply dandelion sap. Pick a fresh dandelion and Break the stem. Apply the milky sap that oozes from the stem onto the wart. Repeat this three or four times a day. Scrape the wart with pumice to remove dead layers of skin. Continue doing this until the wart fades away. Causes and Types of Warts Avoid touching warts as much as possible. Warts are small growths on the body, and are caused by the human papilloma virus (HPV), and can spread to other parts of your body. It's also possible to spread the HPV virus to others through cuts, open sores, or sexual activities. Learn the different wart types. They come in various shapes and sizes, and usually present themselves as a raised round or oval growth on the skin. Common warts. These can appear anywhere on the body. Most often they are seen on the hands. They are rough in appearance, rounded, and are grayish-brown. Flat warts. These are usually found on the face, legs, and arms. They are small, flat (as the name implies), and can be spread by shaving. Plantar warts. These grow on the soles of your feet, and look like thick patches of skin with dark speckles. They can be extremely painful. Genital warts. These are found on and around the genital region, between the thighs, and can also appear in the vagina and anus. Subungual and periungual warts. These appear under fingernails and toenails. They are rough bumps with an uneven surface. Filiform warts. These generally appear around the mouth and nose. They are skin-colored, and have thready growths sticking out of them.",
    "sentences": [
        " Using Medically Verified Remedies Be patient.",
        "Warts are caused by HPV (human papillomavirus) and as such, can take quite a bit of time to eliminate naturally by one's immune system.",
        "Some warts will disappear over time, without treatment.",
        "However, \"time\" could mean anywhere from a couple weeks to a couple of years, so you may wish to choose a more active method.",
        "Whichever method you choose, allow it time to work.",
        "Some methods are faster acting than others.",
        "The fastest method to removing warts permanently is using 100% TCA.",
        "With this method results are often seen in less than 10 days and are permanent.",
        "It is also the cheapest and is discussed later.",
        "Use salicylic acid or 100% Trichloroacetic Acid (TCA).",
        "Salicylic acid is the ingredient of most over-the-counter wart removers, including Compound W and Occlusal.",
        "It's effectiveness varies and it can take weeks for it work.",
        "Soak the skin in water for 5 minutes or longer, apply the acid liberally using the brush and let it dry.",
        "Leave it for a day.",
        "You can either peel or file it off and then file remaining dead skin.",
        "Do this every two or three days.",
        "Use duct tape.",
        "Several studies have tried to assess the effectiveness of duct tape in removing warts.",
        "Duct tape occlusion therapy (DTOT) is supposed to localize medication in the general wart area as well as \"choke\" the wart itself.",
        "One study found that duct tape following the application of imiquimod 5% cream was an effective treatment against the common wart.",
        "However it takes a long time (can take up to 6 months) and usually people don't see success with this.",
        "Apply cantharidin.",
        "Ask your doctor about using cantharidin, a fast-acting chemical that will burn away the wart.",
        "Unfortunately,  It can be really expensive, upwards of $500.",
        "There is some pain involved, but you may see results in just a day.",
        "The doctor applies cantharidin directly on the wart, then applies a bandage.",
        "The next day, the bandage is taken off and the dead skin is removed.",
        "If it doesn't work in one treatment, you may need another method—your doctor will make appropriate recommendations.",
        "Try liquid nitrogen.",
        "Another remedy your doctor may try is liquid nitrogen—or cryotherapy—to freeze the wart.",
        "It may cause some discomfort, and can take a few treatments to completely remove a wart, but can be very effective.",
        "If it's not then the wart will usually come back bigger with bigger blood vessels and be almost impossible to remove.",
        "Alternately, many drug stores carry OTC freeze treatments to zap the wart.",
        "If using an OTC wart freeze treatment, keep the following tips in mind:\nFollow the direction on the wart removal package.",
        "Your skin should turn from white to red in a matter of minutes, and a blister should begin to form underneath the wart.",
        "Small black dots should appear beneath the wart after a few days.",
        "This is a sign that the treatment is working.",
        "Resist the urge to pull the wart off.",
        "The wart should fall off on its own.",
        "If it doesn't, treat again after two weeks.",
        "Do not treat a wart that has been unsuccessfully treated three times; see a doctor.",
        "Burn the wart off.",
        "When other methods fail, burning the wart off may be what's needed.",
        "There will be some pain involved, and burning can lead to scarring, so the best recommendation it to let your doctor handle it.",
        "However, you can try this at home, if you're brave enough.",
        "See your doctor.",
        "They can use a laser to burn the wart away.",
        "This is sometimes effective, but best recommended after other methods have failed.",
        "Try it at home.",
        "Light a match, blow it out, and while the match head is still hot, touch it to the wart.",
        "This causes blistering that initiates a healing response.",
        "Peel the layer of infected skin off, and cover with aloe and a strip bandage.",
        "Repeat as necessary.",
        "Try this at your own risk.",
        "Very dangerous.",
        "Have your doctor cut it out.",
        "When in doubt, have your doctor remove the wart by cutting it out surgically.",
        "This is something best left to a doctor, to prevent infection, and so that a local anesthetic can be used to mitigate the pain.",
        "A doctor will either do this by:\n\nElectrosurgery and curettage.",
        "This is where the doctor burns the wart with an electrical current and cuts it out afterward.",
        "The wart may still return because the blood vessels are still intact.",
        "Laser surgery.",
        "This is where the doctor burns the wart with an intense beam of light.",
        "Consider immunotherapy.",
        "Your doctor will be able to counsel you on this treatment, which uses your body's own defenses to attack the wart.",
        "Ask your doctor about Veregen.",
        "This is a new medication that is used to treat genital warts as well as other warts.",
        "Use imiquimod.",
        "This is a topical cream that is used to treat some types of warts and skin cancers by stimulating an immune response.",
        "It does not cure warts, but it may help, in concert with other treatments.",
        "Ask your doctor for guidance.",
        "Using Unverified Home Remedies Encourage antibodies.",
        "Ice the wart, then sterilize a needle and poke deep into the wart several times, taking care to penetrate every layer of skin in the wart.",
        "By introducing the virus to your bloodstream, you help your body see the wart and fight against it, which can lead to its disappearance from your body.",
        "This method is very effective for some people, especially for those with several warts, as even the poking of one wart on your body can help your body discover the others and destroy the warts naturally.",
        "Cover it in vitamin C. Crush a vitamin C tablet and add water to make a thick paste.",
        "Apply it to the wart and then cover it with a bandage.Leave it on for the day then at night let it breathe (take off bandage) Wrap it in vitamin E. Break a vitamin E capsule and rub a little of the oil on the wart.",
        "Cover it with an adhesive bandage.",
        "Remove the bandage at night to let it breathe, then start over with the oil in the morning.",
        "Repeat three times a day.",
        "Use hot water and pumice.",
        "Soak the wart in hot water until it softens.",
        "Scrape it down with a piece of coarse exfoliating pumice until you reach level with the skin.",
        "Take bleach on a cotton swab and hold it against the wart for 15 minutes (this may sting a bit).",
        "You must wash the area well after applying bleach.",
        "Apply tea tree oil.",
        "Dab a little on the wart and cover with a strip bandage.",
        "Do this for up to three weeks.",
        "Try castor oil.",
        "The acid in castor oil irritates the wart and works best on small, flat warts on the face and back of hands.",
        "Apply castor oil to the wart with a cotton swab twice a day.",
        "Use aspirin.",
        "Take a few aspirins and crunch them up, adding a few drops of water.",
        "Take the mixture and put it onto the effected wart areas, then apply an adhesive bandage.. Leave on overnight.",
        "Aspirin is the ingestible form of salicylic acid, but much cheaper than most commercial lotions.",
        "Try some Betadine (iodine).",
        "Also called iodine, apply the Betadine to the wart and cover with a bandage and leave for one or two days then refresh bandage.",
        "Put toothpaste on the wart and apply an adhesive bandage.",
        "Leave for a day and repeat until the wart is gone.",
        "Using Unverified Food Remedies Use a citrus peel.",
        "Cut a section of lemon or lime peel slightly larger than the wart and tape it over with an adhesive bandage or tape.",
        "Refresh the peel every day or so and keep the wart covered for as long as possible.",
        "After about a week or so, the entire wart will come out completely.",
        "Use basil.",
        "Tape crushed, fresh basil to your wart using waterproof first-aid tape.",
        "Do this daily for up to a week.",
        "The virus-killing compound in the basil leaf will kill your wart.",
        "Take garlic capsules.",
        "Do this twice a day for at least several weeks.",
        "Warts should start peeling off in one or two weeks, but take the garlic until the wart disappears.",
        "You can also cover the wart with garlic oil once or twice daily for a month.",
        "Eat immune system-strengthening foods.",
        "Garlic, sweet potatoes, whole-grain breads, sunflower seeds and rice are all examples of this.",
        "Cut up carrots.",
        "Finely grate a carrot and add enough olive oil to it to make a paste.",
        "Dab the paste on your wart twice daily for 30 minutes.",
        "Do this for two to three weeks.",
        "Make a fig mask.",
        "Mash up a fresh fig and place some on your wart for 30 minutes.",
        "Do this daily for two to three weeks.",
        "Use lemon juice.",
        "Squeeze lemon juice on your wart, then cover it with fresh, chopped onions.",
        "Do this for 30 minutes once a day for two to three weeks.",
        "Put it in pineapple juice.",
        "Soak your wart in pineapple juice.",
        "It has a dissolving enzyme.",
        "Rub daily with the inside of a banana peel.",
        "The potassium may help speed the disappearance of the wart.",
        "Bind your wart with a banana peel.",
        "Cut out a section of the peel so it's slightly smaller than the tape you'll be using.",
        "Rub the inside of a banana peel onto the wart and then secure with duct tape.",
        "Keep it on the wart for a day before removing.",
        "Repeat until wart is fully removed.",
        "Create a preparation of curcumin.",
        "Curcumin is a turmeric extract that can be found in health food stores.",
        "Combine curcumin, papaya extract (Papain.",
        "It may have to be purchased in pill form and crushed into powder), and vitamin E oil.",
        "Dab the wart and surrounding area with alcoholic extract of golden seal.",
        "This will stimulate local immune activity.",
        "Take a sharp needle or pin and dip it into the curcumin paste.",
        "Press the needle as deep into the wart as possible.",
        "Continue injecting more of the paste into the wart, poking several holes if necessary.",
        "Spread the remaining paste over the wart area and cover with medical tape.",
        "This technique is effective against flat warts, which are found on the face and hands.",
        "Flat warts are notoriously stubborn and will often remain on the skin after the body has acquired resistance to the virus.",
        "This will finish the warts off in lieu of freezing.",
        "Use apple cider vinegar.",
        "Take a cotton ball (only enough to cover the wart) and soak it in the vinegar.",
        "Secure with a band aid overnight.",
        "Keep in mind that this might be very painful.",
        "Change the cotton pad daily and keep it on every night if you can.",
        "After one week, the body of the wart will start to peel off and you can gently scrape it away to reveal healthy flesh beneath.",
        "Let the area heal once this is done.",
        "Trying Gentler Methods for Removal Use warm water and sea salt.",
        "Soak the wart for 10 to 15 minutes in warm salt water to moisten the skin.",
        "Scrape the dead skin layers off the wart using a nail file, pumice stone or mild sandpaper.",
        "You could also use your fingers, but wash them thoroughly before and after, as warts can easily spread.",
        "Moisten the wart and apply a large flake of sea salt to it.",
        "Put a band-aid or tape over the wart to hold the salt in place and observe for several days, replacing it after you shower or if it falls off.",
        "Mix up baking powder.",
        "Mix baking powder and castor oil into a paste, then apply it to the wart at night by covering it with a bandage.",
        "Remove the bandage the next morning.",
        "Repeat as necessary.",
        "Use hot water.",
        "Soaking plantar warts in very hot water is helpful because it softens the wart and may kill the virus.",
        "Make sure the water is not hot enough to cause burns—keep it under 140°F (60°C).",
        "Apply dandelion sap.",
        "Pick a fresh dandelion and Break the stem.",
        "Apply the milky sap that oozes from the stem onto the wart.",
        "Repeat this three or four times a day.",
        "Scrape the wart with pumice to remove dead layers of skin.",
        "Continue doing this until the wart fades away.",
        "Causes and Types of Warts Avoid touching warts as much as possible.",
        "Warts are small growths on the body, and are caused by the human papilloma virus (HPV), and can spread to other parts of your body.",
        "It's also possible to spread the HPV virus to others through cuts, open sores, or sexual activities.",
        "Learn the different wart types.",
        "They come in various shapes and sizes, and usually present themselves as a raised round or oval growth on the skin.",
        "Common warts.",
        "These can appear anywhere on the body.",
        "Most often they are seen on the hands.",
        "They are rough in appearance, rounded, and are grayish-brown.",
        "Flat warts.",
        "These are usually found on the face, legs, and arms.",
        "They are small, flat (as the name implies), and can be spread by shaving.",
        "Plantar warts.",
        "These grow on the soles of your feet, and look like thick patches of skin with dark speckles.",
        "They can be extremely painful.",
        "Genital warts.",
        "These are found on and around the genital region, between the thighs, and can also appear in the vagina and anus.",
        "Subungual and periungual warts.",
        "These appear under fingernails and toenails.",
        "They are rough bumps with an uneven surface.",
        "Filiform warts.",
        "These generally appear around the mouth and nose.",
        "They are skin-colored, and have thready growths sticking out of them."
    ]
}