{
    "title": "How to Use a VIN Number to Check a Car's Options",
    "url": "https://www.wikihow.com/Use-a-VIN-Number-to-Check-a-Car%27s-Options",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars"
    ],
    "methods": [
        {
            "name": "Locating the VIN",
            "steps": [
                {
                    "headline": "Find the VIN on the car, if you have access to it.",
                    "description": "Most vehicles have the VIN etched or in the form of a sticker on at least two parts of the car. Look for the VIN on:\nThe driver’s side in the door jamb\nThe driver’s side dash board\nMetal within the engine compartment\nParts of car that can’t be removed"
                },
                {
                    "headline": "Look for the VIN on paperwork associated with the car.",
                    "description": "While you should be able to find the VIN on the actual car, it might be easier to find it on the car’s paperwork. This will come in handy if you don’t physically have the car, but have some paperwork associated with it. Look on the:\nTitle\nRegistration\nRepair records"
                },
                {
                    "headline": "Ask the seller for the VIN.",
                    "description": "If you don’t own the car yet and can’t access it, you can ask the seller of the car for the VIN. The seller will be able to find the VIN just like you could – through paperwork or by looking on the body of the car. Make sure the seller provides you with the entire 17-digit VIN number before you commit to buying the vehicle. The seller should happily give you the number so that you can do an independent vehicle history search. If they don’t, they may be hiding something."
                }
            ]
        },
        {
            "name": "Using VIN Decoding Websites",
            "steps": [
                {
                    "headline": "Find a website to give you details about the car.",
                    "description": "There are a variety of websites that offer VIN lookup services on the website. These websites will ask you to enter a car’s VIN, and then will supply you with information about the car’s options. Run an internet search for “free VIN lookup.”\nThere are websites that provide free VIN lookup services. For example, try: https://www.northamericanmotoring.com/forums/vindecoder.php\n\nWhile some free VIN report services provide every detail of a car’s options, others do not. Some websites offer an advanced search for a fee."
                },
                {
                    "headline": "Enter your VIN.",
                    "description": "After you’ve found a website where you can look up your VIN, enter it in full. This is the most important step, and you need to follow the website’s directions. If you don’t, your search might work or it might return incorrect data. Follow the directions on the website and then press \"search.\" Some websites may ask you to omit certain parts of the VIN number."
                },
                {
                    "headline": "Review the VIN detail report.",
                    "description": "After submitting the VIN number, you’ll get a report back. The report will detail the specifications of the car as it was produced by the manufacturer. The VIN report should include options, such as the transmission, the trim, and emissions specifications. The VIN report should include anything that was changed in the production process. VIN detail reports may not include options added after manufacturer, added at the dealership, or added by the consumer after the initial sale. Depending on the website, you may need to pay a fee for your VIN report."
                }
            ]
        },
        {
            "name": "Decoding the VIN",
            "steps": [
                {
                    "headline": "Visit the manufacturer’s website.",
                    "description": "Once you’ve got the VIN number, you should log on to the internet and visit the manufacturer’s website. The carmaker’s website will contain resources that will help you decode the VIN and understand what each number means. Find the VIN decoder or search section of the website. Almost all manufacturers have a VIN decoder or similar tool on their website. Search through the tabs or search bar for \"VIN decoder\" or \"VIN search.\" Click on the page or .pdf file that gives you information about decoding the VIN. For example, visit estore.honda.com/honda/parts/use-your-vehicle-vin.asp."
                },
                {
                    "headline": "Look at the world manufacturer identifier.",
                    "description": "The world manufacturer identifiers are the first 3 letters or numbers at the beginning of the VIN. This will give you information about the type of vehicle and where it was produced. The first number/letter tells the region the car was manufactured in, for example, “North America.”\nThe second number tells the country. The third number tells the type of vehicle, for example “light truck.”\nMany different vehicles will share their first 3 numbers/letters."
                },
                {
                    "headline": "Identify the second sequence of numbers.",
                    "description": "The second sequence, numbers and letters 4 through 8, tell you more information about manufacturer options. By decoding these numbers, you’ll learn about the features the vehicle was manufactured with. These numbers will tell you info about the:\nEngine\nModel\nBody style."
                },
                {
                    "headline": "Skip the ninth digit.",
                    "description": "This is the digit used to verify that it is not a fraudulent VIN. It cannot be used to find information about the car. If you suspect the vehicle has a fake VIN number, contact the manufacturer. To decode this number, you may have to bring your car into a dealership."
                },
                {
                    "headline": "View the tenth digit.",
                    "description": "The tenth digit will tell you the model year of the vehicle. This is important to knowing the options on the vehicle, as different model years are equipped with different option group packages. This does not indicate what year the car was built. For example, if the car was a 2010 Chevrolet Equinox, it might have been constructed in late 2009\nThis information should also be available in the vehicle’s manual or on other paperwork associated with the car."
                },
                {
                    "headline": "Find the last 7 digits.",
                    "description": "Along with the second sequence of numbers, these last digits are perhaps the most important for finding the options of the vehicle. They will give you all the car specific information you’re looking for. You’ll only be able to decode this information on the car manufacturer’s website. These numbers should give you information like that listed on the original sticker of the car. The numbers will also tell you what specific plant the vehicle was built as well as production specific information."
                },
                {
                    "headline": "Read about common options.",
                    "description": "While manufacturers use different codes to represent different options, the information encoded in the last 7 digits of your VIN number will provide specifics about a number of options. These numbers will give you info about common options like:\nTrim color\nPower seats and windows\nEntertainment system\nSeat covering material\nSunroof\nEquipment packages like off road or towing"
                }
            ]
        },
        {
            "name": "Purchasing a Vehicle History Report",
            "steps": [
                {
                    "headline": "Submit your VIN to a third-party website.",
                    "description": "There are several companies that compile and sell vehicle history reports. A vehicle history report is a comprehensive history that includes data on a vehicle’s manufacture, sales, and sometimes repair information. Try websites like:\nCarfax\nAutocheck"
                },
                {
                    "headline": "Pay a fee.",
                    "description": "After submitting your VIN, the third-party website may prompt you to pay a fee for a complete vehicle history report. While you may not want to pay, it is standard for companies to charge for this service. Feel free to shop around. Different websites or companies may offer different prices. In addition, some companies may run promos on vehicle history reports at different times. Fees normally range from between $20 to $40 to receive a full vehicle history report. Some websites may provide cheaper rates per report if you want several vehicle history reports. For example, you may be able to get 5 reports for $59.99."
                },
                {
                    "headline": "Examine the report.",
                    "description": "Once you get your report back, you’ll need to take a good look at it so you can get a good idea of the car’s history, options, and other information. When reading the report:\nVerify the report matches the VIN you submitted. Read about the car's production and the vehicle's repair and registration history in the report. Look to see if the vehicle has been repaired or if the report shows any evidence of aftermarket upgrades."
                }
            ]
        }
    ],
    "tyn": [
        "Vehicle Identification Number (VIN)",
        "Manufacturer's website",
        "$20 to $40 fee for a vehicle history report"
    ],
    "text": " Locating the VIN Find the VIN on the car, if you have access to it. Most vehicles have the VIN etched or in the form of a sticker on at least two parts of the car. Look for the VIN on:\nThe driver’s side in the door jamb\nThe driver’s side dash board\nMetal within the engine compartment\nParts of car that can’t be removed Look for the VIN on paperwork associated with the car. While you should be able to find the VIN on the actual car, it might be easier to find it on the car’s paperwork. This will come in handy if you don’t physically have the car, but have some paperwork associated with it. Look on the:\nTitle\nRegistration\nRepair records Ask the seller for the VIN. If you don’t own the car yet and can’t access it, you can ask the seller of the car for the VIN. The seller will be able to find the VIN just like you could – through paperwork or by looking on the body of the car. Make sure the seller provides you with the entire 17-digit VIN number before you commit to buying the vehicle. The seller should happily give you the number so that you can do an independent vehicle history search. If they don’t, they may be hiding something. Using VIN Decoding Websites Find a website to give you details about the car. There are a variety of websites that offer VIN lookup services on the website. These websites will ask you to enter a car’s VIN, and then will supply you with information about the car’s options. Run an internet search for “free VIN lookup.”\nThere are websites that provide free VIN lookup services. For example, try: https://www.northamericanmotoring.com/forums/vindecoder.php\n\nWhile some free VIN report services provide every detail of a car’s options, others do not. Some websites offer an advanced search for a fee. Enter your VIN. After you’ve found a website where you can look up your VIN, enter it in full. This is the most important step, and you need to follow the website’s directions. If you don’t, your search might work or it might return incorrect data. Follow the directions on the website and then press \"search.\" Some websites may ask you to omit certain parts of the VIN number. Review the VIN detail report. After submitting the VIN number, you’ll get a report back. The report will detail the specifications of the car as it was produced by the manufacturer. The VIN report should include options, such as the transmission, the trim, and emissions specifications. The VIN report should include anything that was changed in the production process. VIN detail reports may not include options added after manufacturer, added at the dealership, or added by the consumer after the initial sale. Depending on the website, you may need to pay a fee for your VIN report. Decoding the VIN Visit the manufacturer’s website. Once you’ve got the VIN number, you should log on to the internet and visit the manufacturer’s website. The carmaker’s website will contain resources that will help you decode the VIN and understand what each number means. Find the VIN decoder or search section of the website. Almost all manufacturers have a VIN decoder or similar tool on their website. Search through the tabs or search bar for \"VIN decoder\" or \"VIN search.\" Click on the page or .pdf file that gives you information about decoding the VIN. For example, visit estore.honda.com/honda/parts/use-your-vehicle-vin.asp. Look at the world manufacturer identifier. The world manufacturer identifiers are the first 3 letters or numbers at the beginning of the VIN. This will give you information about the type of vehicle and where it was produced. The first number/letter tells the region the car was manufactured in, for example, “North America.”\nThe second number tells the country. The third number tells the type of vehicle, for example “light truck.”\nMany different vehicles will share their first 3 numbers/letters. Identify the second sequence of numbers. The second sequence, numbers and letters 4 through 8, tell you more information about manufacturer options. By decoding these numbers, you’ll learn about the features the vehicle was manufactured with. These numbers will tell you info about the:\nEngine\nModel\nBody style. Skip the ninth digit. This is the digit used to verify that it is not a fraudulent VIN. It cannot be used to find information about the car. If you suspect the vehicle has a fake VIN number, contact the manufacturer. To decode this number, you may have to bring your car into a dealership. View the tenth digit. The tenth digit will tell you the model year of the vehicle. This is important to knowing the options on the vehicle, as different model years are equipped with different option group packages. This does not indicate what year the car was built. For example, if the car was a 2010 Chevrolet Equinox, it might have been constructed in late 2009\nThis information should also be available in the vehicle’s manual or on other paperwork associated with the car. Find the last 7 digits. Along with the second sequence of numbers, these last digits are perhaps the most important for finding the options of the vehicle. They will give you all the car specific information you’re looking for. You’ll only be able to decode this information on the car manufacturer’s website. These numbers should give you information like that listed on the original sticker of the car. The numbers will also tell you what specific plant the vehicle was built as well as production specific information. Read about common options. While manufacturers use different codes to represent different options, the information encoded in the last 7 digits of your VIN number will provide specifics about a number of options. These numbers will give you info about common options like:\nTrim color\nPower seats and windows\nEntertainment system\nSeat covering material\nSunroof\nEquipment packages like off road or towing Purchasing a Vehicle History Report Submit your VIN to a third-party website. There are several companies that compile and sell vehicle history reports. A vehicle history report is a comprehensive history that includes data on a vehicle’s manufacture, sales, and sometimes repair information. Try websites like:\nCarfax\nAutocheck Pay a fee. After submitting your VIN, the third-party website may prompt you to pay a fee for a complete vehicle history report. While you may not want to pay, it is standard for companies to charge for this service. Feel free to shop around. Different websites or companies may offer different prices. In addition, some companies may run promos on vehicle history reports at different times. Fees normally range from between $20 to $40 to receive a full vehicle history report. Some websites may provide cheaper rates per report if you want several vehicle history reports. For example, you may be able to get 5 reports for $59.99. Examine the report. Once you get your report back, you’ll need to take a good look at it so you can get a good idea of the car’s history, options, and other information. When reading the report:\nVerify the report matches the VIN you submitted. Read about the car's production and the vehicle's repair and registration history in the report. Look to see if the vehicle has been repaired or if the report shows any evidence of aftermarket upgrades.",
    "sentences": [
        " Locating the VIN Find the VIN on the car, if you have access to it.",
        "Most vehicles have the VIN etched or in the form of a sticker on at least two parts of the car.",
        "Look for the VIN on:\nThe driver’s side in the door jamb\nThe driver’s side dash board\nMetal within the engine compartment\nParts of car that can’t be removed Look for the VIN on paperwork associated with the car.",
        "While you should be able to find the VIN on the actual car, it might be easier to find it on the car’s paperwork.",
        "This will come in handy if you don’t physically have the car, but have some paperwork associated with it.",
        "Look on the:\nTitle\nRegistration\nRepair records Ask the seller for the VIN.",
        "If you don’t own the car yet and can’t access it, you can ask the seller of the car for the VIN.",
        "The seller will be able to find the VIN just like you could – through paperwork or by looking on the body of the car.",
        "Make sure the seller provides you with the entire 17-digit VIN number before you commit to buying the vehicle.",
        "The seller should happily give you the number so that you can do an independent vehicle history search.",
        "If they don’t, they may be hiding something.",
        "Using VIN Decoding Websites Find a website to give you details about the car.",
        "There are a variety of websites that offer VIN lookup services on the website.",
        "These websites will ask you to enter a car’s VIN, and then will supply you with information about the car’s options.",
        "Run an internet search for “free VIN lookup.”\nThere are websites that provide free VIN lookup services.",
        "For example, try: https://www.northamericanmotoring.com/forums/vindecoder.php\n\nWhile some free VIN report services provide every detail of a car’s options, others do not.",
        "Some websites offer an advanced search for a fee.",
        "Enter your VIN.",
        "After you’ve found a website where you can look up your VIN, enter it in full.",
        "This is the most important step, and you need to follow the website’s directions.",
        "If you don’t, your search might work or it might return incorrect data.",
        "Follow the directions on the website and then press \"search.\"",
        "Some websites may ask you to omit certain parts of the VIN number.",
        "Review the VIN detail report.",
        "After submitting the VIN number, you’ll get a report back.",
        "The report will detail the specifications of the car as it was produced by the manufacturer.",
        "The VIN report should include options, such as the transmission, the trim, and emissions specifications.",
        "The VIN report should include anything that was changed in the production process.",
        "VIN detail reports may not include options added after manufacturer, added at the dealership, or added by the consumer after the initial sale.",
        "Depending on the website, you may need to pay a fee for your VIN report.",
        "Decoding the VIN Visit the manufacturer’s website.",
        "Once you’ve got the VIN number, you should log on to the internet and visit the manufacturer’s website.",
        "The carmaker’s website will contain resources that will help you decode the VIN and understand what each number means.",
        "Find the VIN decoder or search section of the website.",
        "Almost all manufacturers have a VIN decoder or similar tool on their website.",
        "Search through the tabs or search bar for \"VIN decoder\" or \"VIN search.\"",
        "Click on the page or .pdf file that gives you information about decoding the VIN.",
        "For example, visit estore.honda.com/honda/parts/use-your-vehicle-vin.asp.",
        "Look at the world manufacturer identifier.",
        "The world manufacturer identifiers are the first 3 letters or numbers at the beginning of the VIN.",
        "This will give you information about the type of vehicle and where it was produced.",
        "The first number/letter tells the region the car was manufactured in, for example, “North America.”\nThe second number tells the country.",
        "The third number tells the type of vehicle, for example “light truck.”\nMany different vehicles will share their first 3 numbers/letters.",
        "Identify the second sequence of numbers.",
        "The second sequence, numbers and letters 4 through 8, tell you more information about manufacturer options.",
        "By decoding these numbers, you’ll learn about the features the vehicle was manufactured with.",
        "These numbers will tell you info about the:\nEngine\nModel\nBody style.",
        "Skip the ninth digit.",
        "This is the digit used to verify that it is not a fraudulent VIN.",
        "It cannot be used to find information about the car.",
        "If you suspect the vehicle has a fake VIN number, contact the manufacturer.",
        "To decode this number, you may have to bring your car into a dealership.",
        "View the tenth digit.",
        "The tenth digit will tell you the model year of the vehicle.",
        "This is important to knowing the options on the vehicle, as different model years are equipped with different option group packages.",
        "This does not indicate what year the car was built.",
        "For example, if the car was a 2010 Chevrolet Equinox, it might have been constructed in late 2009\nThis information should also be available in the vehicle’s manual or on other paperwork associated with the car.",
        "Find the last 7 digits.",
        "Along with the second sequence of numbers, these last digits are perhaps the most important for finding the options of the vehicle.",
        "They will give you all the car specific information you’re looking for.",
        "You’ll only be able to decode this information on the car manufacturer’s website.",
        "These numbers should give you information like that listed on the original sticker of the car.",
        "The numbers will also tell you what specific plant the vehicle was built as well as production specific information.",
        "Read about common options.",
        "While manufacturers use different codes to represent different options, the information encoded in the last 7 digits of your VIN number will provide specifics about a number of options.",
        "These numbers will give you info about common options like:\nTrim color\nPower seats and windows\nEntertainment system\nSeat covering material\nSunroof\nEquipment packages like off road or towing Purchasing a Vehicle History Report Submit your VIN to a third-party website.",
        "There are several companies that compile and sell vehicle history reports.",
        "A vehicle history report is a comprehensive history that includes data on a vehicle’s manufacture, sales, and sometimes repair information.",
        "Try websites like:\nCarfax\nAutocheck Pay a fee.",
        "After submitting your VIN, the third-party website may prompt you to pay a fee for a complete vehicle history report.",
        "While you may not want to pay, it is standard for companies to charge for this service.",
        "Feel free to shop around.",
        "Different websites or companies may offer different prices.",
        "In addition, some companies may run promos on vehicle history reports at different times.",
        "Fees normally range from between $20 to $40 to receive a full vehicle history report.",
        "Some websites may provide cheaper rates per report if you want several vehicle history reports.",
        "For example, you may be able to get 5 reports for $59.99.",
        "Examine the report.",
        "Once you get your report back, you’ll need to take a good look at it so you can get a good idea of the car’s history, options, and other information.",
        "When reading the report:\nVerify the report matches the VIN you submitted.",
        "Read about the car's production and the vehicle's repair and registration history in the report.",
        "Look to see if the vehicle has been repaired or if the report shows any evidence of aftermarket upgrades."
    ]
}