{
    "title": "How to Do Valentine's Day Makeup",
    "url": "https://www.wikihow.com/Do-Valentine%27s-Day-Makeup",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Makeup",
        "Makeup Styles",
        "Holiday Makeup"
    ],
    "methods": [
        {
            "name": "Creating a Flirty and Soft Look",
            "steps": [
                {
                    "headline": "Create soft eyes.",
                    "description": "For a really soft eye, choose a bronze cream eye shadow and a sparkly sheer champagne color on top. For a little more color, you could use a series of pinks, going from softer to darker up from the eye. First, apply the bronze cream shadow all along your lid. Then, apply the champagne sparkle across the top, under the eyebrow. For the pinks, start with your middle color, and apply it along the crease of your eyelid. Go along the top of the first color with a slightly darker pink, staying under your eyebrows. You can go over the whole thing with a light color, such as peach. You can also highlight your brow with a lighter luminizer by brushing it along your brow bone. Another option is using pale blue on your eyelids."
                },
                {
                    "headline": "Pick an eyeliner.",
                    "description": "Since you're going soft and flirty, use a brown eyeliner that is a little darker than your skin tone. It can have a bit of sparkle. You can also use a nude or bright eyeliner along your eyeline or waterline. Simply apply the liner along the edge of your eye, creating a clean line. You don't want anything too dark. However, a gold-tone eyeliner would also work."
                },
                {
                    "headline": "Work on your eyelashes and eyebrows.",
                    "description": "Add a coat or two of mascara by brushing the mascara up on the top eyelid and down on the bottom eyelid. You can use black or brown, for something softer. Comb out your eyebrows and add a eyebrow gel to help keep them in place. On your eyebrows, comb up and out in the direction the hair is growing. If you don't have gel, spray some hairspray on the comb, then run it over your eyebrows to help them stay in place."
                },
                {
                    "headline": "Put on foundation and bronzer.",
                    "description": "If you would like, you can put on a liquid foundation. Smooth it out over your face with a sponge concentrating on problem areas. In addition, you can also use a concealer on top of the foundation to help hide red or splotchy areas. Both should match your skin tone. You can use a powder over the foundation to help set it and smooth it out. Add a slightly darker bronzer underneath your cheekbones, as that will help give it definition. You can also add it along your jawbone and the top part of your forehead. Smooth it in with a powder brush."
                },
                {
                    "headline": "Add blush.",
                    "description": "You definitely don't want to go overboard with the blush. However, you can use a very light pink blush to add some color and rosiness to your cheeks. Simply brush along the top of your cheekbones. Make sure to blend it in with the rest of your powder."
                },
                {
                    "headline": "Finish with the lips.",
                    "description": "You want something soft and pink for your lips. You could start by going around your lips with a pink lip liner. You also need to fill in your lips with the same liner. Once you're done, put some pink lip gloss on top for shine and sparkle. Another option is using two lipsticks or lip glosses. Start with a slightly darker pink, then put a bit lighter pink on top of it."
                }
            ]
        },
        {
            "name": "Going for a Bolder Look",
            "steps": [
                {
                    "headline": "Work on your eyes.",
                    "description": "Start with a flesh-colored eye shadow that you spread over your whole eyelid. Next, use a soft brown that matches your skin tone, and spread it along the crease of your eye. It will give your eyes some definition but not stand out too strong, letting your eyeliner shine. Then, using a black eyeliner, line the edge of your top eyelid, bringing it out into a little wingtip past the corner of your eye. Another option is to create a smoky eye. Start with a kohl eyeliner, and use it to line your upper and lower eyelid. Then, use a sponge or brush to smudge it upward and downward onto the lid, which will create a smoky eye. Use a light brown or taupe eye shadow on both lids, then line your waterline with a dark eyeliner."
                },
                {
                    "headline": "Work on your lashes.",
                    "description": "For this look, you want dramatic lashes. One option is to ramp up your own lashes. Another option is to apply fake eyelashes. Fake eyelashes can dramatically increase your volume and length, making them stand out.For dramatizing your own lashes, you may want to start by curling them or use a mascara that does the curling for you. Next, apply several coats of mascara to make them darker. To apply fake lashes, start by curling your own lashes with an eyelash curler. Use tweezers to apply the fake lashes, so you can place them right on your natural line. Also, make sure to trim them so they follow your natural line."
                },
                {
                    "headline": "Smooth on foundation.",
                    "description": "Now's the time to apply a liquid foundation. Using a sponge, spread it out over your face. Next, add a concealer in problem areas, such as where your face is splotchy. It can help to hide red spots, too. After, set the foundation with a powder. Make sure the foundation, concealer, and powder all blend with your skin tone."
                },
                {
                    "headline": "Shape and color your cheeks.",
                    "description": "Apply a bronzer underneath your cheekbones to help create dimension, blending it in to the powder. After you've got the bronzer down, add a splash of pink rouge across your face. You want to keep this light, so you don't look like a clown."
                },
                {
                    "headline": "Pick a dramatic lipstick.",
                    "description": "For your lipstick, you want something bold. Red is a classic choice for Valentine's Day. You may need to look through a few reds to find the right one for  your skin tone. You can test them out on the back of your hand to see how they look. For color that stays, line your lips with a lip liner first. Obviously, you need to use a color that matches or that provides an interesting contrast. If you make a mistake with the lip liner, you can cover it with concealer. When you're done, fill in the lines with your bold lipstick choice."
                }
            ]
        },
        {
            "name": "Giving Your Nails a Makeover",
            "steps": [
                {
                    "headline": "Consider heart nails.",
                    "description": "Heart nails don't have to be just a cutesy heart in the middle of your nail, though they can be. It can also be layers of pink and red that just create the middle shape of the heart. If you're layering at home, be sure to let the colors dry between coats."
                },
                {
                    "headline": "Pick a nontraditional color.",
                    "description": "While you may think of pinks and purples for Valentine's Day, any color can be Valentine's with a few hearts and some sparkle. Pick a pale blue with white highlights, for example. Don't be afraid to add some Xs and Os or even spell out \"love\" across your fingernails."
                },
                {
                    "headline": "Add a floral touch.",
                    "description": "Florals create a romantic flair, and with any number of paint-on designs these days, you have your pick. If you want to create your own, try adding little roses by swirling in red on a white background. Red roses are the perfect complement to Valentine's Day."
                },
                {
                    "headline": "Use polka dots.",
                    "description": "Polka dots are just cutesy enough to work for Valentine's Day, especially since they are vintage and modern all at the same time. Just be sure to pick contrasting colors when you create polka dots. Light colors on darker colors usually work best."
                },
                {
                    "headline": "Go dark.",
                    "description": "Another option is to go for a dark color, like purple or even black. You can tone it down a bit with some tiny pink hearts. Once those dry, consider coating the top with a sheer pink sparkle to give your nails some shine. You could also swirl in a second color."
                }
            ]
        },
        {
            "name": "Working on Your Hair",
            "steps": [
                {
                    "headline": "Try a feminine headband.",
                    "description": "A feminine headband can add a romantic side to your look. For instance, you can get one that sparkles and almost looks like a tiara, or one that boosts big, romantic blooms. Whatever you choose, make sure it goes with the makeup you've chosen."
                },
                {
                    "headline": "Create a messy updo.",
                    "description": "Another hair option is to use messiness to your advantage, creating a sexy look. Start with a texturizer. Make sure to just use it on the roots of your hair. Turn your head upside to create a big ponytail high on your head. Also, make sure to leave a few straggles of hair out at the front to frame your face."
                },
                {
                    "headline": "Create a romantic updo.",
                    "description": "Start with a low, loose ponytail. Separate the ponytail into two parts above the holder. Flip the ponytail down and through the separation. Tease your hair in the ponytail a little (if it's fine) to give it body. Flip the ponytail back up and over, tucking the end back into the top of the ponytail, creating a loop. Secure it with bobby pins and hairspray."
                },
                {
                    "headline": "Use dramatic curls.",
                    "description": "Use a curling iron that creates big curls. Curl the hair away from your face, holding each curl to set it. Once you've got your curls set, spray in some light hairspray to set the curls for your day. Smooth any stray hairs out with a touch of hairspray."
                }
            ]
        }
    ],
    "tyn": [
        "Hair accessories",
        "Curling iron",
        "Styling products",
        "Lipstick or lip gloss",
        "Foundation",
        "Concealer",
        "Bronzer",
        "Highlighter",
        "Blush",
        "Eye shadow",
        "Eye liner",
        "Spoolie brush",
        "Eyebrow gel",
        "Mascara",
        "Eyelash curlers or fake eyelashes"
    ],
    "text": " Creating a Flirty and Soft Look Create soft eyes. For a really soft eye, choose a bronze cream eye shadow and a sparkly sheer champagne color on top. For a little more color, you could use a series of pinks, going from softer to darker up from the eye. First, apply the bronze cream shadow all along your lid. Then, apply the champagne sparkle across the top, under the eyebrow. For the pinks, start with your middle color, and apply it along the crease of your eyelid. Go along the top of the first color with a slightly darker pink, staying under your eyebrows. You can go over the whole thing with a light color, such as peach. You can also highlight your brow with a lighter luminizer by brushing it along your brow bone. Another option is using pale blue on your eyelids. Pick an eyeliner. Since you're going soft and flirty, use a brown eyeliner that is a little darker than your skin tone. It can have a bit of sparkle. You can also use a nude or bright eyeliner along your eyeline or waterline. Simply apply the liner along the edge of your eye, creating a clean line. You don't want anything too dark. However, a gold-tone eyeliner would also work. Work on your eyelashes and eyebrows. Add a coat or two of mascara by brushing the mascara up on the top eyelid and down on the bottom eyelid. You can use black or brown, for something softer. Comb out your eyebrows and add a eyebrow gel to help keep them in place. On your eyebrows, comb up and out in the direction the hair is growing. If you don't have gel, spray some hairspray on the comb, then run it over your eyebrows to help them stay in place. Put on foundation and bronzer. If you would like, you can put on a liquid foundation. Smooth it out over your face with a sponge concentrating on problem areas. In addition, you can also use a concealer on top of the foundation to help hide red or splotchy areas. Both should match your skin tone. You can use a powder over the foundation to help set it and smooth it out. Add a slightly darker bronzer underneath your cheekbones, as that will help give it definition. You can also add it along your jawbone and the top part of your forehead. Smooth it in with a powder brush. Add blush. You definitely don't want to go overboard with the blush. However, you can use a very light pink blush to add some color and rosiness to your cheeks. Simply brush along the top of your cheekbones. Make sure to blend it in with the rest of your powder. Finish with the lips. You want something soft and pink for your lips. You could start by going around your lips with a pink lip liner. You also need to fill in your lips with the same liner. Once you're done, put some pink lip gloss on top for shine and sparkle. Another option is using two lipsticks or lip glosses. Start with a slightly darker pink, then put a bit lighter pink on top of it. Going for a Bolder Look Work on your eyes. Start with a flesh-colored eye shadow that you spread over your whole eyelid. Next, use a soft brown that matches your skin tone, and spread it along the crease of your eye. It will give your eyes some definition but not stand out too strong, letting your eyeliner shine. Then, using a black eyeliner, line the edge of your top eyelid, bringing it out into a little wingtip past the corner of your eye. Another option is to create a smoky eye. Start with a kohl eyeliner, and use it to line your upper and lower eyelid. Then, use a sponge or brush to smudge it upward and downward onto the lid, which will create a smoky eye. Use a light brown or taupe eye shadow on both lids, then line your waterline with a dark eyeliner. Work on your lashes. For this look, you want dramatic lashes. One option is to ramp up your own lashes. Another option is to apply fake eyelashes. Fake eyelashes can dramatically increase your volume and length, making them stand out.For dramatizing your own lashes, you may want to start by curling them or use a mascara that does the curling for you. Next, apply several coats of mascara to make them darker. To apply fake lashes, start by curling your own lashes with an eyelash curler. Use tweezers to apply the fake lashes, so you can place them right on your natural line. Also, make sure to trim them so they follow your natural line. Smooth on foundation. Now's the time to apply a liquid foundation. Using a sponge, spread it out over your face. Next, add a concealer in problem areas, such as where your face is splotchy. It can help to hide red spots, too. After, set the foundation with a powder. Make sure the foundation, concealer, and powder all blend with your skin tone. Shape and color your cheeks. Apply a bronzer underneath your cheekbones to help create dimension, blending it in to the powder. After you've got the bronzer down, add a splash of pink rouge across your face. You want to keep this light, so you don't look like a clown. Pick a dramatic lipstick. For your lipstick, you want something bold. Red is a classic choice for Valentine's Day. You may need to look through a few reds to find the right one for  your skin tone. You can test them out on the back of your hand to see how they look. For color that stays, line your lips with a lip liner first. Obviously, you need to use a color that matches or that provides an interesting contrast. If you make a mistake with the lip liner, you can cover it with concealer. When you're done, fill in the lines with your bold lipstick choice. Giving Your Nails a Makeover Consider heart nails. Heart nails don't have to be just a cutesy heart in the middle of your nail, though they can be. It can also be layers of pink and red that just create the middle shape of the heart. If you're layering at home, be sure to let the colors dry between coats. Pick a nontraditional color. While you may think of pinks and purples for Valentine's Day, any color can be Valentine's with a few hearts and some sparkle. Pick a pale blue with white highlights, for example. Don't be afraid to add some Xs and Os or even spell out \"love\" across your fingernails. Add a floral touch. Florals create a romantic flair, and with any number of paint-on designs these days, you have your pick. If you want to create your own, try adding little roses by swirling in red on a white background. Red roses are the perfect complement to Valentine's Day. Use polka dots. Polka dots are just cutesy enough to work for Valentine's Day, especially since they are vintage and modern all at the same time. Just be sure to pick contrasting colors when you create polka dots. Light colors on darker colors usually work best. Go dark. Another option is to go for a dark color, like purple or even black. You can tone it down a bit with some tiny pink hearts. Once those dry, consider coating the top with a sheer pink sparkle to give your nails some shine. You could also swirl in a second color. Working on Your Hair Try a feminine headband. A feminine headband can add a romantic side to your look. For instance, you can get one that sparkles and almost looks like a tiara, or one that boosts big, romantic blooms. Whatever you choose, make sure it goes with the makeup you've chosen. Create a messy updo. Another hair option is to use messiness to your advantage, creating a sexy look. Start with a texturizer. Make sure to just use it on the roots of your hair. Turn your head upside to create a big ponytail high on your head. Also, make sure to leave a few straggles of hair out at the front to frame your face. Create a romantic updo. Start with a low, loose ponytail. Separate the ponytail into two parts above the holder. Flip the ponytail down and through the separation. Tease your hair in the ponytail a little (if it's fine) to give it body. Flip the ponytail back up and over, tucking the end back into the top of the ponytail, creating a loop. Secure it with bobby pins and hairspray. Use dramatic curls. Use a curling iron that creates big curls. Curl the hair away from your face, holding each curl to set it. Once you've got your curls set, spray in some light hairspray to set the curls for your day. Smooth any stray hairs out with a touch of hairspray.",
    "sentences": [
        " Creating a Flirty and Soft Look Create soft eyes.",
        "For a really soft eye, choose a bronze cream eye shadow and a sparkly sheer champagne color on top.",
        "For a little more color, you could use a series of pinks, going from softer to darker up from the eye.",
        "First, apply the bronze cream shadow all along your lid.",
        "Then, apply the champagne sparkle across the top, under the eyebrow.",
        "For the pinks, start with your middle color, and apply it along the crease of your eyelid.",
        "Go along the top of the first color with a slightly darker pink, staying under your eyebrows.",
        "You can go over the whole thing with a light color, such as peach.",
        "You can also highlight your brow with a lighter luminizer by brushing it along your brow bone.",
        "Another option is using pale blue on your eyelids.",
        "Pick an eyeliner.",
        "Since you're going soft and flirty, use a brown eyeliner that is a little darker than your skin tone.",
        "It can have a bit of sparkle.",
        "You can also use a nude or bright eyeliner along your eyeline or waterline.",
        "Simply apply the liner along the edge of your eye, creating a clean line.",
        "You don't want anything too dark.",
        "However, a gold-tone eyeliner would also work.",
        "Work on your eyelashes and eyebrows.",
        "Add a coat or two of mascara by brushing the mascara up on the top eyelid and down on the bottom eyelid.",
        "You can use black or brown, for something softer.",
        "Comb out your eyebrows and add a eyebrow gel to help keep them in place.",
        "On your eyebrows, comb up and out in the direction the hair is growing.",
        "If you don't have gel, spray some hairspray on the comb, then run it over your eyebrows to help them stay in place.",
        "Put on foundation and bronzer.",
        "If you would like, you can put on a liquid foundation.",
        "Smooth it out over your face with a sponge concentrating on problem areas.",
        "In addition, you can also use a concealer on top of the foundation to help hide red or splotchy areas.",
        "Both should match your skin tone.",
        "You can use a powder over the foundation to help set it and smooth it out.",
        "Add a slightly darker bronzer underneath your cheekbones, as that will help give it definition.",
        "You can also add it along your jawbone and the top part of your forehead.",
        "Smooth it in with a powder brush.",
        "Add blush.",
        "You definitely don't want to go overboard with the blush.",
        "However, you can use a very light pink blush to add some color and rosiness to your cheeks.",
        "Simply brush along the top of your cheekbones.",
        "Make sure to blend it in with the rest of your powder.",
        "Finish with the lips.",
        "You want something soft and pink for your lips.",
        "You could start by going around your lips with a pink lip liner.",
        "You also need to fill in your lips with the same liner.",
        "Once you're done, put some pink lip gloss on top for shine and sparkle.",
        "Another option is using two lipsticks or lip glosses.",
        "Start with a slightly darker pink, then put a bit lighter pink on top of it.",
        "Going for a Bolder Look Work on your eyes.",
        "Start with a flesh-colored eye shadow that you spread over your whole eyelid.",
        "Next, use a soft brown that matches your skin tone, and spread it along the crease of your eye.",
        "It will give your eyes some definition but not stand out too strong, letting your eyeliner shine.",
        "Then, using a black eyeliner, line the edge of your top eyelid, bringing it out into a little wingtip past the corner of your eye.",
        "Another option is to create a smoky eye.",
        "Start with a kohl eyeliner, and use it to line your upper and lower eyelid.",
        "Then, use a sponge or brush to smudge it upward and downward onto the lid, which will create a smoky eye.",
        "Use a light brown or taupe eye shadow on both lids, then line your waterline with a dark eyeliner.",
        "Work on your lashes.",
        "For this look, you want dramatic lashes.",
        "One option is to ramp up your own lashes.",
        "Another option is to apply fake eyelashes.",
        "Fake eyelashes can dramatically increase your volume and length, making them stand out.For dramatizing your own lashes, you may want to start by curling them or use a mascara that does the curling for you.",
        "Next, apply several coats of mascara to make them darker.",
        "To apply fake lashes, start by curling your own lashes with an eyelash curler.",
        "Use tweezers to apply the fake lashes, so you can place them right on your natural line.",
        "Also, make sure to trim them so they follow your natural line.",
        "Smooth on foundation.",
        "Now's the time to apply a liquid foundation.",
        "Using a sponge, spread it out over your face.",
        "Next, add a concealer in problem areas, such as where your face is splotchy.",
        "It can help to hide red spots, too.",
        "After, set the foundation with a powder.",
        "Make sure the foundation, concealer, and powder all blend with your skin tone.",
        "Shape and color your cheeks.",
        "Apply a bronzer underneath your cheekbones to help create dimension, blending it in to the powder.",
        "After you've got the bronzer down, add a splash of pink rouge across your face.",
        "You want to keep this light, so you don't look like a clown.",
        "Pick a dramatic lipstick.",
        "For your lipstick, you want something bold.",
        "Red is a classic choice for Valentine's Day.",
        "You may need to look through a few reds to find the right one for  your skin tone.",
        "You can test them out on the back of your hand to see how they look.",
        "For color that stays, line your lips with a lip liner first.",
        "Obviously, you need to use a color that matches or that provides an interesting contrast.",
        "If you make a mistake with the lip liner, you can cover it with concealer.",
        "When you're done, fill in the lines with your bold lipstick choice.",
        "Giving Your Nails a Makeover Consider heart nails.",
        "Heart nails don't have to be just a cutesy heart in the middle of your nail, though they can be.",
        "It can also be layers of pink and red that just create the middle shape of the heart.",
        "If you're layering at home, be sure to let the colors dry between coats.",
        "Pick a nontraditional color.",
        "While you may think of pinks and purples for Valentine's Day, any color can be Valentine's with a few hearts and some sparkle.",
        "Pick a pale blue with white highlights, for example.",
        "Don't be afraid to add some Xs and Os or even spell out \"love\" across your fingernails.",
        "Add a floral touch.",
        "Florals create a romantic flair, and with any number of paint-on designs these days, you have your pick.",
        "If you want to create your own, try adding little roses by swirling in red on a white background.",
        "Red roses are the perfect complement to Valentine's Day.",
        "Use polka dots.",
        "Polka dots are just cutesy enough to work for Valentine's Day, especially since they are vintage and modern all at the same time.",
        "Just be sure to pick contrasting colors when you create polka dots.",
        "Light colors on darker colors usually work best.",
        "Go dark.",
        "Another option is to go for a dark color, like purple or even black.",
        "You can tone it down a bit with some tiny pink hearts.",
        "Once those dry, consider coating the top with a sheer pink sparkle to give your nails some shine.",
        "You could also swirl in a second color.",
        "Working on Your Hair Try a feminine headband.",
        "A feminine headband can add a romantic side to your look.",
        "For instance, you can get one that sparkles and almost looks like a tiara, or one that boosts big, romantic blooms.",
        "Whatever you choose, make sure it goes with the makeup you've chosen.",
        "Create a messy updo.",
        "Another hair option is to use messiness to your advantage, creating a sexy look.",
        "Start with a texturizer.",
        "Make sure to just use it on the roots of your hair.",
        "Turn your head upside to create a big ponytail high on your head.",
        "Also, make sure to leave a few straggles of hair out at the front to frame your face.",
        "Create a romantic updo.",
        "Start with a low, loose ponytail.",
        "Separate the ponytail into two parts above the holder.",
        "Flip the ponytail down and through the separation.",
        "Tease your hair in the ponytail a little (if it's fine) to give it body.",
        "Flip the ponytail back up and over, tucking the end back into the top of the ponytail, creating a loop.",
        "Secure it with bobby pins and hairspray.",
        "Use dramatic curls.",
        "Use a curling iron that creates big curls.",
        "Curl the hair away from your face, holding each curl to set it.",
        "Once you've got your curls set, spray in some light hairspray to set the curls for your day.",
        "Smooth any stray hairs out with a touch of hairspray."
    ]
}