{
    "title": "How to Make Lucky Paper Stars",
    "url": "https://www.wikihow.com/Make-Lucky-Paper-Stars",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Christmas"
    ],
    "steps": [
        {
            "headline": "Cut a long, narrow strip of paper about 1 centimeter (0.4 in) wide and as long as whatever page you are cutting.",
            "description": ""
        },
        {
            "headline": "Tie a simple knot (of the same kind that you would use to tie your shoes) at one end.",
            "description": "Then:\nCross the ends of the strips and pull one end through the loop that forms. If you want the color from a particular end of the strip, tie the knot at the other end. Don't twist the paper, just loop it. Gently tighten the knot, then gently pull the knot without creasing or squeezing the strip of paper. When all the edges are in contact, press it down and crease. You should have a pentagon with a long end and a short end sticking out."
        },
        {
            "headline": "Fold the short end over, following the edges of the pentagon, so that it does not stick out.",
            "description": "If there's a little more than a pentagon width, you can tear it off or fold it under and tuck it in."
        },
        {
            "headline": "Wrap the long end around and around the pentagon, following the edges and the folds.",
            "description": "The result should be a fatter pentagon. Fold so that the color you want faces out, if the two sides of the strip are different."
        },
        {
            "headline": "Tuck in the loose end.",
            "description": "If there is a little too much, fold it over or tear it off before tucking it in."
        },
        {
            "headline": "Pinch each corner or push in the edges to puff the star up.",
            "description": ""
        },
        {
            "headline": "Use the stars for display.",
            "description": "Make a whole bunch of these and display them in a jar or clear glass. Display them mixed with confetti or tinsel as part of the party decorations on a table. Work a needle and thread or string through opposite corners to string them together as a garland or necklace. You could combine them with paper beads or other elements on the same string."
        }
    ],
    "tyn": [
        "Paper – magazine and catalog pages you were going to throw out are great, since they're fairly soft, thin paper and provide a wealth of bright colors. You're using narrow enough strips so that most designs will just show up as colors when you're done.",
        "Scissors and a ruler or a paper cutter",
        "A glass, ",
        "box",
        ", or jar (optional) in which to display a collection",
        "Needle and thread",
        " or string (optional)"
    ],
    "text": " Cut a long, narrow strip of paper about 1 centimeter (0.4 in) wide and as long as whatever page you are cutting.  Tie a simple knot (of the same kind that you would use to tie your shoes) at one end. Then:\nCross the ends of the strips and pull one end through the loop that forms. If you want the color from a particular end of the strip, tie the knot at the other end. Don't twist the paper, just loop it. Gently tighten the knot, then gently pull the knot without creasing or squeezing the strip of paper. When all the edges are in contact, press it down and crease. You should have a pentagon with a long end and a short end sticking out. Fold the short end over, following the edges of the pentagon, so that it does not stick out. If there's a little more than a pentagon width, you can tear it off or fold it under and tuck it in. Wrap the long end around and around the pentagon, following the edges and the folds. The result should be a fatter pentagon. Fold so that the color you want faces out, if the two sides of the strip are different. Tuck in the loose end. If there is a little too much, fold it over or tear it off before tucking it in. Pinch each corner or push in the edges to puff the star up.  Use the stars for display. Make a whole bunch of these and display them in a jar or clear glass. Display them mixed with confetti or tinsel as part of the party decorations on a table. Work a needle and thread or string through opposite corners to string them together as a garland or necklace. You could combine them with paper beads or other elements on the same string.",
    "sentences": [
        " Cut a long, narrow strip of paper about 1 centimeter (0.4 in) wide and as long as whatever page you are cutting.",
        "Tie a simple knot (of the same kind that you would use to tie your shoes) at one end.",
        "Then:\nCross the ends of the strips and pull one end through the loop that forms.",
        "If you want the color from a particular end of the strip, tie the knot at the other end.",
        "Don't twist the paper, just loop it.",
        "Gently tighten the knot, then gently pull the knot without creasing or squeezing the strip of paper.",
        "When all the edges are in contact, press it down and crease.",
        "You should have a pentagon with a long end and a short end sticking out.",
        "Fold the short end over, following the edges of the pentagon, so that it does not stick out.",
        "If there's a little more than a pentagon width, you can tear it off or fold it under and tuck it in.",
        "Wrap the long end around and around the pentagon, following the edges and the folds.",
        "The result should be a fatter pentagon.",
        "Fold so that the color you want faces out, if the two sides of the strip are different.",
        "Tuck in the loose end.",
        "If there is a little too much, fold it over or tear it off before tucking it in.",
        "Pinch each corner or push in the edges to puff the star up.",
        "Use the stars for display.",
        "Make a whole bunch of these and display them in a jar or clear glass.",
        "Display them mixed with confetti or tinsel as part of the party decorations on a table.",
        "Work a needle and thread or string through opposite corners to string them together as a garland or necklace.",
        "You could combine them with paper beads or other elements on the same string."
    ]
}