{
    "title": "How to Avoid Snakes",
    "url": "https://www.wikihow.com/Avoid-Snakes",
    "category_hierarchy": [
        "Sports and Fitness",
        "Outdoor Recreation",
        "Outdoor Safety",
        "Animal and Insect Safety"
    ],
    "methods": [
        {
            "name": "Understanding Snakes",
            "steps": [
                {
                    "headline": "Realize that the majority of snakes do not seek an encounter with humans.",
                    "description": "They would much prefer to avoid a human and, if given the chance, will escape rather than attack you. The problems humans face with snakes usually arise due to accidental encounters or human actions towards the snake––both of these problems can be managed from the human side, as this article will explain."
                },
                {
                    "headline": "Know where snakes hang out.",
                    "description": "Snakes like to be hidden most of the time but warmer weather or surfaces can entice them out to sun themselves too. For the most part, snakes like such places as under rocks, on ledges, in trees, inside hollow logs, under wood piles and in shrubbery. They can also be found in water––both land and water-based snakes can swim. Things to note include:\nSnakes are masters of camouflage. They can easily be overlooked for leaf litter, sticks and plant materials. This is why you are at greater risk of encountering a snake when going off-path and into thick vegetation. The human defensive skill when walking amid potentially dangerous wildlife is vision and whenever human sight is reduced, the risk increases."
                },
                {
                    "headline": "Be aware that snakes hear differently from humans, as they lack external ears.",
                    "description": "However, they can hear through their inner ear via their jawbone, and what they hear are vibrations. Thus, having a heavy footfall as you walk will help to alert a snake you're coming, allowing it to slither off in the opposite direction. This inability to hear in the same way that we do can be used to your advantage, as you can alert your fellow humans that you have come across a snake without any concern that your talking will aggravate it."
                },
                {
                    "headline": "Understand what causes a snake to attack a human.",
                    "description": "As already explained, snakes don't want to attack humans but there is one guaranteed reason a snake will seek to bite a human and that is when the snake feels threatened. A snakebite is a defensive reaction, not a deliberate attack. After all, it wants to live as much as you do. A snake will most likely feel threatened when:\nYou tread on it. While this may seem unfair, it's a case of the snake not knowing what has suddenly landed on it and you being surprised at its presence. Surprise is something you can control and prevent. The snake is cornered. A snake, like any animal, will react unkindly to feeling it has no escape from a potential predator (yes, you look like a predator to a snake, as you're much larger and you're moving). Some snakes are more fiercely defensive than others, so always presume a snake will fight its utmost to stay alive. You hassle the snake in any way, such as chasing it, throwing rocks at it, trying to pick it up, or worse still, trying to kill it."
                },
                {
                    "headline": "Know what to be wary of in the snake's body language.",
                    "description": "Knowing when a snake is turning defensive can help you to take fast evasive action. Things to watch for include:\nThe snake curls itself up; in some snake species, this can be a sign it is getting ready to strike. The snake raises its head. When done in reaction to an encounter, it is a fairly good indicator that the snake is getting ready to strike. Striking distance of a snake is generally about half the snake's body length but you should give the snake at least double that length of space between you and it. Moreover, this is dependent on the snake type, hence the need for learning more about the snakes in your walking area, before you go walking."
                },
                {
                    "headline": "Assume nothing about a snake's willingness or otherwise to attack.",
                    "description": "A lazy-looking snake is as capable of attacking as an active one. A snake is able to attack from any position, so assume that any snake needs to be avoided. Baby snakes are harder to see and likely to be more easily frightened than an adult snake and are just as dangerous if threatened. Dead snakes can still bite, due to biting reflexes and venom lasts a long time post death. Hence, obey the best rule of all in relation to snakes––don't touch."
                },
                {
                    "headline": "Learn more about snakes.",
                    "description": "While we may (or may not) have the same fear reactions to snakes as other primates, we have the advantage of learning to help us to manage such fear. We have many things to fear in our daily lives, but we manage these things through learning and better understanding. For example, we know not to step out in front of a moving car because we have learned what the outcome will be if we do. Snakes are no different––the more we learn and adjust our behaviour accordingly, the better we can stay safe and avoid snakes. Moreover, if we cannot avoid a snake encounter, we can at least know how to react to increase the chances that both human and snake depart each other's company unscathed. The remaining steps will help you to better understand how to avoid snakes and how to cope should you come across one."
                }
            ]
        },
        {
            "name": "Avoiding Snakes when Walking in the Great Outdoors",
            "steps": [
                {
                    "headline": "Know when you're heading into snake territory.",
                    "description": "Some parts of the world, some parts of your own region, are more likely to contain snakes than other places. Find out in advance where snakes live in your neck of the woods or where you're traveling to, before you venture out on a walk. Ask locals, park rangers or the local government authority for advice. In many places, you may be able to check online for snake information. Guidebooks on hiking will likely provide such information and many trail-head map boards will alert you to the presence of snakes. Do not go forth unawares! What snakes are in your area? Are they venomous or non-venomous, or a mix of the two? Have you spent some time looking at images of the snakes in your area to enable you know the type of snake should you encounter one? What are the specific habits of the snakes in your local area? All this knowledge can help you to avoid them or keep safe should you encounter one. The risk of snake bite varies depending on where you are but, on the whole, it is statistically low. While the statistical likelihood doesn't reduce the need for vigilance, it can help to put things in perspective."
                },
                {
                    "headline": "Walk with someone.",
                    "description": "It is not advisable to walk alone when there is a risk of snakebite or any other harm in the bush or back country. If you are bitten while walking alone, there is less chance of getting help fast enough to give you first aid. If you do walk alone, carry a snake first aid kit suited to the snakes in your area (this will contain a compression bandage or other appropriate needs) and know how to use the pressure immobilization technique on yourself. If you cannot walk with others, always have a means for contacting people if an emergency happens. If there is no mobile reception, take a form of communication that will work. At the very least, let a park ranger or other suitable person know your movements and expected return time."
                },
                {
                    "headline": "Dress appropriately.",
                    "description": "For walks where snakes are likely to be, always wear the appropriate clothing, especially for your feet and legs. Ninety percent of snake bites are focused on the ankle area, so it makes sense to cover up these parts of your body well. This means wearing long pants (no exposed legs) and good quality, sturdy, fully covering hiking boots (no open toes).That means leaving shorts, skorts and skirts at home. In addition, wear gaiters; choose gaiters that are marked snake-resistant. The additional fabric over your long pants and boots will help to prevent the snake's fangs from piercing through to your skin, or at the very least, may reduce the amount of venom injected. Boots that cover the ankles are a very good choice. Avoid any shoes with open toes; sandals and flip flops (jandals/thongs) offer no protection and do not make adequate vibrations when walking. Looser pants (trousers) are better than close-fitting ones. Since a snake's bite instinctively clamps on, if it gets nothing more than pants, you may avoid a bite on your skin. Looser pants also allow for better airflow that cools you in warmer weather (the weather you're more likely to encounter snakes in). The fabric is best when close-knit and strong. Thick socks are an extra layer of protection, provided you can stand them if it's hot. Gaiters may be preferable if it's too hot or your feet are too sweaty, although combining both gives added protection. If the snakes are known to strike higher, knee-high gaiters may be your best choice. Note! Do not rely on clothing alone, as it is just one part of your whole line of defensive actions. There is no guarantee a snake won't bite through clothing, the clothing suggestions here are just a sensible precaution as part of the whole."
                },
                {
                    "headline": "Stay alert when walking and watch where you're going.",
                    "description": "This cannot be over-stressed; you have a duty to yourself and your bush-walking party to stay alert at all times. This means looking ahead to where you're going at all times. Always look around and be aware of your surroundings. Look down where you are walking so that you don't accidentally step on a snake. If you need to do anything that causes you to take your eyes off the path ahead, stop first, then do it. If you walk while trying to read a map, take photos, admire the scenery, fish out some snacks from your pack or drink water and you can't keep looking at the path ahead, there is a risk of walking into a snake. Do not rely on the person in front to clear the path ahead. A snake can slither across the path after the person ahead has passed on by. Every walker needs to be vigilant. If you are walking with persons who cannot see or who cannot stay alert (children, visually impaired persons, etc. ), then you are wholly responsible for their safety too. By all means enable them to stay safe by talking to them about what to be concerned about and how to act with care but remain wholly responsible for looking out for their safety in the knowledge that they have limitations."
                },
                {
                    "headline": "Stick to walking paths as much as possible.",
                    "description": "While snakes will use paths to cross from one part of the bush to another, and sometimes to sun themselves, the path is open, and you will see any snakes doing such things well before you come across them. This allows you the opportunity to turn back or wait until the snake has moved on should you encounter one (see below if you do meet a snake). Stay on open, clear and marked trails, to make it easier to see where you're going."
                },
                {
                    "headline": "Watch where you tread.",
                    "description": "This is a vital part of staying alert; always be looking ahead for the possibility of a snake on the path before and alongside of you. If you move off the path, check where every footfall will land before making it. The ideal approach is to be checking several steps ahead of you as you walk. It can be helpful to have a walking stick or pole. These aren't just a walking aid but can also be used to part grass or other vegetation if you need to walk through it, especially if it's obscuring your pathway. Better that a snake bites the stick than you. Use it gently, as the best outcome is that no living being gets hurt. If climbing over a log or rock, stand on it first. Then look down on the other side where you weren't able to see before ascending. If there is a snake resting there, you still have time to back down on the original side and walk a different way."
                },
                {
                    "headline": "Walk firmly, with sure steps.",
                    "description": "This means making it clear that you're coming through your heavy tread, to cause vibrations ahead. This in itself will often be enough to cause many a snake to scatter and hide before you even reach where it was. Use a walking stick to thud on the path as well, for added vibration. Most snakes won't stick around when they're alert to an unknown thudding beast coming their way. However, there are exceptions, such as snakes enjoying the sunshine too much to move and snakes that have barely warmed up and cannot react quickly enough––for such snakes, striking first can be their only defensive reaction. Also, there are snake species that don't move for whatever reason. Some snakes stay absolutely still in the hope their camouflage will deter predators. The trouble with such behavior is that you can easily tread on such a snake, so stay alert. One example of a snake that relies on its camouflage over moving out of the way is the Australian death adder. It will often remain coiled up, relying on the leaf litter as camouflage. This is why you must not rely on vibration alone, but also use sight (look for coiled, round shapes in this instance), while also gently prodding through vegetation with the walking stick before heading across it. This is yet another reason why you need to be aware of what type of snakes are in the area and their typical habits."
                },
                {
                    "headline": "Step upon before stepping over.",
                    "description": "Where a log or rock blocks your way and you need to traverse it to get to where you're headed, always step onto the feature first, then look down. If a snake is resting below the feature, you can then see it and back off before treading down onto it. Wait for it to leave before moving on. A log can be tapped with the walking stick to create vibrations to encourage the snake to move on."
                },
                {
                    "headline": "Keep your hands to yourself.",
                    "description": "When you are walking, marvel from afar. If holes, wood piles and hollow logs intrigue you, look from a good distance or better still, use your camera lens to zoom in. Do not put your hand or arms in there for further investigation because these are very likely holes for snakes to rest in. Left undisturbed, you'd normally pass by the snakes without either of you being bothered but if you stick your hand in there, the snake may bite. Look before grabbing onto tree branches. It can be helpful sometimes to hold onto a tree when climbing or descending a path, or just to take a rest. However, snakes can climb and sometimes a branch can contain a snake. Before you grab that branch, be sure to check it's just a branch and not holding a snake as well. Take care when using rock ledges and other natural features to help you to climb or rest on. Check for snake presence first. If you are doing a rocky trail walk in an area known for snakes, consider wearing thick gloves and long sleeves to protect your hands and arms while grabbing onto rocks. Don't pick up sticks unless you're absolutely sure it's a stick. People have mistaken snakes for sticks and have been bitten as a result."
                },
                {
                    "headline": "Sit with care.",
                    "description": "It's natural to want to rest on a fallen log, a sturdy rock or other natural feature. Such items may also be a home or resting point for a snake. Check the area visually and make vibrations by stomping around before sitting down. If you're unsure, squat on the path or sit on your day-pack on the path; at least you know what is there. Remember to step on the log or rock before checking the other side, in case the snake is resting on the side you cannot see."
                },
                {
                    "headline": "Watch where you take a bathroom break.",
                    "description": "If you need to urinate in the bush, be careful about where you do so. While it's natural to want to hide from your human companions, you don't want to do so at the expense of getting bitten. Look carefully as you go to a toilet spot, check around the spot and avoid anywhere near a rocky outcrop, long grass or logs. Of course, take the usual precautions for not fouling waterways either! Stay alert all the time and finish your business quickly. If you are using the bush for urinating at night, always wear shoes and take light."
                },
                {
                    "headline": "Be careful at night.",
                    "description": "Snakes will naturally gravitate towards warm roads and pathways when these have residual heat as darkness falls because this helps them to keep warm. If using such areas at night, carry a light and use it to be totally aware of what is on the path ahead of you. Avoid night hiking in areas where you cannot see ahead or around you or where you would be forced to walk through heavily wooded or tall grassy areas."
                }
            ]
        },
        {
            "name": "Avoiding Snakes While Camping",
            "steps": [
                {
                    "headline": "Check your tent before leaving your house.",
                    "description": "This is part of routine maintenance. A tent used in snake country must have no holes in it at all, otherwise it's not a serviceable tent and you'll may get water, bugs and other creatures, as well as snakes, coming in if it has holes. Check that the zippers work and that the tent is in good condition."
                },
                {
                    "headline": "Choose a campsite which is away from bush and tall clumps of grass.",
                    "description": "Choose a clearing where you can see the ground without any problems. Avoid rocky outcrops and low-hanging branches as campsites."
                },
                {
                    "headline": "Keep your tent zippered closed at all times.",
                    "description": "Instruct all users, no matter how young or old, to keep the tents fully zippered up. This is a golden rule of camping. A snake can slide in though the smallest of gaps, so instruct everyone to keep the zipper join(s) up towards the top, allowing you to be sure that the base area of the tent is fully closed."
                },
                {
                    "headline": "Keep all sleeping bags rolled up.",
                    "description": "Unfold at night just before you go to bed. This allows you to survey the tent as a whole before getting into it, and you can be sure there isn't a snake snuggled in the end of your sleeping bag before you put your toes in. If you couldn't keep sleeping gear safely secured away or you're just unsure if it was kept safely enough, shake it out before using it. It is better to have a snake drop out and slither off than to put your bare feet into a bag with a snake inside."
                },
                {
                    "headline": "Keep all footwear inside the tent or car at all times.",
                    "description": "Snakes find boots and shoes enticing hiding holes; indeed, snakes up to a metre long can curl into a boot. If you cannot keep them inside the tent or car, pull your socks over the hole of each shoe or boot to prevent entry (or stuff the socks inside). This is a good practice when hiking and camping anyway, as not only snakes like crawling into boots. Check boots before putting them on. Tip them upside down and give them a good shake. Do not put your hand inside; use a long stick if you need to prod inside the boot."
                },
                {
                    "headline": "Practice good camp tidiness.",
                    "description": "Do not leave anything about that could hide a snake seeking cover. This means keeping blankets, picnic rugs, towels, clothing, bags, etc., inside the closed car or tent. Do not leave such items on the ground when not in use and not attended. Keep all containers closed when not being used, from ice boxes to food bags. After all, you're out in nature to enjoy its natural state. Do not leave rubbish or garbage around; it attracts mice and rats, which in turn attract snakes. Yet another great reason to keep your outdoors experience litter-free."
                },
                {
                    "headline": "Use lighting whenever walking around the campsite.",
                    "description": "Stumbling in the dark is its own hazard without adding treading on a snake as well, so it's essential to carry a light at all times when moving about. Do not pick up anything without first shining light onto it, to be sure that you are picking up something safe."
                },
                {
                    "headline": "Keep car doors shut at all times.",
                    "description": "No need to invite a snake into the hiding sanctuary it might view your car as. Sometimes snakes like to go underneath cars to stay protected from the open air and still have contact with the warm asphalt. If you have parked somewhere that snakes are likely to be around, be aware of this possibility. Get into the car quickly and shut the door straight away; don't stand next to the car for too long or lean on or lean your legs out of the car in case there is a snake frightened out of its slumber by your presence."
                }
            ]
        },
        {
            "name": "Avoiding Water Snakes",
            "steps": [
                {
                    "headline": "Know where the water contains snakes.",
                    "description": "Water snakes are usually deadly and it's unlikely you can get help quickly enough after being bitten, so avoiding them is your only line of safety. If you know water snakes are in a body of water, the safest thing is to stay out of the water. There are plenty of safe places to go swimming in the world, so choose those places for your next trip."
                },
                {
                    "headline": "Avoid going into rivers or other water bodies after heavy rains.",
                    "description": "Even if the water is usually safe, the heavy rains may have caused snakes that are usually land-lubbers to get caught up in the water and they'll be attempting to get back to safety."
                }
            ]
        },
        {
            "name": "Removing Yourself from a Snake Encounter Outdoors",
            "steps": [
                {
                    "headline": "Stay calm.",
                    "description": "Panicking will cause you to think poorly. You might also move in the wrong direction or move too quickly and cause the snake to view you as a threat. By staying calm, you remain level-headed and can initiate your retreat with care and good sense. Yelling at a snake makes no difference, it cannot hear what you are saying. However, calmly warning your walking companions to slowly back off is a sensible use of your voice."
                },
                {
                    "headline": "Do not approach the snake.",
                    "description": "Remembering that all a snake wants to do is get away from you, give it the space and opportunity to do so. Snakes need to be quite close to be able to bite you and the striking distance for most snakes is usually half the snake's body length. Thus, by not approaching any farther, you will usually have reduced the risk to negligible.The striking distance for some snakes is less because they are bigger or more agile, such as the Western Taipan. The more distance between you and the snake, clearly the safer."
                },
                {
                    "headline": "Stay still and keep movements to a minimum.",
                    "description": "While the snake isn't listening to your conversation, its excellent eyesight is watching you for sudden and scary movements. Snakes are easily startled by sudden movement, as this is its alert mechanism for a threat. Jumping up and down and flailing your arms around can easily be interpreted as hostile intent by a snake."
                },
                {
                    "headline": "Wait, keeping still.",
                    "description": "Provided you are at a safe distance from the snake, stop and let the snake move on. If the snake has realized you are there, it will often leave of its own accord while you aren't making any movement, to avoid you. However, if the snake proves stubborn in its wish to stay where it is, leave it alone and walk around it at a safe distance. If you cannot go around the snake due to the path being the only way forward, try stomping the ground on the spot, to produce more vibrations. However, only do this if you are a very safe (long) distance away from the snake, as stomping movement and vibrations can be perceived by the snake as a threat and it may strike instead of move.A snake has a short attention span, usually lasting less than a minute. Hence, once it has slithered away from you, it has forgotten about you and goes about its business elsewhere. It's not harbouring thoughts of coming back to chase you."
                },
                {
                    "headline": "Do not harass the snake.",
                    "description": "Do not throw anything at the snake, as this will only cause it to view you as a threat. Do not attempt to poke it or pick it up; both actions are likely to cause it to bite. Most snakebites occur as a result of a human interfering directly with the snake, such as poking it, picking it up, or trying to kill it. Leave the snake be, and most times it'll leave you be too."
                },
                {
                    "headline": "Retreat if you have accidentally cornered a snake.",
                    "description": "To do this, back away slowly and avoid sudden movement. Do not make any sudden movements, as that is what prey would do and some snakes wait for such movements to strike out (such as the death adder). Make as little vibration and movement as possible when slowly backing out, as this will avoid stoking the snake's innate compulsion to strike out at fast moving prey.If the snake is within strike range, you may be better off remaining completely motionless and letting it pass by. If you are between the snake and where it wants to go, it may wish to come past you as part of its escape strategy. If this does happen, stay absolutely still and let the snake slide on by. If it slides over your boots, keep very still and let it pass on by. Stay motionless until the snake passes. Never deliberately corner a snake. That's asking for being bitten and reflects poor decision-making."
                },
                {
                    "headline": "Keep an eye on a snake that is retreating.",
                    "description": "Make sure you leave in the opposite direction, to avoid disturbing it again. Do not follow the snake for any reason."
                }
            ]
        },
        {
            "name": "Avoiding Snakes Around and In the Home",
            "steps": [
                {
                    "headline": "Keep the doors to your house, sheds and pet housing closed if you live in an area where snakes like to crawl in.",
                    "description": "They won't hesitate to come through a door if the entrance is easy for them and they perceive nice hiding holes, water and even food opportunities inside. If snakes are known to be in your garden or yard, assume they can come inside any structure too. If there is enough space under the door for a snake to slide through, cover it with a strong rubber seal or weather stripping. This will also keep out mice, rats, dirt and dust, and the like."
                },
                {
                    "headline": "Avoid making enticing homes for rats and mice and for snakes.",
                    "description": "This includes keeping the yard tidy and not building wood piles or other messy piles in the yard. The snakes will be attracted by rat and mouse homes, and might also decide it's cozy enough to move in for good.Wood stored for fires in winter should be kept well away from the house. It is best kept inside a secure shed that has no opening to outside; use a concrete floor as the base."
                },
                {
                    "headline": "Keep the grass short.",
                    "description": "There is a fine balance between short enough to see snakes and high enough to save water but as long as its even and you can see across and through it with ease, then you will be able to spot any snakes passing through. When gardening, wear thick leather gloves, to protect your hands when touching plants and working around soil and compost."
                },
                {
                    "headline": "Prevent other sources of possible entrance to your house.",
                    "description": "Seal any holes, gaps and cracks around your house that may allow for snakes or other nasty critters to crawl in. Do an underfloor, wall and roof inspection for possible entrance ways."
                },
                {
                    "headline": "Remove food sources for snakes.",
                    "description": "Attracting wildlife to your garden through feeding it can also attract the snakes that eat the wildlife. Bird feeders, bread pieces or even cat and dog food, can attract the snakes to your backyard, in search of the prey eating the food you've left out. If you want to feed birds, clean up the mess left behind daily, to avoid birds settling on the ground frequently.Snakes need water too. If you leave water out for animals, keep it well away from the house. If you have a pond, pool or other water feature, keep the grass low around it, to help you to see if a snake has come for a drink."
                },
                {
                    "headline": "Check your compost bin's accessibility.",
                    "description": "Any compost bin that becomes a rat and mouse haven also becomes a snake's feasting point. Ensure that no small beasts are residing in your compost by checking it and turning it frequently. Do not add eggshells to the compost, as rodents enjoy eating these. Do not compost food scraps in open heaps. This makes it easy for rats and mice to feed off and they'll gather around. Use sticks to poke compost before picking it up with your hands. This applies to all garden piles, such as mulch and leaf heaps."
                }
            ]
        },
        {
            "name": "Removing Yourself from a Snake Encounter Indoors",
            "steps": [
                {
                    "headline": "Determine that there is a snake in the house.",
                    "description": "Usually this will be by site but sometimes you might be aware due to someone else notifying you, hearing snake rustling (if you're familiar with the sound). Stay calm and move slowly; upsetting the snake can cause it to hide somewhere else, which may make it even harder to find and remove. Leave the snake well alone; do not try to capture, kill or remove it."
                },
                {
                    "headline": "Remove everyone from the room where the snake has been discovered.",
                    "description": "Have children leave quietly and quickly. This includes all pets, even fish if possible. Lock pets away somewhere safe.Only remove pets and fish tanks if this does not endanger you."
                },
                {
                    "headline": "Shut the door to the room where you have discovered the snake.",
                    "description": "If the base of the door would allow a snake to crawl under, block it with newspaper, rolled-up towels or a draft (draught) stopper. Inform all family members that the room is out of bounds. Lock it if possible. Alternatively, shut (and block) all internal doors except for the room the snake is in and leave external doors open, to encourage the snake to leave. If you know there is a snake in the house but you don't know where, vacate the whole house; remember to lock your doors if leaving the property, to avoid being burgled while seeking help or sitting it out at the neighbour's. If it's possible, put signs on the doors explaining that there is a snake inside, especially if family members cannot be reached but might return home before you get back."
                },
                {
                    "headline": "Call for help.",
                    "description": "Call a professional snake handler. If you cannot find one, call your local municipality or the local police for assistance and they will be able to direct you to the appropriate help."
                },
                {
                    "headline": "Wait for help.",
                    "description": "Unless you're a professional snake handler, this is your best option. Do not attempt to handle the snake or shoo it away. If you take photos of it, do so through a window. Instagram or Facebook are not worth being bitten by a startled snake. If it is safe to do so, keep an eye on the snake as this increases the chances that the snake handler will catch it and not have to spend a lot of time locating it."
                }
            ]
        }
    ],
    "tyn": [
        "Boots with a thick sole and ankle coverage",
        "Long pants (trousers), preferably loose",
        "Gaiters (snake-resistant)",
        "A walking/hiking stick/staff",
        "A snake first aid kit (learn how to treat a snakebite before you go walking)"
    ],
    "text": " Understanding Snakes Realize that the majority of snakes do not seek an encounter with humans. They would much prefer to avoid a human and, if given the chance, will escape rather than attack you. The problems humans face with snakes usually arise due to accidental encounters or human actions towards the snake––both of these problems can be managed from the human side, as this article will explain. Know where snakes hang out. Snakes like to be hidden most of the time but warmer weather or surfaces can entice them out to sun themselves too. For the most part, snakes like such places as under rocks, on ledges, in trees, inside hollow logs, under wood piles and in shrubbery. They can also be found in water––both land and water-based snakes can swim. Things to note include:\nSnakes are masters of camouflage. They can easily be overlooked for leaf litter, sticks and plant materials. This is why you are at greater risk of encountering a snake when going off-path and into thick vegetation. The human defensive skill when walking amid potentially dangerous wildlife is vision and whenever human sight is reduced, the risk increases. Be aware that snakes hear differently from humans, as they lack external ears. However, they can hear through their inner ear via their jawbone, and what they hear are vibrations. Thus, having a heavy footfall as you walk will help to alert a snake you're coming, allowing it to slither off in the opposite direction. This inability to hear in the same way that we do can be used to your advantage, as you can alert your fellow humans that you have come across a snake without any concern that your talking will aggravate it. Understand what causes a snake to attack a human. As already explained, snakes don't want to attack humans but there is one guaranteed reason a snake will seek to bite a human and that is when the snake feels threatened. A snakebite is a defensive reaction, not a deliberate attack. After all, it wants to live as much as you do. A snake will most likely feel threatened when:\nYou tread on it. While this may seem unfair, it's a case of the snake not knowing what has suddenly landed on it and you being surprised at its presence. Surprise is something you can control and prevent. The snake is cornered. A snake, like any animal, will react unkindly to feeling it has no escape from a potential predator (yes, you look like a predator to a snake, as you're much larger and you're moving). Some snakes are more fiercely defensive than others, so always presume a snake will fight its utmost to stay alive. You hassle the snake in any way, such as chasing it, throwing rocks at it, trying to pick it up, or worse still, trying to kill it. Know what to be wary of in the snake's body language. Knowing when a snake is turning defensive can help you to take fast evasive action. Things to watch for include:\nThe snake curls itself up; in some snake species, this can be a sign it is getting ready to strike. The snake raises its head. When done in reaction to an encounter, it is a fairly good indicator that the snake is getting ready to strike. Striking distance of a snake is generally about half the snake's body length but you should give the snake at least double that length of space between you and it. Moreover, this is dependent on the snake type, hence the need for learning more about the snakes in your walking area, before you go walking. Assume nothing about a snake's willingness or otherwise to attack. A lazy-looking snake is as capable of attacking as an active one. A snake is able to attack from any position, so assume that any snake needs to be avoided. Baby snakes are harder to see and likely to be more easily frightened than an adult snake and are just as dangerous if threatened. Dead snakes can still bite, due to biting reflexes and venom lasts a long time post death. Hence, obey the best rule of all in relation to snakes––don't touch. Learn more about snakes. While we may (or may not) have the same fear reactions to snakes as other primates, we have the advantage of learning to help us to manage such fear. We have many things to fear in our daily lives, but we manage these things through learning and better understanding. For example, we know not to step out in front of a moving car because we have learned what the outcome will be if we do. Snakes are no different––the more we learn and adjust our behaviour accordingly, the better we can stay safe and avoid snakes. Moreover, if we cannot avoid a snake encounter, we can at least know how to react to increase the chances that both human and snake depart each other's company unscathed. The remaining steps will help you to better understand how to avoid snakes and how to cope should you come across one. Avoiding Snakes when Walking in the Great Outdoors Know when you're heading into snake territory. Some parts of the world, some parts of your own region, are more likely to contain snakes than other places. Find out in advance where snakes live in your neck of the woods or where you're traveling to, before you venture out on a walk. Ask locals, park rangers or the local government authority for advice. In many places, you may be able to check online for snake information. Guidebooks on hiking will likely provide such information and many trail-head map boards will alert you to the presence of snakes. Do not go forth unawares! What snakes are in your area? Are they venomous or non-venomous, or a mix of the two? Have you spent some time looking at images of the snakes in your area to enable you know the type of snake should you encounter one? What are the specific habits of the snakes in your local area? All this knowledge can help you to avoid them or keep safe should you encounter one. The risk of snake bite varies depending on where you are but, on the whole, it is statistically low. While the statistical likelihood doesn't reduce the need for vigilance, it can help to put things in perspective. Walk with someone. It is not advisable to walk alone when there is a risk of snakebite or any other harm in the bush or back country. If you are bitten while walking alone, there is less chance of getting help fast enough to give you first aid. If you do walk alone, carry a snake first aid kit suited to the snakes in your area (this will contain a compression bandage or other appropriate needs) and know how to use the pressure immobilization technique on yourself. If you cannot walk with others, always have a means for contacting people if an emergency happens. If there is no mobile reception, take a form of communication that will work. At the very least, let a park ranger or other suitable person know your movements and expected return time. Dress appropriately. For walks where snakes are likely to be, always wear the appropriate clothing, especially for your feet and legs. Ninety percent of snake bites are focused on the ankle area, so it makes sense to cover up these parts of your body well. This means wearing long pants (no exposed legs) and good quality, sturdy, fully covering hiking boots (no open toes).That means leaving shorts, skorts and skirts at home. In addition, wear gaiters; choose gaiters that are marked snake-resistant. The additional fabric over your long pants and boots will help to prevent the snake's fangs from piercing through to your skin, or at the very least, may reduce the amount of venom injected. Boots that cover the ankles are a very good choice. Avoid any shoes with open toes; sandals and flip flops (jandals/thongs) offer no protection and do not make adequate vibrations when walking. Looser pants (trousers) are better than close-fitting ones. Since a snake's bite instinctively clamps on, if it gets nothing more than pants, you may avoid a bite on your skin. Looser pants also allow for better airflow that cools you in warmer weather (the weather you're more likely to encounter snakes in). The fabric is best when close-knit and strong. Thick socks are an extra layer of protection, provided you can stand them if it's hot. Gaiters may be preferable if it's too hot or your feet are too sweaty, although combining both gives added protection. If the snakes are known to strike higher, knee-high gaiters may be your best choice. Note! Do not rely on clothing alone, as it is just one part of your whole line of defensive actions. There is no guarantee a snake won't bite through clothing, the clothing suggestions here are just a sensible precaution as part of the whole. Stay alert when walking and watch where you're going. This cannot be over-stressed; you have a duty to yourself and your bush-walking party to stay alert at all times. This means looking ahead to where you're going at all times. Always look around and be aware of your surroundings. Look down where you are walking so that you don't accidentally step on a snake. If you need to do anything that causes you to take your eyes off the path ahead, stop first, then do it. If you walk while trying to read a map, take photos, admire the scenery, fish out some snacks from your pack or drink water and you can't keep looking at the path ahead, there is a risk of walking into a snake. Do not rely on the person in front to clear the path ahead. A snake can slither across the path after the person ahead has passed on by. Every walker needs to be vigilant. If you are walking with persons who cannot see or who cannot stay alert (children, visually impaired persons, etc. ), then you are wholly responsible for their safety too. By all means enable them to stay safe by talking to them about what to be concerned about and how to act with care but remain wholly responsible for looking out for their safety in the knowledge that they have limitations. Stick to walking paths as much as possible. While snakes will use paths to cross from one part of the bush to another, and sometimes to sun themselves, the path is open, and you will see any snakes doing such things well before you come across them. This allows you the opportunity to turn back or wait until the snake has moved on should you encounter one (see below if you do meet a snake). Stay on open, clear and marked trails, to make it easier to see where you're going. Watch where you tread. This is a vital part of staying alert; always be looking ahead for the possibility of a snake on the path before and alongside of you. If you move off the path, check where every footfall will land before making it. The ideal approach is to be checking several steps ahead of you as you walk. It can be helpful to have a walking stick or pole. These aren't just a walking aid but can also be used to part grass or other vegetation if you need to walk through it, especially if it's obscuring your pathway. Better that a snake bites the stick than you. Use it gently, as the best outcome is that no living being gets hurt. If climbing over a log or rock, stand on it first. Then look down on the other side where you weren't able to see before ascending. If there is a snake resting there, you still have time to back down on the original side and walk a different way. Walk firmly, with sure steps. This means making it clear that you're coming through your heavy tread, to cause vibrations ahead. This in itself will often be enough to cause many a snake to scatter and hide before you even reach where it was. Use a walking stick to thud on the path as well, for added vibration. Most snakes won't stick around when they're alert to an unknown thudding beast coming their way. However, there are exceptions, such as snakes enjoying the sunshine too much to move and snakes that have barely warmed up and cannot react quickly enough––for such snakes, striking first can be their only defensive reaction. Also, there are snake species that don't move for whatever reason. Some snakes stay absolutely still in the hope their camouflage will deter predators. The trouble with such behavior is that you can easily tread on such a snake, so stay alert. One example of a snake that relies on its camouflage over moving out of the way is the Australian death adder. It will often remain coiled up, relying on the leaf litter as camouflage. This is why you must not rely on vibration alone, but also use sight (look for coiled, round shapes in this instance), while also gently prodding through vegetation with the walking stick before heading across it. This is yet another reason why you need to be aware of what type of snakes are in the area and their typical habits. Step upon before stepping over. Where a log or rock blocks your way and you need to traverse it to get to where you're headed, always step onto the feature first, then look down. If a snake is resting below the feature, you can then see it and back off before treading down onto it. Wait for it to leave before moving on. A log can be tapped with the walking stick to create vibrations to encourage the snake to move on. Keep your hands to yourself. When you are walking, marvel from afar. If holes, wood piles and hollow logs intrigue you, look from a good distance or better still, use your camera lens to zoom in. Do not put your hand or arms in there for further investigation because these are very likely holes for snakes to rest in. Left undisturbed, you'd normally pass by the snakes without either of you being bothered but if you stick your hand in there, the snake may bite. Look before grabbing onto tree branches. It can be helpful sometimes to hold onto a tree when climbing or descending a path, or just to take a rest. However, snakes can climb and sometimes a branch can contain a snake. Before you grab that branch, be sure to check it's just a branch and not holding a snake as well. Take care when using rock ledges and other natural features to help you to climb or rest on. Check for snake presence first. If you are doing a rocky trail walk in an area known for snakes, consider wearing thick gloves and long sleeves to protect your hands and arms while grabbing onto rocks. Don't pick up sticks unless you're absolutely sure it's a stick. People have mistaken snakes for sticks and have been bitten as a result. Sit with care. It's natural to want to rest on a fallen log, a sturdy rock or other natural feature. Such items may also be a home or resting point for a snake. Check the area visually and make vibrations by stomping around before sitting down. If you're unsure, squat on the path or sit on your day-pack on the path; at least you know what is there. Remember to step on the log or rock before checking the other side, in case the snake is resting on the side you cannot see. Watch where you take a bathroom break. If you need to urinate in the bush, be careful about where you do so. While it's natural to want to hide from your human companions, you don't want to do so at the expense of getting bitten. Look carefully as you go to a toilet spot, check around the spot and avoid anywhere near a rocky outcrop, long grass or logs. Of course, take the usual precautions for not fouling waterways either! Stay alert all the time and finish your business quickly. If you are using the bush for urinating at night, always wear shoes and take light. Be careful at night. Snakes will naturally gravitate towards warm roads and pathways when these have residual heat as darkness falls because this helps them to keep warm. If using such areas at night, carry a light and use it to be totally aware of what is on the path ahead of you. Avoid night hiking in areas where you cannot see ahead or around you or where you would be forced to walk through heavily wooded or tall grassy areas. Avoiding Snakes While Camping Check your tent before leaving your house. This is part of routine maintenance. A tent used in snake country must have no holes in it at all, otherwise it's not a serviceable tent and you'll may get water, bugs and other creatures, as well as snakes, coming in if it has holes. Check that the zippers work and that the tent is in good condition. Choose a campsite which is away from bush and tall clumps of grass. Choose a clearing where you can see the ground without any problems. Avoid rocky outcrops and low-hanging branches as campsites. Keep your tent zippered closed at all times. Instruct all users, no matter how young or old, to keep the tents fully zippered up. This is a golden rule of camping. A snake can slide in though the smallest of gaps, so instruct everyone to keep the zipper join(s) up towards the top, allowing you to be sure that the base area of the tent is fully closed. Keep all sleeping bags rolled up. Unfold at night just before you go to bed. This allows you to survey the tent as a whole before getting into it, and you can be sure there isn't a snake snuggled in the end of your sleeping bag before you put your toes in. If you couldn't keep sleeping gear safely secured away or you're just unsure if it was kept safely enough, shake it out before using it. It is better to have a snake drop out and slither off than to put your bare feet into a bag with a snake inside. Keep all footwear inside the tent or car at all times. Snakes find boots and shoes enticing hiding holes; indeed, snakes up to a metre long can curl into a boot. If you cannot keep them inside the tent or car, pull your socks over the hole of each shoe or boot to prevent entry (or stuff the socks inside). This is a good practice when hiking and camping anyway, as not only snakes like crawling into boots. Check boots before putting them on. Tip them upside down and give them a good shake. Do not put your hand inside; use a long stick if you need to prod inside the boot. Practice good camp tidiness. Do not leave anything about that could hide a snake seeking cover. This means keeping blankets, picnic rugs, towels, clothing, bags, etc., inside the closed car or tent. Do not leave such items on the ground when not in use and not attended. Keep all containers closed when not being used, from ice boxes to food bags. After all, you're out in nature to enjoy its natural state. Do not leave rubbish or garbage around; it attracts mice and rats, which in turn attract snakes. Yet another great reason to keep your outdoors experience litter-free. Use lighting whenever walking around the campsite. Stumbling in the dark is its own hazard without adding treading on a snake as well, so it's essential to carry a light at all times when moving about. Do not pick up anything without first shining light onto it, to be sure that you are picking up something safe. Keep car doors shut at all times. No need to invite a snake into the hiding sanctuary it might view your car as. Sometimes snakes like to go underneath cars to stay protected from the open air and still have contact with the warm asphalt. If you have parked somewhere that snakes are likely to be around, be aware of this possibility. Get into the car quickly and shut the door straight away; don't stand next to the car for too long or lean on or lean your legs out of the car in case there is a snake frightened out of its slumber by your presence. Avoiding Water Snakes Know where the water contains snakes. Water snakes are usually deadly and it's unlikely you can get help quickly enough after being bitten, so avoiding them is your only line of safety. If you know water snakes are in a body of water, the safest thing is to stay out of the water. There are plenty of safe places to go swimming in the world, so choose those places for your next trip. Avoid going into rivers or other water bodies after heavy rains. Even if the water is usually safe, the heavy rains may have caused snakes that are usually land-lubbers to get caught up in the water and they'll be attempting to get back to safety. Removing Yourself from a Snake Encounter Outdoors Stay calm. Panicking will cause you to think poorly. You might also move in the wrong direction or move too quickly and cause the snake to view you as a threat. By staying calm, you remain level-headed and can initiate your retreat with care and good sense. Yelling at a snake makes no difference, it cannot hear what you are saying. However, calmly warning your walking companions to slowly back off is a sensible use of your voice. Do not approach the snake. Remembering that all a snake wants to do is get away from you, give it the space and opportunity to do so. Snakes need to be quite close to be able to bite you and the striking distance for most snakes is usually half the snake's body length. Thus, by not approaching any farther, you will usually have reduced the risk to negligible.The striking distance for some snakes is less because they are bigger or more agile, such as the Western Taipan. The more distance between you and the snake, clearly the safer. Stay still and keep movements to a minimum. While the snake isn't listening to your conversation, its excellent eyesight is watching you for sudden and scary movements. Snakes are easily startled by sudden movement, as this is its alert mechanism for a threat. Jumping up and down and flailing your arms around can easily be interpreted as hostile intent by a snake. Wait, keeping still. Provided you are at a safe distance from the snake, stop and let the snake move on. If the snake has realized you are there, it will often leave of its own accord while you aren't making any movement, to avoid you. However, if the snake proves stubborn in its wish to stay where it is, leave it alone and walk around it at a safe distance. If you cannot go around the snake due to the path being the only way forward, try stomping the ground on the spot, to produce more vibrations. However, only do this if you are a very safe (long) distance away from the snake, as stomping movement and vibrations can be perceived by the snake as a threat and it may strike instead of move.A snake has a short attention span, usually lasting less than a minute. Hence, once it has slithered away from you, it has forgotten about you and goes about its business elsewhere. It's not harbouring thoughts of coming back to chase you. Do not harass the snake. Do not throw anything at the snake, as this will only cause it to view you as a threat. Do not attempt to poke it or pick it up; both actions are likely to cause it to bite. Most snakebites occur as a result of a human interfering directly with the snake, such as poking it, picking it up, or trying to kill it. Leave the snake be, and most times it'll leave you be too. Retreat if you have accidentally cornered a snake. To do this, back away slowly and avoid sudden movement. Do not make any sudden movements, as that is what prey would do and some snakes wait for such movements to strike out (such as the death adder). Make as little vibration and movement as possible when slowly backing out, as this will avoid stoking the snake's innate compulsion to strike out at fast moving prey.If the snake is within strike range, you may be better off remaining completely motionless and letting it pass by. If you are between the snake and where it wants to go, it may wish to come past you as part of its escape strategy. If this does happen, stay absolutely still and let the snake slide on by. If it slides over your boots, keep very still and let it pass on by. Stay motionless until the snake passes. Never deliberately corner a snake. That's asking for being bitten and reflects poor decision-making. Keep an eye on a snake that is retreating. Make sure you leave in the opposite direction, to avoid disturbing it again. Do not follow the snake for any reason. Avoiding Snakes Around and In the Home Keep the doors to your house, sheds and pet housing closed if you live in an area where snakes like to crawl in. They won't hesitate to come through a door if the entrance is easy for them and they perceive nice hiding holes, water and even food opportunities inside. If snakes are known to be in your garden or yard, assume they can come inside any structure too. If there is enough space under the door for a snake to slide through, cover it with a strong rubber seal or weather stripping. This will also keep out mice, rats, dirt and dust, and the like. Avoid making enticing homes for rats and mice and for snakes. This includes keeping the yard tidy and not building wood piles or other messy piles in the yard. The snakes will be attracted by rat and mouse homes, and might also decide it's cozy enough to move in for good.Wood stored for fires in winter should be kept well away from the house. It is best kept inside a secure shed that has no opening to outside; use a concrete floor as the base. Keep the grass short. There is a fine balance between short enough to see snakes and high enough to save water but as long as its even and you can see across and through it with ease, then you will be able to spot any snakes passing through. When gardening, wear thick leather gloves, to protect your hands when touching plants and working around soil and compost. Prevent other sources of possible entrance to your house. Seal any holes, gaps and cracks around your house that may allow for snakes or other nasty critters to crawl in. Do an underfloor, wall and roof inspection for possible entrance ways. Remove food sources for snakes. Attracting wildlife to your garden through feeding it can also attract the snakes that eat the wildlife. Bird feeders, bread pieces or even cat and dog food, can attract the snakes to your backyard, in search of the prey eating the food you've left out. If you want to feed birds, clean up the mess left behind daily, to avoid birds settling on the ground frequently.Snakes need water too. If you leave water out for animals, keep it well away from the house. If you have a pond, pool or other water feature, keep the grass low around it, to help you to see if a snake has come for a drink. Check your compost bin's accessibility. Any compost bin that becomes a rat and mouse haven also becomes a snake's feasting point. Ensure that no small beasts are residing in your compost by checking it and turning it frequently. Do not add eggshells to the compost, as rodents enjoy eating these. Do not compost food scraps in open heaps. This makes it easy for rats and mice to feed off and they'll gather around. Use sticks to poke compost before picking it up with your hands. This applies to all garden piles, such as mulch and leaf heaps. Removing Yourself from a Snake Encounter Indoors Determine that there is a snake in the house. Usually this will be by site but sometimes you might be aware due to someone else notifying you, hearing snake rustling (if you're familiar with the sound). Stay calm and move slowly; upsetting the snake can cause it to hide somewhere else, which may make it even harder to find and remove. Leave the snake well alone; do not try to capture, kill or remove it. Remove everyone from the room where the snake has been discovered. Have children leave quietly and quickly. This includes all pets, even fish if possible. Lock pets away somewhere safe.Only remove pets and fish tanks if this does not endanger you. Shut the door to the room where you have discovered the snake. If the base of the door would allow a snake to crawl under, block it with newspaper, rolled-up towels or a draft (draught) stopper. Inform all family members that the room is out of bounds. Lock it if possible. Alternatively, shut (and block) all internal doors except for the room the snake is in and leave external doors open, to encourage the snake to leave. If you know there is a snake in the house but you don't know where, vacate the whole house; remember to lock your doors if leaving the property, to avoid being burgled while seeking help or sitting it out at the neighbour's. If it's possible, put signs on the doors explaining that there is a snake inside, especially if family members cannot be reached but might return home before you get back. Call for help. Call a professional snake handler. If you cannot find one, call your local municipality or the local police for assistance and they will be able to direct you to the appropriate help. Wait for help. Unless you're a professional snake handler, this is your best option. Do not attempt to handle the snake or shoo it away. If you take photos of it, do so through a window. Instagram or Facebook are not worth being bitten by a startled snake. If it is safe to do so, keep an eye on the snake as this increases the chances that the snake handler will catch it and not have to spend a lot of time locating it.",
    "sentences": [
        " Understanding Snakes Realize that the majority of snakes do not seek an encounter with humans.",
        "They would much prefer to avoid a human and, if given the chance, will escape rather than attack you.",
        "The problems humans face with snakes usually arise due to accidental encounters or human actions towards the snake––both of these problems can be managed from the human side, as this article will explain.",
        "Know where snakes hang out.",
        "Snakes like to be hidden most of the time but warmer weather or surfaces can entice them out to sun themselves too.",
        "For the most part, snakes like such places as under rocks, on ledges, in trees, inside hollow logs, under wood piles and in shrubbery.",
        "They can also be found in water––both land and water-based snakes can swim.",
        "Things to note include:\nSnakes are masters of camouflage.",
        "They can easily be overlooked for leaf litter, sticks and plant materials.",
        "This is why you are at greater risk of encountering a snake when going off-path and into thick vegetation.",
        "The human defensive skill when walking amid potentially dangerous wildlife is vision and whenever human sight is reduced, the risk increases.",
        "Be aware that snakes hear differently from humans, as they lack external ears.",
        "However, they can hear through their inner ear via their jawbone, and what they hear are vibrations.",
        "Thus, having a heavy footfall as you walk will help to alert a snake you're coming, allowing it to slither off in the opposite direction.",
        "This inability to hear in the same way that we do can be used to your advantage, as you can alert your fellow humans that you have come across a snake without any concern that your talking will aggravate it.",
        "Understand what causes a snake to attack a human.",
        "As already explained, snakes don't want to attack humans but there is one guaranteed reason a snake will seek to bite a human and that is when the snake feels threatened.",
        "A snakebite is a defensive reaction, not a deliberate attack.",
        "After all, it wants to live as much as you do.",
        "A snake will most likely feel threatened when:\nYou tread on it.",
        "While this may seem unfair, it's a case of the snake not knowing what has suddenly landed on it and you being surprised at its presence.",
        "Surprise is something you can control and prevent.",
        "The snake is cornered.",
        "A snake, like any animal, will react unkindly to feeling it has no escape from a potential predator (yes, you look like a predator to a snake, as you're much larger and you're moving).",
        "Some snakes are more fiercely defensive than others, so always presume a snake will fight its utmost to stay alive.",
        "You hassle the snake in any way, such as chasing it, throwing rocks at it, trying to pick it up, or worse still, trying to kill it.",
        "Know what to be wary of in the snake's body language.",
        "Knowing when a snake is turning defensive can help you to take fast evasive action.",
        "Things to watch for include:\nThe snake curls itself up; in some snake species, this can be a sign it is getting ready to strike.",
        "The snake raises its head.",
        "When done in reaction to an encounter, it is a fairly good indicator that the snake is getting ready to strike.",
        "Striking distance of a snake is generally about half the snake's body length but you should give the snake at least double that length of space between you and it.",
        "Moreover, this is dependent on the snake type, hence the need for learning more about the snakes in your walking area, before you go walking.",
        "Assume nothing about a snake's willingness or otherwise to attack.",
        "A lazy-looking snake is as capable of attacking as an active one.",
        "A snake is able to attack from any position, so assume that any snake needs to be avoided.",
        "Baby snakes are harder to see and likely to be more easily frightened than an adult snake and are just as dangerous if threatened.",
        "Dead snakes can still bite, due to biting reflexes and venom lasts a long time post death.",
        "Hence, obey the best rule of all in relation to snakes––don't touch.",
        "Learn more about snakes.",
        "While we may (or may not) have the same fear reactions to snakes as other primates, we have the advantage of learning to help us to manage such fear.",
        "We have many things to fear in our daily lives, but we manage these things through learning and better understanding.",
        "For example, we know not to step out in front of a moving car because we have learned what the outcome will be if we do.",
        "Snakes are no different––the more we learn and adjust our behaviour accordingly, the better we can stay safe and avoid snakes.",
        "Moreover, if we cannot avoid a snake encounter, we can at least know how to react to increase the chances that both human and snake depart each other's company unscathed.",
        "The remaining steps will help you to better understand how to avoid snakes and how to cope should you come across one.",
        "Avoiding Snakes when Walking in the Great Outdoors Know when you're heading into snake territory.",
        "Some parts of the world, some parts of your own region, are more likely to contain snakes than other places.",
        "Find out in advance where snakes live in your neck of the woods or where you're traveling to, before you venture out on a walk.",
        "Ask locals, park rangers or the local government authority for advice.",
        "In many places, you may be able to check online for snake information.",
        "Guidebooks on hiking will likely provide such information and many trail-head map boards will alert you to the presence of snakes.",
        "Do not go forth unawares!",
        "What snakes are in your area?",
        "Are they venomous or non-venomous, or a mix of the two?",
        "Have you spent some time looking at images of the snakes in your area to enable you know the type of snake should you encounter one?",
        "What are the specific habits of the snakes in your local area?",
        "All this knowledge can help you to avoid them or keep safe should you encounter one.",
        "The risk of snake bite varies depending on where you are but, on the whole, it is statistically low.",
        "While the statistical likelihood doesn't reduce the need for vigilance, it can help to put things in perspective.",
        "Walk with someone.",
        "It is not advisable to walk alone when there is a risk of snakebite or any other harm in the bush or back country.",
        "If you are bitten while walking alone, there is less chance of getting help fast enough to give you first aid.",
        "If you do walk alone, carry a snake first aid kit suited to the snakes in your area (this will contain a compression bandage or other appropriate needs) and know how to use the pressure immobilization technique on yourself.",
        "If you cannot walk with others, always have a means for contacting people if an emergency happens.",
        "If there is no mobile reception, take a form of communication that will work.",
        "At the very least, let a park ranger or other suitable person know your movements and expected return time.",
        "Dress appropriately.",
        "For walks where snakes are likely to be, always wear the appropriate clothing, especially for your feet and legs.",
        "Ninety percent of snake bites are focused on the ankle area, so it makes sense to cover up these parts of your body well.",
        "This means wearing long pants (no exposed legs) and good quality, sturdy, fully covering hiking boots (no open toes).That means leaving shorts, skorts and skirts at home.",
        "In addition, wear gaiters; choose gaiters that are marked snake-resistant.",
        "The additional fabric over your long pants and boots will help to prevent the snake's fangs from piercing through to your skin, or at the very least, may reduce the amount of venom injected.",
        "Boots that cover the ankles are a very good choice.",
        "Avoid any shoes with open toes; sandals and flip flops (jandals/thongs) offer no protection and do not make adequate vibrations when walking.",
        "Looser pants (trousers) are better than close-fitting ones.",
        "Since a snake's bite instinctively clamps on, if it gets nothing more than pants, you may avoid a bite on your skin.",
        "Looser pants also allow for better airflow that cools you in warmer weather (the weather you're more likely to encounter snakes in).",
        "The fabric is best when close-knit and strong.",
        "Thick socks are an extra layer of protection, provided you can stand them if it's hot.",
        "Gaiters may be preferable if it's too hot or your feet are too sweaty, although combining both gives added protection.",
        "If the snakes are known to strike higher, knee-high gaiters may be your best choice.",
        "Note!",
        "Do not rely on clothing alone, as it is just one part of your whole line of defensive actions.",
        "There is no guarantee a snake won't bite through clothing, the clothing suggestions here are just a sensible precaution as part of the whole.",
        "Stay alert when walking and watch where you're going.",
        "This cannot be over-stressed; you have a duty to yourself and your bush-walking party to stay alert at all times.",
        "This means looking ahead to where you're going at all times.",
        "Always look around and be aware of your surroundings.",
        "Look down where you are walking so that you don't accidentally step on a snake.",
        "If you need to do anything that causes you to take your eyes off the path ahead, stop first, then do it.",
        "If you walk while trying to read a map, take photos, admire the scenery, fish out some snacks from your pack or drink water and you can't keep looking at the path ahead, there is a risk of walking into a snake.",
        "Do not rely on the person in front to clear the path ahead.",
        "A snake can slither across the path after the person ahead has passed on by.",
        "Every walker needs to be vigilant.",
        "If you are walking with persons who cannot see or who cannot stay alert (children, visually impaired persons, etc.",
        "), then you are wholly responsible for their safety too.",
        "By all means enable them to stay safe by talking to them about what to be concerned about and how to act with care but remain wholly responsible for looking out for their safety in the knowledge that they have limitations.",
        "Stick to walking paths as much as possible.",
        "While snakes will use paths to cross from one part of the bush to another, and sometimes to sun themselves, the path is open, and you will see any snakes doing such things well before you come across them.",
        "This allows you the opportunity to turn back or wait until the snake has moved on should you encounter one (see below if you do meet a snake).",
        "Stay on open, clear and marked trails, to make it easier to see where you're going.",
        "Watch where you tread.",
        "This is a vital part of staying alert; always be looking ahead for the possibility of a snake on the path before and alongside of you.",
        "If you move off the path, check where every footfall will land before making it.",
        "The ideal approach is to be checking several steps ahead of you as you walk.",
        "It can be helpful to have a walking stick or pole.",
        "These aren't just a walking aid but can also be used to part grass or other vegetation if you need to walk through it, especially if it's obscuring your pathway.",
        "Better that a snake bites the stick than you.",
        "Use it gently, as the best outcome is that no living being gets hurt.",
        "If climbing over a log or rock, stand on it first.",
        "Then look down on the other side where you weren't able to see before ascending.",
        "If there is a snake resting there, you still have time to back down on the original side and walk a different way.",
        "Walk firmly, with sure steps.",
        "This means making it clear that you're coming through your heavy tread, to cause vibrations ahead.",
        "This in itself will often be enough to cause many a snake to scatter and hide before you even reach where it was.",
        "Use a walking stick to thud on the path as well, for added vibration.",
        "Most snakes won't stick around when they're alert to an unknown thudding beast coming their way.",
        "However, there are exceptions, such as snakes enjoying the sunshine too much to move and snakes that have barely warmed up and cannot react quickly enough––for such snakes, striking first can be their only defensive reaction.",
        "Also, there are snake species that don't move for whatever reason.",
        "Some snakes stay absolutely still in the hope their camouflage will deter predators.",
        "The trouble with such behavior is that you can easily tread on such a snake, so stay alert.",
        "One example of a snake that relies on its camouflage over moving out of the way is the Australian death adder.",
        "It will often remain coiled up, relying on the leaf litter as camouflage.",
        "This is why you must not rely on vibration alone, but also use sight (look for coiled, round shapes in this instance), while also gently prodding through vegetation with the walking stick before heading across it.",
        "This is yet another reason why you need to be aware of what type of snakes are in the area and their typical habits.",
        "Step upon before stepping over.",
        "Where a log or rock blocks your way and you need to traverse it to get to where you're headed, always step onto the feature first, then look down.",
        "If a snake is resting below the feature, you can then see it and back off before treading down onto it.",
        "Wait for it to leave before moving on.",
        "A log can be tapped with the walking stick to create vibrations to encourage the snake to move on.",
        "Keep your hands to yourself.",
        "When you are walking, marvel from afar.",
        "If holes, wood piles and hollow logs intrigue you, look from a good distance or better still, use your camera lens to zoom in.",
        "Do not put your hand or arms in there for further investigation because these are very likely holes for snakes to rest in.",
        "Left undisturbed, you'd normally pass by the snakes without either of you being bothered but if you stick your hand in there, the snake may bite.",
        "Look before grabbing onto tree branches.",
        "It can be helpful sometimes to hold onto a tree when climbing or descending a path, or just to take a rest.",
        "However, snakes can climb and sometimes a branch can contain a snake.",
        "Before you grab that branch, be sure to check it's just a branch and not holding a snake as well.",
        "Take care when using rock ledges and other natural features to help you to climb or rest on.",
        "Check for snake presence first.",
        "If you are doing a rocky trail walk in an area known for snakes, consider wearing thick gloves and long sleeves to protect your hands and arms while grabbing onto rocks.",
        "Don't pick up sticks unless you're absolutely sure it's a stick.",
        "People have mistaken snakes for sticks and have been bitten as a result.",
        "Sit with care.",
        "It's natural to want to rest on a fallen log, a sturdy rock or other natural feature.",
        "Such items may also be a home or resting point for a snake.",
        "Check the area visually and make vibrations by stomping around before sitting down.",
        "If you're unsure, squat on the path or sit on your day-pack on the path; at least you know what is there.",
        "Remember to step on the log or rock before checking the other side, in case the snake is resting on the side you cannot see.",
        "Watch where you take a bathroom break.",
        "If you need to urinate in the bush, be careful about where you do so.",
        "While it's natural to want to hide from your human companions, you don't want to do so at the expense of getting bitten.",
        "Look carefully as you go to a toilet spot, check around the spot and avoid anywhere near a rocky outcrop, long grass or logs.",
        "Of course, take the usual precautions for not fouling waterways either!",
        "Stay alert all the time and finish your business quickly.",
        "If you are using the bush for urinating at night, always wear shoes and take light.",
        "Be careful at night.",
        "Snakes will naturally gravitate towards warm roads and pathways when these have residual heat as darkness falls because this helps them to keep warm.",
        "If using such areas at night, carry a light and use it to be totally aware of what is on the path ahead of you.",
        "Avoid night hiking in areas where you cannot see ahead or around you or where you would be forced to walk through heavily wooded or tall grassy areas.",
        "Avoiding Snakes While Camping Check your tent before leaving your house.",
        "This is part of routine maintenance.",
        "A tent used in snake country must have no holes in it at all, otherwise it's not a serviceable tent and you'll may get water, bugs and other creatures, as well as snakes, coming in if it has holes.",
        "Check that the zippers work and that the tent is in good condition.",
        "Choose a campsite which is away from bush and tall clumps of grass.",
        "Choose a clearing where you can see the ground without any problems.",
        "Avoid rocky outcrops and low-hanging branches as campsites.",
        "Keep your tent zippered closed at all times.",
        "Instruct all users, no matter how young or old, to keep the tents fully zippered up.",
        "This is a golden rule of camping.",
        "A snake can slide in though the smallest of gaps, so instruct everyone to keep the zipper join(s) up towards the top, allowing you to be sure that the base area of the tent is fully closed.",
        "Keep all sleeping bags rolled up.",
        "Unfold at night just before you go to bed.",
        "This allows you to survey the tent as a whole before getting into it, and you can be sure there isn't a snake snuggled in the end of your sleeping bag before you put your toes in.",
        "If you couldn't keep sleeping gear safely secured away or you're just unsure if it was kept safely enough, shake it out before using it.",
        "It is better to have a snake drop out and slither off than to put your bare feet into a bag with a snake inside.",
        "Keep all footwear inside the tent or car at all times.",
        "Snakes find boots and shoes enticing hiding holes; indeed, snakes up to a metre long can curl into a boot.",
        "If you cannot keep them inside the tent or car, pull your socks over the hole of each shoe or boot to prevent entry (or stuff the socks inside).",
        "This is a good practice when hiking and camping anyway, as not only snakes like crawling into boots.",
        "Check boots before putting them on.",
        "Tip them upside down and give them a good shake.",
        "Do not put your hand inside; use a long stick if you need to prod inside the boot.",
        "Practice good camp tidiness.",
        "Do not leave anything about that could hide a snake seeking cover.",
        "This means keeping blankets, picnic rugs, towels, clothing, bags, etc., inside the closed car or tent.",
        "Do not leave such items on the ground when not in use and not attended.",
        "Keep all containers closed when not being used, from ice boxes to food bags.",
        "After all, you're out in nature to enjoy its natural state.",
        "Do not leave rubbish or garbage around; it attracts mice and rats, which in turn attract snakes.",
        "Yet another great reason to keep your outdoors experience litter-free.",
        "Use lighting whenever walking around the campsite.",
        "Stumbling in the dark is its own hazard without adding treading on a snake as well, so it's essential to carry a light at all times when moving about.",
        "Do not pick up anything without first shining light onto it, to be sure that you are picking up something safe.",
        "Keep car doors shut at all times.",
        "No need to invite a snake into the hiding sanctuary it might view your car as.",
        "Sometimes snakes like to go underneath cars to stay protected from the open air and still have contact with the warm asphalt.",
        "If you have parked somewhere that snakes are likely to be around, be aware of this possibility.",
        "Get into the car quickly and shut the door straight away; don't stand next to the car for too long or lean on or lean your legs out of the car in case there is a snake frightened out of its slumber by your presence.",
        "Avoiding Water Snakes Know where the water contains snakes.",
        "Water snakes are usually deadly and it's unlikely you can get help quickly enough after being bitten, so avoiding them is your only line of safety.",
        "If you know water snakes are in a body of water, the safest thing is to stay out of the water.",
        "There are plenty of safe places to go swimming in the world, so choose those places for your next trip.",
        "Avoid going into rivers or other water bodies after heavy rains.",
        "Even if the water is usually safe, the heavy rains may have caused snakes that are usually land-lubbers to get caught up in the water and they'll be attempting to get back to safety.",
        "Removing Yourself from a Snake Encounter Outdoors Stay calm.",
        "Panicking will cause you to think poorly.",
        "You might also move in the wrong direction or move too quickly and cause the snake to view you as a threat.",
        "By staying calm, you remain level-headed and can initiate your retreat with care and good sense.",
        "Yelling at a snake makes no difference, it cannot hear what you are saying.",
        "However, calmly warning your walking companions to slowly back off is a sensible use of your voice.",
        "Do not approach the snake.",
        "Remembering that all a snake wants to do is get away from you, give it the space and opportunity to do so.",
        "Snakes need to be quite close to be able to bite you and the striking distance for most snakes is usually half the snake's body length.",
        "Thus, by not approaching any farther, you will usually have reduced the risk to negligible.The striking distance for some snakes is less because they are bigger or more agile, such as the Western Taipan.",
        "The more distance between you and the snake, clearly the safer.",
        "Stay still and keep movements to a minimum.",
        "While the snake isn't listening to your conversation, its excellent eyesight is watching you for sudden and scary movements.",
        "Snakes are easily startled by sudden movement, as this is its alert mechanism for a threat.",
        "Jumping up and down and flailing your arms around can easily be interpreted as hostile intent by a snake.",
        "Wait, keeping still.",
        "Provided you are at a safe distance from the snake, stop and let the snake move on.",
        "If the snake has realized you are there, it will often leave of its own accord while you aren't making any movement, to avoid you.",
        "However, if the snake proves stubborn in its wish to stay where it is, leave it alone and walk around it at a safe distance.",
        "If you cannot go around the snake due to the path being the only way forward, try stomping the ground on the spot, to produce more vibrations.",
        "However, only do this if you are a very safe (long) distance away from the snake, as stomping movement and vibrations can be perceived by the snake as a threat and it may strike instead of move.A snake has a short attention span, usually lasting less than a minute.",
        "Hence, once it has slithered away from you, it has forgotten about you and goes about its business elsewhere.",
        "It's not harbouring thoughts of coming back to chase you.",
        "Do not harass the snake.",
        "Do not throw anything at the snake, as this will only cause it to view you as a threat.",
        "Do not attempt to poke it or pick it up; both actions are likely to cause it to bite.",
        "Most snakebites occur as a result of a human interfering directly with the snake, such as poking it, picking it up, or trying to kill it.",
        "Leave the snake be, and most times it'll leave you be too.",
        "Retreat if you have accidentally cornered a snake.",
        "To do this, back away slowly and avoid sudden movement.",
        "Do not make any sudden movements, as that is what prey would do and some snakes wait for such movements to strike out (such as the death adder).",
        "Make as little vibration and movement as possible when slowly backing out, as this will avoid stoking the snake's innate compulsion to strike out at fast moving prey.If the snake is within strike range, you may be better off remaining completely motionless and letting it pass by.",
        "If you are between the snake and where it wants to go, it may wish to come past you as part of its escape strategy.",
        "If this does happen, stay absolutely still and let the snake slide on by.",
        "If it slides over your boots, keep very still and let it pass on by.",
        "Stay motionless until the snake passes.",
        "Never deliberately corner a snake.",
        "That's asking for being bitten and reflects poor decision-making.",
        "Keep an eye on a snake that is retreating.",
        "Make sure you leave in the opposite direction, to avoid disturbing it again.",
        "Do not follow the snake for any reason.",
        "Avoiding Snakes Around and In the Home Keep the doors to your house, sheds and pet housing closed if you live in an area where snakes like to crawl in.",
        "They won't hesitate to come through a door if the entrance is easy for them and they perceive nice hiding holes, water and even food opportunities inside.",
        "If snakes are known to be in your garden or yard, assume they can come inside any structure too.",
        "If there is enough space under the door for a snake to slide through, cover it with a strong rubber seal or weather stripping.",
        "This will also keep out mice, rats, dirt and dust, and the like.",
        "Avoid making enticing homes for rats and mice and for snakes.",
        "This includes keeping the yard tidy and not building wood piles or other messy piles in the yard.",
        "The snakes will be attracted by rat and mouse homes, and might also decide it's cozy enough to move in for good.Wood stored for fires in winter should be kept well away from the house.",
        "It is best kept inside a secure shed that has no opening to outside; use a concrete floor as the base.",
        "Keep the grass short.",
        "There is a fine balance between short enough to see snakes and high enough to save water but as long as its even and you can see across and through it with ease, then you will be able to spot any snakes passing through.",
        "When gardening, wear thick leather gloves, to protect your hands when touching plants and working around soil and compost.",
        "Prevent other sources of possible entrance to your house.",
        "Seal any holes, gaps and cracks around your house that may allow for snakes or other nasty critters to crawl in.",
        "Do an underfloor, wall and roof inspection for possible entrance ways.",
        "Remove food sources for snakes.",
        "Attracting wildlife to your garden through feeding it can also attract the snakes that eat the wildlife.",
        "Bird feeders, bread pieces or even cat and dog food, can attract the snakes to your backyard, in search of the prey eating the food you've left out.",
        "If you want to feed birds, clean up the mess left behind daily, to avoid birds settling on the ground frequently.Snakes need water too.",
        "If you leave water out for animals, keep it well away from the house.",
        "If you have a pond, pool or other water feature, keep the grass low around it, to help you to see if a snake has come for a drink.",
        "Check your compost bin's accessibility.",
        "Any compost bin that becomes a rat and mouse haven also becomes a snake's feasting point.",
        "Ensure that no small beasts are residing in your compost by checking it and turning it frequently.",
        "Do not add eggshells to the compost, as rodents enjoy eating these.",
        "Do not compost food scraps in open heaps.",
        "This makes it easy for rats and mice to feed off and they'll gather around.",
        "Use sticks to poke compost before picking it up with your hands.",
        "This applies to all garden piles, such as mulch and leaf heaps.",
        "Removing Yourself from a Snake Encounter Indoors Determine that there is a snake in the house.",
        "Usually this will be by site but sometimes you might be aware due to someone else notifying you, hearing snake rustling (if you're familiar with the sound).",
        "Stay calm and move slowly; upsetting the snake can cause it to hide somewhere else, which may make it even harder to find and remove.",
        "Leave the snake well alone; do not try to capture, kill or remove it.",
        "Remove everyone from the room where the snake has been discovered.",
        "Have children leave quietly and quickly.",
        "This includes all pets, even fish if possible.",
        "Lock pets away somewhere safe.Only remove pets and fish tanks if this does not endanger you.",
        "Shut the door to the room where you have discovered the snake.",
        "If the base of the door would allow a snake to crawl under, block it with newspaper, rolled-up towels or a draft (draught) stopper.",
        "Inform all family members that the room is out of bounds.",
        "Lock it if possible.",
        "Alternatively, shut (and block) all internal doors except for the room the snake is in and leave external doors open, to encourage the snake to leave.",
        "If you know there is a snake in the house but you don't know where, vacate the whole house; remember to lock your doors if leaving the property, to avoid being burgled while seeking help or sitting it out at the neighbour's.",
        "If it's possible, put signs on the doors explaining that there is a snake inside, especially if family members cannot be reached but might return home before you get back.",
        "Call for help.",
        "Call a professional snake handler.",
        "If you cannot find one, call your local municipality or the local police for assistance and they will be able to direct you to the appropriate help.",
        "Wait for help.",
        "Unless you're a professional snake handler, this is your best option.",
        "Do not attempt to handle the snake or shoo it away.",
        "If you take photos of it, do so through a window.",
        "Instagram or Facebook are not worth being bitten by a startled snake.",
        "If it is safe to do so, keep an eye on the snake as this increases the chances that the snake handler will catch it and not have to spend a lot of time locating it."
    ]
}