{
    "title": "How to Look Girly",
    "url": "https://www.wikihow.com/Look-Girly",
    "category_hierarchy": [
        "Personal Care and Style",
        "Fashion",
        "Fashion Styles"
    ],
    "parts": [
        {
            "name": "Donning Girly Clothes",
            "steps": [
                {
                    "headline": "Choose flattering, cute bottoms.",
                    "description": "Jeans should be formfitting. Go for light washes. If you're wearing a skirt, make sure it's wavy and bright. Make sure your skirts aren't too short."
                },
                {
                    "headline": "Do not wear shirts that are too tight or loose.",
                    "description": "Choose good styles such as baby-doll, empire, t-shirts, halter, peplum, spaghetti straps, and tank tops."
                },
                {
                    "headline": "Wear shorts.",
                    "description": "Make sure the pockets aren't hanging out or that they ride up on you. Alternatively, wear Capri pants, and long shorts that go to your thigh or your mid-calf."
                },
                {
                    "headline": "Wear dresses.",
                    "description": "Dresses are essential for the girly look. All lengths are possible. Choose dresses with floral patterns, plain girly colors, stripes, or swirls."
                }
            ]
        },
        {
            "name": "Adding Girly Footwear and Accessories",
            "steps": [
                {
                    "headline": "Wear flats, heels, flip-flops, or boots.",
                    "description": "If you need to wear sneakers, try finding converse in bright colors."
                },
                {
                    "headline": "Try to glam up your clothes by adding jewelry, fun belts, etc.",
                    "description": "Accessories are a fun part of being a girly girl."
                },
                {
                    "headline": "Wear some lip gloss, or blush.",
                    "description": "Don't wear too much or it could look like you're wearing an ugly mask. Look confident with your makeup. Curl your lashes, and apply some mascara.If you have acne, use foundation to cover it up. Paint your nails pretty colors, and if you want, create a pattern with different colors! Do not overdo the makeup. Keep it simple and natural, for a fresh look."
                }
            ]
        },
        {
            "name": "Showing Girly Behavior",
            "steps": [
                {
                    "headline": "Pay attention to your image.",
                    "description": "Have good hygiene and wear what flatters you."
                },
                {
                    "headline": "Be active.",
                    "description": "Exercise, and eat healthy. Don't try starving yourself as this will lead to anorexia. Be as healthy as you can be, everybody has different body types, curvy or stick-thin."
                },
                {
                    "headline": "Study!",
                    "description": "Just because you are pretty doesn't mean you can't be smart and brainy. If you want to make even more friends, have a study group come over before an exam."
                },
                {
                    "headline": "Don't take this article too seriously.",
                    "description": "Find the style that suits you best, flatters you, and catapults you into the girly stratosphere. Or not. It's totes up to you."
                }
            ]
        }
    ],
    "tyn": [
        "Cute shoes",
        "Makeup",
        "Breath mints",
        "Fashionable purse",
        "Feminine clothes",
        "Nail polish",
        "Bow or headband (optional)",
        "Cute hand bag"
    ],
    "text": " Donning Girly Clothes Choose flattering, cute bottoms. Jeans should be formfitting. Go for light washes. If you're wearing a skirt, make sure it's wavy and bright. Make sure your skirts aren't too short. Do not wear shirts that are too tight or loose. Choose good styles such as baby-doll, empire, t-shirts, halter, peplum, spaghetti straps, and tank tops. Wear shorts. Make sure the pockets aren't hanging out or that they ride up on you. Alternatively, wear Capri pants, and long shorts that go to your thigh or your mid-calf. Wear dresses. Dresses are essential for the girly look. All lengths are possible. Choose dresses with floral patterns, plain girly colors, stripes, or swirls. Adding Girly Footwear and Accessories Wear flats, heels, flip-flops, or boots. If you need to wear sneakers, try finding converse in bright colors. Try to glam up your clothes by adding jewelry, fun belts, etc. Accessories are a fun part of being a girly girl. Wear some lip gloss, or blush. Don't wear too much or it could look like you're wearing an ugly mask. Look confident with your makeup. Curl your lashes, and apply some mascara.If you have acne, use foundation to cover it up. Paint your nails pretty colors, and if you want, create a pattern with different colors! Do not overdo the makeup. Keep it simple and natural, for a fresh look. Showing Girly Behavior Pay attention to your image. Have good hygiene and wear what flatters you. Be active. Exercise, and eat healthy. Don't try starving yourself as this will lead to anorexia. Be as healthy as you can be, everybody has different body types, curvy or stick-thin. Study! Just because you are pretty doesn't mean you can't be smart and brainy. If you want to make even more friends, have a study group come over before an exam. Don't take this article too seriously. Find the style that suits you best, flatters you, and catapults you into the girly stratosphere. Or not. It's totes up to you.",
    "sentences": [
        " Donning Girly Clothes Choose flattering, cute bottoms.",
        "Jeans should be formfitting.",
        "Go for light washes.",
        "If you're wearing a skirt, make sure it's wavy and bright.",
        "Make sure your skirts aren't too short.",
        "Do not wear shirts that are too tight or loose.",
        "Choose good styles such as baby-doll, empire, t-shirts, halter, peplum, spaghetti straps, and tank tops.",
        "Wear shorts.",
        "Make sure the pockets aren't hanging out or that they ride up on you.",
        "Alternatively, wear Capri pants, and long shorts that go to your thigh or your mid-calf.",
        "Wear dresses.",
        "Dresses are essential for the girly look.",
        "All lengths are possible.",
        "Choose dresses with floral patterns, plain girly colors, stripes, or swirls.",
        "Adding Girly Footwear and Accessories Wear flats, heels, flip-flops, or boots.",
        "If you need to wear sneakers, try finding converse in bright colors.",
        "Try to glam up your clothes by adding jewelry, fun belts, etc.",
        "Accessories are a fun part of being a girly girl.",
        "Wear some lip gloss, or blush.",
        "Don't wear too much or it could look like you're wearing an ugly mask.",
        "Look confident with your makeup.",
        "Curl your lashes, and apply some mascara.If you have acne, use foundation to cover it up.",
        "Paint your nails pretty colors, and if you want, create a pattern with different colors!",
        "Do not overdo the makeup.",
        "Keep it simple and natural, for a fresh look.",
        "Showing Girly Behavior Pay attention to your image.",
        "Have good hygiene and wear what flatters you.",
        "Be active.",
        "Exercise, and eat healthy.",
        "Don't try starving yourself as this will lead to anorexia.",
        "Be as healthy as you can be, everybody has different body types, curvy or stick-thin.",
        "Study!",
        "Just because you are pretty doesn't mean you can't be smart and brainy.",
        "If you want to make even more friends, have a study group come over before an exam.",
        "Don't take this article too seriously.",
        "Find the style that suits you best, flatters you, and catapults you into the girly stratosphere.",
        "Or not.",
        "It's totes up to you."
    ]
}