{
    "title": "How to Make Cucumber Salad",
    "url": "https://www.wikihow.com/Make-Cucumber-Salad",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Salads",
        "Traditional Salads"
    ],
    "methods": [
        {
            "name": "Making Basic Cucumber Salad",
            "steps": [
                {
                    "headline": "Place the thinly sliced cucumbers into a small bowl.",
                    "description": "You can use the bowl you will be serving the salad in, or you can use a different bowl. You will eventually be chilling the salad for a few hours, then draining it. Try to use a seedless cucumber. If your cucumber has seeds in it, you will need to core it first."
                },
                {
                    "headline": "Prepare the dressing.",
                    "description": "Pour the vinegar and water into a jar. Add the sugar, salt, and pepper. Close the jar tightly, then shake it to combine the ingredients. If you don't have a jar, you can use a plastic container with a tight-fitting lid. You can also prepare the dressing in a cup and stir it briskly with a fork or mini whisk."
                },
                {
                    "headline": "Pour the dressing over the cucumbers.",
                    "description": "Gently toss the cucumbers to help distribute the dressing."
                },
                {
                    "headline": "Cover and refrigerate the cucumbers.",
                    "description": "Cover the bowl with a piece of plastic wrap. Place the bowl into the fridge and leave it there for at least 3 hours. This will allow the cucumbers to soak up the flavors from the dressing."
                },
                {
                    "headline": "Drain the cucumbers.",
                    "description": "Peel the plastic wrap off of the bowl. Dump the salad into a strainer or colander. Shake the strainer or colander over a sink to get rid of any excess moisture."
                },
                {
                    "headline": "Place the cucumbers into a serving bowl.",
                    "description": "Toss them with some chopped fresh dill or parsley, if desired. Serve the salad immediately, or refrigerate it until you are ready to serve it."
                }
            ]
        },
        {
            "name": "Making Creamy Cucumber Salad",
            "steps": [
                {
                    "headline": "Toss the cucumbers with some salt in a colander.",
                    "description": "Place the thinly-sliced cucumbers into a colander or strainer. Sprinkle ½ teaspoon of salt over them. Toss the cucumbers together to distribute the salt."
                },
                {
                    "headline": "Leave the cucumbers for 1 hour so that they can drain.",
                    "description": "If your sink is very clean, you can set to colander into it during this time. You can also set the colander or strainer into a large bowl instead. Do not refrigerate the cucumbers during this time."
                },
                {
                    "headline": "Drain the cucumbers.",
                    "description": "Lift the colander or strainer out of the bowl and shake it to dislodge any moisture. Pour any liquid that's in the bowl into the sink, then wipe the bowl clean."
                },
                {
                    "headline": "Pat the cucumbers dry with paper towels.",
                    "description": "Cover your work surface with paper towels. Spread the cucumbers on top in an even layer. Cover them with another layer of paper towels. Gently press on the paper towels to soak up any excess moisture."
                },
                {
                    "headline": "Prepare the dressing in the serving bowl.",
                    "description": "Place the sour cream into the bowl, then add the chopped dill or chives. Pour in the vinegar, then add in the pepper and the rest of the salt. Mix everything together with a fork or whisk. If you don't like vinegar, or don't have any, use lemon juice instead. If you don't like sour cream, or can't find it, try plain yogurt instead."
                },
                {
                    "headline": "Stir the cucumbers into the bowl.",
                    "description": "Add the cucumbers to the bowl first. Gently stir them in using a large spoon or rubber spatula. Be sure to scrape the bottom and sides of the bowl often."
                },
                {
                    "headline": "Serve the salad immediately.",
                    "description": "If you prepared it ahead of time, cover the bowl with plastic wrap, then leave it in the fridge for up to 24 hours."
                }
            ]
        },
        {
            "name": "Greek Cucumber Salad",
            "steps": [
                {
                    "headline": "Toss the cucumbers with the salt in a strainer.",
                    "description": "Place a strainer or a colander into a bowl. Add the cucumbers and a generous pinch of salt. Toss the cucumbers and salt together. Don't use the serving bowl for this."
                },
                {
                    "headline": "Prepare the dressing.",
                    "description": "Pour the lemon juice and olive oil into a small bowl. Add the lemon zest, then whisk everything together with a fork or mini whisk. Set the dressing aside while you prepare the rest of the salad."
                },
                {
                    "headline": "Mix together the rest of the ingredients in a separate bowl.",
                    "description": "Place the feta cheese into your serving bowl. Add the oregano, garlic, and shallots. Toss them together with a pair of salad tongs until everything is evenly combined. Use the serving bowl for this strep."
                },
                {
                    "headline": "Drain the cucumbers, then add them to the bowl.",
                    "description": "Lift the strainer or colander out of the bowl. Jiggle it to shake off any excess moisture. Add the cucumbers to the salad bowl."
                },
                {
                    "headline": "Toss the salad with the dressing.",
                    "description": "Pour the dressing over the salad. Use a pair of salad tongs to toss everything together. Make sure that you gather the salad from the bottom of the bowl."
                },
                {
                    "headline": "Serve the salad immediately.",
                    "description": "If you won't be serving it right away, cover it with a sheet of plastic wrap, and store it in the fridge until serving time."
                }
            ]
        },
        {
            "name": "Making Japanese Cucumber Salad",
            "steps": [
                {
                    "headline": "Toast the sesame seeds, if needed.",
                    "description": "If the sesame seeds you bought are already toasted, you can skip this step. Otherwise, toast the sesame seeds in a dry skillet over low heat, stirring constantly. After about 2 minutes, they will turn golden and fragrant. Pour them onto a small dish so that they can cool off."
                },
                {
                    "headline": "Peel the cucumbers.",
                    "description": "You can peel them completely, or peel them in alternating stripes for a nicer presentation."
                },
                {
                    "headline": "Core the cucumbers.",
                    "description": "Slice the cucumbers in half lengthwise. Scrape the seeds out with a spoon and discard them. You should do this even if you are using a \"seedless\" variety."
                },
                {
                    "headline": "Cut the cucumbers into very thin slices.",
                    "description": "You can do this with a sharp knife or a food processor. The slices need to be almost paper thin."
                },
                {
                    "headline": "Press the cucumbers between paper towels to soak up any moisture.",
                    "description": "Cover your work surface with a paper towel. Spread the cucumbers in an even layer on top, then lay another paper towel on top. Gently pat the paper towel to soak up any excess moisture."
                },
                {
                    "headline": "Prepare the dressing in the serving bowl.",
                    "description": "Pour the vinegar into a medium-sized serving bowl. Add the sugar and the salt. Stir everything together with a fork or mini whisk until the salt and sugar dissolve."
                },
                {
                    "headline": "Add the cucumbers the sesame seeds into the bowl.",
                    "description": "Toss everything together with a pair of salad tongs. Make sure that you grab the cucumbers from the bottom of the bowl as well."
                },
                {
                    "headline": "Serve the salad immediately.",
                    "description": "Japanese cucumber salad is a great accompaniment to many Japanese dishes, including sushi and sashimi."
                }
            ]
        },
        {
            "name": "Thai Cucumber Salad",
            "steps": [
                {
                    "headline": "Prepare the dressing.",
                    "description": "Pour the vinegar into a small bowl. Add the sugar, sesame oil, red pepper flakes, and salt. Mix them together with a fork or mini whisk, then set the bowl aside. This will give the flavors time to blend while you prepare the rest of the salad."
                },
                {
                    "headline": "Peel and slice the cucumbers.",
                    "description": "Try to slice the cucumbers as thinly as you can. If they have large seeds in them, you will need to core them first. Place the cucumbers into a large serving bowl when you are done."
                },
                {
                    "headline": "Add the peanuts and the green onions into the bowl.",
                    "description": "If you can't find any chopped peanuts in the store, you can shell and chop regular peanuts using a sharp knife. You can also pulse them for a few seconds in a food processor instead."
                },
                {
                    "headline": "Stir the dressing into the salad.",
                    "description": "Pour the dressing over the salad, then toss the salad using a pair of salad tongs. Be sure to grab the salad from the bottom of the bowl so that everything gets evenly coated with dressing. If the dressing settle or separated, give it a brisk stir first."
                },
                {
                    "headline": "Serve the salad immediately.",
                    "description": "If you can't serve to right away, cover it with a sheet of plastic wrap and store it in the fridge. You will need to toss it once more just before serving."
                }
            ]
        }
    ],
    "tyn": [
        "Making Basic Cucumber Salad",
        "Small bowl",
        "Jar or cup and fork",
        "Plastic wrap",
        "Refrigerator",
        "Making Creamy Cucumber Salad",
        "Colander or strainer",
        "Serving bowl",
        "Paper towels",
        "Fork or whisk",
        "Mixing spoon",
        "Salad tongs",
        "Greek Cucumber Salad",
        "Medium-sized mixing bowl",
        "Small mixing bowl",
        "Fork or mini whisk",
        "Making Japanese Cucumber Salad",
        "Small skillet (optional)",
        "Vegetable peeler",
        "Sharp knife",
        "Thai Cucumber Salad"
    ],
    "text": " Making Basic Cucumber Salad Place the thinly sliced cucumbers into a small bowl. You can use the bowl you will be serving the salad in, or you can use a different bowl. You will eventually be chilling the salad for a few hours, then draining it. Try to use a seedless cucumber. If your cucumber has seeds in it, you will need to core it first. Prepare the dressing. Pour the vinegar and water into a jar. Add the sugar, salt, and pepper. Close the jar tightly, then shake it to combine the ingredients. If you don't have a jar, you can use a plastic container with a tight-fitting lid. You can also prepare the dressing in a cup and stir it briskly with a fork or mini whisk. Pour the dressing over the cucumbers. Gently toss the cucumbers to help distribute the dressing. Cover and refrigerate the cucumbers. Cover the bowl with a piece of plastic wrap. Place the bowl into the fridge and leave it there for at least 3 hours. This will allow the cucumbers to soak up the flavors from the dressing. Drain the cucumbers. Peel the plastic wrap off of the bowl. Dump the salad into a strainer or colander. Shake the strainer or colander over a sink to get rid of any excess moisture. Place the cucumbers into a serving bowl. Toss them with some chopped fresh dill or parsley, if desired. Serve the salad immediately, or refrigerate it until you are ready to serve it. Making Creamy Cucumber Salad Toss the cucumbers with some salt in a colander. Place the thinly-sliced cucumbers into a colander or strainer. Sprinkle ½ teaspoon of salt over them. Toss the cucumbers together to distribute the salt. Leave the cucumbers for 1 hour so that they can drain. If your sink is very clean, you can set to colander into it during this time. You can also set the colander or strainer into a large bowl instead. Do not refrigerate the cucumbers during this time. Drain the cucumbers. Lift the colander or strainer out of the bowl and shake it to dislodge any moisture. Pour any liquid that's in the bowl into the sink, then wipe the bowl clean. Pat the cucumbers dry with paper towels. Cover your work surface with paper towels. Spread the cucumbers on top in an even layer. Cover them with another layer of paper towels. Gently press on the paper towels to soak up any excess moisture. Prepare the dressing in the serving bowl. Place the sour cream into the bowl, then add the chopped dill or chives. Pour in the vinegar, then add in the pepper and the rest of the salt. Mix everything together with a fork or whisk. If you don't like vinegar, or don't have any, use lemon juice instead. If you don't like sour cream, or can't find it, try plain yogurt instead. Stir the cucumbers into the bowl. Add the cucumbers to the bowl first. Gently stir them in using a large spoon or rubber spatula. Be sure to scrape the bottom and sides of the bowl often. Serve the salad immediately. If you prepared it ahead of time, cover the bowl with plastic wrap, then leave it in the fridge for up to 24 hours. Greek Cucumber Salad Toss the cucumbers with the salt in a strainer. Place a strainer or a colander into a bowl. Add the cucumbers and a generous pinch of salt. Toss the cucumbers and salt together. Don't use the serving bowl for this. Prepare the dressing. Pour the lemon juice and olive oil into a small bowl. Add the lemon zest, then whisk everything together with a fork or mini whisk. Set the dressing aside while you prepare the rest of the salad. Mix together the rest of the ingredients in a separate bowl. Place the feta cheese into your serving bowl. Add the oregano, garlic, and shallots. Toss them together with a pair of salad tongs until everything is evenly combined. Use the serving bowl for this strep. Drain the cucumbers, then add them to the bowl. Lift the strainer or colander out of the bowl. Jiggle it to shake off any excess moisture. Add the cucumbers to the salad bowl. Toss the salad with the dressing. Pour the dressing over the salad. Use a pair of salad tongs to toss everything together. Make sure that you gather the salad from the bottom of the bowl. Serve the salad immediately. If you won't be serving it right away, cover it with a sheet of plastic wrap, and store it in the fridge until serving time. Making Japanese Cucumber Salad Toast the sesame seeds, if needed. If the sesame seeds you bought are already toasted, you can skip this step. Otherwise, toast the sesame seeds in a dry skillet over low heat, stirring constantly. After about 2 minutes, they will turn golden and fragrant. Pour them onto a small dish so that they can cool off. Peel the cucumbers. You can peel them completely, or peel them in alternating stripes for a nicer presentation. Core the cucumbers. Slice the cucumbers in half lengthwise. Scrape the seeds out with a spoon and discard them. You should do this even if you are using a \"seedless\" variety. Cut the cucumbers into very thin slices. You can do this with a sharp knife or a food processor. The slices need to be almost paper thin. Press the cucumbers between paper towels to soak up any moisture. Cover your work surface with a paper towel. Spread the cucumbers in an even layer on top, then lay another paper towel on top. Gently pat the paper towel to soak up any excess moisture. Prepare the dressing in the serving bowl. Pour the vinegar into a medium-sized serving bowl. Add the sugar and the salt. Stir everything together with a fork or mini whisk until the salt and sugar dissolve. Add the cucumbers the sesame seeds into the bowl. Toss everything together with a pair of salad tongs. Make sure that you grab the cucumbers from the bottom of the bowl as well. Serve the salad immediately. Japanese cucumber salad is a great accompaniment to many Japanese dishes, including sushi and sashimi. Thai Cucumber Salad Prepare the dressing. Pour the vinegar into a small bowl. Add the sugar, sesame oil, red pepper flakes, and salt. Mix them together with a fork or mini whisk, then set the bowl aside. This will give the flavors time to blend while you prepare the rest of the salad. Peel and slice the cucumbers. Try to slice the cucumbers as thinly as you can. If they have large seeds in them, you will need to core them first. Place the cucumbers into a large serving bowl when you are done. Add the peanuts and the green onions into the bowl. If you can't find any chopped peanuts in the store, you can shell and chop regular peanuts using a sharp knife. You can also pulse them for a few seconds in a food processor instead. Stir the dressing into the salad. Pour the dressing over the salad, then toss the salad using a pair of salad tongs. Be sure to grab the salad from the bottom of the bowl so that everything gets evenly coated with dressing. If the dressing settle or separated, give it a brisk stir first. Serve the salad immediately. If you can't serve to right away, cover it with a sheet of plastic wrap and store it in the fridge. You will need to toss it once more just before serving.",
    "sentences": [
        " Making Basic Cucumber Salad Place the thinly sliced cucumbers into a small bowl.",
        "You can use the bowl you will be serving the salad in, or you can use a different bowl.",
        "You will eventually be chilling the salad for a few hours, then draining it.",
        "Try to use a seedless cucumber.",
        "If your cucumber has seeds in it, you will need to core it first.",
        "Prepare the dressing.",
        "Pour the vinegar and water into a jar.",
        "Add the sugar, salt, and pepper.",
        "Close the jar tightly, then shake it to combine the ingredients.",
        "If you don't have a jar, you can use a plastic container with a tight-fitting lid.",
        "You can also prepare the dressing in a cup and stir it briskly with a fork or mini whisk.",
        "Pour the dressing over the cucumbers.",
        "Gently toss the cucumbers to help distribute the dressing.",
        "Cover and refrigerate the cucumbers.",
        "Cover the bowl with a piece of plastic wrap.",
        "Place the bowl into the fridge and leave it there for at least 3 hours.",
        "This will allow the cucumbers to soak up the flavors from the dressing.",
        "Drain the cucumbers.",
        "Peel the plastic wrap off of the bowl.",
        "Dump the salad into a strainer or colander.",
        "Shake the strainer or colander over a sink to get rid of any excess moisture.",
        "Place the cucumbers into a serving bowl.",
        "Toss them with some chopped fresh dill or parsley, if desired.",
        "Serve the salad immediately, or refrigerate it until you are ready to serve it.",
        "Making Creamy Cucumber Salad Toss the cucumbers with some salt in a colander.",
        "Place the thinly-sliced cucumbers into a colander or strainer.",
        "Sprinkle ½ teaspoon of salt over them.",
        "Toss the cucumbers together to distribute the salt.",
        "Leave the cucumbers for 1 hour so that they can drain.",
        "If your sink is very clean, you can set to colander into it during this time.",
        "You can also set the colander or strainer into a large bowl instead.",
        "Do not refrigerate the cucumbers during this time.",
        "Drain the cucumbers.",
        "Lift the colander or strainer out of the bowl and shake it to dislodge any moisture.",
        "Pour any liquid that's in the bowl into the sink, then wipe the bowl clean.",
        "Pat the cucumbers dry with paper towels.",
        "Cover your work surface with paper towels.",
        "Spread the cucumbers on top in an even layer.",
        "Cover them with another layer of paper towels.",
        "Gently press on the paper towels to soak up any excess moisture.",
        "Prepare the dressing in the serving bowl.",
        "Place the sour cream into the bowl, then add the chopped dill or chives.",
        "Pour in the vinegar, then add in the pepper and the rest of the salt.",
        "Mix everything together with a fork or whisk.",
        "If you don't like vinegar, or don't have any, use lemon juice instead.",
        "If you don't like sour cream, or can't find it, try plain yogurt instead.",
        "Stir the cucumbers into the bowl.",
        "Add the cucumbers to the bowl first.",
        "Gently stir them in using a large spoon or rubber spatula.",
        "Be sure to scrape the bottom and sides of the bowl often.",
        "Serve the salad immediately.",
        "If you prepared it ahead of time, cover the bowl with plastic wrap, then leave it in the fridge for up to 24 hours.",
        "Greek Cucumber Salad Toss the cucumbers with the salt in a strainer.",
        "Place a strainer or a colander into a bowl.",
        "Add the cucumbers and a generous pinch of salt.",
        "Toss the cucumbers and salt together.",
        "Don't use the serving bowl for this.",
        "Prepare the dressing.",
        "Pour the lemon juice and olive oil into a small bowl.",
        "Add the lemon zest, then whisk everything together with a fork or mini whisk.",
        "Set the dressing aside while you prepare the rest of the salad.",
        "Mix together the rest of the ingredients in a separate bowl.",
        "Place the feta cheese into your serving bowl.",
        "Add the oregano, garlic, and shallots.",
        "Toss them together with a pair of salad tongs until everything is evenly combined.",
        "Use the serving bowl for this strep.",
        "Drain the cucumbers, then add them to the bowl.",
        "Lift the strainer or colander out of the bowl.",
        "Jiggle it to shake off any excess moisture.",
        "Add the cucumbers to the salad bowl.",
        "Toss the salad with the dressing.",
        "Pour the dressing over the salad.",
        "Use a pair of salad tongs to toss everything together.",
        "Make sure that you gather the salad from the bottom of the bowl.",
        "Serve the salad immediately.",
        "If you won't be serving it right away, cover it with a sheet of plastic wrap, and store it in the fridge until serving time.",
        "Making Japanese Cucumber Salad Toast the sesame seeds, if needed.",
        "If the sesame seeds you bought are already toasted, you can skip this step.",
        "Otherwise, toast the sesame seeds in a dry skillet over low heat, stirring constantly.",
        "After about 2 minutes, they will turn golden and fragrant.",
        "Pour them onto a small dish so that they can cool off.",
        "Peel the cucumbers.",
        "You can peel them completely, or peel them in alternating stripes for a nicer presentation.",
        "Core the cucumbers.",
        "Slice the cucumbers in half lengthwise.",
        "Scrape the seeds out with a spoon and discard them.",
        "You should do this even if you are using a \"seedless\" variety.",
        "Cut the cucumbers into very thin slices.",
        "You can do this with a sharp knife or a food processor.",
        "The slices need to be almost paper thin.",
        "Press the cucumbers between paper towels to soak up any moisture.",
        "Cover your work surface with a paper towel.",
        "Spread the cucumbers in an even layer on top, then lay another paper towel on top.",
        "Gently pat the paper towel to soak up any excess moisture.",
        "Prepare the dressing in the serving bowl.",
        "Pour the vinegar into a medium-sized serving bowl.",
        "Add the sugar and the salt.",
        "Stir everything together with a fork or mini whisk until the salt and sugar dissolve.",
        "Add the cucumbers the sesame seeds into the bowl.",
        "Toss everything together with a pair of salad tongs.",
        "Make sure that you grab the cucumbers from the bottom of the bowl as well.",
        "Serve the salad immediately.",
        "Japanese cucumber salad is a great accompaniment to many Japanese dishes, including sushi and sashimi.",
        "Thai Cucumber Salad Prepare the dressing.",
        "Pour the vinegar into a small bowl.",
        "Add the sugar, sesame oil, red pepper flakes, and salt.",
        "Mix them together with a fork or mini whisk, then set the bowl aside.",
        "This will give the flavors time to blend while you prepare the rest of the salad.",
        "Peel and slice the cucumbers.",
        "Try to slice the cucumbers as thinly as you can.",
        "If they have large seeds in them, you will need to core them first.",
        "Place the cucumbers into a large serving bowl when you are done.",
        "Add the peanuts and the green onions into the bowl.",
        "If you can't find any chopped peanuts in the store, you can shell and chop regular peanuts using a sharp knife.",
        "You can also pulse them for a few seconds in a food processor instead.",
        "Stir the dressing into the salad.",
        "Pour the dressing over the salad, then toss the salad using a pair of salad tongs.",
        "Be sure to grab the salad from the bottom of the bowl so that everything gets evenly coated with dressing.",
        "If the dressing settle or separated, give it a brisk stir first.",
        "Serve the salad immediately.",
        "If you can't serve to right away, cover it with a sheet of plastic wrap and store it in the fridge.",
        "You will need to toss it once more just before serving."
    ]
}