{
    "title": "How to Apply Makeup According to Your Face Shape",
    "url": "https://www.wikihow.com/Apply-Makeup-According-to-Your-Face-Shape",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Makeup",
        "Learning to Use Makeup"
    ],
    "methods": [
        {
            "name": "Determining Your Face Shape",
            "steps": [
                {
                    "headline": "Learn about different face shapes.",
                    "description": "Many of us are unsure about our face shape and end up applying makeup that is unflattering. The most common face shapes are round, square, heart-shaped, and oval."
                },
                {
                    "headline": "Tie back your hair.",
                    "description": "To determine your face shape you will need to make sure all hair is away from your face. If you have bangs, use a headband as well."
                },
                {
                    "headline": "Look in a mirror and carefully examine your face.",
                    "description": "Pay particular attention to the width and length of your face. Take note of the distribution of facial features. A round face is equally distant between chin and forehead as it is from cheek to cheek. A heart shaped face has a wider width from temple to temple, tapering down to a narrower chin. A square shaped face has the same width from jawline to jawline as it does from temple to temple. An oval shaped face is generally about one and a half times longer from forehead to chin as it is from cheek to cheek."
                }
            ]
        },
        {
            "name": "Applying Makeup to a Round Face",
            "steps": [
                {
                    "headline": "Contour along the sides of your forehead and temples.",
                    "description": "Use a cream or matte powder that is one to two shades darker than your skin tone and foundation. Use foundation to shade the areas you would like to reshape or define, such as your chin, nose, forehead and cheekbones."
                },
                {
                    "headline": "Highlight the middle of your forehead and chin.",
                    "description": "This will offset the contouring and accentuate different areas of your face. Use a concealer that is one to two shades lighter than your skin. Move from the center of your hairline to the center of your forehead, down the bridge of your nose, the cheekbones under the outer corners of your eyes, and the center of your chin. Highlight under your eyes in an upside-down triangle shape. This will brighten your eyes."
                },
                {
                    "headline": "Apply blush on the apples of your cheeks.",
                    "description": "Using an angular motion, blend the blush from the apples of your cheeks back towards the temples. The idea is to draw a triangle that points towards your nose. Avoid getting the color too close to your ears."
                },
                {
                    "headline": "Apply a darker shade of eyeshadow.",
                    "description": "Try a shade like plum, and then contour your eyelids with a bronzer. The combination of darker eyeshadow and the bronzer will add definition to your eyes."
                },
                {
                    "headline": "Apply lip makeup to offset your face shape.",
                    "description": "You can do this by putting a small amount of liner on the sides of the lips. This will give your face a less rounded, and more angular appearance."
                }
            ]
        },
        {
            "name": "Applying Makeup to a Square Face",
            "steps": [
                {
                    "headline": "Contour the sides of your forehead, below your cheekbones, and under your jaw.",
                    "description": "This will promote the appearance of roundness and softness and to minimize more angular features. Use a cream or matte powder that is one to two shades darker than your skin tone and foundation. Use foundation to shade the areas you would like to reshape or define, such as your chin, nose, forehead and cheekbones."
                },
                {
                    "headline": "Highlight the high points of your face.",
                    "description": "Use a concealer that is one to two shades lighter than your skin tone. Move from the center of your hairline, the center of your forehead, above and below the outer edges of your brows, and the center of your chin. The highlighter should blend into the contour using an upward sweeping motion. Diffuse sharp lines. Highlight the middle of your forehead and the middle of your chin. Highlight along your brow bone to brighten your eye area."
                },
                {
                    "headline": "Concentrate blush on the hollow of your cheek.",
                    "description": "Using a linear motion, begin on the hollow of your cheek and move toward the outer corner of the eye. The blush should be just a few inches from the sides of your nose. Make sure the blush is concentrated more on the upper part of your cheeks. If you want to emphasize the lower lines of your face, you can take the blush lower."
                },
                {
                    "headline": "Apply a unique color of eyeshadow.",
                    "description": "Try scarlet, periwinkle, or lavender to bring out your facial features, especially your eyes. Finish by applying one or two coats of mascara."
                },
                {
                    "headline": "Apply a wide but light border of lip liner on the edge of your lips.",
                    "description": "Make the liner look like a shadow by smudging it. This will make the edges of your face appear softer and less square."
                }
            ]
        },
        {
            "name": "Applying Makeup to a Heart-Shaped Face",
            "steps": [
                {
                    "headline": "Contour along the sides of your forehead and temples.",
                    "description": "Soften the point in your chin by contouring the small area below your chin. Contouring will help minimize your forehead, maximize your jawline, and emphasize your cheekbones. This will create a balance between the wider upper part of your face and the narrow lower part of your face. In the area beneath your cheekbones, you should begin contouring at your ears and end in the middle of your cheeks. Use a cream or matte powder that is one to two shades darker than your skin tone and foundation..\nUse foundation to shade the areas you would like to reshape or define, such as your chin, nose, forehead and cheekbones."
                },
                {
                    "headline": "Highlight areas that naturally catch light, such as your eyes and forehead.",
                    "description": "Move from the center of your hairline to the center of your forehead, down the bridge of your nose, above and below the outer edges of your brows, the chin just below your lower lip, and to the sides of your mouth. Brighten your eyes! Highlight in an upside-down triangle underneath your eyes. Highlight the middle of your forehead. Highlight in the middle of the chin to broaden it."
                },
                {
                    "headline": "Apply blush using a “C” shape motion.",
                    "description": "Sweep the brush from the top of your temple down to the cheekbone. This will give your cheeks a fuller appearance. Make sure that you apply the blush under your cheeks."
                },
                {
                    "headline": "Apply a soft shade of eyeshadow.",
                    "description": "Try a soft color like pale pink, mint green, or sky blue to emphasize eyes. Finish with one or two coats of mascara."
                },
                {
                    "headline": "Apply lip liner on top and bottom lips.",
                    "description": "Place a little more lip liner on the bottom lip than the top lip to even out your face. Add a soft color like rose on the upper lip, and a bold shade like cherry on the bottom lip to even out the top and bottom parts of the face."
                }
            ]
        },
        {
            "name": "Applying Makeup to an Oval Face",
            "steps": [
                {
                    "headline": "Contour your forehead and below your cheekbones.",
                    "description": "Contouring will create balance by emphasizing the center of the face and minimizing the forehead. Use a cream or matte powder one to two shades darker than your skin tone and foundation. Use foundation to shade the areas you would like to reshape or define, such as your chin, nose, forehead and cheekbones. Slightly contour the sides of your forehead to make your hairline look narrow. Contour below your cheekbones. Start from your ears and stop in the middle of your cheek."
                },
                {
                    "headline": "Highlight the middle of your forehead and chin.",
                    "description": "Then, using a C-shaped motion, move your makeup brush from the center of your forehead, down the bridge of your nose, and from your brow bone to your cheekbone. To brighten up the area around your eyes, highlight under your eyes and along your brow bone."
                },
                {
                    "headline": "Apply blush on the apples of your cheeks.",
                    "description": "Begin at the apple of your cheeks and blend upward with a blush brush. Don’t apply too low on your face or your jaw will have a heavy appearance."
                },
                {
                    "headline": "Apply a soft and natural color eyeshadow, like taupe.",
                    "description": "Contour your eyelids with a bronzer to give them more definition. If you want to further enhance your eye color, add smudged eyeliner under your lashes and finish with one or two coats of mascara."
                },
                {
                    "headline": "Apply a deep or rich pink lipstick to enhance the curvature of your lips.",
                    "description": "You can also add a small amount of lip liner to the sides of the lips."
                }
            ]
        }
    ],
    "tyn": [
        "A mirror and good lighting",
        "Foundation",
        "Concealer",
        "Contour Powder",
        "Highlighter",
        "Blush",
        "Makeup Brushes",
        "Lipstick",
        "Lip Gloss",
        "Lip liner",
        "Eye shadow",
        "Mascara",
        "Eyeliner"
    ],
    "text": " Determining Your Face Shape Learn about different face shapes. Many of us are unsure about our face shape and end up applying makeup that is unflattering. The most common face shapes are round, square, heart-shaped, and oval. Tie back your hair. To determine your face shape you will need to make sure all hair is away from your face. If you have bangs, use a headband as well. Look in a mirror and carefully examine your face. Pay particular attention to the width and length of your face. Take note of the distribution of facial features. A round face is equally distant between chin and forehead as it is from cheek to cheek. A heart shaped face has a wider width from temple to temple, tapering down to a narrower chin. A square shaped face has the same width from jawline to jawline as it does from temple to temple. An oval shaped face is generally about one and a half times longer from forehead to chin as it is from cheek to cheek. Applying Makeup to a Round Face Contour along the sides of your forehead and temples. Use a cream or matte powder that is one to two shades darker than your skin tone and foundation. Use foundation to shade the areas you would like to reshape or define, such as your chin, nose, forehead and cheekbones. Highlight the middle of your forehead and chin. This will offset the contouring and accentuate different areas of your face. Use a concealer that is one to two shades lighter than your skin. Move from the center of your hairline to the center of your forehead, down the bridge of your nose, the cheekbones under the outer corners of your eyes, and the center of your chin. Highlight under your eyes in an upside-down triangle shape. This will brighten your eyes. Apply blush on the apples of your cheeks. Using an angular motion, blend the blush from the apples of your cheeks back towards the temples. The idea is to draw a triangle that points towards your nose. Avoid getting the color too close to your ears. Apply a darker shade of eyeshadow. Try a shade like plum, and then contour your eyelids with a bronzer. The combination of darker eyeshadow and the bronzer will add definition to your eyes. Apply lip makeup to offset your face shape. You can do this by putting a small amount of liner on the sides of the lips. This will give your face a less rounded, and more angular appearance. Applying Makeup to a Square Face Contour the sides of your forehead, below your cheekbones, and under your jaw. This will promote the appearance of roundness and softness and to minimize more angular features. Use a cream or matte powder that is one to two shades darker than your skin tone and foundation. Use foundation to shade the areas you would like to reshape or define, such as your chin, nose, forehead and cheekbones. Highlight the high points of your face. Use a concealer that is one to two shades lighter than your skin tone. Move from the center of your hairline, the center of your forehead, above and below the outer edges of your brows, and the center of your chin. The highlighter should blend into the contour using an upward sweeping motion. Diffuse sharp lines. Highlight the middle of your forehead and the middle of your chin. Highlight along your brow bone to brighten your eye area. Concentrate blush on the hollow of your cheek. Using a linear motion, begin on the hollow of your cheek and move toward the outer corner of the eye. The blush should be just a few inches from the sides of your nose. Make sure the blush is concentrated more on the upper part of your cheeks. If you want to emphasize the lower lines of your face, you can take the blush lower. Apply a unique color of eyeshadow. Try scarlet, periwinkle, or lavender to bring out your facial features, especially your eyes. Finish by applying one or two coats of mascara. Apply a wide but light border of lip liner on the edge of your lips. Make the liner look like a shadow by smudging it. This will make the edges of your face appear softer and less square. Applying Makeup to a Heart-Shaped Face Contour along the sides of your forehead and temples. Soften the point in your chin by contouring the small area below your chin. Contouring will help minimize your forehead, maximize your jawline, and emphasize your cheekbones. This will create a balance between the wider upper part of your face and the narrow lower part of your face. In the area beneath your cheekbones, you should begin contouring at your ears and end in the middle of your cheeks. Use a cream or matte powder that is one to two shades darker than your skin tone and foundation..\nUse foundation to shade the areas you would like to reshape or define, such as your chin, nose, forehead and cheekbones. Highlight areas that naturally catch light, such as your eyes and forehead. Move from the center of your hairline to the center of your forehead, down the bridge of your nose, above and below the outer edges of your brows, the chin just below your lower lip, and to the sides of your mouth. Brighten your eyes! Highlight in an upside-down triangle underneath your eyes. Highlight the middle of your forehead. Highlight in the middle of the chin to broaden it. Apply blush using a “C” shape motion. Sweep the brush from the top of your temple down to the cheekbone. This will give your cheeks a fuller appearance. Make sure that you apply the blush under your cheeks. Apply a soft shade of eyeshadow. Try a soft color like pale pink, mint green, or sky blue to emphasize eyes. Finish with one or two coats of mascara. Apply lip liner on top and bottom lips. Place a little more lip liner on the bottom lip than the top lip to even out your face. Add a soft color like rose on the upper lip, and a bold shade like cherry on the bottom lip to even out the top and bottom parts of the face. Applying Makeup to an Oval Face Contour your forehead and below your cheekbones. Contouring will create balance by emphasizing the center of the face and minimizing the forehead. Use a cream or matte powder one to two shades darker than your skin tone and foundation. Use foundation to shade the areas you would like to reshape or define, such as your chin, nose, forehead and cheekbones. Slightly contour the sides of your forehead to make your hairline look narrow. Contour below your cheekbones. Start from your ears and stop in the middle of your cheek. Highlight the middle of your forehead and chin. Then, using a C-shaped motion, move your makeup brush from the center of your forehead, down the bridge of your nose, and from your brow bone to your cheekbone. To brighten up the area around your eyes, highlight under your eyes and along your brow bone. Apply blush on the apples of your cheeks. Begin at the apple of your cheeks and blend upward with a blush brush. Don’t apply too low on your face or your jaw will have a heavy appearance. Apply a soft and natural color eyeshadow, like taupe. Contour your eyelids with a bronzer to give them more definition. If you want to further enhance your eye color, add smudged eyeliner under your lashes and finish with one or two coats of mascara. Apply a deep or rich pink lipstick to enhance the curvature of your lips. You can also add a small amount of lip liner to the sides of the lips.",
    "sentences": [
        " Determining Your Face Shape Learn about different face shapes.",
        "Many of us are unsure about our face shape and end up applying makeup that is unflattering.",
        "The most common face shapes are round, square, heart-shaped, and oval.",
        "Tie back your hair.",
        "To determine your face shape you will need to make sure all hair is away from your face.",
        "If you have bangs, use a headband as well.",
        "Look in a mirror and carefully examine your face.",
        "Pay particular attention to the width and length of your face.",
        "Take note of the distribution of facial features.",
        "A round face is equally distant between chin and forehead as it is from cheek to cheek.",
        "A heart shaped face has a wider width from temple to temple, tapering down to a narrower chin.",
        "A square shaped face has the same width from jawline to jawline as it does from temple to temple.",
        "An oval shaped face is generally about one and a half times longer from forehead to chin as it is from cheek to cheek.",
        "Applying Makeup to a Round Face Contour along the sides of your forehead and temples.",
        "Use a cream or matte powder that is one to two shades darker than your skin tone and foundation.",
        "Use foundation to shade the areas you would like to reshape or define, such as your chin, nose, forehead and cheekbones.",
        "Highlight the middle of your forehead and chin.",
        "This will offset the contouring and accentuate different areas of your face.",
        "Use a concealer that is one to two shades lighter than your skin.",
        "Move from the center of your hairline to the center of your forehead, down the bridge of your nose, the cheekbones under the outer corners of your eyes, and the center of your chin.",
        "Highlight under your eyes in an upside-down triangle shape.",
        "This will brighten your eyes.",
        "Apply blush on the apples of your cheeks.",
        "Using an angular motion, blend the blush from the apples of your cheeks back towards the temples.",
        "The idea is to draw a triangle that points towards your nose.",
        "Avoid getting the color too close to your ears.",
        "Apply a darker shade of eyeshadow.",
        "Try a shade like plum, and then contour your eyelids with a bronzer.",
        "The combination of darker eyeshadow and the bronzer will add definition to your eyes.",
        "Apply lip makeup to offset your face shape.",
        "You can do this by putting a small amount of liner on the sides of the lips.",
        "This will give your face a less rounded, and more angular appearance.",
        "Applying Makeup to a Square Face Contour the sides of your forehead, below your cheekbones, and under your jaw.",
        "This will promote the appearance of roundness and softness and to minimize more angular features.",
        "Use a cream or matte powder that is one to two shades darker than your skin tone and foundation.",
        "Use foundation to shade the areas you would like to reshape or define, such as your chin, nose, forehead and cheekbones.",
        "Highlight the high points of your face.",
        "Use a concealer that is one to two shades lighter than your skin tone.",
        "Move from the center of your hairline, the center of your forehead, above and below the outer edges of your brows, and the center of your chin.",
        "The highlighter should blend into the contour using an upward sweeping motion.",
        "Diffuse sharp lines.",
        "Highlight the middle of your forehead and the middle of your chin.",
        "Highlight along your brow bone to brighten your eye area.",
        "Concentrate blush on the hollow of your cheek.",
        "Using a linear motion, begin on the hollow of your cheek and move toward the outer corner of the eye.",
        "The blush should be just a few inches from the sides of your nose.",
        "Make sure the blush is concentrated more on the upper part of your cheeks.",
        "If you want to emphasize the lower lines of your face, you can take the blush lower.",
        "Apply a unique color of eyeshadow.",
        "Try scarlet, periwinkle, or lavender to bring out your facial features, especially your eyes.",
        "Finish by applying one or two coats of mascara.",
        "Apply a wide but light border of lip liner on the edge of your lips.",
        "Make the liner look like a shadow by smudging it.",
        "This will make the edges of your face appear softer and less square.",
        "Applying Makeup to a Heart-Shaped Face Contour along the sides of your forehead and temples.",
        "Soften the point in your chin by contouring the small area below your chin.",
        "Contouring will help minimize your forehead, maximize your jawline, and emphasize your cheekbones.",
        "This will create a balance between the wider upper part of your face and the narrow lower part of your face.",
        "In the area beneath your cheekbones, you should begin contouring at your ears and end in the middle of your cheeks.",
        "Use a cream or matte powder that is one to two shades darker than your skin tone and foundation..\nUse foundation to shade the areas you would like to reshape or define, such as your chin, nose, forehead and cheekbones.",
        "Highlight areas that naturally catch light, such as your eyes and forehead.",
        "Move from the center of your hairline to the center of your forehead, down the bridge of your nose, above and below the outer edges of your brows, the chin just below your lower lip, and to the sides of your mouth.",
        "Brighten your eyes!",
        "Highlight in an upside-down triangle underneath your eyes.",
        "Highlight the middle of your forehead.",
        "Highlight in the middle of the chin to broaden it.",
        "Apply blush using a “C” shape motion.",
        "Sweep the brush from the top of your temple down to the cheekbone.",
        "This will give your cheeks a fuller appearance.",
        "Make sure that you apply the blush under your cheeks.",
        "Apply a soft shade of eyeshadow.",
        "Try a soft color like pale pink, mint green, or sky blue to emphasize eyes.",
        "Finish with one or two coats of mascara.",
        "Apply lip liner on top and bottom lips.",
        "Place a little more lip liner on the bottom lip than the top lip to even out your face.",
        "Add a soft color like rose on the upper lip, and a bold shade like cherry on the bottom lip to even out the top and bottom parts of the face.",
        "Applying Makeup to an Oval Face Contour your forehead and below your cheekbones.",
        "Contouring will create balance by emphasizing the center of the face and minimizing the forehead.",
        "Use a cream or matte powder one to two shades darker than your skin tone and foundation.",
        "Use foundation to shade the areas you would like to reshape or define, such as your chin, nose, forehead and cheekbones.",
        "Slightly contour the sides of your forehead to make your hairline look narrow.",
        "Contour below your cheekbones.",
        "Start from your ears and stop in the middle of your cheek.",
        "Highlight the middle of your forehead and chin.",
        "Then, using a C-shaped motion, move your makeup brush from the center of your forehead, down the bridge of your nose, and from your brow bone to your cheekbone.",
        "To brighten up the area around your eyes, highlight under your eyes and along your brow bone.",
        "Apply blush on the apples of your cheeks.",
        "Begin at the apple of your cheeks and blend upward with a blush brush.",
        "Don’t apply too low on your face or your jaw will have a heavy appearance.",
        "Apply a soft and natural color eyeshadow, like taupe.",
        "Contour your eyelids with a bronzer to give them more definition.",
        "If you want to further enhance your eye color, add smudged eyeliner under your lashes and finish with one or two coats of mascara.",
        "Apply a deep or rich pink lipstick to enhance the curvature of your lips.",
        "You can also add a small amount of lip liner to the sides of the lips."
    ]
}