{
    "title": "How to Airbrush",
    "url": "https://www.wikihow.com/Airbrush",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "methods": [
        {
            "name": "Painting with an Airbrush",
            "steps": [
                {
                    "headline": "Connect the air hose from the air compressor to the stylus.",
                    "description": "Set your air compressor close to your work area so you can easily access it. Push one end of the air hose onto the nozzle on the side of your compressor so it has a tight fit. Find the long air nozzle on the bottom of the airbrush stylus and push the other end of the hose over it. Make sure the hose fits tightly or else the airbrush won’t get the right amount of pressure. Many airbrushes are sold in kits that include a small air compressor and hose. Look at hobby stores or online for airbrush kits."
                },
                {
                    "headline": "Thin your paint in a mixing tray before you load it into the airbrush.",
                    "description": "Paint is too thick to load directly into your airbrush and won’t apply smoothly to your work. Pour a small amount of paint into a mixing dish and add an equal amount of paint thinner. Stir the paint and paint thinner together until it has the same consistency as the plain paint thinner. Continue adding more paint or thinner until it’s thin enough to use. If you’re using acrylic paints, you can use water to thin your paint. If you’re using enamel or lacquer paint, then use either paint thinner or lacquer thinner respectively. The ratio between paint and thinner depends on the brand and base of the paint. Look on the paint’s packaging to determine how much thinner you need to use.Warning: Work in a well-ventilated area or wear a respirator since paint thinner can create harmful fumes."
                },
                {
                    "headline": "Put 4-6 drops of paint into the airbrush cup.",
                    "description": "Once you thin the paint so it works in the airbrush, use a pipette to transfer the paint from the mixing dish to the cup on your airbrush stylus. Only use a few drops at a time since airbrushes don’t need much paint to work. Once you load the paint, be sure not to tip the stylus over, or else it will spill. You can use either a top-loading or bottom-loading stylus."
                },
                {
                    "headline": "Turn on the air compressor so it’s around 10 PSI.",
                    "description": "Switch the air compressor so you can use your airbrush. Check the dial on the air compressor and reduce the amount of air pressure to 10 PSI when you first start. As you get more comfortable painting with the airbrush, you can adjust the pressure to get different results. Higher pressure is less likely to clog the airbrush and forms tiny droplets, but the paint dries quickly and there’s more overspray. Lower pressure lets you paint fine details and uses less paint, but it’s more likely to clog and the paint texture will look rougher."
                },
                {
                    "headline": "Hold the airbrush 1–2 in (2.5–5.1 cm) away from the object you’re painting.",
                    "description": "Put the airbrush in your dominant hand like you’re holding a pen. Rest your index finger on the trigger button on top of the airbrush. Point the airbrush nozzle at the object you’re painting so it’s about 1–2 inches (2.5–5.1 cm) away and perpendicular to the object. Wrap the airbrush hose around your arm so it doesn’t get in the way of the object you’re painting. The distance between the object and your airbrush affects the thickness of your lines. If you want to paint finer details, hold the airbrush closer."
                },
                {
                    "headline": "Push the trigger on the airbrush down to apply the paint.",
                    "description": "When you’re ready to start painting, use your index finger to press down on the trigger. Keep your wrist locked in place and move your arm to control where the airbrush sprays. When you want to stop, let go of the trigger so the airbrush doesn’t spray anymore. Practice drawing different lines and shapes so you can warm up and get comfortable using the airbrush. Some airbrushes require you to pull back on the trigger to apply the paint. More paint will come out of your airbrush the further back you pull the trigger. Test spraying the airbrush on a scrap sheet of paper first to make sure the paint comes out smoothly. Use a stencil if you want to copy a design perfectly."
                },
                {
                    "headline": "Let the paint dry for 24 hours so it can cure.",
                    "description": "If you need to handle the piece you just painted, wait at least 30 minutes or until the paint isn’t tacky. Then, leave the paint alone for at least 24 hours to let it fully cure. If you put on a thick application of paint, it may take longer to cure since it will stay wet for longer. You can speed up the drying process by using a hair dryer or heat gun."
                }
            ]
        },
        {
            "name": "Applying Airbrush Makeup",
            "steps": [
                {
                    "headline": "Wash and moisturize your face first.",
                    "description": "Before you apply any makeup, make sure to wash your face with a cleanser and moisturizer. Work the facial cleanser into your skin and rinse it thoroughly when you’re finished. Pat your face dry so you can apply your makeup. Washing and moisturizing helps the airbrush makeup stay better and helps reduce the chances of your face breaking out."
                },
                {
                    "headline": "Connect the compressor to the stylus with an air hose.",
                    "description": "Put the air compressor close to your work area so it’s not in your way. Connect one end of the hose to the air nozzle on your compressor, and stretch the hose out so it doesn’t tangle or snag. Attach the other end of the hose to the nozzle on the bottom of the airbrush stylus. You can get an airbrush kit meant for makeup application online or from cosmetic stores."
                },
                {
                    "headline": "Load 4-5 drops of airbrush foundation into the airbrush stylus.",
                    "description": "Get an airbrush foundation that matches your complexion so it blends in well with your skin. Open the container of foundation and place 4-5 drops inside the cup on top of the airbrush stylus. Place the drops in the center of the cup so it goes inside of the stylus. You can buy airbrush foundation from cosmetic stores or online. Don’t use too much foundation since you’ll waste product.Tip: You can use a regular foundation if you want, but you need to mix it with makeup thinner first."
                },
                {
                    "headline": "Turn your compressor to 10-15 PSI.",
                    "description": "Switch your air compressor on and turn the control dial so it’s at 10-15 PSI. Wait until the pressure changes on the machine before using your airbrush so you don’t accidentally overspray. Don’t use pressure much higher since it could apply your makeup too thick."
                },
                {
                    "headline": "Hold the stylus 4–6 in (10–15 cm) from your face.",
                    "description": "Place the stylus in your dominant hand like you are holding a pencil and so your index finger rests on the trigger on top. Keep the cup on top of the stylus upright so you don’t accidentally spill your makeup. Hold the stylus 4–6 inches (10–15 cm) away so you get a light, even application. Holding the stylus closer to your face will give you a thicker layer of makeup, but it will give you more control."
                },
                {
                    "headline": "Press down on the trigger to apply your foundation.",
                    "description": "Once you’re ready to apply the makeup, press the trigger with your index finger to spray the foundation. Move the airbrush in small circles across your face while you’re spraying so you get an even application on your face. Only use the 4-5 drops you originally loaded so you don’t use too much makeup. Close your eyes while you’re spraying and open them occasionally to look for any areas you missed. Rather than applying a thick coat of makeup, gradually build up lighter layers for a more even appearance. Be careful not to blow the makeup up your nose or in your eyes."
                },
                {
                    "headline": "Use your airbrush for bronzer and blush.",
                    "description": "Make sure you get bronzer and blush that’s meant to be used in an airbrush applicator. Only use 2-3 drops at a time and refill the airbrush if you need to. Hold the airbrush about 5 inches (13 cm) from your face and lightly press down on the trigger to apply a light layer of the makeup around your cheeks. Make sure you flush out your airbrush whenever you change makeups since they could cross-contaminate."
                }
            ]
        },
        {
            "name": "Flushing the Airbrush",
            "steps": [
                {
                    "headline": "Clean your airbrush whenever you change materials or when you’re finished.",
                    "description": "Paint or makeup can clog the nozzle and needle inside of your airbrush if it’s left inside. If you need to switch the colors you’re applying or you’re done with your application, then take a few minutes to clean the airbrush.Tip: You can use the same airbrush for multiple kinds of paint and makeup, but they may cross-contaminate if it isn’t cleaned properly. If you want to avoid cross-contamination, then use separate airbrushes for each different type of application."
                },
                {
                    "headline": "Pour airbrush cleaning solution into the stylus cup.",
                    "description": "Look for airbrush cleaning solution at hobby stores or online. Fill the airbrush cup half full with the cleaning solution so it travels through your airbrush. Let the solution sit inside the stylus cup for 10-15 seconds so it breaks down any paint or makeup left inside. If you want to save your cleaning solution, you can dilute it with equal parts water."
                },
                {
                    "headline": "Loosen paint in the airbrush cup with a cotton swab or paintbrush.",
                    "description": "If there’s paint or makeup stuck on the side of the airbrush cup, dip the bristles of a paintbrush or the end of a cotton swab into the solution. Scrape the sides of the cup with the swab so it mixes with the solution and runs through the stylus. You may not need to use a cotton swab or paintbrush if nothing is sticking on the sides."
                },
                {
                    "headline": "Spray the cleaning solution through the airbrush into a container.",
                    "description": "Make sure the airbrush is still connected to the compressor so you can spray it. Point the nozzle of your airbrush inside an empty cup and press down on the nozzle so the solution goes through the stylus. Keep the trigger pressed down until the cup is empty. Only use about 10-15 PSI while you’re cleaning your airbrush so it sprays evenly."
                },
                {
                    "headline": "Continue running cleaning solution through the stylus until it’s clear.",
                    "description": "Refill the cup on the stylus and check if it changes color. If the cleaning solution changes at all, then there is still makeup or paint inside of the airbrush. Press down on the trigger again to empty the cup and spray the cleaner through the stylus. Once the cleaner is clear when you put it in the cup, you can stop cleaning and put your airbrush away."
                }
            ]
        }
    ],
    "tyn": [
        "Painting with an Airbrush",
        "Airbrush",
        "Air compressor",
        "Acrylic, enamel, or lacquer paints",
        "Paint thinner",
        "Pipette",
        "Mixing dish",
        "Paper",
        "Applying Airbrush Makeup",
        "Face wash",
        "Airbrush foundation",
        "Flushing the Airbrush",
        "Airbrush cleaning solution",
        "Cotton swab or paintbrush",
        "Cup"
    ],
    "text": " Painting with an Airbrush Connect the air hose from the air compressor to the stylus. Set your air compressor close to your work area so you can easily access it. Push one end of the air hose onto the nozzle on the side of your compressor so it has a tight fit. Find the long air nozzle on the bottom of the airbrush stylus and push the other end of the hose over it. Make sure the hose fits tightly or else the airbrush won’t get the right amount of pressure. Many airbrushes are sold in kits that include a small air compressor and hose. Look at hobby stores or online for airbrush kits. Thin your paint in a mixing tray before you load it into the airbrush. Paint is too thick to load directly into your airbrush and won’t apply smoothly to your work. Pour a small amount of paint into a mixing dish and add an equal amount of paint thinner. Stir the paint and paint thinner together until it has the same consistency as the plain paint thinner. Continue adding more paint or thinner until it’s thin enough to use. If you’re using acrylic paints, you can use water to thin your paint. If you’re using enamel or lacquer paint, then use either paint thinner or lacquer thinner respectively. The ratio between paint and thinner depends on the brand and base of the paint. Look on the paint’s packaging to determine how much thinner you need to use.Warning: Work in a well-ventilated area or wear a respirator since paint thinner can create harmful fumes. Put 4-6 drops of paint into the airbrush cup. Once you thin the paint so it works in the airbrush, use a pipette to transfer the paint from the mixing dish to the cup on your airbrush stylus. Only use a few drops at a time since airbrushes don’t need much paint to work. Once you load the paint, be sure not to tip the stylus over, or else it will spill. You can use either a top-loading or bottom-loading stylus. Turn on the air compressor so it’s around 10 PSI. Switch the air compressor so you can use your airbrush. Check the dial on the air compressor and reduce the amount of air pressure to 10 PSI when you first start. As you get more comfortable painting with the airbrush, you can adjust the pressure to get different results. Higher pressure is less likely to clog the airbrush and forms tiny droplets, but the paint dries quickly and there’s more overspray. Lower pressure lets you paint fine details and uses less paint, but it’s more likely to clog and the paint texture will look rougher. Hold the airbrush 1–2 in (2.5–5.1 cm) away from the object you’re painting. Put the airbrush in your dominant hand like you’re holding a pen. Rest your index finger on the trigger button on top of the airbrush. Point the airbrush nozzle at the object you’re painting so it’s about 1–2 inches (2.5–5.1 cm) away and perpendicular to the object. Wrap the airbrush hose around your arm so it doesn’t get in the way of the object you’re painting. The distance between the object and your airbrush affects the thickness of your lines. If you want to paint finer details, hold the airbrush closer. Push the trigger on the airbrush down to apply the paint. When you’re ready to start painting, use your index finger to press down on the trigger. Keep your wrist locked in place and move your arm to control where the airbrush sprays. When you want to stop, let go of the trigger so the airbrush doesn’t spray anymore. Practice drawing different lines and shapes so you can warm up and get comfortable using the airbrush. Some airbrushes require you to pull back on the trigger to apply the paint. More paint will come out of your airbrush the further back you pull the trigger. Test spraying the airbrush on a scrap sheet of paper first to make sure the paint comes out smoothly. Use a stencil if you want to copy a design perfectly. Let the paint dry for 24 hours so it can cure. If you need to handle the piece you just painted, wait at least 30 minutes or until the paint isn’t tacky. Then, leave the paint alone for at least 24 hours to let it fully cure. If you put on a thick application of paint, it may take longer to cure since it will stay wet for longer. You can speed up the drying process by using a hair dryer or heat gun. Applying Airbrush Makeup Wash and moisturize your face first. Before you apply any makeup, make sure to wash your face with a cleanser and moisturizer. Work the facial cleanser into your skin and rinse it thoroughly when you’re finished. Pat your face dry so you can apply your makeup. Washing and moisturizing helps the airbrush makeup stay better and helps reduce the chances of your face breaking out. Connect the compressor to the stylus with an air hose. Put the air compressor close to your work area so it’s not in your way. Connect one end of the hose to the air nozzle on your compressor, and stretch the hose out so it doesn’t tangle or snag. Attach the other end of the hose to the nozzle on the bottom of the airbrush stylus. You can get an airbrush kit meant for makeup application online or from cosmetic stores. Load 4-5 drops of airbrush foundation into the airbrush stylus. Get an airbrush foundation that matches your complexion so it blends in well with your skin. Open the container of foundation and place 4-5 drops inside the cup on top of the airbrush stylus. Place the drops in the center of the cup so it goes inside of the stylus. You can buy airbrush foundation from cosmetic stores or online. Don’t use too much foundation since you’ll waste product.Tip: You can use a regular foundation if you want, but you need to mix it with makeup thinner first. Turn your compressor to 10-15 PSI. Switch your air compressor on and turn the control dial so it’s at 10-15 PSI. Wait until the pressure changes on the machine before using your airbrush so you don’t accidentally overspray. Don’t use pressure much higher since it could apply your makeup too thick. Hold the stylus 4–6 in (10–15 cm) from your face. Place the stylus in your dominant hand like you are holding a pencil and so your index finger rests on the trigger on top. Keep the cup on top of the stylus upright so you don’t accidentally spill your makeup. Hold the stylus 4–6 inches (10–15 cm) away so you get a light, even application. Holding the stylus closer to your face will give you a thicker layer of makeup, but it will give you more control. Press down on the trigger to apply your foundation. Once you’re ready to apply the makeup, press the trigger with your index finger to spray the foundation. Move the airbrush in small circles across your face while you’re spraying so you get an even application on your face. Only use the 4-5 drops you originally loaded so you don’t use too much makeup. Close your eyes while you’re spraying and open them occasionally to look for any areas you missed. Rather than applying a thick coat of makeup, gradually build up lighter layers for a more even appearance. Be careful not to blow the makeup up your nose or in your eyes. Use your airbrush for bronzer and blush. Make sure you get bronzer and blush that’s meant to be used in an airbrush applicator. Only use 2-3 drops at a time and refill the airbrush if you need to. Hold the airbrush about 5 inches (13 cm) from your face and lightly press down on the trigger to apply a light layer of the makeup around your cheeks. Make sure you flush out your airbrush whenever you change makeups since they could cross-contaminate. Flushing the Airbrush Clean your airbrush whenever you change materials or when you’re finished. Paint or makeup can clog the nozzle and needle inside of your airbrush if it’s left inside. If you need to switch the colors you’re applying or you’re done with your application, then take a few minutes to clean the airbrush.Tip: You can use the same airbrush for multiple kinds of paint and makeup, but they may cross-contaminate if it isn’t cleaned properly. If you want to avoid cross-contamination, then use separate airbrushes for each different type of application. Pour airbrush cleaning solution into the stylus cup. Look for airbrush cleaning solution at hobby stores or online. Fill the airbrush cup half full with the cleaning solution so it travels through your airbrush. Let the solution sit inside the stylus cup for 10-15 seconds so it breaks down any paint or makeup left inside. If you want to save your cleaning solution, you can dilute it with equal parts water. Loosen paint in the airbrush cup with a cotton swab or paintbrush. If there’s paint or makeup stuck on the side of the airbrush cup, dip the bristles of a paintbrush or the end of a cotton swab into the solution. Scrape the sides of the cup with the swab so it mixes with the solution and runs through the stylus. You may not need to use a cotton swab or paintbrush if nothing is sticking on the sides. Spray the cleaning solution through the airbrush into a container. Make sure the airbrush is still connected to the compressor so you can spray it. Point the nozzle of your airbrush inside an empty cup and press down on the nozzle so the solution goes through the stylus. Keep the trigger pressed down until the cup is empty. Only use about 10-15 PSI while you’re cleaning your airbrush so it sprays evenly. Continue running cleaning solution through the stylus until it’s clear. Refill the cup on the stylus and check if it changes color. If the cleaning solution changes at all, then there is still makeup or paint inside of the airbrush. Press down on the trigger again to empty the cup and spray the cleaner through the stylus. Once the cleaner is clear when you put it in the cup, you can stop cleaning and put your airbrush away.",
    "sentences": [
        " Painting with an Airbrush Connect the air hose from the air compressor to the stylus.",
        "Set your air compressor close to your work area so you can easily access it.",
        "Push one end of the air hose onto the nozzle on the side of your compressor so it has a tight fit.",
        "Find the long air nozzle on the bottom of the airbrush stylus and push the other end of the hose over it.",
        "Make sure the hose fits tightly or else the airbrush won’t get the right amount of pressure.",
        "Many airbrushes are sold in kits that include a small air compressor and hose.",
        "Look at hobby stores or online for airbrush kits.",
        "Thin your paint in a mixing tray before you load it into the airbrush.",
        "Paint is too thick to load directly into your airbrush and won’t apply smoothly to your work.",
        "Pour a small amount of paint into a mixing dish and add an equal amount of paint thinner.",
        "Stir the paint and paint thinner together until it has the same consistency as the plain paint thinner.",
        "Continue adding more paint or thinner until it’s thin enough to use.",
        "If you’re using acrylic paints, you can use water to thin your paint.",
        "If you’re using enamel or lacquer paint, then use either paint thinner or lacquer thinner respectively.",
        "The ratio between paint and thinner depends on the brand and base of the paint.",
        "Look on the paint’s packaging to determine how much thinner you need to use.Warning: Work in a well-ventilated area or wear a respirator since paint thinner can create harmful fumes.",
        "Put 4-6 drops of paint into the airbrush cup.",
        "Once you thin the paint so it works in the airbrush, use a pipette to transfer the paint from the mixing dish to the cup on your airbrush stylus.",
        "Only use a few drops at a time since airbrushes don’t need much paint to work.",
        "Once you load the paint, be sure not to tip the stylus over, or else it will spill.",
        "You can use either a top-loading or bottom-loading stylus.",
        "Turn on the air compressor so it’s around 10 PSI.",
        "Switch the air compressor so you can use your airbrush.",
        "Check the dial on the air compressor and reduce the amount of air pressure to 10 PSI when you first start.",
        "As you get more comfortable painting with the airbrush, you can adjust the pressure to get different results.",
        "Higher pressure is less likely to clog the airbrush and forms tiny droplets, but the paint dries quickly and there’s more overspray.",
        "Lower pressure lets you paint fine details and uses less paint, but it’s more likely to clog and the paint texture will look rougher.",
        "Hold the airbrush 1–2 in (2.5–5.1 cm) away from the object you’re painting.",
        "Put the airbrush in your dominant hand like you’re holding a pen.",
        "Rest your index finger on the trigger button on top of the airbrush.",
        "Point the airbrush nozzle at the object you’re painting so it’s about 1–2 inches (2.5–5.1 cm) away and perpendicular to the object.",
        "Wrap the airbrush hose around your arm so it doesn’t get in the way of the object you’re painting.",
        "The distance between the object and your airbrush affects the thickness of your lines.",
        "If you want to paint finer details, hold the airbrush closer.",
        "Push the trigger on the airbrush down to apply the paint.",
        "When you’re ready to start painting, use your index finger to press down on the trigger.",
        "Keep your wrist locked in place and move your arm to control where the airbrush sprays.",
        "When you want to stop, let go of the trigger so the airbrush doesn’t spray anymore.",
        "Practice drawing different lines and shapes so you can warm up and get comfortable using the airbrush.",
        "Some airbrushes require you to pull back on the trigger to apply the paint.",
        "More paint will come out of your airbrush the further back you pull the trigger.",
        "Test spraying the airbrush on a scrap sheet of paper first to make sure the paint comes out smoothly.",
        "Use a stencil if you want to copy a design perfectly.",
        "Let the paint dry for 24 hours so it can cure.",
        "If you need to handle the piece you just painted, wait at least 30 minutes or until the paint isn’t tacky.",
        "Then, leave the paint alone for at least 24 hours to let it fully cure.",
        "If you put on a thick application of paint, it may take longer to cure since it will stay wet for longer.",
        "You can speed up the drying process by using a hair dryer or heat gun.",
        "Applying Airbrush Makeup Wash and moisturize your face first.",
        "Before you apply any makeup, make sure to wash your face with a cleanser and moisturizer.",
        "Work the facial cleanser into your skin and rinse it thoroughly when you’re finished.",
        "Pat your face dry so you can apply your makeup.",
        "Washing and moisturizing helps the airbrush makeup stay better and helps reduce the chances of your face breaking out.",
        "Connect the compressor to the stylus with an air hose.",
        "Put the air compressor close to your work area so it’s not in your way.",
        "Connect one end of the hose to the air nozzle on your compressor, and stretch the hose out so it doesn’t tangle or snag.",
        "Attach the other end of the hose to the nozzle on the bottom of the airbrush stylus.",
        "You can get an airbrush kit meant for makeup application online or from cosmetic stores.",
        "Load 4-5 drops of airbrush foundation into the airbrush stylus.",
        "Get an airbrush foundation that matches your complexion so it blends in well with your skin.",
        "Open the container of foundation and place 4-5 drops inside the cup on top of the airbrush stylus.",
        "Place the drops in the center of the cup so it goes inside of the stylus.",
        "You can buy airbrush foundation from cosmetic stores or online.",
        "Don’t use too much foundation since you’ll waste product.Tip: You can use a regular foundation if you want, but you need to mix it with makeup thinner first.",
        "Turn your compressor to 10-15 PSI.",
        "Switch your air compressor on and turn the control dial so it’s at 10-15 PSI.",
        "Wait until the pressure changes on the machine before using your airbrush so you don’t accidentally overspray.",
        "Don’t use pressure much higher since it could apply your makeup too thick.",
        "Hold the stylus 4–6 in (10–15 cm) from your face.",
        "Place the stylus in your dominant hand like you are holding a pencil and so your index finger rests on the trigger on top.",
        "Keep the cup on top of the stylus upright so you don’t accidentally spill your makeup.",
        "Hold the stylus 4–6 inches (10–15 cm) away so you get a light, even application.",
        "Holding the stylus closer to your face will give you a thicker layer of makeup, but it will give you more control.",
        "Press down on the trigger to apply your foundation.",
        "Once you’re ready to apply the makeup, press the trigger with your index finger to spray the foundation.",
        "Move the airbrush in small circles across your face while you’re spraying so you get an even application on your face.",
        "Only use the 4-5 drops you originally loaded so you don’t use too much makeup.",
        "Close your eyes while you’re spraying and open them occasionally to look for any areas you missed.",
        "Rather than applying a thick coat of makeup, gradually build up lighter layers for a more even appearance.",
        "Be careful not to blow the makeup up your nose or in your eyes.",
        "Use your airbrush for bronzer and blush.",
        "Make sure you get bronzer and blush that’s meant to be used in an airbrush applicator.",
        "Only use 2-3 drops at a time and refill the airbrush if you need to.",
        "Hold the airbrush about 5 inches (13 cm) from your face and lightly press down on the trigger to apply a light layer of the makeup around your cheeks.",
        "Make sure you flush out your airbrush whenever you change makeups since they could cross-contaminate.",
        "Flushing the Airbrush Clean your airbrush whenever you change materials or when you’re finished.",
        "Paint or makeup can clog the nozzle and needle inside of your airbrush if it’s left inside.",
        "If you need to switch the colors you’re applying or you’re done with your application, then take a few minutes to clean the airbrush.Tip: You can use the same airbrush for multiple kinds of paint and makeup, but they may cross-contaminate if it isn’t cleaned properly.",
        "If you want to avoid cross-contamination, then use separate airbrushes for each different type of application.",
        "Pour airbrush cleaning solution into the stylus cup.",
        "Look for airbrush cleaning solution at hobby stores or online.",
        "Fill the airbrush cup half full with the cleaning solution so it travels through your airbrush.",
        "Let the solution sit inside the stylus cup for 10-15 seconds so it breaks down any paint or makeup left inside.",
        "If you want to save your cleaning solution, you can dilute it with equal parts water.",
        "Loosen paint in the airbrush cup with a cotton swab or paintbrush.",
        "If there’s paint or makeup stuck on the side of the airbrush cup, dip the bristles of a paintbrush or the end of a cotton swab into the solution.",
        "Scrape the sides of the cup with the swab so it mixes with the solution and runs through the stylus.",
        "You may not need to use a cotton swab or paintbrush if nothing is sticking on the sides.",
        "Spray the cleaning solution through the airbrush into a container.",
        "Make sure the airbrush is still connected to the compressor so you can spray it.",
        "Point the nozzle of your airbrush inside an empty cup and press down on the nozzle so the solution goes through the stylus.",
        "Keep the trigger pressed down until the cup is empty.",
        "Only use about 10-15 PSI while you’re cleaning your airbrush so it sprays evenly.",
        "Continue running cleaning solution through the stylus until it’s clear.",
        "Refill the cup on the stylus and check if it changes color.",
        "If the cleaning solution changes at all, then there is still makeup or paint inside of the airbrush.",
        "Press down on the trigger again to empty the cup and spray the cleaner through the stylus.",
        "Once the cleaner is clear when you put it in the cup, you can stop cleaning and put your airbrush away."
    ]
}