{
    "title": "How to Take Notes",
    "url": "https://www.wikihow.com/Take-Notes",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Study Skills",
        "Note Taking"
    ],
    "methods": [
        {
            "name": "Taking Clear and Concise Notes You’ll Remember",
            "steps": [
                {
                    "headline": "Note details at the top of your paper.",
                    "description": "Keep your notes organized by writing important details at the top of each page. Include information such as the date, bibliographic information, and page number of your notes. Noting details can make it easier for you to return to your notes and get important information."
                },
                {
                    "headline": "Use your own language.",
                    "description": "Write down key facts, ideas, and details in your own words. Avoid noting anything in the text verbatim, or word for word, unless it is a phrase or quote you may later use. Taking notes in your own words actively engages your brain, helps you better understand the text, makes you more likely to retain the information, and may minimize the risk of plagiarism. Develop your own system of signs and abbreviations that can help you more quickly take notes and review them. For example, “SM” for “scientific method,” or “GH” for “gender history.”"
                },
                {
                    "headline": "Write keywords instead of full sentences.",
                    "description": "Think about the text you’re reading or the lecture you’re listening to—they may be a bit dense and hard to understand. Avoid using these models when you write your notes. Instead, use keywords to say the same things in a short and manageable way that you can easily and quickly review later. For example, for obstetrics, you might note words such as midwife, placental abruption, childbed fever, and preeclampsia."
                },
                {
                    "headline": "Skip lines on the paper for later review.",
                    "description": "As you write your keywords and ideas down, leave space between each line. Having extra room allows you to make additional notes or clarify points that you may not understand. This helps you quickly have and identify all of the relevant material to that keyword or thought. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAshley Pritchard, MA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster's Degree, School Counseling, Caldwell University\t\t\t\t\t\t\t\tAshley Pritchard is an Academic and School Counselor at Delaware Valley Regional High School in Frenchtown, New Jersey. Ashley has over 3 years of high school, college, and career counseling experience. She has an MA in School Counseling with a specialization in Mental Health from Caldwell University and is certified as an Independent Education Consultant through the University of California, Irvine. Ashley Pritchard, MA\t\t\tMaster's Degree, School Counseling, Caldwell University\t\t\t\tTry to write your notes neatly, or rewrite them neatly later. Your notes will be a more effective study tool if they're organized and written out clearly."
                }
            ]
        },
        {
            "name": "Using a Specific Note-Taking Method",
            "steps": [
                {
                    "headline": "Write your notes by hand.",
                    "description": "Resist the temptation to type out your notes based on what you read or hear. Instead, use either standard or cursive handwriting to take notes. Writing out what you read and hear can help you better streamline, retain, and integrate the information for your purposes. If you have to, incorporate note-taking strategies such as the Cornell Method or an outline to structure your typewritten notes. Consider getting a note-taking program or app, like Evernote or Microsoft OneNote, to help you type more effective notes."
                },
                {
                    "headline": "Use the Cornell Method of note-taking.",
                    "description": "Split a sheet of note paper into three sections: a smaller cue section, a wider note-taking section, and a summary section at the very bottom of the page. Then take your notes in the following columns:\nNote-taking section: Use this largest section to write down the main ideas of the lecture or text. Leave room for later notes or questions. Be sure to note any guiding material related to this section. Cue section: After you’ve finished taking notes, use the smaller cue section to generate your own questions that clarify meanings, reveal connections, and show continuities. Summary section: After you’ve finished taking notes, use this small space at the bottom of your page to summarize what you’ve written on the page in 2-4 sentences."
                },
                {
                    "headline": "Compose an outline.",
                    "description": "As you read or listen to a lecture, keep your notes in outline format. Write general information from the left corner of the page. Indent slightly to the right and add details and examples underneath your general ideas."
                },
                {
                    "headline": "Draw your notes with mind-mapping.",
                    "description": "Draw large circles and write specific topics you hear or read in them. Use thicker lines to indicate main points and write a brief keyword or two that summarize supporting information to the topic. Finally, add shorter and thinner lines for supporting details. Mind mapping can be an especially useful tool if you are a visual learner or you don’t know a lecturer’s style."
                }
            ]
        },
        {
            "name": "Listening Effectively for Note-Taking",
            "steps": [
                {
                    "headline": "Arrive on time.",
                    "description": "Make sure you get to your meeting, class, or other engagement a few minutes before it starts. Sit in a place where you can hear the person speaking and where you’ll have as little distraction as possible. Getting to the lecture or presentation on time can minimize the risk that you miss important information. Have your notes out and ready before the class starts so you don’t have to rush to get your papers out."
                },
                {
                    "headline": "Note pertinent contextual information.",
                    "description": "Write down information that can help you identify your notes at the top of your paper. Include the date, class or meeting number, topic or theme of the meeting, and anything else you think is important. Make sure to do this before you start so that you don’t miss any important information once the speaker begins. Staying organized helps improve the quality of your notes overall."
                },
                {
                    "headline": "Check for guiding material.",
                    "description": "Before the speaker begins, make sure you’ve noted down any keywords on the board. Get a copy of any handouts the person has passed out. Having this guiding material minimizes the risk that you’ll miss important information and can help you better understand what the speaker is saying. Note the date at the top of handouts along with any relevant information for your notes. Refer to the handout in your notes so you know to consult any guiding material during your review."
                },
                {
                    "headline": "Listen carefully to the speaker.",
                    "description": "Be an active listener during your class or meeting. Avoid distractions such as other people, your computer, and social media accounts. Listening carefully can help you take better notes, understand the material, and remember it at a later date."
                },
                {
                    "headline": "Hear important transition words.",
                    "description": "Part of being an active listener is hearing words that signal something important that you should write in your notes. Many transition words will signal the start of a new section of note-taking. Listen for the following types of words that can indicate that you should note what’s coming next:\nFirst, second, third\nImportantly or significantly\nA major development\nOn the other hand\nFor example\nIn contrast\nFurther\nAs a result\nRemember that"
                },
                {
                    "headline": "Re-read your notes immediately.",
                    "description": "After your lecture or meeting, review your notes as soon as you can. Note any spots that need clarification or that you don’t understand. Reviewing your notes quickly after you write them can ensure that you understand and have an accurate record of the lecture or meeting. Rewrite your note as soon as you can. This may help you quickly identify areas that need clarification and may also help you better retain the information."
                }
            ]
        },
        {
            "name": "Reading Properly for Note-Taking",
            "steps": [
                {
                    "headline": "Skim the entire text.",
                    "description": "Before you start taking your notes, read over the entire text quickly. Avoid taking notes or stopping to highlight, which you can do once you have an idea of what the text is saying. Skimming the text can help you figure out the general theme of the text and what parts are most relevant to your question and subject matter. Pay particular attention to the following sections:\nTitle and summary or abstract of the text\nIntroduction or first paragraph\nTopic headings to figure out overall organization\nGraphic material\nConclusion or final paragraph"
                },
                {
                    "headline": "Identify why you’re taking notes on the text.",
                    "description": "After you’ve read the text, figure out the purposes for reading it and why you need to take notes. Ask yourself the following questions to guide the types of notes you take on the text:\nAm I trying to get a general understanding of a subject or concept? Do I need to know specific information or details from the text?"
                },
                {
                    "headline": "Underline key ideas.",
                    "description": "Most texts will have central arguments and ideas they want to convey. Note any key ideas you find with a short phrase or sentence. Highlighting these key ideas—in your own words— can ensure you have all of the important information about the text. In addition to underlining the key ideas in your notes, you can also literally underline or highlight them with your pen or pencil in the text. Make sure to write down the exact page in your notes so you can refer back to the original text. For example, “fall of the Weimar Republic,” is much more manageable than, “The overall conditions that led to the Nazi takeover of power in January of 1933 were a product of interwar intrigue that ultimately damned the young republic.”"
                },
                {
                    "headline": "Review your notes.",
                    "description": "Set aside your notes for a few hours. Re-read what you’ve written and ask if they parallel your understanding of the text. Clarify any keywords or ideas that you don’t understand and fill in your notes with additional thoughts or observations that may help you. Set a regular schedule to review your notes. The more often you review your notes, the more likely you are to remember them later."
                }
            ]
        }
    ],
    "tyn": [
        "Notebook, loose paper, or note-taking application (such as OneNote or Evernote)",
        "Pencil or pen",
        "Highlighter",
        "Textbook",
        "Resources or previous note topics (optional)"
    ],
    "text": " Taking Clear and Concise Notes You’ll Remember Note details at the top of your paper. Keep your notes organized by writing important details at the top of each page. Include information such as the date, bibliographic information, and page number of your notes. Noting details can make it easier for you to return to your notes and get important information. Use your own language. Write down key facts, ideas, and details in your own words. Avoid noting anything in the text verbatim, or word for word, unless it is a phrase or quote you may later use. Taking notes in your own words actively engages your brain, helps you better understand the text, makes you more likely to retain the information, and may minimize the risk of plagiarism. Develop your own system of signs and abbreviations that can help you more quickly take notes and review them. For example, “SM” for “scientific method,” or “GH” for “gender history.” Write keywords instead of full sentences. Think about the text you’re reading or the lecture you’re listening to—they may be a bit dense and hard to understand. Avoid using these models when you write your notes. Instead, use keywords to say the same things in a short and manageable way that you can easily and quickly review later. For example, for obstetrics, you might note words such as midwife, placental abruption, childbed fever, and preeclampsia. Skip lines on the paper for later review. As you write your keywords and ideas down, leave space between each line. Having extra room allows you to make additional notes or clarify points that you may not understand. This helps you quickly have and identify all of the relevant material to that keyword or thought. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAshley Pritchard, MA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster's Degree, School Counseling, Caldwell University\t\t\t\t\t\t\t\tAshley Pritchard is an Academic and School Counselor at Delaware Valley Regional High School in Frenchtown, New Jersey. Ashley has over 3 years of high school, college, and career counseling experience. She has an MA in School Counseling with a specialization in Mental Health from Caldwell University and is certified as an Independent Education Consultant through the University of California, Irvine. Ashley Pritchard, MA\t\t\tMaster's Degree, School Counseling, Caldwell University\t\t\t\tTry to write your notes neatly, or rewrite them neatly later. Your notes will be a more effective study tool if they're organized and written out clearly. Using a Specific Note-Taking Method Write your notes by hand. Resist the temptation to type out your notes based on what you read or hear. Instead, use either standard or cursive handwriting to take notes. Writing out what you read and hear can help you better streamline, retain, and integrate the information for your purposes. If you have to, incorporate note-taking strategies such as the Cornell Method or an outline to structure your typewritten notes. Consider getting a note-taking program or app, like Evernote or Microsoft OneNote, to help you type more effective notes. Use the Cornell Method of note-taking. Split a sheet of note paper into three sections: a smaller cue section, a wider note-taking section, and a summary section at the very bottom of the page. Then take your notes in the following columns:\nNote-taking section: Use this largest section to write down the main ideas of the lecture or text. Leave room for later notes or questions. Be sure to note any guiding material related to this section. Cue section: After you’ve finished taking notes, use the smaller cue section to generate your own questions that clarify meanings, reveal connections, and show continuities. Summary section: After you’ve finished taking notes, use this small space at the bottom of your page to summarize what you’ve written on the page in 2-4 sentences. Compose an outline. As you read or listen to a lecture, keep your notes in outline format. Write general information from the left corner of the page. Indent slightly to the right and add details and examples underneath your general ideas. Draw your notes with mind-mapping. Draw large circles and write specific topics you hear or read in them. Use thicker lines to indicate main points and write a brief keyword or two that summarize supporting information to the topic. Finally, add shorter and thinner lines for supporting details. Mind mapping can be an especially useful tool if you are a visual learner or you don’t know a lecturer’s style. Listening Effectively for Note-Taking Arrive on time. Make sure you get to your meeting, class, or other engagement a few minutes before it starts. Sit in a place where you can hear the person speaking and where you’ll have as little distraction as possible. Getting to the lecture or presentation on time can minimize the risk that you miss important information. Have your notes out and ready before the class starts so you don’t have to rush to get your papers out. Note pertinent contextual information. Write down information that can help you identify your notes at the top of your paper. Include the date, class or meeting number, topic or theme of the meeting, and anything else you think is important. Make sure to do this before you start so that you don’t miss any important information once the speaker begins. Staying organized helps improve the quality of your notes overall. Check for guiding material. Before the speaker begins, make sure you’ve noted down any keywords on the board. Get a copy of any handouts the person has passed out. Having this guiding material minimizes the risk that you’ll miss important information and can help you better understand what the speaker is saying. Note the date at the top of handouts along with any relevant information for your notes. Refer to the handout in your notes so you know to consult any guiding material during your review. Listen carefully to the speaker. Be an active listener during your class or meeting. Avoid distractions such as other people, your computer, and social media accounts. Listening carefully can help you take better notes, understand the material, and remember it at a later date. Hear important transition words. Part of being an active listener is hearing words that signal something important that you should write in your notes. Many transition words will signal the start of a new section of note-taking. Listen for the following types of words that can indicate that you should note what’s coming next:\nFirst, second, third\nImportantly or significantly\nA major development\nOn the other hand\nFor example\nIn contrast\nFurther\nAs a result\nRemember that Re-read your notes immediately. After your lecture or meeting, review your notes as soon as you can. Note any spots that need clarification or that you don’t understand. Reviewing your notes quickly after you write them can ensure that you understand and have an accurate record of the lecture or meeting. Rewrite your note as soon as you can. This may help you quickly identify areas that need clarification and may also help you better retain the information. Reading Properly for Note-Taking Skim the entire text. Before you start taking your notes, read over the entire text quickly. Avoid taking notes or stopping to highlight, which you can do once you have an idea of what the text is saying. Skimming the text can help you figure out the general theme of the text and what parts are most relevant to your question and subject matter. Pay particular attention to the following sections:\nTitle and summary or abstract of the text\nIntroduction or first paragraph\nTopic headings to figure out overall organization\nGraphic material\nConclusion or final paragraph Identify why you’re taking notes on the text. After you’ve read the text, figure out the purposes for reading it and why you need to take notes. Ask yourself the following questions to guide the types of notes you take on the text:\nAm I trying to get a general understanding of a subject or concept? Do I need to know specific information or details from the text? Underline key ideas. Most texts will have central arguments and ideas they want to convey. Note any key ideas you find with a short phrase or sentence. Highlighting these key ideas—in your own words— can ensure you have all of the important information about the text. In addition to underlining the key ideas in your notes, you can also literally underline or highlight them with your pen or pencil in the text. Make sure to write down the exact page in your notes so you can refer back to the original text. For example, “fall of the Weimar Republic,” is much more manageable than, “The overall conditions that led to the Nazi takeover of power in January of 1933 were a product of interwar intrigue that ultimately damned the young republic.” Review your notes. Set aside your notes for a few hours. Re-read what you’ve written and ask if they parallel your understanding of the text. Clarify any keywords or ideas that you don’t understand and fill in your notes with additional thoughts or observations that may help you. Set a regular schedule to review your notes. The more often you review your notes, the more likely you are to remember them later.",
    "sentences": [
        " Taking Clear and Concise Notes You’ll Remember Note details at the top of your paper.",
        "Keep your notes organized by writing important details at the top of each page.",
        "Include information such as the date, bibliographic information, and page number of your notes.",
        "Noting details can make it easier for you to return to your notes and get important information.",
        "Use your own language.",
        "Write down key facts, ideas, and details in your own words.",
        "Avoid noting anything in the text verbatim, or word for word, unless it is a phrase or quote you may later use.",
        "Taking notes in your own words actively engages your brain, helps you better understand the text, makes you more likely to retain the information, and may minimize the risk of plagiarism.",
        "Develop your own system of signs and abbreviations that can help you more quickly take notes and review them.",
        "For example, “SM” for “scientific method,” or “GH” for “gender history.” Write keywords instead of full sentences.",
        "Think about the text you’re reading or the lecture you’re listening to—they may be a bit dense and hard to understand.",
        "Avoid using these models when you write your notes.",
        "Instead, use keywords to say the same things in a short and manageable way that you can easily and quickly review later.",
        "For example, for obstetrics, you might note words such as midwife, placental abruption, childbed fever, and preeclampsia.",
        "Skip lines on the paper for later review.",
        "As you write your keywords and ideas down, leave space between each line.",
        "Having extra room allows you to make additional notes or clarify points that you may not understand.",
        "This helps you quickly have and identify all of the relevant material to that keyword or thought.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAshley Pritchard, MA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster's Degree, School Counseling, Caldwell University\t\t\t\t\t\t\t\tAshley Pritchard is an Academic and School Counselor at Delaware Valley Regional High School in Frenchtown, New Jersey.",
        "Ashley has over 3 years of high school, college, and career counseling experience.",
        "She has an MA in School Counseling with a specialization in Mental Health from Caldwell University and is certified as an Independent Education Consultant through the University of California, Irvine.",
        "Ashley Pritchard, MA\t\t\tMaster's Degree, School Counseling, Caldwell University\t\t\t\tTry to write your notes neatly, or rewrite them neatly later.",
        "Your notes will be a more effective study tool if they're organized and written out clearly.",
        "Using a Specific Note-Taking Method Write your notes by hand.",
        "Resist the temptation to type out your notes based on what you read or hear.",
        "Instead, use either standard or cursive handwriting to take notes.",
        "Writing out what you read and hear can help you better streamline, retain, and integrate the information for your purposes.",
        "If you have to, incorporate note-taking strategies such as the Cornell Method or an outline to structure your typewritten notes.",
        "Consider getting a note-taking program or app, like Evernote or Microsoft OneNote, to help you type more effective notes.",
        "Use the Cornell Method of note-taking.",
        "Split a sheet of note paper into three sections: a smaller cue section, a wider note-taking section, and a summary section at the very bottom of the page.",
        "Then take your notes in the following columns:\nNote-taking section: Use this largest section to write down the main ideas of the lecture or text.",
        "Leave room for later notes or questions.",
        "Be sure to note any guiding material related to this section.",
        "Cue section: After you’ve finished taking notes, use the smaller cue section to generate your own questions that clarify meanings, reveal connections, and show continuities.",
        "Summary section: After you’ve finished taking notes, use this small space at the bottom of your page to summarize what you’ve written on the page in 2-4 sentences.",
        "Compose an outline.",
        "As you read or listen to a lecture, keep your notes in outline format.",
        "Write general information from the left corner of the page.",
        "Indent slightly to the right and add details and examples underneath your general ideas.",
        "Draw your notes with mind-mapping.",
        "Draw large circles and write specific topics you hear or read in them.",
        "Use thicker lines to indicate main points and write a brief keyword or two that summarize supporting information to the topic.",
        "Finally, add shorter and thinner lines for supporting details.",
        "Mind mapping can be an especially useful tool if you are a visual learner or you don’t know a lecturer’s style.",
        "Listening Effectively for Note-Taking Arrive on time.",
        "Make sure you get to your meeting, class, or other engagement a few minutes before it starts.",
        "Sit in a place where you can hear the person speaking and where you’ll have as little distraction as possible.",
        "Getting to the lecture or presentation on time can minimize the risk that you miss important information.",
        "Have your notes out and ready before the class starts so you don’t have to rush to get your papers out.",
        "Note pertinent contextual information.",
        "Write down information that can help you identify your notes at the top of your paper.",
        "Include the date, class or meeting number, topic or theme of the meeting, and anything else you think is important.",
        "Make sure to do this before you start so that you don’t miss any important information once the speaker begins.",
        "Staying organized helps improve the quality of your notes overall.",
        "Check for guiding material.",
        "Before the speaker begins, make sure you’ve noted down any keywords on the board.",
        "Get a copy of any handouts the person has passed out.",
        "Having this guiding material minimizes the risk that you’ll miss important information and can help you better understand what the speaker is saying.",
        "Note the date at the top of handouts along with any relevant information for your notes.",
        "Refer to the handout in your notes so you know to consult any guiding material during your review.",
        "Listen carefully to the speaker.",
        "Be an active listener during your class or meeting.",
        "Avoid distractions such as other people, your computer, and social media accounts.",
        "Listening carefully can help you take better notes, understand the material, and remember it at a later date.",
        "Hear important transition words.",
        "Part of being an active listener is hearing words that signal something important that you should write in your notes.",
        "Many transition words will signal the start of a new section of note-taking.",
        "Listen for the following types of words that can indicate that you should note what’s coming next:\nFirst, second, third\nImportantly or significantly\nA major development\nOn the other hand\nFor example\nIn contrast\nFurther\nAs a result\nRemember that Re-read your notes immediately.",
        "After your lecture or meeting, review your notes as soon as you can.",
        "Note any spots that need clarification or that you don’t understand.",
        "Reviewing your notes quickly after you write them can ensure that you understand and have an accurate record of the lecture or meeting.",
        "Rewrite your note as soon as you can.",
        "This may help you quickly identify areas that need clarification and may also help you better retain the information.",
        "Reading Properly for Note-Taking Skim the entire text.",
        "Before you start taking your notes, read over the entire text quickly.",
        "Avoid taking notes or stopping to highlight, which you can do once you have an idea of what the text is saying.",
        "Skimming the text can help you figure out the general theme of the text and what parts are most relevant to your question and subject matter.",
        "Pay particular attention to the following sections:\nTitle and summary or abstract of the text\nIntroduction or first paragraph\nTopic headings to figure out overall organization\nGraphic material\nConclusion or final paragraph Identify why you’re taking notes on the text.",
        "After you’ve read the text, figure out the purposes for reading it and why you need to take notes.",
        "Ask yourself the following questions to guide the types of notes you take on the text:\nAm I trying to get a general understanding of a subject or concept?",
        "Do I need to know specific information or details from the text?",
        "Underline key ideas.",
        "Most texts will have central arguments and ideas they want to convey.",
        "Note any key ideas you find with a short phrase or sentence.",
        "Highlighting these key ideas—in your own words— can ensure you have all of the important information about the text.",
        "In addition to underlining the key ideas in your notes, you can also literally underline or highlight them with your pen or pencil in the text.",
        "Make sure to write down the exact page in your notes so you can refer back to the original text.",
        "For example, “fall of the Weimar Republic,” is much more manageable than, “The overall conditions that led to the Nazi takeover of power in January of 1933 were a product of interwar intrigue that ultimately damned the young republic.” Review your notes.",
        "Set aside your notes for a few hours.",
        "Re-read what you’ve written and ask if they parallel your understanding of the text.",
        "Clarify any keywords or ideas that you don’t understand and fill in your notes with additional thoughts or observations that may help you.",
        "Set a regular schedule to review your notes.",
        "The more often you review your notes, the more likely you are to remember them later."
    ]
}