{
    "title": "How to Make a Perfect Frisbee Catch",
    "url": "https://www.wikihow.com/Make-a-Perfect-Frisbee-Catch",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Backyard Games",
        "Flying Discs and Frisbees"
    ],
    "steps": [
        {
            "headline": "Don't be afraid of the disk.",
            "description": "It's only a plastic toy, not a meteor hurtling towards you at the speed of light (it just seems that way). Closing your eyes will only make it more difficult to catch."
        },
        {
            "headline": "Get someone to throw you a Frisbee or aerobie.",
            "description": "This is vital unless you have some kind of machine that throws flying disks."
        },
        {
            "headline": "Find an open area where nothing can be broken or stuck in trees.",
            "description": "This is not entirely vital, if you and your partner(s) are careful. Windows, cars and trees are the most common hazards."
        },
        {
            "headline": "Have the disk thrown in your general direction.",
            "description": ""
        },
        {
            "headline": "Now is the climax!",
            "description": "When the Frisbee (or aerobie) is in the air, move side to side with the movement of the disk. Do not go forward...yet."
        },
        {
            "headline": "When the disk is 1-2.5 feet (0.3-0.7 meters) in front of you, catch it.",
            "description": "It is instinct usually. The basic idea is to close your hands around the disk at the right time and not close your eyes. If the disc is an aerobie then the easiest way to catch it is to stick your arm in the large center hole. For Frisbee the easiest way to catch is the alligator method. Take both hands and clamp them around the disc like an alligator. For a one-handed catch: Keep your thumb pointing up if the disk is coming in below your waist. If the disk is coming in high, keep your thumb pointing down. Use whichever position feels most natural for in-between heights. Squeeze your fingers and thumb tightly together to grab the disk just before it smacks into your palm."
        },
        {
            "headline": "If the disk starts to fall early, do not run diagonally at it!",
            "description": "Run straight. If it rises at the last second, it is easier to stop when going straight than diagonally"
        },
        {
            "headline": "If it goes too far, jump or run back and jump.",
            "description": "Not hard."
        },
        {
            "headline": "Be happy inside you caught it!",
            "description": ""
        }
    ],
    "tyn": [
        "Aerobie or Frisbee",
        "You and at least one other person"
    ],
    "text": " Don't be afraid of the disk. It's only a plastic toy, not a meteor hurtling towards you at the speed of light (it just seems that way). Closing your eyes will only make it more difficult to catch. Get someone to throw you a Frisbee or aerobie. This is vital unless you have some kind of machine that throws flying disks. Find an open area where nothing can be broken or stuck in trees. This is not entirely vital, if you and your partner(s) are careful. Windows, cars and trees are the most common hazards. Have the disk thrown in your general direction.  Now is the climax! When the Frisbee (or aerobie) is in the air, move side to side with the movement of the disk. Do not go forward...yet. When the disk is 1-2.5 feet (0.3-0.7 meters) in front of you, catch it. It is instinct usually. The basic idea is to close your hands around the disk at the right time and not close your eyes. If the disc is an aerobie then the easiest way to catch it is to stick your arm in the large center hole. For Frisbee the easiest way to catch is the alligator method. Take both hands and clamp them around the disc like an alligator. For a one-handed catch: Keep your thumb pointing up if the disk is coming in below your waist. If the disk is coming in high, keep your thumb pointing down. Use whichever position feels most natural for in-between heights. Squeeze your fingers and thumb tightly together to grab the disk just before it smacks into your palm. If the disk starts to fall early, do not run diagonally at it! Run straight. If it rises at the last second, it is easier to stop when going straight than diagonally If it goes too far, jump or run back and jump. Not hard. Be happy inside you caught it! ",
    "sentences": [
        " Don't be afraid of the disk.",
        "It's only a plastic toy, not a meteor hurtling towards you at the speed of light (it just seems that way).",
        "Closing your eyes will only make it more difficult to catch.",
        "Get someone to throw you a Frisbee or aerobie.",
        "This is vital unless you have some kind of machine that throws flying disks.",
        "Find an open area where nothing can be broken or stuck in trees.",
        "This is not entirely vital, if you and your partner(s) are careful.",
        "Windows, cars and trees are the most common hazards.",
        "Have the disk thrown in your general direction.",
        "Now is the climax!",
        "When the Frisbee (or aerobie) is in the air, move side to side with the movement of the disk.",
        "Do not go forward...yet.",
        "When the disk is 1-2.5 feet (0.3-0.7 meters) in front of you, catch it.",
        "It is instinct usually.",
        "The basic idea is to close your hands around the disk at the right time and not close your eyes.",
        "If the disc is an aerobie then the easiest way to catch it is to stick your arm in the large center hole.",
        "For Frisbee the easiest way to catch is the alligator method.",
        "Take both hands and clamp them around the disc like an alligator.",
        "For a one-handed catch: Keep your thumb pointing up if the disk is coming in below your waist.",
        "If the disk is coming in high, keep your thumb pointing down.",
        "Use whichever position feels most natural for in-between heights.",
        "Squeeze your fingers and thumb tightly together to grab the disk just before it smacks into your palm.",
        "If the disk starts to fall early, do not run diagonally at it!",
        "Run straight.",
        "If it rises at the last second, it is easier to stop when going straight than diagonally If it goes too far, jump or run back and jump.",
        "Not hard.",
        "Be happy inside you caught it!"
    ]
}