{
    "title": "How to Make a Leprechaun Hat",
    "url": "https://www.wikihow.com/Make-a-Leprechaun-Hat",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "methods": [
        {
            "name": "Paper Leprechaun Hat",
            "steps": [
                {
                    "headline": "Cut out a rectangle for the buckle.",
                    "description": "Cut out a  3 by 2 in (7.6 by 5.1 cm) rectangle from yellow construction paper. Cut out another rectangle inside of it to create a hollow buckle shape. The rectangle can be vertical or horizontal--it’s up to you! Do not cut through the edge when cutting out the center. Pierce the center of the rectangle with your scissors or, if necessary, cut the center out using a craft knife or utility knife."
                },
                {
                    "headline": "Coat the buckle in glitter.",
                    "description": "Apply a thin coat of glue stick to one side of the paper buckle. Shake some gold glitter over the glue and let dry. This will make it look like shiny metal buckle! Make sure to shake off the excess glitter after you apply it."
                },
                {
                    "headline": "Cut a sheet of green construction paper in half.",
                    "description": "Use scissors to cut a standard sheet of green construction paper in half lengthwise, creating two skinny rectangles. If you want a taller hat, you can skip this step and use the entire sheet of construction paper for the body of the hat. You can recycle the other half of the sheet--you won’t need it anymore!"
                },
                {
                    "headline": "Draw a belt onto the bottom of one construction paper half.",
                    "description": "Carefully draw a straight line along the bottom of one of the green halves, about 2 inches (51 mm) from the bottom. Color this bottom portion in with black marker, crayon, or colored pencil."
                },
                {
                    "headline": "Glue the sides together to form a cylinder.",
                    "description": "Apply glue along the edge of the paper, on the side opposite from the belt. Bring the other edge around so that it overlaps the glue edge, forming a cylinder. Press the two edges in place and let dry. The paper should be face up, with the black band visible, when you apply the glue to one edge."
                },
                {
                    "headline": "Cut out a circle 2 inches (51 mm) wider than the cylinder.",
                    "description": "Place the cylinder on top of another sheet of green construction paper. Draw a circle around the cylinder that is roughly 2 inches (51 mm)  wider than the cylinder itself. Cut this circle out with scissors."
                },
                {
                    "headline": "Cut the center of the circle out.",
                    "description": "Place the cylinder on top of the circle again. Trace around it exactly this time, making sure that this second inside circle is the same size as the opening of the cylinder. Cut this circle out with scissors, but be careful not cut the outside circle. Avoid making the circumference of the circle smaller than that of the cylinder, since a circle that is too small will fall through when placed on the top of the cylinder."
                },
                {
                    "headline": "Tape or glue the small circle to the top of the cylinder.",
                    "description": "Use glue or tape to attach the smaller green circle to the top of the cylinder. This will close it off and make it look like a hat! Place circle on your work surface and set the cylinder on top of it. Tape the two pieces together, attaching the tape to the inside of the cylinder rather than the outside. If using glue, you will need to lay the circle on your work surface and draw a thin line of glue around the edge. Set the cylinder on top so that it dips into the glue."
                },
                {
                    "headline": "Attach the ring to the bottom of the cylinder.",
                    "description": "Turn the hat upside-down and place the ring on top. Tape the two pieces together, attaching the tape to the inside of the cylinder and the bottom of the brim."
                },
                {
                    "headline": "Glue the buckle onto the hat.",
                    "description": "Apply a thin coat of glue to the paper buckle. Press the buckle onto the black strip at the bottom of the hat and let it dry. The seam of the hat should face the back, and the buckle should be directly across from the seam at the front of the hat."
                }
            ]
        },
        {
            "name": "Fabric Leprechaun Hat",
            "steps": [
                {
                    "headline": "Use iron-on interfacing to add stability to the hat (optional).",
                    "description": "If you are using a fabric that is somewhat flimsy, place iron-on interfacing on the back side of the fabric and iron in place until bonded. This will help your hat hold its shape, but it’s not required."
                },
                {
                    "headline": "Cut out a large circle from sturdy green fabric.",
                    "description": "Craft felt is a good choice for this project--it’s strong, comes in multiple colors, and is inexpensive. The circle should have a diameter of about 12 inches (300 mm). Avoid using soft, foldable fabric like jersey for this project. This hat is designed for children. For an adult-sized hat, you may need an initial circle that is roughly 18 inches (460 mm) in diameter."
                },
                {
                    "headline": "Divide the circle into a ring and a center circle.",
                    "description": "Cut a small circle out of your original circle. The diameter of this circle should roughly match to diameter of the wearer's head. Be sure to cut out the center of the circle instead of cutting through the outer ring! To find the correct head size, drape the fabric over the wearer’s head and mark it with a pencil."
                },
                {
                    "headline": "Cut out a rectangle for the body of the hat.",
                    "description": "Use the same green fabric used for the circles. The length of the rectangle should roughly match the circumference of the smaller circle with 1 inch (25 mm) of extra material for a seam allowance. The width should be about 12 inches (300 mm)."
                },
                {
                    "headline": "Form a cylinder from the body rectangle.",
                    "description": "Fold the rectangular piece of fabric in half widthwise, with the wrong side facing out, and pin in place. Stitch a straight stitch along the open end of the fabric, roughly ⁄2 inch (13 mm) in from the edge. You can also use fabric glue or iron-on seams for the hat!"
                },
                {
                    "headline": "Pin and sew the top to the cylinder.",
                    "description": "With the wrong side still facing out, and the wrong side of the small circle facing up, pin the circle to one open end of the cylinder. Stitch in place. The right sides of the fabric should not be visible to you at the moment, but they should all face one another."
                },
                {
                    "headline": "Pin and sew the brim to the hat.",
                    "description": "Turn the hat upside-down and right side out. Pin the inside of the ring to the remaining open edge of the hat and stitch in place."
                },
                {
                    "headline": "Cut out a yellow rectangle for a buckle.",
                    "description": "Use sturdy, ravel-resistant fabric like felt and cut out a rectangle that is 4 inches (100 mm) by 5.5 inches (140 mm). Cut out a second rectangle from the center of this rectangle, making an outline that is roughly 1 inch (25 mm) thick."
                },
                {
                    "headline": "Cut out a black rectangle for a band.",
                    "description": "The strip of black fabric should be about 3 inches (76 mm) wide and the same length as your original body rectangle. Felt is the best choice, but you can use any sturdy, ravel-resistant black fabric."
                },
                {
                    "headline": "Attach the buckle to the band.",
                    "description": "Sew or glue the yellow buckle piece onto the center of the black band. Fabric glue is best, but you can use school glue for felt and most other fabrics."
                },
                {
                    "headline": "Glue or stitch the band to the hat.",
                    "description": "Sew or glue the black band around the bottom of the hat, just above the brim. The band should almost lie flush against the rim of the hat. Bring the back edges together at the back edge of the hat, allowing them to overlap."
                }
            ]
        },
        {
            "name": "Using a Pre-Made Hat",
            "steps": [
                {
                    "headline": "Buy a ready-made craft hat.",
                    "description": "Craft stores sell plastic or felt hats that are ready for crafting. Buy one in green if possible, but if you can only get them in white, try spray-painting the hat green before starting. Top hats or derby hats are great for this! You can also use a real hat for this method."
                },
                {
                    "headline": "Cut out a rectangle window out of yellow paper or fabric.",
                    "description": "Cut a 3 inches (76 mm) by 2 inches (51 mm) rectangle out of yellow construction paper or fabric. You should have a rectangular shape that looks like a window--a border with an empty space in the middle. This will be your buckle."
                },
                {
                    "headline": "Add glitter to the rectangle.",
                    "description": "Spread a layer of school glue or glue stick to the buckle. Sprinkle gold glitter on it, then let it dry. Be sure to shake off any excess glitter before using the buckle!"
                },
                {
                    "headline": "Cut a 2 inches (51 mm) black band.",
                    "description": "Use the same kind of material you did for the buckle. The band should be about 2 inches (51 mm) wide, and it should be long enough to wrap completely around the base of the hat’s brim."
                },
                {
                    "headline": "Glue the buckle to the band.",
                    "description": "Glue the buckle to the center of the band. It should look like the buckle is holding the band in place, just like a real buckle. If you are using fabric, you can sew them together instead."
                },
                {
                    "headline": "Glue the band to the hat.",
                    "description": "Use craft glue to attach the band to the base of the hat’s brim. If you used fabric and your hat is made of cloth, you can sew them together. If your hat is made of plastic, be sure your glue is plastic-safe."
                }
            ]
        }
    ],
    "tyn": [
        "Paper Leprechaun Hat",
        "2 sheets of green construction paper",
        "School glue (glue stick or liquid glue)",
        "Clear tape",
        "Gold glitter",
        "Scissors",
        "Craft knife (optional)",
        "Bowl (optional)",
        "Ruler (optional)",
        "Pencil (optional)",
        "Fabric Leprechaun Hat",
        "Tape measure",
        "Green fabric, roughly 1 yd (1 m)",
        "Black fabric, roughly 1/4 yd (1/4 m)",
        "Yellow fabric, scraps",
        "Green, black, yellow thread",
        "Sewing needle or sewing machine",
        "Iron (optional)",
        "Interfacing (optional)",
        "Fray check (optional)",
        "Fabric glue (optional)",
        "Ready-Made Hat",
        "Green craft hat",
        "Yellow paper or fabric",
        "Black paper or fabric",
        "Glue"
    ],
    "text": " Paper Leprechaun Hat Cut out a rectangle for the buckle. Cut out a  3 by 2 in (7.6 by 5.1 cm) rectangle from yellow construction paper. Cut out another rectangle inside of it to create a hollow buckle shape. The rectangle can be vertical or horizontal--it’s up to you! Do not cut through the edge when cutting out the center. Pierce the center of the rectangle with your scissors or, if necessary, cut the center out using a craft knife or utility knife. Coat the buckle in glitter. Apply a thin coat of glue stick to one side of the paper buckle. Shake some gold glitter over the glue and let dry. This will make it look like shiny metal buckle! Make sure to shake off the excess glitter after you apply it. Cut a sheet of green construction paper in half. Use scissors to cut a standard sheet of green construction paper in half lengthwise, creating two skinny rectangles. If you want a taller hat, you can skip this step and use the entire sheet of construction paper for the body of the hat. You can recycle the other half of the sheet--you won’t need it anymore! Draw a belt onto the bottom of one construction paper half. Carefully draw a straight line along the bottom of one of the green halves, about 2 inches (51 mm) from the bottom. Color this bottom portion in with black marker, crayon, or colored pencil. Glue the sides together to form a cylinder. Apply glue along the edge of the paper, on the side opposite from the belt. Bring the other edge around so that it overlaps the glue edge, forming a cylinder. Press the two edges in place and let dry. The paper should be face up, with the black band visible, when you apply the glue to one edge. Cut out a circle 2 inches (51 mm) wider than the cylinder. Place the cylinder on top of another sheet of green construction paper. Draw a circle around the cylinder that is roughly 2 inches (51 mm)  wider than the cylinder itself. Cut this circle out with scissors. Cut the center of the circle out. Place the cylinder on top of the circle again. Trace around it exactly this time, making sure that this second inside circle is the same size as the opening of the cylinder. Cut this circle out with scissors, but be careful not cut the outside circle. Avoid making the circumference of the circle smaller than that of the cylinder, since a circle that is too small will fall through when placed on the top of the cylinder. Tape or glue the small circle to the top of the cylinder. Use glue or tape to attach the smaller green circle to the top of the cylinder. This will close it off and make it look like a hat! Place circle on your work surface and set the cylinder on top of it. Tape the two pieces together, attaching the tape to the inside of the cylinder rather than the outside. If using glue, you will need to lay the circle on your work surface and draw a thin line of glue around the edge. Set the cylinder on top so that it dips into the glue. Attach the ring to the bottom of the cylinder. Turn the hat upside-down and place the ring on top. Tape the two pieces together, attaching the tape to the inside of the cylinder and the bottom of the brim. Glue the buckle onto the hat. Apply a thin coat of glue to the paper buckle. Press the buckle onto the black strip at the bottom of the hat and let it dry. The seam of the hat should face the back, and the buckle should be directly across from the seam at the front of the hat. Fabric Leprechaun Hat Use iron-on interfacing to add stability to the hat (optional). If you are using a fabric that is somewhat flimsy, place iron-on interfacing on the back side of the fabric and iron in place until bonded. This will help your hat hold its shape, but it’s not required. Cut out a large circle from sturdy green fabric. Craft felt is a good choice for this project--it’s strong, comes in multiple colors, and is inexpensive. The circle should have a diameter of about 12 inches (300 mm). Avoid using soft, foldable fabric like jersey for this project. This hat is designed for children. For an adult-sized hat, you may need an initial circle that is roughly 18 inches (460 mm) in diameter. Divide the circle into a ring and a center circle. Cut a small circle out of your original circle. The diameter of this circle should roughly match to diameter of the wearer's head. Be sure to cut out the center of the circle instead of cutting through the outer ring! To find the correct head size, drape the fabric over the wearer’s head and mark it with a pencil. Cut out a rectangle for the body of the hat. Use the same green fabric used for the circles. The length of the rectangle should roughly match the circumference of the smaller circle with 1 inch (25 mm) of extra material for a seam allowance. The width should be about 12 inches (300 mm). Form a cylinder from the body rectangle. Fold the rectangular piece of fabric in half widthwise, with the wrong side facing out, and pin in place. Stitch a straight stitch along the open end of the fabric, roughly ⁄2 inch (13 mm) in from the edge. You can also use fabric glue or iron-on seams for the hat! Pin and sew the top to the cylinder. With the wrong side still facing out, and the wrong side of the small circle facing up, pin the circle to one open end of the cylinder. Stitch in place. The right sides of the fabric should not be visible to you at the moment, but they should all face one another. Pin and sew the brim to the hat. Turn the hat upside-down and right side out. Pin the inside of the ring to the remaining open edge of the hat and stitch in place. Cut out a yellow rectangle for a buckle. Use sturdy, ravel-resistant fabric like felt and cut out a rectangle that is 4 inches (100 mm) by 5.5 inches (140 mm). Cut out a second rectangle from the center of this rectangle, making an outline that is roughly 1 inch (25 mm) thick. Cut out a black rectangle for a band. The strip of black fabric should be about 3 inches (76 mm) wide and the same length as your original body rectangle. Felt is the best choice, but you can use any sturdy, ravel-resistant black fabric. Attach the buckle to the band. Sew or glue the yellow buckle piece onto the center of the black band. Fabric glue is best, but you can use school glue for felt and most other fabrics. Glue or stitch the band to the hat. Sew or glue the black band around the bottom of the hat, just above the brim. The band should almost lie flush against the rim of the hat. Bring the back edges together at the back edge of the hat, allowing them to overlap. Using a Pre-Made Hat Buy a ready-made craft hat. Craft stores sell plastic or felt hats that are ready for crafting. Buy one in green if possible, but if you can only get them in white, try spray-painting the hat green before starting. Top hats or derby hats are great for this! You can also use a real hat for this method. Cut out a rectangle window out of yellow paper or fabric. Cut a 3 inches (76 mm) by 2 inches (51 mm) rectangle out of yellow construction paper or fabric. You should have a rectangular shape that looks like a window--a border with an empty space in the middle. This will be your buckle. Add glitter to the rectangle. Spread a layer of school glue or glue stick to the buckle. Sprinkle gold glitter on it, then let it dry. Be sure to shake off any excess glitter before using the buckle! Cut a 2 inches (51 mm) black band. Use the same kind of material you did for the buckle. The band should be about 2 inches (51 mm) wide, and it should be long enough to wrap completely around the base of the hat’s brim. Glue the buckle to the band. Glue the buckle to the center of the band. It should look like the buckle is holding the band in place, just like a real buckle. If you are using fabric, you can sew them together instead. Glue the band to the hat. Use craft glue to attach the band to the base of the hat’s brim. If you used fabric and your hat is made of cloth, you can sew them together. If your hat is made of plastic, be sure your glue is plastic-safe.",
    "sentences": [
        " Paper Leprechaun Hat Cut out a rectangle for the buckle.",
        "Cut out a  3 by 2 in (7.6 by 5.1 cm) rectangle from yellow construction paper.",
        "Cut out another rectangle inside of it to create a hollow buckle shape.",
        "The rectangle can be vertical or horizontal--it’s up to you!",
        "Do not cut through the edge when cutting out the center.",
        "Pierce the center of the rectangle with your scissors or, if necessary, cut the center out using a craft knife or utility knife.",
        "Coat the buckle in glitter.",
        "Apply a thin coat of glue stick to one side of the paper buckle.",
        "Shake some gold glitter over the glue and let dry.",
        "This will make it look like shiny metal buckle!",
        "Make sure to shake off the excess glitter after you apply it.",
        "Cut a sheet of green construction paper in half.",
        "Use scissors to cut a standard sheet of green construction paper in half lengthwise, creating two skinny rectangles.",
        "If you want a taller hat, you can skip this step and use the entire sheet of construction paper for the body of the hat.",
        "You can recycle the other half of the sheet--you won’t need it anymore!",
        "Draw a belt onto the bottom of one construction paper half.",
        "Carefully draw a straight line along the bottom of one of the green halves, about 2 inches (51 mm) from the bottom.",
        "Color this bottom portion in with black marker, crayon, or colored pencil.",
        "Glue the sides together to form a cylinder.",
        "Apply glue along the edge of the paper, on the side opposite from the belt.",
        "Bring the other edge around so that it overlaps the glue edge, forming a cylinder.",
        "Press the two edges in place and let dry.",
        "The paper should be face up, with the black band visible, when you apply the glue to one edge.",
        "Cut out a circle 2 inches (51 mm) wider than the cylinder.",
        "Place the cylinder on top of another sheet of green construction paper.",
        "Draw a circle around the cylinder that is roughly 2 inches (51 mm)  wider than the cylinder itself.",
        "Cut this circle out with scissors.",
        "Cut the center of the circle out.",
        "Place the cylinder on top of the circle again.",
        "Trace around it exactly this time, making sure that this second inside circle is the same size as the opening of the cylinder.",
        "Cut this circle out with scissors, but be careful not cut the outside circle.",
        "Avoid making the circumference of the circle smaller than that of the cylinder, since a circle that is too small will fall through when placed on the top of the cylinder.",
        "Tape or glue the small circle to the top of the cylinder.",
        "Use glue or tape to attach the smaller green circle to the top of the cylinder.",
        "This will close it off and make it look like a hat!",
        "Place circle on your work surface and set the cylinder on top of it.",
        "Tape the two pieces together, attaching the tape to the inside of the cylinder rather than the outside.",
        "If using glue, you will need to lay the circle on your work surface and draw a thin line of glue around the edge.",
        "Set the cylinder on top so that it dips into the glue.",
        "Attach the ring to the bottom of the cylinder.",
        "Turn the hat upside-down and place the ring on top.",
        "Tape the two pieces together, attaching the tape to the inside of the cylinder and the bottom of the brim.",
        "Glue the buckle onto the hat.",
        "Apply a thin coat of glue to the paper buckle.",
        "Press the buckle onto the black strip at the bottom of the hat and let it dry.",
        "The seam of the hat should face the back, and the buckle should be directly across from the seam at the front of the hat.",
        "Fabric Leprechaun Hat Use iron-on interfacing to add stability to the hat (optional).",
        "If you are using a fabric that is somewhat flimsy, place iron-on interfacing on the back side of the fabric and iron in place until bonded.",
        "This will help your hat hold its shape, but it’s not required.",
        "Cut out a large circle from sturdy green fabric.",
        "Craft felt is a good choice for this project--it’s strong, comes in multiple colors, and is inexpensive.",
        "The circle should have a diameter of about 12 inches (300 mm).",
        "Avoid using soft, foldable fabric like jersey for this project.",
        "This hat is designed for children.",
        "For an adult-sized hat, you may need an initial circle that is roughly 18 inches (460 mm) in diameter.",
        "Divide the circle into a ring and a center circle.",
        "Cut a small circle out of your original circle.",
        "The diameter of this circle should roughly match to diameter of the wearer's head.",
        "Be sure to cut out the center of the circle instead of cutting through the outer ring!",
        "To find the correct head size, drape the fabric over the wearer’s head and mark it with a pencil.",
        "Cut out a rectangle for the body of the hat.",
        "Use the same green fabric used for the circles.",
        "The length of the rectangle should roughly match the circumference of the smaller circle with 1 inch (25 mm) of extra material for a seam allowance.",
        "The width should be about 12 inches (300 mm).",
        "Form a cylinder from the body rectangle.",
        "Fold the rectangular piece of fabric in half widthwise, with the wrong side facing out, and pin in place.",
        "Stitch a straight stitch along the open end of the fabric, roughly ⁄2 inch (13 mm) in from the edge.",
        "You can also use fabric glue or iron-on seams for the hat!",
        "Pin and sew the top to the cylinder.",
        "With the wrong side still facing out, and the wrong side of the small circle facing up, pin the circle to one open end of the cylinder.",
        "Stitch in place.",
        "The right sides of the fabric should not be visible to you at the moment, but they should all face one another.",
        "Pin and sew the brim to the hat.",
        "Turn the hat upside-down and right side out.",
        "Pin the inside of the ring to the remaining open edge of the hat and stitch in place.",
        "Cut out a yellow rectangle for a buckle.",
        "Use sturdy, ravel-resistant fabric like felt and cut out a rectangle that is 4 inches (100 mm) by 5.5 inches (140 mm).",
        "Cut out a second rectangle from the center of this rectangle, making an outline that is roughly 1 inch (25 mm) thick.",
        "Cut out a black rectangle for a band.",
        "The strip of black fabric should be about 3 inches (76 mm) wide and the same length as your original body rectangle.",
        "Felt is the best choice, but you can use any sturdy, ravel-resistant black fabric.",
        "Attach the buckle to the band.",
        "Sew or glue the yellow buckle piece onto the center of the black band.",
        "Fabric glue is best, but you can use school glue for felt and most other fabrics.",
        "Glue or stitch the band to the hat.",
        "Sew or glue the black band around the bottom of the hat, just above the brim.",
        "The band should almost lie flush against the rim of the hat.",
        "Bring the back edges together at the back edge of the hat, allowing them to overlap.",
        "Using a Pre-Made Hat Buy a ready-made craft hat.",
        "Craft stores sell plastic or felt hats that are ready for crafting.",
        "Buy one in green if possible, but if you can only get them in white, try spray-painting the hat green before starting.",
        "Top hats or derby hats are great for this!",
        "You can also use a real hat for this method.",
        "Cut out a rectangle window out of yellow paper or fabric.",
        "Cut a 3 inches (76 mm) by 2 inches (51 mm) rectangle out of yellow construction paper or fabric.",
        "You should have a rectangular shape that looks like a window--a border with an empty space in the middle.",
        "This will be your buckle.",
        "Add glitter to the rectangle.",
        "Spread a layer of school glue or glue stick to the buckle.",
        "Sprinkle gold glitter on it, then let it dry.",
        "Be sure to shake off any excess glitter before using the buckle!",
        "Cut a 2 inches (51 mm) black band.",
        "Use the same kind of material you did for the buckle.",
        "The band should be about 2 inches (51 mm) wide, and it should be long enough to wrap completely around the base of the hat’s brim.",
        "Glue the buckle to the band.",
        "Glue the buckle to the center of the band.",
        "It should look like the buckle is holding the band in place, just like a real buckle.",
        "If you are using fabric, you can sew them together instead.",
        "Glue the band to the hat.",
        "Use craft glue to attach the band to the base of the hat’s brim.",
        "If you used fabric and your hat is made of cloth, you can sew them together.",
        "If your hat is made of plastic, be sure your glue is plastic-safe."
    ]
}