{
    "title": "How to Cook Corned Beef in a Crockpot",
    "url": "https://www.wikihow.com/Cook-Corned-Beef-in-a-Crockpot",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Beef and Lamb"
    ],
    "parts": [
        {
            "name": "Buy Brisket",
            "steps": [
                {
                    "headline": "Shop for a brisket at your local supermarket or butcher's shop.",
                    "description": ""
                },
                {
                    "headline": "Choose a brisket that is about 3 to 4 lbs.",
                    "description": "(1.3 to 1.8kg). This size will fit well in most slow cookers. If you have a smaller slow cooker, you may need to cut your brisket into a manageable size."
                }
            ]
        },
        {
            "name": "Prepare Corned Beef",
            "steps": [
                {
                    "headline": "Defrost the beef brisket for 24 to 48 hours in the refrigerator if it is frozen.",
                    "description": ""
                },
                {
                    "headline": "Remove the beef brisket from the refrigerator.",
                    "description": "Leave it to rest covered on the counter for 30 to 60 minutes. It will come to room temperature."
                },
                {
                    "headline": "Mix your pickling spices.",
                    "description": "In place of mixing your own, you can also use the spice packet that is often sold with a corned beef brisket. If you are mixing your own, try 1/4 cup of brown sugar, 1 tbsp. of pink pickling salt, 1 bay leaf and 2 crushed garlic cloves. Add 1/2 tbsp. of the following: dill seeds, black peppercorns, allspice berries and dried thyme. Add 1/4 tbsp. of hot red pepper flakes, mustard seeds, coriander seeds, celery seeds, ground ginger and whole cloves."
                },
                {
                    "headline": "Rub the brisket all over with the pickling spices.",
                    "description": "Place it in your slow cooker."
                }
            ]
        },
        {
            "name": "Prepare Vegetables",
            "steps": [
                {
                    "headline": "Clean and peel carrots, potatoes, rutabaga and/or onions and a leek.",
                    "description": "Choose the vegetables you like best."
                },
                {
                    "headline": "Cut into 4 inch (10cm) pieces.",
                    "description": "Layer them on the brisket in the following order: rutabaga, potatoes, carrots, onions or leek."
                },
                {
                    "headline": "Pour enough water into the slow cooker to almost cover the brisket.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Slow Cook Corned Beef",
            "steps": [
                {
                    "headline": "Plug in the slow cooker.",
                    "description": "Place the cover over the beef and vegetables."
                },
                {
                    "headline": "Set the timer for 4 hours on high or 8 hours on low.",
                    "description": ""
                },
                {
                    "headline": "Clean and chop up cabbage into 1.5 inch (3.8cm) wedges.",
                    "description": ""
                },
                {
                    "headline": "Set a timer to go off either 1.5 hours (on low) or 45 minutes (on high) before the total cook time is done.",
                    "description": ""
                },
                {
                    "headline": "Place the cabbage on top of the brisket and replace the lid.",
                    "description": ""
                },
                {
                    "headline": "Cook for 45 minutes to 1.5 hours longer.",
                    "description": ""
                },
                {
                    "headline": "Remove and drain the vegetables with a slotted spoon.",
                    "description": ""
                },
                {
                    "headline": "Remove the brisket.",
                    "description": "Let it sit for 5 to 10 minutes while covered, then slice thinly against the grain."
                },
                {
                    "headline": "Serve immediately with mustard or horseradish.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Crockpot",
        "Beef brisket",
        "Salt",
        "Pickling spice packet/pickling spice mix",
        "Vegetables",
        "Knife",
        "Timer",
        "Slotted spoon",
        "Brown sugar",
        "Pink pickling salt"
    ],
    "text": " Buy Brisket Shop for a brisket at your local supermarket or butcher's shop.  Choose a brisket that is about 3 to 4 lbs. (1.3 to 1.8kg). This size will fit well in most slow cookers. If you have a smaller slow cooker, you may need to cut your brisket into a manageable size. Prepare Corned Beef Defrost the beef brisket for 24 to 48 hours in the refrigerator if it is frozen.  Remove the beef brisket from the refrigerator. Leave it to rest covered on the counter for 30 to 60 minutes. It will come to room temperature. Mix your pickling spices. In place of mixing your own, you can also use the spice packet that is often sold with a corned beef brisket. If you are mixing your own, try 1/4 cup of brown sugar, 1 tbsp. of pink pickling salt, 1 bay leaf and 2 crushed garlic cloves. Add 1/2 tbsp. of the following: dill seeds, black peppercorns, allspice berries and dried thyme. Add 1/4 tbsp. of hot red pepper flakes, mustard seeds, coriander seeds, celery seeds, ground ginger and whole cloves. Rub the brisket all over with the pickling spices. Place it in your slow cooker. Prepare Vegetables Clean and peel carrots, potatoes, rutabaga and/or onions and a leek. Choose the vegetables you like best. Cut into 4 inch (10cm) pieces. Layer them on the brisket in the following order: rutabaga, potatoes, carrots, onions or leek. Pour enough water into the slow cooker to almost cover the brisket.  Slow Cook Corned Beef Plug in the slow cooker. Place the cover over the beef and vegetables. Set the timer for 4 hours on high or 8 hours on low.  Clean and chop up cabbage into 1.5 inch (3.8cm) wedges.  Set a timer to go off either 1.5 hours (on low) or 45 minutes (on high) before the total cook time is done.  Place the cabbage on top of the brisket and replace the lid.  Cook for 45 minutes to 1.5 hours longer.  Remove and drain the vegetables with a slotted spoon.  Remove the brisket. Let it sit for 5 to 10 minutes while covered, then slice thinly against the grain. Serve immediately with mustard or horseradish. ",
    "sentences": [
        " Buy Brisket Shop for a brisket at your local supermarket or butcher's shop.",
        "Choose a brisket that is about 3 to 4 lbs.",
        "(1.3 to 1.8kg).",
        "This size will fit well in most slow cookers.",
        "If you have a smaller slow cooker, you may need to cut your brisket into a manageable size.",
        "Prepare Corned Beef Defrost the beef brisket for 24 to 48 hours in the refrigerator if it is frozen.",
        "Remove the beef brisket from the refrigerator.",
        "Leave it to rest covered on the counter for 30 to 60 minutes.",
        "It will come to room temperature.",
        "Mix your pickling spices.",
        "In place of mixing your own, you can also use the spice packet that is often sold with a corned beef brisket.",
        "If you are mixing your own, try 1/4 cup of brown sugar, 1 tbsp.",
        "of pink pickling salt, 1 bay leaf and 2 crushed garlic cloves.",
        "Add 1/2 tbsp.",
        "of the following: dill seeds, black peppercorns, allspice berries and dried thyme.",
        "Add 1/4 tbsp.",
        "of hot red pepper flakes, mustard seeds, coriander seeds, celery seeds, ground ginger and whole cloves.",
        "Rub the brisket all over with the pickling spices.",
        "Place it in your slow cooker.",
        "Prepare Vegetables Clean and peel carrots, potatoes, rutabaga and/or onions and a leek.",
        "Choose the vegetables you like best.",
        "Cut into 4 inch (10cm) pieces.",
        "Layer them on the brisket in the following order: rutabaga, potatoes, carrots, onions or leek.",
        "Pour enough water into the slow cooker to almost cover the brisket.",
        "Slow Cook Corned Beef Plug in the slow cooker.",
        "Place the cover over the beef and vegetables.",
        "Set the timer for 4 hours on high or 8 hours on low.",
        "Clean and chop up cabbage into 1.5 inch (3.8cm) wedges.",
        "Set a timer to go off either 1.5 hours (on low) or 45 minutes (on high) before the total cook time is done.",
        "Place the cabbage on top of the brisket and replace the lid.",
        "Cook for 45 minutes to 1.5 hours longer.",
        "Remove and drain the vegetables with a slotted spoon.",
        "Remove the brisket.",
        "Let it sit for 5 to 10 minutes while covered, then slice thinly against the grain.",
        "Serve immediately with mustard or horseradish."
    ]
}