{
    "title": "How to Make Sidewalk Chalk",
    "url": "https://www.wikihow.com/Make-Sidewalk-Chalk",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Craft for Kids",
        "Chalk Projects"
    ],
    "methods": [
        {
            "name": "Making Cylindrical Molds for Sidewalk Chalk",
            "steps": [
                {
                    "headline": "Gather three to six toilet paper rolls.",
                    "description": "You can also use paper towel tubes, but you will need to cut them in half."
                },
                {
                    "headline": "Cover one end of each tube with duct tape.",
                    "description": "Use enough tape so that there are no holes. If there are any holes, the chalk mixture will leak."
                },
                {
                    "headline": "Line the tubes with wax paper.",
                    "description": "Cut the wax paper into 6 inch by 6 inch (15.25 centimeters by 15.25 centimeters) squares. Roll the wax paper into a tube and slip it inside each toilet paper roll. Gently spread the wax paper out until it is the same size as the toilet paper roll. The top of the wax paper should stick out of the top of the tube. The wax paper will protect the cardboard from the chalk mixture."
                }
            ]
        },
        {
            "name": "Making Sidewalk Chalk",
            "steps": [
                {
                    "headline": "Combine ¼ cup (60 milliliters) of warm water with ½ cup (50 grams) of Plaster of Paris in a small bowl or a large cup.",
                    "description": "Mix the two together with a plastic spoon until you get a thick, soupy mixture. There should be no clumps. Plaster of Paris will begin to harden within 20 to 30 minutes, so you will need to work quickly."
                },
                {
                    "headline": "Mix in 2 to 3 tablespoons (30 to 45 ml) of tempera paint.",
                    "description": "The more paint you use, the brighter your color will be. The less paint you use, the lighter your color will be. Be sure that there are no streaks or swirls in your mixture. The color should be even. If you want to make different colors, divide the Plaster of Paris mixture between two to three small cups. Stir in about 1 tablespoon of paint into each cup. For an even more creative twist, you can use glow-in-the-dark or fluorescent paint instead of standard tempera paint. Glow-in-the-dark paint will allow the chalk to glow at night. Fluorescent paint will allow the chalk to glow under a black light."
                },
                {
                    "headline": "Transfer the mixture into your mold once the mixture begins to thicken.",
                    "description": "You can use almost anything that can hold liquids without leaking as a mold. For example, you can use a normal ice cube tray, or one with fun shapes, such as stars or fish. You can also use toilet paper rolls. Click here to learn how to make toilet paper rolls into chalk molds. If you are using ice cube trays, be sure to wipe any spills and leaks with a damp paper towel before the chalk dries. If you made toilet paper tube molds: line the tubes up on a baking sheet with the tape side facing down. Carefully spoon the colored mixture into each tube. Gently flick the side of each tube with your index finger to bring any trapped air bubbles to the surface."
                },
                {
                    "headline": "Let the chalk dry.",
                    "description": "This can take anywhere between one to three days, depending on the size of your molds. For example, a simple ice cube tray may take as little as a day to dry, while toilet paper rolls will take up to three days."
                },
                {
                    "headline": "Remove the chalk from the molds and allow the chalk to finish drying.",
                    "description": "Once you pop the chalk out of the molds, you may notice that the underside is still damp. If this happens, simply spread the chalk out on a dry, flat surface with the damp part facing upwards. It should be dry within an hour. If you used toilet paper tubes: peel off the duct tape and flip over each tube so that the bottoms can dry. After the chalk has finished drying, peel off the cardboard and wax paper."
                }
            ]
        },
        {
            "name": "Making Liquid Sidewalk Chalk",
            "steps": [
                {
                    "headline": "Fill a muffin tin or several squeeze bottles with cornstarch.",
                    "description": "Fill each well or bottle halfway with cornstarch. If you see any clumps, break them up with a fork or by shaking the bottle. A muffin tin will act like a paint palette. You will need a paintbrush to use the paint. It is great for painting pictures. A squeeze bottle will allow you to squirt the paint out onto the sidewalk. It is great if you want to create random designs."
                },
                {
                    "headline": "Add a few drops of food coloring into each well or bottle.",
                    "description": "The more food coloring you use, the brighter or darker your chalk will be. You can fill each well or bottle with the same color. You can also fill each well or bottle with a different color. To make scented liquid sidewalk chalk: mix 1 envelope of a powdered fruit drink with 1 cup (240 milliliters) of water. You will be adding this mixture to the cornstarch in the next step. Skip the food coloring, as the fruit juice will be enough to give the chalk some color."
                },
                {
                    "headline": "Fill each well or bottle the rest of the way with water.",
                    "description": "If you are making the scented version, pour your drink mixture into each well or bottle. Try to use equal parts water and cornstarch. For a thicker paint, use one part water to one-and-a-half parts cornstarch."
                },
                {
                    "headline": "Mix the cornstarch and water until you get an even consistency.",
                    "description": "If you are making the liquid sidewalk chalk in a muffin tin, use a fork. If you are making the liquid sidewalk chalk in a squeeze bottle, close the bottle tightly and shake it. Make sure that there are no clumps. The color should be even once you are done mixing."
                },
                {
                    "headline": "Adjust the mixture, if necessary.",
                    "description": "A thicker paint will be easier to paint with, but a thinner paint will be easier to squirt out of a squeeze bottle. If the paint is too thin, add more cornstarch. If the paint is too thick, add more water. Be sure to mix your paint well once you add the extra cornstarch or water."
                },
                {
                    "headline": "Use the paint.",
                    "description": "Dip a paintbrush into the muffin tin wells, and paint pictures on your sidewalk. If you are using a squeeze bottle, hold it horizontally over the sidewalk and give it a quick squeeze."
                }
            ]
        },
        {
            "name": "Making Frozen Sidewalk Chalk",
            "steps": [
                {
                    "headline": "Create your color base in a cup.",
                    "description": "Combine ½ cup (120 milliliters) of water with 1 to 2 tablespoons (15 to 30 ml) of washable tempera paint. Stir the water with a spoon until the color is even. There should be no streaks. For stronger colors, use more paint. Use less for lighter or pastel colors."
                },
                {
                    "headline": "Add ½ cup (65 grams) cornstarch to the mixture.",
                    "description": "Stir well until all of the powder has dissolved. Make sure that there are no clumps or streaks. The mixture should still be a liquid at this point, but it should be much thicker than standard paint."
                },
                {
                    "headline": "Pour the mixture into ice cube trays.",
                    "description": "Gently sift the trays back and forth with your hands to bring any air bubbles to the surface. If you want to get creative, use ice cube molds or freezable candy molds with fun-shaped compartments, such as stars or fish. Alternatively, you can pour the liquid chalk into popsicle molds. Don't fill the molds all the way; the liquid will expand as it freezes. Insert the tops of the molds into the liquid chalk, snapping them in place."
                },
                {
                    "headline": "Freeze the chalk.",
                    "description": "Carefully place the ice cube trays in your freezer. Make sure that they are sitting flat, or the tops will freeze crooked. Leave the trays in the freezer undisturbed until the chalk freezes. This will take several hours."
                },
                {
                    "headline": "Remove the chalk from the ice cube trays as you would remove ice cubes.",
                    "description": "Pour them into a bowl. If you made several different colors, you might want to separate the cubes by color. If you used popsicle molds, simply pull the popsicles out."
                },
                {
                    "headline": "Play with the ice chalk.",
                    "description": "You can draw with the ice chalk as you would with normal chalk. You can also leave the chalk on the sidewalk and let it melt into colorful puddles. Note that ice chalk will melt as you play with it, so it can get pretty messy. The colors may seem dull or translucent at first. Once the water dries, however, the colors become more vibrant."
                }
            ]
        },
        {
            "name": "Making Popping Sidewalk Chalk",
            "steps": [
                {
                    "headline": "Combine 1 cup (125 grams) of cornstarch and 1 cup (240 milliliters) of white distilled vinegar in a bowl.",
                    "description": "Mix the two together until there are no streaks."
                },
                {
                    "headline": "Pour the mixture into four, plastic resealable bags.",
                    "description": "Try to fill each bag about one third of the way with the mixture."
                },
                {
                    "headline": "Add 8 to 10 drops of food coloring into each bag.",
                    "description": "Use a different color for each bag. The more drops you add, the brighter your color will be. You can also use liquid watercolor paints. This will make the chalk easier to clean up in the end."
                },
                {
                    "headline": "Zip the bag closed and mix the coloring into the cornstarch vinegar.",
                    "description": "You can do this by jiggling the bag or by massaging it. You should be left with a very thick liquid. There should be no clumps or streaks of color. When closing the bag, try to leave as little air as possible inside it."
                },
                {
                    "headline": "Consider making some baking soda \"bombs.\"",
                    "description": "Some people like to add the baking soda directly into the plastic bags, while others find that making little bombs first is easier. To make a baking soda bomb, do the following:\nCut a paper towel into fourths; you'll end up with four, smaller squares. Drop 1 to 2 tablespoons (15 to 30 ml) of baking soda in the center of each square. Fold the paper towel around it to create a little bundle. Don't wrap the towel so tightly that the bundle can't easily open on its own."
                },
                {
                    "headline": "Add the baking soda into each bag and close it quickly.",
                    "description": "Open each bag wide enough to slip the baking soda inside. Seal it quickly. Once again, make sure that there is as little air left in the bag. If you made baking soda bombs, simply drop one bomb into each bag. If you did not make a baking soda bomb, simply add 1 tablespoon of baking soda into each bag. The bag must be completely sealed. If there are any holes or leaks, the air will escape through the gap rather than building up inside the bag."
                },
                {
                    "headline": "Shake each bag vigorously and set it down on the sidewalk.",
                    "description": "Step back quickly or you will get sprayed by the exploding chalk. The baking soda will react with the vinegar, causing the bag to expand. Eventually, the bag will pop or burst open, spraying the liquid chalk across the sidewalk."
                }
            ]
        }
    ],
    "tyn": [
        "Cylindrical Molds for Sidewalk Chalk",
        "[6]",
        "X",
        "Research source",
        "Cardboard tubes",
        "Scissors",
        "Duct tape",
        "Wax paper",
        "Sidewalk Chalk",
        "[7]",
        "Warm water",
        "Plaster of Paris",
        "Tempera paint",
        "Measuring cup",
        "Plastic spoon",
        "Ice cube trays or toilet paper rolls and baking sheet",
        "Liquid Sidewalk Chalk",
        "[8]",
        "Water",
        "Cornstarch",
        "Food coloring or powdered fruit juice",
        "Squeeze bottle or muffin tins",
        "Plastic spoon or spatula",
        "Frozen Sidewalk Chalk",
        "[9]",
        "Ice cube trays or popsicle molds",
        "Popping Sidewalk Chalk",
        "Resealable plastic bags",
        "White vinegar",
        "Baking soda",
        "Food coloring or liquid watercolor paints",
        "Paper towels"
    ],
    "text": " Making Cylindrical Molds for Sidewalk Chalk Gather three to six toilet paper rolls. You can also use paper towel tubes, but you will need to cut them in half. Cover one end of each tube with duct tape. Use enough tape so that there are no holes. If there are any holes, the chalk mixture will leak. Line the tubes with wax paper. Cut the wax paper into 6 inch by 6 inch (15.25 centimeters by 15.25 centimeters) squares. Roll the wax paper into a tube and slip it inside each toilet paper roll. Gently spread the wax paper out until it is the same size as the toilet paper roll. The top of the wax paper should stick out of the top of the tube. The wax paper will protect the cardboard from the chalk mixture. Making Sidewalk Chalk Combine ¼ cup (60 milliliters) of warm water with ½ cup (50 grams) of Plaster of Paris in a small bowl or a large cup. Mix the two together with a plastic spoon until you get a thick, soupy mixture. There should be no clumps. Plaster of Paris will begin to harden within 20 to 30 minutes, so you will need to work quickly. Mix in 2 to 3 tablespoons (30 to 45 ml) of tempera paint. The more paint you use, the brighter your color will be. The less paint you use, the lighter your color will be. Be sure that there are no streaks or swirls in your mixture. The color should be even. If you want to make different colors, divide the Plaster of Paris mixture between two to three small cups. Stir in about 1 tablespoon of paint into each cup. For an even more creative twist, you can use glow-in-the-dark or fluorescent paint instead of standard tempera paint. Glow-in-the-dark paint will allow the chalk to glow at night. Fluorescent paint will allow the chalk to glow under a black light. Transfer the mixture into your mold once the mixture begins to thicken. You can use almost anything that can hold liquids without leaking as a mold. For example, you can use a normal ice cube tray, or one with fun shapes, such as stars or fish. You can also use toilet paper rolls. Click here to learn how to make toilet paper rolls into chalk molds. If you are using ice cube trays, be sure to wipe any spills and leaks with a damp paper towel before the chalk dries. If you made toilet paper tube molds: line the tubes up on a baking sheet with the tape side facing down. Carefully spoon the colored mixture into each tube. Gently flick the side of each tube with your index finger to bring any trapped air bubbles to the surface. Let the chalk dry. This can take anywhere between one to three days, depending on the size of your molds. For example, a simple ice cube tray may take as little as a day to dry, while toilet paper rolls will take up to three days. Remove the chalk from the molds and allow the chalk to finish drying. Once you pop the chalk out of the molds, you may notice that the underside is still damp. If this happens, simply spread the chalk out on a dry, flat surface with the damp part facing upwards. It should be dry within an hour. If you used toilet paper tubes: peel off the duct tape and flip over each tube so that the bottoms can dry. After the chalk has finished drying, peel off the cardboard and wax paper. Making Liquid Sidewalk Chalk Fill a muffin tin or several squeeze bottles with cornstarch. Fill each well or bottle halfway with cornstarch. If you see any clumps, break them up with a fork or by shaking the bottle. A muffin tin will act like a paint palette. You will need a paintbrush to use the paint. It is great for painting pictures. A squeeze bottle will allow you to squirt the paint out onto the sidewalk. It is great if you want to create random designs. Add a few drops of food coloring into each well or bottle. The more food coloring you use, the brighter or darker your chalk will be. You can fill each well or bottle with the same color. You can also fill each well or bottle with a different color. To make scented liquid sidewalk chalk: mix 1 envelope of a powdered fruit drink with 1 cup (240 milliliters) of water. You will be adding this mixture to the cornstarch in the next step. Skip the food coloring, as the fruit juice will be enough to give the chalk some color. Fill each well or bottle the rest of the way with water. If you are making the scented version, pour your drink mixture into each well or bottle. Try to use equal parts water and cornstarch. For a thicker paint, use one part water to one-and-a-half parts cornstarch. Mix the cornstarch and water until you get an even consistency. If you are making the liquid sidewalk chalk in a muffin tin, use a fork. If you are making the liquid sidewalk chalk in a squeeze bottle, close the bottle tightly and shake it. Make sure that there are no clumps. The color should be even once you are done mixing. Adjust the mixture, if necessary. A thicker paint will be easier to paint with, but a thinner paint will be easier to squirt out of a squeeze bottle. If the paint is too thin, add more cornstarch. If the paint is too thick, add more water. Be sure to mix your paint well once you add the extra cornstarch or water. Use the paint. Dip a paintbrush into the muffin tin wells, and paint pictures on your sidewalk. If you are using a squeeze bottle, hold it horizontally over the sidewalk and give it a quick squeeze. Making Frozen Sidewalk Chalk Create your color base in a cup. Combine ½ cup (120 milliliters) of water with 1 to 2 tablespoons (15 to 30 ml) of washable tempera paint. Stir the water with a spoon until the color is even. There should be no streaks. For stronger colors, use more paint. Use less for lighter or pastel colors. Add ½ cup (65 grams) cornstarch to the mixture. Stir well until all of the powder has dissolved. Make sure that there are no clumps or streaks. The mixture should still be a liquid at this point, but it should be much thicker than standard paint. Pour the mixture into ice cube trays. Gently sift the trays back and forth with your hands to bring any air bubbles to the surface. If you want to get creative, use ice cube molds or freezable candy molds with fun-shaped compartments, such as stars or fish. Alternatively, you can pour the liquid chalk into popsicle molds. Don't fill the molds all the way; the liquid will expand as it freezes. Insert the tops of the molds into the liquid chalk, snapping them in place. Freeze the chalk. Carefully place the ice cube trays in your freezer. Make sure that they are sitting flat, or the tops will freeze crooked. Leave the trays in the freezer undisturbed until the chalk freezes. This will take several hours. Remove the chalk from the ice cube trays as you would remove ice cubes. Pour them into a bowl. If you made several different colors, you might want to separate the cubes by color. If you used popsicle molds, simply pull the popsicles out. Play with the ice chalk. You can draw with the ice chalk as you would with normal chalk. You can also leave the chalk on the sidewalk and let it melt into colorful puddles. Note that ice chalk will melt as you play with it, so it can get pretty messy. The colors may seem dull or translucent at first. Once the water dries, however, the colors become more vibrant. Making Popping Sidewalk Chalk Combine 1 cup (125 grams) of cornstarch and 1 cup (240 milliliters) of white distilled vinegar in a bowl. Mix the two together until there are no streaks. Pour the mixture into four, plastic resealable bags. Try to fill each bag about one third of the way with the mixture. Add 8 to 10 drops of food coloring into each bag. Use a different color for each bag. The more drops you add, the brighter your color will be. You can also use liquid watercolor paints. This will make the chalk easier to clean up in the end. Zip the bag closed and mix the coloring into the cornstarch vinegar. You can do this by jiggling the bag or by massaging it. You should be left with a very thick liquid. There should be no clumps or streaks of color. When closing the bag, try to leave as little air as possible inside it. Consider making some baking soda \"bombs.\" Some people like to add the baking soda directly into the plastic bags, while others find that making little bombs first is easier. To make a baking soda bomb, do the following:\nCut a paper towel into fourths; you'll end up with four, smaller squares. Drop 1 to 2 tablespoons (15 to 30 ml) of baking soda in the center of each square. Fold the paper towel around it to create a little bundle. Don't wrap the towel so tightly that the bundle can't easily open on its own. Add the baking soda into each bag and close it quickly. Open each bag wide enough to slip the baking soda inside. Seal it quickly. Once again, make sure that there is as little air left in the bag. If you made baking soda bombs, simply drop one bomb into each bag. If you did not make a baking soda bomb, simply add 1 tablespoon of baking soda into each bag. The bag must be completely sealed. If there are any holes or leaks, the air will escape through the gap rather than building up inside the bag. Shake each bag vigorously and set it down on the sidewalk. Step back quickly or you will get sprayed by the exploding chalk. The baking soda will react with the vinegar, causing the bag to expand. Eventually, the bag will pop or burst open, spraying the liquid chalk across the sidewalk.",
    "sentences": [
        " Making Cylindrical Molds for Sidewalk Chalk Gather three to six toilet paper rolls.",
        "You can also use paper towel tubes, but you will need to cut them in half.",
        "Cover one end of each tube with duct tape.",
        "Use enough tape so that there are no holes.",
        "If there are any holes, the chalk mixture will leak.",
        "Line the tubes with wax paper.",
        "Cut the wax paper into 6 inch by 6 inch (15.25 centimeters by 15.25 centimeters) squares.",
        "Roll the wax paper into a tube and slip it inside each toilet paper roll.",
        "Gently spread the wax paper out until it is the same size as the toilet paper roll.",
        "The top of the wax paper should stick out of the top of the tube.",
        "The wax paper will protect the cardboard from the chalk mixture.",
        "Making Sidewalk Chalk Combine ¼ cup (60 milliliters) of warm water with ½ cup (50 grams) of Plaster of Paris in a small bowl or a large cup.",
        "Mix the two together with a plastic spoon until you get a thick, soupy mixture.",
        "There should be no clumps.",
        "Plaster of Paris will begin to harden within 20 to 30 minutes, so you will need to work quickly.",
        "Mix in 2 to 3 tablespoons (30 to 45 ml) of tempera paint.",
        "The more paint you use, the brighter your color will be.",
        "The less paint you use, the lighter your color will be.",
        "Be sure that there are no streaks or swirls in your mixture.",
        "The color should be even.",
        "If you want to make different colors, divide the Plaster of Paris mixture between two to three small cups.",
        "Stir in about 1 tablespoon of paint into each cup.",
        "For an even more creative twist, you can use glow-in-the-dark or fluorescent paint instead of standard tempera paint.",
        "Glow-in-the-dark paint will allow the chalk to glow at night.",
        "Fluorescent paint will allow the chalk to glow under a black light.",
        "Transfer the mixture into your mold once the mixture begins to thicken.",
        "You can use almost anything that can hold liquids without leaking as a mold.",
        "For example, you can use a normal ice cube tray, or one with fun shapes, such as stars or fish.",
        "You can also use toilet paper rolls.",
        "Click here to learn how to make toilet paper rolls into chalk molds.",
        "If you are using ice cube trays, be sure to wipe any spills and leaks with a damp paper towel before the chalk dries.",
        "If you made toilet paper tube molds: line the tubes up on a baking sheet with the tape side facing down.",
        "Carefully spoon the colored mixture into each tube.",
        "Gently flick the side of each tube with your index finger to bring any trapped air bubbles to the surface.",
        "Let the chalk dry.",
        "This can take anywhere between one to three days, depending on the size of your molds.",
        "For example, a simple ice cube tray may take as little as a day to dry, while toilet paper rolls will take up to three days.",
        "Remove the chalk from the molds and allow the chalk to finish drying.",
        "Once you pop the chalk out of the molds, you may notice that the underside is still damp.",
        "If this happens, simply spread the chalk out on a dry, flat surface with the damp part facing upwards.",
        "It should be dry within an hour.",
        "If you used toilet paper tubes: peel off the duct tape and flip over each tube so that the bottoms can dry.",
        "After the chalk has finished drying, peel off the cardboard and wax paper.",
        "Making Liquid Sidewalk Chalk Fill a muffin tin or several squeeze bottles with cornstarch.",
        "Fill each well or bottle halfway with cornstarch.",
        "If you see any clumps, break them up with a fork or by shaking the bottle.",
        "A muffin tin will act like a paint palette.",
        "You will need a paintbrush to use the paint.",
        "It is great for painting pictures.",
        "A squeeze bottle will allow you to squirt the paint out onto the sidewalk.",
        "It is great if you want to create random designs.",
        "Add a few drops of food coloring into each well or bottle.",
        "The more food coloring you use, the brighter or darker your chalk will be.",
        "You can fill each well or bottle with the same color.",
        "You can also fill each well or bottle with a different color.",
        "To make scented liquid sidewalk chalk: mix 1 envelope of a powdered fruit drink with 1 cup (240 milliliters) of water.",
        "You will be adding this mixture to the cornstarch in the next step.",
        "Skip the food coloring, as the fruit juice will be enough to give the chalk some color.",
        "Fill each well or bottle the rest of the way with water.",
        "If you are making the scented version, pour your drink mixture into each well or bottle.",
        "Try to use equal parts water and cornstarch.",
        "For a thicker paint, use one part water to one-and-a-half parts cornstarch.",
        "Mix the cornstarch and water until you get an even consistency.",
        "If you are making the liquid sidewalk chalk in a muffin tin, use a fork.",
        "If you are making the liquid sidewalk chalk in a squeeze bottle, close the bottle tightly and shake it.",
        "Make sure that there are no clumps.",
        "The color should be even once you are done mixing.",
        "Adjust the mixture, if necessary.",
        "A thicker paint will be easier to paint with, but a thinner paint will be easier to squirt out of a squeeze bottle.",
        "If the paint is too thin, add more cornstarch.",
        "If the paint is too thick, add more water.",
        "Be sure to mix your paint well once you add the extra cornstarch or water.",
        "Use the paint.",
        "Dip a paintbrush into the muffin tin wells, and paint pictures on your sidewalk.",
        "If you are using a squeeze bottle, hold it horizontally over the sidewalk and give it a quick squeeze.",
        "Making Frozen Sidewalk Chalk Create your color base in a cup.",
        "Combine ½ cup (120 milliliters) of water with 1 to 2 tablespoons (15 to 30 ml) of washable tempera paint.",
        "Stir the water with a spoon until the color is even.",
        "There should be no streaks.",
        "For stronger colors, use more paint.",
        "Use less for lighter or pastel colors.",
        "Add ½ cup (65 grams) cornstarch to the mixture.",
        "Stir well until all of the powder has dissolved.",
        "Make sure that there are no clumps or streaks.",
        "The mixture should still be a liquid at this point, but it should be much thicker than standard paint.",
        "Pour the mixture into ice cube trays.",
        "Gently sift the trays back and forth with your hands to bring any air bubbles to the surface.",
        "If you want to get creative, use ice cube molds or freezable candy molds with fun-shaped compartments, such as stars or fish.",
        "Alternatively, you can pour the liquid chalk into popsicle molds.",
        "Don't fill the molds all the way; the liquid will expand as it freezes.",
        "Insert the tops of the molds into the liquid chalk, snapping them in place.",
        "Freeze the chalk.",
        "Carefully place the ice cube trays in your freezer.",
        "Make sure that they are sitting flat, or the tops will freeze crooked.",
        "Leave the trays in the freezer undisturbed until the chalk freezes.",
        "This will take several hours.",
        "Remove the chalk from the ice cube trays as you would remove ice cubes.",
        "Pour them into a bowl.",
        "If you made several different colors, you might want to separate the cubes by color.",
        "If you used popsicle molds, simply pull the popsicles out.",
        "Play with the ice chalk.",
        "You can draw with the ice chalk as you would with normal chalk.",
        "You can also leave the chalk on the sidewalk and let it melt into colorful puddles.",
        "Note that ice chalk will melt as you play with it, so it can get pretty messy.",
        "The colors may seem dull or translucent at first.",
        "Once the water dries, however, the colors become more vibrant.",
        "Making Popping Sidewalk Chalk Combine 1 cup (125 grams) of cornstarch and 1 cup (240 milliliters) of white distilled vinegar in a bowl.",
        "Mix the two together until there are no streaks.",
        "Pour the mixture into four, plastic resealable bags.",
        "Try to fill each bag about one third of the way with the mixture.",
        "Add 8 to 10 drops of food coloring into each bag.",
        "Use a different color for each bag.",
        "The more drops you add, the brighter your color will be.",
        "You can also use liquid watercolor paints.",
        "This will make the chalk easier to clean up in the end.",
        "Zip the bag closed and mix the coloring into the cornstarch vinegar.",
        "You can do this by jiggling the bag or by massaging it.",
        "You should be left with a very thick liquid.",
        "There should be no clumps or streaks of color.",
        "When closing the bag, try to leave as little air as possible inside it.",
        "Consider making some baking soda \"bombs.\"",
        "Some people like to add the baking soda directly into the plastic bags, while others find that making little bombs first is easier.",
        "To make a baking soda bomb, do the following:\nCut a paper towel into fourths; you'll end up with four, smaller squares.",
        "Drop 1 to 2 tablespoons (15 to 30 ml) of baking soda in the center of each square.",
        "Fold the paper towel around it to create a little bundle.",
        "Don't wrap the towel so tightly that the bundle can't easily open on its own.",
        "Add the baking soda into each bag and close it quickly.",
        "Open each bag wide enough to slip the baking soda inside.",
        "Seal it quickly.",
        "Once again, make sure that there is as little air left in the bag.",
        "If you made baking soda bombs, simply drop one bomb into each bag.",
        "If you did not make a baking soda bomb, simply add 1 tablespoon of baking soda into each bag.",
        "The bag must be completely sealed.",
        "If there are any holes or leaks, the air will escape through the gap rather than building up inside the bag.",
        "Shake each bag vigorously and set it down on the sidewalk.",
        "Step back quickly or you will get sprayed by the exploding chalk.",
        "The baking soda will react with the vinegar, causing the bag to expand.",
        "Eventually, the bag will pop or burst open, spraying the liquid chalk across the sidewalk."
    ]
}