{
    "title": "How to Use a Diaper Genie",
    "url": "https://www.wikihow.com/Use-a-Diaper-Genie",
    "category_hierarchy": [
        "Family Life",
        "Parenting",
        "Development Stages",
        "Babies and Infants",
        "Diaper Changing"
    ],
    "parts": [
        {
            "name": "Assembling a Diaper Genie®",
            "steps": [
                {
                    "headline": "Take inventory of the pieces that came with your Diaper Genie®.",
                    "description": "Read over the instruction manual that came with your Diaper Genie® to make sure you understand all the parts in the package and how each one functions. Before you start the assembly process, make sure you have all the parts listed in the instruction manual. If you are missing anything, wait to assemble the unit until you get the missing pieces. If you find you are missing any pieces, call the customer support line listed in the manual and request replacement parts be sent to you."
                },
                {
                    "headline": "Attach the top and bottom at the hinge.",
                    "description": "The first step in assembling your Diaper Genie® is to attach the top (piece A) and bottom (piece B) of the genie together. There is a hinge on the bottom of piece A and a bar at the top of piece B. While holding the top at a 45 degree angle, place the bar from piece B into the hinge and press down until they click together. You don't need to force the hinge into place. Just push it until you hear a click."
                },
                {
                    "headline": "Flip the top over and click it into place.",
                    "description": "After securing the hinge between the top and bottom of your Diaper Genie®, flip the top over the bottom of the genie and press down until they click together. At this point, your genie should look like a tall, slim cylinder."
                },
                {
                    "headline": "Prepare a liner refill for your Diaper Genie®.",
                    "description": "You will need to place the plastic liner in your genie in order to use it. To add a new refill, pull the tab on the refill to remove the plastic seal. Then, pull downwards until you’ve released about 18 inches of film (or enough to fill the bottom of the Diaper Genie®). Tie a knot in the bottom of the liner. An overhand knot works best for securing the bottom of your liner."
                },
                {
                    "headline": "Place the liner in the genie.",
                    "description": "Finally, place your liner refill in the top of your Diaper Genie® and push the knot you’ve tied down, through the clamp. Close the lid on your Diaper Genie®. You’re now ready to start using it."
                }
            ]
        },
        {
            "name": "Disposing of Diapers",
            "steps": [
                {
                    "headline": "Roll diapers into a tight ball.",
                    "description": "After you’ve changed your baby, roll their diaper up tightly, securing it with the adhesive tape on the diaper. It is best to roll your diaper into an oblong shape or a small, round bundle. The tighter you can wrap your dirty diapers, the more the Diaper Genie® will hold before needing to empty it. Do not leave the adhesive tape unsecured because this can attach to the liner in your genie, causing it to rip. Generally, the Diaper Genie® will hold approximately 34 newborn diapers at one time. This number will decrease as your child ages."
                },
                {
                    "headline": "Insert the dirty diaper.",
                    "description": "Once you have rolled your dirty diaper, lift the lid of the Diaper Genie® and insert the diaper. Push the dirty diaper all the way down through the clamp. Ensure that the clamp closes again after you have inserted the diaper. Once you have done this, close the lid. Once the clamp closes, the Diaper Genie® twists the film directly under the clamp, sealing the dirty diaper at the top."
                },
                {
                    "headline": "Remove the top of the pail.",
                    "description": "Once your Diaper Genie® is full, unhinge the top from the bottom by pushing the button located in the middle of the genie (where the top and bottom parts meet). Flip the top part over, revealing the built-in cutter mechanism on the inside."
                },
                {
                    "headline": "Cut the liner at the top.",
                    "description": "After you have unhinged the top and revealed the childproof cutter on the genie, pull the liner into the cutter mechanism and press down until it severs the liner. Tie a knot at the top to enclose your diapers in the liner. Ensure you leave enough room at the top of your diaper roll to tie a knot—usually three or four inches."
                },
                {
                    "headline": "Remove the full liner.",
                    "description": "Once you have tied the top of your liner, lift the full bag out and dispose of the dirty diapers wherever you dispose of your garbage outside."
                }
            ]
        },
        {
            "name": "Refilling and Maintaining the Diaper Genie®",
            "steps": [
                {
                    "headline": "Tie a knot in the liner.",
                    "description": "Once you have removed the full liner, be sure to tie a knot at the start of the new liner. If you fail to do so, the dirty diapers you place in the genie will fall out the bottom of the liner when you go to remove the next full load."
                },
                {
                    "headline": "Pull out about 18 inches of liner.",
                    "description": "After tying a knot at the end of the liner you have just cut, pull out about 18 inches of liner, like you did when you were preparing to use your Diaper Genie® for the first time. Ensure that the amount you pull out is enough to fill the bottom of the pail."
                },
                {
                    "headline": "Secure the top back onto the bottom.",
                    "description": "Finally, flip the top of the Diaper Genie® back over so it is sitting atop the bottom of the genie. Press down until the two parts click back into place."
                },
                {
                    "headline": "Clean your Diaper Genie® weekly.",
                    "description": "As you can imagine, you will need to clean your Diaper Genie® routinely to keep germs and any lingering smell from your child’s dirty diapers to a minimum. The best way to do this is to clean your genie at least once a week. To do so, take the Diaper Genie® apart and wipe down both the inside and outside with a bleach-based solution. If you’d like to be more thorough, wipe the genie down with an anti-bacterial cleaning wipe several times throughout the week. Furthermore, whenever you change the liner in your Diaper Genie®, spray the inside with a disinfecting and odor-neutralizing spray."
                },
                {
                    "headline": "Invest in a deodorizing filter.",
                    "description": "The Diaper Genie® doesn’t come with a built-in deodorizer, but investing in one is a good way to help reduce the daily odor from your child’s dirty diapers. You can find deodorizing carbon filters for your Diaper Genie® at nearly all general merchandise retailers, like Walmart or Target. These filters come with a case that attaches to the lid of your Diaper Genie® and several individual carbon filters. To use, simply unlatch the top of the case, place a filter inside, and snap the case closed. Filters should be replaced at least every 90 days for the best results."
                }
            ]
        }
    ],
    "tyn": [
        "Diaper Genie® diaper pail",
        "Diaper Genie® liners",
        "dirty/used disposable diaper(s)"
    ],
    "text": " Assembling a Diaper Genie® Take inventory of the pieces that came with your Diaper Genie®. Read over the instruction manual that came with your Diaper Genie® to make sure you understand all the parts in the package and how each one functions. Before you start the assembly process, make sure you have all the parts listed in the instruction manual. If you are missing anything, wait to assemble the unit until you get the missing pieces. If you find you are missing any pieces, call the customer support line listed in the manual and request replacement parts be sent to you. Attach the top and bottom at the hinge. The first step in assembling your Diaper Genie® is to attach the top (piece A) and bottom (piece B) of the genie together. There is a hinge on the bottom of piece A and a bar at the top of piece B. While holding the top at a 45 degree angle, place the bar from piece B into the hinge and press down until they click together. You don't need to force the hinge into place. Just push it until you hear a click. Flip the top over and click it into place. After securing the hinge between the top and bottom of your Diaper Genie®, flip the top over the bottom of the genie and press down until they click together. At this point, your genie should look like a tall, slim cylinder. Prepare a liner refill for your Diaper Genie®. You will need to place the plastic liner in your genie in order to use it. To add a new refill, pull the tab on the refill to remove the plastic seal. Then, pull downwards until you’ve released about 18 inches of film (or enough to fill the bottom of the Diaper Genie®). Tie a knot in the bottom of the liner. An overhand knot works best for securing the bottom of your liner. Place the liner in the genie. Finally, place your liner refill in the top of your Diaper Genie® and push the knot you’ve tied down, through the clamp. Close the lid on your Diaper Genie®. You’re now ready to start using it. Disposing of Diapers Roll diapers into a tight ball. After you’ve changed your baby, roll their diaper up tightly, securing it with the adhesive tape on the diaper. It is best to roll your diaper into an oblong shape or a small, round bundle. The tighter you can wrap your dirty diapers, the more the Diaper Genie® will hold before needing to empty it. Do not leave the adhesive tape unsecured because this can attach to the liner in your genie, causing it to rip. Generally, the Diaper Genie® will hold approximately 34 newborn diapers at one time. This number will decrease as your child ages. Insert the dirty diaper. Once you have rolled your dirty diaper, lift the lid of the Diaper Genie® and insert the diaper. Push the dirty diaper all the way down through the clamp. Ensure that the clamp closes again after you have inserted the diaper. Once you have done this, close the lid. Once the clamp closes, the Diaper Genie® twists the film directly under the clamp, sealing the dirty diaper at the top. Remove the top of the pail. Once your Diaper Genie® is full, unhinge the top from the bottom by pushing the button located in the middle of the genie (where the top and bottom parts meet). Flip the top part over, revealing the built-in cutter mechanism on the inside. Cut the liner at the top. After you have unhinged the top and revealed the childproof cutter on the genie, pull the liner into the cutter mechanism and press down until it severs the liner. Tie a knot at the top to enclose your diapers in the liner. Ensure you leave enough room at the top of your diaper roll to tie a knot—usually three or four inches. Remove the full liner. Once you have tied the top of your liner, lift the full bag out and dispose of the dirty diapers wherever you dispose of your garbage outside. Refilling and Maintaining the Diaper Genie® Tie a knot in the liner. Once you have removed the full liner, be sure to tie a knot at the start of the new liner. If you fail to do so, the dirty diapers you place in the genie will fall out the bottom of the liner when you go to remove the next full load. Pull out about 18 inches of liner. After tying a knot at the end of the liner you have just cut, pull out about 18 inches of liner, like you did when you were preparing to use your Diaper Genie® for the first time. Ensure that the amount you pull out is enough to fill the bottom of the pail. Secure the top back onto the bottom. Finally, flip the top of the Diaper Genie® back over so it is sitting atop the bottom of the genie. Press down until the two parts click back into place. Clean your Diaper Genie® weekly. As you can imagine, you will need to clean your Diaper Genie® routinely to keep germs and any lingering smell from your child’s dirty diapers to a minimum. The best way to do this is to clean your genie at least once a week. To do so, take the Diaper Genie® apart and wipe down both the inside and outside with a bleach-based solution. If you’d like to be more thorough, wipe the genie down with an anti-bacterial cleaning wipe several times throughout the week. Furthermore, whenever you change the liner in your Diaper Genie®, spray the inside with a disinfecting and odor-neutralizing spray. Invest in a deodorizing filter. The Diaper Genie® doesn’t come with a built-in deodorizer, but investing in one is a good way to help reduce the daily odor from your child’s dirty diapers. You can find deodorizing carbon filters for your Diaper Genie® at nearly all general merchandise retailers, like Walmart or Target. These filters come with a case that attaches to the lid of your Diaper Genie® and several individual carbon filters. To use, simply unlatch the top of the case, place a filter inside, and snap the case closed. Filters should be replaced at least every 90 days for the best results.",
    "sentences": [
        " Assembling a Diaper Genie® Take inventory of the pieces that came with your Diaper Genie®.",
        "Read over the instruction manual that came with your Diaper Genie® to make sure you understand all the parts in the package and how each one functions.",
        "Before you start the assembly process, make sure you have all the parts listed in the instruction manual.",
        "If you are missing anything, wait to assemble the unit until you get the missing pieces.",
        "If you find you are missing any pieces, call the customer support line listed in the manual and request replacement parts be sent to you.",
        "Attach the top and bottom at the hinge.",
        "The first step in assembling your Diaper Genie® is to attach the top (piece A) and bottom (piece B) of the genie together.",
        "There is a hinge on the bottom of piece A and a bar at the top of piece B.",
        "While holding the top at a 45 degree angle, place the bar from piece B into the hinge and press down until they click together.",
        "You don't need to force the hinge into place.",
        "Just push it until you hear a click.",
        "Flip the top over and click it into place.",
        "After securing the hinge between the top and bottom of your Diaper Genie®, flip the top over the bottom of the genie and press down until they click together.",
        "At this point, your genie should look like a tall, slim cylinder.",
        "Prepare a liner refill for your Diaper Genie®.",
        "You will need to place the plastic liner in your genie in order to use it.",
        "To add a new refill, pull the tab on the refill to remove the plastic seal.",
        "Then, pull downwards until you’ve released about 18 inches of film (or enough to fill the bottom of the Diaper Genie®).",
        "Tie a knot in the bottom of the liner.",
        "An overhand knot works best for securing the bottom of your liner.",
        "Place the liner in the genie.",
        "Finally, place your liner refill in the top of your Diaper Genie® and push the knot you’ve tied down, through the clamp.",
        "Close the lid on your Diaper Genie®.",
        "You’re now ready to start using it.",
        "Disposing of Diapers Roll diapers into a tight ball.",
        "After you’ve changed your baby, roll their diaper up tightly, securing it with the adhesive tape on the diaper.",
        "It is best to roll your diaper into an oblong shape or a small, round bundle.",
        "The tighter you can wrap your dirty diapers, the more the Diaper Genie® will hold before needing to empty it.",
        "Do not leave the adhesive tape unsecured because this can attach to the liner in your genie, causing it to rip.",
        "Generally, the Diaper Genie® will hold approximately 34 newborn diapers at one time.",
        "This number will decrease as your child ages.",
        "Insert the dirty diaper.",
        "Once you have rolled your dirty diaper, lift the lid of the Diaper Genie® and insert the diaper.",
        "Push the dirty diaper all the way down through the clamp.",
        "Ensure that the clamp closes again after you have inserted the diaper.",
        "Once you have done this, close the lid.",
        "Once the clamp closes, the Diaper Genie® twists the film directly under the clamp, sealing the dirty diaper at the top.",
        "Remove the top of the pail.",
        "Once your Diaper Genie® is full, unhinge the top from the bottom by pushing the button located in the middle of the genie (where the top and bottom parts meet).",
        "Flip the top part over, revealing the built-in cutter mechanism on the inside.",
        "Cut the liner at the top.",
        "After you have unhinged the top and revealed the childproof cutter on the genie, pull the liner into the cutter mechanism and press down until it severs the liner.",
        "Tie a knot at the top to enclose your diapers in the liner.",
        "Ensure you leave enough room at the top of your diaper roll to tie a knot—usually three or four inches.",
        "Remove the full liner.",
        "Once you have tied the top of your liner, lift the full bag out and dispose of the dirty diapers wherever you dispose of your garbage outside.",
        "Refilling and Maintaining the Diaper Genie® Tie a knot in the liner.",
        "Once you have removed the full liner, be sure to tie a knot at the start of the new liner.",
        "If you fail to do so, the dirty diapers you place in the genie will fall out the bottom of the liner when you go to remove the next full load.",
        "Pull out about 18 inches of liner.",
        "After tying a knot at the end of the liner you have just cut, pull out about 18 inches of liner, like you did when you were preparing to use your Diaper Genie® for the first time.",
        "Ensure that the amount you pull out is enough to fill the bottom of the pail.",
        "Secure the top back onto the bottom.",
        "Finally, flip the top of the Diaper Genie® back over so it is sitting atop the bottom of the genie.",
        "Press down until the two parts click back into place.",
        "Clean your Diaper Genie® weekly.",
        "As you can imagine, you will need to clean your Diaper Genie® routinely to keep germs and any lingering smell from your child’s dirty diapers to a minimum.",
        "The best way to do this is to clean your genie at least once a week.",
        "To do so, take the Diaper Genie® apart and wipe down both the inside and outside with a bleach-based solution.",
        "If you’d like to be more thorough, wipe the genie down with an anti-bacterial cleaning wipe several times throughout the week.",
        "Furthermore, whenever you change the liner in your Diaper Genie®, spray the inside with a disinfecting and odor-neutralizing spray.",
        "Invest in a deodorizing filter.",
        "The Diaper Genie® doesn’t come with a built-in deodorizer, but investing in one is a good way to help reduce the daily odor from your child’s dirty diapers.",
        "You can find deodorizing carbon filters for your Diaper Genie® at nearly all general merchandise retailers, like Walmart or Target.",
        "These filters come with a case that attaches to the lid of your Diaper Genie® and several individual carbon filters.",
        "To use, simply unlatch the top of the case, place a filter inside, and snap the case closed.",
        "Filters should be replaced at least every 90 days for the best results."
    ]
}