{
    "title": "How to Make Fabric Flower Headbands",
    "url": "https://www.wikihow.com/Make-Fabric-Flower-Headbands",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "methods": [
        {
            "name": "Making No-Sew Fabric Flowers",
            "steps": [
                {
                    "headline": "Cut out 25 1.5 in (3.8 cm) squares of fabric.",
                    "description": "Pick a fabric that you want to use to create the flower for your headband. Use a ruler to measure out the squares in the fabric. Then, use fabric scissors to cut out each square. Choose a fabric with either a solid color or a pattern depending on the type of headband that you want to make. Use soft, lightweight fabric if possible to avoid making the flower feel too heavy."
                },
                {
                    "headline": "Round the edges of the squares to create circles that are 1.5 in (3.8 cm) in diameter.",
                    "description": "Stack the squares in groups of 5. For each stack of squares, use fabric scissors to cut off the corners and to make the edges rounded. Don’t worry if the circles aren’t perfect, as you won’t notice once the fabric is scrunched up to make the flower."
                },
                {
                    "headline": "Cut out 2 felt circles that are 2 in (5.1 cm) each in diameter.",
                    "description": "Choose a color for the felt that matches the elastic of your headband. These felt circles are the base for the fabric flower. Make the felt circles smaller or larger depending on the size that you want the fabric flower to be. If you use larger felt circles, you will need to cut out more fabric circles."
                },
                {
                    "headline": "Scrunch a fabric circle from the center.",
                    "description": "Pick up a fabric circle from the middle. Hold the center of the fabric circle tightly so that it stays scrunched and the outer edges form loose folds."
                },
                {
                    "headline": "Glue together the scrunched center of the fabric circle.",
                    "description": "Move your fingers slightly up the fabric circle so that the end is exposed but it is still folded together. Place a dollop of hot glue on the scrunched center. Let the hot glue seep through the layers so that the fabric stays held together without you holding it. Be careful not to touch the hot glue with your hands!"
                },
                {
                    "headline": "Attach the scrunched circle to the center of a felt circle.",
                    "description": "Press the hot glue on the fabric into the center of the felt circle. It’s okay if the fabric opens slightly, as you will be adding many more circles to the felt which will help it to look full. If the hot glue has dried before you get to attach the fabric to the felt, simply add hot glue to the center of the felt and stick the fabric to it."
                },
                {
                    "headline": "Add fabric petals around the center of the felt until the flower looks full.",
                    "description": "Use hot glue to hold each scrunched circle in a petal shape. Then use hot glue to attach each fabric petal around the center point on the felt to create a flower. Aim to have 1 petal in the center and for all the felt to be covered by petals. If the flower looks too messy, trim the edges of the petals with scissors to tidy it up."
                },
                {
                    "headline": "Make additional flowers if desired.",
                    "description": "If you want more than 1 flower on your headband, simply repeat the process as many times as you want. You can use different types of fabric or make flowers that are the same color. You could even vary the size of the flowers if you want."
                }
            ]
        },
        {
            "name": "Sewing Simple Fabric Flowers",
            "steps": [
                {
                    "headline": "Cut a piece of fabric that is 12 in × 3 in (30.5 cm × 7.6 cm).",
                    "description": "Get a piece of your preferred fabric and use a ruler to measure out the size. Cut it into a rectangle using fabric scissors. You can either use new fabric or reuse the fabric from old clothes such as a T-shirt, jeans, or corduroy pants. It just depends on the color and style that you want your fabric flower to be. Popular color choices for fabric flower headbands include pale pink, pale purple, pale blue, green, black, and white. Stripes and polka dots are popular pattern choices."
                },
                {
                    "headline": "Thread a loose stitch lengthwise down the center of the fabric.",
                    "description": "Use a needle to loosely weave a piece of thread down the middle of the fabric. Start at one of the short edges and thread directly down the center until you reach the opposite end. To thread a loose stitch, cut a piece of thread that is approximately 30 in (76 cm) long, thread it through the needle, and tie a knot at the end of the thread. Then, simply weave the needle in and out through the fabric in wide stitches, until you reach the other end."
                },
                {
                    "headline": "Bunch the fabric by pulling the thread.",
                    "description": "Once you have threaded down the center of the fabric, gently tug on the needle to pull the thread tight. Tighten the thread until all of the fabric is bunched up in tight folds."
                },
                {
                    "headline": "Fold the fabric in half crosswise and then wind it into a roll shape.",
                    "description": "Keep the needle and thread attached to the fabric. Gently fold the bunched fabric in half, taking care not to stretch it out. Then, loosely roll the fabric around itself from one end to the other to form the shape of a flower. If you cannot see the flower shape, roll the fabric more loosely. Aim for the bunched folds to look like petals."
                },
                {
                    "headline": "Place 4 stitches through the base to hold the fabric together.",
                    "description": "Once you have rolled the fabric into a flower shape that you are happy with, use the needle and thread to stitch through the bottom of the flower. Make sure that the fabric is tightly held together, as otherwise, the flower could come apart."
                },
                {
                    "headline": "Repeat the process as many times as desired.",
                    "description": "You can stick with 1 flower or make many for your headband. Use the same color or pattern fabric for a monochromatic look, or use various fabrics to create flowers that look different from one another."
                }
            ]
        },
        {
            "name": "Assembling the Headband",
            "steps": [
                {
                    "headline": "Get a plain elastic headband.",
                    "description": "Choose a headband that matches the color and style of the fabric flowers that you created. Popular color choices include white, pink, blue, and purple. You can purchase headbands from clothing and department stores. Alternatively, make your own elastic headband if you prefer. Simply measure the circumference of your head and cut a piece of elastic to size. Sew each end of the elastic together to create a headband."
                },
                {
                    "headline": "Wrap ribbon around the headband to make it more decorative.",
                    "description": "Pick your favorite ribbon and wrap it tightly around the elastic. Secure the end of the ribbon using hot glue. You can use more than 1 type of ribbon if you prefer. Get creative with alternating colors or patterns."
                },
                {
                    "headline": "Glue the elastic to the back of the fabric flowers.",
                    "description": "Place a long line of hot glue across the back of each fabric flower. Firmly press the elastic across the hot glue to attach each flower. If you made no-sew fabric flowers, glue the second felt circle on the back of the first felt circle so that the elastic attachment is covered. Make sure that each flower feels securely attached to the headband once the hot glue is dry. Use more hot glue if you need. You can use as many fabric flowers as you like. Some fabric flower headbands have only 1 flower, while other headbands have a line of smaller flowers across the top."
                },
                {
                    "headline": "Add jewels to each flower center if you want to embellish the headband.",
                    "description": "Press down the center of each flower to hold the fabric flat. Use hot glue to attach a jewel into the middle of each flower. Alternatively, try out buttons or sequins instead of jewels."
                }
            ]
        }
    ],
    "tyn": [
        "Making No-Sew Fabric Flowers",
        "Fabric",
        "Ruler",
        "Fabric scissors",
        "Felt",
        "Hot glue",
        "Sewing Simple Fabric Flowers",
        "Needle",
        "Thread",
        "Assembling the Headband",
        "Elastic headband"
    ],
    "text": " Making No-Sew Fabric Flowers Cut out 25 1.5 in (3.8 cm) squares of fabric. Pick a fabric that you want to use to create the flower for your headband. Use a ruler to measure out the squares in the fabric. Then, use fabric scissors to cut out each square. Choose a fabric with either a solid color or a pattern depending on the type of headband that you want to make. Use soft, lightweight fabric if possible to avoid making the flower feel too heavy. Round the edges of the squares to create circles that are 1.5 in (3.8 cm) in diameter. Stack the squares in groups of 5. For each stack of squares, use fabric scissors to cut off the corners and to make the edges rounded. Don’t worry if the circles aren’t perfect, as you won’t notice once the fabric is scrunched up to make the flower. Cut out 2 felt circles that are 2 in (5.1 cm) each in diameter. Choose a color for the felt that matches the elastic of your headband. These felt circles are the base for the fabric flower. Make the felt circles smaller or larger depending on the size that you want the fabric flower to be. If you use larger felt circles, you will need to cut out more fabric circles. Scrunch a fabric circle from the center. Pick up a fabric circle from the middle. Hold the center of the fabric circle tightly so that it stays scrunched and the outer edges form loose folds. Glue together the scrunched center of the fabric circle. Move your fingers slightly up the fabric circle so that the end is exposed but it is still folded together. Place a dollop of hot glue on the scrunched center. Let the hot glue seep through the layers so that the fabric stays held together without you holding it. Be careful not to touch the hot glue with your hands! Attach the scrunched circle to the center of a felt circle. Press the hot glue on the fabric into the center of the felt circle. It’s okay if the fabric opens slightly, as you will be adding many more circles to the felt which will help it to look full. If the hot glue has dried before you get to attach the fabric to the felt, simply add hot glue to the center of the felt and stick the fabric to it. Add fabric petals around the center of the felt until the flower looks full. Use hot glue to hold each scrunched circle in a petal shape. Then use hot glue to attach each fabric petal around the center point on the felt to create a flower. Aim to have 1 petal in the center and for all the felt to be covered by petals. If the flower looks too messy, trim the edges of the petals with scissors to tidy it up. Make additional flowers if desired. If you want more than 1 flower on your headband, simply repeat the process as many times as you want. You can use different types of fabric or make flowers that are the same color. You could even vary the size of the flowers if you want. Sewing Simple Fabric Flowers Cut a piece of fabric that is 12 in × 3 in (30.5 cm × 7.6 cm). Get a piece of your preferred fabric and use a ruler to measure out the size. Cut it into a rectangle using fabric scissors. You can either use new fabric or reuse the fabric from old clothes such as a T-shirt, jeans, or corduroy pants. It just depends on the color and style that you want your fabric flower to be. Popular color choices for fabric flower headbands include pale pink, pale purple, pale blue, green, black, and white. Stripes and polka dots are popular pattern choices. Thread a loose stitch lengthwise down the center of the fabric. Use a needle to loosely weave a piece of thread down the middle of the fabric. Start at one of the short edges and thread directly down the center until you reach the opposite end. To thread a loose stitch, cut a piece of thread that is approximately 30 in (76 cm) long, thread it through the needle, and tie a knot at the end of the thread. Then, simply weave the needle in and out through the fabric in wide stitches, until you reach the other end. Bunch the fabric by pulling the thread. Once you have threaded down the center of the fabric, gently tug on the needle to pull the thread tight. Tighten the thread until all of the fabric is bunched up in tight folds. Fold the fabric in half crosswise and then wind it into a roll shape. Keep the needle and thread attached to the fabric. Gently fold the bunched fabric in half, taking care not to stretch it out. Then, loosely roll the fabric around itself from one end to the other to form the shape of a flower. If you cannot see the flower shape, roll the fabric more loosely. Aim for the bunched folds to look like petals. Place 4 stitches through the base to hold the fabric together. Once you have rolled the fabric into a flower shape that you are happy with, use the needle and thread to stitch through the bottom of the flower. Make sure that the fabric is tightly held together, as otherwise, the flower could come apart. Repeat the process as many times as desired. You can stick with 1 flower or make many for your headband. Use the same color or pattern fabric for a monochromatic look, or use various fabrics to create flowers that look different from one another. Assembling the Headband Get a plain elastic headband. Choose a headband that matches the color and style of the fabric flowers that you created. Popular color choices include white, pink, blue, and purple. You can purchase headbands from clothing and department stores. Alternatively, make your own elastic headband if you prefer. Simply measure the circumference of your head and cut a piece of elastic to size. Sew each end of the elastic together to create a headband. Wrap ribbon around the headband to make it more decorative. Pick your favorite ribbon and wrap it tightly around the elastic. Secure the end of the ribbon using hot glue. You can use more than 1 type of ribbon if you prefer. Get creative with alternating colors or patterns. Glue the elastic to the back of the fabric flowers. Place a long line of hot glue across the back of each fabric flower. Firmly press the elastic across the hot glue to attach each flower. If you made no-sew fabric flowers, glue the second felt circle on the back of the first felt circle so that the elastic attachment is covered. Make sure that each flower feels securely attached to the headband once the hot glue is dry. Use more hot glue if you need. You can use as many fabric flowers as you like. Some fabric flower headbands have only 1 flower, while other headbands have a line of smaller flowers across the top. Add jewels to each flower center if you want to embellish the headband. Press down the center of each flower to hold the fabric flat. Use hot glue to attach a jewel into the middle of each flower. Alternatively, try out buttons or sequins instead of jewels.",
    "sentences": [
        " Making No-Sew Fabric Flowers Cut out 25 1.5 in (3.8 cm) squares of fabric.",
        "Pick a fabric that you want to use to create the flower for your headband.",
        "Use a ruler to measure out the squares in the fabric.",
        "Then, use fabric scissors to cut out each square.",
        "Choose a fabric with either a solid color or a pattern depending on the type of headband that you want to make.",
        "Use soft, lightweight fabric if possible to avoid making the flower feel too heavy.",
        "Round the edges of the squares to create circles that are 1.5 in (3.8 cm) in diameter.",
        "Stack the squares in groups of 5.",
        "For each stack of squares, use fabric scissors to cut off the corners and to make the edges rounded.",
        "Don’t worry if the circles aren’t perfect, as you won’t notice once the fabric is scrunched up to make the flower.",
        "Cut out 2 felt circles that are 2 in (5.1 cm) each in diameter.",
        "Choose a color for the felt that matches the elastic of your headband.",
        "These felt circles are the base for the fabric flower.",
        "Make the felt circles smaller or larger depending on the size that you want the fabric flower to be.",
        "If you use larger felt circles, you will need to cut out more fabric circles.",
        "Scrunch a fabric circle from the center.",
        "Pick up a fabric circle from the middle.",
        "Hold the center of the fabric circle tightly so that it stays scrunched and the outer edges form loose folds.",
        "Glue together the scrunched center of the fabric circle.",
        "Move your fingers slightly up the fabric circle so that the end is exposed but it is still folded together.",
        "Place a dollop of hot glue on the scrunched center.",
        "Let the hot glue seep through the layers so that the fabric stays held together without you holding it.",
        "Be careful not to touch the hot glue with your hands!",
        "Attach the scrunched circle to the center of a felt circle.",
        "Press the hot glue on the fabric into the center of the felt circle.",
        "It’s okay if the fabric opens slightly, as you will be adding many more circles to the felt which will help it to look full.",
        "If the hot glue has dried before you get to attach the fabric to the felt, simply add hot glue to the center of the felt and stick the fabric to it.",
        "Add fabric petals around the center of the felt until the flower looks full.",
        "Use hot glue to hold each scrunched circle in a petal shape.",
        "Then use hot glue to attach each fabric petal around the center point on the felt to create a flower.",
        "Aim to have 1 petal in the center and for all the felt to be covered by petals.",
        "If the flower looks too messy, trim the edges of the petals with scissors to tidy it up.",
        "Make additional flowers if desired.",
        "If you want more than 1 flower on your headband, simply repeat the process as many times as you want.",
        "You can use different types of fabric or make flowers that are the same color.",
        "You could even vary the size of the flowers if you want.",
        "Sewing Simple Fabric Flowers Cut a piece of fabric that is 12 in × 3 in (30.5 cm × 7.6 cm).",
        "Get a piece of your preferred fabric and use a ruler to measure out the size.",
        "Cut it into a rectangle using fabric scissors.",
        "You can either use new fabric or reuse the fabric from old clothes such as a T-shirt, jeans, or corduroy pants.",
        "It just depends on the color and style that you want your fabric flower to be.",
        "Popular color choices for fabric flower headbands include pale pink, pale purple, pale blue, green, black, and white.",
        "Stripes and polka dots are popular pattern choices.",
        "Thread a loose stitch lengthwise down the center of the fabric.",
        "Use a needle to loosely weave a piece of thread down the middle of the fabric.",
        "Start at one of the short edges and thread directly down the center until you reach the opposite end.",
        "To thread a loose stitch, cut a piece of thread that is approximately 30 in (76 cm) long, thread it through the needle, and tie a knot at the end of the thread.",
        "Then, simply weave the needle in and out through the fabric in wide stitches, until you reach the other end.",
        "Bunch the fabric by pulling the thread.",
        "Once you have threaded down the center of the fabric, gently tug on the needle to pull the thread tight.",
        "Tighten the thread until all of the fabric is bunched up in tight folds.",
        "Fold the fabric in half crosswise and then wind it into a roll shape.",
        "Keep the needle and thread attached to the fabric.",
        "Gently fold the bunched fabric in half, taking care not to stretch it out.",
        "Then, loosely roll the fabric around itself from one end to the other to form the shape of a flower.",
        "If you cannot see the flower shape, roll the fabric more loosely.",
        "Aim for the bunched folds to look like petals.",
        "Place 4 stitches through the base to hold the fabric together.",
        "Once you have rolled the fabric into a flower shape that you are happy with, use the needle and thread to stitch through the bottom of the flower.",
        "Make sure that the fabric is tightly held together, as otherwise, the flower could come apart.",
        "Repeat the process as many times as desired.",
        "You can stick with 1 flower or make many for your headband.",
        "Use the same color or pattern fabric for a monochromatic look, or use various fabrics to create flowers that look different from one another.",
        "Assembling the Headband Get a plain elastic headband.",
        "Choose a headband that matches the color and style of the fabric flowers that you created.",
        "Popular color choices include white, pink, blue, and purple.",
        "You can purchase headbands from clothing and department stores.",
        "Alternatively, make your own elastic headband if you prefer.",
        "Simply measure the circumference of your head and cut a piece of elastic to size.",
        "Sew each end of the elastic together to create a headband.",
        "Wrap ribbon around the headband to make it more decorative.",
        "Pick your favorite ribbon and wrap it tightly around the elastic.",
        "Secure the end of the ribbon using hot glue.",
        "You can use more than 1 type of ribbon if you prefer.",
        "Get creative with alternating colors or patterns.",
        "Glue the elastic to the back of the fabric flowers.",
        "Place a long line of hot glue across the back of each fabric flower.",
        "Firmly press the elastic across the hot glue to attach each flower.",
        "If you made no-sew fabric flowers, glue the second felt circle on the back of the first felt circle so that the elastic attachment is covered.",
        "Make sure that each flower feels securely attached to the headband once the hot glue is dry.",
        "Use more hot glue if you need.",
        "You can use as many fabric flowers as you like.",
        "Some fabric flower headbands have only 1 flower, while other headbands have a line of smaller flowers across the top.",
        "Add jewels to each flower center if you want to embellish the headband.",
        "Press down the center of each flower to hold the fabric flat.",
        "Use hot glue to attach a jewel into the middle of each flower.",
        "Alternatively, try out buttons or sequins instead of jewels."
    ]
}