{
    "title": "How to Make Crown Molding from Plaster of Paris",
    "url": "https://www.wikihow.com/Make-Crown-Molding-from-Plaster-of-Paris",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "steps": [
        {
            "headline": "Roll out a thick piece of clay and press it onto a piece of crown moulding.",
            "description": "Thickness adds strength which is needed later when pouring the plaster."
        },
        {
            "headline": "Peel the clay off and straighten out minor bends.",
            "description": "The clay should be an exact reverse replica of the crown moulding."
        },
        {
            "headline": "Reinforce walls with wood pieces and/or strong plastic.",
            "description": "Seal edges to contain the poured plaster."
        },
        {
            "headline": "Mix plaster of Paris and pour a little in the mould.",
            "description": "Ensure that the nooks and crannies are filled before pouring enough plaster to fill the mould. Your fill line will be the thickness of the crown moulding."
        },
        {
            "headline": "Discard the clay and let the plaster dry until it feels dry to the touch.",
            "description": ""
        },
        {
            "headline": "Trim as needed.",
            "description": "Handle the dry plaster moulding carefully to prevent chipping."
        },
        {
            "headline": "Ignore any tiny air pockets for now.",
            "description": ""
        },
        {
            "headline": "Spread a thin layer of glue on all contact points.",
            "description": ""
        },
        {
            "headline": "Insert the plaster moulding into the gap without force.",
            "description": "It should fit snugly."
        },
        {
            "headline": "Once the glue is dry, fill any air bubbles and gaps with caulking.",
            "description": "Wipe off excess caulking with a slightly damp and smooth cloth."
        },
        {
            "headline": "Once you're satisfied that the gaps and surface are seamless, prime and paint as needed.",
            "description": ""
        }
    ],
    "tyn": [
        "Potter's clay",
        "Plaster of Paris",
        "Pieces of wood/plastic",
        "Whittling knife & X-Acto knife",
        "Ultra fine sandpaper, cut into manageable pieces for smoothing",
        "White glue",
        "Paintable acrylic latex caulking"
    ],
    "text": " Roll out a thick piece of clay and press it onto a piece of crown moulding. Thickness adds strength which is needed later when pouring the plaster. Peel the clay off and straighten out minor bends. The clay should be an exact reverse replica of the crown moulding. Reinforce walls with wood pieces and/or strong plastic. Seal edges to contain the poured plaster. Mix plaster of Paris and pour a little in the mould. Ensure that the nooks and crannies are filled before pouring enough plaster to fill the mould. Your fill line will be the thickness of the crown moulding. Discard the clay and let the plaster dry until it feels dry to the touch.  Trim as needed. Handle the dry plaster moulding carefully to prevent chipping. Ignore any tiny air pockets for now.  Spread a thin layer of glue on all contact points.  Insert the plaster moulding into the gap without force. It should fit snugly. Once the glue is dry, fill any air bubbles and gaps with caulking. Wipe off excess caulking with a slightly damp and smooth cloth. Once you're satisfied that the gaps and surface are seamless, prime and paint as needed. ",
    "sentences": [
        " Roll out a thick piece of clay and press it onto a piece of crown moulding.",
        "Thickness adds strength which is needed later when pouring the plaster.",
        "Peel the clay off and straighten out minor bends.",
        "The clay should be an exact reverse replica of the crown moulding.",
        "Reinforce walls with wood pieces and/or strong plastic.",
        "Seal edges to contain the poured plaster.",
        "Mix plaster of Paris and pour a little in the mould.",
        "Ensure that the nooks and crannies are filled before pouring enough plaster to fill the mould.",
        "Your fill line will be the thickness of the crown moulding.",
        "Discard the clay and let the plaster dry until it feels dry to the touch.",
        "Trim as needed.",
        "Handle the dry plaster moulding carefully to prevent chipping.",
        "Ignore any tiny air pockets for now.",
        "Spread a thin layer of glue on all contact points.",
        "Insert the plaster moulding into the gap without force.",
        "It should fit snugly.",
        "Once the glue is dry, fill any air bubbles and gaps with caulking.",
        "Wipe off excess caulking with a slightly damp and smooth cloth.",
        "Once you're satisfied that the gaps and surface are seamless, prime and paint as needed."
    ]
}