{
    "title": "How to Make Halloween Crafts",
    "url": "https://www.wikihow.com/Make-Halloween-Crafts",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Halloween"
    ],
    "methods": [
        {
            "name": "Traditional Halloween Decorations",
            "steps": [
                {
                    "headline": "Carve a jack o' lantern.",
                    "description": "Carving a scary or silly face on a pumpkin is probably the most popular Halloween craft there is. Cut off the top of the pumpkin, around the stem, and scoop and scrape out all the seeds and pulp. Once that's done, carve any picture you like on the side of the pumpkin, either freehand or using a pumpkin carving template taped to the pumpkin. Kids should only carve under adult supervision. You can find many carving templates online, or in books available at Halloween stores."
                },
                {
                    "headline": "Make a Halloween wreath.",
                    "description": "Decorate your door with a circle of branches, or strips of black and orange cloth tied around a circle of strong wire. Using glue, safety pins, or a drill with adult supervision, add any Halloween or autumn themed objects around the wreath. Try using autumn leaves, black and orange ribbons, or any small, store-bought Halloween decorations. Glow in the dark pumpkins or eyeballs make the wreath extra-spooky for trick-or-treaters."
                },
                {
                    "headline": "Make tombstones.",
                    "description": "You can make these out of any Styrofoam or posterboard, but they turn out best with rigid foam board or high density Styrofoam. Trace out a rounded tombstone shape using a circular object, or a marker tied to a string. Cut out the tombstone using any serrated bread knife, jigsaw, or hacksaw. Pencil on inscriptions, then use a utility knife to carve them out. Spray paint the tombstone grey, then use black spray paint to outline the stone, and black marker to fill in the lettering. Children should draw the shape and words, then let an adult cut them out. You can carve the tombstone into many different shapes. Look at photographs of a cemetery online for inspiration. To make the tombstones stand up in your yard, drill a wooden board to the front and back of the tombstone, and bury the boards."
                }
            ]
        },
        {
            "name": "Quick Halloween Crafts",
            "steps": [
                {
                    "headline": "Spook visitors with bleeding candles.",
                    "description": "Tall, white candles quickly take on a creepy appearance when you melt a red candle or crayon over the flame, leaving trails of red \"blood\" running down the side."
                },
                {
                    "headline": "Trap a ghost in a jar.",
                    "description": "Take a large glass jar and glue a thin circle of Styrofoam in the underside of the lid. Stick twigs in the Styrofoam to make trees, and decorate with moss, grass, or stones. To make the ghost head, draw a face on a cotton ball or ball of paper about the size of your thumbnail. Wrap the head in cheesecloth or gauze and fold a rubber band at the ghost's neck. Let the rest of the gauze dangle down to make a spooky, drifting body. Stick the ghost on a twig and add a green LED light for maximum effect, then put the jar upside-down over the entire scene and tighten the lid. You can cut out the Styrofoam circle from a Styrofoam cup or food tray. It should be thin enough that the lid can still attach to the jar."
                },
                {
                    "headline": "Brew mysterious potions.",
                    "description": "Scrub the label off any glass jar with soap and water, and fill it with water and a few drops of food coloring in any color. Leave some space in the jar so you can drop in seed pods, pine cones, or other small plant parts to create a laboratory of preserved specimens."
                },
                {
                    "headline": "Play with pipe cleaners.",
                    "description": "A few black and orange pipe cleaners are all you need to make easy decorations. Try covering the front steps with spiders and worms. A dab of white glue and a couple googly eyes makes these little creations cuter."
                },
                {
                    "headline": "Make glitter webs.",
                    "description": "Start with a black paper or plastic plate, or color a white one black with markers. Drizzle white glue in a spiderweb pattern over the plate, then sprinkle glitter over the glue to make the web stand out."
                }
            ]
        },
        {
            "name": "Costume Accessories",
            "steps": [
                {
                    "headline": "Create fake blood.",
                    "description": "Raid your kitchen for corn syrup, golden syrup, or chocolate syrup, then whisk in sifted flour or cornstarch a teaspoon (5 mL) at a time until it is thick enough to stick to objects. Stir in several drops of red food coloring, then add blue or green a drop at a time to make it a more realistic color. If the blood is too dark, mix in fruit punch. If it is too red, mix in cocoa powder. This fake blood is edible, but very sticky. If you want to make blood that's easier to wash off, use sugar-free syrup, and washable paint instead of the food coloring."
                },
                {
                    "headline": "Grow a pair of horns.",
                    "description": "Cut a large piece of corrugated cardboard into eight strips with a utility knife or scissors. Make the first strip about two inches (5 cm) wide and nine inches (23 cm) long, and make each subsequent strip ½ in (1.25 cm) and slightly shorter than the last. Roll each strip into a circle and glue it in place with a hot glue gun, then place each circle into the next largest one at an angle and glue together to finish the horn."
                },
                {
                    "headline": "Craft your own mask.",
                    "description": "You can make a custom-fit mask by molding foil onto your face, then using it as a base for papier maché. Once you've applied several layers and waited for them to dry, use a marker to draw on the mask, or a utility knife to alter the shape of the features. Use white glue to attach glitter, craft store feathers, or any other decorations."
                }
            ]
        }
    ],
    "tyn": [
        "Pumpkin, knife, pumpkin carving template",
        "Strips of black and orange cloth, glow in the dark eyeballs",
        "Rigid foam board, jigsaw, utility knife, grey and black spray paint, black marker",
        "White candles, lighter or match, red candle or crayon",
        "Glass jar, Styrofoam, twigs, real or fake moss or grass, cotton ball, pen, cheesecloth or gauze, rubber band, green LED",
        "Glass jar, water, food coloring, plant parts",
        "Paper plate, marker, and glitter",
        "Pipe cleaners, white glue, and googly eyes",
        "Corn syrup or chocolate syrup, red and blue food coloring, cocoa powder, fruit punch",
        "Corrugated cardboard, scissors, hot glue gun",
        "Foil, paper mache paste, newspaper strips, marker, utility knife"
    ],
    "text": " Traditional Halloween Decorations Carve a jack o' lantern. Carving a scary or silly face on a pumpkin is probably the most popular Halloween craft there is. Cut off the top of the pumpkin, around the stem, and scoop and scrape out all the seeds and pulp. Once that's done, carve any picture you like on the side of the pumpkin, either freehand or using a pumpkin carving template taped to the pumpkin. Kids should only carve under adult supervision. You can find many carving templates online, or in books available at Halloween stores. Make a Halloween wreath. Decorate your door with a circle of branches, or strips of black and orange cloth tied around a circle of strong wire. Using glue, safety pins, or a drill with adult supervision, add any Halloween or autumn themed objects around the wreath. Try using autumn leaves, black and orange ribbons, or any small, store-bought Halloween decorations. Glow in the dark pumpkins or eyeballs make the wreath extra-spooky for trick-or-treaters. Make tombstones. You can make these out of any Styrofoam or posterboard, but they turn out best with rigid foam board or high density Styrofoam. Trace out a rounded tombstone shape using a circular object, or a marker tied to a string. Cut out the tombstone using any serrated bread knife, jigsaw, or hacksaw. Pencil on inscriptions, then use a utility knife to carve them out. Spray paint the tombstone grey, then use black spray paint to outline the stone, and black marker to fill in the lettering. Children should draw the shape and words, then let an adult cut them out. You can carve the tombstone into many different shapes. Look at photographs of a cemetery online for inspiration. To make the tombstones stand up in your yard, drill a wooden board to the front and back of the tombstone, and bury the boards. Quick Halloween Crafts Spook visitors with bleeding candles. Tall, white candles quickly take on a creepy appearance when you melt a red candle or crayon over the flame, leaving trails of red \"blood\" running down the side. Trap a ghost in a jar. Take a large glass jar and glue a thin circle of Styrofoam in the underside of the lid. Stick twigs in the Styrofoam to make trees, and decorate with moss, grass, or stones. To make the ghost head, draw a face on a cotton ball or ball of paper about the size of your thumbnail. Wrap the head in cheesecloth or gauze and fold a rubber band at the ghost's neck. Let the rest of the gauze dangle down to make a spooky, drifting body. Stick the ghost on a twig and add a green LED light for maximum effect, then put the jar upside-down over the entire scene and tighten the lid. You can cut out the Styrofoam circle from a Styrofoam cup or food tray. It should be thin enough that the lid can still attach to the jar. Brew mysterious potions. Scrub the label off any glass jar with soap and water, and fill it with water and a few drops of food coloring in any color. Leave some space in the jar so you can drop in seed pods, pine cones, or other small plant parts to create a laboratory of preserved specimens. Play with pipe cleaners. A few black and orange pipe cleaners are all you need to make easy decorations. Try covering the front steps with spiders and worms. A dab of white glue and a couple googly eyes makes these little creations cuter. Make glitter webs. Start with a black paper or plastic plate, or color a white one black with markers. Drizzle white glue in a spiderweb pattern over the plate, then sprinkle glitter over the glue to make the web stand out. Costume Accessories Create fake blood. Raid your kitchen for corn syrup, golden syrup, or chocolate syrup, then whisk in sifted flour or cornstarch a teaspoon (5 mL) at a time until it is thick enough to stick to objects. Stir in several drops of red food coloring, then add blue or green a drop at a time to make it a more realistic color. If the blood is too dark, mix in fruit punch. If it is too red, mix in cocoa powder. This fake blood is edible, but very sticky. If you want to make blood that's easier to wash off, use sugar-free syrup, and washable paint instead of the food coloring. Grow a pair of horns. Cut a large piece of corrugated cardboard into eight strips with a utility knife or scissors. Make the first strip about two inches (5 cm) wide and nine inches (23 cm) long, and make each subsequent strip ½ in (1.25 cm) and slightly shorter than the last. Roll each strip into a circle and glue it in place with a hot glue gun, then place each circle into the next largest one at an angle and glue together to finish the horn. Craft your own mask. You can make a custom-fit mask by molding foil onto your face, then using it as a base for papier maché. Once you've applied several layers and waited for them to dry, use a marker to draw on the mask, or a utility knife to alter the shape of the features. Use white glue to attach glitter, craft store feathers, or any other decorations.",
    "sentences": [
        " Traditional Halloween Decorations Carve a jack o' lantern.",
        "Carving a scary or silly face on a pumpkin is probably the most popular Halloween craft there is.",
        "Cut off the top of the pumpkin, around the stem, and scoop and scrape out all the seeds and pulp.",
        "Once that's done, carve any picture you like on the side of the pumpkin, either freehand or using a pumpkin carving template taped to the pumpkin.",
        "Kids should only carve under adult supervision.",
        "You can find many carving templates online, or in books available at Halloween stores.",
        "Make a Halloween wreath.",
        "Decorate your door with a circle of branches, or strips of black and orange cloth tied around a circle of strong wire.",
        "Using glue, safety pins, or a drill with adult supervision, add any Halloween or autumn themed objects around the wreath.",
        "Try using autumn leaves, black and orange ribbons, or any small, store-bought Halloween decorations.",
        "Glow in the dark pumpkins or eyeballs make the wreath extra-spooky for trick-or-treaters.",
        "Make tombstones.",
        "You can make these out of any Styrofoam or posterboard, but they turn out best with rigid foam board or high density Styrofoam.",
        "Trace out a rounded tombstone shape using a circular object, or a marker tied to a string.",
        "Cut out the tombstone using any serrated bread knife, jigsaw, or hacksaw.",
        "Pencil on inscriptions, then use a utility knife to carve them out.",
        "Spray paint the tombstone grey, then use black spray paint to outline the stone, and black marker to fill in the lettering.",
        "Children should draw the shape and words, then let an adult cut them out.",
        "You can carve the tombstone into many different shapes.",
        "Look at photographs of a cemetery online for inspiration.",
        "To make the tombstones stand up in your yard, drill a wooden board to the front and back of the tombstone, and bury the boards.",
        "Quick Halloween Crafts Spook visitors with bleeding candles.",
        "Tall, white candles quickly take on a creepy appearance when you melt a red candle or crayon over the flame, leaving trails of red \"blood\" running down the side.",
        "Trap a ghost in a jar.",
        "Take a large glass jar and glue a thin circle of Styrofoam in the underside of the lid.",
        "Stick twigs in the Styrofoam to make trees, and decorate with moss, grass, or stones.",
        "To make the ghost head, draw a face on a cotton ball or ball of paper about the size of your thumbnail.",
        "Wrap the head in cheesecloth or gauze and fold a rubber band at the ghost's neck.",
        "Let the rest of the gauze dangle down to make a spooky, drifting body.",
        "Stick the ghost on a twig and add a green LED light for maximum effect, then put the jar upside-down over the entire scene and tighten the lid.",
        "You can cut out the Styrofoam circle from a Styrofoam cup or food tray.",
        "It should be thin enough that the lid can still attach to the jar.",
        "Brew mysterious potions.",
        "Scrub the label off any glass jar with soap and water, and fill it with water and a few drops of food coloring in any color.",
        "Leave some space in the jar so you can drop in seed pods, pine cones, or other small plant parts to create a laboratory of preserved specimens.",
        "Play with pipe cleaners.",
        "A few black and orange pipe cleaners are all you need to make easy decorations.",
        "Try covering the front steps with spiders and worms.",
        "A dab of white glue and a couple googly eyes makes these little creations cuter.",
        "Make glitter webs.",
        "Start with a black paper or plastic plate, or color a white one black with markers.",
        "Drizzle white glue in a spiderweb pattern over the plate, then sprinkle glitter over the glue to make the web stand out.",
        "Costume Accessories Create fake blood.",
        "Raid your kitchen for corn syrup, golden syrup, or chocolate syrup, then whisk in sifted flour or cornstarch a teaspoon (5 mL) at a time until it is thick enough to stick to objects.",
        "Stir in several drops of red food coloring, then add blue or green a drop at a time to make it a more realistic color.",
        "If the blood is too dark, mix in fruit punch.",
        "If it is too red, mix in cocoa powder.",
        "This fake blood is edible, but very sticky.",
        "If you want to make blood that's easier to wash off, use sugar-free syrup, and washable paint instead of the food coloring.",
        "Grow a pair of horns.",
        "Cut a large piece of corrugated cardboard into eight strips with a utility knife or scissors.",
        "Make the first strip about two inches (5 cm) wide and nine inches (23 cm) long, and make each subsequent strip ½ in (1.25 cm) and slightly shorter than the last.",
        "Roll each strip into a circle and glue it in place with a hot glue gun, then place each circle into the next largest one at an angle and glue together to finish the horn.",
        "Craft your own mask.",
        "You can make a custom-fit mask by molding foil onto your face, then using it as a base for papier maché.",
        "Once you've applied several layers and waited for them to dry, use a marker to draw on the mask, or a utility knife to alter the shape of the features.",
        "Use white glue to attach glitter, craft store feathers, or any other decorations."
    ]
}