{
    "title": "How to Attract Yellow Finches",
    "url": "https://www.wikihow.com/Attract-Yellow-Finches",
    "category_hierarchy": [
        "Pets and Animals",
        "Birds",
        "Bird Breeds",
        "Finches"
    ],
    "parts": [
        {
            "name": "Creating a Finch Habitat",
            "steps": [
                {
                    "headline": "Plant shrubs and trees with plenty of vertical branches for nesting.",
                    "description": "Yellow finches make their nests near the tops of these plants. They prefer spots where 2 or 3 branches fork, forming a bowl that provides plenty of support for a new nest. These spots are usually covered from above by a cluster of leaves or needles but visible from below. Finches often build nests among dogwoods, elderberries, buttonbushes, hawthorns, Monterey pines, willows, fruit trees, and even tall thistles. Watch areas that already have these sorts of trees and shrubs. You may be able to spot some finches without putting these plants directly on your property. The best areas are large and secluded with lots of sunlight."
                },
                {
                    "headline": "Grow nesting plants that are 5 ft (1.5 m) tall or higher.",
                    "description": "Finches generally make their nests between 3 ft (0.91 m) to 10 ft (3.0 m) off the ground. It protects the nests from cats and other predators. Set your feeders near areas with taller shrubs and trees to have a better chance of attracting finches. Give new shrubs and trees plenty of space to grow. Yellow finches are easier to spot in more open spaces."
                },
                {
                    "headline": "Plant thistle and tall grasses for nesting material.",
                    "description": "Yellow finches love thistle plants, which also double as a food source. Milkweed, cattails, and cottonwood are a few other types of plants that attract finch nests. However, you may see finches in your area even if you aren't able to grow these plants. Finches are adaptable and will use other material they find as needed. Many types of thistle grow quickly and are considered invasive. Check your local regulations for restrictions on growing thistle and try to choose a type that occurs naturally in your area."
                },
                {
                    "headline": "Grow colorful flowers to serve as a bright food source.",
                    "description": "Black oil sunflowers attract many types of birds, including finches. Yellow finches also eat seeds from asters, purple coneflowers, and black-eyed Susans. Other colorful flowers, including daisies, cosmos, marigolds, poppies, and zinnias, are like beacons for these birds. Some people swear by yellow flowers. While they do attract finches, birds have sharp eyes capable of noticing any type of bright color. Don't deadhead these flowers after their blooms fade. Finches feed on seeds from marigolds, zinnias, and other plans after they die out."
                },
                {
                    "headline": "Add a birdbath to provide fresh water in your yard.",
                    "description": "Yellow finches nest near sources of water for drinking and bathing. To increase your chances of bringing finches to the area, get a standing bath or fountain with circulating water. Set it close to the trees and flowers that attract finches, if possible. If you are able to, create a finch habitat near a stream or river so the birds always have a fresh source of water."
                }
            ]
        },
        {
            "name": "Hanging a Bird Feeder",
            "steps": [
                {
                    "headline": "Choose a tube or sock feeder designed for finches.",
                    "description": "Finches are classified as “cling and peck” feeders, meaning that they cling to the ends of flowers or grass stocks when eating in the wild. For this reason, get a feeder that allows them to hang or cling to the sides at varying angles. Avoid feeders with perches that attract larger birds. Use a mesh sock feeder for an easy way to feed yellow finches. The birds pull seeds through the fabric with their small beaks. Sock feeders are easy to make out of nylon socks or pantyhose tied shut at the end. Quality feeders are available at most pet stores, bird supply shops, and online. Finches may show up at other types of feeders, such as hopper feeders. However, these feeders also attract squirrels and other birds, which will scare away the finches even if you put out the right food."
                },
                {
                    "headline": "Fill your feeder with thistle seeds that finches prefer.",
                    "description": "Thistle seeds, also called niger or nyjer seeds, are the most common food source for bringing yellow finches to feeders. Most other birds and squirrels don't eat this type of seed, so they will leave your feeder alone. Keep the feeder brimming with fresh thistle to attract more finches. Use only fresh thistle seeds, which look black and oily. Brown seeds are old. They have no taste or nutritional value, so yellow finches will avoid them. Purchase seeds in small quantities, up to 2 lb (0.91 kg) at a time, from a wild bird supply store. The seeds stay fresh for up to a couple of months. Places that sell the seeds in bulk are often selling older batches that finches won't eat. Store-bought finch seed mixes are blends of thistle seeds with sunflower chips. They may also contain other components like flaxseed and millet."
                },
                {
                    "headline": "Mix other types of seeds into the feeder as a supplement.",
                    "description": "Yellow finches enjoy black oil sunflower seeds as well as hulled seeds from other sunflower varieties. They also eat seeds from dandelions, goldenrod, and other plants. Flax and millet are a few other inexpensive treats to stretch out a bag of thistle seeds. Finches have small beaks that cannot crack hard shells, so select seeds carefully. If you purchase sunflower seeds or safflower seeds, get them with the husks removed. Keep the seed mix about 75% thistle. That way, the other components don't attract squirrels and other birds."
                },
                {
                    "headline": "Hang your feeder at least 5 ft (1.5 m) above the ground.",
                    "description": "Hook the feeder to the end of a tree branch or a tall metal pole. That way, hunters like cats can't disturb the finches as they feed. This also discourages hungry squirrels from toppling the feeder. Keep the feeder about the same level as nearby tree branches so the finches have plenty of cover. Metal feeder poles are are a great resource since they allow to place a feeder almost anywhere, even if you don't have long tree branches nearby. If you decide the feeder is in a bad spot, pull the pole out of the ground and plant it elsewhere."
                },
                {
                    "headline": "Position feeders about 10 ft (3.0 m) away from tree trunks.",
                    "description": "Naughty cats and squirrels may climb trees and reach the feeders. For finches, feeders don't need to be underneath the tree branches. As long as the trees are close by, you have a good chance of attracting yellow finches. Finches make their nests in thick shrubs near open fields and rivers. Put your feeders close to these sorts of areas to have the best chance of attracting them. They don't go deep into forests to feed, so spacing feeders apart from trees is fine."
                },
                {
                    "headline": "Place the feeder away from other feeders.",
                    "description": "Yellow finches are somewhat shy and tend to stay away from busy areas. Keep finch feeders about 15 ft (4.6 m) away from any other bird feeders in the area. Watch the feeders as birds go to them. If you see larger or more aggressive birds and predators, reposition the feeder. Also, be aware of climbable surfaces like walls and buildings. Feeders near these areas are often vulnerable to clever predators, so finches will avoid them. Place the feeder in a location that is visible from a distance so you are able to watch the finches without disturbing them."
                }
            ]
        },
        {
            "name": "Maintaining the Feeding Environment",
            "steps": [
                {
                    "headline": "Empty half-filled feeders to remove old and compacted seed.",
                    "description": "Seed at the bottom of a feeder accumulates moisture and compacts over time. Yellow finches are a little picky, and if you see them avoiding a good feeder, this could be why. Pour out the old seed and refill the feeder to keep the finches coming. Check the old seed at least once a month, preferably when you deep-clean the feeder. If it looks healthy, mix it in with the new seed. Fresh thistle seeds, for instance, look black and oily. Plan on checking the feeder as often as possible to keep it clean and well-stocked."
                },
                {
                    "headline": "Deep-clean feeders twice a month with water and bleach.",
                    "description": "Dilute 1 part liquid bleach in 9 parts clean water. Then, remove the seeds from the feeder and rinse it out. Soak the feeder in the mixture and scrub off any debris with a nylon bottle brush. Rinse the feeder out with clean water, wipe it off with a paper towel, and let it finish drying in sunlight to eliminate all bacteria. Clean feeders every 2 weeks or more to prevent mold and bacteria. Feeders need to be cleaned more often during rainy periods or when you hear reports about salmonella outbreaks in your area. Liquid dish soap also helps when cleaning feeders, but it doesn't eliminate mold. Bleach is more effective at sterilizing feeders."
                },
                {
                    "headline": "Wash and refill birdbaths 2 to 3 times a week.",
                    "description": "Drain the water, then wipe the birdbath clean with a paper towel or sponge. To give it a more thorough cleaning, mix 1 part white vinegar with 9 parts water. Scrub the bath and put more clean water in it for the finches. Birdbaths are prone to the same bacteria that wet feeders are, so clean them as often as possible to prevent yellow finches from getting sick. You may need to refill a birdbath more often, especially during dry weather."
                },
                {
                    "headline": "Tie bright ribbons near feeders away from colorful wildflowers.",
                    "description": "Colorful ribbons are a shortcut for times when you can't grow flowers around a feeder. Knot the ribbon around branches or poles close to the feeder. Let the ends of the ribbon hang so they blow about in the breeze. Finches notice the color and movement of the ribbon when they're flying by the feeder. If they see the ribbon moving without other birds or predators nearby, they may stop by the feeder."
                },
                {
                    "headline": "Set out more food during the winter to attract traveling finches.",
                    "description": "Yellow finches head towards warmer weather in search of food. They travel in large flocks during these months. If you are able to provide plenty of food in your feeders, you will most likely see a few stop by or even end up with repeat visitors. Finches normally range from the northern part of Canada to part of the southern U.S. In winter, they range from the southern end of Canada to as far as Mexico. Finches nest and lay eggs in the summer. They then molt in autumn. If the birds look a little dull-colored, it's because of their new feathers."
                }
            ]
        }
    ],
    "tyn": [
        "Niger thistle seeds",
        "Alternative seeds for small birds",
        "Mesh or plastic finch feeder",
        "Birdbath or fountain",
        "Trees, shrubs, and wildflowers if planting a new habitat"
    ],
    "text": " Creating a Finch Habitat Plant shrubs and trees with plenty of vertical branches for nesting. Yellow finches make their nests near the tops of these plants. They prefer spots where 2 or 3 branches fork, forming a bowl that provides plenty of support for a new nest. These spots are usually covered from above by a cluster of leaves or needles but visible from below. Finches often build nests among dogwoods, elderberries, buttonbushes, hawthorns, Monterey pines, willows, fruit trees, and even tall thistles. Watch areas that already have these sorts of trees and shrubs. You may be able to spot some finches without putting these plants directly on your property. The best areas are large and secluded with lots of sunlight. Grow nesting plants that are 5 ft (1.5 m) tall or higher. Finches generally make their nests between 3 ft (0.91 m) to 10 ft (3.0 m) off the ground. It protects the nests from cats and other predators. Set your feeders near areas with taller shrubs and trees to have a better chance of attracting finches. Give new shrubs and trees plenty of space to grow. Yellow finches are easier to spot in more open spaces. Plant thistle and tall grasses for nesting material. Yellow finches love thistle plants, which also double as a food source. Milkweed, cattails, and cottonwood are a few other types of plants that attract finch nests. However, you may see finches in your area even if you aren't able to grow these plants. Finches are adaptable and will use other material they find as needed. Many types of thistle grow quickly and are considered invasive. Check your local regulations for restrictions on growing thistle and try to choose a type that occurs naturally in your area. Grow colorful flowers to serve as a bright food source. Black oil sunflowers attract many types of birds, including finches. Yellow finches also eat seeds from asters, purple coneflowers, and black-eyed Susans. Other colorful flowers, including daisies, cosmos, marigolds, poppies, and zinnias, are like beacons for these birds. Some people swear by yellow flowers. While they do attract finches, birds have sharp eyes capable of noticing any type of bright color. Don't deadhead these flowers after their blooms fade. Finches feed on seeds from marigolds, zinnias, and other plans after they die out. Add a birdbath to provide fresh water in your yard. Yellow finches nest near sources of water for drinking and bathing. To increase your chances of bringing finches to the area, get a standing bath or fountain with circulating water. Set it close to the trees and flowers that attract finches, if possible. If you are able to, create a finch habitat near a stream or river so the birds always have a fresh source of water. Hanging a Bird Feeder Choose a tube or sock feeder designed for finches. Finches are classified as “cling and peck” feeders, meaning that they cling to the ends of flowers or grass stocks when eating in the wild. For this reason, get a feeder that allows them to hang or cling to the sides at varying angles. Avoid feeders with perches that attract larger birds. Use a mesh sock feeder for an easy way to feed yellow finches. The birds pull seeds through the fabric with their small beaks. Sock feeders are easy to make out of nylon socks or pantyhose tied shut at the end. Quality feeders are available at most pet stores, bird supply shops, and online. Finches may show up at other types of feeders, such as hopper feeders. However, these feeders also attract squirrels and other birds, which will scare away the finches even if you put out the right food. Fill your feeder with thistle seeds that finches prefer. Thistle seeds, also called niger or nyjer seeds, are the most common food source for bringing yellow finches to feeders. Most other birds and squirrels don't eat this type of seed, so they will leave your feeder alone. Keep the feeder brimming with fresh thistle to attract more finches. Use only fresh thistle seeds, which look black and oily. Brown seeds are old. They have no taste or nutritional value, so yellow finches will avoid them. Purchase seeds in small quantities, up to 2 lb (0.91 kg) at a time, from a wild bird supply store. The seeds stay fresh for up to a couple of months. Places that sell the seeds in bulk are often selling older batches that finches won't eat. Store-bought finch seed mixes are blends of thistle seeds with sunflower chips. They may also contain other components like flaxseed and millet. Mix other types of seeds into the feeder as a supplement. Yellow finches enjoy black oil sunflower seeds as well as hulled seeds from other sunflower varieties. They also eat seeds from dandelions, goldenrod, and other plants. Flax and millet are a few other inexpensive treats to stretch out a bag of thistle seeds. Finches have small beaks that cannot crack hard shells, so select seeds carefully. If you purchase sunflower seeds or safflower seeds, get them with the husks removed. Keep the seed mix about 75% thistle. That way, the other components don't attract squirrels and other birds. Hang your feeder at least 5 ft (1.5 m) above the ground. Hook the feeder to the end of a tree branch or a tall metal pole. That way, hunters like cats can't disturb the finches as they feed. This also discourages hungry squirrels from toppling the feeder. Keep the feeder about the same level as nearby tree branches so the finches have plenty of cover. Metal feeder poles are are a great resource since they allow to place a feeder almost anywhere, even if you don't have long tree branches nearby. If you decide the feeder is in a bad spot, pull the pole out of the ground and plant it elsewhere. Position feeders about 10 ft (3.0 m) away from tree trunks. Naughty cats and squirrels may climb trees and reach the feeders. For finches, feeders don't need to be underneath the tree branches. As long as the trees are close by, you have a good chance of attracting yellow finches. Finches make their nests in thick shrubs near open fields and rivers. Put your feeders close to these sorts of areas to have the best chance of attracting them. They don't go deep into forests to feed, so spacing feeders apart from trees is fine. Place the feeder away from other feeders. Yellow finches are somewhat shy and tend to stay away from busy areas. Keep finch feeders about 15 ft (4.6 m) away from any other bird feeders in the area. Watch the feeders as birds go to them. If you see larger or more aggressive birds and predators, reposition the feeder. Also, be aware of climbable surfaces like walls and buildings. Feeders near these areas are often vulnerable to clever predators, so finches will avoid them. Place the feeder in a location that is visible from a distance so you are able to watch the finches without disturbing them. Maintaining the Feeding Environment Empty half-filled feeders to remove old and compacted seed. Seed at the bottom of a feeder accumulates moisture and compacts over time. Yellow finches are a little picky, and if you see them avoiding a good feeder, this could be why. Pour out the old seed and refill the feeder to keep the finches coming. Check the old seed at least once a month, preferably when you deep-clean the feeder. If it looks healthy, mix it in with the new seed. Fresh thistle seeds, for instance, look black and oily. Plan on checking the feeder as often as possible to keep it clean and well-stocked. Deep-clean feeders twice a month with water and bleach. Dilute 1 part liquid bleach in 9 parts clean water. Then, remove the seeds from the feeder and rinse it out. Soak the feeder in the mixture and scrub off any debris with a nylon bottle brush. Rinse the feeder out with clean water, wipe it off with a paper towel, and let it finish drying in sunlight to eliminate all bacteria. Clean feeders every 2 weeks or more to prevent mold and bacteria. Feeders need to be cleaned more often during rainy periods or when you hear reports about salmonella outbreaks in your area. Liquid dish soap also helps when cleaning feeders, but it doesn't eliminate mold. Bleach is more effective at sterilizing feeders. Wash and refill birdbaths 2 to 3 times a week. Drain the water, then wipe the birdbath clean with a paper towel or sponge. To give it a more thorough cleaning, mix 1 part white vinegar with 9 parts water. Scrub the bath and put more clean water in it for the finches. Birdbaths are prone to the same bacteria that wet feeders are, so clean them as often as possible to prevent yellow finches from getting sick. You may need to refill a birdbath more often, especially during dry weather. Tie bright ribbons near feeders away from colorful wildflowers. Colorful ribbons are a shortcut for times when you can't grow flowers around a feeder. Knot the ribbon around branches or poles close to the feeder. Let the ends of the ribbon hang so they blow about in the breeze. Finches notice the color and movement of the ribbon when they're flying by the feeder. If they see the ribbon moving without other birds or predators nearby, they may stop by the feeder. Set out more food during the winter to attract traveling finches. Yellow finches head towards warmer weather in search of food. They travel in large flocks during these months. If you are able to provide plenty of food in your feeders, you will most likely see a few stop by or even end up with repeat visitors. Finches normally range from the northern part of Canada to part of the southern U.S. In winter, they range from the southern end of Canada to as far as Mexico. Finches nest and lay eggs in the summer. They then molt in autumn. If the birds look a little dull-colored, it's because of their new feathers.",
    "sentences": [
        " Creating a Finch Habitat Plant shrubs and trees with plenty of vertical branches for nesting.",
        "Yellow finches make their nests near the tops of these plants.",
        "They prefer spots where 2 or 3 branches fork, forming a bowl that provides plenty of support for a new nest.",
        "These spots are usually covered from above by a cluster of leaves or needles but visible from below.",
        "Finches often build nests among dogwoods, elderberries, buttonbushes, hawthorns, Monterey pines, willows, fruit trees, and even tall thistles.",
        "Watch areas that already have these sorts of trees and shrubs.",
        "You may be able to spot some finches without putting these plants directly on your property.",
        "The best areas are large and secluded with lots of sunlight.",
        "Grow nesting plants that are 5 ft (1.5 m) tall or higher.",
        "Finches generally make their nests between 3 ft (0.91 m) to 10 ft (3.0 m) off the ground.",
        "It protects the nests from cats and other predators.",
        "Set your feeders near areas with taller shrubs and trees to have a better chance of attracting finches.",
        "Give new shrubs and trees plenty of space to grow.",
        "Yellow finches are easier to spot in more open spaces.",
        "Plant thistle and tall grasses for nesting material.",
        "Yellow finches love thistle plants, which also double as a food source.",
        "Milkweed, cattails, and cottonwood are a few other types of plants that attract finch nests.",
        "However, you may see finches in your area even if you aren't able to grow these plants.",
        "Finches are adaptable and will use other material they find as needed.",
        "Many types of thistle grow quickly and are considered invasive.",
        "Check your local regulations for restrictions on growing thistle and try to choose a type that occurs naturally in your area.",
        "Grow colorful flowers to serve as a bright food source.",
        "Black oil sunflowers attract many types of birds, including finches.",
        "Yellow finches also eat seeds from asters, purple coneflowers, and black-eyed Susans.",
        "Other colorful flowers, including daisies, cosmos, marigolds, poppies, and zinnias, are like beacons for these birds.",
        "Some people swear by yellow flowers.",
        "While they do attract finches, birds have sharp eyes capable of noticing any type of bright color.",
        "Don't deadhead these flowers after their blooms fade.",
        "Finches feed on seeds from marigolds, zinnias, and other plans after they die out.",
        "Add a birdbath to provide fresh water in your yard.",
        "Yellow finches nest near sources of water for drinking and bathing.",
        "To increase your chances of bringing finches to the area, get a standing bath or fountain with circulating water.",
        "Set it close to the trees and flowers that attract finches, if possible.",
        "If you are able to, create a finch habitat near a stream or river so the birds always have a fresh source of water.",
        "Hanging a Bird Feeder Choose a tube or sock feeder designed for finches.",
        "Finches are classified as “cling and peck” feeders, meaning that they cling to the ends of flowers or grass stocks when eating in the wild.",
        "For this reason, get a feeder that allows them to hang or cling to the sides at varying angles.",
        "Avoid feeders with perches that attract larger birds.",
        "Use a mesh sock feeder for an easy way to feed yellow finches.",
        "The birds pull seeds through the fabric with their small beaks.",
        "Sock feeders are easy to make out of nylon socks or pantyhose tied shut at the end.",
        "Quality feeders are available at most pet stores, bird supply shops, and online.",
        "Finches may show up at other types of feeders, such as hopper feeders.",
        "However, these feeders also attract squirrels and other birds, which will scare away the finches even if you put out the right food.",
        "Fill your feeder with thistle seeds that finches prefer.",
        "Thistle seeds, also called niger or nyjer seeds, are the most common food source for bringing yellow finches to feeders.",
        "Most other birds and squirrels don't eat this type of seed, so they will leave your feeder alone.",
        "Keep the feeder brimming with fresh thistle to attract more finches.",
        "Use only fresh thistle seeds, which look black and oily.",
        "Brown seeds are old.",
        "They have no taste or nutritional value, so yellow finches will avoid them.",
        "Purchase seeds in small quantities, up to 2 lb (0.91 kg) at a time, from a wild bird supply store.",
        "The seeds stay fresh for up to a couple of months.",
        "Places that sell the seeds in bulk are often selling older batches that finches won't eat.",
        "Store-bought finch seed mixes are blends of thistle seeds with sunflower chips.",
        "They may also contain other components like flaxseed and millet.",
        "Mix other types of seeds into the feeder as a supplement.",
        "Yellow finches enjoy black oil sunflower seeds as well as hulled seeds from other sunflower varieties.",
        "They also eat seeds from dandelions, goldenrod, and other plants.",
        "Flax and millet are a few other inexpensive treats to stretch out a bag of thistle seeds.",
        "Finches have small beaks that cannot crack hard shells, so select seeds carefully.",
        "If you purchase sunflower seeds or safflower seeds, get them with the husks removed.",
        "Keep the seed mix about 75% thistle.",
        "That way, the other components don't attract squirrels and other birds.",
        "Hang your feeder at least 5 ft (1.5 m) above the ground.",
        "Hook the feeder to the end of a tree branch or a tall metal pole.",
        "That way, hunters like cats can't disturb the finches as they feed.",
        "This also discourages hungry squirrels from toppling the feeder.",
        "Keep the feeder about the same level as nearby tree branches so the finches have plenty of cover.",
        "Metal feeder poles are are a great resource since they allow to place a feeder almost anywhere, even if you don't have long tree branches nearby.",
        "If you decide the feeder is in a bad spot, pull the pole out of the ground and plant it elsewhere.",
        "Position feeders about 10 ft (3.0 m) away from tree trunks.",
        "Naughty cats and squirrels may climb trees and reach the feeders.",
        "For finches, feeders don't need to be underneath the tree branches.",
        "As long as the trees are close by, you have a good chance of attracting yellow finches.",
        "Finches make their nests in thick shrubs near open fields and rivers.",
        "Put your feeders close to these sorts of areas to have the best chance of attracting them.",
        "They don't go deep into forests to feed, so spacing feeders apart from trees is fine.",
        "Place the feeder away from other feeders.",
        "Yellow finches are somewhat shy and tend to stay away from busy areas.",
        "Keep finch feeders about 15 ft (4.6 m) away from any other bird feeders in the area.",
        "Watch the feeders as birds go to them.",
        "If you see larger or more aggressive birds and predators, reposition the feeder.",
        "Also, be aware of climbable surfaces like walls and buildings.",
        "Feeders near these areas are often vulnerable to clever predators, so finches will avoid them.",
        "Place the feeder in a location that is visible from a distance so you are able to watch the finches without disturbing them.",
        "Maintaining the Feeding Environment Empty half-filled feeders to remove old and compacted seed.",
        "Seed at the bottom of a feeder accumulates moisture and compacts over time.",
        "Yellow finches are a little picky, and if you see them avoiding a good feeder, this could be why.",
        "Pour out the old seed and refill the feeder to keep the finches coming.",
        "Check the old seed at least once a month, preferably when you deep-clean the feeder.",
        "If it looks healthy, mix it in with the new seed.",
        "Fresh thistle seeds, for instance, look black and oily.",
        "Plan on checking the feeder as often as possible to keep it clean and well-stocked.",
        "Deep-clean feeders twice a month with water and bleach.",
        "Dilute 1 part liquid bleach in 9 parts clean water.",
        "Then, remove the seeds from the feeder and rinse it out.",
        "Soak the feeder in the mixture and scrub off any debris with a nylon bottle brush.",
        "Rinse the feeder out with clean water, wipe it off with a paper towel, and let it finish drying in sunlight to eliminate all bacteria.",
        "Clean feeders every 2 weeks or more to prevent mold and bacteria.",
        "Feeders need to be cleaned more often during rainy periods or when you hear reports about salmonella outbreaks in your area.",
        "Liquid dish soap also helps when cleaning feeders, but it doesn't eliminate mold.",
        "Bleach is more effective at sterilizing feeders.",
        "Wash and refill birdbaths 2 to 3 times a week.",
        "Drain the water, then wipe the birdbath clean with a paper towel or sponge.",
        "To give it a more thorough cleaning, mix 1 part white vinegar with 9 parts water.",
        "Scrub the bath and put more clean water in it for the finches.",
        "Birdbaths are prone to the same bacteria that wet feeders are, so clean them as often as possible to prevent yellow finches from getting sick.",
        "You may need to refill a birdbath more often, especially during dry weather.",
        "Tie bright ribbons near feeders away from colorful wildflowers.",
        "Colorful ribbons are a shortcut for times when you can't grow flowers around a feeder.",
        "Knot the ribbon around branches or poles close to the feeder.",
        "Let the ends of the ribbon hang so they blow about in the breeze.",
        "Finches notice the color and movement of the ribbon when they're flying by the feeder.",
        "If they see the ribbon moving without other birds or predators nearby, they may stop by the feeder.",
        "Set out more food during the winter to attract traveling finches.",
        "Yellow finches head towards warmer weather in search of food.",
        "They travel in large flocks during these months.",
        "If you are able to provide plenty of food in your feeders, you will most likely see a few stop by or even end up with repeat visitors.",
        "Finches normally range from the northern part of Canada to part of the southern U.S.",
        "In winter, they range from the southern end of Canada to as far as Mexico.",
        "Finches nest and lay eggs in the summer.",
        "They then molt in autumn.",
        "If the birds look a little dull-colored, it's because of their new feathers."
    ]
}