{
    "title": "How to Make Online Quizzes in Moodle",
    "url": "https://www.wikihow.com/Make-Online-Quizzes-in-Moodle",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Tests and Exams",
        "Exam Revision",
        "Study Quizzes"
    ],
    "steps": [
        {
            "headline": "Create Simple Quizzes with Quiz Module in Moodle Fortunately, Moodle already has a Quiz module allowing the instructors to design and set quizzes consisting of a large variety of Question types in the easiest way.",
            "description": "With this module, creating a new quiz is just a two-step process."
        },
        {
            "headline": "Create the quiz activity and set options to interact with the quiz.",
            "description": "- Ensure your role in Moodle is switched to Course creator, Teacher or other editing roles; - Within the course you enrolled, click \"Turn editing on\" on the Administration panel; - On the exact week in outline, click \"Add an activity\", and select \"Quiz\" in the drop-down list; - Specify the Quiz options such as Name, Timing, Display & Attempts, and save."
        },
        {
            "headline": "Edit the quiz and add specified questions from various question types.",
            "description": "- In the created quiz, click \"Edit\" on the top navigation bar to edit the quiz detail; - Switch to the \"Questions\" section on second-level navigation; - In the \"Question Bank\", go to \"Create new question\", and choose the types you like. As the easiest way to create quizzes in Moodle quickly, Quiz module offers fundamental and flexible features to meet the practical requirements. Therefore, it may not support some advanced applications such as importing audio, customizing background or collecting results."
        },
        {
            "headline": "Make Rich-Media Quizzes with SCORM/AICC Module in Moodle Besides the simple quizzes making, some instructors may need to build the assessments with multimedia, as well as results tracking and reporting.",
            "description": "Upon these requirements, Flash quiz is the perfect solution with multimedia authoring. With SCORM/AICC module in Moodle which allows you to upload any standard SCORM package, you can easily create and incorporate a SCROM compliant Flash quiz in your course."
        },
        {
            "headline": "Make Flash-based quizzes with SCORM compliance.",
            "description": "- Make Flash quiz with some Flash authoring tools, such as Articulate QuizMaker]; - Create questions in different question types with these E-Assessment tools, or design Excel-based quizzes and output as Flash with tools; - Publish the quiz for LMS as specified SCORM compliant package."
        },
        {
            "headline": "Add Flash quiz as SCORM compliant content into the course.",
            "description": "- Ensure your role in Moodle is switched to Course creator, Teacher or other editing roles; - Within the course you enrolled, click \"Turn editing on\" on the Administration panel; - On the exact week in outline, click \"Add an activity\", and select \"SCORM/AICC\" in the drop-down list; - Specify the settings such as Name, and choose the SCORM compliant package to upload, then save the course. Finally, as you can see in the course contents as Student role, and the results report as Teacher role, the SCROM compliant Flash quiz can work well with and report results to Moodle. It greatly enhances the quiz with rich media and interactivity to help the learning process."
        }
    ],
    "tyn": [
        "Quiz Module in Moodle",
        " ",
        "http://docs.moodle.org/en/Quiz_module",
        "SCORM/AICC Module in Moodle",
        "http://docs.moodle.org/en/mod/scorm/index"
    ],
    "text": " Create Simple Quizzes with Quiz Module in Moodle Fortunately, Moodle already has a Quiz module allowing the instructors to design and set quizzes consisting of a large variety of Question types in the easiest way. With this module, creating a new quiz is just a two-step process. Create the quiz activity and set options to interact with the quiz. - Ensure your role in Moodle is switched to Course creator, Teacher or other editing roles; - Within the course you enrolled, click \"Turn editing on\" on the Administration panel; - On the exact week in outline, click \"Add an activity\", and select \"Quiz\" in the drop-down list; - Specify the Quiz options such as Name, Timing, Display & Attempts, and save. Edit the quiz and add specified questions from various question types. - In the created quiz, click \"Edit\" on the top navigation bar to edit the quiz detail; - Switch to the \"Questions\" section on second-level navigation; - In the \"Question Bank\", go to \"Create new question\", and choose the types you like. As the easiest way to create quizzes in Moodle quickly, Quiz module offers fundamental and flexible features to meet the practical requirements. Therefore, it may not support some advanced applications such as importing audio, customizing background or collecting results. Make Rich-Media Quizzes with SCORM/AICC Module in Moodle Besides the simple quizzes making, some instructors may need to build the assessments with multimedia, as well as results tracking and reporting. Upon these requirements, Flash quiz is the perfect solution with multimedia authoring. With SCORM/AICC module in Moodle which allows you to upload any standard SCORM package, you can easily create and incorporate a SCROM compliant Flash quiz in your course. Make Flash-based quizzes with SCORM compliance. - Make Flash quiz with some Flash authoring tools, such as Articulate QuizMaker]; - Create questions in different question types with these E-Assessment tools, or design Excel-based quizzes and output as Flash with tools; - Publish the quiz for LMS as specified SCORM compliant package. Add Flash quiz as SCORM compliant content into the course. - Ensure your role in Moodle is switched to Course creator, Teacher or other editing roles; - Within the course you enrolled, click \"Turn editing on\" on the Administration panel; - On the exact week in outline, click \"Add an activity\", and select \"SCORM/AICC\" in the drop-down list; - Specify the settings such as Name, and choose the SCORM compliant package to upload, then save the course. Finally, as you can see in the course contents as Student role, and the results report as Teacher role, the SCROM compliant Flash quiz can work well with and report results to Moodle. It greatly enhances the quiz with rich media and interactivity to help the learning process.",
    "sentences": [
        " Create Simple Quizzes with Quiz Module in Moodle Fortunately, Moodle already has a Quiz module allowing the instructors to design and set quizzes consisting of a large variety of Question types in the easiest way.",
        "With this module, creating a new quiz is just a two-step process.",
        "Create the quiz activity and set options to interact with the quiz.",
        "- Ensure your role in Moodle is switched to Course creator, Teacher or other editing roles; - Within the course you enrolled, click \"Turn editing on\" on the Administration panel; - On the exact week in outline, click \"Add an activity\", and select \"Quiz\" in the drop-down list; - Specify the Quiz options such as Name, Timing, Display & Attempts, and save.",
        "Edit the quiz and add specified questions from various question types.",
        "- In the created quiz, click \"Edit\" on the top navigation bar to edit the quiz detail; - Switch to the \"Questions\" section on second-level navigation; - In the \"Question Bank\", go to \"Create new question\", and choose the types you like.",
        "As the easiest way to create quizzes in Moodle quickly, Quiz module offers fundamental and flexible features to meet the practical requirements.",
        "Therefore, it may not support some advanced applications such as importing audio, customizing background or collecting results.",
        "Make Rich-Media Quizzes with SCORM/AICC Module in Moodle Besides the simple quizzes making, some instructors may need to build the assessments with multimedia, as well as results tracking and reporting.",
        "Upon these requirements, Flash quiz is the perfect solution with multimedia authoring.",
        "With SCORM/AICC module in Moodle which allows you to upload any standard SCORM package, you can easily create and incorporate a SCROM compliant Flash quiz in your course.",
        "Make Flash-based quizzes with SCORM compliance.",
        "- Make Flash quiz with some Flash authoring tools, such as Articulate QuizMaker]; - Create questions in different question types with these E-Assessment tools, or design Excel-based quizzes and output as Flash with tools; - Publish the quiz for LMS as specified SCORM compliant package.",
        "Add Flash quiz as SCORM compliant content into the course.",
        "- Ensure your role in Moodle is switched to Course creator, Teacher or other editing roles; - Within the course you enrolled, click \"Turn editing on\" on the Administration panel; - On the exact week in outline, click \"Add an activity\", and select \"SCORM/AICC\" in the drop-down list; - Specify the settings such as Name, and choose the SCORM compliant package to upload, then save the course.",
        "Finally, as you can see in the course contents as Student role, and the results report as Teacher role, the SCROM compliant Flash quiz can work well with and report results to Moodle.",
        "It greatly enhances the quiz with rich media and interactivity to help the learning process."
    ]
}