{
    "title": "How to Transfer Files from PC to PC",
    "url": "https://www.wikihow.com/Transfer-Files-from-PC-to-PC",
    "category_hierarchy": [
        "Computers and Electronics",
        "Basic Computer Skills"
    ],
    "methods": [
        {
            "name": "Transferring Files with a Removable Drive",
            "steps": [
                {
                    "headline": "Find or buy a removable hard drive that is compatible with your PC.",
                    "description": "Small hard drives up to 1 terabyte are available online and in most electronics departments at large box stores. It is best to keep a removable hard drive for backing up files, if you don’t have a cloud storage provider. Refrain from using the same backup drive as a way to occasionally transfer files from computer to computer. If you use cloud backup, check to see if you can download your files onto another computer by signing into a new computer. Some programs may not have this capability, while others may require verification of computers for security purposes."
                },
                {
                    "headline": "Use a small USB flash drive, if you want to transfer under 64 gigabytes (GB) worth of files to a different computer.",
                    "description": "This is ideal if your PCs are located far from each other. Flash drives are available at office supply stores, box stores and online for $5 to $50, depending on the size. In place of a USB drive, you can opt to burn the files onto a CD or DVD; however, unless you buy expensive rewritable discs, burning a disc filled with files will write the disc permanently. With removable hard drives and flash drives, you can delete and reuse the drive."
                },
                {
                    "headline": "Connect the drive.",
                    "description": "Double click on the removable drive when it pops up. You want it to be open in its own window. Disable software that comes with the removable hard drive, if you want to use it for this purpose. Some hard drives come with software that helps you back up your computer."
                },
                {
                    "headline": "Click on the Start menu on your Windows desktop.",
                    "description": "Navigate to the place where the files are located. If your files are haphazardly organized, now is a good time to organize them into files of similar genre and file type. It is easier to transfer folders than individual files."
                },
                {
                    "headline": "Drag the removable drive window and the file folder window side by side.",
                    "description": "This will allow you to click and drag the files from the computer to your drive."
                },
                {
                    "headline": "Click on the folder you want to transfer.",
                    "description": "Alternatively, you can click on the file name and drag each item individually."
                },
                {
                    "headline": "Drag it to the removable drive window.",
                    "description": "A small dialog box may pop up to tell you that are files are being transferred. For large files, it will tell you how long it will take to copy files."
                },
                {
                    "headline": "Repeat the procedure until all the files you want to transfer are copied to the removable drive.",
                    "description": ""
                },
                {
                    "headline": "Go to the removable drive window.",
                    "description": "Close it out. Go to My Computer and right click to eject the removable drive. Failure to eject the drive before removing it from the computer can result in the loss of some files."
                },
                {
                    "headline": "Plug the removable drive into the other PC using a USB cord or drive.",
                    "description": "Double click the drive window when the computer detects it."
                },
                {
                    "headline": "Drag the files onto your desktop or into a folder on your computer.",
                    "description": "You will want to arrange the folders side by side, just as you did before, to drag them onto your computer and into the correct location. If you choose to drag them onto your desktop, you can reorganize them into other folders later."
                }
            ]
        },
        {
            "name": "Transferring Files Via Network",
            "steps": [
                {
                    "headline": "Verify that your 2 PCs are on the same network.",
                    "description": "If you are using a wireless network, it must have very high speeds to make this an affective process. This option is best if you want to transfer files regularly between PCs, but not necessarily at the same time."
                },
                {
                    "headline": "Sign into the common network on both PCs.",
                    "description": ""
                },
                {
                    "headline": "Click on your Start Menu.",
                    "description": "Go to My Computer. Select your C drive, or hard drive, from the list of options."
                },
                {
                    "headline": "Right click on the drive and select “Properties.” You should also be able to select Properties from the File menu at the top.",
                    "description": ""
                },
                {
                    "headline": "Click on the Sharing tab in the Properties dialog box.",
                    "description": "Select the “Advanced Sharing” button."
                },
                {
                    "headline": "Check the box at the top that says “Share this Folder” or “Change Advanced Sharing Settings.” The option may change according to the version of Windows you are running.",
                    "description": ""
                },
                {
                    "headline": "Click “Apply” when you are done.",
                    "description": ""
                },
                {
                    "headline": "Log on to your other PC.",
                    "description": "Go to the Start menu and select “Network” in your list of default options."
                },
                {
                    "headline": "Look for your other PC on the list of connected computers.",
                    "description": "Double click on that computer. Type in your password to gain access. The password is what you use to log into the other computer."
                },
                {
                    "headline": "Find the files that have been deemed shareable on your other PC.",
                    "description": "Drag them onto your new PC to transfer."
                }
            ]
        }
    ],
    "tyn": [
        "Removable hard drive",
        "USB Flash drive",
        "Easy transfer cord"
    ],
    "text": " Transferring Files with a Removable Drive Find or buy a removable hard drive that is compatible with your PC. Small hard drives up to 1 terabyte are available online and in most electronics departments at large box stores. It is best to keep a removable hard drive for backing up files, if you don’t have a cloud storage provider. Refrain from using the same backup drive as a way to occasionally transfer files from computer to computer. If you use cloud backup, check to see if you can download your files onto another computer by signing into a new computer. Some programs may not have this capability, while others may require verification of computers for security purposes. Use a small USB flash drive, if you want to transfer under 64 gigabytes (GB) worth of files to a different computer. This is ideal if your PCs are located far from each other. Flash drives are available at office supply stores, box stores and online for $5 to $50, depending on the size. In place of a USB drive, you can opt to burn the files onto a CD or DVD; however, unless you buy expensive rewritable discs, burning a disc filled with files will write the disc permanently. With removable hard drives and flash drives, you can delete and reuse the drive. Connect the drive. Double click on the removable drive when it pops up. You want it to be open in its own window. Disable software that comes with the removable hard drive, if you want to use it for this purpose. Some hard drives come with software that helps you back up your computer. Click on the Start menu on your Windows desktop. Navigate to the place where the files are located. If your files are haphazardly organized, now is a good time to organize them into files of similar genre and file type. It is easier to transfer folders than individual files. Drag the removable drive window and the file folder window side by side. This will allow you to click and drag the files from the computer to your drive. Click on the folder you want to transfer. Alternatively, you can click on the file name and drag each item individually. Drag it to the removable drive window. A small dialog box may pop up to tell you that are files are being transferred. For large files, it will tell you how long it will take to copy files. Repeat the procedure until all the files you want to transfer are copied to the removable drive.  Go to the removable drive window. Close it out. Go to My Computer and right click to eject the removable drive. Failure to eject the drive before removing it from the computer can result in the loss of some files. Plug the removable drive into the other PC using a USB cord or drive. Double click the drive window when the computer detects it. Drag the files onto your desktop or into a folder on your computer. You will want to arrange the folders side by side, just as you did before, to drag them onto your computer and into the correct location. If you choose to drag them onto your desktop, you can reorganize them into other folders later. Transferring Files Via Network Verify that your 2 PCs are on the same network. If you are using a wireless network, it must have very high speeds to make this an affective process. This option is best if you want to transfer files regularly between PCs, but not necessarily at the same time. Sign into the common network on both PCs.  Click on your Start Menu. Go to My Computer. Select your C drive, or hard drive, from the list of options. Right click on the drive and select “Properties.” You should also be able to select Properties from the File menu at the top.  Click on the Sharing tab in the Properties dialog box. Select the “Advanced Sharing” button. Check the box at the top that says “Share this Folder” or “Change Advanced Sharing Settings.” The option may change according to the version of Windows you are running.  Click “Apply” when you are done.  Log on to your other PC. Go to the Start menu and select “Network” in your list of default options. Look for your other PC on the list of connected computers. Double click on that computer. Type in your password to gain access. The password is what you use to log into the other computer. Find the files that have been deemed shareable on your other PC. Drag them onto your new PC to transfer.",
    "sentences": [
        " Transferring Files with a Removable Drive Find or buy a removable hard drive that is compatible with your PC.",
        "Small hard drives up to 1 terabyte are available online and in most electronics departments at large box stores.",
        "It is best to keep a removable hard drive for backing up files, if you don’t have a cloud storage provider.",
        "Refrain from using the same backup drive as a way to occasionally transfer files from computer to computer.",
        "If you use cloud backup, check to see if you can download your files onto another computer by signing into a new computer.",
        "Some programs may not have this capability, while others may require verification of computers for security purposes.",
        "Use a small USB flash drive, if you want to transfer under 64 gigabytes (GB) worth of files to a different computer.",
        "This is ideal if your PCs are located far from each other.",
        "Flash drives are available at office supply stores, box stores and online for $5 to $50, depending on the size.",
        "In place of a USB drive, you can opt to burn the files onto a CD or DVD; however, unless you buy expensive rewritable discs, burning a disc filled with files will write the disc permanently.",
        "With removable hard drives and flash drives, you can delete and reuse the drive.",
        "Connect the drive.",
        "Double click on the removable drive when it pops up.",
        "You want it to be open in its own window.",
        "Disable software that comes with the removable hard drive, if you want to use it for this purpose.",
        "Some hard drives come with software that helps you back up your computer.",
        "Click on the Start menu on your Windows desktop.",
        "Navigate to the place where the files are located.",
        "If your files are haphazardly organized, now is a good time to organize them into files of similar genre and file type.",
        "It is easier to transfer folders than individual files.",
        "Drag the removable drive window and the file folder window side by side.",
        "This will allow you to click and drag the files from the computer to your drive.",
        "Click on the folder you want to transfer.",
        "Alternatively, you can click on the file name and drag each item individually.",
        "Drag it to the removable drive window.",
        "A small dialog box may pop up to tell you that are files are being transferred.",
        "For large files, it will tell you how long it will take to copy files.",
        "Repeat the procedure until all the files you want to transfer are copied to the removable drive.",
        "Go to the removable drive window.",
        "Close it out.",
        "Go to My Computer and right click to eject the removable drive.",
        "Failure to eject the drive before removing it from the computer can result in the loss of some files.",
        "Plug the removable drive into the other PC using a USB cord or drive.",
        "Double click the drive window when the computer detects it.",
        "Drag the files onto your desktop or into a folder on your computer.",
        "You will want to arrange the folders side by side, just as you did before, to drag them onto your computer and into the correct location.",
        "If you choose to drag them onto your desktop, you can reorganize them into other folders later.",
        "Transferring Files Via Network Verify that your 2 PCs are on the same network.",
        "If you are using a wireless network, it must have very high speeds to make this an affective process.",
        "This option is best if you want to transfer files regularly between PCs, but not necessarily at the same time.",
        "Sign into the common network on both PCs.",
        "Click on your Start Menu.",
        "Go to My Computer.",
        "Select your C drive, or hard drive, from the list of options.",
        "Right click on the drive and select “Properties.” You should also be able to select Properties from the File menu at the top.",
        "Click on the Sharing tab in the Properties dialog box.",
        "Select the “Advanced Sharing” button.",
        "Check the box at the top that says “Share this Folder” or “Change Advanced Sharing Settings.” The option may change according to the version of Windows you are running.",
        "Click “Apply” when you are done.",
        "Log on to your other PC.",
        "Go to the Start menu and select “Network” in your list of default options.",
        "Look for your other PC on the list of connected computers.",
        "Double click on that computer.",
        "Type in your password to gain access.",
        "The password is what you use to log into the other computer.",
        "Find the files that have been deemed shareable on your other PC.",
        "Drag them onto your new PC to transfer."
    ]
}