{
    "title": "How to Level a Bumpy Lawn",
    "url": "https://www.wikihow.com/Level-a-Bumpy-Lawn",
    "category_hierarchy": [
        "Home and Garden",
        "Yard and Outdoors",
        "Lawn Care",
        "Lawn Problems"
    ],
    "methods": [
        {
            "name": "Flattening Mounds with a Garden Roller",
            "steps": [
                {
                    "headline": "Roll your lawn once a year to avoid over-compacting your soil.",
                    "description": "Rolling your lawn compacts the soil and makes it more difficult for roots to grow if it’s overdone. Only roll your lawn once a year in the spring to prepare for the rest of the growing season. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJeremy Yamaguchi\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLawn Care Specialist & CEO of Lawn Love\t\t\t\t\t\t\t\tJeremy Yamaguchi is a Lawn Care Specialist and the Founder/CEO of Lawn Love, a digital marketplace for lawn care and gardening services. Jeremy provides instant satellite quotes and can coordinate service from a smartphone or web browser. The company has raised funding from notable investors like Y Combinator, Joe Montana, Alexis Ohanian, Barbara Corcoran and others. Jeremy Yamaguchi\t\t\tLawn Care Specialist & CEO of Lawn Love\t\t\t\tDid You Know? There are several reasons lawns can be bumpy. You might have drainage problems like broken water or irrigation pipes that are causing erosion. How you treat the lawn depends on those causes."
                },
                {
                    "headline": "Buy or rent a garden roller from a garden supply store.",
                    "description": "Garden rollers are large cylinders that you can pull across your lawn to flatten any spots that are too tall. Check your local gardening or landscaping stores to see what types of rollers that have. See if the store allows you to rent a roller for a day so you don’t have to buy it. Steel garden rollers are heavier and will flatten your lawn better, but they’re harder to maneuver. Polyurethane rollers are lighter and easier to move around, but they are less durable and could get punctured.Tip: You can get garden rollers that attach to a riding lawn mower if you have a large yard or you can get one that you can pull by hand."
                },
                {
                    "headline": "Water your lawn before you roll it.",
                    "description": "Use a sprinkler attachment on your garden hose to wet your grass. The water will help loosen up the soil to make it easier to roll and flatten. Run the sprinkler on your lawn for about 20-30 minutes so your lawn doesn’t get too wet. Don’t overwater your lawn since it could get muddy."
                },
                {
                    "headline": "Fill the roller barrel with water.",
                    "description": "Garden rollers are hollow so you can transport them easily, but they need to be filled so they can press down on your lawn. Turn the roller on its side so the fill hole points up, and use your hose to fill it with water. Once it’s half-full, you can stop so it’s easier to pull around your yard. Otherwise, you can fill it to the top to get the most weight. You can also use sand inside the roller if you want. Refer to the instruction manual if you have trouble locating the fill hole on your roller."
                },
                {
                    "headline": "Pull the roller across your lawn in long strips.",
                    "description": "Start at the end of lawn furthest from your home. Slowly walk across the length of your lawn and pull the roller behind you to flatten the lawn. When you reach the other end of your lawn, turn the roller around and start a new strip that slightly overlaps the first one. Keep working across your lawn until you’ve rolled it completely. If it’s easier, you can try pushing the roller in front of you. Take breaks frequently so you don’t get sore or worn out."
                },
                {
                    "headline": "Remove grass from large bumps if they aren’t flattened the first time.",
                    "description": "Walk over your lawn after you’ve rolled it to see if there are still any mounds left. If there are, use a shovel to dig them out since they won’t flatten with a roller. Dig out enough of the mound until it’s level with the rest of your lawn and tamp it down with the back of your shovel. Mounds that don’t flatten out with the roller are usually compacted and need to be removed by hand. You may need to reseed any mounds you removed."
                },
                {
                    "headline": "Aerate your lawn to let in air and water.",
                    "description": "Aerating your lawn helps water and air get into compacted soil so your plants can easily grow. Poke the end of a garden fork 4 inches (10 cm) into the ground and rock it slightly back and forth to loosen the soil. Work your way across your lawn until it’s completely aerated. You can also buy or rent a gas-powered aerator to make the job quicker."
                }
            ]
        },
        {
            "name": "Top-Dressing Your Lawn",
            "steps": [
                {
                    "headline": "Fill in low spots in your lawn in the fall or spring.",
                    "description": "Pick a few days at the beginning of the fall or spring when the weather is mild to top-dress your lawn. Work 3-4 weeks before the severe heat of summer or the cold of winter so your grass has time to grow. You can fill in low spots all at once or you can work in small sections of your yard."
                },
                {
                    "headline": "Check your yard for drainage issues or broken pipes.",
                    "description": "Sometimes, drainage problems or damaged pipes could cause your lawn to be uneven. Look for areas where water pools near pipes and hire a professional to come inspect them if you suspect that they’re broken or damaged. If you’re not sure where water lines run, contact your city’s water department to help you locate them. Do not try to level your lawn if you suspect and underlying issues."
                },
                {
                    "headline": "Break apart lawn soil in a wheelbarrow.",
                    "description": "Get a bag of lawn soil that contains sand, soil, and compost from your local gardening or landscaping store and empty it into a wheelbarrow. Use a rake to sift through the soil and break apart any clumps larger than ⁄4 in (0.64 cm) so you can spread it on your lawn evenly.Tip: You can also mix your own top-dressing with equal parts of sharp sand, topsoil, and peat."
                },
                {
                    "headline": "Water your lawn to loosen up the soil.",
                    "description": "Use a hose attachment with a shower option to lightly water your lawn. The water will help your soil settle so you can see the depth of the holes you need to fill. Make sure the soil feels soft underneath your grass instead of hard and dry. Don’t overwater your lawn since it will be hard to work with when it’s too wet."
                },
                {
                    "headline": "Remove the grass if the hole is deeper than 2–3 in (5.1–7.6 cm).",
                    "description": "Deep soil that’s covering grass can cause decay and harm the rest of your lawn. Measure the depths of your holes to see if they are deeper than 2–3 inches (5.1–7.6 cm). If they are, use a shovel to remove the grass from the surface so you can lay the soil down. If the hole is shallower than 2 inches (5.1 cm), then you can put soil directly on the grass. Save the grass if you can because you may be able to replant it when you’re finished filling in the holes."
                },
                {
                    "headline": "Shovel the lawn soil into the holes in your lawn.",
                    "description": "Start on an area of your lawn that’s 2–3 square feet (0.19–0.28 m) and spread a few shovelfuls of the soil from your wheelbarrow. Try to spread the soil evenly across the holes in the area. Tamp the dirt into the holes with the back of your shovel. You can top-dress your entire lawn if you want, or you can just choose a few areas to fill in."
                },
                {
                    "headline": "Spread the soil evenly with a garden rake.",
                    "description": "Alternate between using the pronged side of the rake and the flat edge on the back to spread the soil. Make sure it’s flat across the area so all of the holes are filled completely. Keep working the soil throughout your entire lawn until you can see the grass through the soil. Make sure your layer of top dressing is less than 1 in (2.5 cm) thick or else it could cause your existing grass to die."
                },
                {
                    "headline": "Water the soil and let the topsoil settle for 1-2 days.",
                    "description": "When you’re finished spreading out the soil, water the area thoroughly so the soil can settle into the holes. Leave your yard alone for 1-2 days before inspecting it again to see if it’s still level. If your lawn still isn’t level, then use more soil to fill in the holes again."
                },
                {
                    "headline": "Replant grass in any bare spots if you need to.",
                    "description": "Look for any bare spots in your lawn where you had to remove your grass. Try fitting the old grass on the spot and pressing it down so the roots easily come into contact with the soil. If the grass doesn’t fit, you may have to plant new seeds. You can also fill in any bare spots with sod if you don’t want to grow grass from seeds. Look for grass that’s the same type as the rest of your lawn so your yard looks uniform."
                },
                {
                    "headline": "Check the level of your lawn with a wooden board and level.",
                    "description": "Once the soil is settled after you top-dress your lawn, lay a long 2 in × 4 in (5.1 cm × 10.2 cm) board across the area you flattened. Set a level on top of the board to see if the lawn is flat. Make sure the bubble is in the center of the tube on your level. If it isn’t, then fill in your lawn with more top-dressing. Make sure your board spans the entire area you leveled, or else you may get an inaccurate reading."
                }
            ]
        }
    ],
    "tyn": [
        "Flattening Mounds with a Garden Roller",
        "Garden roller",
        "Sand or garden hose",
        "Shovel",
        "Garden fork",
        "Top-Dressing Your Lawn",
        "Lawn soil",
        "Wheelbarrow",
        "Rake",
        "Garden hose",
        "Grass seed",
        "2 in × 4 in (5.1 cm × 10.2 cm) lumber, as long as possible",
        "Level"
    ],
    "text": " Flattening Mounds with a Garden Roller Roll your lawn once a year to avoid over-compacting your soil. Rolling your lawn compacts the soil and makes it more difficult for roots to grow if it’s overdone. Only roll your lawn once a year in the spring to prepare for the rest of the growing season. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJeremy Yamaguchi\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLawn Care Specialist & CEO of Lawn Love\t\t\t\t\t\t\t\tJeremy Yamaguchi is a Lawn Care Specialist and the Founder/CEO of Lawn Love, a digital marketplace for lawn care and gardening services. Jeremy provides instant satellite quotes and can coordinate service from a smartphone or web browser. The company has raised funding from notable investors like Y Combinator, Joe Montana, Alexis Ohanian, Barbara Corcoran and others. Jeremy Yamaguchi\t\t\tLawn Care Specialist & CEO of Lawn Love\t\t\t\tDid You Know? There are several reasons lawns can be bumpy. You might have drainage problems like broken water or irrigation pipes that are causing erosion. How you treat the lawn depends on those causes. Buy or rent a garden roller from a garden supply store. Garden rollers are large cylinders that you can pull across your lawn to flatten any spots that are too tall. Check your local gardening or landscaping stores to see what types of rollers that have. See if the store allows you to rent a roller for a day so you don’t have to buy it. Steel garden rollers are heavier and will flatten your lawn better, but they’re harder to maneuver. Polyurethane rollers are lighter and easier to move around, but they are less durable and could get punctured.Tip: You can get garden rollers that attach to a riding lawn mower if you have a large yard or you can get one that you can pull by hand. Water your lawn before you roll it. Use a sprinkler attachment on your garden hose to wet your grass. The water will help loosen up the soil to make it easier to roll and flatten. Run the sprinkler on your lawn for about 20-30 minutes so your lawn doesn’t get too wet. Don’t overwater your lawn since it could get muddy. Fill the roller barrel with water. Garden rollers are hollow so you can transport them easily, but they need to be filled so they can press down on your lawn. Turn the roller on its side so the fill hole points up, and use your hose to fill it with water. Once it’s half-full, you can stop so it’s easier to pull around your yard. Otherwise, you can fill it to the top to get the most weight. You can also use sand inside the roller if you want. Refer to the instruction manual if you have trouble locating the fill hole on your roller. Pull the roller across your lawn in long strips. Start at the end of lawn furthest from your home. Slowly walk across the length of your lawn and pull the roller behind you to flatten the lawn. When you reach the other end of your lawn, turn the roller around and start a new strip that slightly overlaps the first one. Keep working across your lawn until you’ve rolled it completely. If it’s easier, you can try pushing the roller in front of you. Take breaks frequently so you don’t get sore or worn out. Remove grass from large bumps if they aren’t flattened the first time. Walk over your lawn after you’ve rolled it to see if there are still any mounds left. If there are, use a shovel to dig them out since they won’t flatten with a roller. Dig out enough of the mound until it’s level with the rest of your lawn and tamp it down with the back of your shovel. Mounds that don’t flatten out with the roller are usually compacted and need to be removed by hand. You may need to reseed any mounds you removed. Aerate your lawn to let in air and water. Aerating your lawn helps water and air get into compacted soil so your plants can easily grow. Poke the end of a garden fork 4 inches (10 cm) into the ground and rock it slightly back and forth to loosen the soil. Work your way across your lawn until it’s completely aerated. You can also buy or rent a gas-powered aerator to make the job quicker. Top-Dressing Your Lawn Fill in low spots in your lawn in the fall or spring. Pick a few days at the beginning of the fall or spring when the weather is mild to top-dress your lawn. Work 3-4 weeks before the severe heat of summer or the cold of winter so your grass has time to grow. You can fill in low spots all at once or you can work in small sections of your yard. Check your yard for drainage issues or broken pipes. Sometimes, drainage problems or damaged pipes could cause your lawn to be uneven. Look for areas where water pools near pipes and hire a professional to come inspect them if you suspect that they’re broken or damaged. If you’re not sure where water lines run, contact your city’s water department to help you locate them. Do not try to level your lawn if you suspect and underlying issues. Break apart lawn soil in a wheelbarrow. Get a bag of lawn soil that contains sand, soil, and compost from your local gardening or landscaping store and empty it into a wheelbarrow. Use a rake to sift through the soil and break apart any clumps larger than ⁄4 in (0.64 cm) so you can spread it on your lawn evenly.Tip: You can also mix your own top-dressing with equal parts of sharp sand, topsoil, and peat. Water your lawn to loosen up the soil. Use a hose attachment with a shower option to lightly water your lawn. The water will help your soil settle so you can see the depth of the holes you need to fill. Make sure the soil feels soft underneath your grass instead of hard and dry. Don’t overwater your lawn since it will be hard to work with when it’s too wet. Remove the grass if the hole is deeper than 2–3 in (5.1–7.6 cm). Deep soil that’s covering grass can cause decay and harm the rest of your lawn. Measure the depths of your holes to see if they are deeper than 2–3 inches (5.1–7.6 cm). If they are, use a shovel to remove the grass from the surface so you can lay the soil down. If the hole is shallower than 2 inches (5.1 cm), then you can put soil directly on the grass. Save the grass if you can because you may be able to replant it when you’re finished filling in the holes. Shovel the lawn soil into the holes in your lawn. Start on an area of your lawn that’s 2–3 square feet (0.19–0.28 m) and spread a few shovelfuls of the soil from your wheelbarrow. Try to spread the soil evenly across the holes in the area. Tamp the dirt into the holes with the back of your shovel. You can top-dress your entire lawn if you want, or you can just choose a few areas to fill in. Spread the soil evenly with a garden rake. Alternate between using the pronged side of the rake and the flat edge on the back to spread the soil. Make sure it’s flat across the area so all of the holes are filled completely. Keep working the soil throughout your entire lawn until you can see the grass through the soil. Make sure your layer of top dressing is less than 1 in (2.5 cm) thick or else it could cause your existing grass to die. Water the soil and let the topsoil settle for 1-2 days. When you’re finished spreading out the soil, water the area thoroughly so the soil can settle into the holes. Leave your yard alone for 1-2 days before inspecting it again to see if it’s still level. If your lawn still isn’t level, then use more soil to fill in the holes again. Replant grass in any bare spots if you need to. Look for any bare spots in your lawn where you had to remove your grass. Try fitting the old grass on the spot and pressing it down so the roots easily come into contact with the soil. If the grass doesn’t fit, you may have to plant new seeds. You can also fill in any bare spots with sod if you don’t want to grow grass from seeds. Look for grass that’s the same type as the rest of your lawn so your yard looks uniform. Check the level of your lawn with a wooden board and level. Once the soil is settled after you top-dress your lawn, lay a long 2 in × 4 in (5.1 cm × 10.2 cm) board across the area you flattened. Set a level on top of the board to see if the lawn is flat. Make sure the bubble is in the center of the tube on your level. If it isn’t, then fill in your lawn with more top-dressing. Make sure your board spans the entire area you leveled, or else you may get an inaccurate reading.",
    "sentences": [
        " Flattening Mounds with a Garden Roller Roll your lawn once a year to avoid over-compacting your soil.",
        "Rolling your lawn compacts the soil and makes it more difficult for roots to grow if it’s overdone.",
        "Only roll your lawn once a year in the spring to prepare for the rest of the growing season.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJeremy Yamaguchi\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLawn Care Specialist & CEO of Lawn Love\t\t\t\t\t\t\t\tJeremy Yamaguchi is a Lawn Care Specialist and the Founder/CEO of Lawn Love, a digital marketplace for lawn care and gardening services.",
        "Jeremy provides instant satellite quotes and can coordinate service from a smartphone or web browser.",
        "The company has raised funding from notable investors like Y Combinator, Joe Montana, Alexis Ohanian, Barbara Corcoran and others.",
        "Jeremy Yamaguchi\t\t\tLawn Care Specialist & CEO of Lawn Love\t\t\t\tDid You Know?",
        "There are several reasons lawns can be bumpy.",
        "You might have drainage problems like broken water or irrigation pipes that are causing erosion.",
        "How you treat the lawn depends on those causes.",
        "Buy or rent a garden roller from a garden supply store.",
        "Garden rollers are large cylinders that you can pull across your lawn to flatten any spots that are too tall.",
        "Check your local gardening or landscaping stores to see what types of rollers that have.",
        "See if the store allows you to rent a roller for a day so you don’t have to buy it.",
        "Steel garden rollers are heavier and will flatten your lawn better, but they’re harder to maneuver.",
        "Polyurethane rollers are lighter and easier to move around, but they are less durable and could get punctured.Tip: You can get garden rollers that attach to a riding lawn mower if you have a large yard or you can get one that you can pull by hand.",
        "Water your lawn before you roll it.",
        "Use a sprinkler attachment on your garden hose to wet your grass.",
        "The water will help loosen up the soil to make it easier to roll and flatten.",
        "Run the sprinkler on your lawn for about 20-30 minutes so your lawn doesn’t get too wet.",
        "Don’t overwater your lawn since it could get muddy.",
        "Fill the roller barrel with water.",
        "Garden rollers are hollow so you can transport them easily, but they need to be filled so they can press down on your lawn.",
        "Turn the roller on its side so the fill hole points up, and use your hose to fill it with water.",
        "Once it’s half-full, you can stop so it’s easier to pull around your yard.",
        "Otherwise, you can fill it to the top to get the most weight.",
        "You can also use sand inside the roller if you want.",
        "Refer to the instruction manual if you have trouble locating the fill hole on your roller.",
        "Pull the roller across your lawn in long strips.",
        "Start at the end of lawn furthest from your home.",
        "Slowly walk across the length of your lawn and pull the roller behind you to flatten the lawn.",
        "When you reach the other end of your lawn, turn the roller around and start a new strip that slightly overlaps the first one.",
        "Keep working across your lawn until you’ve rolled it completely.",
        "If it’s easier, you can try pushing the roller in front of you.",
        "Take breaks frequently so you don’t get sore or worn out.",
        "Remove grass from large bumps if they aren’t flattened the first time.",
        "Walk over your lawn after you’ve rolled it to see if there are still any mounds left.",
        "If there are, use a shovel to dig them out since they won’t flatten with a roller.",
        "Dig out enough of the mound until it’s level with the rest of your lawn and tamp it down with the back of your shovel.",
        "Mounds that don’t flatten out with the roller are usually compacted and need to be removed by hand.",
        "You may need to reseed any mounds you removed.",
        "Aerate your lawn to let in air and water.",
        "Aerating your lawn helps water and air get into compacted soil so your plants can easily grow.",
        "Poke the end of a garden fork 4 inches (10 cm) into the ground and rock it slightly back and forth to loosen the soil.",
        "Work your way across your lawn until it’s completely aerated.",
        "You can also buy or rent a gas-powered aerator to make the job quicker.",
        "Top-Dressing Your Lawn Fill in low spots in your lawn in the fall or spring.",
        "Pick a few days at the beginning of the fall or spring when the weather is mild to top-dress your lawn.",
        "Work 3-4 weeks before the severe heat of summer or the cold of winter so your grass has time to grow.",
        "You can fill in low spots all at once or you can work in small sections of your yard.",
        "Check your yard for drainage issues or broken pipes.",
        "Sometimes, drainage problems or damaged pipes could cause your lawn to be uneven.",
        "Look for areas where water pools near pipes and hire a professional to come inspect them if you suspect that they’re broken or damaged.",
        "If you’re not sure where water lines run, contact your city’s water department to help you locate them.",
        "Do not try to level your lawn if you suspect and underlying issues.",
        "Break apart lawn soil in a wheelbarrow.",
        "Get a bag of lawn soil that contains sand, soil, and compost from your local gardening or landscaping store and empty it into a wheelbarrow.",
        "Use a rake to sift through the soil and break apart any clumps larger than ⁄4 in (0.64 cm) so you can spread it on your lawn evenly.Tip: You can also mix your own top-dressing with equal parts of sharp sand, topsoil, and peat.",
        "Water your lawn to loosen up the soil.",
        "Use a hose attachment with a shower option to lightly water your lawn.",
        "The water will help your soil settle so you can see the depth of the holes you need to fill.",
        "Make sure the soil feels soft underneath your grass instead of hard and dry.",
        "Don’t overwater your lawn since it will be hard to work with when it’s too wet.",
        "Remove the grass if the hole is deeper than 2–3 in (5.1–7.6 cm).",
        "Deep soil that’s covering grass can cause decay and harm the rest of your lawn.",
        "Measure the depths of your holes to see if they are deeper than 2–3 inches (5.1–7.6 cm).",
        "If they are, use a shovel to remove the grass from the surface so you can lay the soil down.",
        "If the hole is shallower than 2 inches (5.1 cm), then you can put soil directly on the grass.",
        "Save the grass if you can because you may be able to replant it when you’re finished filling in the holes.",
        "Shovel the lawn soil into the holes in your lawn.",
        "Start on an area of your lawn that’s 2–3 square feet (0.19–0.28 m) and spread a few shovelfuls of the soil from your wheelbarrow.",
        "Try to spread the soil evenly across the holes in the area.",
        "Tamp the dirt into the holes with the back of your shovel.",
        "You can top-dress your entire lawn if you want, or you can just choose a few areas to fill in.",
        "Spread the soil evenly with a garden rake.",
        "Alternate between using the pronged side of the rake and the flat edge on the back to spread the soil.",
        "Make sure it’s flat across the area so all of the holes are filled completely.",
        "Keep working the soil throughout your entire lawn until you can see the grass through the soil.",
        "Make sure your layer of top dressing is less than 1 in (2.5 cm) thick or else it could cause your existing grass to die.",
        "Water the soil and let the topsoil settle for 1-2 days.",
        "When you’re finished spreading out the soil, water the area thoroughly so the soil can settle into the holes.",
        "Leave your yard alone for 1-2 days before inspecting it again to see if it’s still level.",
        "If your lawn still isn’t level, then use more soil to fill in the holes again.",
        "Replant grass in any bare spots if you need to.",
        "Look for any bare spots in your lawn where you had to remove your grass.",
        "Try fitting the old grass on the spot and pressing it down so the roots easily come into contact with the soil.",
        "If the grass doesn’t fit, you may have to plant new seeds.",
        "You can also fill in any bare spots with sod if you don’t want to grow grass from seeds.",
        "Look for grass that’s the same type as the rest of your lawn so your yard looks uniform.",
        "Check the level of your lawn with a wooden board and level.",
        "Once the soil is settled after you top-dress your lawn, lay a long 2 in × 4 in (5.1 cm × 10.2 cm) board across the area you flattened.",
        "Set a level on top of the board to see if the lawn is flat.",
        "Make sure the bubble is in the center of the tube on your level.",
        "If it isn’t, then fill in your lawn with more top-dressing.",
        "Make sure your board spans the entire area you leveled, or else you may get an inaccurate reading."
    ]
}