{
    "title": "How to Steam an Egg",
    "url": "https://www.wikihow.com/Steam-an-Egg",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills",
        "Steaming Food"
    ],
    "methods": [
        {
            "name": "Steaming an Egg in a Steamer Basket",
            "steps": [
                {
                    "headline": "Add about ⁄2 inch (1.3 cm) of water to a pot.",
                    "description": "Placing your pot under the kitchen sink is the easiest way to get the amount of water you need. You can also put some water in a pitcher and pour it into your pot. Remember, the water doesn't need to cover your eggs at all. You only need enough water to create steam inside your pot. It's perfectly OK to eyeball ⁄2 inch (1.3 cm) of water. Slightly more or slightly less won't hurt the steaming process. A metal colander works the same as a steamer basket."
                },
                {
                    "headline": "Turn your stove to high heat and bring the water to a rapid boil.",
                    "description": "To start, place a lid on the pot. Then, put the pot on the stove. You'll need the proper lid for the pot you're using to hold the steam inside of it. This is vital for success when it comes to steaming eggs. You can remove the pot lid after a few minutes to make sure the water's boiling and creating lots of steam."
                },
                {
                    "headline": "Fill your metal steamer basket with eggs.",
                    "description": "You can place one egg gently in the steamer basket or as many as will fit. You can steam one egg for breakfast or a quick snack, or steam a bunch of eggs to keep on hand for later. A little bit of water visible in the bottom of your steamer basket won't interfere with steaming your eggs."
                },
                {
                    "headline": "Lower the steamer basket into your pot.",
                    "description": "Then, place the lid back on the pot to hold in the steam. Reduce the heat to medium, which keeps your water from drying up. If you're concerned that the steam might be too hot, consider putting on a pair of oven mitts to protect your hands and lower arms as you lower the steamer basket or colander into the pot."
                },
                {
                    "headline": "Set your timer for 6-12 minutes.",
                    "description": "You should set the timer to 6 minutes for a soft boil and 12 minutes for a hard boil. You can keep track of your steaming time by monitoring your kitchen clock. Ideally, it's a good idea to use a timer with an alarm, in case you get distracted. At this point, you want to rely on your timer and avoid opening the pot to check the eggs. Letting out the steam while the eggs are in the pot can interfere with the steaming process."
                },
                {
                    "headline": "Remove the egg from the pot to cool.",
                    "description": "Place the egg in a bowl of cold water. If you want your egg to be cold, you can prepare a bath of ice cubes and water. Cooling the egg stops the cooking process and keeps the egg yolk from getting harder than you want. You should cool down the egg enough to peel without burning your fingers."
                },
                {
                    "headline": "Remove the eggshell.",
                    "description": "Start by tapping the steamed egg on your countertop gently. Then, run your thumb under the crack and flick upwards. This loosens the shell and makes it easy to take off. You can remove the shell of a properly steamed egg with one hand. The egg white should be perfectly smooth and show no gouges. Serve a cold steamed egg as a salad ingredient or a warm steamed egg alongside a piece of buttered toast. Steamed eggs keep in your refrigerator for up to 5 days."
                }
            ]
        },
        {
            "name": "Steaming an Egg without a Steamer Basket",
            "steps": [
                {
                    "headline": "Boil a small amount of water in a pot.",
                    "description": "Using your pinkie finger as a guide, measure enough water to reach the bottom of your fingernail. Cover the pot with a lid. Then, turn the stove to high heat and place the pot on the stove. Bring the water to a rapid boil. The good news is that you don't have to go out and buy a steamer basket to steam eggs if you don't have one. Placing your eggs in steam rather than cold water allows for a bit more precision when it comes to setting your cooking time. Remember to keep the pot on the stove over heat throughout the entire steaming process."
                },
                {
                    "headline": "Remove the lid and place your egg in the pot.",
                    "description": "You can steam as many eggs as you like in a pot using this method. For example, you can steam one egg or even a dozen. The number of eggs you steam at a time depends on the size of your pot. Don't worry—the boiling water touching one side of your egg doesn't change how the steam works."
                },
                {
                    "headline": "Place the lid back on the pot to steam the egg.",
                    "description": "The properly closed lid ensures that the pot will fill with steam which is necessary for perfect cooking. A properly placed lid also makes for more precise cooking times. At this point, you can reduce the heat under your pot to medium-high. This keeps the water from completely evaporating before you're done steaming your egg."
                },
                {
                    "headline": "Set the timer for around 6-12 minutes.",
                    "description": "You can use the same amount of time as you would using a steamer basket—around 6 minutes for a soft boil and around 12 minutes for a hard boil. Turn off the stove when the timer goes off. Use a timer that you'll be able to hear. For example, the timer on your cellphone might not be loud enough, especially if you turned the volume down."
                },
                {
                    "headline": "Run cold water in a mixing bowl to cool your eggs.",
                    "description": "Place the steamed eggs in the bowl. You can add ice cubes to the water if you want your eggs to be cold rather than cool. Placing the eggs in cold water stops the cooking process. Because steam is so hot, forgetting to stop the cooking process right away can result in hard, rubbery eggs. Cooling the eggs after steaming also makes them easier to peel and serve immediately after cooking."
                }
            ]
        },
        {
            "name": "Steaming an Egg in an Instant Pot",
            "steps": [
                {
                    "headline": "Pour 1 cup (240 mL) of water in the bottom of your Instant Pot.",
                    "description": "You need at least that much water to activate the pot's pressure function. An Instant Pot works like a pressure cooker. The precision with which it uses steam to cook food ensures properly steamed eggs in a short amount of time. Confirm that your Instant Pot is plugged in before steaming your eggs."
                },
                {
                    "headline": "Place the metal basket in the bottom of your Instant Pot.",
                    "description": "The metal basket—called a trivet—looks like a steamer basket. Then, fill the metal basket with eggs. As with other egg steaming methods, it doesn't matter if a bit of water touches the eggs. You can pile in as many eggs as will fit in your Instant Pot."
                },
                {
                    "headline": "Close your Instant Pot and set it to seal to steam your egg.",
                    "description": "Choose the steam function from the pot's front panel. Also, set the timer on the panel. Choose 3 minutes for soft-boiled eggs and 6 minutes for hard-boiled eggs. Consider experimenting within the recommended steaming time ranges to get an egg that suits your palate. For example, you might find that setting the timer to 4 minutes or even 7 minutes results in an egg that's just perfect for you. While waiting for your eggs to steam, add water to a bowl to stop the cooking process. And, don't forget to add ice cubes if you want your eggs chilled."
                },
                {
                    "headline": "Remove your steamed egg from the Instant Pot.",
                    "description": "When the timer goes off and pot switches to \"Keep Warm\" mode, release the pressure by setting the pot to Venting. You can open the pot once the steam finishes releasing. Place the egg in the cold or ice water to stop the cooking process. You can leave the eggs in your Instant Pot on Keep Warm mode. Just keep in mind that they do continue cooking, which you might not want, depending on how soft or hard you like your egg."
                }
            ]
        }
    ],
    "tyn": [
        "Saucepan or pot with lid",
        "Metal steamer basket",
        "Metal colander, optional",
        "Bamboo steamer, optional",
        "Instant Pot, optional",
        "Cooking timer"
    ],
    "text": " Steaming an Egg in a Steamer Basket Add about ⁄2 inch (1.3 cm) of water to a pot. Placing your pot under the kitchen sink is the easiest way to get the amount of water you need. You can also put some water in a pitcher and pour it into your pot. Remember, the water doesn't need to cover your eggs at all. You only need enough water to create steam inside your pot. It's perfectly OK to eyeball ⁄2 inch (1.3 cm) of water. Slightly more or slightly less won't hurt the steaming process. A metal colander works the same as a steamer basket. Turn your stove to high heat and bring the water to a rapid boil. To start, place a lid on the pot. Then, put the pot on the stove. You'll need the proper lid for the pot you're using to hold the steam inside of it. This is vital for success when it comes to steaming eggs. You can remove the pot lid after a few minutes to make sure the water's boiling and creating lots of steam. Fill your metal steamer basket with eggs. You can place one egg gently in the steamer basket or as many as will fit. You can steam one egg for breakfast or a quick snack, or steam a bunch of eggs to keep on hand for later. A little bit of water visible in the bottom of your steamer basket won't interfere with steaming your eggs. Lower the steamer basket into your pot. Then, place the lid back on the pot to hold in the steam. Reduce the heat to medium, which keeps your water from drying up. If you're concerned that the steam might be too hot, consider putting on a pair of oven mitts to protect your hands and lower arms as you lower the steamer basket or colander into the pot. Set your timer for 6-12 minutes. You should set the timer to 6 minutes for a soft boil and 12 minutes for a hard boil. You can keep track of your steaming time by monitoring your kitchen clock. Ideally, it's a good idea to use a timer with an alarm, in case you get distracted. At this point, you want to rely on your timer and avoid opening the pot to check the eggs. Letting out the steam while the eggs are in the pot can interfere with the steaming process. Remove the egg from the pot to cool. Place the egg in a bowl of cold water. If you want your egg to be cold, you can prepare a bath of ice cubes and water. Cooling the egg stops the cooking process and keeps the egg yolk from getting harder than you want. You should cool down the egg enough to peel without burning your fingers. Remove the eggshell. Start by tapping the steamed egg on your countertop gently. Then, run your thumb under the crack and flick upwards. This loosens the shell and makes it easy to take off. You can remove the shell of a properly steamed egg with one hand. The egg white should be perfectly smooth and show no gouges. Serve a cold steamed egg as a salad ingredient or a warm steamed egg alongside a piece of buttered toast. Steamed eggs keep in your refrigerator for up to 5 days. Steaming an Egg without a Steamer Basket Boil a small amount of water in a pot. Using your pinkie finger as a guide, measure enough water to reach the bottom of your fingernail. Cover the pot with a lid. Then, turn the stove to high heat and place the pot on the stove. Bring the water to a rapid boil. The good news is that you don't have to go out and buy a steamer basket to steam eggs if you don't have one. Placing your eggs in steam rather than cold water allows for a bit more precision when it comes to setting your cooking time. Remember to keep the pot on the stove over heat throughout the entire steaming process. Remove the lid and place your egg in the pot. You can steam as many eggs as you like in a pot using this method. For example, you can steam one egg or even a dozen. The number of eggs you steam at a time depends on the size of your pot. Don't worry—the boiling water touching one side of your egg doesn't change how the steam works. Place the lid back on the pot to steam the egg. The properly closed lid ensures that the pot will fill with steam which is necessary for perfect cooking. A properly placed lid also makes for more precise cooking times. At this point, you can reduce the heat under your pot to medium-high. This keeps the water from completely evaporating before you're done steaming your egg. Set the timer for around 6-12 minutes. You can use the same amount of time as you would using a steamer basket—around 6 minutes for a soft boil and around 12 minutes for a hard boil. Turn off the stove when the timer goes off. Use a timer that you'll be able to hear. For example, the timer on your cellphone might not be loud enough, especially if you turned the volume down. Run cold water in a mixing bowl to cool your eggs. Place the steamed eggs in the bowl. You can add ice cubes to the water if you want your eggs to be cold rather than cool. Placing the eggs in cold water stops the cooking process. Because steam is so hot, forgetting to stop the cooking process right away can result in hard, rubbery eggs. Cooling the eggs after steaming also makes them easier to peel and serve immediately after cooking. Steaming an Egg in an Instant Pot Pour 1 cup (240 mL) of water in the bottom of your Instant Pot. You need at least that much water to activate the pot's pressure function. An Instant Pot works like a pressure cooker. The precision with which it uses steam to cook food ensures properly steamed eggs in a short amount of time. Confirm that your Instant Pot is plugged in before steaming your eggs. Place the metal basket in the bottom of your Instant Pot. The metal basket—called a trivet—looks like a steamer basket. Then, fill the metal basket with eggs. As with other egg steaming methods, it doesn't matter if a bit of water touches the eggs. You can pile in as many eggs as will fit in your Instant Pot. Close your Instant Pot and set it to seal to steam your egg. Choose the steam function from the pot's front panel. Also, set the timer on the panel. Choose 3 minutes for soft-boiled eggs and 6 minutes for hard-boiled eggs. Consider experimenting within the recommended steaming time ranges to get an egg that suits your palate. For example, you might find that setting the timer to 4 minutes or even 7 minutes results in an egg that's just perfect for you. While waiting for your eggs to steam, add water to a bowl to stop the cooking process. And, don't forget to add ice cubes if you want your eggs chilled. Remove your steamed egg from the Instant Pot. When the timer goes off and pot switches to \"Keep Warm\" mode, release the pressure by setting the pot to Venting. You can open the pot once the steam finishes releasing. Place the egg in the cold or ice water to stop the cooking process. You can leave the eggs in your Instant Pot on Keep Warm mode. Just keep in mind that they do continue cooking, which you might not want, depending on how soft or hard you like your egg.",
    "sentences": [
        " Steaming an Egg in a Steamer Basket Add about ⁄2 inch (1.3 cm) of water to a pot.",
        "Placing your pot under the kitchen sink is the easiest way to get the amount of water you need.",
        "You can also put some water in a pitcher and pour it into your pot.",
        "Remember, the water doesn't need to cover your eggs at all.",
        "You only need enough water to create steam inside your pot.",
        "It's perfectly OK to eyeball ⁄2 inch (1.3 cm) of water.",
        "Slightly more or slightly less won't hurt the steaming process.",
        "A metal colander works the same as a steamer basket.",
        "Turn your stove to high heat and bring the water to a rapid boil.",
        "To start, place a lid on the pot.",
        "Then, put the pot on the stove.",
        "You'll need the proper lid for the pot you're using to hold the steam inside of it.",
        "This is vital for success when it comes to steaming eggs.",
        "You can remove the pot lid after a few minutes to make sure the water's boiling and creating lots of steam.",
        "Fill your metal steamer basket with eggs.",
        "You can place one egg gently in the steamer basket or as many as will fit.",
        "You can steam one egg for breakfast or a quick snack, or steam a bunch of eggs to keep on hand for later.",
        "A little bit of water visible in the bottom of your steamer basket won't interfere with steaming your eggs.",
        "Lower the steamer basket into your pot.",
        "Then, place the lid back on the pot to hold in the steam.",
        "Reduce the heat to medium, which keeps your water from drying up.",
        "If you're concerned that the steam might be too hot, consider putting on a pair of oven mitts to protect your hands and lower arms as you lower the steamer basket or colander into the pot.",
        "Set your timer for 6-12 minutes.",
        "You should set the timer to 6 minutes for a soft boil and 12 minutes for a hard boil.",
        "You can keep track of your steaming time by monitoring your kitchen clock.",
        "Ideally, it's a good idea to use a timer with an alarm, in case you get distracted.",
        "At this point, you want to rely on your timer and avoid opening the pot to check the eggs.",
        "Letting out the steam while the eggs are in the pot can interfere with the steaming process.",
        "Remove the egg from the pot to cool.",
        "Place the egg in a bowl of cold water.",
        "If you want your egg to be cold, you can prepare a bath of ice cubes and water.",
        "Cooling the egg stops the cooking process and keeps the egg yolk from getting harder than you want.",
        "You should cool down the egg enough to peel without burning your fingers.",
        "Remove the eggshell.",
        "Start by tapping the steamed egg on your countertop gently.",
        "Then, run your thumb under the crack and flick upwards.",
        "This loosens the shell and makes it easy to take off.",
        "You can remove the shell of a properly steamed egg with one hand.",
        "The egg white should be perfectly smooth and show no gouges.",
        "Serve a cold steamed egg as a salad ingredient or a warm steamed egg alongside a piece of buttered toast.",
        "Steamed eggs keep in your refrigerator for up to 5 days.",
        "Steaming an Egg without a Steamer Basket Boil a small amount of water in a pot.",
        "Using your pinkie finger as a guide, measure enough water to reach the bottom of your fingernail.",
        "Cover the pot with a lid.",
        "Then, turn the stove to high heat and place the pot on the stove.",
        "Bring the water to a rapid boil.",
        "The good news is that you don't have to go out and buy a steamer basket to steam eggs if you don't have one.",
        "Placing your eggs in steam rather than cold water allows for a bit more precision when it comes to setting your cooking time.",
        "Remember to keep the pot on the stove over heat throughout the entire steaming process.",
        "Remove the lid and place your egg in the pot.",
        "You can steam as many eggs as you like in a pot using this method.",
        "For example, you can steam one egg or even a dozen.",
        "The number of eggs you steam at a time depends on the size of your pot.",
        "Don't worry—the boiling water touching one side of your egg doesn't change how the steam works.",
        "Place the lid back on the pot to steam the egg.",
        "The properly closed lid ensures that the pot will fill with steam which is necessary for perfect cooking.",
        "A properly placed lid also makes for more precise cooking times.",
        "At this point, you can reduce the heat under your pot to medium-high.",
        "This keeps the water from completely evaporating before you're done steaming your egg.",
        "Set the timer for around 6-12 minutes.",
        "You can use the same amount of time as you would using a steamer basket—around 6 minutes for a soft boil and around 12 minutes for a hard boil.",
        "Turn off the stove when the timer goes off.",
        "Use a timer that you'll be able to hear.",
        "For example, the timer on your cellphone might not be loud enough, especially if you turned the volume down.",
        "Run cold water in a mixing bowl to cool your eggs.",
        "Place the steamed eggs in the bowl.",
        "You can add ice cubes to the water if you want your eggs to be cold rather than cool.",
        "Placing the eggs in cold water stops the cooking process.",
        "Because steam is so hot, forgetting to stop the cooking process right away can result in hard, rubbery eggs.",
        "Cooling the eggs after steaming also makes them easier to peel and serve immediately after cooking.",
        "Steaming an Egg in an Instant Pot Pour 1 cup (240 mL) of water in the bottom of your Instant Pot.",
        "You need at least that much water to activate the pot's pressure function.",
        "An Instant Pot works like a pressure cooker.",
        "The precision with which it uses steam to cook food ensures properly steamed eggs in a short amount of time.",
        "Confirm that your Instant Pot is plugged in before steaming your eggs.",
        "Place the metal basket in the bottom of your Instant Pot.",
        "The metal basket—called a trivet—looks like a steamer basket.",
        "Then, fill the metal basket with eggs.",
        "As with other egg steaming methods, it doesn't matter if a bit of water touches the eggs.",
        "You can pile in as many eggs as will fit in your Instant Pot.",
        "Close your Instant Pot and set it to seal to steam your egg.",
        "Choose the steam function from the pot's front panel.",
        "Also, set the timer on the panel.",
        "Choose 3 minutes for soft-boiled eggs and 6 minutes for hard-boiled eggs.",
        "Consider experimenting within the recommended steaming time ranges to get an egg that suits your palate.",
        "For example, you might find that setting the timer to 4 minutes or even 7 minutes results in an egg that's just perfect for you.",
        "While waiting for your eggs to steam, add water to a bowl to stop the cooking process.",
        "And, don't forget to add ice cubes if you want your eggs chilled.",
        "Remove your steamed egg from the Instant Pot.",
        "When the timer goes off and pot switches to \"Keep Warm\" mode, release the pressure by setting the pot to Venting.",
        "You can open the pot once the steam finishes releasing.",
        "Place the egg in the cold or ice water to stop the cooking process.",
        "You can leave the eggs in your Instant Pot on Keep Warm mode.",
        "Just keep in mind that they do continue cooking, which you might not want, depending on how soft or hard you like your egg."
    ]
}