{
    "title": "How to Double a Recipe",
    "url": "https://www.wikihow.com/Double-a-Recipe",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes"
    ],
    "parts": [
        {
            "name": "Separating the Ingredients",
            "steps": [
                {
                    "headline": "Write each of the ingredients on a piece of paper.",
                    "description": "Chefs don’t recommend scaling a recipe in your head. You should write out the amounts you need ahead of time. If you have a copier, you may want to copy the original recipe and write in the margins, so that you have the instructions next to the ingredients."
                },
                {
                    "headline": "Write down all of the vegetables, flour and meat products in 1 column.",
                    "description": "Write down the seasonings in another column and the liquid ingredients in another column. Lastly, write down rising agents and alcohol in the last column."
                },
                {
                    "headline": "Write “Times 2” above the main ingredients column and above the liquids column.",
                    "description": "Write “Times 1.5” above the seasonings” column, excluding hot peppers. Place them in the last column with the exacting ingredients, such as rising agents and alcohol."
                },
                {
                    "headline": "Finish the calculations below, then double check your ingredients list on the original recipe to make sure you’ve included everything.",
                    "description": "Rewrite your ingredients in list form according to the “double” measure you have calculated."
                }
            ]
        },
        {
            "name": "Doubling Main Ingredients",
            "steps": [
                {
                    "headline": "Multiply the amount of all the vegetables and fruits by 2.",
                    "description": "This will provide the bulk of your recipe. Write down the new amount in your first column."
                },
                {
                    "headline": "Increase the flour in a recipe by 2.",
                    "description": "You will change your rising agent later on, according to the amount of flour you are using. Write down the new amount of flour you need."
                },
                {
                    "headline": "Double the amount of meat you must purchase.",
                    "description": "Remember that cooking larger chunks of meat may require increased cooking time. Write down the new lb. or g measurement."
                },
                {
                    "headline": "Double the amount of eggs you will use exactly.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Doubling Liquids",
            "steps": [
                {
                    "headline": "Increase the amount of water you use by a multiple of 2.",
                    "description": "Write this down in the liquids column. If you need 2 cups of water, you now need 4."
                },
                {
                    "headline": "Use twice as much stock.",
                    "description": "Write this number down in the liquids column."
                },
                {
                    "headline": "Leave alcohol-based ingredients, such as sherry, wine, beer and spirits to the special ingredients section.",
                    "description": "Alcohol has a stronger flavor and will become too concentrated if doubled."
                },
                {
                    "headline": "Consider ingredients like soy sauce, Worcestershire sauce and other concentrated sauces to be seasonings.",
                    "description": "You will use a different ratio with these in order to get the measurements right."
                },
                {
                    "headline": "Double the amount of butter or olive oil that is called for in a recipe mix.",
                    "description": "However, don’t double the amount of olive oil or butter you use in the pan with sautéing. The aim should be to use enough to cover the pan you are using, so if you use a bigger pan, you use as much as you need to cover the pan."
                }
            ]
        },
        {
            "name": "Increasing Seasonings",
            "steps": [
                {
                    "headline": "Multiply your spices, like salt, pepper and cinnamon, by 1.5 times the original recipe.",
                    "description": "If your recipe calls for 2 tsp. (12.2 g) of salt, you now need 3 tsp. (18.3 g) of salt. You may need to use a calculator to write down an accurate measurement."
                },
                {
                    "headline": "Increase chili peppers and other hot spices by 1.25 times the original recipe.",
                    "description": "This includes curry powders, garlic powders and fresh hot peppers."
                },
                {
                    "headline": "Increase salty, peppery and concentrated sauces by 1.5 times the original amount.",
                    "description": "If a sauce has alcohol in it, you may want to only increase it by 1.25 times."
                }
            ]
        },
        {
            "name": "Increasing Special Ingredients (The Exceptions)",
            "steps": [
                {
                    "headline": "Use 1.5 times the amount of alcohol in the recipe.",
                    "description": "Try to avoid “eyeing it” and pouring based on instinct, if you are doubling the recipe for the first time."
                },
                {
                    "headline": "Recalculate your baking soda quantity.",
                    "description": "To rise properly, you need 1/4 tsp. (1.15 g) of baking soda per cup (125 g) of all-purpose flour. If you now need 4 cups (500 g) of all-purpose flour, your baking soda measurement should be 1 tsp. (4.6 g). Include extra baking soda, approximately 1/4 tsp. to 1/2 tsp. per cup of acidic ingredient. If your recipe calls for yogurt, buttermilk, vinegar or lemon juice, you will need slightly more baking soda to neutralize the acidity. If both baking powder and baking soda are in the recipe, it usually means there is an acidic ingredient that needs to be neutralized."
                },
                {
                    "headline": "Recalculate your baking powder quantity.",
                    "description": "To rise, you need 1.25 tsp. (4.44 g) of baking powder per cup (125 g) of all-purpose flour. If you have 4 cups of flour (500 g), you need 5 tsp. (17.77 g) of baking powder."
                }
            ]
        }
    ],
    "tyn": [
        "Pencil",
        "Paper",
        "Copy of recipe",
        "Calculator",
        "Fahrenheit to Celsius calculator"
    ],
    "text": " Separating the Ingredients Write each of the ingredients on a piece of paper. Chefs don’t recommend scaling a recipe in your head. You should write out the amounts you need ahead of time. If you have a copier, you may want to copy the original recipe and write in the margins, so that you have the instructions next to the ingredients. Write down all of the vegetables, flour and meat products in 1 column. Write down the seasonings in another column and the liquid ingredients in another column. Lastly, write down rising agents and alcohol in the last column. Write “Times 2” above the main ingredients column and above the liquids column. Write “Times 1.5” above the seasonings” column, excluding hot peppers. Place them in the last column with the exacting ingredients, such as rising agents and alcohol. Finish the calculations below, then double check your ingredients list on the original recipe to make sure you’ve included everything. Rewrite your ingredients in list form according to the “double” measure you have calculated. Doubling Main Ingredients Multiply the amount of all the vegetables and fruits by 2. This will provide the bulk of your recipe. Write down the new amount in your first column. Increase the flour in a recipe by 2. You will change your rising agent later on, according to the amount of flour you are using. Write down the new amount of flour you need. Double the amount of meat you must purchase. Remember that cooking larger chunks of meat may require increased cooking time. Write down the new lb. or g measurement. Double the amount of eggs you will use exactly.  Doubling Liquids Increase the amount of water you use by a multiple of 2. Write this down in the liquids column. If you need 2 cups of water, you now need 4. Use twice as much stock. Write this number down in the liquids column. Leave alcohol-based ingredients, such as sherry, wine, beer and spirits to the special ingredients section. Alcohol has a stronger flavor and will become too concentrated if doubled. Consider ingredients like soy sauce, Worcestershire sauce and other concentrated sauces to be seasonings. You will use a different ratio with these in order to get the measurements right. Double the amount of butter or olive oil that is called for in a recipe mix. However, don’t double the amount of olive oil or butter you use in the pan with sautéing. The aim should be to use enough to cover the pan you are using, so if you use a bigger pan, you use as much as you need to cover the pan. Increasing Seasonings Multiply your spices, like salt, pepper and cinnamon, by 1.5 times the original recipe. If your recipe calls for 2 tsp. (12.2 g) of salt, you now need 3 tsp. (18.3 g) of salt. You may need to use a calculator to write down an accurate measurement. Increase chili peppers and other hot spices by 1.25 times the original recipe. This includes curry powders, garlic powders and fresh hot peppers. Increase salty, peppery and concentrated sauces by 1.5 times the original amount. If a sauce has alcohol in it, you may want to only increase it by 1.25 times. Increasing Special Ingredients (The Exceptions) Use 1.5 times the amount of alcohol in the recipe. Try to avoid “eyeing it” and pouring based on instinct, if you are doubling the recipe for the first time. Recalculate your baking soda quantity. To rise properly, you need 1/4 tsp. (1.15 g) of baking soda per cup (125 g) of all-purpose flour. If you now need 4 cups (500 g) of all-purpose flour, your baking soda measurement should be 1 tsp. (4.6 g). Include extra baking soda, approximately 1/4 tsp. to 1/2 tsp. per cup of acidic ingredient. If your recipe calls for yogurt, buttermilk, vinegar or lemon juice, you will need slightly more baking soda to neutralize the acidity. If both baking powder and baking soda are in the recipe, it usually means there is an acidic ingredient that needs to be neutralized. Recalculate your baking powder quantity. To rise, you need 1.25 tsp. (4.44 g) of baking powder per cup (125 g) of all-purpose flour. If you have 4 cups of flour (500 g), you need 5 tsp. (17.77 g) of baking powder.",
    "sentences": [
        " Separating the Ingredients Write each of the ingredients on a piece of paper.",
        "Chefs don’t recommend scaling a recipe in your head.",
        "You should write out the amounts you need ahead of time.",
        "If you have a copier, you may want to copy the original recipe and write in the margins, so that you have the instructions next to the ingredients.",
        "Write down all of the vegetables, flour and meat products in 1 column.",
        "Write down the seasonings in another column and the liquid ingredients in another column.",
        "Lastly, write down rising agents and alcohol in the last column.",
        "Write “Times 2” above the main ingredients column and above the liquids column.",
        "Write “Times 1.5” above the seasonings” column, excluding hot peppers.",
        "Place them in the last column with the exacting ingredients, such as rising agents and alcohol.",
        "Finish the calculations below, then double check your ingredients list on the original recipe to make sure you’ve included everything.",
        "Rewrite your ingredients in list form according to the “double” measure you have calculated.",
        "Doubling Main Ingredients Multiply the amount of all the vegetables and fruits by 2.",
        "This will provide the bulk of your recipe.",
        "Write down the new amount in your first column.",
        "Increase the flour in a recipe by 2.",
        "You will change your rising agent later on, according to the amount of flour you are using.",
        "Write down the new amount of flour you need.",
        "Double the amount of meat you must purchase.",
        "Remember that cooking larger chunks of meat may require increased cooking time.",
        "Write down the new lb.",
        "or g measurement.",
        "Double the amount of eggs you will use exactly.",
        "Doubling Liquids Increase the amount of water you use by a multiple of 2.",
        "Write this down in the liquids column.",
        "If you need 2 cups of water, you now need 4.",
        "Use twice as much stock.",
        "Write this number down in the liquids column.",
        "Leave alcohol-based ingredients, such as sherry, wine, beer and spirits to the special ingredients section.",
        "Alcohol has a stronger flavor and will become too concentrated if doubled.",
        "Consider ingredients like soy sauce, Worcestershire sauce and other concentrated sauces to be seasonings.",
        "You will use a different ratio with these in order to get the measurements right.",
        "Double the amount of butter or olive oil that is called for in a recipe mix.",
        "However, don’t double the amount of olive oil or butter you use in the pan with sautéing.",
        "The aim should be to use enough to cover the pan you are using, so if you use a bigger pan, you use as much as you need to cover the pan.",
        "Increasing Seasonings Multiply your spices, like salt, pepper and cinnamon, by 1.5 times the original recipe.",
        "If your recipe calls for 2 tsp.",
        "(12.2 g) of salt, you now need 3 tsp.",
        "(18.3 g) of salt.",
        "You may need to use a calculator to write down an accurate measurement.",
        "Increase chili peppers and other hot spices by 1.25 times the original recipe.",
        "This includes curry powders, garlic powders and fresh hot peppers.",
        "Increase salty, peppery and concentrated sauces by 1.5 times the original amount.",
        "If a sauce has alcohol in it, you may want to only increase it by 1.25 times.",
        "Increasing Special Ingredients (The Exceptions) Use 1.5 times the amount of alcohol in the recipe.",
        "Try to avoid “eyeing it” and pouring based on instinct, if you are doubling the recipe for the first time.",
        "Recalculate your baking soda quantity.",
        "To rise properly, you need 1/4 tsp.",
        "(1.15 g) of baking soda per cup (125 g) of all-purpose flour.",
        "If you now need 4 cups (500 g) of all-purpose flour, your baking soda measurement should be 1 tsp.",
        "(4.6 g).",
        "Include extra baking soda, approximately 1/4 tsp.",
        "to 1/2 tsp.",
        "per cup of acidic ingredient.",
        "If your recipe calls for yogurt, buttermilk, vinegar or lemon juice, you will need slightly more baking soda to neutralize the acidity.",
        "If both baking powder and baking soda are in the recipe, it usually means there is an acidic ingredient that needs to be neutralized.",
        "Recalculate your baking powder quantity.",
        "To rise, you need 1.25 tsp.",
        "(4.44 g) of baking powder per cup (125 g) of all-purpose flour.",
        "If you have 4 cups of flour (500 g), you need 5 tsp.",
        "(17.77 g) of baking powder."
    ]
}