{
    "title": "How to Make an Indian Tea",
    "url": "https://www.wikihow.com/Make-an-Indian-Tea",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Tea",
        "Milk Tea"
    ],
    "methods": [
        {
            "name": "Masala Chai",
            "steps": [
                {
                    "headline": "Coarsely grate the ginger and lightly crush the cinnamon stick.",
                    "description": "Take a 1 ⁄2 in (3.8 cm) piece of fresh ginger that hasn't been peeled and grate it against the coarsest side of a box grater. Then, hit a 3 in (7.6 cm) cinnamon stick lightly with a rolling pin to crush it. Since ginger is an underground produce, you might want to scrape off any soil on it. Put the ginger and cinnamon into a medium-sized pot. Crushing the cinnamon will release more flavor than if you leave the stick whole.There's no need to peel the ginger because you'll be straining the solids out of the chai."
                },
                {
                    "headline": "Bring the water, ginger, and cinnamon to a boil.",
                    "description": "Pour 3 ⁄2 cups (830 ml) of water into the pot with the crushed cinnamon and grated ginger. Turn the burner to medium-high heat and heat the mixture until it starts to bubble vigorously. If you are not using a teapot which is set aside only for tea making, use a clean vessel without any oil or tangy residue left on it because it might lead to the curdling of milk while boiling. Keep the lid off of the pot so the water doesn't boil over and you can see when to reduce the temperature."
                },
                {
                    "headline": "Turn the burner to medium and simmer the liquid for about 20 minutes.",
                    "description": "Reduce the heat so the water simmers and keep the lid off of the pot so liquid can evaporate. You'll need to stir the liquid occasionally and keep simmering until 1/3 of the liquid has evaporated. The simmering water should smell very fragrant once it's finished heating."
                },
                {
                    "headline": "Stir in the tea with the cardamom and steep it for 2 minutes off the heat.",
                    "description": "Carefully move the pot to a cool burner and stir in 6 teaspoons (4 g) of strong loose leaf black tea or 6 tea bags. Then, lightly crush 14 green cardamom pods to add to the mixture or stir in 3/4 teaspoon (1.5 g) of ground cardamom. Leave the tea to steep for 2 minutes.Tip: Play around with adding other spices to create a unique masala. For example, add ground nutmeg, ground black pepper, or fennel, according to your taste. There's no need to use very expensive, high-quality tea for chai. Masala chai is frequently made with strong, inexpensive black tea that you can find at the grocery store or Indian market. For a stronger tea, steep it for an extra 1 to 2 minutes. Keep in mind that the tea may become bitter the longer you steep it."
                },
                {
                    "headline": "Stir in the milk with the sugar and boil the chai for 5 minutes.",
                    "description": "Move the pot back to the warm burner and turn it on to medium-high. Slowly pour in 2 ⁄4 cups (650 ml) of milk and ¼ cup (50 g) of sugar or pure maple syrup. Then, stir the tea occasionally as it comes to a boil. Let the tea boil for 5 minutes so it foams up. You can use your choice of sweetener instead of sugar or maple syrup. Try using honey, agave, or demerara sugar, for instance."
                },
                {
                    "headline": "Cool the chai for 5 minutes and strain it into a serving jug.",
                    "description": "Turn off the burner and let the chai steep for another 5 minutes. Then, set a fine mesh strainer over a serving pitcher or teapot and pour the chai through it. Pour the chai into small serving cups and sip it while it's hot. Discard the solids that are left in the fine mesh strainer. If you'd like to store leftover chai, put it in an airtight container within 2 hours and refrigerate it for up to 3 to 4 days."
                }
            ]
        },
        {
            "name": "Butter Tea",
            "steps": [
                {
                    "headline": "Bring the milk, sugar, and baking soda to a boil.",
                    "description": "Pour 1 cup (240 ml) of whole milk or goat's milk into a pot and stir in 1 tablespoon (12 g) of sugar along with 2 pinches of baking soda. Turn the burner to medium and heat the liquid until it begins to boil.Did You Know? Butter tea is traditionally made with yak milk and butter, but you can use your favorite type of milk. For extremely rich and creamy butter tea, try it with half-and-half."
                },
                {
                    "headline": "Stir in the tea powder and boil it for 30 to 60 seconds.",
                    "description": "Add 1 teaspoon (2 g) of black tea powder to the pot and stir it until it dissolves in the hot milk. Then, keep the lid off of the pot and gently boil the tea over medium heat for up to 1 minute. The longer you boil the tea, the stronger the tea flavor will be. Some of the milk will evaporate as it boils, which will make the tea thick."
                },
                {
                    "headline": "Strain the tea into a serving cup.",
                    "description": "Turn off the burner and set a small fine mesh strainer over a serving cup. Slowly pour the tea into the cup and discard the solids that are left in the strainer. If you'd like thinner tea, you can top off the tea in your cup with warm or cold milk."
                },
                {
                    "headline": "Stir in the butter and serve the tea.",
                    "description": "Add 1 teaspoon (5 g) of butter and slowly stir it until it dissolves. If you'd like slightly foamy butter tea, use a whisk to carefully blend the butter into the tea. Then, sip the tea while it's hot. If you'd like to make a larger batch of butter tea, you can double or triple the amount and make it in a large pot."
                }
            ]
        },
        {
            "name": "Kashmiri Kahwa",
            "steps": [
                {
                    "headline": "Combine the water, saffron, cinnamon, clove, rose, and cardamom in a pot.",
                    "description": "Pour 3 cups (710 ml) of water into a medium-sized pot and add 10 to 12 strands of saffron, a ⁄2 inch (1.3 cm) stick of cinnamon, and 1 clove. Then crush 1 cardamom pod and add it to the pot. If you can't afford very much saffron, use as few strands as you like."
                },
                {
                    "headline": "Bring the mixture to a boil and simmer it for 3 to 4 minutes.",
                    "description": "Turn the burner to medium-high and heat the liquid until it bubbles vigorously. Then, turn the burner down until the liquid gently simmers. Keep the lid off of the pot as it simmers."
                },
                {
                    "headline": "Add the green tea and steep it for 1 minute.",
                    "description": "Turn off the burner and stir in 1 teaspoon (2 g) of green tea. Leave the pot uncovered and let the tea steep so the flavor can develop.Tip: You can use plain green tea or specially blended Kashmiri green tea, which contains spices. For stronger kahwa, add an extra 1 to 2 teaspoons (2 to 4 g) of green tea."
                },
                {
                    "headline": "Strain the kahwa into a serving jug or teapot.",
                    "description": "Set a fine mesh strainer over a serving jug or teapot and slowly pour the hot kahwa through it. Discard the solids and then pour the kahwa into individual serving cups."
                },
                {
                    "headline": "Stir in honey and slivered almonds before serving the kahwa.",
                    "description": "To sweeten the kahwa, you can mix in a little honey until it dissolves. Then, sprinkle a few slivered almonds into each cup. If you'd like to garnish the drink even more, add a saffron thread to each cup or sprinkle extra dried rose petals on top. Refrigerate leftover kahwa in an airtight container for up to 3 to 4 days."
                }
            ]
        }
    ],
    "tyn": [
        "Masala Chai",
        "Measuring cups and spoons",
        "Medium-sized pot",
        "Box grater",
        "Rolling pin",
        "Spoon",
        "Fine mesh strainer",
        "Serving pitcher or teapot",
        "Serving cups",
        "Butter Tea",
        "Small pot",
        "Small fine mesh strainer",
        "Serving cup",
        "Whisk, optional",
        "Kashmiri Kahwa"
    ],
    "text": " Masala Chai Coarsely grate the ginger and lightly crush the cinnamon stick. Take a 1 ⁄2 in (3.8 cm) piece of fresh ginger that hasn't been peeled and grate it against the coarsest side of a box grater. Then, hit a 3 in (7.6 cm) cinnamon stick lightly with a rolling pin to crush it. Since ginger is an underground produce, you might want to scrape off any soil on it. Put the ginger and cinnamon into a medium-sized pot. Crushing the cinnamon will release more flavor than if you leave the stick whole.There's no need to peel the ginger because you'll be straining the solids out of the chai. Bring the water, ginger, and cinnamon to a boil. Pour 3 ⁄2 cups (830 ml) of water into the pot with the crushed cinnamon and grated ginger. Turn the burner to medium-high heat and heat the mixture until it starts to bubble vigorously. If you are not using a teapot which is set aside only for tea making, use a clean vessel without any oil or tangy residue left on it because it might lead to the curdling of milk while boiling. Keep the lid off of the pot so the water doesn't boil over and you can see when to reduce the temperature. Turn the burner to medium and simmer the liquid for about 20 minutes. Reduce the heat so the water simmers and keep the lid off of the pot so liquid can evaporate. You'll need to stir the liquid occasionally and keep simmering until 1/3 of the liquid has evaporated. The simmering water should smell very fragrant once it's finished heating. Stir in the tea with the cardamom and steep it for 2 minutes off the heat. Carefully move the pot to a cool burner and stir in 6 teaspoons (4 g) of strong loose leaf black tea or 6 tea bags. Then, lightly crush 14 green cardamom pods to add to the mixture or stir in 3/4 teaspoon (1.5 g) of ground cardamom. Leave the tea to steep for 2 minutes.Tip: Play around with adding other spices to create a unique masala. For example, add ground nutmeg, ground black pepper, or fennel, according to your taste. There's no need to use very expensive, high-quality tea for chai. Masala chai is frequently made with strong, inexpensive black tea that you can find at the grocery store or Indian market. For a stronger tea, steep it for an extra 1 to 2 minutes. Keep in mind that the tea may become bitter the longer you steep it. Stir in the milk with the sugar and boil the chai for 5 minutes. Move the pot back to the warm burner and turn it on to medium-high. Slowly pour in 2 ⁄4 cups (650 ml) of milk and ¼ cup (50 g) of sugar or pure maple syrup. Then, stir the tea occasionally as it comes to a boil. Let the tea boil for 5 minutes so it foams up. You can use your choice of sweetener instead of sugar or maple syrup. Try using honey, agave, or demerara sugar, for instance. Cool the chai for 5 minutes and strain it into a serving jug. Turn off the burner and let the chai steep for another 5 minutes. Then, set a fine mesh strainer over a serving pitcher or teapot and pour the chai through it. Pour the chai into small serving cups and sip it while it's hot. Discard the solids that are left in the fine mesh strainer. If you'd like to store leftover chai, put it in an airtight container within 2 hours and refrigerate it for up to 3 to 4 days. Butter Tea Bring the milk, sugar, and baking soda to a boil. Pour 1 cup (240 ml) of whole milk or goat's milk into a pot and stir in 1 tablespoon (12 g) of sugar along with 2 pinches of baking soda. Turn the burner to medium and heat the liquid until it begins to boil.Did You Know? Butter tea is traditionally made with yak milk and butter, but you can use your favorite type of milk. For extremely rich and creamy butter tea, try it with half-and-half. Stir in the tea powder and boil it for 30 to 60 seconds. Add 1 teaspoon (2 g) of black tea powder to the pot and stir it until it dissolves in the hot milk. Then, keep the lid off of the pot and gently boil the tea over medium heat for up to 1 minute. The longer you boil the tea, the stronger the tea flavor will be. Some of the milk will evaporate as it boils, which will make the tea thick. Strain the tea into a serving cup. Turn off the burner and set a small fine mesh strainer over a serving cup. Slowly pour the tea into the cup and discard the solids that are left in the strainer. If you'd like thinner tea, you can top off the tea in your cup with warm or cold milk. Stir in the butter and serve the tea. Add 1 teaspoon (5 g) of butter and slowly stir it until it dissolves. If you'd like slightly foamy butter tea, use a whisk to carefully blend the butter into the tea. Then, sip the tea while it's hot. If you'd like to make a larger batch of butter tea, you can double or triple the amount and make it in a large pot. Kashmiri Kahwa Combine the water, saffron, cinnamon, clove, rose, and cardamom in a pot. Pour 3 cups (710 ml) of water into a medium-sized pot and add 10 to 12 strands of saffron, a ⁄2 inch (1.3 cm) stick of cinnamon, and 1 clove. Then crush 1 cardamom pod and add it to the pot. If you can't afford very much saffron, use as few strands as you like. Bring the mixture to a boil and simmer it for 3 to 4 minutes. Turn the burner to medium-high and heat the liquid until it bubbles vigorously. Then, turn the burner down until the liquid gently simmers. Keep the lid off of the pot as it simmers. Add the green tea and steep it for 1 minute. Turn off the burner and stir in 1 teaspoon (2 g) of green tea. Leave the pot uncovered and let the tea steep so the flavor can develop.Tip: You can use plain green tea or specially blended Kashmiri green tea, which contains spices. For stronger kahwa, add an extra 1 to 2 teaspoons (2 to 4 g) of green tea. Strain the kahwa into a serving jug or teapot. Set a fine mesh strainer over a serving jug or teapot and slowly pour the hot kahwa through it. Discard the solids and then pour the kahwa into individual serving cups. Stir in honey and slivered almonds before serving the kahwa. To sweeten the kahwa, you can mix in a little honey until it dissolves. Then, sprinkle a few slivered almonds into each cup. If you'd like to garnish the drink even more, add a saffron thread to each cup or sprinkle extra dried rose petals on top. Refrigerate leftover kahwa in an airtight container for up to 3 to 4 days.",
    "sentences": [
        " Masala Chai Coarsely grate the ginger and lightly crush the cinnamon stick.",
        "Take a 1 ⁄2 in (3.8 cm) piece of fresh ginger that hasn't been peeled and grate it against the coarsest side of a box grater.",
        "Then, hit a 3 in (7.6 cm) cinnamon stick lightly with a rolling pin to crush it.",
        "Since ginger is an underground produce, you might want to scrape off any soil on it.",
        "Put the ginger and cinnamon into a medium-sized pot.",
        "Crushing the cinnamon will release more flavor than if you leave the stick whole.There's no need to peel the ginger because you'll be straining the solids out of the chai.",
        "Bring the water, ginger, and cinnamon to a boil.",
        "Pour 3 ⁄2 cups (830 ml) of water into the pot with the crushed cinnamon and grated ginger.",
        "Turn the burner to medium-high heat and heat the mixture until it starts to bubble vigorously.",
        "If you are not using a teapot which is set aside only for tea making, use a clean vessel without any oil or tangy residue left on it because it might lead to the curdling of milk while boiling.",
        "Keep the lid off of the pot so the water doesn't boil over and you can see when to reduce the temperature.",
        "Turn the burner to medium and simmer the liquid for about 20 minutes.",
        "Reduce the heat so the water simmers and keep the lid off of the pot so liquid can evaporate.",
        "You'll need to stir the liquid occasionally and keep simmering until 1/3 of the liquid has evaporated.",
        "The simmering water should smell very fragrant once it's finished heating.",
        "Stir in the tea with the cardamom and steep it for 2 minutes off the heat.",
        "Carefully move the pot to a cool burner and stir in 6 teaspoons (4 g) of strong loose leaf black tea or 6 tea bags.",
        "Then, lightly crush 14 green cardamom pods to add to the mixture or stir in 3/4 teaspoon (1.5 g) of ground cardamom.",
        "Leave the tea to steep for 2 minutes.Tip: Play around with adding other spices to create a unique masala.",
        "For example, add ground nutmeg, ground black pepper, or fennel, according to your taste.",
        "There's no need to use very expensive, high-quality tea for chai.",
        "Masala chai is frequently made with strong, inexpensive black tea that you can find at the grocery store or Indian market.",
        "For a stronger tea, steep it for an extra 1 to 2 minutes.",
        "Keep in mind that the tea may become bitter the longer you steep it.",
        "Stir in the milk with the sugar and boil the chai for 5 minutes.",
        "Move the pot back to the warm burner and turn it on to medium-high.",
        "Slowly pour in 2 ⁄4 cups (650 ml) of milk and ¼ cup (50 g) of sugar or pure maple syrup.",
        "Then, stir the tea occasionally as it comes to a boil.",
        "Let the tea boil for 5 minutes so it foams up.",
        "You can use your choice of sweetener instead of sugar or maple syrup.",
        "Try using honey, agave, or demerara sugar, for instance.",
        "Cool the chai for 5 minutes and strain it into a serving jug.",
        "Turn off the burner and let the chai steep for another 5 minutes.",
        "Then, set a fine mesh strainer over a serving pitcher or teapot and pour the chai through it.",
        "Pour the chai into small serving cups and sip it while it's hot.",
        "Discard the solids that are left in the fine mesh strainer.",
        "If you'd like to store leftover chai, put it in an airtight container within 2 hours and refrigerate it for up to 3 to 4 days.",
        "Butter Tea Bring the milk, sugar, and baking soda to a boil.",
        "Pour 1 cup (240 ml) of whole milk or goat's milk into a pot and stir in 1 tablespoon (12 g) of sugar along with 2 pinches of baking soda.",
        "Turn the burner to medium and heat the liquid until it begins to boil.Did You Know?",
        "Butter tea is traditionally made with yak milk and butter, but you can use your favorite type of milk.",
        "For extremely rich and creamy butter tea, try it with half-and-half.",
        "Stir in the tea powder and boil it for 30 to 60 seconds.",
        "Add 1 teaspoon (2 g) of black tea powder to the pot and stir it until it dissolves in the hot milk.",
        "Then, keep the lid off of the pot and gently boil the tea over medium heat for up to 1 minute.",
        "The longer you boil the tea, the stronger the tea flavor will be.",
        "Some of the milk will evaporate as it boils, which will make the tea thick.",
        "Strain the tea into a serving cup.",
        "Turn off the burner and set a small fine mesh strainer over a serving cup.",
        "Slowly pour the tea into the cup and discard the solids that are left in the strainer.",
        "If you'd like thinner tea, you can top off the tea in your cup with warm or cold milk.",
        "Stir in the butter and serve the tea.",
        "Add 1 teaspoon (5 g) of butter and slowly stir it until it dissolves.",
        "If you'd like slightly foamy butter tea, use a whisk to carefully blend the butter into the tea.",
        "Then, sip the tea while it's hot.",
        "If you'd like to make a larger batch of butter tea, you can double or triple the amount and make it in a large pot.",
        "Kashmiri Kahwa Combine the water, saffron, cinnamon, clove, rose, and cardamom in a pot.",
        "Pour 3 cups (710 ml) of water into a medium-sized pot and add 10 to 12 strands of saffron, a ⁄2 inch (1.3 cm) stick of cinnamon, and 1 clove.",
        "Then crush 1 cardamom pod and add it to the pot.",
        "If you can't afford very much saffron, use as few strands as you like.",
        "Bring the mixture to a boil and simmer it for 3 to 4 minutes.",
        "Turn the burner to medium-high and heat the liquid until it bubbles vigorously.",
        "Then, turn the burner down until the liquid gently simmers.",
        "Keep the lid off of the pot as it simmers.",
        "Add the green tea and steep it for 1 minute.",
        "Turn off the burner and stir in 1 teaspoon (2 g) of green tea.",
        "Leave the pot uncovered and let the tea steep so the flavor can develop.Tip: You can use plain green tea or specially blended Kashmiri green tea, which contains spices.",
        "For stronger kahwa, add an extra 1 to 2 teaspoons (2 to 4 g) of green tea.",
        "Strain the kahwa into a serving jug or teapot.",
        "Set a fine mesh strainer over a serving jug or teapot and slowly pour the hot kahwa through it.",
        "Discard the solids and then pour the kahwa into individual serving cups.",
        "Stir in honey and slivered almonds before serving the kahwa.",
        "To sweeten the kahwa, you can mix in a little honey until it dissolves.",
        "Then, sprinkle a few slivered almonds into each cup.",
        "If you'd like to garnish the drink even more, add a saffron thread to each cup or sprinkle extra dried rose petals on top.",
        "Refrigerate leftover kahwa in an airtight container for up to 3 to 4 days."
    ]
}