{
    "title": "How to Die in Mario Games",
    "url": "https://www.wikihow.com/Die-in-Mario-Games",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Video Games",
        "Nintendo Video Game Consoles"
    ],
    "methods": [
        {
            "name": "Getting Killed by Enemies",
            "steps": [
                {
                    "headline": "Go to any enemy that is near you.",
                    "description": "Make sure that you are in a place full of enemies so that they can come to you and kill you easily."
                },
                {
                    "headline": "Attract them to come to you slowly.",
                    "description": "Get their attention by going within their eyesight so that they can follow and attack you."
                },
                {
                    "headline": "Let them reach and kill you.",
                    "description": "Just stand in a spot where they can easily reach you and allow their methods to kill you until you run out of health or you are too small and die."
                }
            ]
        },
        {
            "name": "Coming Across Hazards",
            "steps": [
                {
                    "headline": "Walk up to a hazard that is capable of inflicting damage on you.",
                    "description": "This can include fire, electricity, ice, quicksand, lava, black-holes, dark matter, or poison."
                },
                {
                    "headline": "Allow the hazard to damage you or come in close contact with it until you begin losing a lot of damage from the hazard.",
                    "description": ""
                },
                {
                    "headline": "Let the hazard kill you slowly.",
                    "description": "Enjoy the torture of the Italian plumber!"
                }
            ]
        },
        {
            "name": "Encountering Obstacles",
            "steps": [
                {
                    "headline": "Run up to an obstacle or to a place filled with obstacles.",
                    "description": "Obstacles are any objects that can inflict damage on you and are not related to hazards as hazards are energy or elements."
                },
                {
                    "headline": "Wait for the obstacle to activate or to come near you.",
                    "description": "Let it do its thing before it starts to damage you and slowly kill you."
                },
                {
                    "headline": "Let the suicide begin!",
                    "description": ""
                }
            ]
        },
        {
            "name": "Falling",
            "steps": [
                {
                    "headline": "Go to a very high place or an open ended area with no boundaries that is blocking your way from falling out of bounds or to a lower altitude.",
                    "description": ""
                },
                {
                    "headline": "Make sure that you choose a spot that you can easily jump off but quickly grab back in case you don't want to jump and die.",
                    "description": ""
                },
                {
                    "headline": "Jump down and skydive to your doom!",
                    "description": ""
                }
            ]
        },
        {
            "name": "Getting Squished",
            "steps": [
                {
                    "headline": "Walk to a place with obstacles or enemies that can squish you to a blob of jelly.",
                    "description": ""
                },
                {
                    "headline": "Go to an obstacle and wait for it to squish upon your body.",
                    "description": ""
                },
                {
                    "headline": "Let it squish you and watch as Mario becomes a blob of muck.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Drowning or Choking",
            "steps": [
                {
                    "headline": "Go to a body of water, fluids, poison, or any toxin, gas, or liquid that can kill you.",
                    "description": ""
                },
                {
                    "headline": "Swim into the water or liquid.",
                    "description": "Slowly watch and wait as your air meter slowly depletes, until it runs out of air."
                },
                {
                    "headline": "Wait, even while Mario needs air.",
                    "description": "Watch as more time spent in water without air means losing more and more health to accommodate for the air loss."
                },
                {
                    "headline": "Die from exposure to toxins.",
                    "description": "If you come to a poisonous gas, walk into the area with all that toxin and watch as Mario slowly inhales or resists inhaling the poison into his airway."
                },
                {
                    "headline": "Inhale water or poison.",
                    "description": "When it is too late, Mario will inhale the water or the poison and make a funny struggle to resist but still die at the hands of death!"
                }
            ]
        },
        {
            "name": "Losing",
            "steps": [
                {
                    "headline": "Go to a person or enemy.",
                    "description": "Challenge them to a competition to win a prize from them."
                },
                {
                    "headline": "Let the competition begin.",
                    "description": "Let them win or let the time run out for you to purposely lose."
                },
                {
                    "headline": "Allow the person or enemy to tell you about your loss and let it traumatize you to death.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Letting the Time Limit Expire",
            "steps": [
                {
                    "headline": "Let the time run out to let it kill you!",
                    "description": ""
                },
                {
                    "headline": "Be sure to just stand there.",
                    "description": "Alternatively, waste your time in that level by messing around!"
                }
            ]
        },
        {
            "name": "Pushing to Prompt Game Glitches",
            "steps": [
                {
                    "headline": "Practice and perform game-breaking or risky glitches.",
                    "description": "These actions can result in save data corruption or life loss and nothing else!"
                },
                {
                    "headline": "Trigger a glitch.",
                    "description": "When you have practiced enough to trigger the glitch easily, simply trigger the glitch as needed."
                },
                {
                    "headline": "Complete the glitch.",
                    "description": "Watch as it destroys your life, save data, or even console (ouch!)"
                }
            ]
        }
    ],
    "tyn": [
        "Mario Video Game",
        "Nintendo Console or Handheld System",
        "Death Guide",
        "Backed-Up Save Data"
    ],
    "text": " Getting Killed by Enemies Go to any enemy that is near you. Make sure that you are in a place full of enemies so that they can come to you and kill you easily. Attract them to come to you slowly. Get their attention by going within their eyesight so that they can follow and attack you. Let them reach and kill you. Just stand in a spot where they can easily reach you and allow their methods to kill you until you run out of health or you are too small and die. Coming Across Hazards Walk up to a hazard that is capable of inflicting damage on you. This can include fire, electricity, ice, quicksand, lava, black-holes, dark matter, or poison. Allow the hazard to damage you or come in close contact with it until you begin losing a lot of damage from the hazard.  Let the hazard kill you slowly. Enjoy the torture of the Italian plumber! Encountering Obstacles Run up to an obstacle or to a place filled with obstacles. Obstacles are any objects that can inflict damage on you and are not related to hazards as hazards are energy or elements. Wait for the obstacle to activate or to come near you. Let it do its thing before it starts to damage you and slowly kill you. Let the suicide begin!  Falling Go to a very high place or an open ended area with no boundaries that is blocking your way from falling out of bounds or to a lower altitude.  Make sure that you choose a spot that you can easily jump off but quickly grab back in case you don't want to jump and die.  Jump down and skydive to your doom!  Getting Squished Walk to a place with obstacles or enemies that can squish you to a blob of jelly.  Go to an obstacle and wait for it to squish upon your body.  Let it squish you and watch as Mario becomes a blob of muck.  Drowning or Choking Go to a body of water, fluids, poison, or any toxin, gas, or liquid that can kill you.  Swim into the water or liquid. Slowly watch and wait as your air meter slowly depletes, until it runs out of air. Wait, even while Mario needs air. Watch as more time spent in water without air means losing more and more health to accommodate for the air loss. Die from exposure to toxins. If you come to a poisonous gas, walk into the area with all that toxin and watch as Mario slowly inhales or resists inhaling the poison into his airway. Inhale water or poison. When it is too late, Mario will inhale the water or the poison and make a funny struggle to resist but still die at the hands of death! Losing Go to a person or enemy. Challenge them to a competition to win a prize from them. Let the competition begin. Let them win or let the time run out for you to purposely lose. Allow the person or enemy to tell you about your loss and let it traumatize you to death.  Letting the Time Limit Expire Let the time run out to let it kill you!  Be sure to just stand there. Alternatively, waste your time in that level by messing around! Pushing to Prompt Game Glitches Practice and perform game-breaking or risky glitches. These actions can result in save data corruption or life loss and nothing else! Trigger a glitch. When you have practiced enough to trigger the glitch easily, simply trigger the glitch as needed. Complete the glitch. Watch as it destroys your life, save data, or even console (ouch!)",
    "sentences": [
        " Getting Killed by Enemies Go to any enemy that is near you.",
        "Make sure that you are in a place full of enemies so that they can come to you and kill you easily.",
        "Attract them to come to you slowly.",
        "Get their attention by going within their eyesight so that they can follow and attack you.",
        "Let them reach and kill you.",
        "Just stand in a spot where they can easily reach you and allow their methods to kill you until you run out of health or you are too small and die.",
        "Coming Across Hazards Walk up to a hazard that is capable of inflicting damage on you.",
        "This can include fire, electricity, ice, quicksand, lava, black-holes, dark matter, or poison.",
        "Allow the hazard to damage you or come in close contact with it until you begin losing a lot of damage from the hazard.",
        "Let the hazard kill you slowly.",
        "Enjoy the torture of the Italian plumber!",
        "Encountering Obstacles Run up to an obstacle or to a place filled with obstacles.",
        "Obstacles are any objects that can inflict damage on you and are not related to hazards as hazards are energy or elements.",
        "Wait for the obstacle to activate or to come near you.",
        "Let it do its thing before it starts to damage you and slowly kill you.",
        "Let the suicide begin!",
        "Falling Go to a very high place or an open ended area with no boundaries that is blocking your way from falling out of bounds or to a lower altitude.",
        "Make sure that you choose a spot that you can easily jump off but quickly grab back in case you don't want to jump and die.",
        "Jump down and skydive to your doom!",
        "Getting Squished Walk to a place with obstacles or enemies that can squish you to a blob of jelly.",
        "Go to an obstacle and wait for it to squish upon your body.",
        "Let it squish you and watch as Mario becomes a blob of muck.",
        "Drowning or Choking Go to a body of water, fluids, poison, or any toxin, gas, or liquid that can kill you.",
        "Swim into the water or liquid.",
        "Slowly watch and wait as your air meter slowly depletes, until it runs out of air.",
        "Wait, even while Mario needs air.",
        "Watch as more time spent in water without air means losing more and more health to accommodate for the air loss.",
        "Die from exposure to toxins.",
        "If you come to a poisonous gas, walk into the area with all that toxin and watch as Mario slowly inhales or resists inhaling the poison into his airway.",
        "Inhale water or poison.",
        "When it is too late, Mario will inhale the water or the poison and make a funny struggle to resist but still die at the hands of death!",
        "Losing Go to a person or enemy.",
        "Challenge them to a competition to win a prize from them.",
        "Let the competition begin.",
        "Let them win or let the time run out for you to purposely lose.",
        "Allow the person or enemy to tell you about your loss and let it traumatize you to death.",
        "Letting the Time Limit Expire Let the time run out to let it kill you!",
        "Be sure to just stand there.",
        "Alternatively, waste your time in that level by messing around!",
        "Pushing to Prompt Game Glitches Practice and perform game-breaking or risky glitches.",
        "These actions can result in save data corruption or life loss and nothing else!",
        "Trigger a glitch.",
        "When you have practiced enough to trigger the glitch easily, simply trigger the glitch as needed.",
        "Complete the glitch.",
        "Watch as it destroys your life, save data, or even console (ouch!)"
    ]
}