{
    "title": "How to Make Gyoza Dumplings",
    "url": "https://www.wikihow.com/Make-Gyoza-Dumplings",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "Asian Cuisine",
        "Japanese Dishes"
    ],
    "steps": [
        {
            "headline": "Prepare the ingredients.",
            "description": "Chop the chives and cabbage. Peel and devein the shrimp, and grate your ginger and garlic."
        },
        {
            "headline": "Combine the beef, shrimp, cabbage, ginger, garlic, salt, white pepper, and the oils into a large bowl.",
            "description": ""
        },
        {
            "headline": "Mix everything together well with your hands, making sure the mixture isn't lumpy or uneven.",
            "description": "Place the bowl into the refrigerator, and then leave it for about 10 minutes."
        },
        {
            "headline": "Take a gyoza wrapper and place a small spoonful of the mixture in the middle.",
            "description": "Dab a little water on one half of the wrapper's edge and securely fold in two to make a semi or half circle. While folding, pinch the two sides together like a Ziploc bag and create waves while pinching. Repeat this step for all the wrappers. This is called \"crimping\", the way to seal up the edges of the dumpling."
        },
        {
            "headline": "Oil and heat a skillet on the stove.",
            "description": "Put it on medium heat and carefully drop a few dumplings into the skillet at a time, but be sure not to overload the skillet with everything."
        },
        {
            "headline": "Fry the dumplings for about two minutes, then reduce the heat.",
            "description": ""
        },
        {
            "headline": "Add about half a cup of water to the skillet and cover it with a pan lid.",
            "description": "Steam the dumplings until the water has evaporated or boiled off and then remove the food from the heat."
        },
        {
            "headline": "Place the dumplings onto a plate or serving bowl and serve with dipping sauce or soy sauce (shoyu).",
            "description": "Gyoza dumplings are mainly served with a soy based tare sauce, which you can season with rice vinegar. The dumplings are best served while still steaming hot."
        }
    ],
    "tyn": [
        "Large mixing bowl",
        "Sharp knife",
        "Cutting board",
        "Large skillet"
    ],
    "text": " Prepare the ingredients. Chop the chives and cabbage. Peel and devein the shrimp, and grate your ginger and garlic. Combine the beef, shrimp, cabbage, ginger, garlic, salt, white pepper, and the oils into a large bowl.  Mix everything together well with your hands, making sure the mixture isn't lumpy or uneven. Place the bowl into the refrigerator, and then leave it for about 10 minutes. Take a gyoza wrapper and place a small spoonful of the mixture in the middle. Dab a little water on one half of the wrapper's edge and securely fold in two to make a semi or half circle. While folding, pinch the two sides together like a Ziploc bag and create waves while pinching. Repeat this step for all the wrappers. This is called \"crimping\", the way to seal up the edges of the dumpling. Oil and heat a skillet on the stove. Put it on medium heat and carefully drop a few dumplings into the skillet at a time, but be sure not to overload the skillet with everything. Fry the dumplings for about two minutes, then reduce the heat.  Add about half a cup of water to the skillet and cover it with a pan lid. Steam the dumplings until the water has evaporated or boiled off and then remove the food from the heat. Place the dumplings onto a plate or serving bowl and serve with dipping sauce or soy sauce (shoyu). Gyoza dumplings are mainly served with a soy based tare sauce, which you can season with rice vinegar. The dumplings are best served while still steaming hot.",
    "sentences": [
        " Prepare the ingredients.",
        "Chop the chives and cabbage.",
        "Peel and devein the shrimp, and grate your ginger and garlic.",
        "Combine the beef, shrimp, cabbage, ginger, garlic, salt, white pepper, and the oils into a large bowl.",
        "Mix everything together well with your hands, making sure the mixture isn't lumpy or uneven.",
        "Place the bowl into the refrigerator, and then leave it for about 10 minutes.",
        "Take a gyoza wrapper and place a small spoonful of the mixture in the middle.",
        "Dab a little water on one half of the wrapper's edge and securely fold in two to make a semi or half circle.",
        "While folding, pinch the two sides together like a Ziploc bag and create waves while pinching.",
        "Repeat this step for all the wrappers.",
        "This is called \"crimping\", the way to seal up the edges of the dumpling.",
        "Oil and heat a skillet on the stove.",
        "Put it on medium heat and carefully drop a few dumplings into the skillet at a time, but be sure not to overload the skillet with everything.",
        "Fry the dumplings for about two minutes, then reduce the heat.",
        "Add about half a cup of water to the skillet and cover it with a pan lid.",
        "Steam the dumplings until the water has evaporated or boiled off and then remove the food from the heat.",
        "Place the dumplings onto a plate or serving bowl and serve with dipping sauce or soy sauce (shoyu).",
        "Gyoza dumplings are mainly served with a soy based tare sauce, which you can season with rice vinegar.",
        "The dumplings are best served while still steaming hot."
    ]
}