{
    "title": "How to Sew a Curved Seam",
    "url": "https://www.wikihow.com/Sew-a-Curved-Seam",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Sewing",
        "Sewing Skills",
        "Basic Sewing Stitches"
    ],
    "steps": [
        {
            "headline": "Face the material with the wrong side out.",
            "description": "This is presumed, unless your pattern states otherwise."
        },
        {
            "headline": "Measure the required space between the edge and where your sewing line will go.",
            "description": "This makes the seam allowance."
        },
        {
            "headline": "Clip a \"V\" shape from the raw edge of the fabric to the line of your seam allowance.",
            "description": ""
        },
        {
            "headline": "Clip out more \"V\" shapes at evenly spaced intervals all the way along the curved seam edge.",
            "description": ""
        },
        {
            "headline": "Sew the curved seam at the seam allowance line.",
            "description": "The little clipped \"V\"s will ensure that the seam allowance lies flat on the inside."
        },
        {
            "headline": "Trim if needed.",
            "description": "Then turn the sewing the right side out. Continue sewing other parts of the fabric item as instructed by the pattern."
        }
    ],
    "tyn": [
        "Fabric item requiring a curved seam",
        "Fabric scissors",
        "Measuring tape",
        "Sewing machine or needle and thread"
    ],
    "text": " Face the material with the wrong side out. This is presumed, unless your pattern states otherwise. Measure the required space between the edge and where your sewing line will go. This makes the seam allowance. Clip a \"V\" shape from the raw edge of the fabric to the line of your seam allowance.  Clip out more \"V\" shapes at evenly spaced intervals all the way along the curved seam edge.  Sew the curved seam at the seam allowance line. The little clipped \"V\"s will ensure that the seam allowance lies flat on the inside. Trim if needed. Then turn the sewing the right side out. Continue sewing other parts of the fabric item as instructed by the pattern.",
    "sentences": [
        " Face the material with the wrong side out.",
        "This is presumed, unless your pattern states otherwise.",
        "Measure the required space between the edge and where your sewing line will go.",
        "This makes the seam allowance.",
        "Clip a \"V\" shape from the raw edge of the fabric to the line of your seam allowance.",
        "Clip out more \"V\" shapes at evenly spaced intervals all the way along the curved seam edge.",
        "Sew the curved seam at the seam allowance line.",
        "The little clipped \"V\"s will ensure that the seam allowance lies flat on the inside.",
        "Trim if needed.",
        "Then turn the sewing the right side out.",
        "Continue sewing other parts of the fabric item as instructed by the pattern."
    ]
}