{
    "title": "How to Make Pressure Cooker \"Fried\" Chicken",
    "url": "https://www.wikihow.com/Make-Pressure-Cooker-%22Fried%22-Chicken",
    "category_hierarchy": [
        "Home and Garden",
        "Home Appliances"
    ],
    "parts": [
        {
            "name": "Pressure Cooking the Chicken",
            "steps": [
                {
                    "headline": "Pour cold water into the pressure cooker and put a steamer basket in it.",
                    "description": "Put 1 cup (240 ml) of cold water into the pressure cooker and set a steamer basket down into the cooker. If you're using a steamer basket that didn't come with your pressure cooker, ensure that it will fit inside your machine."
                },
                {
                    "headline": "Arrange chicken pieces in the steamer basket.",
                    "description": "Get out 6 chicken thighs and place them in the steamer basket. If you need to, you can stack the thighs so they're loosely touching. Avoid overcrowding the basket. If you want to make more chicken, cook the chicken in batches. If you prefer, use a combination of breasts, wings, or drumsticks."
                },
                {
                    "headline": "Cook the chicken at high pressure for 6 to 9 minutes.",
                    "description": "Put the lid on the cooker and secure it closed. Turn the pressure cooker onto high pressure and set the timer to 6 minutes, if you're using small thighs. If you're using large thighs, they'll probably need closer to 9 minutes to pressure cook."
                },
                {
                    "headline": "Turn off the heat and let the pressure release naturally.",
                    "description": "Once the chicken has pressure cooked, turn off the heat and select \"Full Natural Release.\" This will allow the pressure to gradually. Then you can open the lid of the machine. Most pressure cookers take about 10 minutes for the pressure to naturally release."
                }
            ]
        },
        {
            "name": "Making the Crispy Breading",
            "steps": [
                {
                    "headline": "Heat butter and olive oil over medium heat.",
                    "description": "Set a skillet on the stove and pour 2 tablespoons (30 ml) of olive oil into it. Add 2 tablespoons (29.6 ml) (28 g) of unsalted butter and turn the burner on to medium heat. The butter should melt and combine with the oil."
                },
                {
                    "headline": "Stir 1 to 1 ½ cups (62 to 93 g) of panko breadcrumbs into the skillet.",
                    "description": "Add the panko breadcrumbs to the butter and oil mixture. Stir until the breadcrumbs have absorbed the mixture. If you're using smaller thighs, you may only need 1 cup (62 g) of the breadcrumbs. If you don't have panko  breadcrumbs, you can substitute dried breadcrumbs but they won't crisp up as much."
                },
                {
                    "headline": "Heat the breadcrumbs for about 3 to 5 minutes.",
                    "description": "Continue to cook and stir the breadcrumbs frequently until they become rich, golden brown. Then stir in kosher salt according to your taste. Watch the breadcrumbs closely while they're toasting since they can burn quickly."
                }
            ]
        },
        {
            "name": "Baking the Chicken",
            "steps": [
                {
                    "headline": "Preheat the oven to 400 °F (204 °C) and set a rack on a sheet.",
                    "description": "Get out a large baking sheet and put a large wire rack on it. The wire rack will allow air to circulate under the chicken as it bakes. This will make the chicken even crispier."
                },
                {
                    "headline": "Check the chicken temperature to see if it's reached 160 °F (71 °C).",
                    "description": "Insert an instant-read meat thermometer into the thickest part of a chicken thigh to ensure that it's reached 160 °F (71 °C). Keep in mind that the chicken will cook more when you put it into the oven to crisp up. If the chicken hasn't reached temperature, close the pressure cooker and turn it back on to high for 3 to 5 more minutes."
                },
                {
                    "headline": "Remove the chicken and pat the pieces dry with a paper towel.",
                    "description": "Lift the steamer basket out of the pressure cooker and lay the pieces of chicken on a baking sheet. Take a paper towel and blot the chicken pieces until they're completely dry. If the chicken is very moist, you may need several paper towels."
                },
                {
                    "headline": "Season the chicken and coat them with flour.",
                    "description": "Sprinkle the chicken with salt and pepper. Put 1 cup (125 g) of all-purpose flour into a shallow bowl and place the chicken pieces in it. Turn the chicken over so they're completely coated with the flour."
                },
                {
                    "headline": "Beat 2 eggs in a bowl and dip the chicken into them.",
                    "description": "Crack 2 eggs into a bowl and whisk them until they're uniform in color. Transfer the chicken from the dish of flour and lower them into the beaten eggs. Shake off the excess flour before you put them into the beaten eggs."
                },
                {
                    "headline": "Coat the chicken with the breadcrumbs and bake it for 5 to 10 minutes.",
                    "description": "Put the baking sheet with the chicken into the preheated oven. Bake the chicken until the breadcrumbs become completely crispy and the chicken appears to be fried. Keep the chicken pieces on the wire rack that's on the baking sheet."
                },
                {
                    "headline": "Remove and serve the chicken.",
                    "description": "Turn off the oven and take the chicken out of the oven. Put the chicken on a platter and serve it immediately with your favorite sides. For example, serve the chicken with mashed potatoes, green beans, or biscuits. Refrigerate the leftover chicken in an airtight container in the refrigerator for up to 3 to 4 days. Keep in mind that the chicken breading will become soggy as it's stored."
                }
            ]
        }
    ],
    "tyn": [
        "Measuring cups and spoons",
        "Pressure cooker",
        "Steamer basket",
        "Instant-read meat thermometer",
        "Skillet",
        "Spoon",
        "Shallow bowls",
        "Whisk or fork",
        "Baking sheet",
        "Wire rack",
        "Platter"
    ],
    "text": " Pressure Cooking the Chicken Pour cold water into the pressure cooker and put a steamer basket in it. Put 1 cup (240 ml) of cold water into the pressure cooker and set a steamer basket down into the cooker. If you're using a steamer basket that didn't come with your pressure cooker, ensure that it will fit inside your machine. Arrange chicken pieces in the steamer basket. Get out 6 chicken thighs and place them in the steamer basket. If you need to, you can stack the thighs so they're loosely touching. Avoid overcrowding the basket. If you want to make more chicken, cook the chicken in batches. If you prefer, use a combination of breasts, wings, or drumsticks. Cook the chicken at high pressure for 6 to 9 minutes. Put the lid on the cooker and secure it closed. Turn the pressure cooker onto high pressure and set the timer to 6 minutes, if you're using small thighs. If you're using large thighs, they'll probably need closer to 9 minutes to pressure cook. Turn off the heat and let the pressure release naturally. Once the chicken has pressure cooked, turn off the heat and select \"Full Natural Release.\" This will allow the pressure to gradually. Then you can open the lid of the machine. Most pressure cookers take about 10 minutes for the pressure to naturally release. Making the Crispy Breading Heat butter and olive oil over medium heat. Set a skillet on the stove and pour 2 tablespoons (30 ml) of olive oil into it. Add 2 tablespoons (29.6 ml) (28 g) of unsalted butter and turn the burner on to medium heat. The butter should melt and combine with the oil. Stir 1 to 1 ½ cups (62 to 93 g) of panko breadcrumbs into the skillet. Add the panko breadcrumbs to the butter and oil mixture. Stir until the breadcrumbs have absorbed the mixture. If you're using smaller thighs, you may only need 1 cup (62 g) of the breadcrumbs. If you don't have panko  breadcrumbs, you can substitute dried breadcrumbs but they won't crisp up as much. Heat the breadcrumbs for about 3 to 5 minutes. Continue to cook and stir the breadcrumbs frequently until they become rich, golden brown. Then stir in kosher salt according to your taste. Watch the breadcrumbs closely while they're toasting since they can burn quickly. Baking the Chicken Preheat the oven to 400 °F (204 °C) and set a rack on a sheet. Get out a large baking sheet and put a large wire rack on it. The wire rack will allow air to circulate under the chicken as it bakes. This will make the chicken even crispier. Check the chicken temperature to see if it's reached 160 °F (71 °C). Insert an instant-read meat thermometer into the thickest part of a chicken thigh to ensure that it's reached 160 °F (71 °C). Keep in mind that the chicken will cook more when you put it into the oven to crisp up. If the chicken hasn't reached temperature, close the pressure cooker and turn it back on to high for 3 to 5 more minutes. Remove the chicken and pat the pieces dry with a paper towel. Lift the steamer basket out of the pressure cooker and lay the pieces of chicken on a baking sheet. Take a paper towel and blot the chicken pieces until they're completely dry. If the chicken is very moist, you may need several paper towels. Season the chicken and coat them with flour. Sprinkle the chicken with salt and pepper. Put 1 cup (125 g) of all-purpose flour into a shallow bowl and place the chicken pieces in it. Turn the chicken over so they're completely coated with the flour. Beat 2 eggs in a bowl and dip the chicken into them. Crack 2 eggs into a bowl and whisk them until they're uniform in color. Transfer the chicken from the dish of flour and lower them into the beaten eggs. Shake off the excess flour before you put them into the beaten eggs. Coat the chicken with the breadcrumbs and bake it for 5 to 10 minutes. Put the baking sheet with the chicken into the preheated oven. Bake the chicken until the breadcrumbs become completely crispy and the chicken appears to be fried. Keep the chicken pieces on the wire rack that's on the baking sheet. Remove and serve the chicken. Turn off the oven and take the chicken out of the oven. Put the chicken on a platter and serve it immediately with your favorite sides. For example, serve the chicken with mashed potatoes, green beans, or biscuits. Refrigerate the leftover chicken in an airtight container in the refrigerator for up to 3 to 4 days. Keep in mind that the chicken breading will become soggy as it's stored.",
    "sentences": [
        " Pressure Cooking the Chicken Pour cold water into the pressure cooker and put a steamer basket in it.",
        "Put 1 cup (240 ml) of cold water into the pressure cooker and set a steamer basket down into the cooker.",
        "If you're using a steamer basket that didn't come with your pressure cooker, ensure that it will fit inside your machine.",
        "Arrange chicken pieces in the steamer basket.",
        "Get out 6 chicken thighs and place them in the steamer basket.",
        "If you need to, you can stack the thighs so they're loosely touching.",
        "Avoid overcrowding the basket.",
        "If you want to make more chicken, cook the chicken in batches.",
        "If you prefer, use a combination of breasts, wings, or drumsticks.",
        "Cook the chicken at high pressure for 6 to 9 minutes.",
        "Put the lid on the cooker and secure it closed.",
        "Turn the pressure cooker onto high pressure and set the timer to 6 minutes, if you're using small thighs.",
        "If you're using large thighs, they'll probably need closer to 9 minutes to pressure cook.",
        "Turn off the heat and let the pressure release naturally.",
        "Once the chicken has pressure cooked, turn off the heat and select \"Full Natural Release.\"",
        "This will allow the pressure to gradually.",
        "Then you can open the lid of the machine.",
        "Most pressure cookers take about 10 minutes for the pressure to naturally release.",
        "Making the Crispy Breading Heat butter and olive oil over medium heat.",
        "Set a skillet on the stove and pour 2 tablespoons (30 ml) of olive oil into it.",
        "Add 2 tablespoons (29.6 ml) (28 g) of unsalted butter and turn the burner on to medium heat.",
        "The butter should melt and combine with the oil.",
        "Stir 1 to 1 ½ cups (62 to 93 g) of panko breadcrumbs into the skillet.",
        "Add the panko breadcrumbs to the butter and oil mixture.",
        "Stir until the breadcrumbs have absorbed the mixture.",
        "If you're using smaller thighs, you may only need 1 cup (62 g) of the breadcrumbs.",
        "If you don't have panko  breadcrumbs, you can substitute dried breadcrumbs but they won't crisp up as much.",
        "Heat the breadcrumbs for about 3 to 5 minutes.",
        "Continue to cook and stir the breadcrumbs frequently until they become rich, golden brown.",
        "Then stir in kosher salt according to your taste.",
        "Watch the breadcrumbs closely while they're toasting since they can burn quickly.",
        "Baking the Chicken Preheat the oven to 400 °F (204 °C) and set a rack on a sheet.",
        "Get out a large baking sheet and put a large wire rack on it.",
        "The wire rack will allow air to circulate under the chicken as it bakes.",
        "This will make the chicken even crispier.",
        "Check the chicken temperature to see if it's reached 160 °F (71 °C).",
        "Insert an instant-read meat thermometer into the thickest part of a chicken thigh to ensure that it's reached 160 °F (71 °C).",
        "Keep in mind that the chicken will cook more when you put it into the oven to crisp up.",
        "If the chicken hasn't reached temperature, close the pressure cooker and turn it back on to high for 3 to 5 more minutes.",
        "Remove the chicken and pat the pieces dry with a paper towel.",
        "Lift the steamer basket out of the pressure cooker and lay the pieces of chicken on a baking sheet.",
        "Take a paper towel and blot the chicken pieces until they're completely dry.",
        "If the chicken is very moist, you may need several paper towels.",
        "Season the chicken and coat them with flour.",
        "Sprinkle the chicken with salt and pepper.",
        "Put 1 cup (125 g) of all-purpose flour into a shallow bowl and place the chicken pieces in it.",
        "Turn the chicken over so they're completely coated with the flour.",
        "Beat 2 eggs in a bowl and dip the chicken into them.",
        "Crack 2 eggs into a bowl and whisk them until they're uniform in color.",
        "Transfer the chicken from the dish of flour and lower them into the beaten eggs.",
        "Shake off the excess flour before you put them into the beaten eggs.",
        "Coat the chicken with the breadcrumbs and bake it for 5 to 10 minutes.",
        "Put the baking sheet with the chicken into the preheated oven.",
        "Bake the chicken until the breadcrumbs become completely crispy and the chicken appears to be fried.",
        "Keep the chicken pieces on the wire rack that's on the baking sheet.",
        "Remove and serve the chicken.",
        "Turn off the oven and take the chicken out of the oven.",
        "Put the chicken on a platter and serve it immediately with your favorite sides.",
        "For example, serve the chicken with mashed potatoes, green beans, or biscuits.",
        "Refrigerate the leftover chicken in an airtight container in the refrigerator for up to 3 to 4 days.",
        "Keep in mind that the chicken breading will become soggy as it's stored."
    ]
}