{
    "title": "How to Make a Slip Knot",
    "url": "https://www.wikihow.com/Make-a-Slip-Knot",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Knitting and Crochet"
    ],
    "methods": [
        {
            "name": "Looping, Pinching, and Pulling Up",
            "steps": [
                {
                    "headline": "Pinching with two fingers, pick up the yarn roughly 6-8\" from the end.",
                    "description": "It should drop down into a U-shape as it falls under your fingers. You don't need to measure the yarn precisely; just give yourself enough extra yarn to work with. This U-shape is called a \"bight\" in knot tying."
                },
                {
                    "headline": "Twist your fingers clockwise to make the yarn cross over, forming a loop.",
                    "description": "All it requires is a half turn or so, and the yarn should naturally cross over itself."
                },
                {
                    "headline": "Put your two fingers inside the loop, expanding it out.",
                    "description": "Make sure your other hand is holding onto the strands of yarn below your loop, keeping the shape intact."
                },
                {
                    "headline": "Using the fingers in the loop, grab the standing yarn and pull it  partially through.",
                    "description": "The standing yarn is the line that leads back to your ball of yarn. The shorter side, leading to the end, is called the tail. Pulling the standing line through will form another bight (U-shaped bend in the yarn). You only need to pull a few inches of yarn through."
                },
                {
                    "headline": "Pull the tail of the yarn to tighten the knot about halfway.",
                    "description": "You don't want to cinch the whole thing down yet. You can, however, pull on the tail to bring the knot closer together and \"clean it up.\" It should look a bit like a noose, with a knot on the bottom of a yarn loop."
                },
                {
                    "headline": "Slide your knitting needle or crochet hook into the loop and pull both ends of yarn tight.",
                    "description": "A slip knot almost always goes around something, as the beauty of the know is how easily it tightens and loosens around an object. Pull both the tail and standing line simultaneously to tighten your slip knot."
                }
            ]
        },
        {
            "name": "Feeding a Loop into a Loop",
            "steps": [
                {
                    "headline": "Pick up the yarn approximately 12 centimeter (4.7 in) (5in) from the end.",
                    "description": "This will create a U-shaped \"bight\" in the yarn."
                },
                {
                    "headline": "Create a loop by taking the long end of the yarn (standing line) and winding it over the top of the shorter end (tail).",
                    "description": "Hold the point where the yarns cross tightly between your left thumb and forefinger."
                },
                {
                    "headline": "Using your right hand, pick up the standing line of yarn to form another bight.",
                    "description": "Remember, the standing line is the part leading back to your yarn ball. Form another half-loop here, like you did in step one of this method."
                },
                {
                    "headline": "Feed this second bite through the back of the loop.",
                    "description": "This will create a loop in a loop."
                },
                {
                    "headline": "Pull on the tail of the knot to tighten the first loop around the second.",
                    "description": "This will make the knot much cleaner and easier to manage."
                },
                {
                    "headline": "Feed your knitting needles or crochet hook into the remaining loop and pull the long end of the yarn to close the loop over the needle.",
                    "description": "This is all you need for your slipknot."
                }
            ]
        },
        {
            "name": "Looping and Pushing Through",
            "steps": [
                {
                    "headline": "Pull out about ten inches of yarn from your yarn ball.",
                    "description": "The exact amount doesn't matter -- you just need enough to work with comfortably."
                },
                {
                    "headline": "Make a 1\" loop in the yarn by tucking the end of the yarn under the rest of the yarn.",
                    "description": "Simply double the yarn back on itself, then slide the end underneath the rest of the yarn to make a circle."
                },
                {
                    "headline": "Flip the loop back down so it lays on top of the rest of the yarn.",
                    "description": "Make sure you flip it towards the side with the rest of the yarn, not the side with the end of the yarn."
                },
                {
                    "headline": "Pick up the yarn inside the loop and pull it through.",
                    "description": "Simply pinch the straight line of yarn underneath your loop and pull it through 1-2\". It should naturally form another loop."
                },
                {
                    "headline": "Pull the end of the yarn to get the knot tight, keeping the loop at the top open.",
                    "description": "You only want to tighten it enough to close the first loop you made, leaving the other loop open on top. It looks a bit like a noose."
                },
                {
                    "headline": "Slip the knot onto a knitting needle or crochet hook and pull both ends to tighten the knot.",
                    "description": "Put the knitting needle in through the remaining loop and pull both ends of yarn to make it snug."
                }
            ]
        }
    ],
    "tyn": [
        "A ball of yarn or string",
        "A knitting needle",
        "If no knitting needle you can use your hands"
    ],
    "text": " Looping, Pinching, and Pulling Up Pinching with two fingers, pick up the yarn roughly 6-8\" from the end. It should drop down into a U-shape as it falls under your fingers. You don't need to measure the yarn precisely; just give yourself enough extra yarn to work with. This U-shape is called a \"bight\" in knot tying. Twist your fingers clockwise to make the yarn cross over, forming a loop. All it requires is a half turn or so, and the yarn should naturally cross over itself. Put your two fingers inside the loop, expanding it out. Make sure your other hand is holding onto the strands of yarn below your loop, keeping the shape intact. Using the fingers in the loop, grab the standing yarn and pull it  partially through. The standing yarn is the line that leads back to your ball of yarn. The shorter side, leading to the end, is called the tail. Pulling the standing line through will form another bight (U-shaped bend in the yarn). You only need to pull a few inches of yarn through. Pull the tail of the yarn to tighten the knot about halfway. You don't want to cinch the whole thing down yet. You can, however, pull on the tail to bring the knot closer together and \"clean it up.\" It should look a bit like a noose, with a knot on the bottom of a yarn loop. Slide your knitting needle or crochet hook into the loop and pull both ends of yarn tight. A slip knot almost always goes around something, as the beauty of the know is how easily it tightens and loosens around an object. Pull both the tail and standing line simultaneously to tighten your slip knot. Feeding a Loop into a Loop Pick up the yarn approximately 12 centimeter (4.7 in) (5in) from the end. This will create a U-shaped \"bight\" in the yarn. Create a loop by taking the long end of the yarn (standing line) and winding it over the top of the shorter end (tail). Hold the point where the yarns cross tightly between your left thumb and forefinger. Using your right hand, pick up the standing line of yarn to form another bight. Remember, the standing line is the part leading back to your yarn ball. Form another half-loop here, like you did in step one of this method. Feed this second bite through the back of the loop. This will create a loop in a loop. Pull on the tail of the knot to tighten the first loop around the second. This will make the knot much cleaner and easier to manage. Feed your knitting needles or crochet hook into the remaining loop and pull the long end of the yarn to close the loop over the needle. This is all you need for your slipknot. Looping and Pushing Through Pull out about ten inches of yarn from your yarn ball. The exact amount doesn't matter -- you just need enough to work with comfortably. Make a 1\" loop in the yarn by tucking the end of the yarn under the rest of the yarn. Simply double the yarn back on itself, then slide the end underneath the rest of the yarn to make a circle. Flip the loop back down so it lays on top of the rest of the yarn. Make sure you flip it towards the side with the rest of the yarn, not the side with the end of the yarn. Pick up the yarn inside the loop and pull it through. Simply pinch the straight line of yarn underneath your loop and pull it through 1-2\". It should naturally form another loop. Pull the end of the yarn to get the knot tight, keeping the loop at the top open. You only want to tighten it enough to close the first loop you made, leaving the other loop open on top. It looks a bit like a noose. Slip the knot onto a knitting needle or crochet hook and pull both ends to tighten the knot. Put the knitting needle in through the remaining loop and pull both ends of yarn to make it snug.",
    "sentences": [
        " Looping, Pinching, and Pulling Up Pinching with two fingers, pick up the yarn roughly 6-8\" from the end.",
        "It should drop down into a U-shape as it falls under your fingers.",
        "You don't need to measure the yarn precisely; just give yourself enough extra yarn to work with.",
        "This U-shape is called a \"bight\" in knot tying.",
        "Twist your fingers clockwise to make the yarn cross over, forming a loop.",
        "All it requires is a half turn or so, and the yarn should naturally cross over itself.",
        "Put your two fingers inside the loop, expanding it out.",
        "Make sure your other hand is holding onto the strands of yarn below your loop, keeping the shape intact.",
        "Using the fingers in the loop, grab the standing yarn and pull it  partially through.",
        "The standing yarn is the line that leads back to your ball of yarn.",
        "The shorter side, leading to the end, is called the tail.",
        "Pulling the standing line through will form another bight (U-shaped bend in the yarn).",
        "You only need to pull a few inches of yarn through.",
        "Pull the tail of the yarn to tighten the knot about halfway.",
        "You don't want to cinch the whole thing down yet.",
        "You can, however, pull on the tail to bring the knot closer together and \"clean it up.\"",
        "It should look a bit like a noose, with a knot on the bottom of a yarn loop.",
        "Slide your knitting needle or crochet hook into the loop and pull both ends of yarn tight.",
        "A slip knot almost always goes around something, as the beauty of the know is how easily it tightens and loosens around an object.",
        "Pull both the tail and standing line simultaneously to tighten your slip knot.",
        "Feeding a Loop into a Loop Pick up the yarn approximately 12 centimeter (4.7 in) (5in) from the end.",
        "This will create a U-shaped \"bight\" in the yarn.",
        "Create a loop by taking the long end of the yarn (standing line) and winding it over the top of the shorter end (tail).",
        "Hold the point where the yarns cross tightly between your left thumb and forefinger.",
        "Using your right hand, pick up the standing line of yarn to form another bight.",
        "Remember, the standing line is the part leading back to your yarn ball.",
        "Form another half-loop here, like you did in step one of this method.",
        "Feed this second bite through the back of the loop.",
        "This will create a loop in a loop.",
        "Pull on the tail of the knot to tighten the first loop around the second.",
        "This will make the knot much cleaner and easier to manage.",
        "Feed your knitting needles or crochet hook into the remaining loop and pull the long end of the yarn to close the loop over the needle.",
        "This is all you need for your slipknot.",
        "Looping and Pushing Through Pull out about ten inches of yarn from your yarn ball.",
        "The exact amount doesn't matter -- you just need enough to work with comfortably.",
        "Make a 1\" loop in the yarn by tucking the end of the yarn under the rest of the yarn.",
        "Simply double the yarn back on itself, then slide the end underneath the rest of the yarn to make a circle.",
        "Flip the loop back down so it lays on top of the rest of the yarn.",
        "Make sure you flip it towards the side with the rest of the yarn, not the side with the end of the yarn.",
        "Pick up the yarn inside the loop and pull it through.",
        "Simply pinch the straight line of yarn underneath your loop and pull it through 1-2\".",
        "It should naturally form another loop.",
        "Pull the end of the yarn to get the knot tight, keeping the loop at the top open.",
        "You only want to tighten it enough to close the first loop you made, leaving the other loop open on top.",
        "It looks a bit like a noose.",
        "Slip the knot onto a knitting needle or crochet hook and pull both ends to tighten the knot.",
        "Put the knitting needle in through the remaining loop and pull both ends of yarn to make it snug."
    ]
}