{
    "title": "How to Make Chocolate Syrup",
    "url": "https://www.wikihow.com/Make-Chocolate-Syrup",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments",
        "Syrups"
    ],
    "steps": [
        {
            "headline": "Whisk together cocoa, sugar and salt in a 2 or 3-quart saucepan.",
            "description": "It may seem like you don't need that much space, but the liquid will seem to increase in volume -- and it prevents splashing! To reduce the caloric content of the syrup you can use Splenda instead of sugar. But take note: if you're doing this, do not bake with it -- just use it as a drink mix or topping. Also, you'll have to use it within a couple days of making as it does not store well (when made with Splenda, that is)."
        },
        {
            "headline": "Whisk in the cold water.",
            "description": "Continue whisking until it's smooth and the lumps are gone."
        },
        {
            "headline": "Cook over medium heat, bringing it to a light boil for 3 minutes.",
            "description": "Keep whisking it occasionally, but take it off the heat once the 3 minutes are up. It won't thicken just yet, so don't worry if it's still too thin."
        },
        {
            "headline": "Add in the vanilla as it's cooling.",
            "description": "You can also give 'er a quick taste test and see if you'd like to add in a pinch more salt or a bit extra vanilla. Just don't burn your tongue!"
        },
        {
            "headline": "Pour into a resealable container and store in the refrigerator.",
            "description": "If you made it with regular sugar, it should keep for around a month. All the more reason to bake tons of chocolate-y recipes!"
        },
        {
            "headline": "Use on the treat of your choice and enjoy!",
            "description": "Because how could you not?! And if you're feeling sneaky, put your homemade syrup into a chocolate syrup bottle and see if anyone notices!"
        }
    ],
    "tyn": [
        "Measuring cups and spoons",
        "Saucepan",
        "Whisk",
        "Storage container"
    ],
    "text": " Whisk together cocoa, sugar and salt in a 2 or 3-quart saucepan. It may seem like you don't need that much space, but the liquid will seem to increase in volume -- and it prevents splashing! To reduce the caloric content of the syrup you can use Splenda instead of sugar. But take note: if you're doing this, do not bake with it -- just use it as a drink mix or topping. Also, you'll have to use it within a couple days of making as it does not store well (when made with Splenda, that is). Whisk in the cold water. Continue whisking until it's smooth and the lumps are gone. Cook over medium heat, bringing it to a light boil for 3 minutes. Keep whisking it occasionally, but take it off the heat once the 3 minutes are up. It won't thicken just yet, so don't worry if it's still too thin. Add in the vanilla as it's cooling. You can also give 'er a quick taste test and see if you'd like to add in a pinch more salt or a bit extra vanilla. Just don't burn your tongue! Pour into a resealable container and store in the refrigerator. If you made it with regular sugar, it should keep for around a month. All the more reason to bake tons of chocolate-y recipes! Use on the treat of your choice and enjoy! Because how could you not?! And if you're feeling sneaky, put your homemade syrup into a chocolate syrup bottle and see if anyone notices!",
    "sentences": [
        " Whisk together cocoa, sugar and salt in a 2 or 3-quart saucepan.",
        "It may seem like you don't need that much space, but the liquid will seem to increase in volume -- and it prevents splashing!",
        "To reduce the caloric content of the syrup you can use Splenda instead of sugar.",
        "But take note: if you're doing this, do not bake with it -- just use it as a drink mix or topping.",
        "Also, you'll have to use it within a couple days of making as it does not store well (when made with Splenda, that is).",
        "Whisk in the cold water.",
        "Continue whisking until it's smooth and the lumps are gone.",
        "Cook over medium heat, bringing it to a light boil for 3 minutes.",
        "Keep whisking it occasionally, but take it off the heat once the 3 minutes are up.",
        "It won't thicken just yet, so don't worry if it's still too thin.",
        "Add in the vanilla as it's cooling.",
        "You can also give 'er a quick taste test and see if you'd like to add in a pinch more salt or a bit extra vanilla.",
        "Just don't burn your tongue!",
        "Pour into a resealable container and store in the refrigerator.",
        "If you made it with regular sugar, it should keep for around a month.",
        "All the more reason to bake tons of chocolate-y recipes!",
        "Use on the treat of your choice and enjoy!",
        "Because how could you not?!",
        "And if you're feeling sneaky, put your homemade syrup into a chocolate syrup bottle and see if anyone notices!"
    ]
}