{
    "title": "How to Fix a Crack in Your Ukulele",
    "url": "https://www.wikihow.com/Fix-a-Crack-in-Your-Ukulele",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music",
        "Musical Instruments",
        "String Instruments",
        "Ukulele"
    ],
    "parts": [
        {
            "name": "Cleaning the Ukulele for Repair",
            "steps": [
                {
                    "headline": "Examine the crack to determine if it is small enough to repair with glue.",
                    "description": "You can fill hairline cracks yourself with wood glue. Anything bigger than a hairline crack will need to be fixed by a professional. Ukuleles usually develop small cracks because they are kept in very dry conditions. Ukuleles need to be kept in humidity levels of 40-60% to prevent cracking. Note that this method only works for repairing cracks in wooden ukuleles. Ukuleles made of other materials, or that are laminated, are not likely to develop cracks."
                },
                {
                    "headline": "Cover a flat work surface with old newspaper to protect it.",
                    "description": "Select a surface where you can work comfortably, such as a table or desk. Cover it to protect it from any accidental glue drips. The newspapers will also protect your ukulele from anything rough on the work surface that could scratch it."
                },
                {
                    "headline": "Place your ukulele on the surface with the crack facing up.",
                    "description": "Set it down flat on the surface if the crack is on the front or back. Hold it carefully up on its side if the crack is on the side. If it’s more comfortable, you can hold the ukulele between your knees if the crack is on the side."
                },
                {
                    "headline": "Wipe the ukulele clean with a clean damp cloth and then dry it.",
                    "description": "Wipe away any dirt, dust, or whatever might be stuck to your ukulele so that you don't rub it into the crack while you are filling it. Wipe it again with a clean dry cloth to dry it off completely. Tip: Microfiber cloths work particularly well for cleaning off dust and dirt from your ukulele. Make sure to wring the damp cloth out well before you clean the ukulele. You want it to be just barely wet and not dripping. Don’t use any type of cleaning liquids. These liquids can get in the crack and cause the wood to swell and warp."
                }
            ]
        },
        {
            "name": "Gluing the Crack",
            "steps": [
                {
                    "headline": "Get some wood glue to fill the crack with.",
                    "description": "Purchase wood glue at a hardware store or home improvement center. The glue will be ready to use right out of the bottle. You can do a quick search online to find recommended brands of wood glue for instrument repair. Any carpenter’s wood glue will work fine for fixing a hairline crack in your ukulele. There is no need for any stronger kind of glue."
                },
                {
                    "headline": "Apply glue to the length of the crack.",
                    "description": "Squeeze a small line of glue out of the bottle along the whole length of the crack. Make sure you cover it all the way to each end of the crack. You can also apply the glue with a very small brush if you don’t have a squeeze bottle."
                },
                {
                    "headline": "Rub the glue into the crack with your index finger.",
                    "description": "Rub your finger all the way down the crack and back to press the glue down into it. Repeat this 2-3 times to make sure the glue gets all the way down into the crack. Wood glue is easy to get off your skin with just soap and water as long as it is still wet. Wash your hands as soon as you are done rubbing the glue in so it doesn’t dry on your skin."
                },
                {
                    "headline": "Remove excess glue from the surface with a wet cloth.",
                    "description": "Wipe a clean, just barely damp cloth over top of the crack where you put the glue to remove all the glue that isn’t inside the crack. Make sure to wipe the ukulele well so the remaining glue doesn’t dry onto the finish of the instrument. Wring out the cloth extremely well before you wipe the glue away so it doesn’t drip any water down into the crack on top of the glue."
                },
                {
                    "headline": "Put the ukulele in its case with a humidifier to prevent future cracking.",
                    "description": "Instrument humidifiers are a relatively inexpensive accessory that will keep your ukulele at the right humidity levels in its case. This will ensure that it doesn’t develop more cracks due to dry conditions. Tip: Don’t play the ukulele for at least a day while the glue dries completely in the crack. Just leave it in the case. You can purchase a ukulele humidifier online or at an instrument store for less than $20 USD."
                }
            ]
        }
    ],
    "tyn": [
        "Flat work surface",
        "Newspaper",
        "Wood glue",
        "Clean cloths",
        "Ukulele case",
        "Ukulele humidifier"
    ],
    "text": " Cleaning the Ukulele for Repair Examine the crack to determine if it is small enough to repair with glue. You can fill hairline cracks yourself with wood glue. Anything bigger than a hairline crack will need to be fixed by a professional. Ukuleles usually develop small cracks because they are kept in very dry conditions. Ukuleles need to be kept in humidity levels of 40-60% to prevent cracking. Note that this method only works for repairing cracks in wooden ukuleles. Ukuleles made of other materials, or that are laminated, are not likely to develop cracks. Cover a flat work surface with old newspaper to protect it. Select a surface where you can work comfortably, such as a table or desk. Cover it to protect it from any accidental glue drips. The newspapers will also protect your ukulele from anything rough on the work surface that could scratch it. Place your ukulele on the surface with the crack facing up. Set it down flat on the surface if the crack is on the front or back. Hold it carefully up on its side if the crack is on the side. If it’s more comfortable, you can hold the ukulele between your knees if the crack is on the side. Wipe the ukulele clean with a clean damp cloth and then dry it. Wipe away any dirt, dust, or whatever might be stuck to your ukulele so that you don't rub it into the crack while you are filling it. Wipe it again with a clean dry cloth to dry it off completely. Tip: Microfiber cloths work particularly well for cleaning off dust and dirt from your ukulele. Make sure to wring the damp cloth out well before you clean the ukulele. You want it to be just barely wet and not dripping. Don’t use any type of cleaning liquids. These liquids can get in the crack and cause the wood to swell and warp. Gluing the Crack Get some wood glue to fill the crack with. Purchase wood glue at a hardware store or home improvement center. The glue will be ready to use right out of the bottle. You can do a quick search online to find recommended brands of wood glue for instrument repair. Any carpenter’s wood glue will work fine for fixing a hairline crack in your ukulele. There is no need for any stronger kind of glue. Apply glue to the length of the crack. Squeeze a small line of glue out of the bottle along the whole length of the crack. Make sure you cover it all the way to each end of the crack. You can also apply the glue with a very small brush if you don’t have a squeeze bottle. Rub the glue into the crack with your index finger. Rub your finger all the way down the crack and back to press the glue down into it. Repeat this 2-3 times to make sure the glue gets all the way down into the crack. Wood glue is easy to get off your skin with just soap and water as long as it is still wet. Wash your hands as soon as you are done rubbing the glue in so it doesn’t dry on your skin. Remove excess glue from the surface with a wet cloth. Wipe a clean, just barely damp cloth over top of the crack where you put the glue to remove all the glue that isn’t inside the crack. Make sure to wipe the ukulele well so the remaining glue doesn’t dry onto the finish of the instrument. Wring out the cloth extremely well before you wipe the glue away so it doesn’t drip any water down into the crack on top of the glue. Put the ukulele in its case with a humidifier to prevent future cracking. Instrument humidifiers are a relatively inexpensive accessory that will keep your ukulele at the right humidity levels in its case. This will ensure that it doesn’t develop more cracks due to dry conditions. Tip: Don’t play the ukulele for at least a day while the glue dries completely in the crack. Just leave it in the case. You can purchase a ukulele humidifier online or at an instrument store for less than $20 USD.",
    "sentences": [
        " Cleaning the Ukulele for Repair Examine the crack to determine if it is small enough to repair with glue.",
        "You can fill hairline cracks yourself with wood glue.",
        "Anything bigger than a hairline crack will need to be fixed by a professional.",
        "Ukuleles usually develop small cracks because they are kept in very dry conditions.",
        "Ukuleles need to be kept in humidity levels of 40-60% to prevent cracking.",
        "Note that this method only works for repairing cracks in wooden ukuleles.",
        "Ukuleles made of other materials, or that are laminated, are not likely to develop cracks.",
        "Cover a flat work surface with old newspaper to protect it.",
        "Select a surface where you can work comfortably, such as a table or desk.",
        "Cover it to protect it from any accidental glue drips.",
        "The newspapers will also protect your ukulele from anything rough on the work surface that could scratch it.",
        "Place your ukulele on the surface with the crack facing up.",
        "Set it down flat on the surface if the crack is on the front or back.",
        "Hold it carefully up on its side if the crack is on the side.",
        "If it’s more comfortable, you can hold the ukulele between your knees if the crack is on the side.",
        "Wipe the ukulele clean with a clean damp cloth and then dry it.",
        "Wipe away any dirt, dust, or whatever might be stuck to your ukulele so that you don't rub it into the crack while you are filling it.",
        "Wipe it again with a clean dry cloth to dry it off completely.",
        "Tip: Microfiber cloths work particularly well for cleaning off dust and dirt from your ukulele.",
        "Make sure to wring the damp cloth out well before you clean the ukulele.",
        "You want it to be just barely wet and not dripping.",
        "Don’t use any type of cleaning liquids.",
        "These liquids can get in the crack and cause the wood to swell and warp.",
        "Gluing the Crack Get some wood glue to fill the crack with.",
        "Purchase wood glue at a hardware store or home improvement center.",
        "The glue will be ready to use right out of the bottle.",
        "You can do a quick search online to find recommended brands of wood glue for instrument repair.",
        "Any carpenter’s wood glue will work fine for fixing a hairline crack in your ukulele.",
        "There is no need for any stronger kind of glue.",
        "Apply glue to the length of the crack.",
        "Squeeze a small line of glue out of the bottle along the whole length of the crack.",
        "Make sure you cover it all the way to each end of the crack.",
        "You can also apply the glue with a very small brush if you don’t have a squeeze bottle.",
        "Rub the glue into the crack with your index finger.",
        "Rub your finger all the way down the crack and back to press the glue down into it.",
        "Repeat this 2-3 times to make sure the glue gets all the way down into the crack.",
        "Wood glue is easy to get off your skin with just soap and water as long as it is still wet.",
        "Wash your hands as soon as you are done rubbing the glue in so it doesn’t dry on your skin.",
        "Remove excess glue from the surface with a wet cloth.",
        "Wipe a clean, just barely damp cloth over top of the crack where you put the glue to remove all the glue that isn’t inside the crack.",
        "Make sure to wipe the ukulele well so the remaining glue doesn’t dry onto the finish of the instrument.",
        "Wring out the cloth extremely well before you wipe the glue away so it doesn’t drip any water down into the crack on top of the glue.",
        "Put the ukulele in its case with a humidifier to prevent future cracking.",
        "Instrument humidifiers are a relatively inexpensive accessory that will keep your ukulele at the right humidity levels in its case.",
        "This will ensure that it doesn’t develop more cracks due to dry conditions.",
        "Tip: Don’t play the ukulele for at least a day while the glue dries completely in the crack.",
        "Just leave it in the case.",
        "You can purchase a ukulele humidifier online or at an instrument store for less than $20 USD."
    ]
}