{
    "title": "How to Play Statues",
    "url": "https://www.wikihow.com/Play-Statues",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Playground Games"
    ],
    "steps": [
        {
            "headline": "Arrange all the players except one on chairs or a bench.",
            "description": "The player not seated is the leader and she stands on the floor in front of the other players."
        },
        {
            "headline": "Start the game.",
            "description": "Beginning at one end of the row, she pulls each player from the bench, letting her remain in whatever position she falls."
        },
        {
            "headline": "Describe the statue pose.",
            "description": "Sometimes the leader can tell the other players how to pose, for instance, she will say \"Like an angel,\" and that player will fold her hands and look upward. Another might be \"cross school-teacher,\" and this player may pretend to be scolding someone."
        },
        {
            "headline": "Stay still!",
            "description": "Each player remains perfectly still, posed in the attitude suggested, until all the players are on the floor."
        },
        {
            "headline": "Choose the winner.",
            "description": "Have the leader select the player she thinks has posed the best and that one takes the leader's place and the game goes on as before."
        }
    ],
    "tyn": [
        "Chairs or bench",
        "Camera"
    ],
    "text": " Arrange all the players except one on chairs or a bench. The player not seated is the leader and she stands on the floor in front of the other players. Start the game. Beginning at one end of the row, she pulls each player from the bench, letting her remain in whatever position she falls. Describe the statue pose. Sometimes the leader can tell the other players how to pose, for instance, she will say \"Like an angel,\" and that player will fold her hands and look upward. Another might be \"cross school-teacher,\" and this player may pretend to be scolding someone. Stay still! Each player remains perfectly still, posed in the attitude suggested, until all the players are on the floor. Choose the winner. Have the leader select the player she thinks has posed the best and that one takes the leader's place and the game goes on as before.",
    "sentences": [
        " Arrange all the players except one on chairs or a bench.",
        "The player not seated is the leader and she stands on the floor in front of the other players.",
        "Start the game.",
        "Beginning at one end of the row, she pulls each player from the bench, letting her remain in whatever position she falls.",
        "Describe the statue pose.",
        "Sometimes the leader can tell the other players how to pose, for instance, she will say \"Like an angel,\" and that player will fold her hands and look upward.",
        "Another might be \"cross school-teacher,\" and this player may pretend to be scolding someone.",
        "Stay still!",
        "Each player remains perfectly still, posed in the attitude suggested, until all the players are on the floor.",
        "Choose the winner.",
        "Have the leader select the player she thinks has posed the best and that one takes the leader's place and the game goes on as before."
    ]
}