{
    "title": "How to Make Dangly Earrings",
    "url": "https://www.wikihow.com/Make-Dangly-Earrings",
    "category_hierarchy": [
        "Personal Care and Style",
        "Tattoos and Piercing",
        "Piercings",
        "Ear Piercing"
    ],
    "steps": [
        {
            "headline": "Assemble the basic equipment listed below.",
            "description": "Most of these are available at craft shops or at a specialist bead shop - try to search online if there is not one near you."
        },
        {
            "headline": "Set up your work space.",
            "description": "You'll need a clear space and a well lit area. Always work on a tray, just in case the beads split."
        },
        {
            "headline": "Choose a design.",
            "description": "There are no limits to your imagination, and the internet also has lots of ideas for earring designs, but remember to try to stick to the level you are currently working at. The easiest types are simple drop earrings, and how to make these are described below."
        },
        {
            "headline": "Using head pins, arrange the beads onto the pin in the order you want them to be on the earring.",
            "description": ""
        },
        {
            "headline": "Use the round-nosed pliers to bend the wire 90 degrees, cut to allow approximately 1 centimeter (0.4 in) past the bend.",
            "description": ""
        },
        {
            "headline": "Again using the pliers, bend the wire into a loop, but leave it slightly open for now.",
            "description": ""
        },
        {
            "headline": "Pass the loop of the headpin through the earring loop, and then close the loop using the pliers.",
            "description": ""
        },
        {
            "headline": "Repeat for a pair.",
            "description": ""
        }
    ],
    "tyn": [
        "Round nosed pliers",
        "Wire cutters (or strong scissors)",
        "Earring loops",
        "Headpins",
        "Jewelry wire",
        "Beads."
    ],
    "text": " Assemble the basic equipment listed below. Most of these are available at craft shops or at a specialist bead shop - try to search online if there is not one near you. Set up your work space. You'll need a clear space and a well lit area. Always work on a tray, just in case the beads split. Choose a design. There are no limits to your imagination, and the internet also has lots of ideas for earring designs, but remember to try to stick to the level you are currently working at. The easiest types are simple drop earrings, and how to make these are described below. Using head pins, arrange the beads onto the pin in the order you want them to be on the earring.  Use the round-nosed pliers to bend the wire 90 degrees, cut to allow approximately 1 centimeter (0.4 in) past the bend.  Again using the pliers, bend the wire into a loop, but leave it slightly open for now.  Pass the loop of the headpin through the earring loop, and then close the loop using the pliers.  Repeat for a pair. ",
    "sentences": [
        " Assemble the basic equipment listed below.",
        "Most of these are available at craft shops or at a specialist bead shop - try to search online if there is not one near you.",
        "Set up your work space.",
        "You'll need a clear space and a well lit area.",
        "Always work on a tray, just in case the beads split.",
        "Choose a design.",
        "There are no limits to your imagination, and the internet also has lots of ideas for earring designs, but remember to try to stick to the level you are currently working at.",
        "The easiest types are simple drop earrings, and how to make these are described below.",
        "Using head pins, arrange the beads onto the pin in the order you want them to be on the earring.",
        "Use the round-nosed pliers to bend the wire 90 degrees, cut to allow approximately 1 centimeter (0.4 in) past the bend.",
        "Again using the pliers, bend the wire into a loop, but leave it slightly open for now.",
        "Pass the loop of the headpin through the earring loop, and then close the loop using the pliers.",
        "Repeat for a pair."
    ]
}