{
    "title": "How to Draw Toothless",
    "url": "https://www.wikihow.com/Draw-Toothless",
    "category_hierarchy": [
        "Arts and Entertainment"
    ],
    "methods": [
        {
            "name": "Toothless (regular)",
            "steps": [
                {
                    "headline": "Draw a medium circle near the topmost area of the paper.",
                    "description": ""
                },
                {
                    "headline": "Draw a stretched egg-shaped oval (vertical orientation) and intersect it with the circle.",
                    "description": ""
                },
                {
                    "headline": "Draw a pair of little egg-shaped ovals at the base of the bigger oval.",
                    "description": "Intersect each at both sides of the bigger oval."
                },
                {
                    "headline": "Draw the outline for Toothless' front legs and wings.",
                    "description": ""
                },
                {
                    "headline": "Draw facial guide lines (a vertical line with two horizontal lines across it, forming a kind of two-beamed cross).",
                    "description": "This will help in placing Toothless' eyes."
                },
                {
                    "headline": "Using the facial line guides, start drawing Toothless' eyes and nose (in this orientation, he is looking down).",
                    "description": ""
                },
                {
                    "headline": "Draw Toothless' big ears and little horns on top of his head.",
                    "description": "Place dashed lines in between his forehead going towards the back of his head, to make a lizard's scale impression."
                },
                {
                    "headline": "Trace Toothless' front legs with claws at the bottom.",
                    "description": ""
                },
                {
                    "headline": "Draw Toothless' hind legs with claws.",
                    "description": ""
                },
                {
                    "headline": "Trace Toothless' folded wings that resembled that of a bat.",
                    "description": ""
                },
                {
                    "headline": "Remove unnecessary lines.",
                    "description": ""
                },
                {
                    "headline": "Color the drawing as desired.",
                    "description": "Note: Toothless' entire body is dark grey."
                }
            ]
        },
        {
            "name": "Toothless (Cartoony)",
            "steps": [
                {
                    "headline": "Near the bottom and leftmost side of the paper, draw a large horizontal oval for his head.",
                    "description": ""
                },
                {
                    "headline": "Draw a larger diagonal oval (southwest to northeast orientation) and intersect it with the first oval.",
                    "description": ""
                },
                {
                    "headline": "In between the head and attached to the bigger oval, draw pine-nut shaped ovals for his legs.",
                    "description": ""
                },
                {
                    "headline": "Draw an oblong as one of its hind legs.",
                    "description": "Draw guide lines for Toothless' wings."
                },
                {
                    "headline": "Protruding behind Toothless, draw his tail.",
                    "description": "On its tip, trace shapes that would make it look like a fishtail."
                },
                {
                    "headline": "On the head part, draw facial guide lines (a vertical line with two horizontal lines across it, forming a kind of two-beamed cross).",
                    "description": "This will help in placing Toothless' eyes."
                },
                {
                    "headline": "Start tracing Toothless' head outline, along with his scaly forehead, long ears and horns.",
                    "description": "Begin tracing his front legs too. Don't forget the claws."
                },
                {
                    "headline": "Using the facial guide lines, draw Toothless' large cartoon eyes and little nose holes.",
                    "description": "At the southwest corner of the head, draw a little smile."
                },
                {
                    "headline": "Continue tracing the rest of Toothless' legs.",
                    "description": ""
                },
                {
                    "headline": "Start tracing the rest of Toothless' body, wings and the details of his tail.",
                    "description": ""
                },
                {
                    "headline": "Erase unnecessary lines.",
                    "description": ""
                },
                {
                    "headline": "Color the drawing as desired.",
                    "description": "Note: Toothless' entire body is dark grey."
                }
            ]
        }
    ],
    "tyn": [
        "Paper",
        "Pencil",
        "Pencil sharpener",
        "Eraser gum",
        "Colored pencils, crayons, markers or watercolors"
    ],
    "text": " Toothless (regular) Draw a medium circle near the topmost area of the paper.  Draw a stretched egg-shaped oval (vertical orientation) and intersect it with the circle.  Draw a pair of little egg-shaped ovals at the base of the bigger oval. Intersect each at both sides of the bigger oval. Draw the outline for Toothless' front legs and wings.  Draw facial guide lines (a vertical line with two horizontal lines across it, forming a kind of two-beamed cross). This will help in placing Toothless' eyes. Using the facial line guides, start drawing Toothless' eyes and nose (in this orientation, he is looking down).  Draw Toothless' big ears and little horns on top of his head. Place dashed lines in between his forehead going towards the back of his head, to make a lizard's scale impression. Trace Toothless' front legs with claws at the bottom.  Draw Toothless' hind legs with claws.  Trace Toothless' folded wings that resembled that of a bat.  Remove unnecessary lines.  Color the drawing as desired. Note: Toothless' entire body is dark grey. Toothless (Cartoony) Near the bottom and leftmost side of the paper, draw a large horizontal oval for his head.  Draw a larger diagonal oval (southwest to northeast orientation) and intersect it with the first oval.  In between the head and attached to the bigger oval, draw pine-nut shaped ovals for his legs.  Draw an oblong as one of its hind legs. Draw guide lines for Toothless' wings. Protruding behind Toothless, draw his tail. On its tip, trace shapes that would make it look like a fishtail. On the head part, draw facial guide lines (a vertical line with two horizontal lines across it, forming a kind of two-beamed cross). This will help in placing Toothless' eyes. Start tracing Toothless' head outline, along with his scaly forehead, long ears and horns. Begin tracing his front legs too. Don't forget the claws. Using the facial guide lines, draw Toothless' large cartoon eyes and little nose holes. At the southwest corner of the head, draw a little smile. Continue tracing the rest of Toothless' legs.  Start tracing the rest of Toothless' body, wings and the details of his tail.  Erase unnecessary lines.  Color the drawing as desired. Note: Toothless' entire body is dark grey.",
    "sentences": [
        " Toothless (regular) Draw a medium circle near the topmost area of the paper.",
        "Draw a stretched egg-shaped oval (vertical orientation) and intersect it with the circle.",
        "Draw a pair of little egg-shaped ovals at the base of the bigger oval.",
        "Intersect each at both sides of the bigger oval.",
        "Draw the outline for Toothless' front legs and wings.",
        "Draw facial guide lines (a vertical line with two horizontal lines across it, forming a kind of two-beamed cross).",
        "This will help in placing Toothless' eyes.",
        "Using the facial line guides, start drawing Toothless' eyes and nose (in this orientation, he is looking down).",
        "Draw Toothless' big ears and little horns on top of his head.",
        "Place dashed lines in between his forehead going towards the back of his head, to make a lizard's scale impression.",
        "Trace Toothless' front legs with claws at the bottom.",
        "Draw Toothless' hind legs with claws.",
        "Trace Toothless' folded wings that resembled that of a bat.",
        "Remove unnecessary lines.",
        "Color the drawing as desired.",
        "Note: Toothless' entire body is dark grey.",
        "Toothless (Cartoony) Near the bottom and leftmost side of the paper, draw a large horizontal oval for his head.",
        "Draw a larger diagonal oval (southwest to northeast orientation) and intersect it with the first oval.",
        "In between the head and attached to the bigger oval, draw pine-nut shaped ovals for his legs.",
        "Draw an oblong as one of its hind legs.",
        "Draw guide lines for Toothless' wings.",
        "Protruding behind Toothless, draw his tail.",
        "On its tip, trace shapes that would make it look like a fishtail.",
        "On the head part, draw facial guide lines (a vertical line with two horizontal lines across it, forming a kind of two-beamed cross).",
        "This will help in placing Toothless' eyes.",
        "Start tracing Toothless' head outline, along with his scaly forehead, long ears and horns.",
        "Begin tracing his front legs too.",
        "Don't forget the claws.",
        "Using the facial guide lines, draw Toothless' large cartoon eyes and little nose holes.",
        "At the southwest corner of the head, draw a little smile.",
        "Continue tracing the rest of Toothless' legs.",
        "Start tracing the rest of Toothless' body, wings and the details of his tail.",
        "Erase unnecessary lines.",
        "Color the drawing as desired.",
        "Note: Toothless' entire body is dark grey."
    ]
}