{
    "title": "How to Make Oil Paint",
    "url": "https://www.wikihow.com/Make-Oil-Paint",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Mixing the Pigment and Linseed Oil",
            "steps": [
                {
                    "headline": "Place 2 oz (56.7 g) of dry powder pigment in the center of the grinding slab.",
                    "description": "Pour the pigment out of the bottle. Use a palette knife to form it into a small mound shape.You can use more or less pigment depending on how much oil paint you would like to make. A wide range of dry powder pigments are available from art stores and online. A grinding slab is a sheet of glass that rests on your workbench. It is the surface that you combine and grind ingredients on to create paint. For this project, an ideal grinding slab size is ⁄4 in (0.64 cm) thick."
                },
                {
                    "headline": "Create a hole in the center of the mound of pigment.",
                    "description": "Use the palette knife to gently move the pigment around so that a small gap in the center forms. Make sure that all of the powdered pigment stays clustered together and that it isn't scattered across the grinding slab."
                },
                {
                    "headline": "Add 3 tsp (15 ml) of cold-pressed linseed oil into the hole in the pigment.",
                    "description": "Use the eyedropper that comes with the linseed oil to pour it directly into the center of the pigment. Approximately 2 eyedroppers of the linseed oil should be enough.Although poppy seed, walnut, and saffron oil can also be used to bind oil paints, linseed oil has been the most popular choice for centuries. This is because it is very slow to dry, meaning that the paint can easily be reworked until you are happy with it."
                },
                {
                    "headline": "Use the palette knife to mix the pigment and the linseed oil.",
                    "description": "Drag the pigment into the center where the oil is using the knife. Place small amounts of the pigment into the linseed oil at a time and gently fold the mixture together to make a paste.Carefully spread the paste out slightly by drawing the knife over it so that you can make sure that it has been mixed thoroughly."
                },
                {
                    "headline": "Add ½ tsp (2.5 ml) of extra linseed oil at a time if the mixture is too dry.",
                    "description": "If you have too much pigment and not enough linseed oil in your original mixture, add more linseed oil. Add only very small amounts at a time so that you can stop when the consistency is correct.You can tell if the mixture is too dry as it will look powdery and won't combine properly."
                },
                {
                    "headline": "Use 1 tsp (2 g) of extra pigment if the mixture is too wet.",
                    "description": "Add small amounts of extra pigment if the mixture is too runny and mix it in thoroughly before deciding whether or not to add more. This means that there was originally too much linseed oil, so you need more pigment to balance it out.You will be able to tell if the mixture is too runny because it will have too much liquid to look like oil paint."
                },
                {
                    "headline": "Stir the mixture until the linseed oil and the pigment are fully combined.",
                    "description": "Work either the extra linseed oil or the extra pigment into the mixture using the palette knife. Aim for your desired consistency of oil paint.The preferred consistency of the paint differs between artists. Some prefer to have oil paint that is slightly runny, while others prefer firmer paint. Aim for the consistency of oil paint and ignore any tiny lumps as these will be removed when you use the glass muller."
                },
                {
                    "headline": "Use a glass muller to grind the oil paint for 1 minute.",
                    "description": "Once the paint has reached the right consistency, hold the muller in your fist and draw it over the paint. Grind the paint in either a figure 8 motion or in small circles. Tilt the muller slightly and spin it in a circle against the grinding slab to remove excess paint from the sides.You may find that the pigment changes color as the consistency changes. This is completely normal and most often happens with pigments such as ultramarine blue. A glass muller is a handheld tool that is used to grind pigment and linseed oil into a smooth paint mixture. These can be purchased from art stores or online."
                },
                {
                    "headline": "Scrape all of the paint back into the center of the grinding slab.",
                    "description": "Grinding the paint with the glass muller spreads the paint into a larger area across the slab. Use the palette knife to draw the paint from the outside and into the center to create a small mound again."
                },
                {
                    "headline": "Repeat the grinding process until the paint has a smooth texture.",
                    "description": "Use the glass muller to grind the oil paint in figure 8 or circular motions again. Then use the palette knife to bring the paint back into the center and repeat this process as many times as is required.Repeating the process 1-2 times is usually all that is necessary. The aim is to get the oil paint fully consistent in both look and feel throughout the entire mixture. A butter-like consistency is usually best. The end mixture should have no tiny lumps of pigment."
                }
            ]
        },
        {
            "name": "Placing the Paint into a Tube",
            "steps": [
                {
                    "headline": "Place the paint in the center of a disposable palette starting from the edge.",
                    "description": "Use the palette knife to transfer the paint from the grinding slab and onto a disposable palette. Create a rough center line going from the edge of the disposable palette to approximately halfway across. Scrape the palette knife against the paper to remove the paint from the knife.The line doesn’t need to be neat. All that's important is that it begins on the edge of the paper."
                },
                {
                    "headline": "Roll the disposable palette and place the end into a new, empty paint tube.",
                    "description": "Loosely fold the paper in half so that the line of paint is at the center of the fold. Starting with the fold, gently roll the paper towards the edge so that the paint is wrapped up in a few layers of paper. Insert the end of the roll where the paint is into the open, bottom end of the tube and push it in slightly so that it stays in place.You don’t need to roll the paper tightly. It just has to be small enough to fit into the tube. An aluminum paint tube is ideal. Only the edge where the paint begins needs to be inside the tube. This means that most of the paper will be exposed and not in the tube."
                },
                {
                    "headline": "Wrap the disposable palette around a glass bottle to push the paint into the tube.",
                    "description": "Rest the disposable palette and the paint tube on your work surface. Start with the glass bottle close to you and slowly roll it along the surface and towards the tube, wrapping the paper around it as you go. Make sure that it is wrapped tightly so that the paint will squeeze from the palette and into the tube.The pressure caused by tightly wrapping the paper around the bottle will squeeze the paint out of the paper and towards the tube."
                },
                {
                    "headline": "Unwrap the bottle and remove the disposable palette from the tube.",
                    "description": "Roll the glass bottle back toward you to unroll the paper. Hold the tube upright and carefully pull the paper out from the tube. Tap the paper against the tube as you remove it to shake off any excess paint."
                },
                {
                    "headline": "Use the knife to scrape any paint on the disposable palette into the tube.",
                    "description": "Unroll the paper and rest it flat. Transfer any remaining paint into the bottom of the tube by scraping it over the edge of the tube so that it falls in."
                },
                {
                    "headline": "Fold the edge of the paint tube to seal it.",
                    "description": "Hold the palette knife across the paint tube, approximately ⁄8 in (0.32 cm) from the edge. Fold the edge over the palette knife. Place the palette knife on top of the fold and push it down firmly to seal the aluminum tube.Use your thumbs to firmly push on the seal once you have removed the palette knife to make sure that it’s secure. Make sure that you secure the cap on the tube. Alternatively, press pliers against the seal to make sure that it’s airtight."
                },
                {
                    "headline": "Label the tube with the date and the color.",
                    "description": "Use a permanent marker to write the color of the pigment on the tube. Make sure to also include the date when you made the oil paint.Having the pigment color or combination of pigments written on the tube is especially useful if you want to replicate the paint in the future."
                }
            ]
        }
    ],
    "tyn": [
        "Grinding slab",
        "Palette knife",
        "Gloves",
        "Dry powder pigment",
        "Linseed oil",
        "Glass muller",
        "Disposable palette paper",
        "Empty aluminum paint tube",
        "Glass bottle",
        "Pliers",
        "Permanent marker"
    ],
    "text": " Mixing the Pigment and Linseed Oil Place 2 oz (56.7 g) of dry powder pigment in the center of the grinding slab. Pour the pigment out of the bottle. Use a palette knife to form it into a small mound shape.You can use more or less pigment depending on how much oil paint you would like to make. A wide range of dry powder pigments are available from art stores and online. A grinding slab is a sheet of glass that rests on your workbench. It is the surface that you combine and grind ingredients on to create paint. For this project, an ideal grinding slab size is ⁄4 in (0.64 cm) thick. Create a hole in the center of the mound of pigment. Use the palette knife to gently move the pigment around so that a small gap in the center forms. Make sure that all of the powdered pigment stays clustered together and that it isn't scattered across the grinding slab. Add 3 tsp (15 ml) of cold-pressed linseed oil into the hole in the pigment. Use the eyedropper that comes with the linseed oil to pour it directly into the center of the pigment. Approximately 2 eyedroppers of the linseed oil should be enough.Although poppy seed, walnut, and saffron oil can also be used to bind oil paints, linseed oil has been the most popular choice for centuries. This is because it is very slow to dry, meaning that the paint can easily be reworked until you are happy with it. Use the palette knife to mix the pigment and the linseed oil. Drag the pigment into the center where the oil is using the knife. Place small amounts of the pigment into the linseed oil at a time and gently fold the mixture together to make a paste.Carefully spread the paste out slightly by drawing the knife over it so that you can make sure that it has been mixed thoroughly. Add ½ tsp (2.5 ml) of extra linseed oil at a time if the mixture is too dry. If you have too much pigment and not enough linseed oil in your original mixture, add more linseed oil. Add only very small amounts at a time so that you can stop when the consistency is correct.You can tell if the mixture is too dry as it will look powdery and won't combine properly. Use 1 tsp (2 g) of extra pigment if the mixture is too wet. Add small amounts of extra pigment if the mixture is too runny and mix it in thoroughly before deciding whether or not to add more. This means that there was originally too much linseed oil, so you need more pigment to balance it out.You will be able to tell if the mixture is too runny because it will have too much liquid to look like oil paint. Stir the mixture until the linseed oil and the pigment are fully combined. Work either the extra linseed oil or the extra pigment into the mixture using the palette knife. Aim for your desired consistency of oil paint.The preferred consistency of the paint differs between artists. Some prefer to have oil paint that is slightly runny, while others prefer firmer paint. Aim for the consistency of oil paint and ignore any tiny lumps as these will be removed when you use the glass muller. Use a glass muller to grind the oil paint for 1 minute. Once the paint has reached the right consistency, hold the muller in your fist and draw it over the paint. Grind the paint in either a figure 8 motion or in small circles. Tilt the muller slightly and spin it in a circle against the grinding slab to remove excess paint from the sides.You may find that the pigment changes color as the consistency changes. This is completely normal and most often happens with pigments such as ultramarine blue. A glass muller is a handheld tool that is used to grind pigment and linseed oil into a smooth paint mixture. These can be purchased from art stores or online. Scrape all of the paint back into the center of the grinding slab. Grinding the paint with the glass muller spreads the paint into a larger area across the slab. Use the palette knife to draw the paint from the outside and into the center to create a small mound again. Repeat the grinding process until the paint has a smooth texture. Use the glass muller to grind the oil paint in figure 8 or circular motions again. Then use the palette knife to bring the paint back into the center and repeat this process as many times as is required.Repeating the process 1-2 times is usually all that is necessary. The aim is to get the oil paint fully consistent in both look and feel throughout the entire mixture. A butter-like consistency is usually best. The end mixture should have no tiny lumps of pigment. Placing the Paint into a Tube Place the paint in the center of a disposable palette starting from the edge. Use the palette knife to transfer the paint from the grinding slab and onto a disposable palette. Create a rough center line going from the edge of the disposable palette to approximately halfway across. Scrape the palette knife against the paper to remove the paint from the knife.The line doesn’t need to be neat. All that's important is that it begins on the edge of the paper. Roll the disposable palette and place the end into a new, empty paint tube. Loosely fold the paper in half so that the line of paint is at the center of the fold. Starting with the fold, gently roll the paper towards the edge so that the paint is wrapped up in a few layers of paper. Insert the end of the roll where the paint is into the open, bottom end of the tube and push it in slightly so that it stays in place.You don’t need to roll the paper tightly. It just has to be small enough to fit into the tube. An aluminum paint tube is ideal. Only the edge where the paint begins needs to be inside the tube. This means that most of the paper will be exposed and not in the tube. Wrap the disposable palette around a glass bottle to push the paint into the tube. Rest the disposable palette and the paint tube on your work surface. Start with the glass bottle close to you and slowly roll it along the surface and towards the tube, wrapping the paper around it as you go. Make sure that it is wrapped tightly so that the paint will squeeze from the palette and into the tube.The pressure caused by tightly wrapping the paper around the bottle will squeeze the paint out of the paper and towards the tube. Unwrap the bottle and remove the disposable palette from the tube. Roll the glass bottle back toward you to unroll the paper. Hold the tube upright and carefully pull the paper out from the tube. Tap the paper against the tube as you remove it to shake off any excess paint. Use the knife to scrape any paint on the disposable palette into the tube. Unroll the paper and rest it flat. Transfer any remaining paint into the bottom of the tube by scraping it over the edge of the tube so that it falls in. Fold the edge of the paint tube to seal it. Hold the palette knife across the paint tube, approximately ⁄8 in (0.32 cm) from the edge. Fold the edge over the palette knife. Place the palette knife on top of the fold and push it down firmly to seal the aluminum tube.Use your thumbs to firmly push on the seal once you have removed the palette knife to make sure that it’s secure. Make sure that you secure the cap on the tube. Alternatively, press pliers against the seal to make sure that it’s airtight. Label the tube with the date and the color. Use a permanent marker to write the color of the pigment on the tube. Make sure to also include the date when you made the oil paint.Having the pigment color or combination of pigments written on the tube is especially useful if you want to replicate the paint in the future.",
    "sentences": [
        " Mixing the Pigment and Linseed Oil Place 2 oz (56.7 g) of dry powder pigment in the center of the grinding slab.",
        "Pour the pigment out of the bottle.",
        "Use a palette knife to form it into a small mound shape.You can use more or less pigment depending on how much oil paint you would like to make.",
        "A wide range of dry powder pigments are available from art stores and online.",
        "A grinding slab is a sheet of glass that rests on your workbench.",
        "It is the surface that you combine and grind ingredients on to create paint.",
        "For this project, an ideal grinding slab size is ⁄4 in (0.64 cm) thick.",
        "Create a hole in the center of the mound of pigment.",
        "Use the palette knife to gently move the pigment around so that a small gap in the center forms.",
        "Make sure that all of the powdered pigment stays clustered together and that it isn't scattered across the grinding slab.",
        "Add 3 tsp (15 ml) of cold-pressed linseed oil into the hole in the pigment.",
        "Use the eyedropper that comes with the linseed oil to pour it directly into the center of the pigment.",
        "Approximately 2 eyedroppers of the linseed oil should be enough.Although poppy seed, walnut, and saffron oil can also be used to bind oil paints, linseed oil has been the most popular choice for centuries.",
        "This is because it is very slow to dry, meaning that the paint can easily be reworked until you are happy with it.",
        "Use the palette knife to mix the pigment and the linseed oil.",
        "Drag the pigment into the center where the oil is using the knife.",
        "Place small amounts of the pigment into the linseed oil at a time and gently fold the mixture together to make a paste.Carefully spread the paste out slightly by drawing the knife over it so that you can make sure that it has been mixed thoroughly.",
        "Add ½ tsp (2.5 ml) of extra linseed oil at a time if the mixture is too dry.",
        "If you have too much pigment and not enough linseed oil in your original mixture, add more linseed oil.",
        "Add only very small amounts at a time so that you can stop when the consistency is correct.You can tell if the mixture is too dry as it will look powdery and won't combine properly.",
        "Use 1 tsp (2 g) of extra pigment if the mixture is too wet.",
        "Add small amounts of extra pigment if the mixture is too runny and mix it in thoroughly before deciding whether or not to add more.",
        "This means that there was originally too much linseed oil, so you need more pigment to balance it out.You will be able to tell if the mixture is too runny because it will have too much liquid to look like oil paint.",
        "Stir the mixture until the linseed oil and the pigment are fully combined.",
        "Work either the extra linseed oil or the extra pigment into the mixture using the palette knife.",
        "Aim for your desired consistency of oil paint.The preferred consistency of the paint differs between artists.",
        "Some prefer to have oil paint that is slightly runny, while others prefer firmer paint.",
        "Aim for the consistency of oil paint and ignore any tiny lumps as these will be removed when you use the glass muller.",
        "Use a glass muller to grind the oil paint for 1 minute.",
        "Once the paint has reached the right consistency, hold the muller in your fist and draw it over the paint.",
        "Grind the paint in either a figure 8 motion or in small circles.",
        "Tilt the muller slightly and spin it in a circle against the grinding slab to remove excess paint from the sides.You may find that the pigment changes color as the consistency changes.",
        "This is completely normal and most often happens with pigments such as ultramarine blue.",
        "A glass muller is a handheld tool that is used to grind pigment and linseed oil into a smooth paint mixture.",
        "These can be purchased from art stores or online.",
        "Scrape all of the paint back into the center of the grinding slab.",
        "Grinding the paint with the glass muller spreads the paint into a larger area across the slab.",
        "Use the palette knife to draw the paint from the outside and into the center to create a small mound again.",
        "Repeat the grinding process until the paint has a smooth texture.",
        "Use the glass muller to grind the oil paint in figure 8 or circular motions again.",
        "Then use the palette knife to bring the paint back into the center and repeat this process as many times as is required.Repeating the process 1-2 times is usually all that is necessary.",
        "The aim is to get the oil paint fully consistent in both look and feel throughout the entire mixture.",
        "A butter-like consistency is usually best.",
        "The end mixture should have no tiny lumps of pigment.",
        "Placing the Paint into a Tube Place the paint in the center of a disposable palette starting from the edge.",
        "Use the palette knife to transfer the paint from the grinding slab and onto a disposable palette.",
        "Create a rough center line going from the edge of the disposable palette to approximately halfway across.",
        "Scrape the palette knife against the paper to remove the paint from the knife.The line doesn’t need to be neat.",
        "All that's important is that it begins on the edge of the paper.",
        "Roll the disposable palette and place the end into a new, empty paint tube.",
        "Loosely fold the paper in half so that the line of paint is at the center of the fold.",
        "Starting with the fold, gently roll the paper towards the edge so that the paint is wrapped up in a few layers of paper.",
        "Insert the end of the roll where the paint is into the open, bottom end of the tube and push it in slightly so that it stays in place.You don’t need to roll the paper tightly.",
        "It just has to be small enough to fit into the tube.",
        "An aluminum paint tube is ideal.",
        "Only the edge where the paint begins needs to be inside the tube.",
        "This means that most of the paper will be exposed and not in the tube.",
        "Wrap the disposable palette around a glass bottle to push the paint into the tube.",
        "Rest the disposable palette and the paint tube on your work surface.",
        "Start with the glass bottle close to you and slowly roll it along the surface and towards the tube, wrapping the paper around it as you go.",
        "Make sure that it is wrapped tightly so that the paint will squeeze from the palette and into the tube.The pressure caused by tightly wrapping the paper around the bottle will squeeze the paint out of the paper and towards the tube.",
        "Unwrap the bottle and remove the disposable palette from the tube.",
        "Roll the glass bottle back toward you to unroll the paper.",
        "Hold the tube upright and carefully pull the paper out from the tube.",
        "Tap the paper against the tube as you remove it to shake off any excess paint.",
        "Use the knife to scrape any paint on the disposable palette into the tube.",
        "Unroll the paper and rest it flat.",
        "Transfer any remaining paint into the bottom of the tube by scraping it over the edge of the tube so that it falls in.",
        "Fold the edge of the paint tube to seal it.",
        "Hold the palette knife across the paint tube, approximately ⁄8 in (0.32 cm) from the edge.",
        "Fold the edge over the palette knife.",
        "Place the palette knife on top of the fold and push it down firmly to seal the aluminum tube.Use your thumbs to firmly push on the seal once you have removed the palette knife to make sure that it’s secure.",
        "Make sure that you secure the cap on the tube.",
        "Alternatively, press pliers against the seal to make sure that it’s airtight.",
        "Label the tube with the date and the color.",
        "Use a permanent marker to write the color of the pigment on the tube.",
        "Make sure to also include the date when you made the oil paint.Having the pigment color or combination of pigments written on the tube is especially useful if you want to replicate the paint in the future."
    ]
}