{
    "title": "How to Head a Letter",
    "url": "https://www.wikihow.com/Head-a-Letter",
    "category_hierarchy": [
        "Education and Communications"
    ],
    "methods": [
        {
            "name": "Heading a Business Letter",
            "steps": [
                {
                    "headline": "Use a computer or typewriter to create your letter.",
                    "description": "Business letters are typed and printed instead of handwritten, so decide if you'll type up the letter or use your computer to print the letter. If you're using a computer, open your favorite word processing software or app. Load the printer or typewriter with heavy, high-quality paper."
                },
                {
                    "headline": "Type your business name and address on the left corner of the paper.",
                    "description": "If you're writing a business letter, write the business name in the upper left corner of the paper. On the line below it, list the street address. Then, type the city, state, and zip code on the line below it. There's no need to write your name since you'll be signing the bottom of the letter."
                },
                {
                    "headline": "Include optional contact information below the address.",
                    "description": "If you want the recipient to be able to reach you by email or phone, type the email address or telephone number below the address. You could use your email or the business's email, depending on who you want the recipient to reach.Tip: Don't indent the address, date, salutation or body paragraphs. The paragraphs in a business letter are separated by line breaks and begin flush with the left hand side. You can list the company's fax number as well."
                },
                {
                    "headline": "Omit the address if you're using paper with your company's letterhead.",
                    "description": "There's no need to type the address again if it's already listed on the side or at the top of the paper. Some company letterheads also include the business name, a logo, and contact information."
                },
                {
                    "headline": "Skip 1 line and type the current date so it's aligned to the left.",
                    "description": "Leave a line below your address and write the date that you're writing the letter. If you're writing in the U.S., format the date with the month followed by the date and year. In most other countries, list the date before the month and year. For example, in the U.S. you'd write October 12, 2019, but in another country, you'd write 12 October 2019."
                },
                {
                    "headline": "Type the recipient's address 1 line below the date on the left side of the page.",
                    "description": "After you hit \"Enter\", write the recipient's name. On the line below the name, type the street address. Then, list the city, street, and zip code. The recipient's address in the heading is called the inside address. If you like, you can also type the name of the person's company below their name."
                },
                {
                    "headline": "Leave 1 line below the address and type your salutation.",
                    "description": "You can write \"Dear\" followed by their last name or \"To whom it may concern.\" Then, write a colon or a comma depending on how personal you'd like to make the letter. For example, write, \"Dear Ms. Penvenen,\" or \"Dear Secretary Wilson.\" Skip another line before writing the body of the letter."
                }
            ]
        },
        {
            "name": "Writing a Personal Heading",
            "steps": [
                {
                    "headline": "Select paper or personalized stationery.",
                    "description": "You can write your letter on any type of plain or printed paper. If you choose personalized stationery, you might have your monogram, full name, or address printed at the top. You can design your own personalized stationery or order it from a local printing shop."
                },
                {
                    "headline": "Write your return address in the upper right corner of the paper.",
                    "description": "Since this is a friendly letter, you don't need to include your name above the address. Write the mailing address that you'd like the recipient to use if they write you back. Keep in mind that this might be different from your home address if you're writing while traveling.Tip: To write the mailing address, list the street number and street name on the first line. Then, write the city, state, and zip code below it. For example, if you're on vacation and want them to write you back where you're currently staying, list the address they can use to reach you instead of your home address. If your personalized stationery already has the address printed on it, skip this step."
                },
                {
                    "headline": "Put the current date 1 line below the address on the left.",
                    "description": "Skip 1 line under the address and type or write the date that you're writing the letter so it's aligned to the left. Keep in mind that dates are formatted differently around the world, so follow your country's accepted method. For example, in the U.S. you'd write September 13, 2019 or 9/13/2019. In most of the world, it's written as 13 September 2019 or 13/9/2019. Some people prefer to write the date that they send the letter. The choice is up to you."
                },
                {
                    "headline": "Avoid including the recipient's address.",
                    "description": "Writing the recipient's address makes the letter more formal, which could be awkward if you're writing to a friend or family member. Skip this space and don't include any recipient information on the left side of the paper's heading."
                },
                {
                    "headline": "Write a personalized salutation on the left side of the paper.",
                    "description": "The personal greeting is completely up to you, but since it's a personal letter, you could use \"Dear\" followed by their first name. For example, write, \"Dear Lucy\" or \"Dear Ms. Singh\" depending on how well you know the person. Then, write a comma after the salutation. If you're writing a close friend, you could write, \"Dearest,\" \"Dear chum,\" or another affectionate term. Once you've written the heading, continue with the body paragraphs underneath."
                }
            ]
        }
    ],
    "tyn": [
        "Word processor/typewriter",
        "Stationery",
        "Company letterhead",
        "Pen"
    ],
    "text": " Heading a Business Letter Use a computer or typewriter to create your letter. Business letters are typed and printed instead of handwritten, so decide if you'll type up the letter or use your computer to print the letter. If you're using a computer, open your favorite word processing software or app. Load the printer or typewriter with heavy, high-quality paper. Type your business name and address on the left corner of the paper. If you're writing a business letter, write the business name in the upper left corner of the paper. On the line below it, list the street address. Then, type the city, state, and zip code on the line below it. There's no need to write your name since you'll be signing the bottom of the letter. Include optional contact information below the address. If you want the recipient to be able to reach you by email or phone, type the email address or telephone number below the address. You could use your email or the business's email, depending on who you want the recipient to reach.Tip: Don't indent the address, date, salutation or body paragraphs. The paragraphs in a business letter are separated by line breaks and begin flush with the left hand side. You can list the company's fax number as well. Omit the address if you're using paper with your company's letterhead. There's no need to type the address again if it's already listed on the side or at the top of the paper. Some company letterheads also include the business name, a logo, and contact information. Skip 1 line and type the current date so it's aligned to the left. Leave a line below your address and write the date that you're writing the letter. If you're writing in the U.S., format the date with the month followed by the date and year. In most other countries, list the date before the month and year. For example, in the U.S. you'd write October 12, 2019, but in another country, you'd write 12 October 2019. Type the recipient's address 1 line below the date on the left side of the page. After you hit \"Enter\", write the recipient's name. On the line below the name, type the street address. Then, list the city, street, and zip code. The recipient's address in the heading is called the inside address. If you like, you can also type the name of the person's company below their name. Leave 1 line below the address and type your salutation. You can write \"Dear\" followed by their last name or \"To whom it may concern.\" Then, write a colon or a comma depending on how personal you'd like to make the letter. For example, write, \"Dear Ms. Penvenen,\" or \"Dear Secretary Wilson.\" Skip another line before writing the body of the letter. Writing a Personal Heading Select paper or personalized stationery. You can write your letter on any type of plain or printed paper. If you choose personalized stationery, you might have your monogram, full name, or address printed at the top. You can design your own personalized stationery or order it from a local printing shop. Write your return address in the upper right corner of the paper. Since this is a friendly letter, you don't need to include your name above the address. Write the mailing address that you'd like the recipient to use if they write you back. Keep in mind that this might be different from your home address if you're writing while traveling.Tip: To write the mailing address, list the street number and street name on the first line. Then, write the city, state, and zip code below it. For example, if you're on vacation and want them to write you back where you're currently staying, list the address they can use to reach you instead of your home address. If your personalized stationery already has the address printed on it, skip this step. Put the current date 1 line below the address on the left. Skip 1 line under the address and type or write the date that you're writing the letter so it's aligned to the left. Keep in mind that dates are formatted differently around the world, so follow your country's accepted method. For example, in the U.S. you'd write September 13, 2019 or 9/13/2019. In most of the world, it's written as 13 September 2019 or 13/9/2019. Some people prefer to write the date that they send the letter. The choice is up to you. Avoid including the recipient's address. Writing the recipient's address makes the letter more formal, which could be awkward if you're writing to a friend or family member. Skip this space and don't include any recipient information on the left side of the paper's heading. Write a personalized salutation on the left side of the paper. The personal greeting is completely up to you, but since it's a personal letter, you could use \"Dear\" followed by their first name. For example, write, \"Dear Lucy\" or \"Dear Ms. Singh\" depending on how well you know the person. Then, write a comma after the salutation. If you're writing a close friend, you could write, \"Dearest,\" \"Dear chum,\" or another affectionate term. Once you've written the heading, continue with the body paragraphs underneath.",
    "sentences": [
        " Heading a Business Letter Use a computer or typewriter to create your letter.",
        "Business letters are typed and printed instead of handwritten, so decide if you'll type up the letter or use your computer to print the letter.",
        "If you're using a computer, open your favorite word processing software or app.",
        "Load the printer or typewriter with heavy, high-quality paper.",
        "Type your business name and address on the left corner of the paper.",
        "If you're writing a business letter, write the business name in the upper left corner of the paper.",
        "On the line below it, list the street address.",
        "Then, type the city, state, and zip code on the line below it.",
        "There's no need to write your name since you'll be signing the bottom of the letter.",
        "Include optional contact information below the address.",
        "If you want the recipient to be able to reach you by email or phone, type the email address or telephone number below the address.",
        "You could use your email or the business's email, depending on who you want the recipient to reach.Tip: Don't indent the address, date, salutation or body paragraphs.",
        "The paragraphs in a business letter are separated by line breaks and begin flush with the left hand side.",
        "You can list the company's fax number as well.",
        "Omit the address if you're using paper with your company's letterhead.",
        "There's no need to type the address again if it's already listed on the side or at the top of the paper.",
        "Some company letterheads also include the business name, a logo, and contact information.",
        "Skip 1 line and type the current date so it's aligned to the left.",
        "Leave a line below your address and write the date that you're writing the letter.",
        "If you're writing in the U.S., format the date with the month followed by the date and year.",
        "In most other countries, list the date before the month and year.",
        "For example, in the U.S. you'd write October 12, 2019, but in another country, you'd write 12 October 2019.",
        "Type the recipient's address 1 line below the date on the left side of the page.",
        "After you hit \"Enter\", write the recipient's name.",
        "On the line below the name, type the street address.",
        "Then, list the city, street, and zip code.",
        "The recipient's address in the heading is called the inside address.",
        "If you like, you can also type the name of the person's company below their name.",
        "Leave 1 line below the address and type your salutation.",
        "You can write \"Dear\" followed by their last name or \"To whom it may concern.\"",
        "Then, write a colon or a comma depending on how personal you'd like to make the letter.",
        "For example, write, \"Dear Ms. Penvenen,\" or \"Dear Secretary Wilson.\"",
        "Skip another line before writing the body of the letter.",
        "Writing a Personal Heading Select paper or personalized stationery.",
        "You can write your letter on any type of plain or printed paper.",
        "If you choose personalized stationery, you might have your monogram, full name, or address printed at the top.",
        "You can design your own personalized stationery or order it from a local printing shop.",
        "Write your return address in the upper right corner of the paper.",
        "Since this is a friendly letter, you don't need to include your name above the address.",
        "Write the mailing address that you'd like the recipient to use if they write you back.",
        "Keep in mind that this might be different from your home address if you're writing while traveling.Tip: To write the mailing address, list the street number and street name on the first line.",
        "Then, write the city, state, and zip code below it.",
        "For example, if you're on vacation and want them to write you back where you're currently staying, list the address they can use to reach you instead of your home address.",
        "If your personalized stationery already has the address printed on it, skip this step.",
        "Put the current date 1 line below the address on the left.",
        "Skip 1 line under the address and type or write the date that you're writing the letter so it's aligned to the left.",
        "Keep in mind that dates are formatted differently around the world, so follow your country's accepted method.",
        "For example, in the U.S. you'd write September 13, 2019 or 9/13/2019.",
        "In most of the world, it's written as 13 September 2019 or 13/9/2019.",
        "Some people prefer to write the date that they send the letter.",
        "The choice is up to you.",
        "Avoid including the recipient's address.",
        "Writing the recipient's address makes the letter more formal, which could be awkward if you're writing to a friend or family member.",
        "Skip this space and don't include any recipient information on the left side of the paper's heading.",
        "Write a personalized salutation on the left side of the paper.",
        "The personal greeting is completely up to you, but since it's a personal letter, you could use \"Dear\" followed by their first name.",
        "For example, write, \"Dear Lucy\" or \"Dear Ms. Singh\" depending on how well you know the person.",
        "Then, write a comma after the salutation.",
        "If you're writing a close friend, you could write, \"Dearest,\" \"Dear chum,\" or another affectionate term.",
        "Once you've written the heading, continue with the body paragraphs underneath."
    ]
}