{
    "title": "How to Do the Pile Up Glitch in Tranzit",
    "url": "https://www.wikihow.com/Do-the-Pile-Up-Glitch-in-Tranzit",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Video Games",
        "PC Games",
        "PC First Person Shooter"
    ],
    "steps": [
        {
            "headline": "Go straight to Diner.",
            "description": "Open the doors to the gas station and the diner. Both will cost 750 points."
        },
        {
            "headline": "Find the car door in the gas station.",
            "description": "It will be on the car, on the bench, or next to the toilet."
        },
        {
            "headline": "Find the broken seat.",
            "description": "It will be along the bar at the near or far end of the room, or behind the second seat at the far end."
        },
        {
            "headline": "Build both parts on the workbench in the gas station.",
            "description": "Your result will be a Zombie-Shield."
        },
        {
            "headline": "Pick up a Zombie-Shield.",
            "description": "Run back through the fog into the tunnel."
        },
        {
            "headline": "Go to the wall where you find the colt-action gun.",
            "description": "Go all the way to the back. You will find a small gap."
        },
        {
            "headline": "Place your Zombie-Shield right in the middle of the gap, and squeeze yourself up against the handrail as close as you can.",
            "description": ""
        },
        {
            "headline": "Your final result: zombies will pile up against the handrail, instead of running around it, leaving them free for pickings.",
            "description": ""
        }
    ],
    "tyn": [
        "Call of Duty: Black Ops II",
        "Xbox 360/PS3",
        "Internet",
        "Live play (optional)",
        "TV"
    ],
    "text": " Go straight to Diner. Open the doors to the gas station and the diner. Both will cost 750 points. Find the car door in the gas station. It will be on the car, on the bench, or next to the toilet. Find the broken seat. It will be along the bar at the near or far end of the room, or behind the second seat at the far end. Build both parts on the workbench in the gas station. Your result will be a Zombie-Shield. Pick up a Zombie-Shield. Run back through the fog into the tunnel. Go to the wall where you find the colt-action gun. Go all the way to the back. You will find a small gap. Place your Zombie-Shield right in the middle of the gap, and squeeze yourself up against the handrail as close as you can.  Your final result: zombies will pile up against the handrail, instead of running around it, leaving them free for pickings. ",
    "sentences": [
        " Go straight to Diner.",
        "Open the doors to the gas station and the diner.",
        "Both will cost 750 points.",
        "Find the car door in the gas station.",
        "It will be on the car, on the bench, or next to the toilet.",
        "Find the broken seat.",
        "It will be along the bar at the near or far end of the room, or behind the second seat at the far end.",
        "Build both parts on the workbench in the gas station.",
        "Your result will be a Zombie-Shield.",
        "Pick up a Zombie-Shield.",
        "Run back through the fog into the tunnel.",
        "Go to the wall where you find the colt-action gun.",
        "Go all the way to the back.",
        "You will find a small gap.",
        "Place your Zombie-Shield right in the middle of the gap, and squeeze yourself up against the handrail as close as you can.",
        "Your final result: zombies will pile up against the handrail, instead of running around it, leaving them free for pickings."
    ]
}