{
    "title": "How to Do a Quick and Easy Hair Bun",
    "url": "https://www.wikihow.com/Do-a-Quick-and-Easy-Hair-Bun",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Hairstyles",
        "Quick Hairstyles"
    ],
    "methods": [
        {
            "name": "Creating an Easy Bun",
            "steps": [
                {
                    "headline": "Gather your hair into a ponytail.",
                    "description": "Fling your hair over your head, and then rapidly fling it back again. This creates volume for your bun, making the bun less severe and tight. Then, grasp the hair with your hands and hold it in a ponytail. You can brush your hair before this step. Since you are putting your hair up into a bun, you can skip this step. This style can work anywhere on your head. For a high, messy bun, use your fingers to brush your hair into a high ponytail on the top of your head. For a low bun, gather your hair at the base of your neck. If you need some texture in your hair, add some sea salt spray or dry shampoo."
                },
                {
                    "headline": "Twist the hair.",
                    "description": "After you have pulled your hair into a ponytail, twist the hair clockwise. As the hair is twisted, it will wrap around itself until you have one long twisted strand. You can also twist the hair counter-clockwise. The direction does not matter to the overall look of the bun; it is purely up to your preference. If you have unruly or thick hair, putting your hair in a ponytail before making a bun may help keep hair secure and in place. For an extra bit of style, leave one thick strand loose. After securing the hair into a bun, braid this strand of hair and wrap around the base of the bun for added flare and sophistication. Secure the braid by tucking the end under the bun and using a bobby pin to keep in place."
                },
                {
                    "headline": "Wrap the hair into a bun.",
                    "description": "Once the hair is fully twisted, bring the strand towards your head. Wrap it in a circular motion around the head the same direction in which you twisted it. The hair will begin to coil into a bun. An alternative is to twist the hair halfway, then circle into a bun, leaving some of the end strands loose. Take the loose strands and spread it over the bun. Hold it in place with your palm."
                },
                {
                    "headline": "Secure the bun.",
                    "description": "Holding the bun with one hand, use the other hand to get the hair band from your wrist or from a nearby counter. Wrap the hair band around the bun until tight. Don't worry about not getting the hair secured perfectly. A quick, easy bun has the ends of the hair sticking out. You can tuck the ends under the hair band if you don't want them sticking out. An alternative is to use bobby pins to secure the bun instead of a hair tie. You will probably need between 4-8 pins. You can also add ribbons, barrettes, or clips for decoration. Pull down a few strands for a flyaway, bohemian look. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristine George\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster Hairstylist and Colorist\t\t\t\t\t\t\t\tChristine George is a Master Hairstylist, Colorist, and Owner of Luxe Parlour, a premier boutique salon based in the Los Angeles, California area. Christine has over 23 years of hair styling and coloring experience. She specializes in customized haircuts, premium color services, balayage expertise, classic highlights, and color correction. She received her cosmetology degree from the Newberry School of Beauty. Christine George\t\t\tMaster Hairstylist and Colorist\t\t\t\tTry a foam bun tool for an easy alternative. If you don't have much time to do your hair but you want to look clean and professional, try using a foam piece from a beauty supply store. Just put your shoulder-length or longer hair into a ponytail. Then, twist your ponytail around the foam piece and close the metal clasp to get the perfect bun!"
                }
            ]
        },
        {
            "name": "Making a Quick Braided Bun",
            "steps": [
                {
                    "headline": "Pull your hair into a ponytail.",
                    "description": "Brush your hair to rid it of any tangles. Then, pull it into a loose ponytail anywhere on your head. Secure this with a hair tie."
                },
                {
                    "headline": "Braid your hair.",
                    "description": "Braid the ponytail down to the end of your hair. Secure the braid with another hair tie. A simple braid works best on this, but a fishtail braid can work, too. To braid your hair, start by separating the hair into three strands. Cross the right strand over the middle strand. Pull the middle strand to the right so that it is now the right strand. Cross the left strand over the middle strand, then pull the middle strand to the left so it is now the left strand. Continue repeating this until you have braided all the way to the end. An alternative braided bun style is to gather your hair at your neck and start a loose braid with no hair tie. When you get to the ends, secure only two of the three strands, leaving one strand free."
                },
                {
                    "headline": "Wrap the hair into a bun.",
                    "description": "Take the braid and circle around the hair tie, making the bun. Tuck the loose ends of your hair and the hair tie underneath your bun. For the alternative style, hold the loose strand and push up the rest of the braid until it creates a messy bun."
                },
                {
                    "headline": "Secure the bun.",
                    "description": "Use 4-8 bobby pins to secure the bun. You can also use another hair tie to achieve this. Wrap the hair tie around the bun until tight. For the loose braided bun, tuck the loose strand under the bun and secure the bun with bobby pins."
                }
            ]
        },
        {
            "name": "Creating an Easy Three Twist Bun",
            "steps": [
                {
                    "headline": "Divide your hair into three sections.",
                    "description": "At the base of your neck, use your fingers to separate your hair into three equal sections. If you prefer to brush your hair before separating, you can. Or you can comb through it with your fingers for a messier look. This style works well with hair that is not freshly shampooed. If you need some texture, try sea salt spray or dry shampoo."
                },
                {
                    "headline": "Twist the right section.",
                    "description": "Start with the right side and twist the strand clockwise to the end. After you have twisted the strand, wrap it close to your head, producing a tiny bun. Secure this strand with bobby pins. For a messy, chic look, let some strands fall out so it doesn't look like a severe, tight bun."
                },
                {
                    "headline": "Twist the other two sections.",
                    "description": "Take the middle strand and twist it counterclockwise all the way to the end of your hair. Wrap this strand close to your head to make a mini-bun. Do the same thing with the left strand, twisting it counterclockwise. Secure them with bobby pins. Tug some hair from the sides of your hair to give yourself a messy, slept in look."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Hair band/hair tie",
        "Brush (Optional)",
        "Bobby pins (Optional)"
    ],
    "text": " Creating an Easy Bun Gather your hair into a ponytail. Fling your hair over your head, and then rapidly fling it back again. This creates volume for your bun, making the bun less severe and tight. Then, grasp the hair with your hands and hold it in a ponytail. You can brush your hair before this step. Since you are putting your hair up into a bun, you can skip this step. This style can work anywhere on your head. For a high, messy bun, use your fingers to brush your hair into a high ponytail on the top of your head. For a low bun, gather your hair at the base of your neck. If you need some texture in your hair, add some sea salt spray or dry shampoo. Twist the hair. After you have pulled your hair into a ponytail, twist the hair clockwise. As the hair is twisted, it will wrap around itself until you have one long twisted strand. You can also twist the hair counter-clockwise. The direction does not matter to the overall look of the bun; it is purely up to your preference. If you have unruly or thick hair, putting your hair in a ponytail before making a bun may help keep hair secure and in place. For an extra bit of style, leave one thick strand loose. After securing the hair into a bun, braid this strand of hair and wrap around the base of the bun for added flare and sophistication. Secure the braid by tucking the end under the bun and using a bobby pin to keep in place. Wrap the hair into a bun. Once the hair is fully twisted, bring the strand towards your head. Wrap it in a circular motion around the head the same direction in which you twisted it. The hair will begin to coil into a bun. An alternative is to twist the hair halfway, then circle into a bun, leaving some of the end strands loose. Take the loose strands and spread it over the bun. Hold it in place with your palm. Secure the bun. Holding the bun with one hand, use the other hand to get the hair band from your wrist or from a nearby counter. Wrap the hair band around the bun until tight. Don't worry about not getting the hair secured perfectly. A quick, easy bun has the ends of the hair sticking out. You can tuck the ends under the hair band if you don't want them sticking out. An alternative is to use bobby pins to secure the bun instead of a hair tie. You will probably need between 4-8 pins. You can also add ribbons, barrettes, or clips for decoration. Pull down a few strands for a flyaway, bohemian look. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristine George\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster Hairstylist and Colorist\t\t\t\t\t\t\t\tChristine George is a Master Hairstylist, Colorist, and Owner of Luxe Parlour, a premier boutique salon based in the Los Angeles, California area. Christine has over 23 years of hair styling and coloring experience. She specializes in customized haircuts, premium color services, balayage expertise, classic highlights, and color correction. She received her cosmetology degree from the Newberry School of Beauty. Christine George\t\t\tMaster Hairstylist and Colorist\t\t\t\tTry a foam bun tool for an easy alternative. If you don't have much time to do your hair but you want to look clean and professional, try using a foam piece from a beauty supply store. Just put your shoulder-length or longer hair into a ponytail. Then, twist your ponytail around the foam piece and close the metal clasp to get the perfect bun! Making a Quick Braided Bun Pull your hair into a ponytail. Brush your hair to rid it of any tangles. Then, pull it into a loose ponytail anywhere on your head. Secure this with a hair tie. Braid your hair. Braid the ponytail down to the end of your hair. Secure the braid with another hair tie. A simple braid works best on this, but a fishtail braid can work, too. To braid your hair, start by separating the hair into three strands. Cross the right strand over the middle strand. Pull the middle strand to the right so that it is now the right strand. Cross the left strand over the middle strand, then pull the middle strand to the left so it is now the left strand. Continue repeating this until you have braided all the way to the end. An alternative braided bun style is to gather your hair at your neck and start a loose braid with no hair tie. When you get to the ends, secure only two of the three strands, leaving one strand free. Wrap the hair into a bun. Take the braid and circle around the hair tie, making the bun. Tuck the loose ends of your hair and the hair tie underneath your bun. For the alternative style, hold the loose strand and push up the rest of the braid until it creates a messy bun. Secure the bun. Use 4-8 bobby pins to secure the bun. You can also use another hair tie to achieve this. Wrap the hair tie around the bun until tight. For the loose braided bun, tuck the loose strand under the bun and secure the bun with bobby pins. Creating an Easy Three Twist Bun Divide your hair into three sections. At the base of your neck, use your fingers to separate your hair into three equal sections. If you prefer to brush your hair before separating, you can. Or you can comb through it with your fingers for a messier look. This style works well with hair that is not freshly shampooed. If you need some texture, try sea salt spray or dry shampoo. Twist the right section. Start with the right side and twist the strand clockwise to the end. After you have twisted the strand, wrap it close to your head, producing a tiny bun. Secure this strand with bobby pins. For a messy, chic look, let some strands fall out so it doesn't look like a severe, tight bun. Twist the other two sections. Take the middle strand and twist it counterclockwise all the way to the end of your hair. Wrap this strand close to your head to make a mini-bun. Do the same thing with the left strand, twisting it counterclockwise. Secure them with bobby pins. Tug some hair from the sides of your hair to give yourself a messy, slept in look. Finished. ",
    "sentences": [
        " Creating an Easy Bun Gather your hair into a ponytail.",
        "Fling your hair over your head, and then rapidly fling it back again.",
        "This creates volume for your bun, making the bun less severe and tight.",
        "Then, grasp the hair with your hands and hold it in a ponytail.",
        "You can brush your hair before this step.",
        "Since you are putting your hair up into a bun, you can skip this step.",
        "This style can work anywhere on your head.",
        "For a high, messy bun, use your fingers to brush your hair into a high ponytail on the top of your head.",
        "For a low bun, gather your hair at the base of your neck.",
        "If you need some texture in your hair, add some sea salt spray or dry shampoo.",
        "Twist the hair.",
        "After you have pulled your hair into a ponytail, twist the hair clockwise.",
        "As the hair is twisted, it will wrap around itself until you have one long twisted strand.",
        "You can also twist the hair counter-clockwise.",
        "The direction does not matter to the overall look of the bun; it is purely up to your preference.",
        "If you have unruly or thick hair, putting your hair in a ponytail before making a bun may help keep hair secure and in place.",
        "For an extra bit of style, leave one thick strand loose.",
        "After securing the hair into a bun, braid this strand of hair and wrap around the base of the bun for added flare and sophistication.",
        "Secure the braid by tucking the end under the bun and using a bobby pin to keep in place.",
        "Wrap the hair into a bun.",
        "Once the hair is fully twisted, bring the strand towards your head.",
        "Wrap it in a circular motion around the head the same direction in which you twisted it.",
        "The hair will begin to coil into a bun.",
        "An alternative is to twist the hair halfway, then circle into a bun, leaving some of the end strands loose.",
        "Take the loose strands and spread it over the bun.",
        "Hold it in place with your palm.",
        "Secure the bun.",
        "Holding the bun with one hand, use the other hand to get the hair band from your wrist or from a nearby counter.",
        "Wrap the hair band around the bun until tight.",
        "Don't worry about not getting the hair secured perfectly.",
        "A quick, easy bun has the ends of the hair sticking out.",
        "You can tuck the ends under the hair band if you don't want them sticking out.",
        "An alternative is to use bobby pins to secure the bun instead of a hair tie.",
        "You will probably need between 4-8 pins.",
        "You can also add ribbons, barrettes, or clips for decoration.",
        "Pull down a few strands for a flyaway, bohemian look.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristine George\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster Hairstylist and Colorist\t\t\t\t\t\t\t\tChristine George is a Master Hairstylist, Colorist, and Owner of Luxe Parlour, a premier boutique salon based in the Los Angeles, California area.",
        "Christine has over 23 years of hair styling and coloring experience.",
        "She specializes in customized haircuts, premium color services, balayage expertise, classic highlights, and color correction.",
        "She received her cosmetology degree from the Newberry School of Beauty.",
        "Christine George\t\t\tMaster Hairstylist and Colorist\t\t\t\tTry a foam bun tool for an easy alternative.",
        "If you don't have much time to do your hair but you want to look clean and professional, try using a foam piece from a beauty supply store.",
        "Just put your shoulder-length or longer hair into a ponytail.",
        "Then, twist your ponytail around the foam piece and close the metal clasp to get the perfect bun!",
        "Making a Quick Braided Bun Pull your hair into a ponytail.",
        "Brush your hair to rid it of any tangles.",
        "Then, pull it into a loose ponytail anywhere on your head.",
        "Secure this with a hair tie.",
        "Braid your hair.",
        "Braid the ponytail down to the end of your hair.",
        "Secure the braid with another hair tie.",
        "A simple braid works best on this, but a fishtail braid can work, too.",
        "To braid your hair, start by separating the hair into three strands.",
        "Cross the right strand over the middle strand.",
        "Pull the middle strand to the right so that it is now the right strand.",
        "Cross the left strand over the middle strand, then pull the middle strand to the left so it is now the left strand.",
        "Continue repeating this until you have braided all the way to the end.",
        "An alternative braided bun style is to gather your hair at your neck and start a loose braid with no hair tie.",
        "When you get to the ends, secure only two of the three strands, leaving one strand free.",
        "Wrap the hair into a bun.",
        "Take the braid and circle around the hair tie, making the bun.",
        "Tuck the loose ends of your hair and the hair tie underneath your bun.",
        "For the alternative style, hold the loose strand and push up the rest of the braid until it creates a messy bun.",
        "Secure the bun.",
        "Use 4-8 bobby pins to secure the bun.",
        "You can also use another hair tie to achieve this.",
        "Wrap the hair tie around the bun until tight.",
        "For the loose braided bun, tuck the loose strand under the bun and secure the bun with bobby pins.",
        "Creating an Easy Three Twist Bun Divide your hair into three sections.",
        "At the base of your neck, use your fingers to separate your hair into three equal sections.",
        "If you prefer to brush your hair before separating, you can.",
        "Or you can comb through it with your fingers for a messier look.",
        "This style works well with hair that is not freshly shampooed.",
        "If you need some texture, try sea salt spray or dry shampoo.",
        "Twist the right section.",
        "Start with the right side and twist the strand clockwise to the end.",
        "After you have twisted the strand, wrap it close to your head, producing a tiny bun.",
        "Secure this strand with bobby pins.",
        "For a messy, chic look, let some strands fall out so it doesn't look like a severe, tight bun.",
        "Twist the other two sections.",
        "Take the middle strand and twist it counterclockwise all the way to the end of your hair.",
        "Wrap this strand close to your head to make a mini-bun.",
        "Do the same thing with the left strand, twisting it counterclockwise.",
        "Secure them with bobby pins.",
        "Tug some hair from the sides of your hair to give yourself a messy, slept in look.",
        "Finished."
    ]
}