{
    "title": "How to Grow Violets",
    "url": "https://www.wikihow.com/Grow-Violets",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Planting and Growing",
        "Growing Flowers"
    ],
    "methods": [
        {
            "name": "Preparing Your Garden",
            "steps": [
                {
                    "headline": "Determine your hardiness zone.",
                    "description": "Violets can grow in a wide variety of climates, but they might not be possible to grow in your area. Violets grow in hardiness zones 5-8. These zones are based on average annual temperatures, and the lower the number, the colder the climate. To check your hardiness zone, visit http://planthardiness.ars.usda.gov/PHZMWeb/."
                },
                {
                    "headline": "Get soil that is well drained and disease free.",
                    "description": "Violets require deep, well-draining soil. The type of soil can vary, as violets are fairly tolerant flowers. Adding some compost or fertilizer will supply the additional nutrients that will ensure your violets thrive."
                },
                {
                    "headline": "Check your soil pH level.",
                    "description": "Violets prefer a slightly acidic soil, anywhere with a pH value from 5.5 to 7. To check soil pH, you can purchase an inexpensive soil test at your local gardening store. To lower pH, you can add the following materials to your garden: elemental sulfur, aluminum sulfate, iron sulfate, and sulfur coated urea. All of these can be purchased at your local gardening center."
                },
                {
                    "headline": "Select an area with partial shade.",
                    "description": "Violets can handle full sun in colder climates, but if you live in warmer areas, it’s best to ensure your violets get regular shade. One idea is to plant them near or under deciduous trees, so they have shade during the summer but full sunlight in winter."
                },
                {
                    "headline": "Plan for adequate spacing.",
                    "description": "Like any other plant, violets need sufficient space to grow healthily. Violets grow between 6 to 12 inches (15 to 30 centimetres) high and require 6 to 12 inches (15 to 30 centimetres) of space between each plant."
                }
            ]
        },
        {
            "name": "Planting Violets",
            "steps": [
                {
                    "headline": "Plant seeds during the late fall.",
                    "description": "If you are planting seeds, it’s best to plant into flats in the autumn and covered with 0.125 inches (0.32 centimetres) inch of soil. Violet seeds require some cold stratification, so planting in autumn will allow the winter to prepare your seeds well. Alternatively, if you decide to start your violets indoors, plant them 6-8 weeks before the last frost of spring and transplant after."
                },
                {
                    "headline": "Plant seedlings in early spring.",
                    "description": "If you are planting seedlings or divided violets, plant after the last frost of the winter. While violets can handle mild frosts, harsh ones will kill your flowers."
                },
                {
                    "headline": "Add mulch.",
                    "description": "Mulch can help ensure the soil stays damp and your roots to keep cool longer. Consider doing so especially if you live in a hot climate."
                },
                {
                    "headline": "Fertilize.",
                    "description": "You can use compost, manure, or a general fertilizer. Fertilize your soil during planting, and then once a month afterwards for best results."
                }
            ]
        },
        {
            "name": "Caring for Violets",
            "steps": [
                {
                    "headline": "Keep your soil damp, but not saturated.",
                    "description": "If your soil is well-drained, a light, regular watering of once or twice weekly should be sufficient. The surface of the soil should feel damp"
                },
                {
                    "headline": "Remove spent blooms.",
                    "description": "Once your flowers are spent, trim them back. This will let the next flowers have room to bloom and make your garden bloom longer in general. This will also keep the appearance of your garden neat."
                },
                {
                    "headline": "Propagate your violets to add to your garden.",
                    "description": "You can divide violets at the beginning of spring to allow your violets to propagate further. Cut back the foliage about halfway before dividing to reduce the stress on the plant. Take a cutting near the root and grow them in a pot indoors six to eight weeks before the last frost to have them ready by spring."
                },
                {
                    "headline": "Fertilize in late autumn with liquid fertilizer.",
                    "description": "Because violets are perennials, well-cared-for violets can live longer than two years. At the beginning of spring, add a liquid fertilizer to your soil to ensure your violets have enough nutrients to spring back."
                }
            ]
        }
    ],
    "tyn": [
        "Violet seeds/seedlings",
        "Soil",
        "Soil kit",
        "Fertilizer",
        "Mulch",
        "Water"
    ],
    "text": " Preparing Your Garden Determine your hardiness zone. Violets can grow in a wide variety of climates, but they might not be possible to grow in your area. Violets grow in hardiness zones 5-8. These zones are based on average annual temperatures, and the lower the number, the colder the climate. To check your hardiness zone, visit http://planthardiness.ars.usda.gov/PHZMWeb/. Get soil that is well drained and disease free. Violets require deep, well-draining soil. The type of soil can vary, as violets are fairly tolerant flowers. Adding some compost or fertilizer will supply the additional nutrients that will ensure your violets thrive. Check your soil pH level. Violets prefer a slightly acidic soil, anywhere with a pH value from 5.5 to 7. To check soil pH, you can purchase an inexpensive soil test at your local gardening store. To lower pH, you can add the following materials to your garden: elemental sulfur, aluminum sulfate, iron sulfate, and sulfur coated urea. All of these can be purchased at your local gardening center. Select an area with partial shade. Violets can handle full sun in colder climates, but if you live in warmer areas, it’s best to ensure your violets get regular shade. One idea is to plant them near or under deciduous trees, so they have shade during the summer but full sunlight in winter. Plan for adequate spacing. Like any other plant, violets need sufficient space to grow healthily. Violets grow between 6 to 12 inches (15 to 30 centimetres) high and require 6 to 12 inches (15 to 30 centimetres) of space between each plant. Planting Violets Plant seeds during the late fall. If you are planting seeds, it’s best to plant into flats in the autumn and covered with 0.125 inches (0.32 centimetres) inch of soil. Violet seeds require some cold stratification, so planting in autumn will allow the winter to prepare your seeds well. Alternatively, if you decide to start your violets indoors, plant them 6-8 weeks before the last frost of spring and transplant after. Plant seedlings in early spring. If you are planting seedlings or divided violets, plant after the last frost of the winter. While violets can handle mild frosts, harsh ones will kill your flowers. Add mulch. Mulch can help ensure the soil stays damp and your roots to keep cool longer. Consider doing so especially if you live in a hot climate. Fertilize. You can use compost, manure, or a general fertilizer. Fertilize your soil during planting, and then once a month afterwards for best results. Caring for Violets Keep your soil damp, but not saturated. If your soil is well-drained, a light, regular watering of once or twice weekly should be sufficient. The surface of the soil should feel damp Remove spent blooms. Once your flowers are spent, trim them back. This will let the next flowers have room to bloom and make your garden bloom longer in general. This will also keep the appearance of your garden neat. Propagate your violets to add to your garden. You can divide violets at the beginning of spring to allow your violets to propagate further. Cut back the foliage about halfway before dividing to reduce the stress on the plant. Take a cutting near the root and grow them in a pot indoors six to eight weeks before the last frost to have them ready by spring. Fertilize in late autumn with liquid fertilizer. Because violets are perennials, well-cared-for violets can live longer than two years. At the beginning of spring, add a liquid fertilizer to your soil to ensure your violets have enough nutrients to spring back.",
    "sentences": [
        " Preparing Your Garden Determine your hardiness zone.",
        "Violets can grow in a wide variety of climates, but they might not be possible to grow in your area.",
        "Violets grow in hardiness zones 5-8.",
        "These zones are based on average annual temperatures, and the lower the number, the colder the climate.",
        "To check your hardiness zone, visit http://planthardiness.ars.usda.gov/PHZMWeb/.",
        "Get soil that is well drained and disease free.",
        "Violets require deep, well-draining soil.",
        "The type of soil can vary, as violets are fairly tolerant flowers.",
        "Adding some compost or fertilizer will supply the additional nutrients that will ensure your violets thrive.",
        "Check your soil pH level.",
        "Violets prefer a slightly acidic soil, anywhere with a pH value from 5.5 to 7.",
        "To check soil pH, you can purchase an inexpensive soil test at your local gardening store.",
        "To lower pH, you can add the following materials to your garden: elemental sulfur, aluminum sulfate, iron sulfate, and sulfur coated urea.",
        "All of these can be purchased at your local gardening center.",
        "Select an area with partial shade.",
        "Violets can handle full sun in colder climates, but if you live in warmer areas, it’s best to ensure your violets get regular shade.",
        "One idea is to plant them near or under deciduous trees, so they have shade during the summer but full sunlight in winter.",
        "Plan for adequate spacing.",
        "Like any other plant, violets need sufficient space to grow healthily.",
        "Violets grow between 6 to 12 inches (15 to 30 centimetres) high and require 6 to 12 inches (15 to 30 centimetres) of space between each plant.",
        "Planting Violets Plant seeds during the late fall.",
        "If you are planting seeds, it’s best to plant into flats in the autumn and covered with 0.125 inches (0.32 centimetres) inch of soil.",
        "Violet seeds require some cold stratification, so planting in autumn will allow the winter to prepare your seeds well.",
        "Alternatively, if you decide to start your violets indoors, plant them 6-8 weeks before the last frost of spring and transplant after.",
        "Plant seedlings in early spring.",
        "If you are planting seedlings or divided violets, plant after the last frost of the winter.",
        "While violets can handle mild frosts, harsh ones will kill your flowers.",
        "Add mulch.",
        "Mulch can help ensure the soil stays damp and your roots to keep cool longer.",
        "Consider doing so especially if you live in a hot climate.",
        "Fertilize.",
        "You can use compost, manure, or a general fertilizer.",
        "Fertilize your soil during planting, and then once a month afterwards for best results.",
        "Caring for Violets Keep your soil damp, but not saturated.",
        "If your soil is well-drained, a light, regular watering of once or twice weekly should be sufficient.",
        "The surface of the soil should feel damp Remove spent blooms.",
        "Once your flowers are spent, trim them back.",
        "This will let the next flowers have room to bloom and make your garden bloom longer in general.",
        "This will also keep the appearance of your garden neat.",
        "Propagate your violets to add to your garden.",
        "You can divide violets at the beginning of spring to allow your violets to propagate further.",
        "Cut back the foliage about halfway before dividing to reduce the stress on the plant.",
        "Take a cutting near the root and grow them in a pot indoors six to eight weeks before the last frost to have them ready by spring.",
        "Fertilize in late autumn with liquid fertilizer.",
        "Because violets are perennials, well-cared-for violets can live longer than two years.",
        "At the beginning of spring, add a liquid fertilizer to your soil to ensure your violets have enough nutrients to spring back."
    ]
}