{
    "title": "How to Kill Vines",
    "url": "https://www.wikihow.com/Kill-Vines",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Garden Pests and Weeds"
    ],
    "methods": [
        {
            "name": "Removing the Vines Manually",
            "steps": [
                {
                    "headline": "Cover up to protect your skin from the vines.",
                    "description": "Some species of vines, such as English ivy, may cause irritation to your skin. Protect yourself by wearing long sleeves, pants, and shoes to cover your skin when you handle vines. You should also wear thick gardening gloves. Proper attire may also protect you from scratches and bug bites while you work."
                },
                {
                    "headline": "Pry away climbing vines from trees or buildings with a sturdy, flat tool.",
                    "description": "To avoid damage to the trees or other surfaces they are clinging to, remove vines by using a long, flat object to pry it away. Gently insert a screwdriver, crowbar, or similar tool between each vine and the surface it is clinging to. Slowly pull the vine up and away. If you are removing vines from a tree, pull them off slowly to avoid damaging the tree's bark."
                },
                {
                    "headline": "Cut away vines with pruning shears or a pruning saw.",
                    "description": "Cut off climbing vines at a height of 3–5 feet (0.91–1.52 m). Use pruning shears or a razor tooth pruning saw to sever the vines, depending on their thickness. This helps make removing the roots more manageable. Dispose of all vine cuttings right away as new plants can grow easily from cut stems."
                },
                {
                    "headline": "Pull or dig the base of the vines out of the ground by hand.",
                    "description": "If the vine is still fairly small, you should be able to track down the roots. Pull the roots out by hand or use a shovel or trowel to dig the root system out completely. Remove the underground roots, bulbs, and tubers completely to effectively kill the vines. For best results, do this when the soil is moist and soft in the spring. You will be able to move more of the dirt around this way, giving you better access to the root system. Note that you might need to dig out vine seedlings regularly for a few months or years to keep the problem under control."
                },
                {
                    "headline": "Mow vines growing on the ground to kill them easily.",
                    "description": "Groundcover vines can be controlled by cutting them down with a lawnmower. Use a gas-powered machine that will be powerful enough to cut through tough vines instead of just rolling over them. Doing this at least 3-4 times a year will slowly kill the spreading vine. Electric or rotary mowers are more likely to run over vines than to cut them. If you want to reduce the hard labor of killing vines, this is the best option to try, though it will take regular, repeat mowing for it to be effective."
                }
            ]
        },
        {
            "name": "Using Non-Toxic Materials to Kill the Vines",
            "steps": [
                {
                    "headline": "Smother the vine with mulch.",
                    "description": "Vines require light, water, and air to survive and grow. Cover the vine with mulch, which is made up of any materials you can use to cover the area where the vines grow. Cover the area thoroughly to deprive the vines of enough light, sun, and air to kill them off within a few weeks. Try to use biodegradable mulch materials like grass cuttings, tree bark, old newspaper, or dead leaves so that they can decompose into the soil after killing the vines. Alternatively, you can cover the vines with plastic sheeting. This will rob the plant of oxygen and build up intense heat, which is likely kill off the vine after a few weeks."
                },
                {
                    "headline": "Spray the vines with a vinegar mixture.",
                    "description": "Fill a spray bottle or garden sprayer with a mixture of 80% water and 20% white vinegar. Douse the vines with the mixture. Check their condition after 2-3 days and pull out any dead vines. Repeat the process if necessary. Be careful to avoid spraying other plants with the mixture."
                },
                {
                    "headline": "Pour boiling water onto the root crown of the vines.",
                    "description": "Cut away the bulk of the surface vines with pruning shears and discard them. Use a shovel or trowel to dig into the ground until you reach the vine root. Pour 3–4 cups (0.71–0.95 L) of boiling water directly onto the top of the root system, where the roots meet the base of the plant."
                }
            ]
        },
        {
            "name": "Applying a Systemic Herbicide",
            "steps": [
                {
                    "headline": "Buy a triclopyr herbicide to kill thick, woody vines.",
                    "description": "Systemic herbicides enter the vines' circulatory system through their leaves, then kill off their roots. Use a triclopyr herbicide, the strongest type of systemic herbicide, to kill vines that are strong and thick. This will penetrate the tough exterior of the vines easily. Buy herbicide at a local garden center or hardware store."
                },
                {
                    "headline": "Use a glyphosate herbicide to tackle herbaceous vines.",
                    "description": "Herbaceous vines can be removed with a milder systemic herbicide. Apply a glyphosate herbicide to the vine leaves to be absorbed into the circulatory system. Herbaceous vines are not as durable as woody vines and can be killed without need for a more intense poison."
                },
                {
                    "headline": "Spray isolated vine leaves with systemic herbicide.",
                    "description": "If you are killing vines on the ground or on a building that are not touching other plants, spray them with herbicide. Apply enough herbicide to completely wet the foliage of the vine. Avoid dousing the leaves enough to cause runoff onto the ground, which may damage the soil and the roots of nearby plants. Do not spray vines growing on trees or other plants. It may take several weeks or months to kill the vines depending on their thickness and how developed their root system is. Multiple applications may be necessary."
                },
                {
                    "headline": "Cover your other plants with plastic bags or plastic sheeting while you spray.",
                    "description": "Protect your garden from vine-killing chemicals by covering them completely with thick plastic. To protect their roots, cover the soil surrounding them as much as possible. Ground the plastic with large rocks, bricks, or stakes while you spray. Remove the plastic 2-3 hours after applying the herbicide."
                },
                {
                    "headline": "Cut away large vines and treat the stumps with herbicide.",
                    "description": "Larger, well-established vines are likely to be intertwined with other plants or firmly planted on building or trees. Cut away these vines with a pruning saw or shears and leave a 3–5 inches (7.6–12.7 cm) stump. Apply an undiluted triclopyr herbicide directly to the freshly cut stump. The treated stump should die within a week or 2 after the herbicide attacks the root system."
                }
            ]
        }
    ],
    "tyn": [
        "Physically Removing the Vines",
        "Gloves",
        "Protective clothing",
        "Trowel or shovel",
        "Pruning shears or pruning saw",
        "Lawnmower",
        "Using Non-Toxic Materials to Kill the Vines",
        "Mulch",
        "Plastic sheeting",
        "Vinegar",
        "Boiling water",
        "Using a Systemic Herbicide",
        "Systemic herbicide (glyphosate or triclopyr)",
        "Plastic bags or sheeting",
        "Rocks or bricks",
        "Pruning saw or shears",
        "Plastic or rubber (nonabsorbent) gloves",
        "Mask to prevent inhalation of airborne chemicals"
    ],
    "text": " Removing the Vines Manually Cover up to protect your skin from the vines. Some species of vines, such as English ivy, may cause irritation to your skin. Protect yourself by wearing long sleeves, pants, and shoes to cover your skin when you handle vines. You should also wear thick gardening gloves. Proper attire may also protect you from scratches and bug bites while you work. Pry away climbing vines from trees or buildings with a sturdy, flat tool. To avoid damage to the trees or other surfaces they are clinging to, remove vines by using a long, flat object to pry it away. Gently insert a screwdriver, crowbar, or similar tool between each vine and the surface it is clinging to. Slowly pull the vine up and away. If you are removing vines from a tree, pull them off slowly to avoid damaging the tree's bark. Cut away vines with pruning shears or a pruning saw. Cut off climbing vines at a height of 3–5 feet (0.91–1.52 m). Use pruning shears or a razor tooth pruning saw to sever the vines, depending on their thickness. This helps make removing the roots more manageable. Dispose of all vine cuttings right away as new plants can grow easily from cut stems. Pull or dig the base of the vines out of the ground by hand. If the vine is still fairly small, you should be able to track down the roots. Pull the roots out by hand or use a shovel or trowel to dig the root system out completely. Remove the underground roots, bulbs, and tubers completely to effectively kill the vines. For best results, do this when the soil is moist and soft in the spring. You will be able to move more of the dirt around this way, giving you better access to the root system. Note that you might need to dig out vine seedlings regularly for a few months or years to keep the problem under control. Mow vines growing on the ground to kill them easily. Groundcover vines can be controlled by cutting them down with a lawnmower. Use a gas-powered machine that will be powerful enough to cut through tough vines instead of just rolling over them. Doing this at least 3-4 times a year will slowly kill the spreading vine. Electric or rotary mowers are more likely to run over vines than to cut them. If you want to reduce the hard labor of killing vines, this is the best option to try, though it will take regular, repeat mowing for it to be effective. Using Non-Toxic Materials to Kill the Vines Smother the vine with mulch. Vines require light, water, and air to survive and grow. Cover the vine with mulch, which is made up of any materials you can use to cover the area where the vines grow. Cover the area thoroughly to deprive the vines of enough light, sun, and air to kill them off within a few weeks. Try to use biodegradable mulch materials like grass cuttings, tree bark, old newspaper, or dead leaves so that they can decompose into the soil after killing the vines. Alternatively, you can cover the vines with plastic sheeting. This will rob the plant of oxygen and build up intense heat, which is likely kill off the vine after a few weeks. Spray the vines with a vinegar mixture. Fill a spray bottle or garden sprayer with a mixture of 80% water and 20% white vinegar. Douse the vines with the mixture. Check their condition after 2-3 days and pull out any dead vines. Repeat the process if necessary. Be careful to avoid spraying other plants with the mixture. Pour boiling water onto the root crown of the vines. Cut away the bulk of the surface vines with pruning shears and discard them. Use a shovel or trowel to dig into the ground until you reach the vine root. Pour 3–4 cups (0.71–0.95 L) of boiling water directly onto the top of the root system, where the roots meet the base of the plant. Applying a Systemic Herbicide Buy a triclopyr herbicide to kill thick, woody vines. Systemic herbicides enter the vines' circulatory system through their leaves, then kill off their roots. Use a triclopyr herbicide, the strongest type of systemic herbicide, to kill vines that are strong and thick. This will penetrate the tough exterior of the vines easily. Buy herbicide at a local garden center or hardware store. Use a glyphosate herbicide to tackle herbaceous vines. Herbaceous vines can be removed with a milder systemic herbicide. Apply a glyphosate herbicide to the vine leaves to be absorbed into the circulatory system. Herbaceous vines are not as durable as woody vines and can be killed without need for a more intense poison. Spray isolated vine leaves with systemic herbicide. If you are killing vines on the ground or on a building that are not touching other plants, spray them with herbicide. Apply enough herbicide to completely wet the foliage of the vine. Avoid dousing the leaves enough to cause runoff onto the ground, which may damage the soil and the roots of nearby plants. Do not spray vines growing on trees or other plants. It may take several weeks or months to kill the vines depending on their thickness and how developed their root system is. Multiple applications may be necessary. Cover your other plants with plastic bags or plastic sheeting while you spray. Protect your garden from vine-killing chemicals by covering them completely with thick plastic. To protect their roots, cover the soil surrounding them as much as possible. Ground the plastic with large rocks, bricks, or stakes while you spray. Remove the plastic 2-3 hours after applying the herbicide. Cut away large vines and treat the stumps with herbicide. Larger, well-established vines are likely to be intertwined with other plants or firmly planted on building or trees. Cut away these vines with a pruning saw or shears and leave a 3–5 inches (7.6–12.7 cm) stump. Apply an undiluted triclopyr herbicide directly to the freshly cut stump. The treated stump should die within a week or 2 after the herbicide attacks the root system.",
    "sentences": [
        " Removing the Vines Manually Cover up to protect your skin from the vines.",
        "Some species of vines, such as English ivy, may cause irritation to your skin.",
        "Protect yourself by wearing long sleeves, pants, and shoes to cover your skin when you handle vines.",
        "You should also wear thick gardening gloves.",
        "Proper attire may also protect you from scratches and bug bites while you work.",
        "Pry away climbing vines from trees or buildings with a sturdy, flat tool.",
        "To avoid damage to the trees or other surfaces they are clinging to, remove vines by using a long, flat object to pry it away.",
        "Gently insert a screwdriver, crowbar, or similar tool between each vine and the surface it is clinging to.",
        "Slowly pull the vine up and away.",
        "If you are removing vines from a tree, pull them off slowly to avoid damaging the tree's bark.",
        "Cut away vines with pruning shears or a pruning saw.",
        "Cut off climbing vines at a height of 3–5 feet (0.91–1.52 m).",
        "Use pruning shears or a razor tooth pruning saw to sever the vines, depending on their thickness.",
        "This helps make removing the roots more manageable.",
        "Dispose of all vine cuttings right away as new plants can grow easily from cut stems.",
        "Pull or dig the base of the vines out of the ground by hand.",
        "If the vine is still fairly small, you should be able to track down the roots.",
        "Pull the roots out by hand or use a shovel or trowel to dig the root system out completely.",
        "Remove the underground roots, bulbs, and tubers completely to effectively kill the vines.",
        "For best results, do this when the soil is moist and soft in the spring.",
        "You will be able to move more of the dirt around this way, giving you better access to the root system.",
        "Note that you might need to dig out vine seedlings regularly for a few months or years to keep the problem under control.",
        "Mow vines growing on the ground to kill them easily.",
        "Groundcover vines can be controlled by cutting them down with a lawnmower.",
        "Use a gas-powered machine that will be powerful enough to cut through tough vines instead of just rolling over them.",
        "Doing this at least 3-4 times a year will slowly kill the spreading vine.",
        "Electric or rotary mowers are more likely to run over vines than to cut them.",
        "If you want to reduce the hard labor of killing vines, this is the best option to try, though it will take regular, repeat mowing for it to be effective.",
        "Using Non-Toxic Materials to Kill the Vines Smother the vine with mulch.",
        "Vines require light, water, and air to survive and grow.",
        "Cover the vine with mulch, which is made up of any materials you can use to cover the area where the vines grow.",
        "Cover the area thoroughly to deprive the vines of enough light, sun, and air to kill them off within a few weeks.",
        "Try to use biodegradable mulch materials like grass cuttings, tree bark, old newspaper, or dead leaves so that they can decompose into the soil after killing the vines.",
        "Alternatively, you can cover the vines with plastic sheeting.",
        "This will rob the plant of oxygen and build up intense heat, which is likely kill off the vine after a few weeks.",
        "Spray the vines with a vinegar mixture.",
        "Fill a spray bottle or garden sprayer with a mixture of 80% water and 20% white vinegar.",
        "Douse the vines with the mixture.",
        "Check their condition after 2-3 days and pull out any dead vines.",
        "Repeat the process if necessary.",
        "Be careful to avoid spraying other plants with the mixture.",
        "Pour boiling water onto the root crown of the vines.",
        "Cut away the bulk of the surface vines with pruning shears and discard them.",
        "Use a shovel or trowel to dig into the ground until you reach the vine root.",
        "Pour 3–4 cups (0.71–0.95 L) of boiling water directly onto the top of the root system, where the roots meet the base of the plant.",
        "Applying a Systemic Herbicide Buy a triclopyr herbicide to kill thick, woody vines.",
        "Systemic herbicides enter the vines' circulatory system through their leaves, then kill off their roots.",
        "Use a triclopyr herbicide, the strongest type of systemic herbicide, to kill vines that are strong and thick.",
        "This will penetrate the tough exterior of the vines easily.",
        "Buy herbicide at a local garden center or hardware store.",
        "Use a glyphosate herbicide to tackle herbaceous vines.",
        "Herbaceous vines can be removed with a milder systemic herbicide.",
        "Apply a glyphosate herbicide to the vine leaves to be absorbed into the circulatory system.",
        "Herbaceous vines are not as durable as woody vines and can be killed without need for a more intense poison.",
        "Spray isolated vine leaves with systemic herbicide.",
        "If you are killing vines on the ground or on a building that are not touching other plants, spray them with herbicide.",
        "Apply enough herbicide to completely wet the foliage of the vine.",
        "Avoid dousing the leaves enough to cause runoff onto the ground, which may damage the soil and the roots of nearby plants.",
        "Do not spray vines growing on trees or other plants.",
        "It may take several weeks or months to kill the vines depending on their thickness and how developed their root system is.",
        "Multiple applications may be necessary.",
        "Cover your other plants with plastic bags or plastic sheeting while you spray.",
        "Protect your garden from vine-killing chemicals by covering them completely with thick plastic.",
        "To protect their roots, cover the soil surrounding them as much as possible.",
        "Ground the plastic with large rocks, bricks, or stakes while you spray.",
        "Remove the plastic 2-3 hours after applying the herbicide.",
        "Cut away large vines and treat the stumps with herbicide.",
        "Larger, well-established vines are likely to be intertwined with other plants or firmly planted on building or trees.",
        "Cut away these vines with a pruning saw or shears and leave a 3–5 inches (7.6–12.7 cm) stump.",
        "Apply an undiluted triclopyr herbicide directly to the freshly cut stump.",
        "The treated stump should die within a week or 2 after the herbicide attacks the root system."
    ]
}