{
    "title": "How to Make a Capri Sun Purse",
    "url": "https://www.wikihow.com/Make-a-Capri-Sun-Purse",
    "category_hierarchy": [
        "Personal Care and Style",
        "Bags"
    ],
    "parts": [
        {
            "name": "Cleaning and Cutting the Bags",
            "steps": [
                {
                    "headline": "Find 10 empty Capri Sun pouches.",
                    "description": "The pouches can all be the same flavor, or they can be different flavors. If you want to make a slightly bigger bag, however, you will need more pouches.If your friends like to drink Capri Sun too, ask them to save their pouches and give them to you once they finish their drink. You only need the pouches; throw the straws away."
                },
                {
                    "headline": "Cut a slit into the bottom of each pouch.",
                    "description": "Do not cut the bottom off. Instead, pull the bottom edges apart to reveal the bottom panel. Poke a pair of scissors into the bottom panel, then cut a slit into it, from 1 side of the pouch to the other.The slit needs to span the entire width of the bottom panel. You can use a serrated knife for this step, but be careful! If you are a child, ask an adult to help you."
                },
                {
                    "headline": "Rinse the pouches with soapy water to remove any sticky residue.",
                    "description": "Use the slit to fill your first pouch with water. Add a pump of dish soap, then slosh the water around inside the pouch. Dump the water out, then fill the pouch with fresh water. Slosh the water around again, then dump it out. Do this for all of the pouches.If you don't have dish soap, use liquid hand soap. You can wash the pouches in the dishwasher. Slip them over the prongs on the top and bottom racks, then start a cycle. Don't do a drying cycle, however!"
                },
                {
                    "headline": "Allow the pouches to dry overnight.",
                    "description": "Stand the pouches up on a paper towel, or prop them up on a dish rack. Alternatively, open up a dishwasher, and slide the pouches onto the prongs. The pouches must be completely dry before you sew them. This may take up to 8 hours. Don't use a drying cycle on a dishwasher, as the hot air can damage the pouches."
                }
            ]
        },
        {
            "name": "Creating the Panels",
            "steps": [
                {
                    "headline": "Overlap 2 pouches along the long, side edges.",
                    "description": "Take 2 pouches that you want to use for the front of your bag. Turn them so that the front sides are facing up. Place them side-by-side, then overlap the long, side edges. The front is the side with the design and the words “Capri Sun” on it. How much you overlap the side edges by depends on the width of the seam. For most pouches, this will be about ⁄4 inch (0.64 cm). This bag will require some sewing. If you don't know how to sew, you can use duct tape instead. In this case, do not overlap the bags. Place them side-by-side instead."
                },
                {
                    "headline": "Sew down the seam between the 2 pouches using a zigzag stitch.",
                    "description": "You can use any color of thread you want for this, but red, blue, or yellow would look the best. Backstitch when you start and finish sewing so that the thread doesn't unravel.A backstitch is simply where you reverse the sewing machine for 2 to 3 stitches. Add more pouches to the sides and top to create a bigger bag. If you don't know how to sew, cut a 5 ⁄2 in (14 cm) strip of duct tape in half lengthwise, then tape the seams on the front and back of the pouch. If you taped the pouches together, fold a strip of duct tape over the bottom edge of the panel. This will cover up the seams and prevent the bag from coming apart."
                },
                {
                    "headline": "Repeat the process to create a second panel for the back of the bag.",
                    "description": "Take 2 more pouches and overlap the side edges. Make sure that the front side with the design is facing you, then sew down the seam using a zigzag stitch. If you made the front panel bigger, you will need to make the back panel bigger too so that they both match. If you taped the bags together, remember to fold a strip of duct tape over the bottom edge of the panel as well."
                },
                {
                    "headline": "Overlap 2 pouches until they are the same width as the front panel.",
                    "description": "Take 2 pouches and overlap the narrow ends until they are the same width as the front panel. How much you overlap the pouches by depends on the width of your front panel; the narrower the panel is, the more you'll have to overlap them by. This will eventually create the bottom panel of your bag. Make sure that the same side is facing up on both pouches. You should still overlap the pouches, even if you are making a duct taped bag."
                },
                {
                    "headline": "Sew the seams on the bottom panel with a zigzag stitch.",
                    "description": "Find the seam on the front of your bottom panel. Sew down the seam using a zigzag stitch, then flip the strip over. Find the seam on the back, then sew it down using a zigzag stitch as well.Remember to backstitch when you start and finish sewing. For a duct taped bag, cut a 3 ⁄4 in (9.5 cm) strip of duct tape in half lengthwise, then place each strip over each seam on the front and back. If you taped the pouches, check the narrow ends of your bottom panel. If you see slits in the pouches, fold a strip of duct tape over them to close them up."
                },
                {
                    "headline": "Set 2 pouches aside for the side panels.",
                    "description": "If you are making a taller bag, then you will need to sew extra pouches together first to make taller side panels. You will use these later, once you are ready to assemble the bag.For a duct taped bag, remember to fold strips of duct tape over the bottom edges to hide the slits."
                }
            ]
        },
        {
            "name": "Adding the Handles",
            "steps": [
                {
                    "headline": "Overlap the ends of 2 pouches by ⁄4 inch (0.64 cm).",
                    "description": "Take 2 pouches and overlap the narrow top and bottom ends by ⁄4 inch (0.64 cm). Make sure that the front of each pouch is facing up.If you aren't sewing the bag, simply have the narrow edges touching; don’t overlap them."
                },
                {
                    "headline": "Sew across the overlap with a zigzag stitch.",
                    "description": "For a stronger handle, flip the bag over, then zigzag stitch across the seam on the back. Remember to backstitch so that your stitching doesn't come undone.For a duct taped bag, cut a 3 ⁄4 in (9.5 cm) strip of duct tape in half, then tape the narrow edges of the pouches together. Do this for the front and the back."
                },
                {
                    "headline": "Cut the strip down the middle lengthwise.",
                    "description": "If you need to, fold the strip in half first to find the center, then cut it. This will create 2 identical handles."
                },
                {
                    "headline": "Fold the strips in half lengthwise, then zigzag stitch the cut edges.",
                    "description": "Fold the first strip in half lengthwise, then sew along the long, raw edge (not the folded edge) with a zigzag stitch. Repeat this step for the other strip.For a duct taped bag, fold both long edges towards the middle. Cut a strip of duct tape in half lengthwise, then cover the seam with it. Do this for both handles."
                },
                {
                    "headline": "Sew the strips to the front and back panels with a zigzag stitch.",
                    "description": "Place the ends of your first strip along the top edge of your front panel. Sew across the bottom and side edges of the strip first, then sew across the strip where it meets the top edge of the bag. Repeat this step with the second strip for the back panel.The ends of the handles should be on the outside (design side) of the panels. If your straw holes are on the top edge of the panels, use those as a placement guide. For a duct taped bag, secure the ends of the strips to the panels with square pieces of duct tape."
                }
            ]
        },
        {
            "name": "Assembling the Bag",
            "steps": [
                {
                    "headline": "Overlap the front and bottom panels by ⁄4 inch (0.64 cm).",
                    "description": "Set both panels down with the silver (back) side facing up. Make sure that the bottom edge of the front panel is touching 1 of the long edges on the bottom panel. Slide the panels together so that the 2 edges overlap by about ⁄4 inch (0.64 cm).If you aren't sewing the bag, don't overlap the edges. Instead, place the edges close enough so that they touch."
                },
                {
                    "headline": "Sew the edges together with a zigzag stitch.",
                    "description": "Try to sew right down the middle of the seam. Start on 1 side of the bottom panel and finish on the other. Backstitch when you start and finish sewing.For a duct taped bag, cover the seams on the front and back of the bag with a strip of duct tape that's been cut in half lengthwise."
                },
                {
                    "headline": "Overlap and sew the edges of the back and bottom panels.",
                    "description": "Place the back panel against the other long edge on the bottom panel. Slide the 2 panels together so that the edges overlap by about ⁄4 inch (0.64 cm), then sew across the seam with a zigzag stitch.Make sure that the silver side of the back panel is facing you and remember to backstitch. If you are taping the bag, skip the overlap and tape the edges together, just like you did for the front panel."
                },
                {
                    "headline": "Repeat the process with the side panels to form a cross shape.",
                    "description": "Overlap the narrow bottom edges of the side panels with the narrow side edges of the bottom panel. Sew down both seams with a zigzag stitch. When you are done, you should have a cross shape.Keep the overlap consistent with the front and back panels, about ⁄4 inch (0.64 cm). The silver side of the side panels should be facing up. Be sure to backstitch. For a no-sew bag, skip the overlap. Cut strips of duct tape in half lengthwise, then place them over the seams on the front and back of the bag instead."
                },
                {
                    "headline": "Bring the edges of the side panel and front panel together.",
                    "description": "Stand the left side panel and the front panel up so that they are perpendicular to the bottom panel. Bring the adjacent edges together to form a corner, like on a box. You won't be turning this bag inside-out, so make sure that the silver sides are touching."
                },
                {
                    "headline": "Sew down the edge with a zigzag stitch.",
                    "description": "Begin sewing at the top edge of the bag, and finish sewing at the bottom edge, where the bottom panel begins. Use a zigzag stitch, and remember to backstitch when you start and finish sewing.For a no-sew bag, fold a strip of duct tape over the seam instead. For a stronger bag, cover the seam on the inside with a strip of duct tape as well."
                },
                {
                    "headline": "Repeat the procedure for the remaining 3 seams.",
                    "description": "Bring the right side panel towards the right edge on the front panel. Make sure that the silver sides are touching, then sew the seam with a zigzag stitch. Repeat this step for the remaining edges on the side panels and the back panel.Be sure to backstitch whenever you start and finish sewing a seam. If you are duct taping the bag, continue to fold strips of duct tape over the edges of the panels. Remember to cover the inside seams with more duct tape too."
                }
            ]
        }
    ],
    "tyn": [
        "10 Capri Sun juice pouches",
        "Scissors",
        "Thread",
        "Sewing machine",
        "Duct tape (no-sew version)"
    ],
    "text": " Cleaning and Cutting the Bags Find 10 empty Capri Sun pouches. The pouches can all be the same flavor, or they can be different flavors. If you want to make a slightly bigger bag, however, you will need more pouches.If your friends like to drink Capri Sun too, ask them to save their pouches and give them to you once they finish their drink. You only need the pouches; throw the straws away. Cut a slit into the bottom of each pouch. Do not cut the bottom off. Instead, pull the bottom edges apart to reveal the bottom panel. Poke a pair of scissors into the bottom panel, then cut a slit into it, from 1 side of the pouch to the other.The slit needs to span the entire width of the bottom panel. You can use a serrated knife for this step, but be careful! If you are a child, ask an adult to help you. Rinse the pouches with soapy water to remove any sticky residue. Use the slit to fill your first pouch with water. Add a pump of dish soap, then slosh the water around inside the pouch. Dump the water out, then fill the pouch with fresh water. Slosh the water around again, then dump it out. Do this for all of the pouches.If you don't have dish soap, use liquid hand soap. You can wash the pouches in the dishwasher. Slip them over the prongs on the top and bottom racks, then start a cycle. Don't do a drying cycle, however! Allow the pouches to dry overnight. Stand the pouches up on a paper towel, or prop them up on a dish rack. Alternatively, open up a dishwasher, and slide the pouches onto the prongs. The pouches must be completely dry before you sew them. This may take up to 8 hours. Don't use a drying cycle on a dishwasher, as the hot air can damage the pouches. Creating the Panels Overlap 2 pouches along the long, side edges. Take 2 pouches that you want to use for the front of your bag. Turn them so that the front sides are facing up. Place them side-by-side, then overlap the long, side edges. The front is the side with the design and the words “Capri Sun” on it. How much you overlap the side edges by depends on the width of the seam. For most pouches, this will be about ⁄4 inch (0.64 cm). This bag will require some sewing. If you don't know how to sew, you can use duct tape instead. In this case, do not overlap the bags. Place them side-by-side instead. Sew down the seam between the 2 pouches using a zigzag stitch. You can use any color of thread you want for this, but red, blue, or yellow would look the best. Backstitch when you start and finish sewing so that the thread doesn't unravel.A backstitch is simply where you reverse the sewing machine for 2 to 3 stitches. Add more pouches to the sides and top to create a bigger bag. If you don't know how to sew, cut a 5 ⁄2 in (14 cm) strip of duct tape in half lengthwise, then tape the seams on the front and back of the pouch. If you taped the pouches together, fold a strip of duct tape over the bottom edge of the panel. This will cover up the seams and prevent the bag from coming apart. Repeat the process to create a second panel for the back of the bag. Take 2 more pouches and overlap the side edges. Make sure that the front side with the design is facing you, then sew down the seam using a zigzag stitch. If you made the front panel bigger, you will need to make the back panel bigger too so that they both match. If you taped the bags together, remember to fold a strip of duct tape over the bottom edge of the panel as well. Overlap 2 pouches until they are the same width as the front panel. Take 2 pouches and overlap the narrow ends until they are the same width as the front panel. How much you overlap the pouches by depends on the width of your front panel; the narrower the panel is, the more you'll have to overlap them by. This will eventually create the bottom panel of your bag. Make sure that the same side is facing up on both pouches. You should still overlap the pouches, even if you are making a duct taped bag. Sew the seams on the bottom panel with a zigzag stitch. Find the seam on the front of your bottom panel. Sew down the seam using a zigzag stitch, then flip the strip over. Find the seam on the back, then sew it down using a zigzag stitch as well.Remember to backstitch when you start and finish sewing. For a duct taped bag, cut a 3 ⁄4 in (9.5 cm) strip of duct tape in half lengthwise, then place each strip over each seam on the front and back. If you taped the pouches, check the narrow ends of your bottom panel. If you see slits in the pouches, fold a strip of duct tape over them to close them up. Set 2 pouches aside for the side panels. If you are making a taller bag, then you will need to sew extra pouches together first to make taller side panels. You will use these later, once you are ready to assemble the bag.For a duct taped bag, remember to fold strips of duct tape over the bottom edges to hide the slits. Adding the Handles Overlap the ends of 2 pouches by ⁄4 inch (0.64 cm). Take 2 pouches and overlap the narrow top and bottom ends by ⁄4 inch (0.64 cm). Make sure that the front of each pouch is facing up.If you aren't sewing the bag, simply have the narrow edges touching; don’t overlap them. Sew across the overlap with a zigzag stitch. For a stronger handle, flip the bag over, then zigzag stitch across the seam on the back. Remember to backstitch so that your stitching doesn't come undone.For a duct taped bag, cut a 3 ⁄4 in (9.5 cm) strip of duct tape in half, then tape the narrow edges of the pouches together. Do this for the front and the back. Cut the strip down the middle lengthwise. If you need to, fold the strip in half first to find the center, then cut it. This will create 2 identical handles. Fold the strips in half lengthwise, then zigzag stitch the cut edges. Fold the first strip in half lengthwise, then sew along the long, raw edge (not the folded edge) with a zigzag stitch. Repeat this step for the other strip.For a duct taped bag, fold both long edges towards the middle. Cut a strip of duct tape in half lengthwise, then cover the seam with it. Do this for both handles. Sew the strips to the front and back panels with a zigzag stitch. Place the ends of your first strip along the top edge of your front panel. Sew across the bottom and side edges of the strip first, then sew across the strip where it meets the top edge of the bag. Repeat this step with the second strip for the back panel.The ends of the handles should be on the outside (design side) of the panels. If your straw holes are on the top edge of the panels, use those as a placement guide. For a duct taped bag, secure the ends of the strips to the panels with square pieces of duct tape. Assembling the Bag Overlap the front and bottom panels by ⁄4 inch (0.64 cm). Set both panels down with the silver (back) side facing up. Make sure that the bottom edge of the front panel is touching 1 of the long edges on the bottom panel. Slide the panels together so that the 2 edges overlap by about ⁄4 inch (0.64 cm).If you aren't sewing the bag, don't overlap the edges. Instead, place the edges close enough so that they touch. Sew the edges together with a zigzag stitch. Try to sew right down the middle of the seam. Start on 1 side of the bottom panel and finish on the other. Backstitch when you start and finish sewing.For a duct taped bag, cover the seams on the front and back of the bag with a strip of duct tape that's been cut in half lengthwise. Overlap and sew the edges of the back and bottom panels. Place the back panel against the other long edge on the bottom panel. Slide the 2 panels together so that the edges overlap by about ⁄4 inch (0.64 cm), then sew across the seam with a zigzag stitch.Make sure that the silver side of the back panel is facing you and remember to backstitch. If you are taping the bag, skip the overlap and tape the edges together, just like you did for the front panel. Repeat the process with the side panels to form a cross shape. Overlap the narrow bottom edges of the side panels with the narrow side edges of the bottom panel. Sew down both seams with a zigzag stitch. When you are done, you should have a cross shape.Keep the overlap consistent with the front and back panels, about ⁄4 inch (0.64 cm). The silver side of the side panels should be facing up. Be sure to backstitch. For a no-sew bag, skip the overlap. Cut strips of duct tape in half lengthwise, then place them over the seams on the front and back of the bag instead. Bring the edges of the side panel and front panel together. Stand the left side panel and the front panel up so that they are perpendicular to the bottom panel. Bring the adjacent edges together to form a corner, like on a box. You won't be turning this bag inside-out, so make sure that the silver sides are touching. Sew down the edge with a zigzag stitch. Begin sewing at the top edge of the bag, and finish sewing at the bottom edge, where the bottom panel begins. Use a zigzag stitch, and remember to backstitch when you start and finish sewing.For a no-sew bag, fold a strip of duct tape over the seam instead. For a stronger bag, cover the seam on the inside with a strip of duct tape as well. Repeat the procedure for the remaining 3 seams. Bring the right side panel towards the right edge on the front panel. Make sure that the silver sides are touching, then sew the seam with a zigzag stitch. Repeat this step for the remaining edges on the side panels and the back panel.Be sure to backstitch whenever you start and finish sewing a seam. If you are duct taping the bag, continue to fold strips of duct tape over the edges of the panels. Remember to cover the inside seams with more duct tape too.",
    "sentences": [
        " Cleaning and Cutting the Bags Find 10 empty Capri Sun pouches.",
        "The pouches can all be the same flavor, or they can be different flavors.",
        "If you want to make a slightly bigger bag, however, you will need more pouches.If your friends like to drink Capri Sun too, ask them to save their pouches and give them to you once they finish their drink.",
        "You only need the pouches; throw the straws away.",
        "Cut a slit into the bottom of each pouch.",
        "Do not cut the bottom off.",
        "Instead, pull the bottom edges apart to reveal the bottom panel.",
        "Poke a pair of scissors into the bottom panel, then cut a slit into it, from 1 side of the pouch to the other.The slit needs to span the entire width of the bottom panel.",
        "You can use a serrated knife for this step, but be careful!",
        "If you are a child, ask an adult to help you.",
        "Rinse the pouches with soapy water to remove any sticky residue.",
        "Use the slit to fill your first pouch with water.",
        "Add a pump of dish soap, then slosh the water around inside the pouch.",
        "Dump the water out, then fill the pouch with fresh water.",
        "Slosh the water around again, then dump it out.",
        "Do this for all of the pouches.If you don't have dish soap, use liquid hand soap.",
        "You can wash the pouches in the dishwasher.",
        "Slip them over the prongs on the top and bottom racks, then start a cycle.",
        "Don't do a drying cycle, however!",
        "Allow the pouches to dry overnight.",
        "Stand the pouches up on a paper towel, or prop them up on a dish rack.",
        "Alternatively, open up a dishwasher, and slide the pouches onto the prongs.",
        "The pouches must be completely dry before you sew them.",
        "This may take up to 8 hours.",
        "Don't use a drying cycle on a dishwasher, as the hot air can damage the pouches.",
        "Creating the Panels Overlap 2 pouches along the long, side edges.",
        "Take 2 pouches that you want to use for the front of your bag.",
        "Turn them so that the front sides are facing up.",
        "Place them side-by-side, then overlap the long, side edges.",
        "The front is the side with the design and the words “Capri Sun” on it.",
        "How much you overlap the side edges by depends on the width of the seam.",
        "For most pouches, this will be about ⁄4 inch (0.64 cm).",
        "This bag will require some sewing.",
        "If you don't know how to sew, you can use duct tape instead.",
        "In this case, do not overlap the bags.",
        "Place them side-by-side instead.",
        "Sew down the seam between the 2 pouches using a zigzag stitch.",
        "You can use any color of thread you want for this, but red, blue, or yellow would look the best.",
        "Backstitch when you start and finish sewing so that the thread doesn't unravel.A backstitch is simply where you reverse the sewing machine for 2 to 3 stitches.",
        "Add more pouches to the sides and top to create a bigger bag.",
        "If you don't know how to sew, cut a 5 ⁄2 in (14 cm) strip of duct tape in half lengthwise, then tape the seams on the front and back of the pouch.",
        "If you taped the pouches together, fold a strip of duct tape over the bottom edge of the panel.",
        "This will cover up the seams and prevent the bag from coming apart.",
        "Repeat the process to create a second panel for the back of the bag.",
        "Take 2 more pouches and overlap the side edges.",
        "Make sure that the front side with the design is facing you, then sew down the seam using a zigzag stitch.",
        "If you made the front panel bigger, you will need to make the back panel bigger too so that they both match.",
        "If you taped the bags together, remember to fold a strip of duct tape over the bottom edge of the panel as well.",
        "Overlap 2 pouches until they are the same width as the front panel.",
        "Take 2 pouches and overlap the narrow ends until they are the same width as the front panel.",
        "How much you overlap the pouches by depends on the width of your front panel; the narrower the panel is, the more you'll have to overlap them by.",
        "This will eventually create the bottom panel of your bag.",
        "Make sure that the same side is facing up on both pouches.",
        "You should still overlap the pouches, even if you are making a duct taped bag.",
        "Sew the seams on the bottom panel with a zigzag stitch.",
        "Find the seam on the front of your bottom panel.",
        "Sew down the seam using a zigzag stitch, then flip the strip over.",
        "Find the seam on the back, then sew it down using a zigzag stitch as well.Remember to backstitch when you start and finish sewing.",
        "For a duct taped bag, cut a 3 ⁄4 in (9.5 cm) strip of duct tape in half lengthwise, then place each strip over each seam on the front and back.",
        "If you taped the pouches, check the narrow ends of your bottom panel.",
        "If you see slits in the pouches, fold a strip of duct tape over them to close them up.",
        "Set 2 pouches aside for the side panels.",
        "If you are making a taller bag, then you will need to sew extra pouches together first to make taller side panels.",
        "You will use these later, once you are ready to assemble the bag.For a duct taped bag, remember to fold strips of duct tape over the bottom edges to hide the slits.",
        "Adding the Handles Overlap the ends of 2 pouches by ⁄4 inch (0.64 cm).",
        "Take 2 pouches and overlap the narrow top and bottom ends by ⁄4 inch (0.64 cm).",
        "Make sure that the front of each pouch is facing up.If you aren't sewing the bag, simply have the narrow edges touching; don’t overlap them.",
        "Sew across the overlap with a zigzag stitch.",
        "For a stronger handle, flip the bag over, then zigzag stitch across the seam on the back.",
        "Remember to backstitch so that your stitching doesn't come undone.For a duct taped bag, cut a 3 ⁄4 in (9.5 cm) strip of duct tape in half, then tape the narrow edges of the pouches together.",
        "Do this for the front and the back.",
        "Cut the strip down the middle lengthwise.",
        "If you need to, fold the strip in half first to find the center, then cut it.",
        "This will create 2 identical handles.",
        "Fold the strips in half lengthwise, then zigzag stitch the cut edges.",
        "Fold the first strip in half lengthwise, then sew along the long, raw edge (not the folded edge) with a zigzag stitch.",
        "Repeat this step for the other strip.For a duct taped bag, fold both long edges towards the middle.",
        "Cut a strip of duct tape in half lengthwise, then cover the seam with it.",
        "Do this for both handles.",
        "Sew the strips to the front and back panels with a zigzag stitch.",
        "Place the ends of your first strip along the top edge of your front panel.",
        "Sew across the bottom and side edges of the strip first, then sew across the strip where it meets the top edge of the bag.",
        "Repeat this step with the second strip for the back panel.The ends of the handles should be on the outside (design side) of the panels.",
        "If your straw holes are on the top edge of the panels, use those as a placement guide.",
        "For a duct taped bag, secure the ends of the strips to the panels with square pieces of duct tape.",
        "Assembling the Bag Overlap the front and bottom panels by ⁄4 inch (0.64 cm).",
        "Set both panels down with the silver (back) side facing up.",
        "Make sure that the bottom edge of the front panel is touching 1 of the long edges on the bottom panel.",
        "Slide the panels together so that the 2 edges overlap by about ⁄4 inch (0.64 cm).If you aren't sewing the bag, don't overlap the edges.",
        "Instead, place the edges close enough so that they touch.",
        "Sew the edges together with a zigzag stitch.",
        "Try to sew right down the middle of the seam.",
        "Start on 1 side of the bottom panel and finish on the other.",
        "Backstitch when you start and finish sewing.For a duct taped bag, cover the seams on the front and back of the bag with a strip of duct tape that's been cut in half lengthwise.",
        "Overlap and sew the edges of the back and bottom panels.",
        "Place the back panel against the other long edge on the bottom panel.",
        "Slide the 2 panels together so that the edges overlap by about ⁄4 inch (0.64 cm), then sew across the seam with a zigzag stitch.Make sure that the silver side of the back panel is facing you and remember to backstitch.",
        "If you are taping the bag, skip the overlap and tape the edges together, just like you did for the front panel.",
        "Repeat the process with the side panels to form a cross shape.",
        "Overlap the narrow bottom edges of the side panels with the narrow side edges of the bottom panel.",
        "Sew down both seams with a zigzag stitch.",
        "When you are done, you should have a cross shape.Keep the overlap consistent with the front and back panels, about ⁄4 inch (0.64 cm).",
        "The silver side of the side panels should be facing up.",
        "Be sure to backstitch.",
        "For a no-sew bag, skip the overlap.",
        "Cut strips of duct tape in half lengthwise, then place them over the seams on the front and back of the bag instead.",
        "Bring the edges of the side panel and front panel together.",
        "Stand the left side panel and the front panel up so that they are perpendicular to the bottom panel.",
        "Bring the adjacent edges together to form a corner, like on a box.",
        "You won't be turning this bag inside-out, so make sure that the silver sides are touching.",
        "Sew down the edge with a zigzag stitch.",
        "Begin sewing at the top edge of the bag, and finish sewing at the bottom edge, where the bottom panel begins.",
        "Use a zigzag stitch, and remember to backstitch when you start and finish sewing.For a no-sew bag, fold a strip of duct tape over the seam instead.",
        "For a stronger bag, cover the seam on the inside with a strip of duct tape as well.",
        "Repeat the procedure for the remaining 3 seams.",
        "Bring the right side panel towards the right edge on the front panel.",
        "Make sure that the silver sides are touching, then sew the seam with a zigzag stitch.",
        "Repeat this step for the remaining edges on the side panels and the back panel.Be sure to backstitch whenever you start and finish sewing a seam.",
        "If you are duct taping the bag, continue to fold strips of duct tape over the edges of the panels.",
        "Remember to cover the inside seams with more duct tape too."
    ]
}