{
    "title": "How to Make Book Art",
    "url": "https://www.wikihow.com/Make-Book-Art",
    "category_hierarchy": [
        "Arts and Entertainment"
    ],
    "methods": [
        {
            "name": "Stacked Book Sculpture",
            "steps": [
                {
                    "headline": "Separate your books by color.",
                    "description": "Consider removing the dust jacket to see what color the book spine is."
                },
                {
                    "headline": "Pick the predominant color of book spines in your collection.",
                    "description": "Find a room that will be improved by a sculpture in that color. Bright the books into that room."
                },
                {
                    "headline": "Stack the books against the wall, pushing a large flat book against the floor to use as your sculpture base.",
                    "description": "The spines should be horizontal and facing into the room for the biggest color splash."
                },
                {
                    "headline": "Stack the books in decreasing size to make a triangle.",
                    "description": "Stack books of varying sizes for an unsymmetrical sculpture. Stop when you run out of books. Stack them in lighter and lighter variations of the color, to create an ombre look. Place a contrasting book every five books to make a two-toned color scheme."
                },
                {
                    "headline": "Purchase a floating bookshelf from Amazon or Ikea to move your sculpture from the ground or a table to the wall.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Book Painting",
            "steps": [
                {
                    "headline": "Find an old, cloth bound book.",
                    "description": "It should be of short or medium length."
                },
                {
                    "headline": "Flip to the page on which you want to paint.",
                    "description": "You can choose a page that highlights the subject you want to paint on the book. For example, if you paint a butterfly, choose a book that talks about butterflies."
                },
                {
                    "headline": "Glue the remaining pages to each other one by one using a thin, painted layer of craft glue.",
                    "description": "You can also use double-sided tape. You want to glue the book open so that it remains permanently open to the page of your choice. The book will act as your frame when you hang it on the wall. Let the book dry and cure for a couple of days."
                },
                {
                    "headline": "Sketch a design onto the open page of the book with pencil.",
                    "description": ""
                },
                {
                    "headline": "Grab oil paints, charcoal or watercolors.",
                    "description": "Paint the design onto the paper."
                },
                {
                    "headline": "Allow it to dry for a day.",
                    "description": "Consider sealing it with Mod Podge."
                },
                {
                    "headline": "Screw a toothed hanger into either side of the book cover.",
                    "description": "You can also place it inside a plate display hook."
                },
                {
                    "headline": "Hang it on your wall.",
                    "description": "If part of the book wants to come off of the wall, secure it with blue tack. If you have a hard time getting the book to stay open, you can cut pages from the book and frame them after you have painted on them."
                }
            ]
        },
        {
            "name": "Papier-Mache Book Sculpture",
            "steps": [
                {
                    "headline": "Cut out pages from your discarded books.",
                    "description": "Cut them into one to two inch (2.5 to 5 cm) strips."
                },
                {
                    "headline": "Find a knick-knack or shape that you want to cover with text.",
                    "description": "You can find cardboard shapes, boxes and ceramic shapes in thrift stores and craft stores."
                },
                {
                    "headline": "Mix up a batch of papier-mache material.",
                    "description": "Mix together one-half cup (63g) of flour with two cups (473ml) of cold water. Boil two cups (473ml) of water in a saucepan. Add the flour mixture to the saucepan. Bring it to a boil again. Stir in three tbsp. (37g) of sugar. Remove it from the heat and set it aside to cool. Once it is near room-temperature it is ready to use."
                },
                {
                    "headline": "Dip the strips of paper into the papier-mache liquid.",
                    "description": "Make sure the strip is entirely covered with paste."
                },
                {
                    "headline": "Wind the strip onto the ceramic or cardboard shape.",
                    "description": "Smooth it down. Repeat until the entire surface of the sculpture is covered in strips of text."
                },
                {
                    "headline": "Allow it to dry overnight.",
                    "description": "It will harden. Place it out to show off your text sculpture."
                }
            ]
        },
        {
            "name": "Book Folding Sculpture",
            "steps": [
                {
                    "headline": "Pick a very thick, discarded book, such as an old phone book or reference book.",
                    "description": ""
                },
                {
                    "headline": "Choose a word or shape you’d like to fold into the pages of the book.",
                    "description": "Try a single shape for your first folded book sculpture. The shape will appear when you set the book upright with the pages, rather than the spine, showing."
                },
                {
                    "headline": "Print out the shape or word of your choice onto a piece of cardstock.",
                    "description": "Cut the edges out of the paper template."
                },
                {
                    "headline": "Set the template against the front pages of the book.",
                    "description": "You may need to ask someone to hold the book closed. Draw the shape onto the pages with pencil."
                },
                {
                    "headline": "Make a cardstock-folding template for each portion of the pages you need to fold.",
                    "description": "When you set the book on its side to fold individual pages, you should be able to fold around the template."
                },
                {
                    "headline": "Set the book on its side with the front facing up.",
                    "description": "Leave 20 pages on each end unfolded to frame your shape. Use a paperclip to secure them while you fold."
                },
                {
                    "headline": "Set your first template on the top of page 21.",
                    "description": "Fold the individual page back according to your design at the start of your shape. You may need to fold the top and the bottom to create the design."
                },
                {
                    "headline": "Fold the page back over your cardstock template or a ruler edge.",
                    "description": "Use a bone folder to make an even, well-pressed fold."
                },
                {
                    "headline": "Fold several pages the exact same as the first page you folded, and then start to fold according to the pencil lines on the tip of the page to make curves for letters, numbers or shapes.",
                    "description": "Fold a “v” shape into the center of a page to make the center section look open."
                },
                {
                    "headline": "Set the book upright and check the folds frequently to ensure you are following your outline.",
                    "description": ""
                },
                {
                    "headline": "Paint the tips of the folds when you are done to highlight your shape.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Floating/invisible bookshelf",
        "Old, discarded books",
        "Craft glue",
        "Paintbrush",
        "Papier-mâché paste",
        "Scissors",
        "Ceramic/cardboard shape",
        "Bone folder",
        "Ruler",
        "Pencil"
    ],
    "text": " Stacked Book Sculpture Separate your books by color. Consider removing the dust jacket to see what color the book spine is. Pick the predominant color of book spines in your collection. Find a room that will be improved by a sculpture in that color. Bright the books into that room. Stack the books against the wall, pushing a large flat book against the floor to use as your sculpture base. The spines should be horizontal and facing into the room for the biggest color splash. Stack the books in decreasing size to make a triangle. Stack books of varying sizes for an unsymmetrical sculpture. Stop when you run out of books. Stack them in lighter and lighter variations of the color, to create an ombre look. Place a contrasting book every five books to make a two-toned color scheme. Purchase a floating bookshelf from Amazon or Ikea to move your sculpture from the ground or a table to the wall.  Book Painting Find an old, cloth bound book. It should be of short or medium length. Flip to the page on which you want to paint. You can choose a page that highlights the subject you want to paint on the book. For example, if you paint a butterfly, choose a book that talks about butterflies. Glue the remaining pages to each other one by one using a thin, painted layer of craft glue. You can also use double-sided tape. You want to glue the book open so that it remains permanently open to the page of your choice. The book will act as your frame when you hang it on the wall. Let the book dry and cure for a couple of days. Sketch a design onto the open page of the book with pencil.  Grab oil paints, charcoal or watercolors. Paint the design onto the paper. Allow it to dry for a day. Consider sealing it with Mod Podge. Screw a toothed hanger into either side of the book cover. You can also place it inside a plate display hook. Hang it on your wall. If part of the book wants to come off of the wall, secure it with blue tack. If you have a hard time getting the book to stay open, you can cut pages from the book and frame them after you have painted on them. Papier-Mache Book Sculpture Cut out pages from your discarded books. Cut them into one to two inch (2.5 to 5 cm) strips. Find a knick-knack or shape that you want to cover with text. You can find cardboard shapes, boxes and ceramic shapes in thrift stores and craft stores. Mix up a batch of papier-mache material. Mix together one-half cup (63g) of flour with two cups (473ml) of cold water. Boil two cups (473ml) of water in a saucepan. Add the flour mixture to the saucepan. Bring it to a boil again. Stir in three tbsp. (37g) of sugar. Remove it from the heat and set it aside to cool. Once it is near room-temperature it is ready to use. Dip the strips of paper into the papier-mache liquid. Make sure the strip is entirely covered with paste. Wind the strip onto the ceramic or cardboard shape. Smooth it down. Repeat until the entire surface of the sculpture is covered in strips of text. Allow it to dry overnight. It will harden. Place it out to show off your text sculpture. Book Folding Sculpture Pick a very thick, discarded book, such as an old phone book or reference book.  Choose a word or shape you’d like to fold into the pages of the book. Try a single shape for your first folded book sculpture. The shape will appear when you set the book upright with the pages, rather than the spine, showing. Print out the shape or word of your choice onto a piece of cardstock. Cut the edges out of the paper template. Set the template against the front pages of the book. You may need to ask someone to hold the book closed. Draw the shape onto the pages with pencil. Make a cardstock-folding template for each portion of the pages you need to fold. When you set the book on its side to fold individual pages, you should be able to fold around the template. Set the book on its side with the front facing up. Leave 20 pages on each end unfolded to frame your shape. Use a paperclip to secure them while you fold. Set your first template on the top of page 21. Fold the individual page back according to your design at the start of your shape. You may need to fold the top and the bottom to create the design. Fold the page back over your cardstock template or a ruler edge. Use a bone folder to make an even, well-pressed fold. Fold several pages the exact same as the first page you folded, and then start to fold according to the pencil lines on the tip of the page to make curves for letters, numbers or shapes. Fold a “v” shape into the center of a page to make the center section look open. Set the book upright and check the folds frequently to ensure you are following your outline.  Paint the tips of the folds when you are done to highlight your shape. ",
    "sentences": [
        " Stacked Book Sculpture Separate your books by color.",
        "Consider removing the dust jacket to see what color the book spine is.",
        "Pick the predominant color of book spines in your collection.",
        "Find a room that will be improved by a sculpture in that color.",
        "Bright the books into that room.",
        "Stack the books against the wall, pushing a large flat book against the floor to use as your sculpture base.",
        "The spines should be horizontal and facing into the room for the biggest color splash.",
        "Stack the books in decreasing size to make a triangle.",
        "Stack books of varying sizes for an unsymmetrical sculpture.",
        "Stop when you run out of books.",
        "Stack them in lighter and lighter variations of the color, to create an ombre look.",
        "Place a contrasting book every five books to make a two-toned color scheme.",
        "Purchase a floating bookshelf from Amazon or Ikea to move your sculpture from the ground or a table to the wall.",
        "Book Painting Find an old, cloth bound book.",
        "It should be of short or medium length.",
        "Flip to the page on which you want to paint.",
        "You can choose a page that highlights the subject you want to paint on the book.",
        "For example, if you paint a butterfly, choose a book that talks about butterflies.",
        "Glue the remaining pages to each other one by one using a thin, painted layer of craft glue.",
        "You can also use double-sided tape.",
        "You want to glue the book open so that it remains permanently open to the page of your choice.",
        "The book will act as your frame when you hang it on the wall.",
        "Let the book dry and cure for a couple of days.",
        "Sketch a design onto the open page of the book with pencil.",
        "Grab oil paints, charcoal or watercolors.",
        "Paint the design onto the paper.",
        "Allow it to dry for a day.",
        "Consider sealing it with Mod Podge.",
        "Screw a toothed hanger into either side of the book cover.",
        "You can also place it inside a plate display hook.",
        "Hang it on your wall.",
        "If part of the book wants to come off of the wall, secure it with blue tack.",
        "If you have a hard time getting the book to stay open, you can cut pages from the book and frame them after you have painted on them.",
        "Papier-Mache Book Sculpture Cut out pages from your discarded books.",
        "Cut them into one to two inch (2.5 to 5 cm) strips.",
        "Find a knick-knack or shape that you want to cover with text.",
        "You can find cardboard shapes, boxes and ceramic shapes in thrift stores and craft stores.",
        "Mix up a batch of papier-mache material.",
        "Mix together one-half cup (63g) of flour with two cups (473ml) of cold water.",
        "Boil two cups (473ml) of water in a saucepan.",
        "Add the flour mixture to the saucepan.",
        "Bring it to a boil again.",
        "Stir in three tbsp.",
        "(37g) of sugar.",
        "Remove it from the heat and set it aside to cool.",
        "Once it is near room-temperature it is ready to use.",
        "Dip the strips of paper into the papier-mache liquid.",
        "Make sure the strip is entirely covered with paste.",
        "Wind the strip onto the ceramic or cardboard shape.",
        "Smooth it down.",
        "Repeat until the entire surface of the sculpture is covered in strips of text.",
        "Allow it to dry overnight.",
        "It will harden.",
        "Place it out to show off your text sculpture.",
        "Book Folding Sculpture Pick a very thick, discarded book, such as an old phone book or reference book.",
        "Choose a word or shape you’d like to fold into the pages of the book.",
        "Try a single shape for your first folded book sculpture.",
        "The shape will appear when you set the book upright with the pages, rather than the spine, showing.",
        "Print out the shape or word of your choice onto a piece of cardstock.",
        "Cut the edges out of the paper template.",
        "Set the template against the front pages of the book.",
        "You may need to ask someone to hold the book closed.",
        "Draw the shape onto the pages with pencil.",
        "Make a cardstock-folding template for each portion of the pages you need to fold.",
        "When you set the book on its side to fold individual pages, you should be able to fold around the template.",
        "Set the book on its side with the front facing up.",
        "Leave 20 pages on each end unfolded to frame your shape.",
        "Use a paperclip to secure them while you fold.",
        "Set your first template on the top of page 21.",
        "Fold the individual page back according to your design at the start of your shape.",
        "You may need to fold the top and the bottom to create the design.",
        "Fold the page back over your cardstock template or a ruler edge.",
        "Use a bone folder to make an even, well-pressed fold.",
        "Fold several pages the exact same as the first page you folded, and then start to fold according to the pencil lines on the tip of the page to make curves for letters, numbers or shapes.",
        "Fold a “v” shape into the center of a page to make the center section look open.",
        "Set the book upright and check the folds frequently to ensure you are following your outline.",
        "Paint the tips of the folds when you are done to highlight your shape."
    ]
}