{
    "title": "How to Make Crumb Topping",
    "url": "https://www.wikihow.com/Make-Crumb-Topping",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation"
    ],
    "methods": [
        {
            "name": "Savory Bread Crumb Topping",
            "steps": [
                {
                    "headline": "Leave your bread on the counter.",
                    "description": "Stale and slightly hardened bread is ideal for breadcrumbs. Cutting it into smaller pieces and leaving it in an open bowl will help dry it out."
                },
                {
                    "headline": "Add bread pieces to a food processor.",
                    "description": "Pulse the food processor until you have coarse crumbs. Don't pulse too long or you will have powder instead of crumbs."
                },
                {
                    "headline": "Heat the butter or olive oil in a skillet.",
                    "description": ""
                },
                {
                    "headline": "Smash your cloves of garlic.",
                    "description": "Add them to the heated butter or oil. When the butter starts to bubble, turn off the burner. Allow the garlic to sit in the butter for three to five minutes. It will infuse the liquid."
                },
                {
                    "headline": "Remove the crushed garlic cloves with a slotted spoon.",
                    "description": "Sprinkle your breadcrumbs on the butter. Toss them with a wooden spoon. If you want cheesy bread topping, add grated parmesan cheese."
                },
                {
                    "headline": "Stir in chopped parsley and season with sea salt and pepper.",
                    "description": ""
                },
                {
                    "headline": "Spread a layer of breadcrumbs over the top of your dish.",
                    "description": "You can also cook them on a baking sheet for 15 minutes on 350 degrees Fahrenheit (177 Celsius)."
                }
            ]
        },
        {
            "name": "Sweet Crumb Topping",
            "steps": [
                {
                    "headline": "Preheat your oven to 350 degrees Fahrenheit (177 Celsius) if you want to serve the crumb topping right away.",
                    "description": "If not, this topping can be frozen for later use or placed directly on top of a pie and cooked with it."
                },
                {
                    "headline": "Mix flour, light brown sugar, granulated sugar, salt and cinnamon in a bowl.",
                    "description": "Use a whisk to ensure the dry ingredients are well combined."
                },
                {
                    "headline": "Remove one and one-half sticks of unsalted butter from your refrigerator.",
                    "description": "Cut it into small, even squares."
                },
                {
                    "headline": "Add it to your bowl of dry ingredients.",
                    "description": "Combine the butter with the mixture until lumps start to form. Use your hands or a large wooden spoon."
                },
                {
                    "headline": "Spread the topping on a baking sheet.",
                    "description": "Bake for 15 minutes. If you are storing it for later, divide it in half and freeze it in plastic freezer bags."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Food processor",
        "Skillet",
        "Slotted spoon",
        "Wooden spoon",
        "Oven",
        "Whisk",
        "Bowls",
        "Knife"
    ],
    "text": " Savory Bread Crumb Topping Leave your bread on the counter. Stale and slightly hardened bread is ideal for breadcrumbs. Cutting it into smaller pieces and leaving it in an open bowl will help dry it out. Add bread pieces to a food processor. Pulse the food processor until you have coarse crumbs. Don't pulse too long or you will have powder instead of crumbs. Heat the butter or olive oil in a skillet.  Smash your cloves of garlic. Add them to the heated butter or oil. When the butter starts to bubble, turn off the burner. Allow the garlic to sit in the butter for three to five minutes. It will infuse the liquid. Remove the crushed garlic cloves with a slotted spoon. Sprinkle your breadcrumbs on the butter. Toss them with a wooden spoon. If you want cheesy bread topping, add grated parmesan cheese. Stir in chopped parsley and season with sea salt and pepper.  Spread a layer of breadcrumbs over the top of your dish. You can also cook them on a baking sheet for 15 minutes on 350 degrees Fahrenheit (177 Celsius). Sweet Crumb Topping Preheat your oven to 350 degrees Fahrenheit (177 Celsius) if you want to serve the crumb topping right away. If not, this topping can be frozen for later use or placed directly on top of a pie and cooked with it. Mix flour, light brown sugar, granulated sugar, salt and cinnamon in a bowl. Use a whisk to ensure the dry ingredients are well combined. Remove one and one-half sticks of unsalted butter from your refrigerator. Cut it into small, even squares. Add it to your bowl of dry ingredients. Combine the butter with the mixture until lumps start to form. Use your hands or a large wooden spoon. Spread the topping on a baking sheet. Bake for 15 minutes. If you are storing it for later, divide it in half and freeze it in plastic freezer bags. Finished. ",
    "sentences": [
        " Savory Bread Crumb Topping Leave your bread on the counter.",
        "Stale and slightly hardened bread is ideal for breadcrumbs.",
        "Cutting it into smaller pieces and leaving it in an open bowl will help dry it out.",
        "Add bread pieces to a food processor.",
        "Pulse the food processor until you have coarse crumbs.",
        "Don't pulse too long or you will have powder instead of crumbs.",
        "Heat the butter or olive oil in a skillet.",
        "Smash your cloves of garlic.",
        "Add them to the heated butter or oil.",
        "When the butter starts to bubble, turn off the burner.",
        "Allow the garlic to sit in the butter for three to five minutes.",
        "It will infuse the liquid.",
        "Remove the crushed garlic cloves with a slotted spoon.",
        "Sprinkle your breadcrumbs on the butter.",
        "Toss them with a wooden spoon.",
        "If you want cheesy bread topping, add grated parmesan cheese.",
        "Stir in chopped parsley and season with sea salt and pepper.",
        "Spread a layer of breadcrumbs over the top of your dish.",
        "You can also cook them on a baking sheet for 15 minutes on 350 degrees Fahrenheit (177 Celsius).",
        "Sweet Crumb Topping Preheat your oven to 350 degrees Fahrenheit (177 Celsius) if you want to serve the crumb topping right away.",
        "If not, this topping can be frozen for later use or placed directly on top of a pie and cooked with it.",
        "Mix flour, light brown sugar, granulated sugar, salt and cinnamon in a bowl.",
        "Use a whisk to ensure the dry ingredients are well combined.",
        "Remove one and one-half sticks of unsalted butter from your refrigerator.",
        "Cut it into small, even squares.",
        "Add it to your bowl of dry ingredients.",
        "Combine the butter with the mixture until lumps start to form.",
        "Use your hands or a large wooden spoon.",
        "Spread the topping on a baking sheet.",
        "Bake for 15 minutes.",
        "If you are storing it for later, divide it in half and freeze it in plastic freezer bags.",
        "Finished."
    ]
}