{
    "title": "How to Make a Jello Mold",
    "url": "https://www.wikihow.com/Make-a-Jello-Mold",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Alcoholic Drinks",
        "Spirits and Liqueurs",
        "Mixed Drink Shooters and Shots",
        "Jello and Jelly Shots"
    ],
    "parts": [
        {
            "name": "Preparing a Mold",
            "steps": [
                {
                    "headline": "Purchase your mold shape.",
                    "description": "Traditionally, Bundt pans are used to achieve an attractive circular shape. Purchase a non-stick Bundt pan for best results."
                },
                {
                    "headline": "Opt for a silicone Jello mold.",
                    "description": "They are available for purchase on the Internet in holiday shapes, like hearts, Christmas trees and roses."
                },
                {
                    "headline": "Purchase as many boxes of Jello as colors you would like to be layered in your mold.",
                    "description": "You will need about five boxes of Jello to fill a standard Bundt pan. You will need one and one-fourth cups of boiling water and a bowl for each color of gelatin."
                }
            ]
        },
        {
            "name": "Mixing Jello",
            "steps": [
                {
                    "headline": "Boil your water.",
                    "description": "Mix one packet of gelatin with one and one-fourth cup of boiling water. Mix thoroughly with a metal spoon until it has completely dissolved. Note that this is less water than indicated on the packet, which will make a firmer mold."
                },
                {
                    "headline": "Repeat with remaining colors of Jello in separate bowls.",
                    "description": "The number of Jello packets needed will depend greatly on the size of your Bundt pan or mold. Buy extra packets to ensure you have enough."
                },
                {
                    "headline": "Allow your mixtures of Jello to cool to room temperature.",
                    "description": "Clear a space in your refrigerator for the next step."
                },
                {
                    "headline": "Add two tbsp.",
                    "description": "(30ml) of sour cream for each color you want to be opaque. Whisk the sour cream into the gelatin."
                },
                {
                    "headline": "Add a can of crushed pineapple or other canned fruit to the Jello mixture.",
                    "description": "Stir well to mix it uniformly."
                },
                {
                    "headline": "Pour your cooled Jello into the mold if you want it to be a uniform color.",
                    "description": "Place it in the refrigerator overnight before removing."
                }
            ]
        },
        {
            "name": "Layering a Jello Mold",
            "steps": [
                {
                    "headline": "Spray the metal or silicone mold with cooking spray.",
                    "description": ""
                },
                {
                    "headline": "Pour one mixed bowl of gelatin into the bottom of your pan or mold.",
                    "description": "Place it in the refrigerator for at least 20 minutes. Remove it when the top is just starting to set and leaves a tight edge against the side of the pan."
                },
                {
                    "headline": "Spoon the next color onto the top of the last color.",
                    "description": "Try a sour cream layer for a big contrast. Place the gelatin in the refrigerator again for at least 20 minutes to let the second layer set."
                },
                {
                    "headline": "Remove the gelatin mold.",
                    "description": "Spoon in the next layer and refrigerate for at least 20 minutes. Repeat spooning and refrigerating until you have used the last of your Jello mixtures."
                },
                {
                    "headline": "Place it in the refrigerator to set overnight.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Removing a Jello Mold",
            "steps": [
                {
                    "headline": "Wash your hands.",
                    "description": "Dry them."
                },
                {
                    "headline": "Loosen the edges of the Jello against the pan by pressing your finger lightly against the edges.",
                    "description": "If you are using a Bundt pan, also loosen the center circle."
                },
                {
                    "headline": "Find a platter that is flat.",
                    "description": "It should be several inches bigger in all directions than your Bundt pan or silicone mold."
                },
                {
                    "headline": "Fill a large bowl with warm water.",
                    "description": ""
                },
                {
                    "headline": "Immerse the gelatin mold in the bowl of warm water to loosen the edges.",
                    "description": "Be careful not to get water inside the pan."
                },
                {
                    "headline": "Remove it after 15 seconds.",
                    "description": "Dry off the outside of the pan or silicone mold."
                },
                {
                    "headline": "Place the platter face down on the top of the Jello pan or mold.",
                    "description": "Hold the top of the platter and the top of the mold firmly together between your thumbs and fingers."
                },
                {
                    "headline": "Flip the mold so that the platter is face up.",
                    "description": "You should feel the Jello release from the mold. If it doesn’t release from the pan, flip it back over and stick it in the warm water for a few more seconds before trying again."
                },
                {
                    "headline": "Serve the Jello mold by cutting it into slices.",
                    "description": ""
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Bundt pan/Mold",
        "Cooking spray",
        "Kettle/microwave",
        "Spoon",
        "Bowls",
        "Whisk",
        "Warm water",
        "Platter"
    ],
    "text": " Preparing a Mold Purchase your mold shape. Traditionally, Bundt pans are used to achieve an attractive circular shape. Purchase a non-stick Bundt pan for best results. Opt for a silicone Jello mold. They are available for purchase on the Internet in holiday shapes, like hearts, Christmas trees and roses. Purchase as many boxes of Jello as colors you would like to be layered in your mold. You will need about five boxes of Jello to fill a standard Bundt pan. You will need one and one-fourth cups of boiling water and a bowl for each color of gelatin. Mixing Jello Boil your water. Mix one packet of gelatin with one and one-fourth cup of boiling water. Mix thoroughly with a metal spoon until it has completely dissolved. Note that this is less water than indicated on the packet, which will make a firmer mold. Repeat with remaining colors of Jello in separate bowls. The number of Jello packets needed will depend greatly on the size of your Bundt pan or mold. Buy extra packets to ensure you have enough. Allow your mixtures of Jello to cool to room temperature. Clear a space in your refrigerator for the next step. Add two tbsp. (30ml) of sour cream for each color you want to be opaque. Whisk the sour cream into the gelatin. Add a can of crushed pineapple or other canned fruit to the Jello mixture. Stir well to mix it uniformly. Pour your cooled Jello into the mold if you want it to be a uniform color. Place it in the refrigerator overnight before removing. Layering a Jello Mold Spray the metal or silicone mold with cooking spray.  Pour one mixed bowl of gelatin into the bottom of your pan or mold. Place it in the refrigerator for at least 20 minutes. Remove it when the top is just starting to set and leaves a tight edge against the side of the pan. Spoon the next color onto the top of the last color. Try a sour cream layer for a big contrast. Place the gelatin in the refrigerator again for at least 20 minutes to let the second layer set. Remove the gelatin mold. Spoon in the next layer and refrigerate for at least 20 minutes. Repeat spooning and refrigerating until you have used the last of your Jello mixtures. Place it in the refrigerator to set overnight.  Removing a Jello Mold Wash your hands. Dry them. Loosen the edges of the Jello against the pan by pressing your finger lightly against the edges. If you are using a Bundt pan, also loosen the center circle. Find a platter that is flat. It should be several inches bigger in all directions than your Bundt pan or silicone mold. Fill a large bowl with warm water.  Immerse the gelatin mold in the bowl of warm water to loosen the edges. Be careful not to get water inside the pan. Remove it after 15 seconds. Dry off the outside of the pan or silicone mold. Place the platter face down on the top of the Jello pan or mold. Hold the top of the platter and the top of the mold firmly together between your thumbs and fingers. Flip the mold so that the platter is face up. You should feel the Jello release from the mold. If it doesn’t release from the pan, flip it back over and stick it in the warm water for a few more seconds before trying again. Serve the Jello mold by cutting it into slices.  Finished. ",
    "sentences": [
        " Preparing a Mold Purchase your mold shape.",
        "Traditionally, Bundt pans are used to achieve an attractive circular shape.",
        "Purchase a non-stick Bundt pan for best results.",
        "Opt for a silicone Jello mold.",
        "They are available for purchase on the Internet in holiday shapes, like hearts, Christmas trees and roses.",
        "Purchase as many boxes of Jello as colors you would like to be layered in your mold.",
        "You will need about five boxes of Jello to fill a standard Bundt pan.",
        "You will need one and one-fourth cups of boiling water and a bowl for each color of gelatin.",
        "Mixing Jello Boil your water.",
        "Mix one packet of gelatin with one and one-fourth cup of boiling water.",
        "Mix thoroughly with a metal spoon until it has completely dissolved.",
        "Note that this is less water than indicated on the packet, which will make a firmer mold.",
        "Repeat with remaining colors of Jello in separate bowls.",
        "The number of Jello packets needed will depend greatly on the size of your Bundt pan or mold.",
        "Buy extra packets to ensure you have enough.",
        "Allow your mixtures of Jello to cool to room temperature.",
        "Clear a space in your refrigerator for the next step.",
        "Add two tbsp.",
        "(30ml) of sour cream for each color you want to be opaque.",
        "Whisk the sour cream into the gelatin.",
        "Add a can of crushed pineapple or other canned fruit to the Jello mixture.",
        "Stir well to mix it uniformly.",
        "Pour your cooled Jello into the mold if you want it to be a uniform color.",
        "Place it in the refrigerator overnight before removing.",
        "Layering a Jello Mold Spray the metal or silicone mold with cooking spray.",
        "Pour one mixed bowl of gelatin into the bottom of your pan or mold.",
        "Place it in the refrigerator for at least 20 minutes.",
        "Remove it when the top is just starting to set and leaves a tight edge against the side of the pan.",
        "Spoon the next color onto the top of the last color.",
        "Try a sour cream layer for a big contrast.",
        "Place the gelatin in the refrigerator again for at least 20 minutes to let the second layer set.",
        "Remove the gelatin mold.",
        "Spoon in the next layer and refrigerate for at least 20 minutes.",
        "Repeat spooning and refrigerating until you have used the last of your Jello mixtures.",
        "Place it in the refrigerator to set overnight.",
        "Removing a Jello Mold Wash your hands.",
        "Dry them.",
        "Loosen the edges of the Jello against the pan by pressing your finger lightly against the edges.",
        "If you are using a Bundt pan, also loosen the center circle.",
        "Find a platter that is flat.",
        "It should be several inches bigger in all directions than your Bundt pan or silicone mold.",
        "Fill a large bowl with warm water.",
        "Immerse the gelatin mold in the bowl of warm water to loosen the edges.",
        "Be careful not to get water inside the pan.",
        "Remove it after 15 seconds.",
        "Dry off the outside of the pan or silicone mold.",
        "Place the platter face down on the top of the Jello pan or mold.",
        "Hold the top of the platter and the top of the mold firmly together between your thumbs and fingers.",
        "Flip the mold so that the platter is face up.",
        "You should feel the Jello release from the mold.",
        "If it doesn’t release from the pan, flip it back over and stick it in the warm water for a few more seconds before trying again.",
        "Serve the Jello mold by cutting it into slices.",
        "Finished."
    ]
}