{
    "title": "How to Expand Ivory Soap",
    "url": "https://www.wikihow.com/Expand-Ivory-Soap",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science",
        "Science for Kids"
    ],
    "methods": [
        {
            "name": "Expanding the Soap",
            "steps": [
                {
                    "headline": "Gather the necessary materials.",
                    "description": "To perform this experiment, you will need a bar of Ivory brand soap, a bowl, water, a knife, paper towels, a microwave-safe plate, and a microwave. Parental supervision is recommended while performing this experiment. All of these items should be easily accessible at home. The soap can be purchased at any grocery store or big box store. The bar of soap must be Ivory brand for this to work properly."
                },
                {
                    "headline": "Cut the soap into 4 pieces.",
                    "description": "With adult supervision, use the knife to cut the bar of soap into 4 approximately equal pieces. Separating the soap will make it heat faster and expand better in the microwave. Put the soap pieces on a microwave-safe plate."
                },
                {
                    "headline": "Microwave the soap on HIGH for 1 ½ - 2 minutes.",
                    "description": "Place the plate of soap in the microwave and set the time for 2 minutes. Watch the bar of soap as it begins to expand and erupt into beautiful puffy clouds. Make sure an adult is present during this step and stop the microwave once the soap stops expanding. Avoid overcooking the soap as this can cause it to burn. Leave the “soap soufflé” in the microwave for at 1-2 minutes to let it cool."
                },
                {
                    "headline": "Observe and touch the soap.",
                    "description": "Once the soap has fully cooled, handle it and see what it feels like. It may look like a giant marshmallow, but you'll notice that it is still rigid like the original bar of soap. You can still use it like soap as well; just break off pieces. The soap expands because there are water molecules in the tiny pockets of air. When the soap is heated, the water vaporizes and the trapped air expands. The heat also makes the soap softer, allowing these expanding air pockets to cause the whole bar to blow up like a cloud. Try the same experiment with a different brand of soap. You'll notice that the soap doesn't expand like the Ivory soap does because it doesn't have air pockets."
                },
                {
                    "headline": "Place the bar of soap in a bowl of water.",
                    "description": "Before (or after) you perform the experiment, you can do a small test to see if the soap floats. Fill your bowl with water until it is about two-thirds full. Drop the bar into the water and observe what happens. You will notice that the soap floats. If you have other bars of soap that aren't Ivory brand, drop them in the water and see what happens. They will sink to the bottom of the container. The Ivory brand soap floats because it has lots of tiny air pockets inside it. These tiny air pockets are what allows the soap to expand the way it does when it is heated. Remove the soap from the water and let it dry before microwaving it."
                }
            ]
        },
        {
            "name": "Making a Learning Experience",
            "steps": [
                {
                    "headline": "Talk about a hypothesis.",
                    "description": "A hypothesis is an educated guess about the outcome of an experiment. Discuss the air pockets in the soap and ask your child what they think will happen to the soap when it gets heated. Write down the hypothesis before you begin. Can they think of anything else that expands when heated? For instance, both marshmallows and popcorn expand when you heat them up."
                },
                {
                    "headline": "Experiment with different types of soap.",
                    "description": "Ivory soap is special because it has air whipped into it, but other soaps do not. Perform this same experiment with different types of soap and observe the various results with each brand. Avoid heating the soap for longer than 1 minute, as it could burn. Record your results and observations underneath your written hypothesis."
                },
                {
                    "headline": "Discuss the results.",
                    "description": "Talk about what happened with the soap. Ask your child why the soap expanded and why the air pockets are important. Explain to them that there is water trapped in the air pockets and that gas expands when it is heated. Gases expand because the molecules begin to move quickly when they are heated. This causes them to bounce off of each other and hit the pockets of soap with such force that they expand out. Discuss the differences between the various brands of soap and the reason you see differences in the results."
                }
            ]
        }
    ],
    "tyn": [
        "Bar of Ivory soap",
        "Bowl of water (or a plastic tub)",
        "Paper towel",
        "Microwave-safe plate",
        "Microwave oven",
        "Knife"
    ],
    "text": " Expanding the Soap Gather the necessary materials. To perform this experiment, you will need a bar of Ivory brand soap, a bowl, water, a knife, paper towels, a microwave-safe plate, and a microwave. Parental supervision is recommended while performing this experiment. All of these items should be easily accessible at home. The soap can be purchased at any grocery store or big box store. The bar of soap must be Ivory brand for this to work properly. Cut the soap into 4 pieces. With adult supervision, use the knife to cut the bar of soap into 4 approximately equal pieces. Separating the soap will make it heat faster and expand better in the microwave. Put the soap pieces on a microwave-safe plate. Microwave the soap on HIGH for 1 ½ - 2 minutes. Place the plate of soap in the microwave and set the time for 2 minutes. Watch the bar of soap as it begins to expand and erupt into beautiful puffy clouds. Make sure an adult is present during this step and stop the microwave once the soap stops expanding. Avoid overcooking the soap as this can cause it to burn. Leave the “soap soufflé” in the microwave for at 1-2 minutes to let it cool. Observe and touch the soap. Once the soap has fully cooled, handle it and see what it feels like. It may look like a giant marshmallow, but you'll notice that it is still rigid like the original bar of soap. You can still use it like soap as well; just break off pieces. The soap expands because there are water molecules in the tiny pockets of air. When the soap is heated, the water vaporizes and the trapped air expands. The heat also makes the soap softer, allowing these expanding air pockets to cause the whole bar to blow up like a cloud. Try the same experiment with a different brand of soap. You'll notice that the soap doesn't expand like the Ivory soap does because it doesn't have air pockets. Place the bar of soap in a bowl of water. Before (or after) you perform the experiment, you can do a small test to see if the soap floats. Fill your bowl with water until it is about two-thirds full. Drop the bar into the water and observe what happens. You will notice that the soap floats. If you have other bars of soap that aren't Ivory brand, drop them in the water and see what happens. They will sink to the bottom of the container. The Ivory brand soap floats because it has lots of tiny air pockets inside it. These tiny air pockets are what allows the soap to expand the way it does when it is heated. Remove the soap from the water and let it dry before microwaving it. Making a Learning Experience Talk about a hypothesis. A hypothesis is an educated guess about the outcome of an experiment. Discuss the air pockets in the soap and ask your child what they think will happen to the soap when it gets heated. Write down the hypothesis before you begin. Can they think of anything else that expands when heated? For instance, both marshmallows and popcorn expand when you heat them up. Experiment with different types of soap. Ivory soap is special because it has air whipped into it, but other soaps do not. Perform this same experiment with different types of soap and observe the various results with each brand. Avoid heating the soap for longer than 1 minute, as it could burn. Record your results and observations underneath your written hypothesis. Discuss the results. Talk about what happened with the soap. Ask your child why the soap expanded and why the air pockets are important. Explain to them that there is water trapped in the air pockets and that gas expands when it is heated. Gases expand because the molecules begin to move quickly when they are heated. This causes them to bounce off of each other and hit the pockets of soap with such force that they expand out. Discuss the differences between the various brands of soap and the reason you see differences in the results.",
    "sentences": [
        " Expanding the Soap Gather the necessary materials.",
        "To perform this experiment, you will need a bar of Ivory brand soap, a bowl, water, a knife, paper towels, a microwave-safe plate, and a microwave.",
        "Parental supervision is recommended while performing this experiment.",
        "All of these items should be easily accessible at home.",
        "The soap can be purchased at any grocery store or big box store.",
        "The bar of soap must be Ivory brand for this to work properly.",
        "Cut the soap into 4 pieces.",
        "With adult supervision, use the knife to cut the bar of soap into 4 approximately equal pieces.",
        "Separating the soap will make it heat faster and expand better in the microwave.",
        "Put the soap pieces on a microwave-safe plate.",
        "Microwave the soap on HIGH for 1 ½ - 2 minutes.",
        "Place the plate of soap in the microwave and set the time for 2 minutes.",
        "Watch the bar of soap as it begins to expand and erupt into beautiful puffy clouds.",
        "Make sure an adult is present during this step and stop the microwave once the soap stops expanding.",
        "Avoid overcooking the soap as this can cause it to burn.",
        "Leave the “soap soufflé” in the microwave for at 1-2 minutes to let it cool.",
        "Observe and touch the soap.",
        "Once the soap has fully cooled, handle it and see what it feels like.",
        "It may look like a giant marshmallow, but you'll notice that it is still rigid like the original bar of soap.",
        "You can still use it like soap as well; just break off pieces.",
        "The soap expands because there are water molecules in the tiny pockets of air.",
        "When the soap is heated, the water vaporizes and the trapped air expands.",
        "The heat also makes the soap softer, allowing these expanding air pockets to cause the whole bar to blow up like a cloud.",
        "Try the same experiment with a different brand of soap.",
        "You'll notice that the soap doesn't expand like the Ivory soap does because it doesn't have air pockets.",
        "Place the bar of soap in a bowl of water.",
        "Before (or after) you perform the experiment, you can do a small test to see if the soap floats.",
        "Fill your bowl with water until it is about two-thirds full.",
        "Drop the bar into the water and observe what happens.",
        "You will notice that the soap floats.",
        "If you have other bars of soap that aren't Ivory brand, drop them in the water and see what happens.",
        "They will sink to the bottom of the container.",
        "The Ivory brand soap floats because it has lots of tiny air pockets inside it.",
        "These tiny air pockets are what allows the soap to expand the way it does when it is heated.",
        "Remove the soap from the water and let it dry before microwaving it.",
        "Making a Learning Experience Talk about a hypothesis.",
        "A hypothesis is an educated guess about the outcome of an experiment.",
        "Discuss the air pockets in the soap and ask your child what they think will happen to the soap when it gets heated.",
        "Write down the hypothesis before you begin.",
        "Can they think of anything else that expands when heated?",
        "For instance, both marshmallows and popcorn expand when you heat them up.",
        "Experiment with different types of soap.",
        "Ivory soap is special because it has air whipped into it, but other soaps do not.",
        "Perform this same experiment with different types of soap and observe the various results with each brand.",
        "Avoid heating the soap for longer than 1 minute, as it could burn.",
        "Record your results and observations underneath your written hypothesis.",
        "Discuss the results.",
        "Talk about what happened with the soap.",
        "Ask your child why the soap expanded and why the air pockets are important.",
        "Explain to them that there is water trapped in the air pockets and that gas expands when it is heated.",
        "Gases expand because the molecules begin to move quickly when they are heated.",
        "This causes them to bounce off of each other and hit the pockets of soap with such force that they expand out.",
        "Discuss the differences between the various brands of soap and the reason you see differences in the results."
    ]
}