{
    "title": "How to Ride a Two Wheeled Scooter",
    "url": "https://www.wikihow.com/Ride-a-Two-Wheeled-Scooter",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Scooters"
    ],
    "steps": [
        {
            "headline": "Learn how to balance yourself.",
            "description": "Since the wheels on a two wheeled scooter are in front of each other, it doesn't balance correctly. Once you get the hang of balancing, you will be ready to ride the scooter."
        },
        {
            "headline": "Practise on an easier scooter.",
            "description": "This can improve your balance for when you ride a two wheeled scooter. Use scooters such as ones with three wheels. If you know how to ride a bike with two wheels, you may be able to practice on that."
        },
        {
            "headline": "Unfold your scooter.",
            "description": "Some two wheeled scooters are folded when you take them out of the box. Unlock any lock that is in the scooter."
        },
        {
            "headline": "Wear protective gear, such as a helmet, pads, etc.",
            "description": ""
        },
        {
            "headline": "Make sure everything is working right on your scooter.",
            "description": ""
        },
        {
            "headline": "Place your hands on the handles of the two wheeled scooter.",
            "description": "At the same time, place one of your legs on the bottom of the scooter. Keep your other leg down, and ready to push."
        },
        {
            "headline": "Slowly push yourself with your leg that's on the ground.",
            "description": "Start off slow and later, go a little bit faster. This will prevent yourself from falling off the two wheeled scooter."
        },
        {
            "headline": "Keep your balance.",
            "description": "Make sure you don't go too fast, or you may fall. Even though you have your gear on, you may still get hurt. Try forcing yourself not to fall, or when you are about to fall, change to a normal position for riding a two wheeled scooter and go slow. Use this method if possible. If the scooter is tilting to the left, tilt yourself to the right. If the scooter is tilting to the right, tilt yourself to the left. Make sure you don't tilt yourself too hard, as this may result in you falling."
        }
    ],
    "tyn": [
        "Two wheeled scooter",
        "Protective gear for riding a scooter"
    ],
    "text": " Learn how to balance yourself. Since the wheels on a two wheeled scooter are in front of each other, it doesn't balance correctly. Once you get the hang of balancing, you will be ready to ride the scooter. Practise on an easier scooter. This can improve your balance for when you ride a two wheeled scooter. Use scooters such as ones with three wheels. If you know how to ride a bike with two wheels, you may be able to practice on that. Unfold your scooter. Some two wheeled scooters are folded when you take them out of the box. Unlock any lock that is in the scooter. Wear protective gear, such as a helmet, pads, etc.  Make sure everything is working right on your scooter.  Place your hands on the handles of the two wheeled scooter. At the same time, place one of your legs on the bottom of the scooter. Keep your other leg down, and ready to push. Slowly push yourself with your leg that's on the ground. Start off slow and later, go a little bit faster. This will prevent yourself from falling off the two wheeled scooter. Keep your balance. Make sure you don't go too fast, or you may fall. Even though you have your gear on, you may still get hurt. Try forcing yourself not to fall, or when you are about to fall, change to a normal position for riding a two wheeled scooter and go slow. Use this method if possible. If the scooter is tilting to the left, tilt yourself to the right. If the scooter is tilting to the right, tilt yourself to the left. Make sure you don't tilt yourself too hard, as this may result in you falling.",
    "sentences": [
        " Learn how to balance yourself.",
        "Since the wheels on a two wheeled scooter are in front of each other, it doesn't balance correctly.",
        "Once you get the hang of balancing, you will be ready to ride the scooter.",
        "Practise on an easier scooter.",
        "This can improve your balance for when you ride a two wheeled scooter.",
        "Use scooters such as ones with three wheels.",
        "If you know how to ride a bike with two wheels, you may be able to practice on that.",
        "Unfold your scooter.",
        "Some two wheeled scooters are folded when you take them out of the box.",
        "Unlock any lock that is in the scooter.",
        "Wear protective gear, such as a helmet, pads, etc.",
        "Make sure everything is working right on your scooter.",
        "Place your hands on the handles of the two wheeled scooter.",
        "At the same time, place one of your legs on the bottom of the scooter.",
        "Keep your other leg down, and ready to push.",
        "Slowly push yourself with your leg that's on the ground.",
        "Start off slow and later, go a little bit faster.",
        "This will prevent yourself from falling off the two wheeled scooter.",
        "Keep your balance.",
        "Make sure you don't go too fast, or you may fall.",
        "Even though you have your gear on, you may still get hurt.",
        "Try forcing yourself not to fall, or when you are about to fall, change to a normal position for riding a two wheeled scooter and go slow.",
        "Use this method if possible.",
        "If the scooter is tilting to the left, tilt yourself to the right.",
        "If the scooter is tilting to the right, tilt yourself to the left.",
        "Make sure you don't tilt yourself too hard, as this may result in you falling."
    ]
}