{
    "title": "How to Make 2D Eevee Evolutions on Paper",
    "url": "https://www.wikihow.com/Make-2D-Eevee-Evolutions-on-Paper",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Movies",
        "Filmmaking",
        "Animation"
    ],
    "parts": [
        {
            "name": "Eevee the Evolution Pokémon",
            "steps": [
                {
                    "headline": "Start off with is Eevee the Evolution Pokémon.",
                    "description": "It should be easy, although designing skills are required."
                },
                {
                    "headline": "Gather the materials listed in the \"Things You'll Need\" section.",
                    "description": ""
                },
                {
                    "headline": "Cut the tissue carefully into a wide rectangle, but not too wide.",
                    "description": "Keep it aside for now."
                },
                {
                    "headline": "Fold a piece of light to medium brown paper in half vertically, although it does not need to be perfect.",
                    "description": "Fold it again the same way. This does not need to be perfect, either, but is better perfect."
                },
                {
                    "headline": "Fold it down the middle so it looks like a square .",
                    "description": "Keep doing that until it reaches the size of about one inch. You might want something to hold it down, because it may unfold."
                },
                {
                    "headline": "Fold the rest of it into a rectangle.",
                    "description": "Fold the two sides of it into triangles and fold them to the back of the head. You should tape the triangles to the back so they stay."
                },
                {
                    "headline": "Add the facial features.",
                    "description": "Make two eyes shaped like zeros. Then, add a tiny nose in the middle bottom of the eyes. If you want, you can do a mouth."
                },
                {
                    "headline": "Tape the middle of the face all the way to the end without folding it.",
                    "description": ""
                },
                {
                    "headline": "Crumble the back of the square body and tape it about four times so it stays.",
                    "description": "Take a strip of your cut tissue off and tape it around the tip of the part you crumbled, which is the tail. Tape the rest of the tissue around Eevee's neck."
                },
                {
                    "headline": "Finally, get him some small cut-out bunny ears and you're done!",
                    "description": "If you want, you can add paper legs."
                }
            ]
        },
        {
            "name": "Flareon the Flame Pokémon",
            "steps": [
                {
                    "headline": "Using red construction paper, fold it as you would for Eevee, except stop at the second square.",
                    "description": "Then, do Eevee's head and stop there. Save the yellow paper for later."
                },
                {
                    "headline": "Tape some crumbled orange or yellow paper (orange to substitute for yellow) to the back of Flareon.",
                    "description": ""
                },
                {
                    "headline": "Cut in the middle of the yellow paper and tape it around the neck just like you did with Eevee.",
                    "description": "# Cut a very small triangle shape from the yellow paper and tape it in the middle of Flareon's head, but on the top. Do the other things you did with Eevee (ears, facial features, legs,tail), and Flareon is done!"
                }
            ]
        },
        {
            "name": "Jolteon the Lightning Pokémon",
            "steps": [
                {
                    "headline": "Fold the yellow paper in half vertically.",
                    "description": "It can be slightly not perfect, but otherwise it must be perfectly folded. You can use a metal folding tool, such as the edge of a metal ruler, to help with creasing."
                },
                {
                    "headline": "Make sort of triangle shapes with the paper all over it.",
                    "description": "It is optional to do them only on the back."
                },
                {
                    "headline": "Crumble an open spot up like a head in a circle.",
                    "description": "Do the eyes and nose on it. Tape all over the head until it is a perfect circle. Add bunny ears to it, but make them big."
                },
                {
                    "headline": "Add the tail by sticking the back up a little.",
                    "description": ""
                },
                {
                    "headline": "Cut triangles from the white paper and tape them around the neck of Jolteon.",
                    "description": "Add legs if desired, and done!"
                }
            ]
        },
        {
            "name": "Vaporeon the Bubblejet Pokémon",
            "steps": [
                {
                    "headline": "Fold any color of blue paper vertically in half.",
                    "description": "Do the Eevee steps up to the tail."
                },
                {
                    "headline": "Add a slit in between the tip of Vaporeon's tail.",
                    "description": "Shape either side to resemble a dolphin-like tail."
                },
                {
                    "headline": "Add some bold tiny square like shapes from his back to his tail.",
                    "description": ""
                },
                {
                    "headline": "Add additional desired features.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Scissors",
        "Tissues",
        "Light to medium brown paper",
        "Red and yellow paper",
        "Yellow and white paper",
        "Any color of blue paper"
    ],
    "text": " Eevee the Evolution Pokémon Start off with is Eevee the Evolution Pokémon. It should be easy, although designing skills are required. Gather the materials listed in the \"Things You'll Need\" section.  Cut the tissue carefully into a wide rectangle, but not too wide. Keep it aside for now. Fold a piece of light to medium brown paper in half vertically, although it does not need to be perfect. Fold it again the same way. This does not need to be perfect, either, but is better perfect. Fold it down the middle so it looks like a square . Keep doing that until it reaches the size of about one inch. You might want something to hold it down, because it may unfold. Fold the rest of it into a rectangle. Fold the two sides of it into triangles and fold them to the back of the head. You should tape the triangles to the back so they stay. Add the facial features. Make two eyes shaped like zeros. Then, add a tiny nose in the middle bottom of the eyes. If you want, you can do a mouth. Tape the middle of the face all the way to the end without folding it.  Crumble the back of the square body and tape it about four times so it stays. Take a strip of your cut tissue off and tape it around the tip of the part you crumbled, which is the tail. Tape the rest of the tissue around Eevee's neck. Finally, get him some small cut-out bunny ears and you're done! If you want, you can add paper legs. Flareon the Flame Pokémon Using red construction paper, fold it as you would for Eevee, except stop at the second square. Then, do Eevee's head and stop there. Save the yellow paper for later. Tape some crumbled orange or yellow paper (orange to substitute for yellow) to the back of Flareon.  Cut in the middle of the yellow paper and tape it around the neck just like you did with Eevee. # Cut a very small triangle shape from the yellow paper and tape it in the middle of Flareon's head, but on the top. Do the other things you did with Eevee (ears, facial features, legs,tail), and Flareon is done! Jolteon the Lightning Pokémon Fold the yellow paper in half vertically. It can be slightly not perfect, but otherwise it must be perfectly folded. You can use a metal folding tool, such as the edge of a metal ruler, to help with creasing. Make sort of triangle shapes with the paper all over it. It is optional to do them only on the back. Crumble an open spot up like a head in a circle. Do the eyes and nose on it. Tape all over the head until it is a perfect circle. Add bunny ears to it, but make them big. Add the tail by sticking the back up a little.  Cut triangles from the white paper and tape them around the neck of Jolteon. Add legs if desired, and done! Vaporeon the Bubblejet Pokémon Fold any color of blue paper vertically in half. Do the Eevee steps up to the tail. Add a slit in between the tip of Vaporeon's tail. Shape either side to resemble a dolphin-like tail. Add some bold tiny square like shapes from his back to his tail.  Add additional desired features. ",
    "sentences": [
        " Eevee the Evolution Pokémon Start off with is Eevee the Evolution Pokémon.",
        "It should be easy, although designing skills are required.",
        "Gather the materials listed in the \"Things You'll Need\" section.",
        "Cut the tissue carefully into a wide rectangle, but not too wide.",
        "Keep it aside for now.",
        "Fold a piece of light to medium brown paper in half vertically, although it does not need to be perfect.",
        "Fold it again the same way.",
        "This does not need to be perfect, either, but is better perfect.",
        "Fold it down the middle so it looks like a square .",
        "Keep doing that until it reaches the size of about one inch.",
        "You might want something to hold it down, because it may unfold.",
        "Fold the rest of it into a rectangle.",
        "Fold the two sides of it into triangles and fold them to the back of the head.",
        "You should tape the triangles to the back so they stay.",
        "Add the facial features.",
        "Make two eyes shaped like zeros.",
        "Then, add a tiny nose in the middle bottom of the eyes.",
        "If you want, you can do a mouth.",
        "Tape the middle of the face all the way to the end without folding it.",
        "Crumble the back of the square body and tape it about four times so it stays.",
        "Take a strip of your cut tissue off and tape it around the tip of the part you crumbled, which is the tail.",
        "Tape the rest of the tissue around Eevee's neck.",
        "Finally, get him some small cut-out bunny ears and you're done!",
        "If you want, you can add paper legs.",
        "Flareon the Flame Pokémon Using red construction paper, fold it as you would for Eevee, except stop at the second square.",
        "Then, do Eevee's head and stop there.",
        "Save the yellow paper for later.",
        "Tape some crumbled orange or yellow paper (orange to substitute for yellow) to the back of Flareon.",
        "Cut in the middle of the yellow paper and tape it around the neck just like you did with Eevee.",
        "# Cut a very small triangle shape from the yellow paper and tape it in the middle of Flareon's head, but on the top.",
        "Do the other things you did with Eevee (ears, facial features, legs,tail), and Flareon is done!",
        "Jolteon the Lightning Pokémon Fold the yellow paper in half vertically.",
        "It can be slightly not perfect, but otherwise it must be perfectly folded.",
        "You can use a metal folding tool, such as the edge of a metal ruler, to help with creasing.",
        "Make sort of triangle shapes with the paper all over it.",
        "It is optional to do them only on the back.",
        "Crumble an open spot up like a head in a circle.",
        "Do the eyes and nose on it.",
        "Tape all over the head until it is a perfect circle.",
        "Add bunny ears to it, but make them big.",
        "Add the tail by sticking the back up a little.",
        "Cut triangles from the white paper and tape them around the neck of Jolteon.",
        "Add legs if desired, and done!",
        "Vaporeon the Bubblejet Pokémon Fold any color of blue paper vertically in half.",
        "Do the Eevee steps up to the tail.",
        "Add a slit in between the tip of Vaporeon's tail.",
        "Shape either side to resemble a dolphin-like tail.",
        "Add some bold tiny square like shapes from his back to his tail.",
        "Add additional desired features."
    ]
}