{
    "title": "How to Make a Layer Cake",
    "url": "https://www.wikihow.com/Make-a-Layer-Cake",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking",
        "Cakes",
        "Cake Making Tips"
    ],
    "parts": [
        {
            "name": "Baking the Cakes",
            "steps": [
                {
                    "headline": "Line or grease your cake pans.",
                    "description": "Decide what size cake you'd like to make and get out the number of pans you'll need. You'll typically need 2 or 3 pans. Then cut parchment paper to fit the inside of the pans or spray the inside of each pan with baking spray. Greasing or lining the pan will ensure that the cakes don't crumble or tear when you remove them. For example, you could use 8 or 9 inch (20.3 or 22.9 cm) round cake pans. Since you bake several cakes you can either stack them and frost them to make thick layers, or slice each cake in half horizontally to make even more thin layers."
                },
                {
                    "headline": "Make the cake batter.",
                    "description": "For a homemade cake, choose your favorite recipe and mix the cake batter. Ensure that the cake will make as many layers as you need or plan on doubling the recipe. To save time, combine 2 purchased cake mixes according to the packaged instructions. You can make a layer cake that has the same flavor of cake layers or use a different flavor for each layer."
                },
                {
                    "headline": "Use a digital scale to divide the batter evenly among the pans.",
                    "description": "Once you've mixed your cake batter, set a prepared cake pan on a digital scale. Spoon some of the batter in and then set another pan on the scale. Keep filling each of your cake pans while you weigh them so the batter is divided evenly. Dividing the batter evenly will ensure that all of your cake layers are the same thickness."
                },
                {
                    "headline": "Wrap cake strips or towels around the outsides of the cake pans.",
                    "description": "Secure cake strips to the outside of each filled cake pan. If you don't have cake strips, tear an old kitchen towel into long strips and wet them. Wrap the damp strips around the outside of each filled cake pan. The cake strips or towel will help the cake bake slowly from the edges towards the center. This will prevent the cakes from forming domes in the center."
                },
                {
                    "headline": "Reduce the temperature to 325 °F (163 °C) and increase the baking time.",
                    "description": "To bake flat cakes that are easily to layer and frost, turn the oven temperature down and bake the cakes for a little longer. Doing these things will prevent the cakes from cooking quickly in the center and puffing up. For example, if your recipe calls for baking the cakes for 30 minutes at 350 °F (177 °C), turn the oven down to 325 °F (163 °C) and bake them for 45 minutes. Plan on increasing the baking time by one half when you reduce the oven temperature by 25 degrees."
                },
                {
                    "headline": "Test the cakes and cool them completely.",
                    "description": "If you think the cakes have finished baking, insert a cake tester or toothpick into the center and pull it out. If it comes out clean and dry, the cakes are done. Then you can remove the cakes to cool completely. If the cake tester comes out with batter on it, return the cakes to the oven for a few minutes and check them again."
                },
                {
                    "headline": "Chill the layers for up to 5 days.",
                    "description": "Once the cakes are completely cooked, remove them from the oven and turn them out onto a wire rack to cool. When the cakes are at room temperature, cover them with plastic wrap and put them in the refrigerator for at least 1 hour or up to 5 days. Chilling the cakes will make them easier to slice and frost. Never try cutting or trimming warm cakes because they'll tear more."
                }
            ]
        },
        {
            "name": "Cutting the Layers and Making the Frosting",
            "steps": [
                {
                    "headline": "Trim away the excess dome from each cake.",
                    "description": "If your cakes baked faster in the center and domed up, you'll need to slice off the excess tops so each layer is even. Hold a serrated knife so the blade is horizontal and gently saw across the top of the cake so it's completely flat. Do this for each cake. Discard or snack on the cake dome once you've trimmed it away."
                },
                {
                    "headline": "Cut the cakes into layers.",
                    "description": "If you'd like thin layers, use a serrated knife or cake leveler to cut each cake in half horizontally. This will also double the number of layers your cake will be. For example, if you baked 2 round cakes, instead of having 2 thick layers, slice them in half to make 4 thin layers of cake. For thicker layers, skip cutting the cakes in half and just plan on stacking them."
                },
                {
                    "headline": "Mix your choice of filling and frosting.",
                    "description": "Decide what flavor and type of frosting you'd like to use in between the cake layers and on top of the cake. For a variety of flavors, use one flavor for the filling and a different flavor for the top and sides. If you're short on time, purchase a few containers of ready-made frosting. For example, fill the cake with a raspberry filling, but frost it with a chocolate ganache. You could even fill the cake with custard or cream cheese filling before frosting it with a lemon or strawberry frosting."
                }
            ]
        },
        {
            "name": "Assembling the Layer Cake",
            "steps": [
                {
                    "headline": "Place the first cake layer on a cardboard cake round or turntable.",
                    "description": "Cut a piece of cardboard to the same size as your cake pan and set it on a turntable. Spoon a dab of frosting on the center of the cardboard then set the bottom layer of chilled cake directly onto it. Put the cake top or cut-side down. The frosting will anchor the cake layer in place. If you don't have a turntable, set the cardboard on your work surface or a cake plate."
                },
                {
                    "headline": "Spread frosting or filling over the bottom layer.",
                    "description": "Spoon 1/2 cup to 1 cup (125 to 250 g) of frosting onto the cake layer. Use an offset spatula to spread the frosting evenly across the top of the layer, but don't try to frost the sides. If you prefer, you can use a piping bag to pipe the frosting onto the cake layer. If you're using a soft filling like a fruit curd or jam, pipe frosting around the edge of the cake layer. Then spread the filling. The frosting will prevent the soft filling from spilling out."
                },
                {
                    "headline": "Stack another layer of cake on top.",
                    "description": "If you're using a cake layer that you cut, lay it so the cut-side is facing down. It's fine if some of the frosting below the cake layer spills out over the sides."
                },
                {
                    "headline": "Spread frosting or filling over the layer.",
                    "description": "Add another 1/2 cup to 1 cup (125 to 250 g) of frosting or filling to the newest cake layer and spread it so it's evenly covered. Continue to stack the cake layers and spread filling in between them until you've added all of your cake layers. Leave the top layer of cake unfrosted for now since you'll be covering the cake with a crumb coat."
                }
            ]
        },
        {
            "name": "Frosting the Top and Sides",
            "steps": [
                {
                    "headline": "Spread a thin crumb coat over the top and sides of the cake.",
                    "description": "Put a large dollop of frosting onto the top of the assembled layer cake. Use an offset spatula to spread the frosting across the top and sides of the cake. The crumb coat should be so thin that you can see through to the cake. The crumb coat will trap the crumbs in the thin layer of frosting. This way, you can easily add frosting without getting crumbs in it."
                },
                {
                    "headline": "Chill the cake for 30 minutes and frost the top and sides.",
                    "description": "Put the cake in the fridge to chill until the crumb coat firms up. Then remove it and spread the remaining frosting over the top and sides of the cake. This layer of frosting should be much thicker than the crumb coat. Spin the cake turntable slowly as you work. This will make it easier to frost the sides of the cake. For very smooth sides, run a bench scraper against them so the frosting level is even."
                },
                {
                    "headline": "Chill the cake for at least 30 minutes.",
                    "description": "Place the frosted layer cake in the refrigerator and let it chill until the frosting sets. This will make it easier to pipe frosting or add other decorations without the frosting sliding or melting. You don't need to cover the cake as it chills. The frosting will prevent the cake from drying out."
                },
                {
                    "headline": "Decorate the cake.",
                    "description": "Once your cake has been completely frosted, pipe frosting embellishments on the top and sides. If you like, sprinkle cocoa or candy sprinkles over the top. Consider garnishing the cake with flaked coconut, mini-chocolate chips, or chopped nuts. For a botanical look, place fresh flowers on the cake. Remove the flowers just before slicing and serving the cake."
                },
                {
                    "headline": "Transfer the cake from the turntable to a cake stand.",
                    "description": "Slide a cake lifter or large spatula under the cardboard base for your layer cake. Carefully lift it up in order to move the whole cake from the turntable. Set it down on your cake stand. Then slice and enjoy the layer cake. Use a chef's knife to slice the cake into pieces."
                },
                {
                    "headline": "Store the layer cake at room temperature for up to 3 or 4 days.",
                    "description": "For the best texture, cover the layer cake with an overturned bowl or plastic wrap and keep it at room temperature. If you'd rather refrigerate it, store it in an airtight container for up to 1 week and let it sit out at room temperature before you serve it. If your frosting has cream cheese or whipped cream, plan on refrigerating it instead of storing it at room temperature."
                }
            ]
        }
    ],
    "tyn": [
        "Round cake pans",
        "Cake mix or recipe",
        "Frosting",
        "Digital scale",
        "Cardboard platform",
        "Wire cooling rack",
        "Plastic wrap",
        "Cake strips or old kitchen towels",
        "Cake stand",
        "Offset spatula",
        "Serrated knife or cake leveler",
        "Cake decorations",
        "Cake leveler (optional)"
    ],
    "text": " Baking the Cakes Line or grease your cake pans. Decide what size cake you'd like to make and get out the number of pans you'll need. You'll typically need 2 or 3 pans. Then cut parchment paper to fit the inside of the pans or spray the inside of each pan with baking spray. Greasing or lining the pan will ensure that the cakes don't crumble or tear when you remove them. For example, you could use 8 or 9 inch (20.3 or 22.9 cm) round cake pans. Since you bake several cakes you can either stack them and frost them to make thick layers, or slice each cake in half horizontally to make even more thin layers. Make the cake batter. For a homemade cake, choose your favorite recipe and mix the cake batter. Ensure that the cake will make as many layers as you need or plan on doubling the recipe. To save time, combine 2 purchased cake mixes according to the packaged instructions. You can make a layer cake that has the same flavor of cake layers or use a different flavor for each layer. Use a digital scale to divide the batter evenly among the pans. Once you've mixed your cake batter, set a prepared cake pan on a digital scale. Spoon some of the batter in and then set another pan on the scale. Keep filling each of your cake pans while you weigh them so the batter is divided evenly. Dividing the batter evenly will ensure that all of your cake layers are the same thickness. Wrap cake strips or towels around the outsides of the cake pans. Secure cake strips to the outside of each filled cake pan. If you don't have cake strips, tear an old kitchen towel into long strips and wet them. Wrap the damp strips around the outside of each filled cake pan. The cake strips or towel will help the cake bake slowly from the edges towards the center. This will prevent the cakes from forming domes in the center. Reduce the temperature to 325 °F (163 °C) and increase the baking time. To bake flat cakes that are easily to layer and frost, turn the oven temperature down and bake the cakes for a little longer. Doing these things will prevent the cakes from cooking quickly in the center and puffing up. For example, if your recipe calls for baking the cakes for 30 minutes at 350 °F (177 °C), turn the oven down to 325 °F (163 °C) and bake them for 45 minutes. Plan on increasing the baking time by one half when you reduce the oven temperature by 25 degrees. Test the cakes and cool them completely. If you think the cakes have finished baking, insert a cake tester or toothpick into the center and pull it out. If it comes out clean and dry, the cakes are done. Then you can remove the cakes to cool completely. If the cake tester comes out with batter on it, return the cakes to the oven for a few minutes and check them again. Chill the layers for up to 5 days. Once the cakes are completely cooked, remove them from the oven and turn them out onto a wire rack to cool. When the cakes are at room temperature, cover them with plastic wrap and put them in the refrigerator for at least 1 hour or up to 5 days. Chilling the cakes will make them easier to slice and frost. Never try cutting or trimming warm cakes because they'll tear more. Cutting the Layers and Making the Frosting Trim away the excess dome from each cake. If your cakes baked faster in the center and domed up, you'll need to slice off the excess tops so each layer is even. Hold a serrated knife so the blade is horizontal and gently saw across the top of the cake so it's completely flat. Do this for each cake. Discard or snack on the cake dome once you've trimmed it away. Cut the cakes into layers. If you'd like thin layers, use a serrated knife or cake leveler to cut each cake in half horizontally. This will also double the number of layers your cake will be. For example, if you baked 2 round cakes, instead of having 2 thick layers, slice them in half to make 4 thin layers of cake. For thicker layers, skip cutting the cakes in half and just plan on stacking them. Mix your choice of filling and frosting. Decide what flavor and type of frosting you'd like to use in between the cake layers and on top of the cake. For a variety of flavors, use one flavor for the filling and a different flavor for the top and sides. If you're short on time, purchase a few containers of ready-made frosting. For example, fill the cake with a raspberry filling, but frost it with a chocolate ganache. You could even fill the cake with custard or cream cheese filling before frosting it with a lemon or strawberry frosting. Assembling the Layer Cake Place the first cake layer on a cardboard cake round or turntable. Cut a piece of cardboard to the same size as your cake pan and set it on a turntable. Spoon a dab of frosting on the center of the cardboard then set the bottom layer of chilled cake directly onto it. Put the cake top or cut-side down. The frosting will anchor the cake layer in place. If you don't have a turntable, set the cardboard on your work surface or a cake plate. Spread frosting or filling over the bottom layer. Spoon 1/2 cup to 1 cup (125 to 250 g) of frosting onto the cake layer. Use an offset spatula to spread the frosting evenly across the top of the layer, but don't try to frost the sides. If you prefer, you can use a piping bag to pipe the frosting onto the cake layer. If you're using a soft filling like a fruit curd or jam, pipe frosting around the edge of the cake layer. Then spread the filling. The frosting will prevent the soft filling from spilling out. Stack another layer of cake on top. If you're using a cake layer that you cut, lay it so the cut-side is facing down. It's fine if some of the frosting below the cake layer spills out over the sides. Spread frosting or filling over the layer. Add another 1/2 cup to 1 cup (125 to 250 g) of frosting or filling to the newest cake layer and spread it so it's evenly covered. Continue to stack the cake layers and spread filling in between them until you've added all of your cake layers. Leave the top layer of cake unfrosted for now since you'll be covering the cake with a crumb coat. Frosting the Top and Sides Spread a thin crumb coat over the top and sides of the cake. Put a large dollop of frosting onto the top of the assembled layer cake. Use an offset spatula to spread the frosting across the top and sides of the cake. The crumb coat should be so thin that you can see through to the cake. The crumb coat will trap the crumbs in the thin layer of frosting. This way, you can easily add frosting without getting crumbs in it. Chill the cake for 30 minutes and frost the top and sides. Put the cake in the fridge to chill until the crumb coat firms up. Then remove it and spread the remaining frosting over the top and sides of the cake. This layer of frosting should be much thicker than the crumb coat. Spin the cake turntable slowly as you work. This will make it easier to frost the sides of the cake. For very smooth sides, run a bench scraper against them so the frosting level is even. Chill the cake for at least 30 minutes. Place the frosted layer cake in the refrigerator and let it chill until the frosting sets. This will make it easier to pipe frosting or add other decorations without the frosting sliding or melting. You don't need to cover the cake as it chills. The frosting will prevent the cake from drying out. Decorate the cake. Once your cake has been completely frosted, pipe frosting embellishments on the top and sides. If you like, sprinkle cocoa or candy sprinkles over the top. Consider garnishing the cake with flaked coconut, mini-chocolate chips, or chopped nuts. For a botanical look, place fresh flowers on the cake. Remove the flowers just before slicing and serving the cake. Transfer the cake from the turntable to a cake stand. Slide a cake lifter or large spatula under the cardboard base for your layer cake. Carefully lift it up in order to move the whole cake from the turntable. Set it down on your cake stand. Then slice and enjoy the layer cake. Use a chef's knife to slice the cake into pieces. Store the layer cake at room temperature for up to 3 or 4 days. For the best texture, cover the layer cake with an overturned bowl or plastic wrap and keep it at room temperature. If you'd rather refrigerate it, store it in an airtight container for up to 1 week and let it sit out at room temperature before you serve it. If your frosting has cream cheese or whipped cream, plan on refrigerating it instead of storing it at room temperature.",
    "sentences": [
        " Baking the Cakes Line or grease your cake pans.",
        "Decide what size cake you'd like to make and get out the number of pans you'll need.",
        "You'll typically need 2 or 3 pans.",
        "Then cut parchment paper to fit the inside of the pans or spray the inside of each pan with baking spray.",
        "Greasing or lining the pan will ensure that the cakes don't crumble or tear when you remove them.",
        "For example, you could use 8 or 9 inch (20.3 or 22.9 cm) round cake pans.",
        "Since you bake several cakes you can either stack them and frost them to make thick layers, or slice each cake in half horizontally to make even more thin layers.",
        "Make the cake batter.",
        "For a homemade cake, choose your favorite recipe and mix the cake batter.",
        "Ensure that the cake will make as many layers as you need or plan on doubling the recipe.",
        "To save time, combine 2 purchased cake mixes according to the packaged instructions.",
        "You can make a layer cake that has the same flavor of cake layers or use a different flavor for each layer.",
        "Use a digital scale to divide the batter evenly among the pans.",
        "Once you've mixed your cake batter, set a prepared cake pan on a digital scale.",
        "Spoon some of the batter in and then set another pan on the scale.",
        "Keep filling each of your cake pans while you weigh them so the batter is divided evenly.",
        "Dividing the batter evenly will ensure that all of your cake layers are the same thickness.",
        "Wrap cake strips or towels around the outsides of the cake pans.",
        "Secure cake strips to the outside of each filled cake pan.",
        "If you don't have cake strips, tear an old kitchen towel into long strips and wet them.",
        "Wrap the damp strips around the outside of each filled cake pan.",
        "The cake strips or towel will help the cake bake slowly from the edges towards the center.",
        "This will prevent the cakes from forming domes in the center.",
        "Reduce the temperature to 325 °F (163 °C) and increase the baking time.",
        "To bake flat cakes that are easily to layer and frost, turn the oven temperature down and bake the cakes for a little longer.",
        "Doing these things will prevent the cakes from cooking quickly in the center and puffing up.",
        "For example, if your recipe calls for baking the cakes for 30 minutes at 350 °F (177 °C), turn the oven down to 325 °F (163 °C) and bake them for 45 minutes.",
        "Plan on increasing the baking time by one half when you reduce the oven temperature by 25 degrees.",
        "Test the cakes and cool them completely.",
        "If you think the cakes have finished baking, insert a cake tester or toothpick into the center and pull it out.",
        "If it comes out clean and dry, the cakes are done.",
        "Then you can remove the cakes to cool completely.",
        "If the cake tester comes out with batter on it, return the cakes to the oven for a few minutes and check them again.",
        "Chill the layers for up to 5 days.",
        "Once the cakes are completely cooked, remove them from the oven and turn them out onto a wire rack to cool.",
        "When the cakes are at room temperature, cover them with plastic wrap and put them in the refrigerator for at least 1 hour or up to 5 days.",
        "Chilling the cakes will make them easier to slice and frost.",
        "Never try cutting or trimming warm cakes because they'll tear more.",
        "Cutting the Layers and Making the Frosting Trim away the excess dome from each cake.",
        "If your cakes baked faster in the center and domed up, you'll need to slice off the excess tops so each layer is even.",
        "Hold a serrated knife so the blade is horizontal and gently saw across the top of the cake so it's completely flat.",
        "Do this for each cake.",
        "Discard or snack on the cake dome once you've trimmed it away.",
        "Cut the cakes into layers.",
        "If you'd like thin layers, use a serrated knife or cake leveler to cut each cake in half horizontally.",
        "This will also double the number of layers your cake will be.",
        "For example, if you baked 2 round cakes, instead of having 2 thick layers, slice them in half to make 4 thin layers of cake.",
        "For thicker layers, skip cutting the cakes in half and just plan on stacking them.",
        "Mix your choice of filling and frosting.",
        "Decide what flavor and type of frosting you'd like to use in between the cake layers and on top of the cake.",
        "For a variety of flavors, use one flavor for the filling and a different flavor for the top and sides.",
        "If you're short on time, purchase a few containers of ready-made frosting.",
        "For example, fill the cake with a raspberry filling, but frost it with a chocolate ganache.",
        "You could even fill the cake with custard or cream cheese filling before frosting it with a lemon or strawberry frosting.",
        "Assembling the Layer Cake Place the first cake layer on a cardboard cake round or turntable.",
        "Cut a piece of cardboard to the same size as your cake pan and set it on a turntable.",
        "Spoon a dab of frosting on the center of the cardboard then set the bottom layer of chilled cake directly onto it.",
        "Put the cake top or cut-side down.",
        "The frosting will anchor the cake layer in place.",
        "If you don't have a turntable, set the cardboard on your work surface or a cake plate.",
        "Spread frosting or filling over the bottom layer.",
        "Spoon 1/2 cup to 1 cup (125 to 250 g) of frosting onto the cake layer.",
        "Use an offset spatula to spread the frosting evenly across the top of the layer, but don't try to frost the sides.",
        "If you prefer, you can use a piping bag to pipe the frosting onto the cake layer.",
        "If you're using a soft filling like a fruit curd or jam, pipe frosting around the edge of the cake layer.",
        "Then spread the filling.",
        "The frosting will prevent the soft filling from spilling out.",
        "Stack another layer of cake on top.",
        "If you're using a cake layer that you cut, lay it so the cut-side is facing down.",
        "It's fine if some of the frosting below the cake layer spills out over the sides.",
        "Spread frosting or filling over the layer.",
        "Add another 1/2 cup to 1 cup (125 to 250 g) of frosting or filling to the newest cake layer and spread it so it's evenly covered.",
        "Continue to stack the cake layers and spread filling in between them until you've added all of your cake layers.",
        "Leave the top layer of cake unfrosted for now since you'll be covering the cake with a crumb coat.",
        "Frosting the Top and Sides Spread a thin crumb coat over the top and sides of the cake.",
        "Put a large dollop of frosting onto the top of the assembled layer cake.",
        "Use an offset spatula to spread the frosting across the top and sides of the cake.",
        "The crumb coat should be so thin that you can see through to the cake.",
        "The crumb coat will trap the crumbs in the thin layer of frosting.",
        "This way, you can easily add frosting without getting crumbs in it.",
        "Chill the cake for 30 minutes and frost the top and sides.",
        "Put the cake in the fridge to chill until the crumb coat firms up.",
        "Then remove it and spread the remaining frosting over the top and sides of the cake.",
        "This layer of frosting should be much thicker than the crumb coat.",
        "Spin the cake turntable slowly as you work.",
        "This will make it easier to frost the sides of the cake.",
        "For very smooth sides, run a bench scraper against them so the frosting level is even.",
        "Chill the cake for at least 30 minutes.",
        "Place the frosted layer cake in the refrigerator and let it chill until the frosting sets.",
        "This will make it easier to pipe frosting or add other decorations without the frosting sliding or melting.",
        "You don't need to cover the cake as it chills.",
        "The frosting will prevent the cake from drying out.",
        "Decorate the cake.",
        "Once your cake has been completely frosted, pipe frosting embellishments on the top and sides.",
        "If you like, sprinkle cocoa or candy sprinkles over the top.",
        "Consider garnishing the cake with flaked coconut, mini-chocolate chips, or chopped nuts.",
        "For a botanical look, place fresh flowers on the cake.",
        "Remove the flowers just before slicing and serving the cake.",
        "Transfer the cake from the turntable to a cake stand.",
        "Slide a cake lifter or large spatula under the cardboard base for your layer cake.",
        "Carefully lift it up in order to move the whole cake from the turntable.",
        "Set it down on your cake stand.",
        "Then slice and enjoy the layer cake.",
        "Use a chef's knife to slice the cake into pieces.",
        "Store the layer cake at room temperature for up to 3 or 4 days.",
        "For the best texture, cover the layer cake with an overturned bowl or plastic wrap and keep it at room temperature.",
        "If you'd rather refrigerate it, store it in an airtight container for up to 1 week and let it sit out at room temperature before you serve it.",
        "If your frosting has cream cheese or whipped cream, plan on refrigerating it instead of storing it at room temperature."
    ]
}