{
    "title": "How to Take Paint Off Brick",
    "url": "https://www.wikihow.com/Take-Paint-Off-Brick",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Prepping Your Brick and Getting a Stripper",
            "steps": [
                {
                    "headline": "Buy a caustic paint stripper designed for masonry.",
                    "description": "While you may be able to physically scrape your paint off with a scraper or steel wool, you won’t completely remove the paint from the pores of the masonry without using a chemical paint stripper. Look online or buy a caustic paint stripper from your local hardware store. Paint strippers vary brand by brand, so look for a stripper specifically designed for masonry.Tip: This is really the only way to entirely remove paint from bricks. If the paint is really old and flaking off, you can scrub it with water a stiff-bristled brush, but doing this may damage the bricks. It also won’t remove any paint that is embedded in the pores beneath the surface of the brick. Avoid spray strippers unless you’re working in an isolated area. These sprays tend to be a little weaker and are much harder to use. If you’re removing paint from a wall, look for a stripper that does not contain methylene chloride. Methylene-free strippers tend to have thick textures and won’t easily drip down a vertical surface. Paint strippers are often marketed as paint removers. Get a kit that comes with plastic sheeting for the stripper to make things easier. Strippers that rely on air drying need to be washed away and don’t tend to be as effective."
                },
                {
                    "headline": "Clean your walls by washing them with a hose or wet cloth.",
                    "description": "To prepare your bricks for paint stripping, clean them with lukewarm water. If you’re stripping a smaller set of bricks, soak a towel or cloth in water and wash the bricks by hand. If you have a larger brick surface that you’re stripping and it’s outside, rinse the surface with a hose. Wait 6-12 hours for your bricks to air dry. It’s not the end of the world if you don’t wash your bricks, but it will be a little tougher to scrape the paint away if you don’t clean them."
                },
                {
                    "headline": "Set a drop cloth out underneath your brick to catch debris.",
                    "description": "Paint stripper will damage the yard or asphalt around your home if you’re stripping an exterior wall, and the old paint will fly all over the place once you begin scraping the paint away if you’re indoors. Get a large plastic drop cloth and lay it down underneath the bricksthat you’re going to strip. If it’s a little windy and you’re working outside, weigh the drop cloth down with cinderblocks or bricks.This process typically takes a few hours. Don’t start this process if it’s really cold or forecasted to rain. Go ahead and skip this step if you’re stripping bricks on a floor."
                },
                {
                    "headline": "Put on the protective gear listed on your type of paint stripper.",
                    "description": "While the safety gear is different for every brand of paint stripper, you’ll definitely need to wear protective eyewear, long-sleeve clothing, and thick rubber, neoprene, or nitrile gloves. If you’re working outside, wear a face shield to protect your face and neck. Read your container carefully to determine what you need to do to stay safe while applying your paint stripper.You normally don’t have to wear a respirator, but you may want to wear one if you’re working inside to avoid irritating your lungs. If you’re using a stripper indoors, open the windows to keep the room well-ventilated. Turn on any fans to increase the air flow as well. Keep any pets or children out of the room where you’ll be working—preferably on a different floor."
                }
            ]
        },
        {
            "name": "Applying the Paint Stripper",
            "steps": [
                {
                    "headline": "Work in sections based on the size of your plastic sheeting.",
                    "description": "Paint stripper comes with plastic sheeting that you lay over the stripper after you apply it. This means that you need to apply stripper in sections based on how big your sheeting is. Measure the size of one of your plastic sheets to get a good idea of how big each section needs to be.These sheets are typically around 5 by 5 feet (1.5 by 1.5 m), but your sheets may be a little bigger or smaller. You don’t need to be exact about it, though. If your sheets are 8 by 8 ft (2.4 by 2.4 m) for example, it’s not a big deal if you cover a 10 by 12 ft (3.0 by 3.7 m) section in stripper before applying the sheet. If you do need plastic sheeting and it didn’t come with your stripper, purchase peel-away laminated paper. This is the same thing as the plastic sheeting that comes with the stripper kits. Some paint strippers don’t use plastic sheeting, but most caustic strippers do. However, if your stripper doesn’t rely on sheeting to eat away the paint, skip the steps related to the plastic sheeting."
                },
                {
                    "headline": "Apply the stripper using a trowel or paint brush.",
                    "description": "Read your can of paint stripper to see if you apply it with a brush or some other tool. Usually, you use a 3–4 in (7.6–10.2 cm) flat brush to apply the stripper. Open the can of paint stripper and pour it into a paint tray. Dip your brush into the stripper and apply the stripper in the direction of the brick using back-and-forth strokes. Your brush strokes don’t really matter. How the paint stripper is applied matters less than how thick it is once you apply it. If you’re using a trowel or putty knife to apply your stripper, dip the blade into the stripper and scrape it into the surface by dragging the loaded edge across the surface at a 45-degree angle. Reload your stripper as needed to apply more of it. If you’re stripping a tall wall, get a stable ladder and work your way from the top of the wall to the bottom. Enlist a friend to hold the ladder at the bottom so that you don’t fall off while you work."
                },
                {
                    "headline": "Build up a layer of stripper thicker than ⁄4–⁄2 in (0.64–1.27 cm).",
                    "description": "Continue applying paint stripper to your first section of the brick until you build up a thick layer. Reload your brush, knife, or trowel as needed to continue layering the stripper on top of itself. Stop adding paint stripper once the layer is at least ⁄8 in (0.32 cm) thick.Tip: Paint stripper is usually at least semi-translucent. You can tell that your layer is built up when the brick underneath becomes kind of hard to see. Paint stripper is usually white, and it should be pretty easy to recognize when you’ve missed a section."
                },
                {
                    "headline": "Spread your plastic sheet over the stripper and press it into the brick.",
                    "description": "Once you’ve covered your first section, grab one of your plastic sheets. Lift the sheet up with both hands and orient the sheet with any writing facing out. Then, starting in a top corner, press the sheet into the paint stripper. Use your palm to press the sheet into the wall and smooth it out as you move towards the opposite corner. Use both of your palms to smooth the sheet down until it’s completely adhered to the wall.Push air bubbles out towards the edges of the sheeting to remove them. You may need to remove an adhesive back before applying the sheet, but most plastic sheets come ready to be applied. If you’re using a ladder, don’t unfold your sheet until you get to the top of the ladder. Enlist a friend to hold it for you and work slowly to ensure that you stay safe. Some strippers don’t use plastic sheeting. If your stripper doesn’t, simply let it air dry after applying it before washing and scraping it off."
                },
                {
                    "headline": "Continue working in small sections until you cover the entire surface.",
                    "description": "Once your first sheet is applied, pick your paint stripper back up and work on the section next to it. Apply your paint stripper and build it up into a thick layer. Add your second plastic sheet, overlapping the edge of the sheet next to it. Continue doing this until your wall is entirely covered in the plastic sheeting.Depending on the size of your wall, this may be time consuming. For an exterior wall, expect to spend a few hours applying the sheets."
                },
                {
                    "headline": "Wait for the stripper to eat away the paint based on the manufacturer’s instructions.",
                    "description": "Once the stripper is covered, read the instructions on your container to determine how long you need to wait for the stripper to eat away the paint. Wait a minimum of 30 minutes to give the stripper time to work its way into the porous bricks. At most, you may need to wait 12 hours for the stripper to work.In most cases, the stripper will be more effective the longer you wait. If your stripper lists a range of waiting times, like 30-60 minutes, wait the maximum amount of time listed if you want to make this process easier."
                }
            ]
        },
        {
            "name": "Scraping Your Paint Away",
            "steps": [
                {
                    "headline": "Peel the plastic sheets off of the brick and discard them.",
                    "description": "Once you’ve waited at least 30 minutes, peel the sheets off of the wall. Either lift the corners of each sheet off by hand or use your putty knife or trowel to scrape an edge out. Peel each sheet sheet slowly to ensure that you don’t rip any of the grout or brick out with your plastic. Take off every sheet and discard them in a thick garbage bag to safely discard them.You may notice a lot of the stripper peeling off with your sheets, revealing the clean brick underneath. Don’t worry if this doesn’t happen, though. The remaining paint should be pretty easy to remove."
                },
                {
                    "headline": "Use a scraper to peel the dried stripper away.",
                    "description": "With your sheets removed, grab a putty knife, paint scraper, or chisel. Press the blade of your scraping tool into the wall at a 45-degree angle. Scrape away from you in the direction of the brick to remove a layer of the dried stripper. Continue this process until you’ve scraped the remaining paint away.Tip: Some air-dry strippers need to be washed off first. If your stripper needs to be washed away, use a standard hose and a thin nozzle to spray your brick at angle away from you. This process should be fairly easy. You shouldn’t need to apply a lot of pressure to remove the weakened paint. However, this can take quite some time. Expect to spend a few hours scraping a large external wall. Fold your drop cloth up and discard it along with your used plastic sheeting."
                },
                {
                    "headline": "Reapply more paint stripper if you can’t remove some of the paint.",
                    "description": "If you find it extremely difficult to remove some of the paint, don’t keep grinding your scraper into the brick. Instead, reapply a small layer of paint stripper over the area and add a new sheet. Wait the minimum amount of time listed on the stripper’s container before removing the sheet and scraping the resilient paint away.If your brick has been painted over multiple times, you may need to repeat the entire process across your entire surface."
                },
                {
                    "headline": "Wash the brick after removing the paint to clear any debris away.",
                    "description": "On an exterior wall, grab a hose and attach a sprayer to the end. Turn the hose on and spray your wall at an angle away from you to wipe away any remaining residue from your paint stripper. If you’re stripping an interior wall, use a damp cloth and a stiff-bristled brush to carefully scrub any residue away.Let your brick air dry after washing it."
                }
            ]
        }
    ],
    "tyn": [
        "Paint stripper",
        "Gloves",
        "Respirator (optional)",
        "Protective eyewear",
        "Face shield",
        "Water",
        "Cloth",
        "Hose (optional)",
        "Ladder (optional)",
        "Brush, trowel, or putty knife",
        "Scraper",
        "Hose attachment",
        "Garbage bag",
        "Stiff-bristled brush"
    ],
    "text": " Prepping Your Brick and Getting a Stripper Buy a caustic paint stripper designed for masonry. While you may be able to physically scrape your paint off with a scraper or steel wool, you won’t completely remove the paint from the pores of the masonry without using a chemical paint stripper. Look online or buy a caustic paint stripper from your local hardware store. Paint strippers vary brand by brand, so look for a stripper specifically designed for masonry.Tip: This is really the only way to entirely remove paint from bricks. If the paint is really old and flaking off, you can scrub it with water a stiff-bristled brush, but doing this may damage the bricks. It also won’t remove any paint that is embedded in the pores beneath the surface of the brick. Avoid spray strippers unless you’re working in an isolated area. These sprays tend to be a little weaker and are much harder to use. If you’re removing paint from a wall, look for a stripper that does not contain methylene chloride. Methylene-free strippers tend to have thick textures and won’t easily drip down a vertical surface. Paint strippers are often marketed as paint removers. Get a kit that comes with plastic sheeting for the stripper to make things easier. Strippers that rely on air drying need to be washed away and don’t tend to be as effective. Clean your walls by washing them with a hose or wet cloth. To prepare your bricks for paint stripping, clean them with lukewarm water. If you’re stripping a smaller set of bricks, soak a towel or cloth in water and wash the bricks by hand. If you have a larger brick surface that you’re stripping and it’s outside, rinse the surface with a hose. Wait 6-12 hours for your bricks to air dry. It’s not the end of the world if you don’t wash your bricks, but it will be a little tougher to scrape the paint away if you don’t clean them. Set a drop cloth out underneath your brick to catch debris. Paint stripper will damage the yard or asphalt around your home if you’re stripping an exterior wall, and the old paint will fly all over the place once you begin scraping the paint away if you’re indoors. Get a large plastic drop cloth and lay it down underneath the bricksthat you’re going to strip. If it’s a little windy and you’re working outside, weigh the drop cloth down with cinderblocks or bricks.This process typically takes a few hours. Don’t start this process if it’s really cold or forecasted to rain. Go ahead and skip this step if you’re stripping bricks on a floor. Put on the protective gear listed on your type of paint stripper. While the safety gear is different for every brand of paint stripper, you’ll definitely need to wear protective eyewear, long-sleeve clothing, and thick rubber, neoprene, or nitrile gloves. If you’re working outside, wear a face shield to protect your face and neck. Read your container carefully to determine what you need to do to stay safe while applying your paint stripper.You normally don’t have to wear a respirator, but you may want to wear one if you’re working inside to avoid irritating your lungs. If you’re using a stripper indoors, open the windows to keep the room well-ventilated. Turn on any fans to increase the air flow as well. Keep any pets or children out of the room where you’ll be working—preferably on a different floor. Applying the Paint Stripper Work in sections based on the size of your plastic sheeting. Paint stripper comes with plastic sheeting that you lay over the stripper after you apply it. This means that you need to apply stripper in sections based on how big your sheeting is. Measure the size of one of your plastic sheets to get a good idea of how big each section needs to be.These sheets are typically around 5 by 5 feet (1.5 by 1.5 m), but your sheets may be a little bigger or smaller. You don’t need to be exact about it, though. If your sheets are 8 by 8 ft (2.4 by 2.4 m) for example, it’s not a big deal if you cover a 10 by 12 ft (3.0 by 3.7 m) section in stripper before applying the sheet. If you do need plastic sheeting and it didn’t come with your stripper, purchase peel-away laminated paper. This is the same thing as the plastic sheeting that comes with the stripper kits. Some paint strippers don’t use plastic sheeting, but most caustic strippers do. However, if your stripper doesn’t rely on sheeting to eat away the paint, skip the steps related to the plastic sheeting. Apply the stripper using a trowel or paint brush. Read your can of paint stripper to see if you apply it with a brush or some other tool. Usually, you use a 3–4 in (7.6–10.2 cm) flat brush to apply the stripper. Open the can of paint stripper and pour it into a paint tray. Dip your brush into the stripper and apply the stripper in the direction of the brick using back-and-forth strokes. Your brush strokes don’t really matter. How the paint stripper is applied matters less than how thick it is once you apply it. If you’re using a trowel or putty knife to apply your stripper, dip the blade into the stripper and scrape it into the surface by dragging the loaded edge across the surface at a 45-degree angle. Reload your stripper as needed to apply more of it. If you’re stripping a tall wall, get a stable ladder and work your way from the top of the wall to the bottom. Enlist a friend to hold the ladder at the bottom so that you don’t fall off while you work. Build up a layer of stripper thicker than ⁄4–⁄2 in (0.64–1.27 cm). Continue applying paint stripper to your first section of the brick until you build up a thick layer. Reload your brush, knife, or trowel as needed to continue layering the stripper on top of itself. Stop adding paint stripper once the layer is at least ⁄8 in (0.32 cm) thick.Tip: Paint stripper is usually at least semi-translucent. You can tell that your layer is built up when the brick underneath becomes kind of hard to see. Paint stripper is usually white, and it should be pretty easy to recognize when you’ve missed a section. Spread your plastic sheet over the stripper and press it into the brick. Once you’ve covered your first section, grab one of your plastic sheets. Lift the sheet up with both hands and orient the sheet with any writing facing out. Then, starting in a top corner, press the sheet into the paint stripper. Use your palm to press the sheet into the wall and smooth it out as you move towards the opposite corner. Use both of your palms to smooth the sheet down until it’s completely adhered to the wall.Push air bubbles out towards the edges of the sheeting to remove them. You may need to remove an adhesive back before applying the sheet, but most plastic sheets come ready to be applied. If you’re using a ladder, don’t unfold your sheet until you get to the top of the ladder. Enlist a friend to hold it for you and work slowly to ensure that you stay safe. Some strippers don’t use plastic sheeting. If your stripper doesn’t, simply let it air dry after applying it before washing and scraping it off. Continue working in small sections until you cover the entire surface. Once your first sheet is applied, pick your paint stripper back up and work on the section next to it. Apply your paint stripper and build it up into a thick layer. Add your second plastic sheet, overlapping the edge of the sheet next to it. Continue doing this until your wall is entirely covered in the plastic sheeting.Depending on the size of your wall, this may be time consuming. For an exterior wall, expect to spend a few hours applying the sheets. Wait for the stripper to eat away the paint based on the manufacturer’s instructions. Once the stripper is covered, read the instructions on your container to determine how long you need to wait for the stripper to eat away the paint. Wait a minimum of 30 minutes to give the stripper time to work its way into the porous bricks. At most, you may need to wait 12 hours for the stripper to work.In most cases, the stripper will be more effective the longer you wait. If your stripper lists a range of waiting times, like 30-60 minutes, wait the maximum amount of time listed if you want to make this process easier. Scraping Your Paint Away Peel the plastic sheets off of the brick and discard them. Once you’ve waited at least 30 minutes, peel the sheets off of the wall. Either lift the corners of each sheet off by hand or use your putty knife or trowel to scrape an edge out. Peel each sheet sheet slowly to ensure that you don’t rip any of the grout or brick out with your plastic. Take off every sheet and discard them in a thick garbage bag to safely discard them.You may notice a lot of the stripper peeling off with your sheets, revealing the clean brick underneath. Don’t worry if this doesn’t happen, though. The remaining paint should be pretty easy to remove. Use a scraper to peel the dried stripper away. With your sheets removed, grab a putty knife, paint scraper, or chisel. Press the blade of your scraping tool into the wall at a 45-degree angle. Scrape away from you in the direction of the brick to remove a layer of the dried stripper. Continue this process until you’ve scraped the remaining paint away.Tip: Some air-dry strippers need to be washed off first. If your stripper needs to be washed away, use a standard hose and a thin nozzle to spray your brick at angle away from you. This process should be fairly easy. You shouldn’t need to apply a lot of pressure to remove the weakened paint. However, this can take quite some time. Expect to spend a few hours scraping a large external wall. Fold your drop cloth up and discard it along with your used plastic sheeting. Reapply more paint stripper if you can’t remove some of the paint. If you find it extremely difficult to remove some of the paint, don’t keep grinding your scraper into the brick. Instead, reapply a small layer of paint stripper over the area and add a new sheet. Wait the minimum amount of time listed on the stripper’s container before removing the sheet and scraping the resilient paint away.If your brick has been painted over multiple times, you may need to repeat the entire process across your entire surface. Wash the brick after removing the paint to clear any debris away. On an exterior wall, grab a hose and attach a sprayer to the end. Turn the hose on and spray your wall at an angle away from you to wipe away any remaining residue from your paint stripper. If you’re stripping an interior wall, use a damp cloth and a stiff-bristled brush to carefully scrub any residue away.Let your brick air dry after washing it.",
    "sentences": [
        " Prepping Your Brick and Getting a Stripper Buy a caustic paint stripper designed for masonry.",
        "While you may be able to physically scrape your paint off with a scraper or steel wool, you won’t completely remove the paint from the pores of the masonry without using a chemical paint stripper.",
        "Look online or buy a caustic paint stripper from your local hardware store.",
        "Paint strippers vary brand by brand, so look for a stripper specifically designed for masonry.Tip: This is really the only way to entirely remove paint from bricks.",
        "If the paint is really old and flaking off, you can scrub it with water a stiff-bristled brush, but doing this may damage the bricks.",
        "It also won’t remove any paint that is embedded in the pores beneath the surface of the brick.",
        "Avoid spray strippers unless you’re working in an isolated area.",
        "These sprays tend to be a little weaker and are much harder to use.",
        "If you’re removing paint from a wall, look for a stripper that does not contain methylene chloride.",
        "Methylene-free strippers tend to have thick textures and won’t easily drip down a vertical surface.",
        "Paint strippers are often marketed as paint removers.",
        "Get a kit that comes with plastic sheeting for the stripper to make things easier.",
        "Strippers that rely on air drying need to be washed away and don’t tend to be as effective.",
        "Clean your walls by washing them with a hose or wet cloth.",
        "To prepare your bricks for paint stripping, clean them with lukewarm water.",
        "If you’re stripping a smaller set of bricks, soak a towel or cloth in water and wash the bricks by hand.",
        "If you have a larger brick surface that you’re stripping and it’s outside, rinse the surface with a hose.",
        "Wait 6-12 hours for your bricks to air dry.",
        "It’s not the end of the world if you don’t wash your bricks, but it will be a little tougher to scrape the paint away if you don’t clean them.",
        "Set a drop cloth out underneath your brick to catch debris.",
        "Paint stripper will damage the yard or asphalt around your home if you’re stripping an exterior wall, and the old paint will fly all over the place once you begin scraping the paint away if you’re indoors.",
        "Get a large plastic drop cloth and lay it down underneath the bricksthat you’re going to strip.",
        "If it’s a little windy and you’re working outside, weigh the drop cloth down with cinderblocks or bricks.This process typically takes a few hours.",
        "Don’t start this process if it’s really cold or forecasted to rain.",
        "Go ahead and skip this step if you’re stripping bricks on a floor.",
        "Put on the protective gear listed on your type of paint stripper.",
        "While the safety gear is different for every brand of paint stripper, you’ll definitely need to wear protective eyewear, long-sleeve clothing, and thick rubber, neoprene, or nitrile gloves.",
        "If you’re working outside, wear a face shield to protect your face and neck.",
        "Read your container carefully to determine what you need to do to stay safe while applying your paint stripper.You normally don’t have to wear a respirator, but you may want to wear one if you’re working inside to avoid irritating your lungs.",
        "If you’re using a stripper indoors, open the windows to keep the room well-ventilated.",
        "Turn on any fans to increase the air flow as well.",
        "Keep any pets or children out of the room where you’ll be working—preferably on a different floor.",
        "Applying the Paint Stripper Work in sections based on the size of your plastic sheeting.",
        "Paint stripper comes with plastic sheeting that you lay over the stripper after you apply it.",
        "This means that you need to apply stripper in sections based on how big your sheeting is.",
        "Measure the size of one of your plastic sheets to get a good idea of how big each section needs to be.These sheets are typically around 5 by 5 feet (1.5 by 1.5 m), but your sheets may be a little bigger or smaller.",
        "You don’t need to be exact about it, though.",
        "If your sheets are 8 by 8 ft (2.4 by 2.4 m) for example, it’s not a big deal if you cover a 10 by 12 ft (3.0 by 3.7 m) section in stripper before applying the sheet.",
        "If you do need plastic sheeting and it didn’t come with your stripper, purchase peel-away laminated paper.",
        "This is the same thing as the plastic sheeting that comes with the stripper kits.",
        "Some paint strippers don’t use plastic sheeting, but most caustic strippers do.",
        "However, if your stripper doesn’t rely on sheeting to eat away the paint, skip the steps related to the plastic sheeting.",
        "Apply the stripper using a trowel or paint brush.",
        "Read your can of paint stripper to see if you apply it with a brush or some other tool.",
        "Usually, you use a 3–4 in (7.6–10.2 cm) flat brush to apply the stripper.",
        "Open the can of paint stripper and pour it into a paint tray.",
        "Dip your brush into the stripper and apply the stripper in the direction of the brick using back-and-forth strokes.",
        "Your brush strokes don’t really matter.",
        "How the paint stripper is applied matters less than how thick it is once you apply it.",
        "If you’re using a trowel or putty knife to apply your stripper, dip the blade into the stripper and scrape it into the surface by dragging the loaded edge across the surface at a 45-degree angle.",
        "Reload your stripper as needed to apply more of it.",
        "If you’re stripping a tall wall, get a stable ladder and work your way from the top of the wall to the bottom.",
        "Enlist a friend to hold the ladder at the bottom so that you don’t fall off while you work.",
        "Build up a layer of stripper thicker than ⁄4–⁄2 in (0.64–1.27 cm).",
        "Continue applying paint stripper to your first section of the brick until you build up a thick layer.",
        "Reload your brush, knife, or trowel as needed to continue layering the stripper on top of itself.",
        "Stop adding paint stripper once the layer is at least ⁄8 in (0.32 cm) thick.Tip: Paint stripper is usually at least semi-translucent.",
        "You can tell that your layer is built up when the brick underneath becomes kind of hard to see.",
        "Paint stripper is usually white, and it should be pretty easy to recognize when you’ve missed a section.",
        "Spread your plastic sheet over the stripper and press it into the brick.",
        "Once you’ve covered your first section, grab one of your plastic sheets.",
        "Lift the sheet up with both hands and orient the sheet with any writing facing out.",
        "Then, starting in a top corner, press the sheet into the paint stripper.",
        "Use your palm to press the sheet into the wall and smooth it out as you move towards the opposite corner.",
        "Use both of your palms to smooth the sheet down until it’s completely adhered to the wall.Push air bubbles out towards the edges of the sheeting to remove them.",
        "You may need to remove an adhesive back before applying the sheet, but most plastic sheets come ready to be applied.",
        "If you’re using a ladder, don’t unfold your sheet until you get to the top of the ladder.",
        "Enlist a friend to hold it for you and work slowly to ensure that you stay safe.",
        "Some strippers don’t use plastic sheeting.",
        "If your stripper doesn’t, simply let it air dry after applying it before washing and scraping it off.",
        "Continue working in small sections until you cover the entire surface.",
        "Once your first sheet is applied, pick your paint stripper back up and work on the section next to it.",
        "Apply your paint stripper and build it up into a thick layer.",
        "Add your second plastic sheet, overlapping the edge of the sheet next to it.",
        "Continue doing this until your wall is entirely covered in the plastic sheeting.Depending on the size of your wall, this may be time consuming.",
        "For an exterior wall, expect to spend a few hours applying the sheets.",
        "Wait for the stripper to eat away the paint based on the manufacturer’s instructions.",
        "Once the stripper is covered, read the instructions on your container to determine how long you need to wait for the stripper to eat away the paint.",
        "Wait a minimum of 30 minutes to give the stripper time to work its way into the porous bricks.",
        "At most, you may need to wait 12 hours for the stripper to work.In most cases, the stripper will be more effective the longer you wait.",
        "If your stripper lists a range of waiting times, like 30-60 minutes, wait the maximum amount of time listed if you want to make this process easier.",
        "Scraping Your Paint Away Peel the plastic sheets off of the brick and discard them.",
        "Once you’ve waited at least 30 minutes, peel the sheets off of the wall.",
        "Either lift the corners of each sheet off by hand or use your putty knife or trowel to scrape an edge out.",
        "Peel each sheet sheet slowly to ensure that you don’t rip any of the grout or brick out with your plastic.",
        "Take off every sheet and discard them in a thick garbage bag to safely discard them.You may notice a lot of the stripper peeling off with your sheets, revealing the clean brick underneath.",
        "Don’t worry if this doesn’t happen, though.",
        "The remaining paint should be pretty easy to remove.",
        "Use a scraper to peel the dried stripper away.",
        "With your sheets removed, grab a putty knife, paint scraper, or chisel.",
        "Press the blade of your scraping tool into the wall at a 45-degree angle.",
        "Scrape away from you in the direction of the brick to remove a layer of the dried stripper.",
        "Continue this process until you’ve scraped the remaining paint away.Tip: Some air-dry strippers need to be washed off first.",
        "If your stripper needs to be washed away, use a standard hose and a thin nozzle to spray your brick at angle away from you.",
        "This process should be fairly easy.",
        "You shouldn’t need to apply a lot of pressure to remove the weakened paint.",
        "However, this can take quite some time.",
        "Expect to spend a few hours scraping a large external wall.",
        "Fold your drop cloth up and discard it along with your used plastic sheeting.",
        "Reapply more paint stripper if you can’t remove some of the paint.",
        "If you find it extremely difficult to remove some of the paint, don’t keep grinding your scraper into the brick.",
        "Instead, reapply a small layer of paint stripper over the area and add a new sheet.",
        "Wait the minimum amount of time listed on the stripper’s container before removing the sheet and scraping the resilient paint away.If your brick has been painted over multiple times, you may need to repeat the entire process across your entire surface.",
        "Wash the brick after removing the paint to clear any debris away.",
        "On an exterior wall, grab a hose and attach a sprayer to the end.",
        "Turn the hose on and spray your wall at an angle away from you to wipe away any remaining residue from your paint stripper.",
        "If you’re stripping an interior wall, use a damp cloth and a stiff-bristled brush to carefully scrub any residue away.Let your brick air dry after washing it."
    ]
}