{
    "title": "How to Play Pitch",
    "url": "https://www.wikihow.com/Play-Pitch",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Card Games",
        "Trick Taking Card Games"
    ],
    "parts": [
        {
            "name": "Beginning the Game with Bidding",
            "steps": [
                {
                    "headline": "Get at least three players together.",
                    "description": "Pitch requires at least three people, though you can play with more. Typically, a traditional game is played with partners. So, four players are ideal for this game. The dealer shuffles and then deals out six cards to each player. The dealer should hand out the cards in the pattern of 1, then 2, then 3 cards per deal."
                },
                {
                    "headline": "Evaluate your cards.",
                    "description": "Once the cards have been dealt, look at the cards you’ve been given. If you’re playing with a partner, look at the cards with your partner. The values for the cards are:\nTen: 10 points. Ace: 4 points. King: 3 points. Queen: 2 points. Jack: 1 point."
                },
                {
                    "headline": "Make bids.",
                    "description": "Every player must now make a bid. How much you bid corresponds to how much confidence you have in the hand you've been dealt. The bidding starts with the person to the left of the dealer, and goes in a circle. You can bid 2, 3, or 4 cards. The bid represents the number of points that you think you will get in this hand. If you aren't confident at all, you may pass, unless you are the last to bid (i.e. the dealer) and everyone else has passed, in which case you have to bid at least 2."
                },
                {
                    "headline": "Match the bids.",
                    "description": "Once someone has placed a bid, you have to match them, surpass them, or pass on your turn. For example, you cannot bid two if three has already been bid. The point of bidding is to figure out who is the most confident in their hand, because that is the person who is going to get to choose the trump suit."
                },
                {
                    "headline": "Know how the trump works.",
                    "description": "The points that you can get in pitch are these: high of trump, low of trump, jack of trump, and game. \"High\" is the highest trump card played, \"low\" is the lowest trump card played, \"jack\" is the jack of trump, and \"game\" has to do with how many face cards you end up with."
                }
            ]
        },
        {
            "name": "Playing the Game",
            "steps": [
                {
                    "headline": "Determine who has the highest trump.",
                    "description": "Which suit becomes trump depends on who bids the highest, because whoever bids the highest gets to throw down first. The first card that they throw down becomes the trump suit. Therefore, if you have the ace of spades, the two of spades, and the jack of spades, you probably want to bid four, because then you will get to make \"spades\" the trump suit and you will probably be able to get four points."
                },
                {
                    "headline": "Throw down the first card.",
                    "description": "Whoever bid the highest gets to throw down first. Whichever is the first card that they throw becomes the trump suit. Play continues to the left. Everyone throws down one card. The winner of the \"hand\" is the person who has thrown either the highest card in suit, or the highest trump card. Trump can be played anytime. Trump always beats \"in suit.\""
                },
                {
                    "headline": "Complete the first round.",
                    "description": "The winner of the hand is the player that puts down the trump card or the highest suit. The game continues on until everyone is out of cards. When everyone is out of cards (which should happen concurrently), the cards are tallied up to see who gets points. The winner of the round gets to take all of the cards that he has won."
                },
                {
                    "headline": "Hand out the points.",
                    "description": "If the highest initial bidder (the person who threw the trump at the beginning of the game) has come up with the points that they bid, he gets those points. If not, he gets negative of those points. Meanwhile, anyone else who scores points gets them free of charge (i.e., if the bidder bid 3, and he got high low and game, he gets 3 points). The person who got jack gets 1 point. If the bidder bid 3, and got high and low, he gets negative three points. Whoever got jack gets a point, whoever got game gets a point. Points are assigned as follows:\n1 point to the lowest trump card played. 1 point to the highest trump card played. 1 point to the jack of trump. 1 point to \"game.\" This is the person with the highest number, if you count the 10 card of any suit as 10 and each jack as 1, queen as 2, king as 3, ace as 4."
                },
                {
                    "headline": "Play until someone reaches 21 points.",
                    "description": "In a traditional game, the game ends when someone reaches 21 games. The game should also end when all of the playable cards have been played. The game may end sooner or later if you are playing a variation of the game. You can choose to make the end of the game be reached at 32 points."
                }
            ]
        },
        {
            "name": "Playing Variations of Pitch",
            "steps": [
                {
                    "headline": "Play with money.",
                    "description": "In this version of the game, players pay for ten cents a point. The players in this version play individually. There are no partners. Players can leave the game after any hand. Ten cents are received for each point that is above average. The players lose ten cents for each point they are below the average. The smudge bid (4 point bid) is called “shooting the moon” in this version of the game. One dollar is received for a successful attempt at shooting the moon."
                },
                {
                    "headline": "Play a cutthroat game.",
                    "description": "There aren’t any partners in this version of the game. Every person plays individually. This version is called “cutthroat” because players are allowed to gang up against the bidder. The goal is to prevent the bidder from making their bid. The players in the game should try to convince the bidder that their bid is not good. This can be done by intimidation, or by bluffing about the bid you are about to make. Make sure rules are set before the game. For example, determine is insults and swearing will be allowed."
                },
                {
                    "headline": "Choose to play another version of the money game.",
                    "description": "Another version of the money game is called “Racehorse.” It is usually played by five or more players that are playing for themselves. One dollar is received from each player for each successful bid that is made. If a bid fails, the player that made the losing bid pays one dollar to each player."
                }
            ]
        }
    ],
    "tyn": [
        "Standard 52-card deck",
        "3 to 7 players"
    ],
    "text": " Beginning the Game with Bidding Get at least three players together. Pitch requires at least three people, though you can play with more. Typically, a traditional game is played with partners. So, four players are ideal for this game. The dealer shuffles and then deals out six cards to each player. The dealer should hand out the cards in the pattern of 1, then 2, then 3 cards per deal. Evaluate your cards. Once the cards have been dealt, look at the cards you’ve been given. If you’re playing with a partner, look at the cards with your partner. The values for the cards are:\nTen: 10 points. Ace: 4 points. King: 3 points. Queen: 2 points. Jack: 1 point. Make bids. Every player must now make a bid. How much you bid corresponds to how much confidence you have in the hand you've been dealt. The bidding starts with the person to the left of the dealer, and goes in a circle. You can bid 2, 3, or 4 cards. The bid represents the number of points that you think you will get in this hand. If you aren't confident at all, you may pass, unless you are the last to bid (i.e. the dealer) and everyone else has passed, in which case you have to bid at least 2. Match the bids. Once someone has placed a bid, you have to match them, surpass them, or pass on your turn. For example, you cannot bid two if three has already been bid. The point of bidding is to figure out who is the most confident in their hand, because that is the person who is going to get to choose the trump suit. Know how the trump works. The points that you can get in pitch are these: high of trump, low of trump, jack of trump, and game. \"High\" is the highest trump card played, \"low\" is the lowest trump card played, \"jack\" is the jack of trump, and \"game\" has to do with how many face cards you end up with. Playing the Game Determine who has the highest trump. Which suit becomes trump depends on who bids the highest, because whoever bids the highest gets to throw down first. The first card that they throw down becomes the trump suit. Therefore, if you have the ace of spades, the two of spades, and the jack of spades, you probably want to bid four, because then you will get to make \"spades\" the trump suit and you will probably be able to get four points. Throw down the first card. Whoever bid the highest gets to throw down first. Whichever is the first card that they throw becomes the trump suit. Play continues to the left. Everyone throws down one card. The winner of the \"hand\" is the person who has thrown either the highest card in suit, or the highest trump card. Trump can be played anytime. Trump always beats \"in suit.\" Complete the first round. The winner of the hand is the player that puts down the trump card or the highest suit. The game continues on until everyone is out of cards. When everyone is out of cards (which should happen concurrently), the cards are tallied up to see who gets points. The winner of the round gets to take all of the cards that he has won. Hand out the points. If the highest initial bidder (the person who threw the trump at the beginning of the game) has come up with the points that they bid, he gets those points. If not, he gets negative of those points. Meanwhile, anyone else who scores points gets them free of charge (i.e., if the bidder bid 3, and he got high low and game, he gets 3 points). The person who got jack gets 1 point. If the bidder bid 3, and got high and low, he gets negative three points. Whoever got jack gets a point, whoever got game gets a point. Points are assigned as follows:\n1 point to the lowest trump card played. 1 point to the highest trump card played. 1 point to the jack of trump. 1 point to \"game.\" This is the person with the highest number, if you count the 10 card of any suit as 10 and each jack as 1, queen as 2, king as 3, ace as 4. Play until someone reaches 21 points. In a traditional game, the game ends when someone reaches 21 games. The game should also end when all of the playable cards have been played. The game may end sooner or later if you are playing a variation of the game. You can choose to make the end of the game be reached at 32 points. Playing Variations of Pitch Play with money. In this version of the game, players pay for ten cents a point. The players in this version play individually. There are no partners. Players can leave the game after any hand. Ten cents are received for each point that is above average. The players lose ten cents for each point they are below the average. The smudge bid (4 point bid) is called “shooting the moon” in this version of the game. One dollar is received for a successful attempt at shooting the moon. Play a cutthroat game. There aren’t any partners in this version of the game. Every person plays individually. This version is called “cutthroat” because players are allowed to gang up against the bidder. The goal is to prevent the bidder from making their bid. The players in the game should try to convince the bidder that their bid is not good. This can be done by intimidation, or by bluffing about the bid you are about to make. Make sure rules are set before the game. For example, determine is insults and swearing will be allowed. Choose to play another version of the money game. Another version of the money game is called “Racehorse.” It is usually played by five or more players that are playing for themselves. One dollar is received from each player for each successful bid that is made. If a bid fails, the player that made the losing bid pays one dollar to each player.",
    "sentences": [
        " Beginning the Game with Bidding Get at least three players together.",
        "Pitch requires at least three people, though you can play with more.",
        "Typically, a traditional game is played with partners.",
        "So, four players are ideal for this game.",
        "The dealer shuffles and then deals out six cards to each player.",
        "The dealer should hand out the cards in the pattern of 1, then 2, then 3 cards per deal.",
        "Evaluate your cards.",
        "Once the cards have been dealt, look at the cards you’ve been given.",
        "If you’re playing with a partner, look at the cards with your partner.",
        "The values for the cards are:\nTen: 10 points.",
        "Ace: 4 points.",
        "King: 3 points.",
        "Queen: 2 points.",
        "Jack: 1 point.",
        "Make bids.",
        "Every player must now make a bid.",
        "How much you bid corresponds to how much confidence you have in the hand you've been dealt.",
        "The bidding starts with the person to the left of the dealer, and goes in a circle.",
        "You can bid 2, 3, or 4 cards.",
        "The bid represents the number of points that you think you will get in this hand.",
        "If you aren't confident at all, you may pass, unless you are the last to bid (i.e.",
        "the dealer) and everyone else has passed, in which case you have to bid at least 2.",
        "Match the bids.",
        "Once someone has placed a bid, you have to match them, surpass them, or pass on your turn.",
        "For example, you cannot bid two if three has already been bid.",
        "The point of bidding is to figure out who is the most confident in their hand, because that is the person who is going to get to choose the trump suit.",
        "Know how the trump works.",
        "The points that you can get in pitch are these: high of trump, low of trump, jack of trump, and game.",
        "\"High\" is the highest trump card played, \"low\" is the lowest trump card played, \"jack\" is the jack of trump, and \"game\" has to do with how many face cards you end up with.",
        "Playing the Game Determine who has the highest trump.",
        "Which suit becomes trump depends on who bids the highest, because whoever bids the highest gets to throw down first.",
        "The first card that they throw down becomes the trump suit.",
        "Therefore, if you have the ace of spades, the two of spades, and the jack of spades, you probably want to bid four, because then you will get to make \"spades\" the trump suit and you will probably be able to get four points.",
        "Throw down the first card.",
        "Whoever bid the highest gets to throw down first.",
        "Whichever is the first card that they throw becomes the trump suit.",
        "Play continues to the left.",
        "Everyone throws down one card.",
        "The winner of the \"hand\" is the person who has thrown either the highest card in suit, or the highest trump card.",
        "Trump can be played anytime.",
        "Trump always beats \"in suit.\"",
        "Complete the first round.",
        "The winner of the hand is the player that puts down the trump card or the highest suit.",
        "The game continues on until everyone is out of cards.",
        "When everyone is out of cards (which should happen concurrently), the cards are tallied up to see who gets points.",
        "The winner of the round gets to take all of the cards that he has won.",
        "Hand out the points.",
        "If the highest initial bidder (the person who threw the trump at the beginning of the game) has come up with the points that they bid, he gets those points.",
        "If not, he gets negative of those points.",
        "Meanwhile, anyone else who scores points gets them free of charge (i.e., if the bidder bid 3, and he got high low and game, he gets 3 points).",
        "The person who got jack gets 1 point.",
        "If the bidder bid 3, and got high and low, he gets negative three points.",
        "Whoever got jack gets a point, whoever got game gets a point.",
        "Points are assigned as follows:\n1 point to the lowest trump card played.",
        "1 point to the highest trump card played.",
        "1 point to the jack of trump.",
        "1 point to \"game.\"",
        "This is the person with the highest number, if you count the 10 card of any suit as 10 and each jack as 1, queen as 2, king as 3, ace as 4.",
        "Play until someone reaches 21 points.",
        "In a traditional game, the game ends when someone reaches 21 games.",
        "The game should also end when all of the playable cards have been played.",
        "The game may end sooner or later if you are playing a variation of the game.",
        "You can choose to make the end of the game be reached at 32 points.",
        "Playing Variations of Pitch Play with money.",
        "In this version of the game, players pay for ten cents a point.",
        "The players in this version play individually.",
        "There are no partners.",
        "Players can leave the game after any hand.",
        "Ten cents are received for each point that is above average.",
        "The players lose ten cents for each point they are below the average.",
        "The smudge bid (4 point bid) is called “shooting the moon” in this version of the game.",
        "One dollar is received for a successful attempt at shooting the moon.",
        "Play a cutthroat game.",
        "There aren’t any partners in this version of the game.",
        "Every person plays individually.",
        "This version is called “cutthroat” because players are allowed to gang up against the bidder.",
        "The goal is to prevent the bidder from making their bid.",
        "The players in the game should try to convince the bidder that their bid is not good.",
        "This can be done by intimidation, or by bluffing about the bid you are about to make.",
        "Make sure rules are set before the game.",
        "For example, determine is insults and swearing will be allowed.",
        "Choose to play another version of the money game.",
        "Another version of the money game is called “Racehorse.” It is usually played by five or more players that are playing for themselves.",
        "One dollar is received from each player for each successful bid that is made.",
        "If a bid fails, the player that made the losing bid pays one dollar to each player."
    ]
}