{
    "title": "How to Start up a Diabolo (Chinese Yo Yo)",
    "url": "https://www.wikihow.com/Start-up-a-Diabolo-(Chinese-Yo-Yo)",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "String Games"
    ],
    "steps": [
        {
            "headline": "If you are right-handed, follow the instructions precisely.",
            "description": "If you are left handed, reverse the handedness of the instructions."
        },
        {
            "headline": "Place the diabolo down on the ground directly in front of you.",
            "description": "Put the string under the axle (the metal bit)."
        },
        {
            "headline": "Roll the diabolo over to your right foot, and let it stop.",
            "description": "Then roll it over to the left or just back and forth, and lift the sticks into the air when it reaches the foot. This gives the diabolo initial rotational momentum that stabilizes it when you lift it into the air."
        },
        {
            "headline": "Before it stops spinning, move the right stick up and down in a \"hitting\" motion.",
            "description": "Try to imagine cutting a carrot with a kitchen knife. Try to keep this up as long as possible without the diabolo falling off."
        },
        {
            "headline": "The diabolo will naturally tilt away from or toward you.",
            "description": "Do not fret; this is easily controlled. If the diabolo is tilting towards you, move your right hand forward. If it is tilting away from you, move your right hand back. Do this while continuing to move the right stick up and down. This works by pushing against the top of the diabolo with the string."
        },
        {
            "headline": "The diabolo naturally tends to unbalance until you learn to keep it at consistent high speeds.",
            "description": "Until then, you can rectify the balance of the diabolo by moving the right stick it the opposite direction diabolo is leaning. For example, if it's leaning forward, bring the stick backwards."
        },
        {
            "headline": "When you can keep the diabolo level and with reasonable speed, try learning to throw and catch it.",
            "description": "This is done by simply pulling the two hand sticks apart rapidly, causing the diabolo to fly up. To catch, simply position the string underneath the axle of the diabolo."
        }
    ],
    "tyn": [
        "2 sticks tied together at opposite ends of string(strong so it won't rip apart). the string length should reach from the ground up to your shoulder.",
        "a diabolo (preferably rubber).  Larger and heavier diabolos are easier to start with, although larger and lighter diabolos are easiest for many tricks.",
        "Buy Diabolo & Juggling Equipment"
    ],
    "text": " If you are right-handed, follow the instructions precisely. If you are left handed, reverse the handedness of the instructions. Place the diabolo down on the ground directly in front of you. Put the string under the axle (the metal bit). Roll the diabolo over to your right foot, and let it stop. Then roll it over to the left or just back and forth, and lift the sticks into the air when it reaches the foot. This gives the diabolo initial rotational momentum that stabilizes it when you lift it into the air. Before it stops spinning, move the right stick up and down in a \"hitting\" motion. Try to imagine cutting a carrot with a kitchen knife. Try to keep this up as long as possible without the diabolo falling off. The diabolo will naturally tilt away from or toward you. Do not fret; this is easily controlled. If the diabolo is tilting towards you, move your right hand forward. If it is tilting away from you, move your right hand back. Do this while continuing to move the right stick up and down. This works by pushing against the top of the diabolo with the string. The diabolo naturally tends to unbalance until you learn to keep it at consistent high speeds. Until then, you can rectify the balance of the diabolo by moving the right stick it the opposite direction diabolo is leaning. For example, if it's leaning forward, bring the stick backwards. When you can keep the diabolo level and with reasonable speed, try learning to throw and catch it. This is done by simply pulling the two hand sticks apart rapidly, causing the diabolo to fly up. To catch, simply position the string underneath the axle of the diabolo.",
    "sentences": [
        " If you are right-handed, follow the instructions precisely.",
        "If you are left handed, reverse the handedness of the instructions.",
        "Place the diabolo down on the ground directly in front of you.",
        "Put the string under the axle (the metal bit).",
        "Roll the diabolo over to your right foot, and let it stop.",
        "Then roll it over to the left or just back and forth, and lift the sticks into the air when it reaches the foot.",
        "This gives the diabolo initial rotational momentum that stabilizes it when you lift it into the air.",
        "Before it stops spinning, move the right stick up and down in a \"hitting\" motion.",
        "Try to imagine cutting a carrot with a kitchen knife.",
        "Try to keep this up as long as possible without the diabolo falling off.",
        "The diabolo will naturally tilt away from or toward you.",
        "Do not fret; this is easily controlled.",
        "If the diabolo is tilting towards you, move your right hand forward.",
        "If it is tilting away from you, move your right hand back.",
        "Do this while continuing to move the right stick up and down.",
        "This works by pushing against the top of the diabolo with the string.",
        "The diabolo naturally tends to unbalance until you learn to keep it at consistent high speeds.",
        "Until then, you can rectify the balance of the diabolo by moving the right stick it the opposite direction diabolo is leaning.",
        "For example, if it's leaning forward, bring the stick backwards.",
        "When you can keep the diabolo level and with reasonable speed, try learning to throw and catch it.",
        "This is done by simply pulling the two hand sticks apart rapidly, causing the diabolo to fly up.",
        "To catch, simply position the string underneath the axle of the diabolo."
    ]
}