{
    "title": "How to Ring Up Fruit on a Walmart Self Checkout Register",
    "url": "https://www.wikihow.com/Ring-Up-Fruit-on-a-Walmart-Self-Checkout-Register",
    "category_hierarchy": [
        "Finance and Business",
        "Shopping",
        "Retail Self Checkouts"
    ],
    "steps": [
        {
            "headline": "Proceed up to and ring up all items on the Walmart Self Checkout register.",
            "description": "Scan in all the items that have barcodes and that don't need additional lookup or weight measuring to proceed."
        },
        {
            "headline": "Look down at the first piece of fruit you'll need to ring up.",
            "description": "You'll see a sticker on it. The sticker will have a number that is marked starting with the character \"#\"."
        },
        {
            "headline": "Place the item onto the scanner's scale with the sticker facing up.",
            "description": "Don't allow any other item to be placed on the scale, otherwise you'll end up paying for more than what the weight really was on the item."
        },
        {
            "headline": "Press the \"Fresh Produce Lookup\" button to open a list of items you can choose from.",
            "description": ""
        },
        {
            "headline": "Press the \"Key in Code\" button (which should also contain a 10-digit keypad looking icon on same said button).",
            "description": ""
        },
        {
            "headline": "Touch each number on the screen that corresponds to each number on the piece of fruit.",
            "description": ""
        },
        {
            "headline": "Press the OK button to ring up that piece completely.",
            "description": ""
        },
        {
            "headline": "Remove the piece of fruit from the scale, and place it into the bag.",
            "description": ""
        },
        {
            "headline": "Ring up any other pieces of fruit that may still be existing in your shopping cart or shopping basket.",
            "description": ""
        },
        {
            "headline": "Press the \"Checkout\" Purchase button to complete the purchase.",
            "description": ""
        }
    ],
    "tyn": [
        "Fruits of any type at Walmart (any quantity will work)",
        "Walmart Self-checkout register"
    ],
    "text": " Proceed up to and ring up all items on the Walmart Self Checkout register. Scan in all the items that have barcodes and that don't need additional lookup or weight measuring to proceed. Look down at the first piece of fruit you'll need to ring up. You'll see a sticker on it. The sticker will have a number that is marked starting with the character \"#\". Place the item onto the scanner's scale with the sticker facing up. Don't allow any other item to be placed on the scale, otherwise you'll end up paying for more than what the weight really was on the item. Press the \"Fresh Produce Lookup\" button to open a list of items you can choose from.  Press the \"Key in Code\" button (which should also contain a 10-digit keypad looking icon on same said button).  Touch each number on the screen that corresponds to each number on the piece of fruit.  Press the OK button to ring up that piece completely.  Remove the piece of fruit from the scale, and place it into the bag.  Ring up any other pieces of fruit that may still be existing in your shopping cart or shopping basket.  Press the \"Checkout\" Purchase button to complete the purchase. ",
    "sentences": [
        " Proceed up to and ring up all items on the Walmart Self Checkout register.",
        "Scan in all the items that have barcodes and that don't need additional lookup or weight measuring to proceed.",
        "Look down at the first piece of fruit you'll need to ring up.",
        "You'll see a sticker on it.",
        "The sticker will have a number that is marked starting with the character \"#\".",
        "Place the item onto the scanner's scale with the sticker facing up.",
        "Don't allow any other item to be placed on the scale, otherwise you'll end up paying for more than what the weight really was on the item.",
        "Press the \"Fresh Produce Lookup\" button to open a list of items you can choose from.",
        "Press the \"Key in Code\" button (which should also contain a 10-digit keypad looking icon on same said button).",
        "Touch each number on the screen that corresponds to each number on the piece of fruit.",
        "Press the OK button to ring up that piece completely.",
        "Remove the piece of fruit from the scale, and place it into the bag.",
        "Ring up any other pieces of fruit that may still be existing in your shopping cart or shopping basket.",
        "Press the \"Checkout\" Purchase button to complete the purchase."
    ]
}