{
    "title": "How to De Haze a Photo with GIMP",
    "url": "https://www.wikihow.com/De-Haze-a-Photo-with-GIMP",
    "category_hierarchy": [
        "Computers and Electronics",
        "Software",
        "Graphics"
    ],
    "steps": [
        {
            "headline": "Try the easy way first.",
            "description": "Go to the Colors -> Auto -> White Balance menu. More often than not, this will fix haziness and color casts sufficiently well. The rest of this article is only relevant if this has unusual effects."
        },
        {
            "headline": "Bring up the Levels dialog with the menu Colors -> Levels.",
            "description": ""
        },
        {
            "headline": "Observe the \"dead spots\" in the histogram.",
            "description": "The histogram will show areas on the left and right which are \"flat-lined\", or close to it. Move the sliding arrow on the left past the dead spot on the left, and likewise for the arrow on the right. If there are colour casts on the image (e.g. if the original has, for example, a red haze) then don't hit OK yet; go on to the next step)."
        },
        {
            "headline": "Fix any colour casts.",
            "description": "At the top of the Levels dialog that you opened, you'll notice a drop-down box (labeled Channel), with three options: Value, Red, Green, and Blue. Pick whichever of the latter three matches the color cast of your image. Again, you will see a \"dead spot\" towards the left hand side; move the slider past this dead spot. You can be pretty aggressive about doing this. Do the same on the right hand side, but be more judicious about it. You may find that you need to repeat this on the other channels, as well. Hit \"OK\"."
        },
        {
            "headline": "Apply lots of \"Unsharp Mask\".",
            "description": "Go to Filters -> Enhance -> Unsharp Mask. Use a very large radius (50px or more), and a relatively small \"Amount\" (somewhere between 0.10 to 0.20 should suffice). After that, optionally, apply another pass of Unsharp Mask at something close to its default settings (with \"Radius\" set to 5px, \"Amount\" set to .50; you may want to set \"Threshold\" to a non-zero value to avoid bringing out too much noise), to sharpen the image a little."
        },
        {
            "headline": "Admire the finished picture.",
            "description": "Or if the editing still didn't have the desired effect, experiment further until you get it right."
        }
    ],
    "tyn": [
        "The GIMP",
        ".",
        "A hazy photograph."
    ],
    "text": " Try the easy way first. Go to the Colors -> Auto -> White Balance menu. More often than not, this will fix haziness and color casts sufficiently well. The rest of this article is only relevant if this has unusual effects. Bring up the Levels dialog with the menu Colors -> Levels.  Observe the \"dead spots\" in the histogram. The histogram will show areas on the left and right which are \"flat-lined\", or close to it. Move the sliding arrow on the left past the dead spot on the left, and likewise for the arrow on the right. If there are colour casts on the image (e.g. if the original has, for example, a red haze) then don't hit OK yet; go on to the next step). Fix any colour casts. At the top of the Levels dialog that you opened, you'll notice a drop-down box (labeled Channel), with three options: Value, Red, Green, and Blue. Pick whichever of the latter three matches the color cast of your image. Again, you will see a \"dead spot\" towards the left hand side; move the slider past this dead spot. You can be pretty aggressive about doing this. Do the same on the right hand side, but be more judicious about it. You may find that you need to repeat this on the other channels, as well. Hit \"OK\". Apply lots of \"Unsharp Mask\". Go to Filters -> Enhance -> Unsharp Mask. Use a very large radius (50px or more), and a relatively small \"Amount\" (somewhere between 0.10 to 0.20 should suffice). After that, optionally, apply another pass of Unsharp Mask at something close to its default settings (with \"Radius\" set to 5px, \"Amount\" set to .50; you may want to set \"Threshold\" to a non-zero value to avoid bringing out too much noise), to sharpen the image a little. Admire the finished picture. Or if the editing still didn't have the desired effect, experiment further until you get it right.",
    "sentences": [
        " Try the easy way first.",
        "Go to the Colors -> Auto -> White Balance menu.",
        "More often than not, this will fix haziness and color casts sufficiently well.",
        "The rest of this article is only relevant if this has unusual effects.",
        "Bring up the Levels dialog with the menu Colors -> Levels.",
        "Observe the \"dead spots\" in the histogram.",
        "The histogram will show areas on the left and right which are \"flat-lined\", or close to it.",
        "Move the sliding arrow on the left past the dead spot on the left, and likewise for the arrow on the right.",
        "If there are colour casts on the image (e.g.",
        "if the original has, for example, a red haze) then don't hit OK yet; go on to the next step).",
        "Fix any colour casts.",
        "At the top of the Levels dialog that you opened, you'll notice a drop-down box (labeled Channel), with three options: Value, Red, Green, and Blue.",
        "Pick whichever of the latter three matches the color cast of your image.",
        "Again, you will see a \"dead spot\" towards the left hand side; move the slider past this dead spot.",
        "You can be pretty aggressive about doing this.",
        "Do the same on the right hand side, but be more judicious about it.",
        "You may find that you need to repeat this on the other channels, as well.",
        "Hit \"OK\".",
        "Apply lots of \"Unsharp Mask\".",
        "Go to Filters -> Enhance -> Unsharp Mask.",
        "Use a very large radius (50px or more), and a relatively small \"Amount\" (somewhere between 0.10 to 0.20 should suffice).",
        "After that, optionally, apply another pass of Unsharp Mask at something close to its default settings (with \"Radius\" set to 5px, \"Amount\" set to .50; you may want to set \"Threshold\" to a non-zero value to avoid bringing out too much noise), to sharpen the image a little.",
        "Admire the finished picture.",
        "Or if the editing still didn't have the desired effect, experiment further until you get it right."
    ]
}