{
    "title": "How to Take a Screenshot of the Entire Screen",
    "url": "https://www.wikihow.com/Take-a-Screenshot-of-the-Entire-Screen",
    "category_hierarchy": [
        "Computers and Electronics",
        "Software",
        "Graphics",
        "Screenshots"
    ],
    "methods": [
        {
            "name": "Taking Screenshots on Windows Computers",
            "steps": [
                {
                    "headline": "Find a key on your keyboard labeled \"Prt Sc\".",
                    "description": "This stands for \"Print Screen,\" and pressing this button saves an image of your screen to your clipboard. This is similar to clicking \"copy\" on a picture. The button is usually in the upper-righthand corner of your keyboard, above \"Backspace.\" Press \"Prt Sc\" once to take a picture of your current screen. If you hold the \"Alt\" key while doing this it will take a picture of just the window you are using, such as your internet browser. So if you want a shot of only your internet browser, click into that window and press Alt & Prt Sc keys together."
                },
                {
                    "headline": "Open Microsoft Paint.",
                    "description": "(Microsoft office word may also work) This free program comes pre-installed on every Windows computer, and it allows you to paste your screenshot and edit it if you'd like. You can find paint through the Start Menu. Click \"All Programs\" → \"Accessories\" → \"Paint\" to open it. You may use any program that allows you to paste images -- Photoshop, Microsoft Word, InDesign -- but Paint is the simplest and fastest way to save a screenshot."
                },
                {
                    "headline": "Click \"Paste\" to view your screenshot.",
                    "description": "The paste button is in the upper left corner of Microsoft Paint, but you can also press the CTRL and V keys simultaneously to paste."
                },
                {
                    "headline": "Save your screenshot.",
                    "description": "You can now save your screenshot through Paint. Click the small purple save button (it looks like a purple floppy disc) or press CTRL and S simultaneously. You will be given a chance to name the picture and choose the image quality."
                },
                {
                    "headline": "Alternatively, use the Snipping Tool on Windows Vista, 7, or 8.",
                    "description": "Microsoft put a small tool on every windows machine that lets you take custom screenshots. In the start menu, search for \"Snipping Tool\" to find the program. From here, you can create a custom sized screenshot and save it directly through the Snipping Tool program:\nClick \"New\"\nClick and drag over the area you want a picture of. Click \"Save Snip\" (square, purple floppy disc button)."
                }
            ]
        },
        {
            "name": "Mac OS X",
            "steps": [
                {
                    "headline": "Press the Command (\"Apple\"), Shift and 3 keys simultaneously.",
                    "description": "An image of the entire desktop picture will be saved on your desktop named \"Screen shot\" with the date and time included in the file name."
                },
                {
                    "headline": "To capture a selected area, press the Command (\"Apple\"), Shift and the \"4\" keys.",
                    "description": "This will turn your cursor into a small cross. Once the cross pops up, you can click and drag over the image as you wish to save."
                },
                {
                    "headline": "Open the image file edit it.",
                    "description": "You can double click on the image file on your desktop to open it. From there you can edit it, crop it, or rename it with your favorite program. If you click on the name and let the mouse hover over it, you can rename the picture right on your desktop."
                }
            ]
        },
        {
            "name": "Other Methods for Capturing Screenshots",
            "steps": [
                {
                    "headline": "Use GIMP to take a screenshot any time.",
                    "description": "GIMP is a free and open-source photo editor, and it has a built-in screenshot function. There are two ways to take a screenshot while in GIMP. Click \"File,\" → \"Create\" → \"Screenshot. Press the Shift and F12 keys simultaneously."
                },
                {
                    "headline": "Take a screenshot on Linux with the GNOME Desktop.",
                    "description": "While the \"Prt Sc\" method discussed in the Windows section usually works on Linux, the OS has a few other ways to take screenshots with more options:\nClick on \"Applications\"\nClick on \"Accessories\" and find \"Take Screenshot.\" You will have a variety of options, from screen size to setting up a delay."
                },
                {
                    "headline": "Take an iPhone screenshot by pressing the Home and Power Buttons at once.",
                    "description": "If you press the two buttons simultaneously you'll see a bright flash and your picture will be saved in your Photos, where you can access it anytime."
                },
                {
                    "headline": "Take an Android Phone Screenshot by pressing the Volume and Power buttons at once.",
                    "description": "Many Android phones also offer a \"Screenshot\" option when you click the Power button as well. Android phones running the Ice Cream Sandwich 4.0 Operating System can do this, but not anything older. Phones without this capability can download an app from the Google Play Store. Search for \"Screenshot\" and download your favorite free app."
                }
            ]
        }
    ],
    "tyn": [
        "Computer"
    ],
    "text": " Taking Screenshots on Windows Computers Find a key on your keyboard labeled \"Prt Sc\". This stands for \"Print Screen,\" and pressing this button saves an image of your screen to your clipboard. This is similar to clicking \"copy\" on a picture. The button is usually in the upper-righthand corner of your keyboard, above \"Backspace.\" Press \"Prt Sc\" once to take a picture of your current screen. If you hold the \"Alt\" key while doing this it will take a picture of just the window you are using, such as your internet browser. So if you want a shot of only your internet browser, click into that window and press Alt & Prt Sc keys together. Open Microsoft Paint. (Microsoft office word may also work) This free program comes pre-installed on every Windows computer, and it allows you to paste your screenshot and edit it if you'd like. You can find paint through the Start Menu. Click \"All Programs\" → \"Accessories\" → \"Paint\" to open it. You may use any program that allows you to paste images -- Photoshop, Microsoft Word, InDesign -- but Paint is the simplest and fastest way to save a screenshot. Click \"Paste\" to view your screenshot. The paste button is in the upper left corner of Microsoft Paint, but you can also press the CTRL and V keys simultaneously to paste. Save your screenshot. You can now save your screenshot through Paint. Click the small purple save button (it looks like a purple floppy disc) or press CTRL and S simultaneously. You will be given a chance to name the picture and choose the image quality. Alternatively, use the Snipping Tool on Windows Vista, 7, or 8. Microsoft put a small tool on every windows machine that lets you take custom screenshots. In the start menu, search for \"Snipping Tool\" to find the program. From here, you can create a custom sized screenshot and save it directly through the Snipping Tool program:\nClick \"New\"\nClick and drag over the area you want a picture of. Click \"Save Snip\" (square, purple floppy disc button). Mac OS X Press the Command (\"Apple\"), Shift and 3 keys simultaneously. An image of the entire desktop picture will be saved on your desktop named \"Screen shot\" with the date and time included in the file name. To capture a selected area, press the Command (\"Apple\"), Shift and the \"4\" keys. This will turn your cursor into a small cross. Once the cross pops up, you can click and drag over the image as you wish to save. Open the image file edit it. You can double click on the image file on your desktop to open it. From there you can edit it, crop it, or rename it with your favorite program. If you click on the name and let the mouse hover over it, you can rename the picture right on your desktop. Other Methods for Capturing Screenshots Use GIMP to take a screenshot any time. GIMP is a free and open-source photo editor, and it has a built-in screenshot function. There are two ways to take a screenshot while in GIMP. Click \"File,\" → \"Create\" → \"Screenshot. Press the Shift and F12 keys simultaneously. Take a screenshot on Linux with the GNOME Desktop. While the \"Prt Sc\" method discussed in the Windows section usually works on Linux, the OS has a few other ways to take screenshots with more options:\nClick on \"Applications\"\nClick on \"Accessories\" and find \"Take Screenshot.\" You will have a variety of options, from screen size to setting up a delay. Take an iPhone screenshot by pressing the Home and Power Buttons at once. If you press the two buttons simultaneously you'll see a bright flash and your picture will be saved in your Photos, where you can access it anytime. Take an Android Phone Screenshot by pressing the Volume and Power buttons at once. Many Android phones also offer a \"Screenshot\" option when you click the Power button as well. Android phones running the Ice Cream Sandwich 4.0 Operating System can do this, but not anything older. Phones without this capability can download an app from the Google Play Store. Search for \"Screenshot\" and download your favorite free app.",
    "sentences": [
        " Taking Screenshots on Windows Computers Find a key on your keyboard labeled \"Prt Sc\".",
        "This stands for \"Print Screen,\" and pressing this button saves an image of your screen to your clipboard.",
        "This is similar to clicking \"copy\" on a picture.",
        "The button is usually in the upper-righthand corner of your keyboard, above \"Backspace.\"",
        "Press \"Prt Sc\" once to take a picture of your current screen.",
        "If you hold the \"Alt\" key while doing this it will take a picture of just the window you are using, such as your internet browser.",
        "So if you want a shot of only your internet browser, click into that window and press Alt & Prt Sc keys together.",
        "Open Microsoft Paint.",
        "(Microsoft office word may also work) This free program comes pre-installed on every Windows computer, and it allows you to paste your screenshot and edit it if you'd like.",
        "You can find paint through the Start Menu.",
        "Click \"All Programs\" → \"Accessories\" → \"Paint\" to open it.",
        "You may use any program that allows you to paste images -- Photoshop, Microsoft Word, InDesign -- but Paint is the simplest and fastest way to save a screenshot.",
        "Click \"Paste\" to view your screenshot.",
        "The paste button is in the upper left corner of Microsoft Paint, but you can also press the CTRL and V keys simultaneously to paste.",
        "Save your screenshot.",
        "You can now save your screenshot through Paint.",
        "Click the small purple save button (it looks like a purple floppy disc) or press CTRL and S simultaneously.",
        "You will be given a chance to name the picture and choose the image quality.",
        "Alternatively, use the Snipping Tool on Windows Vista, 7, or 8.",
        "Microsoft put a small tool on every windows machine that lets you take custom screenshots.",
        "In the start menu, search for \"Snipping Tool\" to find the program.",
        "From here, you can create a custom sized screenshot and save it directly through the Snipping Tool program:\nClick \"New\"\nClick and drag over the area you want a picture of.",
        "Click \"Save Snip\" (square, purple floppy disc button).",
        "Mac OS X Press the Command (\"Apple\"), Shift and 3 keys simultaneously.",
        "An image of the entire desktop picture will be saved on your desktop named \"Screen shot\" with the date and time included in the file name.",
        "To capture a selected area, press the Command (\"Apple\"), Shift and the \"4\" keys.",
        "This will turn your cursor into a small cross.",
        "Once the cross pops up, you can click and drag over the image as you wish to save.",
        "Open the image file edit it.",
        "You can double click on the image file on your desktop to open it.",
        "From there you can edit it, crop it, or rename it with your favorite program.",
        "If you click on the name and let the mouse hover over it, you can rename the picture right on your desktop.",
        "Other Methods for Capturing Screenshots Use GIMP to take a screenshot any time.",
        "GIMP is a free and open-source photo editor, and it has a built-in screenshot function.",
        "There are two ways to take a screenshot while in GIMP.",
        "Click \"File,\" → \"Create\" → \"Screenshot.",
        "Press the Shift and F12 keys simultaneously.",
        "Take a screenshot on Linux with the GNOME Desktop.",
        "While the \"Prt Sc\" method discussed in the Windows section usually works on Linux, the OS has a few other ways to take screenshots with more options:\nClick on \"Applications\"\nClick on \"Accessories\" and find \"Take Screenshot.\"",
        "You will have a variety of options, from screen size to setting up a delay.",
        "Take an iPhone screenshot by pressing the Home and Power Buttons at once.",
        "If you press the two buttons simultaneously you'll see a bright flash and your picture will be saved in your Photos, where you can access it anytime.",
        "Take an Android Phone Screenshot by pressing the Volume and Power buttons at once.",
        "Many Android phones also offer a \"Screenshot\" option when you click the Power button as well.",
        "Android phones running the Ice Cream Sandwich 4.0 Operating System can do this, but not anything older.",
        "Phones without this capability can download an app from the Google Play Store.",
        "Search for \"Screenshot\" and download your favorite free app."
    ]
}