{
    "title": "How to Play Volleyball Like a Star",
    "url": "https://www.wikihow.com/Play-Volleyball-Like-a-Star",
    "category_hierarchy": [
        "Sports and Fitness",
        "Team Sports",
        "Volleyball"
    ],
    "methods": [
        {
            "name": "Steps",
            "steps": [
                {
                    "headline": "Keep up a good attitude.",
                    "description": ""
                },
                {
                    "headline": "Don't complain at practice.",
                    "description": "Do what the coach tells you; they know what they're doing. Even when you feel like your legs are about to fall off from all the conditioning, keep doing it. It will pay off in the long run and after all of the pain it will get easier and easier."
                },
                {
                    "headline": "Practice, practice, practice.",
                    "description": "Practice at your house by bumping, serving, setting, and hitting on your wall. You can randomly do your approach and jump as high as possible to practice blocking. And give your best effort at practice; put your all in it."
                }
            ]
        },
        {
            "name": "Passing or Bumping",
            "steps": [
                {
                    "headline": "Position.",
                    "description": "To bump, you'll need to squat until it looks like you're sitting on a chair. Stick your butt out so it goes past your heels, and straighten your back. Your posture is correct!"
                },
                {
                    "headline": "Hands and arms.",
                    "description": "Make a fist with your dominant hand. Cup your opposite hand around that one. Don't cross your thumbs, but keep them parallel to one another. Straighten your arms out. Feel the flat part of your forearms (smooth inside part). This is where the ball will make contact."
                },
                {
                    "headline": "How to do this move.",
                    "description": "This is one of the most crucial and most used moves in volleyball. Move your feet to square up with the ball. When it is almost touching your arms, take a step forward, hitting the ball with your arms, or platform (flat part of arms). DO NOT SWING. Use your legs to push up and out to target, and your arms should just move with them. Don't swing your arms more than 2 inches (5.1 cm). Passing may sting. An easy way to keep from stinging is to simply shrug your shoulders when you hit the ball."
                }
            ]
        },
        {
            "name": "How to Set",
            "steps": [
                {
                    "headline": "Position.",
                    "description": "To set, you'll need to lean forward a bit, but only a little. Bend your knees slightly. Be ready to push up, and straighten your legs and your power source."
                },
                {
                    "headline": "Hands and arms.",
                    "description": "Bend your elbows at an angle. Put your index and thumb fingers so they are almost touching their opposites. There should be a spade-type space between. Place hands so thumbs are close to the forehead's hairline."
                },
                {
                    "headline": "How to do this move.",
                    "description": "Your knees and limbs are bent at the above angles or amounts. When the ball comes, flick it up and forwards. Be sure to push off from your legs and ankles. This move is very difficult for some to master-so don't worry if you can't do this! If you're a/the setter, you play an important role and need to practice setting more than others."
                }
            ]
        },
        {
            "name": "Spiking",
            "steps": [
                {
                    "headline": "Position.",
                    "description": "This move has many positions. At the 10 foot (3.0 m) line, begin with your non-dominant foot front. Say you are right handed. Have your right foot back, and your left front. Step left, and then right left. On left, swing your arms up, as you bend. You'll need to use your legs and knees for power."
                },
                {
                    "headline": "Hands and arms.",
                    "description": "Swing your arms up as if blocking when you jump to hit. Swing your arm through like a crane, 'scooping' as you finish. As you hit the ball, snap your wrist down so the ball hits the floor."
                },
                {
                    "headline": "Do this move.",
                    "description": "Altogether, you should do this. Step Left, right left, jump like your blocking, and scoop."
                }
            ]
        },
        {
            "name": "Serving: Underhand",
            "steps": [
                {
                    "headline": "Position.",
                    "description": "Serving underhand, crouch your body down as if you were going to bump. Have your right foot slightly in front of left. Make sure you're not standing up straight."
                },
                {
                    "headline": "Hands and arms.",
                    "description": "Say you are right handed. Hold the ball out in front of you in your left hand. Pick a patch on the ball to hit. Make your right hand into a fist. Swing your arm back to shoulder height, and propel it forward like a pendulum. Some people prefer to hit it on the part of their arm where they bump it, because it can give more control, but it doesn't give as much power. Do what works best for you."
                },
                {
                    "headline": "Do this move.",
                    "description": "Crouch, aim, and propel. That was easy, right? Make sure you don't bounce, throw the ball before, then hit it (you'll take out a ceiling light). You just need to hold onto it."
                }
            ]
        },
        {
            "name": "Serving: Overhand",
            "steps": [
                {
                    "headline": "Position.",
                    "description": "To overhand serve, it is an easy, four step piece. You'll first need to have your left foot slightly in front of right foot. The rest is in the next section."
                },
                {
                    "headline": "Hands and Arms.",
                    "description": "Do this move. (2 part) Step 1, your position; have your left foot forward. Hold the ball directly in front of you at chest height, arm length away. Step 2, bring back your right arm like your hand is going to touch your ear. Step 3, keeping left arm straight, toss the ball up about a foot  above your head. Toss it a little bit forward, but not so much you can't reach it. Step 4, step forward with right leg, and hit the ball as you step. If you aren't strong, do it with your fist instead of flat handed; some coaches don't allow their team to do it with their fist, though."
                }
            ]
        },
        {
            "name": "Blocking",
            "steps": [
                {
                    "headline": "Position.",
                    "description": "Blocking is very easy. Blockers should be cocked and ready to jump up. Generally, you should be half an arms length away, off from the net. Watch the ball and then jump. When you are in the air, do following steps."
                },
                {
                    "headline": "Hands and arms.",
                    "description": "Swing your arms up to get height. Hold your arms straight, hands stiff. When the ball comes over, just touch the ball, keeping hands stiff, with your palms. Even if you aren't as tall as the net, just getting a glimpse of an emerging body will scare them and throw the opposing team off. Do this every play, even for just a bump."
                },
                {
                    "headline": "Do this move.",
                    "description": "Keep your hands up at your shoulders. After you jump, penetrate the net with your hands and hold stiff against ball. If your fingers are not stiff, you can risk hyper-extension injury and the ball will go past your fingers."
                }
            ]
        },
        {
            "name": "Diving\\/Saving Net Balls",
            "steps": [
                {
                    "headline": "Position.",
                    "description": "Saving a ball from the net is easy, if you have great reflexes. When the ball hits the middle of the net and bounces back, run and penguin slide to the ball at last resort if you cannot get to it in time. NEVER slide on your knee pads as this is harmful to your knees."
                },
                {
                    "headline": "Hands and arms.",
                    "description": "Set up like you are going to bump, but not until the last second. Then, shrug and hit."
                },
                {
                    "headline": "Do this move, watch the ball hit the net.",
                    "description": "Run, slide, and bump. Try to bump it behind you for another teammate to hit over. Do this by bring your arms farther back (like a miniature swing of the arms), or arching your back as you make contact with the ball."
                }
            ]
        },
        {
            "name": "How to Hit a Ball Along the Net",
            "steps": [
                {
                    "headline": "Do this when your setter has set the ball and you go to hit it but it's too close to the net for you to spike.",
                    "description": ""
                },
                {
                    "headline": "Turn sideways, with your shoulders aligned to the net.",
                    "description": ""
                },
                {
                    "headline": "Bump like you would to hit a ball from the side.",
                    "description": "Lift up a lot more than out, though, and only lift out a bit."
                }
            ]
        },
        {
            "name": "Every Day Conditioning Routine",
            "steps": [
                {
                    "headline": "Jump rope 20 times.",
                    "description": ""
                },
                {
                    "headline": "Run to the end of the room or an area about the size of a volleyball court once and back.",
                    "description": "Jump rope 20 more times."
                },
                {
                    "headline": "Do 10 push ups.",
                    "description": "30 jumping jacks. Jump rope 20 times."
                }
            ]
        }
    ],
    "tyn": [
        "Volleyball and knee pads",
        "Determination",
        "At least 30 minutes every other day",
        "Water to keep hydrated"
    ],
    "text": " Steps Keep up a good attitude.  Don't complain at practice. Do what the coach tells you; they know what they're doing. Even when you feel like your legs are about to fall off from all the conditioning, keep doing it. It will pay off in the long run and after all of the pain it will get easier and easier. Practice, practice, practice. Practice at your house by bumping, serving, setting, and hitting on your wall. You can randomly do your approach and jump as high as possible to practice blocking. And give your best effort at practice; put your all in it. Passing or Bumping Position. To bump, you'll need to squat until it looks like you're sitting on a chair. Stick your butt out so it goes past your heels, and straighten your back. Your posture is correct! Hands and arms. Make a fist with your dominant hand. Cup your opposite hand around that one. Don't cross your thumbs, but keep them parallel to one another. Straighten your arms out. Feel the flat part of your forearms (smooth inside part). This is where the ball will make contact. How to do this move. This is one of the most crucial and most used moves in volleyball. Move your feet to square up with the ball. When it is almost touching your arms, take a step forward, hitting the ball with your arms, or platform (flat part of arms). DO NOT SWING. Use your legs to push up and out to target, and your arms should just move with them. Don't swing your arms more than 2 inches (5.1 cm). Passing may sting. An easy way to keep from stinging is to simply shrug your shoulders when you hit the ball. How to Set Position. To set, you'll need to lean forward a bit, but only a little. Bend your knees slightly. Be ready to push up, and straighten your legs and your power source. Hands and arms. Bend your elbows at an angle. Put your index and thumb fingers so they are almost touching their opposites. There should be a spade-type space between. Place hands so thumbs are close to the forehead's hairline. How to do this move. Your knees and limbs are bent at the above angles or amounts. When the ball comes, flick it up and forwards. Be sure to push off from your legs and ankles. This move is very difficult for some to master-so don't worry if you can't do this! If you're a/the setter, you play an important role and need to practice setting more than others. Spiking Position. This move has many positions. At the 10 foot (3.0 m) line, begin with your non-dominant foot front. Say you are right handed. Have your right foot back, and your left front. Step left, and then right left. On left, swing your arms up, as you bend. You'll need to use your legs and knees for power. Hands and arms. Swing your arms up as if blocking when you jump to hit. Swing your arm through like a crane, 'scooping' as you finish. As you hit the ball, snap your wrist down so the ball hits the floor. Do this move. Altogether, you should do this. Step Left, right left, jump like your blocking, and scoop. Serving: Underhand Position. Serving underhand, crouch your body down as if you were going to bump. Have your right foot slightly in front of left. Make sure you're not standing up straight. Hands and arms. Say you are right handed. Hold the ball out in front of you in your left hand. Pick a patch on the ball to hit. Make your right hand into a fist. Swing your arm back to shoulder height, and propel it forward like a pendulum. Some people prefer to hit it on the part of their arm where they bump it, because it can give more control, but it doesn't give as much power. Do what works best for you. Do this move. Crouch, aim, and propel. That was easy, right? Make sure you don't bounce, throw the ball before, then hit it (you'll take out a ceiling light). You just need to hold onto it. Serving: Overhand Position. To overhand serve, it is an easy, four step piece. You'll first need to have your left foot slightly in front of right foot. The rest is in the next section. Hands and Arms. Do this move. (2 part) Step 1, your position; have your left foot forward. Hold the ball directly in front of you at chest height, arm length away. Step 2, bring back your right arm like your hand is going to touch your ear. Step 3, keeping left arm straight, toss the ball up about a foot  above your head. Toss it a little bit forward, but not so much you can't reach it. Step 4, step forward with right leg, and hit the ball as you step. If you aren't strong, do it with your fist instead of flat handed; some coaches don't allow their team to do it with their fist, though. Blocking Position. Blocking is very easy. Blockers should be cocked and ready to jump up. Generally, you should be half an arms length away, off from the net. Watch the ball and then jump. When you are in the air, do following steps. Hands and arms. Swing your arms up to get height. Hold your arms straight, hands stiff. When the ball comes over, just touch the ball, keeping hands stiff, with your palms. Even if you aren't as tall as the net, just getting a glimpse of an emerging body will scare them and throw the opposing team off. Do this every play, even for just a bump. Do this move. Keep your hands up at your shoulders. After you jump, penetrate the net with your hands and hold stiff against ball. If your fingers are not stiff, you can risk hyper-extension injury and the ball will go past your fingers. Diving\\/Saving Net Balls Position. Saving a ball from the net is easy, if you have great reflexes. When the ball hits the middle of the net and bounces back, run and penguin slide to the ball at last resort if you cannot get to it in time. NEVER slide on your knee pads as this is harmful to your knees. Hands and arms. Set up like you are going to bump, but not until the last second. Then, shrug and hit. Do this move, watch the ball hit the net. Run, slide, and bump. Try to bump it behind you for another teammate to hit over. Do this by bring your arms farther back (like a miniature swing of the arms), or arching your back as you make contact with the ball. How to Hit a Ball Along the Net Do this when your setter has set the ball and you go to hit it but it's too close to the net for you to spike.  Turn sideways, with your shoulders aligned to the net.  Bump like you would to hit a ball from the side. Lift up a lot more than out, though, and only lift out a bit. Every Day Conditioning Routine Jump rope 20 times.  Run to the end of the room or an area about the size of a volleyball court once and back. Jump rope 20 more times. Do 10 push ups. 30 jumping jacks. Jump rope 20 times.",
    "sentences": [
        " Steps Keep up a good attitude.",
        "Don't complain at practice.",
        "Do what the coach tells you; they know what they're doing.",
        "Even when you feel like your legs are about to fall off from all the conditioning, keep doing it.",
        "It will pay off in the long run and after all of the pain it will get easier and easier.",
        "Practice, practice, practice.",
        "Practice at your house by bumping, serving, setting, and hitting on your wall.",
        "You can randomly do your approach and jump as high as possible to practice blocking.",
        "And give your best effort at practice; put your all in it.",
        "Passing or Bumping Position.",
        "To bump, you'll need to squat until it looks like you're sitting on a chair.",
        "Stick your butt out so it goes past your heels, and straighten your back.",
        "Your posture is correct!",
        "Hands and arms.",
        "Make a fist with your dominant hand.",
        "Cup your opposite hand around that one.",
        "Don't cross your thumbs, but keep them parallel to one another.",
        "Straighten your arms out.",
        "Feel the flat part of your forearms (smooth inside part).",
        "This is where the ball will make contact.",
        "How to do this move.",
        "This is one of the most crucial and most used moves in volleyball.",
        "Move your feet to square up with the ball.",
        "When it is almost touching your arms, take a step forward, hitting the ball with your arms, or platform (flat part of arms).",
        "DO NOT SWING.",
        "Use your legs to push up and out to target, and your arms should just move with them.",
        "Don't swing your arms more than 2 inches (5.1 cm).",
        "Passing may sting.",
        "An easy way to keep from stinging is to simply shrug your shoulders when you hit the ball.",
        "How to Set Position.",
        "To set, you'll need to lean forward a bit, but only a little.",
        "Bend your knees slightly.",
        "Be ready to push up, and straighten your legs and your power source.",
        "Hands and arms.",
        "Bend your elbows at an angle.",
        "Put your index and thumb fingers so they are almost touching their opposites.",
        "There should be a spade-type space between.",
        "Place hands so thumbs are close to the forehead's hairline.",
        "How to do this move.",
        "Your knees and limbs are bent at the above angles or amounts.",
        "When the ball comes, flick it up and forwards.",
        "Be sure to push off from your legs and ankles.",
        "This move is very difficult for some to master-so don't worry if you can't do this!",
        "If you're a/the setter, you play an important role and need to practice setting more than others.",
        "Spiking Position.",
        "This move has many positions.",
        "At the 10 foot (3.0 m) line, begin with your non-dominant foot front.",
        "Say you are right handed.",
        "Have your right foot back, and your left front.",
        "Step left, and then right left.",
        "On left, swing your arms up, as you bend.",
        "You'll need to use your legs and knees for power.",
        "Hands and arms.",
        "Swing your arms up as if blocking when you jump to hit.",
        "Swing your arm through like a crane, 'scooping' as you finish.",
        "As you hit the ball, snap your wrist down so the ball hits the floor.",
        "Do this move.",
        "Altogether, you should do this.",
        "Step Left, right left, jump like your blocking, and scoop.",
        "Serving: Underhand Position.",
        "Serving underhand, crouch your body down as if you were going to bump.",
        "Have your right foot slightly in front of left.",
        "Make sure you're not standing up straight.",
        "Hands and arms.",
        "Say you are right handed.",
        "Hold the ball out in front of you in your left hand.",
        "Pick a patch on the ball to hit.",
        "Make your right hand into a fist.",
        "Swing your arm back to shoulder height, and propel it forward like a pendulum.",
        "Some people prefer to hit it on the part of their arm where they bump it, because it can give more control, but it doesn't give as much power.",
        "Do what works best for you.",
        "Do this move.",
        "Crouch, aim, and propel.",
        "That was easy, right?",
        "Make sure you don't bounce, throw the ball before, then hit it (you'll take out a ceiling light).",
        "You just need to hold onto it.",
        "Serving: Overhand Position.",
        "To overhand serve, it is an easy, four step piece.",
        "You'll first need to have your left foot slightly in front of right foot.",
        "The rest is in the next section.",
        "Hands and Arms.",
        "Do this move.",
        "(2 part) Step 1, your position; have your left foot forward.",
        "Hold the ball directly in front of you at chest height, arm length away.",
        "Step 2, bring back your right arm like your hand is going to touch your ear.",
        "Step 3, keeping left arm straight, toss the ball up about a foot  above your head.",
        "Toss it a little bit forward, but not so much you can't reach it.",
        "Step 4, step forward with right leg, and hit the ball as you step.",
        "If you aren't strong, do it with your fist instead of flat handed; some coaches don't allow their team to do it with their fist, though.",
        "Blocking Position.",
        "Blocking is very easy.",
        "Blockers should be cocked and ready to jump up.",
        "Generally, you should be half an arms length away, off from the net.",
        "Watch the ball and then jump.",
        "When you are in the air, do following steps.",
        "Hands and arms.",
        "Swing your arms up to get height.",
        "Hold your arms straight, hands stiff.",
        "When the ball comes over, just touch the ball, keeping hands stiff, with your palms.",
        "Even if you aren't as tall as the net, just getting a glimpse of an emerging body will scare them and throw the opposing team off.",
        "Do this every play, even for just a bump.",
        "Do this move.",
        "Keep your hands up at your shoulders.",
        "After you jump, penetrate the net with your hands and hold stiff against ball.",
        "If your fingers are not stiff, you can risk hyper-extension injury and the ball will go past your fingers.",
        "Diving\\/Saving Net Balls Position.",
        "Saving a ball from the net is easy, if you have great reflexes.",
        "When the ball hits the middle of the net and bounces back, run and penguin slide to the ball at last resort if you cannot get to it in time.",
        "NEVER slide on your knee pads as this is harmful to your knees.",
        "Hands and arms.",
        "Set up like you are going to bump, but not until the last second.",
        "Then, shrug and hit.",
        "Do this move, watch the ball hit the net.",
        "Run, slide, and bump.",
        "Try to bump it behind you for another teammate to hit over.",
        "Do this by bring your arms farther back (like a miniature swing of the arms), or arching your back as you make contact with the ball.",
        "How to Hit a Ball Along the Net Do this when your setter has set the ball and you go to hit it but it's too close to the net for you to spike.",
        "Turn sideways, with your shoulders aligned to the net.",
        "Bump like you would to hit a ball from the side.",
        "Lift up a lot more than out, though, and only lift out a bit.",
        "Every Day Conditioning Routine Jump rope 20 times.",
        "Run to the end of the room or an area about the size of a volleyball court once and back.",
        "Jump rope 20 more times.",
        "Do 10 push ups.",
        "30 jumping jacks.",
        "Jump rope 20 times."
    ]
}