{
    "title": "How to Perform the Lesser Banishing Ritual of the Pentagram",
    "url": "https://www.wikihow.com/Perform-the-Lesser-Banishing-Ritual-of-the-Pentagram",
    "category_hierarchy": [
        "Philosophy and Religion",
        "Religion",
        "Nature & Pagan Beliefs"
    ],
    "methods": [
        {
            "name": "The Kabalistic Cross",
            "steps": [
                {
                    "headline": "Stand in the center of your room, facing east, and imagine that you are a towering figure and the earth is a tiny sphere below you.",
                    "description": "Feel yourself to be the center of the universe."
                },
                {
                    "headline": "Look up into space and imagine a sphere of white brilliance.",
                    "description": "See this light descend to the top of your head."
                },
                {
                    "headline": "Reach up with your right hand (or ritual dagger (Athame) and pull this white light down to your forehead.",
                    "description": "When you do this vibrate the word ATAH (ah-tah)."
                },
                {
                    "headline": "Move your hand down your body, feeling the light being drawn down through you in a beam.",
                    "description": "Touch your breast, move your hand over the groin area, pointing down, vibrate MALKUTH (Mahl-koot [h], and imagine there is now a shaft of light running through you, connecting the light source above your head, to the earth below you."
                },
                {
                    "headline": "Touch your right shoulder and imagine that a beam of light from the shaft passes through that point and your right side, into space.",
                    "description": "Vibrate VE-GEBURAH (v'ge-boo-rah)."
                },
                {
                    "headline": "Do the same with your left shoulder and vibrate VE-GEDULAH (v'ge-doo-lah).",
                    "description": ""
                },
                {
                    "headline": "Bring both of your hands to your breast and clasp them together as if praying and vibrate LE-OLAHM, AMEN (lay-oh-lahm, ah-men).",
                    "description": "You are now standing in the center of a cross of light that reaches to the ends of the universe."
                }
            ]
        },
        {
            "name": "The 4 Pentagrams",
            "steps": [
                {
                    "headline": "Move to the east of your area (or at least be facing east) and trace with your finger/wand/Athame a large banishing pentagram in the air before you.",
                    "description": "Visualise it glowing in flaming blue light. Perform the Sign of the Enterer and vibrate YOD HEH VAV HEH (yode-heh-vahv-heh). Perform the sign of silence."
                },
                {
                    "headline": "Keeping your finger or tip of dagger in the center of your pentagram, move to the south quarter, and trace a bright white line to the center of the south of your circle.",
                    "description": "These lines connect your pentagrams."
                },
                {
                    "headline": "Trace another pentagram the same way, now perform the sign of the enterer and vibrate ADONAI (ah-doe-nye).",
                    "description": "Perform the sign of silence, remembering to keep your right arm out in front of you."
                },
                {
                    "headline": "Carry the white line of light to the west, repeat the steps of tracing and charging your pentagram, but this time vibrate EHEIEH (eh-hey-yay).",
                    "description": ""
                },
                {
                    "headline": "Carry the light to the north, do the same one last time, and vibrate AGLA (ah-gah-la)",
                    "description": ""
                },
                {
                    "headline": "Carry the white line of light back to the east, and connect all your pentagrams together.",
                    "description": "You should now be surrounded by four blue flaming pentagrams in the 4 equal corners of your circle you've just made."
                },
                {
                    "headline": "Walk back to the center of your circle and turn clockwise to face east.",
                    "description": ""
                }
            ]
        },
        {
            "name": "The Calling of The Archangels",
            "steps": [
                {
                    "headline": "Once again, visualise the Kabbalistic cross you made earlier, extend your arms out to make this shape.",
                    "description": "Look in front of you (east) and say, Before Me, RAPHAEL (rah-fay-el). Try to feel his presence and feel the airy breeze hit your face."
                },
                {
                    "headline": "Imagine another presence behind you and say, Behind Me, GABRIEL (gah-bree-el).",
                    "description": "Try to feel the element moisture of water on your back."
                },
                {
                    "headline": "Look to your right and say, On my right hand, MICHAEL (mi-kai-el).",
                    "description": "Feel the heat of fire."
                },
                {
                    "headline": "Look to your left, and say, On my left hand, URIEL (or-ee-el), try to feel the sense of solidity given off by this quarter.",
                    "description": ""
                },
                {
                    "headline": "Face east again and contemplate the flaming pentagrams around you, saying, For around me shines the pentagram... Then visualise a brilliant hexagram within your chest and say, And within me shines the six ray star.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "A robe",
        "A Wand (preferably crystal) or an Athame",
        "Your magical jewelry (if any), the ring of Solomon is a lovely piece if you can find one.",
        "Your altar. This is generally placed in the middle of the room and acts as your center of your sacred space, but again its not necessary."
    ],
    "text": " The Kabalistic Cross Stand in the center of your room, facing east, and imagine that you are a towering figure and the earth is a tiny sphere below you. Feel yourself to be the center of the universe. Look up into space and imagine a sphere of white brilliance. See this light descend to the top of your head. Reach up with your right hand (or ritual dagger (Athame) and pull this white light down to your forehead. When you do this vibrate the word ATAH (ah-tah). Move your hand down your body, feeling the light being drawn down through you in a beam. Touch your breast, move your hand over the groin area, pointing down, vibrate MALKUTH (Mahl-koot [h], and imagine there is now a shaft of light running through you, connecting the light source above your head, to the earth below you. Touch your right shoulder and imagine that a beam of light from the shaft passes through that point and your right side, into space. Vibrate VE-GEBURAH (v'ge-boo-rah). Do the same with your left shoulder and vibrate VE-GEDULAH (v'ge-doo-lah).  Bring both of your hands to your breast and clasp them together as if praying and vibrate LE-OLAHM, AMEN (lay-oh-lahm, ah-men). You are now standing in the center of a cross of light that reaches to the ends of the universe. The 4 Pentagrams Move to the east of your area (or at least be facing east) and trace with your finger/wand/Athame a large banishing pentagram in the air before you. Visualise it glowing in flaming blue light. Perform the Sign of the Enterer and vibrate YOD HEH VAV HEH (yode-heh-vahv-heh). Perform the sign of silence. Keeping your finger or tip of dagger in the center of your pentagram, move to the south quarter, and trace a bright white line to the center of the south of your circle. These lines connect your pentagrams. Trace another pentagram the same way, now perform the sign of the enterer and vibrate ADONAI (ah-doe-nye). Perform the sign of silence, remembering to keep your right arm out in front of you. Carry the white line of light to the west, repeat the steps of tracing and charging your pentagram, but this time vibrate EHEIEH (eh-hey-yay).  Carry the light to the north, do the same one last time, and vibrate AGLA (ah-gah-la)  Carry the white line of light back to the east, and connect all your pentagrams together. You should now be surrounded by four blue flaming pentagrams in the 4 equal corners of your circle you've just made. Walk back to the center of your circle and turn clockwise to face east.  The Calling of The Archangels Once again, visualise the Kabbalistic cross you made earlier, extend your arms out to make this shape. Look in front of you (east) and say, Before Me, RAPHAEL (rah-fay-el). Try to feel his presence and feel the airy breeze hit your face. Imagine another presence behind you and say, Behind Me, GABRIEL (gah-bree-el). Try to feel the element moisture of water on your back. Look to your right and say, On my right hand, MICHAEL (mi-kai-el). Feel the heat of fire. Look to your left, and say, On my left hand, URIEL (or-ee-el), try to feel the sense of solidity given off by this quarter.  Face east again and contemplate the flaming pentagrams around you, saying, For around me shines the pentagram... Then visualise a brilliant hexagram within your chest and say, And within me shines the six ray star. ",
    "sentences": [
        " The Kabalistic Cross Stand in the center of your room, facing east, and imagine that you are a towering figure and the earth is a tiny sphere below you.",
        "Feel yourself to be the center of the universe.",
        "Look up into space and imagine a sphere of white brilliance.",
        "See this light descend to the top of your head.",
        "Reach up with your right hand (or ritual dagger (Athame) and pull this white light down to your forehead.",
        "When you do this vibrate the word ATAH (ah-tah).",
        "Move your hand down your body, feeling the light being drawn down through you in a beam.",
        "Touch your breast, move your hand over the groin area, pointing down, vibrate MALKUTH (Mahl-koot [h], and imagine there is now a shaft of light running through you, connecting the light source above your head, to the earth below you.",
        "Touch your right shoulder and imagine that a beam of light from the shaft passes through that point and your right side, into space.",
        "Vibrate VE-GEBURAH (v'ge-boo-rah).",
        "Do the same with your left shoulder and vibrate VE-GEDULAH (v'ge-doo-lah).",
        "Bring both of your hands to your breast and clasp them together as if praying and vibrate LE-OLAHM, AMEN (lay-oh-lahm, ah-men).",
        "You are now standing in the center of a cross of light that reaches to the ends of the universe.",
        "The 4 Pentagrams Move to the east of your area (or at least be facing east) and trace with your finger/wand/Athame a large banishing pentagram in the air before you.",
        "Visualise it glowing in flaming blue light.",
        "Perform the Sign of the Enterer and vibrate YOD HEH VAV HEH (yode-heh-vahv-heh).",
        "Perform the sign of silence.",
        "Keeping your finger or tip of dagger in the center of your pentagram, move to the south quarter, and trace a bright white line to the center of the south of your circle.",
        "These lines connect your pentagrams.",
        "Trace another pentagram the same way, now perform the sign of the enterer and vibrate ADONAI (ah-doe-nye).",
        "Perform the sign of silence, remembering to keep your right arm out in front of you.",
        "Carry the white line of light to the west, repeat the steps of tracing and charging your pentagram, but this time vibrate EHEIEH (eh-hey-yay).",
        "Carry the light to the north, do the same one last time, and vibrate AGLA (ah-gah-la)  Carry the white line of light back to the east, and connect all your pentagrams together.",
        "You should now be surrounded by four blue flaming pentagrams in the 4 equal corners of your circle you've just made.",
        "Walk back to the center of your circle and turn clockwise to face east.",
        "The Calling of The Archangels Once again, visualise the Kabbalistic cross you made earlier, extend your arms out to make this shape.",
        "Look in front of you (east) and say, Before Me, RAPHAEL (rah-fay-el).",
        "Try to feel his presence and feel the airy breeze hit your face.",
        "Imagine another presence behind you and say, Behind Me, GABRIEL (gah-bree-el).",
        "Try to feel the element moisture of water on your back.",
        "Look to your right and say, On my right hand, MICHAEL (mi-kai-el).",
        "Feel the heat of fire.",
        "Look to your left, and say, On my left hand, URIEL (or-ee-el), try to feel the sense of solidity given off by this quarter.",
        "Face east again and contemplate the flaming pentagrams around you, saying, For around me shines the pentagram... Then visualise a brilliant hexagram within your chest and say, And within me shines the six ray star."
    ]
}