{
    "title": "How to Drape a Dress",
    "url": "https://www.wikihow.com/Drape-a-Dress",
    "category_hierarchy": [
        "Work World",
        "Occupations"
    ],
    "parts": [
        {
            "name": "Preparing Materials",
            "steps": [
                {
                    "headline": "Purchase a dress form.",
                    "description": "You will need an adjustable dress form to ensure your dress design is made to the exact size you need. Adjustable dress forms are available for approximately $250 brand new."
                },
                {
                    "headline": "Adjust your dress form to the height, waist and torso measurements you are going to use for your prototype dress.",
                    "description": ""
                },
                {
                    "headline": "Create a sketch of the dress you want to create.",
                    "description": "Do several detail drawings of the front, back and sides."
                },
                {
                    "headline": "Buy muslin to drape.",
                    "description": "Choose muslin that is close to the weight of the material you want to use in the final dress, so that it behaves in a similar way. This will reduce the cost of materials, because you are creating a prototype in a less expensive fabric."
                },
                {
                    "headline": "Mark a centerline down your dress form in the front and back using tape to aid you in creating a symmetrical dress.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Draping the Bodice",
            "steps": [
                {
                    "headline": "Start with a foundation piece if your dress is made out of lightweight fabric.",
                    "description": "This is usually the liner and it allows the dress to keep its shape on the form. If your dress is a heavyweight fabric to begin with, you can skip this step."
                },
                {
                    "headline": "Pin the foundation piece of pieces to your dress form.",
                    "description": "Often designers will make a generic foundation piece in the measurements of the dress form and then adjust it to fit when it’s on the form."
                },
                {
                    "headline": "Ensure you have enough fabric to cover the sections of the dress between hems.",
                    "description": "You can always cut more off, but you can’t add more on without changing your design."
                },
                {
                    "headline": "Drape the fabric across the front bodice.",
                    "description": "This is usually where you will start because it requires more tailoring."
                },
                {
                    "headline": "Choose a place with the most folds and begin pinning the fabric to your dress form.",
                    "description": ""
                },
                {
                    "headline": "Mark additional folds with chalk according to your illustration.",
                    "description": ""
                },
                {
                    "headline": "Step back and compare the draped fabric to your dress illustration frequently.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Finishing the Draping",
            "steps": [
                {
                    "headline": "Move on to the back bodice when you have finished the front bodice.",
                    "description": "Pin and compare until you are happy with the draping."
                },
                {
                    "headline": "Continue with the front skirt next.",
                    "description": "Mark lines that should be cut later with chalk."
                },
                {
                    "headline": "Complete the draping with the back skirt section.",
                    "description": ""
                },
                {
                    "headline": "Baste stitch the sections and folds to the foundation piece.",
                    "description": "Keep the pins in as long as you can. Removing pins too early and losing folds and tucks is a common mistake with dress draping."
                },
                {
                    "headline": "Remove your pins as an entire section is attached with a basting stitch.",
                    "description": "Remember to hide raw edges from the draping inside the seams."
                },
                {
                    "headline": "Cut excess fabric off the form at your chalk lines.",
                    "description": "Remember to leave seam allowances. If you have very little fabric left, you can fold in under instead of cutting it away."
                },
                {
                    "headline": "Remove the dress from the form and sew the seams into your dress with a sewing machine.",
                    "description": "Alternatively, you can sew it by hand."
                },
                {
                    "headline": "Cut away the basting stitches.",
                    "description": "Use your prototype to construct a dress using the final material. Once designers get used to dress draping, they may choose to start with the final dress material so that they don’t have to drape the dress twice."
                }
            ]
        }
    ],
    "tyn": [
        "Adjustable dress form",
        "Dress sketch",
        "Muslin",
        "Pins",
        "Tape",
        "Chalk/Crayon",
        "Needle",
        "Thread",
        "Sewing machine",
        "Scissors"
    ],
    "text": " Preparing Materials Purchase a dress form. You will need an adjustable dress form to ensure your dress design is made to the exact size you need. Adjustable dress forms are available for approximately $250 brand new. Adjust your dress form to the height, waist and torso measurements you are going to use for your prototype dress.  Create a sketch of the dress you want to create. Do several detail drawings of the front, back and sides. Buy muslin to drape. Choose muslin that is close to the weight of the material you want to use in the final dress, so that it behaves in a similar way. This will reduce the cost of materials, because you are creating a prototype in a less expensive fabric. Mark a centerline down your dress form in the front and back using tape to aid you in creating a symmetrical dress.  Draping the Bodice Start with a foundation piece if your dress is made out of lightweight fabric. This is usually the liner and it allows the dress to keep its shape on the form. If your dress is a heavyweight fabric to begin with, you can skip this step. Pin the foundation piece of pieces to your dress form. Often designers will make a generic foundation piece in the measurements of the dress form and then adjust it to fit when it’s on the form. Ensure you have enough fabric to cover the sections of the dress between hems. You can always cut more off, but you can’t add more on without changing your design. Drape the fabric across the front bodice. This is usually where you will start because it requires more tailoring. Choose a place with the most folds and begin pinning the fabric to your dress form.  Mark additional folds with chalk according to your illustration.  Step back and compare the draped fabric to your dress illustration frequently.  Finishing the Draping Move on to the back bodice when you have finished the front bodice. Pin and compare until you are happy with the draping. Continue with the front skirt next. Mark lines that should be cut later with chalk. Complete the draping with the back skirt section.  Baste stitch the sections and folds to the foundation piece. Keep the pins in as long as you can. Removing pins too early and losing folds and tucks is a common mistake with dress draping. Remove your pins as an entire section is attached with a basting stitch. Remember to hide raw edges from the draping inside the seams. Cut excess fabric off the form at your chalk lines. Remember to leave seam allowances. If you have very little fabric left, you can fold in under instead of cutting it away. Remove the dress from the form and sew the seams into your dress with a sewing machine. Alternatively, you can sew it by hand. Cut away the basting stitches. Use your prototype to construct a dress using the final material. Once designers get used to dress draping, they may choose to start with the final dress material so that they don’t have to drape the dress twice.",
    "sentences": [
        " Preparing Materials Purchase a dress form.",
        "You will need an adjustable dress form to ensure your dress design is made to the exact size you need.",
        "Adjustable dress forms are available for approximately $250 brand new.",
        "Adjust your dress form to the height, waist and torso measurements you are going to use for your prototype dress.",
        "Create a sketch of the dress you want to create.",
        "Do several detail drawings of the front, back and sides.",
        "Buy muslin to drape.",
        "Choose muslin that is close to the weight of the material you want to use in the final dress, so that it behaves in a similar way.",
        "This will reduce the cost of materials, because you are creating a prototype in a less expensive fabric.",
        "Mark a centerline down your dress form in the front and back using tape to aid you in creating a symmetrical dress.",
        "Draping the Bodice Start with a foundation piece if your dress is made out of lightweight fabric.",
        "This is usually the liner and it allows the dress to keep its shape on the form.",
        "If your dress is a heavyweight fabric to begin with, you can skip this step.",
        "Pin the foundation piece of pieces to your dress form.",
        "Often designers will make a generic foundation piece in the measurements of the dress form and then adjust it to fit when it’s on the form.",
        "Ensure you have enough fabric to cover the sections of the dress between hems.",
        "You can always cut more off, but you can’t add more on without changing your design.",
        "Drape the fabric across the front bodice.",
        "This is usually where you will start because it requires more tailoring.",
        "Choose a place with the most folds and begin pinning the fabric to your dress form.",
        "Mark additional folds with chalk according to your illustration.",
        "Step back and compare the draped fabric to your dress illustration frequently.",
        "Finishing the Draping Move on to the back bodice when you have finished the front bodice.",
        "Pin and compare until you are happy with the draping.",
        "Continue with the front skirt next.",
        "Mark lines that should be cut later with chalk.",
        "Complete the draping with the back skirt section.",
        "Baste stitch the sections and folds to the foundation piece.",
        "Keep the pins in as long as you can.",
        "Removing pins too early and losing folds and tucks is a common mistake with dress draping.",
        "Remove your pins as an entire section is attached with a basting stitch.",
        "Remember to hide raw edges from the draping inside the seams.",
        "Cut excess fabric off the form at your chalk lines.",
        "Remember to leave seam allowances.",
        "If you have very little fabric left, you can fold in under instead of cutting it away.",
        "Remove the dress from the form and sew the seams into your dress with a sewing machine.",
        "Alternatively, you can sew it by hand.",
        "Cut away the basting stitches.",
        "Use your prototype to construct a dress using the final material.",
        "Once designers get used to dress draping, they may choose to start with the final dress material so that they don’t have to drape the dress twice."
    ]
}