{
    "title": "How to Delete a Playlist from an iPod Nano",
    "url": "https://www.wikihow.com/Delete-a-Playlist-from-an-iPod-Nano",
    "category_hierarchy": [
        "Computers and Electronics",
        "Consumer Electronics",
        "Portable Media Players",
        "IPods",
        "IPod Nano"
    ],
    "methods": [
        {
            "name": "Automatically adding and removing songs and playlists",
            "steps": [
                {
                    "headline": "Open your iTunes program before plugging your iPod nano into your computer with your USB sync cable.",
                    "description": ""
                },
                {
                    "headline": "Right-click on the playlist you wish to delete, and click \"delete\".",
                    "description": "If your iPod nano is set to sync automatically with your computer, then any playlist from your iPod nano should also be in your iTunes."
                },
                {
                    "headline": "Plug in your iPod nano to your computer using your iPod's USB sync cable.",
                    "description": "If iTunes is not already open, it should open automatically, but if it doesn't, you can open it by double-clicking on it."
                },
                {
                    "headline": "Wait for your iPod nano to automatically sync with your iTunes Library, deleting any playlists that are no longer in your iTunes Library.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Manually adding and removing songs of playlist",
            "steps": [
                {
                    "headline": "If you prefer to manage the songs and playlists on your iPod separately from the way you manage them in iTunes:",
                    "description": "Set your iPod to manually manage music and video by clicking on your iPod's icon on the left side of iTunes when it is plugged in. Check the \"manually manage music and videos\" box."
                },
                {
                    "headline": "Plug in your iPod nano to your computer using your iPod's USB sync cable.",
                    "description": "iTunes should open automatically, but if it doesn't, you can open it by double-clicking on it."
                },
                {
                    "headline": "Click the gray triangle icon next to your iPod in the iTunes source pane.",
                    "description": "This will allow you to see the contents of your iPod. All playlists on your iPod nano will appear here."
                },
                {
                    "headline": "Click on the playlist you wish to delete and select \"delete\" from the iTunes Edit menu.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "iPod",
        "iTunes",
        "Working computer with USB cable/dock"
    ],
    "text": " Automatically adding and removing songs and playlists Open your iTunes program before plugging your iPod nano into your computer with your USB sync cable.  Right-click on the playlist you wish to delete, and click \"delete\". If your iPod nano is set to sync automatically with your computer, then any playlist from your iPod nano should also be in your iTunes. Plug in your iPod nano to your computer using your iPod's USB sync cable. If iTunes is not already open, it should open automatically, but if it doesn't, you can open it by double-clicking on it. Wait for your iPod nano to automatically sync with your iTunes Library, deleting any playlists that are no longer in your iTunes Library.  Manually adding and removing songs of playlist If you prefer to manage the songs and playlists on your iPod separately from the way you manage them in iTunes: Set your iPod to manually manage music and video by clicking on your iPod's icon on the left side of iTunes when it is plugged in. Check the \"manually manage music and videos\" box. Plug in your iPod nano to your computer using your iPod's USB sync cable. iTunes should open automatically, but if it doesn't, you can open it by double-clicking on it. Click the gray triangle icon next to your iPod in the iTunes source pane. This will allow you to see the contents of your iPod. All playlists on your iPod nano will appear here. Click on the playlist you wish to delete and select \"delete\" from the iTunes Edit menu. ",
    "sentences": [
        " Automatically adding and removing songs and playlists Open your iTunes program before plugging your iPod nano into your computer with your USB sync cable.",
        "Right-click on the playlist you wish to delete, and click \"delete\".",
        "If your iPod nano is set to sync automatically with your computer, then any playlist from your iPod nano should also be in your iTunes.",
        "Plug in your iPod nano to your computer using your iPod's USB sync cable.",
        "If iTunes is not already open, it should open automatically, but if it doesn't, you can open it by double-clicking on it.",
        "Wait for your iPod nano to automatically sync with your iTunes Library, deleting any playlists that are no longer in your iTunes Library.",
        "Manually adding and removing songs of playlist If you prefer to manage the songs and playlists on your iPod separately from the way you manage them in iTunes: Set your iPod to manually manage music and video by clicking on your iPod's icon on the left side of iTunes when it is plugged in.",
        "Check the \"manually manage music and videos\" box.",
        "Plug in your iPod nano to your computer using your iPod's USB sync cable.",
        "iTunes should open automatically, but if it doesn't, you can open it by double-clicking on it.",
        "Click the gray triangle icon next to your iPod in the iTunes source pane.",
        "This will allow you to see the contents of your iPod.",
        "All playlists on your iPod nano will appear here.",
        "Click on the playlist you wish to delete and select \"delete\" from the iTunes Edit menu."
    ]
}