{
    "title": "How to Make Strawberry Juice",
    "url": "https://www.wikihow.com/Make-Strawberry-Juice",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Juice"
    ],
    "methods": [
        {
            "name": "Making Pure Strawberry Juice",
            "steps": [
                {
                    "headline": "Prepare your strawberries for extracting juice.",
                    "description": "To make a generous amount of juice, you’ll need to gather about two pounds of strawberries. Wash and cut the stems off of fresh strawberries, or thaw frozen strawberries."
                },
                {
                    "headline": "Set up the device you’ll use to squeeze out the juice from the strawberries.",
                    "description": "There’s more than one type of kitchen gadget you can use to extract juice from strawberries. You can use a juicer, a blender, or a centrifuge, a rare kitchen gadget commonly used in labs, which uses rotational forces to separate high and low density particles. Not all juicers are made the same, but a typical assembly involves attaching a blade, filter, chute, and juice and pulp containers to a juicer base. Connect the juicer to an electrical outlet and make sure it’s set to “on.”\nA typical blender assembly involves inserting a blade inside of a container and connecting the container to a base, which plugs into an electrical outlet. A kitchen centrifuge is a small rectangular machine that spins several bottles on a rotor at a high speed to apply gravitational force. It may already come assembled. If not, assembly usually requires you to lift the top and secure the rotor on the base. The rotor should have a number of holes which hold bottles. You’ll fill those bottles with contents, and then place them in the holes of the rotor."
                },
                {
                    "headline": "Use a juicer to extract strawberry juice.",
                    "description": "You’ll likely have to use a pusher to push the fruit into the blades. While holding the pusher in one hand, use the other to fill the chute with strawberries. Use the pusher to press the strawberries into the blades. The juicer will shoot the juice into one container, and the pulp into another. Continue pushing the strawberries through the juicer until they’re all juiced. You should have a generous amount of juice to drink."
                },
                {
                    "headline": "Use a blender to extract juice.",
                    "description": "Fill the blender with your strawberries, cover with a top, and blend until smooth. Pour the mixture through a sieve or strainer to separate the juice from the pulp. Alternately, you could use a centrifuge to separate the juice from the pulp."
                },
                {
                    "headline": "Use a centrifuge to extract strawberry juice.",
                    "description": "If you’re a home chef who’s also into science gastronomy, using a centrifuge to extract strawberry juice is right up your ally. Take strawberry puree that’s just been blended and pour equal amounts into the bottles. Weigh the bottles to ensure they’re equal. Place the filled bottles into the rotor, close the centrifuge, and set it to maximum speed for about ten minutes. The force of the machine will draw heavier particles, like the pulp and seeds, to the bottom; while the lighter weighing juice will float to the top."
                },
                {
                    "headline": "Pour your juice into a juice jug to serve.",
                    "description": "Once you’ve used your designated kitchen gadget to release the juices from the strawberries, you can now pour the juice through a sieve or strainer to make sure all of the pulp is separated from the juice. If you’ve used a juicer, you won’t need to do this because the machine has already done it for you. If you’ve used a blender, wait for the contents in the container to settle, about 10 minutes. The juice at the bottom should look a lot darker than the juice at the top. Pour the mixture slowly through a sieve. Press the pulp with a spatula or the back of a large spoon to squeeze out as much juice as possible. If you’ve used a centrifuge, pour the mixture slowly through the sieve to keep from disturbing the heavier contents at the bottom."
                },
                {
                    "headline": "Serve your juice as desired.",
                    "description": "You can allow your fresh strawberry juice, to cool in the refrigerator before serving, or add ice to serve immediately."
                }
            ]
        },
        {
            "name": "Making Simple Strawberry Lemon Juice",
            "steps": [
                {
                    "headline": "Prepare your strawberries.",
                    "description": "Rinse two cups of fresh strawberries under cold water and remove their stems. If you only have frozen, gather the same amount, which is about 18 to 20 strawberries, and allow them to thaw. You’ll want your frozen strawberries to thaw so that your juice will be more like a smooth liquid as opposed to a thick smoothie. This amount will create two servings of juice. If you plan to serve more than two people, then double or triple the amount of strawberries as needed. You’ll also need to increase the amount of the remaining ingredients accordingly."
                },
                {
                    "headline": "Put strawberries and other ingredients into blender.",
                    "description": "This simple strawberry juice will be pureed in a blender, so all of your ingredients can be added at once. Add to your blender the strawberries, a teaspoon of lemon juice, two tablespoons of sugar, a pinch of salt, and two cups of water. Remember, if you’ve doubled or tripled your strawberries, make sure you double or triple the amount of the additional ingredients as well. Salt is optional. While adding salt helps bring out the sweetness of the juice, if you’re trying to limit your salt intake for health reasons or as a personal preference, then it’s not necessary to add. The amount of sugar you use depends on taste and need. Your strawberries may already be so sweet that you won’t need much, if any, sugar. Alternately, they may not be sweet at all, and you may need more sugar than recommended."
                },
                {
                    "headline": "Blend for a minute or two.",
                    "description": "Ingredients should be well mixed and pureed."
                },
                {
                    "headline": "Taste test your juice.",
                    "description": "Is your strawberry juice too sweet or not sweet enough? Adjust the taste of your juice as needed. If it’s too sweet, then add a little more water. If it doesn’t taste sweet enough, you can add more sugar. Add a couple of teaspoons of sugar at a time to keep from adding too much sugar to your juice."
                },
                {
                    "headline": "Strain your juice to remove the pulp and seeds.",
                    "description": "This step is optional, but if you prefer the feel and taste of pulp-free juice, pour your juice through a fine meshed strainer before serving. Place the sieve over a juice jug to pour your juice directly into your serving container."
                },
                {
                    "headline": "Enjoy your strawberry juice.",
                    "description": "You can either chill your juice in the refrigerator for a couple hours before serving, or add a few ice cubes to a glass to serve immediately."
                }
            ]
        },
        {
            "name": "Making Strawberry Syrup for Strawberry Juice",
            "steps": [
                {
                    "headline": "Prepare your strawberries.",
                    "description": "Wash two pounds of fresh strawberries. Remove the stems and cut the strawberries in half. If your strawberries are frozen, allow to thaw before slicing in half. It is possible that using frozen strawberries in this method may alter the taste a little, so try to use fresh strawberries if you can."
                },
                {
                    "headline": "Put half of the chopped strawberries into a large bowl and cover with one cup of sugar.",
                    "description": "Top with the remaining chopped strawberries, and then cover those with the rest of the sugar. Cover the bowl with plastic wrap or foil paper and let sit in the refrigerator for 24 hours."
                },
                {
                    "headline": "After 24 hours, remove the bowl from the refrigerator and pour the mixture into a saucepan.",
                    "description": "A saucepan is deep cooking pan. If you don’t have one, a large pot will suffice. Put the pan on the stove and heat over medium-high heat. Keep a close eye on the mixture as it comes to a boil to prevent it from burning. When it begins to boil, reduce the heat and let it simmer for 30 minutes."
                },
                {
                    "headline": "While the mixture is simmering, wash the large bowl used for marinating the strawberry and sugar mixture.",
                    "description": "Place a sieve or strainer over the bowl. The mesh of the sieve or strainer should be fine to prevent the tiniest of food particles, like the seeds, from passing through."
                },
                {
                    "headline": "Once the mixture finishes simmering, carefully pour it through sieve to make sure it doesn’t splash or burn you.",
                    "description": "Once poured through, the cooked strawberries should be left in the sieve. Using a spatula or the back of a large spoon, smash the strawberries into the sieve to squeeze out any remaining juices. You now should have a bowl of hot strawberry syrup."
                },
                {
                    "headline": "Pour the strawberry syrup into a sterilized glass bottle.",
                    "description": "The sterilized bottle will ensure that the mixture lasts for longer than a few days in your refrigerator. If you have one, put a funnel cup inside the spout of the bottle to keep from spilling the syrup over the sides. If you don’t have a funnel cup, transfer the mixture into a container with a spout. This should make it easier to pour the syrup into the bottle without spilling it. Top the bottle with the sterilized cap and allow the bottle and the mixture to completely cool before storing in the refrigerator. To sterilize a glass bottle, wash the glass bottle and then place on a baking sheet in an oven preheated to 170 degrees. Let it sit for 30 minutes. Put the cap of the bottle in a small bowl and pour boiling water over it. This will sterilize it. Remove the bottle from the oven with an oven-mitt or thick towel to be safe. Wait until it is cool enough to touch before filling with the strawberry syrup."
                },
                {
                    "headline": "To make strawberry juice using the syrup, mix ¼- cup of the syrup with one cup of water.",
                    "description": "Add more strawberry syrup if you’d prefer it sweeter. Or add more water if it’s too sweet. You can spice up your strawberry juice by using soda water instead. Or if you’re having an evening event, use the strawberry syrup to make a strawberry cocktail."
                }
            ]
        }
    ],
    "tyn": [
        "Cutting knife",
        "Mixing bowl",
        "Fine meshed sieve or strainer",
        "Saucepan or pot",
        "Measuring cups and spoons",
        "Funnel cup",
        "Glass bottle",
        "Juice jug",
        "Oven"
    ],
    "text": " Making Pure Strawberry Juice Prepare your strawberries for extracting juice. To make a generous amount of juice, you’ll need to gather about two pounds of strawberries. Wash and cut the stems off of fresh strawberries, or thaw frozen strawberries. Set up the device you’ll use to squeeze out the juice from the strawberries. There’s more than one type of kitchen gadget you can use to extract juice from strawberries. You can use a juicer, a blender, or a centrifuge, a rare kitchen gadget commonly used in labs, which uses rotational forces to separate high and low density particles. Not all juicers are made the same, but a typical assembly involves attaching a blade, filter, chute, and juice and pulp containers to a juicer base. Connect the juicer to an electrical outlet and make sure it’s set to “on.”\nA typical blender assembly involves inserting a blade inside of a container and connecting the container to a base, which plugs into an electrical outlet. A kitchen centrifuge is a small rectangular machine that spins several bottles on a rotor at a high speed to apply gravitational force. It may already come assembled. If not, assembly usually requires you to lift the top and secure the rotor on the base. The rotor should have a number of holes which hold bottles. You’ll fill those bottles with contents, and then place them in the holes of the rotor. Use a juicer to extract strawberry juice. You’ll likely have to use a pusher to push the fruit into the blades. While holding the pusher in one hand, use the other to fill the chute with strawberries. Use the pusher to press the strawberries into the blades. The juicer will shoot the juice into one container, and the pulp into another. Continue pushing the strawberries through the juicer until they’re all juiced. You should have a generous amount of juice to drink. Use a blender to extract juice. Fill the blender with your strawberries, cover with a top, and blend until smooth. Pour the mixture through a sieve or strainer to separate the juice from the pulp. Alternately, you could use a centrifuge to separate the juice from the pulp. Use a centrifuge to extract strawberry juice. If you’re a home chef who’s also into science gastronomy, using a centrifuge to extract strawberry juice is right up your ally. Take strawberry puree that’s just been blended and pour equal amounts into the bottles. Weigh the bottles to ensure they’re equal. Place the filled bottles into the rotor, close the centrifuge, and set it to maximum speed for about ten minutes. The force of the machine will draw heavier particles, like the pulp and seeds, to the bottom; while the lighter weighing juice will float to the top. Pour your juice into a juice jug to serve. Once you’ve used your designated kitchen gadget to release the juices from the strawberries, you can now pour the juice through a sieve or strainer to make sure all of the pulp is separated from the juice. If you’ve used a juicer, you won’t need to do this because the machine has already done it for you. If you’ve used a blender, wait for the contents in the container to settle, about 10 minutes. The juice at the bottom should look a lot darker than the juice at the top. Pour the mixture slowly through a sieve. Press the pulp with a spatula or the back of a large spoon to squeeze out as much juice as possible. If you’ve used a centrifuge, pour the mixture slowly through the sieve to keep from disturbing the heavier contents at the bottom. Serve your juice as desired. You can allow your fresh strawberry juice, to cool in the refrigerator before serving, or add ice to serve immediately. Making Simple Strawberry Lemon Juice Prepare your strawberries. Rinse two cups of fresh strawberries under cold water and remove their stems. If you only have frozen, gather the same amount, which is about 18 to 20 strawberries, and allow them to thaw. You’ll want your frozen strawberries to thaw so that your juice will be more like a smooth liquid as opposed to a thick smoothie. This amount will create two servings of juice. If you plan to serve more than two people, then double or triple the amount of strawberries as needed. You’ll also need to increase the amount of the remaining ingredients accordingly. Put strawberries and other ingredients into blender. This simple strawberry juice will be pureed in a blender, so all of your ingredients can be added at once. Add to your blender the strawberries, a teaspoon of lemon juice, two tablespoons of sugar, a pinch of salt, and two cups of water. Remember, if you’ve doubled or tripled your strawberries, make sure you double or triple the amount of the additional ingredients as well. Salt is optional. While adding salt helps bring out the sweetness of the juice, if you’re trying to limit your salt intake for health reasons or as a personal preference, then it’s not necessary to add. The amount of sugar you use depends on taste and need. Your strawberries may already be so sweet that you won’t need much, if any, sugar. Alternately, they may not be sweet at all, and you may need more sugar than recommended. Blend for a minute or two. Ingredients should be well mixed and pureed. Taste test your juice. Is your strawberry juice too sweet or not sweet enough? Adjust the taste of your juice as needed. If it’s too sweet, then add a little more water. If it doesn’t taste sweet enough, you can add more sugar. Add a couple of teaspoons of sugar at a time to keep from adding too much sugar to your juice. Strain your juice to remove the pulp and seeds. This step is optional, but if you prefer the feel and taste of pulp-free juice, pour your juice through a fine meshed strainer before serving. Place the sieve over a juice jug to pour your juice directly into your serving container. Enjoy your strawberry juice. You can either chill your juice in the refrigerator for a couple hours before serving, or add a few ice cubes to a glass to serve immediately. Making Strawberry Syrup for Strawberry Juice Prepare your strawberries. Wash two pounds of fresh strawberries. Remove the stems and cut the strawberries in half. If your strawberries are frozen, allow to thaw before slicing in half. It is possible that using frozen strawberries in this method may alter the taste a little, so try to use fresh strawberries if you can. Put half of the chopped strawberries into a large bowl and cover with one cup of sugar. Top with the remaining chopped strawberries, and then cover those with the rest of the sugar. Cover the bowl with plastic wrap or foil paper and let sit in the refrigerator for 24 hours. After 24 hours, remove the bowl from the refrigerator and pour the mixture into a saucepan. A saucepan is deep cooking pan. If you don’t have one, a large pot will suffice. Put the pan on the stove and heat over medium-high heat. Keep a close eye on the mixture as it comes to a boil to prevent it from burning. When it begins to boil, reduce the heat and let it simmer for 30 minutes. While the mixture is simmering, wash the large bowl used for marinating the strawberry and sugar mixture. Place a sieve or strainer over the bowl. The mesh of the sieve or strainer should be fine to prevent the tiniest of food particles, like the seeds, from passing through. Once the mixture finishes simmering, carefully pour it through sieve to make sure it doesn’t splash or burn you. Once poured through, the cooked strawberries should be left in the sieve. Using a spatula or the back of a large spoon, smash the strawberries into the sieve to squeeze out any remaining juices. You now should have a bowl of hot strawberry syrup. Pour the strawberry syrup into a sterilized glass bottle. The sterilized bottle will ensure that the mixture lasts for longer than a few days in your refrigerator. If you have one, put a funnel cup inside the spout of the bottle to keep from spilling the syrup over the sides. If you don’t have a funnel cup, transfer the mixture into a container with a spout. This should make it easier to pour the syrup into the bottle without spilling it. Top the bottle with the sterilized cap and allow the bottle and the mixture to completely cool before storing in the refrigerator. To sterilize a glass bottle, wash the glass bottle and then place on a baking sheet in an oven preheated to 170 degrees. Let it sit for 30 minutes. Put the cap of the bottle in a small bowl and pour boiling water over it. This will sterilize it. Remove the bottle from the oven with an oven-mitt or thick towel to be safe. Wait until it is cool enough to touch before filling with the strawberry syrup. To make strawberry juice using the syrup, mix ¼- cup of the syrup with one cup of water. Add more strawberry syrup if you’d prefer it sweeter. Or add more water if it’s too sweet. You can spice up your strawberry juice by using soda water instead. Or if you’re having an evening event, use the strawberry syrup to make a strawberry cocktail.",
    "sentences": [
        " Making Pure Strawberry Juice Prepare your strawberries for extracting juice.",
        "To make a generous amount of juice, you’ll need to gather about two pounds of strawberries.",
        "Wash and cut the stems off of fresh strawberries, or thaw frozen strawberries.",
        "Set up the device you’ll use to squeeze out the juice from the strawberries.",
        "There’s more than one type of kitchen gadget you can use to extract juice from strawberries.",
        "You can use a juicer, a blender, or a centrifuge, a rare kitchen gadget commonly used in labs, which uses rotational forces to separate high and low density particles.",
        "Not all juicers are made the same, but a typical assembly involves attaching a blade, filter, chute, and juice and pulp containers to a juicer base.",
        "Connect the juicer to an electrical outlet and make sure it’s set to “on.”\nA typical blender assembly involves inserting a blade inside of a container and connecting the container to a base, which plugs into an electrical outlet.",
        "A kitchen centrifuge is a small rectangular machine that spins several bottles on a rotor at a high speed to apply gravitational force.",
        "It may already come assembled.",
        "If not, assembly usually requires you to lift the top and secure the rotor on the base.",
        "The rotor should have a number of holes which hold bottles.",
        "You’ll fill those bottles with contents, and then place them in the holes of the rotor.",
        "Use a juicer to extract strawberry juice.",
        "You’ll likely have to use a pusher to push the fruit into the blades.",
        "While holding the pusher in one hand, use the other to fill the chute with strawberries.",
        "Use the pusher to press the strawberries into the blades.",
        "The juicer will shoot the juice into one container, and the pulp into another.",
        "Continue pushing the strawberries through the juicer until they’re all juiced.",
        "You should have a generous amount of juice to drink.",
        "Use a blender to extract juice.",
        "Fill the blender with your strawberries, cover with a top, and blend until smooth.",
        "Pour the mixture through a sieve or strainer to separate the juice from the pulp.",
        "Alternately, you could use a centrifuge to separate the juice from the pulp.",
        "Use a centrifuge to extract strawberry juice.",
        "If you’re a home chef who’s also into science gastronomy, using a centrifuge to extract strawberry juice is right up your ally.",
        "Take strawberry puree that’s just been blended and pour equal amounts into the bottles.",
        "Weigh the bottles to ensure they’re equal.",
        "Place the filled bottles into the rotor, close the centrifuge, and set it to maximum speed for about ten minutes.",
        "The force of the machine will draw heavier particles, like the pulp and seeds, to the bottom; while the lighter weighing juice will float to the top.",
        "Pour your juice into a juice jug to serve.",
        "Once you’ve used your designated kitchen gadget to release the juices from the strawberries, you can now pour the juice through a sieve or strainer to make sure all of the pulp is separated from the juice.",
        "If you’ve used a juicer, you won’t need to do this because the machine has already done it for you.",
        "If you’ve used a blender, wait for the contents in the container to settle, about 10 minutes.",
        "The juice at the bottom should look a lot darker than the juice at the top.",
        "Pour the mixture slowly through a sieve.",
        "Press the pulp with a spatula or the back of a large spoon to squeeze out as much juice as possible.",
        "If you’ve used a centrifuge, pour the mixture slowly through the sieve to keep from disturbing the heavier contents at the bottom.",
        "Serve your juice as desired.",
        "You can allow your fresh strawberry juice, to cool in the refrigerator before serving, or add ice to serve immediately.",
        "Making Simple Strawberry Lemon Juice Prepare your strawberries.",
        "Rinse two cups of fresh strawberries under cold water and remove their stems.",
        "If you only have frozen, gather the same amount, which is about 18 to 20 strawberries, and allow them to thaw.",
        "You’ll want your frozen strawberries to thaw so that your juice will be more like a smooth liquid as opposed to a thick smoothie.",
        "This amount will create two servings of juice.",
        "If you plan to serve more than two people, then double or triple the amount of strawberries as needed.",
        "You’ll also need to increase the amount of the remaining ingredients accordingly.",
        "Put strawberries and other ingredients into blender.",
        "This simple strawberry juice will be pureed in a blender, so all of your ingredients can be added at once.",
        "Add to your blender the strawberries, a teaspoon of lemon juice, two tablespoons of sugar, a pinch of salt, and two cups of water.",
        "Remember, if you’ve doubled or tripled your strawberries, make sure you double or triple the amount of the additional ingredients as well.",
        "Salt is optional.",
        "While adding salt helps bring out the sweetness of the juice, if you’re trying to limit your salt intake for health reasons or as a personal preference, then it’s not necessary to add.",
        "The amount of sugar you use depends on taste and need.",
        "Your strawberries may already be so sweet that you won’t need much, if any, sugar.",
        "Alternately, they may not be sweet at all, and you may need more sugar than recommended.",
        "Blend for a minute or two.",
        "Ingredients should be well mixed and pureed.",
        "Taste test your juice.",
        "Is your strawberry juice too sweet or not sweet enough?",
        "Adjust the taste of your juice as needed.",
        "If it’s too sweet, then add a little more water.",
        "If it doesn’t taste sweet enough, you can add more sugar.",
        "Add a couple of teaspoons of sugar at a time to keep from adding too much sugar to your juice.",
        "Strain your juice to remove the pulp and seeds.",
        "This step is optional, but if you prefer the feel and taste of pulp-free juice, pour your juice through a fine meshed strainer before serving.",
        "Place the sieve over a juice jug to pour your juice directly into your serving container.",
        "Enjoy your strawberry juice.",
        "You can either chill your juice in the refrigerator for a couple hours before serving, or add a few ice cubes to a glass to serve immediately.",
        "Making Strawberry Syrup for Strawberry Juice Prepare your strawberries.",
        "Wash two pounds of fresh strawberries.",
        "Remove the stems and cut the strawberries in half.",
        "If your strawberries are frozen, allow to thaw before slicing in half.",
        "It is possible that using frozen strawberries in this method may alter the taste a little, so try to use fresh strawberries if you can.",
        "Put half of the chopped strawberries into a large bowl and cover with one cup of sugar.",
        "Top with the remaining chopped strawberries, and then cover those with the rest of the sugar.",
        "Cover the bowl with plastic wrap or foil paper and let sit in the refrigerator for 24 hours.",
        "After 24 hours, remove the bowl from the refrigerator and pour the mixture into a saucepan.",
        "A saucepan is deep cooking pan.",
        "If you don’t have one, a large pot will suffice.",
        "Put the pan on the stove and heat over medium-high heat.",
        "Keep a close eye on the mixture as it comes to a boil to prevent it from burning.",
        "When it begins to boil, reduce the heat and let it simmer for 30 minutes.",
        "While the mixture is simmering, wash the large bowl used for marinating the strawberry and sugar mixture.",
        "Place a sieve or strainer over the bowl.",
        "The mesh of the sieve or strainer should be fine to prevent the tiniest of food particles, like the seeds, from passing through.",
        "Once the mixture finishes simmering, carefully pour it through sieve to make sure it doesn’t splash or burn you.",
        "Once poured through, the cooked strawberries should be left in the sieve.",
        "Using a spatula or the back of a large spoon, smash the strawberries into the sieve to squeeze out any remaining juices.",
        "You now should have a bowl of hot strawberry syrup.",
        "Pour the strawberry syrup into a sterilized glass bottle.",
        "The sterilized bottle will ensure that the mixture lasts for longer than a few days in your refrigerator.",
        "If you have one, put a funnel cup inside the spout of the bottle to keep from spilling the syrup over the sides.",
        "If you don’t have a funnel cup, transfer the mixture into a container with a spout.",
        "This should make it easier to pour the syrup into the bottle without spilling it.",
        "Top the bottle with the sterilized cap and allow the bottle and the mixture to completely cool before storing in the refrigerator.",
        "To sterilize a glass bottle, wash the glass bottle and then place on a baking sheet in an oven preheated to 170 degrees.",
        "Let it sit for 30 minutes.",
        "Put the cap of the bottle in a small bowl and pour boiling water over it.",
        "This will sterilize it.",
        "Remove the bottle from the oven with an oven-mitt or thick towel to be safe.",
        "Wait until it is cool enough to touch before filling with the strawberry syrup.",
        "To make strawberry juice using the syrup, mix ¼- cup of the syrup with one cup of water.",
        "Add more strawberry syrup if you’d prefer it sweeter.",
        "Or add more water if it’s too sweet.",
        "You can spice up your strawberry juice by using soda water instead.",
        "Or if you’re having an evening event, use the strawberry syrup to make a strawberry cocktail."
    ]
}