{
    "title": "How to Make Homemade Yoghurt Thicker",
    "url": "https://www.wikihow.com/Make-Homemade-Yoghurt-Thicker",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Eggs and Dairy",
        "Yogurt"
    ],
    "steps": [
        {
            "headline": "Use fat free milk to help make your yoghurt thicker.",
            "description": "Try fat free milk and you will notice that it makes a thicker yoghurt than regular milk."
        },
        {
            "headline": "Add 1/2 cup of milk powder to the milk before you start heating it.",
            "description": "This, too, helps thicken the final product."
        },
        {
            "headline": "Heat the milk to a higher temperature - 200ºF (95ºC).",
            "description": "Keep the milk at the higher temperature for a full 20 minutes, stirring occasionally and monitoring continually. This is a higher temperature than is normally recommended and allows the moisture in the milk to evaporate, resulting in a thicker yoghurt. If you have one, use a double boiler as this will make it easier to maintain the temperature with little stirring. Make sure to use an accurate thermometer that covers the temperature range 90-212ºF (30-100ºC) and do not let the milk get too hot or become scorched. A candy thermometer is great for this."
        },
        {
            "headline": "Allow the milk to cool sufficiently, then add the yoghurt culture.",
            "description": "It is best to use cold running water reduce the temperature below 120ºF (50ºC), but don't let it to go below 90ºF (32ºC)."
        },
        {
            "headline": "Let the yoghurt sit for a minimum of seven hours at a temperature close to 110ºF (45ºC).",
            "description": "The longer the yoghurt sits, the thicker it will become, so let it sit longer than you normally would, certainly for at least seven hours."
        },
        {
            "headline": "Strain the yoghurt for a longer time.",
            "description": "It is very important to strain the yoghurt through a colander lined with cheesecloth to remove whey, the yellowish, watery liquid in the yoghurt. Place the strainer over a bowl to catch the whey and place the assembly in your refrigerator during the straining process. You can strain it for a few minutes or overnight, depending on how thick you want it to be - the longer, the better for creating thick yoghurt."
        },
        {
            "headline": "Use the yoghurt from this batch to start the next batch.",
            "description": ""
        }
    ],
    "tyn": [
        "Pot - a double boiler is optional (",
        "make your own with two pots",
        ")",
        "Spoon - wooden or metal",
        "Candy thermometer",
        "Containers with lid"
    ],
    "text": " Use fat free milk to help make your yoghurt thicker. Try fat free milk and you will notice that it makes a thicker yoghurt than regular milk. Add 1/2 cup of milk powder to the milk before you start heating it. This, too, helps thicken the final product. Heat the milk to a higher temperature - 200ºF (95ºC). Keep the milk at the higher temperature for a full 20 minutes, stirring occasionally and monitoring continually. This is a higher temperature than is normally recommended and allows the moisture in the milk to evaporate, resulting in a thicker yoghurt. If you have one, use a double boiler as this will make it easier to maintain the temperature with little stirring. Make sure to use an accurate thermometer that covers the temperature range 90-212ºF (30-100ºC) and do not let the milk get too hot or become scorched. A candy thermometer is great for this. Allow the milk to cool sufficiently, then add the yoghurt culture. It is best to use cold running water reduce the temperature below 120ºF (50ºC), but don't let it to go below 90ºF (32ºC). Let the yoghurt sit for a minimum of seven hours at a temperature close to 110ºF (45ºC). The longer the yoghurt sits, the thicker it will become, so let it sit longer than you normally would, certainly for at least seven hours. Strain the yoghurt for a longer time. It is very important to strain the yoghurt through a colander lined with cheesecloth to remove whey, the yellowish, watery liquid in the yoghurt. Place the strainer over a bowl to catch the whey and place the assembly in your refrigerator during the straining process. You can strain it for a few minutes or overnight, depending on how thick you want it to be - the longer, the better for creating thick yoghurt. Use the yoghurt from this batch to start the next batch. ",
    "sentences": [
        " Use fat free milk to help make your yoghurt thicker.",
        "Try fat free milk and you will notice that it makes a thicker yoghurt than regular milk.",
        "Add 1/2 cup of milk powder to the milk before you start heating it.",
        "This, too, helps thicken the final product.",
        "Heat the milk to a higher temperature - 200ºF (95ºC).",
        "Keep the milk at the higher temperature for a full 20 minutes, stirring occasionally and monitoring continually.",
        "This is a higher temperature than is normally recommended and allows the moisture in the milk to evaporate, resulting in a thicker yoghurt.",
        "If you have one, use a double boiler as this will make it easier to maintain the temperature with little stirring.",
        "Make sure to use an accurate thermometer that covers the temperature range 90-212ºF (30-100ºC) and do not let the milk get too hot or become scorched.",
        "A candy thermometer is great for this.",
        "Allow the milk to cool sufficiently, then add the yoghurt culture.",
        "It is best to use cold running water reduce the temperature below 120ºF (50ºC), but don't let it to go below 90ºF (32ºC).",
        "Let the yoghurt sit for a minimum of seven hours at a temperature close to 110ºF (45ºC).",
        "The longer the yoghurt sits, the thicker it will become, so let it sit longer than you normally would, certainly for at least seven hours.",
        "Strain the yoghurt for a longer time.",
        "It is very important to strain the yoghurt through a colander lined with cheesecloth to remove whey, the yellowish, watery liquid in the yoghurt.",
        "Place the strainer over a bowl to catch the whey and place the assembly in your refrigerator during the straining process.",
        "You can strain it for a few minutes or overnight, depending on how thick you want it to be - the longer, the better for creating thick yoghurt.",
        "Use the yoghurt from this batch to start the next batch."
    ]
}