{
    "title": "How to Redeem Unused Gift Cards",
    "url": "https://www.wikihow.com/Redeem-Unused-Gift-Cards",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Gift Giving",
        "Gifts by Type"
    ],
    "methods": [
        {
            "name": "Redeeming Amazon Gift Cards",
            "steps": [
                {
                    "headline": "Find your Amazon Gift Card in physical or virtual form.",
                    "description": "If you were sent a gift card by email, there is no need to print it out. Amazon gift cards are widely distributed via email, Facebook and plastic card."
                },
                {
                    "headline": "Look for the claim code.",
                    "description": "This is a 16-digit number on the email receipt or on the back of the plastic gift card. If you are using a plastic card, you may need to scratch off the strip of coating to see the number."
                },
                {
                    "headline": "Sign into your Amazon account.",
                    "description": "If you don't have one, you should create an account and confirm it using your email. Unlike other gift cards, Amazon's cards are stored in your online account once entered, instead of on the card itself."
                },
                {
                    "headline": "Click on “My Account” in the upper right hand corner.",
                    "description": "Click the link that says, “Apply a Gift Card to Your Account.”"
                },
                {
                    "headline": "Enter the 16-digit claim code.",
                    "description": "Once you are finished, click “Apply to your Account.” The gift card balance will be applied to your account and used on your next purchase before other forms of payment."
                },
                {
                    "headline": "Opt to enter the claim code when you make a purchase, instead of applying it to your account if you plan to spend the whole thing immediately.",
                    "description": "You can apply it during checkout."
                }
            ]
        },
        {
            "name": "Redeeming E-Commerce Gift Cards",
            "steps": [
                {
                    "headline": "Find your gift card.",
                    "description": "Look at the expiration date. As of 2009, gift cards can't expire within five years of the date they were issued. If it is older than five years ago, you can try to redeem it, but it may have already expired."
                },
                {
                    "headline": "Go to an Internet search engine and type in “Gift Card Balance.” You will see several websites that will help you find out your gift card balance if you don't already know it.",
                    "description": "Select your e-commerce retailer from the list and follow their link to the customer service line or website that will help you find your balance."
                },
                {
                    "headline": "Keep in mind that most gift cards charge an inactivity fee after the first year.",
                    "description": "It can be $2.50 or more per month. If your gift card is depleted, it is best to use it up before the next month's fee can be charged."
                },
                {
                    "headline": "Go to the website listed on the back of your gift card.",
                    "description": "Start shopping. Keep your balance in mind as you shop. With most large retailers, you can redeem your gift card through an application, website or retail location. Click “Redeem” on your app to enter the coupon code on the back of the card."
                },
                {
                    "headline": "Checkout of the e-commerce site.",
                    "description": "Click “Redeem Gift Card” or “Enter Coupon Code” before you pay with a credit card."
                },
                {
                    "headline": "Click “Enter” or “Ok” after you input the number on the back of the card.",
                    "description": "It should adjust your balance to reflect only the remaining charges after the gift card is used. Some gift cards will not apply the balance to your shipping charges."
                },
                {
                    "headline": "Enter your credit card number to charge the remainder of the purchase if applicable.",
                    "description": "Enter your shipping address and billing address, and then complete the order."
                },
                {
                    "headline": "Write down the order confirmation number.",
                    "description": "You should also receive an order confirmation number at your email address."
                }
            ]
        },
        {
            "name": "Redeeming Retail Location Gift Cards",
            "steps": [
                {
                    "headline": "Use your retail gift card at a location within one year of when it was purchased.",
                    "description": "Unless otherwise listed, it is likely to charge an inactivity fee of approximately $2.50 per month after the first year."
                },
                {
                    "headline": "Ask a store clerk to check the balance on your gift card.",
                    "description": "This way you will know how much you can spend with the remaining balance."
                },
                {
                    "headline": "Acquire your merchandise.",
                    "description": "Bring it to the till when you are done."
                },
                {
                    "headline": "Hand the clerk your gift card after they ring up your merchandise.",
                    "description": "They will swipe it like a credit card and deduct the purchase price."
                },
                {
                    "headline": "Take your card back if you have a remaining balance.",
                    "description": "You won't be charged an inactivity fee that month if you have used it."
                },
                {
                    "headline": "Give up empty gift cards to the clerk unless you plan to refill it.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Trading in Gift Cards",
            "steps": [
                {
                    "headline": "Decide if you can use your gift card.",
                    "description": "If you were given a gift card to an e-commerce site or retail location that you can't use, you can sell it on the Internet or trade it in."
                },
                {
                    "headline": "Go to Carpool .com, Giftcardgranny.com and giftcardbalancenow.com.",
                    "description": "It is a good idea to compare the amount of cash on each of these sites or similar sites so that you can get the largest percentage back."
                },
                {
                    "headline": "Click on the link that says “Sell Gift Card.” Find the store in the list of stores on the site.",
                    "description": "If it is not listed, either request to sell it through the customer service section or move on to another website that deals in those gift cards."
                },
                {
                    "headline": "Create an account.",
                    "description": "You will need a shipping address and email address."
                },
                {
                    "headline": "Enter information about your gift card.",
                    "description": "The site will check the balance and tell you how much you can gain in cash or trade on the site."
                },
                {
                    "headline": "Choose to get cash value or trade.",
                    "description": "You may be able to get more back through trade than with the cash option. Some sites let you choose the store you would like to trade for, while others will issue a trade to Amazon."
                },
                {
                    "headline": "Complete your transaction.",
                    "description": "Ship your gift card using the shipping label that is given."
                },
                {
                    "headline": "Receive your gift card via mail or email.",
                    "description": "Use it within the expiration date given."
                }
            ]
        }
    ],
    "tyn": [
        "Credit card"
    ],
    "text": " Redeeming Amazon Gift Cards Find your Amazon Gift Card in physical or virtual form. If you were sent a gift card by email, there is no need to print it out. Amazon gift cards are widely distributed via email, Facebook and plastic card. Look for the claim code. This is a 16-digit number on the email receipt or on the back of the plastic gift card. If you are using a plastic card, you may need to scratch off the strip of coating to see the number. Sign into your Amazon account. If you don't have one, you should create an account and confirm it using your email. Unlike other gift cards, Amazon's cards are stored in your online account once entered, instead of on the card itself. Click on “My Account” in the upper right hand corner. Click the link that says, “Apply a Gift Card to Your Account.” Enter the 16-digit claim code. Once you are finished, click “Apply to your Account.” The gift card balance will be applied to your account and used on your next purchase before other forms of payment. Opt to enter the claim code when you make a purchase, instead of applying it to your account if you plan to spend the whole thing immediately. You can apply it during checkout. Redeeming E-Commerce Gift Cards Find your gift card. Look at the expiration date. As of 2009, gift cards can't expire within five years of the date they were issued. If it is older than five years ago, you can try to redeem it, but it may have already expired. Go to an Internet search engine and type in “Gift Card Balance.” You will see several websites that will help you find out your gift card balance if you don't already know it. Select your e-commerce retailer from the list and follow their link to the customer service line or website that will help you find your balance. Keep in mind that most gift cards charge an inactivity fee after the first year. It can be $2.50 or more per month. If your gift card is depleted, it is best to use it up before the next month's fee can be charged. Go to the website listed on the back of your gift card. Start shopping. Keep your balance in mind as you shop. With most large retailers, you can redeem your gift card through an application, website or retail location. Click “Redeem” on your app to enter the coupon code on the back of the card. Checkout of the e-commerce site. Click “Redeem Gift Card” or “Enter Coupon Code” before you pay with a credit card. Click “Enter” or “Ok” after you input the number on the back of the card. It should adjust your balance to reflect only the remaining charges after the gift card is used. Some gift cards will not apply the balance to your shipping charges. Enter your credit card number to charge the remainder of the purchase if applicable. Enter your shipping address and billing address, and then complete the order. Write down the order confirmation number. You should also receive an order confirmation number at your email address. Redeeming Retail Location Gift Cards Use your retail gift card at a location within one year of when it was purchased. Unless otherwise listed, it is likely to charge an inactivity fee of approximately $2.50 per month after the first year. Ask a store clerk to check the balance on your gift card. This way you will know how much you can spend with the remaining balance. Acquire your merchandise. Bring it to the till when you are done. Hand the clerk your gift card after they ring up your merchandise. They will swipe it like a credit card and deduct the purchase price. Take your card back if you have a remaining balance. You won't be charged an inactivity fee that month if you have used it. Give up empty gift cards to the clerk unless you plan to refill it.  Trading in Gift Cards Decide if you can use your gift card. If you were given a gift card to an e-commerce site or retail location that you can't use, you can sell it on the Internet or trade it in. Go to Carpool .com, Giftcardgranny.com and giftcardbalancenow.com. It is a good idea to compare the amount of cash on each of these sites or similar sites so that you can get the largest percentage back. Click on the link that says “Sell Gift Card.” Find the store in the list of stores on the site. If it is not listed, either request to sell it through the customer service section or move on to another website that deals in those gift cards. Create an account. You will need a shipping address and email address. Enter information about your gift card. The site will check the balance and tell you how much you can gain in cash or trade on the site. Choose to get cash value or trade. You may be able to get more back through trade than with the cash option. Some sites let you choose the store you would like to trade for, while others will issue a trade to Amazon. Complete your transaction. Ship your gift card using the shipping label that is given. Receive your gift card via mail or email. Use it within the expiration date given.",
    "sentences": [
        " Redeeming Amazon Gift Cards Find your Amazon Gift Card in physical or virtual form.",
        "If you were sent a gift card by email, there is no need to print it out.",
        "Amazon gift cards are widely distributed via email, Facebook and plastic card.",
        "Look for the claim code.",
        "This is a 16-digit number on the email receipt or on the back of the plastic gift card.",
        "If you are using a plastic card, you may need to scratch off the strip of coating to see the number.",
        "Sign into your Amazon account.",
        "If you don't have one, you should create an account and confirm it using your email.",
        "Unlike other gift cards, Amazon's cards are stored in your online account once entered, instead of on the card itself.",
        "Click on “My Account” in the upper right hand corner.",
        "Click the link that says, “Apply a Gift Card to Your Account.” Enter the 16-digit claim code.",
        "Once you are finished, click “Apply to your Account.” The gift card balance will be applied to your account and used on your next purchase before other forms of payment.",
        "Opt to enter the claim code when you make a purchase, instead of applying it to your account if you plan to spend the whole thing immediately.",
        "You can apply it during checkout.",
        "Redeeming E-Commerce Gift Cards Find your gift card.",
        "Look at the expiration date.",
        "As of 2009, gift cards can't expire within five years of the date they were issued.",
        "If it is older than five years ago, you can try to redeem it, but it may have already expired.",
        "Go to an Internet search engine and type in “Gift Card Balance.” You will see several websites that will help you find out your gift card balance if you don't already know it.",
        "Select your e-commerce retailer from the list and follow their link to the customer service line or website that will help you find your balance.",
        "Keep in mind that most gift cards charge an inactivity fee after the first year.",
        "It can be $2.50 or more per month.",
        "If your gift card is depleted, it is best to use it up before the next month's fee can be charged.",
        "Go to the website listed on the back of your gift card.",
        "Start shopping.",
        "Keep your balance in mind as you shop.",
        "With most large retailers, you can redeem your gift card through an application, website or retail location.",
        "Click “Redeem” on your app to enter the coupon code on the back of the card.",
        "Checkout of the e-commerce site.",
        "Click “Redeem Gift Card” or “Enter Coupon Code” before you pay with a credit card.",
        "Click “Enter” or “Ok” after you input the number on the back of the card.",
        "It should adjust your balance to reflect only the remaining charges after the gift card is used.",
        "Some gift cards will not apply the balance to your shipping charges.",
        "Enter your credit card number to charge the remainder of the purchase if applicable.",
        "Enter your shipping address and billing address, and then complete the order.",
        "Write down the order confirmation number.",
        "You should also receive an order confirmation number at your email address.",
        "Redeeming Retail Location Gift Cards Use your retail gift card at a location within one year of when it was purchased.",
        "Unless otherwise listed, it is likely to charge an inactivity fee of approximately $2.50 per month after the first year.",
        "Ask a store clerk to check the balance on your gift card.",
        "This way you will know how much you can spend with the remaining balance.",
        "Acquire your merchandise.",
        "Bring it to the till when you are done.",
        "Hand the clerk your gift card after they ring up your merchandise.",
        "They will swipe it like a credit card and deduct the purchase price.",
        "Take your card back if you have a remaining balance.",
        "You won't be charged an inactivity fee that month if you have used it.",
        "Give up empty gift cards to the clerk unless you plan to refill it.",
        "Trading in Gift Cards Decide if you can use your gift card.",
        "If you were given a gift card to an e-commerce site or retail location that you can't use, you can sell it on the Internet or trade it in.",
        "Go to Carpool .com, Giftcardgranny.com and giftcardbalancenow.com.",
        "It is a good idea to compare the amount of cash on each of these sites or similar sites so that you can get the largest percentage back.",
        "Click on the link that says “Sell Gift Card.” Find the store in the list of stores on the site.",
        "If it is not listed, either request to sell it through the customer service section or move on to another website that deals in those gift cards.",
        "Create an account.",
        "You will need a shipping address and email address.",
        "Enter information about your gift card.",
        "The site will check the balance and tell you how much you can gain in cash or trade on the site.",
        "Choose to get cash value or trade.",
        "You may be able to get more back through trade than with the cash option.",
        "Some sites let you choose the store you would like to trade for, while others will issue a trade to Amazon.",
        "Complete your transaction.",
        "Ship your gift card using the shipping label that is given.",
        "Receive your gift card via mail or email.",
        "Use it within the expiration date given."
    ]
}