{
    "title": "How to Make a Lace Candleholder",
    "url": "https://www.wikihow.com/Make-a-Lace-Candleholder",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Decoration Projects"
    ],
    "methods": [
        {
            "name": "Making a Doily Candleholder",
            "steps": [
                {
                    "headline": "Choose a bowl to use as the mold for your candleholder.",
                    "description": "You will be wrapping the doily over the bottom of the bowl, so make sure that it is the right size for you. You can use a balloon too. Be aware that the candleholder won't be stable due to its curved bottom."
                },
                {
                    "headline": "Turn the bowl upside down.",
                    "description": "If you want to, you can cover the bowl with a sheet of plastic wrap. This will help keep the glue from sticking to the glass. It would also be a good idea to lay down a sheet of wax paper or parchment paper under the bowl to keep your work surface clean. If you are using a balloon, set down into a bowl so that it is stable. You can also coat it with petroleum jelly to keep the doily from sticking."
                },
                {
                    "headline": "Soak a crocheted, lace doily in fabric stiffener.",
                    "description": "Pour some fabric stiffener into another bowl or plastic container. Dip the doily inside, soak it, then pull it out. Let the excess fabric stiffener drip back into the bowl. If you don't have any fabric stiffener, you can also use decoupage glue (ie: Mod Podge) or wallpaper glue. You can also make your own glue by mixing equal parts of white school glue and water."
                },
                {
                    "headline": "Drape the doily across the top of the bowl.",
                    "description": "Smooth the doily against the surface of the bowl so that you don't have any wrinkles. Be sure to press out as much excess fabric stiffener as you can. For a larger candleholder, feel free to use more doilies and overlap them."
                },
                {
                    "headline": "Allow the fabric stiffener to dry.",
                    "description": "This can take at least a day, depending on the weather and temperature. The hotter and drier it is, the faster the stiffener will dry. It must be completely dry before you move onto the next step."
                },
                {
                    "headline": "Peel the stiffened doily off of the bowl and invert it.",
                    "description": "If you used plastic wrap earlier, it might have gotten stuck to the doily. In this case, simply peel the plastic wrap away. If the doily is still damp inside, let it finish drying. If you used a balloon, peel the doily away from the balloon. Do not pop the balloon while the doily is still on it, or you will risk warping it."
                },
                {
                    "headline": "Use the candleholder.",
                    "description": "Because you used real fabric for this, it would be safest to use only battery-operated candles. You can get them in both tea light and votive form from the arts and crafts store."
                }
            ]
        },
        {
            "name": "Making a Lace Wrapped Candleholder",
            "steps": [
                {
                    "headline": "Wipe the candleholder with rubbing alcohol.",
                    "description": "This will remove any dirt or oils that may prevent the glue from sticking. Once you have the candleholder clean, avoid touching it on the outside as much as possible. The candleholder needs to have straight, vertical walls. It can be round, square, or rectangular, however."
                },
                {
                    "headline": "Choose a crocheted lace trim that's shorter than your candleholder.",
                    "description": "Crocheted lace is thicker than ordinary lace. It is straight along one edge, and scalloped or pointed along the other. Look for something that is half or three-quarters of the candleholder's height."
                },
                {
                    "headline": "Cut the lace long enough to wrap around the candleholder.",
                    "description": "Make sure that you cut the lace a little bit longer to allow for some overlap. About 1/4 inch (0.64 centimeter) would be idea."
                },
                {
                    "headline": "Glue the bottom edge of the lace to the bottom edge of the candleholder.",
                    "description": "Working an inch (2.54 centimeters) at a time, make a thin line of glue along the bottom edge of your candleholder, then press the flat edge of the lace into it. Work your way along the bottom edge of the candleholder until you are back to where you started. For a twist, glue the flat edge of the lace to the top edge of the glass, with the design pointing down. Use a strong glue, such as E6000, super glue, or fabric glue. You can use hot glue, but only if you'll be using battery-operated candled. Real candles will melt the glue."
                },
                {
                    "headline": "Glue down the seam.",
                    "description": "Pull away the ends of the lace enough to see the glass. Lay down another line of glue, then press the edges of the lace back into place. For a neater finish, you can glue down the top edge of the lace as well. Apply the glue directly to the lace, then press it against the glass."
                },
                {
                    "headline": "Let the glue dry.",
                    "description": "How long this takes depends on the type of glue you are using. Super glue and fabric glue both dry fast. Industrial strength glues, such as E6000, take much longer to dry, and often include a curing time."
                },
                {
                    "headline": "Use the candleholder.",
                    "description": "Because the lace is on the outside, you can use both real and battery-operated candles. To really see the glow, choose a short candle that falls below the lace. A tea light will work the best, but a votive may work for taller candleholders. If you used hot glue, use a battery-operated candle."
                }
            ]
        },
        {
            "name": "Making a Lace Covered Candleholder",
            "steps": [
                {
                    "headline": "Measure the height and circumference of the candleholder.",
                    "description": "Choose a candleholder with straight, vertical walls. Use a measuring tape to get the height, then wrap the measuring tape around it to get the circumference. The candleholder can be round, square, or even rectangular, but the walls need to be straight."
                },
                {
                    "headline": "Cut the lace a little bigger than you need.",
                    "description": "In most cases, you will need to buy lace fabric from the fabric store. If you are covering a very short candleholder, however, wide lace trim might be big enough."
                },
                {
                    "headline": "Wipe the candleholder down with rubbing alcohol.",
                    "description": "Glass is a smooth surface, which makes it difficult for glue to stick to. The rubbing alcohol will get rid of any dust or oils that might keep the glue from sticking. Avoid touching the outside of the candleholder from now on."
                },
                {
                    "headline": "Coat the candleholder with decoupage glue.",
                    "description": "Choose a decoupage glue, such a Mod Podge. Apply it to the outside of the candleholder with a paintbrush or a foam brush. If you need to, hold the candleholder from the inside. A glossy finish will look the best, but a matte finish will give you a \"sea glass\" effect."
                },
                {
                    "headline": "Wrap the lace firmly around the candleholder.",
                    "description": "Overlap the narrow ends and press down the seam. Smooth down any air bubbles or wrinkles. Make sure that the bottom edge is flush with the bottom edge of the candleholder. This way, you only have to trim off the excess from the top edge."
                },
                {
                    "headline": "Coat the lace with more decoupage glue.",
                    "description": "Again, hold the candleholder from the inside if you need to. Be sure to extend the glue over the top and bottom edges of the candleholder. Work on a sheet of wax paper or parchment paper. This will reduce the chances of the candleholder sticking."
                },
                {
                    "headline": "Let the candleholder dry before trimming off the excess lace.",
                    "description": "It may take a few hours for the decoupage glue to dry. Once it has dried, hold a pair of scissors parallel to the rim of the candleholder, and cut away any excess lace."
                },
                {
                    "headline": "Use the candleholder.",
                    "description": "Because the lace is on the outside, you may be able to use the candleholder with real candles. If you are worried, however, you can always use battery-operated candles instead. Use short candles, such as tea lights or votives, to experience the true glow of the lace."
                }
            ]
        },
        {
            "name": "Making a Stenciled Lace Candleholder",
            "steps": [
                {
                    "headline": "Wipe down a glass candleholder with rubbing alcohol.",
                    "description": "Glass is a tricky surface to paint because of how smooth it is. The rubbing alcohol will get rid of any dirt or oils that might prevent the paint from sticking. From now on, avoid touching the outside of the holder as much as possible. Choose a square, rectangular, or round candleholder with straight walls. This will make it easier to wrap the lace."
                },
                {
                    "headline": "Cut a strip of lace long enough to wrap around your candleholder.",
                    "description": "How wide the lace is depends on how wide you want the design to be. It can go a quarter of the way up the candleholder, halfway, or even all the way. You will be using the lace as a stencil, so pay more attention to the design than the color."
                },
                {
                    "headline": "Wrap the lace tightly around the candleholder and secure it with tape.",
                    "description": "Place the tape vertically down the seam between the two edges of the lace. This way, you won't cover to much of the deign. If your lace is shorter than the candleholder, make sure that you place it where you want the design to go: top, bottom, or middle?"
                },
                {
                    "headline": "Take the candleholder to a well-ventilated area.",
                    "description": "Outside will be the best. If you can't work outdoors, a large room with open windows will be your next best option. Cover your work surface with newspaper, plastic, or anything else that can get paint on it. For a neater finish, stuff the inside of your candleholder with newspaper."
                },
                {
                    "headline": "Coat the candleholder with spray paint.",
                    "description": "A metallic color, such as gold or silver, will look beautiful. You can also use a flat color, such as black or white. Another option would be to use a \"frosted glass\" spray paint that mimics the look of frosted glass. Make sure that you coat the lace as well, but be careful not to soak it."
                },
                {
                    "headline": "Allow the paint to dry before removing the lace.",
                    "description": "Spray paint dries quickly, depending on the weather. In most cases, it will be ready in about 20 minutes. Once the lace is dry, pull the tape off, then peel the lace away to reveal your stenciled design."
                },
                {
                    "headline": "Use the candleholder.",
                    "description": "You can use real or battery-operated candles for this. Short candles, such as tea lights, will allow the light to glow through the stenciled design, but you can use a regular votive candle too."
                }
            ]
        }
    ],
    "tyn": [
        "Making a Doily Candleholder",
        "Crocheted lace doilies",
        "Fabric stiffener",
        "Bowl",
        "Battery-operated candles",
        "Making a Lace Wrapped Candleholder",
        "Glass candleholder with straight walls",
        "Crocheted lace trim",
        "Scissors",
        "Rubbing alcohol",
        "Strong glue",
        "Tea light or votive candle",
        "Making a Lace Covered Candleholder",
        "Measuring tape",
        "Lace fabric",
        "Decoupage glue",
        "Paintbrush",
        "Making a Stenciled Lace Candleholder",
        "Lace",
        "Tape",
        "Newspaper",
        "Spray paint"
    ],
    "text": " Making a Doily Candleholder Choose a bowl to use as the mold for your candleholder. You will be wrapping the doily over the bottom of the bowl, so make sure that it is the right size for you. You can use a balloon too. Be aware that the candleholder won't be stable due to its curved bottom. Turn the bowl upside down. If you want to, you can cover the bowl with a sheet of plastic wrap. This will help keep the glue from sticking to the glass. It would also be a good idea to lay down a sheet of wax paper or parchment paper under the bowl to keep your work surface clean. If you are using a balloon, set down into a bowl so that it is stable. You can also coat it with petroleum jelly to keep the doily from sticking. Soak a crocheted, lace doily in fabric stiffener. Pour some fabric stiffener into another bowl or plastic container. Dip the doily inside, soak it, then pull it out. Let the excess fabric stiffener drip back into the bowl. If you don't have any fabric stiffener, you can also use decoupage glue (ie: Mod Podge) or wallpaper glue. You can also make your own glue by mixing equal parts of white school glue and water. Drape the doily across the top of the bowl. Smooth the doily against the surface of the bowl so that you don't have any wrinkles. Be sure to press out as much excess fabric stiffener as you can. For a larger candleholder, feel free to use more doilies and overlap them. Allow the fabric stiffener to dry. This can take at least a day, depending on the weather and temperature. The hotter and drier it is, the faster the stiffener will dry. It must be completely dry before you move onto the next step. Peel the stiffened doily off of the bowl and invert it. If you used plastic wrap earlier, it might have gotten stuck to the doily. In this case, simply peel the plastic wrap away. If the doily is still damp inside, let it finish drying. If you used a balloon, peel the doily away from the balloon. Do not pop the balloon while the doily is still on it, or you will risk warping it. Use the candleholder. Because you used real fabric for this, it would be safest to use only battery-operated candles. You can get them in both tea light and votive form from the arts and crafts store. Making a Lace Wrapped Candleholder Wipe the candleholder with rubbing alcohol. This will remove any dirt or oils that may prevent the glue from sticking. Once you have the candleholder clean, avoid touching it on the outside as much as possible. The candleholder needs to have straight, vertical walls. It can be round, square, or rectangular, however. Choose a crocheted lace trim that's shorter than your candleholder. Crocheted lace is thicker than ordinary lace. It is straight along one edge, and scalloped or pointed along the other. Look for something that is half or three-quarters of the candleholder's height. Cut the lace long enough to wrap around the candleholder. Make sure that you cut the lace a little bit longer to allow for some overlap. About 1/4 inch (0.64 centimeter) would be idea. Glue the bottom edge of the lace to the bottom edge of the candleholder. Working an inch (2.54 centimeters) at a time, make a thin line of glue along the bottom edge of your candleholder, then press the flat edge of the lace into it. Work your way along the bottom edge of the candleholder until you are back to where you started. For a twist, glue the flat edge of the lace to the top edge of the glass, with the design pointing down. Use a strong glue, such as E6000, super glue, or fabric glue. You can use hot glue, but only if you'll be using battery-operated candled. Real candles will melt the glue. Glue down the seam. Pull away the ends of the lace enough to see the glass. Lay down another line of glue, then press the edges of the lace back into place. For a neater finish, you can glue down the top edge of the lace as well. Apply the glue directly to the lace, then press it against the glass. Let the glue dry. How long this takes depends on the type of glue you are using. Super glue and fabric glue both dry fast. Industrial strength glues, such as E6000, take much longer to dry, and often include a curing time. Use the candleholder. Because the lace is on the outside, you can use both real and battery-operated candles. To really see the glow, choose a short candle that falls below the lace. A tea light will work the best, but a votive may work for taller candleholders. If you used hot glue, use a battery-operated candle. Making a Lace Covered Candleholder Measure the height and circumference of the candleholder. Choose a candleholder with straight, vertical walls. Use a measuring tape to get the height, then wrap the measuring tape around it to get the circumference. The candleholder can be round, square, or even rectangular, but the walls need to be straight. Cut the lace a little bigger than you need. In most cases, you will need to buy lace fabric from the fabric store. If you are covering a very short candleholder, however, wide lace trim might be big enough. Wipe the candleholder down with rubbing alcohol. Glass is a smooth surface, which makes it difficult for glue to stick to. The rubbing alcohol will get rid of any dust or oils that might keep the glue from sticking. Avoid touching the outside of the candleholder from now on. Coat the candleholder with decoupage glue. Choose a decoupage glue, such a Mod Podge. Apply it to the outside of the candleholder with a paintbrush or a foam brush. If you need to, hold the candleholder from the inside. A glossy finish will look the best, but a matte finish will give you a \"sea glass\" effect. Wrap the lace firmly around the candleholder. Overlap the narrow ends and press down the seam. Smooth down any air bubbles or wrinkles. Make sure that the bottom edge is flush with the bottom edge of the candleholder. This way, you only have to trim off the excess from the top edge. Coat the lace with more decoupage glue. Again, hold the candleholder from the inside if you need to. Be sure to extend the glue over the top and bottom edges of the candleholder. Work on a sheet of wax paper or parchment paper. This will reduce the chances of the candleholder sticking. Let the candleholder dry before trimming off the excess lace. It may take a few hours for the decoupage glue to dry. Once it has dried, hold a pair of scissors parallel to the rim of the candleholder, and cut away any excess lace. Use the candleholder. Because the lace is on the outside, you may be able to use the candleholder with real candles. If you are worried, however, you can always use battery-operated candles instead. Use short candles, such as tea lights or votives, to experience the true glow of the lace. Making a Stenciled Lace Candleholder Wipe down a glass candleholder with rubbing alcohol. Glass is a tricky surface to paint because of how smooth it is. The rubbing alcohol will get rid of any dirt or oils that might prevent the paint from sticking. From now on, avoid touching the outside of the holder as much as possible. Choose a square, rectangular, or round candleholder with straight walls. This will make it easier to wrap the lace. Cut a strip of lace long enough to wrap around your candleholder. How wide the lace is depends on how wide you want the design to be. It can go a quarter of the way up the candleholder, halfway, or even all the way. You will be using the lace as a stencil, so pay more attention to the design than the color. Wrap the lace tightly around the candleholder and secure it with tape. Place the tape vertically down the seam between the two edges of the lace. This way, you won't cover to much of the deign. If your lace is shorter than the candleholder, make sure that you place it where you want the design to go: top, bottom, or middle? Take the candleholder to a well-ventilated area. Outside will be the best. If you can't work outdoors, a large room with open windows will be your next best option. Cover your work surface with newspaper, plastic, or anything else that can get paint on it. For a neater finish, stuff the inside of your candleholder with newspaper. Coat the candleholder with spray paint. A metallic color, such as gold or silver, will look beautiful. You can also use a flat color, such as black or white. Another option would be to use a \"frosted glass\" spray paint that mimics the look of frosted glass. Make sure that you coat the lace as well, but be careful not to soak it. Allow the paint to dry before removing the lace. Spray paint dries quickly, depending on the weather. In most cases, it will be ready in about 20 minutes. Once the lace is dry, pull the tape off, then peel the lace away to reveal your stenciled design. Use the candleholder. You can use real or battery-operated candles for this. Short candles, such as tea lights, will allow the light to glow through the stenciled design, but you can use a regular votive candle too.",
    "sentences": [
        " Making a Doily Candleholder Choose a bowl to use as the mold for your candleholder.",
        "You will be wrapping the doily over the bottom of the bowl, so make sure that it is the right size for you.",
        "You can use a balloon too.",
        "Be aware that the candleholder won't be stable due to its curved bottom.",
        "Turn the bowl upside down.",
        "If you want to, you can cover the bowl with a sheet of plastic wrap.",
        "This will help keep the glue from sticking to the glass.",
        "It would also be a good idea to lay down a sheet of wax paper or parchment paper under the bowl to keep your work surface clean.",
        "If you are using a balloon, set down into a bowl so that it is stable.",
        "You can also coat it with petroleum jelly to keep the doily from sticking.",
        "Soak a crocheted, lace doily in fabric stiffener.",
        "Pour some fabric stiffener into another bowl or plastic container.",
        "Dip the doily inside, soak it, then pull it out.",
        "Let the excess fabric stiffener drip back into the bowl.",
        "If you don't have any fabric stiffener, you can also use decoupage glue (ie: Mod Podge) or wallpaper glue.",
        "You can also make your own glue by mixing equal parts of white school glue and water.",
        "Drape the doily across the top of the bowl.",
        "Smooth the doily against the surface of the bowl so that you don't have any wrinkles.",
        "Be sure to press out as much excess fabric stiffener as you can.",
        "For a larger candleholder, feel free to use more doilies and overlap them.",
        "Allow the fabric stiffener to dry.",
        "This can take at least a day, depending on the weather and temperature.",
        "The hotter and drier it is, the faster the stiffener will dry.",
        "It must be completely dry before you move onto the next step.",
        "Peel the stiffened doily off of the bowl and invert it.",
        "If you used plastic wrap earlier, it might have gotten stuck to the doily.",
        "In this case, simply peel the plastic wrap away.",
        "If the doily is still damp inside, let it finish drying.",
        "If you used a balloon, peel the doily away from the balloon.",
        "Do not pop the balloon while the doily is still on it, or you will risk warping it.",
        "Use the candleholder.",
        "Because you used real fabric for this, it would be safest to use only battery-operated candles.",
        "You can get them in both tea light and votive form from the arts and crafts store.",
        "Making a Lace Wrapped Candleholder Wipe the candleholder with rubbing alcohol.",
        "This will remove any dirt or oils that may prevent the glue from sticking.",
        "Once you have the candleholder clean, avoid touching it on the outside as much as possible.",
        "The candleholder needs to have straight, vertical walls.",
        "It can be round, square, or rectangular, however.",
        "Choose a crocheted lace trim that's shorter than your candleholder.",
        "Crocheted lace is thicker than ordinary lace.",
        "It is straight along one edge, and scalloped or pointed along the other.",
        "Look for something that is half or three-quarters of the candleholder's height.",
        "Cut the lace long enough to wrap around the candleholder.",
        "Make sure that you cut the lace a little bit longer to allow for some overlap.",
        "About 1/4 inch (0.64 centimeter) would be idea.",
        "Glue the bottom edge of the lace to the bottom edge of the candleholder.",
        "Working an inch (2.54 centimeters) at a time, make a thin line of glue along the bottom edge of your candleholder, then press the flat edge of the lace into it.",
        "Work your way along the bottom edge of the candleholder until you are back to where you started.",
        "For a twist, glue the flat edge of the lace to the top edge of the glass, with the design pointing down.",
        "Use a strong glue, such as E6000, super glue, or fabric glue.",
        "You can use hot glue, but only if you'll be using battery-operated candled.",
        "Real candles will melt the glue.",
        "Glue down the seam.",
        "Pull away the ends of the lace enough to see the glass.",
        "Lay down another line of glue, then press the edges of the lace back into place.",
        "For a neater finish, you can glue down the top edge of the lace as well.",
        "Apply the glue directly to the lace, then press it against the glass.",
        "Let the glue dry.",
        "How long this takes depends on the type of glue you are using.",
        "Super glue and fabric glue both dry fast.",
        "Industrial strength glues, such as E6000, take much longer to dry, and often include a curing time.",
        "Use the candleholder.",
        "Because the lace is on the outside, you can use both real and battery-operated candles.",
        "To really see the glow, choose a short candle that falls below the lace.",
        "A tea light will work the best, but a votive may work for taller candleholders.",
        "If you used hot glue, use a battery-operated candle.",
        "Making a Lace Covered Candleholder Measure the height and circumference of the candleholder.",
        "Choose a candleholder with straight, vertical walls.",
        "Use a measuring tape to get the height, then wrap the measuring tape around it to get the circumference.",
        "The candleholder can be round, square, or even rectangular, but the walls need to be straight.",
        "Cut the lace a little bigger than you need.",
        "In most cases, you will need to buy lace fabric from the fabric store.",
        "If you are covering a very short candleholder, however, wide lace trim might be big enough.",
        "Wipe the candleholder down with rubbing alcohol.",
        "Glass is a smooth surface, which makes it difficult for glue to stick to.",
        "The rubbing alcohol will get rid of any dust or oils that might keep the glue from sticking.",
        "Avoid touching the outside of the candleholder from now on.",
        "Coat the candleholder with decoupage glue.",
        "Choose a decoupage glue, such a Mod Podge.",
        "Apply it to the outside of the candleholder with a paintbrush or a foam brush.",
        "If you need to, hold the candleholder from the inside.",
        "A glossy finish will look the best, but a matte finish will give you a \"sea glass\" effect.",
        "Wrap the lace firmly around the candleholder.",
        "Overlap the narrow ends and press down the seam.",
        "Smooth down any air bubbles or wrinkles.",
        "Make sure that the bottom edge is flush with the bottom edge of the candleholder.",
        "This way, you only have to trim off the excess from the top edge.",
        "Coat the lace with more decoupage glue.",
        "Again, hold the candleholder from the inside if you need to.",
        "Be sure to extend the glue over the top and bottom edges of the candleholder.",
        "Work on a sheet of wax paper or parchment paper.",
        "This will reduce the chances of the candleholder sticking.",
        "Let the candleholder dry before trimming off the excess lace.",
        "It may take a few hours for the decoupage glue to dry.",
        "Once it has dried, hold a pair of scissors parallel to the rim of the candleholder, and cut away any excess lace.",
        "Use the candleholder.",
        "Because the lace is on the outside, you may be able to use the candleholder with real candles.",
        "If you are worried, however, you can always use battery-operated candles instead.",
        "Use short candles, such as tea lights or votives, to experience the true glow of the lace.",
        "Making a Stenciled Lace Candleholder Wipe down a glass candleholder with rubbing alcohol.",
        "Glass is a tricky surface to paint because of how smooth it is.",
        "The rubbing alcohol will get rid of any dirt or oils that might prevent the paint from sticking.",
        "From now on, avoid touching the outside of the holder as much as possible.",
        "Choose a square, rectangular, or round candleholder with straight walls.",
        "This will make it easier to wrap the lace.",
        "Cut a strip of lace long enough to wrap around your candleholder.",
        "How wide the lace is depends on how wide you want the design to be.",
        "It can go a quarter of the way up the candleholder, halfway, or even all the way.",
        "You will be using the lace as a stencil, so pay more attention to the design than the color.",
        "Wrap the lace tightly around the candleholder and secure it with tape.",
        "Place the tape vertically down the seam between the two edges of the lace.",
        "This way, you won't cover to much of the deign.",
        "If your lace is shorter than the candleholder, make sure that you place it where you want the design to go: top, bottom, or middle?",
        "Take the candleholder to a well-ventilated area.",
        "Outside will be the best.",
        "If you can't work outdoors, a large room with open windows will be your next best option.",
        "Cover your work surface with newspaper, plastic, or anything else that can get paint on it.",
        "For a neater finish, stuff the inside of your candleholder with newspaper.",
        "Coat the candleholder with spray paint.",
        "A metallic color, such as gold or silver, will look beautiful.",
        "You can also use a flat color, such as black or white.",
        "Another option would be to use a \"frosted glass\" spray paint that mimics the look of frosted glass.",
        "Make sure that you coat the lace as well, but be careful not to soak it.",
        "Allow the paint to dry before removing the lace.",
        "Spray paint dries quickly, depending on the weather.",
        "In most cases, it will be ready in about 20 minutes.",
        "Once the lace is dry, pull the tape off, then peel the lace away to reveal your stenciled design.",
        "Use the candleholder.",
        "You can use real or battery-operated candles for this.",
        "Short candles, such as tea lights, will allow the light to glow through the stenciled design, but you can use a regular votive candle too."
    ]
}