{
    "title": "How to Make Simple Fondant Roses",
    "url": "https://www.wikihow.com/Make-Simple-Fondant-Roses",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Chocolate and Candy"
    ],
    "steps": [
        {
            "headline": "Roll out the fondant to a thickness of about 0.5 centimeter (0.2 in).",
            "description": "If you are colouring it, do this beforehand."
        },
        {
            "headline": "Cut a small teardrop shape.",
            "description": "This will be the centre of your rose, so change the size depending on how big you want your rose to be."
        },
        {
            "headline": "Wrap the teardrop vertically with the pointy end at the bottom around a toothpick.",
            "description": "Pinch at the bottom."
        },
        {
            "headline": "Cut out two teardrops slightly bigger than the last one.",
            "description": "Wrap this in the same manner around the first 'petal'."
        },
        {
            "headline": "Repeat.",
            "description": "Occasionally add another petal until your rose is the desired size. As you add more layers, make sure that they are not pressed right up against the last layer at the top."
        },
        {
            "headline": "Start gently pinching the edges and bending the layers outwards as you add each petal.",
            "description": "You can also make the rounded end of the tear drop wavy or uneven, to give the rose a more natural look."
        },
        {
            "headline": "Allow to dry.",
            "description": "Once you are happy with your rose, leave to dry in a cool, dry area, to prevent the fondant from becoming sticky, for one day. They can be left for less time, but this is for best results."
        },
        {
            "headline": "Use as required.",
            "description": "Once dried, the roses can be placed on cakes, cookies or other baked goods as needed."
        }
    ],
    "tyn": [
        "Rolling pin",
        "Marble board",
        "Cutting tool",
        "Toothpick",
        "Drying plate or tray"
    ],
    "text": " Roll out the fondant to a thickness of about 0.5 centimeter (0.2 in). If you are colouring it, do this beforehand. Cut a small teardrop shape. This will be the centre of your rose, so change the size depending on how big you want your rose to be. Wrap the teardrop vertically with the pointy end at the bottom around a toothpick. Pinch at the bottom. Cut out two teardrops slightly bigger than the last one. Wrap this in the same manner around the first 'petal'. Repeat. Occasionally add another petal until your rose is the desired size. As you add more layers, make sure that they are not pressed right up against the last layer at the top. Start gently pinching the edges and bending the layers outwards as you add each petal. You can also make the rounded end of the tear drop wavy or uneven, to give the rose a more natural look. Allow to dry. Once you are happy with your rose, leave to dry in a cool, dry area, to prevent the fondant from becoming sticky, for one day. They can be left for less time, but this is for best results. Use as required. Once dried, the roses can be placed on cakes, cookies or other baked goods as needed.",
    "sentences": [
        " Roll out the fondant to a thickness of about 0.5 centimeter (0.2 in).",
        "If you are colouring it, do this beforehand.",
        "Cut a small teardrop shape.",
        "This will be the centre of your rose, so change the size depending on how big you want your rose to be.",
        "Wrap the teardrop vertically with the pointy end at the bottom around a toothpick.",
        "Pinch at the bottom.",
        "Cut out two teardrops slightly bigger than the last one.",
        "Wrap this in the same manner around the first 'petal'.",
        "Repeat.",
        "Occasionally add another petal until your rose is the desired size.",
        "As you add more layers, make sure that they are not pressed right up against the last layer at the top.",
        "Start gently pinching the edges and bending the layers outwards as you add each petal.",
        "You can also make the rounded end of the tear drop wavy or uneven, to give the rose a more natural look.",
        "Allow to dry.",
        "Once you are happy with your rose, leave to dry in a cool, dry area, to prevent the fondant from becoming sticky, for one day.",
        "They can be left for less time, but this is for best results.",
        "Use as required.",
        "Once dried, the roses can be placed on cakes, cookies or other baked goods as needed."
    ]
}