{
    "title": "How to Get Rid of Cracked Heels Fast",
    "url": "https://www.wikihow.com/Get-Rid-of-Cracked-Heels-Fast",
    "category_hierarchy": [
        "Personal Care and Style",
        "Skin Care",
        "Skin Types",
        "Dry Skin Care"
    ],
    "parts": [
        {
            "name": "Understanding The Causes",
            "steps": [
                {
                    "headline": "Notice your skin's elasticity.",
                    "description": "The skin around your heels is prone to dryness which can be exacerbated by improper care. When the skin becomes too dry, it loses much of its elasticity. This can result in cracked heels, and other ailments, over time. Dry, flaky skin can be a result of climate, such as very dry summers and/or cold winters."
                },
                {
                    "headline": "Beware of excess weight.",
                    "description": "Being overweight, or pregnancy, can cause severe calluses. Increased weight intensifies pressure on the feet, particularly on the heels, and this frequently results in one or more calluses. Keep in mind that the extra weight requires more expansion of the heel, which usually results in cracking or splitting of the skin through the callus."
                },
                {
                    "headline": "Avoid certain types of shoes to prevent foot pain and problems.",
                    "description": "Sticking with certain kinds of footwear, or no footwear at all, can dry out the skin around the heel. Thongs, open backed or sling sandals are frequently the culprits. High heels can also cause heel discomfort and dryness."
                },
                {
                    "headline": "Try to avoid standing at work, or at home, for extended periods of time.",
                    "description": "This can cause harm to your heels and feet in general. Hard floors can be detrimental your foot's health so try to wear orthopedic footwear."
                },
                {
                    "headline": "Know about your genes.",
                    "description": "Your genetics have a rather large impact on your skin, including the skin on your feet. Dry skin, and wrong footwear, won't necessarily result in cracked heels for everyone. But it might happen rather quickly if you're genetically predisposed."
                },
                {
                    "headline": "Be aware of your general health.",
                    "description": "Diabetes, for example, can decrease the moisture supply to the body, therewith resulting in more overall dryness. Thyroid problems have also been known to cause cracked heels."
                }
            ]
        },
        {
            "name": "Recognizing The Symptoms",
            "steps": [
                {
                    "headline": "Look for dry skin on and around your heels.",
                    "description": "The skin will look dry (much like the skin on the rest of your body), but it can also show signs of yellow and/or brown discoloration.The dryness and different skin color will be particularly obvious along the inside border of the heel. Your heel's skin will be quite to very rough to the touch, and might even become sharp. In other words, you skin might have lost so much moisture that it could rip light textures apart."
                },
                {
                    "headline": "Pay attention to any pain or discomfort in your feet.",
                    "description": "Your feet, and especially heels, might hurt a little to a lot when you stand, walk, or run. The pain usually subsides when the weight is taken off of the feet."
                },
                {
                    "headline": "Be aware of calluses forming on your heels.",
                    "description": "In some cases, you might notice a callus forming around the inside border of the heel. A callus is basically an accumulation of dry skin, which manifests as thickening of the skin."
                },
                {
                    "headline": "Look out for blood or bleeding around your heels.",
                    "description": "In advanced cases, you might notice blood around the heel area or in your socks. Examine your heels for signs of dry skin and cracking. If you know you suffer of diabetes or thyroid diseases, consult your physician right away."
                },
                {
                    "headline": "Make sure to inspect your feet on a daily basis for any changes in the skin and nail tone.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Treating The Condition",
            "steps": [
                {
                    "headline": "Get a hold of an oil based moisturizer and/or heel balm and apply it daily.",
                    "description": "Ideally you should apply moisture to your feet twice a day, in the morning and before going to bed. Using a cream or balm in the morning is crucial. Remember, you need to increase the skin's elasticity before you start using your feet so that existing dry skin doesn't get worse (and potentially preventing new dry skin from forming). Use a foot balm right before going to bed and put on soft socks to seal in the moisture. You can also just apply the balm or cream; adding the socks simply aids in additional hydration. Highly effective is Urea 20%, a natural and inexpensive product which is clear and odorless and in nature it's job is moisturizing the skin. Don't like to get your hands greasy? No worries. Nowadays there are a variety of products, tailored to various needs and tastes. Try a gel, or cream in stick form to avoid stickiness on your hands completely."
                },
                {
                    "headline": "Use a pumice stone, or foot file, every day in the shower.",
                    "description": "A pumice stone works to shave off dry skin, leaving your heels much softer. Keep in mind, the pumice stone or foot file will work well for mild cases of dry skin. Soaking your feet in warm water for about 10 minutes will soften the skin, making the pumice stone more effective. Try using the foot file on your feet when they're dry and wet. This will give you an idea of what condition most readily responds to this treatment. Follow both treatments with a moisturizer. Highly effective is Urea 20%, a natural and inexpensive product which is clear and odorless and in nature it's job is moisturizing the skin. In the event of bad cracks, a highly effective method is to utilize a food wrap (Press & Seal seems to work well) to keep the Urea cream from being absorbed by socks (note-this may make the feet feel hot so keep on as long as comfortable).."
                },
                {
                    "headline": "Apply an antiseptic to avoid infection of the skin if the cracks or skin start to bleed.",
                    "description": "Keep a dressing on it, and change it at least twice a day until bleeding stops completely. Always wash your hands before touching an open would, or the cracks in the skin."
                },
                {
                    "headline": "Use a heel cup to better distribute the weight on your heel.",
                    "description": "A cup will prevent the fat pad on your heel from expanding sideways. It can be a highly effective preventative and curative measure if worn daily."
                },
                {
                    "headline": "Try to stick to closed shoes and high-quality socks.",
                    "description": "Remember that open-toed and open backed shoes and sandal can wreak havoc on your heels. Sticking to high quality socks and shoes can greatly improve your skin's condition. Flip flops are great at the pool, and during the summer, but try to avoid making these a year-round habit. Women should limit the use of heels higher than 3 inches."
                },
                {
                    "headline": "Try losing some weight if you're not in a healthy range.",
                    "description": "Excess weight has a multitude of drawbacks, and burdening your feet is one them. Reducing the pressure on your heels can do wonders for the skin around them."
                },
                {
                    "headline": "Visit your podiatrist.",
                    "description": "If your condition doesn't show signs of improvement with the aforementioned treatments it might be time to visit a healthcare professional. S/he will recommend personalized treatments for your condition."
                }
            ]
        }
    ],
    "tyn": [
        "A pumice stone and/or foot file, easily available at your local drugstore.",
        "The thickest moisturizer you can find, such as cocoa butter",
        "A bowl with warm water."
    ],
    "text": " Understanding The Causes Notice your skin's elasticity. The skin around your heels is prone to dryness which can be exacerbated by improper care. When the skin becomes too dry, it loses much of its elasticity. This can result in cracked heels, and other ailments, over time. Dry, flaky skin can be a result of climate, such as very dry summers and/or cold winters. Beware of excess weight. Being overweight, or pregnancy, can cause severe calluses. Increased weight intensifies pressure on the feet, particularly on the heels, and this frequently results in one or more calluses. Keep in mind that the extra weight requires more expansion of the heel, which usually results in cracking or splitting of the skin through the callus. Avoid certain types of shoes to prevent foot pain and problems. Sticking with certain kinds of footwear, or no footwear at all, can dry out the skin around the heel. Thongs, open backed or sling sandals are frequently the culprits. High heels can also cause heel discomfort and dryness. Try to avoid standing at work, or at home, for extended periods of time. This can cause harm to your heels and feet in general. Hard floors can be detrimental your foot's health so try to wear orthopedic footwear. Know about your genes. Your genetics have a rather large impact on your skin, including the skin on your feet. Dry skin, and wrong footwear, won't necessarily result in cracked heels for everyone. But it might happen rather quickly if you're genetically predisposed. Be aware of your general health. Diabetes, for example, can decrease the moisture supply to the body, therewith resulting in more overall dryness. Thyroid problems have also been known to cause cracked heels. Recognizing The Symptoms Look for dry skin on and around your heels. The skin will look dry (much like the skin on the rest of your body), but it can also show signs of yellow and/or brown discoloration.The dryness and different skin color will be particularly obvious along the inside border of the heel. Your heel's skin will be quite to very rough to the touch, and might even become sharp. In other words, you skin might have lost so much moisture that it could rip light textures apart. Pay attention to any pain or discomfort in your feet. Your feet, and especially heels, might hurt a little to a lot when you stand, walk, or run. The pain usually subsides when the weight is taken off of the feet. Be aware of calluses forming on your heels. In some cases, you might notice a callus forming around the inside border of the heel. A callus is basically an accumulation of dry skin, which manifests as thickening of the skin. Look out for blood or bleeding around your heels. In advanced cases, you might notice blood around the heel area or in your socks. Examine your heels for signs of dry skin and cracking. If you know you suffer of diabetes or thyroid diseases, consult your physician right away. Make sure to inspect your feet on a daily basis for any changes in the skin and nail tone.  Treating The Condition Get a hold of an oil based moisturizer and/or heel balm and apply it daily. Ideally you should apply moisture to your feet twice a day, in the morning and before going to bed. Using a cream or balm in the morning is crucial. Remember, you need to increase the skin's elasticity before you start using your feet so that existing dry skin doesn't get worse (and potentially preventing new dry skin from forming). Use a foot balm right before going to bed and put on soft socks to seal in the moisture. You can also just apply the balm or cream; adding the socks simply aids in additional hydration. Highly effective is Urea 20%, a natural and inexpensive product which is clear and odorless and in nature it's job is moisturizing the skin. Don't like to get your hands greasy? No worries. Nowadays there are a variety of products, tailored to various needs and tastes. Try a gel, or cream in stick form to avoid stickiness on your hands completely. Use a pumice stone, or foot file, every day in the shower. A pumice stone works to shave off dry skin, leaving your heels much softer. Keep in mind, the pumice stone or foot file will work well for mild cases of dry skin. Soaking your feet in warm water for about 10 minutes will soften the skin, making the pumice stone more effective. Try using the foot file on your feet when they're dry and wet. This will give you an idea of what condition most readily responds to this treatment. Follow both treatments with a moisturizer. Highly effective is Urea 20%, a natural and inexpensive product which is clear and odorless and in nature it's job is moisturizing the skin. In the event of bad cracks, a highly effective method is to utilize a food wrap (Press & Seal seems to work well) to keep the Urea cream from being absorbed by socks (note-this may make the feet feel hot so keep on as long as comfortable).. Apply an antiseptic to avoid infection of the skin if the cracks or skin start to bleed. Keep a dressing on it, and change it at least twice a day until bleeding stops completely. Always wash your hands before touching an open would, or the cracks in the skin. Use a heel cup to better distribute the weight on your heel. A cup will prevent the fat pad on your heel from expanding sideways. It can be a highly effective preventative and curative measure if worn daily. Try to stick to closed shoes and high-quality socks. Remember that open-toed and open backed shoes and sandal can wreak havoc on your heels. Sticking to high quality socks and shoes can greatly improve your skin's condition. Flip flops are great at the pool, and during the summer, but try to avoid making these a year-round habit. Women should limit the use of heels higher than 3 inches. Try losing some weight if you're not in a healthy range. Excess weight has a multitude of drawbacks, and burdening your feet is one them. Reducing the pressure on your heels can do wonders for the skin around them. Visit your podiatrist. If your condition doesn't show signs of improvement with the aforementioned treatments it might be time to visit a healthcare professional. S/he will recommend personalized treatments for your condition.",
    "sentences": [
        " Understanding The Causes Notice your skin's elasticity.",
        "The skin around your heels is prone to dryness which can be exacerbated by improper care.",
        "When the skin becomes too dry, it loses much of its elasticity.",
        "This can result in cracked heels, and other ailments, over time.",
        "Dry, flaky skin can be a result of climate, such as very dry summers and/or cold winters.",
        "Beware of excess weight.",
        "Being overweight, or pregnancy, can cause severe calluses.",
        "Increased weight intensifies pressure on the feet, particularly on the heels, and this frequently results in one or more calluses.",
        "Keep in mind that the extra weight requires more expansion of the heel, which usually results in cracking or splitting of the skin through the callus.",
        "Avoid certain types of shoes to prevent foot pain and problems.",
        "Sticking with certain kinds of footwear, or no footwear at all, can dry out the skin around the heel.",
        "Thongs, open backed or sling sandals are frequently the culprits.",
        "High heels can also cause heel discomfort and dryness.",
        "Try to avoid standing at work, or at home, for extended periods of time.",
        "This can cause harm to your heels and feet in general.",
        "Hard floors can be detrimental your foot's health so try to wear orthopedic footwear.",
        "Know about your genes.",
        "Your genetics have a rather large impact on your skin, including the skin on your feet.",
        "Dry skin, and wrong footwear, won't necessarily result in cracked heels for everyone.",
        "But it might happen rather quickly if you're genetically predisposed.",
        "Be aware of your general health.",
        "Diabetes, for example, can decrease the moisture supply to the body, therewith resulting in more overall dryness.",
        "Thyroid problems have also been known to cause cracked heels.",
        "Recognizing The Symptoms Look for dry skin on and around your heels.",
        "The skin will look dry (much like the skin on the rest of your body), but it can also show signs of yellow and/or brown discoloration.The dryness and different skin color will be particularly obvious along the inside border of the heel.",
        "Your heel's skin will be quite to very rough to the touch, and might even become sharp.",
        "In other words, you skin might have lost so much moisture that it could rip light textures apart.",
        "Pay attention to any pain or discomfort in your feet.",
        "Your feet, and especially heels, might hurt a little to a lot when you stand, walk, or run.",
        "The pain usually subsides when the weight is taken off of the feet.",
        "Be aware of calluses forming on your heels.",
        "In some cases, you might notice a callus forming around the inside border of the heel.",
        "A callus is basically an accumulation of dry skin, which manifests as thickening of the skin.",
        "Look out for blood or bleeding around your heels.",
        "In advanced cases, you might notice blood around the heel area or in your socks.",
        "Examine your heels for signs of dry skin and cracking.",
        "If you know you suffer of diabetes or thyroid diseases, consult your physician right away.",
        "Make sure to inspect your feet on a daily basis for any changes in the skin and nail tone.",
        "Treating The Condition Get a hold of an oil based moisturizer and/or heel balm and apply it daily.",
        "Ideally you should apply moisture to your feet twice a day, in the morning and before going to bed.",
        "Using a cream or balm in the morning is crucial.",
        "Remember, you need to increase the skin's elasticity before you start using your feet so that existing dry skin doesn't get worse (and potentially preventing new dry skin from forming).",
        "Use a foot balm right before going to bed and put on soft socks to seal in the moisture.",
        "You can also just apply the balm or cream; adding the socks simply aids in additional hydration.",
        "Highly effective is Urea 20%, a natural and inexpensive product which is clear and odorless and in nature it's job is moisturizing the skin.",
        "Don't like to get your hands greasy?",
        "No worries.",
        "Nowadays there are a variety of products, tailored to various needs and tastes.",
        "Try a gel, or cream in stick form to avoid stickiness on your hands completely.",
        "Use a pumice stone, or foot file, every day in the shower.",
        "A pumice stone works to shave off dry skin, leaving your heels much softer.",
        "Keep in mind, the pumice stone or foot file will work well for mild cases of dry skin.",
        "Soaking your feet in warm water for about 10 minutes will soften the skin, making the pumice stone more effective.",
        "Try using the foot file on your feet when they're dry and wet.",
        "This will give you an idea of what condition most readily responds to this treatment.",
        "Follow both treatments with a moisturizer.",
        "Highly effective is Urea 20%, a natural and inexpensive product which is clear and odorless and in nature it's job is moisturizing the skin.",
        "In the event of bad cracks, a highly effective method is to utilize a food wrap (Press & Seal seems to work well) to keep the Urea cream from being absorbed by socks (note-this may make the feet feel hot so keep on as long as comfortable)..",
        "Apply an antiseptic to avoid infection of the skin if the cracks or skin start to bleed.",
        "Keep a dressing on it, and change it at least twice a day until bleeding stops completely.",
        "Always wash your hands before touching an open would, or the cracks in the skin.",
        "Use a heel cup to better distribute the weight on your heel.",
        "A cup will prevent the fat pad on your heel from expanding sideways.",
        "It can be a highly effective preventative and curative measure if worn daily.",
        "Try to stick to closed shoes and high-quality socks.",
        "Remember that open-toed and open backed shoes and sandal can wreak havoc on your heels.",
        "Sticking to high quality socks and shoes can greatly improve your skin's condition.",
        "Flip flops are great at the pool, and during the summer, but try to avoid making these a year-round habit.",
        "Women should limit the use of heels higher than 3 inches.",
        "Try losing some weight if you're not in a healthy range.",
        "Excess weight has a multitude of drawbacks, and burdening your feet is one them.",
        "Reducing the pressure on your heels can do wonders for the skin around them.",
        "Visit your podiatrist.",
        "If your condition doesn't show signs of improvement with the aforementioned treatments it might be time to visit a healthcare professional.",
        "S/he will recommend personalized treatments for your condition."
    ]
}