{
    "title": "How to Dehydrate Carrots",
    "url": "https://www.wikihow.com/Dehydrate-Carrots",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Food Preservation Techniques",
        "Drying Food"
    ],
    "parts": [
        {
            "name": "Prepping the Carrots",
            "steps": [
                {
                    "headline": "Buy carrots fresh from the grocery store or dig them up in your garden.",
                    "description": "Dehydrating carrots is a great way to preserve them for soups, stews and other recipes that are partially liquid."
                },
                {
                    "headline": "Scrub the carrots with a potato scrubber if they are fresh out of the dirt.",
                    "description": ""
                },
                {
                    "headline": "Peel the carrots.",
                    "description": "Cut off the carrot tops. Consider saving the peels and tops for making vegetable stock."
                },
                {
                    "headline": "Prepare only the amount of carrots that will fit on your dehydrator trays for one batch.",
                    "description": "A small dehydrator may only fit six carrots, while a large one with nine trays may be able to handle 30 or more large carrots."
                },
                {
                    "headline": "Slice the carrots into rounds.",
                    "description": "If you want to dehydrate them for soups or stews, then one-half inch (0.6cm) rounds are ideal. If you want to make carrot chips for a snack, try slicing to one-eighth inch (0.15cm) with a mandolin slicer. You can also grate the carrots, if you want to use grated carrots in recipes. They can be prepared in a similar way, but they may require less drying time."
                }
            ]
        },
        {
            "name": "Steam Blanching the Carrots",
            "steps": [
                {
                    "headline": "Opt to steam blanch the carrots to preserve their nutrient content.",
                    "description": ""
                },
                {
                    "headline": "Heat a saucepan with several inches of water on the stove.",
                    "description": ""
                },
                {
                    "headline": "Add your steamer tray when the water has reached a boil.",
                    "description": "Then, pour your carrot rounds into the basket."
                },
                {
                    "headline": "Cover them and steam for three to four minutes.",
                    "description": "Remove the tray and steam blanch another batch if you are filling a lot of dehydrator trays."
                }
            ]
        },
        {
            "name": "Dehydrating Carrots",
            "steps": [
                {
                    "headline": "Fill the dehydrator trays with the carrot rounds.",
                    "description": "Try to leave a little bit of space between the carrot round, so that air can flow through. This will reduce drying time."
                },
                {
                    "headline": "Insert the trays into the dehydrator.",
                    "description": "Turn it on to 125 degrees Fahrenheit (52 Celsius)."
                },
                {
                    "headline": "Dry them for 6 to 12 hours.",
                    "description": "Check them at six hours and then every two hours after that. They should be dry, leathery and brittle when they are dehydrated. Thinly sliced chips will take six hours to dry."
                },
                {
                    "headline": "Store them in sealed mason jars with an inch or less of headspace.",
                    "description": "Keep them in a cool, dark place to preserve them. Add as needed to recipes. The carrots will rehydrate after being placed in liquid for an hour or so."
                }
            ]
        }
    ],
    "tyn": [
        "Carrots",
        "Dehydrator",
        "Peeler",
        "Potato scrubber",
        "Water",
        "Knife",
        "Saucepan",
        "Stovetop",
        "Steamer tray",
        "Mason jars/storage containers",
        "Timer"
    ],
    "text": " Prepping the Carrots Buy carrots fresh from the grocery store or dig them up in your garden. Dehydrating carrots is a great way to preserve them for soups, stews and other recipes that are partially liquid. Scrub the carrots with a potato scrubber if they are fresh out of the dirt.  Peel the carrots. Cut off the carrot tops. Consider saving the peels and tops for making vegetable stock. Prepare only the amount of carrots that will fit on your dehydrator trays for one batch. A small dehydrator may only fit six carrots, while a large one with nine trays may be able to handle 30 or more large carrots. Slice the carrots into rounds. If you want to dehydrate them for soups or stews, then one-half inch (0.6cm) rounds are ideal. If you want to make carrot chips for a snack, try slicing to one-eighth inch (0.15cm) with a mandolin slicer. You can also grate the carrots, if you want to use grated carrots in recipes. They can be prepared in a similar way, but they may require less drying time. Steam Blanching the Carrots Opt to steam blanch the carrots to preserve their nutrient content.  Heat a saucepan with several inches of water on the stove.  Add your steamer tray when the water has reached a boil. Then, pour your carrot rounds into the basket. Cover them and steam for three to four minutes. Remove the tray and steam blanch another batch if you are filling a lot of dehydrator trays. Dehydrating Carrots Fill the dehydrator trays with the carrot rounds. Try to leave a little bit of space between the carrot round, so that air can flow through. This will reduce drying time. Insert the trays into the dehydrator. Turn it on to 125 degrees Fahrenheit (52 Celsius). Dry them for 6 to 12 hours. Check them at six hours and then every two hours after that. They should be dry, leathery and brittle when they are dehydrated. Thinly sliced chips will take six hours to dry. Store them in sealed mason jars with an inch or less of headspace. Keep them in a cool, dark place to preserve them. Add as needed to recipes. The carrots will rehydrate after being placed in liquid for an hour or so.",
    "sentences": [
        " Prepping the Carrots Buy carrots fresh from the grocery store or dig them up in your garden.",
        "Dehydrating carrots is a great way to preserve them for soups, stews and other recipes that are partially liquid.",
        "Scrub the carrots with a potato scrubber if they are fresh out of the dirt.",
        "Peel the carrots.",
        "Cut off the carrot tops.",
        "Consider saving the peels and tops for making vegetable stock.",
        "Prepare only the amount of carrots that will fit on your dehydrator trays for one batch.",
        "A small dehydrator may only fit six carrots, while a large one with nine trays may be able to handle 30 or more large carrots.",
        "Slice the carrots into rounds.",
        "If you want to dehydrate them for soups or stews, then one-half inch (0.6cm) rounds are ideal.",
        "If you want to make carrot chips for a snack, try slicing to one-eighth inch (0.15cm) with a mandolin slicer.",
        "You can also grate the carrots, if you want to use grated carrots in recipes.",
        "They can be prepared in a similar way, but they may require less drying time.",
        "Steam Blanching the Carrots Opt to steam blanch the carrots to preserve their nutrient content.",
        "Heat a saucepan with several inches of water on the stove.",
        "Add your steamer tray when the water has reached a boil.",
        "Then, pour your carrot rounds into the basket.",
        "Cover them and steam for three to four minutes.",
        "Remove the tray and steam blanch another batch if you are filling a lot of dehydrator trays.",
        "Dehydrating Carrots Fill the dehydrator trays with the carrot rounds.",
        "Try to leave a little bit of space between the carrot round, so that air can flow through.",
        "This will reduce drying time.",
        "Insert the trays into the dehydrator.",
        "Turn it on to 125 degrees Fahrenheit (52 Celsius).",
        "Dry them for 6 to 12 hours.",
        "Check them at six hours and then every two hours after that.",
        "They should be dry, leathery and brittle when they are dehydrated.",
        "Thinly sliced chips will take six hours to dry.",
        "Store them in sealed mason jars with an inch or less of headspace.",
        "Keep them in a cool, dark place to preserve them.",
        "Add as needed to recipes.",
        "The carrots will rehydrate after being placed in liquid for an hour or so."
    ]
}