{
    "title": "How to Neutralize Ammonia",
    "url": "https://www.wikihow.com/Neutralize-Ammonia",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science",
        "Chemistry"
    ],
    "methods": [
        {
            "name": "Neutralizing Pet Ammonia",
            "steps": [
                {
                    "headline": "Soak up the urine.",
                    "description": "Apply layers of paper towels as soon as you discover the urine stain. Stand or walk on the paper towels to increase absorbency. Try to soak up as much as possible before moving on."
                },
                {
                    "headline": "Create a neutralizing mixture.",
                    "description": "Mix a solution of one part white vinegar to one part water. Transfer the mixed ingredients into a spray container or cleaning bucket. Spray or pour the solution onto the area. If the area is carpeted, apply a generous amount of cleaning mixture. You want to use enough solution to soak into all areas of the urine stain. You must be careful not to let the solution sink into the subflooring."
                },
                {
                    "headline": "Allow the mixture to settle.",
                    "description": "Wait 10 minutes. Return and blot the area again with paper towels. You can also blot with washcloths, but use only old ones, as the ammonia might be difficult to remove."
                },
                {
                    "headline": "Clear the area.",
                    "description": "Let the area dry until it is slightly damp. Sprinkle the area with baking soda. Let the baking soda sit for 15 minutes. Baking soda is a mild alkali that dissolves dirt and grease with water effectively. Put a laundry bucket over the area while the baking soda is cleaning the area. This will prevent your pet or any small children from messing with the area."
                },
                {
                    "headline": "Vacuum the area.",
                    "description": "You should have removed the majority of the urine, which causes the release of ammonia. If the odor still smells, then you will need to treat the area again or use a commercial product."
                },
                {
                    "headline": "Buy a commercial pet stain remover.",
                    "description": "The key to a commercial product is to make sure it removes the smell. Cats, especially, will urinate in the same location if they smell their urine. Buy a product that caters to your pet specifically, instead of buying an \"all pets\" stain remover. Try to use natural products that won't be damaging to your pet or yourself. Apply the cleaner according to package's directions. Repeat as necessary. Read the safety measures to ensure the product doesn’t contain hazardous materials."
                }
            ]
        },
        {
            "name": "Neutralizing Ammonia in Horse Stalls",
            "steps": [
                {
                    "headline": "Protect your horses.",
                    "description": "Ensure your horses are in stalls that provide proper ventilation, even in the winter. Ventilation in the walkways is not enough. Each stall should have a permanent opening of at least a one square foot (0.3m) to ensure that the excess ammonia gas can leave the stall. You can make this opening a long slot, rather than a square, so that it’s easier to leave open permanently. For example, you could cut a slot that’s 1 inch (2.5 cm) wide and 12 feet (3.7 m) long, placing it along the length of the stall. If possible, place the slot near the ceiling of the stable, which allows the freshest air to circulate into the stall. In high concentrations, ammonia can cause respiratory damage and even death."
                },
                {
                    "headline": "Ensure your stalls have proper drainage.",
                    "description": "This usually means laying stall mats down. Make sure you clean underneath the mats at least once week."
                },
                {
                    "headline": "Choose an absorbent bedding.",
                    "description": "Wheat straw has been found to reduce ammonia. Kenaf fiber is also helpful in reducing ammonia levels. The most absorbent bedding is porous flooring like packed dirt, clay, or even stone dust. Use tightly interlocking or seamless stall mats to keep the urine from seeping into the floor underneath the bedding."
                },
                {
                    "headline": "Prepare the stall.",
                    "description": "Remove the horses from their stalls for a daily cleaning. Get rid of all urine-soaked bedding and dispose of it. It is important to let the horses out of their stall when cleaning or preparing ammonia neutralizers."
                },
                {
                    "headline": "Mix your bedding with an ammonia-neutralizing product.",
                    "description": "You can use diatomaceous earth (DE) or a clinoptilolite-based product. This increases the absorbency of the materials, lowering the amount of bacteria that is converted into ammonia. Use a ratio of 1:8 for the ammonia neutralizing agent."
                },
                {
                    "headline": "Spread the bedding.",
                    "description": "Use a stable shovel and dump two scoops of bedding into the stall. Spread out the bedding with the shovel. Continue to shovel and spread the bedding in increments of two scoops. If you're leaving the horse in the stall overnight, use between 4 to 6 inches of bedding. If the horse is in and out of the stall and you have mats, cover the mats with about 2 inches of bedding."
                }
            ]
        },
        {
            "name": "Cleaning Ammonia Spills",
            "steps": [
                {
                    "headline": "Create a dry mixture.",
                    "description": "Mix together equal parts baking soda (sodium bicarbonate), clay cat litter and dry sand. Keep it in buckets near your workstation. Create a dry mixture if you intend to absorb the spill. Some might attempt to dilute the spill and use it to clean the affected area. Liquid ammonia is a common cleaning agent. You can dilute the spill with water and use the mixture as an impromptu cleaner. You'll need to add a higher ratio of water to ammonia, so if you spilled too much, use the dry mixture. This combination of dry ingredients is a safe way of containing and disposing large amounts of liquid ammonia."
                },
                {
                    "headline": "Acquire a weak acid.",
                    "description": "An acid or alkaline compound can be used to neutralize ammonia, making it safer to handle. You could use hydrochloric or sulfuric neutralizers. Application of these products to the spill will cause a chemical reaction that will neutralize the ammonia. Search for ammonia neutralizers. Some brands develop a mixture of acids to be used to neutralize ammonia. Hydrochloric acid is found in some tile and toilet bowl cleaners, as well as stain removers. You can also buy pure hydrochloric acid online. Sulfuric acid is found in toilet bowl cleaners and drain de-cloggers. You can buy it online as well. This acid is highly corrosive, so read the safety instructions on the bottle carefully and wear gloves when handling it."
                },
                {
                    "headline": "Identify the ammonia spill.",
                    "description": "Cover the spill with your dry spill mix. You should use enough spill mix so that the surface is completely dry. Wait for the mix to absorb the liquid."
                },
                {
                    "headline": "Scoop up the mixture into a container.",
                    "description": "Wear a mask while doing this. If possible, place the compound in a fume hood. Turn the fume hood on for the remainder of the process. Throw this mixture directly into your outdoor trash bin if you don’t have access to a fume hood."
                },
                {
                    "headline": "Create a liquid cleaner.",
                    "description": "Fill a pail with cold water. Slowly add the liquid neutralizers into the cold water. Only add a tenth of the chemical neutralizer to the water. If you added too much, the neutralizer will still do the job, but may need more applications of water to the spill area. Stir the mixture for about thirty seconds."
                },
                {
                    "headline": "Apply the liquid neutralizer.",
                    "description": "Add a small amount of liquid mixture created earlier to the area of the spill. Add small dollops at a time. On the surface clean thoroughly with a clean mop. Allow the area to dry before cleaning a second time. On the second cleaning, use water and a surface cleaner to ensure a thorough cleaning of the area. Never use bleach to clean ammonia because the combined chemicals will create a poisonous gas harmful to people."
                }
            ]
        }
    ],
    "tyn": [
        "Neutralizing Pet Ammonia",
        "Paper towels",
        "Spray bottle",
        "White vinegar",
        "Baking soda",
        "Vacuum",
        "Commercial pet stain remover",
        "Neutralizing Ammonia in Horse Stalls",
        "Floor mats",
        "Wheat straw/kenaf fiber bedding",
        "Diatomaceous earth",
        "Clinoptilolite-based ammonia neutralizing products",
        "Cleaning Ammonia Spills",
        "Sodium bicarbonate",
        "Clay cat litter",
        "Dry sand",
        "5% aqueous hydrochloric acid",
        "Plastic pail",
        "Cold water",
        "Fume hood",
        "Mask",
        "Trashcan",
        "Drain"
    ],
    "text": " Neutralizing Pet Ammonia Soak up the urine. Apply layers of paper towels as soon as you discover the urine stain. Stand or walk on the paper towels to increase absorbency. Try to soak up as much as possible before moving on. Create a neutralizing mixture. Mix a solution of one part white vinegar to one part water. Transfer the mixed ingredients into a spray container or cleaning bucket. Spray or pour the solution onto the area. If the area is carpeted, apply a generous amount of cleaning mixture. You want to use enough solution to soak into all areas of the urine stain. You must be careful not to let the solution sink into the subflooring. Allow the mixture to settle. Wait 10 minutes. Return and blot the area again with paper towels. You can also blot with washcloths, but use only old ones, as the ammonia might be difficult to remove. Clear the area. Let the area dry until it is slightly damp. Sprinkle the area with baking soda. Let the baking soda sit for 15 minutes. Baking soda is a mild alkali that dissolves dirt and grease with water effectively. Put a laundry bucket over the area while the baking soda is cleaning the area. This will prevent your pet or any small children from messing with the area. Vacuum the area. You should have removed the majority of the urine, which causes the release of ammonia. If the odor still smells, then you will need to treat the area again or use a commercial product. Buy a commercial pet stain remover. The key to a commercial product is to make sure it removes the smell. Cats, especially, will urinate in the same location if they smell their urine. Buy a product that caters to your pet specifically, instead of buying an \"all pets\" stain remover. Try to use natural products that won't be damaging to your pet or yourself. Apply the cleaner according to package's directions. Repeat as necessary. Read the safety measures to ensure the product doesn’t contain hazardous materials. Neutralizing Ammonia in Horse Stalls Protect your horses. Ensure your horses are in stalls that provide proper ventilation, even in the winter. Ventilation in the walkways is not enough. Each stall should have a permanent opening of at least a one square foot (0.3m) to ensure that the excess ammonia gas can leave the stall. You can make this opening a long slot, rather than a square, so that it’s easier to leave open permanently. For example, you could cut a slot that’s 1 inch (2.5 cm) wide and 12 feet (3.7 m) long, placing it along the length of the stall. If possible, place the slot near the ceiling of the stable, which allows the freshest air to circulate into the stall. In high concentrations, ammonia can cause respiratory damage and even death. Ensure your stalls have proper drainage. This usually means laying stall mats down. Make sure you clean underneath the mats at least once week. Choose an absorbent bedding. Wheat straw has been found to reduce ammonia. Kenaf fiber is also helpful in reducing ammonia levels. The most absorbent bedding is porous flooring like packed dirt, clay, or even stone dust. Use tightly interlocking or seamless stall mats to keep the urine from seeping into the floor underneath the bedding. Prepare the stall. Remove the horses from their stalls for a daily cleaning. Get rid of all urine-soaked bedding and dispose of it. It is important to let the horses out of their stall when cleaning or preparing ammonia neutralizers. Mix your bedding with an ammonia-neutralizing product. You can use diatomaceous earth (DE) or a clinoptilolite-based product. This increases the absorbency of the materials, lowering the amount of bacteria that is converted into ammonia. Use a ratio of 1:8 for the ammonia neutralizing agent. Spread the bedding. Use a stable shovel and dump two scoops of bedding into the stall. Spread out the bedding with the shovel. Continue to shovel and spread the bedding in increments of two scoops. If you're leaving the horse in the stall overnight, use between 4 to 6 inches of bedding. If the horse is in and out of the stall and you have mats, cover the mats with about 2 inches of bedding. Cleaning Ammonia Spills Create a dry mixture. Mix together equal parts baking soda (sodium bicarbonate), clay cat litter and dry sand. Keep it in buckets near your workstation. Create a dry mixture if you intend to absorb the spill. Some might attempt to dilute the spill and use it to clean the affected area. Liquid ammonia is a common cleaning agent. You can dilute the spill with water and use the mixture as an impromptu cleaner. You'll need to add a higher ratio of water to ammonia, so if you spilled too much, use the dry mixture. This combination of dry ingredients is a safe way of containing and disposing large amounts of liquid ammonia. Acquire a weak acid. An acid or alkaline compound can be used to neutralize ammonia, making it safer to handle. You could use hydrochloric or sulfuric neutralizers. Application of these products to the spill will cause a chemical reaction that will neutralize the ammonia. Search for ammonia neutralizers. Some brands develop a mixture of acids to be used to neutralize ammonia. Hydrochloric acid is found in some tile and toilet bowl cleaners, as well as stain removers. You can also buy pure hydrochloric acid online. Sulfuric acid is found in toilet bowl cleaners and drain de-cloggers. You can buy it online as well. This acid is highly corrosive, so read the safety instructions on the bottle carefully and wear gloves when handling it. Identify the ammonia spill. Cover the spill with your dry spill mix. You should use enough spill mix so that the surface is completely dry. Wait for the mix to absorb the liquid. Scoop up the mixture into a container. Wear a mask while doing this. If possible, place the compound in a fume hood. Turn the fume hood on for the remainder of the process. Throw this mixture directly into your outdoor trash bin if you don’t have access to a fume hood. Create a liquid cleaner. Fill a pail with cold water. Slowly add the liquid neutralizers into the cold water. Only add a tenth of the chemical neutralizer to the water. If you added too much, the neutralizer will still do the job, but may need more applications of water to the spill area. Stir the mixture for about thirty seconds. Apply the liquid neutralizer. Add a small amount of liquid mixture created earlier to the area of the spill. Add small dollops at a time. On the surface clean thoroughly with a clean mop. Allow the area to dry before cleaning a second time. On the second cleaning, use water and a surface cleaner to ensure a thorough cleaning of the area. Never use bleach to clean ammonia because the combined chemicals will create a poisonous gas harmful to people.",
    "sentences": [
        " Neutralizing Pet Ammonia Soak up the urine.",
        "Apply layers of paper towels as soon as you discover the urine stain.",
        "Stand or walk on the paper towels to increase absorbency.",
        "Try to soak up as much as possible before moving on.",
        "Create a neutralizing mixture.",
        "Mix a solution of one part white vinegar to one part water.",
        "Transfer the mixed ingredients into a spray container or cleaning bucket.",
        "Spray or pour the solution onto the area.",
        "If the area is carpeted, apply a generous amount of cleaning mixture.",
        "You want to use enough solution to soak into all areas of the urine stain.",
        "You must be careful not to let the solution sink into the subflooring.",
        "Allow the mixture to settle.",
        "Wait 10 minutes.",
        "Return and blot the area again with paper towels.",
        "You can also blot with washcloths, but use only old ones, as the ammonia might be difficult to remove.",
        "Clear the area.",
        "Let the area dry until it is slightly damp.",
        "Sprinkle the area with baking soda.",
        "Let the baking soda sit for 15 minutes.",
        "Baking soda is a mild alkali that dissolves dirt and grease with water effectively.",
        "Put a laundry bucket over the area while the baking soda is cleaning the area.",
        "This will prevent your pet or any small children from messing with the area.",
        "Vacuum the area.",
        "You should have removed the majority of the urine, which causes the release of ammonia.",
        "If the odor still smells, then you will need to treat the area again or use a commercial product.",
        "Buy a commercial pet stain remover.",
        "The key to a commercial product is to make sure it removes the smell.",
        "Cats, especially, will urinate in the same location if they smell their urine.",
        "Buy a product that caters to your pet specifically, instead of buying an \"all pets\" stain remover.",
        "Try to use natural products that won't be damaging to your pet or yourself.",
        "Apply the cleaner according to package's directions.",
        "Repeat as necessary.",
        "Read the safety measures to ensure the product doesn’t contain hazardous materials.",
        "Neutralizing Ammonia in Horse Stalls Protect your horses.",
        "Ensure your horses are in stalls that provide proper ventilation, even in the winter.",
        "Ventilation in the walkways is not enough.",
        "Each stall should have a permanent opening of at least a one square foot (0.3m) to ensure that the excess ammonia gas can leave the stall.",
        "You can make this opening a long slot, rather than a square, so that it’s easier to leave open permanently.",
        "For example, you could cut a slot that’s 1 inch (2.5 cm) wide and 12 feet (3.7 m) long, placing it along the length of the stall.",
        "If possible, place the slot near the ceiling of the stable, which allows the freshest air to circulate into the stall.",
        "In high concentrations, ammonia can cause respiratory damage and even death.",
        "Ensure your stalls have proper drainage.",
        "This usually means laying stall mats down.",
        "Make sure you clean underneath the mats at least once week.",
        "Choose an absorbent bedding.",
        "Wheat straw has been found to reduce ammonia.",
        "Kenaf fiber is also helpful in reducing ammonia levels.",
        "The most absorbent bedding is porous flooring like packed dirt, clay, or even stone dust.",
        "Use tightly interlocking or seamless stall mats to keep the urine from seeping into the floor underneath the bedding.",
        "Prepare the stall.",
        "Remove the horses from their stalls for a daily cleaning.",
        "Get rid of all urine-soaked bedding and dispose of it.",
        "It is important to let the horses out of their stall when cleaning or preparing ammonia neutralizers.",
        "Mix your bedding with an ammonia-neutralizing product.",
        "You can use diatomaceous earth (DE) or a clinoptilolite-based product.",
        "This increases the absorbency of the materials, lowering the amount of bacteria that is converted into ammonia.",
        "Use a ratio of 1:8 for the ammonia neutralizing agent.",
        "Spread the bedding.",
        "Use a stable shovel and dump two scoops of bedding into the stall.",
        "Spread out the bedding with the shovel.",
        "Continue to shovel and spread the bedding in increments of two scoops.",
        "If you're leaving the horse in the stall overnight, use between 4 to 6 inches of bedding.",
        "If the horse is in and out of the stall and you have mats, cover the mats with about 2 inches of bedding.",
        "Cleaning Ammonia Spills Create a dry mixture.",
        "Mix together equal parts baking soda (sodium bicarbonate), clay cat litter and dry sand.",
        "Keep it in buckets near your workstation.",
        "Create a dry mixture if you intend to absorb the spill.",
        "Some might attempt to dilute the spill and use it to clean the affected area.",
        "Liquid ammonia is a common cleaning agent.",
        "You can dilute the spill with water and use the mixture as an impromptu cleaner.",
        "You'll need to add a higher ratio of water to ammonia, so if you spilled too much, use the dry mixture.",
        "This combination of dry ingredients is a safe way of containing and disposing large amounts of liquid ammonia.",
        "Acquire a weak acid.",
        "An acid or alkaline compound can be used to neutralize ammonia, making it safer to handle.",
        "You could use hydrochloric or sulfuric neutralizers.",
        "Application of these products to the spill will cause a chemical reaction that will neutralize the ammonia.",
        "Search for ammonia neutralizers.",
        "Some brands develop a mixture of acids to be used to neutralize ammonia.",
        "Hydrochloric acid is found in some tile and toilet bowl cleaners, as well as stain removers.",
        "You can also buy pure hydrochloric acid online.",
        "Sulfuric acid is found in toilet bowl cleaners and drain de-cloggers.",
        "You can buy it online as well.",
        "This acid is highly corrosive, so read the safety instructions on the bottle carefully and wear gloves when handling it.",
        "Identify the ammonia spill.",
        "Cover the spill with your dry spill mix.",
        "You should use enough spill mix so that the surface is completely dry.",
        "Wait for the mix to absorb the liquid.",
        "Scoop up the mixture into a container.",
        "Wear a mask while doing this.",
        "If possible, place the compound in a fume hood.",
        "Turn the fume hood on for the remainder of the process.",
        "Throw this mixture directly into your outdoor trash bin if you don’t have access to a fume hood.",
        "Create a liquid cleaner.",
        "Fill a pail with cold water.",
        "Slowly add the liquid neutralizers into the cold water.",
        "Only add a tenth of the chemical neutralizer to the water.",
        "If you added too much, the neutralizer will still do the job, but may need more applications of water to the spill area.",
        "Stir the mixture for about thirty seconds.",
        "Apply the liquid neutralizer.",
        "Add a small amount of liquid mixture created earlier to the area of the spill.",
        "Add small dollops at a time.",
        "On the surface clean thoroughly with a clean mop.",
        "Allow the area to dry before cleaning a second time.",
        "On the second cleaning, use water and a surface cleaner to ensure a thorough cleaning of the area.",
        "Never use bleach to clean ammonia because the combined chemicals will create a poisonous gas harmful to people."
    ]
}