{
    "title": "How to Paint a Landscape in Oils",
    "url": "https://www.wikihow.com/Paint-a-Landscape-in-Oils",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "parts": [
        {
            "name": "Toning the Canvas",
            "steps": [
                {
                    "headline": "Select the subject for your painting.",
                    "description": "Think about what type of landscape you'd like to paint. Do you want to include the ocean, a mountain, or a field? Decide what season you'd like to paint and consider what type of light your landscape will have. For example, if you're painting an afternoon scene, the light might be casting long shadows.Tip: Although you can paint outside from real life, you could prop a photograph of an outdoor scene near your easel. Then, you can refer to the photo as you paint. To give you some ideas, you might want to paint a bright spring scene of a mountain with pine trees in the foreground. You could also paint a darker landscape of the ocean at sunset with deep streaks across the sky."
                },
                {
                    "headline": "Set your canvas on an easel and squeeze oil paints onto a palette.",
                    "description": "If you don't have an easel or you're painting a small canvas, you can prop the canvas against something sturdy or lay it flat on your work surface. Then, get out a paint palette and squeeze a coin-sized amount of each color of oil paint that you want to use. Improvise if you don't have a classic artist's palette. Use a smooth piece of cardboard, a flat glass platter, a thin plank of wood, or a plastic container lid."
                },
                {
                    "headline": "Cover the canvas with your lightest tone.",
                    "description": "Decide the lightest color that will be on your landscape, such as a pale blue sky, a warm sunlight tone, or a light cool gray. Dip whichever brush you feel comfortable using in transparent oil paint and a few drops of solvent, such as turpentine. Then, brush that tone over the entire surface of the canvas and rub a paper towel or cloth over the canvas to blend the color.Did You Know? Toning the canvas will cover the bold white of the blank canvas so tiny points of white aren't visible through your landscape painting. To make a warm sunlight tone, blend ivory black with white and a little orange. To create a pale blue, mix blue with gray and white."
                },
                {
                    "headline": "Dry the toned canvas at room temperature for 1 to 2 days.",
                    "description": "Set the canvas in a well-ventilated room and leave it to dry completely. This should take 1 to 2 days depending on your climate. Then, you can begin to paint the sky on your canvas. To ventilate the room, run a fan or open a window. Remember to clean your paintbrushes and cover the paint palette tightly to prevent them from drying out."
                },
                {
                    "headline": "Paint the outline of major shapes with a light oil paint color.",
                    "description": "Dip a small paintbrush into a light paint color and use it to lightly paint in the outline of main focal points like trees, mountains, barns, or fences, for instance. This rough outline will help you fill in the composition as you paint. Be as detailed or basic as you like when you paint the outline. Make the shapes more detailed if you want more guidance as you paint the landscape. If you prefer to make up the composition of the painting as you go, you can skip this step."
                }
            ]
        },
        {
            "name": "Working on the Sky",
            "steps": [
                {
                    "headline": "Blend oil paint to make a sky color.",
                    "description": "You might mix cobalt blue with ivory black and a little white to make a realistic blue sky. Or blend burnt sienna with yellow ochre and naples yellow to make golden sky at sunset. You can make a few different hues with the colors on your palette. Keep in mind that if you want to apply layers of oil paint, you should with the thinnest, most transparent colors before adding thicker layers."
                },
                {
                    "headline": "Paint the darkest part of the sky near the top of your canvas.",
                    "description": "You can use any size brush you like to apply the darkest paint for the sky along the top of the canvas. The sky is usually a little darker near the top and lighter near the horizon line regardless of the time of day. If you'd like to make the edges of the painting even darker, especially if you're painting an evening landscape, add a touch of black paint to the corners and blend them in with your brush."
                },
                {
                    "headline": "Brush the paint down to create a lighter color that fills the sky.",
                    "description": "You may want to switch to a medium or large paintbrush if you started with a small one. Brush the paintbrush into the color you applied across the top of the canvas and then drag it down towards the middle half or two-thirds of the canvas. As you bring the color down, it will become lighter.Did You Know? Atmospheric perspective is the effect you get when you layer color to create distance. For example, things that are far away will appear lighter than parts of your landscape that are darker and closer. If you run out of the paint to brush down, don't be afraid to dip your brush onto your palette to pick up more oil paint."
                },
                {
                    "headline": "Brush a clean paintbrush over the sky to soften and blend the paint.",
                    "description": "Once half or two-thirds of the canvas is filled with the sky, take a clean and dry 2 in (5.1 cm) brush and move it across the sky until you've lightly blended the paint. You shouldn't see a noticeable break or difference between the dark portion of the sky and the lighter area near the horizon. It's fine to leave some areas of the sky darker to create interest and draw in your viewer."
                },
                {
                    "headline": "Use the corner of a small brush to add clouds to the sky.",
                    "description": "Now take a 1 in (2.5 cm) brush and dip it into the white oil paint on your palette. Dab the paint onto part of the sky and swirl it a little to make a cloud as large as you like. Instead of making several clouds that are all bright white, try to leave a few gaps or paint pale wispy clouds as well. If you'd like to soften the clouds even more, brush a clean, dry 2 in (5.1 cm) brush over the clouds to blur them into the sky."
                }
            ]
        },
        {
            "name": "Painting Details in the Landscape",
            "steps": [
                {
                    "headline": "Use a palette knife to make large shapes.",
                    "description": "To create, or block in, rough shapes, such as mountains, trees, barns, or boulders, dip the edges of an angled palette knife into your paint. Scrape the side of the palette knife against the canvas to create sharp angles or edges. You can use the palette knife to simply outline the shapes and then fill them in with a paintbrush. If you prefer, keep using the palette knife to paint the subject, especially if you want it to look really rough."
                },
                {
                    "headline": "Create mid-ground elements, such as a treeline.",
                    "description": "Tap a paintbrush onto the mid-ground of the canvas to create a treeline in the distance, a far off field, or a fence along the horizon. Keep in mind that these mid-ground shapes will be less detailed than things that are closer to the viewer in the foreground. To make a treeline with realistic earth-tones, mix a little green, black, and brown oil paint. Then, dip a 2 in (5.1 cm) paintbrush into it and tap the end of the brush along the mid-ground of the painting."
                },
                {
                    "headline": "Paint in the details of your landscape with a paintbrush.",
                    "description": "Switch to a fine-tip paintbrush, and paint subjects, such as fences, bridges, or buildings, in the foreground slightly darker than in the mid-ground. You should also make the subjects more detailed if they're closer to you. For example, paint a large tree or flower in the foreground close to the viewer. Make the colors darker and the leaves or petals very detailed. If you have trees or flowers in the mid-ground, use muted colors and just paint their general shape."
                },
                {
                    "headline": "Add shadows to your subjects so they look realistic.",
                    "description": "Remember how you chose what time of day to paint your landscape? Consider where the sun would be placed in the sky and where it would cast its light. Then, use a small palette knife or fine-tip paintbrush to dab a little blue-green oil paint where the shadows should fall. The shadows will also add depth to your landscape."
                },
                {
                    "headline": "Use a blending brush to blur parts of the painting that you want to soften.",
                    "description": "If you painted water or a field of softly blowing grass, you may want to give the illusion of soft movement or a reflection. Take a clean, dry 2 in (5.1 cm) brush and gently brush it horizontally against the area of the canvas that you'd like to blur. The dry brush will blend the brushstrokes so they're not visible.Tip: If you'd like to show the reflection of something in the water, such as trees along the waterline, drag the brush down from the subject into the water."
                }
            ]
        }
    ],
    "tyn": [
        "Canvas",
        "Easel",
        "Paintbrushes",
        "Paint palette",
        "Oil paints",
        "Solvent"
    ],
    "text": " Toning the Canvas Select the subject for your painting. Think about what type of landscape you'd like to paint. Do you want to include the ocean, a mountain, or a field? Decide what season you'd like to paint and consider what type of light your landscape will have. For example, if you're painting an afternoon scene, the light might be casting long shadows.Tip: Although you can paint outside from real life, you could prop a photograph of an outdoor scene near your easel. Then, you can refer to the photo as you paint. To give you some ideas, you might want to paint a bright spring scene of a mountain with pine trees in the foreground. You could also paint a darker landscape of the ocean at sunset with deep streaks across the sky. Set your canvas on an easel and squeeze oil paints onto a palette. If you don't have an easel or you're painting a small canvas, you can prop the canvas against something sturdy or lay it flat on your work surface. Then, get out a paint palette and squeeze a coin-sized amount of each color of oil paint that you want to use. Improvise if you don't have a classic artist's palette. Use a smooth piece of cardboard, a flat glass platter, a thin plank of wood, or a plastic container lid. Cover the canvas with your lightest tone. Decide the lightest color that will be on your landscape, such as a pale blue sky, a warm sunlight tone, or a light cool gray. Dip whichever brush you feel comfortable using in transparent oil paint and a few drops of solvent, such as turpentine. Then, brush that tone over the entire surface of the canvas and rub a paper towel or cloth over the canvas to blend the color.Did You Know? Toning the canvas will cover the bold white of the blank canvas so tiny points of white aren't visible through your landscape painting. To make a warm sunlight tone, blend ivory black with white and a little orange. To create a pale blue, mix blue with gray and white. Dry the toned canvas at room temperature for 1 to 2 days. Set the canvas in a well-ventilated room and leave it to dry completely. This should take 1 to 2 days depending on your climate. Then, you can begin to paint the sky on your canvas. To ventilate the room, run a fan or open a window. Remember to clean your paintbrushes and cover the paint palette tightly to prevent them from drying out. Paint the outline of major shapes with a light oil paint color. Dip a small paintbrush into a light paint color and use it to lightly paint in the outline of main focal points like trees, mountains, barns, or fences, for instance. This rough outline will help you fill in the composition as you paint. Be as detailed or basic as you like when you paint the outline. Make the shapes more detailed if you want more guidance as you paint the landscape. If you prefer to make up the composition of the painting as you go, you can skip this step. Working on the Sky Blend oil paint to make a sky color. You might mix cobalt blue with ivory black and a little white to make a realistic blue sky. Or blend burnt sienna with yellow ochre and naples yellow to make golden sky at sunset. You can make a few different hues with the colors on your palette. Keep in mind that if you want to apply layers of oil paint, you should with the thinnest, most transparent colors before adding thicker layers. Paint the darkest part of the sky near the top of your canvas. You can use any size brush you like to apply the darkest paint for the sky along the top of the canvas. The sky is usually a little darker near the top and lighter near the horizon line regardless of the time of day. If you'd like to make the edges of the painting even darker, especially if you're painting an evening landscape, add a touch of black paint to the corners and blend them in with your brush. Brush the paint down to create a lighter color that fills the sky. You may want to switch to a medium or large paintbrush if you started with a small one. Brush the paintbrush into the color you applied across the top of the canvas and then drag it down towards the middle half or two-thirds of the canvas. As you bring the color down, it will become lighter.Did You Know? Atmospheric perspective is the effect you get when you layer color to create distance. For example, things that are far away will appear lighter than parts of your landscape that are darker and closer. If you run out of the paint to brush down, don't be afraid to dip your brush onto your palette to pick up more oil paint. Brush a clean paintbrush over the sky to soften and blend the paint. Once half or two-thirds of the canvas is filled with the sky, take a clean and dry 2 in (5.1 cm) brush and move it across the sky until you've lightly blended the paint. You shouldn't see a noticeable break or difference between the dark portion of the sky and the lighter area near the horizon. It's fine to leave some areas of the sky darker to create interest and draw in your viewer. Use the corner of a small brush to add clouds to the sky. Now take a 1 in (2.5 cm) brush and dip it into the white oil paint on your palette. Dab the paint onto part of the sky and swirl it a little to make a cloud as large as you like. Instead of making several clouds that are all bright white, try to leave a few gaps or paint pale wispy clouds as well. If you'd like to soften the clouds even more, brush a clean, dry 2 in (5.1 cm) brush over the clouds to blur them into the sky. Painting Details in the Landscape Use a palette knife to make large shapes. To create, or block in, rough shapes, such as mountains, trees, barns, or boulders, dip the edges of an angled palette knife into your paint. Scrape the side of the palette knife against the canvas to create sharp angles or edges. You can use the palette knife to simply outline the shapes and then fill them in with a paintbrush. If you prefer, keep using the palette knife to paint the subject, especially if you want it to look really rough. Create mid-ground elements, such as a treeline. Tap a paintbrush onto the mid-ground of the canvas to create a treeline in the distance, a far off field, or a fence along the horizon. Keep in mind that these mid-ground shapes will be less detailed than things that are closer to the viewer in the foreground. To make a treeline with realistic earth-tones, mix a little green, black, and brown oil paint. Then, dip a 2 in (5.1 cm) paintbrush into it and tap the end of the brush along the mid-ground of the painting. Paint in the details of your landscape with a paintbrush. Switch to a fine-tip paintbrush, and paint subjects, such as fences, bridges, or buildings, in the foreground slightly darker than in the mid-ground. You should also make the subjects more detailed if they're closer to you. For example, paint a large tree or flower in the foreground close to the viewer. Make the colors darker and the leaves or petals very detailed. If you have trees or flowers in the mid-ground, use muted colors and just paint their general shape. Add shadows to your subjects so they look realistic. Remember how you chose what time of day to paint your landscape? Consider where the sun would be placed in the sky and where it would cast its light. Then, use a small palette knife or fine-tip paintbrush to dab a little blue-green oil paint where the shadows should fall. The shadows will also add depth to your landscape. Use a blending brush to blur parts of the painting that you want to soften. If you painted water or a field of softly blowing grass, you may want to give the illusion of soft movement or a reflection. Take a clean, dry 2 in (5.1 cm) brush and gently brush it horizontally against the area of the canvas that you'd like to blur. The dry brush will blend the brushstrokes so they're not visible.Tip: If you'd like to show the reflection of something in the water, such as trees along the waterline, drag the brush down from the subject into the water.",
    "sentences": [
        " Toning the Canvas Select the subject for your painting.",
        "Think about what type of landscape you'd like to paint.",
        "Do you want to include the ocean, a mountain, or a field?",
        "Decide what season you'd like to paint and consider what type of light your landscape will have.",
        "For example, if you're painting an afternoon scene, the light might be casting long shadows.Tip: Although you can paint outside from real life, you could prop a photograph of an outdoor scene near your easel.",
        "Then, you can refer to the photo as you paint.",
        "To give you some ideas, you might want to paint a bright spring scene of a mountain with pine trees in the foreground.",
        "You could also paint a darker landscape of the ocean at sunset with deep streaks across the sky.",
        "Set your canvas on an easel and squeeze oil paints onto a palette.",
        "If you don't have an easel or you're painting a small canvas, you can prop the canvas against something sturdy or lay it flat on your work surface.",
        "Then, get out a paint palette and squeeze a coin-sized amount of each color of oil paint that you want to use.",
        "Improvise if you don't have a classic artist's palette.",
        "Use a smooth piece of cardboard, a flat glass platter, a thin plank of wood, or a plastic container lid.",
        "Cover the canvas with your lightest tone.",
        "Decide the lightest color that will be on your landscape, such as a pale blue sky, a warm sunlight tone, or a light cool gray.",
        "Dip whichever brush you feel comfortable using in transparent oil paint and a few drops of solvent, such as turpentine.",
        "Then, brush that tone over the entire surface of the canvas and rub a paper towel or cloth over the canvas to blend the color.Did You Know?",
        "Toning the canvas will cover the bold white of the blank canvas so tiny points of white aren't visible through your landscape painting.",
        "To make a warm sunlight tone, blend ivory black with white and a little orange.",
        "To create a pale blue, mix blue with gray and white.",
        "Dry the toned canvas at room temperature for 1 to 2 days.",
        "Set the canvas in a well-ventilated room and leave it to dry completely.",
        "This should take 1 to 2 days depending on your climate.",
        "Then, you can begin to paint the sky on your canvas.",
        "To ventilate the room, run a fan or open a window.",
        "Remember to clean your paintbrushes and cover the paint palette tightly to prevent them from drying out.",
        "Paint the outline of major shapes with a light oil paint color.",
        "Dip a small paintbrush into a light paint color and use it to lightly paint in the outline of main focal points like trees, mountains, barns, or fences, for instance.",
        "This rough outline will help you fill in the composition as you paint.",
        "Be as detailed or basic as you like when you paint the outline.",
        "Make the shapes more detailed if you want more guidance as you paint the landscape.",
        "If you prefer to make up the composition of the painting as you go, you can skip this step.",
        "Working on the Sky Blend oil paint to make a sky color.",
        "You might mix cobalt blue with ivory black and a little white to make a realistic blue sky.",
        "Or blend burnt sienna with yellow ochre and naples yellow to make golden sky at sunset.",
        "You can make a few different hues with the colors on your palette.",
        "Keep in mind that if you want to apply layers of oil paint, you should with the thinnest, most transparent colors before adding thicker layers.",
        "Paint the darkest part of the sky near the top of your canvas.",
        "You can use any size brush you like to apply the darkest paint for the sky along the top of the canvas.",
        "The sky is usually a little darker near the top and lighter near the horizon line regardless of the time of day.",
        "If you'd like to make the edges of the painting even darker, especially if you're painting an evening landscape, add a touch of black paint to the corners and blend them in with your brush.",
        "Brush the paint down to create a lighter color that fills the sky.",
        "You may want to switch to a medium or large paintbrush if you started with a small one.",
        "Brush the paintbrush into the color you applied across the top of the canvas and then drag it down towards the middle half or two-thirds of the canvas.",
        "As you bring the color down, it will become lighter.Did You Know?",
        "Atmospheric perspective is the effect you get when you layer color to create distance.",
        "For example, things that are far away will appear lighter than parts of your landscape that are darker and closer.",
        "If you run out of the paint to brush down, don't be afraid to dip your brush onto your palette to pick up more oil paint.",
        "Brush a clean paintbrush over the sky to soften and blend the paint.",
        "Once half or two-thirds of the canvas is filled with the sky, take a clean and dry 2 in (5.1 cm) brush and move it across the sky until you've lightly blended the paint.",
        "You shouldn't see a noticeable break or difference between the dark portion of the sky and the lighter area near the horizon.",
        "It's fine to leave some areas of the sky darker to create interest and draw in your viewer.",
        "Use the corner of a small brush to add clouds to the sky.",
        "Now take a 1 in (2.5 cm) brush and dip it into the white oil paint on your palette.",
        "Dab the paint onto part of the sky and swirl it a little to make a cloud as large as you like.",
        "Instead of making several clouds that are all bright white, try to leave a few gaps or paint pale wispy clouds as well.",
        "If you'd like to soften the clouds even more, brush a clean, dry 2 in (5.1 cm) brush over the clouds to blur them into the sky.",
        "Painting Details in the Landscape Use a palette knife to make large shapes.",
        "To create, or block in, rough shapes, such as mountains, trees, barns, or boulders, dip the edges of an angled palette knife into your paint.",
        "Scrape the side of the palette knife against the canvas to create sharp angles or edges.",
        "You can use the palette knife to simply outline the shapes and then fill them in with a paintbrush.",
        "If you prefer, keep using the palette knife to paint the subject, especially if you want it to look really rough.",
        "Create mid-ground elements, such as a treeline.",
        "Tap a paintbrush onto the mid-ground of the canvas to create a treeline in the distance, a far off field, or a fence along the horizon.",
        "Keep in mind that these mid-ground shapes will be less detailed than things that are closer to the viewer in the foreground.",
        "To make a treeline with realistic earth-tones, mix a little green, black, and brown oil paint.",
        "Then, dip a 2 in (5.1 cm) paintbrush into it and tap the end of the brush along the mid-ground of the painting.",
        "Paint in the details of your landscape with a paintbrush.",
        "Switch to a fine-tip paintbrush, and paint subjects, such as fences, bridges, or buildings, in the foreground slightly darker than in the mid-ground.",
        "You should also make the subjects more detailed if they're closer to you.",
        "For example, paint a large tree or flower in the foreground close to the viewer.",
        "Make the colors darker and the leaves or petals very detailed.",
        "If you have trees or flowers in the mid-ground, use muted colors and just paint their general shape.",
        "Add shadows to your subjects so they look realistic.",
        "Remember how you chose what time of day to paint your landscape?",
        "Consider where the sun would be placed in the sky and where it would cast its light.",
        "Then, use a small palette knife or fine-tip paintbrush to dab a little blue-green oil paint where the shadows should fall.",
        "The shadows will also add depth to your landscape.",
        "Use a blending brush to blur parts of the painting that you want to soften.",
        "If you painted water or a field of softly blowing grass, you may want to give the illusion of soft movement or a reflection.",
        "Take a clean, dry 2 in (5.1 cm) brush and gently brush it horizontally against the area of the canvas that you'd like to blur.",
        "The dry brush will blend the brushstrokes so they're not visible.Tip: If you'd like to show the reflection of something in the water, such as trees along the waterline, drag the brush down from the subject into the water."
    ]
}