{
    "title": "How to Clean and Maintain a Rain Barrel",
    "url": "https://www.wikihow.com/Clean-and-Maintain-a-Rain-Barrel",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "steps": [
        {
            "headline": "Open valve of barrel.",
            "description": "Let stagnant water stream from the barrel. After most of the water has escaped, the barrel should be light enough to safely move. If the barrel is found to still be too heavy, acquire further assistance in moving the barrel throughout the remaining steps."
        },
        {
            "headline": "Disconnect rain barrel from water collection system.",
            "description": "Separate the barrel from its original location, removing any gutters or funnels used to direct water. If any obstructions are present in any of the barrel’s openings, clear them away."
        },
        {
            "headline": "Flip barrel over.",
            "description": "Drain any remaining stagnant water from the barrel. Decaying material (such as leaves and dirt) will also flow out with the water. At this time, identifying if any animals are present in the barrel would be advised."
        },
        {
            "headline": "Remove any sediment or foreign materials from the barrel.",
            "description": "Keeping the barrel on the ground, rinse the inside with water and remove decaying materials. Use a hooked coat hanger to pull out and dislodge sludge from the barrel openings. Upon finishing the removal of foreign material, dispose of the material into a designated yard waste receptacle."
        },
        {
            "headline": "Make cleaning solution.",
            "description": "Within the five-gallon bucket, mix dish soap and water until suds are clearly visible. Fill bucket two-thirds of the way."
        },
        {
            "headline": "Clean the outside of the barrel.",
            "description": "Keeping the bottom end of the barrel up, sponge and clean off the outside of the container."
        },
        {
            "headline": "Inspect the inside of the barrel.",
            "description": "Flip the barrel to its upright position. Using a flashlight, investigate the insides of the container. It will most likely still be very dirty with sludge and hardened sediment."
        },
        {
            "headline": "Put broom head into the barrel.",
            "description": "Insert the broom head through one of the openings of the barrel. Allow it to fall to the bottom. If your barrel does not have an opening large enough for a broom head, instead stuff a sponge or mop head into the barrel and move it around with the broomstick."
        },
        {
            "headline": "Attach broomstick to the broom head and clean the inside of the barrel.",
            "description": "Screw the broomstick into the broom head inside of the barrel. Add the remaining cleaning solution into the barrel and scrub the inside thoroughly."
        },
        {
            "headline": "Empty cleaning products from the barrel.",
            "description": "Unscrew the broomstick from the broom head and remove the shaft. Dump the cleaning and dirt solution back into the five-gallon bucket. If the barrel is too heavy, acquire assistance to avoid self-harm. Once empty, feed the broom head out through one of the openings of the barrel. Dispose of the contents of the five-gallon bucket into a sink or proper wastewater manageable receptacle."
        },
        {
            "headline": "Inspect the inside of the barrel.",
            "description": "If the barrel appears to be satisfactorily clean, leave it to dry."
        },
        {
            "headline": "Once dry, identify if the barrel has a hole or crack.",
            "description": "Inspect the outside of the barrel for holes or any damage that would allow leaks to occur. If found, prepare to patch the area."
        },
        {
            "headline": "Sand the area around the damage.",
            "description": "Using sandpaper (coarse grade preferred) roughen the area around the hole or crack. The scratches will create a greater surface area in which the patch and sealant will cure."
        },
        {
            "headline": "Patch the area.",
            "description": "Place the thin plastic sheet over the damaged area, and secure it with the adhesive drywall patch. Using a waterproofing sealant and plastic spatula, pad sealant around the patch."
        },
        {
            "headline": "Cure the patch.",
            "description": "Store the barrel in a cool, dry place and allow sealant to cure (depending on the type of sealant used, this process will take between 6 and 24 hours)."
        },
        {
            "headline": "Return the barrel to the water collection system.",
            "description": "After cleaning and sealing of damage has completed, replace the barrel to its original location so that normal water collection may continue."
        }
    ],
    "tyn": [
        "Rain barrel",
        "Five-gallon bucket",
        "Sponge",
        "Dish soap",
        "Hose and nozzle",
        "Coat hanger",
        "Broomstick and removable broom head",
        "Flashlight",
        "Sandpaper",
        "Thin plastic sheet",
        "Drywall patching",
        "Waterproofing sealant",
        "Plastic Spatula"
    ],
    "text": " Open valve of barrel. Let stagnant water stream from the barrel. After most of the water has escaped, the barrel should be light enough to safely move. If the barrel is found to still be too heavy, acquire further assistance in moving the barrel throughout the remaining steps. Disconnect rain barrel from water collection system. Separate the barrel from its original location, removing any gutters or funnels used to direct water. If any obstructions are present in any of the barrel’s openings, clear them away. Flip barrel over. Drain any remaining stagnant water from the barrel. Decaying material (such as leaves and dirt) will also flow out with the water. At this time, identifying if any animals are present in the barrel would be advised. Remove any sediment or foreign materials from the barrel. Keeping the barrel on the ground, rinse the inside with water and remove decaying materials. Use a hooked coat hanger to pull out and dislodge sludge from the barrel openings. Upon finishing the removal of foreign material, dispose of the material into a designated yard waste receptacle. Make cleaning solution. Within the five-gallon bucket, mix dish soap and water until suds are clearly visible. Fill bucket two-thirds of the way. Clean the outside of the barrel. Keeping the bottom end of the barrel up, sponge and clean off the outside of the container. Inspect the inside of the barrel. Flip the barrel to its upright position. Using a flashlight, investigate the insides of the container. It will most likely still be very dirty with sludge and hardened sediment. Put broom head into the barrel. Insert the broom head through one of the openings of the barrel. Allow it to fall to the bottom. If your barrel does not have an opening large enough for a broom head, instead stuff a sponge or mop head into the barrel and move it around with the broomstick. Attach broomstick to the broom head and clean the inside of the barrel. Screw the broomstick into the broom head inside of the barrel. Add the remaining cleaning solution into the barrel and scrub the inside thoroughly. Empty cleaning products from the barrel. Unscrew the broomstick from the broom head and remove the shaft. Dump the cleaning and dirt solution back into the five-gallon bucket. If the barrel is too heavy, acquire assistance to avoid self-harm. Once empty, feed the broom head out through one of the openings of the barrel. Dispose of the contents of the five-gallon bucket into a sink or proper wastewater manageable receptacle. Inspect the inside of the barrel. If the barrel appears to be satisfactorily clean, leave it to dry. Once dry, identify if the barrel has a hole or crack. Inspect the outside of the barrel for holes or any damage that would allow leaks to occur. If found, prepare to patch the area. Sand the area around the damage. Using sandpaper (coarse grade preferred) roughen the area around the hole or crack. The scratches will create a greater surface area in which the patch and sealant will cure. Patch the area. Place the thin plastic sheet over the damaged area, and secure it with the adhesive drywall patch. Using a waterproofing sealant and plastic spatula, pad sealant around the patch. Cure the patch. Store the barrel in a cool, dry place and allow sealant to cure (depending on the type of sealant used, this process will take between 6 and 24 hours). Return the barrel to the water collection system. After cleaning and sealing of damage has completed, replace the barrel to its original location so that normal water collection may continue.",
    "sentences": [
        " Open valve of barrel.",
        "Let stagnant water stream from the barrel.",
        "After most of the water has escaped, the barrel should be light enough to safely move.",
        "If the barrel is found to still be too heavy, acquire further assistance in moving the barrel throughout the remaining steps.",
        "Disconnect rain barrel from water collection system.",
        "Separate the barrel from its original location, removing any gutters or funnels used to direct water.",
        "If any obstructions are present in any of the barrel’s openings, clear them away.",
        "Flip barrel over.",
        "Drain any remaining stagnant water from the barrel.",
        "Decaying material (such as leaves and dirt) will also flow out with the water.",
        "At this time, identifying if any animals are present in the barrel would be advised.",
        "Remove any sediment or foreign materials from the barrel.",
        "Keeping the barrel on the ground, rinse the inside with water and remove decaying materials.",
        "Use a hooked coat hanger to pull out and dislodge sludge from the barrel openings.",
        "Upon finishing the removal of foreign material, dispose of the material into a designated yard waste receptacle.",
        "Make cleaning solution.",
        "Within the five-gallon bucket, mix dish soap and water until suds are clearly visible.",
        "Fill bucket two-thirds of the way.",
        "Clean the outside of the barrel.",
        "Keeping the bottom end of the barrel up, sponge and clean off the outside of the container.",
        "Inspect the inside of the barrel.",
        "Flip the barrel to its upright position.",
        "Using a flashlight, investigate the insides of the container.",
        "It will most likely still be very dirty with sludge and hardened sediment.",
        "Put broom head into the barrel.",
        "Insert the broom head through one of the openings of the barrel.",
        "Allow it to fall to the bottom.",
        "If your barrel does not have an opening large enough for a broom head, instead stuff a sponge or mop head into the barrel and move it around with the broomstick.",
        "Attach broomstick to the broom head and clean the inside of the barrel.",
        "Screw the broomstick into the broom head inside of the barrel.",
        "Add the remaining cleaning solution into the barrel and scrub the inside thoroughly.",
        "Empty cleaning products from the barrel.",
        "Unscrew the broomstick from the broom head and remove the shaft.",
        "Dump the cleaning and dirt solution back into the five-gallon bucket.",
        "If the barrel is too heavy, acquire assistance to avoid self-harm.",
        "Once empty, feed the broom head out through one of the openings of the barrel.",
        "Dispose of the contents of the five-gallon bucket into a sink or proper wastewater manageable receptacle.",
        "Inspect the inside of the barrel.",
        "If the barrel appears to be satisfactorily clean, leave it to dry.",
        "Once dry, identify if the barrel has a hole or crack.",
        "Inspect the outside of the barrel for holes or any damage that would allow leaks to occur.",
        "If found, prepare to patch the area.",
        "Sand the area around the damage.",
        "Using sandpaper (coarse grade preferred) roughen the area around the hole or crack.",
        "The scratches will create a greater surface area in which the patch and sealant will cure.",
        "Patch the area.",
        "Place the thin plastic sheet over the damaged area, and secure it with the adhesive drywall patch.",
        "Using a waterproofing sealant and plastic spatula, pad sealant around the patch.",
        "Cure the patch.",
        "Store the barrel in a cool, dry place and allow sealant to cure (depending on the type of sealant used, this process will take between 6 and 24 hours).",
        "Return the barrel to the water collection system.",
        "After cleaning and sealing of damage has completed, replace the barrel to its original location so that normal water collection may continue."
    ]
}