{
    "title": "How to Make Two Ingredient Play Dough",
    "url": "https://www.wikihow.com/Make-Two-Ingredient-Play-Dough",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Craft for Kids",
        "Putty Dough and Slime",
        "Play Dough"
    ],
    "methods": [
        {
            "name": "Creating Silky Play Dough",
            "steps": [
                {
                    "headline": "Pour some hair conditioner into a bowl.",
                    "description": "How much conditioner you use is up to you. If you only want to make a little bit of play dough, use 1 tablespoon (15 milliliters) of conditioner. If you want to make more, try ½ cup (120 milliliters) of conditioner instead. Keep in mind that you will eventually need to add twice the amount of cornstarch. If you don't have conditioner, you can use hand lotion or aloe vera instead. Make sure that you like the smell of the conditioner. You don't need to use the expensive kind of conditioner. The cheap kind will work just fine."
                },
                {
                    "headline": "Add twice as much cornstarch into the bowl.",
                    "description": "For example, if you used 1 tablespoon (15 milliliters) of conditioner, you will need 2 tablespoons (15 grams) of cornstarch. If you used ½ cup (120 milliliters) of conditioner, then you will need 1 cup (125 grams) of cornstarch. If you can't find cornstarch, use cornflour instead. It is the same thing, but with a different name."
                },
                {
                    "headline": "Mix everything together with a spoon or rubber spatula.",
                    "description": "Scrape the sides of the bowl often so that all of the cornstarch goes into the conditioner. If the play dough sticks to the spoon too much, add 1 teaspoon of cornstarch. If the play dough is too crumbly, add 1 teaspoon of conditioner."
                },
                {
                    "headline": "Knead the play dough for 1 to 2 minutes.",
                    "description": "Press down on the dough with your hands, then pick it up and flip it over. Press down on it and flip it over. Repeat this step until the dough starts to come together and all of the cornstarch has disappeared into the conditioner. If you made a tiny amount of play dough, knead it with your fingers instead."
                },
                {
                    "headline": "Knead in some glitter and/or food coloring, if desired.",
                    "description": "How much glitter and food coloring you use depends on how much play dough you are making. If you made a little bit of play dough, a sprinkle of glitter and a drop of food coloring will be plenty. If you made a lot of play dough, try a teaspoon of glitter and 1 to 3 drops of food coloring. Extra-fine glitter will look much nicer than the regular chunky kind, but you can use whatever you want. If your conditioner is already colored, be aware that the food coloring may mix with it to create a new color. It would be best to use the same color and get brighter play dough."
                },
                {
                    "headline": "Play with the play dough, then discard it when it dries up.",
                    "description": "Because this recipe is very simple, the play dough will not last very long. It may start drying up after the first time that you use it. If it is still wet when you are done playing with it, you can put it into a sealed container."
                }
            ]
        },
        {
            "name": "Making Cloud Dough",
            "steps": [
                {
                    "headline": "Pour some cornstarch onto a clean counter.",
                    "description": "How much cornstarch you use is up to you. The measurement doesn't have to be exact, but ½ cup (65 grams) is a good place to start. If you can't find cornstarch, look for cornflour instead. It's the same thing, but with a different name."
                },
                {
                    "headline": "Add an equal amount of shaving cream.",
                    "description": "Again, the amount does not have to be precise. Simply squirt enough shaving cream onto the cornstarch until the amounts look equal. Make sure that you are using the creamy, foamy type of shaving cream. Don't use the gel kind. You don't have to use a measuring cup for this. It will be too messy and too much of a hassle."
                },
                {
                    "headline": "Knead the ingredients together for about 5 minutes.",
                    "description": "Fold the cornstarch over the shaving cream, then press down on it. Keep folding and pressing the ingredients until they start to clump together and form a dough. The dough may look crumbly at first, but eventually it will stick together and turn soft. This will take about 5 minutes."
                },
                {
                    "headline": "Add some food coloring and/or glitter, if desired.",
                    "description": "How much you use of each depends on how much cornstarch and shaving cream you used to begin with. About 1 to 3 drops of food coloring and 1 teaspoon of glitter will be enough for 1 cup (240 grams) of play dough. Be sure to knead the dough well after you add the food coloring and/or glitter. Extra-fine scrapbooking glitter will look the nicest, but you can use the chunky craft kind if you want to."
                },
                {
                    "headline": "Play with the play dough in an easy-to-clean area.",
                    "description": "This play dough is soft and foamy, like a cloud. It can get crumbly, however, so play with it some place that it easy to clean. A table would be perfect. When you are done playing with the play dough, put it into an air-tight container. If some of this play dough accidentally gets off your playing surface and into your carpet, don't worry! You can get it out of carpet by carefully scraping it away, then removing leftover stains with something like soapy water or rubbing alcohol."
                },
                {
                    "headline": "Discard the play dough when it starts to turn dry.",
                    "description": "This type of play dough will not last very long. You can try to make it last longer by keeping it in an air-tight container, but it will still begin to dry out after a few days."
                }
            ]
        },
        {
            "name": "Mixing Edible Play Dough",
            "steps": [
                {
                    "headline": "Scoop 1 cup (226.5 grams) of pre-made frosting into a mixer.",
                    "description": "Make sure that you use the type of frosting that comes in tubs, not \"toothpaste\" tubes. You can find this frosting alongside the cake mix in the baking aisle of a grocery store. This play dough is edible, but you can use it for play too. If you plan on eating it, make sure that all your counters and utensils are clean. Use “Funfetti” frosting for a colorful effect. It is white frosting with sprinkles added to it. Do not use frozen or refrigerated frosting, such as Cool Whip. It is not the same thing."
                },
                {
                    "headline": "Add some food coloring or edible sprinkles, if desired.",
                    "description": "If you used white frosting, you might want to add some food coloring to it to make it look more interesting. A few drops is all that you need. You can also add 1 to 3 teaspoons of candle sprinkles for more color. Do not add food coloring if your frosting came colored. Do not use glitter, or the play dough won't be edible anymore."
                },
                {
                    "headline": "Mix in 2¾ cups (345 grams) of powdered sugar a little bit at time.",
                    "description": "Turn the mixer onto a low speed setting. Add 2¾ cups (345 grams) of powdered sugar a little bit at a time while the mixer is turning. The play dough is ready when it is no longer sticky and looks a little bit like ice cream. Pause the mixer and touch the play dough from time-to-time; you may not need to use all 2¾ cups (345 grams) of powdered sugar. It is important to add the sugar slowly, otherwise it may clump together."
                },
                {
                    "headline": "Transfer the play dough to the counter, then make any adjustments.",
                    "description": "Roll the dough into a ball on the counter. If it feels sticky, add some more powdered sugar. If it feels too hard, crumbly, or dry, add a splash of cooking oil to it. Olive oil will work the best, but canola or sunflower oil will also work. If you add powdered sugar or oil to your dough, be sure to knead them in well."
                },
                {
                    "headline": "Play with the play dough.",
                    "description": "Roll it into balls with your hands, and put it into ice cream bowls or ice cream cones. Decorate the balls with candy sprinkles to make it look even more like ice cream. Feel free to nibble on it, but don't eat all of the dough. If you start taking big bites out of it, you'll get a tummy ache!"
                },
                {
                    "headline": "Store the play dough in the fridge, and discard it after 1 week.",
                    "description": "Do not eat this dough after the first time you play with it. It will collect a lot of germs as you play with it, so eating it on the second day could make you sick. Throw the dough out once it starts to feel dry, look moldy, or smell. It should keep for about 5 to 7 days before going bad."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Silky Play Dough",
        "Cornstarch",
        "Conditioner",
        "Mixing bowl",
        "Mixing spoon",
        "Food coloring (optional)",
        "Glitter (optional)",
        "Cloud Dough",
        "Shaving cream",
        "Edible Play Dough",
        "1 cup (226.5 grams) pre-made frosting",
        "2¾ cups (345 grams) powdered sugar",
        "Mixer",
        "Edible sprinkles (optional)"
    ],
    "text": " Creating Silky Play Dough Pour some hair conditioner into a bowl. How much conditioner you use is up to you. If you only want to make a little bit of play dough, use 1 tablespoon (15 milliliters) of conditioner. If you want to make more, try ½ cup (120 milliliters) of conditioner instead. Keep in mind that you will eventually need to add twice the amount of cornstarch. If you don't have conditioner, you can use hand lotion or aloe vera instead. Make sure that you like the smell of the conditioner. You don't need to use the expensive kind of conditioner. The cheap kind will work just fine. Add twice as much cornstarch into the bowl. For example, if you used 1 tablespoon (15 milliliters) of conditioner, you will need 2 tablespoons (15 grams) of cornstarch. If you used ½ cup (120 milliliters) of conditioner, then you will need 1 cup (125 grams) of cornstarch. If you can't find cornstarch, use cornflour instead. It is the same thing, but with a different name. Mix everything together with a spoon or rubber spatula. Scrape the sides of the bowl often so that all of the cornstarch goes into the conditioner. If the play dough sticks to the spoon too much, add 1 teaspoon of cornstarch. If the play dough is too crumbly, add 1 teaspoon of conditioner. Knead the play dough for 1 to 2 minutes. Press down on the dough with your hands, then pick it up and flip it over. Press down on it and flip it over. Repeat this step until the dough starts to come together and all of the cornstarch has disappeared into the conditioner. If you made a tiny amount of play dough, knead it with your fingers instead. Knead in some glitter and/or food coloring, if desired. How much glitter and food coloring you use depends on how much play dough you are making. If you made a little bit of play dough, a sprinkle of glitter and a drop of food coloring will be plenty. If you made a lot of play dough, try a teaspoon of glitter and 1 to 3 drops of food coloring. Extra-fine glitter will look much nicer than the regular chunky kind, but you can use whatever you want. If your conditioner is already colored, be aware that the food coloring may mix with it to create a new color. It would be best to use the same color and get brighter play dough. Play with the play dough, then discard it when it dries up. Because this recipe is very simple, the play dough will not last very long. It may start drying up after the first time that you use it. If it is still wet when you are done playing with it, you can put it into a sealed container. Making Cloud Dough Pour some cornstarch onto a clean counter. How much cornstarch you use is up to you. The measurement doesn't have to be exact, but ½ cup (65 grams) is a good place to start. If you can't find cornstarch, look for cornflour instead. It's the same thing, but with a different name. Add an equal amount of shaving cream. Again, the amount does not have to be precise. Simply squirt enough shaving cream onto the cornstarch until the amounts look equal. Make sure that you are using the creamy, foamy type of shaving cream. Don't use the gel kind. You don't have to use a measuring cup for this. It will be too messy and too much of a hassle. Knead the ingredients together for about 5 minutes. Fold the cornstarch over the shaving cream, then press down on it. Keep folding and pressing the ingredients until they start to clump together and form a dough. The dough may look crumbly at first, but eventually it will stick together and turn soft. This will take about 5 minutes. Add some food coloring and/or glitter, if desired. How much you use of each depends on how much cornstarch and shaving cream you used to begin with. About 1 to 3 drops of food coloring and 1 teaspoon of glitter will be enough for 1 cup (240 grams) of play dough. Be sure to knead the dough well after you add the food coloring and/or glitter. Extra-fine scrapbooking glitter will look the nicest, but you can use the chunky craft kind if you want to. Play with the play dough in an easy-to-clean area. This play dough is soft and foamy, like a cloud. It can get crumbly, however, so play with it some place that it easy to clean. A table would be perfect. When you are done playing with the play dough, put it into an air-tight container. If some of this play dough accidentally gets off your playing surface and into your carpet, don't worry! You can get it out of carpet by carefully scraping it away, then removing leftover stains with something like soapy water or rubbing alcohol. Discard the play dough when it starts to turn dry. This type of play dough will not last very long. You can try to make it last longer by keeping it in an air-tight container, but it will still begin to dry out after a few days. Mixing Edible Play Dough Scoop 1 cup (226.5 grams) of pre-made frosting into a mixer. Make sure that you use the type of frosting that comes in tubs, not \"toothpaste\" tubes. You can find this frosting alongside the cake mix in the baking aisle of a grocery store. This play dough is edible, but you can use it for play too. If you plan on eating it, make sure that all your counters and utensils are clean. Use “Funfetti” frosting for a colorful effect. It is white frosting with sprinkles added to it. Do not use frozen or refrigerated frosting, such as Cool Whip. It is not the same thing. Add some food coloring or edible sprinkles, if desired. If you used white frosting, you might want to add some food coloring to it to make it look more interesting. A few drops is all that you need. You can also add 1 to 3 teaspoons of candle sprinkles for more color. Do not add food coloring if your frosting came colored. Do not use glitter, or the play dough won't be edible anymore. Mix in 2¾ cups (345 grams) of powdered sugar a little bit at time. Turn the mixer onto a low speed setting. Add 2¾ cups (345 grams) of powdered sugar a little bit at a time while the mixer is turning. The play dough is ready when it is no longer sticky and looks a little bit like ice cream. Pause the mixer and touch the play dough from time-to-time; you may not need to use all 2¾ cups (345 grams) of powdered sugar. It is important to add the sugar slowly, otherwise it may clump together. Transfer the play dough to the counter, then make any adjustments. Roll the dough into a ball on the counter. If it feels sticky, add some more powdered sugar. If it feels too hard, crumbly, or dry, add a splash of cooking oil to it. Olive oil will work the best, but canola or sunflower oil will also work. If you add powdered sugar or oil to your dough, be sure to knead them in well. Play with the play dough. Roll it into balls with your hands, and put it into ice cream bowls or ice cream cones. Decorate the balls with candy sprinkles to make it look even more like ice cream. Feel free to nibble on it, but don't eat all of the dough. If you start taking big bites out of it, you'll get a tummy ache! Store the play dough in the fridge, and discard it after 1 week. Do not eat this dough after the first time you play with it. It will collect a lot of germs as you play with it, so eating it on the second day could make you sick. Throw the dough out once it starts to feel dry, look moldy, or smell. It should keep for about 5 to 7 days before going bad. Finished. ",
    "sentences": [
        " Creating Silky Play Dough Pour some hair conditioner into a bowl.",
        "How much conditioner you use is up to you.",
        "If you only want to make a little bit of play dough, use 1 tablespoon (15 milliliters) of conditioner.",
        "If you want to make more, try ½ cup (120 milliliters) of conditioner instead.",
        "Keep in mind that you will eventually need to add twice the amount of cornstarch.",
        "If you don't have conditioner, you can use hand lotion or aloe vera instead.",
        "Make sure that you like the smell of the conditioner.",
        "You don't need to use the expensive kind of conditioner.",
        "The cheap kind will work just fine.",
        "Add twice as much cornstarch into the bowl.",
        "For example, if you used 1 tablespoon (15 milliliters) of conditioner, you will need 2 tablespoons (15 grams) of cornstarch.",
        "If you used ½ cup (120 milliliters) of conditioner, then you will need 1 cup (125 grams) of cornstarch.",
        "If you can't find cornstarch, use cornflour instead.",
        "It is the same thing, but with a different name.",
        "Mix everything together with a spoon or rubber spatula.",
        "Scrape the sides of the bowl often so that all of the cornstarch goes into the conditioner.",
        "If the play dough sticks to the spoon too much, add 1 teaspoon of cornstarch.",
        "If the play dough is too crumbly, add 1 teaspoon of conditioner.",
        "Knead the play dough for 1 to 2 minutes.",
        "Press down on the dough with your hands, then pick it up and flip it over.",
        "Press down on it and flip it over.",
        "Repeat this step until the dough starts to come together and all of the cornstarch has disappeared into the conditioner.",
        "If you made a tiny amount of play dough, knead it with your fingers instead.",
        "Knead in some glitter and/or food coloring, if desired.",
        "How much glitter and food coloring you use depends on how much play dough you are making.",
        "If you made a little bit of play dough, a sprinkle of glitter and a drop of food coloring will be plenty.",
        "If you made a lot of play dough, try a teaspoon of glitter and 1 to 3 drops of food coloring.",
        "Extra-fine glitter will look much nicer than the regular chunky kind, but you can use whatever you want.",
        "If your conditioner is already colored, be aware that the food coloring may mix with it to create a new color.",
        "It would be best to use the same color and get brighter play dough.",
        "Play with the play dough, then discard it when it dries up.",
        "Because this recipe is very simple, the play dough will not last very long.",
        "It may start drying up after the first time that you use it.",
        "If it is still wet when you are done playing with it, you can put it into a sealed container.",
        "Making Cloud Dough Pour some cornstarch onto a clean counter.",
        "How much cornstarch you use is up to you.",
        "The measurement doesn't have to be exact, but ½ cup (65 grams) is a good place to start.",
        "If you can't find cornstarch, look for cornflour instead.",
        "It's the same thing, but with a different name.",
        "Add an equal amount of shaving cream.",
        "Again, the amount does not have to be precise.",
        "Simply squirt enough shaving cream onto the cornstarch until the amounts look equal.",
        "Make sure that you are using the creamy, foamy type of shaving cream.",
        "Don't use the gel kind.",
        "You don't have to use a measuring cup for this.",
        "It will be too messy and too much of a hassle.",
        "Knead the ingredients together for about 5 minutes.",
        "Fold the cornstarch over the shaving cream, then press down on it.",
        "Keep folding and pressing the ingredients until they start to clump together and form a dough.",
        "The dough may look crumbly at first, but eventually it will stick together and turn soft.",
        "This will take about 5 minutes.",
        "Add some food coloring and/or glitter, if desired.",
        "How much you use of each depends on how much cornstarch and shaving cream you used to begin with.",
        "About 1 to 3 drops of food coloring and 1 teaspoon of glitter will be enough for 1 cup (240 grams) of play dough.",
        "Be sure to knead the dough well after you add the food coloring and/or glitter.",
        "Extra-fine scrapbooking glitter will look the nicest, but you can use the chunky craft kind if you want to.",
        "Play with the play dough in an easy-to-clean area.",
        "This play dough is soft and foamy, like a cloud.",
        "It can get crumbly, however, so play with it some place that it easy to clean.",
        "A table would be perfect.",
        "When you are done playing with the play dough, put it into an air-tight container.",
        "If some of this play dough accidentally gets off your playing surface and into your carpet, don't worry!",
        "You can get it out of carpet by carefully scraping it away, then removing leftover stains with something like soapy water or rubbing alcohol.",
        "Discard the play dough when it starts to turn dry.",
        "This type of play dough will not last very long.",
        "You can try to make it last longer by keeping it in an air-tight container, but it will still begin to dry out after a few days.",
        "Mixing Edible Play Dough Scoop 1 cup (226.5 grams) of pre-made frosting into a mixer.",
        "Make sure that you use the type of frosting that comes in tubs, not \"toothpaste\" tubes.",
        "You can find this frosting alongside the cake mix in the baking aisle of a grocery store.",
        "This play dough is edible, but you can use it for play too.",
        "If you plan on eating it, make sure that all your counters and utensils are clean.",
        "Use “Funfetti” frosting for a colorful effect.",
        "It is white frosting with sprinkles added to it.",
        "Do not use frozen or refrigerated frosting, such as Cool Whip.",
        "It is not the same thing.",
        "Add some food coloring or edible sprinkles, if desired.",
        "If you used white frosting, you might want to add some food coloring to it to make it look more interesting.",
        "A few drops is all that you need.",
        "You can also add 1 to 3 teaspoons of candle sprinkles for more color.",
        "Do not add food coloring if your frosting came colored.",
        "Do not use glitter, or the play dough won't be edible anymore.",
        "Mix in 2¾ cups (345 grams) of powdered sugar a little bit at time.",
        "Turn the mixer onto a low speed setting.",
        "Add 2¾ cups (345 grams) of powdered sugar a little bit at a time while the mixer is turning.",
        "The play dough is ready when it is no longer sticky and looks a little bit like ice cream.",
        "Pause the mixer and touch the play dough from time-to-time; you may not need to use all 2¾ cups (345 grams) of powdered sugar.",
        "It is important to add the sugar slowly, otherwise it may clump together.",
        "Transfer the play dough to the counter, then make any adjustments.",
        "Roll the dough into a ball on the counter.",
        "If it feels sticky, add some more powdered sugar.",
        "If it feels too hard, crumbly, or dry, add a splash of cooking oil to it.",
        "Olive oil will work the best, but canola or sunflower oil will also work.",
        "If you add powdered sugar or oil to your dough, be sure to knead them in well.",
        "Play with the play dough.",
        "Roll it into balls with your hands, and put it into ice cream bowls or ice cream cones.",
        "Decorate the balls with candy sprinkles to make it look even more like ice cream.",
        "Feel free to nibble on it, but don't eat all of the dough.",
        "If you start taking big bites out of it, you'll get a tummy ache!",
        "Store the play dough in the fridge, and discard it after 1 week.",
        "Do not eat this dough after the first time you play with it.",
        "It will collect a lot of germs as you play with it, so eating it on the second day could make you sick.",
        "Throw the dough out once it starts to feel dry, look moldy, or smell.",
        "It should keep for about 5 to 7 days before going bad.",
        "Finished."
    ]
}