{
    "title": "How to Cook Rice in a Slow Cooker",
    "url": "https://www.wikihow.com/Cook-Rice-in-a-Slow-Cooker",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes"
    ],
    "parts": [
        {
            "name": "Preparing Your Rice",
            "steps": [
                {
                    "headline": "Measure out the amount of rice you want to cook in dry cups.",
                    "description": "Using whole cup increments will make it easier to get the water-to-rice ratio just right. 1 cup (190 g) of rice (cooked) is a standard serving for 1 person. Plan on using ½-1 cup (95-190 g) extra for each additional person you’re feeding. Remember, rice can as much as double in size as it cooks. This means that 1 cup (190 g) of uncooked rice will puff up into about 2-2.5 cups (380-475 g) of rice once cooked.Tip: You can use a slow cooker to fix any type of rice, including white, brown, wild, or long-grain jasmine or basmati."
                },
                {
                    "headline": "Wash your rice thoroughly to remove excess starch.",
                    "description": "Place your pre-portioned rice into a fine mesh sieve and run a stream of cool water over the top, moving the sieve slowly to make sure the water touches every last grain. Continue rinsing your rice until the water runs clean, then shake the sieve a few times to get rid of excess water. Alternatively, you can swish your rice in a shallow bowl full of water, draining and replacing the water when it becomes cloudy. A good washing will eliminate any starchy residue on the outside of your rice, which can help prevent sticking and clumping."
                },
                {
                    "headline": "Grease the inside of your slow cooker with oil or butter.",
                    "description": "Coat a folded paper towel with about 1 tablespoon (15 mL) of oil or softened butter and rub it onto the bowl of your slow cooker. Lubricating your slow cooker with a little fat makes the rice around the edges less likely to stick. You may not need to oil your slow cooker if it’s equipped with a nonstick cooking surface."
                },
                {
                    "headline": "Add your freshly-rinsed rice directly to your slow cooker.",
                    "description": "After you’ve finished washing your rice, dump it into the bottom of your slow cooker. Spread the rice with a spoon or the tips of your fingers to make sure it’s distributed evenly over the cooking surface, with no noticeable mounds or thin spots. While any type of slow cooker will get the job done, a large, oblong variety that holds at least 6 quarts (5.7 L) will work provide the most even and consistent heating. One of the best things about using a slow cooker is that everything is done in a single piece of cookware, which means less prep work and faster cleanup!"
                },
                {
                    "headline": "Bring your water to a boil before adding it to your rice (optional).",
                    "description": "Some slow cooker aficionados swear by preheating the water for their rice. If you want to give this method a shot, heat some water in a kettle on the stovetop, then pour it into a glass liquid measuring cup to make sure you’re using the correct amount. The idea behind this is that it starts cooking the rice right away rather than heating up gradually. As a result, the rice is less likely to turn out overly soft or gummy. Never pour boiling water into kitchenware made from plastic or similar materials, as it could easily melt."
                },
                {
                    "headline": "Pour in 2–3 cups (0.47–0.71 L) of water for every 1 cup (190 g) of rice.",
                    "description": "As a general rule, you should use approximately twice the amount of water in liquid cups as you did rice in dry cups. Once you’ve added the water, give your rice a quick stir to fully incorporate it. Then, place the lid on the slow cooker. Brown rice usually requires more water to cook to perfection, while white rice can get by with a little less. If you decide to use 3 cups (0.71 L) of water per cup (190 g) of rice, be prepared to tack on an additional 30-45 minutes of cook time."
                }
            ]
        },
        {
            "name": "Heating the Rice",
            "steps": [
                {
                    "headline": "Cover the rice with parchment paper before you start cooking (optional).",
                    "description": "Trim the parchment paper so that it fits comfortably over the opening of the slow cooker, leaving 3–4 inches (7.6–10.2 cm) of extra material on all sides. Double-check that there are no gaps in the paper where steam might be able to escape. While this step isn’t strictly necessary, it can be a good way to lock in moisture and keep your rice from becoming overly dry. Avoid using plastic cling wrap or similar materials. These coverings could melt as a result of prolonged exposure to heat or leech potential toxins into your rice."
                },
                {
                    "headline": "Set your slow cooker to high heat.",
                    "description": "The old saying that rice should be cooked low and slow is true. Since slow cookers already make use of low temperatures to heat food gradually, however, the highest heat setting will still be considerably cooler than a conventional rice cooker. Make sure your slow cooker is properly hooked up and positioned, and that there are no objects nearby that could cause it to come unplugged accidentally. You can also cook your rice on a lower heat setting if you’re going to be out of the house all day. Keep in mind, though, that this will likely add 3-4 hours to your overall cook time."
                },
                {
                    "headline": "Allow the rice to cook for 2½-3 hours.",
                    "description": "While your rice is cooking all you have to do is—nothing! Just put it in, turn it on, and walk away. It’s really that easy! If it makes you feel better, you can come back periodically and take a look at your rice to see how it’s doing. Just avoid leaving the lid off of the slow cooker for too long, as this will allow precious moisture to escape. Don’t forget to set a timer so you’ll know when your rice is ready to come out of the slow cooker.Tip: You’ll know your rice is done when it looks plump and no longer glistens with moisture."
                },
                {
                    "headline": "Stir your rice thoroughly before serving it.",
                    "description": "Remove the lid from your slow cooker and fluff the rice using a long-handled serving spoon. It will be pretty hot when it first comes out of the slow cooker, so be sure to give it a few minutes to cool to a safe temperature before you dig in. Enjoy! It’s possible that the layer of rice directly over the cooking surface might get a little crunchy, as this is where most of the heat is. If that sounds unappetizing, just scoop out the softer rice, then scrape and discard the drier bits."
                }
            ]
        }
    ],
    "tyn": [
        "Slow cooker",
        "Fine mesh sieve",
        "Wet and dry measuring cups",
        "Tea kettle",
        "Long-handled serving spoon",
        "Paper towels",
        "Parchment paper (optional)"
    ],
    "text": " Preparing Your Rice Measure out the amount of rice you want to cook in dry cups. Using whole cup increments will make it easier to get the water-to-rice ratio just right. 1 cup (190 g) of rice (cooked) is a standard serving for 1 person. Plan on using ½-1 cup (95-190 g) extra for each additional person you’re feeding. Remember, rice can as much as double in size as it cooks. This means that 1 cup (190 g) of uncooked rice will puff up into about 2-2.5 cups (380-475 g) of rice once cooked.Tip: You can use a slow cooker to fix any type of rice, including white, brown, wild, or long-grain jasmine or basmati. Wash your rice thoroughly to remove excess starch. Place your pre-portioned rice into a fine mesh sieve and run a stream of cool water over the top, moving the sieve slowly to make sure the water touches every last grain. Continue rinsing your rice until the water runs clean, then shake the sieve a few times to get rid of excess water. Alternatively, you can swish your rice in a shallow bowl full of water, draining and replacing the water when it becomes cloudy. A good washing will eliminate any starchy residue on the outside of your rice, which can help prevent sticking and clumping. Grease the inside of your slow cooker with oil or butter. Coat a folded paper towel with about 1 tablespoon (15 mL) of oil or softened butter and rub it onto the bowl of your slow cooker. Lubricating your slow cooker with a little fat makes the rice around the edges less likely to stick. You may not need to oil your slow cooker if it’s equipped with a nonstick cooking surface. Add your freshly-rinsed rice directly to your slow cooker. After you’ve finished washing your rice, dump it into the bottom of your slow cooker. Spread the rice with a spoon or the tips of your fingers to make sure it’s distributed evenly over the cooking surface, with no noticeable mounds or thin spots. While any type of slow cooker will get the job done, a large, oblong variety that holds at least 6 quarts (5.7 L) will work provide the most even and consistent heating. One of the best things about using a slow cooker is that everything is done in a single piece of cookware, which means less prep work and faster cleanup! Bring your water to a boil before adding it to your rice (optional). Some slow cooker aficionados swear by preheating the water for their rice. If you want to give this method a shot, heat some water in a kettle on the stovetop, then pour it into a glass liquid measuring cup to make sure you’re using the correct amount. The idea behind this is that it starts cooking the rice right away rather than heating up gradually. As a result, the rice is less likely to turn out overly soft or gummy. Never pour boiling water into kitchenware made from plastic or similar materials, as it could easily melt. Pour in 2–3 cups (0.47–0.71 L) of water for every 1 cup (190 g) of rice. As a general rule, you should use approximately twice the amount of water in liquid cups as you did rice in dry cups. Once you’ve added the water, give your rice a quick stir to fully incorporate it. Then, place the lid on the slow cooker. Brown rice usually requires more water to cook to perfection, while white rice can get by with a little less. If you decide to use 3 cups (0.71 L) of water per cup (190 g) of rice, be prepared to tack on an additional 30-45 minutes of cook time. Heating the Rice Cover the rice with parchment paper before you start cooking (optional). Trim the parchment paper so that it fits comfortably over the opening of the slow cooker, leaving 3–4 inches (7.6–10.2 cm) of extra material on all sides. Double-check that there are no gaps in the paper where steam might be able to escape. While this step isn’t strictly necessary, it can be a good way to lock in moisture and keep your rice from becoming overly dry. Avoid using plastic cling wrap or similar materials. These coverings could melt as a result of prolonged exposure to heat or leech potential toxins into your rice. Set your slow cooker to high heat. The old saying that rice should be cooked low and slow is true. Since slow cookers already make use of low temperatures to heat food gradually, however, the highest heat setting will still be considerably cooler than a conventional rice cooker. Make sure your slow cooker is properly hooked up and positioned, and that there are no objects nearby that could cause it to come unplugged accidentally. You can also cook your rice on a lower heat setting if you’re going to be out of the house all day. Keep in mind, though, that this will likely add 3-4 hours to your overall cook time. Allow the rice to cook for 2½-3 hours. While your rice is cooking all you have to do is—nothing! Just put it in, turn it on, and walk away. It’s really that easy! If it makes you feel better, you can come back periodically and take a look at your rice to see how it’s doing. Just avoid leaving the lid off of the slow cooker for too long, as this will allow precious moisture to escape. Don’t forget to set a timer so you’ll know when your rice is ready to come out of the slow cooker.Tip: You’ll know your rice is done when it looks plump and no longer glistens with moisture. Stir your rice thoroughly before serving it. Remove the lid from your slow cooker and fluff the rice using a long-handled serving spoon. It will be pretty hot when it first comes out of the slow cooker, so be sure to give it a few minutes to cool to a safe temperature before you dig in. Enjoy! It’s possible that the layer of rice directly over the cooking surface might get a little crunchy, as this is where most of the heat is. If that sounds unappetizing, just scoop out the softer rice, then scrape and discard the drier bits.",
    "sentences": [
        " Preparing Your Rice Measure out the amount of rice you want to cook in dry cups.",
        "Using whole cup increments will make it easier to get the water-to-rice ratio just right.",
        "1 cup (190 g) of rice (cooked) is a standard serving for 1 person.",
        "Plan on using ½-1 cup (95-190 g) extra for each additional person you’re feeding.",
        "Remember, rice can as much as double in size as it cooks.",
        "This means that 1 cup (190 g) of uncooked rice will puff up into about 2-2.5 cups (380-475 g) of rice once cooked.Tip: You can use a slow cooker to fix any type of rice, including white, brown, wild, or long-grain jasmine or basmati.",
        "Wash your rice thoroughly to remove excess starch.",
        "Place your pre-portioned rice into a fine mesh sieve and run a stream of cool water over the top, moving the sieve slowly to make sure the water touches every last grain.",
        "Continue rinsing your rice until the water runs clean, then shake the sieve a few times to get rid of excess water.",
        "Alternatively, you can swish your rice in a shallow bowl full of water, draining and replacing the water when it becomes cloudy.",
        "A good washing will eliminate any starchy residue on the outside of your rice, which can help prevent sticking and clumping.",
        "Grease the inside of your slow cooker with oil or butter.",
        "Coat a folded paper towel with about 1 tablespoon (15 mL) of oil or softened butter and rub it onto the bowl of your slow cooker.",
        "Lubricating your slow cooker with a little fat makes the rice around the edges less likely to stick.",
        "You may not need to oil your slow cooker if it’s equipped with a nonstick cooking surface.",
        "Add your freshly-rinsed rice directly to your slow cooker.",
        "After you’ve finished washing your rice, dump it into the bottom of your slow cooker.",
        "Spread the rice with a spoon or the tips of your fingers to make sure it’s distributed evenly over the cooking surface, with no noticeable mounds or thin spots.",
        "While any type of slow cooker will get the job done, a large, oblong variety that holds at least 6 quarts (5.7 L) will work provide the most even and consistent heating.",
        "One of the best things about using a slow cooker is that everything is done in a single piece of cookware, which means less prep work and faster cleanup!",
        "Bring your water to a boil before adding it to your rice (optional).",
        "Some slow cooker aficionados swear by preheating the water for their rice.",
        "If you want to give this method a shot, heat some water in a kettle on the stovetop, then pour it into a glass liquid measuring cup to make sure you’re using the correct amount.",
        "The idea behind this is that it starts cooking the rice right away rather than heating up gradually.",
        "As a result, the rice is less likely to turn out overly soft or gummy.",
        "Never pour boiling water into kitchenware made from plastic or similar materials, as it could easily melt.",
        "Pour in 2–3 cups (0.47–0.71 L) of water for every 1 cup (190 g) of rice.",
        "As a general rule, you should use approximately twice the amount of water in liquid cups as you did rice in dry cups.",
        "Once you’ve added the water, give your rice a quick stir to fully incorporate it.",
        "Then, place the lid on the slow cooker.",
        "Brown rice usually requires more water to cook to perfection, while white rice can get by with a little less.",
        "If you decide to use 3 cups (0.71 L) of water per cup (190 g) of rice, be prepared to tack on an additional 30-45 minutes of cook time.",
        "Heating the Rice Cover the rice with parchment paper before you start cooking (optional).",
        "Trim the parchment paper so that it fits comfortably over the opening of the slow cooker, leaving 3–4 inches (7.6–10.2 cm) of extra material on all sides.",
        "Double-check that there are no gaps in the paper where steam might be able to escape.",
        "While this step isn’t strictly necessary, it can be a good way to lock in moisture and keep your rice from becoming overly dry.",
        "Avoid using plastic cling wrap or similar materials.",
        "These coverings could melt as a result of prolonged exposure to heat or leech potential toxins into your rice.",
        "Set your slow cooker to high heat.",
        "The old saying that rice should be cooked low and slow is true.",
        "Since slow cookers already make use of low temperatures to heat food gradually, however, the highest heat setting will still be considerably cooler than a conventional rice cooker.",
        "Make sure your slow cooker is properly hooked up and positioned, and that there are no objects nearby that could cause it to come unplugged accidentally.",
        "You can also cook your rice on a lower heat setting if you’re going to be out of the house all day.",
        "Keep in mind, though, that this will likely add 3-4 hours to your overall cook time.",
        "Allow the rice to cook for 2½-3 hours.",
        "While your rice is cooking all you have to do is—nothing!",
        "Just put it in, turn it on, and walk away.",
        "It’s really that easy!",
        "If it makes you feel better, you can come back periodically and take a look at your rice to see how it’s doing.",
        "Just avoid leaving the lid off of the slow cooker for too long, as this will allow precious moisture to escape.",
        "Don’t forget to set a timer so you’ll know when your rice is ready to come out of the slow cooker.Tip: You’ll know your rice is done when it looks plump and no longer glistens with moisture.",
        "Stir your rice thoroughly before serving it.",
        "Remove the lid from your slow cooker and fluff the rice using a long-handled serving spoon.",
        "It will be pretty hot when it first comes out of the slow cooker, so be sure to give it a few minutes to cool to a safe temperature before you dig in.",
        "Enjoy!",
        "It’s possible that the layer of rice directly over the cooking surface might get a little crunchy, as this is where most of the heat is.",
        "If that sounds unappetizing, just scoop out the softer rice, then scrape and discard the drier bits."
    ]
}