{
    "title": "How to Learn Sesotho",
    "url": "https://www.wikihow.com/Learn-Sesotho",
    "category_hierarchy": [
        "Education and Communications",
        "World Languages",
        "Learning Languages"
    ],
    "steps": [
        {
            "headline": "Be aware that, like for any other language, Sesotho requires you to hear it in order to learn it.",
            "description": "Visit the country or listen to Radio Lesotho as often as possible"
        },
        {
            "headline": "Realize early on that Sesotho is probably not like any language you've learned before.",
            "description": "Never try to compare a language you're learning with one you already speak."
        },
        {
            "headline": "Use the Internet to listen to model sentences and to do quizzes (see links below).",
            "description": ""
        },
        {
            "headline": "Use a dictionary as often as possible.",
            "description": "There are at least three good ones online."
        },
        {
            "headline": "Find a Mosotho who would like to learn your language, and exchange with them through chat, email and telephoning.",
            "description": ""
        },
        {
            "headline": "There's a large body of written Sesotho on the Internet.",
            "description": "Find it and read as much as possible. You won't understand much at the beginning, but it's the little that you will understand that counts. Build on it. You're not trying to learn the grammar of Sesotho, you're trying to learn how to speak Sesotho. Remember that."
        },
        {
            "headline": "Use flash cards or a phrase book to revise recently acquired phrases and words.",
            "description": "Revision is very important, especially if you're learning Sesotho outside Lesotho or South Africa."
        },
        {
            "headline": "Remember new words by means of mnemonics, jokes and genuine emotions.",
            "description": "Do not memorise words out of their context. For example, do not memorise \"ho rata\" as the verb \"to love;\" rather learn \"ho rata\" by practising with the sentence, \"Ke rata Odile,\" or \"I love Odile,\" or Jack, or Jill."
        },
        {
            "headline": "Wherever you may be, there is probably a Lesotho or South African embassy nearby.",
            "description": "Visit them and ask them what help they can give you in your noble endeavour. If they haven't got help, ask them why they aren't interested in people learning Sesotho."
        }
    ],
    "tyn": [
        "A good Internet connection.",
        "Computer headphones.",
        "A list of performant, paedagogical websites.",
        "A bilingual dictionary"
    ],
    "text": " Be aware that, like for any other language, Sesotho requires you to hear it in order to learn it. Visit the country or listen to Radio Lesotho as often as possible Realize early on that Sesotho is probably not like any language you've learned before. Never try to compare a language you're learning with one you already speak. Use the Internet to listen to model sentences and to do quizzes (see links below).  Use a dictionary as often as possible. There are at least three good ones online. Find a Mosotho who would like to learn your language, and exchange with them through chat, email and telephoning.  There's a large body of written Sesotho on the Internet. Find it and read as much as possible. You won't understand much at the beginning, but it's the little that you will understand that counts. Build on it. You're not trying to learn the grammar of Sesotho, you're trying to learn how to speak Sesotho. Remember that. Use flash cards or a phrase book to revise recently acquired phrases and words. Revision is very important, especially if you're learning Sesotho outside Lesotho or South Africa. Remember new words by means of mnemonics, jokes and genuine emotions. Do not memorise words out of their context. For example, do not memorise \"ho rata\" as the verb \"to love;\" rather learn \"ho rata\" by practising with the sentence, \"Ke rata Odile,\" or \"I love Odile,\" or Jack, or Jill. Wherever you may be, there is probably a Lesotho or South African embassy nearby. Visit them and ask them what help they can give you in your noble endeavour. If they haven't got help, ask them why they aren't interested in people learning Sesotho.",
    "sentences": [
        " Be aware that, like for any other language, Sesotho requires you to hear it in order to learn it.",
        "Visit the country or listen to Radio Lesotho as often as possible Realize early on that Sesotho is probably not like any language you've learned before.",
        "Never try to compare a language you're learning with one you already speak.",
        "Use the Internet to listen to model sentences and to do quizzes (see links below).",
        "Use a dictionary as often as possible.",
        "There are at least three good ones online.",
        "Find a Mosotho who would like to learn your language, and exchange with them through chat, email and telephoning.",
        "There's a large body of written Sesotho on the Internet.",
        "Find it and read as much as possible.",
        "You won't understand much at the beginning, but it's the little that you will understand that counts.",
        "Build on it.",
        "You're not trying to learn the grammar of Sesotho, you're trying to learn how to speak Sesotho.",
        "Remember that.",
        "Use flash cards or a phrase book to revise recently acquired phrases and words.",
        "Revision is very important, especially if you're learning Sesotho outside Lesotho or South Africa.",
        "Remember new words by means of mnemonics, jokes and genuine emotions.",
        "Do not memorise words out of their context.",
        "For example, do not memorise \"ho rata\" as the verb \"to love;\" rather learn \"ho rata\" by practising with the sentence, \"Ke rata Odile,\" or \"I love Odile,\" or Jack, or Jill.",
        "Wherever you may be, there is probably a Lesotho or South African embassy nearby.",
        "Visit them and ask them what help they can give you in your noble endeavour.",
        "If they haven't got help, ask them why they aren't interested in people learning Sesotho."
    ]
}