{
    "title": "How to Paddle a Canoe Alone Using the J Stroke",
    "url": "https://www.wikihow.com/Paddle-a-Canoe-Alone-Using-the-J-Stroke",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Canoeing and Kayaking"
    ],
    "steps": [
        {
            "headline": "Unload your canoe into the water (guides on this can be found elsewhere).",
            "description": ""
        },
        {
            "headline": "Seat yourself in the canoe.",
            "description": "When paddling a two person canoe alone you should sit in the bow seat (the one closer to the middle of the canoe) facing backwards (toward the stern). This position prevents the other end of the canoe from rising too far out of the water due to your weight. Steering a canoe with one end out of the water is extremely difficult, especially in windy conditions. Some people recommend kneeling in the exact middle of the canoe, but this actually makes steering much more difficult since most steering strokes will simply push the canoe sideways rather than turn it when sitting in this position."
        },
        {
            "headline": "Grip your paddle.",
            "description": "One hand should be gripping the top of the paddle, with the other hand gripping directly above the blade. Use whichever hand feels comfortable to you, preference for paddling on one side or the other actually seems to be independent of which hand is dominant."
        },
        {
            "headline": "Reach forward with the paddle on the side of the canoe corresponding to your lower hand until your bottom arm is fully extended.",
            "description": ""
        },
        {
            "headline": "Dip the paddle into the water until the blade is totally submerged.",
            "description": ""
        },
        {
            "headline": "Pull the paddle back until your lower hand is slightly behind your torso.",
            "description": ""
        },
        {
            "headline": "Rotate the paddle ninety degrees so that the face of the blade is parallel with the side of the canoe.",
            "description": ""
        },
        {
            "headline": "Push the blade out away from the canoe by using the edge of the canoe as a fulcrum and pulling the top of the paddle in the opposite direction.",
            "description": ""
        },
        {
            "headline": "Pull the blade of the paddle out of the water and return to step 4.",
            "description": ""
        }
    ],
    "tyn": [
        "Canoe",
        "Paddle, which ideally should come up to your chin when planted vertically on the ground.",
        "Buoyancy aid",
        "Cell phone in a zip-lock bag or other water-tight container.",
        "Sunscreen",
        "Water bottle"
    ],
    "text": " Unload your canoe into the water (guides on this can be found elsewhere).  Seat yourself in the canoe. When paddling a two person canoe alone you should sit in the bow seat (the one closer to the middle of the canoe) facing backwards (toward the stern). This position prevents the other end of the canoe from rising too far out of the water due to your weight. Steering a canoe with one end out of the water is extremely difficult, especially in windy conditions. Some people recommend kneeling in the exact middle of the canoe, but this actually makes steering much more difficult since most steering strokes will simply push the canoe sideways rather than turn it when sitting in this position. Grip your paddle. One hand should be gripping the top of the paddle, with the other hand gripping directly above the blade. Use whichever hand feels comfortable to you, preference for paddling on one side or the other actually seems to be independent of which hand is dominant. Reach forward with the paddle on the side of the canoe corresponding to your lower hand until your bottom arm is fully extended.  Dip the paddle into the water until the blade is totally submerged.  Pull the paddle back until your lower hand is slightly behind your torso.  Rotate the paddle ninety degrees so that the face of the blade is parallel with the side of the canoe.  Push the blade out away from the canoe by using the edge of the canoe as a fulcrum and pulling the top of the paddle in the opposite direction.  Pull the blade of the paddle out of the water and return to step 4. ",
    "sentences": [
        " Unload your canoe into the water (guides on this can be found elsewhere).",
        "Seat yourself in the canoe.",
        "When paddling a two person canoe alone you should sit in the bow seat (the one closer to the middle of the canoe) facing backwards (toward the stern).",
        "This position prevents the other end of the canoe from rising too far out of the water due to your weight.",
        "Steering a canoe with one end out of the water is extremely difficult, especially in windy conditions.",
        "Some people recommend kneeling in the exact middle of the canoe, but this actually makes steering much more difficult since most steering strokes will simply push the canoe sideways rather than turn it when sitting in this position.",
        "Grip your paddle.",
        "One hand should be gripping the top of the paddle, with the other hand gripping directly above the blade.",
        "Use whichever hand feels comfortable to you, preference for paddling on one side or the other actually seems to be independent of which hand is dominant.",
        "Reach forward with the paddle on the side of the canoe corresponding to your lower hand until your bottom arm is fully extended.",
        "Dip the paddle into the water until the blade is totally submerged.",
        "Pull the paddle back until your lower hand is slightly behind your torso.",
        "Rotate the paddle ninety degrees so that the face of the blade is parallel with the side of the canoe.",
        "Push the blade out away from the canoe by using the edge of the canoe as a fulcrum and pulling the top of the paddle in the opposite direction.",
        "Pull the blade of the paddle out of the water and return to step 4."
    ]
}