{
    "title": "How to Make Alcohol Based Fudge",
    "url": "https://www.wikihow.com/Make-Alcohol-Based-Fudge",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Chocolate and Candy",
        "Fudge"
    ],
    "methods": [
        {
            "name": "Making Rum and Raisin Fudge",
            "steps": [
                {
                    "headline": "Prepare the cake pan.",
                    "description": "Grease the pan. Then line both the base and sides with the parchment or baking paper."
                },
                {
                    "headline": "Place the raisins and rum into the saucepan.",
                    "description": "Heat over medium heat for 2 minutes to make the raisins plump up."
                },
                {
                    "headline": "Remove from the heat.",
                    "description": "Allow to cool."
                },
                {
                    "headline": "Pour the condensed milk into the medium saucepan.",
                    "description": "Add the sugar, glucose syrup and butter."
                },
                {
                    "headline": "Heat over low heat for 5 to 7 minutes.",
                    "description": "Stir occasionally until the sugar dissolves."
                },
                {
                    "headline": "Turn up the heat to medium.",
                    "description": "Cook the mixture for 10 minutes more, stirring often. It is done when it turns a pale golden color. Remove from the heat."
                },
                {
                    "headline": "Add the chopped chocolate.",
                    "description": "Stir it into the mixture to melt it through."
                },
                {
                    "headline": "Add the raisin and rum mix.",
                    "description": "Mix."
                },
                {
                    "headline": "Pour the fudge mixture into the prepared pan.",
                    "description": "Use the back of a spoon or a spatula to smooth the top of the fudge. Put aside to set. This will take about 2 hours."
                },
                {
                    "headline": "Tip the set fudge out onto a clean work surface.",
                    "description": "Cut into squares or fingers. It can be wrapped in wax paper or clear cellophane, or served immediately. If you don't wish to wrap individual squares or fingers, keep in an airtight container lined with wax paper. Use wax paper if you need to layer it."
                }
            ]
        },
        {
            "name": "Making Bailey's Fudge",
            "steps": [
                {
                    "headline": "Prepare the cake pan.",
                    "description": "Grease the pan. Then line both the base and sides with the parchment or baking paper."
                },
                {
                    "headline": "Pour the Baileys into the large saucepan.",
                    "description": "Add the cream and sugar to the Baileys."
                },
                {
                    "headline": "Place over medium heat.",
                    "description": "Heat to bring to the boil, stirring continuously. Continue to stir until the sugar dissolves. Adjust the heat if needed, to prevent the mixture from boiling over but to allow it to bubble."
                },
                {
                    "headline": "Stir until it reaches soft ball stage.",
                    "description": "this is when you drop a little of the mixture into a little cold water and the sugary mass forms a soft ball."
                },
                {
                    "headline": "Add the white chocolate.",
                    "description": "Stir through until melted in evenly."
                },
                {
                    "headline": "Pour the fudge mixture into the prepared cake pan.",
                    "description": "Smooth the top with the back of a spoon or a spatula."
                },
                {
                    "headline": "Set aside to cool.",
                    "description": "After it has set, cut into individual squares or fingers. The fudge can be wrapped in wax paper or clear cellophane, or served immediately. If you don't wish to wrap individual squares or fingers, keep in an airtight container lined with wax paper. Use wax paper if you need to layer it."
                }
            ]
        },
        {
            "name": "Making Chocolate Whiskey Fudge",
            "steps": [
                {
                    "headline": "Prepare the cake pan.",
                    "description": "Grease the pan. Then line both the base and sides with the parchment or baking paper."
                },
                {
                    "headline": "Pour the condensed milk and glucose syrup into the saucepan.",
                    "description": "Add the butter and sugar."
                },
                {
                    "headline": "Place over a medium to low heat.",
                    "description": "Heat and stir for 3 minutes, or until the sugar dissolves."
                },
                {
                    "headline": "Turn the heat up to medium-high.",
                    "description": "Stir constantly for 1- to 15 minutes until the mixture thickens. When it turns a caramel color and leaves the sides of the saucepan, it is ready. Remove from the heat."
                },
                {
                    "headline": "Pour in the whisky and the add the chopped chocolate.",
                    "description": "Stir to melt it through, stirring until the mixture turns smooth."
                },
                {
                    "headline": "Pour the fudge mixture into the cake pan.",
                    "description": "Set aside to cool and set."
                },
                {
                    "headline": "Cover the fudge with plastic food wrap.",
                    "description": "Place in the refrigerator to firm up for an hour."
                },
                {
                    "headline": "Remove from the fridge.",
                    "description": "Tip the fudge over, using the paper."
                },
                {
                    "headline": "Cut into individual squares or fingers.",
                    "description": "The fudge can be wrapped in wax paper or clear cellophane, or served immediately. If you don't wish to wrap individual squares or fingers, keep in an airtight container lined with wax paper. Use wax paper if you need to layer it."
                }
            ]
        }
    ],
    "tyn": [
        "Rum and raisin",
        "20 centimeter (7.9 in) square cake pan",
        "Parchment/baking paper",
        "Small heavy-based saucepan",
        "Medium heavy-based saucepan",
        "Wooden spoon",
        "Knife",
        "Cellophane or wax paper",
        "Baileys fudge",
        "Large heavy-based saucepan",
        "Spatula",
        "Chocolate whiskey fudge"
    ],
    "text": " Making Rum and Raisin Fudge Prepare the cake pan. Grease the pan. Then line both the base and sides with the parchment or baking paper. Place the raisins and rum into the saucepan. Heat over medium heat for 2 minutes to make the raisins plump up. Remove from the heat. Allow to cool. Pour the condensed milk into the medium saucepan. Add the sugar, glucose syrup and butter. Heat over low heat for 5 to 7 minutes. Stir occasionally until the sugar dissolves. Turn up the heat to medium. Cook the mixture for 10 minutes more, stirring often. It is done when it turns a pale golden color. Remove from the heat. Add the chopped chocolate. Stir it into the mixture to melt it through. Add the raisin and rum mix. Mix. Pour the fudge mixture into the prepared pan. Use the back of a spoon or a spatula to smooth the top of the fudge. Put aside to set. This will take about 2 hours. Tip the set fudge out onto a clean work surface. Cut into squares or fingers. It can be wrapped in wax paper or clear cellophane, or served immediately. If you don't wish to wrap individual squares or fingers, keep in an airtight container lined with wax paper. Use wax paper if you need to layer it. Making Bailey's Fudge Prepare the cake pan. Grease the pan. Then line both the base and sides with the parchment or baking paper. Pour the Baileys into the large saucepan. Add the cream and sugar to the Baileys. Place over medium heat. Heat to bring to the boil, stirring continuously. Continue to stir until the sugar dissolves. Adjust the heat if needed, to prevent the mixture from boiling over but to allow it to bubble. Stir until it reaches soft ball stage. this is when you drop a little of the mixture into a little cold water and the sugary mass forms a soft ball. Add the white chocolate. Stir through until melted in evenly. Pour the fudge mixture into the prepared cake pan. Smooth the top with the back of a spoon or a spatula. Set aside to cool. After it has set, cut into individual squares or fingers. The fudge can be wrapped in wax paper or clear cellophane, or served immediately. If you don't wish to wrap individual squares or fingers, keep in an airtight container lined with wax paper. Use wax paper if you need to layer it. Making Chocolate Whiskey Fudge Prepare the cake pan. Grease the pan. Then line both the base and sides with the parchment or baking paper. Pour the condensed milk and glucose syrup into the saucepan. Add the butter and sugar. Place over a medium to low heat. Heat and stir for 3 minutes, or until the sugar dissolves. Turn the heat up to medium-high. Stir constantly for 1- to 15 minutes until the mixture thickens. When it turns a caramel color and leaves the sides of the saucepan, it is ready. Remove from the heat. Pour in the whisky and the add the chopped chocolate. Stir to melt it through, stirring until the mixture turns smooth. Pour the fudge mixture into the cake pan. Set aside to cool and set. Cover the fudge with plastic food wrap. Place in the refrigerator to firm up for an hour. Remove from the fridge. Tip the fudge over, using the paper. Cut into individual squares or fingers. The fudge can be wrapped in wax paper or clear cellophane, or served immediately. If you don't wish to wrap individual squares or fingers, keep in an airtight container lined with wax paper. Use wax paper if you need to layer it.",
    "sentences": [
        " Making Rum and Raisin Fudge Prepare the cake pan.",
        "Grease the pan.",
        "Then line both the base and sides with the parchment or baking paper.",
        "Place the raisins and rum into the saucepan.",
        "Heat over medium heat for 2 minutes to make the raisins plump up.",
        "Remove from the heat.",
        "Allow to cool.",
        "Pour the condensed milk into the medium saucepan.",
        "Add the sugar, glucose syrup and butter.",
        "Heat over low heat for 5 to 7 minutes.",
        "Stir occasionally until the sugar dissolves.",
        "Turn up the heat to medium.",
        "Cook the mixture for 10 minutes more, stirring often.",
        "It is done when it turns a pale golden color.",
        "Remove from the heat.",
        "Add the chopped chocolate.",
        "Stir it into the mixture to melt it through.",
        "Add the raisin and rum mix.",
        "Mix.",
        "Pour the fudge mixture into the prepared pan.",
        "Use the back of a spoon or a spatula to smooth the top of the fudge.",
        "Put aside to set.",
        "This will take about 2 hours.",
        "Tip the set fudge out onto a clean work surface.",
        "Cut into squares or fingers.",
        "It can be wrapped in wax paper or clear cellophane, or served immediately.",
        "If you don't wish to wrap individual squares or fingers, keep in an airtight container lined with wax paper.",
        "Use wax paper if you need to layer it.",
        "Making Bailey's Fudge Prepare the cake pan.",
        "Grease the pan.",
        "Then line both the base and sides with the parchment or baking paper.",
        "Pour the Baileys into the large saucepan.",
        "Add the cream and sugar to the Baileys.",
        "Place over medium heat.",
        "Heat to bring to the boil, stirring continuously.",
        "Continue to stir until the sugar dissolves.",
        "Adjust the heat if needed, to prevent the mixture from boiling over but to allow it to bubble.",
        "Stir until it reaches soft ball stage.",
        "this is when you drop a little of the mixture into a little cold water and the sugary mass forms a soft ball.",
        "Add the white chocolate.",
        "Stir through until melted in evenly.",
        "Pour the fudge mixture into the prepared cake pan.",
        "Smooth the top with the back of a spoon or a spatula.",
        "Set aside to cool.",
        "After it has set, cut into individual squares or fingers.",
        "The fudge can be wrapped in wax paper or clear cellophane, or served immediately.",
        "If you don't wish to wrap individual squares or fingers, keep in an airtight container lined with wax paper.",
        "Use wax paper if you need to layer it.",
        "Making Chocolate Whiskey Fudge Prepare the cake pan.",
        "Grease the pan.",
        "Then line both the base and sides with the parchment or baking paper.",
        "Pour the condensed milk and glucose syrup into the saucepan.",
        "Add the butter and sugar.",
        "Place over a medium to low heat.",
        "Heat and stir for 3 minutes, or until the sugar dissolves.",
        "Turn the heat up to medium-high.",
        "Stir constantly for 1- to 15 minutes until the mixture thickens.",
        "When it turns a caramel color and leaves the sides of the saucepan, it is ready.",
        "Remove from the heat.",
        "Pour in the whisky and the add the chopped chocolate.",
        "Stir to melt it through, stirring until the mixture turns smooth.",
        "Pour the fudge mixture into the cake pan.",
        "Set aside to cool and set.",
        "Cover the fudge with plastic food wrap.",
        "Place in the refrigerator to firm up for an hour.",
        "Remove from the fridge.",
        "Tip the fudge over, using the paper.",
        "Cut into individual squares or fingers.",
        "The fudge can be wrapped in wax paper or clear cellophane, or served immediately.",
        "If you don't wish to wrap individual squares or fingers, keep in an airtight container lined with wax paper.",
        "Use wax paper if you need to layer it."
    ]
}