{
    "title": "How to Measure Bed Size",
    "url": "https://www.wikihow.com/Measure-Bed-Size",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Bedrooms"
    ],
    "methods": [
        {
            "name": "Assessing the Frame Size",
            "steps": [
                {
                    "headline": "Extend a tape measure to figure out the length of your frame.",
                    "description": "Take a mechanical or regular measuring tape and pull it lengthwise along the side of the bed frame. It doesn’t matter if the bed frame is still in pieces or already set up—what matters most is stretching the tape from corner to corner. Have a notepad on hand to write down the length once you’ve measured it. If you want to save time, check the instruction manual to find the bed frame’s exact dimensions. This is most convenient if you’re unpacking the bed frame and moving into a new home. If the frame is still in pieces, lay each piece on a flat surface and assemble the frame before taking your measurements."
                },
                {
                    "headline": "Rotate the measuring tape to figure out the width.",
                    "description": "Turn the tape 90 degrees so it goes along the width of the bed frame. As a general rule of thumb, this measurement will be significantly smaller than the length of the bed frame. Be sure to jot down the width so you don’t forget it later.Picture the height and width dimensions of a bed resembling a capital L. For the bed frame’s width, you’d be looking at the lower, horizontal part of the L."
                },
                {
                    "headline": "Use household items to measure the frame if you don’t have a measuring tape.",
                    "description": "Find straight-edged, alternative items to use as measuring tools if you don’t have a tape on hand. For reference, American dollar bills are 6 inches (15 cm) long, while a sheet of generic printer paper is 11 inches (28 cm) in height. Use whatever tools you have on hand to figure out the size of your bed frame. If you don’t care about exact measurements, consider using your foot size or height to estimate the length and width of the frame."
                },
                {
                    "headline": "Use a mattress that matches the dimensions of the bed frame.",
                    "description": "Take your dimensions and compare them to most common mattress sizes. Be certain that the mattress fits comfortably within the determined frame dimensions before you continue with any installations or purchases. For example, a twin XL mattress is 38 by 80 inches (97 by 203 cm). If your bed frame is only 35 by 80 inches (89 by 203 cm), then it’s safe to say that your mattress isn’t a twin XL."
                }
            ]
        },
        {
            "name": "Evaluating the Mattress Dimensions",
            "steps": [
                {
                    "headline": "Use a tape measure to determine the length of the mattress.",
                    "description": "Place a measuring tape along the longest edge of the mattress and record the mattress’s length. Depending on your mattress type, this could be anywhere from 52 to 84 inches (130 to 210 cm). If you’re using a mechanical tape measure, hook the metal edge along the corner of the mattress. That’ll help your measurements to be as accurate as possible. Make sure that you’ve removed any bedding from the mattress before measuring."
                },
                {
                    "headline": "Measure the width of the mattress.",
                    "description": "Rotate the tape at a right angle to figure out the width of the mattress. Try to go from corner to corner, as this yields the most accurate measurements. Depending on how small or large your mattress is, this could range from 38 to 72 inches (97 to 183 cm). This width measurement will be significantly shorter than the length."
                },
                {
                    "headline": "Figure out the depth or thickness.",
                    "description": "Hold or hook the measuring tape at the base of the mattress before pulling it upwards. This determines the depth of the mattress, or how thick it is. While this measurement is irrelevant when finding the dimensions of a bed frame, it’s extremely useful when measuring a mattress’s thickness. Knowing the depth, width, and length of a mattress makes for a far simpler and stress-free shopping experience when you go to buy new sheets or other bedding. Keep these measurements on hand in case you go shopping later."
                },
                {
                    "headline": "Compare your mattress measurements to the standard retail dimensions.",
                    "description": "If your bed is 30 by 75 inches (76 by 191 cm), it’s a small single, while 38 by 75 inches (97 by 191 cm) is a standard twin mattress size. Don’t worry if your own measurements aren’t exact, as long as you find the closest measurement possible. Be aware of the differences between major mattress sizes. For instance, a twin mattress is 38 by 75 inches (97 by 191 cm) while a twin XL is 38 by 80 inches (97 by 203 cm). A full mattress is 53 by 75 inches (130 by 190 cm) and a Queen is 60 by 80 inches (150 by 200 cm). Note that a king mattress is 76 by 80 inches (190 by 200 cm) while a California king is 72 by 84 inches (180 by 210 cm)."
                },
                {
                    "headline": "Figure out how many people can fit on the mattress as an alternative.",
                    "description": "Check to see how many people can comfortably fit onto the bed. You can do this by yourself or with other people—just be certain that you have an accurate estimate in mind. Even without the exact dimensions, you can figure out what type of mattress you have by knowing how many people the bed can hold. For instance, a full bed can fit 2 people in close capacity, while a queen bed allows for a little more room. Single, twin, and twin XL beds can only fit 1 person, while kings and California kings can comfortably fit at least 2 people."
                },
                {
                    "headline": "Apply these measurements to purchase the right bedding and accessories.",
                    "description": "Think about these measurements when you go shopping for other accessories, like bed covers and bed skirts. For these items, consider sheets that could fit around the mattress and also be tucked into the bed frame. Don’t stress about the shopping process, though—as long as you have a general idea of your mattress size, you should be fine. If you’re planning on adding a foam mattress topper, double check with a sales associate before purchasing fitted sheets for your mattress."
                }
            ]
        }
    ],
    "tyn": [
        "Retractable measuring tape",
        "Paper",
        "Pencil"
    ],
    "text": " Assessing the Frame Size Extend a tape measure to figure out the length of your frame. Take a mechanical or regular measuring tape and pull it lengthwise along the side of the bed frame. It doesn’t matter if the bed frame is still in pieces or already set up—what matters most is stretching the tape from corner to corner. Have a notepad on hand to write down the length once you’ve measured it. If you want to save time, check the instruction manual to find the bed frame’s exact dimensions. This is most convenient if you’re unpacking the bed frame and moving into a new home. If the frame is still in pieces, lay each piece on a flat surface and assemble the frame before taking your measurements. Rotate the measuring tape to figure out the width. Turn the tape 90 degrees so it goes along the width of the bed frame. As a general rule of thumb, this measurement will be significantly smaller than the length of the bed frame. Be sure to jot down the width so you don’t forget it later.Picture the height and width dimensions of a bed resembling a capital L. For the bed frame’s width, you’d be looking at the lower, horizontal part of the L. Use household items to measure the frame if you don’t have a measuring tape. Find straight-edged, alternative items to use as measuring tools if you don’t have a tape on hand. For reference, American dollar bills are 6 inches (15 cm) long, while a sheet of generic printer paper is 11 inches (28 cm) in height. Use whatever tools you have on hand to figure out the size of your bed frame. If you don’t care about exact measurements, consider using your foot size or height to estimate the length and width of the frame. Use a mattress that matches the dimensions of the bed frame. Take your dimensions and compare them to most common mattress sizes. Be certain that the mattress fits comfortably within the determined frame dimensions before you continue with any installations or purchases. For example, a twin XL mattress is 38 by 80 inches (97 by 203 cm). If your bed frame is only 35 by 80 inches (89 by 203 cm), then it’s safe to say that your mattress isn’t a twin XL. Evaluating the Mattress Dimensions Use a tape measure to determine the length of the mattress. Place a measuring tape along the longest edge of the mattress and record the mattress’s length. Depending on your mattress type, this could be anywhere from 52 to 84 inches (130 to 210 cm). If you’re using a mechanical tape measure, hook the metal edge along the corner of the mattress. That’ll help your measurements to be as accurate as possible. Make sure that you’ve removed any bedding from the mattress before measuring. Measure the width of the mattress. Rotate the tape at a right angle to figure out the width of the mattress. Try to go from corner to corner, as this yields the most accurate measurements. Depending on how small or large your mattress is, this could range from 38 to 72 inches (97 to 183 cm). This width measurement will be significantly shorter than the length. Figure out the depth or thickness. Hold or hook the measuring tape at the base of the mattress before pulling it upwards. This determines the depth of the mattress, or how thick it is. While this measurement is irrelevant when finding the dimensions of a bed frame, it’s extremely useful when measuring a mattress’s thickness. Knowing the depth, width, and length of a mattress makes for a far simpler and stress-free shopping experience when you go to buy new sheets or other bedding. Keep these measurements on hand in case you go shopping later. Compare your mattress measurements to the standard retail dimensions. If your bed is 30 by 75 inches (76 by 191 cm), it’s a small single, while 38 by 75 inches (97 by 191 cm) is a standard twin mattress size. Don’t worry if your own measurements aren’t exact, as long as you find the closest measurement possible. Be aware of the differences between major mattress sizes. For instance, a twin mattress is 38 by 75 inches (97 by 191 cm) while a twin XL is 38 by 80 inches (97 by 203 cm). A full mattress is 53 by 75 inches (130 by 190 cm) and a Queen is 60 by 80 inches (150 by 200 cm). Note that a king mattress is 76 by 80 inches (190 by 200 cm) while a California king is 72 by 84 inches (180 by 210 cm). Figure out how many people can fit on the mattress as an alternative. Check to see how many people can comfortably fit onto the bed. You can do this by yourself or with other people—just be certain that you have an accurate estimate in mind. Even without the exact dimensions, you can figure out what type of mattress you have by knowing how many people the bed can hold. For instance, a full bed can fit 2 people in close capacity, while a queen bed allows for a little more room. Single, twin, and twin XL beds can only fit 1 person, while kings and California kings can comfortably fit at least 2 people. Apply these measurements to purchase the right bedding and accessories. Think about these measurements when you go shopping for other accessories, like bed covers and bed skirts. For these items, consider sheets that could fit around the mattress and also be tucked into the bed frame. Don’t stress about the shopping process, though—as long as you have a general idea of your mattress size, you should be fine. If you’re planning on adding a foam mattress topper, double check with a sales associate before purchasing fitted sheets for your mattress.",
    "sentences": [
        " Assessing the Frame Size Extend a tape measure to figure out the length of your frame.",
        "Take a mechanical or regular measuring tape and pull it lengthwise along the side of the bed frame.",
        "It doesn’t matter if the bed frame is still in pieces or already set up—what matters most is stretching the tape from corner to corner.",
        "Have a notepad on hand to write down the length once you’ve measured it.",
        "If you want to save time, check the instruction manual to find the bed frame’s exact dimensions.",
        "This is most convenient if you’re unpacking the bed frame and moving into a new home.",
        "If the frame is still in pieces, lay each piece on a flat surface and assemble the frame before taking your measurements.",
        "Rotate the measuring tape to figure out the width.",
        "Turn the tape 90 degrees so it goes along the width of the bed frame.",
        "As a general rule of thumb, this measurement will be significantly smaller than the length of the bed frame.",
        "Be sure to jot down the width so you don’t forget it later.Picture the height and width dimensions of a bed resembling a capital L. For the bed frame’s width, you’d be looking at the lower, horizontal part of the L. Use household items to measure the frame if you don’t have a measuring tape.",
        "Find straight-edged, alternative items to use as measuring tools if you don’t have a tape on hand.",
        "For reference, American dollar bills are 6 inches (15 cm) long, while a sheet of generic printer paper is 11 inches (28 cm) in height.",
        "Use whatever tools you have on hand to figure out the size of your bed frame.",
        "If you don’t care about exact measurements, consider using your foot size or height to estimate the length and width of the frame.",
        "Use a mattress that matches the dimensions of the bed frame.",
        "Take your dimensions and compare them to most common mattress sizes.",
        "Be certain that the mattress fits comfortably within the determined frame dimensions before you continue with any installations or purchases.",
        "For example, a twin XL mattress is 38 by 80 inches (97 by 203 cm).",
        "If your bed frame is only 35 by 80 inches (89 by 203 cm), then it’s safe to say that your mattress isn’t a twin XL.",
        "Evaluating the Mattress Dimensions Use a tape measure to determine the length of the mattress.",
        "Place a measuring tape along the longest edge of the mattress and record the mattress’s length.",
        "Depending on your mattress type, this could be anywhere from 52 to 84 inches (130 to 210 cm).",
        "If you’re using a mechanical tape measure, hook the metal edge along the corner of the mattress.",
        "That’ll help your measurements to be as accurate as possible.",
        "Make sure that you’ve removed any bedding from the mattress before measuring.",
        "Measure the width of the mattress.",
        "Rotate the tape at a right angle to figure out the width of the mattress.",
        "Try to go from corner to corner, as this yields the most accurate measurements.",
        "Depending on how small or large your mattress is, this could range from 38 to 72 inches (97 to 183 cm).",
        "This width measurement will be significantly shorter than the length.",
        "Figure out the depth or thickness.",
        "Hold or hook the measuring tape at the base of the mattress before pulling it upwards.",
        "This determines the depth of the mattress, or how thick it is.",
        "While this measurement is irrelevant when finding the dimensions of a bed frame, it’s extremely useful when measuring a mattress’s thickness.",
        "Knowing the depth, width, and length of a mattress makes for a far simpler and stress-free shopping experience when you go to buy new sheets or other bedding.",
        "Keep these measurements on hand in case you go shopping later.",
        "Compare your mattress measurements to the standard retail dimensions.",
        "If your bed is 30 by 75 inches (76 by 191 cm), it’s a small single, while 38 by 75 inches (97 by 191 cm) is a standard twin mattress size.",
        "Don’t worry if your own measurements aren’t exact, as long as you find the closest measurement possible.",
        "Be aware of the differences between major mattress sizes.",
        "For instance, a twin mattress is 38 by 75 inches (97 by 191 cm) while a twin XL is 38 by 80 inches (97 by 203 cm).",
        "A full mattress is 53 by 75 inches (130 by 190 cm) and a Queen is 60 by 80 inches (150 by 200 cm).",
        "Note that a king mattress is 76 by 80 inches (190 by 200 cm) while a California king is 72 by 84 inches (180 by 210 cm).",
        "Figure out how many people can fit on the mattress as an alternative.",
        "Check to see how many people can comfortably fit onto the bed.",
        "You can do this by yourself or with other people—just be certain that you have an accurate estimate in mind.",
        "Even without the exact dimensions, you can figure out what type of mattress you have by knowing how many people the bed can hold.",
        "For instance, a full bed can fit 2 people in close capacity, while a queen bed allows for a little more room.",
        "Single, twin, and twin XL beds can only fit 1 person, while kings and California kings can comfortably fit at least 2 people.",
        "Apply these measurements to purchase the right bedding and accessories.",
        "Think about these measurements when you go shopping for other accessories, like bed covers and bed skirts.",
        "For these items, consider sheets that could fit around the mattress and also be tucked into the bed frame.",
        "Don’t stress about the shopping process, though—as long as you have a general idea of your mattress size, you should be fine.",
        "If you’re planning on adding a foam mattress topper, double check with a sales associate before purchasing fitted sheets for your mattress."
    ]
}