{
    "title": "How to Rock Climb Overhangs on a Rock Wall",
    "url": "https://www.wikihow.com/Rock-Climb-Overhangs-on-a-Rock-Wall",
    "category_hierarchy": [
        "Sports and Fitness",
        "Outdoor Recreation",
        "Climbing",
        "Rock Climbing"
    ],
    "methods": [
        {
            "name": "Mastering the Basic Climbing Technique",
            "steps": [
                {
                    "headline": "Visualize your line before you start climbing the overhang.",
                    "description": "Overhangs don’t leave you with a lot of time to stop and think where you need to go next, so plan out your route before you begin climbing. Look for holds that provide plenty of space for your feet and hands. Also, identify holds or spots on the wall where you can plant your knees if you need to rest and recalculate your route. The best route is one that allows you to keep your body relatively compact. Overhang climbs are tough work, so avoid stretching toward holds as much as possible. If you’re on the wall, find a stable spot to stop, such as by stepping to a sturdy hold or using a kneebar. Use these spots to rest and consider where you need to go next."
                },
                {
                    "headline": "Hold your arms straight and relax your muscles.",
                    "description": "Overhangs put a ton of stress on your arms and shoulders. Successfully climbing an overhang involves trying to limit that stress as much as possible. Hold onto the wall with a firm, stable grip, keeping your arms out ahead of you. In order to save energy, avoid twisting your arms. Over gripping is a big problem on these types of climbs, so be alert for tension in your arms, shoulders, and fingers. If you hold on too hard, you end up wearing yourself out. Loosen your grip so you can climb further. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tErika Noble\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPCIA Certified Rock Climbing Instructor\t\t\t\t\t\t\t\tErika Noble graduated from Stanford University with a BS in Management Science & Engineering. After competing in collegiate rock climbing competitions as part of the Stanford Rock Climbing team, Erika worked as a Rock Climbing Instructor in Lake Tahoe. She continues to boulder and climb throughout California and the Southwest. Erika Noble\t\t\tPCIA Certified Rock Climbing Instructor\t\t\t\tLooking for immediate improvement? Erika Noble, rock climbing instructor, suggests: \"To improve your endurance on the wall in the short term try to keep your feet on the wall as much as you can to alleviate pressure on your upper body. Take advantage of heel and toe hooks, and look for ideal resting positions where you can straighten your arms and let your biceps and lats rest.\""
                },
                {
                    "headline": "Press your weight into your feet to protect your arms.",
                    "description": "Footwork is even more important on overhangs than it is on other climbs. Keep your knees bent with your feet firmly planted on the nearest footholds. Also, tense your core, your stomach and back muscles, to shift your weight down toward your feet. Push down into the footholds to relieve any unnecessary weight on your arms. Overhang climbs take plenty of core strength, which takes some time to build. While you’re working out your arms by doing exercises like pull-ups at the gym, also try planks and other techniques that build core endurance. If your feet slip off the wall, plant them on a hold as soon as possible to relieve the pressure on your arms."
                },
                {
                    "headline": "Climb at a steady rate with your feet close to your hands.",
                    "description": "One of the biggest mistakes beginning climbers make is trying to get up an overhang too quickly. When you rush, your feet slip and poor footwork means more stress on your upper body. Keep your knees bent so you don’t reach for holds too far ahead of you, then move at a comfortable but consistent pace. You’re going to get tired during an overhang climb, but a good climbing technique improves your endurance. Master your technique by practicing on regular climbs and safe overhangs, such as in a gym. Heel holds and toe holds are useful leg techniques to master for overhang climbs. Make them a part of your routine to improve your climbs."
                },
                {
                    "headline": "Turn your shoulders and hips whenever you reach for a hold.",
                    "description": "Instead of twisting your arms, turn your body to face the spot you wish to reach. Even though this may seem like it extra work, it actually saves your strength. Turning your body improves your balance and keeps pressure on your legs instead of your arms. Climbing is a dynamic activity, so use your entire body as much as possible. For example, if you’re reaching for a hold with your left hand, plant your right foot. As you raise your left foot, turn your left shoulder and hip toward the hold. If you’re uncertain about how to do this, watch an experienced climber."
                },
                {
                    "headline": "Move until you reach a safe spot.",
                    "description": "Because overhangs take so much effort to climb, you don’t have the option to stop whenever you want. Usually, you have to keep moving until you complete the overhang. Stopping and being indecisive costs you precious arm strength. The only exception to this is when you come upon a safe hold to plant your knees on. Practice kneebars and drop knees to find ways to rest on an overhang. These techniques involve finding comfortable holds or indentations to relieve the pressure on your arms. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tErika Noble\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPCIA Certified Rock Climbing Instructor\t\t\t\t\t\t\t\tErika Noble graduated from Stanford University with a BS in Management Science & Engineering. After competing in collegiate rock climbing competitions as part of the Stanford Rock Climbing team, Erika worked as a Rock Climbing Instructor in Lake Tahoe. She continues to boulder and climb throughout California and the Southwest. Erika Noble\t\t\tPCIA Certified Rock Climbing Instructor\t\t\t\tBuild your core strength to reduce the effort. Erika Noble, rock climbing instructor, advises: \"In the long run, practice on overhung boulder problems and focus on building your core strength! Try forearms planks, side planks, toe-to-bars, jackknives, and supermans.\""
                }
            ]
        },
        {
            "name": "Using Your Knees to Move and Rest",
            "steps": [
                {
                    "headline": "Find a small hold close to one of your legs.",
                    "description": "Knee techniques are great ways to take advantage of holds you would otherwise ignore during your climb. Small holds are ones that you can’t rest your entire knee on. Look around the same level as your legs for holds that have enough space for part of your foot. Try to find a hold with a second one nearby. The drop knee technique allows you to take some weight off your arms before you move on. Drop knees are mainly used to adjust your stance during a climb. Kneebars are similar but are better for resting. You could also plant your knee on the wall. Doing this doesn’t give you time to rest, but it still helps you reach for a distant hold."
                },
                {
                    "headline": "Stretch your leg to the hold using the outside edge of your foot.",
                    "description": "Before moving your closest foot toward the hold, make sure the rest of your body is planted firmly on the wall. Twist your hips in the direction of the hold as you reach for it with your back foot. Moving to the foothold brings your hips toward the wall. This lowers your center of gravity, which is very important on overhangs. When you’re ready to move again, you can use your strong positioning to reach higher."
                },
                {
                    "headline": "Twist your knee carefully toward the wall to plant it.",
                    "description": "Hold onto the wall, making sure your feet are stable. Once you twist your hips toward the wall, rotate your leg. Position your leg perpendicular to the wall before planting it on a hold or another resting spot. Be very cautious when performing this technique. If you feel any pain, stop and reverse direction. Dropped knees can lead to injuries if you push through the pain."
                },
                {
                    "headline": "Bridge your knee between 2 footholds if you wish to rest.",
                    "description": "This technique is called a kneebar, and it’s almost identical to a standard drop knee. You need a second foothold close to the first one. After twisting your hips toward the wall, plant your knee on the second foothold. Keep your toes on the original foothold nearby. Kneebars are one of the best ways to rest on an overhang. Planting your leg takes pressure off of your arms. You could stop and reanalyze your climbing route before moving again."
                },
                {
                    "headline": "Reach for the next hold with your free hand.",
                    "description": "Usually, you reach with the hand on the same side of your body as your planted knee. Leave your opposite hand on the wall for stability. Find the next hold before you start moving again. Then, straighten out your body as you push your way up toward it. This motion is sometimes called a twist lock. It enables you to reach further without lunging or ever taking your feet off the wall."
                }
            ]
        },
        {
            "name": "Boosting with Heel and Toe Hooks",
            "steps": [
                {
                    "headline": "Find a hold you can easily reach with your foot.",
                    "description": "Heel holds and toe holds are moves that help boost you along an overhang. Search for a hold above your waist, fairly close to your body. Make sure the hold is large enough for you to comfortably plant your heel or toes. Flexibility helps a lot with holds. If you’re very flexible, you could swing your leg up to reach holds above your head."
                },
                {
                    "headline": "Check the hold for a rough surface to plant your feet on.",
                    "description": "Examine the hold to identify any bumps, dips, or other spots to catch your shoe on. Try to maximize your contact with the hold as much as possible to ensure you get a good grip on it. Before attempting to make your move, thoroughly plan out where you intend on placing your foot. Accuracy is very important, especially if you’re stuck in a difficult spot. Good shoes are a must for holds. You need shoes that fit you snugly and have stiff patches of rubber on the toes and heels. Tie your shoes well so the laces or straps don’t get in the way of your foot placement."
                },
                {
                    "headline": "Swing your foot up to the spot on the hold you picked.",
                    "description": "Grip the wall tightly with your hands, leaning on your other foot for stability as you move. Keep your hips close to the wall so you don’t accidentally slip backward. Then, engage your core and leg muscles by attempting to pull your foot back toward your body when it lands. For a heel hook, you plant the rubber patch on your heel on top of the hold. Toe hooks are almost the same, except you position your toes on the side of the hold furthest from you."
                },
                {
                    "headline": "Pull yourself up gradually as you reach for the next hold.",
                    "description": "Think of your leg as a third arm. Your leg is actually stronger than either of your arms, so use its power to thrust yourself up the wall. As your body rises, reach with the hand on the opposite side of your body. Plant your hand on the hold to finish pulling yourself up. Releasing your heel or toe hold can cause you to slip if you’re not careful. Go at a steady, controlled pace after you have planted your other foot on a secure hold. Keep your core tight to ensure you stay close to the wall as your arms and hands take on additional pressure."
                }
            ]
        },
        {
            "name": "Smearing to Climb without Holds",
            "steps": [
                {
                    "headline": "Find a spot on the wall that isn’t completely flat.",
                    "description": "Smearing means pressing your foot down on a wall for a boost, kind of like squashing a bug. If you can’t find a good hold to plant your foot on, look for indentations, bulges, or other angle changes on the wall. These spots are often very small, so take your time and look carefully around the overhang before proceeding. Try to visualize your route before you begin climbing the overhang. Stop at a resting point with a kneebar as needed to plan your route further. Smearing is somewhat similar to holds since you depend on your shoe rubber to adhere to a rough part of the wall. The difference is that smearing involves using a part of the wall that appears flat."
                },
                {
                    "headline": "Visualize where you plan on placing your feet and hands.",
                    "description": "Precision is key in smearing and rock climbing in general. One wrong move could mean you lose your balance and slip off the wall. You need a stable hold for one foot and a pair of subsequent holds to boost toward. Also, picture where exactly you intend on planting your other foot on the wall."
                },
                {
                    "headline": "Press the upper part of your foot down hard on the indentation.",
                    "description": "You might be thinking that placing your foot on a flat wall is a mistake, but it does work. Press down hard with your toes and the ball of your foot, or the strong part right below your toes. If you feel yourself slipping, press down harder with more of your weight to create more friction. As dangerous as smearing appears to be, it’s an essential climbing technique you can use on any overhang. It’s all about combining precise footwork with as much shoe rubber and weight as possible."
                },
                {
                    "headline": "Push off of the wall to boost yourself to the next hold.",
                    "description": "As you press down on the rock, you generate force with your leg similar to heel holds and other climbing techniques. Use your momentum to push yourself up. Keep your body close to the wall with your arms straight as you reach toward the next holds. Follow up by bringing your other leg and arm up to the next holds. This technique can be a little intimidating at first, so practice it in a safe location. Try using a smooth boulder or visit a gym with big handholds."
                }
            ]
        }
    ],
    "tyn": [
        "Soft, flexible climbing shoes",
        "Climbing helmet",
        "Climbing rope",
        "Climbing harness",
        "Chalk for improved grip",
        "Belays",
        "Carabiners",
        "Rock overhang"
    ],
    "text": " Mastering the Basic Climbing Technique Visualize your line before you start climbing the overhang. Overhangs don’t leave you with a lot of time to stop and think where you need to go next, so plan out your route before you begin climbing. Look for holds that provide plenty of space for your feet and hands. Also, identify holds or spots on the wall where you can plant your knees if you need to rest and recalculate your route. The best route is one that allows you to keep your body relatively compact. Overhang climbs are tough work, so avoid stretching toward holds as much as possible. If you’re on the wall, find a stable spot to stop, such as by stepping to a sturdy hold or using a kneebar. Use these spots to rest and consider where you need to go next. Hold your arms straight and relax your muscles. Overhangs put a ton of stress on your arms and shoulders. Successfully climbing an overhang involves trying to limit that stress as much as possible. Hold onto the wall with a firm, stable grip, keeping your arms out ahead of you. In order to save energy, avoid twisting your arms. Over gripping is a big problem on these types of climbs, so be alert for tension in your arms, shoulders, and fingers. If you hold on too hard, you end up wearing yourself out. Loosen your grip so you can climb further. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tErika Noble\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPCIA Certified Rock Climbing Instructor\t\t\t\t\t\t\t\tErika Noble graduated from Stanford University with a BS in Management Science & Engineering. After competing in collegiate rock climbing competitions as part of the Stanford Rock Climbing team, Erika worked as a Rock Climbing Instructor in Lake Tahoe. She continues to boulder and climb throughout California and the Southwest. Erika Noble\t\t\tPCIA Certified Rock Climbing Instructor\t\t\t\tLooking for immediate improvement? Erika Noble, rock climbing instructor, suggests: \"To improve your endurance on the wall in the short term try to keep your feet on the wall as much as you can to alleviate pressure on your upper body. Take advantage of heel and toe hooks, and look for ideal resting positions where you can straighten your arms and let your biceps and lats rest.\" Press your weight into your feet to protect your arms. Footwork is even more important on overhangs than it is on other climbs. Keep your knees bent with your feet firmly planted on the nearest footholds. Also, tense your core, your stomach and back muscles, to shift your weight down toward your feet. Push down into the footholds to relieve any unnecessary weight on your arms. Overhang climbs take plenty of core strength, which takes some time to build. While you’re working out your arms by doing exercises like pull-ups at the gym, also try planks and other techniques that build core endurance. If your feet slip off the wall, plant them on a hold as soon as possible to relieve the pressure on your arms. Climb at a steady rate with your feet close to your hands. One of the biggest mistakes beginning climbers make is trying to get up an overhang too quickly. When you rush, your feet slip and poor footwork means more stress on your upper body. Keep your knees bent so you don’t reach for holds too far ahead of you, then move at a comfortable but consistent pace. You’re going to get tired during an overhang climb, but a good climbing technique improves your endurance. Master your technique by practicing on regular climbs and safe overhangs, such as in a gym. Heel holds and toe holds are useful leg techniques to master for overhang climbs. Make them a part of your routine to improve your climbs. Turn your shoulders and hips whenever you reach for a hold. Instead of twisting your arms, turn your body to face the spot you wish to reach. Even though this may seem like it extra work, it actually saves your strength. Turning your body improves your balance and keeps pressure on your legs instead of your arms. Climbing is a dynamic activity, so use your entire body as much as possible. For example, if you’re reaching for a hold with your left hand, plant your right foot. As you raise your left foot, turn your left shoulder and hip toward the hold. If you’re uncertain about how to do this, watch an experienced climber. Move until you reach a safe spot. Because overhangs take so much effort to climb, you don’t have the option to stop whenever you want. Usually, you have to keep moving until you complete the overhang. Stopping and being indecisive costs you precious arm strength. The only exception to this is when you come upon a safe hold to plant your knees on. Practice kneebars and drop knees to find ways to rest on an overhang. These techniques involve finding comfortable holds or indentations to relieve the pressure on your arms. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tErika Noble\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPCIA Certified Rock Climbing Instructor\t\t\t\t\t\t\t\tErika Noble graduated from Stanford University with a BS in Management Science & Engineering. After competing in collegiate rock climbing competitions as part of the Stanford Rock Climbing team, Erika worked as a Rock Climbing Instructor in Lake Tahoe. She continues to boulder and climb throughout California and the Southwest. Erika Noble\t\t\tPCIA Certified Rock Climbing Instructor\t\t\t\tBuild your core strength to reduce the effort. Erika Noble, rock climbing instructor, advises: \"In the long run, practice on overhung boulder problems and focus on building your core strength! Try forearms planks, side planks, toe-to-bars, jackknives, and supermans.\" Using Your Knees to Move and Rest Find a small hold close to one of your legs. Knee techniques are great ways to take advantage of holds you would otherwise ignore during your climb. Small holds are ones that you can’t rest your entire knee on. Look around the same level as your legs for holds that have enough space for part of your foot. Try to find a hold with a second one nearby. The drop knee technique allows you to take some weight off your arms before you move on. Drop knees are mainly used to adjust your stance during a climb. Kneebars are similar but are better for resting. You could also plant your knee on the wall. Doing this doesn’t give you time to rest, but it still helps you reach for a distant hold. Stretch your leg to the hold using the outside edge of your foot. Before moving your closest foot toward the hold, make sure the rest of your body is planted firmly on the wall. Twist your hips in the direction of the hold as you reach for it with your back foot. Moving to the foothold brings your hips toward the wall. This lowers your center of gravity, which is very important on overhangs. When you’re ready to move again, you can use your strong positioning to reach higher. Twist your knee carefully toward the wall to plant it. Hold onto the wall, making sure your feet are stable. Once you twist your hips toward the wall, rotate your leg. Position your leg perpendicular to the wall before planting it on a hold or another resting spot. Be very cautious when performing this technique. If you feel any pain, stop and reverse direction. Dropped knees can lead to injuries if you push through the pain. Bridge your knee between 2 footholds if you wish to rest. This technique is called a kneebar, and it’s almost identical to a standard drop knee. You need a second foothold close to the first one. After twisting your hips toward the wall, plant your knee on the second foothold. Keep your toes on the original foothold nearby. Kneebars are one of the best ways to rest on an overhang. Planting your leg takes pressure off of your arms. You could stop and reanalyze your climbing route before moving again. Reach for the next hold with your free hand. Usually, you reach with the hand on the same side of your body as your planted knee. Leave your opposite hand on the wall for stability. Find the next hold before you start moving again. Then, straighten out your body as you push your way up toward it. This motion is sometimes called a twist lock. It enables you to reach further without lunging or ever taking your feet off the wall. Boosting with Heel and Toe Hooks Find a hold you can easily reach with your foot. Heel holds and toe holds are moves that help boost you along an overhang. Search for a hold above your waist, fairly close to your body. Make sure the hold is large enough for you to comfortably plant your heel or toes. Flexibility helps a lot with holds. If you’re very flexible, you could swing your leg up to reach holds above your head. Check the hold for a rough surface to plant your feet on. Examine the hold to identify any bumps, dips, or other spots to catch your shoe on. Try to maximize your contact with the hold as much as possible to ensure you get a good grip on it. Before attempting to make your move, thoroughly plan out where you intend on placing your foot. Accuracy is very important, especially if you’re stuck in a difficult spot. Good shoes are a must for holds. You need shoes that fit you snugly and have stiff patches of rubber on the toes and heels. Tie your shoes well so the laces or straps don’t get in the way of your foot placement. Swing your foot up to the spot on the hold you picked. Grip the wall tightly with your hands, leaning on your other foot for stability as you move. Keep your hips close to the wall so you don’t accidentally slip backward. Then, engage your core and leg muscles by attempting to pull your foot back toward your body when it lands. For a heel hook, you plant the rubber patch on your heel on top of the hold. Toe hooks are almost the same, except you position your toes on the side of the hold furthest from you. Pull yourself up gradually as you reach for the next hold. Think of your leg as a third arm. Your leg is actually stronger than either of your arms, so use its power to thrust yourself up the wall. As your body rises, reach with the hand on the opposite side of your body. Plant your hand on the hold to finish pulling yourself up. Releasing your heel or toe hold can cause you to slip if you’re not careful. Go at a steady, controlled pace after you have planted your other foot on a secure hold. Keep your core tight to ensure you stay close to the wall as your arms and hands take on additional pressure. Smearing to Climb without Holds Find a spot on the wall that isn’t completely flat. Smearing means pressing your foot down on a wall for a boost, kind of like squashing a bug. If you can’t find a good hold to plant your foot on, look for indentations, bulges, or other angle changes on the wall. These spots are often very small, so take your time and look carefully around the overhang before proceeding. Try to visualize your route before you begin climbing the overhang. Stop at a resting point with a kneebar as needed to plan your route further. Smearing is somewhat similar to holds since you depend on your shoe rubber to adhere to a rough part of the wall. The difference is that smearing involves using a part of the wall that appears flat. Visualize where you plan on placing your feet and hands. Precision is key in smearing and rock climbing in general. One wrong move could mean you lose your balance and slip off the wall. You need a stable hold for one foot and a pair of subsequent holds to boost toward. Also, picture where exactly you intend on planting your other foot on the wall. Press the upper part of your foot down hard on the indentation. You might be thinking that placing your foot on a flat wall is a mistake, but it does work. Press down hard with your toes and the ball of your foot, or the strong part right below your toes. If you feel yourself slipping, press down harder with more of your weight to create more friction. As dangerous as smearing appears to be, it’s an essential climbing technique you can use on any overhang. It’s all about combining precise footwork with as much shoe rubber and weight as possible. Push off of the wall to boost yourself to the next hold. As you press down on the rock, you generate force with your leg similar to heel holds and other climbing techniques. Use your momentum to push yourself up. Keep your body close to the wall with your arms straight as you reach toward the next holds. Follow up by bringing your other leg and arm up to the next holds. This technique can be a little intimidating at first, so practice it in a safe location. Try using a smooth boulder or visit a gym with big handholds.",
    "sentences": [
        " Mastering the Basic Climbing Technique Visualize your line before you start climbing the overhang.",
        "Overhangs don’t leave you with a lot of time to stop and think where you need to go next, so plan out your route before you begin climbing.",
        "Look for holds that provide plenty of space for your feet and hands.",
        "Also, identify holds or spots on the wall where you can plant your knees if you need to rest and recalculate your route.",
        "The best route is one that allows you to keep your body relatively compact.",
        "Overhang climbs are tough work, so avoid stretching toward holds as much as possible.",
        "If you’re on the wall, find a stable spot to stop, such as by stepping to a sturdy hold or using a kneebar.",
        "Use these spots to rest and consider where you need to go next.",
        "Hold your arms straight and relax your muscles.",
        "Overhangs put a ton of stress on your arms and shoulders.",
        "Successfully climbing an overhang involves trying to limit that stress as much as possible.",
        "Hold onto the wall with a firm, stable grip, keeping your arms out ahead of you.",
        "In order to save energy, avoid twisting your arms.",
        "Over gripping is a big problem on these types of climbs, so be alert for tension in your arms, shoulders, and fingers.",
        "If you hold on too hard, you end up wearing yourself out.",
        "Loosen your grip so you can climb further.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tErika Noble\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPCIA Certified Rock Climbing Instructor\t\t\t\t\t\t\t\tErika Noble graduated from Stanford University with a BS in Management Science & Engineering.",
        "After competing in collegiate rock climbing competitions as part of the Stanford Rock Climbing team, Erika worked as a Rock Climbing Instructor in Lake Tahoe.",
        "She continues to boulder and climb throughout California and the Southwest.",
        "Erika Noble\t\t\tPCIA Certified Rock Climbing Instructor\t\t\t\tLooking for immediate improvement?",
        "Erika Noble, rock climbing instructor, suggests: \"To improve your endurance on the wall in the short term try to keep your feet on the wall as much as you can to alleviate pressure on your upper body.",
        "Take advantage of heel and toe hooks, and look for ideal resting positions where you can straighten your arms and let your biceps and lats rest.\"",
        "Press your weight into your feet to protect your arms.",
        "Footwork is even more important on overhangs than it is on other climbs.",
        "Keep your knees bent with your feet firmly planted on the nearest footholds.",
        "Also, tense your core, your stomach and back muscles, to shift your weight down toward your feet.",
        "Push down into the footholds to relieve any unnecessary weight on your arms.",
        "Overhang climbs take plenty of core strength, which takes some time to build.",
        "While you’re working out your arms by doing exercises like pull-ups at the gym, also try planks and other techniques that build core endurance.",
        "If your feet slip off the wall, plant them on a hold as soon as possible to relieve the pressure on your arms.",
        "Climb at a steady rate with your feet close to your hands.",
        "One of the biggest mistakes beginning climbers make is trying to get up an overhang too quickly.",
        "When you rush, your feet slip and poor footwork means more stress on your upper body.",
        "Keep your knees bent so you don’t reach for holds too far ahead of you, then move at a comfortable but consistent pace.",
        "You’re going to get tired during an overhang climb, but a good climbing technique improves your endurance.",
        "Master your technique by practicing on regular climbs and safe overhangs, such as in a gym.",
        "Heel holds and toe holds are useful leg techniques to master for overhang climbs.",
        "Make them a part of your routine to improve your climbs.",
        "Turn your shoulders and hips whenever you reach for a hold.",
        "Instead of twisting your arms, turn your body to face the spot you wish to reach.",
        "Even though this may seem like it extra work, it actually saves your strength.",
        "Turning your body improves your balance and keeps pressure on your legs instead of your arms.",
        "Climbing is a dynamic activity, so use your entire body as much as possible.",
        "For example, if you’re reaching for a hold with your left hand, plant your right foot.",
        "As you raise your left foot, turn your left shoulder and hip toward the hold.",
        "If you’re uncertain about how to do this, watch an experienced climber.",
        "Move until you reach a safe spot.",
        "Because overhangs take so much effort to climb, you don’t have the option to stop whenever you want.",
        "Usually, you have to keep moving until you complete the overhang.",
        "Stopping and being indecisive costs you precious arm strength.",
        "The only exception to this is when you come upon a safe hold to plant your knees on.",
        "Practice kneebars and drop knees to find ways to rest on an overhang.",
        "These techniques involve finding comfortable holds or indentations to relieve the pressure on your arms.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tErika Noble\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPCIA Certified Rock Climbing Instructor\t\t\t\t\t\t\t\tErika Noble graduated from Stanford University with a BS in Management Science & Engineering.",
        "After competing in collegiate rock climbing competitions as part of the Stanford Rock Climbing team, Erika worked as a Rock Climbing Instructor in Lake Tahoe.",
        "She continues to boulder and climb throughout California and the Southwest.",
        "Erika Noble\t\t\tPCIA Certified Rock Climbing Instructor\t\t\t\tBuild your core strength to reduce the effort.",
        "Erika Noble, rock climbing instructor, advises: \"In the long run, practice on overhung boulder problems and focus on building your core strength!",
        "Try forearms planks, side planks, toe-to-bars, jackknives, and supermans.\"",
        "Using Your Knees to Move and Rest Find a small hold close to one of your legs.",
        "Knee techniques are great ways to take advantage of holds you would otherwise ignore during your climb.",
        "Small holds are ones that you can’t rest your entire knee on.",
        "Look around the same level as your legs for holds that have enough space for part of your foot.",
        "Try to find a hold with a second one nearby.",
        "The drop knee technique allows you to take some weight off your arms before you move on.",
        "Drop knees are mainly used to adjust your stance during a climb.",
        "Kneebars are similar but are better for resting.",
        "You could also plant your knee on the wall.",
        "Doing this doesn’t give you time to rest, but it still helps you reach for a distant hold.",
        "Stretch your leg to the hold using the outside edge of your foot.",
        "Before moving your closest foot toward the hold, make sure the rest of your body is planted firmly on the wall.",
        "Twist your hips in the direction of the hold as you reach for it with your back foot.",
        "Moving to the foothold brings your hips toward the wall.",
        "This lowers your center of gravity, which is very important on overhangs.",
        "When you’re ready to move again, you can use your strong positioning to reach higher.",
        "Twist your knee carefully toward the wall to plant it.",
        "Hold onto the wall, making sure your feet are stable.",
        "Once you twist your hips toward the wall, rotate your leg.",
        "Position your leg perpendicular to the wall before planting it on a hold or another resting spot.",
        "Be very cautious when performing this technique.",
        "If you feel any pain, stop and reverse direction.",
        "Dropped knees can lead to injuries if you push through the pain.",
        "Bridge your knee between 2 footholds if you wish to rest.",
        "This technique is called a kneebar, and it’s almost identical to a standard drop knee.",
        "You need a second foothold close to the first one.",
        "After twisting your hips toward the wall, plant your knee on the second foothold.",
        "Keep your toes on the original foothold nearby.",
        "Kneebars are one of the best ways to rest on an overhang.",
        "Planting your leg takes pressure off of your arms.",
        "You could stop and reanalyze your climbing route before moving again.",
        "Reach for the next hold with your free hand.",
        "Usually, you reach with the hand on the same side of your body as your planted knee.",
        "Leave your opposite hand on the wall for stability.",
        "Find the next hold before you start moving again.",
        "Then, straighten out your body as you push your way up toward it.",
        "This motion is sometimes called a twist lock.",
        "It enables you to reach further without lunging or ever taking your feet off the wall.",
        "Boosting with Heel and Toe Hooks Find a hold you can easily reach with your foot.",
        "Heel holds and toe holds are moves that help boost you along an overhang.",
        "Search for a hold above your waist, fairly close to your body.",
        "Make sure the hold is large enough for you to comfortably plant your heel or toes.",
        "Flexibility helps a lot with holds.",
        "If you’re very flexible, you could swing your leg up to reach holds above your head.",
        "Check the hold for a rough surface to plant your feet on.",
        "Examine the hold to identify any bumps, dips, or other spots to catch your shoe on.",
        "Try to maximize your contact with the hold as much as possible to ensure you get a good grip on it.",
        "Before attempting to make your move, thoroughly plan out where you intend on placing your foot.",
        "Accuracy is very important, especially if you’re stuck in a difficult spot.",
        "Good shoes are a must for holds.",
        "You need shoes that fit you snugly and have stiff patches of rubber on the toes and heels.",
        "Tie your shoes well so the laces or straps don’t get in the way of your foot placement.",
        "Swing your foot up to the spot on the hold you picked.",
        "Grip the wall tightly with your hands, leaning on your other foot for stability as you move.",
        "Keep your hips close to the wall so you don’t accidentally slip backward.",
        "Then, engage your core and leg muscles by attempting to pull your foot back toward your body when it lands.",
        "For a heel hook, you plant the rubber patch on your heel on top of the hold.",
        "Toe hooks are almost the same, except you position your toes on the side of the hold furthest from you.",
        "Pull yourself up gradually as you reach for the next hold.",
        "Think of your leg as a third arm.",
        "Your leg is actually stronger than either of your arms, so use its power to thrust yourself up the wall.",
        "As your body rises, reach with the hand on the opposite side of your body.",
        "Plant your hand on the hold to finish pulling yourself up.",
        "Releasing your heel or toe hold can cause you to slip if you’re not careful.",
        "Go at a steady, controlled pace after you have planted your other foot on a secure hold.",
        "Keep your core tight to ensure you stay close to the wall as your arms and hands take on additional pressure.",
        "Smearing to Climb without Holds Find a spot on the wall that isn’t completely flat.",
        "Smearing means pressing your foot down on a wall for a boost, kind of like squashing a bug.",
        "If you can’t find a good hold to plant your foot on, look for indentations, bulges, or other angle changes on the wall.",
        "These spots are often very small, so take your time and look carefully around the overhang before proceeding.",
        "Try to visualize your route before you begin climbing the overhang.",
        "Stop at a resting point with a kneebar as needed to plan your route further.",
        "Smearing is somewhat similar to holds since you depend on your shoe rubber to adhere to a rough part of the wall.",
        "The difference is that smearing involves using a part of the wall that appears flat.",
        "Visualize where you plan on placing your feet and hands.",
        "Precision is key in smearing and rock climbing in general.",
        "One wrong move could mean you lose your balance and slip off the wall.",
        "You need a stable hold for one foot and a pair of subsequent holds to boost toward.",
        "Also, picture where exactly you intend on planting your other foot on the wall.",
        "Press the upper part of your foot down hard on the indentation.",
        "You might be thinking that placing your foot on a flat wall is a mistake, but it does work.",
        "Press down hard with your toes and the ball of your foot, or the strong part right below your toes.",
        "If you feel yourself slipping, press down harder with more of your weight to create more friction.",
        "As dangerous as smearing appears to be, it’s an essential climbing technique you can use on any overhang.",
        "It’s all about combining precise footwork with as much shoe rubber and weight as possible.",
        "Push off of the wall to boost yourself to the next hold.",
        "As you press down on the rock, you generate force with your leg similar to heel holds and other climbing techniques.",
        "Use your momentum to push yourself up.",
        "Keep your body close to the wall with your arms straight as you reach toward the next holds.",
        "Follow up by bringing your other leg and arm up to the next holds.",
        "This technique can be a little intimidating at first, so practice it in a safe location.",
        "Try using a smooth boulder or visit a gym with big handholds."
    ]
}