{
    "title": "How to Make Cinnamon Ornaments",
    "url": "https://www.wikihow.com/Make-Cinnamon-Ornaments",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Christmas"
    ],
    "methods": [
        {
            "name": "Making Cinnamon Applesauce Ornaments",
            "steps": [
                {
                    "headline": "Preheat your oven to 200°F (94°C).",
                    "description": "If you don't want to bake your ornaments, you can air dry them instead. This will take a few hours, however; baking will only take 2 hours and 30 minutes."
                },
                {
                    "headline": "Mix the applesauce and cinnamon in a bowl with a rubber spatula.",
                    "description": "Try to use smooth applesauce instead of the chunky kind. Keep stirring until it forms a ball of stiff dough. If your applesauce has large chunks in it, pulse it in a blender first, or your ornaments will be lumpy. To make the ornaments last longer, add 2 tablespoons (30 milliliters) of white craft/school glue into the mixture."
                },
                {
                    "headline": "Roll the dough out until it is ¼-inch to 1/3-inch (6.4 to 8.5 millimeters) thick.",
                    "description": "Take one fourth of the dough, and roll it out on a sheet of wax paper. To prevent sticking, dust it with extra cinnamon. You can also roll it out between two sheets of plastic wrap instead. Working with smaller batches of dough is much easier than working with one big batch."
                },
                {
                    "headline": "Cut the dough using cookie cutters.",
                    "description": "You can make them any shape you wish, but stars, gingerbread men, and trees are the most popular. After you have finished cutting the first batch of cookies, you can roll out another batch of dough, and cut some more."
                },
                {
                    "headline": "Poke a hole near the top of each ornament.",
                    "description": "You can do this using a skewer or straw. The hole needs to be big enough to allow a piece of ribbon or string to pass through it."
                },
                {
                    "headline": "Place the ornaments on a baking sheet, and bake for 2 hours and 30 minutes.",
                    "description": "If you choose not to bake the ornaments, let them air dry for 1 to 2 days; be sure to flip them every 6 hours so that they dry evenly."
                },
                {
                    "headline": "Allow the ornaments to cool, then decorate them, if desired.",
                    "description": "You can decorate them with paint or glitter, or leave them blank. If you'd like to make them look like real gingerbread cookies, decorate them with white puffy paint; it will look just like icing! When you are done decorating, set them out to dry again."
                },
                {
                    "headline": "Thread a piece of ribbon through the hole, and tie it into a secure knot.",
                    "description": "Make sure that the loop is big enough to fit over one of the branches on your tree."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Making Cinnamon Dough Ornaments",
            "steps": [
                {
                    "headline": "Preheat your oven to 350ºF (180ºC).",
                    "description": "If you do not want to bake the ornaments, you can choose to air dry them instead. It will take them about 24 hours for them to air dry, however; it will only take them 7 to 10 minutes to bake."
                },
                {
                    "headline": "Mix the flour, cinnamon, and salt, then add the water gradually.",
                    "description": "Combine the dry ingredients together first until they are evenly mixed together, then slowly add the warm water. Keep mixing and kneading until you get a thick, dough-like consistency."
                },
                {
                    "headline": "Roll the dough out until it is ¼-inch to 1/3-inch (6.4 to 8.5 millimeters) thick.",
                    "description": "Take a fourth of the dough, and roll it out on a sheet of wax paper. To keep it from sticking, dust it with extra cinnamon. You can also roll it out between two sheets of plastic wrap instead. It is easier to work with a small batch of dough than one big batch."
                },
                {
                    "headline": "Cut the dough using cookie cutters.",
                    "description": "You can make them any shape you wish, but stars, gingerbread men, and trees are the most popular. Once you have finished cutting them, roll out some more dough, and cut out some more shapes."
                },
                {
                    "headline": "Poke a hole near the top of each ornament using a skewer or straw.",
                    "description": "The hole needs to be large enough so that you can thread string or ribbon through it."
                },
                {
                    "headline": "Transfer the ornaments to a baking sheet, and bake them for 7 to 10 minutes.",
                    "description": "If you choose not to bake the ornaments, set them out to air dry for 24 hours. Flip them every 6 hours so that they can dry evenly. Because of the flour content, these ornaments will be a lot lighter than ones makes with just cinnamon and applesauce."
                },
                {
                    "headline": "Let the ornaments cool, then decorate, if desired.",
                    "description": "You can paint them, draw on them with glue and glitter, or leave them blank. If you want to make them look like gingerbread cookies, draw on them with white puffy paint; it will look just like icing! When you are done decorating, wait for them."
                },
                {
                    "headline": "Tread a piece of string or ribbon through the hole at the top of the ornament, and secure it with a tight knot.",
                    "description": "Make sure that the loop is big enough to fit over a branch on your tree."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Making Cinnamon Ball Ornaments",
            "steps": [
                {
                    "headline": "Paint a small Styrofoam ball using brown acrylic paint.",
                    "description": "Try to match the brown paint to the color of your cinnamon sticks. This will help hide the Styrofoam when you are done. Do not use spray paint; it will disintegrate the Styrofoam."
                },
                {
                    "headline": "Cut the cinnamon sticks into 2-inch (5.08 centimeters) long pieces.",
                    "description": "If you are having difficulties cutting the cinnamon, make some scoring lines first using a serrated knife, then snap the sticks along those lines. Use a piece of sandpaper to smooth away any jagged edges. How many cinnamon stick you'll need will depend on the size of your Styrofoam ball."
                },
                {
                    "headline": "Glue a loop of string or ribbon to the top of the ball.",
                    "description": "Tie a piece of string into a loop first, then glue the knot to the top of the ball. The loop should be big enough to fit over one of the branches on your Christmas tree."
                },
                {
                    "headline": "Start gluing the cinnamon sticks onto the ball.",
                    "description": "Place a drop of hot glue onto one of the ends of a cinnamon stick, then press it against the ball. Hold it until the glue sets, and glue another stick right next to it."
                },
                {
                    "headline": "Keep gluing sticks until the entire ball is covered.",
                    "description": "You should barely see any Styrofoam. You will end up with a spiky ball made out of cinnamon sticks."
                },
                {
                    "headline": "Hang the ball on your tree.",
                    "description": "You can also hang it from a doorknob, a fireplace mantle, or even a window!"
                }
            ]
        },
        {
            "name": "Making Cinnamon Snowflake Ornaments",
            "steps": [
                {
                    "headline": "Glue 2 cinnamon sticks together to form a cross.",
                    "description": "Hold the sticks together until the hot glue sets. Orient it so that one stick is vertical and the other is horizontal. This will make the larger spokes on your snowflake."
                },
                {
                    "headline": "Wrap a piece of baker's twine 3 to 4 times around the end of each spoke.",
                    "description": "Position the twine ½ inch (1.27 centimeters) from each end, and secure it with a drop of glue. This will give your snowflake some color and design."
                },
                {
                    "headline": "Secure a star anise to the middle of your snowflake with hot glue.",
                    "description": "Place a swirl of glue onto the back of a star anise, and press it in the middle of your cinnamon stick cross. This will be the front of your snowflake."
                },
                {
                    "headline": "Cut 2 cinnamon sticks in half to make the smaller spokes for your snowflake.",
                    "description": "If you are having trouble cutting the sticks, use a serrate knife to score a line across the middle of each one, then snap the sticks in half. Use a piece of sandpaper to smooth out any rough edges, if necessary."
                },
                {
                    "headline": "Glue the mini cinnamon sticks between each of the larger spokes the snowflake.",
                    "description": "Place a drop of glue onto one of the ends of a mini stick. Press it into the corner between two of the longer spokes on the snowflake. Hold the stick in place until the glue sets, and repeat for the remaining three sticks. When you are done, you should have an 8-spoked snowflake: 4 long spokes, and 4 short spokes."
                },
                {
                    "headline": "Add 2 cloves to the top of each of the mini spokes.",
                    "description": "Place a drop of glue onto the pointy end of a piece of clove, and press it against the left side of a mini spoke, about ½ inch (1.27 centimeters) down from the top edge. Hold it in place until the glue sets, then glue another piece of clove on the right side. Repeat this for the remaining three mini spokes. When you are done, each of the smaller spokes should have 3 prongs. This will give your snowflake an interesting design."
                },
                {
                    "headline": "Attach a loop of baker's twine to the back of your snowflake.",
                    "description": "Fold a piece of baker's twine in half and secure it with a knot. Flip your snowflake over, and glue the knot to the top of the snowflake. This way, the knot won't be visible from the front."
                },
                {
                    "headline": "Hang your snowflake from your tree.",
                    "description": "You can also hang it from other places, such as your window or fireplace mantle."
                }
            ]
        }
    ],
    "tyn": [
        "Cinnamon Applesauce Ornaments",
        "Mixing bowl",
        "Wax paper or plastic wrap",
        "Rolling pin",
        "Cookie cutters",
        "Straw or skewer",
        "Colorful ribbon",
        "Baking sheet",
        "Paints, glitter, etc. (optional, for decorating)",
        "Cinnamon Dough Ornaments",
        "Cinnamon Ball Ornaments",
        "Cinnamon sticks",
        "2 to 3 inch (5.08 to 7.62 centimeters) Styrofoam ball",
        "String or ribbon",
        "Serrated knife",
        "Hot glue gun",
        "Hot glue sticks",
        "Brown acrylic paint",
        "Cinnamon Snowflake Ornaments",
        "4 cinnamon sticks",
        "8 cloves",
        "1 star anise",
        "Baker's twine"
    ],
    "text": " Making Cinnamon Applesauce Ornaments Preheat your oven to 200°F (94°C). If you don't want to bake your ornaments, you can air dry them instead. This will take a few hours, however; baking will only take 2 hours and 30 minutes. Mix the applesauce and cinnamon in a bowl with a rubber spatula. Try to use smooth applesauce instead of the chunky kind. Keep stirring until it forms a ball of stiff dough. If your applesauce has large chunks in it, pulse it in a blender first, or your ornaments will be lumpy. To make the ornaments last longer, add 2 tablespoons (30 milliliters) of white craft/school glue into the mixture. Roll the dough out until it is ¼-inch to 1/3-inch (6.4 to 8.5 millimeters) thick. Take one fourth of the dough, and roll it out on a sheet of wax paper. To prevent sticking, dust it with extra cinnamon. You can also roll it out between two sheets of plastic wrap instead. Working with smaller batches of dough is much easier than working with one big batch. Cut the dough using cookie cutters. You can make them any shape you wish, but stars, gingerbread men, and trees are the most popular. After you have finished cutting the first batch of cookies, you can roll out another batch of dough, and cut some more. Poke a hole near the top of each ornament. You can do this using a skewer or straw. The hole needs to be big enough to allow a piece of ribbon or string to pass through it. Place the ornaments on a baking sheet, and bake for 2 hours and 30 minutes. If you choose not to bake the ornaments, let them air dry for 1 to 2 days; be sure to flip them every 6 hours so that they dry evenly. Allow the ornaments to cool, then decorate them, if desired. You can decorate them with paint or glitter, or leave them blank. If you'd like to make them look like real gingerbread cookies, decorate them with white puffy paint; it will look just like icing! When you are done decorating, set them out to dry again. Thread a piece of ribbon through the hole, and tie it into a secure knot. Make sure that the loop is big enough to fit over one of the branches on your tree. Finished.  Making Cinnamon Dough Ornaments Preheat your oven to 350ºF (180ºC). If you do not want to bake the ornaments, you can choose to air dry them instead. It will take them about 24 hours for them to air dry, however; it will only take them 7 to 10 minutes to bake. Mix the flour, cinnamon, and salt, then add the water gradually. Combine the dry ingredients together first until they are evenly mixed together, then slowly add the warm water. Keep mixing and kneading until you get a thick, dough-like consistency. Roll the dough out until it is ¼-inch to 1/3-inch (6.4 to 8.5 millimeters) thick. Take a fourth of the dough, and roll it out on a sheet of wax paper. To keep it from sticking, dust it with extra cinnamon. You can also roll it out between two sheets of plastic wrap instead. It is easier to work with a small batch of dough than one big batch. Cut the dough using cookie cutters. You can make them any shape you wish, but stars, gingerbread men, and trees are the most popular. Once you have finished cutting them, roll out some more dough, and cut out some more shapes. Poke a hole near the top of each ornament using a skewer or straw. The hole needs to be large enough so that you can thread string or ribbon through it. Transfer the ornaments to a baking sheet, and bake them for 7 to 10 minutes. If you choose not to bake the ornaments, set them out to air dry for 24 hours. Flip them every 6 hours so that they can dry evenly. Because of the flour content, these ornaments will be a lot lighter than ones makes with just cinnamon and applesauce. Let the ornaments cool, then decorate, if desired. You can paint them, draw on them with glue and glitter, or leave them blank. If you want to make them look like gingerbread cookies, draw on them with white puffy paint; it will look just like icing! When you are done decorating, wait for them. Tread a piece of string or ribbon through the hole at the top of the ornament, and secure it with a tight knot. Make sure that the loop is big enough to fit over a branch on your tree. Finished.  Making Cinnamon Ball Ornaments Paint a small Styrofoam ball using brown acrylic paint. Try to match the brown paint to the color of your cinnamon sticks. This will help hide the Styrofoam when you are done. Do not use spray paint; it will disintegrate the Styrofoam. Cut the cinnamon sticks into 2-inch (5.08 centimeters) long pieces. If you are having difficulties cutting the cinnamon, make some scoring lines first using a serrated knife, then snap the sticks along those lines. Use a piece of sandpaper to smooth away any jagged edges. How many cinnamon stick you'll need will depend on the size of your Styrofoam ball. Glue a loop of string or ribbon to the top of the ball. Tie a piece of string into a loop first, then glue the knot to the top of the ball. The loop should be big enough to fit over one of the branches on your Christmas tree. Start gluing the cinnamon sticks onto the ball. Place a drop of hot glue onto one of the ends of a cinnamon stick, then press it against the ball. Hold it until the glue sets, and glue another stick right next to it. Keep gluing sticks until the entire ball is covered. You should barely see any Styrofoam. You will end up with a spiky ball made out of cinnamon sticks. Hang the ball on your tree. You can also hang it from a doorknob, a fireplace mantle, or even a window! Making Cinnamon Snowflake Ornaments Glue 2 cinnamon sticks together to form a cross. Hold the sticks together until the hot glue sets. Orient it so that one stick is vertical and the other is horizontal. This will make the larger spokes on your snowflake. Wrap a piece of baker's twine 3 to 4 times around the end of each spoke. Position the twine ½ inch (1.27 centimeters) from each end, and secure it with a drop of glue. This will give your snowflake some color and design. Secure a star anise to the middle of your snowflake with hot glue. Place a swirl of glue onto the back of a star anise, and press it in the middle of your cinnamon stick cross. This will be the front of your snowflake. Cut 2 cinnamon sticks in half to make the smaller spokes for your snowflake. If you are having trouble cutting the sticks, use a serrate knife to score a line across the middle of each one, then snap the sticks in half. Use a piece of sandpaper to smooth out any rough edges, if necessary. Glue the mini cinnamon sticks between each of the larger spokes the snowflake. Place a drop of glue onto one of the ends of a mini stick. Press it into the corner between two of the longer spokes on the snowflake. Hold the stick in place until the glue sets, and repeat for the remaining three sticks. When you are done, you should have an 8-spoked snowflake: 4 long spokes, and 4 short spokes. Add 2 cloves to the top of each of the mini spokes. Place a drop of glue onto the pointy end of a piece of clove, and press it against the left side of a mini spoke, about ½ inch (1.27 centimeters) down from the top edge. Hold it in place until the glue sets, then glue another piece of clove on the right side. Repeat this for the remaining three mini spokes. When you are done, each of the smaller spokes should have 3 prongs. This will give your snowflake an interesting design. Attach a loop of baker's twine to the back of your snowflake. Fold a piece of baker's twine in half and secure it with a knot. Flip your snowflake over, and glue the knot to the top of the snowflake. This way, the knot won't be visible from the front. Hang your snowflake from your tree. You can also hang it from other places, such as your window or fireplace mantle.",
    "sentences": [
        " Making Cinnamon Applesauce Ornaments Preheat your oven to 200°F (94°C).",
        "If you don't want to bake your ornaments, you can air dry them instead.",
        "This will take a few hours, however; baking will only take 2 hours and 30 minutes.",
        "Mix the applesauce and cinnamon in a bowl with a rubber spatula.",
        "Try to use smooth applesauce instead of the chunky kind.",
        "Keep stirring until it forms a ball of stiff dough.",
        "If your applesauce has large chunks in it, pulse it in a blender first, or your ornaments will be lumpy.",
        "To make the ornaments last longer, add 2 tablespoons (30 milliliters) of white craft/school glue into the mixture.",
        "Roll the dough out until it is ¼-inch to 1/3-inch (6.4 to 8.5 millimeters) thick.",
        "Take one fourth of the dough, and roll it out on a sheet of wax paper.",
        "To prevent sticking, dust it with extra cinnamon.",
        "You can also roll it out between two sheets of plastic wrap instead.",
        "Working with smaller batches of dough is much easier than working with one big batch.",
        "Cut the dough using cookie cutters.",
        "You can make them any shape you wish, but stars, gingerbread men, and trees are the most popular.",
        "After you have finished cutting the first batch of cookies, you can roll out another batch of dough, and cut some more.",
        "Poke a hole near the top of each ornament.",
        "You can do this using a skewer or straw.",
        "The hole needs to be big enough to allow a piece of ribbon or string to pass through it.",
        "Place the ornaments on a baking sheet, and bake for 2 hours and 30 minutes.",
        "If you choose not to bake the ornaments, let them air dry for 1 to 2 days; be sure to flip them every 6 hours so that they dry evenly.",
        "Allow the ornaments to cool, then decorate them, if desired.",
        "You can decorate them with paint or glitter, or leave them blank.",
        "If you'd like to make them look like real gingerbread cookies, decorate them with white puffy paint; it will look just like icing!",
        "When you are done decorating, set them out to dry again.",
        "Thread a piece of ribbon through the hole, and tie it into a secure knot.",
        "Make sure that the loop is big enough to fit over one of the branches on your tree.",
        "Finished.",
        "Making Cinnamon Dough Ornaments Preheat your oven to 350ºF (180ºC).",
        "If you do not want to bake the ornaments, you can choose to air dry them instead.",
        "It will take them about 24 hours for them to air dry, however; it will only take them 7 to 10 minutes to bake.",
        "Mix the flour, cinnamon, and salt, then add the water gradually.",
        "Combine the dry ingredients together first until they are evenly mixed together, then slowly add the warm water.",
        "Keep mixing and kneading until you get a thick, dough-like consistency.",
        "Roll the dough out until it is ¼-inch to 1/3-inch (6.4 to 8.5 millimeters) thick.",
        "Take a fourth of the dough, and roll it out on a sheet of wax paper.",
        "To keep it from sticking, dust it with extra cinnamon.",
        "You can also roll it out between two sheets of plastic wrap instead.",
        "It is easier to work with a small batch of dough than one big batch.",
        "Cut the dough using cookie cutters.",
        "You can make them any shape you wish, but stars, gingerbread men, and trees are the most popular.",
        "Once you have finished cutting them, roll out some more dough, and cut out some more shapes.",
        "Poke a hole near the top of each ornament using a skewer or straw.",
        "The hole needs to be large enough so that you can thread string or ribbon through it.",
        "Transfer the ornaments to a baking sheet, and bake them for 7 to 10 minutes.",
        "If you choose not to bake the ornaments, set them out to air dry for 24 hours.",
        "Flip them every 6 hours so that they can dry evenly.",
        "Because of the flour content, these ornaments will be a lot lighter than ones makes with just cinnamon and applesauce.",
        "Let the ornaments cool, then decorate, if desired.",
        "You can paint them, draw on them with glue and glitter, or leave them blank.",
        "If you want to make them look like gingerbread cookies, draw on them with white puffy paint; it will look just like icing!",
        "When you are done decorating, wait for them.",
        "Tread a piece of string or ribbon through the hole at the top of the ornament, and secure it with a tight knot.",
        "Make sure that the loop is big enough to fit over a branch on your tree.",
        "Finished.",
        "Making Cinnamon Ball Ornaments Paint a small Styrofoam ball using brown acrylic paint.",
        "Try to match the brown paint to the color of your cinnamon sticks.",
        "This will help hide the Styrofoam when you are done.",
        "Do not use spray paint; it will disintegrate the Styrofoam.",
        "Cut the cinnamon sticks into 2-inch (5.08 centimeters) long pieces.",
        "If you are having difficulties cutting the cinnamon, make some scoring lines first using a serrated knife, then snap the sticks along those lines.",
        "Use a piece of sandpaper to smooth away any jagged edges.",
        "How many cinnamon stick you'll need will depend on the size of your Styrofoam ball.",
        "Glue a loop of string or ribbon to the top of the ball.",
        "Tie a piece of string into a loop first, then glue the knot to the top of the ball.",
        "The loop should be big enough to fit over one of the branches on your Christmas tree.",
        "Start gluing the cinnamon sticks onto the ball.",
        "Place a drop of hot glue onto one of the ends of a cinnamon stick, then press it against the ball.",
        "Hold it until the glue sets, and glue another stick right next to it.",
        "Keep gluing sticks until the entire ball is covered.",
        "You should barely see any Styrofoam.",
        "You will end up with a spiky ball made out of cinnamon sticks.",
        "Hang the ball on your tree.",
        "You can also hang it from a doorknob, a fireplace mantle, or even a window!",
        "Making Cinnamon Snowflake Ornaments Glue 2 cinnamon sticks together to form a cross.",
        "Hold the sticks together until the hot glue sets.",
        "Orient it so that one stick is vertical and the other is horizontal.",
        "This will make the larger spokes on your snowflake.",
        "Wrap a piece of baker's twine 3 to 4 times around the end of each spoke.",
        "Position the twine ½ inch (1.27 centimeters) from each end, and secure it with a drop of glue.",
        "This will give your snowflake some color and design.",
        "Secure a star anise to the middle of your snowflake with hot glue.",
        "Place a swirl of glue onto the back of a star anise, and press it in the middle of your cinnamon stick cross.",
        "This will be the front of your snowflake.",
        "Cut 2 cinnamon sticks in half to make the smaller spokes for your snowflake.",
        "If you are having trouble cutting the sticks, use a serrate knife to score a line across the middle of each one, then snap the sticks in half.",
        "Use a piece of sandpaper to smooth out any rough edges, if necessary.",
        "Glue the mini cinnamon sticks between each of the larger spokes the snowflake.",
        "Place a drop of glue onto one of the ends of a mini stick.",
        "Press it into the corner between two of the longer spokes on the snowflake.",
        "Hold the stick in place until the glue sets, and repeat for the remaining three sticks.",
        "When you are done, you should have an 8-spoked snowflake: 4 long spokes, and 4 short spokes.",
        "Add 2 cloves to the top of each of the mini spokes.",
        "Place a drop of glue onto the pointy end of a piece of clove, and press it against the left side of a mini spoke, about ½ inch (1.27 centimeters) down from the top edge.",
        "Hold it in place until the glue sets, then glue another piece of clove on the right side.",
        "Repeat this for the remaining three mini spokes.",
        "When you are done, each of the smaller spokes should have 3 prongs.",
        "This will give your snowflake an interesting design.",
        "Attach a loop of baker's twine to the back of your snowflake.",
        "Fold a piece of baker's twine in half and secure it with a knot.",
        "Flip your snowflake over, and glue the knot to the top of the snowflake.",
        "This way, the knot won't be visible from the front.",
        "Hang your snowflake from your tree.",
        "You can also hang it from other places, such as your window or fireplace mantle."
    ]
}