{
    "title": "How to Make Coconut Rice",
    "url": "https://www.wikihow.com/Make-Coconut-Rice",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Rice and Beans"
    ],
    "methods": [
        {
            "name": "Using a Saucepan",
            "steps": [
                {
                    "headline": "Place the rice in a colander or sieve.",
                    "description": "Place 2 cups of basmati rice in a colander or sieve and rinse the rice under running, cold water until the water is clear. Just make sure the rice doesn't actually fall through the sieve. You can place the sieve over a bowl to catch any of the rice that may fall out."
                },
                {
                    "headline": "Drain the rice.",
                    "description": "When you're done, add it to a saucepan with the cup of coconut milk, 3 cups of water, and the tablespoon of sea salt."
                },
                {
                    "headline": "Bring the mixture to a boil.",
                    "description": "Stir it occasionally to keep the rice from clumping together."
                },
                {
                    "headline": "Reduce the heat and leave the rice to simmer for about 10-12 minutes.",
                    "description": "If the water is absorbed really quickly and the rice is still hard, then you can add a little bit more water to the mixture and keep stirring it to make it more fluffy."
                },
                {
                    "headline": "Serve.",
                    "description": "Serve the rice on its own, or pair it with beef, chicken, or a vegetable mixture."
                }
            ]
        },
        {
            "name": "Using a Rice Cooker",
            "steps": [
                {
                    "headline": "Place the rice in a rice cooker.",
                    "description": "Place 2 cups of Thai jasmine-scented white rice in the cooker."
                },
                {
                    "headline": "Add the other ingredients.",
                    "description": "Add 2 cups of water, 1 cup of coconut milk, and 1 tbsp. of dry shredded coconut to the rice. Stir the ingredients together with a plastic spoon until they're thoroughly combined to distribute the coconut flavor and to keep the rice from sticking."
                },
                {
                    "headline": "Cover the cooker and set it to cook.",
                    "description": ""
                },
                {
                    "headline": "After your cooker reaches \"warm\" mode, cook the rice for another 10-15 minutes.",
                    "description": "This depends on how long it takes for the ingredients in your cooker to finish steaming."
                },
                {
                    "headline": "Gently fluff the rice.",
                    "description": "Once it's done, fluffing the rice with the cooker spoon a bit will make it more soft and tasty."
                },
                {
                    "headline": "Serve.",
                    "description": "Enjoy this rice on its own or with chicken, veggies, or beef. You can also try it with shrimp, scallops, or other delicious seafood."
                }
            ]
        }
    ],
    "tyn": [
        "Colander or sieve",
        "Saucepan",
        "Stirring spoon",
        "Serving dish (optional)"
    ],
    "text": " Using a Saucepan Place the rice in a colander or sieve. Place 2 cups of basmati rice in a colander or sieve and rinse the rice under running, cold water until the water is clear. Just make sure the rice doesn't actually fall through the sieve. You can place the sieve over a bowl to catch any of the rice that may fall out. Drain the rice. When you're done, add it to a saucepan with the cup of coconut milk, 3 cups of water, and the tablespoon of sea salt. Bring the mixture to a boil. Stir it occasionally to keep the rice from clumping together. Reduce the heat and leave the rice to simmer for about 10-12 minutes. If the water is absorbed really quickly and the rice is still hard, then you can add a little bit more water to the mixture and keep stirring it to make it more fluffy. Serve. Serve the rice on its own, or pair it with beef, chicken, or a vegetable mixture. Using a Rice Cooker Place the rice in a rice cooker. Place 2 cups of Thai jasmine-scented white rice in the cooker. Add the other ingredients. Add 2 cups of water, 1 cup of coconut milk, and 1 tbsp. of dry shredded coconut to the rice. Stir the ingredients together with a plastic spoon until they're thoroughly combined to distribute the coconut flavor and to keep the rice from sticking. Cover the cooker and set it to cook.  After your cooker reaches \"warm\" mode, cook the rice for another 10-15 minutes. This depends on how long it takes for the ingredients in your cooker to finish steaming. Gently fluff the rice. Once it's done, fluffing the rice with the cooker spoon a bit will make it more soft and tasty. Serve. Enjoy this rice on its own or with chicken, veggies, or beef. You can also try it with shrimp, scallops, or other delicious seafood.",
    "sentences": [
        " Using a Saucepan Place the rice in a colander or sieve.",
        "Place 2 cups of basmati rice in a colander or sieve and rinse the rice under running, cold water until the water is clear.",
        "Just make sure the rice doesn't actually fall through the sieve.",
        "You can place the sieve over a bowl to catch any of the rice that may fall out.",
        "Drain the rice.",
        "When you're done, add it to a saucepan with the cup of coconut milk, 3 cups of water, and the tablespoon of sea salt.",
        "Bring the mixture to a boil.",
        "Stir it occasionally to keep the rice from clumping together.",
        "Reduce the heat and leave the rice to simmer for about 10-12 minutes.",
        "If the water is absorbed really quickly and the rice is still hard, then you can add a little bit more water to the mixture and keep stirring it to make it more fluffy.",
        "Serve.",
        "Serve the rice on its own, or pair it with beef, chicken, or a vegetable mixture.",
        "Using a Rice Cooker Place the rice in a rice cooker.",
        "Place 2 cups of Thai jasmine-scented white rice in the cooker.",
        "Add the other ingredients.",
        "Add 2 cups of water, 1 cup of coconut milk, and 1 tbsp.",
        "of dry shredded coconut to the rice.",
        "Stir the ingredients together with a plastic spoon until they're thoroughly combined to distribute the coconut flavor and to keep the rice from sticking.",
        "Cover the cooker and set it to cook.",
        "After your cooker reaches \"warm\" mode, cook the rice for another 10-15 minutes.",
        "This depends on how long it takes for the ingredients in your cooker to finish steaming.",
        "Gently fluff the rice.",
        "Once it's done, fluffing the rice with the cooker spoon a bit will make it more soft and tasty.",
        "Serve.",
        "Enjoy this rice on its own or with chicken, veggies, or beef.",
        "You can also try it with shrimp, scallops, or other delicious seafood."
    ]
}