{
    "title": "How to Make Prawn Curry",
    "url": "https://www.wikihow.com/Make-Prawn-Curry",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fish and Seafood",
        "Prawns and Shrimp"
    ],
    "steps": [
        {
            "headline": "Remove the Prawns shells.",
            "description": "First pull off the head. Then rinse the prawn in water. Remove the shell from the middle part of the prawn. Hold the exposed top end and pull the tail to remove the rest of the shell. Then use a sharp knife to make a shallow slit down the middle of the curved back and pull out the dark colored vein. You can use your fingers or a cocktail stick to do this."
        },
        {
            "headline": "Rinse the prawn again.Good prawns should be a bluish/green color once peeled.",
            "description": ""
        },
        {
            "headline": "Chop the ingredients.Peel and finely dice 2 onions, then 4 tomatoes.Then chop 2 green chillies.",
            "description": ""
        },
        {
            "headline": "Start frying.Put a large non-stick frying pan over a medium heat.",
            "description": "Add 3 tablespoons of vegetable oil\n2 sticks of cinnamon\n4 cardamom pods and 4 cloves."
        },
        {
            "headline": "Fry for about 30 seconds, stirring continually.",
            "description": ""
        },
        {
            "headline": "Add finely chopped onions and chillies.Add the 2 chopped onions and 2 green chillies to the pan, and fry for about 5 minutes or until the onions are a light brown.",
            "description": "Stir frequently to stop the onions burning."
        },
        {
            "headline": "Ginger and garlic paste.Now add 2 tablespoons of ginger and garlic paste.",
            "description": "Stir well for a couple of minutes."
        },
        {
            "headline": "Add the spices.",
            "description": "1/2 a teaspoon of turmeric,\n1 teaspoon of red chilli powder and\n1 teaspoon of coriander powder\nhalf a teaspoon of garam masala and fry for 5 minutes over a low heat, stirring frequently."
        },
        {
            "headline": "Add the finely chopped tomatoes followed by 1 tablespoon of cumin powder.",
            "description": "Then stir. Add 1 tablespoon of tomato paste and stir it in. Add a cup of water and keep stirring until the water is absorbed. Turn the heat down, put the lid on, and leave to simmer for 10-15 minutes, or until the oil separates from the dish and rises to the top."
        },
        {
            "headline": "Add the prawns.",
            "description": "Turn the heat back up to high and add the prawns to the pan. Then stir in 2 generous pinches of salt."
        },
        {
            "headline": "Add water to the pan.Add approximately 200ml of warm water to the pan.",
            "description": "Stir. Then put the lid on and bring the heat down. Leave for about 10 minutes or until the prawns are cooked. check occasionally. The prawns are done when they turn pink and opaque. When they are ready, turn the heat off."
        },
        {
            "headline": "Garnish with coriander.",
            "description": "Finely chop the coriander and save a couple of good leaves to garnish. Now stir in the coriander to finish the dish."
        },
        {
            "headline": "Serve with medium heat.Lay the coriander leaves onto the curry, and serve.",
            "description": ""
        },
        {
            "headline": "Finished.",
            "description": ""
        }
    ],
    "tyn": [
        "1 knife",
        "1 tablespoon",
        "1 teaspoon",
        "1 large non-sticky pan",
        "1 cup",
        "1 spatula"
    ],
    "text": " Remove the Prawns shells. First pull off the head. Then rinse the prawn in water. Remove the shell from the middle part of the prawn. Hold the exposed top end and pull the tail to remove the rest of the shell. Then use a sharp knife to make a shallow slit down the middle of the curved back and pull out the dark colored vein. You can use your fingers or a cocktail stick to do this. Rinse the prawn again.Good prawns should be a bluish/green color once peeled.  Chop the ingredients.Peel and finely dice 2 onions, then 4 tomatoes.Then chop 2 green chillies.  Start frying.Put a large non-stick frying pan over a medium heat. Add 3 tablespoons of vegetable oil\n2 sticks of cinnamon\n4 cardamom pods and 4 cloves. Fry for about 30 seconds, stirring continually.  Add finely chopped onions and chillies.Add the 2 chopped onions and 2 green chillies to the pan, and fry for about 5 minutes or until the onions are a light brown. Stir frequently to stop the onions burning. Ginger and garlic paste.Now add 2 tablespoons of ginger and garlic paste. Stir well for a couple of minutes. Add the spices. 1/2 a teaspoon of turmeric,\n1 teaspoon of red chilli powder and\n1 teaspoon of coriander powder\nhalf a teaspoon of garam masala and fry for 5 minutes over a low heat, stirring frequently. Add the finely chopped tomatoes followed by 1 tablespoon of cumin powder. Then stir. Add 1 tablespoon of tomato paste and stir it in. Add a cup of water and keep stirring until the water is absorbed. Turn the heat down, put the lid on, and leave to simmer for 10-15 minutes, or until the oil separates from the dish and rises to the top. Add the prawns. Turn the heat back up to high and add the prawns to the pan. Then stir in 2 generous pinches of salt. Add water to the pan.Add approximately 200ml of warm water to the pan. Stir. Then put the lid on and bring the heat down. Leave for about 10 minutes or until the prawns are cooked. check occasionally. The prawns are done when they turn pink and opaque. When they are ready, turn the heat off. Garnish with coriander. Finely chop the coriander and save a couple of good leaves to garnish. Now stir in the coriander to finish the dish. Serve with medium heat.Lay the coriander leaves onto the curry, and serve.  Finished. ",
    "sentences": [
        " Remove the Prawns shells.",
        "First pull off the head.",
        "Then rinse the prawn in water.",
        "Remove the shell from the middle part of the prawn.",
        "Hold the exposed top end and pull the tail to remove the rest of the shell.",
        "Then use a sharp knife to make a shallow slit down the middle of the curved back and pull out the dark colored vein.",
        "You can use your fingers or a cocktail stick to do this.",
        "Rinse the prawn again.Good prawns should be a bluish/green color once peeled.",
        "Chop the ingredients.Peel and finely dice 2 onions, then 4 tomatoes.Then chop 2 green chillies.",
        "Start frying.Put a large non-stick frying pan over a medium heat.",
        "Add 3 tablespoons of vegetable oil\n2 sticks of cinnamon\n4 cardamom pods and 4 cloves.",
        "Fry for about 30 seconds, stirring continually.",
        "Add finely chopped onions and chillies.Add the 2 chopped onions and 2 green chillies to the pan, and fry for about 5 minutes or until the onions are a light brown.",
        "Stir frequently to stop the onions burning.",
        "Ginger and garlic paste.Now add 2 tablespoons of ginger and garlic paste.",
        "Stir well for a couple of minutes.",
        "Add the spices.",
        "1/2 a teaspoon of turmeric,\n1 teaspoon of red chilli powder and\n1 teaspoon of coriander powder\nhalf a teaspoon of garam masala and fry for 5 minutes over a low heat, stirring frequently.",
        "Add the finely chopped tomatoes followed by 1 tablespoon of cumin powder.",
        "Then stir.",
        "Add 1 tablespoon of tomato paste and stir it in.",
        "Add a cup of water and keep stirring until the water is absorbed.",
        "Turn the heat down, put the lid on, and leave to simmer for 10-15 minutes, or until the oil separates from the dish and rises to the top.",
        "Add the prawns.",
        "Turn the heat back up to high and add the prawns to the pan.",
        "Then stir in 2 generous pinches of salt.",
        "Add water to the pan.Add approximately 200ml of warm water to the pan.",
        "Stir.",
        "Then put the lid on and bring the heat down.",
        "Leave for about 10 minutes or until the prawns are cooked.",
        "check occasionally.",
        "The prawns are done when they turn pink and opaque.",
        "When they are ready, turn the heat off.",
        "Garnish with coriander.",
        "Finely chop the coriander and save a couple of good leaves to garnish.",
        "Now stir in the coriander to finish the dish.",
        "Serve with medium heat.Lay the coriander leaves onto the curry, and serve.",
        "Finished."
    ]
}