{
    "title": "How to Hook Up a Battery Charger",
    "url": "https://www.wikihow.com/Hook-Up-a-Battery-Charger",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Maintenance and Repair",
        "Car Engines",
        "Car Batteries and Ignitions"
    ],
    "parts": [
        {
            "name": "Preparing to Charge Your Battery",
            "steps": [
                {
                    "headline": "Read the specifications for your battery.",
                    "description": "Start with the owner’s manual if your battery is original to the car. This should answer important questions such as what the voltage requirements are for charging your battery and whether or not you should remove it from the vehicle before charging. Almost all car batteries are 12 volt, but the charging voltage can vary depending on the amount of charge your battery currently has and the temperature."
                },
                {
                    "headline": "Read the specifications for your battery charger.",
                    "description": "There will be a manual with your battery charger that provides details for the appropriate use of the charger."
                },
                {
                    "headline": "Choose a well-ventilated work area.",
                    "description": "Working in a well-ventilated area will help dissipate the hydrogen gas that batteries generate from the sulfuric acid within their cells. Also, make sure to keep any other volatile substances, such as gasoline, flammable materials, or ignition sources (flames, cigarettes, matches, lighters) away from the battery at all times."
                },
                {
                    "headline": "Put on protective gear.",
                    "description": "Glasses, gloves, and other protective gear is a good precaution. Hydrogen released within the battery quickly converts to a gas and expands, this can cause the battery to explode if venting mechanisms fail. Once the hydrogen is in contact with the oxygen in the air, it is highly flammable and can be ignited even by static electricity."
                },
                {
                    "headline": "Turn off all vehicle accessories.",
                    "description": "These accessories draw power from the battery and should be turned off before removing or charging the battery."
                },
                {
                    "headline": "Locate your battery.",
                    "description": "Most batteries will be found either under the hood of the vehicle or in the trunk. It is also possible that your battery may be under the rear seat, and sometimes the battery can only be accessed from underneath the side of the car."
                },
                {
                    "headline": "Identify the positive and grounded posts on your battery.",
                    "description": "One post will be grounded by being connected to the vehicle’s chassis. The other post will be “hot,” meaning that current will flow from it to the grounded post in a circuit. There are a few ways to tell which is which:\nLook for labels such as “POS,” “P,” or “+” for the positive post and “NEG,” “N,” or “-“ for the negative (grounded) posts on the battery case. Compare the diameters of the battery posts. For most batteries, the positive post is thicker than the negative post. If the battery cables are connected to the posts, note the color of the cables. The cable connected to the positive post should be red, while the cable connected to the negative post should be black."
                },
                {
                    "headline": "Disconnect the vehicle battery cables.",
                    "description": "Disconnect the grounded terminal (negative), then the ungrounded terminal (positive) before removing the battery."
                },
                {
                    "headline": "Remove the battery from the vehicle.",
                    "description": "Some vehicles require that you remove the battery before charging, others do not. Follow the instructions provided in your owner’s manual or with your battery. Typically if the battery you’re charging is for a boat, you must take the battery out of the boat and charge it on shore. You can charge the battery inside the boat only if you have a charger and other equipment that is specifically meant for doing so. Using a battery carrier to move the battery from the vehicle to the place where you will connect it to the charger is recommended. This will avoid putting pressure on the battery ends and forcing battery acid out of the vent caps, as might happen if you carry it in your hands."
                }
            ]
        },
        {
            "name": "Hooking Up the Charger",
            "steps": [
                {
                    "headline": "Clean the battery terminals.",
                    "description": "Use a mixture of baking soda and water to clean any corrosion off the terminals and neutralize any sulfuric acid that may have spilled on them. You can apply the mixture with an old toothbrush. Alternatively, you can clean off mild corrosion by using a wire brush. Auto parts stores even sell a special round wire brush that fits over the terminals. Do not touch your eyes, nose, or mouth right after cleaning the terminals. Wash your hands immediately. Do not touch any white gunk that may appear on the terminals, as this is congealed sulfuric acid."
                },
                {
                    "headline": "Pour in enough distilled water to reach the fill level on each battery cell.",
                    "description": "Pouring water into your battery cells disperses hydrogen gas from the cell. Do not use tap water as it will damage your battery over time. Replace the cell caps after filling. Most U.S. batteries, they are equipped with flame arrestors. If your battery does not have flame-arresting caps, put a wet cloth across the top of the caps. If you have a battery that does not need filled with water (known as maintenance free batteries) or if your battery caps are sealed then you should ignore this step and follow the manufacturer’s instructions for charging your battery."
                },
                {
                    "headline": "Place the charger as far from the battery as its cables will allow.",
                    "description": "This will reduce the possibility of damage to the unit from any airborne sulfuric acid vapor. Never place the charger directly above or below the battery."
                },
                {
                    "headline": "Set the charger to deliver the correct voltage.",
                    "description": "This is done by adjusting the voltage output selector, usually on the front of the charging unit. If the required voltage isn’t posted on the battery case itself, it should be in the vehicle owner’s manual. If your charger has an adjustable rate of charge you should start at the lowest rate."
                },
                {
                    "headline": "Connect one charger clip to the positive post on the battery.",
                    "description": "This step is the same whether the battery is removed from the vehicle for charging or not."
                },
                {
                    "headline": "Connect the second charger clip to ground.",
                    "description": "There are two different cases for connecting the ground. If the battery has not been removed from the vehicle, connect the battery charger’s grounding cable to a heavy-gauge metal part of the engine block or chassis. This prevents arcing at the battery terminal and will not run the risk of causing the battery to explode. Clipping the grounding cable directly to the negative battery terminal can be dangerous. If the battery has been removed from the vehicle, you should connect a jumper cable or insulated battery cable at least 24 inches (60 cm) long to the grounded post. Then, connect the battery charger clip for the grounded post to this cable. This allows you to be away from the battery when you complete the circuit in case it explodes. It is also a good idea not to be facing the battery when you connect the charger to the jumper cable."
                },
                {
                    "headline": "Plug the charger into an outlet.",
                    "description": "The charger should be equipped with a grounded plug (three pronged plug) and should be plugged into a properly grounded outlet (three prong outlet). An adapter should not be used. Use an extension cord only if absolutely necessary. If an extension cord is necessary, it should be a grounded (three pronged) extension cord and be the proper wire size to accommodate the amperage of the charger. An adapter should not be used between the charger and extension cord or the extension cord and the wall."
                },
                {
                    "headline": "Leave the battery on the charger until the battery is fully charged.",
                    "description": "You can tell this by using the recommended charging time for your battery or looking to see if the charge indicator shows the battery has been fully charged."
                }
            ]
        },
        {
            "name": "Disconnecting the Charger",
            "steps": [
                {
                    "headline": "Unplug the charger.",
                    "description": "Once your battery is fully charged, you will need to systematically unhook your components. Start by unplugging the charger from the outlet."
                },
                {
                    "headline": "Disconnect the charger grounding clip from the battery.",
                    "description": "Disconnect from the grounded terminal first. Again, this will be the negative terminal on the battery if the battery was removed and will be the clip attached to a metal component of the vehicle if the battery was not removed."
                },
                {
                    "headline": "Disconnect the positive clip from the battery.",
                    "description": "This will be the clip on the positive battery post. Some battery chargers have an engine starting feature. If your battery charger has one, you can leave it connected to the battery when you start the vehicle’s engine; if not, you must disconnect the charger before you start the engine. In either case, avoid moving engine parts if you start the engine with the hood raised or cover removed."
                },
                {
                    "headline": "Re-install the battery.",
                    "description": "This will only be necessary if you had to remove your battery for charging."
                },
                {
                    "headline": "Reconnect the battery cables.",
                    "description": "Connect to the ungrounded (positive) terminal first, then to the grounded (negative) terminal."
                }
            ]
        }
    ],
    "tyn": [
        "Battery charger",
        "Jumper cable or 6-gauge battery cable (when charging a battery outside a vehicle)",
        "Grounded extension cord (if necessary)",
        "Battery carrier (if battery has to be moved any distance to be charged)",
        "Safety glasses or goggles",
        "Soap and water"
    ],
    "text": " Preparing to Charge Your Battery Read the specifications for your battery. Start with the owner’s manual if your battery is original to the car. This should answer important questions such as what the voltage requirements are for charging your battery and whether or not you should remove it from the vehicle before charging. Almost all car batteries are 12 volt, but the charging voltage can vary depending on the amount of charge your battery currently has and the temperature. Read the specifications for your battery charger. There will be a manual with your battery charger that provides details for the appropriate use of the charger. Choose a well-ventilated work area. Working in a well-ventilated area will help dissipate the hydrogen gas that batteries generate from the sulfuric acid within their cells. Also, make sure to keep any other volatile substances, such as gasoline, flammable materials, or ignition sources (flames, cigarettes, matches, lighters) away from the battery at all times. Put on protective gear. Glasses, gloves, and other protective gear is a good precaution. Hydrogen released within the battery quickly converts to a gas and expands, this can cause the battery to explode if venting mechanisms fail. Once the hydrogen is in contact with the oxygen in the air, it is highly flammable and can be ignited even by static electricity. Turn off all vehicle accessories. These accessories draw power from the battery and should be turned off before removing or charging the battery. Locate your battery. Most batteries will be found either under the hood of the vehicle or in the trunk. It is also possible that your battery may be under the rear seat, and sometimes the battery can only be accessed from underneath the side of the car. Identify the positive and grounded posts on your battery. One post will be grounded by being connected to the vehicle’s chassis. The other post will be “hot,” meaning that current will flow from it to the grounded post in a circuit. There are a few ways to tell which is which:\nLook for labels such as “POS,” “P,” or “+” for the positive post and “NEG,” “N,” or “-“ for the negative (grounded) posts on the battery case. Compare the diameters of the battery posts. For most batteries, the positive post is thicker than the negative post. If the battery cables are connected to the posts, note the color of the cables. The cable connected to the positive post should be red, while the cable connected to the negative post should be black. Disconnect the vehicle battery cables. Disconnect the grounded terminal (negative), then the ungrounded terminal (positive) before removing the battery. Remove the battery from the vehicle. Some vehicles require that you remove the battery before charging, others do not. Follow the instructions provided in your owner’s manual or with your battery. Typically if the battery you’re charging is for a boat, you must take the battery out of the boat and charge it on shore. You can charge the battery inside the boat only if you have a charger and other equipment that is specifically meant for doing so. Using a battery carrier to move the battery from the vehicle to the place where you will connect it to the charger is recommended. This will avoid putting pressure on the battery ends and forcing battery acid out of the vent caps, as might happen if you carry it in your hands. Hooking Up the Charger Clean the battery terminals. Use a mixture of baking soda and water to clean any corrosion off the terminals and neutralize any sulfuric acid that may have spilled on them. You can apply the mixture with an old toothbrush. Alternatively, you can clean off mild corrosion by using a wire brush. Auto parts stores even sell a special round wire brush that fits over the terminals. Do not touch your eyes, nose, or mouth right after cleaning the terminals. Wash your hands immediately. Do not touch any white gunk that may appear on the terminals, as this is congealed sulfuric acid. Pour in enough distilled water to reach the fill level on each battery cell. Pouring water into your battery cells disperses hydrogen gas from the cell. Do not use tap water as it will damage your battery over time. Replace the cell caps after filling. Most U.S. batteries, they are equipped with flame arrestors. If your battery does not have flame-arresting caps, put a wet cloth across the top of the caps. If you have a battery that does not need filled with water (known as maintenance free batteries) or if your battery caps are sealed then you should ignore this step and follow the manufacturer’s instructions for charging your battery. Place the charger as far from the battery as its cables will allow. This will reduce the possibility of damage to the unit from any airborne sulfuric acid vapor. Never place the charger directly above or below the battery. Set the charger to deliver the correct voltage. This is done by adjusting the voltage output selector, usually on the front of the charging unit. If the required voltage isn’t posted on the battery case itself, it should be in the vehicle owner’s manual. If your charger has an adjustable rate of charge you should start at the lowest rate. Connect one charger clip to the positive post on the battery. This step is the same whether the battery is removed from the vehicle for charging or not. Connect the second charger clip to ground. There are two different cases for connecting the ground. If the battery has not been removed from the vehicle, connect the battery charger’s grounding cable to a heavy-gauge metal part of the engine block or chassis. This prevents arcing at the battery terminal and will not run the risk of causing the battery to explode. Clipping the grounding cable directly to the negative battery terminal can be dangerous. If the battery has been removed from the vehicle, you should connect a jumper cable or insulated battery cable at least 24 inches (60 cm) long to the grounded post. Then, connect the battery charger clip for the grounded post to this cable. This allows you to be away from the battery when you complete the circuit in case it explodes. It is also a good idea not to be facing the battery when you connect the charger to the jumper cable. Plug the charger into an outlet. The charger should be equipped with a grounded plug (three pronged plug) and should be plugged into a properly grounded outlet (three prong outlet). An adapter should not be used. Use an extension cord only if absolutely necessary. If an extension cord is necessary, it should be a grounded (three pronged) extension cord and be the proper wire size to accommodate the amperage of the charger. An adapter should not be used between the charger and extension cord or the extension cord and the wall. Leave the battery on the charger until the battery is fully charged. You can tell this by using the recommended charging time for your battery or looking to see if the charge indicator shows the battery has been fully charged. Disconnecting the Charger Unplug the charger. Once your battery is fully charged, you will need to systematically unhook your components. Start by unplugging the charger from the outlet. Disconnect the charger grounding clip from the battery. Disconnect from the grounded terminal first. Again, this will be the negative terminal on the battery if the battery was removed and will be the clip attached to a metal component of the vehicle if the battery was not removed. Disconnect the positive clip from the battery. This will be the clip on the positive battery post. Some battery chargers have an engine starting feature. If your battery charger has one, you can leave it connected to the battery when you start the vehicle’s engine; if not, you must disconnect the charger before you start the engine. In either case, avoid moving engine parts if you start the engine with the hood raised or cover removed. Re-install the battery. This will only be necessary if you had to remove your battery for charging. Reconnect the battery cables. Connect to the ungrounded (positive) terminal first, then to the grounded (negative) terminal.",
    "sentences": [
        " Preparing to Charge Your Battery Read the specifications for your battery.",
        "Start with the owner’s manual if your battery is original to the car.",
        "This should answer important questions such as what the voltage requirements are for charging your battery and whether or not you should remove it from the vehicle before charging.",
        "Almost all car batteries are 12 volt, but the charging voltage can vary depending on the amount of charge your battery currently has and the temperature.",
        "Read the specifications for your battery charger.",
        "There will be a manual with your battery charger that provides details for the appropriate use of the charger.",
        "Choose a well-ventilated work area.",
        "Working in a well-ventilated area will help dissipate the hydrogen gas that batteries generate from the sulfuric acid within their cells.",
        "Also, make sure to keep any other volatile substances, such as gasoline, flammable materials, or ignition sources (flames, cigarettes, matches, lighters) away from the battery at all times.",
        "Put on protective gear.",
        "Glasses, gloves, and other protective gear is a good precaution.",
        "Hydrogen released within the battery quickly converts to a gas and expands, this can cause the battery to explode if venting mechanisms fail.",
        "Once the hydrogen is in contact with the oxygen in the air, it is highly flammable and can be ignited even by static electricity.",
        "Turn off all vehicle accessories.",
        "These accessories draw power from the battery and should be turned off before removing or charging the battery.",
        "Locate your battery.",
        "Most batteries will be found either under the hood of the vehicle or in the trunk.",
        "It is also possible that your battery may be under the rear seat, and sometimes the battery can only be accessed from underneath the side of the car.",
        "Identify the positive and grounded posts on your battery.",
        "One post will be grounded by being connected to the vehicle’s chassis.",
        "The other post will be “hot,” meaning that current will flow from it to the grounded post in a circuit.",
        "There are a few ways to tell which is which:\nLook for labels such as “POS,” “P,” or “+” for the positive post and “NEG,” “N,” or “-“ for the negative (grounded) posts on the battery case.",
        "Compare the diameters of the battery posts.",
        "For most batteries, the positive post is thicker than the negative post.",
        "If the battery cables are connected to the posts, note the color of the cables.",
        "The cable connected to the positive post should be red, while the cable connected to the negative post should be black.",
        "Disconnect the vehicle battery cables.",
        "Disconnect the grounded terminal (negative), then the ungrounded terminal (positive) before removing the battery.",
        "Remove the battery from the vehicle.",
        "Some vehicles require that you remove the battery before charging, others do not.",
        "Follow the instructions provided in your owner’s manual or with your battery.",
        "Typically if the battery you’re charging is for a boat, you must take the battery out of the boat and charge it on shore.",
        "You can charge the battery inside the boat only if you have a charger and other equipment that is specifically meant for doing so.",
        "Using a battery carrier to move the battery from the vehicle to the place where you will connect it to the charger is recommended.",
        "This will avoid putting pressure on the battery ends and forcing battery acid out of the vent caps, as might happen if you carry it in your hands.",
        "Hooking Up the Charger Clean the battery terminals.",
        "Use a mixture of baking soda and water to clean any corrosion off the terminals and neutralize any sulfuric acid that may have spilled on them.",
        "You can apply the mixture with an old toothbrush.",
        "Alternatively, you can clean off mild corrosion by using a wire brush.",
        "Auto parts stores even sell a special round wire brush that fits over the terminals.",
        "Do not touch your eyes, nose, or mouth right after cleaning the terminals.",
        "Wash your hands immediately.",
        "Do not touch any white gunk that may appear on the terminals, as this is congealed sulfuric acid.",
        "Pour in enough distilled water to reach the fill level on each battery cell.",
        "Pouring water into your battery cells disperses hydrogen gas from the cell.",
        "Do not use tap water as it will damage your battery over time.",
        "Replace the cell caps after filling.",
        "Most U.S. batteries, they are equipped with flame arrestors.",
        "If your battery does not have flame-arresting caps, put a wet cloth across the top of the caps.",
        "If you have a battery that does not need filled with water (known as maintenance free batteries) or if your battery caps are sealed then you should ignore this step and follow the manufacturer’s instructions for charging your battery.",
        "Place the charger as far from the battery as its cables will allow.",
        "This will reduce the possibility of damage to the unit from any airborne sulfuric acid vapor.",
        "Never place the charger directly above or below the battery.",
        "Set the charger to deliver the correct voltage.",
        "This is done by adjusting the voltage output selector, usually on the front of the charging unit.",
        "If the required voltage isn’t posted on the battery case itself, it should be in the vehicle owner’s manual.",
        "If your charger has an adjustable rate of charge you should start at the lowest rate.",
        "Connect one charger clip to the positive post on the battery.",
        "This step is the same whether the battery is removed from the vehicle for charging or not.",
        "Connect the second charger clip to ground.",
        "There are two different cases for connecting the ground.",
        "If the battery has not been removed from the vehicle, connect the battery charger’s grounding cable to a heavy-gauge metal part of the engine block or chassis.",
        "This prevents arcing at the battery terminal and will not run the risk of causing the battery to explode.",
        "Clipping the grounding cable directly to the negative battery terminal can be dangerous.",
        "If the battery has been removed from the vehicle, you should connect a jumper cable or insulated battery cable at least 24 inches (60 cm) long to the grounded post.",
        "Then, connect the battery charger clip for the grounded post to this cable.",
        "This allows you to be away from the battery when you complete the circuit in case it explodes.",
        "It is also a good idea not to be facing the battery when you connect the charger to the jumper cable.",
        "Plug the charger into an outlet.",
        "The charger should be equipped with a grounded plug (three pronged plug) and should be plugged into a properly grounded outlet (three prong outlet).",
        "An adapter should not be used.",
        "Use an extension cord only if absolutely necessary.",
        "If an extension cord is necessary, it should be a grounded (three pronged) extension cord and be the proper wire size to accommodate the amperage of the charger.",
        "An adapter should not be used between the charger and extension cord or the extension cord and the wall.",
        "Leave the battery on the charger until the battery is fully charged.",
        "You can tell this by using the recommended charging time for your battery or looking to see if the charge indicator shows the battery has been fully charged.",
        "Disconnecting the Charger Unplug the charger.",
        "Once your battery is fully charged, you will need to systematically unhook your components.",
        "Start by unplugging the charger from the outlet.",
        "Disconnect the charger grounding clip from the battery.",
        "Disconnect from the grounded terminal first.",
        "Again, this will be the negative terminal on the battery if the battery was removed and will be the clip attached to a metal component of the vehicle if the battery was not removed.",
        "Disconnect the positive clip from the battery.",
        "This will be the clip on the positive battery post.",
        "Some battery chargers have an engine starting feature.",
        "If your battery charger has one, you can leave it connected to the battery when you start the vehicle’s engine; if not, you must disconnect the charger before you start the engine.",
        "In either case, avoid moving engine parts if you start the engine with the hood raised or cover removed.",
        "Re-install the battery.",
        "This will only be necessary if you had to remove your battery for charging.",
        "Reconnect the battery cables.",
        "Connect to the ungrounded (positive) terminal first, then to the grounded (negative) terminal."
    ]
}