{
    "title": "How to Make Diffuser Oil",
    "url": "https://www.wikihow.com/Make-Diffuser-Oil",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills"
    ],
    "methods": [
        {
            "name": "Making a Blend for Reed Diffusers",
            "steps": [
                {
                    "headline": "Choose a light, carrier oil to use as your base.",
                    "description": "You can use just about any type of lightweight oil, such as coconut oil, safflower oil, or sweet almond oil. Avoid using solid coconut oil, and other heavy oils, such as extra virgin olive oil and jojoba oil; they will take too long to travel up the diffuser. This method is intended for reed-based diffusers. Do not use it for plug-in diffusers."
                },
                {
                    "headline": "Pour ¼ cup (60 milliliters) of your carrier oil into a glass bottle.",
                    "description": "Stick a funnel into the neck of the bottle first, so that you don't spill and waste any oil."
                },
                {
                    "headline": "Add 20 to 30 drops of your favorite essential oil.",
                    "description": "Lavender, lemon, mint, tea tree, and vanilla are all popular individual choices, but you can combine different oils to create a more unique fragrance. Here are some combinations to get you started:\nBergamot and patchouli\nCinnamon and wild orange\nLavender and eucalyptus\nLavender, lemon, and rosemary\nWhite fir and cypress"
                },
                {
                    "headline": "Consider adding 1 teaspoon of rubbing alcohol to help bind the water to the essential oil.",
                    "description": "This will also help the oil travel faster up the bamboo reeds. Choose something that is at least 90%. Vodka can be used in place of rubbing alcohol."
                },
                {
                    "headline": "Close the bottle, and shake it to mix.",
                    "description": "This will help the different oils (and rubbing alcohol, if you are using it) to blend together instead of just floating on top of each other."
                },
                {
                    "headline": "Use the diffuser oil.",
                    "description": "If your bottle has a narrow neck, you can simply insert some bamboo skewers into it. You can also pour it into your reed diffuser bottle, but make sure that it is clean and all traces of the previous fragrance have been washed out. When inserting reeds into the bottle, make sure that they are new. Do not reuse old reeds."
                }
            ]
        },
        {
            "name": "Making a Blend for Plug-In Diffusers",
            "steps": [
                {
                    "headline": "Find an empty, plug-in diffuser.",
                    "description": "This method is intended for those small diffusers that you plug into your wall. They are about the same size as nightlights and have a small glass jar or bulb attached to the bottom."
                },
                {
                    "headline": "Unscrew the glass bulb from the body of the diffuser.",
                    "description": "In most cases, you will need to twist the bulb counterclockwise."
                },
                {
                    "headline": "Use a butter knife or flat screwdriver to pop the cap and wick out.",
                    "description": "Slide your tool under the cap, and press down on the handle. This will help pop the cap out. Some wicks may have a nail inserted through them. In this case, you may need to use a pair of needle-nose pliers to pry it out."
                },
                {
                    "headline": "Rinse the bottle out and let it dry so that the scents don't mix.",
                    "description": "It might also be a good idea to rinse the wick out as well (be sure to squeeze it to get any residual oil out) and let it dry as well. Be aware that some wicks have a sharp nail poked through them."
                },
                {
                    "headline": "Add 20 drops of essential oil into the diffuser.",
                    "description": "Cinnamon, lavender, lemon, orange, and vanilla are all popular choices, but you can also use other types as well. You can even combine different oils to create your own unique scent. Some of the oil scent will remain. When adding a new scent, consider using something that is similar to the old one. This will ensure that you don't end up with something that smells unpleasant."
                },
                {
                    "headline": "Fill the diffuser with water, but leave some space at the top.",
                    "description": "You need that extra space for the wick. If you are using a bulb-shaped diffuser, then fill it to just below the widest point."
                },
                {
                    "headline": "Put the cap back on.",
                    "description": "If you took the wick out of the cap, then put it back in first. Try to pop the cap straight down, applying even pressure. Wiggling it back and forth will not be as effective."
                },
                {
                    "headline": "Twist the bulb back into the body of your diffuser, and give the diffuser a good shake.",
                    "description": "This will blend the oil and water together. Don't worry if your mixture looks cloudy; this is normal, because you are using essential oils."
                },
                {
                    "headline": "Plug the diffuser into the wall.",
                    "description": "The fragrance will be more subtle than the store bought fragrance because you are using natural, essential oils. It will take only a fraction of the cost to make, however!"
                }
            ]
        }
    ],
    "tyn": [
        "Making a Blend for Reed Diffusers",
        "¼ cup (60 milliliters) light oil (ie: fractionated coconut oil, sweet almond oil, or safflower oil.)",
        "20 to 30 drops essential oil(s)",
        "1 teaspoon rubbing alcohol (optional)",
        "Funnel",
        "Glass bottle",
        "Making a Blend for Plug-In Diffusers",
        "Water",
        "Essential oil",
        "Plug-In diffuser",
        "Butter knife or flat screwdriver",
        "Needle-nose pliers (optional)"
    ],
    "text": " Making a Blend for Reed Diffusers Choose a light, carrier oil to use as your base. You can use just about any type of lightweight oil, such as coconut oil, safflower oil, or sweet almond oil. Avoid using solid coconut oil, and other heavy oils, such as extra virgin olive oil and jojoba oil; they will take too long to travel up the diffuser. This method is intended for reed-based diffusers. Do not use it for plug-in diffusers. Pour ¼ cup (60 milliliters) of your carrier oil into a glass bottle. Stick a funnel into the neck of the bottle first, so that you don't spill and waste any oil. Add 20 to 30 drops of your favorite essential oil. Lavender, lemon, mint, tea tree, and vanilla are all popular individual choices, but you can combine different oils to create a more unique fragrance. Here are some combinations to get you started:\nBergamot and patchouli\nCinnamon and wild orange\nLavender and eucalyptus\nLavender, lemon, and rosemary\nWhite fir and cypress Consider adding 1 teaspoon of rubbing alcohol to help bind the water to the essential oil. This will also help the oil travel faster up the bamboo reeds. Choose something that is at least 90%. Vodka can be used in place of rubbing alcohol. Close the bottle, and shake it to mix. This will help the different oils (and rubbing alcohol, if you are using it) to blend together instead of just floating on top of each other. Use the diffuser oil. If your bottle has a narrow neck, you can simply insert some bamboo skewers into it. You can also pour it into your reed diffuser bottle, but make sure that it is clean and all traces of the previous fragrance have been washed out. When inserting reeds into the bottle, make sure that they are new. Do not reuse old reeds. Making a Blend for Plug-In Diffusers Find an empty, plug-in diffuser. This method is intended for those small diffusers that you plug into your wall. They are about the same size as nightlights and have a small glass jar or bulb attached to the bottom. Unscrew the glass bulb from the body of the diffuser. In most cases, you will need to twist the bulb counterclockwise. Use a butter knife or flat screwdriver to pop the cap and wick out. Slide your tool under the cap, and press down on the handle. This will help pop the cap out. Some wicks may have a nail inserted through them. In this case, you may need to use a pair of needle-nose pliers to pry it out. Rinse the bottle out and let it dry so that the scents don't mix. It might also be a good idea to rinse the wick out as well (be sure to squeeze it to get any residual oil out) and let it dry as well. Be aware that some wicks have a sharp nail poked through them. Add 20 drops of essential oil into the diffuser. Cinnamon, lavender, lemon, orange, and vanilla are all popular choices, but you can also use other types as well. You can even combine different oils to create your own unique scent. Some of the oil scent will remain. When adding a new scent, consider using something that is similar to the old one. This will ensure that you don't end up with something that smells unpleasant. Fill the diffuser with water, but leave some space at the top. You need that extra space for the wick. If you are using a bulb-shaped diffuser, then fill it to just below the widest point. Put the cap back on. If you took the wick out of the cap, then put it back in first. Try to pop the cap straight down, applying even pressure. Wiggling it back and forth will not be as effective. Twist the bulb back into the body of your diffuser, and give the diffuser a good shake. This will blend the oil and water together. Don't worry if your mixture looks cloudy; this is normal, because you are using essential oils. Plug the diffuser into the wall. The fragrance will be more subtle than the store bought fragrance because you are using natural, essential oils. It will take only a fraction of the cost to make, however!",
    "sentences": [
        " Making a Blend for Reed Diffusers Choose a light, carrier oil to use as your base.",
        "You can use just about any type of lightweight oil, such as coconut oil, safflower oil, or sweet almond oil.",
        "Avoid using solid coconut oil, and other heavy oils, such as extra virgin olive oil and jojoba oil; they will take too long to travel up the diffuser.",
        "This method is intended for reed-based diffusers.",
        "Do not use it for plug-in diffusers.",
        "Pour ¼ cup (60 milliliters) of your carrier oil into a glass bottle.",
        "Stick a funnel into the neck of the bottle first, so that you don't spill and waste any oil.",
        "Add 20 to 30 drops of your favorite essential oil.",
        "Lavender, lemon, mint, tea tree, and vanilla are all popular individual choices, but you can combine different oils to create a more unique fragrance.",
        "Here are some combinations to get you started:\nBergamot and patchouli\nCinnamon and wild orange\nLavender and eucalyptus\nLavender, lemon, and rosemary\nWhite fir and cypress Consider adding 1 teaspoon of rubbing alcohol to help bind the water to the essential oil.",
        "This will also help the oil travel faster up the bamboo reeds.",
        "Choose something that is at least 90%.",
        "Vodka can be used in place of rubbing alcohol.",
        "Close the bottle, and shake it to mix.",
        "This will help the different oils (and rubbing alcohol, if you are using it) to blend together instead of just floating on top of each other.",
        "Use the diffuser oil.",
        "If your bottle has a narrow neck, you can simply insert some bamboo skewers into it.",
        "You can also pour it into your reed diffuser bottle, but make sure that it is clean and all traces of the previous fragrance have been washed out.",
        "When inserting reeds into the bottle, make sure that they are new.",
        "Do not reuse old reeds.",
        "Making a Blend for Plug-In Diffusers Find an empty, plug-in diffuser.",
        "This method is intended for those small diffusers that you plug into your wall.",
        "They are about the same size as nightlights and have a small glass jar or bulb attached to the bottom.",
        "Unscrew the glass bulb from the body of the diffuser.",
        "In most cases, you will need to twist the bulb counterclockwise.",
        "Use a butter knife or flat screwdriver to pop the cap and wick out.",
        "Slide your tool under the cap, and press down on the handle.",
        "This will help pop the cap out.",
        "Some wicks may have a nail inserted through them.",
        "In this case, you may need to use a pair of needle-nose pliers to pry it out.",
        "Rinse the bottle out and let it dry so that the scents don't mix.",
        "It might also be a good idea to rinse the wick out as well (be sure to squeeze it to get any residual oil out) and let it dry as well.",
        "Be aware that some wicks have a sharp nail poked through them.",
        "Add 20 drops of essential oil into the diffuser.",
        "Cinnamon, lavender, lemon, orange, and vanilla are all popular choices, but you can also use other types as well.",
        "You can even combine different oils to create your own unique scent.",
        "Some of the oil scent will remain.",
        "When adding a new scent, consider using something that is similar to the old one.",
        "This will ensure that you don't end up with something that smells unpleasant.",
        "Fill the diffuser with water, but leave some space at the top.",
        "You need that extra space for the wick.",
        "If you are using a bulb-shaped diffuser, then fill it to just below the widest point.",
        "Put the cap back on.",
        "If you took the wick out of the cap, then put it back in first.",
        "Try to pop the cap straight down, applying even pressure.",
        "Wiggling it back and forth will not be as effective.",
        "Twist the bulb back into the body of your diffuser, and give the diffuser a good shake.",
        "This will blend the oil and water together.",
        "Don't worry if your mixture looks cloudy; this is normal, because you are using essential oils.",
        "Plug the diffuser into the wall.",
        "The fragrance will be more subtle than the store bought fragrance because you are using natural, essential oils.",
        "It will take only a fraction of the cost to make, however!"
    ]
}