{
    "title": "How to Make a Moss Table",
    "url": "https://www.wikihow.com/Make-a-Moss-Table",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening"
    ],
    "parts": [
        {
            "name": "Obtaining the materials",
            "steps": [
                {
                    "headline": "Buy a cocktail table with a center piece of glass.",
                    "description": ""
                },
                {
                    "headline": "Buy some mood moss, sheet moss, and deer moss.",
                    "description": "Having different types of moss will allow you to create a variety of colors."
                }
            ]
        },
        {
            "name": "Preparing the moss holding base",
            "steps": [
                {
                    "headline": "Buy some plywood for under the table, with pieces also for the sides.",
                    "description": "Measure the pieces to fit under the glass-top area of the table – one base piece and four sides measuring the same length as the table. Making the sides deeper is better, to create a feeling of depth. Form the base from the plywood for the moss to be assembled on and attached under the coffee table. Measure twice, cut once."
                },
                {
                    "headline": "Attach the plywood base to the underside of the table.",
                    "description": "Use L wood brackets and some very small screws to keep the holding base in place. You can purchase thin pieces of wood veneer to include in the design."
                }
            ]
        },
        {
            "name": "Making the moss design",
            "steps": [
                {
                    "headline": "Decide how you would like to place the pieces of moss in the holding base.",
                    "description": "Choose to put different colors alongside each other, to vary the appearance of the moss, and include such additions as pieces of driftwood or branches, to create visual breaks and interesting effects. Use a good pair of scissors to cut moss into the shapes desired."
                },
                {
                    "headline": "Add Styrofoam pieces underneath the moss pieces.",
                    "description": "Doing this will help to create a raised effect. This can be done here and there or all the way across, depending on the design you're aiming for."
                },
                {
                    "headline": "Add decorative sand for the third element.",
                    "description": "The sand can be placed in gaps, to add more visual appeal and a color variant. It can also help bring forth the landscape effect."
                },
                {
                    "headline": "Keep adding the design pieces.",
                    "description": "Make adjustments as you go until you're happy with the design."
                },
                {
                    "headline": "Attach the glass on the top.",
                    "description": "Note the side table; this is how the cocktail table looked initially."
                },
                {
                    "headline": "Done.",
                    "description": "Now you have a beautiful moss table."
                }
            ]
        }
    ],
    "tyn": [
        "Cocktail table with a glass centerpiece",
        "Mood moss, sheet moss, and deer moss",
        "Plywood to make the table moss holding base",
        "Veneer wood",
        "Glue",
        "Styrofoam",
        "Decorative sand",
        "Driftwood or branches, etc.",
        "Scissors"
    ],
    "text": " Obtaining the materials Buy a cocktail table with a center piece of glass.  Buy some mood moss, sheet moss, and deer moss. Having different types of moss will allow you to create a variety of colors. Preparing the moss holding base Buy some plywood for under the table, with pieces also for the sides. Measure the pieces to fit under the glass-top area of the table – one base piece and four sides measuring the same length as the table. Making the sides deeper is better, to create a feeling of depth. Form the base from the plywood for the moss to be assembled on and attached under the coffee table. Measure twice, cut once. Attach the plywood base to the underside of the table. Use L wood brackets and some very small screws to keep the holding base in place. You can purchase thin pieces of wood veneer to include in the design. Making the moss design Decide how you would like to place the pieces of moss in the holding base. Choose to put different colors alongside each other, to vary the appearance of the moss, and include such additions as pieces of driftwood or branches, to create visual breaks and interesting effects. Use a good pair of scissors to cut moss into the shapes desired. Add Styrofoam pieces underneath the moss pieces. Doing this will help to create a raised effect. This can be done here and there or all the way across, depending on the design you're aiming for. Add decorative sand for the third element. The sand can be placed in gaps, to add more visual appeal and a color variant. It can also help bring forth the landscape effect. Keep adding the design pieces. Make adjustments as you go until you're happy with the design. Attach the glass on the top. Note the side table; this is how the cocktail table looked initially. Done. Now you have a beautiful moss table.",
    "sentences": [
        " Obtaining the materials Buy a cocktail table with a center piece of glass.",
        "Buy some mood moss, sheet moss, and deer moss.",
        "Having different types of moss will allow you to create a variety of colors.",
        "Preparing the moss holding base Buy some plywood for under the table, with pieces also for the sides.",
        "Measure the pieces to fit under the glass-top area of the table – one base piece and four sides measuring the same length as the table.",
        "Making the sides deeper is better, to create a feeling of depth.",
        "Form the base from the plywood for the moss to be assembled on and attached under the coffee table.",
        "Measure twice, cut once.",
        "Attach the plywood base to the underside of the table.",
        "Use L wood brackets and some very small screws to keep the holding base in place.",
        "You can purchase thin pieces of wood veneer to include in the design.",
        "Making the moss design Decide how you would like to place the pieces of moss in the holding base.",
        "Choose to put different colors alongside each other, to vary the appearance of the moss, and include such additions as pieces of driftwood or branches, to create visual breaks and interesting effects.",
        "Use a good pair of scissors to cut moss into the shapes desired.",
        "Add Styrofoam pieces underneath the moss pieces.",
        "Doing this will help to create a raised effect.",
        "This can be done here and there or all the way across, depending on the design you're aiming for.",
        "Add decorative sand for the third element.",
        "The sand can be placed in gaps, to add more visual appeal and a color variant.",
        "It can also help bring forth the landscape effect.",
        "Keep adding the design pieces.",
        "Make adjustments as you go until you're happy with the design.",
        "Attach the glass on the top.",
        "Note the side table; this is how the cocktail table looked initially.",
        "Done.",
        "Now you have a beautiful moss table."
    ]
}