{
    "title": "How to Hang Voile",
    "url": "https://www.wikihow.com/Hang-Voile",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Doors and Windows",
        "Window Treatments",
        "Curtains"
    ],
    "methods": [
        {
            "name": "Hanging Voile on a Curtain Rod",
            "steps": [
                {
                    "headline": "Install curtain brackets above your window.",
                    "description": "Place your brackets at least 2 in (5.1 cm) above the top of your window, and 6 in (15 cm) out from each side. Make sure the brackets are level so your curtain rod runs horizontally. Use a drill with a screwdriver attachment to secure the brackets in place. Once they’re installed, set the curtain rod on top of the bracket. If you can’t drill into your walls, you can also use adhesive-backed hooks to hold the curtain rod. Put them in the same position as you would the brackets and allow them to set on the wall for at least 1 hour. If you have a recessed window, you can also use a tension rod inside of the window well. Twist the tension rod until it’s ⁄2 in (1.3 cm) wider than the window. Use a double curtain rod if you want to hang voile behind a different type of curtain. That way, you can close a thicker curtain over the voile to get more privacy.Tip: If you want to make your ceilings look like they’re taller, hang your curtain rods closer to the ceiling instead of just above the window."
                },
                {
                    "headline": "Get voile curtains that are twice the width of the window.",
                    "description": "Curtains that are the same size as your window look flat whenever they’re closed. Look for a voile curtain that is at least 2 times as wide as your window and long enough to reach down to your floor. Get 2 voile panels if you want curtains that open up in the middle. Each panel should be as wide as the full width of the window."
                },
                {
                    "headline": "Put hooks into every fourth pocket along the top of the voile.",
                    "description": "Most curtains have small pockets or holes running along the top of them. Place a hook in the first pocket on one side of your curtain, and then add another hook every 4 pockets after that. Work your way across the voile until you reach the other side of the curtain. You can buy curtain hooks from any home goods store. If your voile curtain doesn’t have holes or pockets, then it will have an area on top where you can easily slide the curtain rod through it."
                },
                {
                    "headline": "Slide the voile curtain onto the curtain rod.",
                    "description": "Once the hooks are attached to your voile, unscrew the end of your curtain rod so the cap comes off. Slide the hooks over the rod until you’ve put on the entire curtain. If you’re using 2 curtain panels, slide the second panel on as well. Screw the cap back onto the end of the rod once you’re finished."
                },
                {
                    "headline": "Hang the rod in the brackets.",
                    "description": "Set the rod on top of the brackets so it’s held securely in place. Some brackets may have a screw that you can use to keep your rod from moving around while it’s hanging, so be sure to tighten it with a screwdriver. Spread out your voile curtain so it covers the window entirely. If you’re using a tension rod to hang your voile, slide one end of the rod into the window well and shimmy the other side in until it feels tight against the sides."
                }
            ]
        },
        {
            "name": "Draping a Voile Window Scarf",
            "steps": [
                {
                    "headline": "Hang hooks on either side of your window.",
                    "description": "Measure 6 in (15 cm) out from each side your window and 2 in (5.1 cm) above the top of the window so to place your hooks. Install the hooks so they’re level with one another or else your voile will hang crooked when you drape it. You can screw decorative hooks, or finials, into your wall or you can use adhesive-backed hooks if you don’t want to cause any wall damage. Make sure to get hooks that match the aesthetic of your room."
                },
                {
                    "headline": "Measure the height and distance between the hooks to size your voile.",
                    "description": "Use a tape measure to find the length from the floor up to the top of your hooks. Then measure how far apart your hooks are. Multiply the height you found by 2 and add that product to the distance between your hooks. Add about 12 in (30 cm) to that length so you can drape the voile without pulling it too tight."
                },
                {
                    "headline": "Drape the voile over the hooks so it frames your window.",
                    "description": "Stand on a step ladder to drape the voile over the top of the first hook. Move the ladder to the other hook so you can put the voile over it. Lightly pull on the ends of the voile to adjust the lengths on each side until they’re symmetrical. You may also set a curtain rod on the hooks and loop the voile around the center of the rod. This can add a small decorative touch to the top of your window."
                },
                {
                    "headline": "Tie the voile to the hook with yarn or thread.",
                    "description": "When you’re happy with how one side of the voile hangs, tie a knot around the hook and voile so it doesn’t move. Be sure the thread or yarn you use is the same color as the voile so it doesn’t clash. Keep the knot tight enough where it holds the voile in place, but loose enough so you can still make adjustments if you need to. You don’t have to tie the voile to the hook if you don’t want to.Tip: Tying your voile to the hook is a great solution if you have small children or pets that may pull on the hanging fabric."
                },
                {
                    "headline": "Adjust the voile from the untied side until you’re happy with how it hangs.",
                    "description": "Pull on the end of the voile that isn’t tied to change how far it drapes in the center of your window. Make sure the voile isn’t pulled tight across the top of the window, or else it won’t look as nice. Take a few steps back from the window and look at it after you make an adjustment to see if you’re happy with how it hangs."
                },
                {
                    "headline": "Tie the voile around your second hook to secure it in place.",
                    "description": "Use the same type of knot you used on the other hook so your voile doesn’t move around. Make sure the thread or yarn you use doesn’t have any elasticity, or else it may stretch and start to sag. Secure the knot tight enough so the voile doesn’t fall, but so you can still make changes to the length if you need to. Use thread that’s the same color as your voile so it’s not visible."
                }
            ]
        }
    ],
    "tyn": [
        "Putting Voile on a Curtain Rod",
        "Curtain brackets",
        "Drill",
        "Curtain rod",
        "Voile curtain",
        "Curtain hooks",
        "Draping a Voile Window Scarf",
        "Decorative hooks",
        "Tape measure",
        "Voile",
        "Step ladder",
        "Yarn or thread"
    ],
    "text": " Hanging Voile on a Curtain Rod Install curtain brackets above your window. Place your brackets at least 2 in (5.1 cm) above the top of your window, and 6 in (15 cm) out from each side. Make sure the brackets are level so your curtain rod runs horizontally. Use a drill with a screwdriver attachment to secure the brackets in place. Once they’re installed, set the curtain rod on top of the bracket. If you can’t drill into your walls, you can also use adhesive-backed hooks to hold the curtain rod. Put them in the same position as you would the brackets and allow them to set on the wall for at least 1 hour. If you have a recessed window, you can also use a tension rod inside of the window well. Twist the tension rod until it’s ⁄2 in (1.3 cm) wider than the window. Use a double curtain rod if you want to hang voile behind a different type of curtain. That way, you can close a thicker curtain over the voile to get more privacy.Tip: If you want to make your ceilings look like they’re taller, hang your curtain rods closer to the ceiling instead of just above the window. Get voile curtains that are twice the width of the window. Curtains that are the same size as your window look flat whenever they’re closed. Look for a voile curtain that is at least 2 times as wide as your window and long enough to reach down to your floor. Get 2 voile panels if you want curtains that open up in the middle. Each panel should be as wide as the full width of the window. Put hooks into every fourth pocket along the top of the voile. Most curtains have small pockets or holes running along the top of them. Place a hook in the first pocket on one side of your curtain, and then add another hook every 4 pockets after that. Work your way across the voile until you reach the other side of the curtain. You can buy curtain hooks from any home goods store. If your voile curtain doesn’t have holes or pockets, then it will have an area on top where you can easily slide the curtain rod through it. Slide the voile curtain onto the curtain rod. Once the hooks are attached to your voile, unscrew the end of your curtain rod so the cap comes off. Slide the hooks over the rod until you’ve put on the entire curtain. If you’re using 2 curtain panels, slide the second panel on as well. Screw the cap back onto the end of the rod once you’re finished. Hang the rod in the brackets. Set the rod on top of the brackets so it’s held securely in place. Some brackets may have a screw that you can use to keep your rod from moving around while it’s hanging, so be sure to tighten it with a screwdriver. Spread out your voile curtain so it covers the window entirely. If you’re using a tension rod to hang your voile, slide one end of the rod into the window well and shimmy the other side in until it feels tight against the sides. Draping a Voile Window Scarf Hang hooks on either side of your window. Measure 6 in (15 cm) out from each side your window and 2 in (5.1 cm) above the top of the window so to place your hooks. Install the hooks so they’re level with one another or else your voile will hang crooked when you drape it. You can screw decorative hooks, or finials, into your wall or you can use adhesive-backed hooks if you don’t want to cause any wall damage. Make sure to get hooks that match the aesthetic of your room. Measure the height and distance between the hooks to size your voile. Use a tape measure to find the length from the floor up to the top of your hooks. Then measure how far apart your hooks are. Multiply the height you found by 2 and add that product to the distance between your hooks. Add about 12 in (30 cm) to that length so you can drape the voile without pulling it too tight. Drape the voile over the hooks so it frames your window. Stand on a step ladder to drape the voile over the top of the first hook. Move the ladder to the other hook so you can put the voile over it. Lightly pull on the ends of the voile to adjust the lengths on each side until they’re symmetrical. You may also set a curtain rod on the hooks and loop the voile around the center of the rod. This can add a small decorative touch to the top of your window. Tie the voile to the hook with yarn or thread. When you’re happy with how one side of the voile hangs, tie a knot around the hook and voile so it doesn’t move. Be sure the thread or yarn you use is the same color as the voile so it doesn’t clash. Keep the knot tight enough where it holds the voile in place, but loose enough so you can still make adjustments if you need to. You don’t have to tie the voile to the hook if you don’t want to.Tip: Tying your voile to the hook is a great solution if you have small children or pets that may pull on the hanging fabric. Adjust the voile from the untied side until you’re happy with how it hangs. Pull on the end of the voile that isn’t tied to change how far it drapes in the center of your window. Make sure the voile isn’t pulled tight across the top of the window, or else it won’t look as nice. Take a few steps back from the window and look at it after you make an adjustment to see if you’re happy with how it hangs. Tie the voile around your second hook to secure it in place. Use the same type of knot you used on the other hook so your voile doesn’t move around. Make sure the thread or yarn you use doesn’t have any elasticity, or else it may stretch and start to sag. Secure the knot tight enough so the voile doesn’t fall, but so you can still make changes to the length if you need to. Use thread that’s the same color as your voile so it’s not visible.",
    "sentences": [
        " Hanging Voile on a Curtain Rod Install curtain brackets above your window.",
        "Place your brackets at least 2 in (5.1 cm) above the top of your window, and 6 in (15 cm) out from each side.",
        "Make sure the brackets are level so your curtain rod runs horizontally.",
        "Use a drill with a screwdriver attachment to secure the brackets in place.",
        "Once they’re installed, set the curtain rod on top of the bracket.",
        "If you can’t drill into your walls, you can also use adhesive-backed hooks to hold the curtain rod.",
        "Put them in the same position as you would the brackets and allow them to set on the wall for at least 1 hour.",
        "If you have a recessed window, you can also use a tension rod inside of the window well.",
        "Twist the tension rod until it’s ⁄2 in (1.3 cm) wider than the window.",
        "Use a double curtain rod if you want to hang voile behind a different type of curtain.",
        "That way, you can close a thicker curtain over the voile to get more privacy.Tip: If you want to make your ceilings look like they’re taller, hang your curtain rods closer to the ceiling instead of just above the window.",
        "Get voile curtains that are twice the width of the window.",
        "Curtains that are the same size as your window look flat whenever they’re closed.",
        "Look for a voile curtain that is at least 2 times as wide as your window and long enough to reach down to your floor.",
        "Get 2 voile panels if you want curtains that open up in the middle.",
        "Each panel should be as wide as the full width of the window.",
        "Put hooks into every fourth pocket along the top of the voile.",
        "Most curtains have small pockets or holes running along the top of them.",
        "Place a hook in the first pocket on one side of your curtain, and then add another hook every 4 pockets after that.",
        "Work your way across the voile until you reach the other side of the curtain.",
        "You can buy curtain hooks from any home goods store.",
        "If your voile curtain doesn’t have holes or pockets, then it will have an area on top where you can easily slide the curtain rod through it.",
        "Slide the voile curtain onto the curtain rod.",
        "Once the hooks are attached to your voile, unscrew the end of your curtain rod so the cap comes off.",
        "Slide the hooks over the rod until you’ve put on the entire curtain.",
        "If you’re using 2 curtain panels, slide the second panel on as well.",
        "Screw the cap back onto the end of the rod once you’re finished.",
        "Hang the rod in the brackets.",
        "Set the rod on top of the brackets so it’s held securely in place.",
        "Some brackets may have a screw that you can use to keep your rod from moving around while it’s hanging, so be sure to tighten it with a screwdriver.",
        "Spread out your voile curtain so it covers the window entirely.",
        "If you’re using a tension rod to hang your voile, slide one end of the rod into the window well and shimmy the other side in until it feels tight against the sides.",
        "Draping a Voile Window Scarf Hang hooks on either side of your window.",
        "Measure 6 in (15 cm) out from each side your window and 2 in (5.1 cm) above the top of the window so to place your hooks.",
        "Install the hooks so they’re level with one another or else your voile will hang crooked when you drape it.",
        "You can screw decorative hooks, or finials, into your wall or you can use adhesive-backed hooks if you don’t want to cause any wall damage.",
        "Make sure to get hooks that match the aesthetic of your room.",
        "Measure the height and distance between the hooks to size your voile.",
        "Use a tape measure to find the length from the floor up to the top of your hooks.",
        "Then measure how far apart your hooks are.",
        "Multiply the height you found by 2 and add that product to the distance between your hooks.",
        "Add about 12 in (30 cm) to that length so you can drape the voile without pulling it too tight.",
        "Drape the voile over the hooks so it frames your window.",
        "Stand on a step ladder to drape the voile over the top of the first hook.",
        "Move the ladder to the other hook so you can put the voile over it.",
        "Lightly pull on the ends of the voile to adjust the lengths on each side until they’re symmetrical.",
        "You may also set a curtain rod on the hooks and loop the voile around the center of the rod.",
        "This can add a small decorative touch to the top of your window.",
        "Tie the voile to the hook with yarn or thread.",
        "When you’re happy with how one side of the voile hangs, tie a knot around the hook and voile so it doesn’t move.",
        "Be sure the thread or yarn you use is the same color as the voile so it doesn’t clash.",
        "Keep the knot tight enough where it holds the voile in place, but loose enough so you can still make adjustments if you need to.",
        "You don’t have to tie the voile to the hook if you don’t want to.Tip: Tying your voile to the hook is a great solution if you have small children or pets that may pull on the hanging fabric.",
        "Adjust the voile from the untied side until you’re happy with how it hangs.",
        "Pull on the end of the voile that isn’t tied to change how far it drapes in the center of your window.",
        "Make sure the voile isn’t pulled tight across the top of the window, or else it won’t look as nice.",
        "Take a few steps back from the window and look at it after you make an adjustment to see if you’re happy with how it hangs.",
        "Tie the voile around your second hook to secure it in place.",
        "Use the same type of knot you used on the other hook so your voile doesn’t move around.",
        "Make sure the thread or yarn you use doesn’t have any elasticity, or else it may stretch and start to sag.",
        "Secure the knot tight enough so the voile doesn’t fall, but so you can still make changes to the length if you need to.",
        "Use thread that’s the same color as your voile so it’s not visible."
    ]
}