{
    "title": "How to Remove Splinters in Children",
    "url": "https://www.wikihow.com/Remove-Splinters-in-Children",
    "category_hierarchy": [
        "Health",
        "First Aid and Emergency Health Care",
        "Foreign Objects First Aid"
    ],
    "methods": [
        {
            "name": "Keeping the Child Calm",
            "steps": [
                {
                    "headline": "Use a soothing voice to tell the child you can help them.",
                    "description": "A child is likely to be very upset about having a splinter, especially if it hurts even a little. They may also be apprehensive about you removing it, out of fear that it will hurt even more. Use your best “calming adult” voice to ease their anxiety. Clearly state that you’ll help them. For a small child, try something like: “Oh no, Molly has an ouchy splinter. Don’t worry, sweetie, Mommy will make the ouchy go away.”\nOr, for a child who’s a bit older: “Ow, I know splinters like that hurt, David. Let’s go wash up and I’ll take care of that for you.”"
                },
                {
                    "headline": "Hold a small child on your lap or a helper’s lap.",
                    "description": "Embracing the child on your lap is a good way to help calm them down. Also, if they’re being squirmy out of pain or anxiety, it will be easier for you to keep them a bit more still and steady this way. You may find it easier to have another trusted adult hold the child on their lap while you work to remove the splinter. However, it’s usually possible to do the entire job yourself."
                },
                {
                    "headline": "Explain the process or distract them, depending on the child.",
                    "description": "Some kids may want to know exactly what’s happening and watch you work. In this case, explain what you’ll be doing step-by-step. Other kids, though, will do much better if their mind is elsewhere. Keep your explanation simple: \"I'm going to clean off my hands and your skin, then clean the tweezers. After that, I'll use the tweezers to pinch that tiny bit of the splinter that's sticking out. Then I'll pull the whole splinter out. You won't feel a thing!\" To distract the child, sing some favorite songs together or play a game like “I spy.” Or, if necessary, turn on the TV or your tablet. Use your best judgment to determine if a child is better off with explanations or distractions."
                },
                {
                    "headline": "Call the doctor for deep, large, or poorly-located splinters.",
                    "description": "If the splinter is a large shard that has caused a significant puncture, or if it is embedded deep under the skin, leave it in place and call your child’s doctor. Or, if any type of splinter is near a sensitive area—most especially in or near an eye—call the doctor as soon as possible. It’s difficult to quantify when a splinter becomes “too big” or “too deep” to remove on your own. It may be best to consider whether you’d want to pull a splinter like that from your own skin. The doctor may advise you to bring the child in for splinter removal, give you advice on how to remove it yourself, or, in some cases, even tell you to leave it to work its own way out of the skin."
                }
            ]
        },
        {
            "name": "Pulling an Exposed Splinter with Tweezers",
            "steps": [
                {
                    "headline": "Wash your hands and the area with the splinter.",
                    "description": "Wash your own hands with soap and water, then gently wash and rinse the child’s skin over and around the splinter. Don’t rub their skin vigorously or you may drive the splinter deeper. Gently pat the washed area dry with a clean towel. Washing up helps to reduce the risk of transmitting bacteria into the wound. After washing the area with the splinter, you may want to soak it in clean, warm water for 5-10 minutes. This will soften their skin and may help loosen the splinter. Don’t soak their skin if they have a wood splinter, however, or it will swell and become harder to pull out."
                },
                {
                    "headline": "Wash and sterilize your tweezers.",
                    "description": "Clean and rinse the tweezers with soap and water to remove any dirt or debris. Then, do one of the following to sterilize the tweezers:\nOption 1: Hold the tips of the tweezers in the flame of a match for 10-15 seconds. Let the tweezers cool completely on a clean cloth before proceeding. Option 2: Wet the edge of a clean cloth or a cotton ball with rubbing alcohol, then thoroughly wipe the tips of the tweezers. Lay the tweezers on a clean cloth for 30-60 seconds to let the alcohol evaporate."
                },
                {
                    "headline": "Grasp the exposed tip of the splinter with the tweezers.",
                    "description": "Use a magnifying glass, if necessary, so you can clearly see the exposed end of the splinter. Carefully pinch the splinter’s tip between the teeth of the tweezers, making sure not to pinch any skin. If there isn’t enough exposed splinter to grip with the tweezers, try using a sterilized pin to peel back a bit of the skin to you can grasp the splinter. Otherwise, call your child’s doctor. If you need to use a magnifying glass, or if the child is especially squirmy, you may want to enlist a helper if possible."
                },
                {
                    "headline": "Pull opposite to the direction the splinter entered.",
                    "description": "Your goal is to remove the splinter at the same angle it entered the skin, just in the reverse direction. So long as you have a good grip on the tip, the splinter should come right out with minimal trouble. If you lose your grip once, try again. After 3 failed attempts, call the doctor. Likewise, if the splinter tip breaks off and the remainder is inaccessible, call the doctor. This is a good time to offer encouraging words: “Look, the splinter’s all gone already! You were so brave, Mary.”"
                },
                {
                    "headline": "Wash the area again, and bandage it if needed.",
                    "description": "To further reduce the risk of infection, give the area of the splinter another good washing with soap and water, then pat it dry with a clean towel. If there is minor bleeding, apply pressure with a clean cloth for up to 5 minutes. Many splinters don’t require bandaging. If there was some bleeding, however, or if the child will feel better with their “boo-boo” covered up, place a small amount of antibiotic ointment on the wound, then cover it with an adhesive bandage. Call the doctor if there is substantial bleeding that won’t stop after 5 minutes of applying pressure, or if any signs of infection—like swelling, redness, warmth, or discharge—appear over the next 1-5 days."
                }
            ]
        },
        {
            "name": "Exposing a Buried Splinter with a Pin",
            "steps": [
                {
                    "headline": "Wash and sterilize a pin along with your tweezers.",
                    "description": "Just like with the tweezers, start by cleaning the pin with soap and water. Then, sterilize it by holding a flame to it for 10-15 seconds or wiping it with rubbing alcohol. As when using tweezers alone, wash your hands and the area of the splinter with soap and water before cleaning your tools. Make sure the pin is cool and/or dry before using it. Don’t use a pin that is bent, has a blunted tip, or has any rust spots on it."
                },
                {
                    "headline": "Ice the area to reduce pain sensitivity.",
                    "description": "You’ll barely be pricking the child’s skin, so the pin won’t actually cause much pain. However, the thought of you sticking a pin into their skin may make the child to react in an exaggerated fashion. Icing the area down beforehand may help numb the pain and calm their nerves. Never apply ice directly to bare skin. Wrap a bag of ice cubes or an ice pack in a clean towel, and hold it to the splinter for 1-3 minutes."
                },
                {
                    "headline": "Prick the skin just beyond the head of the splinter.",
                    "description": "Your goal is to peel up the very thin layer of skin that’s covering the splinter’s head. Hold the pin at a 45-degree angle to the skin, and aim for the point where the splinter entered the skin. Press just the very tip of the pin into the skin—you only need to go as deep as the head of the splinter. If the child is curious about what’s happening, explain it simply: “OK, now you’ll feel just a tiny pinch as I stick the tip of the pin into your skin.”\nFor many children, this is the best time to make sure they’re distracted. Recruit a helper if possible, especially since you’ll be handling both the pin and the tweezers."
                },
                {
                    "headline": "Lift up the skin with the pin to expose the splinter’s head.",
                    "description": "Keep the tip of the pin embedded under the skin and lift gently upward and toward the head of the splinter. This should lift away the skin just enough for you to access the head of the splinter with your tweezers. With most children, you’ll only get one chance to use the pin. If you aren’t able to access the splinter, you’re probably better off calling the doctor rather than testing the child’s patience again."
                },
                {
                    "headline": "Remove the splinter with tweezers as normal.",
                    "description": "While keeping the pin in position, use the tweezers to pluck out the splinter. As with an exposed splinter, pull it out at the angle of entry but in the opposite direction. Wash the area again with soap and water after you’re done. Use an antibiotic ointment and a bandage if there’s a bit of bleeding or if it makes the child feel better. If you can’t get all of the splinter out, or if you notice any signs of infection (like redness or swelling), call the doctor."
                }
            ]
        },
        {
            "name": "Using Tape, Glue, or Other Methods",
            "steps": [
                {
                    "headline": "Apply tape over the splinter and peel it away.",
                    "description": "Grab a roll of sticky tape you have at home, like transparent tape, electrical tape, or duct tape. Cut a small piece of tape that’s about twice as long as the splinter and press it firmly over the splinter and surrounding skin. Peel the tape away slowly and steadily, opposite to the direction that the splinter entered. The head of an exposed splinter should stick to the tape and pull out the entire splinter. This method won’t work with an embedded splinter. Wash your hands and the area around the splinter before and after using the tape."
                },
                {
                    "headline": "Peel away a layer of dried school glue over the splinter.",
                    "description": "Squeeze a small dab of white school glue onto the exposed head of the splinter, then smear it into a thin layer using a clean finger. Wait 5-10 minutes for the glue to dry, then use your fingernails to peel up the corner of the glue on the edge closest to the embedded tip of the splinter. Peel the glue away slowly, working in the opposite direction of the splinter’s entry. This method works in the same way as using tape, but some splinters may be a bit more likely to stick to the glue. As always, wash your hands and the area around the splinter before and after using the glue."
                },
                {
                    "headline": "Try leaving small, painless splinters alone for a few days.",
                    "description": "If an embedded splinter is around 0.125 in (3.2 mm) or smaller and isn’t causing any pain or discomfort, your best bet may be to simply leave it alone. Over a period of several days, the splinter will work its way to the surface of the skin, where it will either fall out on its own or be easier to pluck out. If the splinter starts causing pain, or if you notice any signs of infection like redness, swelling, or discharge, call the child’s doctor. It’s fine to play it safe and call the doctor before deciding whether to leave a splinter in place. Depending on the type of splinter and other factors, they may prefer that you bring the child in to have even a tiny splinter removed."
                },
                {
                    "headline": "Consider home remedies to draw the splinter to the surface.",
                    "description": "If the splinter is embedded and your child is not eager to have you use a pin to expose it, it may be worth your while to give a home remedy a try. Just keep in mind that the evidence for their effectiveness ranges from limited to nonexistent. Try, for instance, soaking the area in white vinegar or warm water with epsom salts for 15-30 minutes. Or, try spreading one of the following over the splinter, covering it with an adhesive bandage, and waiting 24 hours before using tweezers:\nIchthammol ointment (“drawing salve”), available online or in some pharmacies. A thick paste made of baking soda and water. A small square of a banana peel. A small piece of bread soaked in warm milk."
                }
            ]
        }
    ],
    "tyn": [
        "Tweezers",
        "Soap and water",
        "Rubbing alcohol or matches (for sterilizing)",
        "Pin (optional)",
        "Magnifying glass (optional)",
        "Adhesive bandage (optional)"
    ],
    "text": " Keeping the Child Calm Use a soothing voice to tell the child you can help them. A child is likely to be very upset about having a splinter, especially if it hurts even a little. They may also be apprehensive about you removing it, out of fear that it will hurt even more. Use your best “calming adult” voice to ease their anxiety. Clearly state that you’ll help them. For a small child, try something like: “Oh no, Molly has an ouchy splinter. Don’t worry, sweetie, Mommy will make the ouchy go away.”\nOr, for a child who’s a bit older: “Ow, I know splinters like that hurt, David. Let’s go wash up and I’ll take care of that for you.” Hold a small child on your lap or a helper’s lap. Embracing the child on your lap is a good way to help calm them down. Also, if they’re being squirmy out of pain or anxiety, it will be easier for you to keep them a bit more still and steady this way. You may find it easier to have another trusted adult hold the child on their lap while you work to remove the splinter. However, it’s usually possible to do the entire job yourself. Explain the process or distract them, depending on the child. Some kids may want to know exactly what’s happening and watch you work. In this case, explain what you’ll be doing step-by-step. Other kids, though, will do much better if their mind is elsewhere. Keep your explanation simple: \"I'm going to clean off my hands and your skin, then clean the tweezers. After that, I'll use the tweezers to pinch that tiny bit of the splinter that's sticking out. Then I'll pull the whole splinter out. You won't feel a thing!\" To distract the child, sing some favorite songs together or play a game like “I spy.” Or, if necessary, turn on the TV or your tablet. Use your best judgment to determine if a child is better off with explanations or distractions. Call the doctor for deep, large, or poorly-located splinters. If the splinter is a large shard that has caused a significant puncture, or if it is embedded deep under the skin, leave it in place and call your child’s doctor. Or, if any type of splinter is near a sensitive area—most especially in or near an eye—call the doctor as soon as possible. It’s difficult to quantify when a splinter becomes “too big” or “too deep” to remove on your own. It may be best to consider whether you’d want to pull a splinter like that from your own skin. The doctor may advise you to bring the child in for splinter removal, give you advice on how to remove it yourself, or, in some cases, even tell you to leave it to work its own way out of the skin. Pulling an Exposed Splinter with Tweezers Wash your hands and the area with the splinter. Wash your own hands with soap and water, then gently wash and rinse the child’s skin over and around the splinter. Don’t rub their skin vigorously or you may drive the splinter deeper. Gently pat the washed area dry with a clean towel. Washing up helps to reduce the risk of transmitting bacteria into the wound. After washing the area with the splinter, you may want to soak it in clean, warm water for 5-10 minutes. This will soften their skin and may help loosen the splinter. Don’t soak their skin if they have a wood splinter, however, or it will swell and become harder to pull out. Wash and sterilize your tweezers. Clean and rinse the tweezers with soap and water to remove any dirt or debris. Then, do one of the following to sterilize the tweezers:\nOption 1: Hold the tips of the tweezers in the flame of a match for 10-15 seconds. Let the tweezers cool completely on a clean cloth before proceeding. Option 2: Wet the edge of a clean cloth or a cotton ball with rubbing alcohol, then thoroughly wipe the tips of the tweezers. Lay the tweezers on a clean cloth for 30-60 seconds to let the alcohol evaporate. Grasp the exposed tip of the splinter with the tweezers. Use a magnifying glass, if necessary, so you can clearly see the exposed end of the splinter. Carefully pinch the splinter’s tip between the teeth of the tweezers, making sure not to pinch any skin. If there isn’t enough exposed splinter to grip with the tweezers, try using a sterilized pin to peel back a bit of the skin to you can grasp the splinter. Otherwise, call your child’s doctor. If you need to use a magnifying glass, or if the child is especially squirmy, you may want to enlist a helper if possible. Pull opposite to the direction the splinter entered. Your goal is to remove the splinter at the same angle it entered the skin, just in the reverse direction. So long as you have a good grip on the tip, the splinter should come right out with minimal trouble. If you lose your grip once, try again. After 3 failed attempts, call the doctor. Likewise, if the splinter tip breaks off and the remainder is inaccessible, call the doctor. This is a good time to offer encouraging words: “Look, the splinter’s all gone already! You were so brave, Mary.” Wash the area again, and bandage it if needed. To further reduce the risk of infection, give the area of the splinter another good washing with soap and water, then pat it dry with a clean towel. If there is minor bleeding, apply pressure with a clean cloth for up to 5 minutes. Many splinters don’t require bandaging. If there was some bleeding, however, or if the child will feel better with their “boo-boo” covered up, place a small amount of antibiotic ointment on the wound, then cover it with an adhesive bandage. Call the doctor if there is substantial bleeding that won’t stop after 5 minutes of applying pressure, or if any signs of infection—like swelling, redness, warmth, or discharge—appear over the next 1-5 days. Exposing a Buried Splinter with a Pin Wash and sterilize a pin along with your tweezers. Just like with the tweezers, start by cleaning the pin with soap and water. Then, sterilize it by holding a flame to it for 10-15 seconds or wiping it with rubbing alcohol. As when using tweezers alone, wash your hands and the area of the splinter with soap and water before cleaning your tools. Make sure the pin is cool and/or dry before using it. Don’t use a pin that is bent, has a blunted tip, or has any rust spots on it. Ice the area to reduce pain sensitivity. You’ll barely be pricking the child’s skin, so the pin won’t actually cause much pain. However, the thought of you sticking a pin into their skin may make the child to react in an exaggerated fashion. Icing the area down beforehand may help numb the pain and calm their nerves. Never apply ice directly to bare skin. Wrap a bag of ice cubes or an ice pack in a clean towel, and hold it to the splinter for 1-3 minutes. Prick the skin just beyond the head of the splinter. Your goal is to peel up the very thin layer of skin that’s covering the splinter’s head. Hold the pin at a 45-degree angle to the skin, and aim for the point where the splinter entered the skin. Press just the very tip of the pin into the skin—you only need to go as deep as the head of the splinter. If the child is curious about what’s happening, explain it simply: “OK, now you’ll feel just a tiny pinch as I stick the tip of the pin into your skin.”\nFor many children, this is the best time to make sure they’re distracted. Recruit a helper if possible, especially since you’ll be handling both the pin and the tweezers. Lift up the skin with the pin to expose the splinter’s head. Keep the tip of the pin embedded under the skin and lift gently upward and toward the head of the splinter. This should lift away the skin just enough for you to access the head of the splinter with your tweezers. With most children, you’ll only get one chance to use the pin. If you aren’t able to access the splinter, you’re probably better off calling the doctor rather than testing the child’s patience again. Remove the splinter with tweezers as normal. While keeping the pin in position, use the tweezers to pluck out the splinter. As with an exposed splinter, pull it out at the angle of entry but in the opposite direction. Wash the area again with soap and water after you’re done. Use an antibiotic ointment and a bandage if there’s a bit of bleeding or if it makes the child feel better. If you can’t get all of the splinter out, or if you notice any signs of infection (like redness or swelling), call the doctor. Using Tape, Glue, or Other Methods Apply tape over the splinter and peel it away. Grab a roll of sticky tape you have at home, like transparent tape, electrical tape, or duct tape. Cut a small piece of tape that’s about twice as long as the splinter and press it firmly over the splinter and surrounding skin. Peel the tape away slowly and steadily, opposite to the direction that the splinter entered. The head of an exposed splinter should stick to the tape and pull out the entire splinter. This method won’t work with an embedded splinter. Wash your hands and the area around the splinter before and after using the tape. Peel away a layer of dried school glue over the splinter. Squeeze a small dab of white school glue onto the exposed head of the splinter, then smear it into a thin layer using a clean finger. Wait 5-10 minutes for the glue to dry, then use your fingernails to peel up the corner of the glue on the edge closest to the embedded tip of the splinter. Peel the glue away slowly, working in the opposite direction of the splinter’s entry. This method works in the same way as using tape, but some splinters may be a bit more likely to stick to the glue. As always, wash your hands and the area around the splinter before and after using the glue. Try leaving small, painless splinters alone for a few days. If an embedded splinter is around 0.125 in (3.2 mm) or smaller and isn’t causing any pain or discomfort, your best bet may be to simply leave it alone. Over a period of several days, the splinter will work its way to the surface of the skin, where it will either fall out on its own or be easier to pluck out. If the splinter starts causing pain, or if you notice any signs of infection like redness, swelling, or discharge, call the child’s doctor. It’s fine to play it safe and call the doctor before deciding whether to leave a splinter in place. Depending on the type of splinter and other factors, they may prefer that you bring the child in to have even a tiny splinter removed. Consider home remedies to draw the splinter to the surface. If the splinter is embedded and your child is not eager to have you use a pin to expose it, it may be worth your while to give a home remedy a try. Just keep in mind that the evidence for their effectiveness ranges from limited to nonexistent. Try, for instance, soaking the area in white vinegar or warm water with epsom salts for 15-30 minutes. Or, try spreading one of the following over the splinter, covering it with an adhesive bandage, and waiting 24 hours before using tweezers:\nIchthammol ointment (“drawing salve”), available online or in some pharmacies. A thick paste made of baking soda and water. A small square of a banana peel. A small piece of bread soaked in warm milk.",
    "sentences": [
        " Keeping the Child Calm Use a soothing voice to tell the child you can help them.",
        "A child is likely to be very upset about having a splinter, especially if it hurts even a little.",
        "They may also be apprehensive about you removing it, out of fear that it will hurt even more.",
        "Use your best “calming adult” voice to ease their anxiety.",
        "Clearly state that you’ll help them.",
        "For a small child, try something like: “Oh no, Molly has an ouchy splinter.",
        "Don’t worry, sweetie, Mommy will make the ouchy go away.”\nOr, for a child who’s a bit older: “Ow, I know splinters like that hurt, David.",
        "Let’s go wash up and I’ll take care of that for you.” Hold a small child on your lap or a helper’s lap.",
        "Embracing the child on your lap is a good way to help calm them down.",
        "Also, if they’re being squirmy out of pain or anxiety, it will be easier for you to keep them a bit more still and steady this way.",
        "You may find it easier to have another trusted adult hold the child on their lap while you work to remove the splinter.",
        "However, it’s usually possible to do the entire job yourself.",
        "Explain the process or distract them, depending on the child.",
        "Some kids may want to know exactly what’s happening and watch you work.",
        "In this case, explain what you’ll be doing step-by-step.",
        "Other kids, though, will do much better if their mind is elsewhere.",
        "Keep your explanation simple: \"I'm going to clean off my hands and your skin, then clean the tweezers.",
        "After that, I'll use the tweezers to pinch that tiny bit of the splinter that's sticking out.",
        "Then I'll pull the whole splinter out.",
        "You won't feel a thing!\"",
        "To distract the child, sing some favorite songs together or play a game like “I spy.” Or, if necessary, turn on the TV or your tablet.",
        "Use your best judgment to determine if a child is better off with explanations or distractions.",
        "Call the doctor for deep, large, or poorly-located splinters.",
        "If the splinter is a large shard that has caused a significant puncture, or if it is embedded deep under the skin, leave it in place and call your child’s doctor.",
        "Or, if any type of splinter is near a sensitive area—most especially in or near an eye—call the doctor as soon as possible.",
        "It’s difficult to quantify when a splinter becomes “too big” or “too deep” to remove on your own.",
        "It may be best to consider whether you’d want to pull a splinter like that from your own skin.",
        "The doctor may advise you to bring the child in for splinter removal, give you advice on how to remove it yourself, or, in some cases, even tell you to leave it to work its own way out of the skin.",
        "Pulling an Exposed Splinter with Tweezers Wash your hands and the area with the splinter.",
        "Wash your own hands with soap and water, then gently wash and rinse the child’s skin over and around the splinter.",
        "Don’t rub their skin vigorously or you may drive the splinter deeper.",
        "Gently pat the washed area dry with a clean towel.",
        "Washing up helps to reduce the risk of transmitting bacteria into the wound.",
        "After washing the area with the splinter, you may want to soak it in clean, warm water for 5-10 minutes.",
        "This will soften their skin and may help loosen the splinter.",
        "Don’t soak their skin if they have a wood splinter, however, or it will swell and become harder to pull out.",
        "Wash and sterilize your tweezers.",
        "Clean and rinse the tweezers with soap and water to remove any dirt or debris.",
        "Then, do one of the following to sterilize the tweezers:\nOption 1: Hold the tips of the tweezers in the flame of a match for 10-15 seconds.",
        "Let the tweezers cool completely on a clean cloth before proceeding.",
        "Option 2: Wet the edge of a clean cloth or a cotton ball with rubbing alcohol, then thoroughly wipe the tips of the tweezers.",
        "Lay the tweezers on a clean cloth for 30-60 seconds to let the alcohol evaporate.",
        "Grasp the exposed tip of the splinter with the tweezers.",
        "Use a magnifying glass, if necessary, so you can clearly see the exposed end of the splinter.",
        "Carefully pinch the splinter’s tip between the teeth of the tweezers, making sure not to pinch any skin.",
        "If there isn’t enough exposed splinter to grip with the tweezers, try using a sterilized pin to peel back a bit of the skin to you can grasp the splinter.",
        "Otherwise, call your child’s doctor.",
        "If you need to use a magnifying glass, or if the child is especially squirmy, you may want to enlist a helper if possible.",
        "Pull opposite to the direction the splinter entered.",
        "Your goal is to remove the splinter at the same angle it entered the skin, just in the reverse direction.",
        "So long as you have a good grip on the tip, the splinter should come right out with minimal trouble.",
        "If you lose your grip once, try again.",
        "After 3 failed attempts, call the doctor.",
        "Likewise, if the splinter tip breaks off and the remainder is inaccessible, call the doctor.",
        "This is a good time to offer encouraging words: “Look, the splinter’s all gone already!",
        "You were so brave, Mary.” Wash the area again, and bandage it if needed.",
        "To further reduce the risk of infection, give the area of the splinter another good washing with soap and water, then pat it dry with a clean towel.",
        "If there is minor bleeding, apply pressure with a clean cloth for up to 5 minutes.",
        "Many splinters don’t require bandaging.",
        "If there was some bleeding, however, or if the child will feel better with their “boo-boo” covered up, place a small amount of antibiotic ointment on the wound, then cover it with an adhesive bandage.",
        "Call the doctor if there is substantial bleeding that won’t stop after 5 minutes of applying pressure, or if any signs of infection—like swelling, redness, warmth, or discharge—appear over the next 1-5 days.",
        "Exposing a Buried Splinter with a Pin Wash and sterilize a pin along with your tweezers.",
        "Just like with the tweezers, start by cleaning the pin with soap and water.",
        "Then, sterilize it by holding a flame to it for 10-15 seconds or wiping it with rubbing alcohol.",
        "As when using tweezers alone, wash your hands and the area of the splinter with soap and water before cleaning your tools.",
        "Make sure the pin is cool and/or dry before using it.",
        "Don’t use a pin that is bent, has a blunted tip, or has any rust spots on it.",
        "Ice the area to reduce pain sensitivity.",
        "You’ll barely be pricking the child’s skin, so the pin won’t actually cause much pain.",
        "However, the thought of you sticking a pin into their skin may make the child to react in an exaggerated fashion.",
        "Icing the area down beforehand may help numb the pain and calm their nerves.",
        "Never apply ice directly to bare skin.",
        "Wrap a bag of ice cubes or an ice pack in a clean towel, and hold it to the splinter for 1-3 minutes.",
        "Prick the skin just beyond the head of the splinter.",
        "Your goal is to peel up the very thin layer of skin that’s covering the splinter’s head.",
        "Hold the pin at a 45-degree angle to the skin, and aim for the point where the splinter entered the skin.",
        "Press just the very tip of the pin into the skin—you only need to go as deep as the head of the splinter.",
        "If the child is curious about what’s happening, explain it simply: “OK, now you’ll feel just a tiny pinch as I stick the tip of the pin into your skin.”\nFor many children, this is the best time to make sure they’re distracted.",
        "Recruit a helper if possible, especially since you’ll be handling both the pin and the tweezers.",
        "Lift up the skin with the pin to expose the splinter’s head.",
        "Keep the tip of the pin embedded under the skin and lift gently upward and toward the head of the splinter.",
        "This should lift away the skin just enough for you to access the head of the splinter with your tweezers.",
        "With most children, you’ll only get one chance to use the pin.",
        "If you aren’t able to access the splinter, you’re probably better off calling the doctor rather than testing the child’s patience again.",
        "Remove the splinter with tweezers as normal.",
        "While keeping the pin in position, use the tweezers to pluck out the splinter.",
        "As with an exposed splinter, pull it out at the angle of entry but in the opposite direction.",
        "Wash the area again with soap and water after you’re done.",
        "Use an antibiotic ointment and a bandage if there’s a bit of bleeding or if it makes the child feel better.",
        "If you can’t get all of the splinter out, or if you notice any signs of infection (like redness or swelling), call the doctor.",
        "Using Tape, Glue, or Other Methods Apply tape over the splinter and peel it away.",
        "Grab a roll of sticky tape you have at home, like transparent tape, electrical tape, or duct tape.",
        "Cut a small piece of tape that’s about twice as long as the splinter and press it firmly over the splinter and surrounding skin.",
        "Peel the tape away slowly and steadily, opposite to the direction that the splinter entered.",
        "The head of an exposed splinter should stick to the tape and pull out the entire splinter.",
        "This method won’t work with an embedded splinter.",
        "Wash your hands and the area around the splinter before and after using the tape.",
        "Peel away a layer of dried school glue over the splinter.",
        "Squeeze a small dab of white school glue onto the exposed head of the splinter, then smear it into a thin layer using a clean finger.",
        "Wait 5-10 minutes for the glue to dry, then use your fingernails to peel up the corner of the glue on the edge closest to the embedded tip of the splinter.",
        "Peel the glue away slowly, working in the opposite direction of the splinter’s entry.",
        "This method works in the same way as using tape, but some splinters may be a bit more likely to stick to the glue.",
        "As always, wash your hands and the area around the splinter before and after using the glue.",
        "Try leaving small, painless splinters alone for a few days.",
        "If an embedded splinter is around 0.125 in (3.2 mm) or smaller and isn’t causing any pain or discomfort, your best bet may be to simply leave it alone.",
        "Over a period of several days, the splinter will work its way to the surface of the skin, where it will either fall out on its own or be easier to pluck out.",
        "If the splinter starts causing pain, or if you notice any signs of infection like redness, swelling, or discharge, call the child’s doctor.",
        "It’s fine to play it safe and call the doctor before deciding whether to leave a splinter in place.",
        "Depending on the type of splinter and other factors, they may prefer that you bring the child in to have even a tiny splinter removed.",
        "Consider home remedies to draw the splinter to the surface.",
        "If the splinter is embedded and your child is not eager to have you use a pin to expose it, it may be worth your while to give a home remedy a try.",
        "Just keep in mind that the evidence for their effectiveness ranges from limited to nonexistent.",
        "Try, for instance, soaking the area in white vinegar or warm water with epsom salts for 15-30 minutes.",
        "Or, try spreading one of the following over the splinter, covering it with an adhesive bandage, and waiting 24 hours before using tweezers:\nIchthammol ointment (“drawing salve”), available online or in some pharmacies.",
        "A thick paste made of baking soda and water.",
        "A small square of a banana peel.",
        "A small piece of bread soaked in warm milk."
    ]
}