{
    "title": "How to Forge a Knife",
    "url": "https://www.wikihow.com/Forge-a-Knife",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "steps": [
        {
            "headline": "Heat the metal in a forge or your own personal metal working furnace.",
            "description": "Proper temperature varies, but a charcoal fire with introduced air is sufficient."
        },
        {
            "headline": "Check color when heated.",
            "description": "The steel should be 2,100 to 2,200 °F (1,150 to 1,200 °C) which is a straw or yellow color."
        },
        {
            "headline": "Forge the blade to a point so that the flat side will be your blade edge and the curved side will be your spine when finished.",
            "description": ""
        },
        {
            "headline": "Leave room for a tang (the part in the handle).",
            "description": "Leave about two inches or more on one end."
        },
        {
            "headline": "Establish a blade, by repeating rows of small taps with a three pound sledge (best weight will depend on your size and strength) in long rows up the blade, narrowing the steel making the distal taper.",
            "description": "Work on both sides of the blade to prevent it from distorting."
        },
        {
            "headline": "Hammer out the flat side to make the bevels.",
            "description": "Note that doing so will cause the blade to bend back on the spine."
        },
        {
            "headline": "Try to keep the blade from mushrooming or bending over itself, as this will cause inclusions weakening the blade.",
            "description": ""
        },
        {
            "headline": "Remember, when it is a rough blade shape, you can anneal it by bringing it to this red hot nonmagnetic temperature three times and letting it air cool till all the red is gone.",
            "description": "After the third heating, let it cool in the fire overnight. Cooling it very slowly will make it softer, easier to file."
        },
        {
            "headline": "File to shape and even up any uneven spots.",
            "description": ""
        },
        {
            "headline": "Bring back to nonmagnetic and dip in a vat of oil to harden the blade, (there are oil, water, and air hardening steels).",
            "description": "Dipping only the cutting edge will provide a hard durable cutting edge but leave the back flexible, thereby increasing the overall durability of the blade. Only dip the metal vertically, any other angle besides being a few degrees off will create bubbles around the metal, causing warping and you to have to reforge."
        },
        {
            "headline": "Put it in an oven for an hour or two on 250–350 °F (121–177 °C) to temper it.",
            "description": "You  can also leave it in a hot covered spot with a few coals, such as a makeshift brick box."
        },
        {
            "headline": "Handle it (either drill holes and pin scales of wood, wrap with cord or wire, or make a pointy tang and put in a block of wood then file it to shape.",
            "description": ""
        },
        {
            "headline": "Sharpen your knife with a fine file, then with a whetstone.",
            "description": "Finally use a leather strop impregnated with polishing paste to remove any burr and leave a razor sharp edge."
        }
    ],
    "tyn": [
        "Metal",
        "A Furnace",
        "Rounding hammer",
        "Forging tongs",
        "Sandpaper",
        "Motor oil",
        "Whetstone",
        "Fine file",
        "Leather strop"
    ],
    "text": " Heat the metal in a forge or your own personal metal working furnace. Proper temperature varies, but a charcoal fire with introduced air is sufficient. Check color when heated. The steel should be 2,100 to 2,200 °F (1,150 to 1,200 °C) which is a straw or yellow color. Forge the blade to a point so that the flat side will be your blade edge and the curved side will be your spine when finished.  Leave room for a tang (the part in the handle). Leave about two inches or more on one end. Establish a blade, by repeating rows of small taps with a three pound sledge (best weight will depend on your size and strength) in long rows up the blade, narrowing the steel making the distal taper. Work on both sides of the blade to prevent it from distorting. Hammer out the flat side to make the bevels. Note that doing so will cause the blade to bend back on the spine. Try to keep the blade from mushrooming or bending over itself, as this will cause inclusions weakening the blade.  Remember, when it is a rough blade shape, you can anneal it by bringing it to this red hot nonmagnetic temperature three times and letting it air cool till all the red is gone. After the third heating, let it cool in the fire overnight. Cooling it very slowly will make it softer, easier to file. File to shape and even up any uneven spots.  Bring back to nonmagnetic and dip in a vat of oil to harden the blade, (there are oil, water, and air hardening steels). Dipping only the cutting edge will provide a hard durable cutting edge but leave the back flexible, thereby increasing the overall durability of the blade. Only dip the metal vertically, any other angle besides being a few degrees off will create bubbles around the metal, causing warping and you to have to reforge. Put it in an oven for an hour or two on 250–350 °F (121–177 °C) to temper it. You  can also leave it in a hot covered spot with a few coals, such as a makeshift brick box. Handle it (either drill holes and pin scales of wood, wrap with cord or wire, or make a pointy tang and put in a block of wood then file it to shape.  Sharpen your knife with a fine file, then with a whetstone. Finally use a leather strop impregnated with polishing paste to remove any burr and leave a razor sharp edge.",
    "sentences": [
        " Heat the metal in a forge or your own personal metal working furnace.",
        "Proper temperature varies, but a charcoal fire with introduced air is sufficient.",
        "Check color when heated.",
        "The steel should be 2,100 to 2,200 °F (1,150 to 1,200 °C) which is a straw or yellow color.",
        "Forge the blade to a point so that the flat side will be your blade edge and the curved side will be your spine when finished.",
        "Leave room for a tang (the part in the handle).",
        "Leave about two inches or more on one end.",
        "Establish a blade, by repeating rows of small taps with a three pound sledge (best weight will depend on your size and strength) in long rows up the blade, narrowing the steel making the distal taper.",
        "Work on both sides of the blade to prevent it from distorting.",
        "Hammer out the flat side to make the bevels.",
        "Note that doing so will cause the blade to bend back on the spine.",
        "Try to keep the blade from mushrooming or bending over itself, as this will cause inclusions weakening the blade.",
        "Remember, when it is a rough blade shape, you can anneal it by bringing it to this red hot nonmagnetic temperature three times and letting it air cool till all the red is gone.",
        "After the third heating, let it cool in the fire overnight.",
        "Cooling it very slowly will make it softer, easier to file.",
        "File to shape and even up any uneven spots.",
        "Bring back to nonmagnetic and dip in a vat of oil to harden the blade, (there are oil, water, and air hardening steels).",
        "Dipping only the cutting edge will provide a hard durable cutting edge but leave the back flexible, thereby increasing the overall durability of the blade.",
        "Only dip the metal vertically, any other angle besides being a few degrees off will create bubbles around the metal, causing warping and you to have to reforge.",
        "Put it in an oven for an hour or two on 250–350 °F (121–177 °C) to temper it.",
        "You  can also leave it in a hot covered spot with a few coals, such as a makeshift brick box.",
        "Handle it (either drill holes and pin scales of wood, wrap with cord or wire, or make a pointy tang and put in a block of wood then file it to shape.",
        "Sharpen your knife with a fine file, then with a whetstone.",
        "Finally use a leather strop impregnated with polishing paste to remove any burr and leave a razor sharp edge."
    ]
}