{
    "title": "How to Obtain a Copy of Your Birth Certificate in Virginia",
    "url": "https://www.wikihow.com/Obtain-a-Copy-of-Your-Birth-Certificate-in-Virginia",
    "category_hierarchy": [
        "Finance and Business",
        "Government",
        "Vital Records",
        "Birth Certificates"
    ],
    "methods": [
        {
            "name": "Understanding the Basics",
            "steps": [
                {
                    "headline": "Learn about the office of Vital Records.",
                    "description": "The Virginia Office of Vital Records is a division of the Virginia Department of Health. For most routes to receive your birth certificate, you will go through the office of vital records. The office provides Virginia birth and death certificates from 1912 to the present. The office is very busy, so be prepared for waiting times when making phone calls or visiting during office hours. They receive an average of 30,000 calls a month and 9,000 visitors. The office is located 2001 Maywill Street, Richmond, Virginia 23230. The phone number is 804-662-6200."
                },
                {
                    "headline": "Know who can obtain a copy of a birth certificate.",
                    "description": "Only specific people have access to birth certificates, as they contain confidential material. When requesting a copy of your own birth certificate you must be over 18, an emancipated minor, a parent under 18 if requesting your child's birth certificate at the same time, or a married juvenile. When requesting for an immediate family member, you must be a current spouse, adult child, mother, father, adult brother, adult sister, maternal grandparents (if mother is listed on the birth certificate), or paternal grandparents (if father is listed on the birth certificate). When requesting as a legal representative, you must have original Notarized Power of Attorney over the person named on the certificate or be the attorney or agent of the person named on the certificate."
                },
                {
                    "headline": "Know about the DMV option.",
                    "description": "If you don't live near the Office of Vital Records, there's an alternative route to get a copy of your birth certificate. Certified copies of birth certificates from 1912 to present are available through the Department of Motor Vehicles. Full service DMV locations, which include DMV customer service stations and DMV 2 go mobile offices, issue copies of birth certificates."
                }
            ]
        },
        {
            "name": "Obtaining a Copy by Walk-Ins or Mail",
            "steps": [
                {
                    "headline": "Complete an application.",
                    "description": "Whether you're requesting a birth certificate by mail or planning a walk-in, you first need to complete an application. The application PDF can be found on the website for the Office of Vital Records. The application will ask for your name, address, phone number, city, state, and zip code. It will ask for you relation to the person named on the certificate and your reason for requesting the certificate. It will ask for the full name of the person on the certificate, their date of birth, their place of birth, their hospital of birth, and the names of their mother and father. It will ask what type of certificate you want, and the number of copies. You will be asked for a signature."
                },
                {
                    "headline": "Bring or make a copy of a valid form of ID.",
                    "description": "In order to obtain a copy of your birth certificate, you either need to show a worker at the Office of Vital Records a valid form of ID or mail in a photo copy with your application. The following are acceptable forms of ID in Virginia:\nPhoto driver's license, learner's permit, or photo identification card issued by the DMV\nSchool or employer issued photo identification card\nMilitary card, active or retired\nUS passport or foreign passport with visa\nUS certificate of naturalization or citizenship\nUS citizen identification card\nTemporary resident card\nEmployment Authorization Card\nRefugee Travel Document\nForeign Alien Card\nPermanent Resident Card\nNorthern Marianas Card\nA copy of the first and last page of an application for Asylum\nBirth Abroad (Consular Report) of a citizen from the USA\nBirth Abroad (Certification Report) of a citizen of the USA\nVirginia Criminal Justice Agency Offender Information\nUnited State Probation Offender Information"
                },
                {
                    "headline": "Walk in.",
                    "description": "To walk in to receive your birth certificate, go to 2001 Maywill Street, Richmond, Virginia 23230. You will be asked to fill out an application, if you haven't already. You will be asked to show the processing clerk your form of ID. There is a $12 fee, which can be paid by cash, check, or money order. No debit or credit cards are accepted. This is a same day service, meaning you will receive your birth certificate before you leave."
                },
                {
                    "headline": "Mail in the application.",
                    "description": "If getting to the office is inconvenient for you, you can simply mail in your application. Mail your application to P.O. Box 1000, Richmond, Virginia 23218-1000. You must include a signed application, a photocopy of a valid form of ID, and a signed letter giving your return address. Include a check or money order, made out to the State Health Department, for $12. If you're requesting a birth certificate with no changes made, expect delivery in 2 to 4 weeks. If you've requested any amendments or changes, the wait can be up to 12 weeks."
                }
            ]
        },
        {
            "name": "Ordering Through VitalChek",
            "steps": [
                {
                    "headline": "Know the benefits and drawbacks of VitalChek.",
                    "description": "VitalChek is a network contracted by the Virginia Health Department that issues birth and death certificates for people living in the state of Virginia. The main advantage of VitalChek is its speed and convenience. It takes 10 minutes to complete an application, which you complete from home, and you should receive your birth certificate within 2 to 5 days. Due to the added shipping cost that result from fast delivery times, fees a great deal higher using VitalChek. Payment options are also stricter, as payments must be made by credit cards."
                },
                {
                    "headline": "Gather the needed information.",
                    "description": "When requesting a birth certificate from VitalChek, you will be asked to provide the following information:\nType of certificate requested\nRelationship to the person on the certificate\nFull name of the person on the certificate\nDate and place of birth of the person on the certificate\nMother's full and maiden name\nFather's name\nArea code and daytime phone number\nThe street address, city, state, and zip code where the certificate will be sent (PO boxes are not accepted)"
                },
                {
                    "headline": "Place your order through VitalChek.",
                    "description": "VitalChek offers both online and phone orders. You can order by phone by calling 1-877-572-6333 and following the instructions from there. You can order online by going to vitalchek.com and providing the needed information."
                },
                {
                    "headline": "Pay the fees.",
                    "description": "VitalChek requires fees be paid by credit card, and they vary based on circumstance. There is a $20.80 fee for each certified record, and an additional $11.95 VitalChek service fee. If you need foreign authentication on a document, there is an additional $10 fee. For mailing, there is an $18.50 fee for UPS Air, a $17 fee for UPS 2 Day Air, and no fee for US Post Office Regular Mail."
                }
            ]
        },
        {
            "name": "Going to the DMV",
            "steps": [
                {
                    "headline": "Know what kind of DMV can issue birth certificates.",
                    "description": "In Virginia, the Department of Motor Vehicles can issue birth certificates from 1912 to present. The kinds of DMV's that issue certificates are:\nFull service DMV offices\nDMV customer service centers\nDMV 2 Go mobile offices"
                },
                {
                    "headline": "Fill out an application.",
                    "description": "An application for a birth certificate can be found on the DMV website. The application will ask for the following information:\nYou name, address, city, state, zip code, phone number, and e-mail\nYour gender\nYour relationship to the person named on the certificate\nIt will ask for the name of the person on the certificate, their date of birth, gender, place of birth, hospital of birth, and parents full names. Lastly, it will ask for a signature."
                },
                {
                    "headline": "Go to an office.",
                    "description": "Go to a DMV office and present your application. You should also include:\nAppropriate photo identification. The acceptable photo ID's are the same as those listed for walk-in and mail applications. The $14 fee, which can be paid by cash, check, or money order."
                }
            ]
        }
    ],
    "tyn": [
        "Check or money order",
        "Copy of some kind of State ID",
        "A completed application"
    ],
    "text": " Understanding the Basics Learn about the office of Vital Records. The Virginia Office of Vital Records is a division of the Virginia Department of Health. For most routes to receive your birth certificate, you will go through the office of vital records. The office provides Virginia birth and death certificates from 1912 to the present. The office is very busy, so be prepared for waiting times when making phone calls or visiting during office hours. They receive an average of 30,000 calls a month and 9,000 visitors. The office is located 2001 Maywill Street, Richmond, Virginia 23230. The phone number is 804-662-6200. Know who can obtain a copy of a birth certificate. Only specific people have access to birth certificates, as they contain confidential material. When requesting a copy of your own birth certificate you must be over 18, an emancipated minor, a parent under 18 if requesting your child's birth certificate at the same time, or a married juvenile. When requesting for an immediate family member, you must be a current spouse, adult child, mother, father, adult brother, adult sister, maternal grandparents (if mother is listed on the birth certificate), or paternal grandparents (if father is listed on the birth certificate). When requesting as a legal representative, you must have original Notarized Power of Attorney over the person named on the certificate or be the attorney or agent of the person named on the certificate. Know about the DMV option. If you don't live near the Office of Vital Records, there's an alternative route to get a copy of your birth certificate. Certified copies of birth certificates from 1912 to present are available through the Department of Motor Vehicles. Full service DMV locations, which include DMV customer service stations and DMV 2 go mobile offices, issue copies of birth certificates. Obtaining a Copy by Walk-Ins or Mail Complete an application. Whether you're requesting a birth certificate by mail or planning a walk-in, you first need to complete an application. The application PDF can be found on the website for the Office of Vital Records. The application will ask for your name, address, phone number, city, state, and zip code. It will ask for you relation to the person named on the certificate and your reason for requesting the certificate. It will ask for the full name of the person on the certificate, their date of birth, their place of birth, their hospital of birth, and the names of their mother and father. It will ask what type of certificate you want, and the number of copies. You will be asked for a signature. Bring or make a copy of a valid form of ID. In order to obtain a copy of your birth certificate, you either need to show a worker at the Office of Vital Records a valid form of ID or mail in a photo copy with your application. The following are acceptable forms of ID in Virginia:\nPhoto driver's license, learner's permit, or photo identification card issued by the DMV\nSchool or employer issued photo identification card\nMilitary card, active or retired\nUS passport or foreign passport with visa\nUS certificate of naturalization or citizenship\nUS citizen identification card\nTemporary resident card\nEmployment Authorization Card\nRefugee Travel Document\nForeign Alien Card\nPermanent Resident Card\nNorthern Marianas Card\nA copy of the first and last page of an application for Asylum\nBirth Abroad (Consular Report) of a citizen from the USA\nBirth Abroad (Certification Report) of a citizen of the USA\nVirginia Criminal Justice Agency Offender Information\nUnited State Probation Offender Information Walk in. To walk in to receive your birth certificate, go to 2001 Maywill Street, Richmond, Virginia 23230. You will be asked to fill out an application, if you haven't already. You will be asked to show the processing clerk your form of ID. There is a $12 fee, which can be paid by cash, check, or money order. No debit or credit cards are accepted. This is a same day service, meaning you will receive your birth certificate before you leave. Mail in the application. If getting to the office is inconvenient for you, you can simply mail in your application. Mail your application to P.O. Box 1000, Richmond, Virginia 23218-1000. You must include a signed application, a photocopy of a valid form of ID, and a signed letter giving your return address. Include a check or money order, made out to the State Health Department, for $12. If you're requesting a birth certificate with no changes made, expect delivery in 2 to 4 weeks. If you've requested any amendments or changes, the wait can be up to 12 weeks. Ordering Through VitalChek Know the benefits and drawbacks of VitalChek. VitalChek is a network contracted by the Virginia Health Department that issues birth and death certificates for people living in the state of Virginia. The main advantage of VitalChek is its speed and convenience. It takes 10 minutes to complete an application, which you complete from home, and you should receive your birth certificate within 2 to 5 days. Due to the added shipping cost that result from fast delivery times, fees a great deal higher using VitalChek. Payment options are also stricter, as payments must be made by credit cards. Gather the needed information. When requesting a birth certificate from VitalChek, you will be asked to provide the following information:\nType of certificate requested\nRelationship to the person on the certificate\nFull name of the person on the certificate\nDate and place of birth of the person on the certificate\nMother's full and maiden name\nFather's name\nArea code and daytime phone number\nThe street address, city, state, and zip code where the certificate will be sent (PO boxes are not accepted) Place your order through VitalChek. VitalChek offers both online and phone orders. You can order by phone by calling 1-877-572-6333 and following the instructions from there. You can order online by going to vitalchek.com and providing the needed information. Pay the fees. VitalChek requires fees be paid by credit card, and they vary based on circumstance. There is a $20.80 fee for each certified record, and an additional $11.95 VitalChek service fee. If you need foreign authentication on a document, there is an additional $10 fee. For mailing, there is an $18.50 fee for UPS Air, a $17 fee for UPS 2 Day Air, and no fee for US Post Office Regular Mail. Going to the DMV Know what kind of DMV can issue birth certificates. In Virginia, the Department of Motor Vehicles can issue birth certificates from 1912 to present. The kinds of DMV's that issue certificates are:\nFull service DMV offices\nDMV customer service centers\nDMV 2 Go mobile offices Fill out an application. An application for a birth certificate can be found on the DMV website. The application will ask for the following information:\nYou name, address, city, state, zip code, phone number, and e-mail\nYour gender\nYour relationship to the person named on the certificate\nIt will ask for the name of the person on the certificate, their date of birth, gender, place of birth, hospital of birth, and parents full names. Lastly, it will ask for a signature. Go to an office. Go to a DMV office and present your application. You should also include:\nAppropriate photo identification. The acceptable photo ID's are the same as those listed for walk-in and mail applications. The $14 fee, which can be paid by cash, check, or money order.",
    "sentences": [
        " Understanding the Basics Learn about the office of Vital Records.",
        "The Virginia Office of Vital Records is a division of the Virginia Department of Health.",
        "For most routes to receive your birth certificate, you will go through the office of vital records.",
        "The office provides Virginia birth and death certificates from 1912 to the present.",
        "The office is very busy, so be prepared for waiting times when making phone calls or visiting during office hours.",
        "They receive an average of 30,000 calls a month and 9,000 visitors.",
        "The office is located 2001 Maywill Street, Richmond, Virginia 23230.",
        "The phone number is 804-662-6200.",
        "Know who can obtain a copy of a birth certificate.",
        "Only specific people have access to birth certificates, as they contain confidential material.",
        "When requesting a copy of your own birth certificate you must be over 18, an emancipated minor, a parent under 18 if requesting your child's birth certificate at the same time, or a married juvenile.",
        "When requesting for an immediate family member, you must be a current spouse, adult child, mother, father, adult brother, adult sister, maternal grandparents (if mother is listed on the birth certificate), or paternal grandparents (if father is listed on the birth certificate).",
        "When requesting as a legal representative, you must have original Notarized Power of Attorney over the person named on the certificate or be the attorney or agent of the person named on the certificate.",
        "Know about the DMV option.",
        "If you don't live near the Office of Vital Records, there's an alternative route to get a copy of your birth certificate.",
        "Certified copies of birth certificates from 1912 to present are available through the Department of Motor Vehicles.",
        "Full service DMV locations, which include DMV customer service stations and DMV 2 go mobile offices, issue copies of birth certificates.",
        "Obtaining a Copy by Walk-Ins or Mail Complete an application.",
        "Whether you're requesting a birth certificate by mail or planning a walk-in, you first need to complete an application.",
        "The application PDF can be found on the website for the Office of Vital Records.",
        "The application will ask for your name, address, phone number, city, state, and zip code.",
        "It will ask for you relation to the person named on the certificate and your reason for requesting the certificate.",
        "It will ask for the full name of the person on the certificate, their date of birth, their place of birth, their hospital of birth, and the names of their mother and father.",
        "It will ask what type of certificate you want, and the number of copies.",
        "You will be asked for a signature.",
        "Bring or make a copy of a valid form of ID.",
        "In order to obtain a copy of your birth certificate, you either need to show a worker at the Office of Vital Records a valid form of ID or mail in a photo copy with your application.",
        "The following are acceptable forms of ID in Virginia:\nPhoto driver's license, learner's permit, or photo identification card issued by the DMV\nSchool or employer issued photo identification card\nMilitary card, active or retired\nUS passport or foreign passport with visa\nUS certificate of naturalization or citizenship\nUS citizen identification card\nTemporary resident card\nEmployment Authorization Card\nRefugee Travel Document\nForeign Alien Card\nPermanent Resident Card\nNorthern Marianas Card\nA copy of the first and last page of an application for Asylum\nBirth Abroad (Consular Report) of a citizen from the USA\nBirth Abroad (Certification Report) of a citizen of the USA\nVirginia Criminal Justice Agency Offender Information\nUnited State Probation Offender Information Walk in.",
        "To walk in to receive your birth certificate, go to 2001 Maywill Street, Richmond, Virginia 23230.",
        "You will be asked to fill out an application, if you haven't already.",
        "You will be asked to show the processing clerk your form of ID.",
        "There is a $12 fee, which can be paid by cash, check, or money order.",
        "No debit or credit cards are accepted.",
        "This is a same day service, meaning you will receive your birth certificate before you leave.",
        "Mail in the application.",
        "If getting to the office is inconvenient for you, you can simply mail in your application.",
        "Mail your application to P.O.",
        "Box 1000, Richmond, Virginia 23218-1000.",
        "You must include a signed application, a photocopy of a valid form of ID, and a signed letter giving your return address.",
        "Include a check or money order, made out to the State Health Department, for $12.",
        "If you're requesting a birth certificate with no changes made, expect delivery in 2 to 4 weeks.",
        "If you've requested any amendments or changes, the wait can be up to 12 weeks.",
        "Ordering Through VitalChek Know the benefits and drawbacks of VitalChek.",
        "VitalChek is a network contracted by the Virginia Health Department that issues birth and death certificates for people living in the state of Virginia.",
        "The main advantage of VitalChek is its speed and convenience.",
        "It takes 10 minutes to complete an application, which you complete from home, and you should receive your birth certificate within 2 to 5 days.",
        "Due to the added shipping cost that result from fast delivery times, fees a great deal higher using VitalChek.",
        "Payment options are also stricter, as payments must be made by credit cards.",
        "Gather the needed information.",
        "When requesting a birth certificate from VitalChek, you will be asked to provide the following information:\nType of certificate requested\nRelationship to the person on the certificate\nFull name of the person on the certificate\nDate and place of birth of the person on the certificate\nMother's full and maiden name\nFather's name\nArea code and daytime phone number\nThe street address, city, state, and zip code where the certificate will be sent (PO boxes are not accepted) Place your order through VitalChek.",
        "VitalChek offers both online and phone orders.",
        "You can order by phone by calling 1-877-572-6333 and following the instructions from there.",
        "You can order online by going to vitalchek.com and providing the needed information.",
        "Pay the fees.",
        "VitalChek requires fees be paid by credit card, and they vary based on circumstance.",
        "There is a $20.80 fee for each certified record, and an additional $11.95 VitalChek service fee.",
        "If you need foreign authentication on a document, there is an additional $10 fee.",
        "For mailing, there is an $18.50 fee for UPS Air, a $17 fee for UPS 2 Day Air, and no fee for US Post Office Regular Mail.",
        "Going to the DMV Know what kind of DMV can issue birth certificates.",
        "In Virginia, the Department of Motor Vehicles can issue birth certificates from 1912 to present.",
        "The kinds of DMV's that issue certificates are:\nFull service DMV offices\nDMV customer service centers\nDMV 2 Go mobile offices Fill out an application.",
        "An application for a birth certificate can be found on the DMV website.",
        "The application will ask for the following information:\nYou name, address, city, state, zip code, phone number, and e-mail\nYour gender\nYour relationship to the person named on the certificate\nIt will ask for the name of the person on the certificate, their date of birth, gender, place of birth, hospital of birth, and parents full names.",
        "Lastly, it will ask for a signature.",
        "Go to an office.",
        "Go to a DMV office and present your application.",
        "You should also include:\nAppropriate photo identification.",
        "The acceptable photo ID's are the same as those listed for walk-in and mail applications.",
        "The $14 fee, which can be paid by cash, check, or money order."
    ]
}