{
    "title": "How to Set a Cuckoo Clock",
    "url": "https://www.wikihow.com/Set-a-Cuckoo-Clock",
    "category_hierarchy": [
        "Home and Garden",
        "Home Decorating",
        "Home Decor"
    ],
    "parts": [
        {
            "name": "Removing the Packaging",
            "steps": [
                {
                    "headline": "Take your clock out of the packaging carefully.",
                    "description": "Open the box with scissors or a utility knife. Cuckoo clocks are always shipped and sold with a lot of packing material to keep the carefully-constructed ornaments and face from breaking during travel. Move any packaging aside. Grab the roof of the clock where it sticks out by the side and carefully lift the clock out of the box. Lifting the clock by the roof ensures that you don’t accidentally rip an ornament or fixture off of the clock. Set the weights and pendulum aside. These are almost always a leaf and 2-3 acorns. These are the pieces that hang down from your clock. They’re installed after you’ve mounted the clock though."
                },
                {
                    "headline": "Place your cuckoo clock face-down on a soft surface.",
                    "description": "Set out a large blanket or soft pillow. Carefully place your clock face-down on the surface. Be extremely delicate while doing this to avoid breaking any ornaments on the face. If you use a blanket, fold it over a few times before putting your cuckoo clock down on it."
                },
                {
                    "headline": "Remove the back panel by flipping or sliding the latch.",
                    "description": "The back panel is usually locked by a sliding bolt or hook, but this part of the cuckoo clock is different on every model. Look around the back panel for a 1–2 in (2.5–5.1 cm) latch, lock, hook, or hinge. Unlock it by hand and carefully lift the back panel off of the clock. Set it aside. Some cuckoo clocks don’t have a latch keeping the back panel in place. If you don’t see a latch, look for a little indentation that you can stick your finger in. Place a finger into this opening and pop the back off by applying light pressure."
                },
                {
                    "headline": "Remove the protective paper inside of your clock.",
                    "description": "The interior gears and fixtures of a cuckoo clock are sensitive and delicate. Consequently, there is usually some kind of tissue paper inside to keep them from moving around. Lift the tissue paper out carefully. Remove any flags or papers labelled “remove” or “pull out.” These flags and papers are slid in between mechanical gears to keep them from moving during shipment. Real cuckoo clocks use weights and gravity to turn the gears inside of the clock. The flags and papers help keep the gears from turning as the clock is moved or shipped. If there is a piece of cardboard under the drum inside of your clock, slide it out. The drum looks like a little coil with a platform. Do not remove the packaging underneath your clock. These are the weights and the chains. If you unpack them now, they may slide into the clock’s body as you’re mounting it. This could be disastrous if they get stuck in a gear."
                },
                {
                    "headline": "Insert batteries into the slots if your clock isn’t mechanical.",
                    "description": "With the tissue paper removed, inspect the interior of your clock. If you find plastic slots for batteries, consult your clock’s instructions to determine what kind of batteries the clock requires. Get the proper batteries and insert them into the battery holders to give the clock power.Tip: Battery-operated cuckoo clocks are usually much cheaper than their authentic counterparts. If your cuckoo clock feels really light when you lift it, like less than 1–3 pounds (450–1,360 g), it probably requires batteries to run. Mechanical clocks tend to have a little more weight to them. Most cuckoo clocks that are made of wood are mechanical. If your clock is made of plastic, this may be another sign that it runs on batteries. Sometimes, the battery packs to put your batteries in will be on the outside of the clock on the back or bottom."
                },
                {
                    "headline": "Put the back panel back on and shut the latch.",
                    "description": "With any batteries installed and the tissue paper removed, put the back panel back into place. Close and lock the latch using the same method that you used to unlock it. If you used your finger to pop a lockless panel off, slide it over the grooves for the panel and press it into the place."
                }
            ]
        },
        {
            "name": "Mounting Your Clock",
            "steps": [
                {
                    "headline": "Select a place to mount your clock based on its style.",
                    "description": "To figure out where you want to display your clock, look for a prominent wall to show it off. Once you’ve selected a wall, use a pencil to make a little hash mark and indicate the location where you want to hang the clock. If you have a 1-day clock, you can mount it anywhere. If you have an 8-day clock that weighs more than 25–30 pounds (11–14 kg), consider mounting the clock in a stud. Use a stud finder to find a wall stud in the room where you want to hang the clock.Tip: You only need 1 screw to mount a cuckoo clock. In fact, there is only 1 mounting hole. You couldn’t hang it with multiple screws if you wanted. The term “1-day” and “8-day” refer to how often you need to wind your clock up by raising the weights. A 1-day clock must be rewound daily, while an 8-day clock can be rewound once every week or so. Don’t mount your clock in your bedroom if you think the ticking might bother you at night or the cuckoo noises can’t be turned off. If there isn’t a switch or slide on the side of the clock, the noises cannot be turned off. You’ll notice that there is still packaging underneath the clock. Don’t worry—these pieces are unwrapped once the clock is mounted."
                },
                {
                    "headline": "Drill a 2–4 in (5.1–10.2 cm) screw into the wall where you marked it.",
                    "description": "Grab a drill and a screw with a minimum length of 2 inches (5.1 cm). Hold the screw over the pencil mark that you made and pull the trigger on the drill halfway down to slowly drill the screw into place. Leave at least ⁄2 in (1.3 cm) sticking out of the wall to hang your clock. The longer the screw, the more stable your clock will hang. 2 inches (5.1 cm) is a minimum length. For 8-day clocks that weigh more than a typical cuckoo clock, consult the manufacturer’s instructions on how long the screw has to be for a stable mount."
                },
                {
                    "headline": "Slide the screw into the opening at the top of the clock to hang it.",
                    "description": "With the screw installed, inspect the back of your clock to find an opening above the back panel. This is the mounting hole where the clock hangs on the screw. Carefully lift the clock up and slide this hole over the screw. Once the cuckoo clock’s back is flush against the wall, lower the clock slowly until it hangs on the screw. Adjust your clock by hand to ensure that the back is flush against the wall and the clock is level."
                },
                {
                    "headline": "Take the chains down once the cuckoo clock is mounted.",
                    "description": "With your clock on the wall, carefully reach under the clock and undo any rubber bands or tape on the packaging. The chains must be unpackaged with the clock on the wall. Unwrap the paper to release your clock’s chains. Let them hang down freely. These chains are connected to gears inside of the clock, and if you undo the packaging with the clock unmounted, they may pull on the gears or slide inside of the clock. This could break your clock’s interior components. If you have a closed cuckoo door above the face of the clock, slide it open so that the bird can pop out when the clock cuckoos."
                },
                {
                    "headline": "Hook the weights for the chimes and the pendulum on to the chains.",
                    "description": "With the chains hanging down, grab the weights that you set aside at the beginning. Inspect each end of the weights to find the loops. Then, inspect the front chains and find the end with a hook on it. Slide the hook around the loop on the weight and let it hang down freely. Repeat this process on the other weight. Hook the pendulum on the chain or panel in the back of the clock. The weight for the pendulum is usually a leaf, while the weights for the chimes are almost always pinecones. Some cuckoo clocks have 3 weights. Don’t worry about the weights pulling the clock down. They’re designed to be mounted like this!"
                }
            ]
        },
        {
            "name": "Setting the Time",
            "steps": [
                {
                    "headline": "Pull the lever on the side of the clock to lift the silencer if there is one.",
                    "description": "Look on the sides of your clock for a little latch or switch. If there is one, flip it or slide it in the opposite direction to unlock the silencer inside of your clock. If you ever want your clock to stop making noise, return this latch or switch to its original position. Most cuckoo clocks do not have this feature. If you don’t see a slide or a latch, don’t worry about this step."
                },
                {
                    "headline": "Move the minute hand clockwise until your clock cuckoos.",
                    "description": "Put your index finger on the top of the minute hand. Slowly and carefully, turn it clockwise until your clock makes its cuckoo noise. The minute hand is the only piece you need to set the time and turn the clock on.Warning: Do not turn the hour hand, as this may break an important gear inside of your clock. The cuckoo noise should either be triggered at the 30-minute mark or the 0-minute mark. If your clock doesn’t cuckoo, you either missed a latch for the silencer on the side, or your clock requires batteries and you didn’t see the battery holder. In either case, consult your instruction manual to determine what you missed."
                },
                {
                    "headline": "Continue turning the minute hand clockwise until the time is right.",
                    "description": "Once the clock has cuckooed once, it is triggered to begin operating and you can set the time. To do this, turn the minute hand clockwise. The hour hand will move with the minute hand as you turn it. Continue turning the minute hand until the time is accurate.Warning: Do not turn the minute hand counterclockwise if you accidentally pass your desired time. This can cause the clock to break. It’s really easy to set the time on the cuckoo clock. You simply turn the minute hand until it reads the correct time. If you ever forget to rewind your clock and the clock stops running, this is how you’ll reset the time."
                },
                {
                    "headline": "Rewind your clock periodically by pulling the hooks down on the weights.",
                    "description": "Cuckoo clocks rely on gravity from the weights to turn the gears. Rewinding the clock resets the weights and gives your clock the energy to continue running. To rewind your clock, lightly tug on the end of the chain that doesn’t have a weight on it. Pull the chain down until the weight is raised to the bottom of the clock. For 1-day clocks, do this daily. For 8-day clocks, the weights are lowered at a slower rate. Reset them once every 7-9 days. Never pull on the weights themselves. This can damage the gears inside of your clock."
                }
            ]
        }
    ],
    "tyn": [
        "Cuckoo clock",
        "Long #8 or #10 wood screw",
        "Drill or screwdriver",
        "Stud finder",
        "Secondary clock, watch, or similar time-keeping device"
    ],
    "text": " Removing the Packaging Take your clock out of the packaging carefully. Open the box with scissors or a utility knife. Cuckoo clocks are always shipped and sold with a lot of packing material to keep the carefully-constructed ornaments and face from breaking during travel. Move any packaging aside. Grab the roof of the clock where it sticks out by the side and carefully lift the clock out of the box. Lifting the clock by the roof ensures that you don’t accidentally rip an ornament or fixture off of the clock. Set the weights and pendulum aside. These are almost always a leaf and 2-3 acorns. These are the pieces that hang down from your clock. They’re installed after you’ve mounted the clock though. Place your cuckoo clock face-down on a soft surface. Set out a large blanket or soft pillow. Carefully place your clock face-down on the surface. Be extremely delicate while doing this to avoid breaking any ornaments on the face. If you use a blanket, fold it over a few times before putting your cuckoo clock down on it. Remove the back panel by flipping or sliding the latch. The back panel is usually locked by a sliding bolt or hook, but this part of the cuckoo clock is different on every model. Look around the back panel for a 1–2 in (2.5–5.1 cm) latch, lock, hook, or hinge. Unlock it by hand and carefully lift the back panel off of the clock. Set it aside. Some cuckoo clocks don’t have a latch keeping the back panel in place. If you don’t see a latch, look for a little indentation that you can stick your finger in. Place a finger into this opening and pop the back off by applying light pressure. Remove the protective paper inside of your clock. The interior gears and fixtures of a cuckoo clock are sensitive and delicate. Consequently, there is usually some kind of tissue paper inside to keep them from moving around. Lift the tissue paper out carefully. Remove any flags or papers labelled “remove” or “pull out.” These flags and papers are slid in between mechanical gears to keep them from moving during shipment. Real cuckoo clocks use weights and gravity to turn the gears inside of the clock. The flags and papers help keep the gears from turning as the clock is moved or shipped. If there is a piece of cardboard under the drum inside of your clock, slide it out. The drum looks like a little coil with a platform. Do not remove the packaging underneath your clock. These are the weights and the chains. If you unpack them now, they may slide into the clock’s body as you’re mounting it. This could be disastrous if they get stuck in a gear. Insert batteries into the slots if your clock isn’t mechanical. With the tissue paper removed, inspect the interior of your clock. If you find plastic slots for batteries, consult your clock’s instructions to determine what kind of batteries the clock requires. Get the proper batteries and insert them into the battery holders to give the clock power.Tip: Battery-operated cuckoo clocks are usually much cheaper than their authentic counterparts. If your cuckoo clock feels really light when you lift it, like less than 1–3 pounds (450–1,360 g), it probably requires batteries to run. Mechanical clocks tend to have a little more weight to them. Most cuckoo clocks that are made of wood are mechanical. If your clock is made of plastic, this may be another sign that it runs on batteries. Sometimes, the battery packs to put your batteries in will be on the outside of the clock on the back or bottom. Put the back panel back on and shut the latch. With any batteries installed and the tissue paper removed, put the back panel back into place. Close and lock the latch using the same method that you used to unlock it. If you used your finger to pop a lockless panel off, slide it over the grooves for the panel and press it into the place. Mounting Your Clock Select a place to mount your clock based on its style. To figure out where you want to display your clock, look for a prominent wall to show it off. Once you’ve selected a wall, use a pencil to make a little hash mark and indicate the location where you want to hang the clock. If you have a 1-day clock, you can mount it anywhere. If you have an 8-day clock that weighs more than 25–30 pounds (11–14 kg), consider mounting the clock in a stud. Use a stud finder to find a wall stud in the room where you want to hang the clock.Tip: You only need 1 screw to mount a cuckoo clock. In fact, there is only 1 mounting hole. You couldn’t hang it with multiple screws if you wanted. The term “1-day” and “8-day” refer to how often you need to wind your clock up by raising the weights. A 1-day clock must be rewound daily, while an 8-day clock can be rewound once every week or so. Don’t mount your clock in your bedroom if you think the ticking might bother you at night or the cuckoo noises can’t be turned off. If there isn’t a switch or slide on the side of the clock, the noises cannot be turned off. You’ll notice that there is still packaging underneath the clock. Don’t worry—these pieces are unwrapped once the clock is mounted. Drill a 2–4 in (5.1–10.2 cm) screw into the wall where you marked it. Grab a drill and a screw with a minimum length of 2 inches (5.1 cm). Hold the screw over the pencil mark that you made and pull the trigger on the drill halfway down to slowly drill the screw into place. Leave at least ⁄2 in (1.3 cm) sticking out of the wall to hang your clock. The longer the screw, the more stable your clock will hang. 2 inches (5.1 cm) is a minimum length. For 8-day clocks that weigh more than a typical cuckoo clock, consult the manufacturer’s instructions on how long the screw has to be for a stable mount. Slide the screw into the opening at the top of the clock to hang it. With the screw installed, inspect the back of your clock to find an opening above the back panel. This is the mounting hole where the clock hangs on the screw. Carefully lift the clock up and slide this hole over the screw. Once the cuckoo clock’s back is flush against the wall, lower the clock slowly until it hangs on the screw. Adjust your clock by hand to ensure that the back is flush against the wall and the clock is level. Take the chains down once the cuckoo clock is mounted. With your clock on the wall, carefully reach under the clock and undo any rubber bands or tape on the packaging. The chains must be unpackaged with the clock on the wall. Unwrap the paper to release your clock’s chains. Let them hang down freely. These chains are connected to gears inside of the clock, and if you undo the packaging with the clock unmounted, they may pull on the gears or slide inside of the clock. This could break your clock’s interior components. If you have a closed cuckoo door above the face of the clock, slide it open so that the bird can pop out when the clock cuckoos. Hook the weights for the chimes and the pendulum on to the chains. With the chains hanging down, grab the weights that you set aside at the beginning. Inspect each end of the weights to find the loops. Then, inspect the front chains and find the end with a hook on it. Slide the hook around the loop on the weight and let it hang down freely. Repeat this process on the other weight. Hook the pendulum on the chain or panel in the back of the clock. The weight for the pendulum is usually a leaf, while the weights for the chimes are almost always pinecones. Some cuckoo clocks have 3 weights. Don’t worry about the weights pulling the clock down. They’re designed to be mounted like this! Setting the Time Pull the lever on the side of the clock to lift the silencer if there is one. Look on the sides of your clock for a little latch or switch. If there is one, flip it or slide it in the opposite direction to unlock the silencer inside of your clock. If you ever want your clock to stop making noise, return this latch or switch to its original position. Most cuckoo clocks do not have this feature. If you don’t see a slide or a latch, don’t worry about this step. Move the minute hand clockwise until your clock cuckoos. Put your index finger on the top of the minute hand. Slowly and carefully, turn it clockwise until your clock makes its cuckoo noise. The minute hand is the only piece you need to set the time and turn the clock on.Warning: Do not turn the hour hand, as this may break an important gear inside of your clock. The cuckoo noise should either be triggered at the 30-minute mark or the 0-minute mark. If your clock doesn’t cuckoo, you either missed a latch for the silencer on the side, or your clock requires batteries and you didn’t see the battery holder. In either case, consult your instruction manual to determine what you missed. Continue turning the minute hand clockwise until the time is right. Once the clock has cuckooed once, it is triggered to begin operating and you can set the time. To do this, turn the minute hand clockwise. The hour hand will move with the minute hand as you turn it. Continue turning the minute hand until the time is accurate.Warning: Do not turn the minute hand counterclockwise if you accidentally pass your desired time. This can cause the clock to break. It’s really easy to set the time on the cuckoo clock. You simply turn the minute hand until it reads the correct time. If you ever forget to rewind your clock and the clock stops running, this is how you’ll reset the time. Rewind your clock periodically by pulling the hooks down on the weights. Cuckoo clocks rely on gravity from the weights to turn the gears. Rewinding the clock resets the weights and gives your clock the energy to continue running. To rewind your clock, lightly tug on the end of the chain that doesn’t have a weight on it. Pull the chain down until the weight is raised to the bottom of the clock. For 1-day clocks, do this daily. For 8-day clocks, the weights are lowered at a slower rate. Reset them once every 7-9 days. Never pull on the weights themselves. This can damage the gears inside of your clock.",
    "sentences": [
        " Removing the Packaging Take your clock out of the packaging carefully.",
        "Open the box with scissors or a utility knife.",
        "Cuckoo clocks are always shipped and sold with a lot of packing material to keep the carefully-constructed ornaments and face from breaking during travel.",
        "Move any packaging aside.",
        "Grab the roof of the clock where it sticks out by the side and carefully lift the clock out of the box.",
        "Lifting the clock by the roof ensures that you don’t accidentally rip an ornament or fixture off of the clock.",
        "Set the weights and pendulum aside.",
        "These are almost always a leaf and 2-3 acorns.",
        "These are the pieces that hang down from your clock.",
        "They’re installed after you’ve mounted the clock though.",
        "Place your cuckoo clock face-down on a soft surface.",
        "Set out a large blanket or soft pillow.",
        "Carefully place your clock face-down on the surface.",
        "Be extremely delicate while doing this to avoid breaking any ornaments on the face.",
        "If you use a blanket, fold it over a few times before putting your cuckoo clock down on it.",
        "Remove the back panel by flipping or sliding the latch.",
        "The back panel is usually locked by a sliding bolt or hook, but this part of the cuckoo clock is different on every model.",
        "Look around the back panel for a 1–2 in (2.5–5.1 cm) latch, lock, hook, or hinge.",
        "Unlock it by hand and carefully lift the back panel off of the clock.",
        "Set it aside.",
        "Some cuckoo clocks don’t have a latch keeping the back panel in place.",
        "If you don’t see a latch, look for a little indentation that you can stick your finger in.",
        "Place a finger into this opening and pop the back off by applying light pressure.",
        "Remove the protective paper inside of your clock.",
        "The interior gears and fixtures of a cuckoo clock are sensitive and delicate.",
        "Consequently, there is usually some kind of tissue paper inside to keep them from moving around.",
        "Lift the tissue paper out carefully.",
        "Remove any flags or papers labelled “remove” or “pull out.” These flags and papers are slid in between mechanical gears to keep them from moving during shipment.",
        "Real cuckoo clocks use weights and gravity to turn the gears inside of the clock.",
        "The flags and papers help keep the gears from turning as the clock is moved or shipped.",
        "If there is a piece of cardboard under the drum inside of your clock, slide it out.",
        "The drum looks like a little coil with a platform.",
        "Do not remove the packaging underneath your clock.",
        "These are the weights and the chains.",
        "If you unpack them now, they may slide into the clock’s body as you’re mounting it.",
        "This could be disastrous if they get stuck in a gear.",
        "Insert batteries into the slots if your clock isn’t mechanical.",
        "With the tissue paper removed, inspect the interior of your clock.",
        "If you find plastic slots for batteries, consult your clock’s instructions to determine what kind of batteries the clock requires.",
        "Get the proper batteries and insert them into the battery holders to give the clock power.Tip: Battery-operated cuckoo clocks are usually much cheaper than their authentic counterparts.",
        "If your cuckoo clock feels really light when you lift it, like less than 1–3 pounds (450–1,360 g), it probably requires batteries to run.",
        "Mechanical clocks tend to have a little more weight to them.",
        "Most cuckoo clocks that are made of wood are mechanical.",
        "If your clock is made of plastic, this may be another sign that it runs on batteries.",
        "Sometimes, the battery packs to put your batteries in will be on the outside of the clock on the back or bottom.",
        "Put the back panel back on and shut the latch.",
        "With any batteries installed and the tissue paper removed, put the back panel back into place.",
        "Close and lock the latch using the same method that you used to unlock it.",
        "If you used your finger to pop a lockless panel off, slide it over the grooves for the panel and press it into the place.",
        "Mounting Your Clock Select a place to mount your clock based on its style.",
        "To figure out where you want to display your clock, look for a prominent wall to show it off.",
        "Once you’ve selected a wall, use a pencil to make a little hash mark and indicate the location where you want to hang the clock.",
        "If you have a 1-day clock, you can mount it anywhere.",
        "If you have an 8-day clock that weighs more than 25–30 pounds (11–14 kg), consider mounting the clock in a stud.",
        "Use a stud finder to find a wall stud in the room where you want to hang the clock.Tip: You only need 1 screw to mount a cuckoo clock.",
        "In fact, there is only 1 mounting hole.",
        "You couldn’t hang it with multiple screws if you wanted.",
        "The term “1-day” and “8-day” refer to how often you need to wind your clock up by raising the weights.",
        "A 1-day clock must be rewound daily, while an 8-day clock can be rewound once every week or so.",
        "Don’t mount your clock in your bedroom if you think the ticking might bother you at night or the cuckoo noises can’t be turned off.",
        "If there isn’t a switch or slide on the side of the clock, the noises cannot be turned off.",
        "You’ll notice that there is still packaging underneath the clock.",
        "Don’t worry—these pieces are unwrapped once the clock is mounted.",
        "Drill a 2–4 in (5.1–10.2 cm) screw into the wall where you marked it.",
        "Grab a drill and a screw with a minimum length of 2 inches (5.1 cm).",
        "Hold the screw over the pencil mark that you made and pull the trigger on the drill halfway down to slowly drill the screw into place.",
        "Leave at least ⁄2 in (1.3 cm) sticking out of the wall to hang your clock.",
        "The longer the screw, the more stable your clock will hang.",
        "2 inches (5.1 cm) is a minimum length.",
        "For 8-day clocks that weigh more than a typical cuckoo clock, consult the manufacturer’s instructions on how long the screw has to be for a stable mount.",
        "Slide the screw into the opening at the top of the clock to hang it.",
        "With the screw installed, inspect the back of your clock to find an opening above the back panel.",
        "This is the mounting hole where the clock hangs on the screw.",
        "Carefully lift the clock up and slide this hole over the screw.",
        "Once the cuckoo clock’s back is flush against the wall, lower the clock slowly until it hangs on the screw.",
        "Adjust your clock by hand to ensure that the back is flush against the wall and the clock is level.",
        "Take the chains down once the cuckoo clock is mounted.",
        "With your clock on the wall, carefully reach under the clock and undo any rubber bands or tape on the packaging.",
        "The chains must be unpackaged with the clock on the wall.",
        "Unwrap the paper to release your clock’s chains.",
        "Let them hang down freely.",
        "These chains are connected to gears inside of the clock, and if you undo the packaging with the clock unmounted, they may pull on the gears or slide inside of the clock.",
        "This could break your clock’s interior components.",
        "If you have a closed cuckoo door above the face of the clock, slide it open so that the bird can pop out when the clock cuckoos.",
        "Hook the weights for the chimes and the pendulum on to the chains.",
        "With the chains hanging down, grab the weights that you set aside at the beginning.",
        "Inspect each end of the weights to find the loops.",
        "Then, inspect the front chains and find the end with a hook on it.",
        "Slide the hook around the loop on the weight and let it hang down freely.",
        "Repeat this process on the other weight.",
        "Hook the pendulum on the chain or panel in the back of the clock.",
        "The weight for the pendulum is usually a leaf, while the weights for the chimes are almost always pinecones.",
        "Some cuckoo clocks have 3 weights.",
        "Don’t worry about the weights pulling the clock down.",
        "They’re designed to be mounted like this!",
        "Setting the Time Pull the lever on the side of the clock to lift the silencer if there is one.",
        "Look on the sides of your clock for a little latch or switch.",
        "If there is one, flip it or slide it in the opposite direction to unlock the silencer inside of your clock.",
        "If you ever want your clock to stop making noise, return this latch or switch to its original position.",
        "Most cuckoo clocks do not have this feature.",
        "If you don’t see a slide or a latch, don’t worry about this step.",
        "Move the minute hand clockwise until your clock cuckoos.",
        "Put your index finger on the top of the minute hand.",
        "Slowly and carefully, turn it clockwise until your clock makes its cuckoo noise.",
        "The minute hand is the only piece you need to set the time and turn the clock on.Warning: Do not turn the hour hand, as this may break an important gear inside of your clock.",
        "The cuckoo noise should either be triggered at the 30-minute mark or the 0-minute mark.",
        "If your clock doesn’t cuckoo, you either missed a latch for the silencer on the side, or your clock requires batteries and you didn’t see the battery holder.",
        "In either case, consult your instruction manual to determine what you missed.",
        "Continue turning the minute hand clockwise until the time is right.",
        "Once the clock has cuckooed once, it is triggered to begin operating and you can set the time.",
        "To do this, turn the minute hand clockwise.",
        "The hour hand will move with the minute hand as you turn it.",
        "Continue turning the minute hand until the time is accurate.Warning: Do not turn the minute hand counterclockwise if you accidentally pass your desired time.",
        "This can cause the clock to break.",
        "It’s really easy to set the time on the cuckoo clock.",
        "You simply turn the minute hand until it reads the correct time.",
        "If you ever forget to rewind your clock and the clock stops running, this is how you’ll reset the time.",
        "Rewind your clock periodically by pulling the hooks down on the weights.",
        "Cuckoo clocks rely on gravity from the weights to turn the gears.",
        "Rewinding the clock resets the weights and gives your clock the energy to continue running.",
        "To rewind your clock, lightly tug on the end of the chain that doesn’t have a weight on it.",
        "Pull the chain down until the weight is raised to the bottom of the clock.",
        "For 1-day clocks, do this daily.",
        "For 8-day clocks, the weights are lowered at a slower rate.",
        "Reset them once every 7-9 days.",
        "Never pull on the weights themselves.",
        "This can damage the gears inside of your clock."
    ]
}