{
    "title": "How to Dress Like a Yuppie",
    "url": "https://www.wikihow.com/Dress-Like-a-Yuppie",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Costumes",
        "Historical Costumes",
        "Twentieth Century Costumes",
        "1980s Costumes and Fashion"
    ],
    "parts": [
        {
            "name": "Wearing Yuppie Clothing",
            "steps": [
                {
                    "headline": "Start with tailored shirts.",
                    "description": "Both men and women embrace the simple and stylish look of a button down shirt fitted on the sides and freshly pressed. Wool and merino sweaters over a button down are still a yuppie classic. Casual tailored clothing, like you find at The Gap, J Crew or Banana Republic is a good place to start looking. Better yet, find some small designer fashion shops in your local urban neighborhood."
                },
                {
                    "headline": "Wear a white or grey t-shirt.",
                    "description": "V-necks are popular. This is common to both the hipster and yuppie styles; however, yuppies usually wear softer, more expensive brands."
                },
                {
                    "headline": "Choose skinny jeans.",
                    "description": "Men should choose tailored, slim fit jeans, while women opt for skinny jeans in crops or full-length. Jeans are some of the most expensive items in the wardrobe, from brands where they are hand-dyed and made with high-quality denim."
                },
                {
                    "headline": "Invest in some tailored blazers.",
                    "description": "They will be valuable in your professional life. Start collecting, and don’t be afraid to try some contrasting colored lapels or new designs, since they will get you noticed in the office."
                },
                {
                    "headline": "Buy a suit.",
                    "description": "Male yuppies will find a lot of value in one or two slim fit suits. Consider adding in a waistcoat, cufflinks, a bow tie or a skinny tie to be even more stylish."
                },
                {
                    "headline": "Invest in figure flattering dresses and skirts.",
                    "description": "Female yuppies look stylish in pencil skirts, peplum tops, shirtdresses and other classic styles. Tapered skirts are preferred to A-line varieties."
                },
                {
                    "headline": "Choose leather shoes.",
                    "description": "A yuppie stops buying low quality and aims to invest in pairs of boots or shoes that can be worn and cared for. Although leather is the most common investment, vegan leather shoes in high quality brands are also an option."
                }
            ]
        },
        {
            "name": "Accessorizing a Yuppie Look",
            "steps": [
                {
                    "headline": "Get a regular haircut.",
                    "description": "The bedhead look of the early 20s is over, and regular stylish haircuts are essential for both men and women. This attention to appearance is as important at the office as it is on the social scene."
                },
                {
                    "headline": "Purchase a few scarves.",
                    "description": "Borrowing from the hipster scene, men and women alike wear scarves over simple shirts, thermals, and button downs. Women can use them for dresses as well."
                },
                {
                    "headline": "Choose your coats carefully.",
                    "description": "Leather coats are back in style, although they should be short and lack shoulder pads. Winter coats in felt and down and spring jackets in tweed are also popular. If you enjoy the outdoors, invest in coats from Pendleton, Patagonia or Woolriches, which are known as western high-class, but practical brands."
                },
                {
                    "headline": "Invest in sunglasses.",
                    "description": "A $100 to $200 pair of sunglasses shows off success in the same way a watch used to."
                },
                {
                    "headline": "Get an iPhone, Google glass or an Apple watch.",
                    "description": "Yuppies today stay on top of the newest technological trends. Headphones and Bluetooth accessories are also common to the yuppie crowd."
                },
                {
                    "headline": "Buy a designer bag.",
                    "description": "Men can go with a leather or canvas messenger bag. Women often choose a designer brand, like coach, Sophie Hulmes, Michael Kors or Chloe show off wealth, although they might cost as much as a whole paycheck."
                },
                {
                    "headline": "Grab a coffee from your local coffee roaster.",
                    "description": "Fancy coffees and teas indicate disposable income. If you are able to buy one in the morning and afternoon, you show your desire to invest in artisan food."
                }
            ]
        }
    ],
    "tyn": [
        "Tailored shirts",
        "Tailored blazers",
        "Merino sweaters",
        "Slim fit suits",
        "White/grey v-neck t-shirts",
        "Scarves",
        "Leather boots/shoes",
        "Pencil skirts",
        "Fashion-forward dresses",
        "Skinny/tailored jeans",
        "Designer handbags",
        "Designer sunglasses",
        "Smart phone/watch or glasses",
        "Bluetooth accessories",
        "Haircut",
        "Quality coat"
    ],
    "text": " Wearing Yuppie Clothing Start with tailored shirts. Both men and women embrace the simple and stylish look of a button down shirt fitted on the sides and freshly pressed. Wool and merino sweaters over a button down are still a yuppie classic. Casual tailored clothing, like you find at The Gap, J Crew or Banana Republic is a good place to start looking. Better yet, find some small designer fashion shops in your local urban neighborhood. Wear a white or grey t-shirt. V-necks are popular. This is common to both the hipster and yuppie styles; however, yuppies usually wear softer, more expensive brands. Choose skinny jeans. Men should choose tailored, slim fit jeans, while women opt for skinny jeans in crops or full-length. Jeans are some of the most expensive items in the wardrobe, from brands where they are hand-dyed and made with high-quality denim. Invest in some tailored blazers. They will be valuable in your professional life. Start collecting, and don’t be afraid to try some contrasting colored lapels or new designs, since they will get you noticed in the office. Buy a suit. Male yuppies will find a lot of value in one or two slim fit suits. Consider adding in a waistcoat, cufflinks, a bow tie or a skinny tie to be even more stylish. Invest in figure flattering dresses and skirts. Female yuppies look stylish in pencil skirts, peplum tops, shirtdresses and other classic styles. Tapered skirts are preferred to A-line varieties. Choose leather shoes. A yuppie stops buying low quality and aims to invest in pairs of boots or shoes that can be worn and cared for. Although leather is the most common investment, vegan leather shoes in high quality brands are also an option. Accessorizing a Yuppie Look Get a regular haircut. The bedhead look of the early 20s is over, and regular stylish haircuts are essential for both men and women. This attention to appearance is as important at the office as it is on the social scene. Purchase a few scarves. Borrowing from the hipster scene, men and women alike wear scarves over simple shirts, thermals, and button downs. Women can use them for dresses as well. Choose your coats carefully. Leather coats are back in style, although they should be short and lack shoulder pads. Winter coats in felt and down and spring jackets in tweed are also popular. If you enjoy the outdoors, invest in coats from Pendleton, Patagonia or Woolriches, which are known as western high-class, but practical brands. Invest in sunglasses. A $100 to $200 pair of sunglasses shows off success in the same way a watch used to. Get an iPhone, Google glass or an Apple watch. Yuppies today stay on top of the newest technological trends. Headphones and Bluetooth accessories are also common to the yuppie crowd. Buy a designer bag. Men can go with a leather or canvas messenger bag. Women often choose a designer brand, like coach, Sophie Hulmes, Michael Kors or Chloe show off wealth, although they might cost as much as a whole paycheck. Grab a coffee from your local coffee roaster. Fancy coffees and teas indicate disposable income. If you are able to buy one in the morning and afternoon, you show your desire to invest in artisan food.",
    "sentences": [
        " Wearing Yuppie Clothing Start with tailored shirts.",
        "Both men and women embrace the simple and stylish look of a button down shirt fitted on the sides and freshly pressed.",
        "Wool and merino sweaters over a button down are still a yuppie classic.",
        "Casual tailored clothing, like you find at The Gap, J Crew or Banana Republic is a good place to start looking.",
        "Better yet, find some small designer fashion shops in your local urban neighborhood.",
        "Wear a white or grey t-shirt.",
        "V-necks are popular.",
        "This is common to both the hipster and yuppie styles; however, yuppies usually wear softer, more expensive brands.",
        "Choose skinny jeans.",
        "Men should choose tailored, slim fit jeans, while women opt for skinny jeans in crops or full-length.",
        "Jeans are some of the most expensive items in the wardrobe, from brands where they are hand-dyed and made with high-quality denim.",
        "Invest in some tailored blazers.",
        "They will be valuable in your professional life.",
        "Start collecting, and don’t be afraid to try some contrasting colored lapels or new designs, since they will get you noticed in the office.",
        "Buy a suit.",
        "Male yuppies will find a lot of value in one or two slim fit suits.",
        "Consider adding in a waistcoat, cufflinks, a bow tie or a skinny tie to be even more stylish.",
        "Invest in figure flattering dresses and skirts.",
        "Female yuppies look stylish in pencil skirts, peplum tops, shirtdresses and other classic styles.",
        "Tapered skirts are preferred to A-line varieties.",
        "Choose leather shoes.",
        "A yuppie stops buying low quality and aims to invest in pairs of boots or shoes that can be worn and cared for.",
        "Although leather is the most common investment, vegan leather shoes in high quality brands are also an option.",
        "Accessorizing a Yuppie Look Get a regular haircut.",
        "The bedhead look of the early 20s is over, and regular stylish haircuts are essential for both men and women.",
        "This attention to appearance is as important at the office as it is on the social scene.",
        "Purchase a few scarves.",
        "Borrowing from the hipster scene, men and women alike wear scarves over simple shirts, thermals, and button downs.",
        "Women can use them for dresses as well.",
        "Choose your coats carefully.",
        "Leather coats are back in style, although they should be short and lack shoulder pads.",
        "Winter coats in felt and down and spring jackets in tweed are also popular.",
        "If you enjoy the outdoors, invest in coats from Pendleton, Patagonia or Woolriches, which are known as western high-class, but practical brands.",
        "Invest in sunglasses.",
        "A $100 to $200 pair of sunglasses shows off success in the same way a watch used to.",
        "Get an iPhone, Google glass or an Apple watch.",
        "Yuppies today stay on top of the newest technological trends.",
        "Headphones and Bluetooth accessories are also common to the yuppie crowd.",
        "Buy a designer bag.",
        "Men can go with a leather or canvas messenger bag.",
        "Women often choose a designer brand, like coach, Sophie Hulmes, Michael Kors or Chloe show off wealth, although they might cost as much as a whole paycheck.",
        "Grab a coffee from your local coffee roaster.",
        "Fancy coffees and teas indicate disposable income.",
        "If you are able to buy one in the morning and afternoon, you show your desire to invest in artisan food."
    ]
}