{
    "title": "How to Make Gluten Free Lemon Cookies with Soy Flour",
    "url": "https://www.wikihow.com/Make-Gluten-Free-Lemon-Cookies-with-Soy-Flour",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Specialty Diet Recipes",
        "Gluten Free Dishes"
    ],
    "steps": [
        {
            "headline": "Preheat your oven to 325°F.",
            "description": "These cookies need light cooking so the temperature needs to be low."
        },
        {
            "headline": "Mix the oil and sugar together in a bowl.",
            "description": "Use a whisk or spoon to accomplish this."
        },
        {
            "headline": "Slowly pour in the lemon extract.",
            "description": "Measure correctly and avoid spills, or else your cookies will taste too sour!"
        },
        {
            "headline": "Mix again until the lemon extract has been blended into the mixture.",
            "description": "Leave the bowl aside."
        },
        {
            "headline": "Sift all the dry ingredients; the soy flour, salt, and baking powder in a separate bowl.",
            "description": "Sift about three times, until the soy flour looks fluffy and smooth."
        },
        {
            "headline": "Add your oil and sugar mixture to the dry ingredients.",
            "description": "Mix until it starts looking like cookie dough."
        },
        {
            "headline": "Add the tablespoons of water.",
            "description": "The water helps the cookies from crumbling. If your cookies keep crumbling, add a teaspoon more water. Don't put any more because the lemon flavor will wash away."
        },
        {
            "headline": "Get a cookie pan and use baking grease to spray the pan.",
            "description": "This grease keeps the cookies from sticking on the sheet, and won't cause a disaster when you wash those dishes."
        },
        {
            "headline": "Using a teaspoon, drop the dough onto your cookie sheet.",
            "description": "Keep adding them until there is no more dough."
        },
        {
            "headline": "Using a fork, push a cookie down, making tic-tac-toes.",
            "description": "Do that to all the cookies."
        },
        {
            "headline": "Place them in the oven and have them cook for fifteen minutes.",
            "description": ""
        },
        {
            "headline": "Take the cookies out of the oven and have them cool on a wire rack for ten minutes.",
            "description": "Don't eat the cookies when they are hot, they'll start to crumble."
        },
        {
            "headline": "Finished.",
            "description": ""
        }
    ],
    "tyn": [
        "2 bowls",
        "Whisk or spoon",
        "Fork",
        "Baking grease",
        "Cookie tray"
    ],
    "text": " Preheat your oven to 325°F. These cookies need light cooking so the temperature needs to be low. Mix the oil and sugar together in a bowl. Use a whisk or spoon to accomplish this. Slowly pour in the lemon extract. Measure correctly and avoid spills, or else your cookies will taste too sour! Mix again until the lemon extract has been blended into the mixture. Leave the bowl aside. Sift all the dry ingredients; the soy flour, salt, and baking powder in a separate bowl. Sift about three times, until the soy flour looks fluffy and smooth. Add your oil and sugar mixture to the dry ingredients. Mix until it starts looking like cookie dough. Add the tablespoons of water. The water helps the cookies from crumbling. If your cookies keep crumbling, add a teaspoon more water. Don't put any more because the lemon flavor will wash away. Get a cookie pan and use baking grease to spray the pan. This grease keeps the cookies from sticking on the sheet, and won't cause a disaster when you wash those dishes. Using a teaspoon, drop the dough onto your cookie sheet. Keep adding them until there is no more dough. Using a fork, push a cookie down, making tic-tac-toes. Do that to all the cookies. Place them in the oven and have them cook for fifteen minutes.  Take the cookies out of the oven and have them cool on a wire rack for ten minutes. Don't eat the cookies when they are hot, they'll start to crumble. Finished. ",
    "sentences": [
        " Preheat your oven to 325°F.",
        "These cookies need light cooking so the temperature needs to be low.",
        "Mix the oil and sugar together in a bowl.",
        "Use a whisk or spoon to accomplish this.",
        "Slowly pour in the lemon extract.",
        "Measure correctly and avoid spills, or else your cookies will taste too sour!",
        "Mix again until the lemon extract has been blended into the mixture.",
        "Leave the bowl aside.",
        "Sift all the dry ingredients; the soy flour, salt, and baking powder in a separate bowl.",
        "Sift about three times, until the soy flour looks fluffy and smooth.",
        "Add your oil and sugar mixture to the dry ingredients.",
        "Mix until it starts looking like cookie dough.",
        "Add the tablespoons of water.",
        "The water helps the cookies from crumbling.",
        "If your cookies keep crumbling, add a teaspoon more water.",
        "Don't put any more because the lemon flavor will wash away.",
        "Get a cookie pan and use baking grease to spray the pan.",
        "This grease keeps the cookies from sticking on the sheet, and won't cause a disaster when you wash those dishes.",
        "Using a teaspoon, drop the dough onto your cookie sheet.",
        "Keep adding them until there is no more dough.",
        "Using a fork, push a cookie down, making tic-tac-toes.",
        "Do that to all the cookies.",
        "Place them in the oven and have them cook for fifteen minutes.",
        "Take the cookies out of the oven and have them cool on a wire rack for ten minutes.",
        "Don't eat the cookies when they are hot, they'll start to crumble.",
        "Finished."
    ]
}