{
    "title": "How to Make Salted Cucumbers",
    "url": "https://www.wikihow.com/Make-Salted-Cucumbers",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables"
    ],
    "methods": [
        {
            "name": "Salting with a cooked pickle",
            "steps": [
                {
                    "headline": "Place a jar on the counter.",
                    "description": "On the bottom of the jar, layer some dill, garlic, currant leaves and radish leaf."
                },
                {
                    "headline": "Place the cucumbers in the jar tightly.",
                    "description": "Do not force in so many that you crush them though."
                },
                {
                    "headline": "Make a pickle.",
                    "description": "Boil water with salt and a few grains of black pepper. Do not put too much salt. Take a proportion: 2 tablespoons of salt on 1 liter of water. Cool the pickle a little, then pour it into the jar."
                },
                {
                    "headline": "Leave the jar in a warm place.",
                    "description": "A day later, the salted cucumbers will be ready."
                }
            ]
        },
        {
            "name": "Salting with a cold pickle",
            "steps": [
                {
                    "headline": "Pour cold pickle over the cucumbers in a jar.",
                    "description": "Then leave it in the kitchen. You will have good crispy salted cucumbers after 2 days."
                },
                {
                    "headline": "When cucumbers are ready, cover them and put into a fridge.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Salting without a pickle",
            "steps": [
                {
                    "headline": "Cut cucumbers lengthwise into two pieces and place in a bowl.",
                    "description": ""
                },
                {
                    "headline": "Peel a few cloves of garlic.",
                    "description": "Crush the cloves."
                },
                {
                    "headline": "Chop the dill.",
                    "description": ""
                },
                {
                    "headline": "Put the garlic and dill with the cucumbers.",
                    "description": ""
                },
                {
                    "headline": "Salt the mixture and mix it by hand, so that all ingredients are well-balanced.",
                    "description": "Put the mixed cucumbers in a polythene bag and tie it, pre-releasing all the air."
                },
                {
                    "headline": "Leave it for an hour.",
                    "description": "After an hour, the salted cucumbers are ready."
                }
            ]
        },
        {
            "name": "Salted cucumbers in 5 minutes",
            "steps": [
                {
                    "headline": "Slice cucumbers in two or four pieces, or chop across in large chunks.",
                    "description": ""
                },
                {
                    "headline": "Put the slices or chunks in a plastic container with a lid.",
                    "description": ""
                },
                {
                    "headline": "Chop some fresh dill, a few cloves of garlic and a piece of radish root.",
                    "description": "Put the chopped ingredients in with the cucumbers."
                },
                {
                    "headline": "Salt the contents of the container.",
                    "description": "Then close tightly with a lid."
                },
                {
                    "headline": "Strongly shake the container for a couple of minutes.",
                    "description": "Your salted cucumbers are ready."
                }
            ]
        }
    ],
    "tyn": [
        "Jar",
        "Polythene bag or container with lid",
        "Cutting board and knife",
        "Saucepan (where relevant)"
    ],
    "text": " Salting with a cooked pickle Place a jar on the counter. On the bottom of the jar, layer some dill, garlic, currant leaves and radish leaf. Place the cucumbers in the jar tightly. Do not force in so many that you crush them though. Make a pickle. Boil water with salt and a few grains of black pepper. Do not put too much salt. Take a proportion: 2 tablespoons of salt on 1 liter of water. Cool the pickle a little, then pour it into the jar. Leave the jar in a warm place. A day later, the salted cucumbers will be ready. Salting with a cold pickle Pour cold pickle over the cucumbers in a jar. Then leave it in the kitchen. You will have good crispy salted cucumbers after 2 days. When cucumbers are ready, cover them and put into a fridge.  Salting without a pickle Cut cucumbers lengthwise into two pieces and place in a bowl.  Peel a few cloves of garlic. Crush the cloves. Chop the dill.  Put the garlic and dill with the cucumbers.  Salt the mixture and mix it by hand, so that all ingredients are well-balanced. Put the mixed cucumbers in a polythene bag and tie it, pre-releasing all the air. Leave it for an hour. After an hour, the salted cucumbers are ready. Salted cucumbers in 5 minutes Slice cucumbers in two or four pieces, or chop across in large chunks.  Put the slices or chunks in a plastic container with a lid.  Chop some fresh dill, a few cloves of garlic and a piece of radish root. Put the chopped ingredients in with the cucumbers. Salt the contents of the container. Then close tightly with a lid. Strongly shake the container for a couple of minutes. Your salted cucumbers are ready.",
    "sentences": [
        " Salting with a cooked pickle Place a jar on the counter.",
        "On the bottom of the jar, layer some dill, garlic, currant leaves and radish leaf.",
        "Place the cucumbers in the jar tightly.",
        "Do not force in so many that you crush them though.",
        "Make a pickle.",
        "Boil water with salt and a few grains of black pepper.",
        "Do not put too much salt.",
        "Take a proportion: 2 tablespoons of salt on 1 liter of water.",
        "Cool the pickle a little, then pour it into the jar.",
        "Leave the jar in a warm place.",
        "A day later, the salted cucumbers will be ready.",
        "Salting with a cold pickle Pour cold pickle over the cucumbers in a jar.",
        "Then leave it in the kitchen.",
        "You will have good crispy salted cucumbers after 2 days.",
        "When cucumbers are ready, cover them and put into a fridge.",
        "Salting without a pickle Cut cucumbers lengthwise into two pieces and place in a bowl.",
        "Peel a few cloves of garlic.",
        "Crush the cloves.",
        "Chop the dill.",
        "Put the garlic and dill with the cucumbers.",
        "Salt the mixture and mix it by hand, so that all ingredients are well-balanced.",
        "Put the mixed cucumbers in a polythene bag and tie it, pre-releasing all the air.",
        "Leave it for an hour.",
        "After an hour, the salted cucumbers are ready.",
        "Salted cucumbers in 5 minutes Slice cucumbers in two or four pieces, or chop across in large chunks.",
        "Put the slices or chunks in a plastic container with a lid.",
        "Chop some fresh dill, a few cloves of garlic and a piece of radish root.",
        "Put the chopped ingredients in with the cucumbers.",
        "Salt the contents of the container.",
        "Then close tightly with a lid.",
        "Strongly shake the container for a couple of minutes.",
        "Your salted cucumbers are ready."
    ]
}