{
    "title": "How to Do a Basic Ponytail",
    "url": "https://www.wikihow.com/Do-a-Basic-Ponytail",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Hairstyles",
        "Updos",
        "Ponytails"
    ],
    "methods": [
        {
            "name": "Creating a Basic Ponytail",
            "steps": [
                {
                    "headline": "Comb your hair and wrap a hair tie around your wrist.",
                    "description": "Keep the hair tie on your dominant hand so that it is ready to use. It's best to use a color that matches your hair, but you can use a bright one too."
                },
                {
                    "headline": "Gather your hair into your dominant hand.",
                    "description": "Make an L-shape with you dominant hand. Hook it around your hair at the back of your head, with your thumb at the bottom. Use your other hand to gather your hand into your dominant hand. Keep your hand at the base of your head. If you are doing the ponytail on someone else, keep your fingers under the ponytail and your thumb on top."
                },
                {
                    "headline": "Lift your hair up to the height you want it.",
                    "description": "If you want a low ponytail, keep your hand near the base of your neck where your hairline begins. If you want a mid-height ponytail, lift your hand up until it is level with your ears. For a high ponytail, lift your hand up past your ears. Use your free hand to catch any hair that comes loose and gather it back into your dominant hand."
                },
                {
                    "headline": "Smooth your hair back.",
                    "description": "Use a brush or your hands to comb your hair until it lays smooth. Work your way along the top, bottom, and sides of your head. Always brush the hair from the hairline and back towards your hand. You will have to pass the ponytail from 1 hand to the other. If you are doing a mid-height or high ponytail, remember to brush the hair at the nape of your neck upwards. If your hair is still bumpy after smoothing it while it is dry, then mist it with some water and try again. Wetting it slightly may help to relax any bumpy spots in your hair."
                },
                {
                    "headline": "Wrap a hair tie around the ponytail.",
                    "description": "Hold the ponytail with your dominant hand. Use your free hand to pull the hair tie off your wrist and onto the ponytail. Pull the ponytail through the hair tie. Twist the hair tie, and pull the ponytail through it once more. If you have thin hair, you may have to twist the hair tie a third time, and pull the ponytail through it again. For an extra secure hold, you can slide 2 bobby pins onto the hair band after securing your ponytail. Slide 1 bobby pin onto the hair band from the top of the ponytail, so that the ends of the bobby pin are going into and through the ponytail. Then, do the same thing with the other bobby pin, but going from the bottom of the ponytail."
                },
                {
                    "headline": "Touch up the ponytail, then mist it with hairspray, if desired.",
                    "description": "If you want a nice, full ponytail, split it into 2 sections. Pull the 2 sections apart to tighten the hair tie, then let go of them. Use hairspray to lightly mist your ponytail to set the style. For a sleeker look, use the back of your brush to smooth your hair down before the hairspray sets. For a messier look, muss up the hair at your temples before you add the hairspray."
                }
            ]
        },
        {
            "name": "Stepping Up Your Ponytail Game",
            "steps": [
                {
                    "headline": "Hide the hair tie with a thin strand of hair.",
                    "description": "Create a ponytail of your choice. Take a thin strand of hair from underneath your ponytail. Wrap it around the hair tie to hide it from view. Secure the strand of hair with a bobby pin that matches your hair color. Try to finish wrapping the strand underneath your ponytail. For something fancier, braid the thin strand first."
                },
                {
                    "headline": "Add volume with backcombing.",
                    "description": "If you finished your ponytail, and think it could use a little more volume, don't despair—you don't have to start all over. Simply lift up a section of your ponytail and backcomb it, starting from the middle and pressing down lightly towards the base. Keep lifting sections of your ponytail and backcombing it until you reach the underside. Only backcomb the underside of each section, never the top. Use just the tips of your brush’s bristles to smooth out the top of the ponytail when you are finished. Mist the ponytail with hairspray when you are done to set the style."
                },
                {
                    "headline": "Add volume to a ponytail with a small claw clip.",
                    "description": "Another great way to add volume to an existing ponytail is with a claw clip. Start with a high or mid-height ponytail. Pull the top half of the ponytail up and away. Take a small claw clip, about 1-inch (2.54-centimeters) wide, and clip it over the lower ponytail, close to the hair tie. Drop the upper part of the ponytail, and smooth it down to hide the claw clip. You may want to use a claw clip that matches your hair color to help it blend in, such as a brown clip if your hair is brown."
                },
                {
                    "headline": "Make a topsy-turvy ponytail.",
                    "description": "Start by making a low ponytail. Create a hole in your hair by dividing your hair in the center right above the hair tie. Push your finger up through the hole. Hook it around your ponytail, then use it to pull the ponytail down through the hole. Split the ponytail in two, and tug the two sections apart to tighten the hair tie. Smooth down the ponytail when you are done. A bow or other hair accessory works great for this style. Place it around the hair tie to hide it."
                },
                {
                    "headline": "Spice up your ponytail with accessories.",
                    "description": "A simple accessory, such as a hair comb or a hair clip can take your ponytail to the next level. Try tying a bow around the base of the ponytail, or slipping a hair comb behind the hair tie. If you have long bangs or short wisps of hair, pin them out of the way with a pretty hair clip."
                }
            ]
        },
        {
            "name": "Trying Different Types of Ponytails",
            "steps": [
                {
                    "headline": "Add a side part to a low ponytail.",
                    "description": "Begin by using a rattail comb to create a deep side part. Start the part above your right or left eyebrow, then angle it towards the back-center of your head. Brush your hair away from the side part going downwards and along the sides of your head, then pull it back into a low ponytail. You can also create a center part instead."
                },
                {
                    "headline": "Play around with different positions.",
                    "description": "If you want a more vintage look, suitable for anything 80s, try making a high ponytail on the side of your head. If you have curly or wavy hair, you can make a low ponytail to one side of your head."
                },
                {
                    "headline": "Try a half-up, hair-down ponytail.",
                    "description": "Make a L-shape with both of your hands. Position them at your temples, by your eyebrows. Tuck your thumbs under your hair, then pull your hair back into a mid-high ponytail. Use your hands to smooth down the hair on the top and sides of the ponytail, then tie it off."
                },
                {
                    "headline": "Make a double ponytail.",
                    "description": "Start with a half-up, half-down ponytail. Tie it off with a clear elastic, or use one that matches your hair color. Next, gather all of your hair into a low ponytail and tie it off with another elastic. Use a hair tie that matches your hair color. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristine George\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster Hairstylist and Colorist\t\t\t\t\t\t\t\tChristine George is a Master Hairstylist, Colorist, and Owner of Luxe Parlour, a premier boutique salon based in the Los Angeles, California area. Christine has over 23 years of hair styling and coloring experience. She specializes in customized haircuts, premium color services, balayage expertise, classic highlights, and color correction. She received her cosmetology degree from the Newberry School of Beauty. Christine George\t\t\tMaster Hairstylist and Colorist\t\t\t\tTry this variation: To get a perfect ponytail, double up on the elastics. Put the top half of your hair in a ponytail, then comb the bottom up and wrap a second elastic around that. You'll get a tighter ponytail if you use a fabric-wrapped elastic, although a scrunchie is gentler on your hair."
                },
                {
                    "headline": "Add an accent braid to a mid-height ponytail.",
                    "description": "Take some hair from your part, and braid it into a thin braid, no wider than your finger. Next, gather all of your hair, including the braid, into a mid-height ponytail, and secure it with a hair tie. Wrap a thin strand of hair, around the base of your ponytail to high the hair tie. Secure it with a bobby pin. If your hair is straight of smooth, secure the end of the thin braid with an elastic. Remove the elastic at the end. You can also wrap the thin braid around the base of the ponytail instead. Remove the elastic (if you used it) before pinning the braid."
                }
            ]
        }
    ],
    "tyn": [
        "Brush",
        "Hair tie",
        "Hairspray (optional)"
    ],
    "text": " Creating a Basic Ponytail Comb your hair and wrap a hair tie around your wrist. Keep the hair tie on your dominant hand so that it is ready to use. It's best to use a color that matches your hair, but you can use a bright one too. Gather your hair into your dominant hand. Make an L-shape with you dominant hand. Hook it around your hair at the back of your head, with your thumb at the bottom. Use your other hand to gather your hand into your dominant hand. Keep your hand at the base of your head. If you are doing the ponytail on someone else, keep your fingers under the ponytail and your thumb on top. Lift your hair up to the height you want it. If you want a low ponytail, keep your hand near the base of your neck where your hairline begins. If you want a mid-height ponytail, lift your hand up until it is level with your ears. For a high ponytail, lift your hand up past your ears. Use your free hand to catch any hair that comes loose and gather it back into your dominant hand. Smooth your hair back. Use a brush or your hands to comb your hair until it lays smooth. Work your way along the top, bottom, and sides of your head. Always brush the hair from the hairline and back towards your hand. You will have to pass the ponytail from 1 hand to the other. If you are doing a mid-height or high ponytail, remember to brush the hair at the nape of your neck upwards. If your hair is still bumpy after smoothing it while it is dry, then mist it with some water and try again. Wetting it slightly may help to relax any bumpy spots in your hair. Wrap a hair tie around the ponytail. Hold the ponytail with your dominant hand. Use your free hand to pull the hair tie off your wrist and onto the ponytail. Pull the ponytail through the hair tie. Twist the hair tie, and pull the ponytail through it once more. If you have thin hair, you may have to twist the hair tie a third time, and pull the ponytail through it again. For an extra secure hold, you can slide 2 bobby pins onto the hair band after securing your ponytail. Slide 1 bobby pin onto the hair band from the top of the ponytail, so that the ends of the bobby pin are going into and through the ponytail. Then, do the same thing with the other bobby pin, but going from the bottom of the ponytail. Touch up the ponytail, then mist it with hairspray, if desired. If you want a nice, full ponytail, split it into 2 sections. Pull the 2 sections apart to tighten the hair tie, then let go of them. Use hairspray to lightly mist your ponytail to set the style. For a sleeker look, use the back of your brush to smooth your hair down before the hairspray sets. For a messier look, muss up the hair at your temples before you add the hairspray. Stepping Up Your Ponytail Game Hide the hair tie with a thin strand of hair. Create a ponytail of your choice. Take a thin strand of hair from underneath your ponytail. Wrap it around the hair tie to hide it from view. Secure the strand of hair with a bobby pin that matches your hair color. Try to finish wrapping the strand underneath your ponytail. For something fancier, braid the thin strand first. Add volume with backcombing. If you finished your ponytail, and think it could use a little more volume, don't despair—you don't have to start all over. Simply lift up a section of your ponytail and backcomb it, starting from the middle and pressing down lightly towards the base. Keep lifting sections of your ponytail and backcombing it until you reach the underside. Only backcomb the underside of each section, never the top. Use just the tips of your brush’s bristles to smooth out the top of the ponytail when you are finished. Mist the ponytail with hairspray when you are done to set the style. Add volume to a ponytail with a small claw clip. Another great way to add volume to an existing ponytail is with a claw clip. Start with a high or mid-height ponytail. Pull the top half of the ponytail up and away. Take a small claw clip, about 1-inch (2.54-centimeters) wide, and clip it over the lower ponytail, close to the hair tie. Drop the upper part of the ponytail, and smooth it down to hide the claw clip. You may want to use a claw clip that matches your hair color to help it blend in, such as a brown clip if your hair is brown. Make a topsy-turvy ponytail. Start by making a low ponytail. Create a hole in your hair by dividing your hair in the center right above the hair tie. Push your finger up through the hole. Hook it around your ponytail, then use it to pull the ponytail down through the hole. Split the ponytail in two, and tug the two sections apart to tighten the hair tie. Smooth down the ponytail when you are done. A bow or other hair accessory works great for this style. Place it around the hair tie to hide it. Spice up your ponytail with accessories. A simple accessory, such as a hair comb or a hair clip can take your ponytail to the next level. Try tying a bow around the base of the ponytail, or slipping a hair comb behind the hair tie. If you have long bangs or short wisps of hair, pin them out of the way with a pretty hair clip. Trying Different Types of Ponytails Add a side part to a low ponytail. Begin by using a rattail comb to create a deep side part. Start the part above your right or left eyebrow, then angle it towards the back-center of your head. Brush your hair away from the side part going downwards and along the sides of your head, then pull it back into a low ponytail. You can also create a center part instead. Play around with different positions. If you want a more vintage look, suitable for anything 80s, try making a high ponytail on the side of your head. If you have curly or wavy hair, you can make a low ponytail to one side of your head. Try a half-up, hair-down ponytail. Make a L-shape with both of your hands. Position them at your temples, by your eyebrows. Tuck your thumbs under your hair, then pull your hair back into a mid-high ponytail. Use your hands to smooth down the hair on the top and sides of the ponytail, then tie it off. Make a double ponytail. Start with a half-up, half-down ponytail. Tie it off with a clear elastic, or use one that matches your hair color. Next, gather all of your hair into a low ponytail and tie it off with another elastic. Use a hair tie that matches your hair color. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristine George\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster Hairstylist and Colorist\t\t\t\t\t\t\t\tChristine George is a Master Hairstylist, Colorist, and Owner of Luxe Parlour, a premier boutique salon based in the Los Angeles, California area. Christine has over 23 years of hair styling and coloring experience. She specializes in customized haircuts, premium color services, balayage expertise, classic highlights, and color correction. She received her cosmetology degree from the Newberry School of Beauty. Christine George\t\t\tMaster Hairstylist and Colorist\t\t\t\tTry this variation: To get a perfect ponytail, double up on the elastics. Put the top half of your hair in a ponytail, then comb the bottom up and wrap a second elastic around that. You'll get a tighter ponytail if you use a fabric-wrapped elastic, although a scrunchie is gentler on your hair. Add an accent braid to a mid-height ponytail. Take some hair from your part, and braid it into a thin braid, no wider than your finger. Next, gather all of your hair, including the braid, into a mid-height ponytail, and secure it with a hair tie. Wrap a thin strand of hair, around the base of your ponytail to high the hair tie. Secure it with a bobby pin. If your hair is straight of smooth, secure the end of the thin braid with an elastic. Remove the elastic at the end. You can also wrap the thin braid around the base of the ponytail instead. Remove the elastic (if you used it) before pinning the braid.",
    "sentences": [
        " Creating a Basic Ponytail Comb your hair and wrap a hair tie around your wrist.",
        "Keep the hair tie on your dominant hand so that it is ready to use.",
        "It's best to use a color that matches your hair, but you can use a bright one too.",
        "Gather your hair into your dominant hand.",
        "Make an L-shape with you dominant hand.",
        "Hook it around your hair at the back of your head, with your thumb at the bottom.",
        "Use your other hand to gather your hand into your dominant hand.",
        "Keep your hand at the base of your head.",
        "If you are doing the ponytail on someone else, keep your fingers under the ponytail and your thumb on top.",
        "Lift your hair up to the height you want it.",
        "If you want a low ponytail, keep your hand near the base of your neck where your hairline begins.",
        "If you want a mid-height ponytail, lift your hand up until it is level with your ears.",
        "For a high ponytail, lift your hand up past your ears.",
        "Use your free hand to catch any hair that comes loose and gather it back into your dominant hand.",
        "Smooth your hair back.",
        "Use a brush or your hands to comb your hair until it lays smooth.",
        "Work your way along the top, bottom, and sides of your head.",
        "Always brush the hair from the hairline and back towards your hand.",
        "You will have to pass the ponytail from 1 hand to the other.",
        "If you are doing a mid-height or high ponytail, remember to brush the hair at the nape of your neck upwards.",
        "If your hair is still bumpy after smoothing it while it is dry, then mist it with some water and try again.",
        "Wetting it slightly may help to relax any bumpy spots in your hair.",
        "Wrap a hair tie around the ponytail.",
        "Hold the ponytail with your dominant hand.",
        "Use your free hand to pull the hair tie off your wrist and onto the ponytail.",
        "Pull the ponytail through the hair tie.",
        "Twist the hair tie, and pull the ponytail through it once more.",
        "If you have thin hair, you may have to twist the hair tie a third time, and pull the ponytail through it again.",
        "For an extra secure hold, you can slide 2 bobby pins onto the hair band after securing your ponytail.",
        "Slide 1 bobby pin onto the hair band from the top of the ponytail, so that the ends of the bobby pin are going into and through the ponytail.",
        "Then, do the same thing with the other bobby pin, but going from the bottom of the ponytail.",
        "Touch up the ponytail, then mist it with hairspray, if desired.",
        "If you want a nice, full ponytail, split it into 2 sections.",
        "Pull the 2 sections apart to tighten the hair tie, then let go of them.",
        "Use hairspray to lightly mist your ponytail to set the style.",
        "For a sleeker look, use the back of your brush to smooth your hair down before the hairspray sets.",
        "For a messier look, muss up the hair at your temples before you add the hairspray.",
        "Stepping Up Your Ponytail Game Hide the hair tie with a thin strand of hair.",
        "Create a ponytail of your choice.",
        "Take a thin strand of hair from underneath your ponytail.",
        "Wrap it around the hair tie to hide it from view.",
        "Secure the strand of hair with a bobby pin that matches your hair color.",
        "Try to finish wrapping the strand underneath your ponytail.",
        "For something fancier, braid the thin strand first.",
        "Add volume with backcombing.",
        "If you finished your ponytail, and think it could use a little more volume, don't despair—you don't have to start all over.",
        "Simply lift up a section of your ponytail and backcomb it, starting from the middle and pressing down lightly towards the base.",
        "Keep lifting sections of your ponytail and backcombing it until you reach the underside.",
        "Only backcomb the underside of each section, never the top.",
        "Use just the tips of your brush’s bristles to smooth out the top of the ponytail when you are finished.",
        "Mist the ponytail with hairspray when you are done to set the style.",
        "Add volume to a ponytail with a small claw clip.",
        "Another great way to add volume to an existing ponytail is with a claw clip.",
        "Start with a high or mid-height ponytail.",
        "Pull the top half of the ponytail up and away.",
        "Take a small claw clip, about 1-inch (2.54-centimeters) wide, and clip it over the lower ponytail, close to the hair tie.",
        "Drop the upper part of the ponytail, and smooth it down to hide the claw clip.",
        "You may want to use a claw clip that matches your hair color to help it blend in, such as a brown clip if your hair is brown.",
        "Make a topsy-turvy ponytail.",
        "Start by making a low ponytail.",
        "Create a hole in your hair by dividing your hair in the center right above the hair tie.",
        "Push your finger up through the hole.",
        "Hook it around your ponytail, then use it to pull the ponytail down through the hole.",
        "Split the ponytail in two, and tug the two sections apart to tighten the hair tie.",
        "Smooth down the ponytail when you are done.",
        "A bow or other hair accessory works great for this style.",
        "Place it around the hair tie to hide it.",
        "Spice up your ponytail with accessories.",
        "A simple accessory, such as a hair comb or a hair clip can take your ponytail to the next level.",
        "Try tying a bow around the base of the ponytail, or slipping a hair comb behind the hair tie.",
        "If you have long bangs or short wisps of hair, pin them out of the way with a pretty hair clip.",
        "Trying Different Types of Ponytails Add a side part to a low ponytail.",
        "Begin by using a rattail comb to create a deep side part.",
        "Start the part above your right or left eyebrow, then angle it towards the back-center of your head.",
        "Brush your hair away from the side part going downwards and along the sides of your head, then pull it back into a low ponytail.",
        "You can also create a center part instead.",
        "Play around with different positions.",
        "If you want a more vintage look, suitable for anything 80s, try making a high ponytail on the side of your head.",
        "If you have curly or wavy hair, you can make a low ponytail to one side of your head.",
        "Try a half-up, hair-down ponytail.",
        "Make a L-shape with both of your hands.",
        "Position them at your temples, by your eyebrows.",
        "Tuck your thumbs under your hair, then pull your hair back into a mid-high ponytail.",
        "Use your hands to smooth down the hair on the top and sides of the ponytail, then tie it off.",
        "Make a double ponytail.",
        "Start with a half-up, half-down ponytail.",
        "Tie it off with a clear elastic, or use one that matches your hair color.",
        "Next, gather all of your hair into a low ponytail and tie it off with another elastic.",
        "Use a hair tie that matches your hair color.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristine George\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster Hairstylist and Colorist\t\t\t\t\t\t\t\tChristine George is a Master Hairstylist, Colorist, and Owner of Luxe Parlour, a premier boutique salon based in the Los Angeles, California area.",
        "Christine has over 23 years of hair styling and coloring experience.",
        "She specializes in customized haircuts, premium color services, balayage expertise, classic highlights, and color correction.",
        "She received her cosmetology degree from the Newberry School of Beauty.",
        "Christine George\t\t\tMaster Hairstylist and Colorist\t\t\t\tTry this variation: To get a perfect ponytail, double up on the elastics.",
        "Put the top half of your hair in a ponytail, then comb the bottom up and wrap a second elastic around that.",
        "You'll get a tighter ponytail if you use a fabric-wrapped elastic, although a scrunchie is gentler on your hair.",
        "Add an accent braid to a mid-height ponytail.",
        "Take some hair from your part, and braid it into a thin braid, no wider than your finger.",
        "Next, gather all of your hair, including the braid, into a mid-height ponytail, and secure it with a hair tie.",
        "Wrap a thin strand of hair, around the base of your ponytail to high the hair tie.",
        "Secure it with a bobby pin.",
        "If your hair is straight of smooth, secure the end of the thin braid with an elastic.",
        "Remove the elastic at the end.",
        "You can also wrap the thin braid around the base of the ponytail instead.",
        "Remove the elastic (if you used it) before pinning the braid."
    ]
}