{
    "title": "How to Identify a New Zealand Dolphin",
    "url": "https://www.wikihow.com/Identify-a-New-Zealand-Dolphin",
    "category_hierarchy": [
        "Pets and Animals",
        "Wildlife",
        "Cetaceans"
    ],
    "methods": [
        {
            "name": "Identity Hector's Dolphins",
            "steps": [
                {
                    "headline": "Spot these dolphins virtually anywhere off the coast of the South Island and off the west coast of the North Island.",
                    "description": ""
                },
                {
                    "headline": "Identify the major characteristics of Hector's Dolphins.",
                    "description": "Blunt headed and only around 1.38m long, these guys stand out from other Cetacea. They are patterned with black, pale grey and white. The dorsal fin is small and round and bellies outward, uniquely to this NZ dolphin. Males and females are the same in appearance to all intents and purposes. Hector's Dolphins are rarely seen more than 10km from shore."
                },
                {
                    "headline": "Look for them in muddy, turbid waters such as can be found around estuaries.",
                    "description": "If you're in this kind of area and see a dolphin, you may have spotted a Hector's."
                },
                {
                    "headline": "Realize that these dolphins aren't that acrobatic, they rarely leap out of the water, usually coming up to breath in a pretty calm, un-showy fashion.",
                    "description": ""
                },
                {
                    "headline": "Try spotting one near a boat.",
                    "description": "They are often curious and will check out stationary boats to see what's going on on-board. The Maori word for Hector's dolphin is Tupoupou. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\tAT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAndrea Thompson\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNew Zealand Resident\t\t\t\t\t\t\t\tAndrea Thompson has been living in New Zealand for over five years, after moving there from England. She enjoys spending time outdoors in New Zealand and exploring the South Island's coast, bush and mountains alike. AT\t\t\t\t\tAndrea Thompson\t\t\tNew Zealand Resident\t\t\t\tIf you're determined to see a dolphin, get on a dolphin cruise! Andrea Thompson, resident, tells us: \"In five years, I've seen one dolphin, but, I've never set out to see them on a dolphin tour. There are nine species of dolphins in New Zealand, but some are very rare. It's not easy to observe them from the beach or coast. If you want to see and identify them, go on a dolphin sighting tour or cruise.\""
                }
            ]
        },
        {
            "name": "Identify Common Dolphins",
            "steps": [
                {
                    "headline": "Understand that these are the dolphins you are most likely to see!",
                    "description": "As you may have guessed from the name, they are one of the most common dolphins in New Zealand."
                },
                {
                    "headline": "Look for their obvious beak.",
                    "description": "If the upper surface of the flippers is dark with the sides of the flipper being distinctly yellowish or with a beige tinge, it's a Common Dolphin."
                },
                {
                    "headline": "Notice the size.",
                    "description": "If you can get a sense of scale, a fully grown Common Dolphin is about 2.6m."
                },
                {
                    "headline": "Look for their behaviour.",
                    "description": "These dolphins are active and playful, and they sometimes hang out with their cousins, the Dusky Dolphin."
                },
                {
                    "headline": "Spot these grey and white guys anywhere around the coast of New Zealand munching on squid and small fish.These are called Aihe by Maori.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Identify Dusky Dolphins",
            "steps": [
                {
                    "headline": "Easily distinguish a Dusky Dolphin by its short, stubby dark beak.",
                    "description": "These dolphins are smaller than the Common Dolphin. They only grow to 2m in length and have a two-tone dorsal fin."
                },
                {
                    "headline": "Look for their most striking feature, a flame-shaped marking on its dusky flank.",
                    "description": ""
                },
                {
                    "headline": "Check for acrobatics and a lot of play.",
                    "description": "These dolphins can be seen behaving boisterously, even for dolphins, all around New Zealand's coast except for the west coast of the North Island. They can perform spectacular somersaults and body slams. In Maori, the Dusky Dolphin is called Papahau."
                }
            ]
        },
        {
            "name": "Identify Bottlenose Dolphins",
            "steps": [
                {
                    "headline": "Look for a dolphin that resembles Flipper.",
                    "description": "If you can spot Flipper, you can spot a Bottlenose Dolphin!"
                },
                {
                    "headline": "Keep a look out all around in the waters around New Zealand.",
                    "description": "The Bottlenose Dolphin may be spotted anywhere."
                },
                {
                    "headline": "Know that this is the biggest species of NZ dolphin with adults reaching 3.6m.",
                    "description": ""
                },
                {
                    "headline": "Check their colouring and features.",
                    "description": "Grey, primarily, Bottlenose Dolphins have a stubby beak and relatively long flippers. Terehu is the Maori word for Bottlenose Dolphin."
                }
            ]
        }
    ],
    "tyn": [
        "Binoculars"
    ],
    "text": " Identity Hector's Dolphins Spot these dolphins virtually anywhere off the coast of the South Island and off the west coast of the North Island.  Identify the major characteristics of Hector's Dolphins. Blunt headed and only around 1.38m long, these guys stand out from other Cetacea. They are patterned with black, pale grey and white. The dorsal fin is small and round and bellies outward, uniquely to this NZ dolphin. Males and females are the same in appearance to all intents and purposes. Hector's Dolphins are rarely seen more than 10km from shore. Look for them in muddy, turbid waters such as can be found around estuaries. If you're in this kind of area and see a dolphin, you may have spotted a Hector's. Realize that these dolphins aren't that acrobatic, they rarely leap out of the water, usually coming up to breath in a pretty calm, un-showy fashion.  Try spotting one near a boat. They are often curious and will check out stationary boats to see what's going on on-board. The Maori word for Hector's dolphin is Tupoupou. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\tAT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAndrea Thompson\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNew Zealand Resident\t\t\t\t\t\t\t\tAndrea Thompson has been living in New Zealand for over five years, after moving there from England. She enjoys spending time outdoors in New Zealand and exploring the South Island's coast, bush and mountains alike. AT\t\t\t\t\tAndrea Thompson\t\t\tNew Zealand Resident\t\t\t\tIf you're determined to see a dolphin, get on a dolphin cruise! Andrea Thompson, resident, tells us: \"In five years, I've seen one dolphin, but, I've never set out to see them on a dolphin tour. There are nine species of dolphins in New Zealand, but some are very rare. It's not easy to observe them from the beach or coast. If you want to see and identify them, go on a dolphin sighting tour or cruise.\" Identify Common Dolphins Understand that these are the dolphins you are most likely to see! As you may have guessed from the name, they are one of the most common dolphins in New Zealand. Look for their obvious beak. If the upper surface of the flippers is dark with the sides of the flipper being distinctly yellowish or with a beige tinge, it's a Common Dolphin. Notice the size. If you can get a sense of scale, a fully grown Common Dolphin is about 2.6m. Look for their behaviour. These dolphins are active and playful, and they sometimes hang out with their cousins, the Dusky Dolphin. Spot these grey and white guys anywhere around the coast of New Zealand munching on squid and small fish.These are called Aihe by Maori.  Identify Dusky Dolphins Easily distinguish a Dusky Dolphin by its short, stubby dark beak. These dolphins are smaller than the Common Dolphin. They only grow to 2m in length and have a two-tone dorsal fin. Look for their most striking feature, a flame-shaped marking on its dusky flank.  Check for acrobatics and a lot of play. These dolphins can be seen behaving boisterously, even for dolphins, all around New Zealand's coast except for the west coast of the North Island. They can perform spectacular somersaults and body slams. In Maori, the Dusky Dolphin is called Papahau. Identify Bottlenose Dolphins Look for a dolphin that resembles Flipper. If you can spot Flipper, you can spot a Bottlenose Dolphin! Keep a look out all around in the waters around New Zealand. The Bottlenose Dolphin may be spotted anywhere. Know that this is the biggest species of NZ dolphin with adults reaching 3.6m.  Check their colouring and features. Grey, primarily, Bottlenose Dolphins have a stubby beak and relatively long flippers. Terehu is the Maori word for Bottlenose Dolphin.",
    "sentences": [
        " Identity Hector's Dolphins Spot these dolphins virtually anywhere off the coast of the South Island and off the west coast of the North Island.",
        "Identify the major characteristics of Hector's Dolphins.",
        "Blunt headed and only around 1.38m long, these guys stand out from other Cetacea.",
        "They are patterned with black, pale grey and white.",
        "The dorsal fin is small and round and bellies outward, uniquely to this NZ dolphin.",
        "Males and females are the same in appearance to all intents and purposes.",
        "Hector's Dolphins are rarely seen more than 10km from shore.",
        "Look for them in muddy, turbid waters such as can be found around estuaries.",
        "If you're in this kind of area and see a dolphin, you may have spotted a Hector's.",
        "Realize that these dolphins aren't that acrobatic, they rarely leap out of the water, usually coming up to breath in a pretty calm, un-showy fashion.",
        "Try spotting one near a boat.",
        "They are often curious and will check out stationary boats to see what's going on on-board.",
        "The Maori word for Hector's dolphin is Tupoupou.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\tAT\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAndrea Thompson\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNew Zealand Resident\t\t\t\t\t\t\t\tAndrea Thompson has been living in New Zealand for over five years, after moving there from England.",
        "She enjoys spending time outdoors in New Zealand and exploring the South Island's coast, bush and mountains alike.",
        "AT\t\t\t\t\tAndrea Thompson\t\t\tNew Zealand Resident\t\t\t\tIf you're determined to see a dolphin, get on a dolphin cruise!",
        "Andrea Thompson, resident, tells us: \"In five years, I've seen one dolphin, but, I've never set out to see them on a dolphin tour.",
        "There are nine species of dolphins in New Zealand, but some are very rare.",
        "It's not easy to observe them from the beach or coast.",
        "If you want to see and identify them, go on a dolphin sighting tour or cruise.\"",
        "Identify Common Dolphins Understand that these are the dolphins you are most likely to see!",
        "As you may have guessed from the name, they are one of the most common dolphins in New Zealand.",
        "Look for their obvious beak.",
        "If the upper surface of the flippers is dark with the sides of the flipper being distinctly yellowish or with a beige tinge, it's a Common Dolphin.",
        "Notice the size.",
        "If you can get a sense of scale, a fully grown Common Dolphin is about 2.6m.",
        "Look for their behaviour.",
        "These dolphins are active and playful, and they sometimes hang out with their cousins, the Dusky Dolphin.",
        "Spot these grey and white guys anywhere around the coast of New Zealand munching on squid and small fish.These are called Aihe by Maori.",
        "Identify Dusky Dolphins Easily distinguish a Dusky Dolphin by its short, stubby dark beak.",
        "These dolphins are smaller than the Common Dolphin.",
        "They only grow to 2m in length and have a two-tone dorsal fin.",
        "Look for their most striking feature, a flame-shaped marking on its dusky flank.",
        "Check for acrobatics and a lot of play.",
        "These dolphins can be seen behaving boisterously, even for dolphins, all around New Zealand's coast except for the west coast of the North Island.",
        "They can perform spectacular somersaults and body slams.",
        "In Maori, the Dusky Dolphin is called Papahau.",
        "Identify Bottlenose Dolphins Look for a dolphin that resembles Flipper.",
        "If you can spot Flipper, you can spot a Bottlenose Dolphin!",
        "Keep a look out all around in the waters around New Zealand.",
        "The Bottlenose Dolphin may be spotted anywhere.",
        "Know that this is the biggest species of NZ dolphin with adults reaching 3.6m.",
        "Check their colouring and features.",
        "Grey, primarily, Bottlenose Dolphins have a stubby beak and relatively long flippers.",
        "Terehu is the Maori word for Bottlenose Dolphin."
    ]
}