{
    "title": "How to Train a Service Dog",
    "url": "https://www.wikihow.com/Train-a-Service-Dog",
    "category_hierarchy": [
        "Work World",
        "Occupations"
    ],
    "parts": [
        {
            "name": "Determining Your Dog’s Strengths",
            "steps": [
                {
                    "headline": "Pick out the quietly confident dog in a litter.",
                    "description": "Since you know you want your dog to be a service dog, assess the litter carefully. Choose the dog who fits with your needs, is eager to please, and is confident, but not overly confident. A dog with this personality type is the most suitable for service. Don’t choose a dog that seems shy or anxious. It is essential to find a well socialized dog, as a dog struggling with anxiety issues will make a poor assistance dog."
                },
                {
                    "headline": "Work on some basic training with your dog.",
                    "description": "In order to successfully train a service dog, you have to have a basic understanding of dog behavior and the reward-based training method. You should be able to teach basic commands, such as sit and stay, before embarking on more specialized commands. This will also show you how capable your dog is of learning quickly and how motivated your dog is to obey. Focus on rewarding your dog with praise and/or treats whenever they follow a command."
                },
                {
                    "headline": "Research different kinds of service.",
                    "description": "While guide dogs are the most common service dogs, you can also train your dog to assist people with severe allergies, diabetes, limited mobility, neurological issues, etc. Figure out what kind of dog you’d be qualified to train. Consider hiring a trainer if you don’t meet specific qualifications. You should also consider which jobs your dog’s breed and personality qualify them for. For example:\nYou should have experience training specific kinds of service dogs. Experience with allergy alert dogs does not qualify you to train a hearing dog. Working as a medical professional or caregiver doesn’t necessarily qualify you to train service dogs. Experience caring for diabetics might not qualify you to train a diabetic assistance dog. If you want your dog to be a brace/mobility support dog, they must stand at least 23 inches (58 cm) tall and weigh at least 55 pounds (25 kg). A keen sense of smell is key for an allergy alert or diabetic alert dog. Also research different ways of training the service dog. You can train your dog through a non-profit charity who trains specially selected dogs, organizations who undertake training your own dog, or working with a certified trainer in your own home."
                },
                {
                    "headline": "Take care of routine new pet tasks.",
                    "description": "As with any new pet, service dogs require attention that you must take care of during their first few months. These include:\nHousebreaking. This is requirement for all service dogs. Start housebreaking your dog when they’re six weeks old. Spaying and neutering. Neutering makes males less aggressive and prevents females from going into heat on the job. Have your dog sterilized between the ages of eight weeks and six months. Determining their age. A dog must be at least six months old to become a service dog. Although there’s no maximum age, avoid training senior dogs for physically demanding jobs. The annual physical. Schedule heart, eye, joint, and other breed-appropriate tests. Have your dog vaccinated and put on heartworm prevention medication. If you want your dog trained for mobility assistance, physical fitness and strength are especially important. Don’t consider your dog for service training if they have joint problems, bone density issues, or diabetes. Let them live as pampered companions instead!"
                },
                {
                    "headline": "Test your dog’s personality.",
                    "description": "Schedule tests given by the American Temperament Testing Society (ATTS) if you live near a testing location. Otherwise, schedule tests at your local animal shelter, or ask your vet for recommendations. Service dogs are tested on their sensitivity to noise, sensitivity to pain, and their ability to fetch an object and bring it back. Dogs who pass these tests then go for a 30-day evaluation period. Trainers take them into busy public places to evaluate their reactions to noise, crowds, and other factors that might agitate them. If they pass, they may proceed to further train for service. Sometimes, specific personalities determine what kind of service a dog will go into. For example:\nGood fetchers usually make a good guide dogs. Dogs who react keenly to sound make good hearing dogs. Dogs who can tolerate frequent mood swings make good companions for dementia patients."
                },
                {
                    "headline": "Write down your goals.",
                    "description": "Develop objectives and steps toward the Public Access Test. Make a list of manners, tasks, and other goals that your dog needs to achieve. Set dates for these objectives. For example, you could aim to have Fido trained at retrieving in four weeks. As you train, take notes, and review them regularly."
                }
            ]
        },
        {
            "name": "Honing Your Dog’s Skills",
            "steps": [
                {
                    "headline": "Teach obedience.",
                    "description": "In addition to basic commands, train your dog to obey more advanced commands like “Take it” and “Alert.” Use an assertive, yet calm, tone when giving commands. Teach obedience using sympathetic reward-based methods that encourage the dog and reward correct actions. Once your dog gets used to verbal commands, train them to obey hand signals. Do not use old-fashioned techniques that rely on dominating the dog. Be patient with younger dogs in the beginning, as they have shorter attention spans."
                },
                {
                    "headline": "Train for 120 hours over six months.",
                    "description": "Service dogs require frequent training and brush-ups even after they qualify. This should be spread evenly so the dog is trained little and often. Work within their ability to concentrate. Stop any session immediately if the dog is tired or no longer enjoying the training. Dedicate at least 30 of those hours to public outings to get your dog comfortable around other people. Service dogs need to be trained in the following kinds of tasks:\nTugging: opening doors and drawers, removing shoes, dragging laundry to the washing machine. Retrieving objects such as the phone, medicine, and beverages. Carrying: bringing objects to their partners, paying for items at counters, moving objects between locations. Nudging: shutting doors, flipping light switches, calling emergency services. Pawing: shutting doors, pushing elevator buttons, turning on lamps. Bracing: helping their partner turn in bed, preventing falls, helping partner walk from wheelchair to seat. Harnessing: opening heavy doors, transporting objects like books, preventing their partner from stumbling. Medical assistance: fetching medicine/medical devices, helping their  partner cough when no suction devices are available, letting emergency services into the house."
                },
                {
                    "headline": "Teach tug-based tasks.",
                    "description": "Use a rope that you’ll eventually tie to the refrigerator door as a door pull. Introduce your dog to the rope by allowing them to sniff and become familiar with it. Pick up the rope and tell them to take it. Play a tug-of-war game to practice tugging doors open. Make sure the dog’s head forms a straight line with the rest of their body. Practice this routine until the dog can tug smoothly until the rope is released. When your dog has mastered these steps:\nTie the rope to the refrigerator door. The dog should be able to reach the rope with all four paws on the floor. Call them to the fridge. Hold the rope out, and tell them to take it. Help your dog tug the door open on the first few tries. When the door is open, click your clicker and give your dog a treat. Practice until your dog can open the door without help."
                },
                {
                    "headline": "Work on retrieve-based tasks.",
                    "description": "Choose a beverage in a textured and contoured bottle for your dog to retrieve. Empty the bottle and let your dog to get used to it through gentle play. Use the clicker to prevent your dog from turning the bottle into a chew toy. When they’ve mastered this:\nPlace the bottle on a shelf in the fridge your dog can reach with all paws on the floor. Call your dog to the fridge. Open and prop the fridge door. Point out the bottle, and tell them to take it. Tell your dog to give the bottle back to you. Reward them with treats. Repeat training until your dog can open the fridge and retrieve the bottle without help. Leave the bottle in the same place so that your dog will be able to find it without difficulty each time."
                },
                {
                    "headline": "Teach carrying-based tasks.",
                    "description": "Continue with the fridge and bottle task, adding this step after your dog has mastered retrieval. Click the clicker and tell your dog to give you the bottle. Reward them with a treat. During each session, stand farther away from the fridge. Continue to increase the distance between the two of you until they can bring the bottle to you in another room."
                },
                {
                    "headline": "Teach target training.",
                    "description": "This will train your dog in nudge- and paw-based tasks. Put your dog on a leash if they won’t stay near you without one. Sit or stand and face your dog. Click the clicker and give your dog a treat for making eye contact with you. Repeat this two or three times. Then, show your dog a treat and enclose it in a closed fist. Have them nudge your fist with their nose. Click and treat. After your dog has mastered this step:\nContinue to enclose a treat in your fist. Train your dog only to nudge with a closed mouth. Click and treat for reinforcement. Work up to clicking when your dog nudges your fist. Open your hand and reward them. As your dog masters nudging, move your fist to the left and right, up and down. Gradually increase the distance between the two of you until you get about 3 feet (0.91 m) between you. Apply this task to the fridge/bottle activity by teaching your dog to nudge the door closed. Use a sticky note to mark the target. Switch the focus from the nose to the paws to teach paw-based tasks. Target a wooden door to any interior room with a sticky note. Place the sticky note at the edge of the door and at front-paw height for your dog. Use the same steps you used in nudge-training. Use nudge training when teaching your dog to close glass doors. Paw training on glass can lead to broken glass and serious injuries."
                },
                {
                    "headline": "Seek out professional trainers.",
                    "description": "Bracing-based tasks, harness-based tasks, and medical assistance tasks require the work of skilled professionals. Look for skilled, accredited trainers and training programs through Assistance Dogs International’s (ADI) interactive map. Click on your region of the world. Choose your country and state/province from the provided drop-down lists. The site will provide the contact information of a person or group in your area."
                }
            ]
        },
        {
            "name": "Understanding Public Access for Service Dogs",
            "steps": [
                {
                    "headline": "Exercise your legal responsibilities.",
                    "description": "Service dog owners are bound to several guidelines and laws. Familiarize yourself with your local dog ordinances, such as leash laws. Keep your dog up-to-date on vaccinations and yearly physical examinations. Groom and bathe them regularly. Teach others about the rights of service animals."
                },
                {
                    "headline": "Research key information about certification.",
                    "description": "The Americans with Disabilities Act (ADA) doesn’t require certification for service animals. Service dog handlers usually use gear such a vest, harness, or other visible marker to identify the dog as a service animal. While the dog's training is what grants access to public places that normally don’t allow animals. The gear can make it easier to show the dog is an assistance dog while keeping your illness or disability private. Certification or gear is not what makes a service dog a service dog, rather, training is what constitutes a dog's status as a service animal. Laws vary from one country to another. If you live outside the U.S., look up the legal requirements of service dogs, their trainers, and their partners."
                },
                {
                    "headline": "Register for the Public Access Test.",
                    "description": "This test is optional in the United States, but most reputable trainers will highly recommend that handlers and their service dogs take the test. Visit ADI at http://www.assistancedogsinternational.org/standards/public-access-test. Scroll to the bottom left of the page, and click “Members Search.” This will give you a list of the accredited members and candidates that can administer the test. To find a location near you:\nChoose your region by clicking it on the map. Choose your country from the drop-down list. Depending on where you live, you might see a second drop-down list that asks you to choose your state or province. Scroll down slowly to find an organization near you. Click on their website, call the number, or send an email to the listed address. Ask for the next available dates and times they will be conducting the test. You might be required to do a “demo” before taking the actual test. This will usually consist of three tasks that the organization will assess to see if you and your dog are ready for the next step. If your dog has been trained in medical alert tasks, be prepared to submit a video of your dog performing them. Ask the organization if they record the test. If not, have the test recorded and keep it available at all times. You might need proof in the future that you and your dog passed."
                },
                {
                    "headline": "Take the Public Access Test.",
                    "description": "During the test, you and your dog will be assessed as a team. Use the following checklist to prepare. Make sure your dog can\nPerform the mandatory tasks. Obey basic and advanced commands. Avoid begging for food or eating food that falls on the floor. Avoid being aggressive toward people and other animals. Avoid barking or becoming agitated among loud noises or in crowded spaces. You will be tested on\nUnloading your dog into your vehicle. Entering public spaces. Keeping control of your dog no matter the situation. Retrieving a dropped leash. Calmly handling incidents of possible discrimination. Loading your dog back into your vehicle."
                },
                {
                    "headline": "Beware of scams!",
                    "description": "Because the ADA doesn’t require certification, scam artists might try to take advantage of you. If you need guidance, call the ADA information line at 800-514-0301 (voice) or 800-514-0383 (TTY) between 9:30 AM and 5:30 PM (Mon.-Wed., Fri.) or between 12:30 PM and 5:30 PM on Thursday. All times are Eastern Time.There are many registries and websites across the internet that claim to provide unfettered access via ID cards or papers. This is generally frowned upon by trainers and service dog handlers because certifying a service dog and providing papers for them encourages businesses to ask for them. This is not only illegal, but can also provide an easy way for someone to pass off an untrained pet as a trained service animal. Registering a dog as an emotional support animal (ESA) does not grant any public access for the dog, as comfort is not a legally permissible task under the ADA. Registration is not required for ESAs and has no legal standing. All that is required for an ESA is a letter from a healthcare provider that the animal eases symptoms of a disability through comfort."
                }
            ]
        }
    ],
    "tyn": [
        "Rope or similar pull device",
        "Treats",
        "Clicker",
        "Empty plastic beverage bottle",
        "Sticky notes",
        "Leash"
    ],
    "text": " Determining Your Dog’s Strengths Pick out the quietly confident dog in a litter. Since you know you want your dog to be a service dog, assess the litter carefully. Choose the dog who fits with your needs, is eager to please, and is confident, but not overly confident. A dog with this personality type is the most suitable for service. Don’t choose a dog that seems shy or anxious. It is essential to find a well socialized dog, as a dog struggling with anxiety issues will make a poor assistance dog. Work on some basic training with your dog. In order to successfully train a service dog, you have to have a basic understanding of dog behavior and the reward-based training method. You should be able to teach basic commands, such as sit and stay, before embarking on more specialized commands. This will also show you how capable your dog is of learning quickly and how motivated your dog is to obey. Focus on rewarding your dog with praise and/or treats whenever they follow a command. Research different kinds of service. While guide dogs are the most common service dogs, you can also train your dog to assist people with severe allergies, diabetes, limited mobility, neurological issues, etc. Figure out what kind of dog you’d be qualified to train. Consider hiring a trainer if you don’t meet specific qualifications. You should also consider which jobs your dog’s breed and personality qualify them for. For example:\nYou should have experience training specific kinds of service dogs. Experience with allergy alert dogs does not qualify you to train a hearing dog. Working as a medical professional or caregiver doesn’t necessarily qualify you to train service dogs. Experience caring for diabetics might not qualify you to train a diabetic assistance dog. If you want your dog to be a brace/mobility support dog, they must stand at least 23 inches (58 cm) tall and weigh at least 55 pounds (25 kg). A keen sense of smell is key for an allergy alert or diabetic alert dog. Also research different ways of training the service dog. You can train your dog through a non-profit charity who trains specially selected dogs, organizations who undertake training your own dog, or working with a certified trainer in your own home. Take care of routine new pet tasks. As with any new pet, service dogs require attention that you must take care of during their first few months. These include:\nHousebreaking. This is requirement for all service dogs. Start housebreaking your dog when they’re six weeks old. Spaying and neutering. Neutering makes males less aggressive and prevents females from going into heat on the job. Have your dog sterilized between the ages of eight weeks and six months. Determining their age. A dog must be at least six months old to become a service dog. Although there’s no maximum age, avoid training senior dogs for physically demanding jobs. The annual physical. Schedule heart, eye, joint, and other breed-appropriate tests. Have your dog vaccinated and put on heartworm prevention medication. If you want your dog trained for mobility assistance, physical fitness and strength are especially important. Don’t consider your dog for service training if they have joint problems, bone density issues, or diabetes. Let them live as pampered companions instead! Test your dog’s personality. Schedule tests given by the American Temperament Testing Society (ATTS) if you live near a testing location. Otherwise, schedule tests at your local animal shelter, or ask your vet for recommendations. Service dogs are tested on their sensitivity to noise, sensitivity to pain, and their ability to fetch an object and bring it back. Dogs who pass these tests then go for a 30-day evaluation period. Trainers take them into busy public places to evaluate their reactions to noise, crowds, and other factors that might agitate them. If they pass, they may proceed to further train for service. Sometimes, specific personalities determine what kind of service a dog will go into. For example:\nGood fetchers usually make a good guide dogs. Dogs who react keenly to sound make good hearing dogs. Dogs who can tolerate frequent mood swings make good companions for dementia patients. Write down your goals. Develop objectives and steps toward the Public Access Test. Make a list of manners, tasks, and other goals that your dog needs to achieve. Set dates for these objectives. For example, you could aim to have Fido trained at retrieving in four weeks. As you train, take notes, and review them regularly. Honing Your Dog’s Skills Teach obedience. In addition to basic commands, train your dog to obey more advanced commands like “Take it” and “Alert.” Use an assertive, yet calm, tone when giving commands. Teach obedience using sympathetic reward-based methods that encourage the dog and reward correct actions. Once your dog gets used to verbal commands, train them to obey hand signals. Do not use old-fashioned techniques that rely on dominating the dog. Be patient with younger dogs in the beginning, as they have shorter attention spans. Train for 120 hours over six months. Service dogs require frequent training and brush-ups even after they qualify. This should be spread evenly so the dog is trained little and often. Work within their ability to concentrate. Stop any session immediately if the dog is tired or no longer enjoying the training. Dedicate at least 30 of those hours to public outings to get your dog comfortable around other people. Service dogs need to be trained in the following kinds of tasks:\nTugging: opening doors and drawers, removing shoes, dragging laundry to the washing machine. Retrieving objects such as the phone, medicine, and beverages. Carrying: bringing objects to their partners, paying for items at counters, moving objects between locations. Nudging: shutting doors, flipping light switches, calling emergency services. Pawing: shutting doors, pushing elevator buttons, turning on lamps. Bracing: helping their partner turn in bed, preventing falls, helping partner walk from wheelchair to seat. Harnessing: opening heavy doors, transporting objects like books, preventing their partner from stumbling. Medical assistance: fetching medicine/medical devices, helping their  partner cough when no suction devices are available, letting emergency services into the house. Teach tug-based tasks. Use a rope that you’ll eventually tie to the refrigerator door as a door pull. Introduce your dog to the rope by allowing them to sniff and become familiar with it. Pick up the rope and tell them to take it. Play a tug-of-war game to practice tugging doors open. Make sure the dog’s head forms a straight line with the rest of their body. Practice this routine until the dog can tug smoothly until the rope is released. When your dog has mastered these steps:\nTie the rope to the refrigerator door. The dog should be able to reach the rope with all four paws on the floor. Call them to the fridge. Hold the rope out, and tell them to take it. Help your dog tug the door open on the first few tries. When the door is open, click your clicker and give your dog a treat. Practice until your dog can open the door without help. Work on retrieve-based tasks. Choose a beverage in a textured and contoured bottle for your dog to retrieve. Empty the bottle and let your dog to get used to it through gentle play. Use the clicker to prevent your dog from turning the bottle into a chew toy. When they’ve mastered this:\nPlace the bottle on a shelf in the fridge your dog can reach with all paws on the floor. Call your dog to the fridge. Open and prop the fridge door. Point out the bottle, and tell them to take it. Tell your dog to give the bottle back to you. Reward them with treats. Repeat training until your dog can open the fridge and retrieve the bottle without help. Leave the bottle in the same place so that your dog will be able to find it without difficulty each time. Teach carrying-based tasks. Continue with the fridge and bottle task, adding this step after your dog has mastered retrieval. Click the clicker and tell your dog to give you the bottle. Reward them with a treat. During each session, stand farther away from the fridge. Continue to increase the distance between the two of you until they can bring the bottle to you in another room. Teach target training. This will train your dog in nudge- and paw-based tasks. Put your dog on a leash if they won’t stay near you without one. Sit or stand and face your dog. Click the clicker and give your dog a treat for making eye contact with you. Repeat this two or three times. Then, show your dog a treat and enclose it in a closed fist. Have them nudge your fist with their nose. Click and treat. After your dog has mastered this step:\nContinue to enclose a treat in your fist. Train your dog only to nudge with a closed mouth. Click and treat for reinforcement. Work up to clicking when your dog nudges your fist. Open your hand and reward them. As your dog masters nudging, move your fist to the left and right, up and down. Gradually increase the distance between the two of you until you get about 3 feet (0.91 m) between you. Apply this task to the fridge/bottle activity by teaching your dog to nudge the door closed. Use a sticky note to mark the target. Switch the focus from the nose to the paws to teach paw-based tasks. Target a wooden door to any interior room with a sticky note. Place the sticky note at the edge of the door and at front-paw height for your dog. Use the same steps you used in nudge-training. Use nudge training when teaching your dog to close glass doors. Paw training on glass can lead to broken glass and serious injuries. Seek out professional trainers. Bracing-based tasks, harness-based tasks, and medical assistance tasks require the work of skilled professionals. Look for skilled, accredited trainers and training programs through Assistance Dogs International’s (ADI) interactive map. Click on your region of the world. Choose your country and state/province from the provided drop-down lists. The site will provide the contact information of a person or group in your area. Understanding Public Access for Service Dogs Exercise your legal responsibilities. Service dog owners are bound to several guidelines and laws. Familiarize yourself with your local dog ordinances, such as leash laws. Keep your dog up-to-date on vaccinations and yearly physical examinations. Groom and bathe them regularly. Teach others about the rights of service animals. Research key information about certification. The Americans with Disabilities Act (ADA) doesn’t require certification for service animals. Service dog handlers usually use gear such a vest, harness, or other visible marker to identify the dog as a service animal. While the dog's training is what grants access to public places that normally don’t allow animals. The gear can make it easier to show the dog is an assistance dog while keeping your illness or disability private. Certification or gear is not what makes a service dog a service dog, rather, training is what constitutes a dog's status as a service animal. Laws vary from one country to another. If you live outside the U.S., look up the legal requirements of service dogs, their trainers, and their partners. Register for the Public Access Test. This test is optional in the United States, but most reputable trainers will highly recommend that handlers and their service dogs take the test. Visit ADI at http://www.assistancedogsinternational.org/standards/public-access-test. Scroll to the bottom left of the page, and click “Members Search.” This will give you a list of the accredited members and candidates that can administer the test. To find a location near you:\nChoose your region by clicking it on the map. Choose your country from the drop-down list. Depending on where you live, you might see a second drop-down list that asks you to choose your state or province. Scroll down slowly to find an organization near you. Click on their website, call the number, or send an email to the listed address. Ask for the next available dates and times they will be conducting the test. You might be required to do a “demo” before taking the actual test. This will usually consist of three tasks that the organization will assess to see if you and your dog are ready for the next step. If your dog has been trained in medical alert tasks, be prepared to submit a video of your dog performing them. Ask the organization if they record the test. If not, have the test recorded and keep it available at all times. You might need proof in the future that you and your dog passed. Take the Public Access Test. During the test, you and your dog will be assessed as a team. Use the following checklist to prepare. Make sure your dog can\nPerform the mandatory tasks. Obey basic and advanced commands. Avoid begging for food or eating food that falls on the floor. Avoid being aggressive toward people and other animals. Avoid barking or becoming agitated among loud noises or in crowded spaces. You will be tested on\nUnloading your dog into your vehicle. Entering public spaces. Keeping control of your dog no matter the situation. Retrieving a dropped leash. Calmly handling incidents of possible discrimination. Loading your dog back into your vehicle. Beware of scams! Because the ADA doesn’t require certification, scam artists might try to take advantage of you. If you need guidance, call the ADA information line at 800-514-0301 (voice) or 800-514-0383 (TTY) between 9:30 AM and 5:30 PM (Mon.-Wed., Fri.) or between 12:30 PM and 5:30 PM on Thursday. All times are Eastern Time.There are many registries and websites across the internet that claim to provide unfettered access via ID cards or papers. This is generally frowned upon by trainers and service dog handlers because certifying a service dog and providing papers for them encourages businesses to ask for them. This is not only illegal, but can also provide an easy way for someone to pass off an untrained pet as a trained service animal. Registering a dog as an emotional support animal (ESA) does not grant any public access for the dog, as comfort is not a legally permissible task under the ADA. Registration is not required for ESAs and has no legal standing. All that is required for an ESA is a letter from a healthcare provider that the animal eases symptoms of a disability through comfort.",
    "sentences": [
        " Determining Your Dog’s Strengths Pick out the quietly confident dog in a litter.",
        "Since you know you want your dog to be a service dog, assess the litter carefully.",
        "Choose the dog who fits with your needs, is eager to please, and is confident, but not overly confident.",
        "A dog with this personality type is the most suitable for service.",
        "Don’t choose a dog that seems shy or anxious.",
        "It is essential to find a well socialized dog, as a dog struggling with anxiety issues will make a poor assistance dog.",
        "Work on some basic training with your dog.",
        "In order to successfully train a service dog, you have to have a basic understanding of dog behavior and the reward-based training method.",
        "You should be able to teach basic commands, such as sit and stay, before embarking on more specialized commands.",
        "This will also show you how capable your dog is of learning quickly and how motivated your dog is to obey.",
        "Focus on rewarding your dog with praise and/or treats whenever they follow a command.",
        "Research different kinds of service.",
        "While guide dogs are the most common service dogs, you can also train your dog to assist people with severe allergies, diabetes, limited mobility, neurological issues, etc.",
        "Figure out what kind of dog you’d be qualified to train.",
        "Consider hiring a trainer if you don’t meet specific qualifications.",
        "You should also consider which jobs your dog’s breed and personality qualify them for.",
        "For example:\nYou should have experience training specific kinds of service dogs.",
        "Experience with allergy alert dogs does not qualify you to train a hearing dog.",
        "Working as a medical professional or caregiver doesn’t necessarily qualify you to train service dogs.",
        "Experience caring for diabetics might not qualify you to train a diabetic assistance dog.",
        "If you want your dog to be a brace/mobility support dog, they must stand at least 23 inches (58 cm) tall and weigh at least 55 pounds (25 kg).",
        "A keen sense of smell is key for an allergy alert or diabetic alert dog.",
        "Also research different ways of training the service dog.",
        "You can train your dog through a non-profit charity who trains specially selected dogs, organizations who undertake training your own dog, or working with a certified trainer in your own home.",
        "Take care of routine new pet tasks.",
        "As with any new pet, service dogs require attention that you must take care of during their first few months.",
        "These include:\nHousebreaking.",
        "This is requirement for all service dogs.",
        "Start housebreaking your dog when they’re six weeks old.",
        "Spaying and neutering.",
        "Neutering makes males less aggressive and prevents females from going into heat on the job.",
        "Have your dog sterilized between the ages of eight weeks and six months.",
        "Determining their age.",
        "A dog must be at least six months old to become a service dog.",
        "Although there’s no maximum age, avoid training senior dogs for physically demanding jobs.",
        "The annual physical.",
        "Schedule heart, eye, joint, and other breed-appropriate tests.",
        "Have your dog vaccinated and put on heartworm prevention medication.",
        "If you want your dog trained for mobility assistance, physical fitness and strength are especially important.",
        "Don’t consider your dog for service training if they have joint problems, bone density issues, or diabetes.",
        "Let them live as pampered companions instead!",
        "Test your dog’s personality.",
        "Schedule tests given by the American Temperament Testing Society (ATTS) if you live near a testing location.",
        "Otherwise, schedule tests at your local animal shelter, or ask your vet for recommendations.",
        "Service dogs are tested on their sensitivity to noise, sensitivity to pain, and their ability to fetch an object and bring it back.",
        "Dogs who pass these tests then go for a 30-day evaluation period.",
        "Trainers take them into busy public places to evaluate their reactions to noise, crowds, and other factors that might agitate them.",
        "If they pass, they may proceed to further train for service.",
        "Sometimes, specific personalities determine what kind of service a dog will go into.",
        "For example:\nGood fetchers usually make a good guide dogs.",
        "Dogs who react keenly to sound make good hearing dogs.",
        "Dogs who can tolerate frequent mood swings make good companions for dementia patients.",
        "Write down your goals.",
        "Develop objectives and steps toward the Public Access Test.",
        "Make a list of manners, tasks, and other goals that your dog needs to achieve.",
        "Set dates for these objectives.",
        "For example, you could aim to have Fido trained at retrieving in four weeks.",
        "As you train, take notes, and review them regularly.",
        "Honing Your Dog’s Skills Teach obedience.",
        "In addition to basic commands, train your dog to obey more advanced commands like “Take it” and “Alert.” Use an assertive, yet calm, tone when giving commands.",
        "Teach obedience using sympathetic reward-based methods that encourage the dog and reward correct actions.",
        "Once your dog gets used to verbal commands, train them to obey hand signals.",
        "Do not use old-fashioned techniques that rely on dominating the dog.",
        "Be patient with younger dogs in the beginning, as they have shorter attention spans.",
        "Train for 120 hours over six months.",
        "Service dogs require frequent training and brush-ups even after they qualify.",
        "This should be spread evenly so the dog is trained little and often.",
        "Work within their ability to concentrate.",
        "Stop any session immediately if the dog is tired or no longer enjoying the training.",
        "Dedicate at least 30 of those hours to public outings to get your dog comfortable around other people.",
        "Service dogs need to be trained in the following kinds of tasks:\nTugging: opening doors and drawers, removing shoes, dragging laundry to the washing machine.",
        "Retrieving objects such as the phone, medicine, and beverages.",
        "Carrying: bringing objects to their partners, paying for items at counters, moving objects between locations.",
        "Nudging: shutting doors, flipping light switches, calling emergency services.",
        "Pawing: shutting doors, pushing elevator buttons, turning on lamps.",
        "Bracing: helping their partner turn in bed, preventing falls, helping partner walk from wheelchair to seat.",
        "Harnessing: opening heavy doors, transporting objects like books, preventing their partner from stumbling.",
        "Medical assistance: fetching medicine/medical devices, helping their  partner cough when no suction devices are available, letting emergency services into the house.",
        "Teach tug-based tasks.",
        "Use a rope that you’ll eventually tie to the refrigerator door as a door pull.",
        "Introduce your dog to the rope by allowing them to sniff and become familiar with it.",
        "Pick up the rope and tell them to take it.",
        "Play a tug-of-war game to practice tugging doors open.",
        "Make sure the dog’s head forms a straight line with the rest of their body.",
        "Practice this routine until the dog can tug smoothly until the rope is released.",
        "When your dog has mastered these steps:\nTie the rope to the refrigerator door.",
        "The dog should be able to reach the rope with all four paws on the floor.",
        "Call them to the fridge.",
        "Hold the rope out, and tell them to take it.",
        "Help your dog tug the door open on the first few tries.",
        "When the door is open, click your clicker and give your dog a treat.",
        "Practice until your dog can open the door without help.",
        "Work on retrieve-based tasks.",
        "Choose a beverage in a textured and contoured bottle for your dog to retrieve.",
        "Empty the bottle and let your dog to get used to it through gentle play.",
        "Use the clicker to prevent your dog from turning the bottle into a chew toy.",
        "When they’ve mastered this:\nPlace the bottle on a shelf in the fridge your dog can reach with all paws on the floor.",
        "Call your dog to the fridge.",
        "Open and prop the fridge door.",
        "Point out the bottle, and tell them to take it.",
        "Tell your dog to give the bottle back to you.",
        "Reward them with treats.",
        "Repeat training until your dog can open the fridge and retrieve the bottle without help.",
        "Leave the bottle in the same place so that your dog will be able to find it without difficulty each time.",
        "Teach carrying-based tasks.",
        "Continue with the fridge and bottle task, adding this step after your dog has mastered retrieval.",
        "Click the clicker and tell your dog to give you the bottle.",
        "Reward them with a treat.",
        "During each session, stand farther away from the fridge.",
        "Continue to increase the distance between the two of you until they can bring the bottle to you in another room.",
        "Teach target training.",
        "This will train your dog in nudge- and paw-based tasks.",
        "Put your dog on a leash if they won’t stay near you without one.",
        "Sit or stand and face your dog.",
        "Click the clicker and give your dog a treat for making eye contact with you.",
        "Repeat this two or three times.",
        "Then, show your dog a treat and enclose it in a closed fist.",
        "Have them nudge your fist with their nose.",
        "Click and treat.",
        "After your dog has mastered this step:\nContinue to enclose a treat in your fist.",
        "Train your dog only to nudge with a closed mouth.",
        "Click and treat for reinforcement.",
        "Work up to clicking when your dog nudges your fist.",
        "Open your hand and reward them.",
        "As your dog masters nudging, move your fist to the left and right, up and down.",
        "Gradually increase the distance between the two of you until you get about 3 feet (0.91 m) between you.",
        "Apply this task to the fridge/bottle activity by teaching your dog to nudge the door closed.",
        "Use a sticky note to mark the target.",
        "Switch the focus from the nose to the paws to teach paw-based tasks.",
        "Target a wooden door to any interior room with a sticky note.",
        "Place the sticky note at the edge of the door and at front-paw height for your dog.",
        "Use the same steps you used in nudge-training.",
        "Use nudge training when teaching your dog to close glass doors.",
        "Paw training on glass can lead to broken glass and serious injuries.",
        "Seek out professional trainers.",
        "Bracing-based tasks, harness-based tasks, and medical assistance tasks require the work of skilled professionals.",
        "Look for skilled, accredited trainers and training programs through Assistance Dogs International’s (ADI) interactive map.",
        "Click on your region of the world.",
        "Choose your country and state/province from the provided drop-down lists.",
        "The site will provide the contact information of a person or group in your area.",
        "Understanding Public Access for Service Dogs Exercise your legal responsibilities.",
        "Service dog owners are bound to several guidelines and laws.",
        "Familiarize yourself with your local dog ordinances, such as leash laws.",
        "Keep your dog up-to-date on vaccinations and yearly physical examinations.",
        "Groom and bathe them regularly.",
        "Teach others about the rights of service animals.",
        "Research key information about certification.",
        "The Americans with Disabilities Act (ADA) doesn’t require certification for service animals.",
        "Service dog handlers usually use gear such a vest, harness, or other visible marker to identify the dog as a service animal.",
        "While the dog's training is what grants access to public places that normally don’t allow animals.",
        "The gear can make it easier to show the dog is an assistance dog while keeping your illness or disability private.",
        "Certification or gear is not what makes a service dog a service dog, rather, training is what constitutes a dog's status as a service animal.",
        "Laws vary from one country to another.",
        "If you live outside the U.S., look up the legal requirements of service dogs, their trainers, and their partners.",
        "Register for the Public Access Test.",
        "This test is optional in the United States, but most reputable trainers will highly recommend that handlers and their service dogs take the test.",
        "Visit ADI at http://www.assistancedogsinternational.org/standards/public-access-test.",
        "Scroll to the bottom left of the page, and click “Members Search.” This will give you a list of the accredited members and candidates that can administer the test.",
        "To find a location near you:\nChoose your region by clicking it on the map.",
        "Choose your country from the drop-down list.",
        "Depending on where you live, you might see a second drop-down list that asks you to choose your state or province.",
        "Scroll down slowly to find an organization near you.",
        "Click on their website, call the number, or send an email to the listed address.",
        "Ask for the next available dates and times they will be conducting the test.",
        "You might be required to do a “demo” before taking the actual test.",
        "This will usually consist of three tasks that the organization will assess to see if you and your dog are ready for the next step.",
        "If your dog has been trained in medical alert tasks, be prepared to submit a video of your dog performing them.",
        "Ask the organization if they record the test.",
        "If not, have the test recorded and keep it available at all times.",
        "You might need proof in the future that you and your dog passed.",
        "Take the Public Access Test.",
        "During the test, you and your dog will be assessed as a team.",
        "Use the following checklist to prepare.",
        "Make sure your dog can\nPerform the mandatory tasks.",
        "Obey basic and advanced commands.",
        "Avoid begging for food or eating food that falls on the floor.",
        "Avoid being aggressive toward people and other animals.",
        "Avoid barking or becoming agitated among loud noises or in crowded spaces.",
        "You will be tested on\nUnloading your dog into your vehicle.",
        "Entering public spaces.",
        "Keeping control of your dog no matter the situation.",
        "Retrieving a dropped leash.",
        "Calmly handling incidents of possible discrimination.",
        "Loading your dog back into your vehicle.",
        "Beware of scams!",
        "Because the ADA doesn’t require certification, scam artists might try to take advantage of you.",
        "If you need guidance, call the ADA information line at 800-514-0301 (voice) or 800-514-0383 (TTY) between 9:30 AM and 5:30 PM (Mon.-Wed., Fri.) or between 12:30 PM and 5:30 PM on Thursday.",
        "All times are Eastern Time.There are many registries and websites across the internet that claim to provide unfettered access via ID cards or papers.",
        "This is generally frowned upon by trainers and service dog handlers because certifying a service dog and providing papers for them encourages businesses to ask for them.",
        "This is not only illegal, but can also provide an easy way for someone to pass off an untrained pet as a trained service animal.",
        "Registering a dog as an emotional support animal (ESA) does not grant any public access for the dog, as comfort is not a legally permissible task under the ADA.",
        "Registration is not required for ESAs and has no legal standing.",
        "All that is required for an ESA is a letter from a healthcare provider that the animal eases symptoms of a disability through comfort."
    ]
}