{
    "title": "How to Calculate Heat of Combustion",
    "url": "https://www.wikihow.com/Calculate-Heat-of-Combustion",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science",
        "Physics"
    ],
    "methods": [
        {
            "name": "Calculating Heat of Combustion Experimentally",
            "steps": [
                {
                    "headline": "Position the standing rod vertically.",
                    "description": "To begin setting up your experiment you will first place the rod on your work table."
                },
                {
                    "headline": "Measure 100ml of water into the tin can.",
                    "description": ""
                },
                {
                    "headline": "Put the substance at the base of the standing rod.",
                    "description": ""
                },
                {
                    "headline": "At 5cm above the substance affix the tin can with a clamp to the rod.",
                    "description": ""
                },
                {
                    "headline": "Affix the thermometer so that it is in the tin can but not touching the bottom base.",
                    "description": ""
                },
                {
                    "headline": "Experimentation",
                    "description": "Measure the temperature of the water and note it in degrees celsius. Measure the mass of the candle and note it in g.\nLight the substance. When the temperature of the water reaches 40 degrees Centigrade, blow out the substance. Measure the mass of the candle after burning and note it."
                },
                {
                    "headline": "Calculation",
                    "description": "Use the formula q = Cp * m * (delta) t to calculate the heat liberated which heats the water. The specific heat Cp of water is 4.18 J/g C\nMass of the water is 100g\nDelta t is the difference between the initial starting temperature and 40 degrees centigrade. Subtract the initial temperature of the water from 40 C.\nSubstitute it into the formula and you will get the answer q in J. Convert into kJ by dividing q by 1000. Find the amount of substance burned by subtracting the final mass from the initial mass of the substance in g.\nDivide q in kJ by the mass of the substance burned. The answer is the experimental heat of combustion in kJ/g."
                }
            ]
        },
        {
            "name": "Calculating the Heat of Combustion Using Hess' Law",
            "steps": [
                {
                    "headline": "Write the balanced equation of combustion of the substance.",
                    "description": ""
                },
                {
                    "headline": "Find the enthalpies of formation for the reactants and add them.",
                    "description": "Enthalpies of formation are usually found in a table from CRC Handbook of Chemistry and Physics."
                },
                {
                    "headline": "Find the enthalpies of formation of the products and add them.",
                    "description": "Use the table"
                },
                {
                    "headline": "Subtract the enthalpies of the reactants from the product.",
                    "description": ""
                },
                {
                    "headline": "Switch the sign and that is the Heat of Combustion.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Gathering Materials",
        "A tin can",
        "A standing rod",
        "A thermometer",
        "Graduated Cylinder",
        "Ice cold water",
        "Two clamps",
        "The substance - which can be preferable burnt with a wick."
    ],
    "text": " Calculating Heat of Combustion Experimentally Position the standing rod vertically. To begin setting up your experiment you will first place the rod on your work table. Measure 100ml of water into the tin can.  Put the substance at the base of the standing rod.  At 5cm above the substance affix the tin can with a clamp to the rod.  Affix the thermometer so that it is in the tin can but not touching the bottom base.  Experimentation Measure the temperature of the water and note it in degrees celsius. Measure the mass of the candle and note it in g.\nLight the substance. When the temperature of the water reaches 40 degrees Centigrade, blow out the substance. Measure the mass of the candle after burning and note it. Calculation Use the formula q = Cp * m * (delta) t to calculate the heat liberated which heats the water. The specific heat Cp of water is 4.18 J/g C\nMass of the water is 100g\nDelta t is the difference between the initial starting temperature and 40 degrees centigrade. Subtract the initial temperature of the water from 40 C.\nSubstitute it into the formula and you will get the answer q in J. Convert into kJ by dividing q by 1000. Find the amount of substance burned by subtracting the final mass from the initial mass of the substance in g.\nDivide q in kJ by the mass of the substance burned. The answer is the experimental heat of combustion in kJ/g. Calculating the Heat of Combustion Using Hess' Law Write the balanced equation of combustion of the substance.  Find the enthalpies of formation for the reactants and add them. Enthalpies of formation are usually found in a table from CRC Handbook of Chemistry and Physics. Find the enthalpies of formation of the products and add them. Use the table Subtract the enthalpies of the reactants from the product.  Switch the sign and that is the Heat of Combustion. ",
    "sentences": [
        " Calculating Heat of Combustion Experimentally Position the standing rod vertically.",
        "To begin setting up your experiment you will first place the rod on your work table.",
        "Measure 100ml of water into the tin can.",
        "Put the substance at the base of the standing rod.",
        "At 5cm above the substance affix the tin can with a clamp to the rod.",
        "Affix the thermometer so that it is in the tin can but not touching the bottom base.",
        "Experimentation Measure the temperature of the water and note it in degrees celsius.",
        "Measure the mass of the candle and note it in g.\nLight the substance.",
        "When the temperature of the water reaches 40 degrees Centigrade, blow out the substance.",
        "Measure the mass of the candle after burning and note it.",
        "Calculation Use the formula q = Cp * m * (delta) t to calculate the heat liberated which heats the water.",
        "The specific heat Cp of water is 4.18 J/g C\nMass of the water is 100g\nDelta t is the difference between the initial starting temperature and 40 degrees centigrade.",
        "Subtract the initial temperature of the water from 40 C.\nSubstitute it into the formula and you will get the answer q in J.",
        "Convert into kJ by dividing q by 1000.",
        "Find the amount of substance burned by subtracting the final mass from the initial mass of the substance in g.\nDivide q in kJ by the mass of the substance burned.",
        "The answer is the experimental heat of combustion in kJ/g.",
        "Calculating the Heat of Combustion Using Hess' Law Write the balanced equation of combustion of the substance.",
        "Find the enthalpies of formation for the reactants and add them.",
        "Enthalpies of formation are usually found in a table from CRC Handbook of Chemistry and Physics.",
        "Find the enthalpies of formation of the products and add them.",
        "Use the table Subtract the enthalpies of the reactants from the product.",
        "Switch the sign and that is the Heat of Combustion."
    ]
}