{
    "title": "How to Make Sugar Scrub Cubes",
    "url": "https://www.wikihow.com/Make-Sugar-Scrub-Cubes",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Handmade Cosmetics"
    ],
    "methods": [
        {
            "name": "Making Basic Sugar Scrub Cubes",
            "steps": [
                {
                    "headline": "Cut or grate the melt-and-pour soap base and place it into a microwave-safe bowl.",
                    "description": "You can use any type of melt-and-pour soap base, including: goat's milk, shea butter, and glycerin. Avoid using regular soap for this as it's already been processed and won't melt very well. Melt-and-pour soap base is designed to melt easily, but it still needs to be cut or grated into smaller pieces. You can buy melt-and-pour soap bases at arts and crafts stores. You can also buy them online. The soap is important for this scrub. It's what allows the scrub to retain its cube shape."
                },
                {
                    "headline": "Add ¼ cup (60 milliliters) of your choice of oil.",
                    "description": "Coconut oil is extra nourishing and has a nice fragrance, but you can use any other type of food-grade oil, such as: almond, avocado, grapeseed, hempseed, jojoba, or even olive oil. To make your sugar scrub even more nourishing, replace 1 tablespoon of your oil with vitamin E oil."
                },
                {
                    "headline": "Microwave the mixture until it has melted, stirring it every 10 seconds.",
                    "description": "If you don't own a microwave, you can assemble a double boiler, and heat the soap and oil in that."
                },
                {
                    "headline": "Stir in some essential oil and/or soap dye, if desired.",
                    "description": "You can use any color or fragrance you like, but fragrances that work best in scrubs include: grapefruit, lavender, lemon, mint, or vanilla. You can find essential oils in health food shops or online. You can find soap dye in arts and crafts stores and in online soap-making supply shops. Avoid adding dyes if you used brown sugar. Soap making dye is translucent, so the original brown color will still show through."
                },
                {
                    "headline": "Stir in the sugar and have your molds ready.",
                    "description": "If you have sensitive skin, you might want to use brown sugar instead. It is softer than regular sugar and thus very gentle. Keep stirring until everything is evenly mixed together. Your scrub will look a little like wet sand."
                },
                {
                    "headline": "Scoop the mixture into the molds and pack it in well, using your fingers to smooth it out.",
                    "description": "You can use any type of small mold, such as: mini cupcake pan, ice cube tray, or a silicon mold (for baking or for ice). You want the mold to be small. Each cube will only last one use, so if you make them too big, you will waste a lot of scrub."
                },
                {
                    "headline": "Let the scrubs set.",
                    "description": "As the melt-and-pour soap base hardens, the cubes will turn solid and retain their shape. You can leave the molds on the counter or in the fridge. You can also leave them in the freezer if you are in a hurry. Here's how much time each place will take to set:\nCounter: 4 hours\nFridge: 1 hour\nFreezer: 30 minutes"
                },
                {
                    "headline": "Pop the hardened cubes out of the mold and put them into an air-tight container.",
                    "description": "If you'd like, you can place a sheet of wax paper between each layer of cubes. The air-tight container is a must—it will keep the cubes from drying out."
                },
                {
                    "headline": "Use the scrub in the shower.",
                    "description": "Dampen your skin and take a cube out. Break it up in your hand and massage the scrub over your arms and legs. You can also use them on your hands and feet! If the cubes are too big, don't worry. Just cut them in half or into fourths!"
                }
            ]
        },
        {
            "name": "Trying Variations",
            "steps": [
                {
                    "headline": "Make a maple-brown sugar scrub.",
                    "description": "Follow the recipe above, but use brown sugar instead of white. Omit the essential oils and dyes, and add 1 tablespoon of maple syrup. You will get a golden-brown scrub that is perfect for fall!"
                },
                {
                    "headline": "Wake up with a vanilla-coffee scrub.",
                    "description": "Make the basic scrub above using white sugar and your choice of oil. Omit the essential oils and dyes, and add ¼ cup (25 grams) ground coffee and 1 tablespoon of vanilla extract. Some people find that coffee-based scrubs help temporarily reduce the appearance of cellulite."
                },
                {
                    "headline": "Make a pumpkin spice sugar scrub for fall.",
                    "description": "Make a basic scrub using white or brown sugar and your choice of oil. Omit the essential oils and add 1 tablespoon of honey and 1 teaspoon of pumpkin pie spice. The honey in this scrub will make it extra moisturizing because honey is a natural humectant—that is, it helps the body retain moisture. For a fun touch, use mini pumpkin or leaf shaped molds for this. You do not have to add soap dye to this scrub, but if you'd like to, use fall colors, such as: red, orange, and yellow."
                },
                {
                    "headline": "Make a brown sugar cookie scrub if you like sweet things.",
                    "description": "Make a basic scrub using brown sugar and your choice of oil. Skip the essential oils and dyes, and add 1 tablespoon of vanilla extract. If you'd like extra fragrance, add 1 teaspoon of almond extract."
                },
                {
                    "headline": "Freshen up with a lemon scrub.",
                    "description": "Make a basic scrub using white sugar. Use lemon essential oil for this. If you'd like to give it some color, use 1 to 3 drops of yellow soap dye. Almond oil will work great in this scrub, but you can use other kinds as well. A goat's milk melt-and-pour soap base will make this soap extra-luxurious."
                },
                {
                    "headline": "Make your cubes more luxurious by adding a pinch of dried, fragrant herbs to the sugar.",
                    "description": "Before you add the sugar to the soap and oil base, mix in a pinch of dried, ground herbs. These will give your scrub a little exfoliating power as well as a nice fragrance. Herbs that work great in this include lavender, rosemary, and thyme! Avoid using herbs whose scent you don't like."
                },
                {
                    "headline": "Give your cubes some sparkle by adding some mica powder to the sugar.",
                    "description": "Mica powder is a very fine, shimmery powder, sort of like loose eye shadow. Add a pinch of the powder into the sugar and stir it until it is evenly mixed together. Add the sugar to the soap and oil base. You can find mica powder online and in some makeup supply stores."
                }
            ]
        }
    ],
    "tyn": [
        "Microwave safe bowl",
        "Cheese grater or knife",
        "Microwave",
        "Spoon",
        "Silicon or plastic molds",
        "Air-tight container for storage"
    ],
    "text": " Making Basic Sugar Scrub Cubes Cut or grate the melt-and-pour soap base and place it into a microwave-safe bowl. You can use any type of melt-and-pour soap base, including: goat's milk, shea butter, and glycerin. Avoid using regular soap for this as it's already been processed and won't melt very well. Melt-and-pour soap base is designed to melt easily, but it still needs to be cut or grated into smaller pieces. You can buy melt-and-pour soap bases at arts and crafts stores. You can also buy them online. The soap is important for this scrub. It's what allows the scrub to retain its cube shape. Add ¼ cup (60 milliliters) of your choice of oil. Coconut oil is extra nourishing and has a nice fragrance, but you can use any other type of food-grade oil, such as: almond, avocado, grapeseed, hempseed, jojoba, or even olive oil. To make your sugar scrub even more nourishing, replace 1 tablespoon of your oil with vitamin E oil. Microwave the mixture until it has melted, stirring it every 10 seconds. If you don't own a microwave, you can assemble a double boiler, and heat the soap and oil in that. Stir in some essential oil and/or soap dye, if desired. You can use any color or fragrance you like, but fragrances that work best in scrubs include: grapefruit, lavender, lemon, mint, or vanilla. You can find essential oils in health food shops or online. You can find soap dye in arts and crafts stores and in online soap-making supply shops. Avoid adding dyes if you used brown sugar. Soap making dye is translucent, so the original brown color will still show through. Stir in the sugar and have your molds ready. If you have sensitive skin, you might want to use brown sugar instead. It is softer than regular sugar and thus very gentle. Keep stirring until everything is evenly mixed together. Your scrub will look a little like wet sand. Scoop the mixture into the molds and pack it in well, using your fingers to smooth it out. You can use any type of small mold, such as: mini cupcake pan, ice cube tray, or a silicon mold (for baking or for ice). You want the mold to be small. Each cube will only last one use, so if you make them too big, you will waste a lot of scrub. Let the scrubs set. As the melt-and-pour soap base hardens, the cubes will turn solid and retain their shape. You can leave the molds on the counter or in the fridge. You can also leave them in the freezer if you are in a hurry. Here's how much time each place will take to set:\nCounter: 4 hours\nFridge: 1 hour\nFreezer: 30 minutes Pop the hardened cubes out of the mold and put them into an air-tight container. If you'd like, you can place a sheet of wax paper between each layer of cubes. The air-tight container is a must—it will keep the cubes from drying out. Use the scrub in the shower. Dampen your skin and take a cube out. Break it up in your hand and massage the scrub over your arms and legs. You can also use them on your hands and feet! If the cubes are too big, don't worry. Just cut them in half or into fourths! Trying Variations Make a maple-brown sugar scrub. Follow the recipe above, but use brown sugar instead of white. Omit the essential oils and dyes, and add 1 tablespoon of maple syrup. You will get a golden-brown scrub that is perfect for fall! Wake up with a vanilla-coffee scrub. Make the basic scrub above using white sugar and your choice of oil. Omit the essential oils and dyes, and add ¼ cup (25 grams) ground coffee and 1 tablespoon of vanilla extract. Some people find that coffee-based scrubs help temporarily reduce the appearance of cellulite. Make a pumpkin spice sugar scrub for fall. Make a basic scrub using white or brown sugar and your choice of oil. Omit the essential oils and add 1 tablespoon of honey and 1 teaspoon of pumpkin pie spice. The honey in this scrub will make it extra moisturizing because honey is a natural humectant—that is, it helps the body retain moisture. For a fun touch, use mini pumpkin or leaf shaped molds for this. You do not have to add soap dye to this scrub, but if you'd like to, use fall colors, such as: red, orange, and yellow. Make a brown sugar cookie scrub if you like sweet things. Make a basic scrub using brown sugar and your choice of oil. Skip the essential oils and dyes, and add 1 tablespoon of vanilla extract. If you'd like extra fragrance, add 1 teaspoon of almond extract. Freshen up with a lemon scrub. Make a basic scrub using white sugar. Use lemon essential oil for this. If you'd like to give it some color, use 1 to 3 drops of yellow soap dye. Almond oil will work great in this scrub, but you can use other kinds as well. A goat's milk melt-and-pour soap base will make this soap extra-luxurious. Make your cubes more luxurious by adding a pinch of dried, fragrant herbs to the sugar. Before you add the sugar to the soap and oil base, mix in a pinch of dried, ground herbs. These will give your scrub a little exfoliating power as well as a nice fragrance. Herbs that work great in this include lavender, rosemary, and thyme! Avoid using herbs whose scent you don't like. Give your cubes some sparkle by adding some mica powder to the sugar. Mica powder is a very fine, shimmery powder, sort of like loose eye shadow. Add a pinch of the powder into the sugar and stir it until it is evenly mixed together. Add the sugar to the soap and oil base. You can find mica powder online and in some makeup supply stores.",
    "sentences": [
        " Making Basic Sugar Scrub Cubes Cut or grate the melt-and-pour soap base and place it into a microwave-safe bowl.",
        "You can use any type of melt-and-pour soap base, including: goat's milk, shea butter, and glycerin.",
        "Avoid using regular soap for this as it's already been processed and won't melt very well.",
        "Melt-and-pour soap base is designed to melt easily, but it still needs to be cut or grated into smaller pieces.",
        "You can buy melt-and-pour soap bases at arts and crafts stores.",
        "You can also buy them online.",
        "The soap is important for this scrub.",
        "It's what allows the scrub to retain its cube shape.",
        "Add ¼ cup (60 milliliters) of your choice of oil.",
        "Coconut oil is extra nourishing and has a nice fragrance, but you can use any other type of food-grade oil, such as: almond, avocado, grapeseed, hempseed, jojoba, or even olive oil.",
        "To make your sugar scrub even more nourishing, replace 1 tablespoon of your oil with vitamin E oil.",
        "Microwave the mixture until it has melted, stirring it every 10 seconds.",
        "If you don't own a microwave, you can assemble a double boiler, and heat the soap and oil in that.",
        "Stir in some essential oil and/or soap dye, if desired.",
        "You can use any color or fragrance you like, but fragrances that work best in scrubs include: grapefruit, lavender, lemon, mint, or vanilla.",
        "You can find essential oils in health food shops or online.",
        "You can find soap dye in arts and crafts stores and in online soap-making supply shops.",
        "Avoid adding dyes if you used brown sugar.",
        "Soap making dye is translucent, so the original brown color will still show through.",
        "Stir in the sugar and have your molds ready.",
        "If you have sensitive skin, you might want to use brown sugar instead.",
        "It is softer than regular sugar and thus very gentle.",
        "Keep stirring until everything is evenly mixed together.",
        "Your scrub will look a little like wet sand.",
        "Scoop the mixture into the molds and pack it in well, using your fingers to smooth it out.",
        "You can use any type of small mold, such as: mini cupcake pan, ice cube tray, or a silicon mold (for baking or for ice).",
        "You want the mold to be small.",
        "Each cube will only last one use, so if you make them too big, you will waste a lot of scrub.",
        "Let the scrubs set.",
        "As the melt-and-pour soap base hardens, the cubes will turn solid and retain their shape.",
        "You can leave the molds on the counter or in the fridge.",
        "You can also leave them in the freezer if you are in a hurry.",
        "Here's how much time each place will take to set:\nCounter: 4 hours\nFridge: 1 hour\nFreezer: 30 minutes Pop the hardened cubes out of the mold and put them into an air-tight container.",
        "If you'd like, you can place a sheet of wax paper between each layer of cubes.",
        "The air-tight container is a must—it will keep the cubes from drying out.",
        "Use the scrub in the shower.",
        "Dampen your skin and take a cube out.",
        "Break it up in your hand and massage the scrub over your arms and legs.",
        "You can also use them on your hands and feet!",
        "If the cubes are too big, don't worry.",
        "Just cut them in half or into fourths!",
        "Trying Variations Make a maple-brown sugar scrub.",
        "Follow the recipe above, but use brown sugar instead of white.",
        "Omit the essential oils and dyes, and add 1 tablespoon of maple syrup.",
        "You will get a golden-brown scrub that is perfect for fall!",
        "Wake up with a vanilla-coffee scrub.",
        "Make the basic scrub above using white sugar and your choice of oil.",
        "Omit the essential oils and dyes, and add ¼ cup (25 grams) ground coffee and 1 tablespoon of vanilla extract.",
        "Some people find that coffee-based scrubs help temporarily reduce the appearance of cellulite.",
        "Make a pumpkin spice sugar scrub for fall.",
        "Make a basic scrub using white or brown sugar and your choice of oil.",
        "Omit the essential oils and add 1 tablespoon of honey and 1 teaspoon of pumpkin pie spice.",
        "The honey in this scrub will make it extra moisturizing because honey is a natural humectant—that is, it helps the body retain moisture.",
        "For a fun touch, use mini pumpkin or leaf shaped molds for this.",
        "You do not have to add soap dye to this scrub, but if you'd like to, use fall colors, such as: red, orange, and yellow.",
        "Make a brown sugar cookie scrub if you like sweet things.",
        "Make a basic scrub using brown sugar and your choice of oil.",
        "Skip the essential oils and dyes, and add 1 tablespoon of vanilla extract.",
        "If you'd like extra fragrance, add 1 teaspoon of almond extract.",
        "Freshen up with a lemon scrub.",
        "Make a basic scrub using white sugar.",
        "Use lemon essential oil for this.",
        "If you'd like to give it some color, use 1 to 3 drops of yellow soap dye.",
        "Almond oil will work great in this scrub, but you can use other kinds as well.",
        "A goat's milk melt-and-pour soap base will make this soap extra-luxurious.",
        "Make your cubes more luxurious by adding a pinch of dried, fragrant herbs to the sugar.",
        "Before you add the sugar to the soap and oil base, mix in a pinch of dried, ground herbs.",
        "These will give your scrub a little exfoliating power as well as a nice fragrance.",
        "Herbs that work great in this include lavender, rosemary, and thyme!",
        "Avoid using herbs whose scent you don't like.",
        "Give your cubes some sparkle by adding some mica powder to the sugar.",
        "Mica powder is a very fine, shimmery powder, sort of like loose eye shadow.",
        "Add a pinch of the powder into the sugar and stir it until it is evenly mixed together.",
        "Add the sugar to the soap and oil base.",
        "You can find mica powder online and in some makeup supply stores."
    ]
}