{
    "title": "How to Revamp Tight Clothes",
    "url": "https://www.wikihow.com/Revamp-Tight-Clothes",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Laundry"
    ],
    "methods": [
        {
            "name": "Making a Fancy Shirt",
            "steps": [
                {
                    "headline": "Lay your tight shirt down flat.",
                    "description": "Measure out a line down the middle."
                },
                {
                    "headline": "Cut through the line you have measured.",
                    "description": ""
                },
                {
                    "headline": "Cut out another matching piece of material that is similar in length to your shirt, and a few inches wide, depending on how much wider you want your revamped shirt to turn out.",
                    "description": "Cut this piece of fabric in half."
                },
                {
                    "headline": "Flip around one side of the cut shirt.",
                    "description": "Place the additional piece of material on top, face down. Align these edges, and sew the open edge together. Repeat this with the second side of the shirt."
                },
                {
                    "headline": "Sew the other side of the material from one side to the other.",
                    "description": "Make sure to face the front sides inwards. Repeat this for the last side."
                },
                {
                    "headline": "Turn your shirt over, and you're done!",
                    "description": "Leave your new shirt plain, or if you like, sew on a little bow to accent."
                }
            ]
        },
        {
            "name": "Making a Cardigan",
            "steps": [
                {
                    "headline": "Get an old, tight long sleeve top.",
                    "description": ""
                },
                {
                    "headline": "Measure a line down the middle of the front, and cut.",
                    "description": ""
                },
                {
                    "headline": "Neaten it.",
                    "description": "To make it look neater, fold over about 1/2 to 1cm of the edges and sew."
                },
                {
                    "headline": "If you want, you can add buttons or pockets to make the cardigan more suited to you.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Making a Shoulder Bag",
            "steps": [
                {
                    "headline": "Lay your shirt or skirt flat on the floor.",
                    "description": ""
                },
                {
                    "headline": "From the middle, draw out a rectangle the size of your choice.",
                    "description": "This will be the size of the bag."
                },
                {
                    "headline": "Cut out the rectangle from both sides of the shirt or skirt.",
                    "description": ""
                },
                {
                    "headline": "Lay these two shirt pieces down on top of each other.",
                    "description": "Have the good sides facing inwards."
                },
                {
                    "headline": "Stitch together three of the sides, making sure to leave one open for the opening.",
                    "description": "If you like, you can stitch on a zip on this side. Make sure that the zip faces inwards too."
                },
                {
                    "headline": "Turn the bag inside out and add straps using either the leftover material or some string.",
                    "description": "You're all done!"
                }
            ]
        }
    ],
    "tyn": [
        "Tight old t-shirt(s), shirts, long-sleeve shirts, skirts, etc.",
        "Fabric scissors",
        "Sewing thread and needle or sewing machine",
        "Embellishments such as bows and buttons, as needed",
        "Straps for the bag (string or scrap fabric) and a zipper (optional)"
    ],
    "text": " Making a Fancy Shirt Lay your tight shirt down flat. Measure out a line down the middle. Cut through the line you have measured.  Cut out another matching piece of material that is similar in length to your shirt, and a few inches wide, depending on how much wider you want your revamped shirt to turn out. Cut this piece of fabric in half. Flip around one side of the cut shirt. Place the additional piece of material on top, face down. Align these edges, and sew the open edge together. Repeat this with the second side of the shirt. Sew the other side of the material from one side to the other. Make sure to face the front sides inwards. Repeat this for the last side. Turn your shirt over, and you're done! Leave your new shirt plain, or if you like, sew on a little bow to accent. Making a Cardigan Get an old, tight long sleeve top.  Measure a line down the middle of the front, and cut.  Neaten it. To make it look neater, fold over about 1/2 to 1cm of the edges and sew. If you want, you can add buttons or pockets to make the cardigan more suited to you.  Making a Shoulder Bag Lay your shirt or skirt flat on the floor.  From the middle, draw out a rectangle the size of your choice. This will be the size of the bag. Cut out the rectangle from both sides of the shirt or skirt.  Lay these two shirt pieces down on top of each other. Have the good sides facing inwards. Stitch together three of the sides, making sure to leave one open for the opening. If you like, you can stitch on a zip on this side. Make sure that the zip faces inwards too. Turn the bag inside out and add straps using either the leftover material or some string. You're all done!",
    "sentences": [
        " Making a Fancy Shirt Lay your tight shirt down flat.",
        "Measure out a line down the middle.",
        "Cut through the line you have measured.",
        "Cut out another matching piece of material that is similar in length to your shirt, and a few inches wide, depending on how much wider you want your revamped shirt to turn out.",
        "Cut this piece of fabric in half.",
        "Flip around one side of the cut shirt.",
        "Place the additional piece of material on top, face down.",
        "Align these edges, and sew the open edge together.",
        "Repeat this with the second side of the shirt.",
        "Sew the other side of the material from one side to the other.",
        "Make sure to face the front sides inwards.",
        "Repeat this for the last side.",
        "Turn your shirt over, and you're done!",
        "Leave your new shirt plain, or if you like, sew on a little bow to accent.",
        "Making a Cardigan Get an old, tight long sleeve top.",
        "Measure a line down the middle of the front, and cut.",
        "Neaten it.",
        "To make it look neater, fold over about 1/2 to 1cm of the edges and sew.",
        "If you want, you can add buttons or pockets to make the cardigan more suited to you.",
        "Making a Shoulder Bag Lay your shirt or skirt flat on the floor.",
        "From the middle, draw out a rectangle the size of your choice.",
        "This will be the size of the bag.",
        "Cut out the rectangle from both sides of the shirt or skirt.",
        "Lay these two shirt pieces down on top of each other.",
        "Have the good sides facing inwards.",
        "Stitch together three of the sides, making sure to leave one open for the opening.",
        "If you like, you can stitch on a zip on this side.",
        "Make sure that the zip faces inwards too.",
        "Turn the bag inside out and add straps using either the leftover material or some string.",
        "You're all done!"
    ]
}