{
    "title": "How to Install Windows XP on a Windows Vista Computer",
    "url": "https://www.wikihow.com/Install-Windows-XP-on-a-Windows-Vista-Computer",
    "category_hierarchy": [
        "Computers and Electronics",
        "Operating Systems",
        "Windows",
        "Vista Instructions"
    ],
    "steps": [
        {
            "headline": "Consider if you really want to downgrade.",
            "description": "The most problematic issues with Windows Vista only apply to the original 2006 version of Vista, not the newer SP1 version that comes with computers sold today. Windows 7 also doesn't have these issues. Windows Vista (7) also includes many features that enhance productivity, including instant desktop search, and features improvements in security."
        },
        {
            "headline": "Back up the files you want to save.",
            "description": "If you have any pictures or documents you want to keep, or programs that are hard to find, write them to a USB flash drive, external hard disk, or CD or DVD. Do this because everything on your hard disk will be destroyed during the process of installing Windows XP.Also make a set of Windows Vista recovery DVDs to ensure that you can return to Windows Vista if Windows XP doesn't work on your new computer. The exact location of the program to do so differs depending on the brand of your computer, but usually there is a reminder pop-up that periodically appears at the lower right corner if you have not made the discs yet."
        },
        {
            "headline": "Download the Windows XP drivers for your computer from its manufacturer.",
            "description": "This is necessary because these drivers add support for newer hardware that did not exist when Windows XP was released. Save the drivers onto your backup disk (along with your personal files). Make sure you get the drivers for \"Ethernet\" and \"Wireless\". Otherwise, you might not be able to connect to the Internet to download others. And if you use a wireless network with WPA2 security (or if you're not sure), also download the Wireless Client Update and save it to the backup disk. Also find the driver discs for all printers, scanners, PDAs, music players, and wireless network adapters you will use with the new computer. Some of these drivers might be available from the manufacturer's website if you have lost your CD's."
        },
        {
            "headline": "Insert the Windows XP CD and boot to it.",
            "description": "Put in the CD and then restart your computer. Wait for the setup files to finish loading. If the computer starts into Windows Vista instead of Windows XP Setup, you may have to press a key to boot from the CD. Restart your computer and press the key for the boot menu. This key is different for every computer depending on the BIOS."
        },
        {
            "headline": "Follow the instructions given by Setup.",
            "description": "Press ENTER and then press F8 to accept the license agreement.If the setup program asks you for the disc for a previous version of Windows, insert a Windows 98 or Windows Me disc and press ENTER. Then switch back to the Windows XP disc. This is perfectly acceptable as long as you are not using that copy of Windows 98/Me."
        },
        {
            "headline": "Select the C: partition",
            "description": ""
        },
        {
            "headline": "choose the option \"Format the partition by using the NTFS file system (Quick)\" and press F. This erases all the files on your hard drive!",
            "description": "Then wait for the files to copy. When the Setup program asks for a Product Key, get the folder that your Windows XP CD was in and look at the yellow label on the back. The ID number printed on it is what it wants. Type it in accurately. If Setup says that the code is invalid, carefully check your typing against the label and try again.If, however, Setup does not detect your hard disk, check your computer's BIOS settings and change any \"AHCI\" or \"RAID\" setting to \"IDE\". (Change it back if you want to go back to Windows Vista.) If there's no such setting, you're out of luck and will have to continue to use Windows Vista. (In this case, just remove the CD and reboot; no files were erased.)"
        },
        {
            "headline": "Install the drivers you saved to the backup disk.",
            "description": "Before running Windows Update, install the WPA update (if needed), and the drivers you downloaded before installing Windows XP."
        },
        {
            "headline": "When you get to the Windows XP desktop, run Windows Update from the Start menu.",
            "description": "To save time, remember to activate Windows first. When updating your computer, you will need a high-speed Internet connection, and several reboots will be required as Service Pack 3 and other updates are installed; after each reboot, you should run Windows Update again until there are no more updates."
        },
        {
            "headline": "Put back your files and software.",
            "description": "Download and install any drivers you need that you have not already installed. Get the software programs you want and reinstall them, and put back your pictures, documents, and other files you saved. Then install an anti-virus program, such as AVG Anti-Virus (free for personal use)."
        }
    ],
    "tyn": [
        "A desktop or notebook computer with a DVD drive",
        "A Windows XP install disc purchased separately from a computer (not bundled with one). The disc must either include Service Pack 1 (SP1) or Service Pack 2 (SP2). If you are using an SP1 disc, you will need to download Service Pack 3 as described in the Tips section."
    ],
    "text": " Consider if you really want to downgrade. The most problematic issues with Windows Vista only apply to the original 2006 version of Vista, not the newer SP1 version that comes with computers sold today. Windows 7 also doesn't have these issues. Windows Vista (7) also includes many features that enhance productivity, including instant desktop search, and features improvements in security. Back up the files you want to save. If you have any pictures or documents you want to keep, or programs that are hard to find, write them to a USB flash drive, external hard disk, or CD or DVD. Do this because everything on your hard disk will be destroyed during the process of installing Windows XP.Also make a set of Windows Vista recovery DVDs to ensure that you can return to Windows Vista if Windows XP doesn't work on your new computer. The exact location of the program to do so differs depending on the brand of your computer, but usually there is a reminder pop-up that periodically appears at the lower right corner if you have not made the discs yet. Download the Windows XP drivers for your computer from its manufacturer. This is necessary because these drivers add support for newer hardware that did not exist when Windows XP was released. Save the drivers onto your backup disk (along with your personal files). Make sure you get the drivers for \"Ethernet\" and \"Wireless\". Otherwise, you might not be able to connect to the Internet to download others. And if you use a wireless network with WPA2 security (or if you're not sure), also download the Wireless Client Update and save it to the backup disk. Also find the driver discs for all printers, scanners, PDAs, music players, and wireless network adapters you will use with the new computer. Some of these drivers might be available from the manufacturer's website if you have lost your CD's. Insert the Windows XP CD and boot to it. Put in the CD and then restart your computer. Wait for the setup files to finish loading. If the computer starts into Windows Vista instead of Windows XP Setup, you may have to press a key to boot from the CD. Restart your computer and press the key for the boot menu. This key is different for every computer depending on the BIOS. Follow the instructions given by Setup. Press ENTER and then press F8 to accept the license agreement.If the setup program asks you for the disc for a previous version of Windows, insert a Windows 98 or Windows Me disc and press ENTER. Then switch back to the Windows XP disc. This is perfectly acceptable as long as you are not using that copy of Windows 98/Me. Select the C: partition  choose the option \"Format the partition by using the NTFS file system (Quick)\" and press F. This erases all the files on your hard drive! Then wait for the files to copy. When the Setup program asks for a Product Key, get the folder that your Windows XP CD was in and look at the yellow label on the back. The ID number printed on it is what it wants. Type it in accurately. If Setup says that the code is invalid, carefully check your typing against the label and try again.If, however, Setup does not detect your hard disk, check your computer's BIOS settings and change any \"AHCI\" or \"RAID\" setting to \"IDE\". (Change it back if you want to go back to Windows Vista.) If there's no such setting, you're out of luck and will have to continue to use Windows Vista. (In this case, just remove the CD and reboot; no files were erased.) Install the drivers you saved to the backup disk. Before running Windows Update, install the WPA update (if needed), and the drivers you downloaded before installing Windows XP. When you get to the Windows XP desktop, run Windows Update from the Start menu. To save time, remember to activate Windows first. When updating your computer, you will need a high-speed Internet connection, and several reboots will be required as Service Pack 3 and other updates are installed; after each reboot, you should run Windows Update again until there are no more updates. Put back your files and software. Download and install any drivers you need that you have not already installed. Get the software programs you want and reinstall them, and put back your pictures, documents, and other files you saved. Then install an anti-virus program, such as AVG Anti-Virus (free for personal use).",
    "sentences": [
        " Consider if you really want to downgrade.",
        "The most problematic issues with Windows Vista only apply to the original 2006 version of Vista, not the newer SP1 version that comes with computers sold today.",
        "Windows 7 also doesn't have these issues.",
        "Windows Vista (7) also includes many features that enhance productivity, including instant desktop search, and features improvements in security.",
        "Back up the files you want to save.",
        "If you have any pictures or documents you want to keep, or programs that are hard to find, write them to a USB flash drive, external hard disk, or CD or DVD.",
        "Do this because everything on your hard disk will be destroyed during the process of installing Windows XP.Also make a set of Windows Vista recovery DVDs to ensure that you can return to Windows Vista if Windows XP doesn't work on your new computer.",
        "The exact location of the program to do so differs depending on the brand of your computer, but usually there is a reminder pop-up that periodically appears at the lower right corner if you have not made the discs yet.",
        "Download the Windows XP drivers for your computer from its manufacturer.",
        "This is necessary because these drivers add support for newer hardware that did not exist when Windows XP was released.",
        "Save the drivers onto your backup disk (along with your personal files).",
        "Make sure you get the drivers for \"Ethernet\" and \"Wireless\".",
        "Otherwise, you might not be able to connect to the Internet to download others.",
        "And if you use a wireless network with WPA2 security (or if you're not sure), also download the Wireless Client Update and save it to the backup disk.",
        "Also find the driver discs for all printers, scanners, PDAs, music players, and wireless network adapters you will use with the new computer.",
        "Some of these drivers might be available from the manufacturer's website if you have lost your CD's.",
        "Insert the Windows XP CD and boot to it.",
        "Put in the CD and then restart your computer.",
        "Wait for the setup files to finish loading.",
        "If the computer starts into Windows Vista instead of Windows XP Setup, you may have to press a key to boot from the CD.",
        "Restart your computer and press the key for the boot menu.",
        "This key is different for every computer depending on the BIOS.",
        "Follow the instructions given by Setup.",
        "Press ENTER and then press F8 to accept the license agreement.If the setup program asks you for the disc for a previous version of Windows, insert a Windows 98 or Windows Me disc and press ENTER.",
        "Then switch back to the Windows XP disc.",
        "This is perfectly acceptable as long as you are not using that copy of Windows 98/Me.",
        "Select the C: partition  choose the option \"Format the partition by using the NTFS file system (Quick)\" and press F. This erases all the files on your hard drive!",
        "Then wait for the files to copy.",
        "When the Setup program asks for a Product Key, get the folder that your Windows XP CD was in and look at the yellow label on the back.",
        "The ID number printed on it is what it wants.",
        "Type it in accurately.",
        "If Setup says that the code is invalid, carefully check your typing against the label and try again.If, however, Setup does not detect your hard disk, check your computer's BIOS settings and change any \"AHCI\" or \"RAID\" setting to \"IDE\".",
        "(Change it back if you want to go back to Windows Vista.)",
        "If there's no such setting, you're out of luck and will have to continue to use Windows Vista.",
        "(In this case, just remove the CD and reboot; no files were erased.)",
        "Install the drivers you saved to the backup disk.",
        "Before running Windows Update, install the WPA update (if needed), and the drivers you downloaded before installing Windows XP.",
        "When you get to the Windows XP desktop, run Windows Update from the Start menu.",
        "To save time, remember to activate Windows first.",
        "When updating your computer, you will need a high-speed Internet connection, and several reboots will be required as Service Pack 3 and other updates are installed; after each reboot, you should run Windows Update again until there are no more updates.",
        "Put back your files and software.",
        "Download and install any drivers you need that you have not already installed.",
        "Get the software programs you want and reinstall them, and put back your pictures, documents, and other files you saved.",
        "Then install an anti-virus program, such as AVG Anti-Virus (free for personal use)."
    ]
}