{
    "title": "How to Make a Flapper Dress",
    "url": "https://www.wikihow.com/Make-a-Flapper-Dress",
    "category_hierarchy": [
        "Personal Care and Style",
        "Clothing",
        "Clothes by Type",
        "Dresses and Skirts"
    ],
    "methods": [
        {
            "name": "The Dress",
            "steps": [
                {
                    "headline": "Find a loose, comfortable tunic.",
                    "description": "Go to thrift shops or secondhand stores to look for a good, basic dress. If it's not perfect, you can always cut it to the desired length or style. The fringe will cover up any imperfections! Knee length is best. This allows for flapper dancing. Flappers have to dance! Try to make the tunic spaghetti-strapped or sleeveless. It can be short sleeved if you prefer, but do not get long sleeves."
                },
                {
                    "headline": "Buy strips of fringe to decorate the dress.",
                    "description": "Make sure to buy enough to wrap all the way around your dress -- not just the front. Drape and pin your first row of fringe to the top of your dress. Measure the distance between where you want your second row of fringe to start all the way down to where you want the second-to-last row of fringe to end. Take that amount and divide it by how many rows you have left to sew on. This ensures that all the rows will be evenly spaced."
                },
                {
                    "headline": "Start sewing the dress.",
                    "description": "For the top row, turn the dress inside out. That'll make it a lot easier. It'll also be much, much easier if you use a sewing machine. Try on your dress. If anything isn't hanging right, go back and adjust. Even though it will take more time, you'll be grateful you did."
                }
            ]
        },
        {
            "name": "The Accessories",
            "steps": [
                {
                    "headline": "Make a headband.",
                    "description": "Buy a length of sequin. It should be a matching color to your tunic or fringe. Measure it around your head -- because it stretches a little, it's best to make it a bit smaller rather than a bit bigger. Cut off the desired length and adhere together with E6000 glue. Pick the desired place on the headband for your embellishment. This could be a flower, feathers, jewels, or whatever suits your fancy. Place some craft glue on your adornment and press firmly into place. You may want to pin it together with clothespins and leave to dry."
                },
                {
                    "headline": "Add the perfect shoes.",
                    "description": "High heeled Mary Janes (with thick heels) are ideal. If you don't have those, anything that wraps around the ankle (so your shoe doesn't come flying off when doing the Charleston) is good. Stilettos weren't super common back in the day -- they're also not great for dancing in. Only go for stilettos as a last resort and if you're confident you won't trip!"
                },
                {
                    "headline": "Add other accessories.",
                    "description": "Though it's certainly not mandatory, a long string of pearls or feather boa is a fun addition to your already playful outfit. Gloves and a long cigarette holder can help put you in the flapper zone, too! Don't forget your makeup! Depending on the color of your dress, you may be able to pull off bright red lipstick -- don't be shy! You'll be turning heads already, might as well milk it for all it's worth!"
                }
            ]
        }
    ],
    "tyn": [
        "The Dress",
        "Tunic",
        "Fringe material",
        "Scissors, needle and thread or sewing machine",
        "The Accessories",
        "Headband (length of sequin and embellishment, glue)",
        "Shoes",
        "Pearls, feather boa, gloves, or cigarette holder",
        "Lipstick (and other makeup, of course)"
    ],
    "text": " The Dress Find a loose, comfortable tunic. Go to thrift shops or secondhand stores to look for a good, basic dress. If it's not perfect, you can always cut it to the desired length or style. The fringe will cover up any imperfections! Knee length is best. This allows for flapper dancing. Flappers have to dance! Try to make the tunic spaghetti-strapped or sleeveless. It can be short sleeved if you prefer, but do not get long sleeves. Buy strips of fringe to decorate the dress. Make sure to buy enough to wrap all the way around your dress -- not just the front. Drape and pin your first row of fringe to the top of your dress. Measure the distance between where you want your second row of fringe to start all the way down to where you want the second-to-last row of fringe to end. Take that amount and divide it by how many rows you have left to sew on. This ensures that all the rows will be evenly spaced. Start sewing the dress. For the top row, turn the dress inside out. That'll make it a lot easier. It'll also be much, much easier if you use a sewing machine. Try on your dress. If anything isn't hanging right, go back and adjust. Even though it will take more time, you'll be grateful you did. The Accessories Make a headband. Buy a length of sequin. It should be a matching color to your tunic or fringe. Measure it around your head -- because it stretches a little, it's best to make it a bit smaller rather than a bit bigger. Cut off the desired length and adhere together with E6000 glue. Pick the desired place on the headband for your embellishment. This could be a flower, feathers, jewels, or whatever suits your fancy. Place some craft glue on your adornment and press firmly into place. You may want to pin it together with clothespins and leave to dry. Add the perfect shoes. High heeled Mary Janes (with thick heels) are ideal. If you don't have those, anything that wraps around the ankle (so your shoe doesn't come flying off when doing the Charleston) is good. Stilettos weren't super common back in the day -- they're also not great for dancing in. Only go for stilettos as a last resort and if you're confident you won't trip! Add other accessories. Though it's certainly not mandatory, a long string of pearls or feather boa is a fun addition to your already playful outfit. Gloves and a long cigarette holder can help put you in the flapper zone, too! Don't forget your makeup! Depending on the color of your dress, you may be able to pull off bright red lipstick -- don't be shy! You'll be turning heads already, might as well milk it for all it's worth!",
    "sentences": [
        " The Dress Find a loose, comfortable tunic.",
        "Go to thrift shops or secondhand stores to look for a good, basic dress.",
        "If it's not perfect, you can always cut it to the desired length or style.",
        "The fringe will cover up any imperfections!",
        "Knee length is best.",
        "This allows for flapper dancing.",
        "Flappers have to dance!",
        "Try to make the tunic spaghetti-strapped or sleeveless.",
        "It can be short sleeved if you prefer, but do not get long sleeves.",
        "Buy strips of fringe to decorate the dress.",
        "Make sure to buy enough to wrap all the way around your dress -- not just the front.",
        "Drape and pin your first row of fringe to the top of your dress.",
        "Measure the distance between where you want your second row of fringe to start all the way down to where you want the second-to-last row of fringe to end.",
        "Take that amount and divide it by how many rows you have left to sew on.",
        "This ensures that all the rows will be evenly spaced.",
        "Start sewing the dress.",
        "For the top row, turn the dress inside out.",
        "That'll make it a lot easier.",
        "It'll also be much, much easier if you use a sewing machine.",
        "Try on your dress.",
        "If anything isn't hanging right, go back and adjust.",
        "Even though it will take more time, you'll be grateful you did.",
        "The Accessories Make a headband.",
        "Buy a length of sequin.",
        "It should be a matching color to your tunic or fringe.",
        "Measure it around your head -- because it stretches a little, it's best to make it a bit smaller rather than a bit bigger.",
        "Cut off the desired length and adhere together with E6000 glue.",
        "Pick the desired place on the headband for your embellishment.",
        "This could be a flower, feathers, jewels, or whatever suits your fancy.",
        "Place some craft glue on your adornment and press firmly into place.",
        "You may want to pin it together with clothespins and leave to dry.",
        "Add the perfect shoes.",
        "High heeled Mary Janes (with thick heels) are ideal.",
        "If you don't have those, anything that wraps around the ankle (so your shoe doesn't come flying off when doing the Charleston) is good.",
        "Stilettos weren't super common back in the day -- they're also not great for dancing in.",
        "Only go for stilettos as a last resort and if you're confident you won't trip!",
        "Add other accessories.",
        "Though it's certainly not mandatory, a long string of pearls or feather boa is a fun addition to your already playful outfit.",
        "Gloves and a long cigarette holder can help put you in the flapper zone, too!",
        "Don't forget your makeup!",
        "Depending on the color of your dress, you may be able to pull off bright red lipstick -- don't be shy!",
        "You'll be turning heads already, might as well milk it for all it's worth!"
    ]
}