{
    "title": "How to Make a Steve Head",
    "url": "https://www.wikihow.com/Make-a-Steve-Head",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Costumes",
        "Toy Costumes"
    ],
    "methods": [
        {
            "name": "Designing Freehand",
            "steps": [
                {
                    "headline": "Find a few reference images.",
                    "description": "If you've memorized how Minecraft Steve looks, you might be able to skip this step. In most cases, however, it'll be a good idea to find a few pictures online to use as a reference. You can look at the game itself for a reference image or do an Internet search using your favorite search engine. Looking for \"Minecraft Steve images\" should be enough. Once you find a few good pictures, print them out or keep them open on your computer screen. Refer to these images as you work."
                },
                {
                    "headline": "Gather several shades of construction paper.",
                    "description": "You will need several shades of brown, beige, and white. You do not need to use blue paper for the eyes since the eyes will eventually be cut out, anyway. The more shades you use, the more accurate the Steve head will look. At minimum, try to find white, beige, tan, light brown, brown, dark brown, and reddish brown."
                },
                {
                    "headline": "Cut the paper into small squares.",
                    "description": "Use a paper cutter or paper trimmer to cut the construction paper into 2-inch (5-cm) squares. You will only need two white squares (one to go on either side of the eye holes). Cut a relatively even number of squares from the remaining construction paper. You will need a total of 320 squares. Scissors can be used if you do not have a paper cutter, but make sure your sides are as even and straight as possible. Note that these squares are sized for a 16-inch (40-cm) cubical box. If the box you use is larger or smaller, you will need to adjust the size of the squares accordingly. The squares will be arranged into an 8-inch by 8-inch (20-cm by 20-cm) grid, so you will need to divide the length of one side of your box by eight to determine how long/wide the paper squares should be."
                },
                {
                    "headline": "Arrange the squares.",
                    "description": "Arrange the squares into five separate groups on a flat working surface. Piece them together so that they resemble the face, back, sides, and top of Steve's head. The squares must be arranged into 8-inch by 8-inch (20-cm by 20-cm) sides. Use the darker brown shades for Steve's hair and the lighter browns and beige shades for Steve's skin. Leave blank space for the eyes approximately four grid spaces from the bottom and three grid spaces from either side."
                },
                {
                    "headline": "Draw a grid onto the box.",
                    "description": "Mark the center of the box on all four sides by drawing a grid. Do the same for the top of the box. Use a ruler and pencil to draw a line down the vertical center of each side, then draw a line down the horizontal center of each side. The point of intersection will be the center of that side. If necessary, you should also take this time to fold the flaps of the open side into the box and out of the way."
                },
                {
                    "headline": "Glue the squares onto each side of the box.",
                    "description": "Carefully glue the paper squares onto each side of the box using a glue stick or hot glue gun. Work on one side at a time, using the grid to guide you as you place the squares. Remember to leave blank spaces for the eyes. If using a glue stick, you'll need to apply glue to the entire back of each piece. If using a hot glue gun, only apply glue to the corners of each piece. Allow all glue to dry before continuing to the next step."
                },
                {
                    "headline": "Cut out spaces for the eyes.",
                    "description": "Find the blank spaces you left for the eyes. Use a craft knife or utility knife to cut out the cardboard there, creating eye holes. Keep the sides straight by placing a ruler along each edge as you cut."
                },
                {
                    "headline": "Attach a cap to the inside.",
                    "description": "Form a loop with heavy-duty packing tape and stick it to the top of a cap. Stick the other side of the tape to the center of box from inside. The cap is not strictly necessary, but it can help the head stay stable on the wearer's head. Make sure that front of the cap faces the face-side of the head."
                },
                {
                    "headline": "Try it on.",
                    "description": "The Steve head should now be done and ready to wear."
                }
            ]
        },
        {
            "name": "Choosing a Pattern",
            "steps": [
                {
                    "headline": "Find and save the pattern.",
                    "description": "You can find several free Steve head patterns online. Once you find one you like, save it to a USB drive. You should be able to find a pattern by searching \"free Minecraft Steve head pattern\" with your favorite search engine. If you are unable to find a pattern, a standard high-resolution image could also work. Free patterns can also be found at:\nhttp://www.stevelange.net/2011/10/24/making-your-own-minecraft-steve-head-from-pdfs/\nhttp://pixelpapercraft.com/papercraft/5089d9d4332bcac60100004f/life-size-steve-head\nhttp://fpsxgames.com/download/printable-minecraft-steve-mask.pdf"
                },
                {
                    "headline": "Print the pattern out.",
                    "description": "Take the pattern to the nearest copy shop and print it out onto heavy poster paper. You could technically print the pattern using a home printer, but the quality probably won't be as good and you will likely need to piece together the images along each side, creating awkward seams. For these reasons, professional printing is strongly recommended. Make sure that the printer prints the images to a length of 11 inches (8 cm), or to the length of your chosen box edge."
                },
                {
                    "headline": "Trim away any excess.",
                    "description": "After printing off the pattern images, use a paper trimmer to cut away any white margins. If you use scissors instead of a paper trimmer, work slowly try to keep your edges as clean and straight as possible."
                },
                {
                    "headline": "Prepare the box.",
                    "description": "Turn your box to the open side and fold the flaps inward to keep them out of the way. If the flaps will not stay down, use packing tape to secure them. This tutorial calls for an 11-inch (28-cm) cubical box. You can use a different size, but the box must remain a cube and must be scaled to match the length and width of your pattern images. If the seams of the box appear weak, cover them with packing tape, as well."
                },
                {
                    "headline": "Glue on the hair.",
                    "description": "Coat the back of the top hair image with glue from a glue stick, then carefully press the hair onto the outer top side of the box. Spray adhesive can be used, as well. If the hair overlaps the edge of the box, you can use clear packing tape to reinforce the edge of the paper. This tape will likely be hidden by the side pieces of the pattern."
                },
                {
                    "headline": "Glue on the remaining four sides.",
                    "description": "Apply glue or spray adhesive to each of the side pieces and attach them to the sides of the box. Work with one side at a time until all four sides are covered. Make sure that the pieces line up in the proper order. The face should be at the front, the back should be on the opposite side, the left side should be on the left, and the right side should be on the right. Allow the glue to dry before continuing to the next step."
                },
                {
                    "headline": "Cut out the eyes.",
                    "description": "Carefully cut out the eyes using a ruler and a craft knife or utility knife. Locate the eye squares at the face side of the head and evenly cut through both the paper and cardboard layers. Line the ruler up along each side and use it to guide the blade as you cut."
                },
                {
                    "headline": "Touch up the colors as needed.",
                    "description": "If any of the colors did not print well, you can use acrylic paint or poster paint to touch them up. You may need to blend colors to achieve the right shade. Note that this probably won't be necessary if you use an actual pattern image and print with high-quality ink. If you enlarged a smaller image or used a low-quality printer, however, you may need to follow this step."
                },
                {
                    "headline": "Attach a cap to the inside of the box.",
                    "description": "Take a piece of clear packing tape and form a loop with the sticky-side out. Attach one side of the loop to the cap and the other side to the center of the box top from the inside. The cap should make it easier for the wearer to keep the Steve head stable when worn. By using tape instead of glue, you should be able to remove the cap and use it later for another purpose. Make sure that the front of the cap points to the face-side of the head."
                },
                {
                    "headline": "Try it on.",
                    "description": "Your Minecraft Steve head should be finished and ready to wear at this point."
                }
            ]
        }
    ],
    "tyn": [
        "Freehand Design",
        "Construction paper, several dozen sheets (white, beige, tan, light brown, brown, dark brown, reddish brown)",
        "Paper cutter/trimmer",
        "16-inch (40-cm) cubical box",
        "Ruler",
        "Pencil",
        "Glue stick or hot glue gun",
        "Box cutter, utility knife, or craft knife",
        "Hat/cap",
        "Packing tape",
        "Pattern",
        "Printed pattern",
        "Paper trimmer or scissors",
        "11-inch (28-cm) cubical box",
        "Glue stick or spray adhesive",
        "Paintbrush (optional)",
        "Acrylic paint (optional)"
    ],
    "text": " Designing Freehand Find a few reference images. If you've memorized how Minecraft Steve looks, you might be able to skip this step. In most cases, however, it'll be a good idea to find a few pictures online to use as a reference. You can look at the game itself for a reference image or do an Internet search using your favorite search engine. Looking for \"Minecraft Steve images\" should be enough. Once you find a few good pictures, print them out or keep them open on your computer screen. Refer to these images as you work. Gather several shades of construction paper. You will need several shades of brown, beige, and white. You do not need to use blue paper for the eyes since the eyes will eventually be cut out, anyway. The more shades you use, the more accurate the Steve head will look. At minimum, try to find white, beige, tan, light brown, brown, dark brown, and reddish brown. Cut the paper into small squares. Use a paper cutter or paper trimmer to cut the construction paper into 2-inch (5-cm) squares. You will only need two white squares (one to go on either side of the eye holes). Cut a relatively even number of squares from the remaining construction paper. You will need a total of 320 squares. Scissors can be used if you do not have a paper cutter, but make sure your sides are as even and straight as possible. Note that these squares are sized for a 16-inch (40-cm) cubical box. If the box you use is larger or smaller, you will need to adjust the size of the squares accordingly. The squares will be arranged into an 8-inch by 8-inch (20-cm by 20-cm) grid, so you will need to divide the length of one side of your box by eight to determine how long/wide the paper squares should be. Arrange the squares. Arrange the squares into five separate groups on a flat working surface. Piece them together so that they resemble the face, back, sides, and top of Steve's head. The squares must be arranged into 8-inch by 8-inch (20-cm by 20-cm) sides. Use the darker brown shades for Steve's hair and the lighter browns and beige shades for Steve's skin. Leave blank space for the eyes approximately four grid spaces from the bottom and three grid spaces from either side. Draw a grid onto the box. Mark the center of the box on all four sides by drawing a grid. Do the same for the top of the box. Use a ruler and pencil to draw a line down the vertical center of each side, then draw a line down the horizontal center of each side. The point of intersection will be the center of that side. If necessary, you should also take this time to fold the flaps of the open side into the box and out of the way. Glue the squares onto each side of the box. Carefully glue the paper squares onto each side of the box using a glue stick or hot glue gun. Work on one side at a time, using the grid to guide you as you place the squares. Remember to leave blank spaces for the eyes. If using a glue stick, you'll need to apply glue to the entire back of each piece. If using a hot glue gun, only apply glue to the corners of each piece. Allow all glue to dry before continuing to the next step. Cut out spaces for the eyes. Find the blank spaces you left for the eyes. Use a craft knife or utility knife to cut out the cardboard there, creating eye holes. Keep the sides straight by placing a ruler along each edge as you cut. Attach a cap to the inside. Form a loop with heavy-duty packing tape and stick it to the top of a cap. Stick the other side of the tape to the center of box from inside. The cap is not strictly necessary, but it can help the head stay stable on the wearer's head. Make sure that front of the cap faces the face-side of the head. Try it on. The Steve head should now be done and ready to wear. Choosing a Pattern Find and save the pattern. You can find several free Steve head patterns online. Once you find one you like, save it to a USB drive. You should be able to find a pattern by searching \"free Minecraft Steve head pattern\" with your favorite search engine. If you are unable to find a pattern, a standard high-resolution image could also work. Free patterns can also be found at:\nhttp://www.stevelange.net/2011/10/24/making-your-own-minecraft-steve-head-from-pdfs/\nhttp://pixelpapercraft.com/papercraft/5089d9d4332bcac60100004f/life-size-steve-head\nhttp://fpsxgames.com/download/printable-minecraft-steve-mask.pdf Print the pattern out. Take the pattern to the nearest copy shop and print it out onto heavy poster paper. You could technically print the pattern using a home printer, but the quality probably won't be as good and you will likely need to piece together the images along each side, creating awkward seams. For these reasons, professional printing is strongly recommended. Make sure that the printer prints the images to a length of 11 inches (8 cm), or to the length of your chosen box edge. Trim away any excess. After printing off the pattern images, use a paper trimmer to cut away any white margins. If you use scissors instead of a paper trimmer, work slowly try to keep your edges as clean and straight as possible. Prepare the box. Turn your box to the open side and fold the flaps inward to keep them out of the way. If the flaps will not stay down, use packing tape to secure them. This tutorial calls for an 11-inch (28-cm) cubical box. You can use a different size, but the box must remain a cube and must be scaled to match the length and width of your pattern images. If the seams of the box appear weak, cover them with packing tape, as well. Glue on the hair. Coat the back of the top hair image with glue from a glue stick, then carefully press the hair onto the outer top side of the box. Spray adhesive can be used, as well. If the hair overlaps the edge of the box, you can use clear packing tape to reinforce the edge of the paper. This tape will likely be hidden by the side pieces of the pattern. Glue on the remaining four sides. Apply glue or spray adhesive to each of the side pieces and attach them to the sides of the box. Work with one side at a time until all four sides are covered. Make sure that the pieces line up in the proper order. The face should be at the front, the back should be on the opposite side, the left side should be on the left, and the right side should be on the right. Allow the glue to dry before continuing to the next step. Cut out the eyes. Carefully cut out the eyes using a ruler and a craft knife or utility knife. Locate the eye squares at the face side of the head and evenly cut through both the paper and cardboard layers. Line the ruler up along each side and use it to guide the blade as you cut. Touch up the colors as needed. If any of the colors did not print well, you can use acrylic paint or poster paint to touch them up. You may need to blend colors to achieve the right shade. Note that this probably won't be necessary if you use an actual pattern image and print with high-quality ink. If you enlarged a smaller image or used a low-quality printer, however, you may need to follow this step. Attach a cap to the inside of the box. Take a piece of clear packing tape and form a loop with the sticky-side out. Attach one side of the loop to the cap and the other side to the center of the box top from the inside. The cap should make it easier for the wearer to keep the Steve head stable when worn. By using tape instead of glue, you should be able to remove the cap and use it later for another purpose. Make sure that the front of the cap points to the face-side of the head. Try it on. Your Minecraft Steve head should be finished and ready to wear at this point.",
    "sentences": [
        " Designing Freehand Find a few reference images.",
        "If you've memorized how Minecraft Steve looks, you might be able to skip this step.",
        "In most cases, however, it'll be a good idea to find a few pictures online to use as a reference.",
        "You can look at the game itself for a reference image or do an Internet search using your favorite search engine.",
        "Looking for \"Minecraft Steve images\" should be enough.",
        "Once you find a few good pictures, print them out or keep them open on your computer screen.",
        "Refer to these images as you work.",
        "Gather several shades of construction paper.",
        "You will need several shades of brown, beige, and white.",
        "You do not need to use blue paper for the eyes since the eyes will eventually be cut out, anyway.",
        "The more shades you use, the more accurate the Steve head will look.",
        "At minimum, try to find white, beige, tan, light brown, brown, dark brown, and reddish brown.",
        "Cut the paper into small squares.",
        "Use a paper cutter or paper trimmer to cut the construction paper into 2-inch (5-cm) squares.",
        "You will only need two white squares (one to go on either side of the eye holes).",
        "Cut a relatively even number of squares from the remaining construction paper.",
        "You will need a total of 320 squares.",
        "Scissors can be used if you do not have a paper cutter, but make sure your sides are as even and straight as possible.",
        "Note that these squares are sized for a 16-inch (40-cm) cubical box.",
        "If the box you use is larger or smaller, you will need to adjust the size of the squares accordingly.",
        "The squares will be arranged into an 8-inch by 8-inch (20-cm by 20-cm) grid, so you will need to divide the length of one side of your box by eight to determine how long/wide the paper squares should be.",
        "Arrange the squares.",
        "Arrange the squares into five separate groups on a flat working surface.",
        "Piece them together so that they resemble the face, back, sides, and top of Steve's head.",
        "The squares must be arranged into 8-inch by 8-inch (20-cm by 20-cm) sides.",
        "Use the darker brown shades for Steve's hair and the lighter browns and beige shades for Steve's skin.",
        "Leave blank space for the eyes approximately four grid spaces from the bottom and three grid spaces from either side.",
        "Draw a grid onto the box.",
        "Mark the center of the box on all four sides by drawing a grid.",
        "Do the same for the top of the box.",
        "Use a ruler and pencil to draw a line down the vertical center of each side, then draw a line down the horizontal center of each side.",
        "The point of intersection will be the center of that side.",
        "If necessary, you should also take this time to fold the flaps of the open side into the box and out of the way.",
        "Glue the squares onto each side of the box.",
        "Carefully glue the paper squares onto each side of the box using a glue stick or hot glue gun.",
        "Work on one side at a time, using the grid to guide you as you place the squares.",
        "Remember to leave blank spaces for the eyes.",
        "If using a glue stick, you'll need to apply glue to the entire back of each piece.",
        "If using a hot glue gun, only apply glue to the corners of each piece.",
        "Allow all glue to dry before continuing to the next step.",
        "Cut out spaces for the eyes.",
        "Find the blank spaces you left for the eyes.",
        "Use a craft knife or utility knife to cut out the cardboard there, creating eye holes.",
        "Keep the sides straight by placing a ruler along each edge as you cut.",
        "Attach a cap to the inside.",
        "Form a loop with heavy-duty packing tape and stick it to the top of a cap.",
        "Stick the other side of the tape to the center of box from inside.",
        "The cap is not strictly necessary, but it can help the head stay stable on the wearer's head.",
        "Make sure that front of the cap faces the face-side of the head.",
        "Try it on.",
        "The Steve head should now be done and ready to wear.",
        "Choosing a Pattern Find and save the pattern.",
        "You can find several free Steve head patterns online.",
        "Once you find one you like, save it to a USB drive.",
        "You should be able to find a pattern by searching \"free Minecraft Steve head pattern\" with your favorite search engine.",
        "If you are unable to find a pattern, a standard high-resolution image could also work.",
        "Free patterns can also be found at:\nhttp://www.stevelange.net/2011/10/24/making-your-own-minecraft-steve-head-from-pdfs/\nhttp://pixelpapercraft.com/papercraft/5089d9d4332bcac60100004f/life-size-steve-head\nhttp://fpsxgames.com/download/printable-minecraft-steve-mask.pdf Print the pattern out.",
        "Take the pattern to the nearest copy shop and print it out onto heavy poster paper.",
        "You could technically print the pattern using a home printer, but the quality probably won't be as good and you will likely need to piece together the images along each side, creating awkward seams.",
        "For these reasons, professional printing is strongly recommended.",
        "Make sure that the printer prints the images to a length of 11 inches (8 cm), or to the length of your chosen box edge.",
        "Trim away any excess.",
        "After printing off the pattern images, use a paper trimmer to cut away any white margins.",
        "If you use scissors instead of a paper trimmer, work slowly try to keep your edges as clean and straight as possible.",
        "Prepare the box.",
        "Turn your box to the open side and fold the flaps inward to keep them out of the way.",
        "If the flaps will not stay down, use packing tape to secure them.",
        "This tutorial calls for an 11-inch (28-cm) cubical box.",
        "You can use a different size, but the box must remain a cube and must be scaled to match the length and width of your pattern images.",
        "If the seams of the box appear weak, cover them with packing tape, as well.",
        "Glue on the hair.",
        "Coat the back of the top hair image with glue from a glue stick, then carefully press the hair onto the outer top side of the box.",
        "Spray adhesive can be used, as well.",
        "If the hair overlaps the edge of the box, you can use clear packing tape to reinforce the edge of the paper.",
        "This tape will likely be hidden by the side pieces of the pattern.",
        "Glue on the remaining four sides.",
        "Apply glue or spray adhesive to each of the side pieces and attach them to the sides of the box.",
        "Work with one side at a time until all four sides are covered.",
        "Make sure that the pieces line up in the proper order.",
        "The face should be at the front, the back should be on the opposite side, the left side should be on the left, and the right side should be on the right.",
        "Allow the glue to dry before continuing to the next step.",
        "Cut out the eyes.",
        "Carefully cut out the eyes using a ruler and a craft knife or utility knife.",
        "Locate the eye squares at the face side of the head and evenly cut through both the paper and cardboard layers.",
        "Line the ruler up along each side and use it to guide the blade as you cut.",
        "Touch up the colors as needed.",
        "If any of the colors did not print well, you can use acrylic paint or poster paint to touch them up.",
        "You may need to blend colors to achieve the right shade.",
        "Note that this probably won't be necessary if you use an actual pattern image and print with high-quality ink.",
        "If you enlarged a smaller image or used a low-quality printer, however, you may need to follow this step.",
        "Attach a cap to the inside of the box.",
        "Take a piece of clear packing tape and form a loop with the sticky-side out.",
        "Attach one side of the loop to the cap and the other side to the center of the box top from the inside.",
        "The cap should make it easier for the wearer to keep the Steve head stable when worn.",
        "By using tape instead of glue, you should be able to remove the cap and use it later for another purpose.",
        "Make sure that the front of the cap points to the face-side of the head.",
        "Try it on.",
        "Your Minecraft Steve head should be finished and ready to wear at this point."
    ]
}