{
    "title": "How to Make a Pipe Cleaner Person",
    "url": "https://www.wikihow.com/Make-a-Pipe-Cleaner-Person",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Craft for Kids",
        "Pipe Cleaner Crafts"
    ],
    "steps": [
        {
            "headline": "Create a \"V\" shape with the pipe cleaner.",
            "description": "Make a small loop at the top for the head placement."
        },
        {
            "headline": "Twist the pipe cleaner a few times to make the \"body\" figure.",
            "description": "The leftover two sides will become the legs."
        },
        {
            "headline": "Curl another pipe cleaner around a pencil or pen.",
            "description": ""
        },
        {
            "headline": "Loop the legs through the curled one and move the curled one up onto the twisted part to make the torso.",
            "description": ""
        },
        {
            "headline": "Bend a third pipe cleaner in half and loop it through the head part.",
            "description": "This will become the arms, as you can clip it shorter on both sides if needed."
        },
        {
            "headline": "Create another curled pipe cleaner and place it on top of the head placement.",
            "description": "This curled pipe cleaner will become the head."
        },
        {
            "headline": "Create the hands and feet by curling the arms and legs in a small circle.",
            "description": ""
        },
        {
            "headline": "Add other features.",
            "description": "Glue wiggly eyes and add a different color pipe cleaner around the neck for a scarf."
        }
    ],
    "tyn": [
        "4 pipe cleaners, with some leftovers for other features",
        "Scissors or wire cutters",
        "Wiggly eyes",
        "Glue"
    ],
    "text": " Create a \"V\" shape with the pipe cleaner. Make a small loop at the top for the head placement. Twist the pipe cleaner a few times to make the \"body\" figure. The leftover two sides will become the legs. Curl another pipe cleaner around a pencil or pen.  Loop the legs through the curled one and move the curled one up onto the twisted part to make the torso.  Bend a third pipe cleaner in half and loop it through the head part. This will become the arms, as you can clip it shorter on both sides if needed. Create another curled pipe cleaner and place it on top of the head placement. This curled pipe cleaner will become the head. Create the hands and feet by curling the arms and legs in a small circle.  Add other features. Glue wiggly eyes and add a different color pipe cleaner around the neck for a scarf.",
    "sentences": [
        " Create a \"V\" shape with the pipe cleaner.",
        "Make a small loop at the top for the head placement.",
        "Twist the pipe cleaner a few times to make the \"body\" figure.",
        "The leftover two sides will become the legs.",
        "Curl another pipe cleaner around a pencil or pen.",
        "Loop the legs through the curled one and move the curled one up onto the twisted part to make the torso.",
        "Bend a third pipe cleaner in half and loop it through the head part.",
        "This will become the arms, as you can clip it shorter on both sides if needed.",
        "Create another curled pipe cleaner and place it on top of the head placement.",
        "This curled pipe cleaner will become the head.",
        "Create the hands and feet by curling the arms and legs in a small circle.",
        "Add other features.",
        "Glue wiggly eyes and add a different color pipe cleaner around the neck for a scarf."
    ]
}