{
    "title": "How to Take Care of Infection in Newly Pierced Ears",
    "url": "https://www.wikihow.com/Take-Care-of-Infection-in-Newly-Pierced-Ears",
    "category_hierarchy": [
        "Personal Care and Style",
        "Tattoos and Piercing",
        "Piercings",
        "Ear Piercing"
    ],
    "methods": [
        {
            "name": "Treating a Fresh Infection",
            "steps": [
                {
                    "headline": "Identify an infection by looking for redness and swelling.",
                    "description": "Most ear piercing infections are uncomfortable, but, provided action is taken, are never a serious problem. While newly-pierced ears can have a lingering tender feeling for days or weeks, an actual infection usually comes with redness, swelling, and irritation. If your piercing is exhibiting these symptoms, you probably have a minor infection. Not to worry - most piercing infections go away with a few days of treatment at home."
                },
                {
                    "headline": "Wash your hands.",
                    "description": "Most piercing infections are the result of bacteria being introduced into the piercing. This can be from a variety of sources, though dirty piercing equipment, dirty earrings, and dirty hands are among the most common. The next few steps will require you to touch your ears and earrings with your hands, so, before beginning, be sure to carefully wash with an antibacterial soap them to make them as clean and sterile as possible. If you're extra-worried about the germs on your hands, you may even wear a pair of sterile gloves as you work."
                },
                {
                    "headline": "Remove the earring(s) and clean the infected piercing(s).",
                    "description": "When your hands are cleaned, carefully remove the earring from the infected piercing. Use a clean cotton swab or Q-tip to apply an anti-bacterial cleaning solution to both sides of the piercing. In terms of cleaning solutions, you may have several options. Some earrings come with a solutions specifically-designed for this purpose. If yours did not, most commercial antiseptic solutions (especially ones containing benzalkonium chloride) intended for similar uses will work well. Some medical sources recommend rubbing alcohol, while others recommend against it."
                },
                {
                    "headline": "Clean the earring post and reinsert the earring.",
                    "description": "Next, clean your earring's post (the part that sits in the piercing) with the same antiseptic solution you cleaned your ear with. After doing this, apply a thin coating of antibiotic ointment or cream to the post. This will help to kill bacteria inside the piercing when the earring is re-inserted. Finally, put the earring back in."
                },
                {
                    "headline": "Repeat this cleaning process three times each day.",
                    "description": "Perform this routine - removing the earring, cleaning the outside of the piercing, cleaning and applying antibiotic ointment to the post, and re-inserting the earring - three times per day. Maintain this routine for two days after the symptoms of the infection disappear. This last point is important. When fighting bacterial infections, it's crucial to ensure that the infection has been completely wiped out before stopping treatment. If a small amount of bacteria remain, the infection may return."
                },
                {
                    "headline": "Use over-the counter pain medications properly.",
                    "description": "While you're waiting for your infection to disappear, you can treat the pain and inflammation resulting from it by taking most commercially-available painkillers. Acetaminophen, Ibuprofen, Aspirin, Naproxen Sodium, and most other cheap, common medicines will work fine. Even when dealing with these relatively weak drugs, never take more than the recommended dosage or mix drugs carelessly. This is especially true with Non-Steroidal Anti-Inflammatory Drugs (NSAIDs), a class of drugs including Ibuprofen and Aspirin, which have been linked to a variety of serious side effects at high doses."
                },
                {
                    "headline": "Don't hesitate to see a doctor if the infection worsens.",
                    "description": "Though most infections caused by ear piercings are superficial and temporary, some can develop into serious issues. Left untreated, these infections can cause lasting discomfort, permanent damage to the ear, or even worse outcomes. If your infection leads to any of the following symptoms, it's a wise idea to see a doctor as soon as possible to gain access to antibiotics or other forms of treatment:\nSwelling and redness that worsen or do not improve after two days of treatment\nFluid draining from the site of the infection\nSwelling that becomes so pronounced that it is difficult to see either side of the earring\nFever over 100.4°F (38.0°C)"
                }
            ]
        },
        {
            "name": "Preventing Future Infections",
            "steps": [
                {
                    "headline": "Avoid touching your earrings, especially with dirty hands.",
                    "description": "As noted above, one common cause of infection following an ear piercing is the introduction of bacteria into the piercing via the wearer's hands. Though it's easy to absent-mindedly fool with your earrings while you're bored or daydreaming, try to avoid this type of behavior, especially if your hands haven't been recently washed. Doing so lessens the likelihood that you'll accidentally re-infect your piercing."
                },
                {
                    "headline": "Clean your earrings and earlobes before inserting your earrings.",
                    "description": "If you're prone to piercing infections, you may want continue performing the cleaning routine above, albeit less frequently. When you're able to, clean the posts of your earrings and the area around each piercing with an antiseptic fluid before inserting your earrings to kill any bacteria that may be introduced into the piercing."
                },
                {
                    "headline": "Wear your earrings with a loose clasp.",
                    "description": "Believe it or not, one of the causes of ear piercing infection is earrings worn too tightly! If the earring's clasp is applied too tightly, it can cut off the flow of air to the piercing, which, over time, can increase the risk of infection. To prevent this, simply wear your earrings loosely so that air can reach both sides of the piercing."
                },
                {
                    "headline": "Remove the earrings before bed once the piercing has become permanent.",
                    "description": "For the same reason as above, you'll want to periodically give your piercings a chance to \"rest\" from wearing your earrings. Once the piercings have healed (for piercings in the lobe, this is usually about six weeks), take your earrings out every night before you sleep. Doing so ensures that air is able to reach your piercing, reducing the risk of infection."
                },
                {
                    "headline": "Use earrings made from a non-irritating material.",
                    "description": "Certain types of metal used for earrings can irritate the skin or cause an allergic reaction in the skin. These problems can develop into full-blown infections if not addressed. For most people, irritation can be avoided by wearing earrings with posts made from neutral metals like 14-karat gold and stainless steel, which are unlikely to cause problems. Avoid earrings made from nickel, which are notorious for causing allergic reactions."
                }
            ]
        }
    ],
    "tyn": [
        "Sea salt soak (1 cup warm distilled water with 1/4 tsp of non-iodized sea salt) or H2Ocean spray",
        "Clean hands",
        "A piercer's number to call in case of a problem"
    ],
    "text": " Treating a Fresh Infection Identify an infection by looking for redness and swelling. Most ear piercing infections are uncomfortable, but, provided action is taken, are never a serious problem. While newly-pierced ears can have a lingering tender feeling for days or weeks, an actual infection usually comes with redness, swelling, and irritation. If your piercing is exhibiting these symptoms, you probably have a minor infection. Not to worry - most piercing infections go away with a few days of treatment at home. Wash your hands. Most piercing infections are the result of bacteria being introduced into the piercing. This can be from a variety of sources, though dirty piercing equipment, dirty earrings, and dirty hands are among the most common. The next few steps will require you to touch your ears and earrings with your hands, so, before beginning, be sure to carefully wash with an antibacterial soap them to make them as clean and sterile as possible. If you're extra-worried about the germs on your hands, you may even wear a pair of sterile gloves as you work. Remove the earring(s) and clean the infected piercing(s). When your hands are cleaned, carefully remove the earring from the infected piercing. Use a clean cotton swab or Q-tip to apply an anti-bacterial cleaning solution to both sides of the piercing. In terms of cleaning solutions, you may have several options. Some earrings come with a solutions specifically-designed for this purpose. If yours did not, most commercial antiseptic solutions (especially ones containing benzalkonium chloride) intended for similar uses will work well. Some medical sources recommend rubbing alcohol, while others recommend against it. Clean the earring post and reinsert the earring. Next, clean your earring's post (the part that sits in the piercing) with the same antiseptic solution you cleaned your ear with. After doing this, apply a thin coating of antibiotic ointment or cream to the post. This will help to kill bacteria inside the piercing when the earring is re-inserted. Finally, put the earring back in. Repeat this cleaning process three times each day. Perform this routine - removing the earring, cleaning the outside of the piercing, cleaning and applying antibiotic ointment to the post, and re-inserting the earring - three times per day. Maintain this routine for two days after the symptoms of the infection disappear. This last point is important. When fighting bacterial infections, it's crucial to ensure that the infection has been completely wiped out before stopping treatment. If a small amount of bacteria remain, the infection may return. Use over-the counter pain medications properly. While you're waiting for your infection to disappear, you can treat the pain and inflammation resulting from it by taking most commercially-available painkillers. Acetaminophen, Ibuprofen, Aspirin, Naproxen Sodium, and most other cheap, common medicines will work fine. Even when dealing with these relatively weak drugs, never take more than the recommended dosage or mix drugs carelessly. This is especially true with Non-Steroidal Anti-Inflammatory Drugs (NSAIDs), a class of drugs including Ibuprofen and Aspirin, which have been linked to a variety of serious side effects at high doses. Don't hesitate to see a doctor if the infection worsens. Though most infections caused by ear piercings are superficial and temporary, some can develop into serious issues. Left untreated, these infections can cause lasting discomfort, permanent damage to the ear, or even worse outcomes. If your infection leads to any of the following symptoms, it's a wise idea to see a doctor as soon as possible to gain access to antibiotics or other forms of treatment:\nSwelling and redness that worsen or do not improve after two days of treatment\nFluid draining from the site of the infection\nSwelling that becomes so pronounced that it is difficult to see either side of the earring\nFever over 100.4°F (38.0°C) Preventing Future Infections Avoid touching your earrings, especially with dirty hands. As noted above, one common cause of infection following an ear piercing is the introduction of bacteria into the piercing via the wearer's hands. Though it's easy to absent-mindedly fool with your earrings while you're bored or daydreaming, try to avoid this type of behavior, especially if your hands haven't been recently washed. Doing so lessens the likelihood that you'll accidentally re-infect your piercing. Clean your earrings and earlobes before inserting your earrings. If you're prone to piercing infections, you may want continue performing the cleaning routine above, albeit less frequently. When you're able to, clean the posts of your earrings and the area around each piercing with an antiseptic fluid before inserting your earrings to kill any bacteria that may be introduced into the piercing. Wear your earrings with a loose clasp. Believe it or not, one of the causes of ear piercing infection is earrings worn too tightly! If the earring's clasp is applied too tightly, it can cut off the flow of air to the piercing, which, over time, can increase the risk of infection. To prevent this, simply wear your earrings loosely so that air can reach both sides of the piercing. Remove the earrings before bed once the piercing has become permanent. For the same reason as above, you'll want to periodically give your piercings a chance to \"rest\" from wearing your earrings. Once the piercings have healed (for piercings in the lobe, this is usually about six weeks), take your earrings out every night before you sleep. Doing so ensures that air is able to reach your piercing, reducing the risk of infection. Use earrings made from a non-irritating material. Certain types of metal used for earrings can irritate the skin or cause an allergic reaction in the skin. These problems can develop into full-blown infections if not addressed. For most people, irritation can be avoided by wearing earrings with posts made from neutral metals like 14-karat gold and stainless steel, which are unlikely to cause problems. Avoid earrings made from nickel, which are notorious for causing allergic reactions.",
    "sentences": [
        " Treating a Fresh Infection Identify an infection by looking for redness and swelling.",
        "Most ear piercing infections are uncomfortable, but, provided action is taken, are never a serious problem.",
        "While newly-pierced ears can have a lingering tender feeling for days or weeks, an actual infection usually comes with redness, swelling, and irritation.",
        "If your piercing is exhibiting these symptoms, you probably have a minor infection.",
        "Not to worry - most piercing infections go away with a few days of treatment at home.",
        "Wash your hands.",
        "Most piercing infections are the result of bacteria being introduced into the piercing.",
        "This can be from a variety of sources, though dirty piercing equipment, dirty earrings, and dirty hands are among the most common.",
        "The next few steps will require you to touch your ears and earrings with your hands, so, before beginning, be sure to carefully wash with an antibacterial soap them to make them as clean and sterile as possible.",
        "If you're extra-worried about the germs on your hands, you may even wear a pair of sterile gloves as you work.",
        "Remove the earring(s) and clean the infected piercing(s).",
        "When your hands are cleaned, carefully remove the earring from the infected piercing.",
        "Use a clean cotton swab or Q-tip to apply an anti-bacterial cleaning solution to both sides of the piercing.",
        "In terms of cleaning solutions, you may have several options.",
        "Some earrings come with a solutions specifically-designed for this purpose.",
        "If yours did not, most commercial antiseptic solutions (especially ones containing benzalkonium chloride) intended for similar uses will work well.",
        "Some medical sources recommend rubbing alcohol, while others recommend against it.",
        "Clean the earring post and reinsert the earring.",
        "Next, clean your earring's post (the part that sits in the piercing) with the same antiseptic solution you cleaned your ear with.",
        "After doing this, apply a thin coating of antibiotic ointment or cream to the post.",
        "This will help to kill bacteria inside the piercing when the earring is re-inserted.",
        "Finally, put the earring back in.",
        "Repeat this cleaning process three times each day.",
        "Perform this routine - removing the earring, cleaning the outside of the piercing, cleaning and applying antibiotic ointment to the post, and re-inserting the earring - three times per day.",
        "Maintain this routine for two days after the symptoms of the infection disappear.",
        "This last point is important.",
        "When fighting bacterial infections, it's crucial to ensure that the infection has been completely wiped out before stopping treatment.",
        "If a small amount of bacteria remain, the infection may return.",
        "Use over-the counter pain medications properly.",
        "While you're waiting for your infection to disappear, you can treat the pain and inflammation resulting from it by taking most commercially-available painkillers.",
        "Acetaminophen, Ibuprofen, Aspirin, Naproxen Sodium, and most other cheap, common medicines will work fine.",
        "Even when dealing with these relatively weak drugs, never take more than the recommended dosage or mix drugs carelessly.",
        "This is especially true with Non-Steroidal Anti-Inflammatory Drugs (NSAIDs), a class of drugs including Ibuprofen and Aspirin, which have been linked to a variety of serious side effects at high doses.",
        "Don't hesitate to see a doctor if the infection worsens.",
        "Though most infections caused by ear piercings are superficial and temporary, some can develop into serious issues.",
        "Left untreated, these infections can cause lasting discomfort, permanent damage to the ear, or even worse outcomes.",
        "If your infection leads to any of the following symptoms, it's a wise idea to see a doctor as soon as possible to gain access to antibiotics or other forms of treatment:\nSwelling and redness that worsen or do not improve after two days of treatment\nFluid draining from the site of the infection\nSwelling that becomes so pronounced that it is difficult to see either side of the earring\nFever over 100.4°F (38.0°C) Preventing Future Infections Avoid touching your earrings, especially with dirty hands.",
        "As noted above, one common cause of infection following an ear piercing is the introduction of bacteria into the piercing via the wearer's hands.",
        "Though it's easy to absent-mindedly fool with your earrings while you're bored or daydreaming, try to avoid this type of behavior, especially if your hands haven't been recently washed.",
        "Doing so lessens the likelihood that you'll accidentally re-infect your piercing.",
        "Clean your earrings and earlobes before inserting your earrings.",
        "If you're prone to piercing infections, you may want continue performing the cleaning routine above, albeit less frequently.",
        "When you're able to, clean the posts of your earrings and the area around each piercing with an antiseptic fluid before inserting your earrings to kill any bacteria that may be introduced into the piercing.",
        "Wear your earrings with a loose clasp.",
        "Believe it or not, one of the causes of ear piercing infection is earrings worn too tightly!",
        "If the earring's clasp is applied too tightly, it can cut off the flow of air to the piercing, which, over time, can increase the risk of infection.",
        "To prevent this, simply wear your earrings loosely so that air can reach both sides of the piercing.",
        "Remove the earrings before bed once the piercing has become permanent.",
        "For the same reason as above, you'll want to periodically give your piercings a chance to \"rest\" from wearing your earrings.",
        "Once the piercings have healed (for piercings in the lobe, this is usually about six weeks), take your earrings out every night before you sleep.",
        "Doing so ensures that air is able to reach your piercing, reducing the risk of infection.",
        "Use earrings made from a non-irritating material.",
        "Certain types of metal used for earrings can irritate the skin or cause an allergic reaction in the skin.",
        "These problems can develop into full-blown infections if not addressed.",
        "For most people, irritation can be avoided by wearing earrings with posts made from neutral metals like 14-karat gold and stainless steel, which are unlikely to cause problems.",
        "Avoid earrings made from nickel, which are notorious for causing allergic reactions."
    ]
}