{
    "title": "How to Use Prizerebel",
    "url": "https://www.wikihow.com/Use-Prizerebel",
    "category_hierarchy": [
        "Finance and Business",
        "Managing Your Money",
        "Making Money",
        "Making Money Online",
        "Rewards Websites"
    ],
    "steps": [
        {
            "headline": "Make a new email that can take spam.",
            "description": "This is needed for confirmation of your Email in some surveys, and to not spam your real Email. If redeeming PayPal, make sure you've added your email address to your PayPal account."
        },
        {
            "headline": "Go to the Prize Rebel homepage.",
            "description": "Go to the \"Sign Up\" area, enter your Email address (preferably your most useless one), create a password, and make an account. You can also log in with your Facebook account."
        },
        {
            "headline": "Go to your email to confirm this link.",
            "description": ""
        },
        {
            "headline": "Hover over the Get Points Tab and click on Complete Offers or Recently Credited.",
            "description": "You may prefer the Recently Credited tab because you know these offers have been credited to others but the Complete Offers tab is more organized."
        },
        {
            "headline": "Be sure to use a web browser that can open tabs, as you will have to have PrizeRebel, your Email, and the offer in the same window!",
            "description": ""
        },
        {
            "headline": "Use your real information.",
            "description": "Companies tend to check if you have given information that matches with your IP Address."
        },
        {
            "headline": "Complete the surveys.",
            "description": "Follow the description on the \"Available Offers\" page to see what your tasks are. For some of the surveys, you will have to put in your Email. In this situation, put in a newly created email."
        },
        {
            "headline": "After you finish an offer according to the description, you will either get your points instantly or within a day or two.",
            "description": "Usually you will have to wait longer for more complex offers, such as insurance offers, or for high paying offers."
        },
        {
            "headline": "When you get enough points, you can go to \"Available Prizes\" to get Gamecodes for games, cards, or other things.",
            "description": "You can also go to \"Custom Prize\" and request a different prize. Please remember that each point it worth one dollar. For gamecodes, it will be emailed to you."
        }
    ],
    "tyn": [
        "Google Chrome or Mozilla Firefox (Any web browser will do)",
        "RoboForm for fast offer completion",
        "Fresh email created approximately everyday (Use disposable email from a provider online)"
    ],
    "text": " Make a new email that can take spam. This is needed for confirmation of your Email in some surveys, and to not spam your real Email. If redeeming PayPal, make sure you've added your email address to your PayPal account. Go to the Prize Rebel homepage. Go to the \"Sign Up\" area, enter your Email address (preferably your most useless one), create a password, and make an account. You can also log in with your Facebook account. Go to your email to confirm this link.  Hover over the Get Points Tab and click on Complete Offers or Recently Credited. You may prefer the Recently Credited tab because you know these offers have been credited to others but the Complete Offers tab is more organized. Be sure to use a web browser that can open tabs, as you will have to have PrizeRebel, your Email, and the offer in the same window!  Use your real information. Companies tend to check if you have given information that matches with your IP Address. Complete the surveys. Follow the description on the \"Available Offers\" page to see what your tasks are. For some of the surveys, you will have to put in your Email. In this situation, put in a newly created email. After you finish an offer according to the description, you will either get your points instantly or within a day or two. Usually you will have to wait longer for more complex offers, such as insurance offers, or for high paying offers. When you get enough points, you can go to \"Available Prizes\" to get Gamecodes for games, cards, or other things. You can also go to \"Custom Prize\" and request a different prize. Please remember that each point it worth one dollar. For gamecodes, it will be emailed to you.",
    "sentences": [
        " Make a new email that can take spam.",
        "This is needed for confirmation of your Email in some surveys, and to not spam your real Email.",
        "If redeeming PayPal, make sure you've added your email address to your PayPal account.",
        "Go to the Prize Rebel homepage.",
        "Go to the \"Sign Up\" area, enter your Email address (preferably your most useless one), create a password, and make an account.",
        "You can also log in with your Facebook account.",
        "Go to your email to confirm this link.",
        "Hover over the Get Points Tab and click on Complete Offers or Recently Credited.",
        "You may prefer the Recently Credited tab because you know these offers have been credited to others but the Complete Offers tab is more organized.",
        "Be sure to use a web browser that can open tabs, as you will have to have PrizeRebel, your Email, and the offer in the same window!",
        "Use your real information.",
        "Companies tend to check if you have given information that matches with your IP Address.",
        "Complete the surveys.",
        "Follow the description on the \"Available Offers\" page to see what your tasks are.",
        "For some of the surveys, you will have to put in your Email.",
        "In this situation, put in a newly created email.",
        "After you finish an offer according to the description, you will either get your points instantly or within a day or two.",
        "Usually you will have to wait longer for more complex offers, such as insurance offers, or for high paying offers.",
        "When you get enough points, you can go to \"Available Prizes\" to get Gamecodes for games, cards, or other things.",
        "You can also go to \"Custom Prize\" and request a different prize.",
        "Please remember that each point it worth one dollar.",
        "For gamecodes, it will be emailed to you."
    ]
}