{
    "title": "How to Get Permanent Marker Off of Wood",
    "url": "https://www.wikihow.com/Get-Permanent-Marker-Off-of-Wood",
    "category_hierarchy": [
        "Education and Communications",
        "Stationery",
        "Ink"
    ],
    "methods": [
        {
            "name": "Opting for Natural Solutions",
            "steps": [
                {
                    "headline": "Squeeze a dime-sized amount of toothpaste for a convenient solution.",
                    "description": "Get the marker stain slightly wet with a damp rag, then coat the ink with toothpaste — a dime-sized amount is usually enough. Rub the toothpaste into the stain with your fingers, and let it sit for about 5 minutes. Then, scrub the stain with a damp rag in the direction of the grain of the wood. Check your toothpaste tube for bleach, peroxide, or abrasives. It if contains any of these chemicals it could damage your wood. Opt instead for an untreated, non-gel toothpaste."
                },
                {
                    "headline": "Apply soapy water and coconut oil to remove the mark and buff the surface.",
                    "description": "Dab about 1  tsp (4.9 ml) of coconut oil onto the stain, let it sit for a minute or two, then scrub it away with a soapy, damp rag. Coconut oil naturally smells great and has properties that protect your wood. Don't wash the extra residue (after scrubbing the stain away) if you want to give your wood a fresh scent and take advantage of coconut oil's natural buffing properties."
                },
                {
                    "headline": "Mix white vinegar and dishwashing detergent to use household ingredients.",
                    "description": "Combine 1 US tbsp (15 ml) of vinegar, 1 US tbsp (15 ml) of any dishwashing detergent, and 2 cups (470 ml) of water. Mix it all together and cover the stain with the solution. Let it sit for 30 minutes, then slowly blot the solution away every 5 minutes until the mark is removed. Use whichever dishwashing detergent you have on hand, but make sure it contains no bleach, ammonia, peroxide, or other abrasive chemicals. Natural dishwashing detergents work best for this solution."
                }
            ]
        },
        {
            "name": "Using Household Chemicals",
            "steps": [
                {
                    "headline": "Dab rubbing alcohol on a rag for slippery surfaces.",
                    "description": "Fold a rag or a towel and cover it over the top of a rubbing alcohol bottle. Slowly tip the bottle upside down for just a second or two to soak the end of the rag, then put the cap back on the bottle. Scrub the permanent marker stain with the towel until it's completely removed. This is great for floors as the alcohol evaporates and very quickly lifts the stain. Rubbing alcohol can cause damage to your wood if it soaks into the surface, so only apply it to the rag or towel and wipe away any remaining alcohol with water after the stain is lifted. Hand sanitizer works as an alcohol-based alternative to rubbing alcohol that doesn't leave a mark. Let hand sanitizer sit on the stain for 30 seconds to allow the ink to reactivate, then wipe it away with a dry rag."
                },
                {
                    "headline": "Drip a few drops of acetone-based nail polish remover on stubborn marks.",
                    "description": "Put a couple drops of nail polish remover on the stain, let it sit for just a second, and wipe it away with a paper towel. It should remove the stain practically instantly, as acetone is a very powerful chemical, but be sure to wipe down the surface with water afterwards to prevent damage to your wood. The acetone of nail polish remover has the tendency to remove the finish on wood. Test it on an inconspicuous part, perhaps on the underside, to see if the nail polish remover damages the wood before you use it on the permanent marker stain."
                },
                {
                    "headline": "Try WD-40 for a quick and easy solution.",
                    "description": "WD-40 is good not just for making chairs less squeaky, but also for removing marker stains. Spray WD-40 on the stain to cover it, let it sit for about 10 seconds, then wipe it away with a wet rag or a sponge. WD-40 is available at just about every hardware or auto parts store in various sizes. If you don't have other uses for it, opt for a small, travel-sized bottle to save money."
                },
                {
                    "headline": "Opt for a store-bought permanent marker remover as a last resort.",
                    "description": "There are lots of specialty permanent marker stain removers on the market, and although these methods will usually do the trick, sometimes the stain just doesn't come out. Look for permanent marker remover in the cleaning or school supply section of a grocery store — it usually comes in a small spray bottle."
                }
            ]
        },
        {
            "name": "Erasing or Sanding down the Marks",
            "steps": [
                {
                    "headline": "Use a graphite eraser to get rid of surface marks.",
                    "description": "If the permanent marker stain is relatively fresh, you may be able to simply rub it away with a regular eraser. Look for a graphite eraser at your local art store — opt for the solid version rather than the pliable putty-like version. Rub the stain roughly with the eraser until it lifts. If the stain has set deep into the wood, the eraser won't be able to lift all of the ink. Try another solution on the faded ink if the eraser proves ineffective — rubbing alcohol will easily lift the loosened ink. You can also try a microfiber abrasive sponge, such as a Magic Eraser. If you choose to use this, rub the permanent marker ink gently or you will remove the finish of the wood."
                },
                {
                    "headline": "Draw over the mark with a dry erase marker for a liquid-free option.",
                    "description": "Dry erase markers contain non-polar solvents, which mixes with permanent marker stains to reactivate the ink. Draw with your dry erase marker all over the permanent marker stain to completely cover it, wait for it to dry, then wipe it away with a paper towel. This is great for slippery surfaces as there is no residue left over, unlike chemical or liquid cleaners. If you are worried about creating more marks on your wood, opt for a different solution, as this requires you drawing all over the surface to remove it. Use a dry paper towel or rag to lift the dry erase marker. It won't come off easily if you make it wet."
                },
                {
                    "headline": "Sand down permanent marks on unfinished wood, then restain it.",
                    "description": "It is extremely difficult to remove permanent marker stains from unfinished wood, as many chemicals irreversibly damage the material. Roughly rub the permanent marker stain with sandpaper to lift the first layer of wood, then restain the sanded area once the ink has been removed. If the permanent marker stain is particularly large or deeply set, you may need to break out the power sander and get ready for an afternoon of restaining. Do not sand finished wood, and do not use sharp objects to cut away the stain — if you accidentally cut too deep, you will be left with a permanent, irreversible scar in your wood."
                }
            ]
        }
    ],
    "tyn": [
        "Using Household Chemicals",
        "Rag",
        "Paper towel",
        "Bottle of rubbing alcohol",
        "Nail polish remover",
        "WD-40",
        "Hand sanitizer",
        "Opting for Natural Solutions",
        "Toothpaste without bleach, peroxide, or abrasives",
        "1  tsp (4.9 ml) of coconut oil",
        "1 US tbsp (15 ml) of vinegar",
        "1 US tbsp (15 ml) of dishwashing detergent",
        "2 cups (470 ml) of water",
        "Rubbing, Sanding, and Erasing Marks",
        "Solid art eraser",
        "Magic Eraser (optional)",
        "Dry erase marker",
        "Sandpaper or power sander"
    ],
    "text": " Opting for Natural Solutions Squeeze a dime-sized amount of toothpaste for a convenient solution. Get the marker stain slightly wet with a damp rag, then coat the ink with toothpaste — a dime-sized amount is usually enough. Rub the toothpaste into the stain with your fingers, and let it sit for about 5 minutes. Then, scrub the stain with a damp rag in the direction of the grain of the wood. Check your toothpaste tube for bleach, peroxide, or abrasives. It if contains any of these chemicals it could damage your wood. Opt instead for an untreated, non-gel toothpaste. Apply soapy water and coconut oil to remove the mark and buff the surface. Dab about 1  tsp (4.9 ml) of coconut oil onto the stain, let it sit for a minute or two, then scrub it away with a soapy, damp rag. Coconut oil naturally smells great and has properties that protect your wood. Don't wash the extra residue (after scrubbing the stain away) if you want to give your wood a fresh scent and take advantage of coconut oil's natural buffing properties. Mix white vinegar and dishwashing detergent to use household ingredients. Combine 1 US tbsp (15 ml) of vinegar, 1 US tbsp (15 ml) of any dishwashing detergent, and 2 cups (470 ml) of water. Mix it all together and cover the stain with the solution. Let it sit for 30 minutes, then slowly blot the solution away every 5 minutes until the mark is removed. Use whichever dishwashing detergent you have on hand, but make sure it contains no bleach, ammonia, peroxide, or other abrasive chemicals. Natural dishwashing detergents work best for this solution. Using Household Chemicals Dab rubbing alcohol on a rag for slippery surfaces. Fold a rag or a towel and cover it over the top of a rubbing alcohol bottle. Slowly tip the bottle upside down for just a second or two to soak the end of the rag, then put the cap back on the bottle. Scrub the permanent marker stain with the towel until it's completely removed. This is great for floors as the alcohol evaporates and very quickly lifts the stain. Rubbing alcohol can cause damage to your wood if it soaks into the surface, so only apply it to the rag or towel and wipe away any remaining alcohol with water after the stain is lifted. Hand sanitizer works as an alcohol-based alternative to rubbing alcohol that doesn't leave a mark. Let hand sanitizer sit on the stain for 30 seconds to allow the ink to reactivate, then wipe it away with a dry rag. Drip a few drops of acetone-based nail polish remover on stubborn marks. Put a couple drops of nail polish remover on the stain, let it sit for just a second, and wipe it away with a paper towel. It should remove the stain practically instantly, as acetone is a very powerful chemical, but be sure to wipe down the surface with water afterwards to prevent damage to your wood. The acetone of nail polish remover has the tendency to remove the finish on wood. Test it on an inconspicuous part, perhaps on the underside, to see if the nail polish remover damages the wood before you use it on the permanent marker stain. Try WD-40 for a quick and easy solution. WD-40 is good not just for making chairs less squeaky, but also for removing marker stains. Spray WD-40 on the stain to cover it, let it sit for about 10 seconds, then wipe it away with a wet rag or a sponge. WD-40 is available at just about every hardware or auto parts store in various sizes. If you don't have other uses for it, opt for a small, travel-sized bottle to save money. Opt for a store-bought permanent marker remover as a last resort. There are lots of specialty permanent marker stain removers on the market, and although these methods will usually do the trick, sometimes the stain just doesn't come out. Look for permanent marker remover in the cleaning or school supply section of a grocery store — it usually comes in a small spray bottle. Erasing or Sanding down the Marks Use a graphite eraser to get rid of surface marks. If the permanent marker stain is relatively fresh, you may be able to simply rub it away with a regular eraser. Look for a graphite eraser at your local art store — opt for the solid version rather than the pliable putty-like version. Rub the stain roughly with the eraser until it lifts. If the stain has set deep into the wood, the eraser won't be able to lift all of the ink. Try another solution on the faded ink if the eraser proves ineffective — rubbing alcohol will easily lift the loosened ink. You can also try a microfiber abrasive sponge, such as a Magic Eraser. If you choose to use this, rub the permanent marker ink gently or you will remove the finish of the wood. Draw over the mark with a dry erase marker for a liquid-free option. Dry erase markers contain non-polar solvents, which mixes with permanent marker stains to reactivate the ink. Draw with your dry erase marker all over the permanent marker stain to completely cover it, wait for it to dry, then wipe it away with a paper towel. This is great for slippery surfaces as there is no residue left over, unlike chemical or liquid cleaners. If you are worried about creating more marks on your wood, opt for a different solution, as this requires you drawing all over the surface to remove it. Use a dry paper towel or rag to lift the dry erase marker. It won't come off easily if you make it wet. Sand down permanent marks on unfinished wood, then restain it. It is extremely difficult to remove permanent marker stains from unfinished wood, as many chemicals irreversibly damage the material. Roughly rub the permanent marker stain with sandpaper to lift the first layer of wood, then restain the sanded area once the ink has been removed. If the permanent marker stain is particularly large or deeply set, you may need to break out the power sander and get ready for an afternoon of restaining. Do not sand finished wood, and do not use sharp objects to cut away the stain — if you accidentally cut too deep, you will be left with a permanent, irreversible scar in your wood.",
    "sentences": [
        " Opting for Natural Solutions Squeeze a dime-sized amount of toothpaste for a convenient solution.",
        "Get the marker stain slightly wet with a damp rag, then coat the ink with toothpaste — a dime-sized amount is usually enough.",
        "Rub the toothpaste into the stain with your fingers, and let it sit for about 5 minutes.",
        "Then, scrub the stain with a damp rag in the direction of the grain of the wood.",
        "Check your toothpaste tube for bleach, peroxide, or abrasives.",
        "It if contains any of these chemicals it could damage your wood.",
        "Opt instead for an untreated, non-gel toothpaste.",
        "Apply soapy water and coconut oil to remove the mark and buff the surface.",
        "Dab about 1  tsp (4.9 ml) of coconut oil onto the stain, let it sit for a minute or two, then scrub it away with a soapy, damp rag.",
        "Coconut oil naturally smells great and has properties that protect your wood.",
        "Don't wash the extra residue (after scrubbing the stain away) if you want to give your wood a fresh scent and take advantage of coconut oil's natural buffing properties.",
        "Mix white vinegar and dishwashing detergent to use household ingredients.",
        "Combine 1 US tbsp (15 ml) of vinegar, 1 US tbsp (15 ml) of any dishwashing detergent, and 2 cups (470 ml) of water.",
        "Mix it all together and cover the stain with the solution.",
        "Let it sit for 30 minutes, then slowly blot the solution away every 5 minutes until the mark is removed.",
        "Use whichever dishwashing detergent you have on hand, but make sure it contains no bleach, ammonia, peroxide, or other abrasive chemicals.",
        "Natural dishwashing detergents work best for this solution.",
        "Using Household Chemicals Dab rubbing alcohol on a rag for slippery surfaces.",
        "Fold a rag or a towel and cover it over the top of a rubbing alcohol bottle.",
        "Slowly tip the bottle upside down for just a second or two to soak the end of the rag, then put the cap back on the bottle.",
        "Scrub the permanent marker stain with the towel until it's completely removed.",
        "This is great for floors as the alcohol evaporates and very quickly lifts the stain.",
        "Rubbing alcohol can cause damage to your wood if it soaks into the surface, so only apply it to the rag or towel and wipe away any remaining alcohol with water after the stain is lifted.",
        "Hand sanitizer works as an alcohol-based alternative to rubbing alcohol that doesn't leave a mark.",
        "Let hand sanitizer sit on the stain for 30 seconds to allow the ink to reactivate, then wipe it away with a dry rag.",
        "Drip a few drops of acetone-based nail polish remover on stubborn marks.",
        "Put a couple drops of nail polish remover on the stain, let it sit for just a second, and wipe it away with a paper towel.",
        "It should remove the stain practically instantly, as acetone is a very powerful chemical, but be sure to wipe down the surface with water afterwards to prevent damage to your wood.",
        "The acetone of nail polish remover has the tendency to remove the finish on wood.",
        "Test it on an inconspicuous part, perhaps on the underside, to see if the nail polish remover damages the wood before you use it on the permanent marker stain.",
        "Try WD-40 for a quick and easy solution.",
        "WD-40 is good not just for making chairs less squeaky, but also for removing marker stains.",
        "Spray WD-40 on the stain to cover it, let it sit for about 10 seconds, then wipe it away with a wet rag or a sponge.",
        "WD-40 is available at just about every hardware or auto parts store in various sizes.",
        "If you don't have other uses for it, opt for a small, travel-sized bottle to save money.",
        "Opt for a store-bought permanent marker remover as a last resort.",
        "There are lots of specialty permanent marker stain removers on the market, and although these methods will usually do the trick, sometimes the stain just doesn't come out.",
        "Look for permanent marker remover in the cleaning or school supply section of a grocery store — it usually comes in a small spray bottle.",
        "Erasing or Sanding down the Marks Use a graphite eraser to get rid of surface marks.",
        "If the permanent marker stain is relatively fresh, you may be able to simply rub it away with a regular eraser.",
        "Look for a graphite eraser at your local art store — opt for the solid version rather than the pliable putty-like version.",
        "Rub the stain roughly with the eraser until it lifts.",
        "If the stain has set deep into the wood, the eraser won't be able to lift all of the ink.",
        "Try another solution on the faded ink if the eraser proves ineffective — rubbing alcohol will easily lift the loosened ink.",
        "You can also try a microfiber abrasive sponge, such as a Magic Eraser.",
        "If you choose to use this, rub the permanent marker ink gently or you will remove the finish of the wood.",
        "Draw over the mark with a dry erase marker for a liquid-free option.",
        "Dry erase markers contain non-polar solvents, which mixes with permanent marker stains to reactivate the ink.",
        "Draw with your dry erase marker all over the permanent marker stain to completely cover it, wait for it to dry, then wipe it away with a paper towel.",
        "This is great for slippery surfaces as there is no residue left over, unlike chemical or liquid cleaners.",
        "If you are worried about creating more marks on your wood, opt for a different solution, as this requires you drawing all over the surface to remove it.",
        "Use a dry paper towel or rag to lift the dry erase marker.",
        "It won't come off easily if you make it wet.",
        "Sand down permanent marks on unfinished wood, then restain it.",
        "It is extremely difficult to remove permanent marker stains from unfinished wood, as many chemicals irreversibly damage the material.",
        "Roughly rub the permanent marker stain with sandpaper to lift the first layer of wood, then restain the sanded area once the ink has been removed.",
        "If the permanent marker stain is particularly large or deeply set, you may need to break out the power sander and get ready for an afternoon of restaining.",
        "Do not sand finished wood, and do not use sharp objects to cut away the stain — if you accidentally cut too deep, you will be left with a permanent, irreversible scar in your wood."
    ]
}