{
    "title": "How to Make a My Little Pony Cap",
    "url": "https://www.wikihow.com/Make-a-My-Little-Pony-Cap",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Toys",
        "Toy Figurines and Accessories",
        "Model Horses"
    ],
    "steps": [
        {
            "headline": "Pick which pony you want to base the design on.",
            "description": "You can go with your favorite pony, or another one to do a test-run."
        },
        {
            "headline": "Go to an arts and crafts store.",
            "description": "Find a plain white baseball cap, a set of clothing paint (colors depending on the color scheme of the pony you have decided on), and a small paint brush."
        },
        {
            "headline": "Locate a clear workplace.",
            "description": "Place several paper towels out around with more paper towels under them."
        },
        {
            "headline": "Place the cap in the middle.",
            "description": ""
        },
        {
            "headline": "Take a sharp pencil.",
            "description": "Lightly sketch the cutie mark of the pony you've chosen in the center of the cap."
        },
        {
            "headline": "Take out the clothing paint.",
            "description": "Using the colors of the cutie mark, outline it and fill it in with the paint brush."
        },
        {
            "headline": "Let it dry (requires about 48 hours).",
            "description": ""
        },
        {
            "headline": "Bring out the clothing paint again.",
            "description": "Using the color of the pony's secondary color (their mane), outline and fill in the bill of the cap with the paint brush. Let it dry for the same amount of time."
        },
        {
            "headline": "Take out the clothing paint for the last time.",
            "description": "With the color of the pony's primary color (their coat), carefully paint around the cutie mark and fill out the rest of the cap."
        },
        {
            "headline": "Let it dry once more.",
            "description": "Once it is done, try it on."
        }
    ],
    "tyn": [
        "Money",
        "Paper towels",
        "White baseball cap",
        "Paint brush",
        "Clothing paint"
    ],
    "text": " Pick which pony you want to base the design on. You can go with your favorite pony, or another one to do a test-run. Go to an arts and crafts store. Find a plain white baseball cap, a set of clothing paint (colors depending on the color scheme of the pony you have decided on), and a small paint brush. Locate a clear workplace. Place several paper towels out around with more paper towels under them. Place the cap in the middle.  Take a sharp pencil. Lightly sketch the cutie mark of the pony you've chosen in the center of the cap. Take out the clothing paint. Using the colors of the cutie mark, outline it and fill it in with the paint brush. Let it dry (requires about 48 hours).  Bring out the clothing paint again. Using the color of the pony's secondary color (their mane), outline and fill in the bill of the cap with the paint brush. Let it dry for the same amount of time. Take out the clothing paint for the last time. With the color of the pony's primary color (their coat), carefully paint around the cutie mark and fill out the rest of the cap. Let it dry once more. Once it is done, try it on.",
    "sentences": [
        " Pick which pony you want to base the design on.",
        "You can go with your favorite pony, or another one to do a test-run.",
        "Go to an arts and crafts store.",
        "Find a plain white baseball cap, a set of clothing paint (colors depending on the color scheme of the pony you have decided on), and a small paint brush.",
        "Locate a clear workplace.",
        "Place several paper towels out around with more paper towels under them.",
        "Place the cap in the middle.",
        "Take a sharp pencil.",
        "Lightly sketch the cutie mark of the pony you've chosen in the center of the cap.",
        "Take out the clothing paint.",
        "Using the colors of the cutie mark, outline it and fill it in with the paint brush.",
        "Let it dry (requires about 48 hours).",
        "Bring out the clothing paint again.",
        "Using the color of the pony's secondary color (their mane), outline and fill in the bill of the cap with the paint brush.",
        "Let it dry for the same amount of time.",
        "Take out the clothing paint for the last time.",
        "With the color of the pony's primary color (their coat), carefully paint around the cutie mark and fill out the rest of the cap.",
        "Let it dry once more.",
        "Once it is done, try it on."
    ]
}