{
    "title": "How to Roast Broccoli",
    "url": "https://www.wikihow.com/Roast-Broccoli",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables",
        "Cruciferous Vegetables"
    ],
    "methods": [
        {
            "name": "Oven-Roasting Broccoli",
            "steps": [
                {
                    "headline": "Cut your broccoli into bite-sized florets.",
                    "description": "Use a sharp paring knife or something similar to cut the 'branches' of broccoli away from the stem. Continue cutting the florets of broccoli until they are small, bite-sized pieces. Hold your knife at a 45-degree angle to the stem and cut in a circle around the top of the broccoli. It may take some practice, but this an easy way to quickly cut the florets away from the main stem."
                },
                {
                    "headline": "Wash the broccoli in cold water and a splash of vinegar.",
                    "description": "Fill a bowl with cold water and submerge your broccoli florets in it. Swish them around to remove any dirt, before adding roughly 2 tablespoons (30 ml) of vinegar. Leave the broccoli to sit for 5 minutes, pour out the water out and rinse the broccoli in clean water once again. The vinegar will kill help kill any bugs hiding in the broccoli but may affect the taste. Rinsing the broccoli in cold water afterward will make sure it is clean and without any vinegar flavor."
                },
                {
                    "headline": "Preheat your oven to 450 °F (232 °C) and prepare a baking tray.",
                    "description": "Turn your oven onto a bake setting at around 450 °F (232 °C) to begin preheating. Line a baking tray with greaseproof paper and set it aside. If you don't have baking paper, the oil used to roast the broccoli will work instead but will make the baking tray more difficult to clean."
                },
                {
                    "headline": "Toss the broccoli in olive oil, salt, and pepper.",
                    "description": "Transfer the broccoli to a clean, dry bowl and drizzle it with 5 tablespoons (74 ml) of olive oil. Sprinkle over salt and pepper to taste, before tossing the bowl to combine everything. Continue shaking the bowl until the seasoning is evenly distributed and all of the broccoli is coated in oil. You can also do this on the baking tray, but it may be more difficult to evenly coat the broccoli in oil and seasoning. Around ½ teaspoon (2g) each of salt and pepper is a good starting point for seasoning. Add more or less to taste. You could also add other seasonings for more complex flavors. Try sprinkling over 1 teaspoon (5g) of garlic powder, onion powder, or paprika."
                },
                {
                    "headline": "Transfer the broccoli to the tray and cook for 25 to 35 minutes.",
                    "description": "Spread the seasoned broccoli in a single layer over the baking tray and place it in the oven. Leave it to cook for 25 to 35 minutes, shaking every 5 minutes or so to move the broccoli around. After around 20 minutes, the broccoli will be cooked. The longer you leave it in the oven for, the crispier your roasted broccoli will be."
                },
                {
                    "headline": "Serve the broccoli immediately.",
                    "description": "Once the broccoli has browned and caramelized around the edges, take it out and serve immediately. Season it with extra salt and pepper if needed while it's still hot."
                }
            ]
        },
        {
            "name": "Pan-Roasting Broccoli",
            "steps": [
                {
                    "headline": "Cut and wash your broccoli in cold water.",
                    "description": "Use a sharp paring knife to cut away bite-sized florets of broccoli from the main stem. Rinse them in a bowl of cold water with 2 tablespoons (30 ml) of vinegar to kill any bugs, before rinsing again in clean water. Transfer to a clean bowl or colander to get rid of any excess water. Rinse the broccoli, swapping out dirty water with clean water until the water remains clear. This way, you'll know when your broccoli is completely clean."
                },
                {
                    "headline": "Heat 4 to 5 tablespoons (59 to 74 ml) of olive oil in a large skillet.",
                    "description": "Put a large skillet over a medium-high heat and leave it to begin warming up. Pour in 4 to 5 tablespoons (59 to 74 ml) of olive oil and swirl it around to evenly coat the bottom of the pan. Let the oil heat up until it begins shimmering. You could use different oils in place of olive oil for new flavors. Try using sesame oil for an Asian twist, or coconut oil for a little nutty sweetness."
                },
                {
                    "headline": "Roast the broccoli in the oil for 3 to 4 minutes.",
                    "description": "Once the oil is heated, pour in your clean, dry broccoli. Using a pair of tongs, or just by moving the skillet, toss the broccoli around so that it is evenly coated in oil. Move the broccoli around every 30 seconds or so, allowing the edges of the broccoli to brown. For the best results, spread your broccoli out in a single layer in the skillet. If your skillet isn't big enough, keep the broccoli moving so that it cooks evenly."
                },
                {
                    "headline": "Pour ⁄3 cup (160 ml) of water into the pan and cover immediately.",
                    "description": "Measure out roughly ⁄3 cup (160 ml) of water in a measuring jug or cup. Holding the lid of the skillet in front of the pan, quickly pour the water over the broccoli and cover with the lid. This water will turn to steam, which will finish cooking the broccoli. Rather than seasoning the broccoli, mix ½ teaspoon (2g) each of salt and pepper into the water before adding it to the pan."
                },
                {
                    "headline": "Leave the broccoli to steam for 2 to 3 minutes before serving it.",
                    "description": "Hold the lid over the broccoli to allow it steam, shaking the skillet occasionally to keep the broccoli moving and cooking evenly. After 2 or 3 minutes, remove the broccoli from the heat, strain it to remove any excess water, and serve while it's still hot. Season the broccoli with extra salt and pepper to taste once it's cooked."
                }
            ]
        },
        {
            "name": "Roasting Broccoli in an Air-Fryer",
            "steps": [
                {
                    "headline": "Preheat your air-fryer to 350 °F (177 °C).",
                    "description": "Plug in and turn on your air-fryer. Set the temperature to 350 °F (177 °C) and leave it for 4 to 5 minutes to begin heating up. Consult the manufacturer's instructions for your air-fryer if you're unsure how to turn it on or set it to a specific temperature."
                },
                {
                    "headline": "Wash and cut your broccoli.",
                    "description": "Slice bite-sized florets away from the main broccoli stem and transfer them to a bowl of cold water with 2 tablespoons (30 ml) of vinegar. Swish the broccoli around in the water, pouring it out and adding new, clean water whenever it becomes dirty. Strain the broccoli through a colander to get rid of the water once its clean. Adding vinegar to the first bowl of water will kill any bugs or worms hiding in the broccoli."
                },
                {
                    "headline": "Toss the broccoli in olive oil, salt, and pepper.",
                    "description": "Put the broccoli in a clean, dry bowl and drizzle it with the olive oil. Sprinkle over 1/2 teaspoon each of salt and pepper, and toss the broccoli in the bowl until each floret is covered in olive oil and evenly seasoned. For extra flavor, add 1 teaspoon (5g) each of garlic powder and onion powder."
                },
                {
                    "headline": "Cook the broccoli in the fryer for 12 minutes.",
                    "description": "Pour the seasoned broccoli into the basket of the air-fryer and leave it to cook. After 10 to 12 minutes, the broccoli will be bright green and crispy all over. Take it out of the air-fryer and transfer it to a plate to serve immediately. For extra flavor, top the broccoli with grated parmesan cheese as soon as it comes out of the fryer. Cooking times will vary between different air-fryers. Check the broccoli after around 10 minutes in your air-fryer to see how much longer it needs to cook."
                }
            ]
        }
    ],
    "tyn": [
        "Oven-Roasting Broccoli",
        "Knife",
        "Bowl",
        "Oven",
        "Baking tray",
        "Baking or greaseproof paper",
        "Pan-Roasting Broccoli",
        "Skillet with lid",
        "Measuring jug or cup",
        "Tongs",
        "Roasting Broccoli in an Air-Fryer",
        "Air-fryer"
    ],
    "text": " Oven-Roasting Broccoli Cut your broccoli into bite-sized florets. Use a sharp paring knife or something similar to cut the 'branches' of broccoli away from the stem. Continue cutting the florets of broccoli until they are small, bite-sized pieces. Hold your knife at a 45-degree angle to the stem and cut in a circle around the top of the broccoli. It may take some practice, but this an easy way to quickly cut the florets away from the main stem. Wash the broccoli in cold water and a splash of vinegar. Fill a bowl with cold water and submerge your broccoli florets in it. Swish them around to remove any dirt, before adding roughly 2 tablespoons (30 ml) of vinegar. Leave the broccoli to sit for 5 minutes, pour out the water out and rinse the broccoli in clean water once again. The vinegar will kill help kill any bugs hiding in the broccoli but may affect the taste. Rinsing the broccoli in cold water afterward will make sure it is clean and without any vinegar flavor. Preheat your oven to 450 °F (232 °C) and prepare a baking tray. Turn your oven onto a bake setting at around 450 °F (232 °C) to begin preheating. Line a baking tray with greaseproof paper and set it aside. If you don't have baking paper, the oil used to roast the broccoli will work instead but will make the baking tray more difficult to clean. Toss the broccoli in olive oil, salt, and pepper. Transfer the broccoli to a clean, dry bowl and drizzle it with 5 tablespoons (74 ml) of olive oil. Sprinkle over salt and pepper to taste, before tossing the bowl to combine everything. Continue shaking the bowl until the seasoning is evenly distributed and all of the broccoli is coated in oil. You can also do this on the baking tray, but it may be more difficult to evenly coat the broccoli in oil and seasoning. Around ½ teaspoon (2g) each of salt and pepper is a good starting point for seasoning. Add more or less to taste. You could also add other seasonings for more complex flavors. Try sprinkling over 1 teaspoon (5g) of garlic powder, onion powder, or paprika. Transfer the broccoli to the tray and cook for 25 to 35 minutes. Spread the seasoned broccoli in a single layer over the baking tray and place it in the oven. Leave it to cook for 25 to 35 minutes, shaking every 5 minutes or so to move the broccoli around. After around 20 minutes, the broccoli will be cooked. The longer you leave it in the oven for, the crispier your roasted broccoli will be. Serve the broccoli immediately. Once the broccoli has browned and caramelized around the edges, take it out and serve immediately. Season it with extra salt and pepper if needed while it's still hot. Pan-Roasting Broccoli Cut and wash your broccoli in cold water. Use a sharp paring knife to cut away bite-sized florets of broccoli from the main stem. Rinse them in a bowl of cold water with 2 tablespoons (30 ml) of vinegar to kill any bugs, before rinsing again in clean water. Transfer to a clean bowl or colander to get rid of any excess water. Rinse the broccoli, swapping out dirty water with clean water until the water remains clear. This way, you'll know when your broccoli is completely clean. Heat 4 to 5 tablespoons (59 to 74 ml) of olive oil in a large skillet. Put a large skillet over a medium-high heat and leave it to begin warming up. Pour in 4 to 5 tablespoons (59 to 74 ml) of olive oil and swirl it around to evenly coat the bottom of the pan. Let the oil heat up until it begins shimmering. You could use different oils in place of olive oil for new flavors. Try using sesame oil for an Asian twist, or coconut oil for a little nutty sweetness. Roast the broccoli in the oil for 3 to 4 minutes. Once the oil is heated, pour in your clean, dry broccoli. Using a pair of tongs, or just by moving the skillet, toss the broccoli around so that it is evenly coated in oil. Move the broccoli around every 30 seconds or so, allowing the edges of the broccoli to brown. For the best results, spread your broccoli out in a single layer in the skillet. If your skillet isn't big enough, keep the broccoli moving so that it cooks evenly. Pour ⁄3 cup (160 ml) of water into the pan and cover immediately. Measure out roughly ⁄3 cup (160 ml) of water in a measuring jug or cup. Holding the lid of the skillet in front of the pan, quickly pour the water over the broccoli and cover with the lid. This water will turn to steam, which will finish cooking the broccoli. Rather than seasoning the broccoli, mix ½ teaspoon (2g) each of salt and pepper into the water before adding it to the pan. Leave the broccoli to steam for 2 to 3 minutes before serving it. Hold the lid over the broccoli to allow it steam, shaking the skillet occasionally to keep the broccoli moving and cooking evenly. After 2 or 3 minutes, remove the broccoli from the heat, strain it to remove any excess water, and serve while it's still hot. Season the broccoli with extra salt and pepper to taste once it's cooked. Roasting Broccoli in an Air-Fryer Preheat your air-fryer to 350 °F (177 °C). Plug in and turn on your air-fryer. Set the temperature to 350 °F (177 °C) and leave it for 4 to 5 minutes to begin heating up. Consult the manufacturer's instructions for your air-fryer if you're unsure how to turn it on or set it to a specific temperature. Wash and cut your broccoli. Slice bite-sized florets away from the main broccoli stem and transfer them to a bowl of cold water with 2 tablespoons (30 ml) of vinegar. Swish the broccoli around in the water, pouring it out and adding new, clean water whenever it becomes dirty. Strain the broccoli through a colander to get rid of the water once its clean. Adding vinegar to the first bowl of water will kill any bugs or worms hiding in the broccoli. Toss the broccoli in olive oil, salt, and pepper. Put the broccoli in a clean, dry bowl and drizzle it with the olive oil. Sprinkle over 1/2 teaspoon each of salt and pepper, and toss the broccoli in the bowl until each floret is covered in olive oil and evenly seasoned. For extra flavor, add 1 teaspoon (5g) each of garlic powder and onion powder. Cook the broccoli in the fryer for 12 minutes. Pour the seasoned broccoli into the basket of the air-fryer and leave it to cook. After 10 to 12 minutes, the broccoli will be bright green and crispy all over. Take it out of the air-fryer and transfer it to a plate to serve immediately. For extra flavor, top the broccoli with grated parmesan cheese as soon as it comes out of the fryer. Cooking times will vary between different air-fryers. Check the broccoli after around 10 minutes in your air-fryer to see how much longer it needs to cook.",
    "sentences": [
        " Oven-Roasting Broccoli Cut your broccoli into bite-sized florets.",
        "Use a sharp paring knife or something similar to cut the 'branches' of broccoli away from the stem.",
        "Continue cutting the florets of broccoli until they are small, bite-sized pieces.",
        "Hold your knife at a 45-degree angle to the stem and cut in a circle around the top of the broccoli.",
        "It may take some practice, but this an easy way to quickly cut the florets away from the main stem.",
        "Wash the broccoli in cold water and a splash of vinegar.",
        "Fill a bowl with cold water and submerge your broccoli florets in it.",
        "Swish them around to remove any dirt, before adding roughly 2 tablespoons (30 ml) of vinegar.",
        "Leave the broccoli to sit for 5 minutes, pour out the water out and rinse the broccoli in clean water once again.",
        "The vinegar will kill help kill any bugs hiding in the broccoli but may affect the taste.",
        "Rinsing the broccoli in cold water afterward will make sure it is clean and without any vinegar flavor.",
        "Preheat your oven to 450 °F (232 °C) and prepare a baking tray.",
        "Turn your oven onto a bake setting at around 450 °F (232 °C) to begin preheating.",
        "Line a baking tray with greaseproof paper and set it aside.",
        "If you don't have baking paper, the oil used to roast the broccoli will work instead but will make the baking tray more difficult to clean.",
        "Toss the broccoli in olive oil, salt, and pepper.",
        "Transfer the broccoli to a clean, dry bowl and drizzle it with 5 tablespoons (74 ml) of olive oil.",
        "Sprinkle over salt and pepper to taste, before tossing the bowl to combine everything.",
        "Continue shaking the bowl until the seasoning is evenly distributed and all of the broccoli is coated in oil.",
        "You can also do this on the baking tray, but it may be more difficult to evenly coat the broccoli in oil and seasoning.",
        "Around ½ teaspoon (2g) each of salt and pepper is a good starting point for seasoning.",
        "Add more or less to taste.",
        "You could also add other seasonings for more complex flavors.",
        "Try sprinkling over 1 teaspoon (5g) of garlic powder, onion powder, or paprika.",
        "Transfer the broccoli to the tray and cook for 25 to 35 minutes.",
        "Spread the seasoned broccoli in a single layer over the baking tray and place it in the oven.",
        "Leave it to cook for 25 to 35 minutes, shaking every 5 minutes or so to move the broccoli around.",
        "After around 20 minutes, the broccoli will be cooked.",
        "The longer you leave it in the oven for, the crispier your roasted broccoli will be.",
        "Serve the broccoli immediately.",
        "Once the broccoli has browned and caramelized around the edges, take it out and serve immediately.",
        "Season it with extra salt and pepper if needed while it's still hot.",
        "Pan-Roasting Broccoli Cut and wash your broccoli in cold water.",
        "Use a sharp paring knife to cut away bite-sized florets of broccoli from the main stem.",
        "Rinse them in a bowl of cold water with 2 tablespoons (30 ml) of vinegar to kill any bugs, before rinsing again in clean water.",
        "Transfer to a clean bowl or colander to get rid of any excess water.",
        "Rinse the broccoli, swapping out dirty water with clean water until the water remains clear.",
        "This way, you'll know when your broccoli is completely clean.",
        "Heat 4 to 5 tablespoons (59 to 74 ml) of olive oil in a large skillet.",
        "Put a large skillet over a medium-high heat and leave it to begin warming up.",
        "Pour in 4 to 5 tablespoons (59 to 74 ml) of olive oil and swirl it around to evenly coat the bottom of the pan.",
        "Let the oil heat up until it begins shimmering.",
        "You could use different oils in place of olive oil for new flavors.",
        "Try using sesame oil for an Asian twist, or coconut oil for a little nutty sweetness.",
        "Roast the broccoli in the oil for 3 to 4 minutes.",
        "Once the oil is heated, pour in your clean, dry broccoli.",
        "Using a pair of tongs, or just by moving the skillet, toss the broccoli around so that it is evenly coated in oil.",
        "Move the broccoli around every 30 seconds or so, allowing the edges of the broccoli to brown.",
        "For the best results, spread your broccoli out in a single layer in the skillet.",
        "If your skillet isn't big enough, keep the broccoli moving so that it cooks evenly.",
        "Pour ⁄3 cup (160 ml) of water into the pan and cover immediately.",
        "Measure out roughly ⁄3 cup (160 ml) of water in a measuring jug or cup.",
        "Holding the lid of the skillet in front of the pan, quickly pour the water over the broccoli and cover with the lid.",
        "This water will turn to steam, which will finish cooking the broccoli.",
        "Rather than seasoning the broccoli, mix ½ teaspoon (2g) each of salt and pepper into the water before adding it to the pan.",
        "Leave the broccoli to steam for 2 to 3 minutes before serving it.",
        "Hold the lid over the broccoli to allow it steam, shaking the skillet occasionally to keep the broccoli moving and cooking evenly.",
        "After 2 or 3 minutes, remove the broccoli from the heat, strain it to remove any excess water, and serve while it's still hot.",
        "Season the broccoli with extra salt and pepper to taste once it's cooked.",
        "Roasting Broccoli in an Air-Fryer Preheat your air-fryer to 350 °F (177 °C).",
        "Plug in and turn on your air-fryer.",
        "Set the temperature to 350 °F (177 °C) and leave it for 4 to 5 minutes to begin heating up.",
        "Consult the manufacturer's instructions for your air-fryer if you're unsure how to turn it on or set it to a specific temperature.",
        "Wash and cut your broccoli.",
        "Slice bite-sized florets away from the main broccoli stem and transfer them to a bowl of cold water with 2 tablespoons (30 ml) of vinegar.",
        "Swish the broccoli around in the water, pouring it out and adding new, clean water whenever it becomes dirty.",
        "Strain the broccoli through a colander to get rid of the water once its clean.",
        "Adding vinegar to the first bowl of water will kill any bugs or worms hiding in the broccoli.",
        "Toss the broccoli in olive oil, salt, and pepper.",
        "Put the broccoli in a clean, dry bowl and drizzle it with the olive oil.",
        "Sprinkle over 1/2 teaspoon each of salt and pepper, and toss the broccoli in the bowl until each floret is covered in olive oil and evenly seasoned.",
        "For extra flavor, add 1 teaspoon (5g) each of garlic powder and onion powder.",
        "Cook the broccoli in the fryer for 12 minutes.",
        "Pour the seasoned broccoli into the basket of the air-fryer and leave it to cook.",
        "After 10 to 12 minutes, the broccoli will be bright green and crispy all over.",
        "Take it out of the air-fryer and transfer it to a plate to serve immediately.",
        "For extra flavor, top the broccoli with grated parmesan cheese as soon as it comes out of the fryer.",
        "Cooking times will vary between different air-fryers.",
        "Check the broccoli after around 10 minutes in your air-fryer to see how much longer it needs to cook."
    ]
}