{
    "title": "How to Perform a Spread With Cards",
    "url": "https://www.wikihow.com/Perform-a-Spread-With-Cards",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Card Games"
    ],
    "steps": [
        {
            "headline": "First, make sure that you're using the right deck of cards.",
            "description": "Use a deck that's fairly new. Don't use plastic cards or cheap cards. A spread looks best with a new deck."
        },
        {
            "headline": "Next, find a place to do the spread.",
            "description": "A soft surface like a carpet or card table is the best. Avoid performing the spread on hard surfaces."
        },
        {
            "headline": "Then, you grip the deck.",
            "description": "Hold the deck with the back of the card towards you. On top of the deck, grip it with your middle, ring, and pinky finger. On the bottom, grip the deck with your thumb. On the left narrow edge of the deck, grip it with your index finger. Now you are ready to begin."
        },
        {
            "headline": "Place the deck a little to the left in front of you.",
            "description": "Bevel the deck a little bit. What that means is that you make the deck slant. Apply some pressure, and slowly spread the cards from left to right. Your index finger spread the cards so they don't clump up. Now you have a ribbon spread!"
        },
        {
            "headline": "Finished.",
            "description": ""
        }
    ],
    "tyn": [
        "1 deck of playing cards"
    ],
    "text": " First, make sure that you're using the right deck of cards. Use a deck that's fairly new. Don't use plastic cards or cheap cards. A spread looks best with a new deck. Next, find a place to do the spread. A soft surface like a carpet or card table is the best. Avoid performing the spread on hard surfaces. Then, you grip the deck. Hold the deck with the back of the card towards you. On top of the deck, grip it with your middle, ring, and pinky finger. On the bottom, grip the deck with your thumb. On the left narrow edge of the deck, grip it with your index finger. Now you are ready to begin. Place the deck a little to the left in front of you. Bevel the deck a little bit. What that means is that you make the deck slant. Apply some pressure, and slowly spread the cards from left to right. Your index finger spread the cards so they don't clump up. Now you have a ribbon spread! Finished. ",
    "sentences": [
        " First, make sure that you're using the right deck of cards.",
        "Use a deck that's fairly new.",
        "Don't use plastic cards or cheap cards.",
        "A spread looks best with a new deck.",
        "Next, find a place to do the spread.",
        "A soft surface like a carpet or card table is the best.",
        "Avoid performing the spread on hard surfaces.",
        "Then, you grip the deck.",
        "Hold the deck with the back of the card towards you.",
        "On top of the deck, grip it with your middle, ring, and pinky finger.",
        "On the bottom, grip the deck with your thumb.",
        "On the left narrow edge of the deck, grip it with your index finger.",
        "Now you are ready to begin.",
        "Place the deck a little to the left in front of you.",
        "Bevel the deck a little bit.",
        "What that means is that you make the deck slant.",
        "Apply some pressure, and slowly spread the cards from left to right.",
        "Your index finger spread the cards so they don't clump up.",
        "Now you have a ribbon spread!",
        "Finished."
    ]
}