{
    "title": "How to Flip a Pancake",
    "url": "https://www.wikihow.com/Flip-a-Pancake",
    "category_hierarchy": [
        "Food and Entertaining",
        "Breakfast",
        "Pancakes"
    ],
    "methods": [
        {
            "name": "Using a Spatula",
            "steps": [
                {
                    "headline": "Wait for the edges to brown and the top to bubble.",
                    "description": "When the edges of the pancake begin to crisp up and the top begins to bubble, it’s an indication it’s ready to be flipped. Pay close attention to your pancake to see when this happens. If you keep burning your pancake, lower the heat when you try to cook the next one. If the center of your pancake is raw, then it means you're cooking it on too high of a heat. This makes it so the edges burn before the middle gets a chance to cook. Don’t use too much butter or oil when cooking your pancake or it may spit and burn you."
                },
                {
                    "headline": "Lift an edge of the pancake to see if the underside is golden brown.",
                    "description": "The underside of the pancake should be a golden brown color before you flip it. You can check this by carefully lifting up an edge of the pancake with your spatula or a fork. The bottom should now feel more solid, and less like batter. Make sure to use a nonstick pan, non stick cooking spray, butter, or oil so your pancake doesn’t get stuck to the pan. Don’t lift one of the corners of the pancake too much or else you might break the pancake. You may check it often, but use your best judgement. The more you play around with the pancake, the greater chance it’s going to break. You can shake the pan back and forth to see if it slides around. If it does, it indicates that the bottom side has cooked, and it's ready for flipping. If the center of your pancake is too wet and under cooked, there's a chance that hot oil, batter, or butter could splash onto your skin so be careful."
                },
                {
                    "headline": "Slide the spatula under the pancake so that it’s centered.",
                    "description": "Try to get your spatula in the center of the pancake. Get as much of your spatula as you can covered by the underside of the pancake. Lift it so it clears the rim of your pan and get ready to flip. Don’t hold it in the air for too long or it will break. You should transition to the flip quickly. Don’t lift it higher than 4-6 inches off the bottom of your pan. The higher you lift it, the greater chance it’s going to break."
                },
                {
                    "headline": "Quickly flick your wrist 180 degrees to one side so the pancake flips over.",
                    "description": "Using a quick flicking motion, turn your wrist over while holding the spatula. The longer you wait and the more you hesitate, the more likely the pancake will break. Do it quickly and confidently. If you mess up, scrap the pancake and start over. Make sure to try to the flip the pancake only once. Multiple flipping will make it tough and chewy."
                }
            ]
        },
        {
            "name": "Using the Pan",
            "steps": [
                {
                    "headline": "Use a lighter pan for flipping.",
                    "description": "A heavy cast iron pan may be more difficult to use than a lighter pan for flipping pancakes this way. You’ll be using two hands with this technique, so consider the weight of the pan. A pan that has a higher lip on its sides will be easier to use."
                },
                {
                    "headline": "Shake your pan and wait until the pancake slides around.",
                    "description": "A good indicator that your pancake is ready to be flipped is if it moves around when you shake your pan. When you’re flipping without using a spatula, it’s important that you know your pancake won’t get stuck. Shake very lightly when you check on your pancake. You can use a fork to check the underside if you don’t feel confident."
                },
                {
                    "headline": "Use both hands and lift the pan 3 inches in the air and tilt it slightly forward.",
                    "description": "The pancake should be resting on the rim of your pan, but not sliding out of it. If the pancake doesn’t move and is sticking to the pan, it’s not ready to be flipped. A larger rim is better for flipping pancakes."
                },
                {
                    "headline": "Quickly flick your wrists in an upward motion so your pancake flips.",
                    "description": "Follow through confidently when you flick your wrist upward. The pancake should flip towards your body and end up on the other side. A similar method is used when cooking stir fry. Only cook the pancake one time on each side. The more you flip it over, the tougher the pancake will become."
                }
            ]
        }
    ],
    "tyn": [
        "Griddle or frying pan",
        "Stove",
        "Spatula",
        "Butter, nonstick spray, margarine, or oil"
    ],
    "text": " Using a Spatula Wait for the edges to brown and the top to bubble. When the edges of the pancake begin to crisp up and the top begins to bubble, it’s an indication it’s ready to be flipped. Pay close attention to your pancake to see when this happens. If you keep burning your pancake, lower the heat when you try to cook the next one. If the center of your pancake is raw, then it means you're cooking it on too high of a heat. This makes it so the edges burn before the middle gets a chance to cook. Don’t use too much butter or oil when cooking your pancake or it may spit and burn you. Lift an edge of the pancake to see if the underside is golden brown. The underside of the pancake should be a golden brown color before you flip it. You can check this by carefully lifting up an edge of the pancake with your spatula or a fork. The bottom should now feel more solid, and less like batter. Make sure to use a nonstick pan, non stick cooking spray, butter, or oil so your pancake doesn’t get stuck to the pan. Don’t lift one of the corners of the pancake too much or else you might break the pancake. You may check it often, but use your best judgement. The more you play around with the pancake, the greater chance it’s going to break. You can shake the pan back and forth to see if it slides around. If it does, it indicates that the bottom side has cooked, and it's ready for flipping. If the center of your pancake is too wet and under cooked, there's a chance that hot oil, batter, or butter could splash onto your skin so be careful. Slide the spatula under the pancake so that it’s centered. Try to get your spatula in the center of the pancake. Get as much of your spatula as you can covered by the underside of the pancake. Lift it so it clears the rim of your pan and get ready to flip. Don’t hold it in the air for too long or it will break. You should transition to the flip quickly. Don’t lift it higher than 4-6 inches off the bottom of your pan. The higher you lift it, the greater chance it’s going to break. Quickly flick your wrist 180 degrees to one side so the pancake flips over. Using a quick flicking motion, turn your wrist over while holding the spatula. The longer you wait and the more you hesitate, the more likely the pancake will break. Do it quickly and confidently. If you mess up, scrap the pancake and start over. Make sure to try to the flip the pancake only once. Multiple flipping will make it tough and chewy. Using the Pan Use a lighter pan for flipping. A heavy cast iron pan may be more difficult to use than a lighter pan for flipping pancakes this way. You’ll be using two hands with this technique, so consider the weight of the pan. A pan that has a higher lip on its sides will be easier to use. Shake your pan and wait until the pancake slides around. A good indicator that your pancake is ready to be flipped is if it moves around when you shake your pan. When you’re flipping without using a spatula, it’s important that you know your pancake won’t get stuck. Shake very lightly when you check on your pancake. You can use a fork to check the underside if you don’t feel confident. Use both hands and lift the pan 3 inches in the air and tilt it slightly forward. The pancake should be resting on the rim of your pan, but not sliding out of it. If the pancake doesn’t move and is sticking to the pan, it’s not ready to be flipped. A larger rim is better for flipping pancakes. Quickly flick your wrists in an upward motion so your pancake flips. Follow through confidently when you flick your wrist upward. The pancake should flip towards your body and end up on the other side. A similar method is used when cooking stir fry. Only cook the pancake one time on each side. The more you flip it over, the tougher the pancake will become.",
    "sentences": [
        " Using a Spatula Wait for the edges to brown and the top to bubble.",
        "When the edges of the pancake begin to crisp up and the top begins to bubble, it’s an indication it’s ready to be flipped.",
        "Pay close attention to your pancake to see when this happens.",
        "If you keep burning your pancake, lower the heat when you try to cook the next one.",
        "If the center of your pancake is raw, then it means you're cooking it on too high of a heat.",
        "This makes it so the edges burn before the middle gets a chance to cook.",
        "Don’t use too much butter or oil when cooking your pancake or it may spit and burn you.",
        "Lift an edge of the pancake to see if the underside is golden brown.",
        "The underside of the pancake should be a golden brown color before you flip it.",
        "You can check this by carefully lifting up an edge of the pancake with your spatula or a fork.",
        "The bottom should now feel more solid, and less like batter.",
        "Make sure to use a nonstick pan, non stick cooking spray, butter, or oil so your pancake doesn’t get stuck to the pan.",
        "Don’t lift one of the corners of the pancake too much or else you might break the pancake.",
        "You may check it often, but use your best judgement.",
        "The more you play around with the pancake, the greater chance it’s going to break.",
        "You can shake the pan back and forth to see if it slides around.",
        "If it does, it indicates that the bottom side has cooked, and it's ready for flipping.",
        "If the center of your pancake is too wet and under cooked, there's a chance that hot oil, batter, or butter could splash onto your skin so be careful.",
        "Slide the spatula under the pancake so that it’s centered.",
        "Try to get your spatula in the center of the pancake.",
        "Get as much of your spatula as you can covered by the underside of the pancake.",
        "Lift it so it clears the rim of your pan and get ready to flip.",
        "Don’t hold it in the air for too long or it will break.",
        "You should transition to the flip quickly.",
        "Don’t lift it higher than 4-6 inches off the bottom of your pan.",
        "The higher you lift it, the greater chance it’s going to break.",
        "Quickly flick your wrist 180 degrees to one side so the pancake flips over.",
        "Using a quick flicking motion, turn your wrist over while holding the spatula.",
        "The longer you wait and the more you hesitate, the more likely the pancake will break.",
        "Do it quickly and confidently.",
        "If you mess up, scrap the pancake and start over.",
        "Make sure to try to the flip the pancake only once.",
        "Multiple flipping will make it tough and chewy.",
        "Using the Pan Use a lighter pan for flipping.",
        "A heavy cast iron pan may be more difficult to use than a lighter pan for flipping pancakes this way.",
        "You’ll be using two hands with this technique, so consider the weight of the pan.",
        "A pan that has a higher lip on its sides will be easier to use.",
        "Shake your pan and wait until the pancake slides around.",
        "A good indicator that your pancake is ready to be flipped is if it moves around when you shake your pan.",
        "When you’re flipping without using a spatula, it’s important that you know your pancake won’t get stuck.",
        "Shake very lightly when you check on your pancake.",
        "You can use a fork to check the underside if you don’t feel confident.",
        "Use both hands and lift the pan 3 inches in the air and tilt it slightly forward.",
        "The pancake should be resting on the rim of your pan, but not sliding out of it.",
        "If the pancake doesn’t move and is sticking to the pan, it’s not ready to be flipped.",
        "A larger rim is better for flipping pancakes.",
        "Quickly flick your wrists in an upward motion so your pancake flips.",
        "Follow through confidently when you flick your wrist upward.",
        "The pancake should flip towards your body and end up on the other side.",
        "A similar method is used when cooking stir fry.",
        "Only cook the pancake one time on each side.",
        "The more you flip it over, the tougher the pancake will become."
    ]
}