{
    "title": "How to Organize Colored Pencils",
    "url": "https://www.wikihow.com/Organize-Colored-Pencils",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Drawing"
    ],
    "parts": [
        {
            "name": "Choosing a Storage Container",
            "steps": [
                {
                    "headline": "Use 5 mason jars to easily organize your colored pencils.",
                    "description": "Create a row of 3 mason jars, and place a ⁄2 inch (1.3 cm) piece of mounting tape in between each jar. Then, put another ⁄2 inch (1.3 cm) piece of tape on the outer side of the jars. Stagger another 2 jars in between the first 3 so they are all in a bunch. Then, lift up the jars and place them on their side to easily access the tops. After you sort through your pencils, place them into each of the jars, based on your organizational method. Mason jars are a great option to keep on your craft desk at home. You can do this with 3 jars or 7 jars if you prefer. Using an odd number of jars helps create an attractive display."
                },
                {
                    "headline": "Try a pencil wrap to provide your colored pencils with basic coverage.",
                    "description": "A pencil wrap is a convenient, multi-sectioned pouch you can purchase to store your colored pencils. Place your pencils inside each section, and then roll up your pencil wrap starting at the side without a clasp. Then, secure your pencil wrap with the snap or tie. The size, shape, and design depend on the particular model, but you can usually fit at least 40 colored pencils in 1 pouch. This is a great idea if you want to take your pencils with you while traveling."
                },
                {
                    "headline": "Store your pencils in plastic containers to keep them neat.",
                    "description": "Visit a container store or office supply store to browse plastic storage solutions. You can choose individual units or interlocking storage solutions. Sort through your pencils, then place each color family inside its own plastic container. Using plastic storage options is also a waterproof solution. For instance, use these if you want to color while sunbathing at the beach or laying by the pool. You can use more or less plastic containers, depending on your pencil collection."
                },
                {
                    "headline": "Try using a pencil stand if you color with your pencils frequently.",
                    "description": "Purchase a pencil stand from most craft supply stores. These are pieces of wood or plastic with holes drilled into the top to hold your pencils individually. Place 1 pencil in each hole, and arrange them by color for a neat, presentable option. Place your pencil stand on your desk or bedside table if you tend to color very regularly. This way, you can easily access all of your favorite hues. These typically hold around 25-30 pencils at a time."
                },
                {
                    "headline": "Get a plastic carousel to easily locate any color you need.",
                    "description": "A plastic carousel is a desktop unit with individual sections to house pens, pencils, and supplies. Use one of these to keep your colored pencils organized if you want to easily view all of your options. You can group each color into its own unit, or spread the colors out based on how frequently you use them. This is a nice option because they usually have other smaller sections, so you can keep your sharpener or erasers nearby too. You can hold 30-80 pencils, based on the size of your carousel."
                },
                {
                    "headline": "Use a pencil case with elastic holders to house your pencils.",
                    "description": "Pencil cases are zippered canvas bags that easily protect and house your colored pencil collection. Place 3 pencils in each elastic section, based on the size of your case. Most cases have between 50-100 elastic spots, so you can contain many pencils in 1 place. In addition, pencil cases often have elastic spots for your erasers and blending tools. This is the most secure and professional-looking storage option."
                }
            ]
        },
        {
            "name": "Grouping Your Colored Pencils by Color",
            "steps": [
                {
                    "headline": "Organize your pencils by individual color first.",
                    "description": "Create a separate section for your red tones, and group all of your shades of blue together. Do this for all colors in your collection, including orange, yellow, green, and purple. You can also create a separate pile for neutral tones and metallics."
                },
                {
                    "headline": "Group your pencils based on the color spectrum for a rainbow display.",
                    "description": "With whatever organizational method you choose, start with your red colors, then place the orange and yellow shades next to them. Next, include your green, blue, and purple shades. You can finish with your neutrals, such as brown, black, and white. This creates a colorful display out of your organized colored pencils. For instance, do this if you are using a pencil stand or a pencil wrap."
                },
                {
                    "headline": "Separate your warm and cool colors to sort them based on temperature.",
                    "description": "Warm colors include red, orange, and yellow hues. Cool colors refer to green, blue, and purple shades. Choose a separate bin or container for each of these categories, and then place your warm shades in 1 container and the cool colors in another. For instance, you can use 1 pencil case for cool colors and another for warm colors. You can also use 1 mason jar for reds, oranges, and yellows, and then use a separate container for the greens, blues, and purples. Using interlocking storage containers work well if organizing based on color temperature."
                },
                {
                    "headline": "Sort your pencils into brights, neutrals, and pastels as a creative option.",
                    "description": "This is a good idea if you tend to use certain shades or colors more often than others. Put all of your bright shades, such as red, pink, and purple, in 1 storage container. Then, place all of your neutral shades in another, including brown, tan, white, and black. Separate the pastel shades into their own section, such as yellow, lime green, and baby blue. This way, you can easily locate the colors you use often and consider using those that you don't gravitate to."
                },
                {
                    "headline": "Create a color swatch key to easily see what hue the pencils produce.",
                    "description": "While this is not required, it can help you see the true shade of the color as it looks on paper. Cut small cards or paper (based on the size of your storage container), and shade in a small square with each pencil individually. Write the name of the shade or the manufacturer color code on the slip next to the color so you can keep track of each one. Then, place this in your storage solution with your pencils. This is a good idea if you are a coloring book enthusiast and want to compare different hues. For example, use a 1 in × 3 in (2.5 cm × 7.6 cm) card to make your swatch, then use a small paper clip to secure it to each elastic band of your pencil case. You can also cut a 2 in × 4 in (5.1 cm × 10.2 cm) card, fill it out for all of the colors in each mason jar. Then, place the card inside of the mason jar."
                }
            ]
        },
        {
            "name": "Accessing Your Pencils and Tools",
            "steps": [
                {
                    "headline": "Pick a spot to keep your colored pencils.",
                    "description": "After you organize your colored pencils, you want to designate a home for them based on your space. Take an assessment of your space, then situate your storage solution in a spot where you can easily access it. For instance, if you have an art studio or craft space, put your colored pencils on a desk. If you do your coloring on your coffee table, place your colored pencil stand in the top corner. Consider placing your pencil case on a bookshelf when you aren’t using it."
                },
                {
                    "headline": "Keep your other coloring supplies nearby so you can easily use them.",
                    "description": "Reserve a container or section of your case for your colorless blender, Tortillion stumps, or erasers. It is also helpful to keep a pencil sharpener nearby. Use the colorless blender or Tortillion stump to shade 1 color into another."
                },
                {
                    "headline": "Handle your pencils with care to keep them in great shape.",
                    "description": "If you drop your colored pencils, the inside pigment may break. To prevent this, keep them in their storage container when not in use, and handle your pencils with care. Protect your colored pencils to preserve the pigment as long as possible. When you sharpen the pencil, the point will be inconsistent if the inside pigment is broken. This lowers the quality of your colored pencil. Using a pencil case with elastic sections is the most secure storage solution."
                }
            ]
        }
    ],
    "tyn": [
        "Collection of colored pencils",
        "Mason jar and mounting tape",
        "Pencil wrap",
        "Plastic storage container",
        "Pencil stand",
        "Pencil carousel",
        "Pencil case",
        "Location for your storage solution"
    ],
    "text": " Choosing a Storage Container Use 5 mason jars to easily organize your colored pencils. Create a row of 3 mason jars, and place a ⁄2 inch (1.3 cm) piece of mounting tape in between each jar. Then, put another ⁄2 inch (1.3 cm) piece of tape on the outer side of the jars. Stagger another 2 jars in between the first 3 so they are all in a bunch. Then, lift up the jars and place them on their side to easily access the tops. After you sort through your pencils, place them into each of the jars, based on your organizational method. Mason jars are a great option to keep on your craft desk at home. You can do this with 3 jars or 7 jars if you prefer. Using an odd number of jars helps create an attractive display. Try a pencil wrap to provide your colored pencils with basic coverage. A pencil wrap is a convenient, multi-sectioned pouch you can purchase to store your colored pencils. Place your pencils inside each section, and then roll up your pencil wrap starting at the side without a clasp. Then, secure your pencil wrap with the snap or tie. The size, shape, and design depend on the particular model, but you can usually fit at least 40 colored pencils in 1 pouch. This is a great idea if you want to take your pencils with you while traveling. Store your pencils in plastic containers to keep them neat. Visit a container store or office supply store to browse plastic storage solutions. You can choose individual units or interlocking storage solutions. Sort through your pencils, then place each color family inside its own plastic container. Using plastic storage options is also a waterproof solution. For instance, use these if you want to color while sunbathing at the beach or laying by the pool. You can use more or less plastic containers, depending on your pencil collection. Try using a pencil stand if you color with your pencils frequently. Purchase a pencil stand from most craft supply stores. These are pieces of wood or plastic with holes drilled into the top to hold your pencils individually. Place 1 pencil in each hole, and arrange them by color for a neat, presentable option. Place your pencil stand on your desk or bedside table if you tend to color very regularly. This way, you can easily access all of your favorite hues. These typically hold around 25-30 pencils at a time. Get a plastic carousel to easily locate any color you need. A plastic carousel is a desktop unit with individual sections to house pens, pencils, and supplies. Use one of these to keep your colored pencils organized if you want to easily view all of your options. You can group each color into its own unit, or spread the colors out based on how frequently you use them. This is a nice option because they usually have other smaller sections, so you can keep your sharpener or erasers nearby too. You can hold 30-80 pencils, based on the size of your carousel. Use a pencil case with elastic holders to house your pencils. Pencil cases are zippered canvas bags that easily protect and house your colored pencil collection. Place 3 pencils in each elastic section, based on the size of your case. Most cases have between 50-100 elastic spots, so you can contain many pencils in 1 place. In addition, pencil cases often have elastic spots for your erasers and blending tools. This is the most secure and professional-looking storage option. Grouping Your Colored Pencils by Color Organize your pencils by individual color first. Create a separate section for your red tones, and group all of your shades of blue together. Do this for all colors in your collection, including orange, yellow, green, and purple. You can also create a separate pile for neutral tones and metallics. Group your pencils based on the color spectrum for a rainbow display. With whatever organizational method you choose, start with your red colors, then place the orange and yellow shades next to them. Next, include your green, blue, and purple shades. You can finish with your neutrals, such as brown, black, and white. This creates a colorful display out of your organized colored pencils. For instance, do this if you are using a pencil stand or a pencil wrap. Separate your warm and cool colors to sort them based on temperature. Warm colors include red, orange, and yellow hues. Cool colors refer to green, blue, and purple shades. Choose a separate bin or container for each of these categories, and then place your warm shades in 1 container and the cool colors in another. For instance, you can use 1 pencil case for cool colors and another for warm colors. You can also use 1 mason jar for reds, oranges, and yellows, and then use a separate container for the greens, blues, and purples. Using interlocking storage containers work well if organizing based on color temperature. Sort your pencils into brights, neutrals, and pastels as a creative option. This is a good idea if you tend to use certain shades or colors more often than others. Put all of your bright shades, such as red, pink, and purple, in 1 storage container. Then, place all of your neutral shades in another, including brown, tan, white, and black. Separate the pastel shades into their own section, such as yellow, lime green, and baby blue. This way, you can easily locate the colors you use often and consider using those that you don't gravitate to. Create a color swatch key to easily see what hue the pencils produce. While this is not required, it can help you see the true shade of the color as it looks on paper. Cut small cards or paper (based on the size of your storage container), and shade in a small square with each pencil individually. Write the name of the shade or the manufacturer color code on the slip next to the color so you can keep track of each one. Then, place this in your storage solution with your pencils. This is a good idea if you are a coloring book enthusiast and want to compare different hues. For example, use a 1 in × 3 in (2.5 cm × 7.6 cm) card to make your swatch, then use a small paper clip to secure it to each elastic band of your pencil case. You can also cut a 2 in × 4 in (5.1 cm × 10.2 cm) card, fill it out for all of the colors in each mason jar. Then, place the card inside of the mason jar. Accessing Your Pencils and Tools Pick a spot to keep your colored pencils. After you organize your colored pencils, you want to designate a home for them based on your space. Take an assessment of your space, then situate your storage solution in a spot where you can easily access it. For instance, if you have an art studio or craft space, put your colored pencils on a desk. If you do your coloring on your coffee table, place your colored pencil stand in the top corner. Consider placing your pencil case on a bookshelf when you aren’t using it. Keep your other coloring supplies nearby so you can easily use them. Reserve a container or section of your case for your colorless blender, Tortillion stumps, or erasers. It is also helpful to keep a pencil sharpener nearby. Use the colorless blender or Tortillion stump to shade 1 color into another. Handle your pencils with care to keep them in great shape. If you drop your colored pencils, the inside pigment may break. To prevent this, keep them in their storage container when not in use, and handle your pencils with care. Protect your colored pencils to preserve the pigment as long as possible. When you sharpen the pencil, the point will be inconsistent if the inside pigment is broken. This lowers the quality of your colored pencil. Using a pencil case with elastic sections is the most secure storage solution.",
    "sentences": [
        " Choosing a Storage Container Use 5 mason jars to easily organize your colored pencils.",
        "Create a row of 3 mason jars, and place a ⁄2 inch (1.3 cm) piece of mounting tape in between each jar.",
        "Then, put another ⁄2 inch (1.3 cm) piece of tape on the outer side of the jars.",
        "Stagger another 2 jars in between the first 3 so they are all in a bunch.",
        "Then, lift up the jars and place them on their side to easily access the tops.",
        "After you sort through your pencils, place them into each of the jars, based on your organizational method.",
        "Mason jars are a great option to keep on your craft desk at home.",
        "You can do this with 3 jars or 7 jars if you prefer.",
        "Using an odd number of jars helps create an attractive display.",
        "Try a pencil wrap to provide your colored pencils with basic coverage.",
        "A pencil wrap is a convenient, multi-sectioned pouch you can purchase to store your colored pencils.",
        "Place your pencils inside each section, and then roll up your pencil wrap starting at the side without a clasp.",
        "Then, secure your pencil wrap with the snap or tie.",
        "The size, shape, and design depend on the particular model, but you can usually fit at least 40 colored pencils in 1 pouch.",
        "This is a great idea if you want to take your pencils with you while traveling.",
        "Store your pencils in plastic containers to keep them neat.",
        "Visit a container store or office supply store to browse plastic storage solutions.",
        "You can choose individual units or interlocking storage solutions.",
        "Sort through your pencils, then place each color family inside its own plastic container.",
        "Using plastic storage options is also a waterproof solution.",
        "For instance, use these if you want to color while sunbathing at the beach or laying by the pool.",
        "You can use more or less plastic containers, depending on your pencil collection.",
        "Try using a pencil stand if you color with your pencils frequently.",
        "Purchase a pencil stand from most craft supply stores.",
        "These are pieces of wood or plastic with holes drilled into the top to hold your pencils individually.",
        "Place 1 pencil in each hole, and arrange them by color for a neat, presentable option.",
        "Place your pencil stand on your desk or bedside table if you tend to color very regularly.",
        "This way, you can easily access all of your favorite hues.",
        "These typically hold around 25-30 pencils at a time.",
        "Get a plastic carousel to easily locate any color you need.",
        "A plastic carousel is a desktop unit with individual sections to house pens, pencils, and supplies.",
        "Use one of these to keep your colored pencils organized if you want to easily view all of your options.",
        "You can group each color into its own unit, or spread the colors out based on how frequently you use them.",
        "This is a nice option because they usually have other smaller sections, so you can keep your sharpener or erasers nearby too.",
        "You can hold 30-80 pencils, based on the size of your carousel.",
        "Use a pencil case with elastic holders to house your pencils.",
        "Pencil cases are zippered canvas bags that easily protect and house your colored pencil collection.",
        "Place 3 pencils in each elastic section, based on the size of your case.",
        "Most cases have between 50-100 elastic spots, so you can contain many pencils in 1 place.",
        "In addition, pencil cases often have elastic spots for your erasers and blending tools.",
        "This is the most secure and professional-looking storage option.",
        "Grouping Your Colored Pencils by Color Organize your pencils by individual color first.",
        "Create a separate section for your red tones, and group all of your shades of blue together.",
        "Do this for all colors in your collection, including orange, yellow, green, and purple.",
        "You can also create a separate pile for neutral tones and metallics.",
        "Group your pencils based on the color spectrum for a rainbow display.",
        "With whatever organizational method you choose, start with your red colors, then place the orange and yellow shades next to them.",
        "Next, include your green, blue, and purple shades.",
        "You can finish with your neutrals, such as brown, black, and white.",
        "This creates a colorful display out of your organized colored pencils.",
        "For instance, do this if you are using a pencil stand or a pencil wrap.",
        "Separate your warm and cool colors to sort them based on temperature.",
        "Warm colors include red, orange, and yellow hues.",
        "Cool colors refer to green, blue, and purple shades.",
        "Choose a separate bin or container for each of these categories, and then place your warm shades in 1 container and the cool colors in another.",
        "For instance, you can use 1 pencil case for cool colors and another for warm colors.",
        "You can also use 1 mason jar for reds, oranges, and yellows, and then use a separate container for the greens, blues, and purples.",
        "Using interlocking storage containers work well if organizing based on color temperature.",
        "Sort your pencils into brights, neutrals, and pastels as a creative option.",
        "This is a good idea if you tend to use certain shades or colors more often than others.",
        "Put all of your bright shades, such as red, pink, and purple, in 1 storage container.",
        "Then, place all of your neutral shades in another, including brown, tan, white, and black.",
        "Separate the pastel shades into their own section, such as yellow, lime green, and baby blue.",
        "This way, you can easily locate the colors you use often and consider using those that you don't gravitate to.",
        "Create a color swatch key to easily see what hue the pencils produce.",
        "While this is not required, it can help you see the true shade of the color as it looks on paper.",
        "Cut small cards or paper (based on the size of your storage container), and shade in a small square with each pencil individually.",
        "Write the name of the shade or the manufacturer color code on the slip next to the color so you can keep track of each one.",
        "Then, place this in your storage solution with your pencils.",
        "This is a good idea if you are a coloring book enthusiast and want to compare different hues.",
        "For example, use a 1 in × 3 in (2.5 cm × 7.6 cm) card to make your swatch, then use a small paper clip to secure it to each elastic band of your pencil case.",
        "You can also cut a 2 in × 4 in (5.1 cm × 10.2 cm) card, fill it out for all of the colors in each mason jar.",
        "Then, place the card inside of the mason jar.",
        "Accessing Your Pencils and Tools Pick a spot to keep your colored pencils.",
        "After you organize your colored pencils, you want to designate a home for them based on your space.",
        "Take an assessment of your space, then situate your storage solution in a spot where you can easily access it.",
        "For instance, if you have an art studio or craft space, put your colored pencils on a desk.",
        "If you do your coloring on your coffee table, place your colored pencil stand in the top corner.",
        "Consider placing your pencil case on a bookshelf when you aren’t using it.",
        "Keep your other coloring supplies nearby so you can easily use them.",
        "Reserve a container or section of your case for your colorless blender, Tortillion stumps, or erasers.",
        "It is also helpful to keep a pencil sharpener nearby.",
        "Use the colorless blender or Tortillion stump to shade 1 color into another.",
        "Handle your pencils with care to keep them in great shape.",
        "If you drop your colored pencils, the inside pigment may break.",
        "To prevent this, keep them in their storage container when not in use, and handle your pencils with care.",
        "Protect your colored pencils to preserve the pigment as long as possible.",
        "When you sharpen the pencil, the point will be inconsistent if the inside pigment is broken.",
        "This lowers the quality of your colored pencil.",
        "Using a pencil case with elastic sections is the most secure storage solution."
    ]
}