{
    "title": "How to Use the Magic Flight Launch Box",
    "url": "https://www.wikihow.com/Use-the-Magic-Flight-Launch-Box",
    "category_hierarchy": [
        "Health",
        "Medicines and Drugs",
        "Recreational Drugs"
    ],
    "parts": [
        {
            "name": "Preparations",
            "steps": [
                {
                    "headline": "Obtain a Launch Box.",
                    "description": "It can be ordered from the Magic Flight website, or from online stores like Amazon."
                },
                {
                    "headline": "Know the features of the Launch Box and its accessories.",
                    "description": "The kit comes with the Launch Box, two batteries with rubber protective caps, a battery charger, a cleaning brush, and a glass stem used to inhale the vapor.The actual Launch Box contains the following features:\nThe trench, which consists of a screen to contain the material. The lid, which is often engraved with a design and must be closed for effective vaporization. The lid locks in place to contain the vapor. A draw hole, where the vapor is formed and inhaled. A light, which is located within the draw hole and acts a battery life indicator (the dimmer the light, the less charge the battery has). The battery hole, where the battery is held and engaged to use the device. It contains a rubber pushback ring that prevents the battery from accidentally engaging when not in use."
                },
                {
                    "headline": "Grind your material.",
                    "description": "Optimally, you'll want to obtain an extremely fine grind to achieve even vaporization. Make sure the herbs are completely dry, as well. A coarse grind doesn't have enough surface area to vaporize effectively. By grinding the herb finely, the surface area is increased to allow for even vaporization."
                },
                {
                    "headline": "Fill the trench up to the inner side rails.",
                    "description": "Make sure not to overfill or underfill the trench. Avoid packing the material with your fingers; vaporization is most effective when the herbs sit loosely in the trench."
                },
                {
                    "headline": "Close the lid.",
                    "description": "Again, the key to effective vaporization is closing the lid to contain the vapor. Make sure it locks into place to keep the vapor from escaping."
                },
                {
                    "headline": "Insert the positive end of a battery into the battery hole.",
                    "description": "Remove the cap first, then insert it into the hole, positive end first. The rubber pushback ring will prevent the battery from engaging until you're ready to take a hit. Placing the rubber cap on the negative end of the battery will make engaging the battery more comfortable for your hands."
                },
                {
                    "headline": "Insert the glass stem into the draw hole.",
                    "description": "This is optional, but recommended for beginners. Using the Launch Box without the stem is known as \"native mode.\""
                }
            ]
        },
        {
            "name": "Taking a Hit",
            "steps": [
                {
                    "headline": "Wrap your dominant hand around the Launch Box and hold it up to eye level.",
                    "description": "You should be able to peek inside the stem and/or draw hole. The negative end of the battery should be against your palm."
                },
                {
                    "headline": "Squeeze your hand to engage the battery and hold for 3-5 seconds until you see vapor forming.",
                    "description": "If you can see the light through the draw hole, the battery is engaging and vaporization is in progress."
                },
                {
                    "headline": "Without releasing the battery, place your lips on the stem and inhale slowly (this is known as \"drawing\").",
                    "description": "You should be inhaling until 80% of your lung capacity is reached (about ten seconds). It helps to understand the relationship between the draw rate and the temperature of the trench. When you inhale faster, the trench cools due to more airflow passing over the screen. When you inhale more slowly (or stop inhaling completely), the temperature increases as long as the battery is engaged. The key to a perfect hit is balancing the draw rate and trench temperature. You should also know the effects of your draw speed. Too fast and the trench will be too cool to produce vapor; too slow and you run the risk of igniting the herbs (see Warnings section). Sense the heat of the vapor on your tongue and use it to control your draw speed. Ideally, the vapor should be warm without causing throat irritation, and the draw rate should be fast enough so that vapor doesn't collect in the chamber (vapor should be inhaled as it is being formed)."
                },
                {
                    "headline": "Relax your hand to disengage the battery and inhale slightly faster for a few seconds to capture the remaining vapor in the Box.",
                    "description": ""
                },
                {
                    "headline": "Hold in the vapor for several seconds, then exhale.",
                    "description": "To achieve a successful hit, inhale until you reach 80% of your lung capacity (about ten seconds) and hold it in for the remaining 20%. The Launch Box was designed to maximize efficiency by producing only as much vapor as the lungs are likely to naturally absorb. Excess vapor upon exhalation indicates it was not fully absorbed into the body. This also may lead to additional smell."
                },
                {
                    "headline": "\"Turn, tumble, and tap\".",
                    "description": "For even vaporization, it's recommended to tumble your load after each draw. After removing the battery and stem, turn the Launch Box upside-down and tap on the sides to dislodge the herbs from the trench. Tumble the load by shaking the Box side-to-side. Tap the sides of the Box to settle the herbs back into the trench."
                },
                {
                    "headline": "Repeat the process until the trench is finished.",
                    "description": "If even vaporization was consistently achieved, the trench is considered finished when the herbs turn a uniform brown color. The smell of popcorn is also a good indicator of a finished trench."
                }
            ]
        },
        {
            "name": "Cleaning",
            "steps": [
                {
                    "headline": "Clean the box after each completed trench.",
                    "description": "Open the lid, turn the Launch Box over, and empty out the trench. Brush the screen gently with the cleaning brush. Close your eyes and sharply blow against the screen to remove any remaining particles. For most users, basic cleaning should be enough. For more in-depth cleaning, dip the brush or cotton swab into 99% isopropyl alcohol and rub it against the screen. Make sure not to use too much alcohol as it may drip through the screen and produce an unpleasant taste for the next couple of trenches (though this goes away after use)."
                },
                {
                    "headline": "Clean the glass stem periodically using cotton swabs and isopropyl alcohol.",
                    "description": "Dip one end of a cotton swab into the alcohol and insert it back and forth into the stem to scrub away the oily residue. Repeat with water to remove all traces of the alcohol."
                }
            ]
        }
    ],
    "tyn": [
        "Magic Flight Launch Box and its included accessories",
        "Herb grinder",
        "Marijuana",
        "Cotton swabs",
        "Isopropyl alcohol"
    ],
    "text": " Preparations Obtain a Launch Box. It can be ordered from the Magic Flight website, or from online stores like Amazon. Know the features of the Launch Box and its accessories. The kit comes with the Launch Box, two batteries with rubber protective caps, a battery charger, a cleaning brush, and a glass stem used to inhale the vapor.The actual Launch Box contains the following features:\nThe trench, which consists of a screen to contain the material. The lid, which is often engraved with a design and must be closed for effective vaporization. The lid locks in place to contain the vapor. A draw hole, where the vapor is formed and inhaled. A light, which is located within the draw hole and acts a battery life indicator (the dimmer the light, the less charge the battery has). The battery hole, where the battery is held and engaged to use the device. It contains a rubber pushback ring that prevents the battery from accidentally engaging when not in use. Grind your material. Optimally, you'll want to obtain an extremely fine grind to achieve even vaporization. Make sure the herbs are completely dry, as well. A coarse grind doesn't have enough surface area to vaporize effectively. By grinding the herb finely, the surface area is increased to allow for even vaporization. Fill the trench up to the inner side rails. Make sure not to overfill or underfill the trench. Avoid packing the material with your fingers; vaporization is most effective when the herbs sit loosely in the trench. Close the lid. Again, the key to effective vaporization is closing the lid to contain the vapor. Make sure it locks into place to keep the vapor from escaping. Insert the positive end of a battery into the battery hole. Remove the cap first, then insert it into the hole, positive end first. The rubber pushback ring will prevent the battery from engaging until you're ready to take a hit. Placing the rubber cap on the negative end of the battery will make engaging the battery more comfortable for your hands. Insert the glass stem into the draw hole. This is optional, but recommended for beginners. Using the Launch Box without the stem is known as \"native mode.\" Taking a Hit Wrap your dominant hand around the Launch Box and hold it up to eye level. You should be able to peek inside the stem and/or draw hole. The negative end of the battery should be against your palm. Squeeze your hand to engage the battery and hold for 3-5 seconds until you see vapor forming. If you can see the light through the draw hole, the battery is engaging and vaporization is in progress. Without releasing the battery, place your lips on the stem and inhale slowly (this is known as \"drawing\"). You should be inhaling until 80% of your lung capacity is reached (about ten seconds). It helps to understand the relationship between the draw rate and the temperature of the trench. When you inhale faster, the trench cools due to more airflow passing over the screen. When you inhale more slowly (or stop inhaling completely), the temperature increases as long as the battery is engaged. The key to a perfect hit is balancing the draw rate and trench temperature. You should also know the effects of your draw speed. Too fast and the trench will be too cool to produce vapor; too slow and you run the risk of igniting the herbs (see Warnings section). Sense the heat of the vapor on your tongue and use it to control your draw speed. Ideally, the vapor should be warm without causing throat irritation, and the draw rate should be fast enough so that vapor doesn't collect in the chamber (vapor should be inhaled as it is being formed). Relax your hand to disengage the battery and inhale slightly faster for a few seconds to capture the remaining vapor in the Box.  Hold in the vapor for several seconds, then exhale. To achieve a successful hit, inhale until you reach 80% of your lung capacity (about ten seconds) and hold it in for the remaining 20%. The Launch Box was designed to maximize efficiency by producing only as much vapor as the lungs are likely to naturally absorb. Excess vapor upon exhalation indicates it was not fully absorbed into the body. This also may lead to additional smell. \"Turn, tumble, and tap\". For even vaporization, it's recommended to tumble your load after each draw. After removing the battery and stem, turn the Launch Box upside-down and tap on the sides to dislodge the herbs from the trench. Tumble the load by shaking the Box side-to-side. Tap the sides of the Box to settle the herbs back into the trench. Repeat the process until the trench is finished. If even vaporization was consistently achieved, the trench is considered finished when the herbs turn a uniform brown color. The smell of popcorn is also a good indicator of a finished trench. Cleaning Clean the box after each completed trench. Open the lid, turn the Launch Box over, and empty out the trench. Brush the screen gently with the cleaning brush. Close your eyes and sharply blow against the screen to remove any remaining particles. For most users, basic cleaning should be enough. For more in-depth cleaning, dip the brush or cotton swab into 99% isopropyl alcohol and rub it against the screen. Make sure not to use too much alcohol as it may drip through the screen and produce an unpleasant taste for the next couple of trenches (though this goes away after use). Clean the glass stem periodically using cotton swabs and isopropyl alcohol. Dip one end of a cotton swab into the alcohol and insert it back and forth into the stem to scrub away the oily residue. Repeat with water to remove all traces of the alcohol.",
    "sentences": [
        " Preparations Obtain a Launch Box.",
        "It can be ordered from the Magic Flight website, or from online stores like Amazon.",
        "Know the features of the Launch Box and its accessories.",
        "The kit comes with the Launch Box, two batteries with rubber protective caps, a battery charger, a cleaning brush, and a glass stem used to inhale the vapor.The actual Launch Box contains the following features:\nThe trench, which consists of a screen to contain the material.",
        "The lid, which is often engraved with a design and must be closed for effective vaporization.",
        "The lid locks in place to contain the vapor.",
        "A draw hole, where the vapor is formed and inhaled.",
        "A light, which is located within the draw hole and acts a battery life indicator (the dimmer the light, the less charge the battery has).",
        "The battery hole, where the battery is held and engaged to use the device.",
        "It contains a rubber pushback ring that prevents the battery from accidentally engaging when not in use.",
        "Grind your material.",
        "Optimally, you'll want to obtain an extremely fine grind to achieve even vaporization.",
        "Make sure the herbs are completely dry, as well.",
        "A coarse grind doesn't have enough surface area to vaporize effectively.",
        "By grinding the herb finely, the surface area is increased to allow for even vaporization.",
        "Fill the trench up to the inner side rails.",
        "Make sure not to overfill or underfill the trench.",
        "Avoid packing the material with your fingers; vaporization is most effective when the herbs sit loosely in the trench.",
        "Close the lid.",
        "Again, the key to effective vaporization is closing the lid to contain the vapor.",
        "Make sure it locks into place to keep the vapor from escaping.",
        "Insert the positive end of a battery into the battery hole.",
        "Remove the cap first, then insert it into the hole, positive end first.",
        "The rubber pushback ring will prevent the battery from engaging until you're ready to take a hit.",
        "Placing the rubber cap on the negative end of the battery will make engaging the battery more comfortable for your hands.",
        "Insert the glass stem into the draw hole.",
        "This is optional, but recommended for beginners.",
        "Using the Launch Box without the stem is known as \"native mode.\"",
        "Taking a Hit Wrap your dominant hand around the Launch Box and hold it up to eye level.",
        "You should be able to peek inside the stem and/or draw hole.",
        "The negative end of the battery should be against your palm.",
        "Squeeze your hand to engage the battery and hold for 3-5 seconds until you see vapor forming.",
        "If you can see the light through the draw hole, the battery is engaging and vaporization is in progress.",
        "Without releasing the battery, place your lips on the stem and inhale slowly (this is known as \"drawing\").",
        "You should be inhaling until 80% of your lung capacity is reached (about ten seconds).",
        "It helps to understand the relationship between the draw rate and the temperature of the trench.",
        "When you inhale faster, the trench cools due to more airflow passing over the screen.",
        "When you inhale more slowly (or stop inhaling completely), the temperature increases as long as the battery is engaged.",
        "The key to a perfect hit is balancing the draw rate and trench temperature.",
        "You should also know the effects of your draw speed.",
        "Too fast and the trench will be too cool to produce vapor; too slow and you run the risk of igniting the herbs (see Warnings section).",
        "Sense the heat of the vapor on your tongue and use it to control your draw speed.",
        "Ideally, the vapor should be warm without causing throat irritation, and the draw rate should be fast enough so that vapor doesn't collect in the chamber (vapor should be inhaled as it is being formed).",
        "Relax your hand to disengage the battery and inhale slightly faster for a few seconds to capture the remaining vapor in the Box.",
        "Hold in the vapor for several seconds, then exhale.",
        "To achieve a successful hit, inhale until you reach 80% of your lung capacity (about ten seconds) and hold it in for the remaining 20%.",
        "The Launch Box was designed to maximize efficiency by producing only as much vapor as the lungs are likely to naturally absorb.",
        "Excess vapor upon exhalation indicates it was not fully absorbed into the body.",
        "This also may lead to additional smell.",
        "\"Turn, tumble, and tap\".",
        "For even vaporization, it's recommended to tumble your load after each draw.",
        "After removing the battery and stem, turn the Launch Box upside-down and tap on the sides to dislodge the herbs from the trench.",
        "Tumble the load by shaking the Box side-to-side.",
        "Tap the sides of the Box to settle the herbs back into the trench.",
        "Repeat the process until the trench is finished.",
        "If even vaporization was consistently achieved, the trench is considered finished when the herbs turn a uniform brown color.",
        "The smell of popcorn is also a good indicator of a finished trench.",
        "Cleaning Clean the box after each completed trench.",
        "Open the lid, turn the Launch Box over, and empty out the trench.",
        "Brush the screen gently with the cleaning brush.",
        "Close your eyes and sharply blow against the screen to remove any remaining particles.",
        "For most users, basic cleaning should be enough.",
        "For more in-depth cleaning, dip the brush or cotton swab into 99% isopropyl alcohol and rub it against the screen.",
        "Make sure not to use too much alcohol as it may drip through the screen and produce an unpleasant taste for the next couple of trenches (though this goes away after use).",
        "Clean the glass stem periodically using cotton swabs and isopropyl alcohol.",
        "Dip one end of a cotton swab into the alcohol and insert it back and forth into the stem to scrub away the oily residue.",
        "Repeat with water to remove all traces of the alcohol."
    ]
}