{
    "title": "How to Preserve Herbs",
    "url": "https://www.wikihow.com/Preserve-Herbs",
    "category_hierarchy": [
        "Food and Entertaining",
        "Herbs and Spices",
        "Preserving Herbs"
    ],
    "methods": [
        {
            "name": "Steps",
            "steps": [
                {
                    "headline": "Harvest herbs from the garden.",
                    "description": "Use strong scissors or a kitchen knife to snip the herbs. If the herb can survive winter (i.e. it is a perennial with over-wintering abilities), cut the stems at the base of the plant. Other herbs can be entirely pulled out and the roots and woody parts composted after cutting. Cut all herbs used for drying in a way that leaves them with long stems. See \"Tips\" for hints on best times to harvest."
                },
                {
                    "headline": "Wash dirty herbs carefully.",
                    "description": "If you have to wash your herbs because of dirt, the best thing to do is to gently spray them with a fine mist sprayer and then wipe them. (Otherwise there may be a risk of mildew problems during storage.) Pat them with a paper towel or shake dry."
                }
            ]
        },
        {
            "name": "Hanging Herbs",
            "steps": [
                {
                    "headline": "Hang herbs to dry them for a quick preserving method that doesn't require too much effort.",
                    "description": ""
                },
                {
                    "headline": "Remove lower leaves from the stems and tie the bunch of herbs together close to the top of the stems.",
                    "description": "Ideally, a bunch should contain no more than 5 - 10 stems to facilitate ventilation."
                },
                {
                    "headline": "Find a dry, warm (not humid), dark and well ventilated place that is out of the way of pedestrian traffic or constant rummaging.",
                    "description": "The ideal temperature for drying is around 68ºF/20ºC. If you do not have a dark spot in the house, you can try tying paper lunch bags over each bunch and piercing airholes in the bag. This has the added bonus of also keeping the dust off."
                },
                {
                    "headline": "Leave the herbs to dry for 1 - 3 weeks.",
                    "description": "Check them every now and then to see how they are drying - thicker stemmed herbs will take longer. Check to see if their consistency has become crumbly by rubbing a leaf between two fingers. If they crumble, they are ready to be taken down."
                },
                {
                    "headline": "Remove the leaves and bottle them in airtight glass herb jars (or other jars you have around).",
                    "description": "Pick out any fluff, woody pieces and other foreign material as you remove the leaves. You can keep the leaves whole, crush them in your fingers to make a really fine ground mix for cooking (but use this quickly to retain flavour) or leave them in leaf shape for tea, garnishes on soups, etc. (these should not be too crumbly). Seeds should be left whole and crushed only when needed for cooking."
                },
                {
                    "headline": "Label the jar and date it.",
                    "description": "Store the herbs for up to one year."
                }
            ]
        },
        {
            "name": "Freezing Herbs",
            "steps": [
                {
                    "headline": "Freeze the herbs for ease of use when cooking.",
                    "description": "Not all herbs will freeze well but for those that do, here is what to do."
                },
                {
                    "headline": "Select appropriate herbs for freezing.",
                    "description": "Usually this method works best for soft-leaf herbs such as basil, tarragon, lovage and parsley. Some herbs can only be frozen as they don't dry, such as chives."
                },
                {
                    "headline": "Wash and dry freshly picked herbs, as above.",
                    "description": "Strip the leaves off and place them into freezer bags or containers. Label and date them as they should keep for up to 3 months. If you want them to last longer, blanch them for a few seconds in hot water and then dip straight into ice-cold water and pop them into the freezer in bags/containers. Blanched herbs will freeze for up to 6 months."
                },
                {
                    "headline": "Some cooks prefer to freeze herbs in ice-cube trays, so that they have handy little sizes for cooking use.",
                    "description": "If you choose to do it this way, freeze approximately one-third chopped herbs to two-thirds water. Basil is great pureed with olive oil before freezing in ice cubes (don't add water). Remove herbs frozen as ice cubes and store in plastic freezer bags. Remove pieces as needed."
                }
            ]
        },
        {
            "name": "Steeping Herbs in Oil",
            "steps": [
                {
                    "headline": "Steep the herbs in oil to preserve the herbs long term.",
                    "description": "However, see the Warnings below first."
                },
                {
                    "headline": "Harvest and clean herbs as per instructions above.",
                    "description": ""
                },
                {
                    "headline": "Choose an oil.",
                    "description": "Olive oil is preferred but any other oils that you like are generally fine."
                },
                {
                    "headline": "Decide whether to keep the leaves attached to the stem or remove them and add them separately.",
                    "description": "If you want to use the oil as herbal flavoured oil, the stems are fine. Place in a bottle as a container; herbs remaining on their stem inside the oil bottle look very attractive as ornamental arrangements, as well as being useful culinary items. If you wish to remove the herbal leaves for cooking, a shorter, wider container is preferable to enable you to put in a spoon and scoop out the herbs and oil."
                },
                {
                    "headline": "Keep in a cool or refrigerated place, especially during warmer months.",
                    "description": "Use within 6 months of preparation."
                }
            ]
        },
        {
            "name": "Drying Herbs on a Paper Towel",
            "steps": [
                {
                    "headline": "Lay a clean paper towel on a counter top.",
                    "description": "Lay another one on top of this."
                },
                {
                    "headline": "Snip washed leaves off stem and arrange in rows on 1/2 of the towel.",
                    "description": ""
                },
                {
                    "headline": "Lay another paper towel folded in 1/2 over leaves.",
                    "description": ""
                },
                {
                    "headline": "Add another layer of leaves and bring other 1/2 of first 2 towel layers to cover this.",
                    "description": ""
                },
                {
                    "headline": "Leave it to dry about 2 days or 3 depending on leaf thickness.",
                    "description": "You know they're dry when you can crumble a leaf in your hand."
                },
                {
                    "headline": "Place in a zippered plastic bag or plastic container.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Dehydrating Herbs",
            "steps": [
                {
                    "headline": "Remove the stems from chosen herb.",
                    "description": ""
                },
                {
                    "headline": "Remove the leaves from the stem.",
                    "description": ""
                },
                {
                    "headline": "Wipe clean.",
                    "description": ""
                },
                {
                    "headline": "Place the herb leaves on dehydrator trays.",
                    "description": "Leave sufficient room for air circulation."
                },
                {
                    "headline": "Process in a dehydrator.",
                    "description": "Follow the dehydrator instructions for the leaf size."
                },
                {
                    "headline": "Package in clean jars or airtight packaging.",
                    "description": ""
                },
                {
                    "headline": "Label and store.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Fresh garden herbs or locally produced herbs",
        "Twine, elastic bands or wool for tying bunches together",
        "Dark, warm, well-ventilated area for hanging herbs",
        "Storage jars",
        "Freezer for freezing herbs",
        "Plastic bags",
        "Oil for steeping herbs",
        "Glass bottle or container for herbs in oil"
    ],
    "text": " Steps Harvest herbs from the garden. Use strong scissors or a kitchen knife to snip the herbs. If the herb can survive winter (i.e. it is a perennial with over-wintering abilities), cut the stems at the base of the plant. Other herbs can be entirely pulled out and the roots and woody parts composted after cutting. Cut all herbs used for drying in a way that leaves them with long stems. See \"Tips\" for hints on best times to harvest. Wash dirty herbs carefully. If you have to wash your herbs because of dirt, the best thing to do is to gently spray them with a fine mist sprayer and then wipe them. (Otherwise there may be a risk of mildew problems during storage.) Pat them with a paper towel or shake dry. Hanging Herbs Hang herbs to dry them for a quick preserving method that doesn't require too much effort.  Remove lower leaves from the stems and tie the bunch of herbs together close to the top of the stems. Ideally, a bunch should contain no more than 5 - 10 stems to facilitate ventilation. Find a dry, warm (not humid), dark and well ventilated place that is out of the way of pedestrian traffic or constant rummaging. The ideal temperature for drying is around 68ºF/20ºC. If you do not have a dark spot in the house, you can try tying paper lunch bags over each bunch and piercing airholes in the bag. This has the added bonus of also keeping the dust off. Leave the herbs to dry for 1 - 3 weeks. Check them every now and then to see how they are drying - thicker stemmed herbs will take longer. Check to see if their consistency has become crumbly by rubbing a leaf between two fingers. If they crumble, they are ready to be taken down. Remove the leaves and bottle them in airtight glass herb jars (or other jars you have around). Pick out any fluff, woody pieces and other foreign material as you remove the leaves. You can keep the leaves whole, crush them in your fingers to make a really fine ground mix for cooking (but use this quickly to retain flavour) or leave them in leaf shape for tea, garnishes on soups, etc. (these should not be too crumbly). Seeds should be left whole and crushed only when needed for cooking. Label the jar and date it. Store the herbs for up to one year. Freezing Herbs Freeze the herbs for ease of use when cooking. Not all herbs will freeze well but for those that do, here is what to do. Select appropriate herbs for freezing. Usually this method works best for soft-leaf herbs such as basil, tarragon, lovage and parsley. Some herbs can only be frozen as they don't dry, such as chives. Wash and dry freshly picked herbs, as above. Strip the leaves off and place them into freezer bags or containers. Label and date them as they should keep for up to 3 months. If you want them to last longer, blanch them for a few seconds in hot water and then dip straight into ice-cold water and pop them into the freezer in bags/containers. Blanched herbs will freeze for up to 6 months. Some cooks prefer to freeze herbs in ice-cube trays, so that they have handy little sizes for cooking use. If you choose to do it this way, freeze approximately one-third chopped herbs to two-thirds water. Basil is great pureed with olive oil before freezing in ice cubes (don't add water). Remove herbs frozen as ice cubes and store in plastic freezer bags. Remove pieces as needed. Steeping Herbs in Oil Steep the herbs in oil to preserve the herbs long term. However, see the Warnings below first. Harvest and clean herbs as per instructions above.  Choose an oil. Olive oil is preferred but any other oils that you like are generally fine. Decide whether to keep the leaves attached to the stem or remove them and add them separately. If you want to use the oil as herbal flavoured oil, the stems are fine. Place in a bottle as a container; herbs remaining on their stem inside the oil bottle look very attractive as ornamental arrangements, as well as being useful culinary items. If you wish to remove the herbal leaves for cooking, a shorter, wider container is preferable to enable you to put in a spoon and scoop out the herbs and oil. Keep in a cool or refrigerated place, especially during warmer months. Use within 6 months of preparation. Drying Herbs on a Paper Towel Lay a clean paper towel on a counter top. Lay another one on top of this. Snip washed leaves off stem and arrange in rows on 1/2 of the towel.  Lay another paper towel folded in 1/2 over leaves.  Add another layer of leaves and bring other 1/2 of first 2 towel layers to cover this.  Leave it to dry about 2 days or 3 depending on leaf thickness. You know they're dry when you can crumble a leaf in your hand. Place in a zippered plastic bag or plastic container.  Dehydrating Herbs Remove the stems from chosen herb.  Remove the leaves from the stem.  Wipe clean.  Place the herb leaves on dehydrator trays. Leave sufficient room for air circulation. Process in a dehydrator. Follow the dehydrator instructions for the leaf size. Package in clean jars or airtight packaging.  Label and store. ",
    "sentences": [
        " Steps Harvest herbs from the garden.",
        "Use strong scissors or a kitchen knife to snip the herbs.",
        "If the herb can survive winter (i.e.",
        "it is a perennial with over-wintering abilities), cut the stems at the base of the plant.",
        "Other herbs can be entirely pulled out and the roots and woody parts composted after cutting.",
        "Cut all herbs used for drying in a way that leaves them with long stems.",
        "See \"Tips\" for hints on best times to harvest.",
        "Wash dirty herbs carefully.",
        "If you have to wash your herbs because of dirt, the best thing to do is to gently spray them with a fine mist sprayer and then wipe them.",
        "(Otherwise there may be a risk of mildew problems during storage.)",
        "Pat them with a paper towel or shake dry.",
        "Hanging Herbs Hang herbs to dry them for a quick preserving method that doesn't require too much effort.",
        "Remove lower leaves from the stems and tie the bunch of herbs together close to the top of the stems.",
        "Ideally, a bunch should contain no more than 5 - 10 stems to facilitate ventilation.",
        "Find a dry, warm (not humid), dark and well ventilated place that is out of the way of pedestrian traffic or constant rummaging.",
        "The ideal temperature for drying is around 68ºF/20ºC.",
        "If you do not have a dark spot in the house, you can try tying paper lunch bags over each bunch and piercing airholes in the bag.",
        "This has the added bonus of also keeping the dust off.",
        "Leave the herbs to dry for 1 - 3 weeks.",
        "Check them every now and then to see how they are drying - thicker stemmed herbs will take longer.",
        "Check to see if their consistency has become crumbly by rubbing a leaf between two fingers.",
        "If they crumble, they are ready to be taken down.",
        "Remove the leaves and bottle them in airtight glass herb jars (or other jars you have around).",
        "Pick out any fluff, woody pieces and other foreign material as you remove the leaves.",
        "You can keep the leaves whole, crush them in your fingers to make a really fine ground mix for cooking (but use this quickly to retain flavour) or leave them in leaf shape for tea, garnishes on soups, etc.",
        "(these should not be too crumbly).",
        "Seeds should be left whole and crushed only when needed for cooking.",
        "Label the jar and date it.",
        "Store the herbs for up to one year.",
        "Freezing Herbs Freeze the herbs for ease of use when cooking.",
        "Not all herbs will freeze well but for those that do, here is what to do.",
        "Select appropriate herbs for freezing.",
        "Usually this method works best for soft-leaf herbs such as basil, tarragon, lovage and parsley.",
        "Some herbs can only be frozen as they don't dry, such as chives.",
        "Wash and dry freshly picked herbs, as above.",
        "Strip the leaves off and place them into freezer bags or containers.",
        "Label and date them as they should keep for up to 3 months.",
        "If you want them to last longer, blanch them for a few seconds in hot water and then dip straight into ice-cold water and pop them into the freezer in bags/containers.",
        "Blanched herbs will freeze for up to 6 months.",
        "Some cooks prefer to freeze herbs in ice-cube trays, so that they have handy little sizes for cooking use.",
        "If you choose to do it this way, freeze approximately one-third chopped herbs to two-thirds water.",
        "Basil is great pureed with olive oil before freezing in ice cubes (don't add water).",
        "Remove herbs frozen as ice cubes and store in plastic freezer bags.",
        "Remove pieces as needed.",
        "Steeping Herbs in Oil Steep the herbs in oil to preserve the herbs long term.",
        "However, see the Warnings below first.",
        "Harvest and clean herbs as per instructions above.",
        "Choose an oil.",
        "Olive oil is preferred but any other oils that you like are generally fine.",
        "Decide whether to keep the leaves attached to the stem or remove them and add them separately.",
        "If you want to use the oil as herbal flavoured oil, the stems are fine.",
        "Place in a bottle as a container; herbs remaining on their stem inside the oil bottle look very attractive as ornamental arrangements, as well as being useful culinary items.",
        "If you wish to remove the herbal leaves for cooking, a shorter, wider container is preferable to enable you to put in a spoon and scoop out the herbs and oil.",
        "Keep in a cool or refrigerated place, especially during warmer months.",
        "Use within 6 months of preparation.",
        "Drying Herbs on a Paper Towel Lay a clean paper towel on a counter top.",
        "Lay another one on top of this.",
        "Snip washed leaves off stem and arrange in rows on 1/2 of the towel.",
        "Lay another paper towel folded in 1/2 over leaves.",
        "Add another layer of leaves and bring other 1/2 of first 2 towel layers to cover this.",
        "Leave it to dry about 2 days or 3 depending on leaf thickness.",
        "You know they're dry when you can crumble a leaf in your hand.",
        "Place in a zippered plastic bag or plastic container.",
        "Dehydrating Herbs Remove the stems from chosen herb.",
        "Remove the leaves from the stem.",
        "Wipe clean.",
        "Place the herb leaves on dehydrator trays.",
        "Leave sufficient room for air circulation.",
        "Process in a dehydrator.",
        "Follow the dehydrator instructions for the leaf size.",
        "Package in clean jars or airtight packaging.",
        "Label and store."
    ]
}