{
    "title": "How to Write a Chapter Book",
    "url": "https://www.wikihow.com/Write-a-Chapter-Book",
    "category_hierarchy": [
        "Education and Communications",
        "Writing",
        "Writing Genres",
        "Writing for Children"
    ],
    "steps": [
        {
            "headline": "Decide what will happen.",
            "description": "This is to give the book a good beginning as well as a good or twist ending depending on how you want to write your book. It helps if you map out your plot, setting, and characters, keeping the notes with you whenever you have the urge to continue your story."
        },
        {
            "headline": "Organize the chapters.",
            "description": "This is important as you should know where to put what in which chapter. Don't get stressed or worried when the story doesn't make sense. You can erase it or delete it! Also, you can put the information that you want with the chapters in the notes. It also helps."
        },
        {
            "headline": "Organize the characters and their character traits.",
            "description": "This determines what your characters are, who, what they do, how they are. It's also important to give changes in traits for a main character as he/she/they could learn more as they go in your book. In your book, make sure your characters are 3D. Being 3D means that your character will do unexpected things, things that are surprising to the reader."
        },
        {
            "headline": "Picture the Settings.",
            "description": "Observe where you want your characters to go. As you imagine, write down descriptions of what you see in your notes, as it would help in your story. If it is a real place, research it. Find interesting things about it and write it down"
        },
        {
            "headline": "Start writing!",
            "description": "You should have everything ready to get on with your chapter book. It is a good chance that it would be a great book with all of the preparation."
        },
        {
            "headline": "Get feedback.",
            "description": "Don't worry about negative comments. Take negative comments as helpful hints for other books that you may want to write!"
        }
    ],
    "tyn": [
        "Blank notebook or computer",
        "A setting and characters with your own unique names",
        "An outlook"
    ],
    "text": " Decide what will happen. This is to give the book a good beginning as well as a good or twist ending depending on how you want to write your book. It helps if you map out your plot, setting, and characters, keeping the notes with you whenever you have the urge to continue your story. Organize the chapters. This is important as you should know where to put what in which chapter. Don't get stressed or worried when the story doesn't make sense. You can erase it or delete it! Also, you can put the information that you want with the chapters in the notes. It also helps. Organize the characters and their character traits. This determines what your characters are, who, what they do, how they are. It's also important to give changes in traits for a main character as he/she/they could learn more as they go in your book. In your book, make sure your characters are 3D. Being 3D means that your character will do unexpected things, things that are surprising to the reader. Picture the Settings. Observe where you want your characters to go. As you imagine, write down descriptions of what you see in your notes, as it would help in your story. If it is a real place, research it. Find interesting things about it and write it down Start writing! You should have everything ready to get on with your chapter book. It is a good chance that it would be a great book with all of the preparation. Get feedback. Don't worry about negative comments. Take negative comments as helpful hints for other books that you may want to write!",
    "sentences": [
        " Decide what will happen.",
        "This is to give the book a good beginning as well as a good or twist ending depending on how you want to write your book.",
        "It helps if you map out your plot, setting, and characters, keeping the notes with you whenever you have the urge to continue your story.",
        "Organize the chapters.",
        "This is important as you should know where to put what in which chapter.",
        "Don't get stressed or worried when the story doesn't make sense.",
        "You can erase it or delete it!",
        "Also, you can put the information that you want with the chapters in the notes.",
        "It also helps.",
        "Organize the characters and their character traits.",
        "This determines what your characters are, who, what they do, how they are.",
        "It's also important to give changes in traits for a main character as he/she/they could learn more as they go in your book.",
        "In your book, make sure your characters are 3D.",
        "Being 3D means that your character will do unexpected things, things that are surprising to the reader.",
        "Picture the Settings.",
        "Observe where you want your characters to go.",
        "As you imagine, write down descriptions of what you see in your notes, as it would help in your story.",
        "If it is a real place, research it.",
        "Find interesting things about it and write it down Start writing!",
        "You should have everything ready to get on with your chapter book.",
        "It is a good chance that it would be a great book with all of the preparation.",
        "Get feedback.",
        "Don't worry about negative comments.",
        "Take negative comments as helpful hints for other books that you may want to write!"
    ]
}