{
    "title": "How to Organize Ideas",
    "url": "https://www.wikihow.com/Organize-Ideas",
    "category_hierarchy": [
        "Education and Communications"
    ],
    "parts": [
        {
            "name": "Making a List",
            "steps": [
                {
                    "headline": "Grab some writing utensils.",
                    "description": "You need to get a visual of what’s occurring in your mind. To do this, it’s best to write down what you’re thinking. Physically creating words with a writing utensil triggers your brain to pay more attention. If you know you’re a spatial learner, finding a whiteboard might be the best place to start organizing your mind. This way you can spread out your thoughts and then sit back and look at them. If you don’t have access to a whiteboard or prefer to work on a small scale, grab a pen or pencil and paper. There’s nothing quite like a good empty notebook."
                },
                {
                    "headline": "Write a to-do list.",
                    "description": "When someone is looking to organize their mind, what they’re looking for is time management. The first step to effectively managing your time is knowing what you need to accomplish. A good place to begin is planning for the week ahead. Brainstorm all the tasks that need to be accomplished. Just jot them down in a random, unorganized list. Write down the tasks as you think of them. Make sure you actually write your list down before entering info into your smartphone. The act of writing, as said above, triggers the brain to pay close attention."
                },
                {
                    "headline": "Organize your to-dos.",
                    "description": "Comb the chaos out of your list of random tasks by grouping tasks by category. Your goals for the week will start to take shape, and you’ll start to see how scattered your thoughts really were. On a new piece of paper or section of whiteboard, write down the names of the categories you’re seeing take shape in your list. Rewrite each task under a category. You can mark off each task from the master list as it is assigned a category so that you don’t repeat tasks. It’s ok if there end up being categories with only one task—at least you are giving these tasks a home."
                },
                {
                    "headline": "Create an outcome list.",
                    "description": "An outcome list is different from a to-do list in that at the top of each day’s to-do list, you have a list of goals, or “outcomes.” Your outcomes are your real goals for the day or week—the to-dos are how you get there. An outcome list will look similar to a to-do list, except at the top of the paper you will have a numbered list of outcomes, and your to-dos won’t be numbered. Number the outcomes according to importance, #1 being the most imperative. For example, you day’s outcomes might be: 1) Finish last month’s project, 2) Have a meaningful lunch with your wife, 3) Blueprints complete. Prioritize your tasks according to desired outcomes. Below the list of outcomes for each day, you’ll list the to-dos that will help you fulfill them. They won’t be numbered, but they’ll be listed in order of importance, perhaps with boxes next to them for checking off. For example, to follow the outcomes in the example in this part, your to-do list for a day might go: clear emails; call Barb; meet with Alex; meet with project team; turn in final project; call wife; go to restaurant; bring in architects; send approval for blueprints."
                },
                {
                    "headline": "Write down ideas.",
                    "description": "When you’re in the midst of your week, you will probably notice ideas rising to the surface. This creativity is being released because you’re managing your time, allowing your brain to use its energy for more than just managing tasks. Write down these ideas under the category of outcomes they fit into. If you don’t put these thoughts down on paper or whiteboard, your brain will use energy to keep the thought alive. Give your mind a break by transcribing your ideas into categories. You won’t stop mulling over the idea, but now that it’s out in the open, you can move on from the initial idea to the next step. If it’s a bad idea in the end, just erase it."
                }
            ]
        },
        {
            "name": "Maintaining Your Schedule",
            "steps": [
                {
                    "headline": "Begin a weekly routine.",
                    "description": "Start a routine of planning out your weekly outcomes on Sunday night. Break down your weekly outcomes into daily outcomes, then list each day’s to-dos beneath them. This way you won’t be running behind as soon as the week starts anymore. Do this planning on paper or whiteboard so you can see what your goals are, rather than trying to tally them all in your mind. The key to an organized mind is writing things down so your brain doesn’t waste energy trying to contain them all."
                },
                {
                    "headline": "Set up a schedule on your phone.",
                    "description": "It’s great to have all your tasks and ideas out on paper, but you need to make them mobile and give them room to grow. Adding them to the calendar in your smart device will make the list an automated part of your life, and will provide a platform for you to easily add to it. If you set an alarm for each task, you will be reminded to stay on schedule."
                },
                {
                    "headline": "Fill out a hard copy of your schedule.",
                    "description": "If you don’t carry a smartphone or tablet, transfer your new outcomes-and-tasks style of mind organization into your planner. For many of us, our smartphones have become our planners, but if you still carry a paper planner, be sure to get one with a big enough space for each day’s tasks. The advantage of a paper planner over a mobile device is that you just flip it open and everything is mapped out. With a smartphone, you’re having to access the calendar from an app, which means it’s easy to ignore your calendar if you feel like it—which will detract from maintaining an organized mind."
                },
                {
                    "headline": "Check off each completed task and outcome.",
                    "description": "At the end of the day when your outcomes have been accomplished, you will feel relieved instead of the way you used to feel—which was probably stressed. There is evidence that the act of creating and crossing off a to-do list relieves the burden on our brains. Writing down your tasks and goals removes that distraction from your mind. If you have not completely finished a task or accomplished an outcome at the end of the day or week, calculate an estimated percent of what has been accomplished and write it on your notepad or planner. Your brain will be able to relax even if the task isn’t fully accomplished in the allotted time."
                }
            ]
        },
        {
            "name": "Being Consistent",
            "steps": [
                {
                    "headline": "Be realistic in your planning.",
                    "description": "It can be fun to set out on paper everything that’s been rattling around in your brain, and it’s good to do that. But when it comes to actually planning out your hours and days, be realistic. Don’t put too many tasks on one day. For example, you could estimate how long each task will take, writing the time beside each one. Then do some basic addition to determine how much time all these to-dos will take. If it’s more than an 8-hour work day, move your outcomes and to-dos around so that you don’t get upset when you can’t fit everything into the hours you planned."
                },
                {
                    "headline": "Stick to your weekly goals.",
                    "description": "Once you have set up a realistic time frame for each to-do on your list, stick to these goals. Be determined to stay on time with your goals. If you get off track by running out of time on a day, re-set your plan for the week to accommodate for the time lost. If that means placing a few outcomes in the following week, so be it. Even if you have to re-plan a little, at least you are sticking to your goals."
                },
                {
                    "headline": "Overcome the temptation to be lazy.",
                    "description": "Don’t procrastinate by rationalizing that you can get done tomorrow what is on your list today—unless you really run out of time. Procrastinating, especially at the beginning of forming a new habit like goal setting and task completion, derails your plans. You will have to keep re-starting, getting frustrated, and you might end up quitting. When you are tempted to procrastinate, promise yourself a reward. Since habits form when the pleasure part of the brain is triggered, set up a reward system for yourself to stay motivated.For example, if you have a long day of tasks ahead, promise yourself a food treat on your way home from work, that you won’t take any work calls when you get home, or that you’ll sleep in the next morning."
                },
                {
                    "headline": "Form the habit of planning.",
                    "description": "Be consistent until this organization method forms part of your life. Being organized requires practice and energy at first, but once you’re used to a new way of thinking, it becomes easy to do. You will be less stressed and your mind will truly start to feel organized. Habits form gradually as we discipline our bodies to new behaviors. Although the idea that it takes a specific number of days to form a habit (like 21 or 28) is a myth, the truth is that our brains do gradually work less to perform the same task once we’ve been doing it a while."
                }
            ]
        },
        {
            "name": "Focusing in the Moment",
            "steps": [
                {
                    "headline": "Shut out distractions for a project.",
                    "description": "To organize your mind for a project right in front of you, you should learn how to tune out distractions. Practice this by placing yourself in an area with distractions while working on a serious project. Start with only a short time in this environment--say 5 minutes--and gradually increase this time duration each day. For example, sit near the television while doing paperwork like homework or work forms. See how long you can tune out the TV before losing focus. Do a little of this exercise each day, trying to go longer without losing focus each time. Eventually your ability to focus will increase and you will feel like your mind is becoming more organized while actively doing projects."
                },
                {
                    "headline": "Ignore distractions in a conversation.",
                    "description": "Paying attention to a conversation shows organization of your mind as well as a desire to be considerate of other people. To practice, have a conversation in a location you know to be distracting, like with the TV on or in a public place. Make an effort to ignore what's going on around you, and gauge how long it takes before you stop listening. Try to have a conversation like this everyday until you have paid attention the entire time. It doesn't have to be the same person everyday. You can have the conversation over the phone, but try not to have it over the internet or text messaging because people in chat settings tend to pause a lot (because they're distracted themselves)."
                },
                {
                    "headline": "Block irrelevant things in a lecture.",
                    "description": "Paying attention to a lecture, whether at school or for progressional development, shows an organized mind. Practice focusing when someone else is talking by attending classes and visiting lectures, even sermons, and making note of how long you listen before letting your thoughts wander. Make an effort to listen longer each time you attend a lecture. Help yourself focus by taking notes. Note taking not only forces your brain to pay close attention, like we said handwriting does in an earlier part of this guide, but it provides a way to visually organize your thoughts."
                },
                {
                    "headline": "Organize your thoughts in a spreadsheet.",
                    "description": "When it's time to make a big decision, it is especially important to have an organized mind. Just like we need schedules to help us with time management, spreadsheets help us organize the big picture so that it's quantifiable. A spreadsheet is basically a big chart of pros and cons, but you should also include columns for qualities and rankings. You can find templates for this type of spreadsheet online. The beauty of a spreadsheet is that you can make it as simple or complicated as you like, and no matter what, it will always look neat and tidy since it's typed. When you're done with your decision spreadsheet, print it out and post it so that you can think about all its aspects and come to a decision you won't regret."
                }
            ]
        }
    ],
    "tyn": [
        "Notepad and pen, or whiteboard and markers.",
        "Smartphone or other device."
    ],
    "text": " Making a List Grab some writing utensils. You need to get a visual of what’s occurring in your mind. To do this, it’s best to write down what you’re thinking. Physically creating words with a writing utensil triggers your brain to pay more attention. If you know you’re a spatial learner, finding a whiteboard might be the best place to start organizing your mind. This way you can spread out your thoughts and then sit back and look at them. If you don’t have access to a whiteboard or prefer to work on a small scale, grab a pen or pencil and paper. There’s nothing quite like a good empty notebook. Write a to-do list. When someone is looking to organize their mind, what they’re looking for is time management. The first step to effectively managing your time is knowing what you need to accomplish. A good place to begin is planning for the week ahead. Brainstorm all the tasks that need to be accomplished. Just jot them down in a random, unorganized list. Write down the tasks as you think of them. Make sure you actually write your list down before entering info into your smartphone. The act of writing, as said above, triggers the brain to pay close attention. Organize your to-dos. Comb the chaos out of your list of random tasks by grouping tasks by category. Your goals for the week will start to take shape, and you’ll start to see how scattered your thoughts really were. On a new piece of paper or section of whiteboard, write down the names of the categories you’re seeing take shape in your list. Rewrite each task under a category. You can mark off each task from the master list as it is assigned a category so that you don’t repeat tasks. It’s ok if there end up being categories with only one task—at least you are giving these tasks a home. Create an outcome list. An outcome list is different from a to-do list in that at the top of each day’s to-do list, you have a list of goals, or “outcomes.” Your outcomes are your real goals for the day or week—the to-dos are how you get there. An outcome list will look similar to a to-do list, except at the top of the paper you will have a numbered list of outcomes, and your to-dos won’t be numbered. Number the outcomes according to importance, #1 being the most imperative. For example, you day’s outcomes might be: 1) Finish last month’s project, 2) Have a meaningful lunch with your wife, 3) Blueprints complete. Prioritize your tasks according to desired outcomes. Below the list of outcomes for each day, you’ll list the to-dos that will help you fulfill them. They won’t be numbered, but they’ll be listed in order of importance, perhaps with boxes next to them for checking off. For example, to follow the outcomes in the example in this part, your to-do list for a day might go: clear emails; call Barb; meet with Alex; meet with project team; turn in final project; call wife; go to restaurant; bring in architects; send approval for blueprints. Write down ideas. When you’re in the midst of your week, you will probably notice ideas rising to the surface. This creativity is being released because you’re managing your time, allowing your brain to use its energy for more than just managing tasks. Write down these ideas under the category of outcomes they fit into. If you don’t put these thoughts down on paper or whiteboard, your brain will use energy to keep the thought alive. Give your mind a break by transcribing your ideas into categories. You won’t stop mulling over the idea, but now that it’s out in the open, you can move on from the initial idea to the next step. If it’s a bad idea in the end, just erase it. Maintaining Your Schedule Begin a weekly routine. Start a routine of planning out your weekly outcomes on Sunday night. Break down your weekly outcomes into daily outcomes, then list each day’s to-dos beneath them. This way you won’t be running behind as soon as the week starts anymore. Do this planning on paper or whiteboard so you can see what your goals are, rather than trying to tally them all in your mind. The key to an organized mind is writing things down so your brain doesn’t waste energy trying to contain them all. Set up a schedule on your phone. It’s great to have all your tasks and ideas out on paper, but you need to make them mobile and give them room to grow. Adding them to the calendar in your smart device will make the list an automated part of your life, and will provide a platform for you to easily add to it. If you set an alarm for each task, you will be reminded to stay on schedule. Fill out a hard copy of your schedule. If you don’t carry a smartphone or tablet, transfer your new outcomes-and-tasks style of mind organization into your planner. For many of us, our smartphones have become our planners, but if you still carry a paper planner, be sure to get one with a big enough space for each day’s tasks. The advantage of a paper planner over a mobile device is that you just flip it open and everything is mapped out. With a smartphone, you’re having to access the calendar from an app, which means it’s easy to ignore your calendar if you feel like it—which will detract from maintaining an organized mind. Check off each completed task and outcome. At the end of the day when your outcomes have been accomplished, you will feel relieved instead of the way you used to feel—which was probably stressed. There is evidence that the act of creating and crossing off a to-do list relieves the burden on our brains. Writing down your tasks and goals removes that distraction from your mind. If you have not completely finished a task or accomplished an outcome at the end of the day or week, calculate an estimated percent of what has been accomplished and write it on your notepad or planner. Your brain will be able to relax even if the task isn’t fully accomplished in the allotted time. Being Consistent Be realistic in your planning. It can be fun to set out on paper everything that’s been rattling around in your brain, and it’s good to do that. But when it comes to actually planning out your hours and days, be realistic. Don’t put too many tasks on one day. For example, you could estimate how long each task will take, writing the time beside each one. Then do some basic addition to determine how much time all these to-dos will take. If it’s more than an 8-hour work day, move your outcomes and to-dos around so that you don’t get upset when you can’t fit everything into the hours you planned. Stick to your weekly goals. Once you have set up a realistic time frame for each to-do on your list, stick to these goals. Be determined to stay on time with your goals. If you get off track by running out of time on a day, re-set your plan for the week to accommodate for the time lost. If that means placing a few outcomes in the following week, so be it. Even if you have to re-plan a little, at least you are sticking to your goals. Overcome the temptation to be lazy. Don’t procrastinate by rationalizing that you can get done tomorrow what is on your list today—unless you really run out of time. Procrastinating, especially at the beginning of forming a new habit like goal setting and task completion, derails your plans. You will have to keep re-starting, getting frustrated, and you might end up quitting. When you are tempted to procrastinate, promise yourself a reward. Since habits form when the pleasure part of the brain is triggered, set up a reward system for yourself to stay motivated.For example, if you have a long day of tasks ahead, promise yourself a food treat on your way home from work, that you won’t take any work calls when you get home, or that you’ll sleep in the next morning. Form the habit of planning. Be consistent until this organization method forms part of your life. Being organized requires practice and energy at first, but once you’re used to a new way of thinking, it becomes easy to do. You will be less stressed and your mind will truly start to feel organized. Habits form gradually as we discipline our bodies to new behaviors. Although the idea that it takes a specific number of days to form a habit (like 21 or 28) is a myth, the truth is that our brains do gradually work less to perform the same task once we’ve been doing it a while. Focusing in the Moment Shut out distractions for a project. To organize your mind for a project right in front of you, you should learn how to tune out distractions. Practice this by placing yourself in an area with distractions while working on a serious project. Start with only a short time in this environment--say 5 minutes--and gradually increase this time duration each day. For example, sit near the television while doing paperwork like homework or work forms. See how long you can tune out the TV before losing focus. Do a little of this exercise each day, trying to go longer without losing focus each time. Eventually your ability to focus will increase and you will feel like your mind is becoming more organized while actively doing projects. Ignore distractions in a conversation. Paying attention to a conversation shows organization of your mind as well as a desire to be considerate of other people. To practice, have a conversation in a location you know to be distracting, like with the TV on or in a public place. Make an effort to ignore what's going on around you, and gauge how long it takes before you stop listening. Try to have a conversation like this everyday until you have paid attention the entire time. It doesn't have to be the same person everyday. You can have the conversation over the phone, but try not to have it over the internet or text messaging because people in chat settings tend to pause a lot (because they're distracted themselves). Block irrelevant things in a lecture. Paying attention to a lecture, whether at school or for progressional development, shows an organized mind. Practice focusing when someone else is talking by attending classes and visiting lectures, even sermons, and making note of how long you listen before letting your thoughts wander. Make an effort to listen longer each time you attend a lecture. Help yourself focus by taking notes. Note taking not only forces your brain to pay close attention, like we said handwriting does in an earlier part of this guide, but it provides a way to visually organize your thoughts. Organize your thoughts in a spreadsheet. When it's time to make a big decision, it is especially important to have an organized mind. Just like we need schedules to help us with time management, spreadsheets help us organize the big picture so that it's quantifiable. A spreadsheet is basically a big chart of pros and cons, but you should also include columns for qualities and rankings. You can find templates for this type of spreadsheet online. The beauty of a spreadsheet is that you can make it as simple or complicated as you like, and no matter what, it will always look neat and tidy since it's typed. When you're done with your decision spreadsheet, print it out and post it so that you can think about all its aspects and come to a decision you won't regret.",
    "sentences": [
        " Making a List Grab some writing utensils.",
        "You need to get a visual of what’s occurring in your mind.",
        "To do this, it’s best to write down what you’re thinking.",
        "Physically creating words with a writing utensil triggers your brain to pay more attention.",
        "If you know you’re a spatial learner, finding a whiteboard might be the best place to start organizing your mind.",
        "This way you can spread out your thoughts and then sit back and look at them.",
        "If you don’t have access to a whiteboard or prefer to work on a small scale, grab a pen or pencil and paper.",
        "There’s nothing quite like a good empty notebook.",
        "Write a to-do list.",
        "When someone is looking to organize their mind, what they’re looking for is time management.",
        "The first step to effectively managing your time is knowing what you need to accomplish.",
        "A good place to begin is planning for the week ahead.",
        "Brainstorm all the tasks that need to be accomplished.",
        "Just jot them down in a random, unorganized list.",
        "Write down the tasks as you think of them.",
        "Make sure you actually write your list down before entering info into your smartphone.",
        "The act of writing, as said above, triggers the brain to pay close attention.",
        "Organize your to-dos.",
        "Comb the chaos out of your list of random tasks by grouping tasks by category.",
        "Your goals for the week will start to take shape, and you’ll start to see how scattered your thoughts really were.",
        "On a new piece of paper or section of whiteboard, write down the names of the categories you’re seeing take shape in your list.",
        "Rewrite each task under a category.",
        "You can mark off each task from the master list as it is assigned a category so that you don’t repeat tasks.",
        "It’s ok if there end up being categories with only one task—at least you are giving these tasks a home.",
        "Create an outcome list.",
        "An outcome list is different from a to-do list in that at the top of each day’s to-do list, you have a list of goals, or “outcomes.” Your outcomes are your real goals for the day or week—the to-dos are how you get there.",
        "An outcome list will look similar to a to-do list, except at the top of the paper you will have a numbered list of outcomes, and your to-dos won’t be numbered.",
        "Number the outcomes according to importance, #1 being the most imperative.",
        "For example, you day’s outcomes might be: 1) Finish last month’s project, 2) Have a meaningful lunch with your wife, 3) Blueprints complete.",
        "Prioritize your tasks according to desired outcomes.",
        "Below the list of outcomes for each day, you’ll list the to-dos that will help you fulfill them.",
        "They won’t be numbered, but they’ll be listed in order of importance, perhaps with boxes next to them for checking off.",
        "For example, to follow the outcomes in the example in this part, your to-do list for a day might go: clear emails; call Barb; meet with Alex; meet with project team; turn in final project; call wife; go to restaurant; bring in architects; send approval for blueprints.",
        "Write down ideas.",
        "When you’re in the midst of your week, you will probably notice ideas rising to the surface.",
        "This creativity is being released because you’re managing your time, allowing your brain to use its energy for more than just managing tasks.",
        "Write down these ideas under the category of outcomes they fit into.",
        "If you don’t put these thoughts down on paper or whiteboard, your brain will use energy to keep the thought alive.",
        "Give your mind a break by transcribing your ideas into categories.",
        "You won’t stop mulling over the idea, but now that it’s out in the open, you can move on from the initial idea to the next step.",
        "If it’s a bad idea in the end, just erase it.",
        "Maintaining Your Schedule Begin a weekly routine.",
        "Start a routine of planning out your weekly outcomes on Sunday night.",
        "Break down your weekly outcomes into daily outcomes, then list each day’s to-dos beneath them.",
        "This way you won’t be running behind as soon as the week starts anymore.",
        "Do this planning on paper or whiteboard so you can see what your goals are, rather than trying to tally them all in your mind.",
        "The key to an organized mind is writing things down so your brain doesn’t waste energy trying to contain them all.",
        "Set up a schedule on your phone.",
        "It’s great to have all your tasks and ideas out on paper, but you need to make them mobile and give them room to grow.",
        "Adding them to the calendar in your smart device will make the list an automated part of your life, and will provide a platform for you to easily add to it.",
        "If you set an alarm for each task, you will be reminded to stay on schedule.",
        "Fill out a hard copy of your schedule.",
        "If you don’t carry a smartphone or tablet, transfer your new outcomes-and-tasks style of mind organization into your planner.",
        "For many of us, our smartphones have become our planners, but if you still carry a paper planner, be sure to get one with a big enough space for each day’s tasks.",
        "The advantage of a paper planner over a mobile device is that you just flip it open and everything is mapped out.",
        "With a smartphone, you’re having to access the calendar from an app, which means it’s easy to ignore your calendar if you feel like it—which will detract from maintaining an organized mind.",
        "Check off each completed task and outcome.",
        "At the end of the day when your outcomes have been accomplished, you will feel relieved instead of the way you used to feel—which was probably stressed.",
        "There is evidence that the act of creating and crossing off a to-do list relieves the burden on our brains.",
        "Writing down your tasks and goals removes that distraction from your mind.",
        "If you have not completely finished a task or accomplished an outcome at the end of the day or week, calculate an estimated percent of what has been accomplished and write it on your notepad or planner.",
        "Your brain will be able to relax even if the task isn’t fully accomplished in the allotted time.",
        "Being Consistent Be realistic in your planning.",
        "It can be fun to set out on paper everything that’s been rattling around in your brain, and it’s good to do that.",
        "But when it comes to actually planning out your hours and days, be realistic.",
        "Don’t put too many tasks on one day.",
        "For example, you could estimate how long each task will take, writing the time beside each one.",
        "Then do some basic addition to determine how much time all these to-dos will take.",
        "If it’s more than an 8-hour work day, move your outcomes and to-dos around so that you don’t get upset when you can’t fit everything into the hours you planned.",
        "Stick to your weekly goals.",
        "Once you have set up a realistic time frame for each to-do on your list, stick to these goals.",
        "Be determined to stay on time with your goals.",
        "If you get off track by running out of time on a day, re-set your plan for the week to accommodate for the time lost.",
        "If that means placing a few outcomes in the following week, so be it.",
        "Even if you have to re-plan a little, at least you are sticking to your goals.",
        "Overcome the temptation to be lazy.",
        "Don’t procrastinate by rationalizing that you can get done tomorrow what is on your list today—unless you really run out of time.",
        "Procrastinating, especially at the beginning of forming a new habit like goal setting and task completion, derails your plans.",
        "You will have to keep re-starting, getting frustrated, and you might end up quitting.",
        "When you are tempted to procrastinate, promise yourself a reward.",
        "Since habits form when the pleasure part of the brain is triggered, set up a reward system for yourself to stay motivated.For example, if you have a long day of tasks ahead, promise yourself a food treat on your way home from work, that you won’t take any work calls when you get home, or that you’ll sleep in the next morning.",
        "Form the habit of planning.",
        "Be consistent until this organization method forms part of your life.",
        "Being organized requires practice and energy at first, but once you’re used to a new way of thinking, it becomes easy to do.",
        "You will be less stressed and your mind will truly start to feel organized.",
        "Habits form gradually as we discipline our bodies to new behaviors.",
        "Although the idea that it takes a specific number of days to form a habit (like 21 or 28) is a myth, the truth is that our brains do gradually work less to perform the same task once we’ve been doing it a while.",
        "Focusing in the Moment Shut out distractions for a project.",
        "To organize your mind for a project right in front of you, you should learn how to tune out distractions.",
        "Practice this by placing yourself in an area with distractions while working on a serious project.",
        "Start with only a short time in this environment--say 5 minutes--and gradually increase this time duration each day.",
        "For example, sit near the television while doing paperwork like homework or work forms.",
        "See how long you can tune out the TV before losing focus.",
        "Do a little of this exercise each day, trying to go longer without losing focus each time.",
        "Eventually your ability to focus will increase and you will feel like your mind is becoming more organized while actively doing projects.",
        "Ignore distractions in a conversation.",
        "Paying attention to a conversation shows organization of your mind as well as a desire to be considerate of other people.",
        "To practice, have a conversation in a location you know to be distracting, like with the TV on or in a public place.",
        "Make an effort to ignore what's going on around you, and gauge how long it takes before you stop listening.",
        "Try to have a conversation like this everyday until you have paid attention the entire time.",
        "It doesn't have to be the same person everyday.",
        "You can have the conversation over the phone, but try not to have it over the internet or text messaging because people in chat settings tend to pause a lot (because they're distracted themselves).",
        "Block irrelevant things in a lecture.",
        "Paying attention to a lecture, whether at school or for progressional development, shows an organized mind.",
        "Practice focusing when someone else is talking by attending classes and visiting lectures, even sermons, and making note of how long you listen before letting your thoughts wander.",
        "Make an effort to listen longer each time you attend a lecture.",
        "Help yourself focus by taking notes.",
        "Note taking not only forces your brain to pay close attention, like we said handwriting does in an earlier part of this guide, but it provides a way to visually organize your thoughts.",
        "Organize your thoughts in a spreadsheet.",
        "When it's time to make a big decision, it is especially important to have an organized mind.",
        "Just like we need schedules to help us with time management, spreadsheets help us organize the big picture so that it's quantifiable.",
        "A spreadsheet is basically a big chart of pros and cons, but you should also include columns for qualities and rankings.",
        "You can find templates for this type of spreadsheet online.",
        "The beauty of a spreadsheet is that you can make it as simple or complicated as you like, and no matter what, it will always look neat and tidy since it's typed.",
        "When you're done with your decision spreadsheet, print it out and post it so that you can think about all its aspects and come to a decision you won't regret."
    ]
}