{
    "title": "How to Make Rainbow Cookies",
    "url": "https://www.wikihow.com/Make-Rainbow-Cookies",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking",
        "Cookies and Biscuits",
        "Sugar Cookies and Biscuits"
    ],
    "parts": [
        {
            "name": "Preparing the Pans and Beating the Egg Whites",
            "steps": [
                {
                    "headline": "Preheat the oven and arrange the oven racks.",
                    "description": "To be certain the the oven is warm enough when you bake the cookie layers, it’s important to preheat the oven. Set the temperature to 350 degrees Fahrenheit (180 degrees Celsius) and allow it to heat. Position the oven racks in the upper and lower thirds of the oven as well. Be aware of how your oven indicates that it’s preheated to the desired temperature. An indicator light may flash or a beep may sound for most models."
                },
                {
                    "headline": "Line and grease the baking sheets.",
                    "description": "To make the cookies, you’ll need 3 13-inch by 9-inch by 2-inch (33-cm x 23-cm x 5-cm) metal baking sheets. Line all of them with foil, leaving some to overhang the edge. Next, grease all of the foil and edges of the pan with 2 tablespoons (28 g) of unsalted butter that’s been softened to room temperature. You can use parchment paper instead of the foil if you prefer."
                },
                {
                    "headline": "Beat the egg whites until soft peaks form.",
                    "description": "Place the whites from 6 large eggs in the bowl for a stand mixer. Attach the wire whisk, and beat at medium-high speed until soft peaks form. It should take approximately 2 to 3 minutes. You’ll know that soft peaks have formed in the egg whites when you turn the whisk upside down and peaks form that flop over slightly."
                },
                {
                    "headline": "Add the sugar and beat until stiff peaks form.",
                    "description": "Once the egg whites have formed soft peaks, slowly add ⅓ cup (66 g) of sugar to the bowl, and continue beating on medium-high until stiff peaks form. You’ll know that stiff peaks have formed when you turn the whisk upside down and the peaks stand without collapsing."
                },
                {
                    "headline": "Refrigerate the egg white mixture.",
                    "description": "Once the egg white and sugar mixture is thick enough, transfer it to a large bowl. Place it in the refrigerator and allow it to chill while you work on the rest of the batter. Use a sheet of plastic wrap over the top of the bowl to cover the egg white mixture."
                }
            ]
        },
        {
            "name": "Making the Batter",
            "steps": [
                {
                    "headline": "Blend the almond paste and the remaining sugar.",
                    "description": "With the stand mixer fitted with the paddle attachment, combine 12 oz. (340 g) of almond paste that’s been chopped with the remaining 1 cup (200 g) of sugar on medium low. Mix the two ingredients until they are well incorporated, which should take approximately 4 to 5 minutes. Make sure that you’re using almond paste and not marzipan. Almond paste has a coarser texture and isn’t as sweet as marzipan."
                },
                {
                    "headline": "Mix in the remaining butter.",
                    "description": "Once the almond paste and sugar are well blended, turn the stand mixer’s speed up to medium-high and gradually add 2 cups (453 g) of unsalted butter that’s been softened to room temperature. Beat the mixture for 2 to 3 minutes or until it becomes fluffy. The best way to soften butter to room temperature is to cut it into pieces and leave it out on the counter or table for approximately 30 minutes. When you touch it with your finger and it leaves a small indentation, it’s softened enough."
                },
                {
                    "headline": "Beat in the egg yolks, flour, and salt.",
                    "description": "When the almond paste, sugar, and butter mixture is light and fluffy, keep the mixer on medium-high and mix in the yolks from 6 eggs until well combined. Next, stir in 2 ¾ cups plus 1 tablespoon (344 g plus 8.5 g) of all-purpose flour, ½ teaspoon (1.5 g) kosher salt, and 1 teaspoon (5.69 g) salt, and beat until all of the ingredients are well incorporated."
                },
                {
                    "headline": "Fold in the egg whites.",
                    "description": "Remove the bowl from the stand mixer, and take the egg white mixture out of the refrigerator. Use a spatula to fold half of the egg white mixture into the rest of the batter. When it’s fully incorporated, fold in the other half of the egg whites and mix until completely blended. It’s best to use a spatula with a wide, flexible blade when you’re folding in the egg white mixture. That allows you to move more of the batter at a time while still keeping your motion gentle, so you can work more quickly."
                },
                {
                    "headline": "Divide the batter between three bowls and color it.",
                    "description": "Once the egg white mixture is fully incorporated, divide the batter evenly among three bowls. In one of the bowls, stir in 1 teaspoon (5 ml) red food coloring to color the batter red. In a second bowl, stir in 1 teaspoon (5 ml) green food coloring to color the batter green. Leave the third bowl alone to create plain batter. You can use paste or powder food coloring in place of the liquid. Just make sure to consult the packaging to see how much of the formula you should add. It’s best to start with just a little and add more if necessary. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMathew Rice\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Baker & Dessert Influencer\t\t\t\t\t\t\t\tMathew Rice has worked in restaurant pastry kitchens across the country since the late 1990's. His creations have been featured in Food & Wine, Bon Appetit, and Martha Stewart Weddings. In 2016, Eater named Mathew one of the top 18 chefs to follow on Instagram. Mathew Rice\t\t\tProfessional Baker & Dessert Influencer\t\t\t\tMathew Rice recommends using gel food coloring. \"With liquid food coloring, you typically have to use a lot of it. Then, if you're adding a lot more liquid to your frosting, you're thinning it out by doing so! I like gel pastes because it's just a lot more concentrated. One tiny little drop is going to be enough to tint whatever you're making, and that way you're not adding any more liquid to it.\""
                }
            ]
        },
        {
            "name": "Baking the Layers",
            "steps": [
                {
                    "headline": "Spread each color batter into individual pans.",
                    "description": "Take the 3 pans that you lined with foil and greased earlier, and use one pan for each color of batter. Transfer the batter to the pan, and spread it to the edges with an offset spatula that’s been dipped in water. Run the spatula across the top of the batter as well to ensure that it’s smooth. If you don’t have an offset spatula, you can use a regular spatula or a butter knife. It just might be more difficult when you get along the edges of the pan."
                },
                {
                    "headline": "Bake the layers for 9 to 11 minutes, rotating halfway through.",
                    "description": "Place the pans in the preheated oven, and allow them to bake for 8 to 10 minutes or until the edges just begin to pull away from the sides of the pan. Approximately halfway through the baking process, though, rotate the pans to ensure that they bake evenly. Depending on how large your oven is, all three pans may not fit in at the same time. If that’s the case, just bake them in batches."
                },
                {
                    "headline": "Allow the layers to cool in the pans and then on a rack.",
                    "description": "When the cakes are finished baking, remove them from the oven. Let them cool in the pans for approximately 25 to 30 minutes. When they’re cool enough to handle, use the hangover edge of the foil to carefully remove each cake from its pan and place it on a cooling rack right side up to cool completely."
                }
            ]
        },
        {
            "name": "Assembling the Cookies",
            "steps": [
                {
                    "headline": "Brush half of the orange marmalade over the green cake.",
                    "description": "Once the cakes are completely cooled, take the green cake and spread half of ¾ cup orange (248 g) marmalade that’s been heated and strained over it. Use a pastry brush to ensure that the marmalade reaches the edges of the cake. If you don’t have a pastry brush, you can use a butter knife to spread the marmalade across the cake."
                },
                {
                    "headline": "Place the plain cake layer on the green cake and spread the rest of the marmalade over it.",
                    "description": "After the green cake is covered with marmalade, take the plain cake and place it on top of the green. Use the rest of the orange marmalade to cover the top of the plain cake just as you did with the green cake. Make sure that you place the plain cake on top of the green cake right side up."
                },
                {
                    "headline": "Set the red cake on the plain cake and cover it with foil.",
                    "description": "With the green and plain layers covered in marmalade and in place, take the red cake and place it on top of the plain cake. Next, use a piece of foil to cover the top of the cake. You can use plastic wrap instead of the foil if you prefer. You don’t have to wrap the foil all the way around the cake. Just make sure that the top of it is protected."
                },
                {
                    "headline": "Place a pan over the layers and weigh it down before refrigerating.",
                    "description": "With the foil over the top of the cake layers, take one of the pans that you used to bake the layers and place it on top of the foil. Use some heavy canned food or other items from around the house to weigh down the pan and compress the cakes layers. Place the weighted down cake layers in the refrigerator for at least 4 hours. Make sure that the pan that you place on top of the cake layers is completely cool. While the cake can set up in 4 hours, you can leave it in the refrigerator overnight to firm it up even further."
                }
            ]
        },
        {
            "name": "Forming the Cookies",
            "steps": [
                {
                    "headline": "Remove the cake from the refrigerator and uncover.",
                    "description": "After the layers have had enough time to set up in the refrigerator, take it out. Take off the weights and the pan, and pull the foil away from the cake."
                },
                {
                    "headline": "Spread half of the melted chocolate over the cake and freeze briefly.",
                    "description": "Take 4 ounces (112 g) of bittersweet chocolate that’s been melted, and spread half of it over the top of the cake in a thin layer. Place the cake in the freezer for 10 minutes to allow the chocolate to harden. The best way to melt the chocolate is to place it in a heatproof bowl and set it over a pan of simmering water. Heat it until it melts, stirring regularly."
                },
                {
                    "headline": "Flip the cake over and cover with the rest of the chocolate before chilling.",
                    "description": "After the chocolate has hardened on top of the cake, take it out of the freezer and cover it with waxed paper. Place a baking sheet over it, and flip the cake over. Spread the rest of the melted chocolate over the bottom of the cake and freeze for another 10 minutes. If you want to give the tops of the cookies a decorative look, use a fork to scrape wavy lines through the chocolate before placing it in the freezer."
                },
                {
                    "headline": "Trim the cake and cut into cookies.",
                    "description": "After the top layer of chocolate has hardened, use a sharp knife to trim the cake down to 12-inches by 8-inches (30-cm by 20-cm). Next, cut the cake crosswise into 6 2-inch (5-cm) wide strips.Use the knife to divide the stripes crosswise to form 96 ½-inch (1.2 cm) wide cookies. When you store the cookies, make sure to place them in an airtight container.They can last up to a week."
                }
            ]
        }
    ],
    "tyn": [
        "3 13x9x2 inch (33-cm x 23-cm x 5-cm) metal baking sheets",
        "Foil",
        "A stand mixer",
        "A large bowl",
        "A spatula",
        "3 medium bowls",
        "A whisk or wooden spoon",
        "An offset spatula",
        "Cooling racks",
        "A pastry brush",
        "Several heavy cans",
        "A knife"
    ],
    "text": " Preparing the Pans and Beating the Egg Whites Preheat the oven and arrange the oven racks. To be certain the the oven is warm enough when you bake the cookie layers, it’s important to preheat the oven. Set the temperature to 350 degrees Fahrenheit (180 degrees Celsius) and allow it to heat. Position the oven racks in the upper and lower thirds of the oven as well. Be aware of how your oven indicates that it’s preheated to the desired temperature. An indicator light may flash or a beep may sound for most models. Line and grease the baking sheets. To make the cookies, you’ll need 3 13-inch by 9-inch by 2-inch (33-cm x 23-cm x 5-cm) metal baking sheets. Line all of them with foil, leaving some to overhang the edge. Next, grease all of the foil and edges of the pan with 2 tablespoons (28 g) of unsalted butter that’s been softened to room temperature. You can use parchment paper instead of the foil if you prefer. Beat the egg whites until soft peaks form. Place the whites from 6 large eggs in the bowl for a stand mixer. Attach the wire whisk, and beat at medium-high speed until soft peaks form. It should take approximately 2 to 3 minutes. You’ll know that soft peaks have formed in the egg whites when you turn the whisk upside down and peaks form that flop over slightly. Add the sugar and beat until stiff peaks form. Once the egg whites have formed soft peaks, slowly add ⅓ cup (66 g) of sugar to the bowl, and continue beating on medium-high until stiff peaks form. You’ll know that stiff peaks have formed when you turn the whisk upside down and the peaks stand without collapsing. Refrigerate the egg white mixture. Once the egg white and sugar mixture is thick enough, transfer it to a large bowl. Place it in the refrigerator and allow it to chill while you work on the rest of the batter. Use a sheet of plastic wrap over the top of the bowl to cover the egg white mixture. Making the Batter Blend the almond paste and the remaining sugar. With the stand mixer fitted with the paddle attachment, combine 12 oz. (340 g) of almond paste that’s been chopped with the remaining 1 cup (200 g) of sugar on medium low. Mix the two ingredients until they are well incorporated, which should take approximately 4 to 5 minutes. Make sure that you’re using almond paste and not marzipan. Almond paste has a coarser texture and isn’t as sweet as marzipan. Mix in the remaining butter. Once the almond paste and sugar are well blended, turn the stand mixer’s speed up to medium-high and gradually add 2 cups (453 g) of unsalted butter that’s been softened to room temperature. Beat the mixture for 2 to 3 minutes or until it becomes fluffy. The best way to soften butter to room temperature is to cut it into pieces and leave it out on the counter or table for approximately 30 minutes. When you touch it with your finger and it leaves a small indentation, it’s softened enough. Beat in the egg yolks, flour, and salt. When the almond paste, sugar, and butter mixture is light and fluffy, keep the mixer on medium-high and mix in the yolks from 6 eggs until well combined. Next, stir in 2 ¾ cups plus 1 tablespoon (344 g plus 8.5 g) of all-purpose flour, ½ teaspoon (1.5 g) kosher salt, and 1 teaspoon (5.69 g) salt, and beat until all of the ingredients are well incorporated. Fold in the egg whites. Remove the bowl from the stand mixer, and take the egg white mixture out of the refrigerator. Use a spatula to fold half of the egg white mixture into the rest of the batter. When it’s fully incorporated, fold in the other half of the egg whites and mix until completely blended. It’s best to use a spatula with a wide, flexible blade when you’re folding in the egg white mixture. That allows you to move more of the batter at a time while still keeping your motion gentle, so you can work more quickly. Divide the batter between three bowls and color it. Once the egg white mixture is fully incorporated, divide the batter evenly among three bowls. In one of the bowls, stir in 1 teaspoon (5 ml) red food coloring to color the batter red. In a second bowl, stir in 1 teaspoon (5 ml) green food coloring to color the batter green. Leave the third bowl alone to create plain batter. You can use paste or powder food coloring in place of the liquid. Just make sure to consult the packaging to see how much of the formula you should add. It’s best to start with just a little and add more if necessary. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMathew Rice\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Baker & Dessert Influencer\t\t\t\t\t\t\t\tMathew Rice has worked in restaurant pastry kitchens across the country since the late 1990's. His creations have been featured in Food & Wine, Bon Appetit, and Martha Stewart Weddings. In 2016, Eater named Mathew one of the top 18 chefs to follow on Instagram. Mathew Rice\t\t\tProfessional Baker & Dessert Influencer\t\t\t\tMathew Rice recommends using gel food coloring. \"With liquid food coloring, you typically have to use a lot of it. Then, if you're adding a lot more liquid to your frosting, you're thinning it out by doing so! I like gel pastes because it's just a lot more concentrated. One tiny little drop is going to be enough to tint whatever you're making, and that way you're not adding any more liquid to it.\" Baking the Layers Spread each color batter into individual pans. Take the 3 pans that you lined with foil and greased earlier, and use one pan for each color of batter. Transfer the batter to the pan, and spread it to the edges with an offset spatula that’s been dipped in water. Run the spatula across the top of the batter as well to ensure that it’s smooth. If you don’t have an offset spatula, you can use a regular spatula or a butter knife. It just might be more difficult when you get along the edges of the pan. Bake the layers for 9 to 11 minutes, rotating halfway through. Place the pans in the preheated oven, and allow them to bake for 8 to 10 minutes or until the edges just begin to pull away from the sides of the pan. Approximately halfway through the baking process, though, rotate the pans to ensure that they bake evenly. Depending on how large your oven is, all three pans may not fit in at the same time. If that’s the case, just bake them in batches. Allow the layers to cool in the pans and then on a rack. When the cakes are finished baking, remove them from the oven. Let them cool in the pans for approximately 25 to 30 minutes. When they’re cool enough to handle, use the hangover edge of the foil to carefully remove each cake from its pan and place it on a cooling rack right side up to cool completely. Assembling the Cookies Brush half of the orange marmalade over the green cake. Once the cakes are completely cooled, take the green cake and spread half of ¾ cup orange (248 g) marmalade that’s been heated and strained over it. Use a pastry brush to ensure that the marmalade reaches the edges of the cake. If you don’t have a pastry brush, you can use a butter knife to spread the marmalade across the cake. Place the plain cake layer on the green cake and spread the rest of the marmalade over it. After the green cake is covered with marmalade, take the plain cake and place it on top of the green. Use the rest of the orange marmalade to cover the top of the plain cake just as you did with the green cake. Make sure that you place the plain cake on top of the green cake right side up. Set the red cake on the plain cake and cover it with foil. With the green and plain layers covered in marmalade and in place, take the red cake and place it on top of the plain cake. Next, use a piece of foil to cover the top of the cake. You can use plastic wrap instead of the foil if you prefer. You don’t have to wrap the foil all the way around the cake. Just make sure that the top of it is protected. Place a pan over the layers and weigh it down before refrigerating. With the foil over the top of the cake layers, take one of the pans that you used to bake the layers and place it on top of the foil. Use some heavy canned food or other items from around the house to weigh down the pan and compress the cakes layers. Place the weighted down cake layers in the refrigerator for at least 4 hours. Make sure that the pan that you place on top of the cake layers is completely cool. While the cake can set up in 4 hours, you can leave it in the refrigerator overnight to firm it up even further. Forming the Cookies Remove the cake from the refrigerator and uncover. After the layers have had enough time to set up in the refrigerator, take it out. Take off the weights and the pan, and pull the foil away from the cake. Spread half of the melted chocolate over the cake and freeze briefly. Take 4 ounces (112 g) of bittersweet chocolate that’s been melted, and spread half of it over the top of the cake in a thin layer. Place the cake in the freezer for 10 minutes to allow the chocolate to harden. The best way to melt the chocolate is to place it in a heatproof bowl and set it over a pan of simmering water. Heat it until it melts, stirring regularly. Flip the cake over and cover with the rest of the chocolate before chilling. After the chocolate has hardened on top of the cake, take it out of the freezer and cover it with waxed paper. Place a baking sheet over it, and flip the cake over. Spread the rest of the melted chocolate over the bottom of the cake and freeze for another 10 minutes. If you want to give the tops of the cookies a decorative look, use a fork to scrape wavy lines through the chocolate before placing it in the freezer. Trim the cake and cut into cookies. After the top layer of chocolate has hardened, use a sharp knife to trim the cake down to 12-inches by 8-inches (30-cm by 20-cm). Next, cut the cake crosswise into 6 2-inch (5-cm) wide strips.Use the knife to divide the stripes crosswise to form 96 ½-inch (1.2 cm) wide cookies. When you store the cookies, make sure to place them in an airtight container.They can last up to a week.",
    "sentences": [
        " Preparing the Pans and Beating the Egg Whites Preheat the oven and arrange the oven racks.",
        "To be certain the the oven is warm enough when you bake the cookie layers, it’s important to preheat the oven.",
        "Set the temperature to 350 degrees Fahrenheit (180 degrees Celsius) and allow it to heat.",
        "Position the oven racks in the upper and lower thirds of the oven as well.",
        "Be aware of how your oven indicates that it’s preheated to the desired temperature.",
        "An indicator light may flash or a beep may sound for most models.",
        "Line and grease the baking sheets.",
        "To make the cookies, you’ll need 3 13-inch by 9-inch by 2-inch (33-cm x 23-cm x 5-cm) metal baking sheets.",
        "Line all of them with foil, leaving some to overhang the edge.",
        "Next, grease all of the foil and edges of the pan with 2 tablespoons (28 g) of unsalted butter that’s been softened to room temperature.",
        "You can use parchment paper instead of the foil if you prefer.",
        "Beat the egg whites until soft peaks form.",
        "Place the whites from 6 large eggs in the bowl for a stand mixer.",
        "Attach the wire whisk, and beat at medium-high speed until soft peaks form.",
        "It should take approximately 2 to 3 minutes.",
        "You’ll know that soft peaks have formed in the egg whites when you turn the whisk upside down and peaks form that flop over slightly.",
        "Add the sugar and beat until stiff peaks form.",
        "Once the egg whites have formed soft peaks, slowly add ⅓ cup (66 g) of sugar to the bowl, and continue beating on medium-high until stiff peaks form.",
        "You’ll know that stiff peaks have formed when you turn the whisk upside down and the peaks stand without collapsing.",
        "Refrigerate the egg white mixture.",
        "Once the egg white and sugar mixture is thick enough, transfer it to a large bowl.",
        "Place it in the refrigerator and allow it to chill while you work on the rest of the batter.",
        "Use a sheet of plastic wrap over the top of the bowl to cover the egg white mixture.",
        "Making the Batter Blend the almond paste and the remaining sugar.",
        "With the stand mixer fitted with the paddle attachment, combine 12 oz.",
        "(340 g) of almond paste that’s been chopped with the remaining 1 cup (200 g) of sugar on medium low.",
        "Mix the two ingredients until they are well incorporated, which should take approximately 4 to 5 minutes.",
        "Make sure that you’re using almond paste and not marzipan.",
        "Almond paste has a coarser texture and isn’t as sweet as marzipan.",
        "Mix in the remaining butter.",
        "Once the almond paste and sugar are well blended, turn the stand mixer’s speed up to medium-high and gradually add 2 cups (453 g) of unsalted butter that’s been softened to room temperature.",
        "Beat the mixture for 2 to 3 minutes or until it becomes fluffy.",
        "The best way to soften butter to room temperature is to cut it into pieces and leave it out on the counter or table for approximately 30 minutes.",
        "When you touch it with your finger and it leaves a small indentation, it’s softened enough.",
        "Beat in the egg yolks, flour, and salt.",
        "When the almond paste, sugar, and butter mixture is light and fluffy, keep the mixer on medium-high and mix in the yolks from 6 eggs until well combined.",
        "Next, stir in 2 ¾ cups plus 1 tablespoon (344 g plus 8.5 g) of all-purpose flour, ½ teaspoon (1.5 g) kosher salt, and 1 teaspoon (5.69 g) salt, and beat until all of the ingredients are well incorporated.",
        "Fold in the egg whites.",
        "Remove the bowl from the stand mixer, and take the egg white mixture out of the refrigerator.",
        "Use a spatula to fold half of the egg white mixture into the rest of the batter.",
        "When it’s fully incorporated, fold in the other half of the egg whites and mix until completely blended.",
        "It’s best to use a spatula with a wide, flexible blade when you’re folding in the egg white mixture.",
        "That allows you to move more of the batter at a time while still keeping your motion gentle, so you can work more quickly.",
        "Divide the batter between three bowls and color it.",
        "Once the egg white mixture is fully incorporated, divide the batter evenly among three bowls.",
        "In one of the bowls, stir in 1 teaspoon (5 ml) red food coloring to color the batter red.",
        "In a second bowl, stir in 1 teaspoon (5 ml) green food coloring to color the batter green.",
        "Leave the third bowl alone to create plain batter.",
        "You can use paste or powder food coloring in place of the liquid.",
        "Just make sure to consult the packaging to see how much of the formula you should add.",
        "It’s best to start with just a little and add more if necessary.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMathew Rice\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Baker & Dessert Influencer\t\t\t\t\t\t\t\tMathew Rice has worked in restaurant pastry kitchens across the country since the late 1990's.",
        "His creations have been featured in Food & Wine, Bon Appetit, and Martha Stewart Weddings.",
        "In 2016, Eater named Mathew one of the top 18 chefs to follow on Instagram.",
        "Mathew Rice\t\t\tProfessional Baker & Dessert Influencer\t\t\t\tMathew Rice recommends using gel food coloring.",
        "\"With liquid food coloring, you typically have to use a lot of it.",
        "Then, if you're adding a lot more liquid to your frosting, you're thinning it out by doing so!",
        "I like gel pastes because it's just a lot more concentrated.",
        "One tiny little drop is going to be enough to tint whatever you're making, and that way you're not adding any more liquid to it.\"",
        "Baking the Layers Spread each color batter into individual pans.",
        "Take the 3 pans that you lined with foil and greased earlier, and use one pan for each color of batter.",
        "Transfer the batter to the pan, and spread it to the edges with an offset spatula that’s been dipped in water.",
        "Run the spatula across the top of the batter as well to ensure that it’s smooth.",
        "If you don’t have an offset spatula, you can use a regular spatula or a butter knife.",
        "It just might be more difficult when you get along the edges of the pan.",
        "Bake the layers for 9 to 11 minutes, rotating halfway through.",
        "Place the pans in the preheated oven, and allow them to bake for 8 to 10 minutes or until the edges just begin to pull away from the sides of the pan.",
        "Approximately halfway through the baking process, though, rotate the pans to ensure that they bake evenly.",
        "Depending on how large your oven is, all three pans may not fit in at the same time.",
        "If that’s the case, just bake them in batches.",
        "Allow the layers to cool in the pans and then on a rack.",
        "When the cakes are finished baking, remove them from the oven.",
        "Let them cool in the pans for approximately 25 to 30 minutes.",
        "When they’re cool enough to handle, use the hangover edge of the foil to carefully remove each cake from its pan and place it on a cooling rack right side up to cool completely.",
        "Assembling the Cookies Brush half of the orange marmalade over the green cake.",
        "Once the cakes are completely cooled, take the green cake and spread half of ¾ cup orange (248 g) marmalade that’s been heated and strained over it.",
        "Use a pastry brush to ensure that the marmalade reaches the edges of the cake.",
        "If you don’t have a pastry brush, you can use a butter knife to spread the marmalade across the cake.",
        "Place the plain cake layer on the green cake and spread the rest of the marmalade over it.",
        "After the green cake is covered with marmalade, take the plain cake and place it on top of the green.",
        "Use the rest of the orange marmalade to cover the top of the plain cake just as you did with the green cake.",
        "Make sure that you place the plain cake on top of the green cake right side up.",
        "Set the red cake on the plain cake and cover it with foil.",
        "With the green and plain layers covered in marmalade and in place, take the red cake and place it on top of the plain cake.",
        "Next, use a piece of foil to cover the top of the cake.",
        "You can use plastic wrap instead of the foil if you prefer.",
        "You don’t have to wrap the foil all the way around the cake.",
        "Just make sure that the top of it is protected.",
        "Place a pan over the layers and weigh it down before refrigerating.",
        "With the foil over the top of the cake layers, take one of the pans that you used to bake the layers and place it on top of the foil.",
        "Use some heavy canned food or other items from around the house to weigh down the pan and compress the cakes layers.",
        "Place the weighted down cake layers in the refrigerator for at least 4 hours.",
        "Make sure that the pan that you place on top of the cake layers is completely cool.",
        "While the cake can set up in 4 hours, you can leave it in the refrigerator overnight to firm it up even further.",
        "Forming the Cookies Remove the cake from the refrigerator and uncover.",
        "After the layers have had enough time to set up in the refrigerator, take it out.",
        "Take off the weights and the pan, and pull the foil away from the cake.",
        "Spread half of the melted chocolate over the cake and freeze briefly.",
        "Take 4 ounces (112 g) of bittersweet chocolate that’s been melted, and spread half of it over the top of the cake in a thin layer.",
        "Place the cake in the freezer for 10 minutes to allow the chocolate to harden.",
        "The best way to melt the chocolate is to place it in a heatproof bowl and set it over a pan of simmering water.",
        "Heat it until it melts, stirring regularly.",
        "Flip the cake over and cover with the rest of the chocolate before chilling.",
        "After the chocolate has hardened on top of the cake, take it out of the freezer and cover it with waxed paper.",
        "Place a baking sheet over it, and flip the cake over.",
        "Spread the rest of the melted chocolate over the bottom of the cake and freeze for another 10 minutes.",
        "If you want to give the tops of the cookies a decorative look, use a fork to scrape wavy lines through the chocolate before placing it in the freezer.",
        "Trim the cake and cut into cookies.",
        "After the top layer of chocolate has hardened, use a sharp knife to trim the cake down to 12-inches by 8-inches (30-cm by 20-cm).",
        "Next, cut the cake crosswise into 6 2-inch (5-cm) wide strips.Use the knife to divide the stripes crosswise to form 96 ½-inch (1.2 cm) wide cookies.",
        "When you store the cookies, make sure to place them in an airtight container.They can last up to a week."
    ]
}