{
    "title": "How to Clean a Violin Bow",
    "url": "https://www.wikihow.com/Clean-a-Violin-Bow",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music",
        "Musical Instruments",
        "String Instruments"
    ],
    "steps": [
        {
            "headline": "After you're done playing, loosen the bow and wipe of the stick with a soft, lint-free cloth.",
            "description": "Loosening the bow helps prevent warping while it's in the case."
        },
        {
            "headline": "Sometimes, just a simple wipe down isn't enough.",
            "description": "Occasionally, you will need to clean the hair of your bow. To do this, loosen the screw on the end of the frog and take the bow hair away from the stick."
        },
        {
            "headline": "Take a small amount of denatured alcohol and, using a soft toothbrush, gently brush the hair lengthwise.",
            "description": "Especially focus on dirtier areas."
        },
        {
            "headline": "Hang the bow to dry in such a way that the hair is not touching the stick.",
            "description": ""
        },
        {
            "headline": "Put the bow back together, tighten the strings, and rosin well.",
            "description": ""
        }
    ],
    "tyn": [
        "small amount of denatured alcohol",
        "container",
        "toothbrush",
        "bow",
        "soft cloths"
    ],
    "text": " After you're done playing, loosen the bow and wipe of the stick with a soft, lint-free cloth. Loosening the bow helps prevent warping while it's in the case. Sometimes, just a simple wipe down isn't enough. Occasionally, you will need to clean the hair of your bow. To do this, loosen the screw on the end of the frog and take the bow hair away from the stick. Take a small amount of denatured alcohol and, using a soft toothbrush, gently brush the hair lengthwise. Especially focus on dirtier areas. Hang the bow to dry in such a way that the hair is not touching the stick.  Put the bow back together, tighten the strings, and rosin well. ",
    "sentences": [
        " After you're done playing, loosen the bow and wipe of the stick with a soft, lint-free cloth.",
        "Loosening the bow helps prevent warping while it's in the case.",
        "Sometimes, just a simple wipe down isn't enough.",
        "Occasionally, you will need to clean the hair of your bow.",
        "To do this, loosen the screw on the end of the frog and take the bow hair away from the stick.",
        "Take a small amount of denatured alcohol and, using a soft toothbrush, gently brush the hair lengthwise.",
        "Especially focus on dirtier areas.",
        "Hang the bow to dry in such a way that the hair is not touching the stick.",
        "Put the bow back together, tighten the strings, and rosin well."
    ]
}