{
    "title": "How to Make Fish Curry",
    "url": "https://www.wikihow.com/Make-Fish-Curry",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fish and Seafood"
    ],
    "methods": [
        {
            "name": "Making a Quick and Easy Fish Curry",
            "steps": [
                {
                    "headline": "Sauté the onion and garlic over medium heat for 5 minutes.",
                    "description": "Heat the oil in a large skillet over medium heat for 2 to 3 minutes. Then, add the chopped onion and minced garlic to the pan. Stir the onion and garlic every 2 minutes while they cook. The onion will look translucent when it is done.No time to chop an onion? Buy pre-chopped fresh or frozen onions to use in your curry. You can also purchase canned minced garlic. Use 1 tsp (5 g) of pre-minced garlic in place of a garlic clove."
                },
                {
                    "headline": "Stir in the curry paste, tomatoes, and vegetable broth.",
                    "description": "Add 1 to 2 tbsp (15 to 30g) of curry paste, depending on how spicy you want your curry to be. Then, add a 14 oz (400 g) can of diced tomatoes with the juice and 7  fl oz (210 mL) of vegetable broth. Use a metal or wooden spoon to mix the ingredients together. If you do not have vegetable broth, use water and ½ tsp of salt."
                },
                {
                    "headline": "Cook the sauce on medium-high heat while you prepare the fish.",
                    "description": "This should only take about 5 minutes, but it is okay if it takes you a little longer. Just watch the sauce and stir it every few minutes. Turn the heat down to medium or low-medium if you need more than 10 minutes to prepare the fish."
                },
                {
                    "headline": "Cut the fish into 2 in (5.1 cm) chunks and add them to the sauce.",
                    "description": "Use a sharp knife and a cutting board to cut the fish. Large 2 in (5.1 cm) chunks will give the stew a hearty appearance and texture, but you may cut the pieces smaller if desired. You may use fresh or frozen fish, but make sure that the fish is defrosted before you add it to the sauce."
                },
                {
                    "headline": "Cover and cook the curry for 5 more minutes on medium-high heat.",
                    "description": "Use a wooden or metal spoon to stir the curry about once every 3 minutes and watch it closely. The curry is done when the fish flakes easily with a fork. Serve the curry with rice and naan bread, or enjoy it on its own!"
                }
            ]
        },
        {
            "name": "Cooking an Indian Fish Curry from Scratch",
            "steps": [
                {
                    "headline": "Marinate the fish fillets in mustard, oil, salt and pepper for 30 minutes.",
                    "description": "Stir to combine the 2 tsp (10 mL) of Dijon mustard, 1 tsp of black pepper, 1/2 tsp of salt, and 2 tbsp (30 mL) of canola oil in a large bowl. Then, place the fish fillets in the bowl and coat them with the mixture on all sides. Cover the bowl and put it in the refrigerator for 30 minutes. Set a timer to remind you when the fish has marinated for the full 30 minutes."
                },
                {
                    "headline": "Puree the onion, garlic, ginger, and cashews or coconut.",
                    "description": "Place the ingredients in a food processor. Blend the ingredients until they form a paste. Stop the machine and scrape down the sides with a spatula if the ingredients get stuck to the sides. You can also add 1 tbsp (15 mL) of water to get things moving if the ingredients are not blending well."
                },
                {
                    "headline": "Preheat your oven to 350 °F (177 °C).",
                    "description": "At this point, turn on your oven and set it to 350 °F (177 °C). This way it will be hot when you are ready to bake the fish curry. It will take about 10 to 15 minutes for your oven to reach this temperature."
                },
                {
                    "headline": "Sauté the paste in oil for about 2 minutes.",
                    "description": "Heat a large skillet with 1 tbsp (15 mL) of canola oil for about 2 minutes on medium-high heat. Add the paste to the skillet when it is hot and cook for about 2 minutes. Stir it a few times while it cooks. Be careful not to let the paste burn in the pan! Watch it closely and turn down the heat to medium if needed."
                },
                {
                    "headline": "Add the spices, salt, and sugar and cook for 5 more minutes.",
                    "description": "Measure and add 2 tsp (4.2 g) of cayenne pepper, 1/2 tsp (1 g) of ground turmeric, 1 tsp (2.1 g) of ground cumin, 1 tsp (2.1 g) of ground coriander, 1/2 tsp (1 g) of fennel seeds (optional), 1 tsp (5 g) of salt, and 1 tsp (5 g) of sugar to the pan. Stir the spices and sugar in with the paste and cook them for 5 more minutes. Use a metal or wooden spoon."
                },
                {
                    "headline": "Stir in the tomatoes and vegetable broth and turn off the heat.",
                    "description": "Next, pour 4 oz (110 g) of chopped tomato and 2  fl oz (59 mL) of vegetable broth into the pan. Stir to combine all of the ingredients. Then, turn off the heat. Don’t worry that the sauce is not hot! It will heat up in the oven."
                },
                {
                    "headline": "Arrange the fish fillets in a baking dish and pour the sauce over them.",
                    "description": "Spray the dish with non-stick cooking spray to prevent the fish from sticking. Then, place the fillets into the dish so that they are spaced out evenly. Pour the sauce over the fish fillets. Use a spatula to scrape the pan if any of the sauce is stuck to it."
                },
                {
                    "headline": "Bake the fish uncovered at 350 °F (177 °C) for 30 minutes.",
                    "description": "The dish is done when the fish flakes easily with a fork. Set a timer for 30 minutes and place the dish on the center rack of your oven. Remove the dish from the oven when the time is up. Make sure to wear oven mitts when you remove the fish curry from the oven and place the dish on a potholder or trivet."
                },
                {
                    "headline": "Serve the curry with rice and naan bread.",
                    "description": "Let the curry rest for about 10 minutes before enjoying. Then, serve it over a bed of rice, with a slice of naan bread, or with both!Tip: For a bowl of homemade fish curry any time, make a double batch of this curry recipe and freeze half of it in airtight plastic containers! When you are ready to eat it, microwave the frozen curry until the sauce and fish are heated through."
                }
            ]
        }
    ],
    "tyn": [
        "Quick and Easy Fish Curry",
        "Large skillet",
        "Knife",
        "Cutting board",
        "Indian Fish Curry from Scratch",
        "Non-stick cooking spray",
        "9 by 13 in (23 by 33 cm) baking pan"
    ],
    "text": " Making a Quick and Easy Fish Curry Sauté the onion and garlic over medium heat for 5 minutes. Heat the oil in a large skillet over medium heat for 2 to 3 minutes. Then, add the chopped onion and minced garlic to the pan. Stir the onion and garlic every 2 minutes while they cook. The onion will look translucent when it is done.No time to chop an onion? Buy pre-chopped fresh or frozen onions to use in your curry. You can also purchase canned minced garlic. Use 1 tsp (5 g) of pre-minced garlic in place of a garlic clove. Stir in the curry paste, tomatoes, and vegetable broth. Add 1 to 2 tbsp (15 to 30g) of curry paste, depending on how spicy you want your curry to be. Then, add a 14 oz (400 g) can of diced tomatoes with the juice and 7  fl oz (210 mL) of vegetable broth. Use a metal or wooden spoon to mix the ingredients together. If you do not have vegetable broth, use water and ½ tsp of salt. Cook the sauce on medium-high heat while you prepare the fish. This should only take about 5 minutes, but it is okay if it takes you a little longer. Just watch the sauce and stir it every few minutes. Turn the heat down to medium or low-medium if you need more than 10 minutes to prepare the fish. Cut the fish into 2 in (5.1 cm) chunks and add them to the sauce. Use a sharp knife and a cutting board to cut the fish. Large 2 in (5.1 cm) chunks will give the stew a hearty appearance and texture, but you may cut the pieces smaller if desired. You may use fresh or frozen fish, but make sure that the fish is defrosted before you add it to the sauce. Cover and cook the curry for 5 more minutes on medium-high heat. Use a wooden or metal spoon to stir the curry about once every 3 minutes and watch it closely. The curry is done when the fish flakes easily with a fork. Serve the curry with rice and naan bread, or enjoy it on its own! Cooking an Indian Fish Curry from Scratch Marinate the fish fillets in mustard, oil, salt and pepper for 30 minutes. Stir to combine the 2 tsp (10 mL) of Dijon mustard, 1 tsp of black pepper, 1/2 tsp of salt, and 2 tbsp (30 mL) of canola oil in a large bowl. Then, place the fish fillets in the bowl and coat them with the mixture on all sides. Cover the bowl and put it in the refrigerator for 30 minutes. Set a timer to remind you when the fish has marinated for the full 30 minutes. Puree the onion, garlic, ginger, and cashews or coconut. Place the ingredients in a food processor. Blend the ingredients until they form a paste. Stop the machine and scrape down the sides with a spatula if the ingredients get stuck to the sides. You can also add 1 tbsp (15 mL) of water to get things moving if the ingredients are not blending well. Preheat your oven to 350 °F (177 °C). At this point, turn on your oven and set it to 350 °F (177 °C). This way it will be hot when you are ready to bake the fish curry. It will take about 10 to 15 minutes for your oven to reach this temperature. Sauté the paste in oil for about 2 minutes. Heat a large skillet with 1 tbsp (15 mL) of canola oil for about 2 minutes on medium-high heat. Add the paste to the skillet when it is hot and cook for about 2 minutes. Stir it a few times while it cooks. Be careful not to let the paste burn in the pan! Watch it closely and turn down the heat to medium if needed. Add the spices, salt, and sugar and cook for 5 more minutes. Measure and add 2 tsp (4.2 g) of cayenne pepper, 1/2 tsp (1 g) of ground turmeric, 1 tsp (2.1 g) of ground cumin, 1 tsp (2.1 g) of ground coriander, 1/2 tsp (1 g) of fennel seeds (optional), 1 tsp (5 g) of salt, and 1 tsp (5 g) of sugar to the pan. Stir the spices and sugar in with the paste and cook them for 5 more minutes. Use a metal or wooden spoon. Stir in the tomatoes and vegetable broth and turn off the heat. Next, pour 4 oz (110 g) of chopped tomato and 2  fl oz (59 mL) of vegetable broth into the pan. Stir to combine all of the ingredients. Then, turn off the heat. Don’t worry that the sauce is not hot! It will heat up in the oven. Arrange the fish fillets in a baking dish and pour the sauce over them. Spray the dish with non-stick cooking spray to prevent the fish from sticking. Then, place the fillets into the dish so that they are spaced out evenly. Pour the sauce over the fish fillets. Use a spatula to scrape the pan if any of the sauce is stuck to it. Bake the fish uncovered at 350 °F (177 °C) for 30 minutes. The dish is done when the fish flakes easily with a fork. Set a timer for 30 minutes and place the dish on the center rack of your oven. Remove the dish from the oven when the time is up. Make sure to wear oven mitts when you remove the fish curry from the oven and place the dish on a potholder or trivet. Serve the curry with rice and naan bread. Let the curry rest for about 10 minutes before enjoying. Then, serve it over a bed of rice, with a slice of naan bread, or with both!Tip: For a bowl of homemade fish curry any time, make a double batch of this curry recipe and freeze half of it in airtight plastic containers! When you are ready to eat it, microwave the frozen curry until the sauce and fish are heated through.",
    "sentences": [
        " Making a Quick and Easy Fish Curry Sauté the onion and garlic over medium heat for 5 minutes.",
        "Heat the oil in a large skillet over medium heat for 2 to 3 minutes.",
        "Then, add the chopped onion and minced garlic to the pan.",
        "Stir the onion and garlic every 2 minutes while they cook.",
        "The onion will look translucent when it is done.No time to chop an onion?",
        "Buy pre-chopped fresh or frozen onions to use in your curry.",
        "You can also purchase canned minced garlic.",
        "Use 1 tsp (5 g) of pre-minced garlic in place of a garlic clove.",
        "Stir in the curry paste, tomatoes, and vegetable broth.",
        "Add 1 to 2 tbsp (15 to 30g) of curry paste, depending on how spicy you want your curry to be.",
        "Then, add a 14 oz (400 g) can of diced tomatoes with the juice and 7  fl oz (210 mL) of vegetable broth.",
        "Use a metal or wooden spoon to mix the ingredients together.",
        "If you do not have vegetable broth, use water and ½ tsp of salt.",
        "Cook the sauce on medium-high heat while you prepare the fish.",
        "This should only take about 5 minutes, but it is okay if it takes you a little longer.",
        "Just watch the sauce and stir it every few minutes.",
        "Turn the heat down to medium or low-medium if you need more than 10 minutes to prepare the fish.",
        "Cut the fish into 2 in (5.1 cm) chunks and add them to the sauce.",
        "Use a sharp knife and a cutting board to cut the fish.",
        "Large 2 in (5.1 cm) chunks will give the stew a hearty appearance and texture, but you may cut the pieces smaller if desired.",
        "You may use fresh or frozen fish, but make sure that the fish is defrosted before you add it to the sauce.",
        "Cover and cook the curry for 5 more minutes on medium-high heat.",
        "Use a wooden or metal spoon to stir the curry about once every 3 minutes and watch it closely.",
        "The curry is done when the fish flakes easily with a fork.",
        "Serve the curry with rice and naan bread, or enjoy it on its own!",
        "Cooking an Indian Fish Curry from Scratch Marinate the fish fillets in mustard, oil, salt and pepper for 30 minutes.",
        "Stir to combine the 2 tsp (10 mL) of Dijon mustard, 1 tsp of black pepper, 1/2 tsp of salt, and 2 tbsp (30 mL) of canola oil in a large bowl.",
        "Then, place the fish fillets in the bowl and coat them with the mixture on all sides.",
        "Cover the bowl and put it in the refrigerator for 30 minutes.",
        "Set a timer to remind you when the fish has marinated for the full 30 minutes.",
        "Puree the onion, garlic, ginger, and cashews or coconut.",
        "Place the ingredients in a food processor.",
        "Blend the ingredients until they form a paste.",
        "Stop the machine and scrape down the sides with a spatula if the ingredients get stuck to the sides.",
        "You can also add 1 tbsp (15 mL) of water to get things moving if the ingredients are not blending well.",
        "Preheat your oven to 350 °F (177 °C).",
        "At this point, turn on your oven and set it to 350 °F (177 °C).",
        "This way it will be hot when you are ready to bake the fish curry.",
        "It will take about 10 to 15 minutes for your oven to reach this temperature.",
        "Sauté the paste in oil for about 2 minutes.",
        "Heat a large skillet with 1 tbsp (15 mL) of canola oil for about 2 minutes on medium-high heat.",
        "Add the paste to the skillet when it is hot and cook for about 2 minutes.",
        "Stir it a few times while it cooks.",
        "Be careful not to let the paste burn in the pan!",
        "Watch it closely and turn down the heat to medium if needed.",
        "Add the spices, salt, and sugar and cook for 5 more minutes.",
        "Measure and add 2 tsp (4.2 g) of cayenne pepper, 1/2 tsp (1 g) of ground turmeric, 1 tsp (2.1 g) of ground cumin, 1 tsp (2.1 g) of ground coriander, 1/2 tsp (1 g) of fennel seeds (optional), 1 tsp (5 g) of salt, and 1 tsp (5 g) of sugar to the pan.",
        "Stir the spices and sugar in with the paste and cook them for 5 more minutes.",
        "Use a metal or wooden spoon.",
        "Stir in the tomatoes and vegetable broth and turn off the heat.",
        "Next, pour 4 oz (110 g) of chopped tomato and 2  fl oz (59 mL) of vegetable broth into the pan.",
        "Stir to combine all of the ingredients.",
        "Then, turn off the heat.",
        "Don’t worry that the sauce is not hot!",
        "It will heat up in the oven.",
        "Arrange the fish fillets in a baking dish and pour the sauce over them.",
        "Spray the dish with non-stick cooking spray to prevent the fish from sticking.",
        "Then, place the fillets into the dish so that they are spaced out evenly.",
        "Pour the sauce over the fish fillets.",
        "Use a spatula to scrape the pan if any of the sauce is stuck to it.",
        "Bake the fish uncovered at 350 °F (177 °C) for 30 minutes.",
        "The dish is done when the fish flakes easily with a fork.",
        "Set a timer for 30 minutes and place the dish on the center rack of your oven.",
        "Remove the dish from the oven when the time is up.",
        "Make sure to wear oven mitts when you remove the fish curry from the oven and place the dish on a potholder or trivet.",
        "Serve the curry with rice and naan bread.",
        "Let the curry rest for about 10 minutes before enjoying.",
        "Then, serve it over a bed of rice, with a slice of naan bread, or with both!Tip: For a bowl of homemade fish curry any time, make a double batch of this curry recipe and freeze half of it in airtight plastic containers!",
        "When you are ready to eat it, microwave the frozen curry until the sauce and fish are heated through."
    ]
}