{
    "title": "How to Collect Water From Plants",
    "url": "https://www.wikihow.com/Collect-Water-From-Plants",
    "category_hierarchy": [
        "Home and Garden",
        "Disaster Preparedness"
    ],
    "methods": [
        {
            "name": "Getting Plant-Respirated Water",
            "steps": [
                {
                    "headline": "Choose the right plant.",
                    "description": "You should use a healthy, intact plant that is actively growing because a dead or dormant plant will not provide water vapor that you can collect. Plants that are water-loving, such as willows or cottonwoods, are the best option, but you can use any variety with leaves. The larger the leaves on your plant are the better. That’s because a large leaf surface will usually produce more water vapor than plants with small leaves."
                },
                {
                    "headline": "Place a plastic bag over a leafy branch.",
                    "description": "Make sure to cover as much of the live plant as the bag can accommodate. For the best results, use a clear bag that allows light to pass through it. The added heat will help extract moisture from the plant. Check your bag to make sure that there aren’t any holes or tears that might allow air inside. If you find one, cover the tear with a piece of strong tape, such as vinyl duct tape."
                },
                {
                    "headline": "Secure the bag around around the branch, stem, or trunk.",
                    "description": "Ensure that the seal is as airtight as possible. It helps to tie several layers of the bag off with string, making sure that there aren’t any gaps around the base of the plant."
                },
                {
                    "headline": "Position the bag properly.",
                    "description": "You want at least a portion of it to be lower than the seal around the base of the plant. That’s because the water will gather in the lowest portion of the bag, so you want to give it room to collect. You want to be sure that the plant and bag can bear the weight of any water that’s collected, so check that they’re not starting to list to the side before the water vapor begins to gather."
                },
                {
                    "headline": "Let the plant sit for several hours.",
                    "description": "It usually takes four to five hours for water to start to collect in the bag. To help the process along, set the plant near a window or under a lamp, so it can receive light to help heat up the inside of the bag."
                },
                {
                    "headline": "Unwrap the bag.",
                    "description": "You’ll be able to tell when there’s water in the bag for you to collect, but you have to undo the seal carefully to ensure that you don’t spill any. Pour the water into a glass, bowl, or other container for you to use. You may not get as much water as you want even after several hours. If that's the case, reseal the bag over the plant and repeat the process."
                }
            ]
        },
        {
            "name": "Extracting Water Directly from the Plant",
            "steps": [
                {
                    "headline": "Cut a section of the plant.",
                    "description": "The moist, pulpy center of stems, leaves, and stalks contain water, so you can either slice off part of the plant to work with or make a notch in a stalk at the base of the joint. A small pocket knife works best for cutting into a plant because you can be more precise, and avoid cutting any more than is necessary."
                },
                {
                    "headline": "Squeeze or smash until water comes out.",
                    "description": "With some plants, moisture may flow from it as soon as you cut it. However, some species require that you squeeze or press the leaves or stems to get the water to flow. You’ll need to press on the moist pulp inside to access the liquid. Sucking water directly from plant isn’t a good idea because the exterior of the leaves, stems, or stalks may contain bacteria, dirt, and other debris. Be careful if you’re trying to extract moisture from a cactus.They are a great source of water, but their prickly exterior can be hard on your hands if you need to squeeze out the liquid."
                },
                {
                    "headline": "Catch water in a container.",
                    "description": "It’s best to examine the liquid that comes out of the plant to ensure that it’s water and not potentially poisonous. Let the liquid fall into a bowl or cup so you can check its color and texture. If the liquid that comes out of your plant has a milky color and a sap-like consistency, don’t drink it. It’s usually poisonous. Keep in mind that a single leaf, stem, or stalk may not contain much water, so you may need to extract liquid from several pieces of the plant to get as much water as you'd like."
                }
            ]
        }
    ],
    "tyn": [
        "A live plant with leaves",
        "A plastic bag",
        "A piece of string, or other means to secure the seal",
        "A pocket knife",
        "A bowl, cup, or other container"
    ],
    "text": " Getting Plant-Respirated Water Choose the right plant. You should use a healthy, intact plant that is actively growing because a dead or dormant plant will not provide water vapor that you can collect. Plants that are water-loving, such as willows or cottonwoods, are the best option, but you can use any variety with leaves. The larger the leaves on your plant are the better. That’s because a large leaf surface will usually produce more water vapor than plants with small leaves. Place a plastic bag over a leafy branch. Make sure to cover as much of the live plant as the bag can accommodate. For the best results, use a clear bag that allows light to pass through it. The added heat will help extract moisture from the plant. Check your bag to make sure that there aren’t any holes or tears that might allow air inside. If you find one, cover the tear with a piece of strong tape, such as vinyl duct tape. Secure the bag around around the branch, stem, or trunk. Ensure that the seal is as airtight as possible. It helps to tie several layers of the bag off with string, making sure that there aren’t any gaps around the base of the plant. Position the bag properly. You want at least a portion of it to be lower than the seal around the base of the plant. That’s because the water will gather in the lowest portion of the bag, so you want to give it room to collect. You want to be sure that the plant and bag can bear the weight of any water that’s collected, so check that they’re not starting to list to the side before the water vapor begins to gather. Let the plant sit for several hours. It usually takes four to five hours for water to start to collect in the bag. To help the process along, set the plant near a window or under a lamp, so it can receive light to help heat up the inside of the bag. Unwrap the bag. You’ll be able to tell when there’s water in the bag for you to collect, but you have to undo the seal carefully to ensure that you don’t spill any. Pour the water into a glass, bowl, or other container for you to use. You may not get as much water as you want even after several hours. If that's the case, reseal the bag over the plant and repeat the process. Extracting Water Directly from the Plant Cut a section of the plant. The moist, pulpy center of stems, leaves, and stalks contain water, so you can either slice off part of the plant to work with or make a notch in a stalk at the base of the joint. A small pocket knife works best for cutting into a plant because you can be more precise, and avoid cutting any more than is necessary. Squeeze or smash until water comes out. With some plants, moisture may flow from it as soon as you cut it. However, some species require that you squeeze or press the leaves or stems to get the water to flow. You’ll need to press on the moist pulp inside to access the liquid. Sucking water directly from plant isn’t a good idea because the exterior of the leaves, stems, or stalks may contain bacteria, dirt, and other debris. Be careful if you’re trying to extract moisture from a cactus.They are a great source of water, but their prickly exterior can be hard on your hands if you need to squeeze out the liquid. Catch water in a container. It’s best to examine the liquid that comes out of the plant to ensure that it’s water and not potentially poisonous. Let the liquid fall into a bowl or cup so you can check its color and texture. If the liquid that comes out of your plant has a milky color and a sap-like consistency, don’t drink it. It’s usually poisonous. Keep in mind that a single leaf, stem, or stalk may not contain much water, so you may need to extract liquid from several pieces of the plant to get as much water as you'd like.",
    "sentences": [
        " Getting Plant-Respirated Water Choose the right plant.",
        "You should use a healthy, intact plant that is actively growing because a dead or dormant plant will not provide water vapor that you can collect.",
        "Plants that are water-loving, such as willows or cottonwoods, are the best option, but you can use any variety with leaves.",
        "The larger the leaves on your plant are the better.",
        "That’s because a large leaf surface will usually produce more water vapor than plants with small leaves.",
        "Place a plastic bag over a leafy branch.",
        "Make sure to cover as much of the live plant as the bag can accommodate.",
        "For the best results, use a clear bag that allows light to pass through it.",
        "The added heat will help extract moisture from the plant.",
        "Check your bag to make sure that there aren’t any holes or tears that might allow air inside.",
        "If you find one, cover the tear with a piece of strong tape, such as vinyl duct tape.",
        "Secure the bag around around the branch, stem, or trunk.",
        "Ensure that the seal is as airtight as possible.",
        "It helps to tie several layers of the bag off with string, making sure that there aren’t any gaps around the base of the plant.",
        "Position the bag properly.",
        "You want at least a portion of it to be lower than the seal around the base of the plant.",
        "That’s because the water will gather in the lowest portion of the bag, so you want to give it room to collect.",
        "You want to be sure that the plant and bag can bear the weight of any water that’s collected, so check that they’re not starting to list to the side before the water vapor begins to gather.",
        "Let the plant sit for several hours.",
        "It usually takes four to five hours for water to start to collect in the bag.",
        "To help the process along, set the plant near a window or under a lamp, so it can receive light to help heat up the inside of the bag.",
        "Unwrap the bag.",
        "You’ll be able to tell when there’s water in the bag for you to collect, but you have to undo the seal carefully to ensure that you don’t spill any.",
        "Pour the water into a glass, bowl, or other container for you to use.",
        "You may not get as much water as you want even after several hours.",
        "If that's the case, reseal the bag over the plant and repeat the process.",
        "Extracting Water Directly from the Plant Cut a section of the plant.",
        "The moist, pulpy center of stems, leaves, and stalks contain water, so you can either slice off part of the plant to work with or make a notch in a stalk at the base of the joint.",
        "A small pocket knife works best for cutting into a plant because you can be more precise, and avoid cutting any more than is necessary.",
        "Squeeze or smash until water comes out.",
        "With some plants, moisture may flow from it as soon as you cut it.",
        "However, some species require that you squeeze or press the leaves or stems to get the water to flow.",
        "You’ll need to press on the moist pulp inside to access the liquid.",
        "Sucking water directly from plant isn’t a good idea because the exterior of the leaves, stems, or stalks may contain bacteria, dirt, and other debris.",
        "Be careful if you’re trying to extract moisture from a cactus.They are a great source of water, but their prickly exterior can be hard on your hands if you need to squeeze out the liquid.",
        "Catch water in a container.",
        "It’s best to examine the liquid that comes out of the plant to ensure that it’s water and not potentially poisonous.",
        "Let the liquid fall into a bowl or cup so you can check its color and texture.",
        "If the liquid that comes out of your plant has a milky color and a sap-like consistency, don’t drink it.",
        "It’s usually poisonous.",
        "Keep in mind that a single leaf, stem, or stalk may not contain much water, so you may need to extract liquid from several pieces of the plant to get as much water as you'd like."
    ]
}