{
    "title": "How to Make an Egg Wash",
    "url": "https://www.wikihow.com/Make-an-Egg-Wash",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Eggs and Dairy",
        "Egg Basics"
    ],
    "methods": [
        {
            "name": "Whisking the Egg Wash",
            "steps": [
                {
                    "headline": "Crack the egg into a small bowl.",
                    "description": "You can use any type of egg and any sized egg. Keep in mind that a jumbo chicken egg will make more egg wash than a small chicken egg or quail egg. If you want to make a dark egg wash, use just the yolk and a pinch of salt. The salt will liquefy the yolk so it's easier to spread."
                },
                {
                    "headline": "Add 1 teaspoon (4.9 ml) of liquid.",
                    "description": "You can use water, milk, heavy cream, or soy milk according to your preferences. The liquid thins the egg yolk so it won't dry your pastry out and cause it to crack in the oven. If the egg wash looks too thick, you can thin it out with another 1 teaspoon (4.9 ml) to 2 teaspoons (9.9 ml) of liquid. Keep in mind that each liquid will give you a different look. For example, water will give a matte appearance while milk and cream give shine."
                },
                {
                    "headline": "Whisk the egg wash until it's combined.",
                    "description": "Hold a whisk or fork and use your wrist to beat the egg and liquid in a circular motion. Whisk the egg wash for up to 10 seconds so the yolk is well blended and mixed with the white. Avoid whisking the egg wash until the egg foams."
                },
                {
                    "headline": "Whisk in any additional items according to your needs.",
                    "description": "You can whisk a few pinches of spice such as nutmeg or cinnamon, if you want the egg wash to have a darker color with a hint of flavor. Add a few dashes of salt if you want a shiny surface or stronger binding for pastry."
                },
                {
                    "headline": "Thin the egg wash with more liquid, if necessary.",
                    "description": "If you are glazing something that is going to expand a lot such as puff pastry or bread, mix in another 1 teaspoon (4.9 ml) to 2 teaspoons (9.9 ml) of liquid to prevent cracking as the pastry expands."
                }
            ]
        },
        {
            "name": "Selecting an Egg-Free Alternative",
            "steps": [
                {
                    "headline": "Use plain half-and-half or heavy cream.",
                    "description": "If you'd like to leave the egg out of the wash, you can still add golden color to your baked goods. Brush half-and-half or heavy cream on your baked goods for a matte finish. Keep in mind that the heavy cream is more likely to crack as it expands."
                },
                {
                    "headline": "Brush olive oil instead of egg wash. Olive oil is a good vegan substitute for egg wash. Just brush pure olive oil directly on your bread or baked goods.",
                    "description": "While olive oil will give your baked goods a little shine, it may give a faint olive oil flavor so avoid brushing it on sweet baked goods. For another vegan egg wash, mix a few teaspoons of water with soy powder."
                },
                {
                    "headline": "Use a commercial egg substitute.",
                    "description": "Buy a vegan egg replacement or purchase an egg substitute that's made with egg whites and thickeners. If you're using a liquid substitute, brush it directly on the baked goods. If you're using a powder, mix a little water into the powder so it's spreadable."
                }
            ]
        },
        {
            "name": "Using the Egg Wash",
            "steps": [
                {
                    "headline": "Brush the egg wash over your bread.",
                    "description": "Dip a pastry brush into the egg wash or egg wash alternative. Spread it evenly over the top of the bread, but avoid using so much that the egg wash runs down the sides. This could cause the bread to stick to the pan. Score the bread and bake it as directed. If a lot of egg wash puddles near the bottom of the bread, you'll have bits of cooked egg stuck to the loaf."
                },
                {
                    "headline": "Spread egg wash over the bottom of an unbaked pie crust.",
                    "description": "To prevent soggy bottom crusts, brush the egg wash over the unbaked pastry before you add the filling. As the pie cooks, the egg wash will cook and prevent liquids in the filling from soaking into the bottom crust."
                },
                {
                    "headline": "Seal the edges of pastry with egg wash.",
                    "description": "If you're making puff pastry, cooking turnovers, or baking sandwich cookies, brush egg wash along the edges on 1 side of the pastry. Fold or place the top layer over pastry over the washed edges and press down gently. The egg wash will keep the pastry stuck together. If you'd like the pastry to be pale and crisp, consider making an egg wash with just the egg white and water."
                },
                {
                    "headline": "Cover the top of the baked goods.",
                    "description": "Once you've filled your pie, assembled your rolls, or made your croissants, brush the tops with egg wash. Bake the items immediately to get the best finish on them. Try brushing an egg wash on top of:\nBread and rolls\nPastries and danishes\nPie\nMeat pies such as pasties, empanadas, and shepherd's pie\nPuff pastry hors d'oeuvres\nCut-out cookies"
                },
                {
                    "headline": "Use the egg wash to secure seeds, sugar, or pastry.",
                    "description": "If you plan on decorating your food, brush it with egg wash and then sprinkle the embellishments on top. The egg wash will hold the decorations in place. For example, brush a pie with egg wash and sprinkle coarse sugar on top. If you're baking bread, scatter sesame or poppy seeds over the wash. If you want to lay decorative pastry pieces on top of pastry, brush a little egg wash on the decorations before setting them in place."
                }
            ]
        }
    ],
    "tyn": [
        "Whisk or fork",
        "Small bowl",
        "Pastry brush",
        "Measuring spoons"
    ],
    "text": " Whisking the Egg Wash Crack the egg into a small bowl. You can use any type of egg and any sized egg. Keep in mind that a jumbo chicken egg will make more egg wash than a small chicken egg or quail egg. If you want to make a dark egg wash, use just the yolk and a pinch of salt. The salt will liquefy the yolk so it's easier to spread. Add 1 teaspoon (4.9 ml) of liquid. You can use water, milk, heavy cream, or soy milk according to your preferences. The liquid thins the egg yolk so it won't dry your pastry out and cause it to crack in the oven. If the egg wash looks too thick, you can thin it out with another 1 teaspoon (4.9 ml) to 2 teaspoons (9.9 ml) of liquid. Keep in mind that each liquid will give you a different look. For example, water will give a matte appearance while milk and cream give shine. Whisk the egg wash until it's combined. Hold a whisk or fork and use your wrist to beat the egg and liquid in a circular motion. Whisk the egg wash for up to 10 seconds so the yolk is well blended and mixed with the white. Avoid whisking the egg wash until the egg foams. Whisk in any additional items according to your needs. You can whisk a few pinches of spice such as nutmeg or cinnamon, if you want the egg wash to have a darker color with a hint of flavor. Add a few dashes of salt if you want a shiny surface or stronger binding for pastry. Thin the egg wash with more liquid, if necessary. If you are glazing something that is going to expand a lot such as puff pastry or bread, mix in another 1 teaspoon (4.9 ml) to 2 teaspoons (9.9 ml) of liquid to prevent cracking as the pastry expands. Selecting an Egg-Free Alternative Use plain half-and-half or heavy cream. If you'd like to leave the egg out of the wash, you can still add golden color to your baked goods. Brush half-and-half or heavy cream on your baked goods for a matte finish. Keep in mind that the heavy cream is more likely to crack as it expands. Brush olive oil instead of egg wash. Olive oil is a good vegan substitute for egg wash. Just brush pure olive oil directly on your bread or baked goods. While olive oil will give your baked goods a little shine, it may give a faint olive oil flavor so avoid brushing it on sweet baked goods. For another vegan egg wash, mix a few teaspoons of water with soy powder. Use a commercial egg substitute. Buy a vegan egg replacement or purchase an egg substitute that's made with egg whites and thickeners. If you're using a liquid substitute, brush it directly on the baked goods. If you're using a powder, mix a little water into the powder so it's spreadable. Using the Egg Wash Brush the egg wash over your bread. Dip a pastry brush into the egg wash or egg wash alternative. Spread it evenly over the top of the bread, but avoid using so much that the egg wash runs down the sides. This could cause the bread to stick to the pan. Score the bread and bake it as directed. If a lot of egg wash puddles near the bottom of the bread, you'll have bits of cooked egg stuck to the loaf. Spread egg wash over the bottom of an unbaked pie crust. To prevent soggy bottom crusts, brush the egg wash over the unbaked pastry before you add the filling. As the pie cooks, the egg wash will cook and prevent liquids in the filling from soaking into the bottom crust. Seal the edges of pastry with egg wash. If you're making puff pastry, cooking turnovers, or baking sandwich cookies, brush egg wash along the edges on 1 side of the pastry. Fold or place the top layer over pastry over the washed edges and press down gently. The egg wash will keep the pastry stuck together. If you'd like the pastry to be pale and crisp, consider making an egg wash with just the egg white and water. Cover the top of the baked goods. Once you've filled your pie, assembled your rolls, or made your croissants, brush the tops with egg wash. Bake the items immediately to get the best finish on them. Try brushing an egg wash on top of:\nBread and rolls\nPastries and danishes\nPie\nMeat pies such as pasties, empanadas, and shepherd's pie\nPuff pastry hors d'oeuvres\nCut-out cookies Use the egg wash to secure seeds, sugar, or pastry. If you plan on decorating your food, brush it with egg wash and then sprinkle the embellishments on top. The egg wash will hold the decorations in place. For example, brush a pie with egg wash and sprinkle coarse sugar on top. If you're baking bread, scatter sesame or poppy seeds over the wash. If you want to lay decorative pastry pieces on top of pastry, brush a little egg wash on the decorations before setting them in place.",
    "sentences": [
        " Whisking the Egg Wash Crack the egg into a small bowl.",
        "You can use any type of egg and any sized egg.",
        "Keep in mind that a jumbo chicken egg will make more egg wash than a small chicken egg or quail egg.",
        "If you want to make a dark egg wash, use just the yolk and a pinch of salt.",
        "The salt will liquefy the yolk so it's easier to spread.",
        "Add 1 teaspoon (4.9 ml) of liquid.",
        "You can use water, milk, heavy cream, or soy milk according to your preferences.",
        "The liquid thins the egg yolk so it won't dry your pastry out and cause it to crack in the oven.",
        "If the egg wash looks too thick, you can thin it out with another 1 teaspoon (4.9 ml) to 2 teaspoons (9.9 ml) of liquid.",
        "Keep in mind that each liquid will give you a different look.",
        "For example, water will give a matte appearance while milk and cream give shine.",
        "Whisk the egg wash until it's combined.",
        "Hold a whisk or fork and use your wrist to beat the egg and liquid in a circular motion.",
        "Whisk the egg wash for up to 10 seconds so the yolk is well blended and mixed with the white.",
        "Avoid whisking the egg wash until the egg foams.",
        "Whisk in any additional items according to your needs.",
        "You can whisk a few pinches of spice such as nutmeg or cinnamon, if you want the egg wash to have a darker color with a hint of flavor.",
        "Add a few dashes of salt if you want a shiny surface or stronger binding for pastry.",
        "Thin the egg wash with more liquid, if necessary.",
        "If you are glazing something that is going to expand a lot such as puff pastry or bread, mix in another 1 teaspoon (4.9 ml) to 2 teaspoons (9.9 ml) of liquid to prevent cracking as the pastry expands.",
        "Selecting an Egg-Free Alternative Use plain half-and-half or heavy cream.",
        "If you'd like to leave the egg out of the wash, you can still add golden color to your baked goods.",
        "Brush half-and-half or heavy cream on your baked goods for a matte finish.",
        "Keep in mind that the heavy cream is more likely to crack as it expands.",
        "Brush olive oil instead of egg wash. Olive oil is a good vegan substitute for egg wash. Just brush pure olive oil directly on your bread or baked goods.",
        "While olive oil will give your baked goods a little shine, it may give a faint olive oil flavor so avoid brushing it on sweet baked goods.",
        "For another vegan egg wash, mix a few teaspoons of water with soy powder.",
        "Use a commercial egg substitute.",
        "Buy a vegan egg replacement or purchase an egg substitute that's made with egg whites and thickeners.",
        "If you're using a liquid substitute, brush it directly on the baked goods.",
        "If you're using a powder, mix a little water into the powder so it's spreadable.",
        "Using the Egg Wash Brush the egg wash over your bread.",
        "Dip a pastry brush into the egg wash or egg wash alternative.",
        "Spread it evenly over the top of the bread, but avoid using so much that the egg wash runs down the sides.",
        "This could cause the bread to stick to the pan.",
        "Score the bread and bake it as directed.",
        "If a lot of egg wash puddles near the bottom of the bread, you'll have bits of cooked egg stuck to the loaf.",
        "Spread egg wash over the bottom of an unbaked pie crust.",
        "To prevent soggy bottom crusts, brush the egg wash over the unbaked pastry before you add the filling.",
        "As the pie cooks, the egg wash will cook and prevent liquids in the filling from soaking into the bottom crust.",
        "Seal the edges of pastry with egg wash.",
        "If you're making puff pastry, cooking turnovers, or baking sandwich cookies, brush egg wash along the edges on 1 side of the pastry.",
        "Fold or place the top layer over pastry over the washed edges and press down gently.",
        "The egg wash will keep the pastry stuck together.",
        "If you'd like the pastry to be pale and crisp, consider making an egg wash with just the egg white and water.",
        "Cover the top of the baked goods.",
        "Once you've filled your pie, assembled your rolls, or made your croissants, brush the tops with egg wash. Bake the items immediately to get the best finish on them.",
        "Try brushing an egg wash on top of:\nBread and rolls\nPastries and danishes\nPie\nMeat pies such as pasties, empanadas, and shepherd's pie\nPuff pastry hors d'oeuvres\nCut-out cookies Use the egg wash to secure seeds, sugar, or pastry.",
        "If you plan on decorating your food, brush it with egg wash and then sprinkle the embellishments on top.",
        "The egg wash will hold the decorations in place.",
        "For example, brush a pie with egg wash and sprinkle coarse sugar on top.",
        "If you're baking bread, scatter sesame or poppy seeds over the wash.",
        "If you want to lay decorative pastry pieces on top of pastry, brush a little egg wash on the decorations before setting them in place."
    ]
}