{
    "title": "How to Catch a Guinea Pig",
    "url": "https://www.wikihow.com/Catch-a-Guinea-Pig",
    "category_hierarchy": [
        "Pets and Animals",
        "Rodents",
        "Guinea Pigs"
    ],
    "methods": [
        {
            "name": "Catching a Guinea Pig in its Cage",
            "steps": [
                {
                    "headline": "Put food in the cage and let your guinea pig go for it on its own.",
                    "description": "Put some veggies in the middle of your guinea pig's cage and let it come out and munch without your interference. It will smell you nearby, and start to associate your scent with the scent of food. Don't put your hand in yet or try to grab it — getting your guinea pig to stop hiding from you is all about building trust slowly. Some good veggies to choose from include carrots, broccoli, cucumber, or tomatoes."
                },
                {
                    "headline": "Place food on your hand to entice it towards you.",
                    "description": "After a few days, start putting food on your flat palm and let your guinea pig investigate the offering. It may be skittish at first, but eventually, it will overcome its fear for a tasty reward. Keep doing this every day until your guinea pig doesn't hesitate before you try to handle it."
                },
                {
                    "headline": "Pick up your pet from the front with each hand under the chest and rump.",
                    "description": "To avoid startling your guinea pig, pick it up by reaching slowly underneath its front side to cradle its chest, then use your other hand to support its backside. Moving slowly and in front of the guinea pig stops it from being surprised when you hold its chest, and holding its rump makes it feel more comfortable. Never grab, squeeze, toss, or mishandle a guinea pig. This is a surefire way to make it distrust you."
                },
                {
                    "headline": "Monitor your guinea pig for health problems if it hides or refuses to come out.",
                    "description": "If it doesn't come out when tasty treats are available, it could be a sign that your guinea pig is sick, especially if it is normally sociable and trusts you. Rodents and small animals tend to hide and stay quiet if they are injured. Try to find it in the cage, and inspect its body from outside the bars. Look for scratches, broken limbs, puffed-up fur, and irregular breathing patterns. Bring your guinea pig to a vet if you believe it's been hurt or is sick."
                },
                {
                    "headline": "Cover the guinea pig in a towel before trying to grab it.",
                    "description": "Guinea pigs are prey animals and can get skittish when they encounter new things. Herd your guinea pig into a corner of its cage and drape the towel over it. The darkness under the towel will help it calm down so you can easily grab them."
                }
            ]
        },
        {
            "name": "Luring Guinea Pigs with Food",
            "steps": [
                {
                    "headline": "Locate your pet guinea pig in the home by listening for it carefully.",
                    "description": "If your guinea pig has escaped into the house, it's usually easiest to find it and lure it out with its favorite foods. Turn off any distracting noises and listen carefully for anxious teeth grinding and the pitter-patter of your pet's feet. Once you're pretty sure you know where it is, you can start luring it out of it's hiding spot. If your guinea pig has somehow ended up in the wall or a place you can't reach, try luring it out with food before you start moving furniture and tearing up the home — they are easily scared by loud noises and it may go even deeper into its hiding place."
                },
                {
                    "headline": "Cut up your guinea pig's favorite foods nearby to release the scent.",
                    "description": "Guinea pigs, like many animals, navigate the world mainly through smells. If you cut up your pet guinea pig's favorite foods into chunks near its hiding spot, it may smell the foods and be enticed by the aroma. If your guinea pig doesn't have any particular favorite foods, opt for carrots, tomatoes, cucumbers, or broccoli. Unlike picky humans, guinea pigs love veggies. If veggies don't seem to work, try chopping some fruits instead, but don't give your guinea pig too much fruit as they only need a small amount every day."
                },
                {
                    "headline": "Hold some food in your hand to entice the guinea pig to walk up to you.",
                    "description": "Place some food in the palm of your hand with your fingers flat against the ground. If your guinea pig can smell and see the food, it should come running up and take some out of your hand — this is your opportunity to catch it. This is especially effective if you can see your guinea pig. If you can't, leave the food near where you last heard it and sit far away so it doesn't get scared by you. Calmly walk up to it once it starts snacking and gently pick it up with the palm of your hand."
                },
                {
                    "headline": "Pick up the guinea pig gently so you don't scare it away again.",
                    "description": "Avoid any sudden movements that could spook your pet and send it running away. Slowly and gently pick up your guinea pig under its belly and rump with the palms of your hands, then soothe it as you put it back in its cage. Your guinea pig will probably be anxious and scared from its big adventure, so be sure to give it plenty of treats and affection."
                }
            ]
        },
        {
            "name": "Using a Net and Fishing Line",
            "steps": [
                {
                    "headline": "Tie a piece of carrot, or another guinea pig favorite, to the end of a fishing line.",
                    "description": "To catch a lost guinea pig out in the world or one that is cautious around people, you won't be able to entice it with food in your hand. Tie a piece of carrot or another favorite treat, to the end of a fishing line at least 10 ft (3.0 m) long. Later on, you'll slowly pull the treat closer to you so you can catch it in the net. While carrots are generally loved by guinea pigs, feel free to use any other veggie or snack if they don't take to it. Broccoli is a good alternative as it is very easy to tie a string around the head."
                },
                {
                    "headline": "Place the food end of the string near the guinea pig and grab a net.",
                    "description": "Slowly and calmly walk up to the guinea pig's general location and place the food end of the string on the ground. Walk back to the length of the string and pull it just enough to make the string slightly taut without moving the food. Grab a net at least 5 ft (1.5 m) across and wait. Get a net that has holes small enough that a guinea pig can't escape. Opt for a mesh net if you would rather not risk it escaping at all. If you can't see the guinea pig or the end of the string from your hiding spot, it's essential that you tighten the string, as this allows you to feel when the string is being pulled from the other end. If the string is loose, you won't know when the guinea pig takes the bait."
                },
                {
                    "headline": "Pull the string slowly towards you once you see or feel the guinea pig.",
                    "description": "Stay very still and slowly pull the string towards you as soon as you feel the guinea pig pull the string or when you see it munching. This entices it to keep following the food towards you. Stay still and don't make noises so it doesn't get spooked as it gets closer. Pull the food towards you in tiny increments, maybe 1 in (2.5 cm) at a time. Any sudden movements could startle the guinea pig."
                },
                {
                    "headline": "Drop the net on the guinea pig when it gets very close to you.",
                    "description": "When the guinea pig is within 2 ft (0.61 m), drop your net on top of it. Don't throw the net or make sudden movements, instead raise the net slowly above the guinea pig as it eats its snack, and drop it from above. The guinea pig may freak out for a second, but this gives you a second or two to pick it up and carry it with you. If you find a lost guinea pig out in the wild, give it a little cage or box with bedding, water, and some food while you look for its rightful owner. Your local humane society can help you if you are not able to take care of it. Bring a pet guinea pig straight back to its cage and comfort it — it was probably pretty stressed and frightened being in a strange place."
                }
            ]
        },
        {
            "name": "Building a Stick and String Trap",
            "steps": [
                {
                    "headline": "Tie a long piece of string around a stick and cut it to the size of a box.",
                    "description": "Grab a string or fishing line at least 20 ft (6.1 m) long and tie one end tightly around a tall stick. Then, place the stick under one edge of a box with the bottom cut off — if the box balances, you don't need to cut the stick shorter. If the box tips over and doesn't balance on the stick, cut 1 in (2.5 cm) away until it stays on its own. The box should be tipped to the side with a large opening for the guinea pig to crawl into. The bottom should be cut away so you can trap the guinea pig. Opt for a box at least 2 ft (0.61 m) wide and .75 ft (0.23 m) tall, or two times as large as your target guinea pig."
                },
                {
                    "headline": "Set up the box with bait near the guinea pig, raising one edge with the stick.",
                    "description": "Once you've made sure the box stands on its own with an edge raised by the stick, bring it out to where you think the guinea pig is. Place it on the ground and set up the stick once again. Then, place a few different offerings at the end of the box touching the ground. While one piece of fruit or veggies is usually enough to entice a guinea pig, it's best to make a mix of different foods to better lure it into the trap. Use a mix of carrots, broccoli, and tomatoes for an easy and effective option."
                },
                {
                    "headline": "Find an obscured hiding spot nearby to watch the box.",
                    "description": "Walk away from the trap, keeping the string or fishing line loose so you don't accidentally spring the trap too early. Find a spot where you are obscured from sight but you can still see the box. It may take a short while for the guinea pig to come out of its hiding spot, so be patient but don't make too much noise. If you can, set up a remote camera pointed towards the box and step away to an even further distance. You will still be able to see the box and know when to pull the string, and the guinea pig may come out quickly as it won't be able to sense you nearby."
                },
                {
                    "headline": "Pull the string as soon as you see the guinea pig go for the food.",
                    "description": "When the guinea pig is tucked away in the trap munching on the bait, pull the string sharply to yank the stick away from the box. The box will fall flat against the ground, trapping the guinea pig. Move quickly towards the box so it doesn't burrow or chew its way out. It's best to wait until the guinea pig is towards the end of the box touching the ground. If you pull the stick while it's just barely under the trap, it's more likely that it will escape. If the guinea pig manages to get out of the trap, wait for a few minutes before you attempt to trap it again. It may take several attempts, but if you pull the string as it's eating it'll have less time to react."
                },
                {
                    "headline": "Place a piece of cardboard under the box and pick it up.",
                    "description": "If you pick up the box by the sides, the guinea pig will simply run away as soon as it sees an exit. Slide a piece of cardboard larger than the bottom of the box underneath and lift it by this piece. The guinea pig will have no means of escape, and you can bring it back home or start looking for its owner. If you are catching a lost guinea pig, look for its owner before you take it home for yourself or take it to your local humane society. This is similar to how you catch a spider by placing a glass upside-down over it, then sliding a piece of paper underneath so it can't escape."
                }
            ]
        }
    ],
    "tyn": [
        "Luring Guinea Pigs with Food",
        "Various snacks (carrots, tomatoes, cucumbers, broccoli)",
        "Using a Net and Fishing Line",
        "At least 10 ft (3.0 m) of fishing line",
        "5 ft (1.5 m) by 5 ft (1.5 m) mesh net",
        "Building a Stick and String Trap",
        "Medium box, with bottom cut away",
        "Piece of cardboard larger than the bottom of the box",
        "At least 20 ft (6.1 m) string or fishing line",
        "Stick"
    ],
    "text": " Catching a Guinea Pig in its Cage Put food in the cage and let your guinea pig go for it on its own. Put some veggies in the middle of your guinea pig's cage and let it come out and munch without your interference. It will smell you nearby, and start to associate your scent with the scent of food. Don't put your hand in yet or try to grab it — getting your guinea pig to stop hiding from you is all about building trust slowly. Some good veggies to choose from include carrots, broccoli, cucumber, or tomatoes. Place food on your hand to entice it towards you. After a few days, start putting food on your flat palm and let your guinea pig investigate the offering. It may be skittish at first, but eventually, it will overcome its fear for a tasty reward. Keep doing this every day until your guinea pig doesn't hesitate before you try to handle it. Pick up your pet from the front with each hand under the chest and rump. To avoid startling your guinea pig, pick it up by reaching slowly underneath its front side to cradle its chest, then use your other hand to support its backside. Moving slowly and in front of the guinea pig stops it from being surprised when you hold its chest, and holding its rump makes it feel more comfortable. Never grab, squeeze, toss, or mishandle a guinea pig. This is a surefire way to make it distrust you. Monitor your guinea pig for health problems if it hides or refuses to come out. If it doesn't come out when tasty treats are available, it could be a sign that your guinea pig is sick, especially if it is normally sociable and trusts you. Rodents and small animals tend to hide and stay quiet if they are injured. Try to find it in the cage, and inspect its body from outside the bars. Look for scratches, broken limbs, puffed-up fur, and irregular breathing patterns. Bring your guinea pig to a vet if you believe it's been hurt or is sick. Cover the guinea pig in a towel before trying to grab it. Guinea pigs are prey animals and can get skittish when they encounter new things. Herd your guinea pig into a corner of its cage and drape the towel over it. The darkness under the towel will help it calm down so you can easily grab them. Luring Guinea Pigs with Food Locate your pet guinea pig in the home by listening for it carefully. If your guinea pig has escaped into the house, it's usually easiest to find it and lure it out with its favorite foods. Turn off any distracting noises and listen carefully for anxious teeth grinding and the pitter-patter of your pet's feet. Once you're pretty sure you know where it is, you can start luring it out of it's hiding spot. If your guinea pig has somehow ended up in the wall or a place you can't reach, try luring it out with food before you start moving furniture and tearing up the home — they are easily scared by loud noises and it may go even deeper into its hiding place. Cut up your guinea pig's favorite foods nearby to release the scent. Guinea pigs, like many animals, navigate the world mainly through smells. If you cut up your pet guinea pig's favorite foods into chunks near its hiding spot, it may smell the foods and be enticed by the aroma. If your guinea pig doesn't have any particular favorite foods, opt for carrots, tomatoes, cucumbers, or broccoli. Unlike picky humans, guinea pigs love veggies. If veggies don't seem to work, try chopping some fruits instead, but don't give your guinea pig too much fruit as they only need a small amount every day. Hold some food in your hand to entice the guinea pig to walk up to you. Place some food in the palm of your hand with your fingers flat against the ground. If your guinea pig can smell and see the food, it should come running up and take some out of your hand — this is your opportunity to catch it. This is especially effective if you can see your guinea pig. If you can't, leave the food near where you last heard it and sit far away so it doesn't get scared by you. Calmly walk up to it once it starts snacking and gently pick it up with the palm of your hand. Pick up the guinea pig gently so you don't scare it away again. Avoid any sudden movements that could spook your pet and send it running away. Slowly and gently pick up your guinea pig under its belly and rump with the palms of your hands, then soothe it as you put it back in its cage. Your guinea pig will probably be anxious and scared from its big adventure, so be sure to give it plenty of treats and affection. Using a Net and Fishing Line Tie a piece of carrot, or another guinea pig favorite, to the end of a fishing line. To catch a lost guinea pig out in the world or one that is cautious around people, you won't be able to entice it with food in your hand. Tie a piece of carrot or another favorite treat, to the end of a fishing line at least 10 ft (3.0 m) long. Later on, you'll slowly pull the treat closer to you so you can catch it in the net. While carrots are generally loved by guinea pigs, feel free to use any other veggie or snack if they don't take to it. Broccoli is a good alternative as it is very easy to tie a string around the head. Place the food end of the string near the guinea pig and grab a net. Slowly and calmly walk up to the guinea pig's general location and place the food end of the string on the ground. Walk back to the length of the string and pull it just enough to make the string slightly taut without moving the food. Grab a net at least 5 ft (1.5 m) across and wait. Get a net that has holes small enough that a guinea pig can't escape. Opt for a mesh net if you would rather not risk it escaping at all. If you can't see the guinea pig or the end of the string from your hiding spot, it's essential that you tighten the string, as this allows you to feel when the string is being pulled from the other end. If the string is loose, you won't know when the guinea pig takes the bait. Pull the string slowly towards you once you see or feel the guinea pig. Stay very still and slowly pull the string towards you as soon as you feel the guinea pig pull the string or when you see it munching. This entices it to keep following the food towards you. Stay still and don't make noises so it doesn't get spooked as it gets closer. Pull the food towards you in tiny increments, maybe 1 in (2.5 cm) at a time. Any sudden movements could startle the guinea pig. Drop the net on the guinea pig when it gets very close to you. When the guinea pig is within 2 ft (0.61 m), drop your net on top of it. Don't throw the net or make sudden movements, instead raise the net slowly above the guinea pig as it eats its snack, and drop it from above. The guinea pig may freak out for a second, but this gives you a second or two to pick it up and carry it with you. If you find a lost guinea pig out in the wild, give it a little cage or box with bedding, water, and some food while you look for its rightful owner. Your local humane society can help you if you are not able to take care of it. Bring a pet guinea pig straight back to its cage and comfort it — it was probably pretty stressed and frightened being in a strange place. Building a Stick and String Trap Tie a long piece of string around a stick and cut it to the size of a box. Grab a string or fishing line at least 20 ft (6.1 m) long and tie one end tightly around a tall stick. Then, place the stick under one edge of a box with the bottom cut off — if the box balances, you don't need to cut the stick shorter. If the box tips over and doesn't balance on the stick, cut 1 in (2.5 cm) away until it stays on its own. The box should be tipped to the side with a large opening for the guinea pig to crawl into. The bottom should be cut away so you can trap the guinea pig. Opt for a box at least 2 ft (0.61 m) wide and .75 ft (0.23 m) tall, or two times as large as your target guinea pig. Set up the box with bait near the guinea pig, raising one edge with the stick. Once you've made sure the box stands on its own with an edge raised by the stick, bring it out to where you think the guinea pig is. Place it on the ground and set up the stick once again. Then, place a few different offerings at the end of the box touching the ground. While one piece of fruit or veggies is usually enough to entice a guinea pig, it's best to make a mix of different foods to better lure it into the trap. Use a mix of carrots, broccoli, and tomatoes for an easy and effective option. Find an obscured hiding spot nearby to watch the box. Walk away from the trap, keeping the string or fishing line loose so you don't accidentally spring the trap too early. Find a spot where you are obscured from sight but you can still see the box. It may take a short while for the guinea pig to come out of its hiding spot, so be patient but don't make too much noise. If you can, set up a remote camera pointed towards the box and step away to an even further distance. You will still be able to see the box and know when to pull the string, and the guinea pig may come out quickly as it won't be able to sense you nearby. Pull the string as soon as you see the guinea pig go for the food. When the guinea pig is tucked away in the trap munching on the bait, pull the string sharply to yank the stick away from the box. The box will fall flat against the ground, trapping the guinea pig. Move quickly towards the box so it doesn't burrow or chew its way out. It's best to wait until the guinea pig is towards the end of the box touching the ground. If you pull the stick while it's just barely under the trap, it's more likely that it will escape. If the guinea pig manages to get out of the trap, wait for a few minutes before you attempt to trap it again. It may take several attempts, but if you pull the string as it's eating it'll have less time to react. Place a piece of cardboard under the box and pick it up. If you pick up the box by the sides, the guinea pig will simply run away as soon as it sees an exit. Slide a piece of cardboard larger than the bottom of the box underneath and lift it by this piece. The guinea pig will have no means of escape, and you can bring it back home or start looking for its owner. If you are catching a lost guinea pig, look for its owner before you take it home for yourself or take it to your local humane society. This is similar to how you catch a spider by placing a glass upside-down over it, then sliding a piece of paper underneath so it can't escape.",
    "sentences": [
        " Catching a Guinea Pig in its Cage Put food in the cage and let your guinea pig go for it on its own.",
        "Put some veggies in the middle of your guinea pig's cage and let it come out and munch without your interference.",
        "It will smell you nearby, and start to associate your scent with the scent of food.",
        "Don't put your hand in yet or try to grab it — getting your guinea pig to stop hiding from you is all about building trust slowly.",
        "Some good veggies to choose from include carrots, broccoli, cucumber, or tomatoes.",
        "Place food on your hand to entice it towards you.",
        "After a few days, start putting food on your flat palm and let your guinea pig investigate the offering.",
        "It may be skittish at first, but eventually, it will overcome its fear for a tasty reward.",
        "Keep doing this every day until your guinea pig doesn't hesitate before you try to handle it.",
        "Pick up your pet from the front with each hand under the chest and rump.",
        "To avoid startling your guinea pig, pick it up by reaching slowly underneath its front side to cradle its chest, then use your other hand to support its backside.",
        "Moving slowly and in front of the guinea pig stops it from being surprised when you hold its chest, and holding its rump makes it feel more comfortable.",
        "Never grab, squeeze, toss, or mishandle a guinea pig.",
        "This is a surefire way to make it distrust you.",
        "Monitor your guinea pig for health problems if it hides or refuses to come out.",
        "If it doesn't come out when tasty treats are available, it could be a sign that your guinea pig is sick, especially if it is normally sociable and trusts you.",
        "Rodents and small animals tend to hide and stay quiet if they are injured.",
        "Try to find it in the cage, and inspect its body from outside the bars.",
        "Look for scratches, broken limbs, puffed-up fur, and irregular breathing patterns.",
        "Bring your guinea pig to a vet if you believe it's been hurt or is sick.",
        "Cover the guinea pig in a towel before trying to grab it.",
        "Guinea pigs are prey animals and can get skittish when they encounter new things.",
        "Herd your guinea pig into a corner of its cage and drape the towel over it.",
        "The darkness under the towel will help it calm down so you can easily grab them.",
        "Luring Guinea Pigs with Food Locate your pet guinea pig in the home by listening for it carefully.",
        "If your guinea pig has escaped into the house, it's usually easiest to find it and lure it out with its favorite foods.",
        "Turn off any distracting noises and listen carefully for anxious teeth grinding and the pitter-patter of your pet's feet.",
        "Once you're pretty sure you know where it is, you can start luring it out of it's hiding spot.",
        "If your guinea pig has somehow ended up in the wall or a place you can't reach, try luring it out with food before you start moving furniture and tearing up the home — they are easily scared by loud noises and it may go even deeper into its hiding place.",
        "Cut up your guinea pig's favorite foods nearby to release the scent.",
        "Guinea pigs, like many animals, navigate the world mainly through smells.",
        "If you cut up your pet guinea pig's favorite foods into chunks near its hiding spot, it may smell the foods and be enticed by the aroma.",
        "If your guinea pig doesn't have any particular favorite foods, opt for carrots, tomatoes, cucumbers, or broccoli.",
        "Unlike picky humans, guinea pigs love veggies.",
        "If veggies don't seem to work, try chopping some fruits instead, but don't give your guinea pig too much fruit as they only need a small amount every day.",
        "Hold some food in your hand to entice the guinea pig to walk up to you.",
        "Place some food in the palm of your hand with your fingers flat against the ground.",
        "If your guinea pig can smell and see the food, it should come running up and take some out of your hand — this is your opportunity to catch it.",
        "This is especially effective if you can see your guinea pig.",
        "If you can't, leave the food near where you last heard it and sit far away so it doesn't get scared by you.",
        "Calmly walk up to it once it starts snacking and gently pick it up with the palm of your hand.",
        "Pick up the guinea pig gently so you don't scare it away again.",
        "Avoid any sudden movements that could spook your pet and send it running away.",
        "Slowly and gently pick up your guinea pig under its belly and rump with the palms of your hands, then soothe it as you put it back in its cage.",
        "Your guinea pig will probably be anxious and scared from its big adventure, so be sure to give it plenty of treats and affection.",
        "Using a Net and Fishing Line Tie a piece of carrot, or another guinea pig favorite, to the end of a fishing line.",
        "To catch a lost guinea pig out in the world or one that is cautious around people, you won't be able to entice it with food in your hand.",
        "Tie a piece of carrot or another favorite treat, to the end of a fishing line at least 10 ft (3.0 m) long.",
        "Later on, you'll slowly pull the treat closer to you so you can catch it in the net.",
        "While carrots are generally loved by guinea pigs, feel free to use any other veggie or snack if they don't take to it.",
        "Broccoli is a good alternative as it is very easy to tie a string around the head.",
        "Place the food end of the string near the guinea pig and grab a net.",
        "Slowly and calmly walk up to the guinea pig's general location and place the food end of the string on the ground.",
        "Walk back to the length of the string and pull it just enough to make the string slightly taut without moving the food.",
        "Grab a net at least 5 ft (1.5 m) across and wait.",
        "Get a net that has holes small enough that a guinea pig can't escape.",
        "Opt for a mesh net if you would rather not risk it escaping at all.",
        "If you can't see the guinea pig or the end of the string from your hiding spot, it's essential that you tighten the string, as this allows you to feel when the string is being pulled from the other end.",
        "If the string is loose, you won't know when the guinea pig takes the bait.",
        "Pull the string slowly towards you once you see or feel the guinea pig.",
        "Stay very still and slowly pull the string towards you as soon as you feel the guinea pig pull the string or when you see it munching.",
        "This entices it to keep following the food towards you.",
        "Stay still and don't make noises so it doesn't get spooked as it gets closer.",
        "Pull the food towards you in tiny increments, maybe 1 in (2.5 cm) at a time.",
        "Any sudden movements could startle the guinea pig.",
        "Drop the net on the guinea pig when it gets very close to you.",
        "When the guinea pig is within 2 ft (0.61 m), drop your net on top of it.",
        "Don't throw the net or make sudden movements, instead raise the net slowly above the guinea pig as it eats its snack, and drop it from above.",
        "The guinea pig may freak out for a second, but this gives you a second or two to pick it up and carry it with you.",
        "If you find a lost guinea pig out in the wild, give it a little cage or box with bedding, water, and some food while you look for its rightful owner.",
        "Your local humane society can help you if you are not able to take care of it.",
        "Bring a pet guinea pig straight back to its cage and comfort it — it was probably pretty stressed and frightened being in a strange place.",
        "Building a Stick and String Trap Tie a long piece of string around a stick and cut it to the size of a box.",
        "Grab a string or fishing line at least 20 ft (6.1 m) long and tie one end tightly around a tall stick.",
        "Then, place the stick under one edge of a box with the bottom cut off — if the box balances, you don't need to cut the stick shorter.",
        "If the box tips over and doesn't balance on the stick, cut 1 in (2.5 cm) away until it stays on its own.",
        "The box should be tipped to the side with a large opening for the guinea pig to crawl into.",
        "The bottom should be cut away so you can trap the guinea pig.",
        "Opt for a box at least 2 ft (0.61 m) wide and .75 ft (0.23 m) tall, or two times as large as your target guinea pig.",
        "Set up the box with bait near the guinea pig, raising one edge with the stick.",
        "Once you've made sure the box stands on its own with an edge raised by the stick, bring it out to where you think the guinea pig is.",
        "Place it on the ground and set up the stick once again.",
        "Then, place a few different offerings at the end of the box touching the ground.",
        "While one piece of fruit or veggies is usually enough to entice a guinea pig, it's best to make a mix of different foods to better lure it into the trap.",
        "Use a mix of carrots, broccoli, and tomatoes for an easy and effective option.",
        "Find an obscured hiding spot nearby to watch the box.",
        "Walk away from the trap, keeping the string or fishing line loose so you don't accidentally spring the trap too early.",
        "Find a spot where you are obscured from sight but you can still see the box.",
        "It may take a short while for the guinea pig to come out of its hiding spot, so be patient but don't make too much noise.",
        "If you can, set up a remote camera pointed towards the box and step away to an even further distance.",
        "You will still be able to see the box and know when to pull the string, and the guinea pig may come out quickly as it won't be able to sense you nearby.",
        "Pull the string as soon as you see the guinea pig go for the food.",
        "When the guinea pig is tucked away in the trap munching on the bait, pull the string sharply to yank the stick away from the box.",
        "The box will fall flat against the ground, trapping the guinea pig.",
        "Move quickly towards the box so it doesn't burrow or chew its way out.",
        "It's best to wait until the guinea pig is towards the end of the box touching the ground.",
        "If you pull the stick while it's just barely under the trap, it's more likely that it will escape.",
        "If the guinea pig manages to get out of the trap, wait for a few minutes before you attempt to trap it again.",
        "It may take several attempts, but if you pull the string as it's eating it'll have less time to react.",
        "Place a piece of cardboard under the box and pick it up.",
        "If you pick up the box by the sides, the guinea pig will simply run away as soon as it sees an exit.",
        "Slide a piece of cardboard larger than the bottom of the box underneath and lift it by this piece.",
        "The guinea pig will have no means of escape, and you can bring it back home or start looking for its owner.",
        "If you are catching a lost guinea pig, look for its owner before you take it home for yourself or take it to your local humane society.",
        "This is similar to how you catch a spider by placing a glass upside-down over it, then sliding a piece of paper underneath so it can't escape."
    ]
}