{
    "title": "How to Introduce Two Guinea Pigs to Each Other",
    "url": "https://www.wikihow.com/Introduce-Two-Guinea-Pigs-to-Each-Other",
    "category_hierarchy": [
        "Pets and Animals",
        "Rodents",
        "Guinea Pigs",
        "Guinea Pig Socialization"
    ],
    "parts": [
        {
            "name": "Understanding the Role of Sex",
            "steps": [
                {
                    "headline": "Determine the sex of your guinea pigs.",
                    "description": "Sex makes a big deal when it comes to how guinea pigs interact with one another. Before you introduce them, you must determine their sex. Pet shop employees often make mistakes, and if you're buying a guinea pig from a pet store the chance of error is even higher. You should examine your guinea pig on the floor or a very low table. This way, if they get away they will not injure themselves falling. Handle your guinea pig gently, but keep a firm hold around their chest and shoulders. Spread their back legs apart to examine their genitals. The distance between the genitals and anus is greater in males than females. The genital opening of male guinea pigs is shaped like a circular dot, while the genital opening of females forms a Y-shape. For a decisive test, feel just above the genitals. In a female, this area will be soft, but in a male, you will feel a bone. Push in and up (towards the guinea pig's head) from this point. In a male, this will make the penis come out, whereas you will see no change in a female."
                },
                {
                    "headline": "Know which combinations work best.",
                    "description": "Certain pairs work better than others when it comes to guinea pigs. Younger pigs are easier to introduce. They start on a more or less blank slate and then grow and change together. If you already have an older guinea pig, getting a baby of the same sex is a good choice. The adult will not feel as threatened by a baby and its dominance will not be challenged. Its best to neuter males before introducing them to females; however, neutered or not, never place more than one male in a group with females. They will fight over the female's attention. Adult females tend to get along more readily than adult males. Understand that if you house two normal (not fixed) guinea pigs of different sex (one male and one female) together, you will end up with babies. Pregnancy is extremely dangerous for both moms and babies (1/4 of sows die as a result of having babies), so avoid this at all costs."
                },
                {
                    "headline": "Make special accommodations if you have two adult males.",
                    "description": "Male guinea pigs are very territorial, and if you're introducing two adult males take certain precautions. A spacious cage is key to males living in harmony. Provide them with their own space to eat, hide, sleep, and play — provide two of everything. Ensure that hiding houses have two entrances so that one guinea pig cannot trap the other."
                }
            ]
        },
        {
            "name": "Introducing the Guinea Pigs",
            "steps": [
                {
                    "headline": "Quarantine the new guinea pig.",
                    "description": "You should keep your guinea pigs separate from one another in a different room for the first two to three weeks. You will need to have the new guinea checked out by a vet during this time to ensure they are healthy. Do not let them have physical contact until this time period is up. Placing the new guinea pig directly in the cage with a new one can cause undue stress as they must be eased into a new environment, and their presence may cause the current pig to become territorial. In addition to the emotional concerns, many guinea pig illnesses, which are easily spread at pet and department stores, can incubate for long periods. You need to make sure your new guinea shows no signs of sickness before introducing them to your old guinea. Put the guinea pigs in separate cages next to each other. Position the cages in such a way that the guinea pigs cannot see each other but can smell and hear one another."
                },
                {
                    "headline": "Introduce them on a neutral ground.",
                    "description": "Once the two to three week quarantine period has passed, it's time to introduce the guinea pigs. However, do not place the new guinea pig in the cage right away as it's best to introduce them on neutral ground so neither guinea pig feels their territory is being threatened. Find a new territory where neither guinea pig has been before, but that is a secluded and quiet place where both guinea pigs will feel safe. On the floor of a closed-off and small room, such as a bathroom, is a good option. Put veggies, treats, and hay in the center of the area to distract the guinea pigs from fighting as they get accustomed to one another's presence. In case the guinea pigs get physically aggressive, you should have old towels on hand. You can use towels to restrain the guinea pigs while avoiding getting scratched yourself. If it goes well, and the guinea pigs have not fought for over two hours, you will be able to introduce them to the same cage. Ensure that the cage has been thoroughly cleaned, and all the toys re-arranged to make it seem like a new cage."
                },
                {
                    "headline": "Take precautions before putting the guinea pigs in a cage together.",
                    "description": "After the guinea pigs have been introduced, there are steps you can take to smoothen the transition before placing them in the same cage. Make adjustments to the cage. Guinea pigs are territorial, so make sure your cage has enough space. As a general rule, a cage between 7.5 and 10.5 square feet is recommended for two guinea pigs. More room is preferred, and if you're housing three or more guinea pigs aim for at least 13 square feet. Rearrange and wash the cage so it will smell new and feel more like neutral territory for both guinea pigs. Gently rub hay from the old cage on the new guinea pig so he smells more like the rest of the herd."
                }
            ]
        },
        {
            "name": "Knowing When to Intervene",
            "steps": [
                {
                    "headline": "Recognize aggressive body language.",
                    "description": "The first few weeks for guinea pig cohabitation can be rough, and you should expect some tension between your pets. Know what the signs of aggression are and what body language is a signal for you to intervene. Mounting or jumping over one another can lead to aggression if one guinea pig resists or retaliates. Keep an eye on this behavior, but do not intervene unless it leads to fighting. Squealing, chasing, and teeth chattering are common in the first few weeks. Guinea pigs may also gently nip one another if annoyed, and such behaviors are necessary to establish boundaries between the guinea pigs. Only intervene if the guinea pigs are biting hard enough to inflict wounds. If one guinea pig is constantly chattering his teeth, this is a sign of aggression that could grow serious. Watch carefully, but do not separate unless blood is drawn. Raised hair, especially around the neck, and feet stamping are signs guinea pigs are preparing to fight. This can occur but watch carefully. Do not separate unless blood is drawn."
                },
                {
                    "headline": "Understand that humping each other is perfectly normal.",
                    "description": "Again, do not separate unless blood is drawn. Two males or two females humping each other is not an intended sexual interaction, it's their method of establishing dominance. Mounting does not necessarily mean your guinea pig is a boar, or mating."
                },
                {
                    "headline": "Recognize normal interaction.",
                    "description": "Not all body language is a bad sign. There are certain behaviors that are normal, especially early on, and you should be able to recognize these gestures so you do not intervene unnecessarily. Bottom sniffing and nudging is a guinea pig's way of greeting a new companion. This is normal and non-threatening behavior. Your guinea pigs may also want to establish their territory by dragging their bottoms across the ground or raising their heads up on occasion to expression dominance, behaviors that are normal during the first few weeks. Guinea pigs sometimes engage in a behavior called rumble strutting. This is when they walk  with their hips swaying and their fur puffed out while making a rumbling sound. This is an expression of dominance and unless it's followed up by aggressive gestures it's usually a normal part of establishing the pecking order. Don't be afraid of squealing sounds. Although guinea pigs can make shrill noises that may sound like pain, it is just their way of saying that they submit to the more dominant pig."
                },
                {
                    "headline": "Break up fights when necessary.",
                    "description": "If fights start to get bloody, you need to intervene. Know how to do so safely to diminish harm for yourself and your pets. Act quickly. Guinea pigs have sharp teeth and are capable of inflicting serious harm on one another. If you notice aggressive fighting, separate them immediately. Guinea pigs can cause permanent injury and disabilities to one another if left unchecked. Do not intervene with your bare hands. An irate guinea pig can cause injuries to you that are serious enough to warrant medical attention. Cover the animal with an old towel or rag or use heavy gloves while separating them. Separate the guinea pigs after the fight. Keep them in different cages, but in the same room so that they can see, smell, hear, and talk to each other. Continue handling them with gloves or a towel for a few hours after the fight, as they can remain skittish and aggressive for a while after a confrontation. Reintroduce them slowly, once again introducing them on a neutral ground with treats and food as distractions. Depending on the severity of the fight, wait a few hours to a few days. Keep protective gear on hand in case the fight resumes."
                },
                {
                    "headline": "Don't be discouraged if they don't get along.",
                    "description": "Some guinea pigs may simply not get along, even after you follow the proper protocol introducing them. You need to be prepared for this. It's a risk when introducing a new guinea pig to your pack. Do not feel as if this is your fault. Nature simply works this way, and guinea pigs have different personalities. Some may be more independent and aggressive and therefore harder to introduce to a companion. Even when you do all the right things, guinea pigs are sometimes simply not compatible with one another. If the first introduction leads to an excess of fighting, you can restart the introduction process, beginning again with the quarantine period. This gives the guinea pigs time to cool off and forget any previous hostilities. If guinea pigs are simply not getting along, you can always keep them in separate cages where they can smell, see, and hear one another but cannot physically interact. They get the benefits of some social interaction but without the stress of a hostile environment."
                }
            ]
        }
    ],
    "tyn": [
        "Two cages",
        "Food",
        "Treats",
        "Veggies",
        "Old towels and rags",
        "Heavy gloves"
    ],
    "text": " Understanding the Role of Sex Determine the sex of your guinea pigs. Sex makes a big deal when it comes to how guinea pigs interact with one another. Before you introduce them, you must determine their sex. Pet shop employees often make mistakes, and if you're buying a guinea pig from a pet store the chance of error is even higher. You should examine your guinea pig on the floor or a very low table. This way, if they get away they will not injure themselves falling. Handle your guinea pig gently, but keep a firm hold around their chest and shoulders. Spread their back legs apart to examine their genitals. The distance between the genitals and anus is greater in males than females. The genital opening of male guinea pigs is shaped like a circular dot, while the genital opening of females forms a Y-shape. For a decisive test, feel just above the genitals. In a female, this area will be soft, but in a male, you will feel a bone. Push in and up (towards the guinea pig's head) from this point. In a male, this will make the penis come out, whereas you will see no change in a female. Know which combinations work best. Certain pairs work better than others when it comes to guinea pigs. Younger pigs are easier to introduce. They start on a more or less blank slate and then grow and change together. If you already have an older guinea pig, getting a baby of the same sex is a good choice. The adult will not feel as threatened by a baby and its dominance will not be challenged. Its best to neuter males before introducing them to females; however, neutered or not, never place more than one male in a group with females. They will fight over the female's attention. Adult females tend to get along more readily than adult males. Understand that if you house two normal (not fixed) guinea pigs of different sex (one male and one female) together, you will end up with babies. Pregnancy is extremely dangerous for both moms and babies (1/4 of sows die as a result of having babies), so avoid this at all costs. Make special accommodations if you have two adult males. Male guinea pigs are very territorial, and if you're introducing two adult males take certain precautions. A spacious cage is key to males living in harmony. Provide them with their own space to eat, hide, sleep, and play — provide two of everything. Ensure that hiding houses have two entrances so that one guinea pig cannot trap the other. Introducing the Guinea Pigs Quarantine the new guinea pig. You should keep your guinea pigs separate from one another in a different room for the first two to three weeks. You will need to have the new guinea checked out by a vet during this time to ensure they are healthy. Do not let them have physical contact until this time period is up. Placing the new guinea pig directly in the cage with a new one can cause undue stress as they must be eased into a new environment, and their presence may cause the current pig to become territorial. In addition to the emotional concerns, many guinea pig illnesses, which are easily spread at pet and department stores, can incubate for long periods. You need to make sure your new guinea shows no signs of sickness before introducing them to your old guinea. Put the guinea pigs in separate cages next to each other. Position the cages in such a way that the guinea pigs cannot see each other but can smell and hear one another. Introduce them on a neutral ground. Once the two to three week quarantine period has passed, it's time to introduce the guinea pigs. However, do not place the new guinea pig in the cage right away as it's best to introduce them on neutral ground so neither guinea pig feels their territory is being threatened. Find a new territory where neither guinea pig has been before, but that is a secluded and quiet place where both guinea pigs will feel safe. On the floor of a closed-off and small room, such as a bathroom, is a good option. Put veggies, treats, and hay in the center of the area to distract the guinea pigs from fighting as they get accustomed to one another's presence. In case the guinea pigs get physically aggressive, you should have old towels on hand. You can use towels to restrain the guinea pigs while avoiding getting scratched yourself. If it goes well, and the guinea pigs have not fought for over two hours, you will be able to introduce them to the same cage. Ensure that the cage has been thoroughly cleaned, and all the toys re-arranged to make it seem like a new cage. Take precautions before putting the guinea pigs in a cage together. After the guinea pigs have been introduced, there are steps you can take to smoothen the transition before placing them in the same cage. Make adjustments to the cage. Guinea pigs are territorial, so make sure your cage has enough space. As a general rule, a cage between 7.5 and 10.5 square feet is recommended for two guinea pigs. More room is preferred, and if you're housing three or more guinea pigs aim for at least 13 square feet. Rearrange and wash the cage so it will smell new and feel more like neutral territory for both guinea pigs. Gently rub hay from the old cage on the new guinea pig so he smells more like the rest of the herd. Knowing When to Intervene Recognize aggressive body language. The first few weeks for guinea pig cohabitation can be rough, and you should expect some tension between your pets. Know what the signs of aggression are and what body language is a signal for you to intervene. Mounting or jumping over one another can lead to aggression if one guinea pig resists or retaliates. Keep an eye on this behavior, but do not intervene unless it leads to fighting. Squealing, chasing, and teeth chattering are common in the first few weeks. Guinea pigs may also gently nip one another if annoyed, and such behaviors are necessary to establish boundaries between the guinea pigs. Only intervene if the guinea pigs are biting hard enough to inflict wounds. If one guinea pig is constantly chattering his teeth, this is a sign of aggression that could grow serious. Watch carefully, but do not separate unless blood is drawn. Raised hair, especially around the neck, and feet stamping are signs guinea pigs are preparing to fight. This can occur but watch carefully. Do not separate unless blood is drawn. Understand that humping each other is perfectly normal. Again, do not separate unless blood is drawn. Two males or two females humping each other is not an intended sexual interaction, it's their method of establishing dominance. Mounting does not necessarily mean your guinea pig is a boar, or mating. Recognize normal interaction. Not all body language is a bad sign. There are certain behaviors that are normal, especially early on, and you should be able to recognize these gestures so you do not intervene unnecessarily. Bottom sniffing and nudging is a guinea pig's way of greeting a new companion. This is normal and non-threatening behavior. Your guinea pigs may also want to establish their territory by dragging their bottoms across the ground or raising their heads up on occasion to expression dominance, behaviors that are normal during the first few weeks. Guinea pigs sometimes engage in a behavior called rumble strutting. This is when they walk  with their hips swaying and their fur puffed out while making a rumbling sound. This is an expression of dominance and unless it's followed up by aggressive gestures it's usually a normal part of establishing the pecking order. Don't be afraid of squealing sounds. Although guinea pigs can make shrill noises that may sound like pain, it is just their way of saying that they submit to the more dominant pig. Break up fights when necessary. If fights start to get bloody, you need to intervene. Know how to do so safely to diminish harm for yourself and your pets. Act quickly. Guinea pigs have sharp teeth and are capable of inflicting serious harm on one another. If you notice aggressive fighting, separate them immediately. Guinea pigs can cause permanent injury and disabilities to one another if left unchecked. Do not intervene with your bare hands. An irate guinea pig can cause injuries to you that are serious enough to warrant medical attention. Cover the animal with an old towel or rag or use heavy gloves while separating them. Separate the guinea pigs after the fight. Keep them in different cages, but in the same room so that they can see, smell, hear, and talk to each other. Continue handling them with gloves or a towel for a few hours after the fight, as they can remain skittish and aggressive for a while after a confrontation. Reintroduce them slowly, once again introducing them on a neutral ground with treats and food as distractions. Depending on the severity of the fight, wait a few hours to a few days. Keep protective gear on hand in case the fight resumes. Don't be discouraged if they don't get along. Some guinea pigs may simply not get along, even after you follow the proper protocol introducing them. You need to be prepared for this. It's a risk when introducing a new guinea pig to your pack. Do not feel as if this is your fault. Nature simply works this way, and guinea pigs have different personalities. Some may be more independent and aggressive and therefore harder to introduce to a companion. Even when you do all the right things, guinea pigs are sometimes simply not compatible with one another. If the first introduction leads to an excess of fighting, you can restart the introduction process, beginning again with the quarantine period. This gives the guinea pigs time to cool off and forget any previous hostilities. If guinea pigs are simply not getting along, you can always keep them in separate cages where they can smell, see, and hear one another but cannot physically interact. They get the benefits of some social interaction but without the stress of a hostile environment.",
    "sentences": [
        " Understanding the Role of Sex Determine the sex of your guinea pigs.",
        "Sex makes a big deal when it comes to how guinea pigs interact with one another.",
        "Before you introduce them, you must determine their sex.",
        "Pet shop employees often make mistakes, and if you're buying a guinea pig from a pet store the chance of error is even higher.",
        "You should examine your guinea pig on the floor or a very low table.",
        "This way, if they get away they will not injure themselves falling.",
        "Handle your guinea pig gently, but keep a firm hold around their chest and shoulders.",
        "Spread their back legs apart to examine their genitals.",
        "The distance between the genitals and anus is greater in males than females.",
        "The genital opening of male guinea pigs is shaped like a circular dot, while the genital opening of females forms a Y-shape.",
        "For a decisive test, feel just above the genitals.",
        "In a female, this area will be soft, but in a male, you will feel a bone.",
        "Push in and up (towards the guinea pig's head) from this point.",
        "In a male, this will make the penis come out, whereas you will see no change in a female.",
        "Know which combinations work best.",
        "Certain pairs work better than others when it comes to guinea pigs.",
        "Younger pigs are easier to introduce.",
        "They start on a more or less blank slate and then grow and change together.",
        "If you already have an older guinea pig, getting a baby of the same sex is a good choice.",
        "The adult will not feel as threatened by a baby and its dominance will not be challenged.",
        "Its best to neuter males before introducing them to females; however, neutered or not, never place more than one male in a group with females.",
        "They will fight over the female's attention.",
        "Adult females tend to get along more readily than adult males.",
        "Understand that if you house two normal (not fixed) guinea pigs of different sex (one male and one female) together, you will end up with babies.",
        "Pregnancy is extremely dangerous for both moms and babies (1/4 of sows die as a result of having babies), so avoid this at all costs.",
        "Make special accommodations if you have two adult males.",
        "Male guinea pigs are very territorial, and if you're introducing two adult males take certain precautions.",
        "A spacious cage is key to males living in harmony.",
        "Provide them with their own space to eat, hide, sleep, and play — provide two of everything.",
        "Ensure that hiding houses have two entrances so that one guinea pig cannot trap the other.",
        "Introducing the Guinea Pigs Quarantine the new guinea pig.",
        "You should keep your guinea pigs separate from one another in a different room for the first two to three weeks.",
        "You will need to have the new guinea checked out by a vet during this time to ensure they are healthy.",
        "Do not let them have physical contact until this time period is up.",
        "Placing the new guinea pig directly in the cage with a new one can cause undue stress as they must be eased into a new environment, and their presence may cause the current pig to become territorial.",
        "In addition to the emotional concerns, many guinea pig illnesses, which are easily spread at pet and department stores, can incubate for long periods.",
        "You need to make sure your new guinea shows no signs of sickness before introducing them to your old guinea.",
        "Put the guinea pigs in separate cages next to each other.",
        "Position the cages in such a way that the guinea pigs cannot see each other but can smell and hear one another.",
        "Introduce them on a neutral ground.",
        "Once the two to three week quarantine period has passed, it's time to introduce the guinea pigs.",
        "However, do not place the new guinea pig in the cage right away as it's best to introduce them on neutral ground so neither guinea pig feels their territory is being threatened.",
        "Find a new territory where neither guinea pig has been before, but that is a secluded and quiet place where both guinea pigs will feel safe.",
        "On the floor of a closed-off and small room, such as a bathroom, is a good option.",
        "Put veggies, treats, and hay in the center of the area to distract the guinea pigs from fighting as they get accustomed to one another's presence.",
        "In case the guinea pigs get physically aggressive, you should have old towels on hand.",
        "You can use towels to restrain the guinea pigs while avoiding getting scratched yourself.",
        "If it goes well, and the guinea pigs have not fought for over two hours, you will be able to introduce them to the same cage.",
        "Ensure that the cage has been thoroughly cleaned, and all the toys re-arranged to make it seem like a new cage.",
        "Take precautions before putting the guinea pigs in a cage together.",
        "After the guinea pigs have been introduced, there are steps you can take to smoothen the transition before placing them in the same cage.",
        "Make adjustments to the cage.",
        "Guinea pigs are territorial, so make sure your cage has enough space.",
        "As a general rule, a cage between 7.5 and 10.5 square feet is recommended for two guinea pigs.",
        "More room is preferred, and if you're housing three or more guinea pigs aim for at least 13 square feet.",
        "Rearrange and wash the cage so it will smell new and feel more like neutral territory for both guinea pigs.",
        "Gently rub hay from the old cage on the new guinea pig so he smells more like the rest of the herd.",
        "Knowing When to Intervene Recognize aggressive body language.",
        "The first few weeks for guinea pig cohabitation can be rough, and you should expect some tension between your pets.",
        "Know what the signs of aggression are and what body language is a signal for you to intervene.",
        "Mounting or jumping over one another can lead to aggression if one guinea pig resists or retaliates.",
        "Keep an eye on this behavior, but do not intervene unless it leads to fighting.",
        "Squealing, chasing, and teeth chattering are common in the first few weeks.",
        "Guinea pigs may also gently nip one another if annoyed, and such behaviors are necessary to establish boundaries between the guinea pigs.",
        "Only intervene if the guinea pigs are biting hard enough to inflict wounds.",
        "If one guinea pig is constantly chattering his teeth, this is a sign of aggression that could grow serious.",
        "Watch carefully, but do not separate unless blood is drawn.",
        "Raised hair, especially around the neck, and feet stamping are signs guinea pigs are preparing to fight.",
        "This can occur but watch carefully.",
        "Do not separate unless blood is drawn.",
        "Understand that humping each other is perfectly normal.",
        "Again, do not separate unless blood is drawn.",
        "Two males or two females humping each other is not an intended sexual interaction, it's their method of establishing dominance.",
        "Mounting does not necessarily mean your guinea pig is a boar, or mating.",
        "Recognize normal interaction.",
        "Not all body language is a bad sign.",
        "There are certain behaviors that are normal, especially early on, and you should be able to recognize these gestures so you do not intervene unnecessarily.",
        "Bottom sniffing and nudging is a guinea pig's way of greeting a new companion.",
        "This is normal and non-threatening behavior.",
        "Your guinea pigs may also want to establish their territory by dragging their bottoms across the ground or raising their heads up on occasion to expression dominance, behaviors that are normal during the first few weeks.",
        "Guinea pigs sometimes engage in a behavior called rumble strutting.",
        "This is when they walk  with their hips swaying and their fur puffed out while making a rumbling sound.",
        "This is an expression of dominance and unless it's followed up by aggressive gestures it's usually a normal part of establishing the pecking order.",
        "Don't be afraid of squealing sounds.",
        "Although guinea pigs can make shrill noises that may sound like pain, it is just their way of saying that they submit to the more dominant pig.",
        "Break up fights when necessary.",
        "If fights start to get bloody, you need to intervene.",
        "Know how to do so safely to diminish harm for yourself and your pets.",
        "Act quickly.",
        "Guinea pigs have sharp teeth and are capable of inflicting serious harm on one another.",
        "If you notice aggressive fighting, separate them immediately.",
        "Guinea pigs can cause permanent injury and disabilities to one another if left unchecked.",
        "Do not intervene with your bare hands.",
        "An irate guinea pig can cause injuries to you that are serious enough to warrant medical attention.",
        "Cover the animal with an old towel or rag or use heavy gloves while separating them.",
        "Separate the guinea pigs after the fight.",
        "Keep them in different cages, but in the same room so that they can see, smell, hear, and talk to each other.",
        "Continue handling them with gloves or a towel for a few hours after the fight, as they can remain skittish and aggressive for a while after a confrontation.",
        "Reintroduce them slowly, once again introducing them on a neutral ground with treats and food as distractions.",
        "Depending on the severity of the fight, wait a few hours to a few days.",
        "Keep protective gear on hand in case the fight resumes.",
        "Don't be discouraged if they don't get along.",
        "Some guinea pigs may simply not get along, even after you follow the proper protocol introducing them.",
        "You need to be prepared for this.",
        "It's a risk when introducing a new guinea pig to your pack.",
        "Do not feel as if this is your fault.",
        "Nature simply works this way, and guinea pigs have different personalities.",
        "Some may be more independent and aggressive and therefore harder to introduce to a companion.",
        "Even when you do all the right things, guinea pigs are sometimes simply not compatible with one another.",
        "If the first introduction leads to an excess of fighting, you can restart the introduction process, beginning again with the quarantine period.",
        "This gives the guinea pigs time to cool off and forget any previous hostilities.",
        "If guinea pigs are simply not getting along, you can always keep them in separate cages where they can smell, see, and hear one another but cannot physically interact.",
        "They get the benefits of some social interaction but without the stress of a hostile environment."
    ]
}