{
    "title": "How to Get Gorilla Glue off Hands",
    "url": "https://www.wikihow.com/Get-Gorilla-Glue-off-Hands",
    "category_hierarchy": [
        "Health",
        "First Aid and Emergency Health Care",
        "Foreign Objects First Aid"
    ],
    "methods": [
        {
            "name": "Removing Dry Gorilla Glue",
            "steps": [
                {
                    "headline": "Exfoliate.",
                    "description": "Use a knife-sharpening stone, pumice stone, or other gritty or rough material to scrub your skin. Use a strong but slow motion to avoid tearing your skin, and alternate by rubbing with your fingers to prevent friction burns. Attempt this for several minutes, then move on if the glue shows no sign of balling up or peeling off. If nothing else is available, use a scrap of wood or a thick index card."
                },
                {
                    "headline": "Apply oil.",
                    "description": "Rub one of the following oil-based materials onto your hands for several minutes:\nHand lotion, olive oil, sunflower oil, or baby oil are all gentle on skin. Increase the effectiveness by heating it for about 10 seconds in the microwave, and/or by mixing in a pinch of salt to add friction. Lip gloss, lip balm, petroleum jelly (Vaseline), nonstick cooking spray, or oil-based makeup removers are additional options. Also Argan oil with raw Shea oil is a very good solvent. Polyglycol body lotion may be extra effective."
                },
                {
                    "headline": "Scrape with a blunt edge.",
                    "description": "Use a blunt butter knife or your fingernails to scrape away at the edge of the glue, while it is still oily. Avoid sharp blades, which may \"succeed\" by cutting off your protective outer layer of skin."
                },
                {
                    "headline": "Rub with citrus.",
                    "description": "Some people report success when rubbing slices of lemon or lime on the glue, or rubbing with a citrus oil or skin-safe citrus-based cleaner. This method may sting if the gorilla glue or exfoliation has caused dry, cracked, or torn skin."
                },
                {
                    "headline": "Scrub with a homemade mixture.",
                    "description": "Wipe off your hand of the previous ointment, then track down the ingredients for a potentially more effective mixture. Industrial users of MDI, the bonding ingredient in Gorilla Glue, use the following mixture to clean up spills:\nWashing soda / soda ash (5 to 10%)\nLiquid detergent (0.2 to 2%)\nWater (add to reach 100%)"
                },
                {
                    "headline": "Wait for a few days.",
                    "description": "The glue will wear off along with your regular skin replacement, with the stain fading completely in about four or five days. Waiting is recommended over using harsh chemicals, which are often ineffective and may damage skin. Keep your hands moisturized with lotion during this wait, as gorilla glue can cause dry or cracked skin."
                }
            ]
        },
        {
            "name": "Removing Tacky Gorilla Glue",
            "steps": [
                {
                    "headline": "Wipe off tacky glue with a dry cloth.",
                    "description": "Wipe with a dry cloth or paper towel as soon as the glue spill occurs. If you catch it within a couple minutes, you may be able to remove all the glue."
                },
                {
                    "headline": "Wash with soap.",
                    "description": "Gorilla glue hardens when in contact with water, so this won't be 100% successful unless you catch the glue immediately. Wash with soap and plenty of water. Bar soap will provide additional friction, but liquid soap may be more powerful. If using liquid soap, consider dish-washing soap instead of hand soap, unless you have sensitive skin."
                }
            ]
        }
    ],
    "tyn": [
        "Soap or detergent",
        "Baby oil or other skin-safe oil (polyglycol is best)",
        "Half of a lemon or lime",
        "Blunt butter knife",
        "Soda ash (washing soda)"
    ],
    "text": " Removing Dry Gorilla Glue Exfoliate. Use a knife-sharpening stone, pumice stone, or other gritty or rough material to scrub your skin. Use a strong but slow motion to avoid tearing your skin, and alternate by rubbing with your fingers to prevent friction burns. Attempt this for several minutes, then move on if the glue shows no sign of balling up or peeling off. If nothing else is available, use a scrap of wood or a thick index card. Apply oil. Rub one of the following oil-based materials onto your hands for several minutes:\nHand lotion, olive oil, sunflower oil, or baby oil are all gentle on skin. Increase the effectiveness by heating it for about 10 seconds in the microwave, and/or by mixing in a pinch of salt to add friction. Lip gloss, lip balm, petroleum jelly (Vaseline), nonstick cooking spray, or oil-based makeup removers are additional options. Also Argan oil with raw Shea oil is a very good solvent. Polyglycol body lotion may be extra effective. Scrape with a blunt edge. Use a blunt butter knife or your fingernails to scrape away at the edge of the glue, while it is still oily. Avoid sharp blades, which may \"succeed\" by cutting off your protective outer layer of skin. Rub with citrus. Some people report success when rubbing slices of lemon or lime on the glue, or rubbing with a citrus oil or skin-safe citrus-based cleaner. This method may sting if the gorilla glue or exfoliation has caused dry, cracked, or torn skin. Scrub with a homemade mixture. Wipe off your hand of the previous ointment, then track down the ingredients for a potentially more effective mixture. Industrial users of MDI, the bonding ingredient in Gorilla Glue, use the following mixture to clean up spills:\nWashing soda / soda ash (5 to 10%)\nLiquid detergent (0.2 to 2%)\nWater (add to reach 100%) Wait for a few days. The glue will wear off along with your regular skin replacement, with the stain fading completely in about four or five days. Waiting is recommended over using harsh chemicals, which are often ineffective and may damage skin. Keep your hands moisturized with lotion during this wait, as gorilla glue can cause dry or cracked skin. Removing Tacky Gorilla Glue Wipe off tacky glue with a dry cloth. Wipe with a dry cloth or paper towel as soon as the glue spill occurs. If you catch it within a couple minutes, you may be able to remove all the glue. Wash with soap. Gorilla glue hardens when in contact with water, so this won't be 100% successful unless you catch the glue immediately. Wash with soap and plenty of water. Bar soap will provide additional friction, but liquid soap may be more powerful. If using liquid soap, consider dish-washing soap instead of hand soap, unless you have sensitive skin.",
    "sentences": [
        " Removing Dry Gorilla Glue Exfoliate.",
        "Use a knife-sharpening stone, pumice stone, or other gritty or rough material to scrub your skin.",
        "Use a strong but slow motion to avoid tearing your skin, and alternate by rubbing with your fingers to prevent friction burns.",
        "Attempt this for several minutes, then move on if the glue shows no sign of balling up or peeling off.",
        "If nothing else is available, use a scrap of wood or a thick index card.",
        "Apply oil.",
        "Rub one of the following oil-based materials onto your hands for several minutes:\nHand lotion, olive oil, sunflower oil, or baby oil are all gentle on skin.",
        "Increase the effectiveness by heating it for about 10 seconds in the microwave, and/or by mixing in a pinch of salt to add friction.",
        "Lip gloss, lip balm, petroleum jelly (Vaseline), nonstick cooking spray, or oil-based makeup removers are additional options.",
        "Also Argan oil with raw Shea oil is a very good solvent.",
        "Polyglycol body lotion may be extra effective.",
        "Scrape with a blunt edge.",
        "Use a blunt butter knife or your fingernails to scrape away at the edge of the glue, while it is still oily.",
        "Avoid sharp blades, which may \"succeed\" by cutting off your protective outer layer of skin.",
        "Rub with citrus.",
        "Some people report success when rubbing slices of lemon or lime on the glue, or rubbing with a citrus oil or skin-safe citrus-based cleaner.",
        "This method may sting if the gorilla glue or exfoliation has caused dry, cracked, or torn skin.",
        "Scrub with a homemade mixture.",
        "Wipe off your hand of the previous ointment, then track down the ingredients for a potentially more effective mixture.",
        "Industrial users of MDI, the bonding ingredient in Gorilla Glue, use the following mixture to clean up spills:\nWashing soda / soda ash (5 to 10%)\nLiquid detergent (0.2 to 2%)\nWater (add to reach 100%) Wait for a few days.",
        "The glue will wear off along with your regular skin replacement, with the stain fading completely in about four or five days.",
        "Waiting is recommended over using harsh chemicals, which are often ineffective and may damage skin.",
        "Keep your hands moisturized with lotion during this wait, as gorilla glue can cause dry or cracked skin.",
        "Removing Tacky Gorilla Glue Wipe off tacky glue with a dry cloth.",
        "Wipe with a dry cloth or paper towel as soon as the glue spill occurs.",
        "If you catch it within a couple minutes, you may be able to remove all the glue.",
        "Wash with soap.",
        "Gorilla glue hardens when in contact with water, so this won't be 100% successful unless you catch the glue immediately.",
        "Wash with soap and plenty of water.",
        "Bar soap will provide additional friction, but liquid soap may be more powerful.",
        "If using liquid soap, consider dish-washing soap instead of hand soap, unless you have sensitive skin."
    ]
}