{
    "title": "How to Make Pants with a Flap Instead of a Zipper",
    "url": "https://www.wikihow.com/Make-Pants-with-a-Flap-Instead-of-a-Zipper",
    "category_hierarchy": [
        "Personal Care and Style",
        "Clothing",
        "Clothes by Type",
        "Pants and Shorts"
    ],
    "steps": [
        {
            "headline": "Obtain a sewing machine.",
            "description": "This \"can\" be sewn by hand, but a machine makes things a lot easier."
        },
        {
            "headline": "Obtain Fabric for your (new) flap closure.",
            "description": ""
        },
        {
            "headline": "Measure your zipper length.",
            "description": "Call this measurement \"A\"."
        },
        {
            "headline": "Measure the distance your zipper pops open when you unbutton the top button of your jeans.",
            "description": "Call this measurement \"B\"."
        },
        {
            "headline": "Cut two pieces of fabric equal to A times B plus an extra inch in each direction.",
            "description": "See sketch."
        },
        {
            "headline": "Sew the fabric together with right sides facing.",
            "description": "Leave at least two inches for turning."
        },
        {
            "headline": "Miter or clip the corners for easy turning.",
            "description": ""
        },
        {
            "headline": "Turn right side out and press the edges carefully.",
            "description": ""
        },
        {
            "headline": "Top stitch the edges, tucking the open (turning opening) edge inside as you go.",
            "description": ""
        },
        {
            "headline": "Make two button holes on one edge of the flap.",
            "description": "One hole near the top on the waistband, one lower, just below the pocket opening. (These locations are best for hiding the fact that you have buttons on the inside of your pants.)"
        },
        {
            "headline": "Sew the long edge of the flap (the side WITHOUT the button holes)to your former zipper along the inside of the zipper opening on one side.",
            "description": "See sketch."
        },
        {
            "headline": "Mark the location of the button holes on the inside of the pants after the flap is sewn in place.",
            "description": ""
        },
        {
            "headline": "Sew in two buttons.",
            "description": ""
        },
        {
            "headline": "Voila!",
            "description": "You now button your pants in three places and can go without that pesky or broken zipper!"
        },
        {
            "headline": "Cut out the zipper remnants if desired.",
            "description": ""
        }
    ],
    "tyn": [
        "Use of a sewing machine",
        "Fabric",
        "Sewing notions - needles, thread, iron, buttons."
    ],
    "text": " Obtain a sewing machine. This \"can\" be sewn by hand, but a machine makes things a lot easier. Obtain Fabric for your (new) flap closure.  Measure your zipper length. Call this measurement \"A\". Measure the distance your zipper pops open when you unbutton the top button of your jeans. Call this measurement \"B\". Cut two pieces of fabric equal to A times B plus an extra inch in each direction. See sketch. Sew the fabric together with right sides facing. Leave at least two inches for turning. Miter or clip the corners for easy turning.  Turn right side out and press the edges carefully.  Top stitch the edges, tucking the open (turning opening) edge inside as you go.  Make two button holes on one edge of the flap. One hole near the top on the waistband, one lower, just below the pocket opening. (These locations are best for hiding the fact that you have buttons on the inside of your pants.) Sew the long edge of the flap (the side WITHOUT the button holes)to your former zipper along the inside of the zipper opening on one side. See sketch. Mark the location of the button holes on the inside of the pants after the flap is sewn in place.  Sew in two buttons.  Voila! You now button your pants in three places and can go without that pesky or broken zipper! Cut out the zipper remnants if desired. ",
    "sentences": [
        " Obtain a sewing machine.",
        "This \"can\" be sewn by hand, but a machine makes things a lot easier.",
        "Obtain Fabric for your (new) flap closure.",
        "Measure your zipper length.",
        "Call this measurement \"A\".",
        "Measure the distance your zipper pops open when you unbutton the top button of your jeans.",
        "Call this measurement \"B\".",
        "Cut two pieces of fabric equal to A times B plus an extra inch in each direction.",
        "See sketch.",
        "Sew the fabric together with right sides facing.",
        "Leave at least two inches for turning.",
        "Miter or clip the corners for easy turning.",
        "Turn right side out and press the edges carefully.",
        "Top stitch the edges, tucking the open (turning opening) edge inside as you go.",
        "Make two button holes on one edge of the flap.",
        "One hole near the top on the waistband, one lower, just below the pocket opening.",
        "(These locations are best for hiding the fact that you have buttons on the inside of your pants.)",
        "Sew the long edge of the flap (the side WITHOUT the button holes)to your former zipper along the inside of the zipper opening on one side.",
        "See sketch.",
        "Mark the location of the button holes on the inside of the pants after the flap is sewn in place.",
        "Sew in two buttons.",
        "Voila!",
        "You now button your pants in three places and can go without that pesky or broken zipper!",
        "Cut out the zipper remnants if desired."
    ]
}