{
    "title": "How to Calculate the Mass of an Object",
    "url": "https://www.wikihow.com/Calculate-the-Mass-of-an-Object",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science"
    ],
    "methods": [
        {
            "name": "Using a Triple-Beam Balance",
            "steps": [
                {
                    "headline": "Set up the balance.",
                    "description": "Make sure the pan you will place your object onto is clean and dry."
                },
                {
                    "headline": "Zero the balance.",
                    "description": "Move all the weights to the zero position, then turn the knob on the far left beneath the scale pan. The scales should move around. Continue turning it in either direction until the white \"pointer\" line on the right of the beams lines up with the \"0\" marking on the right-hand side."
                },
                {
                    "headline": "Place the object in the pan.",
                    "description": "Be careful not to influence the weight of the object with your hand or other objects."
                },
                {
                    "headline": "Move the weights.",
                    "description": "Slide the weights left and right on the beams until the two white lines at the right line up again. The most efficient way to do this is to make a rough estimate as to what you think the mass will be, and then move the highest value weight you think will still be lower than the mass. Move this weight until the pointer is just under 0. Then move on progressively to the next smallest weights to get closer and closer to the actual mass."
                },
                {
                    "headline": "Read the mass.",
                    "description": "Add the measurement of each weight together. The total will be the mass of the object."
                }
            ]
        },
        {
            "name": "Using the Density and Volume",
            "steps": [
                {
                    "headline": "Know the equation.",
                    "description": "The set equation relating mass, density, and volume is D=m/v or density equals mass divided by volume."
                },
                {
                    "headline": "Plug your values into the equation.",
                    "description": "If the density of your object is 500 kg/m (kilograms per cubic meter), then you put 500 in place of the D for 500=m/v. If your volume is 10 m (cubic meters), put 10 in place of the v for 500=m/10."
                },
                {
                    "headline": "Isolate the variable.",
                    "description": "As you are trying to calculate mass, the variable in this equation is m. You want this value to end up alone on one side of the equal sign. In this equation, it is involved in division with another value. To isolate it, you must multiply both sides of the equation by this value. This equation becomes (500)10=(m/10)10. Isolating a variable is always done by performing the opposite mathematical function on both sides of an equation. If the variable is involved in addition, subtract the extra value from both sides, etc."
                },
                {
                    "headline": "Simplify.",
                    "description": "On the left side of the equation, 500 times 10 simplifies to 5000. On the right side, the two 10's cancel out, leaving the m alone. Thus the answer is 5000kg=m. Don't forget your units. The cubic meters have canceled each other out to leave only kilograms."
                }
            ]
        }
    ],
    "tyn": [
        "Triple-beam balance",
        "Calculator or paper and pen"
    ],
    "text": " Using a Triple-Beam Balance Set up the balance. Make sure the pan you will place your object onto is clean and dry. Zero the balance. Move all the weights to the zero position, then turn the knob on the far left beneath the scale pan. The scales should move around. Continue turning it in either direction until the white \"pointer\" line on the right of the beams lines up with the \"0\" marking on the right-hand side. Place the object in the pan. Be careful not to influence the weight of the object with your hand or other objects. Move the weights. Slide the weights left and right on the beams until the two white lines at the right line up again. The most efficient way to do this is to make a rough estimate as to what you think the mass will be, and then move the highest value weight you think will still be lower than the mass. Move this weight until the pointer is just under 0. Then move on progressively to the next smallest weights to get closer and closer to the actual mass. Read the mass. Add the measurement of each weight together. The total will be the mass of the object. Using the Density and Volume Know the equation. The set equation relating mass, density, and volume is D=m/v or density equals mass divided by volume. Plug your values into the equation. If the density of your object is 500 kg/m (kilograms per cubic meter), then you put 500 in place of the D for 500=m/v. If your volume is 10 m (cubic meters), put 10 in place of the v for 500=m/10. Isolate the variable. As you are trying to calculate mass, the variable in this equation is m. You want this value to end up alone on one side of the equal sign. In this equation, it is involved in division with another value. To isolate it, you must multiply both sides of the equation by this value. This equation becomes (500)10=(m/10)10. Isolating a variable is always done by performing the opposite mathematical function on both sides of an equation. If the variable is involved in addition, subtract the extra value from both sides, etc. Simplify. On the left side of the equation, 500 times 10 simplifies to 5000. On the right side, the two 10's cancel out, leaving the m alone. Thus the answer is 5000kg=m. Don't forget your units. The cubic meters have canceled each other out to leave only kilograms.",
    "sentences": [
        " Using a Triple-Beam Balance Set up the balance.",
        "Make sure the pan you will place your object onto is clean and dry.",
        "Zero the balance.",
        "Move all the weights to the zero position, then turn the knob on the far left beneath the scale pan.",
        "The scales should move around.",
        "Continue turning it in either direction until the white \"pointer\" line on the right of the beams lines up with the \"0\" marking on the right-hand side.",
        "Place the object in the pan.",
        "Be careful not to influence the weight of the object with your hand or other objects.",
        "Move the weights.",
        "Slide the weights left and right on the beams until the two white lines at the right line up again.",
        "The most efficient way to do this is to make a rough estimate as to what you think the mass will be, and then move the highest value weight you think will still be lower than the mass.",
        "Move this weight until the pointer is just under 0.",
        "Then move on progressively to the next smallest weights to get closer and closer to the actual mass.",
        "Read the mass.",
        "Add the measurement of each weight together.",
        "The total will be the mass of the object.",
        "Using the Density and Volume Know the equation.",
        "The set equation relating mass, density, and volume is D=m/v or density equals mass divided by volume.",
        "Plug your values into the equation.",
        "If the density of your object is 500 kg/m (kilograms per cubic meter), then you put 500 in place of the D for 500=m/v.",
        "If your volume is 10 m (cubic meters), put 10 in place of the v for 500=m/10.",
        "Isolate the variable.",
        "As you are trying to calculate mass, the variable in this equation is m. You want this value to end up alone on one side of the equal sign.",
        "In this equation, it is involved in division with another value.",
        "To isolate it, you must multiply both sides of the equation by this value.",
        "This equation becomes (500)10=(m/10)10.",
        "Isolating a variable is always done by performing the opposite mathematical function on both sides of an equation.",
        "If the variable is involved in addition, subtract the extra value from both sides, etc.",
        "Simplify.",
        "On the left side of the equation, 500 times 10 simplifies to 5000.",
        "On the right side, the two 10's cancel out, leaving the m alone.",
        "Thus the answer is 5000kg=m.",
        "Don't forget your units.",
        "The cubic meters have canceled each other out to leave only kilograms."
    ]
}