{
    "title": "How to Make a Paracord Belt",
    "url": "https://www.wikihow.com/Make-a-Paracord-Belt",
    "category_hierarchy": [
        "Personal Care and Style",
        "Fashion",
        "Fashion Accessories",
        "Belts"
    ],
    "parts": [
        {
            "name": "Attaching the Paracord to the Buckle",
            "steps": [
                {
                    "headline": "Buy a hank of paracord.",
                    "description": "You can find paracord hanks in most outdoor or climbing stores, or online. Buy a hank of paracord in a color you like. One of the advantages of making a Slatt’s Rescue Belt is you don’t need to measure out a specific amount of paracord before starting; you can work directly from a hank. To add multiple colors to your belt, buy a patterned hank of paracord with multiple colors already in it. For the Slatt’s Rescue Belt, you can only use one hank of paracord."
                },
                {
                    "headline": "Melt the starting end.",
                    "description": "Hold the flame of a lighter to the starting end of the paracord for several seconds, melting the rope and preventing it from fraying or unraveling. Only melt the working end; do not worry about the finishing end of the paracord yet. This will seal off the end and prevent it from fraying."
                },
                {
                    "headline": "Loop the starting end around the belt buckle four (or more) times.",
                    "description": "Insert the melted paracord end beneath the bar of your first belt buckle half. Wrap the paracord around this bar in an overhand direction, pulling it back up from beneath the bar again to create a full loop. Make four loops for a standard belt buckle, adjusting based on the width of the buckle. Note that wider buckles will need more loops while thinner buckles will need fewer loops. You can use any kind of belt buckle for this project. A metal one or a plastic side release one will work. All loops should flow in the same direction and should be slightly loose so that you'll be able to manipulate them later on. Leave at least 2 or 3 inches (5 or 7.5 cm) of excess paracord hanging out from the belt buckle bar when you finish wrapping these starting loops."
                },
                {
                    "headline": "Knot the starting end.",
                    "description": "Tie a tight, overhand knot from the excess paracord hanging from beneath the buckle bar. This knot must be tight to prevent the cord from unraveling. Adjust the wrapped loops as needed, pulling the working end of the cord back out, so that the knot lies snug against the buckle bar. Note that the loops should still be somewhat loose."
                }
            ]
        },
        {
            "name": "Making the First Row",
            "steps": [
                {
                    "headline": "Form a loop with the working end.",
                    "description": "Grab a portion of the paracord from the working end (i.e. the loose or non-knotted end). Form an open loop from this portion of cord, that is two to three times as long as the width of the buckle or the length of the buckle bar. Position this new loop directly next to portion of cord wrapped around the buckle bar."
                },
                {
                    "headline": "Slide the loose loop beneath the wrapped portion of paracord.",
                    "description": "Push the newly formed loose loop beneath all four loops previously wrapped around the buckle bar. When finished, this \"through loop\" should stick out from beneath the wrapped portion and run parallel to the buckle bar. If you cannot easily push the loop through the wrapped portion of the cord, use your fingers or a thin, sturdy tool (skewer, crochet hook, nail, etc.) to loosen the wrapped loops, creating enough space for the loose loop to pass through."
                },
                {
                    "headline": "Spread apart the wrapped loops.",
                    "description": "Carefully spread the loops wrapped around the buckle bar using your pointed tool. You should be able to see a layer of paracord running beneath the wrapped loops. The paracord running beneath the wrapped loops is connected to the through loop and working end of the cord."
                },
                {
                    "headline": "Pull up several finger loops, one fewer than the number of base loops.",
                    "description": "Using a sturdy skewer or other pointed tool, grab and lift the under layer of paracord through the first two wrapped loops along the bar, creating a new loop large enough for your finger to fit through. If you started with four wrapped loops, you should pull up a total of three \"finger\" loops in this manner. Otherwise, the number of finger loops should be one fewer than the number of wrapped loops you started with. Each of these loops should lie between two of the original wrapped loops along the buckle bar. Start at the edge closest to the through loop, then gradually progress to the edge nearest the loose working end of paracord."
                }
            ]
        },
        {
            "name": "Repeating the Pattern",
            "steps": [
                {
                    "headline": "Thread your finger through the pulled loops.",
                    "description": "Slide the index finger of your non-dominant hand into the sideways through loop, then continue slipping it through all three finger loops in consecutive order. The finger loops should twist clockwise as you thread your finger through them so that the side lying closest to the working cord faces in your direction."
                },
                {
                    "headline": "Pull a new loop through the threaded loops.",
                    "description": "Create a new loose loop from the excess working cord, then pull it through the loops threaded along your finger. This loop should be directly next to the buckle and around two times the width of the buckle. Essentially, you're starting a second row that will be identical to the first. The finger currently threaded through your four previous loops serves the same purpose as the buckle bar did when creating your first row."
                },
                {
                    "headline": "Tighten the finger loops until they lie flat.",
                    "description": "Remove your finger from the loops. Tighten the loops starting from the side where the loop is jutting out (the outside), and moving towards the other side (the inside). To tighten each loop, gently tug on the back side of the loop lying directly next to it. To tighten the innermost loop, tug on the working side of the cord sticking out from the bundle. Once you’ve tightened the finger loops down, you may need to pull the through-loop back towards the outside, if it was pulled in by your tugging."
                },
                {
                    "headline": "Create new finger loops.",
                    "description": "As you did before, ease away the newly wrapped loops to reveal the working portion of paracord. Use a sharp tool to lift paracord up from beneath the wrapped loops, creating the appropriate number of new finger-sized loops. The number of finger loops created here should match the number created for your previous row. These loops form the base of your next pattern row. They should stand upright while the previously created through loop lies perpendicular and sideways."
                },
                {
                    "headline": "Repeat the pattern to your desired length.",
                    "description": "After you’ve created your new finger loops, follow the steps above, starting by threading your finger through the pulled loops. Repeat the previously described pattern steps to create additional rows in the same manner. Continue making rows until the belt reaches your desired length. Note that the final length should roughly match the circumference of your waist, minus the length of the buckle belt. For example, if your waist is 38 inches (96.5 cm) around and the buckle belt is 2 inches (5 cm) long when snapped together, then the length of the paracord portion should be about 36 inches (91.4 cm). For each row, pull a new loop from the working side of the paracord through the four base loops, which should be threaded on your finger. Tighten the base loops over the new through loop, then pull up three more finger loops from beneath the row. The one through loop and three finger loops will be the base for the next row."
                }
            ]
        },
        {
            "name": "Sealing the Opposite End",
            "steps": [
                {
                    "headline": "Create a final row of finger loops.",
                    "description": "Again, the number should match the number created for all previous rows. Make sure they stand upright while the previously created through loop lies perpendicular. Note that you should still have a through loop from your final row; you do not need to create a new one."
                },
                {
                    "headline": "Slide the final row through the other buckle half.",
                    "description": "Gather the through loop and finger loops together, then push them through the bar of the other buckle half. The number of loops pushed beneath this buckle bar should match the number of loops wrapped around the bar of the first buckle half. The connected ends of these loops will stay to the outside of the bar, but the rounded loop ends must pass through completely."
                },
                {
                    "headline": "Pass a final through loop over the buckle and through the finger loops.",
                    "description": "Create a loop from the working end of the paracord, making it roughly the same size as your previous through loops. Insert this loop through the finger loop ends sticking up from beneath the buckle bar."
                },
                {
                    "headline": "Tighten the loops.",
                    "description": "As you did for the body of the pattern, tighten the base loops around the through loop. Work from the outside in, tugging down on the back side of each loop to tighten the one before it. Repeat until all of the loops are snug. Each loop should lay flat at this point."
                },
                {
                    "headline": "Trim and then knot the remaining paracord.",
                    "description": "Cut the paracord so that there is about 4 inches (10 cm) of excess. Pull that excess cord through the final loop to create a snug, secure knot. If you do not like the amount of paracord remaining after you knot the end, you can trim it down further. Leave at least 1 to 2 inches (2.5 to 5 cm) between the knot and the end, though."
                },
                {
                    "headline": "Melt the finishing end.",
                    "description": "Hold the flame of a lighter over the raw, cut end of the paracord for several seconds. Pull it away once the cord end has melted down. An adequately melted end should prevent the paracord from fraying."
                }
            ]
        },
        {
            "name": "Using the Belt",
            "steps": [
                {
                    "headline": "Wear the belt.",
                    "description": "At this point, the paracord belt should be finished and ready to wear. You can wrap the belt around your waist as you would wrap any other belt. If properly measured, it should be snug enough to serve the same purpose as any belt when the buckle is snapped together. This is a great belt to wear on climbing, backpacking, or camping trips, when might want access to paracord rope in the case of an emergency. You can match the belt to a paracord bracelet for some extra outfit coordination."
                },
                {
                    "headline": "Unravel the paracord belt to access the rope.",
                    "description": "A Slatt’s rescue paracord belt can be unraveled in seconds, allowing you to quickly access a large length of sturdy, reliable cord. To deploy it, undo the knot tied on one end and remove the buckle end from the belt. Then, just pull the loose end of cord in your direction, and the belt will begin to unravel. If you are unable to untie the knot, you could slice off the knots using a pocket knife. It is also possible to unwind the paracord from the both sides of the buckle. With practice, it should only take about 20 to 30 seconds to unravel the entire belt, though it will obviously take longer to put the belt back together again."
                },
                {
                    "headline": "Use your paracord in a medical emergency.",
                    "description": "When a serious injury occurs in the wilderness, you often need to improvise to make it to safety and advanced medical care. Paracord is a useful tool for emergency medical care. For example, paracord can be used to make an emergency splint, sling, or even a rope stretcher.To make an emergency splint, lay out some soft material (a jacket or blanket, for example) and a hard object (like a walking stick) to keep the limb stable. Wrap the paracord around the hard object and the cushioning. Then tie a knot (above and below the injured area). A sling will need similar materials to the splint (cushion, hard object, and paracord). Use the paracord to tie a slip knot around the cushion and hard object to the wrist of the injured arm/shoulder. Then, wrap the cord up around the neck and secure it to the elbow of the same arm. Place pieces of cloth under the slip knots at the neck and wrist to prevent rubbing and irritation."
                },
                {
                    "headline": "Use your paracord as a rescue tool for a drowning victim.",
                    "description": "Tie a figure eight knot in your paracord, then attach the paracord to an object that will float (like a lifejacket or log). This will help you to throw the cord farther and provide something for the victim to grab onto. If the victim is in moving water, launch the object upstream of the victim so it will float towards them. Once the person has grabbed onto the object, reel them in using the paracord."
                }
            ]
        }
    ],
    "tyn": [
        "550 paracord, 100 feet (30.5 m) (30.5 m)",
        "Standard clip belt buckle, metal or plastic",
        "Scissors",
        "Lighter",
        "Wooden skewer, crochet hook, or long nail"
    ],
    "text": " Attaching the Paracord to the Buckle Buy a hank of paracord. You can find paracord hanks in most outdoor or climbing stores, or online. Buy a hank of paracord in a color you like. One of the advantages of making a Slatt’s Rescue Belt is you don’t need to measure out a specific amount of paracord before starting; you can work directly from a hank. To add multiple colors to your belt, buy a patterned hank of paracord with multiple colors already in it. For the Slatt’s Rescue Belt, you can only use one hank of paracord. Melt the starting end. Hold the flame of a lighter to the starting end of the paracord for several seconds, melting the rope and preventing it from fraying or unraveling. Only melt the working end; do not worry about the finishing end of the paracord yet. This will seal off the end and prevent it from fraying. Loop the starting end around the belt buckle four (or more) times. Insert the melted paracord end beneath the bar of your first belt buckle half. Wrap the paracord around this bar in an overhand direction, pulling it back up from beneath the bar again to create a full loop. Make four loops for a standard belt buckle, adjusting based on the width of the buckle. Note that wider buckles will need more loops while thinner buckles will need fewer loops. You can use any kind of belt buckle for this project. A metal one or a plastic side release one will work. All loops should flow in the same direction and should be slightly loose so that you'll be able to manipulate them later on. Leave at least 2 or 3 inches (5 or 7.5 cm) of excess paracord hanging out from the belt buckle bar when you finish wrapping these starting loops. Knot the starting end. Tie a tight, overhand knot from the excess paracord hanging from beneath the buckle bar. This knot must be tight to prevent the cord from unraveling. Adjust the wrapped loops as needed, pulling the working end of the cord back out, so that the knot lies snug against the buckle bar. Note that the loops should still be somewhat loose. Making the First Row Form a loop with the working end. Grab a portion of the paracord from the working end (i.e. the loose or non-knotted end). Form an open loop from this portion of cord, that is two to three times as long as the width of the buckle or the length of the buckle bar. Position this new loop directly next to portion of cord wrapped around the buckle bar. Slide the loose loop beneath the wrapped portion of paracord. Push the newly formed loose loop beneath all four loops previously wrapped around the buckle bar. When finished, this \"through loop\" should stick out from beneath the wrapped portion and run parallel to the buckle bar. If you cannot easily push the loop through the wrapped portion of the cord, use your fingers or a thin, sturdy tool (skewer, crochet hook, nail, etc.) to loosen the wrapped loops, creating enough space for the loose loop to pass through. Spread apart the wrapped loops. Carefully spread the loops wrapped around the buckle bar using your pointed tool. You should be able to see a layer of paracord running beneath the wrapped loops. The paracord running beneath the wrapped loops is connected to the through loop and working end of the cord. Pull up several finger loops, one fewer than the number of base loops. Using a sturdy skewer or other pointed tool, grab and lift the under layer of paracord through the first two wrapped loops along the bar, creating a new loop large enough for your finger to fit through. If you started with four wrapped loops, you should pull up a total of three \"finger\" loops in this manner. Otherwise, the number of finger loops should be one fewer than the number of wrapped loops you started with. Each of these loops should lie between two of the original wrapped loops along the buckle bar. Start at the edge closest to the through loop, then gradually progress to the edge nearest the loose working end of paracord. Repeating the Pattern Thread your finger through the pulled loops. Slide the index finger of your non-dominant hand into the sideways through loop, then continue slipping it through all three finger loops in consecutive order. The finger loops should twist clockwise as you thread your finger through them so that the side lying closest to the working cord faces in your direction. Pull a new loop through the threaded loops. Create a new loose loop from the excess working cord, then pull it through the loops threaded along your finger. This loop should be directly next to the buckle and around two times the width of the buckle. Essentially, you're starting a second row that will be identical to the first. The finger currently threaded through your four previous loops serves the same purpose as the buckle bar did when creating your first row. Tighten the finger loops until they lie flat. Remove your finger from the loops. Tighten the loops starting from the side where the loop is jutting out (the outside), and moving towards the other side (the inside). To tighten each loop, gently tug on the back side of the loop lying directly next to it. To tighten the innermost loop, tug on the working side of the cord sticking out from the bundle. Once you’ve tightened the finger loops down, you may need to pull the through-loop back towards the outside, if it was pulled in by your tugging. Create new finger loops. As you did before, ease away the newly wrapped loops to reveal the working portion of paracord. Use a sharp tool to lift paracord up from beneath the wrapped loops, creating the appropriate number of new finger-sized loops. The number of finger loops created here should match the number created for your previous row. These loops form the base of your next pattern row. They should stand upright while the previously created through loop lies perpendicular and sideways. Repeat the pattern to your desired length. After you’ve created your new finger loops, follow the steps above, starting by threading your finger through the pulled loops. Repeat the previously described pattern steps to create additional rows in the same manner. Continue making rows until the belt reaches your desired length. Note that the final length should roughly match the circumference of your waist, minus the length of the buckle belt. For example, if your waist is 38 inches (96.5 cm) around and the buckle belt is 2 inches (5 cm) long when snapped together, then the length of the paracord portion should be about 36 inches (91.4 cm). For each row, pull a new loop from the working side of the paracord through the four base loops, which should be threaded on your finger. Tighten the base loops over the new through loop, then pull up three more finger loops from beneath the row. The one through loop and three finger loops will be the base for the next row. Sealing the Opposite End Create a final row of finger loops. Again, the number should match the number created for all previous rows. Make sure they stand upright while the previously created through loop lies perpendicular. Note that you should still have a through loop from your final row; you do not need to create a new one. Slide the final row through the other buckle half. Gather the through loop and finger loops together, then push them through the bar of the other buckle half. The number of loops pushed beneath this buckle bar should match the number of loops wrapped around the bar of the first buckle half. The connected ends of these loops will stay to the outside of the bar, but the rounded loop ends must pass through completely. Pass a final through loop over the buckle and through the finger loops. Create a loop from the working end of the paracord, making it roughly the same size as your previous through loops. Insert this loop through the finger loop ends sticking up from beneath the buckle bar. Tighten the loops. As you did for the body of the pattern, tighten the base loops around the through loop. Work from the outside in, tugging down on the back side of each loop to tighten the one before it. Repeat until all of the loops are snug. Each loop should lay flat at this point. Trim and then knot the remaining paracord. Cut the paracord so that there is about 4 inches (10 cm) of excess. Pull that excess cord through the final loop to create a snug, secure knot. If you do not like the amount of paracord remaining after you knot the end, you can trim it down further. Leave at least 1 to 2 inches (2.5 to 5 cm) between the knot and the end, though. Melt the finishing end. Hold the flame of a lighter over the raw, cut end of the paracord for several seconds. Pull it away once the cord end has melted down. An adequately melted end should prevent the paracord from fraying. Using the Belt Wear the belt. At this point, the paracord belt should be finished and ready to wear. You can wrap the belt around your waist as you would wrap any other belt. If properly measured, it should be snug enough to serve the same purpose as any belt when the buckle is snapped together. This is a great belt to wear on climbing, backpacking, or camping trips, when might want access to paracord rope in the case of an emergency. You can match the belt to a paracord bracelet for some extra outfit coordination. Unravel the paracord belt to access the rope. A Slatt’s rescue paracord belt can be unraveled in seconds, allowing you to quickly access a large length of sturdy, reliable cord. To deploy it, undo the knot tied on one end and remove the buckle end from the belt. Then, just pull the loose end of cord in your direction, and the belt will begin to unravel. If you are unable to untie the knot, you could slice off the knots using a pocket knife. It is also possible to unwind the paracord from the both sides of the buckle. With practice, it should only take about 20 to 30 seconds to unravel the entire belt, though it will obviously take longer to put the belt back together again. Use your paracord in a medical emergency. When a serious injury occurs in the wilderness, you often need to improvise to make it to safety and advanced medical care. Paracord is a useful tool for emergency medical care. For example, paracord can be used to make an emergency splint, sling, or even a rope stretcher.To make an emergency splint, lay out some soft material (a jacket or blanket, for example) and a hard object (like a walking stick) to keep the limb stable. Wrap the paracord around the hard object and the cushioning. Then tie a knot (above and below the injured area). A sling will need similar materials to the splint (cushion, hard object, and paracord). Use the paracord to tie a slip knot around the cushion and hard object to the wrist of the injured arm/shoulder. Then, wrap the cord up around the neck and secure it to the elbow of the same arm. Place pieces of cloth under the slip knots at the neck and wrist to prevent rubbing and irritation. Use your paracord as a rescue tool for a drowning victim. Tie a figure eight knot in your paracord, then attach the paracord to an object that will float (like a lifejacket or log). This will help you to throw the cord farther and provide something for the victim to grab onto. If the victim is in moving water, launch the object upstream of the victim so it will float towards them. Once the person has grabbed onto the object, reel them in using the paracord.",
    "sentences": [
        " Attaching the Paracord to the Buckle Buy a hank of paracord.",
        "You can find paracord hanks in most outdoor or climbing stores, or online.",
        "Buy a hank of paracord in a color you like.",
        "One of the advantages of making a Slatt’s Rescue Belt is you don’t need to measure out a specific amount of paracord before starting; you can work directly from a hank.",
        "To add multiple colors to your belt, buy a patterned hank of paracord with multiple colors already in it.",
        "For the Slatt’s Rescue Belt, you can only use one hank of paracord.",
        "Melt the starting end.",
        "Hold the flame of a lighter to the starting end of the paracord for several seconds, melting the rope and preventing it from fraying or unraveling.",
        "Only melt the working end; do not worry about the finishing end of the paracord yet.",
        "This will seal off the end and prevent it from fraying.",
        "Loop the starting end around the belt buckle four (or more) times.",
        "Insert the melted paracord end beneath the bar of your first belt buckle half.",
        "Wrap the paracord around this bar in an overhand direction, pulling it back up from beneath the bar again to create a full loop.",
        "Make four loops for a standard belt buckle, adjusting based on the width of the buckle.",
        "Note that wider buckles will need more loops while thinner buckles will need fewer loops.",
        "You can use any kind of belt buckle for this project.",
        "A metal one or a plastic side release one will work.",
        "All loops should flow in the same direction and should be slightly loose so that you'll be able to manipulate them later on.",
        "Leave at least 2 or 3 inches (5 or 7.5 cm) of excess paracord hanging out from the belt buckle bar when you finish wrapping these starting loops.",
        "Knot the starting end.",
        "Tie a tight, overhand knot from the excess paracord hanging from beneath the buckle bar.",
        "This knot must be tight to prevent the cord from unraveling.",
        "Adjust the wrapped loops as needed, pulling the working end of the cord back out, so that the knot lies snug against the buckle bar.",
        "Note that the loops should still be somewhat loose.",
        "Making the First Row Form a loop with the working end.",
        "Grab a portion of the paracord from the working end (i.e.",
        "the loose or non-knotted end).",
        "Form an open loop from this portion of cord, that is two to three times as long as the width of the buckle or the length of the buckle bar.",
        "Position this new loop directly next to portion of cord wrapped around the buckle bar.",
        "Slide the loose loop beneath the wrapped portion of paracord.",
        "Push the newly formed loose loop beneath all four loops previously wrapped around the buckle bar.",
        "When finished, this \"through loop\" should stick out from beneath the wrapped portion and run parallel to the buckle bar.",
        "If you cannot easily push the loop through the wrapped portion of the cord, use your fingers or a thin, sturdy tool (skewer, crochet hook, nail, etc.)",
        "to loosen the wrapped loops, creating enough space for the loose loop to pass through.",
        "Spread apart the wrapped loops.",
        "Carefully spread the loops wrapped around the buckle bar using your pointed tool.",
        "You should be able to see a layer of paracord running beneath the wrapped loops.",
        "The paracord running beneath the wrapped loops is connected to the through loop and working end of the cord.",
        "Pull up several finger loops, one fewer than the number of base loops.",
        "Using a sturdy skewer or other pointed tool, grab and lift the under layer of paracord through the first two wrapped loops along the bar, creating a new loop large enough for your finger to fit through.",
        "If you started with four wrapped loops, you should pull up a total of three \"finger\" loops in this manner.",
        "Otherwise, the number of finger loops should be one fewer than the number of wrapped loops you started with.",
        "Each of these loops should lie between two of the original wrapped loops along the buckle bar.",
        "Start at the edge closest to the through loop, then gradually progress to the edge nearest the loose working end of paracord.",
        "Repeating the Pattern Thread your finger through the pulled loops.",
        "Slide the index finger of your non-dominant hand into the sideways through loop, then continue slipping it through all three finger loops in consecutive order.",
        "The finger loops should twist clockwise as you thread your finger through them so that the side lying closest to the working cord faces in your direction.",
        "Pull a new loop through the threaded loops.",
        "Create a new loose loop from the excess working cord, then pull it through the loops threaded along your finger.",
        "This loop should be directly next to the buckle and around two times the width of the buckle.",
        "Essentially, you're starting a second row that will be identical to the first.",
        "The finger currently threaded through your four previous loops serves the same purpose as the buckle bar did when creating your first row.",
        "Tighten the finger loops until they lie flat.",
        "Remove your finger from the loops.",
        "Tighten the loops starting from the side where the loop is jutting out (the outside), and moving towards the other side (the inside).",
        "To tighten each loop, gently tug on the back side of the loop lying directly next to it.",
        "To tighten the innermost loop, tug on the working side of the cord sticking out from the bundle.",
        "Once you’ve tightened the finger loops down, you may need to pull the through-loop back towards the outside, if it was pulled in by your tugging.",
        "Create new finger loops.",
        "As you did before, ease away the newly wrapped loops to reveal the working portion of paracord.",
        "Use a sharp tool to lift paracord up from beneath the wrapped loops, creating the appropriate number of new finger-sized loops.",
        "The number of finger loops created here should match the number created for your previous row.",
        "These loops form the base of your next pattern row.",
        "They should stand upright while the previously created through loop lies perpendicular and sideways.",
        "Repeat the pattern to your desired length.",
        "After you’ve created your new finger loops, follow the steps above, starting by threading your finger through the pulled loops.",
        "Repeat the previously described pattern steps to create additional rows in the same manner.",
        "Continue making rows until the belt reaches your desired length.",
        "Note that the final length should roughly match the circumference of your waist, minus the length of the buckle belt.",
        "For example, if your waist is 38 inches (96.5 cm) around and the buckle belt is 2 inches (5 cm) long when snapped together, then the length of the paracord portion should be about 36 inches (91.4 cm).",
        "For each row, pull a new loop from the working side of the paracord through the four base loops, which should be threaded on your finger.",
        "Tighten the base loops over the new through loop, then pull up three more finger loops from beneath the row.",
        "The one through loop and three finger loops will be the base for the next row.",
        "Sealing the Opposite End Create a final row of finger loops.",
        "Again, the number should match the number created for all previous rows.",
        "Make sure they stand upright while the previously created through loop lies perpendicular.",
        "Note that you should still have a through loop from your final row; you do not need to create a new one.",
        "Slide the final row through the other buckle half.",
        "Gather the through loop and finger loops together, then push them through the bar of the other buckle half.",
        "The number of loops pushed beneath this buckle bar should match the number of loops wrapped around the bar of the first buckle half.",
        "The connected ends of these loops will stay to the outside of the bar, but the rounded loop ends must pass through completely.",
        "Pass a final through loop over the buckle and through the finger loops.",
        "Create a loop from the working end of the paracord, making it roughly the same size as your previous through loops.",
        "Insert this loop through the finger loop ends sticking up from beneath the buckle bar.",
        "Tighten the loops.",
        "As you did for the body of the pattern, tighten the base loops around the through loop.",
        "Work from the outside in, tugging down on the back side of each loop to tighten the one before it.",
        "Repeat until all of the loops are snug.",
        "Each loop should lay flat at this point.",
        "Trim and then knot the remaining paracord.",
        "Cut the paracord so that there is about 4 inches (10 cm) of excess.",
        "Pull that excess cord through the final loop to create a snug, secure knot.",
        "If you do not like the amount of paracord remaining after you knot the end, you can trim it down further.",
        "Leave at least 1 to 2 inches (2.5 to 5 cm) between the knot and the end, though.",
        "Melt the finishing end.",
        "Hold the flame of a lighter over the raw, cut end of the paracord for several seconds.",
        "Pull it away once the cord end has melted down.",
        "An adequately melted end should prevent the paracord from fraying.",
        "Using the Belt Wear the belt.",
        "At this point, the paracord belt should be finished and ready to wear.",
        "You can wrap the belt around your waist as you would wrap any other belt.",
        "If properly measured, it should be snug enough to serve the same purpose as any belt when the buckle is snapped together.",
        "This is a great belt to wear on climbing, backpacking, or camping trips, when might want access to paracord rope in the case of an emergency.",
        "You can match the belt to a paracord bracelet for some extra outfit coordination.",
        "Unravel the paracord belt to access the rope.",
        "A Slatt’s rescue paracord belt can be unraveled in seconds, allowing you to quickly access a large length of sturdy, reliable cord.",
        "To deploy it, undo the knot tied on one end and remove the buckle end from the belt.",
        "Then, just pull the loose end of cord in your direction, and the belt will begin to unravel.",
        "If you are unable to untie the knot, you could slice off the knots using a pocket knife.",
        "It is also possible to unwind the paracord from the both sides of the buckle.",
        "With practice, it should only take about 20 to 30 seconds to unravel the entire belt, though it will obviously take longer to put the belt back together again.",
        "Use your paracord in a medical emergency.",
        "When a serious injury occurs in the wilderness, you often need to improvise to make it to safety and advanced medical care.",
        "Paracord is a useful tool for emergency medical care.",
        "For example, paracord can be used to make an emergency splint, sling, or even a rope stretcher.To make an emergency splint, lay out some soft material (a jacket or blanket, for example) and a hard object (like a walking stick) to keep the limb stable.",
        "Wrap the paracord around the hard object and the cushioning.",
        "Then tie a knot (above and below the injured area).",
        "A sling will need similar materials to the splint (cushion, hard object, and paracord).",
        "Use the paracord to tie a slip knot around the cushion and hard object to the wrist of the injured arm/shoulder.",
        "Then, wrap the cord up around the neck and secure it to the elbow of the same arm.",
        "Place pieces of cloth under the slip knots at the neck and wrist to prevent rubbing and irritation.",
        "Use your paracord as a rescue tool for a drowning victim.",
        "Tie a figure eight knot in your paracord, then attach the paracord to an object that will float (like a lifejacket or log).",
        "This will help you to throw the cord farther and provide something for the victim to grab onto.",
        "If the victim is in moving water, launch the object upstream of the victim so it will float towards them.",
        "Once the person has grabbed onto the object, reel them in using the paracord."
    ]
}