{
    "title": "How to Build a Solar Lantern",
    "url": "https://www.wikihow.com/Build-a-Solar-Lantern",
    "category_hierarchy": [
        "Home and Garden",
        "Lighting",
        "Lanterns"
    ],
    "steps": [
        {
            "headline": "Decide which color led lights you would like to use.",
            "description": "You can choose from different color LED lights that will be powered by the solar energy you are collecting. Once you've decided, purchase all the items, listed under the Things You'll Need."
        },
        {
            "headline": "Arrange your parts neatly on a table and take note of what everything is and what every part will do.",
            "description": "Familiarize yourself with the parts as this will make it easier for you to build the lantern."
        },
        {
            "headline": "Cut all 8 wires down to a shorter length.",
            "description": "A good recommended length to work with is 3 inches or just a bit longer for all the black and red wires. This ensures you have enough length to re-strip the wires as well."
        },
        {
            "headline": "Re-strip the end of the wires to expose the wire itself.",
            "description": "To do this, insert the newly cut end you just cut into the number 18 size stripping hole below where the cutting blade is on the wire stripper/cutter. Only strip about 1/2in to 3/4in. This will be enough length to tie together in the wire nut. Grip the handles, pull the wire back and the wire stripper should remove the plastic covering the wire. If it doesn't strip, you need to make sure you have the wire in the correct sized hole. When pulling back to strip the wire, do not grip the circuit board and pull as this can result in pulling the wire out of the circuit board. Pull by gripping the wire only."
        },
        {
            "headline": "Take your battery holder and install two AAA batteries.",
            "description": "Install batteries as instructed on battery holder."
        },
        {
            "headline": "Take one grey wire nut and connect the red wire from the battery holder to the red wire from circuit board where it is marked BATTERY.",
            "description": "To connect the wires, bring both ends of red wires together, straighten out the exposed wiring so they easily insert into wire nut(the one from the battery charger and the one from the circuit board) and insert the ends with the wire exposed into the wire nut. Twist the wire nut clockwise as if you were tightening. (remember righty tighty, lefty loosey). After you twist clockwise to tighten the wires together, you can pull wire nut off. Your wire ends should be wrapped together creating a secure electrical bond. It is very important you connect it to the battery section of the circuit."
        },
        {
            "headline": "Connect the black wire from the battery holder to the black wire from circuit board.",
            "description": "It is very important you connect it to the BATTERY section of the circuit!"
        },
        {
            "headline": "Poke a large enough hole through your ball jar lid.",
            "description": "The hole should be large enough for the two black and red wires coming from the solar panel to fit through.The hole should also be made about a 1/2 inches off the edge of the lip of the lid. This will allow the panel to lay flat on the top and will also make sure you can glue the battery holder on the other side of the lid."
        },
        {
            "headline": "String the red and black wires from the solar panel through the hole so that you can connect the wires with the circuit board.",
            "description": ""
        },
        {
            "headline": "Connect the red wire with a wire nut from the solar panel to the red wire from the circuit board where it is marked SOLAR.",
            "description": "After you twist clockwise to tighten the wires together, you can pull wire nut off. Your wire ends should be wrapped together creating a secure electrical bond. Like steps the previous steps it is important to connect these wires to their correct destination on the circuit board."
        },
        {
            "headline": "Connect the black wire from the solar panel to the black wire from circuit board where it is marked SOLAR.",
            "description": ""
        },
        {
            "headline": "Test your light.",
            "description": "Your LED lights should now be on. They are currently running off the battery power as your circuit board is set to battery as the default mode. If your lights do not come on, check to make sure the tiny switches on the circuit board are in the \"on\" position which is towards the center of the board. Also check to make sure your wires are all connected properly."
        },
        {
            "headline": "Glue the battery holder to the bottom of the lid.",
            "description": "Apply a small amount of the instant glue to the batteries and press onto the bottom side of the lid. Hold until it stays on its own."
        },
        {
            "headline": "Glue the battery holder and circuit board together by applying a small amount of glue to the bottom of the circuit board and pressing it to the top (where the batteries are not facing) of the battery holder.",
            "description": ""
        },
        {
            "headline": "Glue the solar panel to the top of the lid.",
            "description": "Apply a small amount of glue to the bottom of the panel (the side that does not look like a grid and has the wires coming out of it) and press and hold the panel to the top of the lid for about a minute. It might not lay completely flat which is okay. Make sure it stays in place though."
        },
        {
            "headline": "Get creative!",
            "description": "You can now put anything into your mason jar to accessorize your solar lantern. Ideas include - stones, succulent plants, marbles, flower pedals."
        },
        {
            "headline": "Screw on your solar lid and enjoy your light!",
            "description": ""
        }
    ],
    "tyn": [
        "1 - 3V 70mA polycrystalline solar panel with wires",
        "1- Circuit board (pcb) with dusk/dawn operation with 2 LEDs",
        "1- Battery holder for 2 AAA batteries",
        "2- AAA NiMH rechargeable batteries",
        "1 yellow wire nut",
        "Any quick setting glue (weatherproof and relatively inexpensive)",
        "Wire stripper and cutter",
        "Any sharp pointed tool to puncture the mason jar lid (a small pair of trimming scissors works great)",
        "1 - Glass ball jar (wide mouth 3\" lid size is preferable)"
    ],
    "text": " Decide which color led lights you would like to use. You can choose from different color LED lights that will be powered by the solar energy you are collecting. Once you've decided, purchase all the items, listed under the Things You'll Need. Arrange your parts neatly on a table and take note of what everything is and what every part will do. Familiarize yourself with the parts as this will make it easier for you to build the lantern. Cut all 8 wires down to a shorter length. A good recommended length to work with is 3 inches or just a bit longer for all the black and red wires. This ensures you have enough length to re-strip the wires as well. Re-strip the end of the wires to expose the wire itself. To do this, insert the newly cut end you just cut into the number 18 size stripping hole below where the cutting blade is on the wire stripper/cutter. Only strip about 1/2in to 3/4in. This will be enough length to tie together in the wire nut. Grip the handles, pull the wire back and the wire stripper should remove the plastic covering the wire. If it doesn't strip, you need to make sure you have the wire in the correct sized hole. When pulling back to strip the wire, do not grip the circuit board and pull as this can result in pulling the wire out of the circuit board. Pull by gripping the wire only. Take your battery holder and install two AAA batteries. Install batteries as instructed on battery holder. Take one grey wire nut and connect the red wire from the battery holder to the red wire from circuit board where it is marked BATTERY. To connect the wires, bring both ends of red wires together, straighten out the exposed wiring so they easily insert into wire nut(the one from the battery charger and the one from the circuit board) and insert the ends with the wire exposed into the wire nut. Twist the wire nut clockwise as if you were tightening. (remember righty tighty, lefty loosey). After you twist clockwise to tighten the wires together, you can pull wire nut off. Your wire ends should be wrapped together creating a secure electrical bond. It is very important you connect it to the battery section of the circuit. Connect the black wire from the battery holder to the black wire from circuit board. It is very important you connect it to the BATTERY section of the circuit! Poke a large enough hole through your ball jar lid. The hole should be large enough for the two black and red wires coming from the solar panel to fit through.The hole should also be made about a 1/2 inches off the edge of the lip of the lid. This will allow the panel to lay flat on the top and will also make sure you can glue the battery holder on the other side of the lid. String the red and black wires from the solar panel through the hole so that you can connect the wires with the circuit board.  Connect the red wire with a wire nut from the solar panel to the red wire from the circuit board where it is marked SOLAR. After you twist clockwise to tighten the wires together, you can pull wire nut off. Your wire ends should be wrapped together creating a secure electrical bond. Like steps the previous steps it is important to connect these wires to their correct destination on the circuit board. Connect the black wire from the solar panel to the black wire from circuit board where it is marked SOLAR.  Test your light. Your LED lights should now be on. They are currently running off the battery power as your circuit board is set to battery as the default mode. If your lights do not come on, check to make sure the tiny switches on the circuit board are in the \"on\" position which is towards the center of the board. Also check to make sure your wires are all connected properly. Glue the battery holder to the bottom of the lid. Apply a small amount of the instant glue to the batteries and press onto the bottom side of the lid. Hold until it stays on its own. Glue the battery holder and circuit board together by applying a small amount of glue to the bottom of the circuit board and pressing it to the top (where the batteries are not facing) of the battery holder.  Glue the solar panel to the top of the lid. Apply a small amount of glue to the bottom of the panel (the side that does not look like a grid and has the wires coming out of it) and press and hold the panel to the top of the lid for about a minute. It might not lay completely flat which is okay. Make sure it stays in place though. Get creative! You can now put anything into your mason jar to accessorize your solar lantern. Ideas include - stones, succulent plants, marbles, flower pedals. Screw on your solar lid and enjoy your light! ",
    "sentences": [
        " Decide which color led lights you would like to use.",
        "You can choose from different color LED lights that will be powered by the solar energy you are collecting.",
        "Once you've decided, purchase all the items, listed under the Things You'll Need.",
        "Arrange your parts neatly on a table and take note of what everything is and what every part will do.",
        "Familiarize yourself with the parts as this will make it easier for you to build the lantern.",
        "Cut all 8 wires down to a shorter length.",
        "A good recommended length to work with is 3 inches or just a bit longer for all the black and red wires.",
        "This ensures you have enough length to re-strip the wires as well.",
        "Re-strip the end of the wires to expose the wire itself.",
        "To do this, insert the newly cut end you just cut into the number 18 size stripping hole below where the cutting blade is on the wire stripper/cutter.",
        "Only strip about 1/2in to 3/4in.",
        "This will be enough length to tie together in the wire nut.",
        "Grip the handles, pull the wire back and the wire stripper should remove the plastic covering the wire.",
        "If it doesn't strip, you need to make sure you have the wire in the correct sized hole.",
        "When pulling back to strip the wire, do not grip the circuit board and pull as this can result in pulling the wire out of the circuit board.",
        "Pull by gripping the wire only.",
        "Take your battery holder and install two AAA batteries.",
        "Install batteries as instructed on battery holder.",
        "Take one grey wire nut and connect the red wire from the battery holder to the red wire from circuit board where it is marked BATTERY.",
        "To connect the wires, bring both ends of red wires together, straighten out the exposed wiring so they easily insert into wire nut(the one from the battery charger and the one from the circuit board) and insert the ends with the wire exposed into the wire nut.",
        "Twist the wire nut clockwise as if you were tightening.",
        "(remember righty tighty, lefty loosey).",
        "After you twist clockwise to tighten the wires together, you can pull wire nut off.",
        "Your wire ends should be wrapped together creating a secure electrical bond.",
        "It is very important you connect it to the battery section of the circuit.",
        "Connect the black wire from the battery holder to the black wire from circuit board.",
        "It is very important you connect it to the BATTERY section of the circuit!",
        "Poke a large enough hole through your ball jar lid.",
        "The hole should be large enough for the two black and red wires coming from the solar panel to fit through.The hole should also be made about a 1/2 inches off the edge of the lip of the lid.",
        "This will allow the panel to lay flat on the top and will also make sure you can glue the battery holder on the other side of the lid.",
        "String the red and black wires from the solar panel through the hole so that you can connect the wires with the circuit board.",
        "Connect the red wire with a wire nut from the solar panel to the red wire from the circuit board where it is marked SOLAR.",
        "After you twist clockwise to tighten the wires together, you can pull wire nut off.",
        "Your wire ends should be wrapped together creating a secure electrical bond.",
        "Like steps the previous steps it is important to connect these wires to their correct destination on the circuit board.",
        "Connect the black wire from the solar panel to the black wire from circuit board where it is marked SOLAR.",
        "Test your light.",
        "Your LED lights should now be on.",
        "They are currently running off the battery power as your circuit board is set to battery as the default mode.",
        "If your lights do not come on, check to make sure the tiny switches on the circuit board are in the \"on\" position which is towards the center of the board.",
        "Also check to make sure your wires are all connected properly.",
        "Glue the battery holder to the bottom of the lid.",
        "Apply a small amount of the instant glue to the batteries and press onto the bottom side of the lid.",
        "Hold until it stays on its own.",
        "Glue the battery holder and circuit board together by applying a small amount of glue to the bottom of the circuit board and pressing it to the top (where the batteries are not facing) of the battery holder.",
        "Glue the solar panel to the top of the lid.",
        "Apply a small amount of glue to the bottom of the panel (the side that does not look like a grid and has the wires coming out of it) and press and hold the panel to the top of the lid for about a minute.",
        "It might not lay completely flat which is okay.",
        "Make sure it stays in place though.",
        "Get creative!",
        "You can now put anything into your mason jar to accessorize your solar lantern.",
        "Ideas include - stones, succulent plants, marbles, flower pedals.",
        "Screw on your solar lid and enjoy your light!"
    ]
}