{
    "title": "How to Make Incense",
    "url": "https://www.wikihow.com/Make-Incense",
    "category_hierarchy": [
        "Health",
        "Alternative Health"
    ],
    "methods": [
        {
            "name": "Making Incense Sticks",
            "steps": [
                {
                    "headline": "Get 30 unscented incense sticks and 1 long, lipped dish.",
                    "description": "Choose specialty incense sticks that are plain and unscented. Make sure the incense sticks can fit into the dish. If the incense sticks are slightly too long for the dish, use scissors to trim down the bamboo end of each stick. A shallow, plastic dish is ideal. The shorter the incense sticks are, the more quickly they will burn. It's important to use specialty incense sticks rather than just plain bamboo sticks. Ordinary bamboo sticks will not work."
                },
                {
                    "headline": "Place dipropylene glycol (DPG) and fragrance or essential oil in the dish.",
                    "description": "Measure out 20 ml (0.68  fl oz) of DPG and 10 ml (0.34  fl oz) of fragrance or essential oil into the dish. Mix the ingredients well with a spoon. DGP helps the incense sticks to burn properly and to reduce the release of black smoke. It is safe to use in your home and you can purchase it online. If you don't use DPG, there will be a strong burning smell when you light the incense. You can use any fragrance or essential oil that you like or a combination of several different oils. Sandalwood is a popular choice for incense sticks."
                },
                {
                    "headline": "Place 10 incense sticks into the dish.",
                    "description": "Make sure that the incense sticks are fully submerged in the DPG and oil mixture. If you place more than 10 incense sticks in the dish at a time, the sticks will not infuse properly."
                },
                {
                    "headline": "Cover the dish with plastic wrap and soak the sticks for 24 hours.",
                    "description": "Tightly wrap the dish with plastic wrap so that that the liquid doesn't evaporate. Leave the dish in a cool, dark place. The sticks will infuse with the incense over the next day."
                },
                {
                    "headline": "Air-dry the sticks on a cooling rack for approximately 24 hours.",
                    "description": "Wear rubber gloves and carefully remove each incense stick from the dish. Spread the sticks out on a cooling rack and leave them to dry, which may take up to a few days depending on the humidity. Don't tightly pack the incense sticks on the cooling rack as there needs to be room around each one for the air to circulate."
                },
                {
                    "headline": "Repeat the soaking and drying process to make 2 more batches.",
                    "description": "Soak the next 10 incense sticks in the liquid for 24 hours. There should be enough liquid left in the dish to use, however, add more DPG and oil if there isn't. Then dry the incense sticks and repeat the process with the final batch. Store the incense sticks in a ziplock bag or a glass jar until they are ready to use."
                },
                {
                    "headline": "Burn the incense sticks using an incense stick holder.",
                    "description": "Prop the plain bamboo end of the incense stick into the groove in the holder so that it hangs over the tray. Light the tip of the incense stick and then blow out the flame. The incense stick will slowly burn and release its aroma. Each incense stick will last approximately 1-2 hours depending on the length. If the incense stick doesn't burn or smolder well, this may be because it is still slightly damp. Let the other incense sticks dry for a longer period of time."
                }
            ]
        },
        {
            "name": "Making Incense Bundles",
            "steps": [
                {
                    "headline": "Make a ⁄2 in (1.3 cm) thick bouquet of flowers and herbs.",
                    "description": "Choose fresh flowers and herbs that you enjoy the scent of or pick a more traditional combination of lavender, rose, thyme, eucalyptus, and rosemary. Make sure that all of the plants are facing the same direction, with stems at one end and leaves or flowers at the opposite end. Try to choose flowers and herbs that dry well and that haven't been grown with pesticides or chemicals. You can also include cuttings from cedar or pine trees."
                },
                {
                    "headline": "Use cotton twine to hold the bouquet or flowers and herbs together.",
                    "description": "Use a ruler and scissors to measure and cut a piece of cotton twine that is approximately 4 in (10 cm) long. Knot the twine tightly around the middle of the bouquet to hold it together."
                },
                {
                    "headline": "Wrap the bouquet in 8-10 fresh sage leaves.",
                    "description": "Hold the bouquet of flowers and herbs in one hand and use your other hand to line up the sage leaves around the bouquet. Make sure that the outside of the bouquet is fully covered by the sage leaves. Use more or fewer sage leaves as required. Sage is the most traditional and popular ingredient to use in an incense bundle. However, if you do not have sage, it's fine to make your incense bundle without it."
                },
                {
                    "headline": "Tie the bundle together using cotton twine.",
                    "description": "Cut and measure a piece of cotton twine that is approximately 8 times as long as the bundle you have made. Use the twine to tie a knot ⁄2 in (1.3 cm) from the bottom of the stems. Make one end of the knotted twine only 2 in (5.1 cm) long, while the other end is the remainder."
                },
                {
                    "headline": "Wrap the twine around the bundle of flowers and herbs.",
                    "description": "Use the long end of the twine to wrap around the bundle. Wrap the twine as tightly, as the herbs and flowers will shrink slightly as they dry. Once you reach the other end of the bundle, wind the twine back down the bundle in the opposite direction. This will create a criss-cross formation with the twine."
                },
                {
                    "headline": "Tie off the twine at the end of the bundle.",
                    "description": "Once you have wrapped the whole bundle, wrap the remaining twine around the stems at the end of the bundle. Tuck in any loose ends under the wrapped twine. The wrapped twine at the end of the bundle creates a handle that you can hold as the incense burns."
                },
                {
                    "headline": "Let the incense bundle dry for 2-3 weeks.",
                    "description": "Hang the incense bundle in a cool, dry, and dark location. Make sure that the incense bundle is completely dry before you burn it. The amount of time that it will take for the bundle to dry depends on the humidity."
                },
                {
                    "headline": "Light the end of the bundle to burn the incense.",
                    "description": "Hold the bundle by the twine handle. Set the opposite end of the bundle alight. Blow out the flames and place the bundle into a heatproof dish. The smoldering bundle will release the aroma of the incense. It is easiest to hold the bundle horizontally rather than vertically as you are lighting it. To put the incense out, simply snuff it on the heatproof dish. If you use water to stop the incense burning, it will be very difficult to light again."
                }
            ]
        },
        {
            "name": "Making Loose Incense",
            "steps": [
                {
                    "headline": "Measure out 1 tsp each of lavender flowers, rosemary, thyme, sage, and peppermint.",
                    "description": "Lay all of your flowers and herbs out in front of you. Use a measuring spoon to determine the amount of each ingredient. You don't need to cut the ingredients, as they will be ground up soon. Make sure that all of your ingredients are fresh. You can use either white sage or garden sage."
                },
                {
                    "headline": "Grind the ingredients into a fine powder.",
                    "description": "Place all of the ingredients into a mortar. Use the pestle to grind and crush the flowers and herbs. Continue grinding the ingredients until there are no large fragments left. Alternatively, you can use an electric grinder rather than a mortar and pestle."
                },
                {
                    "headline": "Mix red sandalwood powder and essential oils into the ingredients.",
                    "description": "Place 1 tsp of red sandalwood powder and 3-4 drops of essential oils directly into the mortar and use the pestle to combine them with the other ingredients. Use any combination of lavender, rosemary, thyme, sage, or peppermint essential oils. You don't need to grind the ingredients as such, but rather just make sure that the powdered flowers and herbs are thoroughly mixed with the sandalwood powder and essential oils. If you used an electric grinder, place the powdered flowers and herbs, red sandalwood powder, and essential oils into a glass bowl. Combine the ingredients with a whisk."
                },
                {
                    "headline": "Store the incense in a cool, dark, place.",
                    "description": "Place the incense into an airtight, glass container. Keep the container out of the sun and open it only when you want to use the incense. This will help to preserve the scent and color of your incense."
                },
                {
                    "headline": "Burn the incense on a charcoal disk in a heatproof dish.",
                    "description": "Spread a thin layer of sand on the bottom of the heatproof dish. Then place the charcoal disk on top of the sand. Light the charcoal disk, place a small sprinkle of the loose incense on top of the disk, and enjoy the aroma of your own homemade, loose incense. Alternatively, use a small cauldron rather than a heatproof dish. You can also use salt rather than sand to layer the heatproof dish or cauldron."
                }
            ]
        }
    ],
    "tyn": [
        "Making Incense Sticks",
        "Plain, bamboo incense sticks",
        "Long, lipped dish",
        "DPG",
        "Fragrance or essential oil",
        "Measuring spoon",
        "Spoon",
        "Plastic wrap",
        "Rubber gloves",
        "Cooling rack",
        "Ziplock bag or glass jar",
        "Incense stick holder",
        "Making Incense Bundles",
        "Fresh flowers and herbs",
        "Sage",
        "Cotton twine",
        "Ruler",
        "Scissors",
        "Lighter",
        "Heatproof dish",
        "Making Loose Incense",
        "Lavender",
        "Rosemary",
        "Thyme",
        "Peppermint",
        "Mortar and pestle or electric grinder",
        "Sandalwood powder",
        "Essential oils",
        "Glass bowl",
        "Whisk",
        "Glass container",
        "Heatproof dish or small cauldron",
        "Sand or salt",
        "Charcoal disk"
    ],
    "text": " Making Incense Sticks Get 30 unscented incense sticks and 1 long, lipped dish. Choose specialty incense sticks that are plain and unscented. Make sure the incense sticks can fit into the dish. If the incense sticks are slightly too long for the dish, use scissors to trim down the bamboo end of each stick. A shallow, plastic dish is ideal. The shorter the incense sticks are, the more quickly they will burn. It's important to use specialty incense sticks rather than just plain bamboo sticks. Ordinary bamboo sticks will not work. Place dipropylene glycol (DPG) and fragrance or essential oil in the dish. Measure out 20 ml (0.68  fl oz) of DPG and 10 ml (0.34  fl oz) of fragrance or essential oil into the dish. Mix the ingredients well with a spoon. DGP helps the incense sticks to burn properly and to reduce the release of black smoke. It is safe to use in your home and you can purchase it online. If you don't use DPG, there will be a strong burning smell when you light the incense. You can use any fragrance or essential oil that you like or a combination of several different oils. Sandalwood is a popular choice for incense sticks. Place 10 incense sticks into the dish. Make sure that the incense sticks are fully submerged in the DPG and oil mixture. If you place more than 10 incense sticks in the dish at a time, the sticks will not infuse properly. Cover the dish with plastic wrap and soak the sticks for 24 hours. Tightly wrap the dish with plastic wrap so that that the liquid doesn't evaporate. Leave the dish in a cool, dark place. The sticks will infuse with the incense over the next day. Air-dry the sticks on a cooling rack for approximately 24 hours. Wear rubber gloves and carefully remove each incense stick from the dish. Spread the sticks out on a cooling rack and leave them to dry, which may take up to a few days depending on the humidity. Don't tightly pack the incense sticks on the cooling rack as there needs to be room around each one for the air to circulate. Repeat the soaking and drying process to make 2 more batches. Soak the next 10 incense sticks in the liquid for 24 hours. There should be enough liquid left in the dish to use, however, add more DPG and oil if there isn't. Then dry the incense sticks and repeat the process with the final batch. Store the incense sticks in a ziplock bag or a glass jar until they are ready to use. Burn the incense sticks using an incense stick holder. Prop the plain bamboo end of the incense stick into the groove in the holder so that it hangs over the tray. Light the tip of the incense stick and then blow out the flame. The incense stick will slowly burn and release its aroma. Each incense stick will last approximately 1-2 hours depending on the length. If the incense stick doesn't burn or smolder well, this may be because it is still slightly damp. Let the other incense sticks dry for a longer period of time. Making Incense Bundles Make a ⁄2 in (1.3 cm) thick bouquet of flowers and herbs. Choose fresh flowers and herbs that you enjoy the scent of or pick a more traditional combination of lavender, rose, thyme, eucalyptus, and rosemary. Make sure that all of the plants are facing the same direction, with stems at one end and leaves or flowers at the opposite end. Try to choose flowers and herbs that dry well and that haven't been grown with pesticides or chemicals. You can also include cuttings from cedar or pine trees. Use cotton twine to hold the bouquet or flowers and herbs together. Use a ruler and scissors to measure and cut a piece of cotton twine that is approximately 4 in (10 cm) long. Knot the twine tightly around the middle of the bouquet to hold it together. Wrap the bouquet in 8-10 fresh sage leaves. Hold the bouquet of flowers and herbs in one hand and use your other hand to line up the sage leaves around the bouquet. Make sure that the outside of the bouquet is fully covered by the sage leaves. Use more or fewer sage leaves as required. Sage is the most traditional and popular ingredient to use in an incense bundle. However, if you do not have sage, it's fine to make your incense bundle without it. Tie the bundle together using cotton twine. Cut and measure a piece of cotton twine that is approximately 8 times as long as the bundle you have made. Use the twine to tie a knot ⁄2 in (1.3 cm) from the bottom of the stems. Make one end of the knotted twine only 2 in (5.1 cm) long, while the other end is the remainder. Wrap the twine around the bundle of flowers and herbs. Use the long end of the twine to wrap around the bundle. Wrap the twine as tightly, as the herbs and flowers will shrink slightly as they dry. Once you reach the other end of the bundle, wind the twine back down the bundle in the opposite direction. This will create a criss-cross formation with the twine. Tie off the twine at the end of the bundle. Once you have wrapped the whole bundle, wrap the remaining twine around the stems at the end of the bundle. Tuck in any loose ends under the wrapped twine. The wrapped twine at the end of the bundle creates a handle that you can hold as the incense burns. Let the incense bundle dry for 2-3 weeks. Hang the incense bundle in a cool, dry, and dark location. Make sure that the incense bundle is completely dry before you burn it. The amount of time that it will take for the bundle to dry depends on the humidity. Light the end of the bundle to burn the incense. Hold the bundle by the twine handle. Set the opposite end of the bundle alight. Blow out the flames and place the bundle into a heatproof dish. The smoldering bundle will release the aroma of the incense. It is easiest to hold the bundle horizontally rather than vertically as you are lighting it. To put the incense out, simply snuff it on the heatproof dish. If you use water to stop the incense burning, it will be very difficult to light again. Making Loose Incense Measure out 1 tsp each of lavender flowers, rosemary, thyme, sage, and peppermint. Lay all of your flowers and herbs out in front of you. Use a measuring spoon to determine the amount of each ingredient. You don't need to cut the ingredients, as they will be ground up soon. Make sure that all of your ingredients are fresh. You can use either white sage or garden sage. Grind the ingredients into a fine powder. Place all of the ingredients into a mortar. Use the pestle to grind and crush the flowers and herbs. Continue grinding the ingredients until there are no large fragments left. Alternatively, you can use an electric grinder rather than a mortar and pestle. Mix red sandalwood powder and essential oils into the ingredients. Place 1 tsp of red sandalwood powder and 3-4 drops of essential oils directly into the mortar and use the pestle to combine them with the other ingredients. Use any combination of lavender, rosemary, thyme, sage, or peppermint essential oils. You don't need to grind the ingredients as such, but rather just make sure that the powdered flowers and herbs are thoroughly mixed with the sandalwood powder and essential oils. If you used an electric grinder, place the powdered flowers and herbs, red sandalwood powder, and essential oils into a glass bowl. Combine the ingredients with a whisk. Store the incense in a cool, dark, place. Place the incense into an airtight, glass container. Keep the container out of the sun and open it only when you want to use the incense. This will help to preserve the scent and color of your incense. Burn the incense on a charcoal disk in a heatproof dish. Spread a thin layer of sand on the bottom of the heatproof dish. Then place the charcoal disk on top of the sand. Light the charcoal disk, place a small sprinkle of the loose incense on top of the disk, and enjoy the aroma of your own homemade, loose incense. Alternatively, use a small cauldron rather than a heatproof dish. You can also use salt rather than sand to layer the heatproof dish or cauldron.",
    "sentences": [
        " Making Incense Sticks Get 30 unscented incense sticks and 1 long, lipped dish.",
        "Choose specialty incense sticks that are plain and unscented.",
        "Make sure the incense sticks can fit into the dish.",
        "If the incense sticks are slightly too long for the dish, use scissors to trim down the bamboo end of each stick.",
        "A shallow, plastic dish is ideal.",
        "The shorter the incense sticks are, the more quickly they will burn.",
        "It's important to use specialty incense sticks rather than just plain bamboo sticks.",
        "Ordinary bamboo sticks will not work.",
        "Place dipropylene glycol (DPG) and fragrance or essential oil in the dish.",
        "Measure out 20 ml (0.68  fl oz) of DPG and 10 ml (0.34  fl oz) of fragrance or essential oil into the dish.",
        "Mix the ingredients well with a spoon.",
        "DGP helps the incense sticks to burn properly and to reduce the release of black smoke.",
        "It is safe to use in your home and you can purchase it online.",
        "If you don't use DPG, there will be a strong burning smell when you light the incense.",
        "You can use any fragrance or essential oil that you like or a combination of several different oils.",
        "Sandalwood is a popular choice for incense sticks.",
        "Place 10 incense sticks into the dish.",
        "Make sure that the incense sticks are fully submerged in the DPG and oil mixture.",
        "If you place more than 10 incense sticks in the dish at a time, the sticks will not infuse properly.",
        "Cover the dish with plastic wrap and soak the sticks for 24 hours.",
        "Tightly wrap the dish with plastic wrap so that that the liquid doesn't evaporate.",
        "Leave the dish in a cool, dark place.",
        "The sticks will infuse with the incense over the next day.",
        "Air-dry the sticks on a cooling rack for approximately 24 hours.",
        "Wear rubber gloves and carefully remove each incense stick from the dish.",
        "Spread the sticks out on a cooling rack and leave them to dry, which may take up to a few days depending on the humidity.",
        "Don't tightly pack the incense sticks on the cooling rack as there needs to be room around each one for the air to circulate.",
        "Repeat the soaking and drying process to make 2 more batches.",
        "Soak the next 10 incense sticks in the liquid for 24 hours.",
        "There should be enough liquid left in the dish to use, however, add more DPG and oil if there isn't.",
        "Then dry the incense sticks and repeat the process with the final batch.",
        "Store the incense sticks in a ziplock bag or a glass jar until they are ready to use.",
        "Burn the incense sticks using an incense stick holder.",
        "Prop the plain bamboo end of the incense stick into the groove in the holder so that it hangs over the tray.",
        "Light the tip of the incense stick and then blow out the flame.",
        "The incense stick will slowly burn and release its aroma.",
        "Each incense stick will last approximately 1-2 hours depending on the length.",
        "If the incense stick doesn't burn or smolder well, this may be because it is still slightly damp.",
        "Let the other incense sticks dry for a longer period of time.",
        "Making Incense Bundles Make a ⁄2 in (1.3 cm) thick bouquet of flowers and herbs.",
        "Choose fresh flowers and herbs that you enjoy the scent of or pick a more traditional combination of lavender, rose, thyme, eucalyptus, and rosemary.",
        "Make sure that all of the plants are facing the same direction, with stems at one end and leaves or flowers at the opposite end.",
        "Try to choose flowers and herbs that dry well and that haven't been grown with pesticides or chemicals.",
        "You can also include cuttings from cedar or pine trees.",
        "Use cotton twine to hold the bouquet or flowers and herbs together.",
        "Use a ruler and scissors to measure and cut a piece of cotton twine that is approximately 4 in (10 cm) long.",
        "Knot the twine tightly around the middle of the bouquet to hold it together.",
        "Wrap the bouquet in 8-10 fresh sage leaves.",
        "Hold the bouquet of flowers and herbs in one hand and use your other hand to line up the sage leaves around the bouquet.",
        "Make sure that the outside of the bouquet is fully covered by the sage leaves.",
        "Use more or fewer sage leaves as required.",
        "Sage is the most traditional and popular ingredient to use in an incense bundle.",
        "However, if you do not have sage, it's fine to make your incense bundle without it.",
        "Tie the bundle together using cotton twine.",
        "Cut and measure a piece of cotton twine that is approximately 8 times as long as the bundle you have made.",
        "Use the twine to tie a knot ⁄2 in (1.3 cm) from the bottom of the stems.",
        "Make one end of the knotted twine only 2 in (5.1 cm) long, while the other end is the remainder.",
        "Wrap the twine around the bundle of flowers and herbs.",
        "Use the long end of the twine to wrap around the bundle.",
        "Wrap the twine as tightly, as the herbs and flowers will shrink slightly as they dry.",
        "Once you reach the other end of the bundle, wind the twine back down the bundle in the opposite direction.",
        "This will create a criss-cross formation with the twine.",
        "Tie off the twine at the end of the bundle.",
        "Once you have wrapped the whole bundle, wrap the remaining twine around the stems at the end of the bundle.",
        "Tuck in any loose ends under the wrapped twine.",
        "The wrapped twine at the end of the bundle creates a handle that you can hold as the incense burns.",
        "Let the incense bundle dry for 2-3 weeks.",
        "Hang the incense bundle in a cool, dry, and dark location.",
        "Make sure that the incense bundle is completely dry before you burn it.",
        "The amount of time that it will take for the bundle to dry depends on the humidity.",
        "Light the end of the bundle to burn the incense.",
        "Hold the bundle by the twine handle.",
        "Set the opposite end of the bundle alight.",
        "Blow out the flames and place the bundle into a heatproof dish.",
        "The smoldering bundle will release the aroma of the incense.",
        "It is easiest to hold the bundle horizontally rather than vertically as you are lighting it.",
        "To put the incense out, simply snuff it on the heatproof dish.",
        "If you use water to stop the incense burning, it will be very difficult to light again.",
        "Making Loose Incense Measure out 1 tsp each of lavender flowers, rosemary, thyme, sage, and peppermint.",
        "Lay all of your flowers and herbs out in front of you.",
        "Use a measuring spoon to determine the amount of each ingredient.",
        "You don't need to cut the ingredients, as they will be ground up soon.",
        "Make sure that all of your ingredients are fresh.",
        "You can use either white sage or garden sage.",
        "Grind the ingredients into a fine powder.",
        "Place all of the ingredients into a mortar.",
        "Use the pestle to grind and crush the flowers and herbs.",
        "Continue grinding the ingredients until there are no large fragments left.",
        "Alternatively, you can use an electric grinder rather than a mortar and pestle.",
        "Mix red sandalwood powder and essential oils into the ingredients.",
        "Place 1 tsp of red sandalwood powder and 3-4 drops of essential oils directly into the mortar and use the pestle to combine them with the other ingredients.",
        "Use any combination of lavender, rosemary, thyme, sage, or peppermint essential oils.",
        "You don't need to grind the ingredients as such, but rather just make sure that the powdered flowers and herbs are thoroughly mixed with the sandalwood powder and essential oils.",
        "If you used an electric grinder, place the powdered flowers and herbs, red sandalwood powder, and essential oils into a glass bowl.",
        "Combine the ingredients with a whisk.",
        "Store the incense in a cool, dark, place.",
        "Place the incense into an airtight, glass container.",
        "Keep the container out of the sun and open it only when you want to use the incense.",
        "This will help to preserve the scent and color of your incense.",
        "Burn the incense on a charcoal disk in a heatproof dish.",
        "Spread a thin layer of sand on the bottom of the heatproof dish.",
        "Then place the charcoal disk on top of the sand.",
        "Light the charcoal disk, place a small sprinkle of the loose incense on top of the disk, and enjoy the aroma of your own homemade, loose incense.",
        "Alternatively, use a small cauldron rather than a heatproof dish.",
        "You can also use salt rather than sand to layer the heatproof dish or cauldron."
    ]
}