{
    "title": "How to Wear Green Eyeshadow",
    "url": "https://www.wikihow.com/Wear-Green-Eyeshadow",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Makeup",
        "Eye Makeup",
        "Eye Shadow",
        "Green Eye Shadow"
    ],
    "methods": [
        {
            "name": "Creating a Dramatic Green Eyeshadow Look",
            "steps": [
                {
                    "headline": "Choose eyeshadow shades.",
                    "description": "For this look, choose three bright green shadows: a light, medium, and dark shade. The lighter shade can even be a lime green, and the dark and medium shades can be similar kelly greens. Make sure you're using highly pigmented eyeshadows for maximum color payoff. For even more drama, choose eyeshadows with a glitter or shimmer finish."
                },
                {
                    "headline": "Prime your eyelids.",
                    "description": "This step is especially important with a bright eye color, as it keeps the shadow from smearing to other parts of your face. Primers also helps you avoid creased or splotchy shadow at the end of a day. Use an eyeshadow brush to sweep eyeshadow primer all over your eyelid to your brow bone. If you don't have a designated eyeshadow primer, you can use your concealer or a nude cream eyeshadow in the same manner."
                },
                {
                    "headline": "Apply the lightest green near your brow bone.",
                    "description": "You only want to cover the top third of your eye area. Get the color as evenly matched as you can on both eyes. When you start to apply shadow, lightly tap your brush in the eyeshadow pan. You want to slightest amount of pigment on your brush. It is easier to build your eyeshadow in layers than to take shadow away if you apply too much."
                },
                {
                    "headline": "Blend the darkest green shade in your eyelid crease.",
                    "description": "A dark color in your crease defines the shape of your eyes, and makes their color more pronounced. After you do this, take a clean brush and blend the dark color up into your lighter brow bone color. To blend eyeshadow, go back and forth across this area with your eyeshadow brush in small circles until it looks airbrushed. Remember that blending takes patience. Keep your strokes light. The longer you blend, the better your finished eyes will look."
                },
                {
                    "headline": "Apply winged eyeliner.",
                    "description": "Dramatic eyeliner is an essential part of any bold eye look. A thick, dark liner will draw attention to your bright green eyeshadow. For winged liner, a liquid liner works best. Either use black or a dark green to accentuate your eyeshadow. Create a clean sharp line on top of the eyelid and extend towards the edge of the eye. The end of your line should angle toward the end of your eyebrow."
                },
                {
                    "headline": "Add the medium shade of green on top of your eyeliner and all over your eyelid.",
                    "description": "This will set your eyeliner, and bring the look together. Take another clean brush and sweep it over your eye area to blend the shades together. Take a look at your eyeshadows together. If the lightest shade looks too light compared to your lid, you can add a bit more pigment for balance. As you apply eyeshadow, keep your brushes separate or wipe them off between the different shades."
                },
                {
                    "headline": "Add another layer of eyeliner on top of the eyeshadow.",
                    "description": "This will emphasize your eyes, and create depth to your liner. With a fresh coat of eyeliner, the line will look crisp and not powdery. For an even more defined eyeliner look, line your waterline in addition to your winged liner. Your waterline is beneath your eyelashes near your eyeball. You can line your waterline with a nude-colored pencil for brightening, or with a black or brown pencil for a darker dramatic effect."
                },
                {
                    "headline": "Finish with two coats of mascara.",
                    "description": "Mascara will make your eyes appear open and bright. Use a mascara designed to volumize your eyelashes. Wiggle the wand of your mascara back and forth, starting at the base of your lashes, to prevent clumping. Use dark black mascara, or mascara with glitter for extra sparkle. For even more volume, consider using false eyelashes in addition to your mascara."
                }
            ]
        },
        {
            "name": "Creating a Subtle Green Eyeshadow Look",
            "steps": [
                {
                    "headline": "Choose an earth-toned green shadow.",
                    "description": "Look for undertones of browns and taupes. Pick a muted sage green for an everyday green eyeshadow look. This works with different skin tones and eye colors. It will simply have a slightly different look. For example, darker skin brings out the blue tone in the shadow, while yellow undertones bring out the green's golden hues, and lighter, pink skin accentuates the darker pigments in the green. Using only one eyeshadow color in your look adds subtlety and sophistication to a standout color. If you only have a bright green eyeshadow, try mixing it or layering it with a brown eyeshadow for a muting effect."
                },
                {
                    "headline": "Prime your eyelids.",
                    "description": "This will prevent your eyeshadow from creasing. With primer, your eyeshadow look will stay in place and crisp all day. Using a clean concealer brush or eyeshadow brush, sweep the primer all over your eye area. You can use neutral cream eyeshadow or concealer in place of a primer, if you don't have one."
                },
                {
                    "headline": "Apply the eyeshadow to the outer halves of your eyelids.",
                    "description": "Take it up slightly past your crease. This outer section is where the color should be the darkest and most pronounced. For definition, brush on your eyeshadow to come to a point near the corner of your eyebrow, almost like you would draw on a liquid winged liner. This shape opens up your eye area and adds sophistication."
                },
                {
                    "headline": "Lightly brush the same eyeshadow over the inner corner of your eyelids.",
                    "description": "Extend it up past your crease. The inner corners of your eyes should be a lighter shade than the outer corners. Remember that it's easier to build up your eyeshadow than to get the right shade on the first try. Add layers of color until you are happy with the darkness."
                },
                {
                    "headline": "Add some green shadow under your bottom lash line.",
                    "description": "Use the same green eyeshadow you used on your lid. Use a small eyeliner brush to extend this color from the middle of your bottom lash line to the outer corner of your eye. To make this shadow almost like a light eyeliner, dampen the tip of your eyeliner brush before tapping it in your eyeshadow. Using the shadow damp will give you a cleaner line."
                },
                {
                    "headline": "Use a clean eyeshadow brush to blend.",
                    "description": "Sweep this brush in light circles back and forth across your eyelids until the two shades of the same shadow blend into each other seamlessly. Take your time in blending. The longer you spend, the more polished your finished look with be."
                },
                {
                    "headline": "Line your lids in brown.",
                    "description": "You don't want to use black eyeliner for this natural green eyeshadow look, as it can be too harsh. Use pencil liner for a softer look. Use your brown eyeliner pencil to line above your lash line and along your water line. Don't extend your eyeliner into a flick. For an even more natural look, skip the eyeliner all together."
                },
                {
                    "headline": "Finish with mascara.",
                    "description": "Use one or two coats. Wiggle the mascara back and forth at your lash line to prevent clumping. Consider using dark brown mascara, instead of black, for a more natural, soft look. Use a lengthening mascara for a delicate look."
                }
            ]
        },
        {
            "name": "Finishing Your Makeup to Complement Your Eyeshadow",
            "steps": [
                {
                    "headline": "Apply foundation or tinted moisturizer to your face.",
                    "description": "Your skin needs to have a pretty and natural freshness for this look. If you don't need much coverage, try a tinted moisturizer, as it will give a dewy glow. If you still want dewy skin but need a bit more coverage than a tinted moisturizer, try mixing your moisturizer with a heavier foundation. Use a foundation brush or Beauty Blender to apply your foundation or tinted moisturizer This will give you an airbrushed finish that isn't splotchy. Wait until you've finished your eye look to apply your face make up. You'll be able to balance your look better, and if you mess up while doing your eyes, you can more easily wipe off the makeup and start again."
                },
                {
                    "headline": "Conceal any red spots or hyperpigmentation.",
                    "description": "With a bold eye, your skin should look flawless and spot-free. With a blender or concealing brush, apply your concealer to cover up any acne spots. Sweep a brightening concealer underneath your eyes to make yourself look more awake."
                },
                {
                    "headline": "Apply a hint of blush and bronzer.",
                    "description": "This will give your skin a sunny, peachy glow. Make sure to use a bronzer that has brown undertones so that your skin doesn't get orange. Lightly tap a powder brush in a peachy pink shade of blush and then in your favorite bronzer. With both the bronzer and blush on your brush, lightly sweep it upward across your cheekbones."
                },
                {
                    "headline": "Wear a nude lip.",
                    "description": "Your green eyeshadow is the focus of your look. Wear a lipstick shade that is neutral to offset the eye. Depending on your skin tone, look for neutrals that are pink or beige. Alternately, you can simply apply some clear gloss or lip balm to your lips so they look natural, plump, and healthy."
                }
            ]
        }
    ],
    "tyn": [
        "Green eyeshadow",
        "Black or brown eyeliner",
        "Black or brown mascara",
        "Makeup brushes",
        "Concealer, foundation, and nude lipstick or lip balm"
    ],
    "text": " Creating a Dramatic Green Eyeshadow Look Choose eyeshadow shades. For this look, choose three bright green shadows: a light, medium, and dark shade. The lighter shade can even be a lime green, and the dark and medium shades can be similar kelly greens. Make sure you're using highly pigmented eyeshadows for maximum color payoff. For even more drama, choose eyeshadows with a glitter or shimmer finish. Prime your eyelids. This step is especially important with a bright eye color, as it keeps the shadow from smearing to other parts of your face. Primers also helps you avoid creased or splotchy shadow at the end of a day. Use an eyeshadow brush to sweep eyeshadow primer all over your eyelid to your brow bone. If you don't have a designated eyeshadow primer, you can use your concealer or a nude cream eyeshadow in the same manner. Apply the lightest green near your brow bone. You only want to cover the top third of your eye area. Get the color as evenly matched as you can on both eyes. When you start to apply shadow, lightly tap your brush in the eyeshadow pan. You want to slightest amount of pigment on your brush. It is easier to build your eyeshadow in layers than to take shadow away if you apply too much. Blend the darkest green shade in your eyelid crease. A dark color in your crease defines the shape of your eyes, and makes their color more pronounced. After you do this, take a clean brush and blend the dark color up into your lighter brow bone color. To blend eyeshadow, go back and forth across this area with your eyeshadow brush in small circles until it looks airbrushed. Remember that blending takes patience. Keep your strokes light. The longer you blend, the better your finished eyes will look. Apply winged eyeliner. Dramatic eyeliner is an essential part of any bold eye look. A thick, dark liner will draw attention to your bright green eyeshadow. For winged liner, a liquid liner works best. Either use black or a dark green to accentuate your eyeshadow. Create a clean sharp line on top of the eyelid and extend towards the edge of the eye. The end of your line should angle toward the end of your eyebrow. Add the medium shade of green on top of your eyeliner and all over your eyelid. This will set your eyeliner, and bring the look together. Take another clean brush and sweep it over your eye area to blend the shades together. Take a look at your eyeshadows together. If the lightest shade looks too light compared to your lid, you can add a bit more pigment for balance. As you apply eyeshadow, keep your brushes separate or wipe them off between the different shades. Add another layer of eyeliner on top of the eyeshadow. This will emphasize your eyes, and create depth to your liner. With a fresh coat of eyeliner, the line will look crisp and not powdery. For an even more defined eyeliner look, line your waterline in addition to your winged liner. Your waterline is beneath your eyelashes near your eyeball. You can line your waterline with a nude-colored pencil for brightening, or with a black or brown pencil for a darker dramatic effect. Finish with two coats of mascara. Mascara will make your eyes appear open and bright. Use a mascara designed to volumize your eyelashes. Wiggle the wand of your mascara back and forth, starting at the base of your lashes, to prevent clumping. Use dark black mascara, or mascara with glitter for extra sparkle. For even more volume, consider using false eyelashes in addition to your mascara. Creating a Subtle Green Eyeshadow Look Choose an earth-toned green shadow. Look for undertones of browns and taupes. Pick a muted sage green for an everyday green eyeshadow look. This works with different skin tones and eye colors. It will simply have a slightly different look. For example, darker skin brings out the blue tone in the shadow, while yellow undertones bring out the green's golden hues, and lighter, pink skin accentuates the darker pigments in the green. Using only one eyeshadow color in your look adds subtlety and sophistication to a standout color. If you only have a bright green eyeshadow, try mixing it or layering it with a brown eyeshadow for a muting effect. Prime your eyelids. This will prevent your eyeshadow from creasing. With primer, your eyeshadow look will stay in place and crisp all day. Using a clean concealer brush or eyeshadow brush, sweep the primer all over your eye area. You can use neutral cream eyeshadow or concealer in place of a primer, if you don't have one. Apply the eyeshadow to the outer halves of your eyelids. Take it up slightly past your crease. This outer section is where the color should be the darkest and most pronounced. For definition, brush on your eyeshadow to come to a point near the corner of your eyebrow, almost like you would draw on a liquid winged liner. This shape opens up your eye area and adds sophistication. Lightly brush the same eyeshadow over the inner corner of your eyelids. Extend it up past your crease. The inner corners of your eyes should be a lighter shade than the outer corners. Remember that it's easier to build up your eyeshadow than to get the right shade on the first try. Add layers of color until you are happy with the darkness. Add some green shadow under your bottom lash line. Use the same green eyeshadow you used on your lid. Use a small eyeliner brush to extend this color from the middle of your bottom lash line to the outer corner of your eye. To make this shadow almost like a light eyeliner, dampen the tip of your eyeliner brush before tapping it in your eyeshadow. Using the shadow damp will give you a cleaner line. Use a clean eyeshadow brush to blend. Sweep this brush in light circles back and forth across your eyelids until the two shades of the same shadow blend into each other seamlessly. Take your time in blending. The longer you spend, the more polished your finished look with be. Line your lids in brown. You don't want to use black eyeliner for this natural green eyeshadow look, as it can be too harsh. Use pencil liner for a softer look. Use your brown eyeliner pencil to line above your lash line and along your water line. Don't extend your eyeliner into a flick. For an even more natural look, skip the eyeliner all together. Finish with mascara. Use one or two coats. Wiggle the mascara back and forth at your lash line to prevent clumping. Consider using dark brown mascara, instead of black, for a more natural, soft look. Use a lengthening mascara for a delicate look. Finishing Your Makeup to Complement Your Eyeshadow Apply foundation or tinted moisturizer to your face. Your skin needs to have a pretty and natural freshness for this look. If you don't need much coverage, try a tinted moisturizer, as it will give a dewy glow. If you still want dewy skin but need a bit more coverage than a tinted moisturizer, try mixing your moisturizer with a heavier foundation. Use a foundation brush or Beauty Blender to apply your foundation or tinted moisturizer This will give you an airbrushed finish that isn't splotchy. Wait until you've finished your eye look to apply your face make up. You'll be able to balance your look better, and if you mess up while doing your eyes, you can more easily wipe off the makeup and start again. Conceal any red spots or hyperpigmentation. With a bold eye, your skin should look flawless and spot-free. With a blender or concealing brush, apply your concealer to cover up any acne spots. Sweep a brightening concealer underneath your eyes to make yourself look more awake. Apply a hint of blush and bronzer. This will give your skin a sunny, peachy glow. Make sure to use a bronzer that has brown undertones so that your skin doesn't get orange. Lightly tap a powder brush in a peachy pink shade of blush and then in your favorite bronzer. With both the bronzer and blush on your brush, lightly sweep it upward across your cheekbones. Wear a nude lip. Your green eyeshadow is the focus of your look. Wear a lipstick shade that is neutral to offset the eye. Depending on your skin tone, look for neutrals that are pink or beige. Alternately, you can simply apply some clear gloss or lip balm to your lips so they look natural, plump, and healthy.",
    "sentences": [
        " Creating a Dramatic Green Eyeshadow Look Choose eyeshadow shades.",
        "For this look, choose three bright green shadows: a light, medium, and dark shade.",
        "The lighter shade can even be a lime green, and the dark and medium shades can be similar kelly greens.",
        "Make sure you're using highly pigmented eyeshadows for maximum color payoff.",
        "For even more drama, choose eyeshadows with a glitter or shimmer finish.",
        "Prime your eyelids.",
        "This step is especially important with a bright eye color, as it keeps the shadow from smearing to other parts of your face.",
        "Primers also helps you avoid creased or splotchy shadow at the end of a day.",
        "Use an eyeshadow brush to sweep eyeshadow primer all over your eyelid to your brow bone.",
        "If you don't have a designated eyeshadow primer, you can use your concealer or a nude cream eyeshadow in the same manner.",
        "Apply the lightest green near your brow bone.",
        "You only want to cover the top third of your eye area.",
        "Get the color as evenly matched as you can on both eyes.",
        "When you start to apply shadow, lightly tap your brush in the eyeshadow pan.",
        "You want to slightest amount of pigment on your brush.",
        "It is easier to build your eyeshadow in layers than to take shadow away if you apply too much.",
        "Blend the darkest green shade in your eyelid crease.",
        "A dark color in your crease defines the shape of your eyes, and makes their color more pronounced.",
        "After you do this, take a clean brush and blend the dark color up into your lighter brow bone color.",
        "To blend eyeshadow, go back and forth across this area with your eyeshadow brush in small circles until it looks airbrushed.",
        "Remember that blending takes patience.",
        "Keep your strokes light.",
        "The longer you blend, the better your finished eyes will look.",
        "Apply winged eyeliner.",
        "Dramatic eyeliner is an essential part of any bold eye look.",
        "A thick, dark liner will draw attention to your bright green eyeshadow.",
        "For winged liner, a liquid liner works best.",
        "Either use black or a dark green to accentuate your eyeshadow.",
        "Create a clean sharp line on top of the eyelid and extend towards the edge of the eye.",
        "The end of your line should angle toward the end of your eyebrow.",
        "Add the medium shade of green on top of your eyeliner and all over your eyelid.",
        "This will set your eyeliner, and bring the look together.",
        "Take another clean brush and sweep it over your eye area to blend the shades together.",
        "Take a look at your eyeshadows together.",
        "If the lightest shade looks too light compared to your lid, you can add a bit more pigment for balance.",
        "As you apply eyeshadow, keep your brushes separate or wipe them off between the different shades.",
        "Add another layer of eyeliner on top of the eyeshadow.",
        "This will emphasize your eyes, and create depth to your liner.",
        "With a fresh coat of eyeliner, the line will look crisp and not powdery.",
        "For an even more defined eyeliner look, line your waterline in addition to your winged liner.",
        "Your waterline is beneath your eyelashes near your eyeball.",
        "You can line your waterline with a nude-colored pencil for brightening, or with a black or brown pencil for a darker dramatic effect.",
        "Finish with two coats of mascara.",
        "Mascara will make your eyes appear open and bright.",
        "Use a mascara designed to volumize your eyelashes.",
        "Wiggle the wand of your mascara back and forth, starting at the base of your lashes, to prevent clumping.",
        "Use dark black mascara, or mascara with glitter for extra sparkle.",
        "For even more volume, consider using false eyelashes in addition to your mascara.",
        "Creating a Subtle Green Eyeshadow Look Choose an earth-toned green shadow.",
        "Look for undertones of browns and taupes.",
        "Pick a muted sage green for an everyday green eyeshadow look.",
        "This works with different skin tones and eye colors.",
        "It will simply have a slightly different look.",
        "For example, darker skin brings out the blue tone in the shadow, while yellow undertones bring out the green's golden hues, and lighter, pink skin accentuates the darker pigments in the green.",
        "Using only one eyeshadow color in your look adds subtlety and sophistication to a standout color.",
        "If you only have a bright green eyeshadow, try mixing it or layering it with a brown eyeshadow for a muting effect.",
        "Prime your eyelids.",
        "This will prevent your eyeshadow from creasing.",
        "With primer, your eyeshadow look will stay in place and crisp all day.",
        "Using a clean concealer brush or eyeshadow brush, sweep the primer all over your eye area.",
        "You can use neutral cream eyeshadow or concealer in place of a primer, if you don't have one.",
        "Apply the eyeshadow to the outer halves of your eyelids.",
        "Take it up slightly past your crease.",
        "This outer section is where the color should be the darkest and most pronounced.",
        "For definition, brush on your eyeshadow to come to a point near the corner of your eyebrow, almost like you would draw on a liquid winged liner.",
        "This shape opens up your eye area and adds sophistication.",
        "Lightly brush the same eyeshadow over the inner corner of your eyelids.",
        "Extend it up past your crease.",
        "The inner corners of your eyes should be a lighter shade than the outer corners.",
        "Remember that it's easier to build up your eyeshadow than to get the right shade on the first try.",
        "Add layers of color until you are happy with the darkness.",
        "Add some green shadow under your bottom lash line.",
        "Use the same green eyeshadow you used on your lid.",
        "Use a small eyeliner brush to extend this color from the middle of your bottom lash line to the outer corner of your eye.",
        "To make this shadow almost like a light eyeliner, dampen the tip of your eyeliner brush before tapping it in your eyeshadow.",
        "Using the shadow damp will give you a cleaner line.",
        "Use a clean eyeshadow brush to blend.",
        "Sweep this brush in light circles back and forth across your eyelids until the two shades of the same shadow blend into each other seamlessly.",
        "Take your time in blending.",
        "The longer you spend, the more polished your finished look with be.",
        "Line your lids in brown.",
        "You don't want to use black eyeliner for this natural green eyeshadow look, as it can be too harsh.",
        "Use pencil liner for a softer look.",
        "Use your brown eyeliner pencil to line above your lash line and along your water line.",
        "Don't extend your eyeliner into a flick.",
        "For an even more natural look, skip the eyeliner all together.",
        "Finish with mascara.",
        "Use one or two coats.",
        "Wiggle the mascara back and forth at your lash line to prevent clumping.",
        "Consider using dark brown mascara, instead of black, for a more natural, soft look.",
        "Use a lengthening mascara for a delicate look.",
        "Finishing Your Makeup to Complement Your Eyeshadow Apply foundation or tinted moisturizer to your face.",
        "Your skin needs to have a pretty and natural freshness for this look.",
        "If you don't need much coverage, try a tinted moisturizer, as it will give a dewy glow.",
        "If you still want dewy skin but need a bit more coverage than a tinted moisturizer, try mixing your moisturizer with a heavier foundation.",
        "Use a foundation brush or Beauty Blender to apply your foundation or tinted moisturizer This will give you an airbrushed finish that isn't splotchy.",
        "Wait until you've finished your eye look to apply your face make up.",
        "You'll be able to balance your look better, and if you mess up while doing your eyes, you can more easily wipe off the makeup and start again.",
        "Conceal any red spots or hyperpigmentation.",
        "With a bold eye, your skin should look flawless and spot-free.",
        "With a blender or concealing brush, apply your concealer to cover up any acne spots.",
        "Sweep a brightening concealer underneath your eyes to make yourself look more awake.",
        "Apply a hint of blush and bronzer.",
        "This will give your skin a sunny, peachy glow.",
        "Make sure to use a bronzer that has brown undertones so that your skin doesn't get orange.",
        "Lightly tap a powder brush in a peachy pink shade of blush and then in your favorite bronzer.",
        "With both the bronzer and blush on your brush, lightly sweep it upward across your cheekbones.",
        "Wear a nude lip.",
        "Your green eyeshadow is the focus of your look.",
        "Wear a lipstick shade that is neutral to offset the eye.",
        "Depending on your skin tone, look for neutrals that are pink or beige.",
        "Alternately, you can simply apply some clear gloss or lip balm to your lips so they look natural, plump, and healthy."
    ]
}