{
    "title": "How to Show a Miniature Horse",
    "url": "https://www.wikihow.com/Show-a-Miniature-Horse",
    "category_hierarchy": [
        "Pets and Animals",
        "Horses",
        "Horse Showing and Competition"
    ],
    "steps": [
        {
            "headline": "Look at the requirements for the show.",
            "description": "Some shows have height, weight, breed, and gender requirements. You can usually find these on the web page for the show or your registration forms. In most mini horse shows there are divisions for different heights, colors, and genders."
        },
        {
            "headline": "Make sure your miniature horse is healthy.",
            "description": "Make sure you are giving it the right amount of feed and hay but be sure not to overfeed it. You can look online, in books, or talk to a vet to find out how much you need to feed it."
        },
        {
            "headline": "Make sure your mini horse listens well, the judges will pay very close attention to the way it obeys you.",
            "description": "Practice turning and stopping. Make sure that when you stop the mini horse stops with you and doesn’t pull on the lead rope."
        },
        {
            "headline": "Get the right equipment.",
            "description": "Getting the right equipment for your mini horse is very important also. You can find brushes, mane combs, horse shampoo/conditioner, hoof polish, hoof picks, lead ropes, and halters at farm supply stores such as; Tractor Supply and Family Center, but you may want to look elsewhere for a more decorative halter and rope. The scissors, towels, baby oil, and baby powder can be found at any store."
        },
        {
            "headline": "Call your farrier or vet and get your mini horse’s hooves trimmed.",
            "description": "It is good to make sure that they are not too long or overgrown."
        },
        {
            "headline": "When preparing for the show you need to trim your mini horse’s mane and tail.",
            "description": "Trim it so that it looks nice and neat but also flows normally, don’t worry if you don’t get it right the first time it takes practice. Practice at home a few months before the show; eventually you will learn how to cut it to make it look right."
        },
        {
            "headline": "The morning before the show you will need to bathe your mini horse.",
            "description": "Some horses do not like to be bathed so you need to tie them to a post and slowly introduce them to the water by just turning it on a little until they get used to it. After you have wet them down you need to put shampoo on them and lather it all over their coat, mane, and tail, you can use your hands or a soap brush. Then rinse them and do the same with the conditioner and then rinse again. After you are done you will want to use the towels to dry your mini horse, so they don’t get muddy or sick."
        },
        {
            "headline": "Brush your horse.",
            "description": "The next step is brushing; you need to brush your mini horse to remove any dust, dirt, or hair still on the horse. Use soft, slow strokes so that you do not spook or aggravate it. After you’ve brushed you should comb out the mane and tail so that there are no tangles, you can use hair de-tangler if needed."
        },
        {
            "headline": "Before you go out into the ring you need to do last minute touch ups.",
            "description": "You use the baby powder for the white legs and faces of your mini horse to make it look cleaner and flawless. You use the baby oil on the dark parts of the horse to make it look darker and smoother. Finally you put the hoof oil on black hooves to make them look shiny and for white hooves you make sure that they are clean and have no mud."
        },
        {
            "headline": "When you go out you will walk around the ring one way with your mini horse until the judge tells you to go the other way.",
            "description": "The judge may give you instructions such as trot or turn in a circle. Then the judge will have all of you come to the middle to announce the winners."
        }
    ],
    "tyn": [
        "A Miniature horse",
        "Mini show or leather halter",
        "Lead rope",
        "Horse soap",
        "Brushes",
        "Mane combs",
        "Scissors",
        "Towels",
        "Hoof polish",
        "Hoof pick",
        "Baby powder",
        "Baby oil"
    ],
    "text": " Look at the requirements for the show. Some shows have height, weight, breed, and gender requirements. You can usually find these on the web page for the show or your registration forms. In most mini horse shows there are divisions for different heights, colors, and genders. Make sure your miniature horse is healthy. Make sure you are giving it the right amount of feed and hay but be sure not to overfeed it. You can look online, in books, or talk to a vet to find out how much you need to feed it. Make sure your mini horse listens well, the judges will pay very close attention to the way it obeys you. Practice turning and stopping. Make sure that when you stop the mini horse stops with you and doesn’t pull on the lead rope. Get the right equipment. Getting the right equipment for your mini horse is very important also. You can find brushes, mane combs, horse shampoo/conditioner, hoof polish, hoof picks, lead ropes, and halters at farm supply stores such as; Tractor Supply and Family Center, but you may want to look elsewhere for a more decorative halter and rope. The scissors, towels, baby oil, and baby powder can be found at any store. Call your farrier or vet and get your mini horse’s hooves trimmed. It is good to make sure that they are not too long or overgrown. When preparing for the show you need to trim your mini horse’s mane and tail. Trim it so that it looks nice and neat but also flows normally, don’t worry if you don’t get it right the first time it takes practice. Practice at home a few months before the show; eventually you will learn how to cut it to make it look right. The morning before the show you will need to bathe your mini horse. Some horses do not like to be bathed so you need to tie them to a post and slowly introduce them to the water by just turning it on a little until they get used to it. After you have wet them down you need to put shampoo on them and lather it all over their coat, mane, and tail, you can use your hands or a soap brush. Then rinse them and do the same with the conditioner and then rinse again. After you are done you will want to use the towels to dry your mini horse, so they don’t get muddy or sick. Brush your horse. The next step is brushing; you need to brush your mini horse to remove any dust, dirt, or hair still on the horse. Use soft, slow strokes so that you do not spook or aggravate it. After you’ve brushed you should comb out the mane and tail so that there are no tangles, you can use hair de-tangler if needed. Before you go out into the ring you need to do last minute touch ups. You use the baby powder for the white legs and faces of your mini horse to make it look cleaner and flawless. You use the baby oil on the dark parts of the horse to make it look darker and smoother. Finally you put the hoof oil on black hooves to make them look shiny and for white hooves you make sure that they are clean and have no mud. When you go out you will walk around the ring one way with your mini horse until the judge tells you to go the other way. The judge may give you instructions such as trot or turn in a circle. Then the judge will have all of you come to the middle to announce the winners.",
    "sentences": [
        " Look at the requirements for the show.",
        "Some shows have height, weight, breed, and gender requirements.",
        "You can usually find these on the web page for the show or your registration forms.",
        "In most mini horse shows there are divisions for different heights, colors, and genders.",
        "Make sure your miniature horse is healthy.",
        "Make sure you are giving it the right amount of feed and hay but be sure not to overfeed it.",
        "You can look online, in books, or talk to a vet to find out how much you need to feed it.",
        "Make sure your mini horse listens well, the judges will pay very close attention to the way it obeys you.",
        "Practice turning and stopping.",
        "Make sure that when you stop the mini horse stops with you and doesn’t pull on the lead rope.",
        "Get the right equipment.",
        "Getting the right equipment for your mini horse is very important also.",
        "You can find brushes, mane combs, horse shampoo/conditioner, hoof polish, hoof picks, lead ropes, and halters at farm supply stores such as; Tractor Supply and Family Center, but you may want to look elsewhere for a more decorative halter and rope.",
        "The scissors, towels, baby oil, and baby powder can be found at any store.",
        "Call your farrier or vet and get your mini horse’s hooves trimmed.",
        "It is good to make sure that they are not too long or overgrown.",
        "When preparing for the show you need to trim your mini horse’s mane and tail.",
        "Trim it so that it looks nice and neat but also flows normally, don’t worry if you don’t get it right the first time it takes practice.",
        "Practice at home a few months before the show; eventually you will learn how to cut it to make it look right.",
        "The morning before the show you will need to bathe your mini horse.",
        "Some horses do not like to be bathed so you need to tie them to a post and slowly introduce them to the water by just turning it on a little until they get used to it.",
        "After you have wet them down you need to put shampoo on them and lather it all over their coat, mane, and tail, you can use your hands or a soap brush.",
        "Then rinse them and do the same with the conditioner and then rinse again.",
        "After you are done you will want to use the towels to dry your mini horse, so they don’t get muddy or sick.",
        "Brush your horse.",
        "The next step is brushing; you need to brush your mini horse to remove any dust, dirt, or hair still on the horse.",
        "Use soft, slow strokes so that you do not spook or aggravate it.",
        "After you’ve brushed you should comb out the mane and tail so that there are no tangles, you can use hair de-tangler if needed.",
        "Before you go out into the ring you need to do last minute touch ups.",
        "You use the baby powder for the white legs and faces of your mini horse to make it look cleaner and flawless.",
        "You use the baby oil on the dark parts of the horse to make it look darker and smoother.",
        "Finally you put the hoof oil on black hooves to make them look shiny and for white hooves you make sure that they are clean and have no mud.",
        "When you go out you will walk around the ring one way with your mini horse until the judge tells you to go the other way.",
        "The judge may give you instructions such as trot or turn in a circle.",
        "Then the judge will have all of you come to the middle to announce the winners."
    ]
}