{
    "title": "How to Change Brake Lines",
    "url": "https://www.wikihow.com/Change-Brake-Lines",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Maintenance and Repair",
        "Car Brakes"
    ],
    "methods": [
        {
            "name": "Replacing Flexible Brake Hoses",
            "steps": [
                {
                    "headline": "Disconnect the hose from the brake system.",
                    "description": "The flexible hose will most likely be a rubber hose (sometimes it may be braided steel) leading from the central brake line to the caliper piston in disc brakes or the wheel cylinder in drum brakes. To disconnect the hose, you should remove the retainer clip between the hose and the steel line. Next, you can turn the connector with a wrench until it comes loose. Do not crank too much on these connections. If you do you may bend the metal brake lines and then have to replace them as well. Instead, drain the line by cutting the brake hose and use a torch to heat the connection. This will break it loose and you can remove it."
                },
                {
                    "headline": "Remove any brackets or bolts along the flexible line.",
                    "description": "The brake hose may be mounted to the strut or another sturdy point between the central line and the wheel. You will need to locate any such connections by tracing the line from end to end. Loosen and remove any mounting connections you find."
                },
                {
                    "headline": "Remove the hose from the brake caliper or wheel cylinder.",
                    "description": "Now that the hose is disconnected from the lines to the master cylinder, you need only remove it from the brake itself. To do this you need to loosen the bolt found at the end of the brake line (known as a banjo bolt). This is often done with a 14mm socket or wrench, but the size can vary depending on make and model. There is also a washer on either side of the brake line (between the line and banjo bolt and the line and brake) that needs removed."
                },
                {
                    "headline": "Attach the new hose to the brake caliper or wheel cylinder.",
                    "description": "To attach the new brake hose, you will simply reverse the steps you took to remove the original. This means putting the washers in first, then tightening the banjo bolt at the end of the brake  hose."
                },
                {
                    "headline": "Attach the new hose to the brake system.",
                    "description": "First, attach the retainer clip. This holds the brake hose in place while you make the connection and is usually attached by sliding it into the appropriate holder at the end of the brake hose. Next, fasten the connector between the brake hose and lines leading the the master cylinder. This should be done with a wrench or flare nut wrench. You should also reconnect any brackets that hold the line secure (often found on the struts or other steering component)."
                },
                {
                    "headline": "Bleed the brakes.",
                    "description": "Bleeding the brakes is necessary to remove air that you have introduced into your brake line. Open up the bleeder cap found on the brake caliper or wheel cylinder and have someone pump the brake to force the air out of the bleeder cap. Wait until you see fluid coming out of the bleeder cap, and then close the cap. There are also pressure bleeders and gravity bleeders available for bleeding brakes."
                }
            ]
        },
        {
            "name": "Replacing Mounted Brake Pipes",
            "steps": [
                {
                    "headline": "Cut all connections to distribution blocks.",
                    "description": "Use a pair of side cutters to cut the line at the distribution block. This will allow you to put a socket on the fitting and remove it from the distribution block more effectively than with a wrench. If the fittings are stuck on, use penetrating oil to loosen them. The distribution blocks can be identified by the multiple brake lines running into them. They mounted near the front and rear of the vehicle and serve to distribute brake fluid from the main line to each of the wheels."
                },
                {
                    "headline": "Disconnect the brake pipes from the master cylinder.",
                    "description": "There should be approximately four connections to the master cylinder (depending on make and model). These will need to be loosened by using a wrench or flare nut wrench. Be careful not to twist the lines or strip the connections."
                },
                {
                    "headline": "Remove the brake line from any mounting clips.",
                    "description": "The steel brake lines are run along the underside of the car and mounted with plastic clips to hold them in place. You will need to remove the line without damaging these clips. The replacement line will need to fit back into the same clips."
                },
                {
                    "headline": "Remove pipes from underneath the car.",
                    "description": "Once all of the connections are loose, you can pull the brake lines out from under the car. This will make it easier to measure out and cut the appropriate amount of brake line from your roll."
                },
                {
                    "headline": "Cut the needed length from a roll of brake pipe.",
                    "description": "Steel brake pipes can be bought in rolls. This means that you will have to measure the old brake line, straighten out the roll, and cut the appropriate length of line. Be sure to compare it to the old brake line before trying to hook it up. Remember that it’s not a straight shot from one end of the car to the other, and that you have to follow the same path as the old lines."
                },
                {
                    "headline": "Install all appropriate fittings before taking the line underneath the car.",
                    "description": "Fittings to connect the line to your distribution blocks or master cylinder should be installed prior to taking the line under the car. There are different types of brake line fittings. Consult your service manual to know whether to use tapered pipe threading, inverted flare fittings, or compression fittings."
                },
                {
                    "headline": "Install the new brake pipe using the factory mounts and clips.",
                    "description": "The new brake line should be run from the master cylinder to the distribution blocks in the same way as the original brake line. That means you will need to follow the path of the original brake line and use the factory mounting clips to clip the new line to the vehicle. Again, the new line needs to be exactly the same length as the old line."
                },
                {
                    "headline": "Connect to the distribution blocks.",
                    "description": "You should use the same type of fitting as the one you removed. Oftentimes, the fittings can be salvaged and put onto the new brake line. This ensures that you will have the right fittings for your connections."
                },
                {
                    "headline": "Connect to the master cylinder.",
                    "description": "Use a wrench or flare nut wrench to reconnect all appropriate fittings to the master cylinder. The same applies here as the distribution block connects ― if you can reuse the old connectors that’s fine. If you cannot reuse the old connectors, make sure you get the correct type of replacement."
                },
                {
                    "headline": "Fill with brake fluid and purge air from the system.",
                    "description": "You will likely drain all or most of the brake fluid from you vehicle while replacing these lines. It is important to use manufacturer recommended brake fuel to replace what has been lost and then bleed the air from your lines."
                }
            ]
        },
        {
            "name": "Identifying Problems in Your Brake Lines",
            "steps": [
                {
                    "headline": "Check your brake fluid.",
                    "description": "Open the hood and find the master cylinder or brake fluid reservoir in the engine compartment. It should be near the firewall on the driver’s side. Check your owner’s manual for the exact location if you’re unsure. Low brake fluid is a sign of a leak in the braking system."
                },
                {
                    "headline": "Remove the wheels.",
                    "description": "You will need to loosen your lug nuts while the car is still on the ground. Next jack up your car and secure it with jack stands. Once the car is in the air you can finish removing the lugs and tires. Be sure to slide the tires under your car. This provides an extra layer of protection if your jack stands fail."
                },
                {
                    "headline": "Visually inspect the brake lines.",
                    "description": "Look for any indication of damage to the brake line. Rust on the steel lines can be indicative of problems, also dried out or cracked rubber lines will need replaced. Look for a drip or wet place on the lines. You should also pay attention to the ground beneath the lines. If there is a drip, the fluid will be visible on the ground."
                },
                {
                    "headline": "Feel the brake lines.",
                    "description": "Sometimes it is difficult to see the brake fluid underneath the car. If you suspect a leak or damaged brake lines, you should always feel the length of the line with your hands. This will ensure that you do not miss any leaks."
                }
            ]
        }
    ],
    "tyn": [
        "Jack stands",
        "Wrenches (open end, flare nut or line)",
        "Brake fluid of the correct type",
        "New brake lines and hose",
        "Spray lubricant",
        "Soft cloths",
        "Safety glasses",
        "Rubber or Nitrile gloves",
        "Brake line bending tool"
    ],
    "text": " Replacing Flexible Brake Hoses Disconnect the hose from the brake system. The flexible hose will most likely be a rubber hose (sometimes it may be braided steel) leading from the central brake line to the caliper piston in disc brakes or the wheel cylinder in drum brakes. To disconnect the hose, you should remove the retainer clip between the hose and the steel line. Next, you can turn the connector with a wrench until it comes loose. Do not crank too much on these connections. If you do you may bend the metal brake lines and then have to replace them as well. Instead, drain the line by cutting the brake hose and use a torch to heat the connection. This will break it loose and you can remove it. Remove any brackets or bolts along the flexible line. The brake hose may be mounted to the strut or another sturdy point between the central line and the wheel. You will need to locate any such connections by tracing the line from end to end. Loosen and remove any mounting connections you find. Remove the hose from the brake caliper or wheel cylinder. Now that the hose is disconnected from the lines to the master cylinder, you need only remove it from the brake itself. To do this you need to loosen the bolt found at the end of the brake line (known as a banjo bolt). This is often done with a 14mm socket or wrench, but the size can vary depending on make and model. There is also a washer on either side of the brake line (between the line and banjo bolt and the line and brake) that needs removed. Attach the new hose to the brake caliper or wheel cylinder. To attach the new brake hose, you will simply reverse the steps you took to remove the original. This means putting the washers in first, then tightening the banjo bolt at the end of the brake  hose. Attach the new hose to the brake system. First, attach the retainer clip. This holds the brake hose in place while you make the connection and is usually attached by sliding it into the appropriate holder at the end of the brake hose. Next, fasten the connector between the brake hose and lines leading the the master cylinder. This should be done with a wrench or flare nut wrench. You should also reconnect any brackets that hold the line secure (often found on the struts or other steering component). Bleed the brakes. Bleeding the brakes is necessary to remove air that you have introduced into your brake line. Open up the bleeder cap found on the brake caliper or wheel cylinder and have someone pump the brake to force the air out of the bleeder cap. Wait until you see fluid coming out of the bleeder cap, and then close the cap. There are also pressure bleeders and gravity bleeders available for bleeding brakes. Replacing Mounted Brake Pipes Cut all connections to distribution blocks. Use a pair of side cutters to cut the line at the distribution block. This will allow you to put a socket on the fitting and remove it from the distribution block more effectively than with a wrench. If the fittings are stuck on, use penetrating oil to loosen them. The distribution blocks can be identified by the multiple brake lines running into them. They mounted near the front and rear of the vehicle and serve to distribute brake fluid from the main line to each of the wheels. Disconnect the brake pipes from the master cylinder. There should be approximately four connections to the master cylinder (depending on make and model). These will need to be loosened by using a wrench or flare nut wrench. Be careful not to twist the lines or strip the connections. Remove the brake line from any mounting clips. The steel brake lines are run along the underside of the car and mounted with plastic clips to hold them in place. You will need to remove the line without damaging these clips. The replacement line will need to fit back into the same clips. Remove pipes from underneath the car. Once all of the connections are loose, you can pull the brake lines out from under the car. This will make it easier to measure out and cut the appropriate amount of brake line from your roll. Cut the needed length from a roll of brake pipe. Steel brake pipes can be bought in rolls. This means that you will have to measure the old brake line, straighten out the roll, and cut the appropriate length of line. Be sure to compare it to the old brake line before trying to hook it up. Remember that it’s not a straight shot from one end of the car to the other, and that you have to follow the same path as the old lines. Install all appropriate fittings before taking the line underneath the car. Fittings to connect the line to your distribution blocks or master cylinder should be installed prior to taking the line under the car. There are different types of brake line fittings. Consult your service manual to know whether to use tapered pipe threading, inverted flare fittings, or compression fittings. Install the new brake pipe using the factory mounts and clips. The new brake line should be run from the master cylinder to the distribution blocks in the same way as the original brake line. That means you will need to follow the path of the original brake line and use the factory mounting clips to clip the new line to the vehicle. Again, the new line needs to be exactly the same length as the old line. Connect to the distribution blocks. You should use the same type of fitting as the one you removed. Oftentimes, the fittings can be salvaged and put onto the new brake line. This ensures that you will have the right fittings for your connections. Connect to the master cylinder. Use a wrench or flare nut wrench to reconnect all appropriate fittings to the master cylinder. The same applies here as the distribution block connects ― if you can reuse the old connectors that’s fine. If you cannot reuse the old connectors, make sure you get the correct type of replacement. Fill with brake fluid and purge air from the system. You will likely drain all or most of the brake fluid from you vehicle while replacing these lines. It is important to use manufacturer recommended brake fuel to replace what has been lost and then bleed the air from your lines. Identifying Problems in Your Brake Lines Check your brake fluid. Open the hood and find the master cylinder or brake fluid reservoir in the engine compartment. It should be near the firewall on the driver’s side. Check your owner’s manual for the exact location if you’re unsure. Low brake fluid is a sign of a leak in the braking system. Remove the wheels. You will need to loosen your lug nuts while the car is still on the ground. Next jack up your car and secure it with jack stands. Once the car is in the air you can finish removing the lugs and tires. Be sure to slide the tires under your car. This provides an extra layer of protection if your jack stands fail. Visually inspect the brake lines. Look for any indication of damage to the brake line. Rust on the steel lines can be indicative of problems, also dried out or cracked rubber lines will need replaced. Look for a drip or wet place on the lines. You should also pay attention to the ground beneath the lines. If there is a drip, the fluid will be visible on the ground. Feel the brake lines. Sometimes it is difficult to see the brake fluid underneath the car. If you suspect a leak or damaged brake lines, you should always feel the length of the line with your hands. This will ensure that you do not miss any leaks.",
    "sentences": [
        " Replacing Flexible Brake Hoses Disconnect the hose from the brake system.",
        "The flexible hose will most likely be a rubber hose (sometimes it may be braided steel) leading from the central brake line to the caliper piston in disc brakes or the wheel cylinder in drum brakes.",
        "To disconnect the hose, you should remove the retainer clip between the hose and the steel line.",
        "Next, you can turn the connector with a wrench until it comes loose.",
        "Do not crank too much on these connections.",
        "If you do you may bend the metal brake lines and then have to replace them as well.",
        "Instead, drain the line by cutting the brake hose and use a torch to heat the connection.",
        "This will break it loose and you can remove it.",
        "Remove any brackets or bolts along the flexible line.",
        "The brake hose may be mounted to the strut or another sturdy point between the central line and the wheel.",
        "You will need to locate any such connections by tracing the line from end to end.",
        "Loosen and remove any mounting connections you find.",
        "Remove the hose from the brake caliper or wheel cylinder.",
        "Now that the hose is disconnected from the lines to the master cylinder, you need only remove it from the brake itself.",
        "To do this you need to loosen the bolt found at the end of the brake line (known as a banjo bolt).",
        "This is often done with a 14mm socket or wrench, but the size can vary depending on make and model.",
        "There is also a washer on either side of the brake line (between the line and banjo bolt and the line and brake) that needs removed.",
        "Attach the new hose to the brake caliper or wheel cylinder.",
        "To attach the new brake hose, you will simply reverse the steps you took to remove the original.",
        "This means putting the washers in first, then tightening the banjo bolt at the end of the brake  hose.",
        "Attach the new hose to the brake system.",
        "First, attach the retainer clip.",
        "This holds the brake hose in place while you make the connection and is usually attached by sliding it into the appropriate holder at the end of the brake hose.",
        "Next, fasten the connector between the brake hose and lines leading the the master cylinder.",
        "This should be done with a wrench or flare nut wrench.",
        "You should also reconnect any brackets that hold the line secure (often found on the struts or other steering component).",
        "Bleed the brakes.",
        "Bleeding the brakes is necessary to remove air that you have introduced into your brake line.",
        "Open up the bleeder cap found on the brake caliper or wheel cylinder and have someone pump the brake to force the air out of the bleeder cap.",
        "Wait until you see fluid coming out of the bleeder cap, and then close the cap.",
        "There are also pressure bleeders and gravity bleeders available for bleeding brakes.",
        "Replacing Mounted Brake Pipes Cut all connections to distribution blocks.",
        "Use a pair of side cutters to cut the line at the distribution block.",
        "This will allow you to put a socket on the fitting and remove it from the distribution block more effectively than with a wrench.",
        "If the fittings are stuck on, use penetrating oil to loosen them.",
        "The distribution blocks can be identified by the multiple brake lines running into them.",
        "They mounted near the front and rear of the vehicle and serve to distribute brake fluid from the main line to each of the wheels.",
        "Disconnect the brake pipes from the master cylinder.",
        "There should be approximately four connections to the master cylinder (depending on make and model).",
        "These will need to be loosened by using a wrench or flare nut wrench.",
        "Be careful not to twist the lines or strip the connections.",
        "Remove the brake line from any mounting clips.",
        "The steel brake lines are run along the underside of the car and mounted with plastic clips to hold them in place.",
        "You will need to remove the line without damaging these clips.",
        "The replacement line will need to fit back into the same clips.",
        "Remove pipes from underneath the car.",
        "Once all of the connections are loose, you can pull the brake lines out from under the car.",
        "This will make it easier to measure out and cut the appropriate amount of brake line from your roll.",
        "Cut the needed length from a roll of brake pipe.",
        "Steel brake pipes can be bought in rolls.",
        "This means that you will have to measure the old brake line, straighten out the roll, and cut the appropriate length of line.",
        "Be sure to compare it to the old brake line before trying to hook it up.",
        "Remember that it’s not a straight shot from one end of the car to the other, and that you have to follow the same path as the old lines.",
        "Install all appropriate fittings before taking the line underneath the car.",
        "Fittings to connect the line to your distribution blocks or master cylinder should be installed prior to taking the line under the car.",
        "There are different types of brake line fittings.",
        "Consult your service manual to know whether to use tapered pipe threading, inverted flare fittings, or compression fittings.",
        "Install the new brake pipe using the factory mounts and clips.",
        "The new brake line should be run from the master cylinder to the distribution blocks in the same way as the original brake line.",
        "That means you will need to follow the path of the original brake line and use the factory mounting clips to clip the new line to the vehicle.",
        "Again, the new line needs to be exactly the same length as the old line.",
        "Connect to the distribution blocks.",
        "You should use the same type of fitting as the one you removed.",
        "Oftentimes, the fittings can be salvaged and put onto the new brake line.",
        "This ensures that you will have the right fittings for your connections.",
        "Connect to the master cylinder.",
        "Use a wrench or flare nut wrench to reconnect all appropriate fittings to the master cylinder.",
        "The same applies here as the distribution block connects ― if you can reuse the old connectors that’s fine.",
        "If you cannot reuse the old connectors, make sure you get the correct type of replacement.",
        "Fill with brake fluid and purge air from the system.",
        "You will likely drain all or most of the brake fluid from you vehicle while replacing these lines.",
        "It is important to use manufacturer recommended brake fuel to replace what has been lost and then bleed the air from your lines.",
        "Identifying Problems in Your Brake Lines Check your brake fluid.",
        "Open the hood and find the master cylinder or brake fluid reservoir in the engine compartment.",
        "It should be near the firewall on the driver’s side.",
        "Check your owner’s manual for the exact location if you’re unsure.",
        "Low brake fluid is a sign of a leak in the braking system.",
        "Remove the wheels.",
        "You will need to loosen your lug nuts while the car is still on the ground.",
        "Next jack up your car and secure it with jack stands.",
        "Once the car is in the air you can finish removing the lugs and tires.",
        "Be sure to slide the tires under your car.",
        "This provides an extra layer of protection if your jack stands fail.",
        "Visually inspect the brake lines.",
        "Look for any indication of damage to the brake line.",
        "Rust on the steel lines can be indicative of problems, also dried out or cracked rubber lines will need replaced.",
        "Look for a drip or wet place on the lines.",
        "You should also pay attention to the ground beneath the lines.",
        "If there is a drip, the fluid will be visible on the ground.",
        "Feel the brake lines.",
        "Sometimes it is difficult to see the brake fluid underneath the car.",
        "If you suspect a leak or damaged brake lines, you should always feel the length of the line with your hands.",
        "This will ensure that you do not miss any leaks."
    ]
}