{
    "title": "How to Prank with Fake Baby Footprints",
    "url": "https://www.wikihow.com/Prank-with-Fake-Baby-Footprints",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Fun Activities",
        "Pranks (Practical Jokes)",
        "Family Pranks"
    ],
    "steps": [
        {
            "headline": "Color your palm.",
            "description": "Color the side of your palm evenly. Start with mixing some color of your choice with water in a dish. Let the color not be too thin with too much water. Make it's consistency just about enough to create a neat, drip free print on the surface. You may either dip the side of your palm in the dish or ask someone to paint your palm."
        },
        {
            "headline": "Make a fist.",
            "description": "Fold your palm to make a fist. Press your colored fist on the paper to make the print. This is how the print would appear."
        },
        {
            "headline": "Prepare for the toes.",
            "description": "When you get the fist print done, color your finger. You may make all the toe prints with any one of your fingers. You may use the finger you find the most steady if you like."
        },
        {
            "headline": "Make the toe tilted.",
            "description": "The first toe must be slightly tilted. It must also be a little bigger than the rest if the toes."
        },
        {
            "headline": "Prepare for the other toes.",
            "description": "The other toes could be done all at once or one by one. To do it all at once, just dip all your four finger tips (excluding the thumb) in the paint and make the imprint a little over the palm's print."
        },
        {
            "headline": "Check the footprint.",
            "description": "The impression you make with your left palm will make the left footprint."
        },
        {
            "headline": "Prepare for the right footprint.",
            "description": "Color the side of your palm thoroughly or you may get incomplete footprints."
        },
        {
            "headline": "Make the toes.",
            "description": "If you feel that the toes are a bit too apart, you may make the rest of the four toe prints one next to the other using one finger only."
        },
        {
            "headline": "Make more prints.",
            "description": "You may try making more prints in different sizes by asking someone else to do it."
        },
        {
            "headline": "Try with different colors.",
            "description": "Try making more prints one over the other to create a trail of foot prints."
        }
    ],
    "tyn": [
        "Dish to mix the color in.",
        "Color",
        "Water",
        "Paper or any surface to make the foot prints on.",
        "A towel or tissues to clean.",
        "Coloring brush. (Optional)"
    ],
    "text": " Color your palm. Color the side of your palm evenly. Start with mixing some color of your choice with water in a dish. Let the color not be too thin with too much water. Make it's consistency just about enough to create a neat, drip free print on the surface. You may either dip the side of your palm in the dish or ask someone to paint your palm. Make a fist. Fold your palm to make a fist. Press your colored fist on the paper to make the print. This is how the print would appear. Prepare for the toes. When you get the fist print done, color your finger. You may make all the toe prints with any one of your fingers. You may use the finger you find the most steady if you like. Make the toe tilted. The first toe must be slightly tilted. It must also be a little bigger than the rest if the toes. Prepare for the other toes. The other toes could be done all at once or one by one. To do it all at once, just dip all your four finger tips (excluding the thumb) in the paint and make the imprint a little over the palm's print. Check the footprint. The impression you make with your left palm will make the left footprint. Prepare for the right footprint. Color the side of your palm thoroughly or you may get incomplete footprints. Make the toes. If you feel that the toes are a bit too apart, you may make the rest of the four toe prints one next to the other using one finger only. Make more prints. You may try making more prints in different sizes by asking someone else to do it. Try with different colors. Try making more prints one over the other to create a trail of foot prints.",
    "sentences": [
        " Color your palm.",
        "Color the side of your palm evenly.",
        "Start with mixing some color of your choice with water in a dish.",
        "Let the color not be too thin with too much water.",
        "Make it's consistency just about enough to create a neat, drip free print on the surface.",
        "You may either dip the side of your palm in the dish or ask someone to paint your palm.",
        "Make a fist.",
        "Fold your palm to make a fist.",
        "Press your colored fist on the paper to make the print.",
        "This is how the print would appear.",
        "Prepare for the toes.",
        "When you get the fist print done, color your finger.",
        "You may make all the toe prints with any one of your fingers.",
        "You may use the finger you find the most steady if you like.",
        "Make the toe tilted.",
        "The first toe must be slightly tilted.",
        "It must also be a little bigger than the rest if the toes.",
        "Prepare for the other toes.",
        "The other toes could be done all at once or one by one.",
        "To do it all at once, just dip all your four finger tips (excluding the thumb) in the paint and make the imprint a little over the palm's print.",
        "Check the footprint.",
        "The impression you make with your left palm will make the left footprint.",
        "Prepare for the right footprint.",
        "Color the side of your palm thoroughly or you may get incomplete footprints.",
        "Make the toes.",
        "If you feel that the toes are a bit too apart, you may make the rest of the four toe prints one next to the other using one finger only.",
        "Make more prints.",
        "You may try making more prints in different sizes by asking someone else to do it.",
        "Try with different colors.",
        "Try making more prints one over the other to create a trail of foot prints."
    ]
}