{
    "title": "How to Build Model Buildings",
    "url": "https://www.wikihow.com/Build-Model-Buildings",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Model Making",
        "Model Buildings"
    ],
    "parts": [
        {
            "name": "Designing Your Building",
            "steps": [
                {
                    "headline": "Decide what kind of building you want to make.",
                    "description": "Before you actually begin putting together your model building, you need to have a clear sense of what it will look like. Take note of different types of buildings while you’re out and about to get inspiration and refine your mental image, or use your imagination to come up with your own one-of-a-kind structure. If you can envision it, you can build it. If you plan on modeling a real building, take plenty of photographs so you’ll have something to refer to throughout the design phase. A simple house, barn, or other traditional structure will be the easiest to create on your first attempt. As your skills improve, you might try your hand at elaborate mansions, skyscrapers, castles, and other types of buildings.Tip: Feel free to modify the design of an existing structure in any way you see fit to make it more manageable for your skill level and the materials you’re working with."
                },
                {
                    "headline": "Sketch your building from multiple angles.",
                    "description": "Sit down with a pencil and a sheet of paper and create a rough rendering of your building showing what it will look like from each side. Make sure you include at least one view of the roof, along with any other prominent design features. Drawing your building will enable you to visualize it more clearly. It will also help you transfer the structure’s individual planes onto your work materials once the time comes. Your sketch doesn’t have to be perfect—it will just serve as a preliminary visual aid to guide you through the process of cutting and assembling your model building’s various pieces."
                },
                {
                    "headline": "Scale your model to the appropriate size if you’re recreating an actual structure.",
                    "description": "To build a miniaturized replica with accurate dimensions and proportions, start by finding the height and width of the building you want to model. Once you’ve done that, pull up a modeling scale conversion chart online and use the figures listed to translate your recorded measurements to a given scale, which you’ll then use to build your model. Scales are represented as fractions that indicate how big a model is in comparison to the object it’s based on. If you’re building your model to a 1/125 scale, for instance, it means that it would take 125 of your model lined up end-to-end to equal the length of the actual building. You may be able to look up the exact dimensions of a given structure in your local building records. Run a quick search for “building records” plus the name of your town or city and the name or address of the building you’re looking for to pull up its original building plans."
                },
                {
                    "headline": "Trace each individual plane of your building onto a sheet of heavy cardstock.",
                    "description": "Now that you know what you want your building to look like and how big you want it to be, it’s time to transfer your designs to your actual work materials. Draw an outline of each of the building’s main components, including the floor, walls, roof, and any outlying features like chimneys, gables, flower boxes or downspouts. You can also use styrene, mat board, gel foam, or balsa wood instead of cardstock. Some of these materials may vary in terms of cost and durability, but all are soft enough to cut and shape easily. If you want your model building to have openings for doors and windows, be sure to draw them in."
                }
            ]
        },
        {
            "name": "Cutting Out the Various Pieces",
            "steps": [
                {
                    "headline": "Cut out your building’s components with a utility knife.",
                    "description": "Run the point of your knife carefully along the outlines you drew earlier using a metal ruler or straight edge as a guide. Rather than trying to force the blade through the material, use light pressure and make multiple passes, gently snapping the piece free by hand afterwards. You may need to go back over your outlines several times if you’re working with a stronger material like styrene or wood. Place a piece of scrap cardboard underneath your materials to protect your work surface. If you’re thinking about getting into modeling seriously, a self-healing cutting mat could also make a wise investment. A pen-style knife will offer greater precision and control than one with a wider handle.Warning: Be careful and pay close attention anytime you pick up your utility knife. The blade will be extremely sharp, and even the slightest slip could result in accident or injury."
                },
                {
                    "headline": "Score openings like doors and windows to make them easier to punch out.",
                    "description": "Start with the tip of your knife inside one corner of the outline and drag it slowly to the opposite corner, stopping just before it reaches the perpendicular line. Then, turn your material, reset your knife, and score the next side of the outline. When you’ve done each side, press down on the excess material at the center of the opening to free it from the surrounding piece. If for some reason you’re having trouble, another option is to extend your cuts all the way to the edges of the piece, snap them apart manually, and glue them back together without the material from the openings. Scoring your doors and windows in this way will also produce cleaner openings, since you won't be over-cutting into the surrounding material."
                },
                {
                    "headline": "Fold or score the roof make your roof from a single piece of material.",
                    "description": "It can be difficult to neatly piece together a roof from lots of small pieces. A much simpler solution is to draw an additional line onto the outline for your roof piece where the two sides will come together, then fold the cardstock along the line to form the point of the roof. If you’re using styrene, wood, or gel foam, make a shallow cut down your roof point line and bend the sections of material on either side away from one another to create a hinge. This technique works best for basic gable, gambrel, and skillion roofs made up of only a couple planes. If you’ve chosen a more complex roof style for your model, you may have no choice but to cut and paste."
                },
                {
                    "headline": "Change out the blade on your utility knife as soon as it gets dull.",
                    "description": "The friction of cutting and scoring will begin to dull your cutting tool after a while. When you begin encountering resistance or notice that your cuts feel rough, stop what you’re doing and very carefully remove the blade you’re currently working with. Replace the dull blade with a fresh one and get back to it—you’ll feel the difference right away. If you’re using a retractable utility knife, open up the casing and lift out the old blade by its rear edge to avoid cutting yourself accidentally. Some newer blades come loaded with pre-notched blades, which make it possible to snap off the dull section and extend a brand new, ultra-sharp tip. Cutting with a dull blade can tire you out quickly, and is much more likely to damage your work materials."
                }
            ]
        },
        {
            "name": "Assembling and Finishing Your Model",
            "steps": [
                {
                    "headline": "Glue your model together where its various planes meet.",
                    "description": "Apply a thin strip of high-hold craft glue or a similar adhesive to the edges of your first piece. Line up the glued edge with the corresponding edge of the neighboring piece and press and hold the two edges together. Allow the glue to dry for 15-20 seconds before letting go and moving on to the next piece. You can also use a hot glue gun, super glue, or ordinary white glue on wood and most types of cardstock and board. To streamline the gluing process, start by putting the outer walls in place around the floor piece, then attach any interior walls you wish to include, saving the roof for last.Tip: Gluing is one of the most time-consuming parts of model-building, but also one of the most important. Take your time and make sure each seam and connection is as clean and precise as possible."
                },
                {
                    "headline": "Apply a thin layer of clay to the outer surface of your model (optional).",
                    "description": "Press small lumps of soft modeling clay onto the skeleton of your structure, working in 3–4 in (7.6–10.2 cm) patches. Once you’ve covered the entire structure, spread and flatten the clay with the pads of your fingers until it’s an even thickness all over. Be careful not to crush, bend, or otherwise damage the underlying material. Pinch the clay gently where the separate planes of your model come together to create sharper corners and edges. Any type of standard modeling or air dry clay will work just fine for most projects. Be sure to select a neutral color if you intend to paint your finished model."
                },
                {
                    "headline": "Carve textures and fine details into the clay with your utility knife.",
                    "description": "Hold the knife the way you would a pen or pencil and use the point of the blade to etch masonry stones, staggered board lines, or tiny brickwork patterns. Study photos of the type of the surfaces and materials you’re replicating to make sure they look authentic. You can also use your utility knife to “draw” on roof tiles, window sills, roof flashing, and other realistic features. If you’d rather not go to the trouble of carving everything by hand, consider purchasing a sheet of embossed vinyl or plastic printed in the exterior finish of your choice. These basically work like stickers—just cut them to fit the shape of your building’s walls, floor, or roof and smooth them on."
                },
                {
                    "headline": "Paint your finished model for added realism.",
                    "description": "A detailed paint job will give your model a more lifelike quality. Pick up as many shades as you need to lend a splash of color to your building’s many features. You’ll need gray for raw stone, dark red for brick, brown or tan for wood, black for roofing tiles, silver for metal, bright colors for siding, shutters, and other painted portions, and so on. If you used air dry clay to cover your model, you’ll need to heat-cure the clay before you apply paint. To do this, place the model in the oven on its lowest setting for 15-20 minutes at a time, allowing the oven to cool completely between rounds to prevent the clay from burning. Continue in this way until it feels dry and solid to the touch. Acrylic, tempera, or poster paint is usually the best choice for applying to clay."
                }
            ]
        }
    ],
    "tyn": [
        "Pencil and paper",
        "Heavy cardstock",
        "Styrene, mat board, gel foam, or balsa wood (optional)",
        "Modeling scale conversion chart (optional)",
        "Camera (optional)",
        "Utility knife",
        "Metal ruler or straight edge",
        "Replacement blades",
        "Scrap cardboard or cutting mat",
        "High-hold craft glue",
        "Soft modeling or air dry clay",
        "Acrylic, tempera, or poster paint",
        "Paintbrush",
        "Hot glue, super glue, or white PVA glue (optional)",
        "Embossed plastic or vinyl exterior model finishing sheets (optional)"
    ],
    "text": " Designing Your Building Decide what kind of building you want to make. Before you actually begin putting together your model building, you need to have a clear sense of what it will look like. Take note of different types of buildings while you’re out and about to get inspiration and refine your mental image, or use your imagination to come up with your own one-of-a-kind structure. If you can envision it, you can build it. If you plan on modeling a real building, take plenty of photographs so you’ll have something to refer to throughout the design phase. A simple house, barn, or other traditional structure will be the easiest to create on your first attempt. As your skills improve, you might try your hand at elaborate mansions, skyscrapers, castles, and other types of buildings.Tip: Feel free to modify the design of an existing structure in any way you see fit to make it more manageable for your skill level and the materials you’re working with. Sketch your building from multiple angles. Sit down with a pencil and a sheet of paper and create a rough rendering of your building showing what it will look like from each side. Make sure you include at least one view of the roof, along with any other prominent design features. Drawing your building will enable you to visualize it more clearly. It will also help you transfer the structure’s individual planes onto your work materials once the time comes. Your sketch doesn’t have to be perfect—it will just serve as a preliminary visual aid to guide you through the process of cutting and assembling your model building’s various pieces. Scale your model to the appropriate size if you’re recreating an actual structure. To build a miniaturized replica with accurate dimensions and proportions, start by finding the height and width of the building you want to model. Once you’ve done that, pull up a modeling scale conversion chart online and use the figures listed to translate your recorded measurements to a given scale, which you’ll then use to build your model. Scales are represented as fractions that indicate how big a model is in comparison to the object it’s based on. If you’re building your model to a 1/125 scale, for instance, it means that it would take 125 of your model lined up end-to-end to equal the length of the actual building. You may be able to look up the exact dimensions of a given structure in your local building records. Run a quick search for “building records” plus the name of your town or city and the name or address of the building you’re looking for to pull up its original building plans. Trace each individual plane of your building onto a sheet of heavy cardstock. Now that you know what you want your building to look like and how big you want it to be, it’s time to transfer your designs to your actual work materials. Draw an outline of each of the building’s main components, including the floor, walls, roof, and any outlying features like chimneys, gables, flower boxes or downspouts. You can also use styrene, mat board, gel foam, or balsa wood instead of cardstock. Some of these materials may vary in terms of cost and durability, but all are soft enough to cut and shape easily. If you want your model building to have openings for doors and windows, be sure to draw them in. Cutting Out the Various Pieces Cut out your building’s components with a utility knife. Run the point of your knife carefully along the outlines you drew earlier using a metal ruler or straight edge as a guide. Rather than trying to force the blade through the material, use light pressure and make multiple passes, gently snapping the piece free by hand afterwards. You may need to go back over your outlines several times if you’re working with a stronger material like styrene or wood. Place a piece of scrap cardboard underneath your materials to protect your work surface. If you’re thinking about getting into modeling seriously, a self-healing cutting mat could also make a wise investment. A pen-style knife will offer greater precision and control than one with a wider handle.Warning: Be careful and pay close attention anytime you pick up your utility knife. The blade will be extremely sharp, and even the slightest slip could result in accident or injury. Score openings like doors and windows to make them easier to punch out. Start with the tip of your knife inside one corner of the outline and drag it slowly to the opposite corner, stopping just before it reaches the perpendicular line. Then, turn your material, reset your knife, and score the next side of the outline. When you’ve done each side, press down on the excess material at the center of the opening to free it from the surrounding piece. If for some reason you’re having trouble, another option is to extend your cuts all the way to the edges of the piece, snap them apart manually, and glue them back together without the material from the openings. Scoring your doors and windows in this way will also produce cleaner openings, since you won't be over-cutting into the surrounding material. Fold or score the roof make your roof from a single piece of material. It can be difficult to neatly piece together a roof from lots of small pieces. A much simpler solution is to draw an additional line onto the outline for your roof piece where the two sides will come together, then fold the cardstock along the line to form the point of the roof. If you’re using styrene, wood, or gel foam, make a shallow cut down your roof point line and bend the sections of material on either side away from one another to create a hinge. This technique works best for basic gable, gambrel, and skillion roofs made up of only a couple planes. If you’ve chosen a more complex roof style for your model, you may have no choice but to cut and paste. Change out the blade on your utility knife as soon as it gets dull. The friction of cutting and scoring will begin to dull your cutting tool after a while. When you begin encountering resistance or notice that your cuts feel rough, stop what you’re doing and very carefully remove the blade you’re currently working with. Replace the dull blade with a fresh one and get back to it—you’ll feel the difference right away. If you’re using a retractable utility knife, open up the casing and lift out the old blade by its rear edge to avoid cutting yourself accidentally. Some newer blades come loaded with pre-notched blades, which make it possible to snap off the dull section and extend a brand new, ultra-sharp tip. Cutting with a dull blade can tire you out quickly, and is much more likely to damage your work materials. Assembling and Finishing Your Model Glue your model together where its various planes meet. Apply a thin strip of high-hold craft glue or a similar adhesive to the edges of your first piece. Line up the glued edge with the corresponding edge of the neighboring piece and press and hold the two edges together. Allow the glue to dry for 15-20 seconds before letting go and moving on to the next piece. You can also use a hot glue gun, super glue, or ordinary white glue on wood and most types of cardstock and board. To streamline the gluing process, start by putting the outer walls in place around the floor piece, then attach any interior walls you wish to include, saving the roof for last.Tip: Gluing is one of the most time-consuming parts of model-building, but also one of the most important. Take your time and make sure each seam and connection is as clean and precise as possible. Apply a thin layer of clay to the outer surface of your model (optional). Press small lumps of soft modeling clay onto the skeleton of your structure, working in 3–4 in (7.6–10.2 cm) patches. Once you’ve covered the entire structure, spread and flatten the clay with the pads of your fingers until it’s an even thickness all over. Be careful not to crush, bend, or otherwise damage the underlying material. Pinch the clay gently where the separate planes of your model come together to create sharper corners and edges. Any type of standard modeling or air dry clay will work just fine for most projects. Be sure to select a neutral color if you intend to paint your finished model. Carve textures and fine details into the clay with your utility knife. Hold the knife the way you would a pen or pencil and use the point of the blade to etch masonry stones, staggered board lines, or tiny brickwork patterns. Study photos of the type of the surfaces and materials you’re replicating to make sure they look authentic. You can also use your utility knife to “draw” on roof tiles, window sills, roof flashing, and other realistic features. If you’d rather not go to the trouble of carving everything by hand, consider purchasing a sheet of embossed vinyl or plastic printed in the exterior finish of your choice. These basically work like stickers—just cut them to fit the shape of your building’s walls, floor, or roof and smooth them on. Paint your finished model for added realism. A detailed paint job will give your model a more lifelike quality. Pick up as many shades as you need to lend a splash of color to your building’s many features. You’ll need gray for raw stone, dark red for brick, brown or tan for wood, black for roofing tiles, silver for metal, bright colors for siding, shutters, and other painted portions, and so on. If you used air dry clay to cover your model, you’ll need to heat-cure the clay before you apply paint. To do this, place the model in the oven on its lowest setting for 15-20 minutes at a time, allowing the oven to cool completely between rounds to prevent the clay from burning. Continue in this way until it feels dry and solid to the touch. Acrylic, tempera, or poster paint is usually the best choice for applying to clay.",
    "sentences": [
        " Designing Your Building Decide what kind of building you want to make.",
        "Before you actually begin putting together your model building, you need to have a clear sense of what it will look like.",
        "Take note of different types of buildings while you’re out and about to get inspiration and refine your mental image, or use your imagination to come up with your own one-of-a-kind structure.",
        "If you can envision it, you can build it.",
        "If you plan on modeling a real building, take plenty of photographs so you’ll have something to refer to throughout the design phase.",
        "A simple house, barn, or other traditional structure will be the easiest to create on your first attempt.",
        "As your skills improve, you might try your hand at elaborate mansions, skyscrapers, castles, and other types of buildings.Tip: Feel free to modify the design of an existing structure in any way you see fit to make it more manageable for your skill level and the materials you’re working with.",
        "Sketch your building from multiple angles.",
        "Sit down with a pencil and a sheet of paper and create a rough rendering of your building showing what it will look like from each side.",
        "Make sure you include at least one view of the roof, along with any other prominent design features.",
        "Drawing your building will enable you to visualize it more clearly.",
        "It will also help you transfer the structure’s individual planes onto your work materials once the time comes.",
        "Your sketch doesn’t have to be perfect—it will just serve as a preliminary visual aid to guide you through the process of cutting and assembling your model building’s various pieces.",
        "Scale your model to the appropriate size if you’re recreating an actual structure.",
        "To build a miniaturized replica with accurate dimensions and proportions, start by finding the height and width of the building you want to model.",
        "Once you’ve done that, pull up a modeling scale conversion chart online and use the figures listed to translate your recorded measurements to a given scale, which you’ll then use to build your model.",
        "Scales are represented as fractions that indicate how big a model is in comparison to the object it’s based on.",
        "If you’re building your model to a 1/125 scale, for instance, it means that it would take 125 of your model lined up end-to-end to equal the length of the actual building.",
        "You may be able to look up the exact dimensions of a given structure in your local building records.",
        "Run a quick search for “building records” plus the name of your town or city and the name or address of the building you’re looking for to pull up its original building plans.",
        "Trace each individual plane of your building onto a sheet of heavy cardstock.",
        "Now that you know what you want your building to look like and how big you want it to be, it’s time to transfer your designs to your actual work materials.",
        "Draw an outline of each of the building’s main components, including the floor, walls, roof, and any outlying features like chimneys, gables, flower boxes or downspouts.",
        "You can also use styrene, mat board, gel foam, or balsa wood instead of cardstock.",
        "Some of these materials may vary in terms of cost and durability, but all are soft enough to cut and shape easily.",
        "If you want your model building to have openings for doors and windows, be sure to draw them in.",
        "Cutting Out the Various Pieces Cut out your building’s components with a utility knife.",
        "Run the point of your knife carefully along the outlines you drew earlier using a metal ruler or straight edge as a guide.",
        "Rather than trying to force the blade through the material, use light pressure and make multiple passes, gently snapping the piece free by hand afterwards.",
        "You may need to go back over your outlines several times if you’re working with a stronger material like styrene or wood.",
        "Place a piece of scrap cardboard underneath your materials to protect your work surface.",
        "If you’re thinking about getting into modeling seriously, a self-healing cutting mat could also make a wise investment.",
        "A pen-style knife will offer greater precision and control than one with a wider handle.Warning: Be careful and pay close attention anytime you pick up your utility knife.",
        "The blade will be extremely sharp, and even the slightest slip could result in accident or injury.",
        "Score openings like doors and windows to make them easier to punch out.",
        "Start with the tip of your knife inside one corner of the outline and drag it slowly to the opposite corner, stopping just before it reaches the perpendicular line.",
        "Then, turn your material, reset your knife, and score the next side of the outline.",
        "When you’ve done each side, press down on the excess material at the center of the opening to free it from the surrounding piece.",
        "If for some reason you’re having trouble, another option is to extend your cuts all the way to the edges of the piece, snap them apart manually, and glue them back together without the material from the openings.",
        "Scoring your doors and windows in this way will also produce cleaner openings, since you won't be over-cutting into the surrounding material.",
        "Fold or score the roof make your roof from a single piece of material.",
        "It can be difficult to neatly piece together a roof from lots of small pieces.",
        "A much simpler solution is to draw an additional line onto the outline for your roof piece where the two sides will come together, then fold the cardstock along the line to form the point of the roof.",
        "If you’re using styrene, wood, or gel foam, make a shallow cut down your roof point line and bend the sections of material on either side away from one another to create a hinge.",
        "This technique works best for basic gable, gambrel, and skillion roofs made up of only a couple planes.",
        "If you’ve chosen a more complex roof style for your model, you may have no choice but to cut and paste.",
        "Change out the blade on your utility knife as soon as it gets dull.",
        "The friction of cutting and scoring will begin to dull your cutting tool after a while.",
        "When you begin encountering resistance or notice that your cuts feel rough, stop what you’re doing and very carefully remove the blade you’re currently working with.",
        "Replace the dull blade with a fresh one and get back to it—you’ll feel the difference right away.",
        "If you’re using a retractable utility knife, open up the casing and lift out the old blade by its rear edge to avoid cutting yourself accidentally.",
        "Some newer blades come loaded with pre-notched blades, which make it possible to snap off the dull section and extend a brand new, ultra-sharp tip.",
        "Cutting with a dull blade can tire you out quickly, and is much more likely to damage your work materials.",
        "Assembling and Finishing Your Model Glue your model together where its various planes meet.",
        "Apply a thin strip of high-hold craft glue or a similar adhesive to the edges of your first piece.",
        "Line up the glued edge with the corresponding edge of the neighboring piece and press and hold the two edges together.",
        "Allow the glue to dry for 15-20 seconds before letting go and moving on to the next piece.",
        "You can also use a hot glue gun, super glue, or ordinary white glue on wood and most types of cardstock and board.",
        "To streamline the gluing process, start by putting the outer walls in place around the floor piece, then attach any interior walls you wish to include, saving the roof for last.Tip: Gluing is one of the most time-consuming parts of model-building, but also one of the most important.",
        "Take your time and make sure each seam and connection is as clean and precise as possible.",
        "Apply a thin layer of clay to the outer surface of your model (optional).",
        "Press small lumps of soft modeling clay onto the skeleton of your structure, working in 3–4 in (7.6–10.2 cm) patches.",
        "Once you’ve covered the entire structure, spread and flatten the clay with the pads of your fingers until it’s an even thickness all over.",
        "Be careful not to crush, bend, or otherwise damage the underlying material.",
        "Pinch the clay gently where the separate planes of your model come together to create sharper corners and edges.",
        "Any type of standard modeling or air dry clay will work just fine for most projects.",
        "Be sure to select a neutral color if you intend to paint your finished model.",
        "Carve textures and fine details into the clay with your utility knife.",
        "Hold the knife the way you would a pen or pencil and use the point of the blade to etch masonry stones, staggered board lines, or tiny brickwork patterns.",
        "Study photos of the type of the surfaces and materials you’re replicating to make sure they look authentic.",
        "You can also use your utility knife to “draw” on roof tiles, window sills, roof flashing, and other realistic features.",
        "If you’d rather not go to the trouble of carving everything by hand, consider purchasing a sheet of embossed vinyl or plastic printed in the exterior finish of your choice.",
        "These basically work like stickers—just cut them to fit the shape of your building’s walls, floor, or roof and smooth them on.",
        "Paint your finished model for added realism.",
        "A detailed paint job will give your model a more lifelike quality.",
        "Pick up as many shades as you need to lend a splash of color to your building’s many features.",
        "You’ll need gray for raw stone, dark red for brick, brown or tan for wood, black for roofing tiles, silver for metal, bright colors for siding, shutters, and other painted portions, and so on.",
        "If you used air dry clay to cover your model, you’ll need to heat-cure the clay before you apply paint.",
        "To do this, place the model in the oven on its lowest setting for 15-20 minutes at a time, allowing the oven to cool completely between rounds to prevent the clay from burning.",
        "Continue in this way until it feels dry and solid to the touch.",
        "Acrylic, tempera, or poster paint is usually the best choice for applying to clay."
    ]
}