{
    "title": "How to Say \"Love\" As an Ancient Roman",
    "url": "https://www.wikihow.com/Say-%22Love%22-As-an-Ancient-Roman",
    "category_hierarchy": [
        "Education and Communications",
        "World Languages",
        "Latin"
    ],
    "steps": [
        {
            "headline": "Decide if you want a noun or a verb.",
            "description": ""
        },
        {
            "headline": "If the choice is a noun, then you will need to determine the gender that you need.",
            "description": "This is very important and it has to be in agreement with an associated verb."
        },
        {
            "headline": "The noun forms for \"love\" are: amor, caritas, pietas.",
            "description": "Gender in Latin is very important for context. For example, \"Amor\" is the ancient Roman \"god of love\". \"Venus\" is the feminine counterpart."
        },
        {
            "headline": "As to the verb, know that it is a first conjugation verb that has both active and passive voice.",
            "description": ""
        },
        {
            "headline": "Then decide if you need the indicative mood or the subjunctive or imperative form of the verb.",
            "description": ""
        },
        {
            "headline": "Next decide which of the six tenses that you need.",
            "description": "They are:  present, imperfect, future, perfect, pluperfect and future perfect tense."
        },
        {
            "headline": "By memorization of vocabulary, the student must know the principal parts of a particular verb which are: present indicative; present infinitive; perfect indicative; and perfect passive",
            "description": ""
        },
        {
            "headline": "Decide the numerical reference to one person as \"I\", or \"you\" or \"it\".",
            "description": "This is conditional that knowing the declension of your noun as subject must be in agreement with the verb."
        },
        {
            "headline": "Know what the present tense is derived from both the present indicative \"amo\" as well as the Latin Infinitive which  is \"amare.\"",
            "description": ""
        },
        {
            "headline": "Next, know your conjugations - conjugating a verb means in a sense to conform it to the speaker.",
            "description": "First person singular, second person singular, etc. ERGO"
        },
        {
            "headline": "amo = \"I love\"  \tamamus = \"we love\"",
            "description": ""
        },
        {
            "headline": "amas = \"you love\"       amátis = \"you love\" (plural)",
            "description": ""
        },
        {
            "headline": "amat = \"he loves\"\tamant = \"they love\"",
            "description": ""
        },
        {
            "headline": "Add an accusative subject, for example:",
            "description": "te amo = \"I love you\" amorem amamus = \"We love love\""
        },
        {
            "headline": "By thorough patient study and mastery, someday you can interpret the wonderful written texts of the ancient Roman Republic or the empire that once ruled the world.",
            "description": "Start with the works of Caesar. Even the scientific works of Sir Isaac Newton were written in Latin."
        }
    ],
    "tyn": [
        "Various Latin texts:  the Caesars; Seutonious; Pliny; Livy; Cicero"
    ],
    "text": " Decide if you want a noun or a verb.  If the choice is a noun, then you will need to determine the gender that you need. This is very important and it has to be in agreement with an associated verb. The noun forms for \"love\" are: amor, caritas, pietas. Gender in Latin is very important for context. For example, \"Amor\" is the ancient Roman \"god of love\". \"Venus\" is the feminine counterpart. As to the verb, know that it is a first conjugation verb that has both active and passive voice.  Then decide if you need the indicative mood or the subjunctive or imperative form of the verb.  Next decide which of the six tenses that you need. They are:  present, imperfect, future, perfect, pluperfect and future perfect tense. By memorization of vocabulary, the student must know the principal parts of a particular verb which are: present indicative; present infinitive; perfect indicative; and perfect passive  Decide the numerical reference to one person as \"I\", or \"you\" or \"it\". This is conditional that knowing the declension of your noun as subject must be in agreement with the verb. Know what the present tense is derived from both the present indicative \"amo\" as well as the Latin Infinitive which  is \"amare.\"  Next, know your conjugations - conjugating a verb means in a sense to conform it to the speaker. First person singular, second person singular, etc. ERGO amo = \"I love\"  \tamamus = \"we love\"  amas = \"you love\"       amátis = \"you love\" (plural)  amat = \"he loves\"\tamant = \"they love\"  Add an accusative subject, for example: te amo = \"I love you\" amorem amamus = \"We love love\" By thorough patient study and mastery, someday you can interpret the wonderful written texts of the ancient Roman Republic or the empire that once ruled the world. Start with the works of Caesar. Even the scientific works of Sir Isaac Newton were written in Latin.",
    "sentences": [
        " Decide if you want a noun or a verb.",
        "If the choice is a noun, then you will need to determine the gender that you need.",
        "This is very important and it has to be in agreement with an associated verb.",
        "The noun forms for \"love\" are: amor, caritas, pietas.",
        "Gender in Latin is very important for context.",
        "For example, \"Amor\" is the ancient Roman \"god of love\".",
        "\"Venus\" is the feminine counterpart.",
        "As to the verb, know that it is a first conjugation verb that has both active and passive voice.",
        "Then decide if you need the indicative mood or the subjunctive or imperative form of the verb.",
        "Next decide which of the six tenses that you need.",
        "They are:  present, imperfect, future, perfect, pluperfect and future perfect tense.",
        "By memorization of vocabulary, the student must know the principal parts of a particular verb which are: present indicative; present infinitive; perfect indicative; and perfect passive  Decide the numerical reference to one person as \"I\", or \"you\" or \"it\".",
        "This is conditional that knowing the declension of your noun as subject must be in agreement with the verb.",
        "Know what the present tense is derived from both the present indicative \"amo\" as well as the Latin Infinitive which  is \"amare.\"",
        "Next, know your conjugations - conjugating a verb means in a sense to conform it to the speaker.",
        "First person singular, second person singular, etc.",
        "ERGO amo = \"I love\"  \tamamus = \"we love\"  amas = \"you love\"       amátis = \"you love\" (plural)  amat = \"he loves\"\tamant = \"they love\"  Add an accusative subject, for example: te amo = \"I love you\" amorem amamus = \"We love love\" By thorough patient study and mastery, someday you can interpret the wonderful written texts of the ancient Roman Republic or the empire that once ruled the world.",
        "Start with the works of Caesar.",
        "Even the scientific works of Sir Isaac Newton were written in Latin."
    ]
}