{
    "title": "How to Remove Rain–X",
    "url": "https://www.wikihow.com/Remove-Rain%E2%80%93X",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Maintenance and Repair"
    ],
    "methods": [
        {
            "name": "Using Water and Vinegar",
            "steps": [
                {
                    "headline": "Use a dry, soft rag to clean the glass surface from which you want Rain-X removed.",
                    "description": "This helps remove loose dust and debris, and reduces the risk for scratches during treatment."
                },
                {
                    "headline": "Pour equal parts water and white vinegar into a spray bottle.",
                    "description": "This mixture will be used to remove Rain-X from the glass surface, since vinegar contains natural cleaning properties that can remove most commercial formulas, including Rain-X."
                },
                {
                    "headline": "Spray the water and vinegar mixture across the entire glass surface.",
                    "description": ""
                },
                {
                    "headline": "Use the rag to rub and work the vinegar solution into the Rain-X problem areas, or across the entire glass surface.",
                    "description": ""
                },
                {
                    "headline": "Dry the glass surface using another dry, soft rag.",
                    "description": "This will wipe away the water and vinegar mixture, as well as any remaining Rain-X residue."
                }
            ]
        },
        {
            "name": "Using Commercial Cleaning Products",
            "steps": [
                {
                    "headline": "Purchase a commercial cleaning product that has the ability to remove Rain-X residue.",
                    "description": "Rain-X suggests using Rain-X Extreme Clean to remove Rain-X from a glass surface. Other products proven effective at removing Rain-X include Soft Scrub Cleanser, Rain-X Glass Polish, Bar Keepers Friend cleanser, Detailer’s Pro Glass Restorer, and No Touch GS8 Auto Glass Stripper."
                },
                {
                    "headline": "Use a dry, soft rag to clean the glass surface from which you want Rain-X removed.",
                    "description": "This helps remove loose dust and debris, and reduces the risk for scratches during treatment."
                },
                {
                    "headline": "Pour several drops of liquid dishwashing soap as needed into a bowl or bucket large enough to clean the entire glass surface",
                    "description": ""
                },
                {
                    "headline": "Fill the bowl with water.",
                    "description": "This formula will be used to clean and wipe down the entirety of the glass surface."
                },
                {
                    "headline": "Dip the rag into the soap and water mixture, then use the rag to clean the glass surface.",
                    "description": ""
                },
                {
                    "headline": "Use another dry, soft rag to remove the soap and water mixture from the glass surface.",
                    "description": ""
                },
                {
                    "headline": "Dampen a soft sponge or microfiber cloth using water.",
                    "description": "The sponge or cloth will be used as a buffer to apply the commercial cleaning solution to the glass surface."
                },
                {
                    "headline": "Apply the appropriate amount of cleaning solution directly to the sponge or cloth.",
                    "description": "You may need to refer to the product’s label for directions."
                },
                {
                    "headline": "Use the sponge or cloth to rub and work the cleaning solution into the Rain-X problem areas, or across the entire glass surface.",
                    "description": ""
                },
                {
                    "headline": "Use water to rinse and remove the cleaning solution from the glass.",
                    "description": "You can use a spray bottle, hose with a nozzle, or wet cloth to remove the cleaning solution."
                },
                {
                    "headline": "Use another soft, dry cloth to completely remove any remaining water or moisture from the glass surface.",
                    "description": "Any Rain-X residue will now be removed from the surface."
                }
            ]
        }
    ],
    "tyn": [
        "2 or 3 soft rags",
        "Distilled white vinegar",
        "Spray bottle",
        "Liquid dishwashing soap",
        "Bowl or bucket",
        "Soft sponge or microfiber cloth",
        "Commercial cleaning solution"
    ],
    "text": " Using Water and Vinegar Use a dry, soft rag to clean the glass surface from which you want Rain-X removed. This helps remove loose dust and debris, and reduces the risk for scratches during treatment. Pour equal parts water and white vinegar into a spray bottle. This mixture will be used to remove Rain-X from the glass surface, since vinegar contains natural cleaning properties that can remove most commercial formulas, including Rain-X. Spray the water and vinegar mixture across the entire glass surface.  Use the rag to rub and work the vinegar solution into the Rain-X problem areas, or across the entire glass surface.  Dry the glass surface using another dry, soft rag. This will wipe away the water and vinegar mixture, as well as any remaining Rain-X residue. Using Commercial Cleaning Products Purchase a commercial cleaning product that has the ability to remove Rain-X residue. Rain-X suggests using Rain-X Extreme Clean to remove Rain-X from a glass surface. Other products proven effective at removing Rain-X include Soft Scrub Cleanser, Rain-X Glass Polish, Bar Keepers Friend cleanser, Detailer’s Pro Glass Restorer, and No Touch GS8 Auto Glass Stripper. Use a dry, soft rag to clean the glass surface from which you want Rain-X removed. This helps remove loose dust and debris, and reduces the risk for scratches during treatment. Pour several drops of liquid dishwashing soap as needed into a bowl or bucket large enough to clean the entire glass surface  Fill the bowl with water. This formula will be used to clean and wipe down the entirety of the glass surface. Dip the rag into the soap and water mixture, then use the rag to clean the glass surface.  Use another dry, soft rag to remove the soap and water mixture from the glass surface.  Dampen a soft sponge or microfiber cloth using water. The sponge or cloth will be used as a buffer to apply the commercial cleaning solution to the glass surface. Apply the appropriate amount of cleaning solution directly to the sponge or cloth. You may need to refer to the product’s label for directions. Use the sponge or cloth to rub and work the cleaning solution into the Rain-X problem areas, or across the entire glass surface.  Use water to rinse and remove the cleaning solution from the glass. You can use a spray bottle, hose with a nozzle, or wet cloth to remove the cleaning solution. Use another soft, dry cloth to completely remove any remaining water or moisture from the glass surface. Any Rain-X residue will now be removed from the surface.",
    "sentences": [
        " Using Water and Vinegar Use a dry, soft rag to clean the glass surface from which you want Rain-X removed.",
        "This helps remove loose dust and debris, and reduces the risk for scratches during treatment.",
        "Pour equal parts water and white vinegar into a spray bottle.",
        "This mixture will be used to remove Rain-X from the glass surface, since vinegar contains natural cleaning properties that can remove most commercial formulas, including Rain-X.",
        "Spray the water and vinegar mixture across the entire glass surface.",
        "Use the rag to rub and work the vinegar solution into the Rain-X problem areas, or across the entire glass surface.",
        "Dry the glass surface using another dry, soft rag.",
        "This will wipe away the water and vinegar mixture, as well as any remaining Rain-X residue.",
        "Using Commercial Cleaning Products Purchase a commercial cleaning product that has the ability to remove Rain-X residue.",
        "Rain-X suggests using Rain-X Extreme Clean to remove Rain-X from a glass surface.",
        "Other products proven effective at removing Rain-X include Soft Scrub Cleanser, Rain-X Glass Polish, Bar Keepers Friend cleanser, Detailer’s Pro Glass Restorer, and No Touch GS8 Auto Glass Stripper.",
        "Use a dry, soft rag to clean the glass surface from which you want Rain-X removed.",
        "This helps remove loose dust and debris, and reduces the risk for scratches during treatment.",
        "Pour several drops of liquid dishwashing soap as needed into a bowl or bucket large enough to clean the entire glass surface  Fill the bowl with water.",
        "This formula will be used to clean and wipe down the entirety of the glass surface.",
        "Dip the rag into the soap and water mixture, then use the rag to clean the glass surface.",
        "Use another dry, soft rag to remove the soap and water mixture from the glass surface.",
        "Dampen a soft sponge or microfiber cloth using water.",
        "The sponge or cloth will be used as a buffer to apply the commercial cleaning solution to the glass surface.",
        "Apply the appropriate amount of cleaning solution directly to the sponge or cloth.",
        "You may need to refer to the product’s label for directions.",
        "Use the sponge or cloth to rub and work the cleaning solution into the Rain-X problem areas, or across the entire glass surface.",
        "Use water to rinse and remove the cleaning solution from the glass.",
        "You can use a spray bottle, hose with a nozzle, or wet cloth to remove the cleaning solution.",
        "Use another soft, dry cloth to completely remove any remaining water or moisture from the glass surface.",
        "Any Rain-X residue will now be removed from the surface."
    ]
}