{
    "title": "How to Use Bay Leaves",
    "url": "https://www.wikihow.com/Use-Bay-Leaves",
    "category_hierarchy": [
        "Food and Entertaining",
        "Herbs and Spices"
    ],
    "methods": [
        {
            "name": "Cooking with Bay Leaves",
            "steps": [
                {
                    "headline": "Go with dried bay leaves over fresh ones for culinary use.",
                    "description": "This is one case where the majority of chefs recommend using a dried seasoning rather than one that's been freshly-picked. The reason for this is that fresh bay leaves actually come from a different plant altogether (Umbellularia californica, to be exact). Though they're similar in most respects, these leaves have more of a minty, astringent taste that doesn’t work well with many ingredients.Fresh bay leaves have a deeper green color and more supple texture compared to dried ones. The bay leaves sold in the spice aisle of most supermarkets are pre-dried, so you shouldn't have to worry about buying the wrong kind by accident."
                },
                {
                    "headline": "Add bay leaves to slow-cooking meals.",
                    "description": "The next time you’ve got a batch of beef stew, short ribs, or pasta going on the stovetop or in the crock pot, try adding 1 or 2 whole bay leaves. The dried leaves release their flavor gradually as they heat up, which makes low-and-slow recipes the perfect place to let them work their magic.Only use whole leaves. Bay leaves aren’t meant to be eaten, so grinding them up or breaking them into small pieces will only make them harder to fish out later on. A couple bay leaves could also make a welcome addition to a savory casserole, a braised cut of meat, or a pot of rice, couscous, or risotto."
                },
                {
                    "headline": "Use bay leaves to lend an earthy richness to soups, stews, and sauces.",
                    "description": "Like other slow-cooking methods, simmering is a good way to unlock the bitter, woody, faintly tea-like notes of the little leaves. The key here lies in the abundant moisture, which serves as a base for the aromatic infusion. You can throw a bay leaf or 2 into any mixture you please. However, they work especially well in culinary staples like marinara, béchamel, and curries.Tip: For a more traditional touch, try putting together your own bouquet garni, a classic French seasoning solution made by bundling an assortment or fresh or dried herbs."
                },
                {
                    "headline": "Boil or steam fresh foods with bay leaves to enhance their natural flavor.",
                    "description": "Try adding 2-3 leaves to the water that you use to cook tender or delicate offerings like root vegetables, greens, and fresh-caught fish and seafood. They’ll help create a more complex profile without overwhelming your ingredients or interfering with their more subtle qualities. Feel free to use bay leaves in addition to any other seasonings you like for boiling and steaming, such as lemon, vinegar, olive oil, garlic, ginger, or fresh herbs."
                },
                {
                    "headline": "Limit the number of bay leaves you use in a given dish.",
                    "description": "A single bay leaf goes a long way. In general, it’s best to avoid adding more than 2 or 3 leaves to whatever you’re cooking. If you overdo it, you could easily end up overpowering the primary flavors of your dish.This is especially true when the recipe you’re following already calls for other bitter, smoky, or musky ingredients."
                },
                {
                    "headline": "Remove the leaves from completed dishes immediately after cooking.",
                    "description": "Always keep track of the number of bay leaves you add, and take a moment to confirm that you've retrieved them all before you ring the dinner bell. Though bay leaves are complementary to a wide variety of foods, they’re not very appetizing themselves. This is why it’s so important to use whole leaves rather than smaller pieces. Advise your dinner guests to keep an eye out for stray bay leaves in their meal in case you happened to miss one. Unlike many other herbs, bay leaves remain rigid even after hours of exposure to intense heat. For this reason, they could also present a choking hazard or cause minor cuts or abrasions if ingested accidentally."
                }
            ]
        },
        {
            "name": "Finding Other Uses for Bay Leaves",
            "steps": [
                {
                    "headline": "Scatter bay leaves around your kitchen to ward off common pests.",
                    "description": "Leave a few dried leaves on the shelves of your pantry or around your dry food storage containers to ward off mice, ants, flies, cockroaches, weevils, and other unwanted critters. The powerful aroma that makes bay leaves a versatile seasoning also makes them a good natural repellent for small pests.Crushing or grinding your bay leaves will help strengthen the scent that they give off, making them a more effective deterrent. You can even hide a couple bay leaves right inside your loose flour or grain if you suspect that your uninvited guests have been making a meal of them."
                },
                {
                    "headline": "Incorporate bay leaves into a homemade simmering potpourri.",
                    "description": "Add 6-8 whole bay leaves to a saucepan or crock pot, along with fresh orange and lemon slices, cinnamon sticks, and whole cloves. Cover your components with water, then place them on the cooktop to simmer over low heat. As they warm up, they’ll begin to fill your home with a warm, comforting fragrance. Simmering potpourris are ideal for providing a sense of atmosphere for afternoon luncheons, teas, holiday parties, and other get-togethers. You can also combine whole dried bay leaves with other pleasant scents like rosemary, time, oregano, sage, cardamom, allspice, and pine for a more subdued dry potpourri."
                },
                {
                    "headline": "Experiment with using bay leaf tea as a health supplement.",
                    "description": "Many cultures throughout the world have been employing bay leaves against a wide range of maladies for thousands of years. To try it yourself, steep 3-5 bay leaves in 16 fluid ounces (470 mL) of hot water for about 20 minutes, then transfer the brew to a mug and drink up. If you like, you can add a cinnamon stick or the juice from 1 or 2 lemons to the concoction to make the finished tea more palatable.Teas and infusions made with bay leaves are said to aid in digestion, reduce flatulence, promote breathing, soothe aches and pains, and even improve diabetes symptoms. If the idea of drinking bay leaf tea doesn’t appeal to you, consider purchasing some bay laurel oil to use as a topical treatment.Warning: Keep in mind that there’s not much hard scientific evidence to back up these claims, so if you decide to use bay leaves as an alternative to conventional medicine, you’ll be doing so at your own risk."
                }
            ]
        },
        {
            "name": "Drying and Storing Fresh Bay Leaves",
            "steps": [
                {
                    "headline": "Air-dry freshly-picked bay leaves to strengthen their flavor naturally.",
                    "description": "Fold the lush green leaves up in a paper towel, then seal the bundle inside a plastic zipper bag and put it away in a cool, dry place. In around 3-5 days, you’ll have a ready supply of dried bay leaves to draw on for all your needs, culinary or otherwise. Of course, you also have the option of simply picking up a package of dried bay leaves from your local supermarket if you don't want to go to the trouble of drying them yourself.Tip: A dim pantry or unused cabinet or drawer that's situated at a distance from your major kitchen appliances can be a great place to air-dry bay leaves and other fresh herbs."
                },
                {
                    "headline": "Dry your fresh bay leaves in the oven to save time.",
                    "description": "Lay your fresh bay leaves out in a single layer on a baking sheet and stick them in an oven set to its lowest heat setting for 3-4 hours, or until they take on a pale brownish-green color and become brittle to the touch. The constant circulation of warm air will help speed up the dehydration process a bit.Leave the oven door cracked to allow more moisture to escape. A dehydrator will also get the job done nicely. For best results, set the machine to a temperature between 95 °F (35 °C) and 115 °F (46 °C) and leave your bay leaves in for 4-6 hours."
                },
                {
                    "headline": "Keep fresh bay leaves in the refrigerator until you're ready to dry them.",
                    "description": "Wrap the green leaves in a paper towel, then slip them inside a plastic zipper bag and seal them up tight. Tuck the bag away in your refrigerator's crisper drawer, where the leaves will stay cool and dry.When properly sealed and refrigerated, fresh bay leaves will keep for roughly the same amount of time as other types of fresh herbs, about 1-2 weeks. Make sure you label the bag that your bay leaves are in so you'll be able to identify its contents at a glance."
                },
                {
                    "headline": "Store your unused bay leaves in the freezer to make them last longer.",
                    "description": "If you want to maximize the shelf life of your dried bay leaves, you can’t do better than to freeze them. Take the leaves out of the jar or bag they came packaged in and place them in an airtight zipper bag or plastic food storage container, then stash them in your freezer until you need them to create your next culinary masterpiece.Freezing bay leaves will preserve their flavor and aroma for years, if not indefinitely. No matter which storage method you choose, it’s important to ensure that your bay leaves are exposed to as little heat, light, and moisture as possible."
                }
            ]
        }
    ],
    "tyn": [
        "Cooking with Bay Leaves",
        "Various cookware",
        "Wooden spoon or tongs (for removing bay leaves after cooking)",
        "Finding Other Uses for Bay Leaves",
        "Saucepan or crock pot",
        "Spice grinder or food processor (optional)",
        "Bay laurel oil (optional)",
        "Drying and Storing Fresh Bay Leaves",
        "Plastic zipper bag",
        "Paper towels",
        "Airtight food storage container",
        "Oven and baking sheet (optional)",
        "Dehydrator (optional)"
    ],
    "text": " Cooking with Bay Leaves Go with dried bay leaves over fresh ones for culinary use. This is one case where the majority of chefs recommend using a dried seasoning rather than one that's been freshly-picked. The reason for this is that fresh bay leaves actually come from a different plant altogether (Umbellularia californica, to be exact). Though they're similar in most respects, these leaves have more of a minty, astringent taste that doesn’t work well with many ingredients.Fresh bay leaves have a deeper green color and more supple texture compared to dried ones. The bay leaves sold in the spice aisle of most supermarkets are pre-dried, so you shouldn't have to worry about buying the wrong kind by accident. Add bay leaves to slow-cooking meals. The next time you’ve got a batch of beef stew, short ribs, or pasta going on the stovetop or in the crock pot, try adding 1 or 2 whole bay leaves. The dried leaves release their flavor gradually as they heat up, which makes low-and-slow recipes the perfect place to let them work their magic.Only use whole leaves. Bay leaves aren’t meant to be eaten, so grinding them up or breaking them into small pieces will only make them harder to fish out later on. A couple bay leaves could also make a welcome addition to a savory casserole, a braised cut of meat, or a pot of rice, couscous, or risotto. Use bay leaves to lend an earthy richness to soups, stews, and sauces. Like other slow-cooking methods, simmering is a good way to unlock the bitter, woody, faintly tea-like notes of the little leaves. The key here lies in the abundant moisture, which serves as a base for the aromatic infusion. You can throw a bay leaf or 2 into any mixture you please. However, they work especially well in culinary staples like marinara, béchamel, and curries.Tip: For a more traditional touch, try putting together your own bouquet garni, a classic French seasoning solution made by bundling an assortment or fresh or dried herbs. Boil or steam fresh foods with bay leaves to enhance their natural flavor. Try adding 2-3 leaves to the water that you use to cook tender or delicate offerings like root vegetables, greens, and fresh-caught fish and seafood. They’ll help create a more complex profile without overwhelming your ingredients or interfering with their more subtle qualities. Feel free to use bay leaves in addition to any other seasonings you like for boiling and steaming, such as lemon, vinegar, olive oil, garlic, ginger, or fresh herbs. Limit the number of bay leaves you use in a given dish. A single bay leaf goes a long way. In general, it’s best to avoid adding more than 2 or 3 leaves to whatever you’re cooking. If you overdo it, you could easily end up overpowering the primary flavors of your dish.This is especially true when the recipe you’re following already calls for other bitter, smoky, or musky ingredients. Remove the leaves from completed dishes immediately after cooking. Always keep track of the number of bay leaves you add, and take a moment to confirm that you've retrieved them all before you ring the dinner bell. Though bay leaves are complementary to a wide variety of foods, they’re not very appetizing themselves. This is why it’s so important to use whole leaves rather than smaller pieces. Advise your dinner guests to keep an eye out for stray bay leaves in their meal in case you happened to miss one. Unlike many other herbs, bay leaves remain rigid even after hours of exposure to intense heat. For this reason, they could also present a choking hazard or cause minor cuts or abrasions if ingested accidentally. Finding Other Uses for Bay Leaves Scatter bay leaves around your kitchen to ward off common pests. Leave a few dried leaves on the shelves of your pantry or around your dry food storage containers to ward off mice, ants, flies, cockroaches, weevils, and other unwanted critters. The powerful aroma that makes bay leaves a versatile seasoning also makes them a good natural repellent for small pests.Crushing or grinding your bay leaves will help strengthen the scent that they give off, making them a more effective deterrent. You can even hide a couple bay leaves right inside your loose flour or grain if you suspect that your uninvited guests have been making a meal of them. Incorporate bay leaves into a homemade simmering potpourri. Add 6-8 whole bay leaves to a saucepan or crock pot, along with fresh orange and lemon slices, cinnamon sticks, and whole cloves. Cover your components with water, then place them on the cooktop to simmer over low heat. As they warm up, they’ll begin to fill your home with a warm, comforting fragrance. Simmering potpourris are ideal for providing a sense of atmosphere for afternoon luncheons, teas, holiday parties, and other get-togethers. You can also combine whole dried bay leaves with other pleasant scents like rosemary, time, oregano, sage, cardamom, allspice, and pine for a more subdued dry potpourri. Experiment with using bay leaf tea as a health supplement. Many cultures throughout the world have been employing bay leaves against a wide range of maladies for thousands of years. To try it yourself, steep 3-5 bay leaves in 16 fluid ounces (470 mL) of hot water for about 20 minutes, then transfer the brew to a mug and drink up. If you like, you can add a cinnamon stick or the juice from 1 or 2 lemons to the concoction to make the finished tea more palatable.Teas and infusions made with bay leaves are said to aid in digestion, reduce flatulence, promote breathing, soothe aches and pains, and even improve diabetes symptoms. If the idea of drinking bay leaf tea doesn’t appeal to you, consider purchasing some bay laurel oil to use as a topical treatment.Warning: Keep in mind that there’s not much hard scientific evidence to back up these claims, so if you decide to use bay leaves as an alternative to conventional medicine, you’ll be doing so at your own risk. Drying and Storing Fresh Bay Leaves Air-dry freshly-picked bay leaves to strengthen their flavor naturally. Fold the lush green leaves up in a paper towel, then seal the bundle inside a plastic zipper bag and put it away in a cool, dry place. In around 3-5 days, you’ll have a ready supply of dried bay leaves to draw on for all your needs, culinary or otherwise. Of course, you also have the option of simply picking up a package of dried bay leaves from your local supermarket if you don't want to go to the trouble of drying them yourself.Tip: A dim pantry or unused cabinet or drawer that's situated at a distance from your major kitchen appliances can be a great place to air-dry bay leaves and other fresh herbs. Dry your fresh bay leaves in the oven to save time. Lay your fresh bay leaves out in a single layer on a baking sheet and stick them in an oven set to its lowest heat setting for 3-4 hours, or until they take on a pale brownish-green color and become brittle to the touch. The constant circulation of warm air will help speed up the dehydration process a bit.Leave the oven door cracked to allow more moisture to escape. A dehydrator will also get the job done nicely. For best results, set the machine to a temperature between 95 °F (35 °C) and 115 °F (46 °C) and leave your bay leaves in for 4-6 hours. Keep fresh bay leaves in the refrigerator until you're ready to dry them. Wrap the green leaves in a paper towel, then slip them inside a plastic zipper bag and seal them up tight. Tuck the bag away in your refrigerator's crisper drawer, where the leaves will stay cool and dry.When properly sealed and refrigerated, fresh bay leaves will keep for roughly the same amount of time as other types of fresh herbs, about 1-2 weeks. Make sure you label the bag that your bay leaves are in so you'll be able to identify its contents at a glance. Store your unused bay leaves in the freezer to make them last longer. If you want to maximize the shelf life of your dried bay leaves, you can’t do better than to freeze them. Take the leaves out of the jar or bag they came packaged in and place them in an airtight zipper bag or plastic food storage container, then stash them in your freezer until you need them to create your next culinary masterpiece.Freezing bay leaves will preserve their flavor and aroma for years, if not indefinitely. No matter which storage method you choose, it’s important to ensure that your bay leaves are exposed to as little heat, light, and moisture as possible.",
    "sentences": [
        " Cooking with Bay Leaves Go with dried bay leaves over fresh ones for culinary use.",
        "This is one case where the majority of chefs recommend using a dried seasoning rather than one that's been freshly-picked.",
        "The reason for this is that fresh bay leaves actually come from a different plant altogether (Umbellularia californica, to be exact).",
        "Though they're similar in most respects, these leaves have more of a minty, astringent taste that doesn’t work well with many ingredients.Fresh bay leaves have a deeper green color and more supple texture compared to dried ones.",
        "The bay leaves sold in the spice aisle of most supermarkets are pre-dried, so you shouldn't have to worry about buying the wrong kind by accident.",
        "Add bay leaves to slow-cooking meals.",
        "The next time you’ve got a batch of beef stew, short ribs, or pasta going on the stovetop or in the crock pot, try adding 1 or 2 whole bay leaves.",
        "The dried leaves release their flavor gradually as they heat up, which makes low-and-slow recipes the perfect place to let them work their magic.Only use whole leaves.",
        "Bay leaves aren’t meant to be eaten, so grinding them up or breaking them into small pieces will only make them harder to fish out later on.",
        "A couple bay leaves could also make a welcome addition to a savory casserole, a braised cut of meat, or a pot of rice, couscous, or risotto.",
        "Use bay leaves to lend an earthy richness to soups, stews, and sauces.",
        "Like other slow-cooking methods, simmering is a good way to unlock the bitter, woody, faintly tea-like notes of the little leaves.",
        "The key here lies in the abundant moisture, which serves as a base for the aromatic infusion.",
        "You can throw a bay leaf or 2 into any mixture you please.",
        "However, they work especially well in culinary staples like marinara, béchamel, and curries.Tip: For a more traditional touch, try putting together your own bouquet garni, a classic French seasoning solution made by bundling an assortment or fresh or dried herbs.",
        "Boil or steam fresh foods with bay leaves to enhance their natural flavor.",
        "Try adding 2-3 leaves to the water that you use to cook tender or delicate offerings like root vegetables, greens, and fresh-caught fish and seafood.",
        "They’ll help create a more complex profile without overwhelming your ingredients or interfering with their more subtle qualities.",
        "Feel free to use bay leaves in addition to any other seasonings you like for boiling and steaming, such as lemon, vinegar, olive oil, garlic, ginger, or fresh herbs.",
        "Limit the number of bay leaves you use in a given dish.",
        "A single bay leaf goes a long way.",
        "In general, it’s best to avoid adding more than 2 or 3 leaves to whatever you’re cooking.",
        "If you overdo it, you could easily end up overpowering the primary flavors of your dish.This is especially true when the recipe you’re following already calls for other bitter, smoky, or musky ingredients.",
        "Remove the leaves from completed dishes immediately after cooking.",
        "Always keep track of the number of bay leaves you add, and take a moment to confirm that you've retrieved them all before you ring the dinner bell.",
        "Though bay leaves are complementary to a wide variety of foods, they’re not very appetizing themselves.",
        "This is why it’s so important to use whole leaves rather than smaller pieces.",
        "Advise your dinner guests to keep an eye out for stray bay leaves in their meal in case you happened to miss one.",
        "Unlike many other herbs, bay leaves remain rigid even after hours of exposure to intense heat.",
        "For this reason, they could also present a choking hazard or cause minor cuts or abrasions if ingested accidentally.",
        "Finding Other Uses for Bay Leaves Scatter bay leaves around your kitchen to ward off common pests.",
        "Leave a few dried leaves on the shelves of your pantry or around your dry food storage containers to ward off mice, ants, flies, cockroaches, weevils, and other unwanted critters.",
        "The powerful aroma that makes bay leaves a versatile seasoning also makes them a good natural repellent for small pests.Crushing or grinding your bay leaves will help strengthen the scent that they give off, making them a more effective deterrent.",
        "You can even hide a couple bay leaves right inside your loose flour or grain if you suspect that your uninvited guests have been making a meal of them.",
        "Incorporate bay leaves into a homemade simmering potpourri.",
        "Add 6-8 whole bay leaves to a saucepan or crock pot, along with fresh orange and lemon slices, cinnamon sticks, and whole cloves.",
        "Cover your components with water, then place them on the cooktop to simmer over low heat.",
        "As they warm up, they’ll begin to fill your home with a warm, comforting fragrance.",
        "Simmering potpourris are ideal for providing a sense of atmosphere for afternoon luncheons, teas, holiday parties, and other get-togethers.",
        "You can also combine whole dried bay leaves with other pleasant scents like rosemary, time, oregano, sage, cardamom, allspice, and pine for a more subdued dry potpourri.",
        "Experiment with using bay leaf tea as a health supplement.",
        "Many cultures throughout the world have been employing bay leaves against a wide range of maladies for thousands of years.",
        "To try it yourself, steep 3-5 bay leaves in 16 fluid ounces (470 mL) of hot water for about 20 minutes, then transfer the brew to a mug and drink up.",
        "If you like, you can add a cinnamon stick or the juice from 1 or 2 lemons to the concoction to make the finished tea more palatable.Teas and infusions made with bay leaves are said to aid in digestion, reduce flatulence, promote breathing, soothe aches and pains, and even improve diabetes symptoms.",
        "If the idea of drinking bay leaf tea doesn’t appeal to you, consider purchasing some bay laurel oil to use as a topical treatment.Warning: Keep in mind that there’s not much hard scientific evidence to back up these claims, so if you decide to use bay leaves as an alternative to conventional medicine, you’ll be doing so at your own risk.",
        "Drying and Storing Fresh Bay Leaves Air-dry freshly-picked bay leaves to strengthen their flavor naturally.",
        "Fold the lush green leaves up in a paper towel, then seal the bundle inside a plastic zipper bag and put it away in a cool, dry place.",
        "In around 3-5 days, you’ll have a ready supply of dried bay leaves to draw on for all your needs, culinary or otherwise.",
        "Of course, you also have the option of simply picking up a package of dried bay leaves from your local supermarket if you don't want to go to the trouble of drying them yourself.Tip: A dim pantry or unused cabinet or drawer that's situated at a distance from your major kitchen appliances can be a great place to air-dry bay leaves and other fresh herbs.",
        "Dry your fresh bay leaves in the oven to save time.",
        "Lay your fresh bay leaves out in a single layer on a baking sheet and stick them in an oven set to its lowest heat setting for 3-4 hours, or until they take on a pale brownish-green color and become brittle to the touch.",
        "The constant circulation of warm air will help speed up the dehydration process a bit.Leave the oven door cracked to allow more moisture to escape.",
        "A dehydrator will also get the job done nicely.",
        "For best results, set the machine to a temperature between 95 °F (35 °C) and 115 °F (46 °C) and leave your bay leaves in for 4-6 hours.",
        "Keep fresh bay leaves in the refrigerator until you're ready to dry them.",
        "Wrap the green leaves in a paper towel, then slip them inside a plastic zipper bag and seal them up tight.",
        "Tuck the bag away in your refrigerator's crisper drawer, where the leaves will stay cool and dry.When properly sealed and refrigerated, fresh bay leaves will keep for roughly the same amount of time as other types of fresh herbs, about 1-2 weeks.",
        "Make sure you label the bag that your bay leaves are in so you'll be able to identify its contents at a glance.",
        "Store your unused bay leaves in the freezer to make them last longer.",
        "If you want to maximize the shelf life of your dried bay leaves, you can’t do better than to freeze them.",
        "Take the leaves out of the jar or bag they came packaged in and place them in an airtight zipper bag or plastic food storage container, then stash them in your freezer until you need them to create your next culinary masterpiece.Freezing bay leaves will preserve their flavor and aroma for years, if not indefinitely.",
        "No matter which storage method you choose, it’s important to ensure that your bay leaves are exposed to as little heat, light, and moisture as possible."
    ]
}