{
    "title": "How to Check the Charge of a Dell Laptop's Battery",
    "url": "https://www.wikihow.com/Check-the-Charge-of-a-Dell-Laptop%27s-Battery",
    "category_hierarchy": [
        "Computers and Electronics",
        "Computers",
        "Laptops",
        "Laptops by Type",
        "Dell Laptops"
    ],
    "steps": [
        {
            "headline": "Take the laptop out of its case.",
            "description": ""
        },
        {
            "headline": "Make sure it is off and not in sleep mode.",
            "description": ""
        },
        {
            "headline": "Flip it over onto it's top so you are looking at the bottom.",
            "description": ""
        },
        {
            "headline": "To identify the battery: Newer models have it underneath.",
            "description": "Look for a gray or black rectangle. Older models may have it at the front, where you put CD drives and such."
        },
        {
            "headline": "For the newer ones that have the battery on the bottom, look on the battery for a little white rectangle with 5 lights on it.",
            "description": "There will be a button next to them. Push it. The lights will come on. The number of lights will give you an estimation on how much it has left.5-Full. 4-80%. 3-60%. 2-40%. 1-20%. None-0%. If it is a half, the lights will stay on and the last one will blink. 4+1=90%. 3+1=70%. 2+1=50%. 1+1 =30%."
        },
        {
            "headline": "For the older ones, take out the battery and look in the inside, where the connector is.",
            "description": "There should be the same as above, a little pad with 5 lights on it. Do that same as above."
        }
    ],
    "tyn": [
        "Dell Laptop"
    ],
    "text": " Take the laptop out of its case.  Make sure it is off and not in sleep mode.  Flip it over onto it's top so you are looking at the bottom.  To identify the battery: Newer models have it underneath. Look for a gray or black rectangle. Older models may have it at the front, where you put CD drives and such. For the newer ones that have the battery on the bottom, look on the battery for a little white rectangle with 5 lights on it. There will be a button next to them. Push it. The lights will come on. The number of lights will give you an estimation on how much it has left.5-Full. 4-80%. 3-60%. 2-40%. 1-20%. None-0%. If it is a half, the lights will stay on and the last one will blink. 4+1=90%. 3+1=70%. 2+1=50%. 1+1 =30%. For the older ones, take out the battery and look in the inside, where the connector is. There should be the same as above, a little pad with 5 lights on it. Do that same as above.",
    "sentences": [
        " Take the laptop out of its case.",
        "Make sure it is off and not in sleep mode.",
        "Flip it over onto it's top so you are looking at the bottom.",
        "To identify the battery: Newer models have it underneath.",
        "Look for a gray or black rectangle.",
        "Older models may have it at the front, where you put CD drives and such.",
        "For the newer ones that have the battery on the bottom, look on the battery for a little white rectangle with 5 lights on it.",
        "There will be a button next to them.",
        "Push it.",
        "The lights will come on.",
        "The number of lights will give you an estimation on how much it has left.5-Full.",
        "4-80%.",
        "3-60%.",
        "2-40%.",
        "1-20%.",
        "None-0%.",
        "If it is a half, the lights will stay on and the last one will blink.",
        "4+1=90%.",
        "3+1=70%.",
        "2+1=50%.",
        "1+1 =30%.",
        "For the older ones, take out the battery and look in the inside, where the connector is.",
        "There should be the same as above, a little pad with 5 lights on it.",
        "Do that same as above."
    ]
}