{
    "title": "How to Fold (Baking)",
    "url": "https://www.wikihow.com/Fold-(Baking)",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking"
    ],
    "steps": [
        {
            "headline": "Follow the recipe's instructions properly.",
            "description": "Folding usually occurs after you have already mixed the mixtures separately in their own containers. While this means more work and dishes, it also means a better end result, so it's worth doing what the recipe asks!"
        },
        {
            "headline": "Use a metallic spoon or a rubber spatula.",
            "description": "The thinness of either implement is important for making it easier to fold correctly."
        },
        {
            "headline": "Add the delicate mixture to the heavy mixture.",
            "description": "Never do this the other way around, so as to avoid the risk of overwhelming the delicate mixture, and potentially bursting air bubbles, or causing other overwhelming reactions."
        },
        {
            "headline": "Use the metallic spoon or spatula in a cutting action.",
            "description": "Cut down through the center of the two mixtures and bring the heavy mixture back up to the top. Baking 911 explains this as the: \"down-across-up-and-over motion\", which explains it well. Turn the bowl as you are doing this, to ensure that the folding is evenly distributed. Do not stir!"
        },
        {
            "headline": "Continue until both mixtures are adequately combined.",
            "description": "See \"Tips\" for avoiding over- or under-folding."
        }
    ],
    "tyn": [
        "Metallic spoon or rubber spatula",
        "Bowl"
    ],
    "text": " Follow the recipe's instructions properly. Folding usually occurs after you have already mixed the mixtures separately in their own containers. While this means more work and dishes, it also means a better end result, so it's worth doing what the recipe asks! Use a metallic spoon or a rubber spatula. The thinness of either implement is important for making it easier to fold correctly. Add the delicate mixture to the heavy mixture. Never do this the other way around, so as to avoid the risk of overwhelming the delicate mixture, and potentially bursting air bubbles, or causing other overwhelming reactions. Use the metallic spoon or spatula in a cutting action. Cut down through the center of the two mixtures and bring the heavy mixture back up to the top. Baking 911 explains this as the: \"down-across-up-and-over motion\", which explains it well. Turn the bowl as you are doing this, to ensure that the folding is evenly distributed. Do not stir! Continue until both mixtures are adequately combined. See \"Tips\" for avoiding over- or under-folding.",
    "sentences": [
        " Follow the recipe's instructions properly.",
        "Folding usually occurs after you have already mixed the mixtures separately in their own containers.",
        "While this means more work and dishes, it also means a better end result, so it's worth doing what the recipe asks!",
        "Use a metallic spoon or a rubber spatula.",
        "The thinness of either implement is important for making it easier to fold correctly.",
        "Add the delicate mixture to the heavy mixture.",
        "Never do this the other way around, so as to avoid the risk of overwhelming the delicate mixture, and potentially bursting air bubbles, or causing other overwhelming reactions.",
        "Use the metallic spoon or spatula in a cutting action.",
        "Cut down through the center of the two mixtures and bring the heavy mixture back up to the top.",
        "Baking 911 explains this as the: \"down-across-up-and-over motion\", which explains it well.",
        "Turn the bowl as you are doing this, to ensure that the folding is evenly distributed.",
        "Do not stir!",
        "Continue until both mixtures are adequately combined.",
        "See \"Tips\" for avoiding over- or under-folding."
    ]
}