{
    "title": "How to Clean Soft Ballet Slippers",
    "url": "https://www.wikihow.com/Clean-Soft-Ballet-Slippers",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Performing Arts",
        "Dancing",
        "Dance Equipment"
    ],
    "methods": [
        {
            "name": "Cleaning Leather Ballet Slippers",
            "steps": [
                {
                    "headline": "Spot clean with a damp cloth.",
                    "description": "If just a couple of spots on your leather shoes are looking dirty, dampen a soft cloth and rub them gently."
                },
                {
                    "headline": "Rub a drop of regular laundry detergent into the shoe for a deeper clean.",
                    "description": "Gently rub the detergent over the surface of the shoe with a cloth or a toothbrush, then wipe it clean with a soft, dry rag."
                },
                {
                    "headline": "Mix detergent or dish soap into a cup of water and apply it to your shoe.",
                    "description": "Put a few drops of detergent or dish soap in a bowl of warm water and mix it until it's sudsy. Wet a sponge in the solution and wash the surface of the shoe, then rinse the sponge out and wipe clean any residue. Dry the shoe with a soft towel."
                },
                {
                    "headline": "Use a window cleaning product to clean your shoe.",
                    "description": "Spritz some window spray onto a paper towel and rub it gently on the shoe. You can also use a melamine foam, such as a Mr. Clean Magic Eraser, in the same fashion, but avoid doing this too often as the cleaners can dry out the leather."
                },
                {
                    "headline": "Put on the shoes after cleaning them.",
                    "description": "The damp leather will mold to your foot for a good fit. Wear them for about half an hour, or until dry."
                },
                {
                    "headline": "Avoid using much water while cleaning your leather shoes.",
                    "description": "Water can dry leather out and make it brittle and cracked, so use as little as possible when cleaning your ballet shoes."
                }
            ]
        },
        {
            "name": "Washing Your Canvas Ballet Slippers",
            "steps": [
                {
                    "headline": "Place slippers in a small lingerie bag and load them into the washing machine.",
                    "description": "You can put them in a load of light, similarly-colored clothes, or by themselves. If you're not sure if any of your clothes have dyes that will wash out and stain your shoes, run the slippers through in their own, separate load. Wash your slippers on a cold, delicate cycle with mild detergent. Avoid using fabric softener or bleach."
                },
                {
                    "headline": "Lay them out to dry.",
                    "description": "Reshape the shoes and lay them on a towel or a drying rack to dry. Make sure they're not lying in direct sunlight. Do not run your slippers through the dryer, as this could cause them to shrink."
                },
                {
                    "headline": "To restore color, use foundation makeup or calamine lotion.",
                    "description": "Washing your canvas ballet shoes won't compromise the integrity of the shoe, but it might wash out the color a bit over time. If you see just a couple of faded spots on your shoes, apply a few of dabs of foundation or pink calamine lotion onto the spots with a cloth, cotton ball, or makeup sponge for a quick, pre-performance fix."
                }
            ]
        },
        {
            "name": "Cleaning Pointe Shoes",
            "steps": [
                {
                    "headline": "Mix dish detergent into water and apply it to your shoe.",
                    "description": "Use a small amount of water and dab it onto the shoe with a soft cloth or toothbrush. Wipe the shoe clean with a clean, slightly damp cloth for a general, all-over cleaning."
                },
                {
                    "headline": "Make a cleaning paste with baking soda and water to remove stains.",
                    "description": "Sprinkle some baking soda into a bit of water and stir until it forms a paste. Use a soft cloth or toothbrush to rub it onto the stain in a circular motion and let dry overnight. Wipe away any remaining residue the next morning with a clean cloth."
                },
                {
                    "headline": "Use calamine lotion to remove and cover up the stains.",
                    "description": "Dip a cotton ball into a bit of calamine lotion and pat all over the pointe shoes, especially on the stained or dirty areas. The lotion will absorb some of the bigger stains. As a bonus, the pink color of the calamine will lend your shoes a clean, consistent color tone."
                },
                {
                    "headline": "Avoid saturating the shoe.",
                    "description": "Use a very small amount of water while cleaning your pointe shoes. If over-saturated, the glue will break down and the shoe won't be able to support the foot en pointe."
                }
            ]
        }
    ],
    "tyn": [
        "Clean, soft cloth",
        "Mild laundry detergent",
        "Dish soap",
        "Sponge",
        "Window cleaning product",
        "Paper towel",
        "Mr. Clean Magic Eraser",
        "Small lingerie bag",
        "Washing machine",
        "Drying rack",
        "Makeup foundation",
        "Calamine lotion",
        "Baking soda",
        "Cotton ball",
        "Makeup sponge"
    ],
    "text": " Cleaning Leather Ballet Slippers Spot clean with a damp cloth. If just a couple of spots on your leather shoes are looking dirty, dampen a soft cloth and rub them gently. Rub a drop of regular laundry detergent into the shoe for a deeper clean. Gently rub the detergent over the surface of the shoe with a cloth or a toothbrush, then wipe it clean with a soft, dry rag. Mix detergent or dish soap into a cup of water and apply it to your shoe. Put a few drops of detergent or dish soap in a bowl of warm water and mix it until it's sudsy. Wet a sponge in the solution and wash the surface of the shoe, then rinse the sponge out and wipe clean any residue. Dry the shoe with a soft towel. Use a window cleaning product to clean your shoe. Spritz some window spray onto a paper towel and rub it gently on the shoe. You can also use a melamine foam, such as a Mr. Clean Magic Eraser, in the same fashion, but avoid doing this too often as the cleaners can dry out the leather. Put on the shoes after cleaning them. The damp leather will mold to your foot for a good fit. Wear them for about half an hour, or until dry. Avoid using much water while cleaning your leather shoes. Water can dry leather out and make it brittle and cracked, so use as little as possible when cleaning your ballet shoes. Washing Your Canvas Ballet Slippers Place slippers in a small lingerie bag and load them into the washing machine. You can put them in a load of light, similarly-colored clothes, or by themselves. If you're not sure if any of your clothes have dyes that will wash out and stain your shoes, run the slippers through in their own, separate load. Wash your slippers on a cold, delicate cycle with mild detergent. Avoid using fabric softener or bleach. Lay them out to dry. Reshape the shoes and lay them on a towel or a drying rack to dry. Make sure they're not lying in direct sunlight. Do not run your slippers through the dryer, as this could cause them to shrink. To restore color, use foundation makeup or calamine lotion. Washing your canvas ballet shoes won't compromise the integrity of the shoe, but it might wash out the color a bit over time. If you see just a couple of faded spots on your shoes, apply a few of dabs of foundation or pink calamine lotion onto the spots with a cloth, cotton ball, or makeup sponge for a quick, pre-performance fix. Cleaning Pointe Shoes Mix dish detergent into water and apply it to your shoe. Use a small amount of water and dab it onto the shoe with a soft cloth or toothbrush. Wipe the shoe clean with a clean, slightly damp cloth for a general, all-over cleaning. Make a cleaning paste with baking soda and water to remove stains. Sprinkle some baking soda into a bit of water and stir until it forms a paste. Use a soft cloth or toothbrush to rub it onto the stain in a circular motion and let dry overnight. Wipe away any remaining residue the next morning with a clean cloth. Use calamine lotion to remove and cover up the stains. Dip a cotton ball into a bit of calamine lotion and pat all over the pointe shoes, especially on the stained or dirty areas. The lotion will absorb some of the bigger stains. As a bonus, the pink color of the calamine will lend your shoes a clean, consistent color tone. Avoid saturating the shoe. Use a very small amount of water while cleaning your pointe shoes. If over-saturated, the glue will break down and the shoe won't be able to support the foot en pointe.",
    "sentences": [
        " Cleaning Leather Ballet Slippers Spot clean with a damp cloth.",
        "If just a couple of spots on your leather shoes are looking dirty, dampen a soft cloth and rub them gently.",
        "Rub a drop of regular laundry detergent into the shoe for a deeper clean.",
        "Gently rub the detergent over the surface of the shoe with a cloth or a toothbrush, then wipe it clean with a soft, dry rag.",
        "Mix detergent or dish soap into a cup of water and apply it to your shoe.",
        "Put a few drops of detergent or dish soap in a bowl of warm water and mix it until it's sudsy.",
        "Wet a sponge in the solution and wash the surface of the shoe, then rinse the sponge out and wipe clean any residue.",
        "Dry the shoe with a soft towel.",
        "Use a window cleaning product to clean your shoe.",
        "Spritz some window spray onto a paper towel and rub it gently on the shoe.",
        "You can also use a melamine foam, such as a Mr. Clean Magic Eraser, in the same fashion, but avoid doing this too often as the cleaners can dry out the leather.",
        "Put on the shoes after cleaning them.",
        "The damp leather will mold to your foot for a good fit.",
        "Wear them for about half an hour, or until dry.",
        "Avoid using much water while cleaning your leather shoes.",
        "Water can dry leather out and make it brittle and cracked, so use as little as possible when cleaning your ballet shoes.",
        "Washing Your Canvas Ballet Slippers Place slippers in a small lingerie bag and load them into the washing machine.",
        "You can put them in a load of light, similarly-colored clothes, or by themselves.",
        "If you're not sure if any of your clothes have dyes that will wash out and stain your shoes, run the slippers through in their own, separate load.",
        "Wash your slippers on a cold, delicate cycle with mild detergent.",
        "Avoid using fabric softener or bleach.",
        "Lay them out to dry.",
        "Reshape the shoes and lay them on a towel or a drying rack to dry.",
        "Make sure they're not lying in direct sunlight.",
        "Do not run your slippers through the dryer, as this could cause them to shrink.",
        "To restore color, use foundation makeup or calamine lotion.",
        "Washing your canvas ballet shoes won't compromise the integrity of the shoe, but it might wash out the color a bit over time.",
        "If you see just a couple of faded spots on your shoes, apply a few of dabs of foundation or pink calamine lotion onto the spots with a cloth, cotton ball, or makeup sponge for a quick, pre-performance fix.",
        "Cleaning Pointe Shoes Mix dish detergent into water and apply it to your shoe.",
        "Use a small amount of water and dab it onto the shoe with a soft cloth or toothbrush.",
        "Wipe the shoe clean with a clean, slightly damp cloth for a general, all-over cleaning.",
        "Make a cleaning paste with baking soda and water to remove stains.",
        "Sprinkle some baking soda into a bit of water and stir until it forms a paste.",
        "Use a soft cloth or toothbrush to rub it onto the stain in a circular motion and let dry overnight.",
        "Wipe away any remaining residue the next morning with a clean cloth.",
        "Use calamine lotion to remove and cover up the stains.",
        "Dip a cotton ball into a bit of calamine lotion and pat all over the pointe shoes, especially on the stained or dirty areas.",
        "The lotion will absorb some of the bigger stains.",
        "As a bonus, the pink color of the calamine will lend your shoes a clean, consistent color tone.",
        "Avoid saturating the shoe.",
        "Use a very small amount of water while cleaning your pointe shoes.",
        "If over-saturated, the glue will break down and the shoe won't be able to support the foot en pointe."
    ]
}