{
    "title": "How to Propagate Succulents (Without Rooting Hormone)",
    "url": "https://www.wikihow.com/Propagate-Succulents-(Without-Rooting-Hormone)",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Planting and Growing",
        "Growing Succulents and Cacti"
    ],
    "parts": [
        {
            "name": "Propagation and Preparing the Planting Container",
            "steps": [
                {
                    "headline": "Find a healthy succulent leaf.",
                    "description": "Make sure it is not mushy and half decomposed. Look under succulent plants for fallen leaves. Wiggle and pull one off a plant if there are none on the ground."
                },
                {
                    "headline": "Find a cardboard tray, eggshell carton, a container to temporary use until the succulent is ready to be transplanted.",
                    "description": "If using a container, the lid does not need to be used."
                },
                {
                    "headline": "Fill your planting container with soil.",
                    "description": "If the soil is already moist, add a little bit of water. If the soil is dry, make sure it is moist before planting."
                }
            ]
        },
        {
            "name": "Planting the Succulent (Indoors)",
            "steps": [
                {
                    "headline": "Place the succulent on top of the soil.",
                    "description": ""
                },
                {
                    "headline": "Spray the soil around the succulent and spray the end of the succulent that was torn off the plant.",
                    "description": "Rainwater or tap water is good for watering."
                },
                {
                    "headline": "Find a good, location out of the sun for the planting container.",
                    "description": "If the planting container is in a spot with some sunlight, that's ok; just make sure the sunlight isn't too strong or the propagated succulent could get sunburned and die."
                },
                {
                    "headline": "Spray the end of the succulent that was torn off every day.",
                    "description": "Spray the soil whenever it's dry."
                }
            ]
        },
        {
            "name": "Growing the Succulent",
            "steps": [
                {
                    "headline": "As soon as the succulent has grown roots, dig a shallow hole to fit the roots and plant the succulent.",
                    "description": "Succulents grow at their own pace, but some will root really quickly. The roots are pinkish and like to stick out in many directions."
                },
                {
                    "headline": "Don't act too soon.",
                    "description": "Sometimes succulents will grow a baby sprout before growing roots\nJust wait until roots appear to plant. If you get a baby sprout first, that means that you are watering it just right."
                },
                {
                    "headline": "Continue to water every day.",
                    "description": "Use the spray bottle to gently mist."
                }
            ]
        },
        {
            "name": "Care and Planting",
            "steps": [
                {
                    "headline": "If dead leaves appear, remove them to prevent mould.",
                    "description": "Eventually, the leaf that succulent grew from will die and fall off. Do not remove the lea; you can risk tearing off roots. Instead, wait for the leaf to fall off then remove."
                },
                {
                    "headline": "Make sure to water daily.",
                    "description": ""
                },
                {
                    "headline": "Look out for signs of transplant readiness.",
                    "description": "The succulent is ready to transplant when:\nThe \"mother leaf\" or leaf the succulent grew from has fallen off. When you gently move the succulent it stays secure in the ground. The succulent has an elongated stem with a baby sprout on top."
                },
                {
                    "headline": "Gently dig slightly under the succulent to avoid damaging roots.",
                    "description": "It's ok to accidentally break roots; the succulent will grow more roots to replace."
                },
                {
                    "headline": "Dig a hole deep enough to cover the entire stem underground and place the succulent in.",
                    "description": "Make sure the location is shady, for example under a succulent already growing. Cover the hole burying everything but still exposing the baby sprout."
                }
            ]
        }
    ],
    "tyn": [
        "Egg carton, cardboard tray, or plastic container",
        "Potting compost/soil",
        "Water sprayer"
    ],
    "text": " Propagation and Preparing the Planting Container Find a healthy succulent leaf. Make sure it is not mushy and half decomposed. Look under succulent plants for fallen leaves. Wiggle and pull one off a plant if there are none on the ground. Find a cardboard tray, eggshell carton, a container to temporary use until the succulent is ready to be transplanted. If using a container, the lid does not need to be used. Fill your planting container with soil. If the soil is already moist, add a little bit of water. If the soil is dry, make sure it is moist before planting. Planting the Succulent (Indoors) Place the succulent on top of the soil.  Spray the soil around the succulent and spray the end of the succulent that was torn off the plant. Rainwater or tap water is good for watering. Find a good, location out of the sun for the planting container. If the planting container is in a spot with some sunlight, that's ok; just make sure the sunlight isn't too strong or the propagated succulent could get sunburned and die. Spray the end of the succulent that was torn off every day. Spray the soil whenever it's dry. Growing the Succulent As soon as the succulent has grown roots, dig a shallow hole to fit the roots and plant the succulent. Succulents grow at their own pace, but some will root really quickly. The roots are pinkish and like to stick out in many directions. Don't act too soon. Sometimes succulents will grow a baby sprout before growing roots\nJust wait until roots appear to plant. If you get a baby sprout first, that means that you are watering it just right. Continue to water every day. Use the spray bottle to gently mist. Care and Planting If dead leaves appear, remove them to prevent mould. Eventually, the leaf that succulent grew from will die and fall off. Do not remove the lea; you can risk tearing off roots. Instead, wait for the leaf to fall off then remove. Make sure to water daily.  Look out for signs of transplant readiness. The succulent is ready to transplant when:\nThe \"mother leaf\" or leaf the succulent grew from has fallen off. When you gently move the succulent it stays secure in the ground. The succulent has an elongated stem with a baby sprout on top. Gently dig slightly under the succulent to avoid damaging roots. It's ok to accidentally break roots; the succulent will grow more roots to replace. Dig a hole deep enough to cover the entire stem underground and place the succulent in. Make sure the location is shady, for example under a succulent already growing. Cover the hole burying everything but still exposing the baby sprout.",
    "sentences": [
        " Propagation and Preparing the Planting Container Find a healthy succulent leaf.",
        "Make sure it is not mushy and half decomposed.",
        "Look under succulent plants for fallen leaves.",
        "Wiggle and pull one off a plant if there are none on the ground.",
        "Find a cardboard tray, eggshell carton, a container to temporary use until the succulent is ready to be transplanted.",
        "If using a container, the lid does not need to be used.",
        "Fill your planting container with soil.",
        "If the soil is already moist, add a little bit of water.",
        "If the soil is dry, make sure it is moist before planting.",
        "Planting the Succulent (Indoors) Place the succulent on top of the soil.",
        "Spray the soil around the succulent and spray the end of the succulent that was torn off the plant.",
        "Rainwater or tap water is good for watering.",
        "Find a good, location out of the sun for the planting container.",
        "If the planting container is in a spot with some sunlight, that's ok; just make sure the sunlight isn't too strong or the propagated succulent could get sunburned and die.",
        "Spray the end of the succulent that was torn off every day.",
        "Spray the soil whenever it's dry.",
        "Growing the Succulent As soon as the succulent has grown roots, dig a shallow hole to fit the roots and plant the succulent.",
        "Succulents grow at their own pace, but some will root really quickly.",
        "The roots are pinkish and like to stick out in many directions.",
        "Don't act too soon.",
        "Sometimes succulents will grow a baby sprout before growing roots\nJust wait until roots appear to plant.",
        "If you get a baby sprout first, that means that you are watering it just right.",
        "Continue to water every day.",
        "Use the spray bottle to gently mist.",
        "Care and Planting If dead leaves appear, remove them to prevent mould.",
        "Eventually, the leaf that succulent grew from will die and fall off.",
        "Do not remove the lea; you can risk tearing off roots.",
        "Instead, wait for the leaf to fall off then remove.",
        "Make sure to water daily.",
        "Look out for signs of transplant readiness.",
        "The succulent is ready to transplant when:\nThe \"mother leaf\" or leaf the succulent grew from has fallen off.",
        "When you gently move the succulent it stays secure in the ground.",
        "The succulent has an elongated stem with a baby sprout on top.",
        "Gently dig slightly under the succulent to avoid damaging roots.",
        "It's ok to accidentally break roots; the succulent will grow more roots to replace.",
        "Dig a hole deep enough to cover the entire stem underground and place the succulent in.",
        "Make sure the location is shady, for example under a succulent already growing.",
        "Cover the hole burying everything but still exposing the baby sprout."
    ]
}