{
    "title": "How to Make Fairy Doors",
    "url": "https://www.wikihow.com/Make-Fairy-Doors",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Craft for Kids",
        "Fairy and Fairy Tale Crafts"
    ],
    "methods": [
        {
            "name": "Craft Stick Doors",
            "steps": [
                {
                    "headline": "Use seven craft sticks for one whole door.",
                    "description": "Glue five of them together side by side."
                },
                {
                    "headline": "Glue one craft stick across the top of the door.",
                    "description": "Glue another one on the bottom. Cut off any excess. Glue these to what will be the back of the door, so that they won't be seen from the front. These cross bars strengthen the door and ensure that it stays held together."
                },
                {
                    "headline": "Allow the glue to dry completely before decorating.",
                    "description": ""
                },
                {
                    "headline": "Paint the craft stick door.",
                    "description": "You can use any color or a combination of colors. You could even paint a rainbow of colors. Allow to dry completely."
                },
                {
                    "headline": "Use a bead for the door knob.",
                    "description": "You could add a small bell too, for tinkling instead of knocking. Dollhouse miniature knockers can be purchased for adding to the door."
                },
                {
                    "headline": "Decorate.",
                    "description": "As preferred, use stickers, pens, flowers, glitter, etc., to make the door appear pretty and inviting."
                }
            ]
        },
        {
            "name": "Wooden Offcut Fairy Doors",
            "steps": [
                {
                    "headline": "Find a wooden offcut of around half an inch in thickness.",
                    "description": "It should be the height and width of the door that you would like."
                },
                {
                    "headline": "Draw an arch-type, round or rectangular shape for the door.",
                    "description": "Do this on paper first, to be sure that you've got the right shape, then transfer the design onto wood, using pencil. The door can be as small or as large as you want it to be. It can be miniature for a fairy's house or much bigger and wider for the base of a tree trunk. Round designs will be hardest to cut. Be sure that you or your helper can cut round shapes with wood first."
                },
                {
                    "headline": "Cut around the shape.",
                    "description": "This can be done with a fine saw, a jigsaw or some other cutting device suitable to wood. As already stated, if you cannot do this yourself, have someone else do it, following your pattern markings."
                },
                {
                    "headline": "Sketch the desired designs onto the door in pencil.",
                    "description": "You might have a window, a door knocker, some door hinges and decorative elements such as plants, butterflies, ladybugs, etc. You could also include a sign."
                },
                {
                    "headline": "Paint over the sketch lines in the colors of your choice.",
                    "description": "For a fancier look, you could glue on embellishments such as felt shapes, buttons, sequins or the like. A little glitter can help to prettify everything too"
                },
                {
                    "headline": "Allow the paint to dry.",
                    "description": "When it's dry, the fairy door is ready for use. It can be glued to a miniature house, leaned against something, propped up with pebbles at the base or tied around the base of a tree. If tying, such as at the base of a tree trunk, drill two little holes each side of the door for inserting string or yarn through and knotting in place once the string is looped around the tree or other object."
                }
            ]
        }
    ],
    "tyn": [
        "Craft stick doors",
        "7 craft sticks",
        "Paint",
        "Beads or small bells",
        "Stickers",
        "Pens",
        "Flowers",
        "Glitter",
        "Wooden offcut doors",
        "Wood offcuts",
        "Pencil",
        "Paper for template",
        "Jigsaw or similar for cutting shape",
        "Embellishments (as preferred)",
        "String or other form of support, depending on where it is placed"
    ],
    "text": " Craft Stick Doors Use seven craft sticks for one whole door. Glue five of them together side by side. Glue one craft stick across the top of the door. Glue another one on the bottom. Cut off any excess. Glue these to what will be the back of the door, so that they won't be seen from the front. These cross bars strengthen the door and ensure that it stays held together. Allow the glue to dry completely before decorating.  Paint the craft stick door. You can use any color or a combination of colors. You could even paint a rainbow of colors. Allow to dry completely. Use a bead for the door knob. You could add a small bell too, for tinkling instead of knocking. Dollhouse miniature knockers can be purchased for adding to the door. Decorate. As preferred, use stickers, pens, flowers, glitter, etc., to make the door appear pretty and inviting. Wooden Offcut Fairy Doors Find a wooden offcut of around half an inch in thickness. It should be the height and width of the door that you would like. Draw an arch-type, round or rectangular shape for the door. Do this on paper first, to be sure that you've got the right shape, then transfer the design onto wood, using pencil. The door can be as small or as large as you want it to be. It can be miniature for a fairy's house or much bigger and wider for the base of a tree trunk. Round designs will be hardest to cut. Be sure that you or your helper can cut round shapes with wood first. Cut around the shape. This can be done with a fine saw, a jigsaw or some other cutting device suitable to wood. As already stated, if you cannot do this yourself, have someone else do it, following your pattern markings. Sketch the desired designs onto the door in pencil. You might have a window, a door knocker, some door hinges and decorative elements such as plants, butterflies, ladybugs, etc. You could also include a sign. Paint over the sketch lines in the colors of your choice. For a fancier look, you could glue on embellishments such as felt shapes, buttons, sequins or the like. A little glitter can help to prettify everything too Allow the paint to dry. When it's dry, the fairy door is ready for use. It can be glued to a miniature house, leaned against something, propped up with pebbles at the base or tied around the base of a tree. If tying, such as at the base of a tree trunk, drill two little holes each side of the door for inserting string or yarn through and knotting in place once the string is looped around the tree or other object.",
    "sentences": [
        " Craft Stick Doors Use seven craft sticks for one whole door.",
        "Glue five of them together side by side.",
        "Glue one craft stick across the top of the door.",
        "Glue another one on the bottom.",
        "Cut off any excess.",
        "Glue these to what will be the back of the door, so that they won't be seen from the front.",
        "These cross bars strengthen the door and ensure that it stays held together.",
        "Allow the glue to dry completely before decorating.",
        "Paint the craft stick door.",
        "You can use any color or a combination of colors.",
        "You could even paint a rainbow of colors.",
        "Allow to dry completely.",
        "Use a bead for the door knob.",
        "You could add a small bell too, for tinkling instead of knocking.",
        "Dollhouse miniature knockers can be purchased for adding to the door.",
        "Decorate.",
        "As preferred, use stickers, pens, flowers, glitter, etc., to make the door appear pretty and inviting.",
        "Wooden Offcut Fairy Doors Find a wooden offcut of around half an inch in thickness.",
        "It should be the height and width of the door that you would like.",
        "Draw an arch-type, round or rectangular shape for the door.",
        "Do this on paper first, to be sure that you've got the right shape, then transfer the design onto wood, using pencil.",
        "The door can be as small or as large as you want it to be.",
        "It can be miniature for a fairy's house or much bigger and wider for the base of a tree trunk.",
        "Round designs will be hardest to cut.",
        "Be sure that you or your helper can cut round shapes with wood first.",
        "Cut around the shape.",
        "This can be done with a fine saw, a jigsaw or some other cutting device suitable to wood.",
        "As already stated, if you cannot do this yourself, have someone else do it, following your pattern markings.",
        "Sketch the desired designs onto the door in pencil.",
        "You might have a window, a door knocker, some door hinges and decorative elements such as plants, butterflies, ladybugs, etc.",
        "You could also include a sign.",
        "Paint over the sketch lines in the colors of your choice.",
        "For a fancier look, you could glue on embellishments such as felt shapes, buttons, sequins or the like.",
        "A little glitter can help to prettify everything too Allow the paint to dry.",
        "When it's dry, the fairy door is ready for use.",
        "It can be glued to a miniature house, leaned against something, propped up with pebbles at the base or tied around the base of a tree.",
        "If tying, such as at the base of a tree trunk, drill two little holes each side of the door for inserting string or yarn through and knotting in place once the string is looped around the tree or other object."
    ]
}