{
    "title": "How to Get Rid of Boredom",
    "url": "https://www.wikihow.com/Get-Rid-of-Boredom",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Fun Activities",
        "Boredom Busters",
        "Coping with Boredom"
    ],
    "steps": [
        {
            "headline": "Find something to do.",
            "description": "Think of things that you like to do. Once you find something, you're good to go! If not, continue."
        },
        {
            "headline": "Make a list of things to do when you're bored.",
            "description": "These things will occupy you and help you the next time when you are bored. For example, think of things such as, could I clean the house or my bedroom? Could I learn a new language? Or perhaps you could find some friends to spend time together."
        },
        {
            "headline": "Play board games.",
            "description": "Don't just think Monopoly, Clue or Snakes and Ladders. Try German-style board games like Agricola, Carcassonne, Puerto Rico or Settlers of Catan."
        },
        {
            "headline": "Play mental games like Pente, Blokus, Chess, and Quoridor.",
            "description": ""
        },
        {
            "headline": "Play card games like Bohnanza, Tichu or Pit.",
            "description": ""
        },
        {
            "headline": "Once you are done, try step one.",
            "description": "If that fails again, do one of the things on your list."
        },
        {
            "headline": "Go to bed, have some rest for about 5 or 10 minutes if the previous steps didn't work.",
            "description": ""
        },
        {
            "headline": "Open your clothes box and find the nicest clothes you like to wear and feel comfortable wearing them.",
            "description": ""
        },
        {
            "headline": "Have a shower with cold water or warm water, but it`s better to be cold.",
            "description": ""
        },
        {
            "headline": "Make a cup of coffee or tea, as you like.",
            "description": ""
        },
        {
            "headline": "Go out in the open air.",
            "description": ""
        },
        {
            "headline": "Call a group of your best friends and ask them for a picnic or the club or cinema.",
            "description": ""
        },
        {
            "headline": "Buy a present for your mom or some one you love.",
            "description": ""
        },
        {
            "headline": "Clean your closet if it is messy.",
            "description": ""
        },
        {
            "headline": "Play games from BINGO to patty-cake as long as it is something that lasts.",
            "description": ""
        },
        {
            "headline": "Do something that is relaxing like sleeping.",
            "description": ""
        },
        {
            "headline": "Find something entertaining to do; watch TV or online videos.",
            "description": ""
        },
        {
            "headline": "Invite people over you are never bored when people are there.",
            "description": ""
        }
    ],
    "tyn": [
        "Paper",
        "Pencil"
    ],
    "text": " Find something to do. Think of things that you like to do. Once you find something, you're good to go! If not, continue. Make a list of things to do when you're bored. These things will occupy you and help you the next time when you are bored. For example, think of things such as, could I clean the house or my bedroom? Could I learn a new language? Or perhaps you could find some friends to spend time together. Play board games. Don't just think Monopoly, Clue or Snakes and Ladders. Try German-style board games like Agricola, Carcassonne, Puerto Rico or Settlers of Catan. Play mental games like Pente, Blokus, Chess, and Quoridor.  Play card games like Bohnanza, Tichu or Pit.  Once you are done, try step one. If that fails again, do one of the things on your list. Go to bed, have some rest for about 5 or 10 minutes if the previous steps didn't work.  Open your clothes box and find the nicest clothes you like to wear and feel comfortable wearing them.  Have a shower with cold water or warm water, but it`s better to be cold.  Make a cup of coffee or tea, as you like.  Go out in the open air.  Call a group of your best friends and ask them for a picnic or the club or cinema.  Buy a present for your mom or some one you love.  Clean your closet if it is messy.  Play games from BINGO to patty-cake as long as it is something that lasts.  Do something that is relaxing like sleeping.  Find something entertaining to do; watch TV or online videos.  Invite people over you are never bored when people are there. ",
    "sentences": [
        " Find something to do.",
        "Think of things that you like to do.",
        "Once you find something, you're good to go!",
        "If not, continue.",
        "Make a list of things to do when you're bored.",
        "These things will occupy you and help you the next time when you are bored.",
        "For example, think of things such as, could I clean the house or my bedroom?",
        "Could I learn a new language?",
        "Or perhaps you could find some friends to spend time together.",
        "Play board games.",
        "Don't just think Monopoly, Clue or Snakes and Ladders.",
        "Try German-style board games like Agricola, Carcassonne, Puerto Rico or Settlers of Catan.",
        "Play mental games like Pente, Blokus, Chess, and Quoridor.",
        "Play card games like Bohnanza, Tichu or Pit.",
        "Once you are done, try step one.",
        "If that fails again, do one of the things on your list.",
        "Go to bed, have some rest for about 5 or 10 minutes if the previous steps didn't work.",
        "Open your clothes box and find the nicest clothes you like to wear and feel comfortable wearing them.",
        "Have a shower with cold water or warm water, but it`s better to be cold.",
        "Make a cup of coffee or tea, as you like.",
        "Go out in the open air.",
        "Call a group of your best friends and ask them for a picnic or the club or cinema.",
        "Buy a present for your mom or some one you love.",
        "Clean your closet if it is messy.",
        "Play games from BINGO to patty-cake as long as it is something that lasts.",
        "Do something that is relaxing like sleeping.",
        "Find something entertaining to do; watch TV or online videos.",
        "Invite people over you are never bored when people are there."
    ]
}