{
    "title": "How to Cook Baby Carrots",
    "url": "https://www.wikihow.com/Cook-Baby-Carrots",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables"
    ],
    "methods": [
        {
            "name": "Boiling the Carrots",
            "steps": [
                {
                    "headline": "Rinse off your carrots in the sink.",
                    "description": "Use a colander if you would like, but just make sure there isn’t any debris anywhere on the carrots before placing them in the pot you’re boiling them in. Use a clean scrubbing tool to remove anything stuck on a carrot that won’t rinse off, or peel it away with a knife or vegetable peeler. Around 8-12 baby carrots will be a single serving."
                },
                {
                    "headline": "Boil water in a pot.",
                    "description": "Fill a pot with water and start heating it on the stove. Use just enough water to cover the carrots you’ll be cooking, and bring it to a rolling boil. You’ll know it’s reached a rolling boil when bubbles are forming at the water’s surface."
                },
                {
                    "headline": "Add the carrots to the pot and cook for 5-10 minutes.",
                    "description": "Keep them in the water until they’re fully cooked through, while retaining an al dente firmness. Boil thinner carrots for closer to 5 minutes, and thicker ones for 10 minutes or longer. So you won’t overcook your carrots, set a timer for the shorter end of how long you intend to cook them. At that time, grab one out of the pot with a fork and taste it to see if it’s cooked enough for you. If not, continue to let them boil."
                },
                {
                    "headline": "Plate your carrots and add your favorite seasonings and toppings.",
                    "description": "Strain your carrots from the water they were boiled in, and place them on a dish where you can add other ingredients such as salt, pepper, crushed red pepper, olive oil, freshly squeezed lime, or whatever else you prefer. You can also leave them completely plain! This is a nice method to prepare lots of pre-cooked carrots to use later in other dishes. Cool leftovers down to room temperature before placing them in an airtight container with a lid. Keep the container in the fridge, and eat the leftovers within a few days of cooking them."
                }
            ]
        },
        {
            "name": "Sautéing the Carrots",
            "steps": [
                {
                    "headline": "Wash your carrots before putting them in the pot.",
                    "description": "Thoroughly rinse your carrots in the sink before cooking with them. Make sure they’re clean of anything that was on them, such as dirt or packaging materials."
                },
                {
                    "headline": "Parboil 1 pound (0.45 kg) of carrots for 5 minutes.",
                    "description": "Parboiling is partially cooking a food by boiling it first to prepare it to be cooked another way. In this case, you’ll be parboiling the carrots to make them firmer, and thus easier to sear in the pan when you go to sauté them. After the water has reached a rolling boil, toss in the carrots, and boil them as you normally would. As they cook, make sure their texture remains even crisper than an al dente bite. When they’re done, strain the carrots from the water, but leave them in the pot until they’re ready to be added to the pan for sautéing. Make sure the carrots are completely submerged in the water when you’re boiling them. Don’t start the timer until bubbles are rolling at the surface of the water. 1 pound (0.45 kg) of carrots will serve 2-3 people."
                },
                {
                    "headline": "Chop up green onions or shallots to sauté with the carrots.",
                    "description": "While you’re letting the carrots parboil, on a cutting board, cut up either 1 bunch (6-8 stems) of long green onions, or 2 shallots to cook with the carrots. Cut them into small enough pieces so they will quickly sauté and caramelize in the pan. Some other vegetables you could add are chopped broccoli or cauliflower, green beans, or bell pepper. They do not have to be parboiled beforehand. Use enough in proportion to the onions or shallots."
                },
                {
                    "headline": "Sauté the onions or shallots in a pan with oil and butter for 2 minutes.",
                    "description": "In a small frying pan start cooking the onions you chopped up. Turn the vegetables around often with a spoon or spatula, or shift them around with the entire pan if you’re practiced. Cook them this way for a full 2 minutes before adding the carrots. Use 2 tablespoons (30 mL) of butter, and 1 tablespoon (15 mL) of the oil to cook with."
                },
                {
                    "headline": "Add the carrots to the pan and continue to sauté for 2 more minutes.",
                    "description": "Keep turning the vegetables with the spoon or spatula so everything cooks evenly. Try to coat all the vegetables in the oil and butter. Stir for a bit before letting the vegetables sear in place a little. Keep repeating for 2 minutes."
                },
                {
                    "headline": "Add ⁄8 cup (30 mL) of brown sugar to the pan and cook for 1 more minute.",
                    "description": "After cooking the carrots for 2 minutes, go ahead and add the brown sugar. Continue to keep moving the vegetables around to make sure it gets on them all to have them be caramelized. Be careful to not cook longer than a minute, or you could risk burning the brown sugar, ruining the carrots. Turn the heat on your stove off after the 1 minute passes, and move the pan to a different part of the stove, or off it, to keep the vegetables from continuing to cook in the still hot pan."
                },
                {
                    "headline": "Sprinkle ⁄4 cup (59 mL) of chopped parsley over the sautéed vegetables.",
                    "description": "Chop up the parsley into small pieces. Once they’re fully cooked, place the vegetables on your serving plate, and while everything’s still hot, add the parsley on top to mix in its flavor. Distribute the parsley evenly onto the vegetables, so no part has too much or too little. Store leftovers in the fridge in a plastic container with a lid."
                }
            ]
        },
        {
            "name": "Roasting the Carrots",
            "steps": [
                {
                    "headline": "Clean off your carrots before roasting them.",
                    "description": "Before placing them on the baking sheet you’ll be cooking them on, wash off any dirt or other residue on the carrots’ surface you wouldn’t want to eat."
                },
                {
                    "headline": "Preheat your oven to 400 °F (204 °C).",
                    "description": "You’ll be cooking your baby carrots and any other vegetables you’d like to roast alongside them at this temperature. While it’s heating up, use the time to prepare the vegetables to be cooked. If you do choose to roast other vegetables with the carrots, some good choices are sliced red onion, potatoes, or brussels sprouts, as they’ll all cook around the same length of time at this temperature. To prepare the vegetables, first rinse everything off as you did the carrots. Slice the onions and potatoes into thick wedge pieces, and halve or quarter the brussels sprouts to your liking."
                },
                {
                    "headline": "Line a roasting pan with aluminum foil to crisp the vegetables.",
                    "description": "Use enough to cover the whole length of the pan. You may need to use more than one sheet to completely cover it. Spray some cooking spray on the aluminum foil to avoid the vegetables sticking to it while they cook."
                },
                {
                    "headline": "Spread the carrots and other vegetables evenly around the pan.",
                    "description": "Line the carrots up side by side, and place all the other vegetables around them. Make sure none of the vegetables are completely covering another, or it could prevent them from cooking through all the way. Add on 2 crushed garlic cloves and, and sprinkle 1 tablespoon (14.3 g) of chopped rosemary on everything for additional flavor. The 1.5 pounds (0.68 kg) of carrots and other veggies will serve 4 people."
                },
                {
                    "headline": "Drizzle the carrots in olive oil, and sprinkle salt and pepper on them.",
                    "description": "Get a nice even coating of the olive oil on most of the carrots and other vegetables if you can, tossing them around so that everything is evenly distributed. Once they’re all oiled, go ahead and shake on the salt and pepper so they’ll stick to the veggies. Remember to shake up the vegetables halfway through adding the salt and pepper to cover all sides of them when you add the second half."
                },
                {
                    "headline": "Put them in the oven for 30 to 40 minutes.",
                    "description": "This should allow ample time for the carrots to brown and get crispy in all the right places, while caramelizing them around the edges. Keep an eye on them to make sure they don’t overcook. Check every few minutes to see if they’re done after they’ve been in for 30 minutes. Prod the carrots with a utensil, and if there’s some give to their surface because it has softened up, the carrots are done."
                },
                {
                    "headline": "Remove the vegetables from the oven when they’re done cooking.",
                    "description": "Use oven mitts when taking the pan out of the oven, and set it down before moving the vegetables off it. Transfer them to a serving dish to let them cool a bit before you chow down. Place leftovers in the fridge in a plastic container with a lid."
                }
            ]
        },
        {
            "name": "Steaming the Carrots in the Microwave",
            "steps": [
                {
                    "headline": "Cleanse your carrots before steaming them.",
                    "description": "Run the carrots under some water to make sure they’re free of any dirt or remaining debris on their surfaces."
                },
                {
                    "headline": "Layer the bottom of a microwave safe dish with the baby carrots.",
                    "description": "Overlaying the carrots on top of each other will prevent the ones on top from being properly steamed, so just use one layer at a time to cook. Make sure the dish you’re cooking the carrots in has sides that come up above them. Using 1.5 pounds (0.68 kg) of carrots will serve 3-4 people."
                },
                {
                    "headline": "Fill the dish with water so the bottom 1/8 of the carrots are covered.",
                    "description": "Eyeball just enough water to pour in so your carrots are sitting in a shallow amount that will cook them when it’s heated up. Use less water if you’re unsure how much to use, as too much won’t steam the carrots. You can always add more later if you notice your carrots aren’t softening up because there isn’t enough water for them be steamed."
                },
                {
                    "headline": "Cover the dish with cling wrap and microwave for 2 full minutes.",
                    "description": "Put them in on the highest setting your microwave has. After the 2 minutes are up, take them out of the microwave and flip the carrots over. Put the cling wrap back on the dish, and place it back into the microwave to keep cooking. Use oven mitts when taking the dish out of the microwave."
                },
                {
                    "headline": "Microwave the carrots in 1-minute intervals until they’re done.",
                    "description": "After each minute cooking, if the carrots aren’t done, flip them over again, put the cling wrap back on the dish, and place them back in the microwave. Continue this until they’ve reached the desired texture you want. If you can easily pierce the carrot with a fork, it’s cooked through and tender enough to eat. You can put leftovers in the fridge in a plastic container with a lid."
                }
            ]
        }
    ],
    "tyn": [
        "Carrots",
        "A colander",
        "A pot for boiling",
        "A pan for sautéing",
        "A baking sheet",
        "A microwave safe dish with tall sides",
        "Cling wrap",
        "Aluminum foil",
        "A spatula or wooden spoon",
        "A stove",
        "A microwave",
        "Green onions or shallots",
        "Olive oil",
        "Butter",
        "Salt",
        "Pepper",
        "Lime juice",
        "Brown sugar",
        "Red pepper flakes",
        "Parsley"
    ],
    "text": " Boiling the Carrots Rinse off your carrots in the sink. Use a colander if you would like, but just make sure there isn’t any debris anywhere on the carrots before placing them in the pot you’re boiling them in. Use a clean scrubbing tool to remove anything stuck on a carrot that won’t rinse off, or peel it away with a knife or vegetable peeler. Around 8-12 baby carrots will be a single serving. Boil water in a pot. Fill a pot with water and start heating it on the stove. Use just enough water to cover the carrots you’ll be cooking, and bring it to a rolling boil. You’ll know it’s reached a rolling boil when bubbles are forming at the water’s surface. Add the carrots to the pot and cook for 5-10 minutes. Keep them in the water until they’re fully cooked through, while retaining an al dente firmness. Boil thinner carrots for closer to 5 minutes, and thicker ones for 10 minutes or longer. So you won’t overcook your carrots, set a timer for the shorter end of how long you intend to cook them. At that time, grab one out of the pot with a fork and taste it to see if it’s cooked enough for you. If not, continue to let them boil. Plate your carrots and add your favorite seasonings and toppings. Strain your carrots from the water they were boiled in, and place them on a dish where you can add other ingredients such as salt, pepper, crushed red pepper, olive oil, freshly squeezed lime, or whatever else you prefer. You can also leave them completely plain! This is a nice method to prepare lots of pre-cooked carrots to use later in other dishes. Cool leftovers down to room temperature before placing them in an airtight container with a lid. Keep the container in the fridge, and eat the leftovers within a few days of cooking them. Sautéing the Carrots Wash your carrots before putting them in the pot. Thoroughly rinse your carrots in the sink before cooking with them. Make sure they’re clean of anything that was on them, such as dirt or packaging materials. Parboil 1 pound (0.45 kg) of carrots for 5 minutes. Parboiling is partially cooking a food by boiling it first to prepare it to be cooked another way. In this case, you’ll be parboiling the carrots to make them firmer, and thus easier to sear in the pan when you go to sauté them. After the water has reached a rolling boil, toss in the carrots, and boil them as you normally would. As they cook, make sure their texture remains even crisper than an al dente bite. When they’re done, strain the carrots from the water, but leave them in the pot until they’re ready to be added to the pan for sautéing. Make sure the carrots are completely submerged in the water when you’re boiling them. Don’t start the timer until bubbles are rolling at the surface of the water. 1 pound (0.45 kg) of carrots will serve 2-3 people. Chop up green onions or shallots to sauté with the carrots. While you’re letting the carrots parboil, on a cutting board, cut up either 1 bunch (6-8 stems) of long green onions, or 2 shallots to cook with the carrots. Cut them into small enough pieces so they will quickly sauté and caramelize in the pan. Some other vegetables you could add are chopped broccoli or cauliflower, green beans, or bell pepper. They do not have to be parboiled beforehand. Use enough in proportion to the onions or shallots. Sauté the onions or shallots in a pan with oil and butter for 2 minutes. In a small frying pan start cooking the onions you chopped up. Turn the vegetables around often with a spoon or spatula, or shift them around with the entire pan if you’re practiced. Cook them this way for a full 2 minutes before adding the carrots. Use 2 tablespoons (30 mL) of butter, and 1 tablespoon (15 mL) of the oil to cook with. Add the carrots to the pan and continue to sauté for 2 more minutes. Keep turning the vegetables with the spoon or spatula so everything cooks evenly. Try to coat all the vegetables in the oil and butter. Stir for a bit before letting the vegetables sear in place a little. Keep repeating for 2 minutes. Add ⁄8 cup (30 mL) of brown sugar to the pan and cook for 1 more minute. After cooking the carrots for 2 minutes, go ahead and add the brown sugar. Continue to keep moving the vegetables around to make sure it gets on them all to have them be caramelized. Be careful to not cook longer than a minute, or you could risk burning the brown sugar, ruining the carrots. Turn the heat on your stove off after the 1 minute passes, and move the pan to a different part of the stove, or off it, to keep the vegetables from continuing to cook in the still hot pan. Sprinkle ⁄4 cup (59 mL) of chopped parsley over the sautéed vegetables. Chop up the parsley into small pieces. Once they’re fully cooked, place the vegetables on your serving plate, and while everything’s still hot, add the parsley on top to mix in its flavor. Distribute the parsley evenly onto the vegetables, so no part has too much or too little. Store leftovers in the fridge in a plastic container with a lid. Roasting the Carrots Clean off your carrots before roasting them. Before placing them on the baking sheet you’ll be cooking them on, wash off any dirt or other residue on the carrots’ surface you wouldn’t want to eat. Preheat your oven to 400 °F (204 °C). You’ll be cooking your baby carrots and any other vegetables you’d like to roast alongside them at this temperature. While it’s heating up, use the time to prepare the vegetables to be cooked. If you do choose to roast other vegetables with the carrots, some good choices are sliced red onion, potatoes, or brussels sprouts, as they’ll all cook around the same length of time at this temperature. To prepare the vegetables, first rinse everything off as you did the carrots. Slice the onions and potatoes into thick wedge pieces, and halve or quarter the brussels sprouts to your liking. Line a roasting pan with aluminum foil to crisp the vegetables. Use enough to cover the whole length of the pan. You may need to use more than one sheet to completely cover it. Spray some cooking spray on the aluminum foil to avoid the vegetables sticking to it while they cook. Spread the carrots and other vegetables evenly around the pan. Line the carrots up side by side, and place all the other vegetables around them. Make sure none of the vegetables are completely covering another, or it could prevent them from cooking through all the way. Add on 2 crushed garlic cloves and, and sprinkle 1 tablespoon (14.3 g) of chopped rosemary on everything for additional flavor. The 1.5 pounds (0.68 kg) of carrots and other veggies will serve 4 people. Drizzle the carrots in olive oil, and sprinkle salt and pepper on them. Get a nice even coating of the olive oil on most of the carrots and other vegetables if you can, tossing them around so that everything is evenly distributed. Once they’re all oiled, go ahead and shake on the salt and pepper so they’ll stick to the veggies. Remember to shake up the vegetables halfway through adding the salt and pepper to cover all sides of them when you add the second half. Put them in the oven for 30 to 40 minutes. This should allow ample time for the carrots to brown and get crispy in all the right places, while caramelizing them around the edges. Keep an eye on them to make sure they don’t overcook. Check every few minutes to see if they’re done after they’ve been in for 30 minutes. Prod the carrots with a utensil, and if there’s some give to their surface because it has softened up, the carrots are done. Remove the vegetables from the oven when they’re done cooking. Use oven mitts when taking the pan out of the oven, and set it down before moving the vegetables off it. Transfer them to a serving dish to let them cool a bit before you chow down. Place leftovers in the fridge in a plastic container with a lid. Steaming the Carrots in the Microwave Cleanse your carrots before steaming them. Run the carrots under some water to make sure they’re free of any dirt or remaining debris on their surfaces. Layer the bottom of a microwave safe dish with the baby carrots. Overlaying the carrots on top of each other will prevent the ones on top from being properly steamed, so just use one layer at a time to cook. Make sure the dish you’re cooking the carrots in has sides that come up above them. Using 1.5 pounds (0.68 kg) of carrots will serve 3-4 people. Fill the dish with water so the bottom 1/8 of the carrots are covered. Eyeball just enough water to pour in so your carrots are sitting in a shallow amount that will cook them when it’s heated up. Use less water if you’re unsure how much to use, as too much won’t steam the carrots. You can always add more later if you notice your carrots aren’t softening up because there isn’t enough water for them be steamed. Cover the dish with cling wrap and microwave for 2 full minutes. Put them in on the highest setting your microwave has. After the 2 minutes are up, take them out of the microwave and flip the carrots over. Put the cling wrap back on the dish, and place it back into the microwave to keep cooking. Use oven mitts when taking the dish out of the microwave. Microwave the carrots in 1-minute intervals until they’re done. After each minute cooking, if the carrots aren’t done, flip them over again, put the cling wrap back on the dish, and place them back in the microwave. Continue this until they’ve reached the desired texture you want. If you can easily pierce the carrot with a fork, it’s cooked through and tender enough to eat. You can put leftovers in the fridge in a plastic container with a lid.",
    "sentences": [
        " Boiling the Carrots Rinse off your carrots in the sink.",
        "Use a colander if you would like, but just make sure there isn’t any debris anywhere on the carrots before placing them in the pot you’re boiling them in.",
        "Use a clean scrubbing tool to remove anything stuck on a carrot that won’t rinse off, or peel it away with a knife or vegetable peeler.",
        "Around 8-12 baby carrots will be a single serving.",
        "Boil water in a pot.",
        "Fill a pot with water and start heating it on the stove.",
        "Use just enough water to cover the carrots you’ll be cooking, and bring it to a rolling boil.",
        "You’ll know it’s reached a rolling boil when bubbles are forming at the water’s surface.",
        "Add the carrots to the pot and cook for 5-10 minutes.",
        "Keep them in the water until they’re fully cooked through, while retaining an al dente firmness.",
        "Boil thinner carrots for closer to 5 minutes, and thicker ones for 10 minutes or longer.",
        "So you won’t overcook your carrots, set a timer for the shorter end of how long you intend to cook them.",
        "At that time, grab one out of the pot with a fork and taste it to see if it’s cooked enough for you.",
        "If not, continue to let them boil.",
        "Plate your carrots and add your favorite seasonings and toppings.",
        "Strain your carrots from the water they were boiled in, and place them on a dish where you can add other ingredients such as salt, pepper, crushed red pepper, olive oil, freshly squeezed lime, or whatever else you prefer.",
        "You can also leave them completely plain!",
        "This is a nice method to prepare lots of pre-cooked carrots to use later in other dishes.",
        "Cool leftovers down to room temperature before placing them in an airtight container with a lid.",
        "Keep the container in the fridge, and eat the leftovers within a few days of cooking them.",
        "Sautéing the Carrots Wash your carrots before putting them in the pot.",
        "Thoroughly rinse your carrots in the sink before cooking with them.",
        "Make sure they’re clean of anything that was on them, such as dirt or packaging materials.",
        "Parboil 1 pound (0.45 kg) of carrots for 5 minutes.",
        "Parboiling is partially cooking a food by boiling it first to prepare it to be cooked another way.",
        "In this case, you’ll be parboiling the carrots to make them firmer, and thus easier to sear in the pan when you go to sauté them.",
        "After the water has reached a rolling boil, toss in the carrots, and boil them as you normally would.",
        "As they cook, make sure their texture remains even crisper than an al dente bite.",
        "When they’re done, strain the carrots from the water, but leave them in the pot until they’re ready to be added to the pan for sautéing.",
        "Make sure the carrots are completely submerged in the water when you’re boiling them.",
        "Don’t start the timer until bubbles are rolling at the surface of the water.",
        "1 pound (0.45 kg) of carrots will serve 2-3 people.",
        "Chop up green onions or shallots to sauté with the carrots.",
        "While you’re letting the carrots parboil, on a cutting board, cut up either 1 bunch (6-8 stems) of long green onions, or 2 shallots to cook with the carrots.",
        "Cut them into small enough pieces so they will quickly sauté and caramelize in the pan.",
        "Some other vegetables you could add are chopped broccoli or cauliflower, green beans, or bell pepper.",
        "They do not have to be parboiled beforehand.",
        "Use enough in proportion to the onions or shallots.",
        "Sauté the onions or shallots in a pan with oil and butter for 2 minutes.",
        "In a small frying pan start cooking the onions you chopped up.",
        "Turn the vegetables around often with a spoon or spatula, or shift them around with the entire pan if you’re practiced.",
        "Cook them this way for a full 2 minutes before adding the carrots.",
        "Use 2 tablespoons (30 mL) of butter, and 1 tablespoon (15 mL) of the oil to cook with.",
        "Add the carrots to the pan and continue to sauté for 2 more minutes.",
        "Keep turning the vegetables with the spoon or spatula so everything cooks evenly.",
        "Try to coat all the vegetables in the oil and butter.",
        "Stir for a bit before letting the vegetables sear in place a little.",
        "Keep repeating for 2 minutes.",
        "Add ⁄8 cup (30 mL) of brown sugar to the pan and cook for 1 more minute.",
        "After cooking the carrots for 2 minutes, go ahead and add the brown sugar.",
        "Continue to keep moving the vegetables around to make sure it gets on them all to have them be caramelized.",
        "Be careful to not cook longer than a minute, or you could risk burning the brown sugar, ruining the carrots.",
        "Turn the heat on your stove off after the 1 minute passes, and move the pan to a different part of the stove, or off it, to keep the vegetables from continuing to cook in the still hot pan.",
        "Sprinkle ⁄4 cup (59 mL) of chopped parsley over the sautéed vegetables.",
        "Chop up the parsley into small pieces.",
        "Once they’re fully cooked, place the vegetables on your serving plate, and while everything’s still hot, add the parsley on top to mix in its flavor.",
        "Distribute the parsley evenly onto the vegetables, so no part has too much or too little.",
        "Store leftovers in the fridge in a plastic container with a lid.",
        "Roasting the Carrots Clean off your carrots before roasting them.",
        "Before placing them on the baking sheet you’ll be cooking them on, wash off any dirt or other residue on the carrots’ surface you wouldn’t want to eat.",
        "Preheat your oven to 400 °F (204 °C).",
        "You’ll be cooking your baby carrots and any other vegetables you’d like to roast alongside them at this temperature.",
        "While it’s heating up, use the time to prepare the vegetables to be cooked.",
        "If you do choose to roast other vegetables with the carrots, some good choices are sliced red onion, potatoes, or brussels sprouts, as they’ll all cook around the same length of time at this temperature.",
        "To prepare the vegetables, first rinse everything off as you did the carrots.",
        "Slice the onions and potatoes into thick wedge pieces, and halve or quarter the brussels sprouts to your liking.",
        "Line a roasting pan with aluminum foil to crisp the vegetables.",
        "Use enough to cover the whole length of the pan.",
        "You may need to use more than one sheet to completely cover it.",
        "Spray some cooking spray on the aluminum foil to avoid the vegetables sticking to it while they cook.",
        "Spread the carrots and other vegetables evenly around the pan.",
        "Line the carrots up side by side, and place all the other vegetables around them.",
        "Make sure none of the vegetables are completely covering another, or it could prevent them from cooking through all the way.",
        "Add on 2 crushed garlic cloves and, and sprinkle 1 tablespoon (14.3 g) of chopped rosemary on everything for additional flavor.",
        "The 1.5 pounds (0.68 kg) of carrots and other veggies will serve 4 people.",
        "Drizzle the carrots in olive oil, and sprinkle salt and pepper on them.",
        "Get a nice even coating of the olive oil on most of the carrots and other vegetables if you can, tossing them around so that everything is evenly distributed.",
        "Once they’re all oiled, go ahead and shake on the salt and pepper so they’ll stick to the veggies.",
        "Remember to shake up the vegetables halfway through adding the salt and pepper to cover all sides of them when you add the second half.",
        "Put them in the oven for 30 to 40 minutes.",
        "This should allow ample time for the carrots to brown and get crispy in all the right places, while caramelizing them around the edges.",
        "Keep an eye on them to make sure they don’t overcook.",
        "Check every few minutes to see if they’re done after they’ve been in for 30 minutes.",
        "Prod the carrots with a utensil, and if there’s some give to their surface because it has softened up, the carrots are done.",
        "Remove the vegetables from the oven when they’re done cooking.",
        "Use oven mitts when taking the pan out of the oven, and set it down before moving the vegetables off it.",
        "Transfer them to a serving dish to let them cool a bit before you chow down.",
        "Place leftovers in the fridge in a plastic container with a lid.",
        "Steaming the Carrots in the Microwave Cleanse your carrots before steaming them.",
        "Run the carrots under some water to make sure they’re free of any dirt or remaining debris on their surfaces.",
        "Layer the bottom of a microwave safe dish with the baby carrots.",
        "Overlaying the carrots on top of each other will prevent the ones on top from being properly steamed, so just use one layer at a time to cook.",
        "Make sure the dish you’re cooking the carrots in has sides that come up above them.",
        "Using 1.5 pounds (0.68 kg) of carrots will serve 3-4 people.",
        "Fill the dish with water so the bottom 1/8 of the carrots are covered.",
        "Eyeball just enough water to pour in so your carrots are sitting in a shallow amount that will cook them when it’s heated up.",
        "Use less water if you’re unsure how much to use, as too much won’t steam the carrots.",
        "You can always add more later if you notice your carrots aren’t softening up because there isn’t enough water for them be steamed.",
        "Cover the dish with cling wrap and microwave for 2 full minutes.",
        "Put them in on the highest setting your microwave has.",
        "After the 2 minutes are up, take them out of the microwave and flip the carrots over.",
        "Put the cling wrap back on the dish, and place it back into the microwave to keep cooking.",
        "Use oven mitts when taking the dish out of the microwave.",
        "Microwave the carrots in 1-minute intervals until they’re done.",
        "After each minute cooking, if the carrots aren’t done, flip them over again, put the cling wrap back on the dish, and place them back in the microwave.",
        "Continue this until they’ve reached the desired texture you want.",
        "If you can easily pierce the carrot with a fork, it’s cooked through and tender enough to eat.",
        "You can put leftovers in the fridge in a plastic container with a lid."
    ]
}