{
    "title": "How to Store Mangoes",
    "url": "https://www.wikihow.com/Store-Mangoes",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables"
    ],
    "methods": [
        {
            "name": "Storing Mangoes for the Short Term",
            "steps": [
                {
                    "headline": "Check if your mangoes are ripe.",
                    "description": "The ripeness of your mangoes can be determined by their firmness and smell. Unlike most fruit, the color of mangoes does not matter when it comes to ripeness. Unripe mangoes are hard, sturdy, and don’t have a noticeable scent. Ripe mangoes are soft, but not so soft that they are mushy. They have a fruity, pleasant smell."
                },
                {
                    "headline": "Store unripe mangoes in a dark, room temperature container.",
                    "description": "Room temperature storage helps unripe mangoes retain their flavor without spoiling too fast. Jars with air flow and plastic bags can protect your mangoes from pests without blocking out oxygen. Check on your mangoes every 2 days until they are ripe. Depending on when you bought your mangoes, they can take up to 8 days to ripen."
                },
                {
                    "headline": "Store ripe mangoes in the fridge so they stay retain more of their flavor.",
                    "description": "Once mangoes are ripe, you can put them in colder storage like the fridge. Fresh mangoes in the fridge can last up to 6 days. The internal temperature of your fridge should stay at around 40°F (4°C)."
                },
                {
                    "headline": "Watch out for signs that the mangoes have turned rotten.",
                    "description": "After six days, ripe mangoes are likely to show symptoms of rot like mushy, black skin and a sour smell. If the discoloration is inside the mangoes, throw them away. Mangoes that only have little spots of discoloration on the skin can still be used for smoothies."
                }
            ]
        },
        {
            "name": "Freezing Mangoes for the Long Term",
            "steps": [
                {
                    "headline": "Cut your mangoes into cubes or slices for easier packaging.",
                    "description": "Mangoes stored for off-season enjoyment should be cut into little pieces so they can be thoroughly frozen. The pieces should be small enough that you can keep them in a Ziploc bag. Most people peel the skin off of mangoes when freezing, but this is not strictly necessary. The only difference is that the mangoes may take a little longer to freeze and thaw. Try a potato cutter or apple peeler if you’re not comfortable peeling mango skin with a knife."
                },
                {
                    "headline": "Pack and seal Ziploc bags with your leftover mangoes.",
                    "description": "Put your mango pieces into Ziploc bags without placing any pieces on top of each other. Push as much oxygen out of the bags as possible before you seal them."
                },
                {
                    "headline": "Place your Ziploc bags in the freezer horizontally.",
                    "description": "Your bags should not stand up against a wall, otherwise the fruit won’t freeze evenly. Make sure your freezer is consistently at or under 0°F (-18°C)."
                },
                {
                    "headline": "Eat your frozen mangoes within 6 months of placing them in the freezer.",
                    "description": "Take your mangoes out of the freezer and let them thaw in the fridge. Once the cubes soften, you can enjoy a healthy snack! Black spots on frozen mangoes are a sign of freezer burn. The mangoes will still be safe to eat, but won’t taste as good."
                }
            ]
        }
    ],
    "tyn": [
        "Fridge or freezer storage",
        "Kitchen knife",
        "Ziploc bag"
    ],
    "text": " Storing Mangoes for the Short Term Check if your mangoes are ripe. The ripeness of your mangoes can be determined by their firmness and smell. Unlike most fruit, the color of mangoes does not matter when it comes to ripeness. Unripe mangoes are hard, sturdy, and don’t have a noticeable scent. Ripe mangoes are soft, but not so soft that they are mushy. They have a fruity, pleasant smell. Store unripe mangoes in a dark, room temperature container. Room temperature storage helps unripe mangoes retain their flavor without spoiling too fast. Jars with air flow and plastic bags can protect your mangoes from pests without blocking out oxygen. Check on your mangoes every 2 days until they are ripe. Depending on when you bought your mangoes, they can take up to 8 days to ripen. Store ripe mangoes in the fridge so they stay retain more of their flavor. Once mangoes are ripe, you can put them in colder storage like the fridge. Fresh mangoes in the fridge can last up to 6 days. The internal temperature of your fridge should stay at around 40°F (4°C). Watch out for signs that the mangoes have turned rotten. After six days, ripe mangoes are likely to show symptoms of rot like mushy, black skin and a sour smell. If the discoloration is inside the mangoes, throw them away. Mangoes that only have little spots of discoloration on the skin can still be used for smoothies. Freezing Mangoes for the Long Term Cut your mangoes into cubes or slices for easier packaging. Mangoes stored for off-season enjoyment should be cut into little pieces so they can be thoroughly frozen. The pieces should be small enough that you can keep them in a Ziploc bag. Most people peel the skin off of mangoes when freezing, but this is not strictly necessary. The only difference is that the mangoes may take a little longer to freeze and thaw. Try a potato cutter or apple peeler if you’re not comfortable peeling mango skin with a knife. Pack and seal Ziploc bags with your leftover mangoes. Put your mango pieces into Ziploc bags without placing any pieces on top of each other. Push as much oxygen out of the bags as possible before you seal them. Place your Ziploc bags in the freezer horizontally. Your bags should not stand up against a wall, otherwise the fruit won’t freeze evenly. Make sure your freezer is consistently at or under 0°F (-18°C). Eat your frozen mangoes within 6 months of placing them in the freezer. Take your mangoes out of the freezer and let them thaw in the fridge. Once the cubes soften, you can enjoy a healthy snack! Black spots on frozen mangoes are a sign of freezer burn. The mangoes will still be safe to eat, but won’t taste as good.",
    "sentences": [
        " Storing Mangoes for the Short Term Check if your mangoes are ripe.",
        "The ripeness of your mangoes can be determined by their firmness and smell.",
        "Unlike most fruit, the color of mangoes does not matter when it comes to ripeness.",
        "Unripe mangoes are hard, sturdy, and don’t have a noticeable scent.",
        "Ripe mangoes are soft, but not so soft that they are mushy.",
        "They have a fruity, pleasant smell.",
        "Store unripe mangoes in a dark, room temperature container.",
        "Room temperature storage helps unripe mangoes retain their flavor without spoiling too fast.",
        "Jars with air flow and plastic bags can protect your mangoes from pests without blocking out oxygen.",
        "Check on your mangoes every 2 days until they are ripe.",
        "Depending on when you bought your mangoes, they can take up to 8 days to ripen.",
        "Store ripe mangoes in the fridge so they stay retain more of their flavor.",
        "Once mangoes are ripe, you can put them in colder storage like the fridge.",
        "Fresh mangoes in the fridge can last up to 6 days.",
        "The internal temperature of your fridge should stay at around 40°F (4°C).",
        "Watch out for signs that the mangoes have turned rotten.",
        "After six days, ripe mangoes are likely to show symptoms of rot like mushy, black skin and a sour smell.",
        "If the discoloration is inside the mangoes, throw them away.",
        "Mangoes that only have little spots of discoloration on the skin can still be used for smoothies.",
        "Freezing Mangoes for the Long Term Cut your mangoes into cubes or slices for easier packaging.",
        "Mangoes stored for off-season enjoyment should be cut into little pieces so they can be thoroughly frozen.",
        "The pieces should be small enough that you can keep them in a Ziploc bag.",
        "Most people peel the skin off of mangoes when freezing, but this is not strictly necessary.",
        "The only difference is that the mangoes may take a little longer to freeze and thaw.",
        "Try a potato cutter or apple peeler if you’re not comfortable peeling mango skin with a knife.",
        "Pack and seal Ziploc bags with your leftover mangoes.",
        "Put your mango pieces into Ziploc bags without placing any pieces on top of each other.",
        "Push as much oxygen out of the bags as possible before you seal them.",
        "Place your Ziploc bags in the freezer horizontally.",
        "Your bags should not stand up against a wall, otherwise the fruit won’t freeze evenly.",
        "Make sure your freezer is consistently at or under 0°F (-18°C).",
        "Eat your frozen mangoes within 6 months of placing them in the freezer.",
        "Take your mangoes out of the freezer and let them thaw in the fridge.",
        "Once the cubes soften, you can enjoy a healthy snack!",
        "Black spots on frozen mangoes are a sign of freezer burn.",
        "The mangoes will still be safe to eat, but won’t taste as good."
    ]
}