{
    "title": "How to Make Christmas Ice (Confectionery)",
    "url": "https://www.wikihow.com/Make-Christmas-Ice-(Confectionery)",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Chocolate and Candy"
    ],
    "parts": [
        {
            "name": "Making the Mixture",
            "steps": [
                {
                    "headline": "Sift the icing sugar and cream of tartar in a bowl.",
                    "description": "Hold a sift over a medium-sized bowl. Measure 300 grams (2 cups) of icing sugar and 0.4 grams (⅛ teaspoon) of cream of tartar into the sift and use a spoon to push all the powder through the holes. This prevents lumps in the Christmas Ice and gives it a smooth consistency. If you are using a mechanical sift, simply turn the handle to push the powder through the sieve. In some countries, icing sugar is called confectionary sugar."
                },
                {
                    "headline": "Stir the desiccated coconut and condensed milk into the mixture.",
                    "description": "Measure 300 grams (3 1/2 cups) of desiccated coconut and 300 mL (1 1/3 cups) of sweetened condensed milk into your bowl. Use a spoon to mix the ingredients until they are fully combined and the mixture is in 1 big lump. In some countries, desiccated coconut is called finely shredded dried coconut"
                },
                {
                    "headline": "Divide the mixture into 2 equal amounts in separate bowls.",
                    "description": "Use a large spoon to scoop out approximately half of the mixture into a small bowl. This allows you to dye the mixture different colours. Don’t worry if the mixture isn’t divided perfectly in half, just use your best judgement."
                },
                {
                    "headline": "Mix green food colouring into 1 bowl, and red food colouring into the other.",
                    "description": "If possible, use liquid food colouring, as this is easiest to stir through the mixture. Add 1 drop of green food colouring into 1 bowl and stir it until the mixture is an even colour. Repeat this process with the other bowl using red food colouring. Be careful not to drop any food colouring on your clothes or the bench as it can stain. To make the colour of the mixture darker, simply add an extra drop of food colouring."
                }
            ]
        },
        {
            "name": "Setting the Christmas Ice",
            "steps": [
                {
                    "headline": "Place baking paper into the base of a 19 cm (7.5 in) square cake pan.",
                    "description": "Place enough baking paper into the cake pan to cover both the bottom and sides of the container. This prevents the Christmas Ice from sticking to the cake pan and makes it easier to remove once it has set. If you don’t have baking paper, use wax paper instead."
                },
                {
                    "headline": "Press the red mixture into the bottom of the cake pan.",
                    "description": "Place the red mixture on top of the baking paper in the cake pan and use a spatula to spread it out. Try to make the mixture lie as evenly as possible on the bottom of the pan. This layer will act as the base of the Christmas ice. If you don’t have a spatula, use your fingers to press the mixture flat."
                },
                {
                    "headline": "Spread the green mixture evenly over the red mixture.",
                    "description": "Spoon the green mixture on top of the red mixture and use a spatula to spread it out. Try to make this layer as even and smooth as possible as this will be the top of your Christmas ice. Make sure to cover all of the green mixture with red mixture so that each piece of confectionary will have a green and red layer."
                },
                {
                    "headline": "Cover the cake pan with cling wrap.",
                    "description": "This helps to prevent any smells in the fridge from soaking into your Christmas ice. Wrap the cling wrap over the top and sides of the cake pan to keep it nice and fresh while it is in the fridge. If you don’t any cling wrap, use aluminium foil instead."
                },
                {
                    "headline": "Place the cake pan into the fridge for 1 hour to set.",
                    "description": "The cool temperature of the fridge will make the Christmas ice stick firmer, which makes it easier to eat. After 1 hour check that it feels hard. If it still feels squishy, leave it in the fridge to set for another 30 minutes or until it is hard."
                },
                {
                    "headline": "Cut the Christmas ice into pieces with a sharp knife.",
                    "description": "Hold the edges of the baking paper to easily lift the Christmas slice out of the baking pan. Place it onto a chopping board and then chop it into pieces with a knife. Enjoy the Christmas Ice by yourself or gift it to a loved one as a Christmas treat. Store the Christmas ice in an airtight container for up to 2 days."
                }
            ]
        }
    ],
    "tyn": [
        "19 centimetres (7.5 in) square base cake pan",
        "Baking paper",
        "Medium-sized mixing bowl",
        "Spoon",
        "Small bowl",
        "Knife",
        "Spatula",
        "Cling film",
        "Chopping board"
    ],
    "text": " Making the Mixture Sift the icing sugar and cream of tartar in a bowl. Hold a sift over a medium-sized bowl. Measure 300 grams (2 cups) of icing sugar and 0.4 grams (⅛ teaspoon) of cream of tartar into the sift and use a spoon to push all the powder through the holes. This prevents lumps in the Christmas Ice and gives it a smooth consistency. If you are using a mechanical sift, simply turn the handle to push the powder through the sieve. In some countries, icing sugar is called confectionary sugar. Stir the desiccated coconut and condensed milk into the mixture. Measure 300 grams (3 1/2 cups) of desiccated coconut and 300 mL (1 1/3 cups) of sweetened condensed milk into your bowl. Use a spoon to mix the ingredients until they are fully combined and the mixture is in 1 big lump. In some countries, desiccated coconut is called finely shredded dried coconut Divide the mixture into 2 equal amounts in separate bowls. Use a large spoon to scoop out approximately half of the mixture into a small bowl. This allows you to dye the mixture different colours. Don’t worry if the mixture isn’t divided perfectly in half, just use your best judgement. Mix green food colouring into 1 bowl, and red food colouring into the other. If possible, use liquid food colouring, as this is easiest to stir through the mixture. Add 1 drop of green food colouring into 1 bowl and stir it until the mixture is an even colour. Repeat this process with the other bowl using red food colouring. Be careful not to drop any food colouring on your clothes or the bench as it can stain. To make the colour of the mixture darker, simply add an extra drop of food colouring. Setting the Christmas Ice Place baking paper into the base of a 19 cm (7.5 in) square cake pan. Place enough baking paper into the cake pan to cover both the bottom and sides of the container. This prevents the Christmas Ice from sticking to the cake pan and makes it easier to remove once it has set. If you don’t have baking paper, use wax paper instead. Press the red mixture into the bottom of the cake pan. Place the red mixture on top of the baking paper in the cake pan and use a spatula to spread it out. Try to make the mixture lie as evenly as possible on the bottom of the pan. This layer will act as the base of the Christmas ice. If you don’t have a spatula, use your fingers to press the mixture flat. Spread the green mixture evenly over the red mixture. Spoon the green mixture on top of the red mixture and use a spatula to spread it out. Try to make this layer as even and smooth as possible as this will be the top of your Christmas ice. Make sure to cover all of the green mixture with red mixture so that each piece of confectionary will have a green and red layer. Cover the cake pan with cling wrap. This helps to prevent any smells in the fridge from soaking into your Christmas ice. Wrap the cling wrap over the top and sides of the cake pan to keep it nice and fresh while it is in the fridge. If you don’t any cling wrap, use aluminium foil instead. Place the cake pan into the fridge for 1 hour to set. The cool temperature of the fridge will make the Christmas ice stick firmer, which makes it easier to eat. After 1 hour check that it feels hard. If it still feels squishy, leave it in the fridge to set for another 30 minutes or until it is hard. Cut the Christmas ice into pieces with a sharp knife. Hold the edges of the baking paper to easily lift the Christmas slice out of the baking pan. Place it onto a chopping board and then chop it into pieces with a knife. Enjoy the Christmas Ice by yourself or gift it to a loved one as a Christmas treat. Store the Christmas ice in an airtight container for up to 2 days.",
    "sentences": [
        " Making the Mixture Sift the icing sugar and cream of tartar in a bowl.",
        "Hold a sift over a medium-sized bowl.",
        "Measure 300 grams (2 cups) of icing sugar and 0.4 grams (⅛ teaspoon) of cream of tartar into the sift and use a spoon to push all the powder through the holes.",
        "This prevents lumps in the Christmas Ice and gives it a smooth consistency.",
        "If you are using a mechanical sift, simply turn the handle to push the powder through the sieve.",
        "In some countries, icing sugar is called confectionary sugar.",
        "Stir the desiccated coconut and condensed milk into the mixture.",
        "Measure 300 grams (3 1/2 cups) of desiccated coconut and 300 mL (1 1/3 cups) of sweetened condensed milk into your bowl.",
        "Use a spoon to mix the ingredients until they are fully combined and the mixture is in 1 big lump.",
        "In some countries, desiccated coconut is called finely shredded dried coconut Divide the mixture into 2 equal amounts in separate bowls.",
        "Use a large spoon to scoop out approximately half of the mixture into a small bowl.",
        "This allows you to dye the mixture different colours.",
        "Don’t worry if the mixture isn’t divided perfectly in half, just use your best judgement.",
        "Mix green food colouring into 1 bowl, and red food colouring into the other.",
        "If possible, use liquid food colouring, as this is easiest to stir through the mixture.",
        "Add 1 drop of green food colouring into 1 bowl and stir it until the mixture is an even colour.",
        "Repeat this process with the other bowl using red food colouring.",
        "Be careful not to drop any food colouring on your clothes or the bench as it can stain.",
        "To make the colour of the mixture darker, simply add an extra drop of food colouring.",
        "Setting the Christmas Ice Place baking paper into the base of a 19 cm (7.5 in) square cake pan.",
        "Place enough baking paper into the cake pan to cover both the bottom and sides of the container.",
        "This prevents the Christmas Ice from sticking to the cake pan and makes it easier to remove once it has set.",
        "If you don’t have baking paper, use wax paper instead.",
        "Press the red mixture into the bottom of the cake pan.",
        "Place the red mixture on top of the baking paper in the cake pan and use a spatula to spread it out.",
        "Try to make the mixture lie as evenly as possible on the bottom of the pan.",
        "This layer will act as the base of the Christmas ice.",
        "If you don’t have a spatula, use your fingers to press the mixture flat.",
        "Spread the green mixture evenly over the red mixture.",
        "Spoon the green mixture on top of the red mixture and use a spatula to spread it out.",
        "Try to make this layer as even and smooth as possible as this will be the top of your Christmas ice.",
        "Make sure to cover all of the green mixture with red mixture so that each piece of confectionary will have a green and red layer.",
        "Cover the cake pan with cling wrap.",
        "This helps to prevent any smells in the fridge from soaking into your Christmas ice.",
        "Wrap the cling wrap over the top and sides of the cake pan to keep it nice and fresh while it is in the fridge.",
        "If you don’t any cling wrap, use aluminium foil instead.",
        "Place the cake pan into the fridge for 1 hour to set.",
        "The cool temperature of the fridge will make the Christmas ice stick firmer, which makes it easier to eat.",
        "After 1 hour check that it feels hard.",
        "If it still feels squishy, leave it in the fridge to set for another 30 minutes or until it is hard.",
        "Cut the Christmas ice into pieces with a sharp knife.",
        "Hold the edges of the baking paper to easily lift the Christmas slice out of the baking pan.",
        "Place it onto a chopping board and then chop it into pieces with a knife.",
        "Enjoy the Christmas Ice by yourself or gift it to a loved one as a Christmas treat.",
        "Store the Christmas ice in an airtight container for up to 2 days."
    ]
}