{
    "title": "How to Make 3D Plots Using MATLAB",
    "url": "https://www.wikihow.com/Make-3D-Plots-Using-MATLAB",
    "category_hierarchy": [
        "Computers and Electronics",
        "Software",
        "Programming",
        "MATLAB"
    ],
    "parts": [
        {
            "name": "Constructing the Domain",
            "steps": [
                {
                    "headline": "Open the command window.",
                    "description": "In the default layout this should appear automatically as the biggest window displayed."
                },
                {
                    "headline": "If the command window isn't present, select home in the upper left corner.",
                    "description": "Afterwards, select layout and then \"Default\"."
                },
                {
                    "headline": "In the command window, define both of your x and y vectors.",
                    "description": "This is typically done in the form of x=[vector or function] and y=[vector or function]\n\nRemember to use the dot operator when multiplying or dividing vectors and matrices. Otherwise errors will occur."
                }
            ]
        },
        {
            "name": "Producing the Grid in the xy-Plane",
            "steps": [
                {
                    "headline": "Define a relationship between x and y.",
                    "description": "In order to accomplish this, two commands must be used. The first is the mesh function. By using this, the result will be a wireframe mesh graph. The other is the surf function. When using surf, the result will be a 3-D surface plot."
                },
                {
                    "headline": "When using mesh, input meshgrid  to the command window.",
                    "description": "The command will be formatted as follows: [xx,yy]=meshgrid(x,y). In the workspace window you will see that the variables xx and yy have been defined."
                }
            ]
        },
        {
            "name": "Defining \"zz\" and Plotting the Surface",
            "steps": [
                {
                    "headline": "Define zz in terms of xx and yy because of its reliance on those sets of data.",
                    "description": "Use the relationship you know exists between x and y. This is likely to be a function or formula. e.g., zz=xx.^2-yy.^2"
                },
                {
                    "headline": "Plot the surface using the surf command.",
                    "description": "From the z components in the matrix \"zz\", the surf command will create a 3-D shaded surface. This is the point in which you will relate xx, yy, and zz together. The actual command line will be in the format of surf(xx,yy,zz) ."
                },
                {
                    "headline": "Watch for your new window to appear showing your 3-D plot.",
                    "description": ""
                },
                {
                    "headline": "Customize as you'd like.",
                    "description": "There is a toolbar at the top of the window where the new plot has appeared. This toolbar contains many options and features that can be used to manipulate your 3-D plot. Some of these options include:\nInserting a label for the x, y, or z axis\nInserting a legend to help readers\nRotating the plot in it's 3-D space\nInserting a light source to show the effects of shadows\n\nA list of complex surface properties can be found at http://www.mathworks.com/help/matlab/examples/changing-surface-properties.html"
                },
                {
                    "headline": "Smooth the color map across the entire surface of the graph, if you'd like.",
                    "description": "This is done by using the command line shading interp."
                }
            ]
        }
    ],
    "tyn": [
        "A set of data that you wish to plot",
        "A computer running MATLAB 2012 (or later)"
    ],
    "text": " Constructing the Domain Open the command window. In the default layout this should appear automatically as the biggest window displayed. If the command window isn't present, select home in the upper left corner. Afterwards, select layout and then \"Default\". In the command window, define both of your x and y vectors. This is typically done in the form of x=[vector or function] and y=[vector or function]\n\nRemember to use the dot operator when multiplying or dividing vectors and matrices. Otherwise errors will occur. Producing the Grid in the xy-Plane Define a relationship between x and y. In order to accomplish this, two commands must be used. The first is the mesh function. By using this, the result will be a wireframe mesh graph. The other is the surf function. When using surf, the result will be a 3-D surface plot. When using mesh, input meshgrid  to the command window. The command will be formatted as follows: [xx,yy]=meshgrid(x,y). In the workspace window you will see that the variables xx and yy have been defined. Defining \"zz\" and Plotting the Surface Define zz in terms of xx and yy because of its reliance on those sets of data. Use the relationship you know exists between x and y. This is likely to be a function or formula. e.g., zz=xx.^2-yy.^2 Plot the surface using the surf command. From the z components in the matrix \"zz\", the surf command will create a 3-D shaded surface. This is the point in which you will relate xx, yy, and zz together. The actual command line will be in the format of surf(xx,yy,zz) . Watch for your new window to appear showing your 3-D plot.  Customize as you'd like. There is a toolbar at the top of the window where the new plot has appeared. This toolbar contains many options and features that can be used to manipulate your 3-D plot. Some of these options include:\nInserting a label for the x, y, or z axis\nInserting a legend to help readers\nRotating the plot in it's 3-D space\nInserting a light source to show the effects of shadows\n\nA list of complex surface properties can be found at http://www.mathworks.com/help/matlab/examples/changing-surface-properties.html Smooth the color map across the entire surface of the graph, if you'd like. This is done by using the command line shading interp.",
    "sentences": [
        " Constructing the Domain Open the command window.",
        "In the default layout this should appear automatically as the biggest window displayed.",
        "If the command window isn't present, select home in the upper left corner.",
        "Afterwards, select layout and then \"Default\".",
        "In the command window, define both of your x and y vectors.",
        "This is typically done in the form of x=[vector or function] and y=[vector or function]\n\nRemember to use the dot operator when multiplying or dividing vectors and matrices.",
        "Otherwise errors will occur.",
        "Producing the Grid in the xy-Plane Define a relationship between x and y.",
        "In order to accomplish this, two commands must be used.",
        "The first is the mesh function.",
        "By using this, the result will be a wireframe mesh graph.",
        "The other is the surf function.",
        "When using surf, the result will be a 3-D surface plot.",
        "When using mesh, input meshgrid  to the command window.",
        "The command will be formatted as follows: [xx,yy]=meshgrid(x,y).",
        "In the workspace window you will see that the variables xx and yy have been defined.",
        "Defining \"zz\" and Plotting the Surface Define zz in terms of xx and yy because of its reliance on those sets of data.",
        "Use the relationship you know exists between x and y.",
        "This is likely to be a function or formula.",
        "e.g., zz=xx.^2-yy.^2 Plot the surface using the surf command.",
        "From the z components in the matrix \"zz\", the surf command will create a 3-D shaded surface.",
        "This is the point in which you will relate xx, yy, and zz together.",
        "The actual command line will be in the format of surf(xx,yy,zz) .",
        "Watch for your new window to appear showing your 3-D plot.",
        "Customize as you'd like.",
        "There is a toolbar at the top of the window where the new plot has appeared.",
        "This toolbar contains many options and features that can be used to manipulate your 3-D plot.",
        "Some of these options include:\nInserting a label for the x, y, or z axis\nInserting a legend to help readers\nRotating the plot in it's 3-D space\nInserting a light source to show the effects of shadows\n\nA list of complex surface properties can be found at http://www.mathworks.com/help/matlab/examples/changing-surface-properties.html Smooth the color map across the entire surface of the graph, if you'd like.",
        "This is done by using the command line shading interp."
    ]
}