{
    "title": "How to Triple Tongue on the Trumpet",
    "url": "https://www.wikihow.com/Triple-Tongue-on-the-Trumpet",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music",
        "Musical Instruments",
        "Brass Musical Instruments",
        "Trumpet and Cornet"
    ],
    "steps": [
        {
            "headline": "Learn double tonguing before learning triple tonguing.",
            "description": "Triple tonguing is similar in that it uses the same syllables as double tonguing so it is recommended to learn double tonguing first."
        },
        {
            "headline": "Understand when to use the triple tongue technique.",
            "description": "Triple tonguing is used when a wind musician is required to play a fast passage that is in groups of three. The triple tongue technique uses the same syllables as the double tongue technique: Ta-Ka, Da-Ga, Tu-Ku. The difference between triple tonguing and double tonguing is the way the syllables are used. When you triple tongue, you tongue at the front of your mouth twice, and the back once."
        },
        {
            "headline": "^ Triple Tonguing in the most popular form uses the syllables as Ta-Ta-Ka, or another popular method is Ta-Ka-Ta.",
            "description": ""
        },
        {
            "headline": "Learn the Ta syllable.",
            "description": "Practice the Ta sound by saying the word “toddler” (other hard T words may be used). Notice where your tongue is when saying the word. Other variations on this syllable are Da or Tu."
        },
        {
            "headline": "Learn the Ka syllable.",
            "description": "Practice the Ka sound by saying the word “Cup” (this sets up the tongue where is should be when you triple tongue). Other variations of this syllable are Ga or Ku."
        },
        {
            "headline": "Group the syllables together.",
            "description": "Slowly say the syllables in the form Ta-Ta-Ka. Be sure you are clearly articulating each syllable, and each syllable is the same length. Gradually pick up the tempo to the point where you are able to say a group of three syllables (Ta-Ta-Ka) at 100 beats per minute on a metronome."
        },
        {
            "headline": "Vocalize the syllables in a different order.",
            "description": "Following the chart above, vocalize these groups of three. Repeat each line on its own, as its own exercise several times. This will help you become very comfortable with the syllables. T represents a Ta, and K represents a Ka."
        },
        {
            "headline": "Play on the mouthpiece.",
            "description": "Begin on a mid-ranged note, between a low E and middle G.  Play a long tone and slowly move your tongue to the Ta-Ta-Ka (or Ta-Ka-Ta) syllables. As this is the first time triple tonguing with your embouchure, begin slow and speed up with the metronome."
        },
        {
            "headline": "Play on the trumpet.",
            "description": "Use the same exercise that was used on the mouthpiece. Holding out a single mid ranged long note and adding in the groups of three syllables, gradually picking up the tempo."
        },
        {
            "headline": "Expand your range.",
            "description": "Practice the above exercise in multiple keys above and below. This exercise helps you work on your triple tonguing technique in the full range of the instrument."
        },
        {
            "headline": "Change notes between triplets.",
            "description": "Follow this exercise again in multiple keys. This exercise begins to change notes. This is the beginning of learning the coordination between your fingers and tongue."
        },
        {
            "headline": "Switch notes during triplets.",
            "description": "Practice this exercise. Playing a chromatic scale, where you switch notes every time you articulate. This takes lots of practice to line up the articulation with when your fingers change notes. Practice this exercise in many keys, changing the range."
        },
        {
            "headline": "Practice.",
            "description": "Being a musician, practice is key to success. Practicing these exercises will help build up the speed and endurance of your triple tongue. Even very advanced musicians practice triple tonguing to maintain his or her skill."
        }
    ],
    "tyn": [
        "Trumpet",
        "Mouthpiece",
        "Metronome"
    ],
    "text": " Learn double tonguing before learning triple tonguing. Triple tonguing is similar in that it uses the same syllables as double tonguing so it is recommended to learn double tonguing first. Understand when to use the triple tongue technique. Triple tonguing is used when a wind musician is required to play a fast passage that is in groups of three. The triple tongue technique uses the same syllables as the double tongue technique: Ta-Ka, Da-Ga, Tu-Ku. The difference between triple tonguing and double tonguing is the way the syllables are used. When you triple tongue, you tongue at the front of your mouth twice, and the back once. ^ Triple Tonguing in the most popular form uses the syllables as Ta-Ta-Ka, or another popular method is Ta-Ka-Ta.  Learn the Ta syllable. Practice the Ta sound by saying the word “toddler” (other hard T words may be used). Notice where your tongue is when saying the word. Other variations on this syllable are Da or Tu. Learn the Ka syllable. Practice the Ka sound by saying the word “Cup” (this sets up the tongue where is should be when you triple tongue). Other variations of this syllable are Ga or Ku. Group the syllables together. Slowly say the syllables in the form Ta-Ta-Ka. Be sure you are clearly articulating each syllable, and each syllable is the same length. Gradually pick up the tempo to the point where you are able to say a group of three syllables (Ta-Ta-Ka) at 100 beats per minute on a metronome. Vocalize the syllables in a different order. Following the chart above, vocalize these groups of three. Repeat each line on its own, as its own exercise several times. This will help you become very comfortable with the syllables. T represents a Ta, and K represents a Ka. Play on the mouthpiece. Begin on a mid-ranged note, between a low E and middle G.  Play a long tone and slowly move your tongue to the Ta-Ta-Ka (or Ta-Ka-Ta) syllables. As this is the first time triple tonguing with your embouchure, begin slow and speed up with the metronome. Play on the trumpet. Use the same exercise that was used on the mouthpiece. Holding out a single mid ranged long note and adding in the groups of three syllables, gradually picking up the tempo. Expand your range. Practice the above exercise in multiple keys above and below. This exercise helps you work on your triple tonguing technique in the full range of the instrument. Change notes between triplets. Follow this exercise again in multiple keys. This exercise begins to change notes. This is the beginning of learning the coordination between your fingers and tongue. Switch notes during triplets. Practice this exercise. Playing a chromatic scale, where you switch notes every time you articulate. This takes lots of practice to line up the articulation with when your fingers change notes. Practice this exercise in many keys, changing the range. Practice. Being a musician, practice is key to success. Practicing these exercises will help build up the speed and endurance of your triple tongue. Even very advanced musicians practice triple tonguing to maintain his or her skill.",
    "sentences": [
        " Learn double tonguing before learning triple tonguing.",
        "Triple tonguing is similar in that it uses the same syllables as double tonguing so it is recommended to learn double tonguing first.",
        "Understand when to use the triple tongue technique.",
        "Triple tonguing is used when a wind musician is required to play a fast passage that is in groups of three.",
        "The triple tongue technique uses the same syllables as the double tongue technique: Ta-Ka, Da-Ga, Tu-Ku.",
        "The difference between triple tonguing and double tonguing is the way the syllables are used.",
        "When you triple tongue, you tongue at the front of your mouth twice, and the back once.",
        "^ Triple Tonguing in the most popular form uses the syllables as Ta-Ta-Ka, or another popular method is Ta-Ka-Ta.",
        "Learn the Ta syllable.",
        "Practice the Ta sound by saying the word “toddler” (other hard T words may be used).",
        "Notice where your tongue is when saying the word.",
        "Other variations on this syllable are Da or Tu.",
        "Learn the Ka syllable.",
        "Practice the Ka sound by saying the word “Cup” (this sets up the tongue where is should be when you triple tongue).",
        "Other variations of this syllable are Ga or Ku.",
        "Group the syllables together.",
        "Slowly say the syllables in the form Ta-Ta-Ka.",
        "Be sure you are clearly articulating each syllable, and each syllable is the same length.",
        "Gradually pick up the tempo to the point where you are able to say a group of three syllables (Ta-Ta-Ka) at 100 beats per minute on a metronome.",
        "Vocalize the syllables in a different order.",
        "Following the chart above, vocalize these groups of three.",
        "Repeat each line on its own, as its own exercise several times.",
        "This will help you become very comfortable with the syllables.",
        "T represents a Ta, and K represents a Ka.",
        "Play on the mouthpiece.",
        "Begin on a mid-ranged note, between a low E and middle G.  Play a long tone and slowly move your tongue to the Ta-Ta-Ka (or Ta-Ka-Ta) syllables.",
        "As this is the first time triple tonguing with your embouchure, begin slow and speed up with the metronome.",
        "Play on the trumpet.",
        "Use the same exercise that was used on the mouthpiece.",
        "Holding out a single mid ranged long note and adding in the groups of three syllables, gradually picking up the tempo.",
        "Expand your range.",
        "Practice the above exercise in multiple keys above and below.",
        "This exercise helps you work on your triple tonguing technique in the full range of the instrument.",
        "Change notes between triplets.",
        "Follow this exercise again in multiple keys.",
        "This exercise begins to change notes.",
        "This is the beginning of learning the coordination between your fingers and tongue.",
        "Switch notes during triplets.",
        "Practice this exercise.",
        "Playing a chromatic scale, where you switch notes every time you articulate.",
        "This takes lots of practice to line up the articulation with when your fingers change notes.",
        "Practice this exercise in many keys, changing the range.",
        "Practice.",
        "Being a musician, practice is key to success.",
        "Practicing these exercises will help build up the speed and endurance of your triple tongue.",
        "Even very advanced musicians practice triple tonguing to maintain his or her skill."
    ]
}