{
    "title": "How to Change a Drill Bit",
    "url": "https://www.wikihow.com/Change-a-Drill-Bit",
    "category_hierarchy": [
        "Home and Garden",
        "Tools",
        "Hole Making Tools"
    ],
    "methods": [
        {
            "name": "Changing Bits on a Keyless Drill",
            "steps": [
                {
                    "headline": "Loosen the chuck.",
                    "description": "The chuck is piece on the end of the drill that loosens and tightens to hold the bit. Grasp the chuck with one hand while you hold the handle of the drill with your other hand. Twist the chuck counterclockwise to loosen it. Another option is to pull the trigger gently while holding the chuck. Loosening the chuck will open the jaws that clamp onto the drill bit."
                },
                {
                    "headline": "Remove the bit.",
                    "description": "Once you loosen the chuck, the drill bit that you currently have in the drill will start to wobble. You should be able to easily pull it out of the drill once the jaws that clamp it to the drill are loose. Always inspect the bit when you remove. If it looks damaged or worn, throw it out so you don't accidentally use it again later."
                },
                {
                    "headline": "Set the bit.",
                    "description": "Hold the bit with your thumb and index finger so that the smooth part of the bit (the shank) is facing the jaws of the chuck. Insert the bit into the chuck and immediately pull it back towards you about a centimeter. Keep your fingers on the bit and the chuck since the bit isn't secured and could fall out."
                },
                {
                    "headline": "Squeeze the trigger.",
                    "description": "Tighten the bit into place by giving the trigger a few short squeezes. Your other hand should still be loosely holding the bit in place while you do this. Lightly hold the bit while squeezing to ensure that the bit is installed straight."
                },
                {
                    "headline": "Engage the ratcheting mechanism if needed.",
                    "description": "If your drill has a ratcheting mechanism to apply extra pressure to the shank of a drill bit, you'll need to click it into place. To engage it, firmly twist the ratcheting mechanism next to the chuck in a clockwise motion."
                }
            ]
        },
        {
            "name": "Using a Chuck Key",
            "steps": [
                {
                    "headline": "Insert the chuck key.",
                    "description": "If your drill came with a chuck key, you'll need to use this in order to loosen the chuck. The end of the drill key will look like a cog that has teeth. To insert the chuck key, line up the teeth so that they match the teeth on the chuck and insert the tip into one of the holes on the side of the chuck. Many drills that use a chuck key have a secure place on the drill where you can store the key. Typically you’ll see a key chuck on a power drill rather than a cordless model."
                },
                {
                    "headline": "Turn the chuck key counterclockwise.",
                    "description": "As you turn the key, the jaws on the chuck will begin to open. Continue turning until the chuck opens enough to easily slide the drill bit out. The jaws are the three or four pieces in the mouth of the chuck that extend to hold the bit in place.}"
                },
                {
                    "headline": "Remove the bit.",
                    "description": "Pull the bit out using your thumb and index finger once the chuck is loosened. If the chuck is opened wide and you turn the drill face down, it may just fall out. Inspect the bit once you've removed it. Check for damage or worn areas. If the bit is dull, you should replace it. If it's bent or shows signs of cracking, throw it out so you won't mistakenly use it again."
                },
                {
                    "headline": "Insert a bit.",
                    "description": "While the jaw on the chuck are open wide, insert your new bit. Hold the bit with your thumb and index finger so that the smooth part of the bit (the shank) is facing the jaws of the chuck and insert it. Keep your fingers on the bit and the chuck since the bit isn't secured and could fall out."
                },
                {
                    "headline": "Tighten the chuck.",
                    "description": "While holding the bit in place with one hand, turn the chuck key clockwise to tighten the chuck's jaws with your other hand. Make sure to tighten it firmly so that the bit is secured. Remove the chuck key. Remove your hand from the bit and turn on the drill to test it before using it."
                }
            ]
        }
    ],
    "tyn": [
        "Power drill",
        "Replacement bit",
        "Chuck key (if needed)"
    ],
    "text": " Changing Bits on a Keyless Drill Loosen the chuck. The chuck is piece on the end of the drill that loosens and tightens to hold the bit. Grasp the chuck with one hand while you hold the handle of the drill with your other hand. Twist the chuck counterclockwise to loosen it. Another option is to pull the trigger gently while holding the chuck. Loosening the chuck will open the jaws that clamp onto the drill bit. Remove the bit. Once you loosen the chuck, the drill bit that you currently have in the drill will start to wobble. You should be able to easily pull it out of the drill once the jaws that clamp it to the drill are loose. Always inspect the bit when you remove. If it looks damaged or worn, throw it out so you don't accidentally use it again later. Set the bit. Hold the bit with your thumb and index finger so that the smooth part of the bit (the shank) is facing the jaws of the chuck. Insert the bit into the chuck and immediately pull it back towards you about a centimeter. Keep your fingers on the bit and the chuck since the bit isn't secured and could fall out. Squeeze the trigger. Tighten the bit into place by giving the trigger a few short squeezes. Your other hand should still be loosely holding the bit in place while you do this. Lightly hold the bit while squeezing to ensure that the bit is installed straight. Engage the ratcheting mechanism if needed. If your drill has a ratcheting mechanism to apply extra pressure to the shank of a drill bit, you'll need to click it into place. To engage it, firmly twist the ratcheting mechanism next to the chuck in a clockwise motion. Using a Chuck Key Insert the chuck key. If your drill came with a chuck key, you'll need to use this in order to loosen the chuck. The end of the drill key will look like a cog that has teeth. To insert the chuck key, line up the teeth so that they match the teeth on the chuck and insert the tip into one of the holes on the side of the chuck. Many drills that use a chuck key have a secure place on the drill where you can store the key. Typically you’ll see a key chuck on a power drill rather than a cordless model. Turn the chuck key counterclockwise. As you turn the key, the jaws on the chuck will begin to open. Continue turning until the chuck opens enough to easily slide the drill bit out. The jaws are the three or four pieces in the mouth of the chuck that extend to hold the bit in place.} Remove the bit. Pull the bit out using your thumb and index finger once the chuck is loosened. If the chuck is opened wide and you turn the drill face down, it may just fall out. Inspect the bit once you've removed it. Check for damage or worn areas. If the bit is dull, you should replace it. If it's bent or shows signs of cracking, throw it out so you won't mistakenly use it again. Insert a bit. While the jaw on the chuck are open wide, insert your new bit. Hold the bit with your thumb and index finger so that the smooth part of the bit (the shank) is facing the jaws of the chuck and insert it. Keep your fingers on the bit and the chuck since the bit isn't secured and could fall out. Tighten the chuck. While holding the bit in place with one hand, turn the chuck key clockwise to tighten the chuck's jaws with your other hand. Make sure to tighten it firmly so that the bit is secured. Remove the chuck key. Remove your hand from the bit and turn on the drill to test it before using it.",
    "sentences": [
        " Changing Bits on a Keyless Drill Loosen the chuck.",
        "The chuck is piece on the end of the drill that loosens and tightens to hold the bit.",
        "Grasp the chuck with one hand while you hold the handle of the drill with your other hand.",
        "Twist the chuck counterclockwise to loosen it.",
        "Another option is to pull the trigger gently while holding the chuck.",
        "Loosening the chuck will open the jaws that clamp onto the drill bit.",
        "Remove the bit.",
        "Once you loosen the chuck, the drill bit that you currently have in the drill will start to wobble.",
        "You should be able to easily pull it out of the drill once the jaws that clamp it to the drill are loose.",
        "Always inspect the bit when you remove.",
        "If it looks damaged or worn, throw it out so you don't accidentally use it again later.",
        "Set the bit.",
        "Hold the bit with your thumb and index finger so that the smooth part of the bit (the shank) is facing the jaws of the chuck.",
        "Insert the bit into the chuck and immediately pull it back towards you about a centimeter.",
        "Keep your fingers on the bit and the chuck since the bit isn't secured and could fall out.",
        "Squeeze the trigger.",
        "Tighten the bit into place by giving the trigger a few short squeezes.",
        "Your other hand should still be loosely holding the bit in place while you do this.",
        "Lightly hold the bit while squeezing to ensure that the bit is installed straight.",
        "Engage the ratcheting mechanism if needed.",
        "If your drill has a ratcheting mechanism to apply extra pressure to the shank of a drill bit, you'll need to click it into place.",
        "To engage it, firmly twist the ratcheting mechanism next to the chuck in a clockwise motion.",
        "Using a Chuck Key Insert the chuck key.",
        "If your drill came with a chuck key, you'll need to use this in order to loosen the chuck.",
        "The end of the drill key will look like a cog that has teeth.",
        "To insert the chuck key, line up the teeth so that they match the teeth on the chuck and insert the tip into one of the holes on the side of the chuck.",
        "Many drills that use a chuck key have a secure place on the drill where you can store the key.",
        "Typically you’ll see a key chuck on a power drill rather than a cordless model.",
        "Turn the chuck key counterclockwise.",
        "As you turn the key, the jaws on the chuck will begin to open.",
        "Continue turning until the chuck opens enough to easily slide the drill bit out.",
        "The jaws are the three or four pieces in the mouth of the chuck that extend to hold the bit in place.}",
        "Remove the bit.",
        "Pull the bit out using your thumb and index finger once the chuck is loosened.",
        "If the chuck is opened wide and you turn the drill face down, it may just fall out.",
        "Inspect the bit once you've removed it.",
        "Check for damage or worn areas.",
        "If the bit is dull, you should replace it.",
        "If it's bent or shows signs of cracking, throw it out so you won't mistakenly use it again.",
        "Insert a bit.",
        "While the jaw on the chuck are open wide, insert your new bit.",
        "Hold the bit with your thumb and index finger so that the smooth part of the bit (the shank) is facing the jaws of the chuck and insert it.",
        "Keep your fingers on the bit and the chuck since the bit isn't secured and could fall out.",
        "Tighten the chuck.",
        "While holding the bit in place with one hand, turn the chuck key clockwise to tighten the chuck's jaws with your other hand.",
        "Make sure to tighten it firmly so that the bit is secured.",
        "Remove the chuck key.",
        "Remove your hand from the bit and turn on the drill to test it before using it."
    ]
}