{
    "title": "How to Create a Scrapbook That You Will Love",
    "url": "https://www.wikihow.com/Create-a-Scrapbook-That-You-Will-Love",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Paper Craft",
        "Scrapbooks"
    ],
    "methods": [
        {
            "name": "Steps",
            "steps": [
                {
                    "headline": "Firstly, find a good quality scrapbook with plain or coloured pages.",
                    "description": "It doesn't have to be expensive or flashy either, just the right kind you want. Also, get the vital craft materials if you don't already have them, such as craft glue, scissors etc."
                },
                {
                    "headline": "And of course, the things to include in it!",
                    "description": "Go bargain hunting in shops such as Poundland or The works, and look for materials such as pretty backgrounds or beautiful sheets of paper. How about special little extras too, such as stickers, 3D stickers, special labels or just mementos you like? Anything that can transform a scrapbook into a better keepsake and more personalized!"
                },
                {
                    "headline": "Find a big box or something else for storing your materials in, so all the stuff will be there when you want or need it.",
                    "description": ""
                },
                {
                    "headline": "A clear working space is essential, you don't want to be too cramped or squashed.",
                    "description": ""
                },
                {
                    "headline": "Now for some ideas to try!",
                    "description": "Of course, your scrapbook can be about absolutely anything you want but, if you're stuck for inspiration or don't have much ideas, why not take a look? It may be better to not have a theme and base it around your life, because if you do that you have so much more things to include then just one topic."
                }
            ]
        },
        {
            "name": "Introduction",
            "steps": [
                {
                    "headline": "Either on the computer or in your best handwriting, write for example \"Izzy's (use your own though!",
                    "description": ")Scrapbook\" and stick it on the first page, or on the cover. Both ways work."
                },
                {
                    "headline": "Write a short description of yourself, including just little details such as your hobbies, style, details such as your age and anything like that.",
                    "description": "You could stick it onto a piece of bright card and add stickers or special motifs. Glue the piece on."
                },
                {
                    "headline": "Remember, as on any page you want a background, stick that on first and the card on afterward.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Family",
            "steps": [
                {
                    "headline": "Ask for copies of photos you may want to add or get some of your own( though if it's an original, get another copy if you still want another one).",
                    "description": ""
                },
                {
                    "headline": "Write and draw.",
                    "description": "If you know how too, why not make a family tree or draw pictures, too? Even write descriptions of your family."
                },
                {
                    "headline": "An idea is to get a piece of your most pretty notepaper and ask your family to write a little message each so you can include that too.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "scrapbook",
        "photos",
        "paper,stickers,decorations",
        "Writing and drawing materials",
        "glue, scissors etc.",
        "Storage"
    ],
    "text": " Steps Firstly, find a good quality scrapbook with plain or coloured pages. It doesn't have to be expensive or flashy either, just the right kind you want. Also, get the vital craft materials if you don't already have them, such as craft glue, scissors etc. And of course, the things to include in it! Go bargain hunting in shops such as Poundland or The works, and look for materials such as pretty backgrounds or beautiful sheets of paper. How about special little extras too, such as stickers, 3D stickers, special labels or just mementos you like? Anything that can transform a scrapbook into a better keepsake and more personalized! Find a big box or something else for storing your materials in, so all the stuff will be there when you want or need it.  A clear working space is essential, you don't want to be too cramped or squashed.  Now for some ideas to try! Of course, your scrapbook can be about absolutely anything you want but, if you're stuck for inspiration or don't have much ideas, why not take a look? It may be better to not have a theme and base it around your life, because if you do that you have so much more things to include then just one topic. Introduction Either on the computer or in your best handwriting, write for example \"Izzy's (use your own though! )Scrapbook\" and stick it on the first page, or on the cover. Both ways work. Write a short description of yourself, including just little details such as your hobbies, style, details such as your age and anything like that. You could stick it onto a piece of bright card and add stickers or special motifs. Glue the piece on. Remember, as on any page you want a background, stick that on first and the card on afterward.  Family Ask for copies of photos you may want to add or get some of your own( though if it's an original, get another copy if you still want another one).  Write and draw. If you know how too, why not make a family tree or draw pictures, too? Even write descriptions of your family. An idea is to get a piece of your most pretty notepaper and ask your family to write a little message each so you can include that too. ",
    "sentences": [
        " Steps Firstly, find a good quality scrapbook with plain or coloured pages.",
        "It doesn't have to be expensive or flashy either, just the right kind you want.",
        "Also, get the vital craft materials if you don't already have them, such as craft glue, scissors etc.",
        "And of course, the things to include in it!",
        "Go bargain hunting in shops such as Poundland or The works, and look for materials such as pretty backgrounds or beautiful sheets of paper.",
        "How about special little extras too, such as stickers, 3D stickers, special labels or just mementos you like?",
        "Anything that can transform a scrapbook into a better keepsake and more personalized!",
        "Find a big box or something else for storing your materials in, so all the stuff will be there when you want or need it.",
        "A clear working space is essential, you don't want to be too cramped or squashed.",
        "Now for some ideas to try!",
        "Of course, your scrapbook can be about absolutely anything you want but, if you're stuck for inspiration or don't have much ideas, why not take a look?",
        "It may be better to not have a theme and base it around your life, because if you do that you have so much more things to include then just one topic.",
        "Introduction Either on the computer or in your best handwriting, write for example \"Izzy's (use your own though!",
        ")Scrapbook\" and stick it on the first page, or on the cover.",
        "Both ways work.",
        "Write a short description of yourself, including just little details such as your hobbies, style, details such as your age and anything like that.",
        "You could stick it onto a piece of bright card and add stickers or special motifs.",
        "Glue the piece on.",
        "Remember, as on any page you want a background, stick that on first and the card on afterward.",
        "Family Ask for copies of photos you may want to add or get some of your own( though if it's an original, get another copy if you still want another one).",
        "Write and draw.",
        "If you know how too, why not make a family tree or draw pictures, too?",
        "Even write descriptions of your family.",
        "An idea is to get a piece of your most pretty notepaper and ask your family to write a little message each so you can include that too."
    ]
}