{
    "title": "How to Make Gluten Free Flour",
    "url": "https://www.wikihow.com/Make-Gluten-Free-Flour",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Specialty Diet Recipes",
        "Gluten Free Dishes"
    ],
    "methods": [
        {
            "name": "Making All-Purpose Flour",
            "steps": [
                {
                    "headline": "Pour all four flours into a large bowl.",
                    "description": "If you can't find tapioca flour, you can use tapioca starch instead; it's the same thing. If you'd like to make this blend using smaller amount, simply use equal parts of all four flours, then add ¼ part of tapioca flour/starch. If you are allergic to tapioca, use potato starch instead. Do not use potato flour; it's not the same thing."
                },
                {
                    "headline": "Add the xanthan gum as a gluten replacement and to allow for better binding.",
                    "description": "The trouble with gluten-free flour is that it is gluten-free. This means that when you use it instead of regular flour in a recipe, you might get slightly different results. Adding xanthan gum is not completely necessary, but it will help bind your ingredients and give you better results."
                },
                {
                    "headline": "Blend the ingredients together well with a whisk.",
                    "description": "Do not skimp on the blending; if your flours are not well-blended, your baked goods will not turn out right. It will take 3 to 5 minutes of whisking."
                },
                {
                    "headline": "Store the flour in an air-tight container.",
                    "description": "Depending on the recipe, you can use it as a direct substitute for regular flour. You may have to use a little more/less flour depending on the recipe however. It works great in just about any baked good, including breads, cakes, crepes, muffins, and even waffles."
                }
            ]
        },
        {
            "name": "Making Self-Rising Flour",
            "steps": [
                {
                    "headline": "Pour all of the ingredients into a large bowl.",
                    "description": "The ingredients in this flour will give you a similar result to what regular, self-rising flour gives you."
                },
                {
                    "headline": "Stir everything together with a whisk until it is well blended, about 3 to 5 minutes.",
                    "description": "Don't rush through this step. If your flours and starches aren't well-blended, your recipes won't turn out right."
                },
                {
                    "headline": "Store the blended flour in a large container.",
                    "description": "When you are done, transfer everything into an air-tight container. Keep it in a cool dark place."
                },
                {
                    "headline": "Use the flour in your baked goods.",
                    "description": "This blend is ideal for tings like cakes, cupcakes, muffins, and scones—basically, anything that uses baking powder as a leavener."
                }
            ]
        },
        {
            "name": "Making Baking Flour",
            "steps": [
                {
                    "headline": "Pour the white rice flour, brown rice flour, potato starch, and tapioca starch into a large bowl.",
                    "description": "Make sure that you are using potato starch and not potato flour. If you can't find any tapioca starch, however, you can use tapioca flour; it's the same thing."
                },
                {
                    "headline": "Add the nonfat dry milk powder.",
                    "description": "This is the secret ingredient that will help improve the structure of your gluten-free cakes, breads, cookies, muffins, etc. The added sugars will also create a browning reaction and lend your baked goods a more complex flavor."
                },
                {
                    "headline": "Combine the ingredients with a whisk until everything is well combined.",
                    "description": "Don't get lazy on the mixing! If you don't mix things well enough, your baked goods will have poor results. It will take about 3 to 5 minutes of good mixing."
                },
                {
                    "headline": "Pour the blended flour into an air-tight container and store it in the fridge for up to 3 months.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Trying Different Mixes",
            "steps": [
                {
                    "headline": "Make a simple, all-purpose blend using three different types of flours.",
                    "description": "Combine the ingredients listen below, and use as a substitute for anything that calls for all-purpose flour. 3 cups (450 grams) brown or white rice flour\n1 cup (125 grams) potato starch\n½ cup (65 grams) tapioca flour/starch"
                },
                {
                    "headline": "Make a blend using soy flour if you can't use potato starch.",
                    "description": "If you need a simple flour, but can't use potato starch, you can use soy flour instead. Gather the ingredients listed below, mix them well, and use the flour in your recipes. ½ cup (75 grams) brown rice flour\n¼ cup (25 grams) soy flour\n¼ cup (30 grams) tapioca flour/starch"
                },
                {
                    "headline": "Try a coconut flour blend.",
                    "description": "The coconut flour gives this blend a slightly sweet flavor, making it ideal for cakes an pastries. Mix the ingredients below, and store them in an air-tight container. 1 cup (150 grams) white rice flour\n1 cup (100 grams) oat flour\n1 cup (100 grams) coconut flour\n1 cup (125 grams) tapioca flour/starch\n¼ cup (30 grams) cornstarch\n3½ teaspoons xanthan gum"
                },
                {
                    "headline": "Try a gluten free Bisquick blend.",
                    "description": "Bisquick is used to make pancakes and waffles, but the store bought kind contains gluten. You can make your own by mixing the ingredients below:\n2 cups (300 grams) white rice flour\n1¼ cup (125 grams) coconut flour\n1 cup (125 grams) dry milk powder\n¼ to ½ cup (55 to 115 grams) granulated sugar\n½ cup (65 grams) cornstarch\n1 tablespoon baking powder\n1 tsp baking soda\n½ tsp salt"
                },
                {
                    "headline": "Add some xanthan gum or guar gum to make your recipes more effective.",
                    "description": "Gluten helps bind ingredients together. Unfortunately, when you use gluten-free flour, you lose this important property. Fortunately, xantham gum and guar gum are great substitutes for gluten, and adding them will make your blended flours more effective. How much xanthan gum or guar gum you add depends on what you are making. Each of the measurements below are for 1 cup (100 grams) of flour. If you are using more flour, use more xanthan gum or guar gum. If you are making bars, cakes, cookies, muffins, or quick-breads, add ½ teaspoon of xanthan gum or guar gum. If you are making yeast bread or baked items containing yeast, add 1 teaspoon of xanthan gum or guar gum. If you are making pizza dough or pie crust, add ½ teaspoon of xanthan gum or guar gum."
                },
                {
                    "headline": "Know that you can use single, non-gluten flours instead of blends when you are cooking.",
                    "description": "Just because a recipe, such as a sauce, calls for flour does not necessarily mean that you have to whip up a batch of blended flour. You can always substitute any of the flours below:\nUse arrowroot, amaranth, and tapioca flour to thicken roux, sauces, and pie filling. Use chickpea flour, besan, and garbanzo bean flour to bind burgers and meatballs. Substitute corn masa to make tortillas. Try corn flour and millet flour when breading meat. Use sweet rice flour to thicken gravy and sauces, and make noodles."
                }
            ]
        }
    ],
    "tyn": [
        "Large bowl",
        "Whisk",
        "Air-tight container"
    ],
    "text": " Making All-Purpose Flour Pour all four flours into a large bowl. If you can't find tapioca flour, you can use tapioca starch instead; it's the same thing. If you'd like to make this blend using smaller amount, simply use equal parts of all four flours, then add ¼ part of tapioca flour/starch. If you are allergic to tapioca, use potato starch instead. Do not use potato flour; it's not the same thing. Add the xanthan gum as a gluten replacement and to allow for better binding. The trouble with gluten-free flour is that it is gluten-free. This means that when you use it instead of regular flour in a recipe, you might get slightly different results. Adding xanthan gum is not completely necessary, but it will help bind your ingredients and give you better results. Blend the ingredients together well with a whisk. Do not skimp on the blending; if your flours are not well-blended, your baked goods will not turn out right. It will take 3 to 5 minutes of whisking. Store the flour in an air-tight container. Depending on the recipe, you can use it as a direct substitute for regular flour. You may have to use a little more/less flour depending on the recipe however. It works great in just about any baked good, including breads, cakes, crepes, muffins, and even waffles. Making Self-Rising Flour Pour all of the ingredients into a large bowl. The ingredients in this flour will give you a similar result to what regular, self-rising flour gives you. Stir everything together with a whisk until it is well blended, about 3 to 5 minutes. Don't rush through this step. If your flours and starches aren't well-blended, your recipes won't turn out right. Store the blended flour in a large container. When you are done, transfer everything into an air-tight container. Keep it in a cool dark place. Use the flour in your baked goods. This blend is ideal for tings like cakes, cupcakes, muffins, and scones—basically, anything that uses baking powder as a leavener. Making Baking Flour Pour the white rice flour, brown rice flour, potato starch, and tapioca starch into a large bowl. Make sure that you are using potato starch and not potato flour. If you can't find any tapioca starch, however, you can use tapioca flour; it's the same thing. Add the nonfat dry milk powder. This is the secret ingredient that will help improve the structure of your gluten-free cakes, breads, cookies, muffins, etc. The added sugars will also create a browning reaction and lend your baked goods a more complex flavor. Combine the ingredients with a whisk until everything is well combined. Don't get lazy on the mixing! If you don't mix things well enough, your baked goods will have poor results. It will take about 3 to 5 minutes of good mixing. Pour the blended flour into an air-tight container and store it in the fridge for up to 3 months.  Trying Different Mixes Make a simple, all-purpose blend using three different types of flours. Combine the ingredients listen below, and use as a substitute for anything that calls for all-purpose flour. 3 cups (450 grams) brown or white rice flour\n1 cup (125 grams) potato starch\n½ cup (65 grams) tapioca flour/starch Make a blend using soy flour if you can't use potato starch. If you need a simple flour, but can't use potato starch, you can use soy flour instead. Gather the ingredients listed below, mix them well, and use the flour in your recipes. ½ cup (75 grams) brown rice flour\n¼ cup (25 grams) soy flour\n¼ cup (30 grams) tapioca flour/starch Try a coconut flour blend. The coconut flour gives this blend a slightly sweet flavor, making it ideal for cakes an pastries. Mix the ingredients below, and store them in an air-tight container. 1 cup (150 grams) white rice flour\n1 cup (100 grams) oat flour\n1 cup (100 grams) coconut flour\n1 cup (125 grams) tapioca flour/starch\n¼ cup (30 grams) cornstarch\n3½ teaspoons xanthan gum Try a gluten free Bisquick blend. Bisquick is used to make pancakes and waffles, but the store bought kind contains gluten. You can make your own by mixing the ingredients below:\n2 cups (300 grams) white rice flour\n1¼ cup (125 grams) coconut flour\n1 cup (125 grams) dry milk powder\n¼ to ½ cup (55 to 115 grams) granulated sugar\n½ cup (65 grams) cornstarch\n1 tablespoon baking powder\n1 tsp baking soda\n½ tsp salt Add some xanthan gum or guar gum to make your recipes more effective. Gluten helps bind ingredients together. Unfortunately, when you use gluten-free flour, you lose this important property. Fortunately, xantham gum and guar gum are great substitutes for gluten, and adding them will make your blended flours more effective. How much xanthan gum or guar gum you add depends on what you are making. Each of the measurements below are for 1 cup (100 grams) of flour. If you are using more flour, use more xanthan gum or guar gum. If you are making bars, cakes, cookies, muffins, or quick-breads, add ½ teaspoon of xanthan gum or guar gum. If you are making yeast bread or baked items containing yeast, add 1 teaspoon of xanthan gum or guar gum. If you are making pizza dough or pie crust, add ½ teaspoon of xanthan gum or guar gum. Know that you can use single, non-gluten flours instead of blends when you are cooking. Just because a recipe, such as a sauce, calls for flour does not necessarily mean that you have to whip up a batch of blended flour. You can always substitute any of the flours below:\nUse arrowroot, amaranth, and tapioca flour to thicken roux, sauces, and pie filling. Use chickpea flour, besan, and garbanzo bean flour to bind burgers and meatballs. Substitute corn masa to make tortillas. Try corn flour and millet flour when breading meat. Use sweet rice flour to thicken gravy and sauces, and make noodles.",
    "sentences": [
        " Making All-Purpose Flour Pour all four flours into a large bowl.",
        "If you can't find tapioca flour, you can use tapioca starch instead; it's the same thing.",
        "If you'd like to make this blend using smaller amount, simply use equal parts of all four flours, then add ¼ part of tapioca flour/starch.",
        "If you are allergic to tapioca, use potato starch instead.",
        "Do not use potato flour; it's not the same thing.",
        "Add the xanthan gum as a gluten replacement and to allow for better binding.",
        "The trouble with gluten-free flour is that it is gluten-free.",
        "This means that when you use it instead of regular flour in a recipe, you might get slightly different results.",
        "Adding xanthan gum is not completely necessary, but it will help bind your ingredients and give you better results.",
        "Blend the ingredients together well with a whisk.",
        "Do not skimp on the blending; if your flours are not well-blended, your baked goods will not turn out right.",
        "It will take 3 to 5 minutes of whisking.",
        "Store the flour in an air-tight container.",
        "Depending on the recipe, you can use it as a direct substitute for regular flour.",
        "You may have to use a little more/less flour depending on the recipe however.",
        "It works great in just about any baked good, including breads, cakes, crepes, muffins, and even waffles.",
        "Making Self-Rising Flour Pour all of the ingredients into a large bowl.",
        "The ingredients in this flour will give you a similar result to what regular, self-rising flour gives you.",
        "Stir everything together with a whisk until it is well blended, about 3 to 5 minutes.",
        "Don't rush through this step.",
        "If your flours and starches aren't well-blended, your recipes won't turn out right.",
        "Store the blended flour in a large container.",
        "When you are done, transfer everything into an air-tight container.",
        "Keep it in a cool dark place.",
        "Use the flour in your baked goods.",
        "This blend is ideal for tings like cakes, cupcakes, muffins, and scones—basically, anything that uses baking powder as a leavener.",
        "Making Baking Flour Pour the white rice flour, brown rice flour, potato starch, and tapioca starch into a large bowl.",
        "Make sure that you are using potato starch and not potato flour.",
        "If you can't find any tapioca starch, however, you can use tapioca flour; it's the same thing.",
        "Add the nonfat dry milk powder.",
        "This is the secret ingredient that will help improve the structure of your gluten-free cakes, breads, cookies, muffins, etc.",
        "The added sugars will also create a browning reaction and lend your baked goods a more complex flavor.",
        "Combine the ingredients with a whisk until everything is well combined.",
        "Don't get lazy on the mixing!",
        "If you don't mix things well enough, your baked goods will have poor results.",
        "It will take about 3 to 5 minutes of good mixing.",
        "Pour the blended flour into an air-tight container and store it in the fridge for up to 3 months.",
        "Trying Different Mixes Make a simple, all-purpose blend using three different types of flours.",
        "Combine the ingredients listen below, and use as a substitute for anything that calls for all-purpose flour.",
        "3 cups (450 grams) brown or white rice flour\n1 cup (125 grams) potato starch\n½ cup (65 grams) tapioca flour/starch Make a blend using soy flour if you can't use potato starch.",
        "If you need a simple flour, but can't use potato starch, you can use soy flour instead.",
        "Gather the ingredients listed below, mix them well, and use the flour in your recipes.",
        "½ cup (75 grams) brown rice flour\n¼ cup (25 grams) soy flour\n¼ cup (30 grams) tapioca flour/starch Try a coconut flour blend.",
        "The coconut flour gives this blend a slightly sweet flavor, making it ideal for cakes an pastries.",
        "Mix the ingredients below, and store them in an air-tight container.",
        "1 cup (150 grams) white rice flour\n1 cup (100 grams) oat flour\n1 cup (100 grams) coconut flour\n1 cup (125 grams) tapioca flour/starch\n¼ cup (30 grams) cornstarch\n3½ teaspoons xanthan gum Try a gluten free Bisquick blend.",
        "Bisquick is used to make pancakes and waffles, but the store bought kind contains gluten.",
        "You can make your own by mixing the ingredients below:\n2 cups (300 grams) white rice flour\n1¼ cup (125 grams) coconut flour\n1 cup (125 grams) dry milk powder\n¼ to ½ cup (55 to 115 grams) granulated sugar\n½ cup (65 grams) cornstarch\n1 tablespoon baking powder\n1 tsp baking soda\n½ tsp salt Add some xanthan gum or guar gum to make your recipes more effective.",
        "Gluten helps bind ingredients together.",
        "Unfortunately, when you use gluten-free flour, you lose this important property.",
        "Fortunately, xantham gum and guar gum are great substitutes for gluten, and adding them will make your blended flours more effective.",
        "How much xanthan gum or guar gum you add depends on what you are making.",
        "Each of the measurements below are for 1 cup (100 grams) of flour.",
        "If you are using more flour, use more xanthan gum or guar gum.",
        "If you are making bars, cakes, cookies, muffins, or quick-breads, add ½ teaspoon of xanthan gum or guar gum.",
        "If you are making yeast bread or baked items containing yeast, add 1 teaspoon of xanthan gum or guar gum.",
        "If you are making pizza dough or pie crust, add ½ teaspoon of xanthan gum or guar gum.",
        "Know that you can use single, non-gluten flours instead of blends when you are cooking.",
        "Just because a recipe, such as a sauce, calls for flour does not necessarily mean that you have to whip up a batch of blended flour.",
        "You can always substitute any of the flours below:\nUse arrowroot, amaranth, and tapioca flour to thicken roux, sauces, and pie filling.",
        "Use chickpea flour, besan, and garbanzo bean flour to bind burgers and meatballs.",
        "Substitute corn masa to make tortillas.",
        "Try corn flour and millet flour when breading meat.",
        "Use sweet rice flour to thicken gravy and sauces, and make noodles."
    ]
}