{
    "title": "How to Install a New Dishwasher",
    "url": "https://www.wikihow.com/Install-a-New-Dishwasher",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Cleaning",
        "House Cleaning"
    ],
    "methods": [
        {
            "name": "Preparing to Install",
            "steps": [
                {
                    "headline": "Turn off the water.",
                    "description": "Turn off the water supply at the valve. Usually this valve will be under the sink."
                },
                {
                    "headline": "Test the water.",
                    "description": "Run the hot water on the sink to insure that the water has been shut off. With older houses, the shut off valve may be damaged and it will need replacing. If this is the case then the water will either have to be turned of at the house main or at the street."
                },
                {
                    "headline": "Turn off the power.",
                    "description": "At the electrical service panel, switch off the power for the dishwasher."
                },
                {
                    "headline": "Test the power.",
                    "description": "Test the electricity to ensure that it is turned off. Electrical panels are often mislabeled, especially if they are in an old house."
                }
            ]
        },
        {
            "name": "Disconnect and Remove  the Dishwasher",
            "steps": [
                {
                    "headline": "Remove the attachment screws.",
                    "description": "At the top of the dishwasher counter flange, you will find some screws. Unscrew them with the screwdriver to remove them."
                },
                {
                    "headline": "Remove the cover.",
                    "description": "Now pull out the bottom cover."
                },
                {
                    "headline": "Cover the wires.",
                    "description": "At the end of the wires, attach wire nuts. Now remove the wires from the terminal screws and tuck them out of the way."
                },
                {
                    "headline": "Locate the water supply.",
                    "description": "Find out where the water supply is, usually under the washer."
                },
                {
                    "headline": "Disconnect the supply.",
                    "description": "Disconnect the water supply line from the water inlet by removing the nut."
                },
                {
                    "headline": "Remove the hose.",
                    "description": "Loosen the clamp and remove the hose to disconnect the drain hose from beneath the sink."
                },
                {
                    "headline": "Move the dishwasher.",
                    "description": "After disconnecting all the attachments, place a blanket in front of the old dishwasher, slowly lift up the old dishwasher and put it onto the blanket."
                },
                {
                    "headline": "Prepare for a mess.",
                    "description": "Keep a towel ready with you because in this process of lifting up the old dishwasher and putting it onto the blanket, some water may spill out. If it happens, just wipe it with the towel."
                },
                {
                    "headline": "Clean the area.",
                    "description": "Now that you have removed the old dishwasher, clean the area where the old dishwasher was placed and where you have to install the new one."
                }
            ]
        },
        {
            "name": "Installing The New Dishwasher",
            "steps": [
                {
                    "headline": "Position the washer.",
                    "description": "Position the new dishwasher on its back."
                },
                {
                    "headline": "Connect the hose.",
                    "description": "Connect the drain hose with a compression clamp."
                },
                {
                    "headline": "Attach the fittings.",
                    "description": "Wrap the water line connection with Teflon tape and attach the 90-degree brass fitting that is used to connect the water line, also known as a dishwasher 90."
                },
                {
                    "headline": "Slide in the new dishwasher.",
                    "description": "Screw the front legs of the new dishwasher in so that you can easily slide the unit into place. Meanwhile, have an assistant pull the drain hose through under the sink as you go."
                },
                {
                    "headline": "Connect the line.",
                    "description": "Connect the water line underneath the dishwasher to the dishwasher 90."
                },
                {
                    "headline": "Arrange the cable.",
                    "description": "Pass the electric cable through the sleeve on the dishwasher and tighten the sleeve so that the cable can not be pulled out."
                },
                {
                    "headline": "Connect the wires.",
                    "description": "Now make all the electrical wired connections – ground wire to the green screw, white wire to white wire, and black wire to black wire. Use wire nuts to secure the connection."
                },
                {
                    "headline": "Connect the hose.",
                    "description": "Connect the new drain hose at its previous position."
                }
            ]
        },
        {
            "name": "Finishing Details",
            "steps": [
                {
                    "headline": "Fill the line.",
                    "description": "Fill the water line by opening the hot water valve."
                },
                {
                    "headline": "Check for leaks.",
                    "description": "Carefully check if there are any leaks."
                },
                {
                    "headline": "Test the connections.",
                    "description": "If any leaks occur, recheck all the connections and test again."
                },
                {
                    "headline": "Adjust the height.",
                    "description": "Adjust front legs of the dishwasher down and position it properly on a level."
                },
                {
                    "headline": "Attach the mounting screws.",
                    "description": "Drive the small mounting screws into the underside of the countertop through the flange in order to attach the dishwasher to the countertop."
                },
                {
                    "headline": "Turn on the power.",
                    "description": "Turn on the power and your dishwasher is ready to work."
                }
            ]
        }
    ],
    "tyn": [
        "Screwdriver",
        "Multimeter",
        "Slip-joint pliers",
        "Needle-nose pliers",
        "Adjustable wrench"
    ],
    "text": " Preparing to Install Turn off the water. Turn off the water supply at the valve. Usually this valve will be under the sink. Test the water. Run the hot water on the sink to insure that the water has been shut off. With older houses, the shut off valve may be damaged and it will need replacing. If this is the case then the water will either have to be turned of at the house main or at the street. Turn off the power. At the electrical service panel, switch off the power for the dishwasher. Test the power. Test the electricity to ensure that it is turned off. Electrical panels are often mislabeled, especially if they are in an old house. Disconnect and Remove  the Dishwasher Remove the attachment screws. At the top of the dishwasher counter flange, you will find some screws. Unscrew them with the screwdriver to remove them. Remove the cover. Now pull out the bottom cover. Cover the wires. At the end of the wires, attach wire nuts. Now remove the wires from the terminal screws and tuck them out of the way. Locate the water supply. Find out where the water supply is, usually under the washer. Disconnect the supply. Disconnect the water supply line from the water inlet by removing the nut. Remove the hose. Loosen the clamp and remove the hose to disconnect the drain hose from beneath the sink. Move the dishwasher. After disconnecting all the attachments, place a blanket in front of the old dishwasher, slowly lift up the old dishwasher and put it onto the blanket. Prepare for a mess. Keep a towel ready with you because in this process of lifting up the old dishwasher and putting it onto the blanket, some water may spill out. If it happens, just wipe it with the towel. Clean the area. Now that you have removed the old dishwasher, clean the area where the old dishwasher was placed and where you have to install the new one. Installing The New Dishwasher Position the washer. Position the new dishwasher on its back. Connect the hose. Connect the drain hose with a compression clamp. Attach the fittings. Wrap the water line connection with Teflon tape and attach the 90-degree brass fitting that is used to connect the water line, also known as a dishwasher 90. Slide in the new dishwasher. Screw the front legs of the new dishwasher in so that you can easily slide the unit into place. Meanwhile, have an assistant pull the drain hose through under the sink as you go. Connect the line. Connect the water line underneath the dishwasher to the dishwasher 90. Arrange the cable. Pass the electric cable through the sleeve on the dishwasher and tighten the sleeve so that the cable can not be pulled out. Connect the wires. Now make all the electrical wired connections – ground wire to the green screw, white wire to white wire, and black wire to black wire. Use wire nuts to secure the connection. Connect the hose. Connect the new drain hose at its previous position. Finishing Details Fill the line. Fill the water line by opening the hot water valve. Check for leaks. Carefully check if there are any leaks. Test the connections. If any leaks occur, recheck all the connections and test again. Adjust the height. Adjust front legs of the dishwasher down and position it properly on a level. Attach the mounting screws. Drive the small mounting screws into the underside of the countertop through the flange in order to attach the dishwasher to the countertop. Turn on the power. Turn on the power and your dishwasher is ready to work.",
    "sentences": [
        " Preparing to Install Turn off the water.",
        "Turn off the water supply at the valve.",
        "Usually this valve will be under the sink.",
        "Test the water.",
        "Run the hot water on the sink to insure that the water has been shut off.",
        "With older houses, the shut off valve may be damaged and it will need replacing.",
        "If this is the case then the water will either have to be turned of at the house main or at the street.",
        "Turn off the power.",
        "At the electrical service panel, switch off the power for the dishwasher.",
        "Test the power.",
        "Test the electricity to ensure that it is turned off.",
        "Electrical panels are often mislabeled, especially if they are in an old house.",
        "Disconnect and Remove  the Dishwasher Remove the attachment screws.",
        "At the top of the dishwasher counter flange, you will find some screws.",
        "Unscrew them with the screwdriver to remove them.",
        "Remove the cover.",
        "Now pull out the bottom cover.",
        "Cover the wires.",
        "At the end of the wires, attach wire nuts.",
        "Now remove the wires from the terminal screws and tuck them out of the way.",
        "Locate the water supply.",
        "Find out where the water supply is, usually under the washer.",
        "Disconnect the supply.",
        "Disconnect the water supply line from the water inlet by removing the nut.",
        "Remove the hose.",
        "Loosen the clamp and remove the hose to disconnect the drain hose from beneath the sink.",
        "Move the dishwasher.",
        "After disconnecting all the attachments, place a blanket in front of the old dishwasher, slowly lift up the old dishwasher and put it onto the blanket.",
        "Prepare for a mess.",
        "Keep a towel ready with you because in this process of lifting up the old dishwasher and putting it onto the blanket, some water may spill out.",
        "If it happens, just wipe it with the towel.",
        "Clean the area.",
        "Now that you have removed the old dishwasher, clean the area where the old dishwasher was placed and where you have to install the new one.",
        "Installing The New Dishwasher Position the washer.",
        "Position the new dishwasher on its back.",
        "Connect the hose.",
        "Connect the drain hose with a compression clamp.",
        "Attach the fittings.",
        "Wrap the water line connection with Teflon tape and attach the 90-degree brass fitting that is used to connect the water line, also known as a dishwasher 90.",
        "Slide in the new dishwasher.",
        "Screw the front legs of the new dishwasher in so that you can easily slide the unit into place.",
        "Meanwhile, have an assistant pull the drain hose through under the sink as you go.",
        "Connect the line.",
        "Connect the water line underneath the dishwasher to the dishwasher 90.",
        "Arrange the cable.",
        "Pass the electric cable through the sleeve on the dishwasher and tighten the sleeve so that the cable can not be pulled out.",
        "Connect the wires.",
        "Now make all the electrical wired connections – ground wire to the green screw, white wire to white wire, and black wire to black wire.",
        "Use wire nuts to secure the connection.",
        "Connect the hose.",
        "Connect the new drain hose at its previous position.",
        "Finishing Details Fill the line.",
        "Fill the water line by opening the hot water valve.",
        "Check for leaks.",
        "Carefully check if there are any leaks.",
        "Test the connections.",
        "If any leaks occur, recheck all the connections and test again.",
        "Adjust the height.",
        "Adjust front legs of the dishwasher down and position it properly on a level.",
        "Attach the mounting screws.",
        "Drive the small mounting screws into the underside of the countertop through the flange in order to attach the dishwasher to the countertop.",
        "Turn on the power.",
        "Turn on the power and your dishwasher is ready to work."
    ]
}