{
    "title": "How to Keep Your Diary a Secret",
    "url": "https://www.wikihow.com/Keep-Your-Diary-a-Secret",
    "category_hierarchy": [
        "Education and Communications",
        "Stationery",
        "Diaries and Journals"
    ],
    "steps": [
        {
            "headline": "Buy yourself a diary that looks like a book.",
            "description": "Like, don't buy a diary that says 'diary' across the front. Just buy a cute one that could be a school textbook, or whatever. It's a good idea to buy your diary when you are out alone, so that nobody gets suspicious."
        },
        {
            "headline": "Hide your diary.",
            "description": "Not in the typical places, like under your bed or in a pillowcase. Hide it between the mattresses of your bed, In that purse at the back of your closet you never use, or even tucked away in the back of your bookshelf."
        },
        {
            "headline": "Don't write, 'Do not enter' across the spine of the book, as this will make people want to read it even more!",
            "description": ""
        },
        {
            "headline": "Get a fake, obvious diary.",
            "description": "Across it, write, 'my diary, do not enter'. Inside, write a few pages of fake entries."
        },
        {
            "headline": "In your real diary, open to random pages and write fake entries there, too.",
            "description": ""
        },
        {
            "headline": "Let them know you have a 'fake diary'.",
            "description": "Example: \"So, yesterday I was writing in my diary, and...\""
        },
        {
            "headline": "Keep your fake diary obvious and in-reach.",
            "description": ""
        },
        {
            "headline": "If possible, put a book cover over your real diary so it looks like that book, and slip it back into your bookshelf.",
            "description": "Nobody will suspect a thing."
        },
        {
            "headline": "If you find your parents skimming through your diary, sit down with them and talk.",
            "description": "They will understand and leave you alone. But if you have truly nosy parents, they will be suspicious of you and not know why you don't want them to read your diary. Talk some more, calmly and respectfully."
        },
        {
            "headline": "Consider keeping your diary in code.",
            "description": "Use the second or third letter of someone's name instead of their whole name if you don't want a reader to know which person you're writing about. Another option is to write your own stories as if they're rumors you heard. Instead of \"I hate school\", say \"I hear that Alex hates school\", for instance. If you have a hobby that you fear a reader would disapprove of, record your achievements as if they were in a more acceptable hobby. Perhaps if you are playing board games when a reader wishes you would play sports, you could decide to always say football instead of Monopoly and tennis instead of Chess. So the memory \"I beat Brook at chess\" becomes the encoded message \"I beat Brook at tennis\"."
        }
    ],
    "tyn": [
        "a subtle book that could be anything",
        "a pen",
        "a large, outstanding notebook"
    ],
    "text": " Buy yourself a diary that looks like a book. Like, don't buy a diary that says 'diary' across the front. Just buy a cute one that could be a school textbook, or whatever. It's a good idea to buy your diary when you are out alone, so that nobody gets suspicious. Hide your diary. Not in the typical places, like under your bed or in a pillowcase. Hide it between the mattresses of your bed, In that purse at the back of your closet you never use, or even tucked away in the back of your bookshelf. Don't write, 'Do not enter' across the spine of the book, as this will make people want to read it even more!  Get a fake, obvious diary. Across it, write, 'my diary, do not enter'. Inside, write a few pages of fake entries. In your real diary, open to random pages and write fake entries there, too.  Let them know you have a 'fake diary'. Example: \"So, yesterday I was writing in my diary, and...\" Keep your fake diary obvious and in-reach.  If possible, put a book cover over your real diary so it looks like that book, and slip it back into your bookshelf. Nobody will suspect a thing. If you find your parents skimming through your diary, sit down with them and talk. They will understand and leave you alone. But if you have truly nosy parents, they will be suspicious of you and not know why you don't want them to read your diary. Talk some more, calmly and respectfully. Consider keeping your diary in code. Use the second or third letter of someone's name instead of their whole name if you don't want a reader to know which person you're writing about. Another option is to write your own stories as if they're rumors you heard. Instead of \"I hate school\", say \"I hear that Alex hates school\", for instance. If you have a hobby that you fear a reader would disapprove of, record your achievements as if they were in a more acceptable hobby. Perhaps if you are playing board games when a reader wishes you would play sports, you could decide to always say football instead of Monopoly and tennis instead of Chess. So the memory \"I beat Brook at chess\" becomes the encoded message \"I beat Brook at tennis\".",
    "sentences": [
        " Buy yourself a diary that looks like a book.",
        "Like, don't buy a diary that says 'diary' across the front.",
        "Just buy a cute one that could be a school textbook, or whatever.",
        "It's a good idea to buy your diary when you are out alone, so that nobody gets suspicious.",
        "Hide your diary.",
        "Not in the typical places, like under your bed or in a pillowcase.",
        "Hide it between the mattresses of your bed, In that purse at the back of your closet you never use, or even tucked away in the back of your bookshelf.",
        "Don't write, 'Do not enter' across the spine of the book, as this will make people want to read it even more!",
        "Get a fake, obvious diary.",
        "Across it, write, 'my diary, do not enter'.",
        "Inside, write a few pages of fake entries.",
        "In your real diary, open to random pages and write fake entries there, too.",
        "Let them know you have a 'fake diary'.",
        "Example: \"So, yesterday I was writing in my diary, and...\" Keep your fake diary obvious and in-reach.",
        "If possible, put a book cover over your real diary so it looks like that book, and slip it back into your bookshelf.",
        "Nobody will suspect a thing.",
        "If you find your parents skimming through your diary, sit down with them and talk.",
        "They will understand and leave you alone.",
        "But if you have truly nosy parents, they will be suspicious of you and not know why you don't want them to read your diary.",
        "Talk some more, calmly and respectfully.",
        "Consider keeping your diary in code.",
        "Use the second or third letter of someone's name instead of their whole name if you don't want a reader to know which person you're writing about.",
        "Another option is to write your own stories as if they're rumors you heard.",
        "Instead of \"I hate school\", say \"I hear that Alex hates school\", for instance.",
        "If you have a hobby that you fear a reader would disapprove of, record your achievements as if they were in a more acceptable hobby.",
        "Perhaps if you are playing board games when a reader wishes you would play sports, you could decide to always say football instead of Monopoly and tennis instead of Chess.",
        "So the memory \"I beat Brook at chess\" becomes the encoded message \"I beat Brook at tennis\"."
    ]
}