{
    "title": "How to Make a Paper Cone or Cornet for Icing",
    "url": "https://www.wikihow.com/Make-a-Paper-Cone-or-Cornet-for-Icing",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking"
    ],
    "steps": [
        {
            "headline": "Cut parchment paper into a right-triangle (one corner 90-degrees, the two short sides equal in length).",
            "description": "Alternately, buy parchment paper that is already cut into triangles for cones (available at cake-decorating stores)."
        },
        {
            "headline": "Hold the triangle with the \"peak\" at the top.",
            "description": "Label the points:\nA (bottom right)\nB (bottom left) and\nC (top peak)."
        },
        {
            "headline": "With your dominant hand (your \"writing\" hand), hold the triangle like a pyramid.",
            "description": "This will have the \"north\" peak (corner C) pointing towards you."
        },
        {
            "headline": "With your non-writing hand, bring the bottom right corner (corner A) up to meet the top corner C or \"north\" peak.",
            "description": ""
        },
        {
            "headline": "Place corner A directly on top of the \"north\" peak C. Have the ends directly over each other (no overlapping).",
            "description": ""
        },
        {
            "headline": "Hold the seams of A and C in your writing hand.",
            "description": "With your non-writing hand, bring corner B completely around the cone and up to where corners A and C meet. All three letters should line up together. Make sure all seams are dead center and the hole at the bottom of the cone is extremely small or non-existent."
        },
        {
            "headline": "Place a piece of tape on the seam to keep them together and centered.",
            "description": ""
        },
        {
            "headline": "Fold about 1-inch of top edge inside the cone.",
            "description": ""
        },
        {
            "headline": "Fill with melted chocolate or royal icing and start icing!",
            "description": ""
        }
    ],
    "tyn": [
        "Parchment/baking paper",
        "Scissors",
        "Tape"
    ],
    "text": " Cut parchment paper into a right-triangle (one corner 90-degrees, the two short sides equal in length). Alternately, buy parchment paper that is already cut into triangles for cones (available at cake-decorating stores). Hold the triangle with the \"peak\" at the top. Label the points:\nA (bottom right)\nB (bottom left) and\nC (top peak). With your dominant hand (your \"writing\" hand), hold the triangle like a pyramid. This will have the \"north\" peak (corner C) pointing towards you. With your non-writing hand, bring the bottom right corner (corner A) up to meet the top corner C or \"north\" peak.  Place corner A directly on top of the \"north\" peak C. Have the ends directly over each other (no overlapping).  Hold the seams of A and C in your writing hand. With your non-writing hand, bring corner B completely around the cone and up to where corners A and C meet. All three letters should line up together. Make sure all seams are dead center and the hole at the bottom of the cone is extremely small or non-existent. Place a piece of tape on the seam to keep them together and centered.  Fold about 1-inch of top edge inside the cone.  Fill with melted chocolate or royal icing and start icing! ",
    "sentences": [
        " Cut parchment paper into a right-triangle (one corner 90-degrees, the two short sides equal in length).",
        "Alternately, buy parchment paper that is already cut into triangles for cones (available at cake-decorating stores).",
        "Hold the triangle with the \"peak\" at the top.",
        "Label the points:\nA (bottom right)\nB (bottom left) and\nC (top peak).",
        "With your dominant hand (your \"writing\" hand), hold the triangle like a pyramid.",
        "This will have the \"north\" peak (corner C) pointing towards you.",
        "With your non-writing hand, bring the bottom right corner (corner A) up to meet the top corner C or \"north\" peak.",
        "Place corner A directly on top of the \"north\" peak C. Have the ends directly over each other (no overlapping).",
        "Hold the seams of A and C in your writing hand.",
        "With your non-writing hand, bring corner B completely around the cone and up to where corners A and C meet.",
        "All three letters should line up together.",
        "Make sure all seams are dead center and the hole at the bottom of the cone is extremely small or non-existent.",
        "Place a piece of tape on the seam to keep them together and centered.",
        "Fold about 1-inch of top edge inside the cone.",
        "Fill with melted chocolate or royal icing and start icing!"
    ]
}