{
    "title": "How to Set a Sleep Schedule",
    "url": "https://www.wikihow.com/Set-a-Sleep-Schedule",
    "category_hierarchy": [
        "Health",
        "Sleep Health",
        "Better Sleeping"
    ],
    "parts": [
        {
            "name": "Determining an Ideal Sleep Schedule",
            "steps": [
                {
                    "headline": "Use your age to determine how long you should be sleeping.",
                    "description": "People in your household may require differing amounts of sleep. We gradually grow to require less sleep throughout our lives. Babies and children to two years old require between 11 and 17 hours of sleep, including nights and naps. School-aged children up to age 17 require eight to 13 hours of sleep. Young adults and adults require seven to nine hours of sleep. Adults over 65 require seven to eight hours of sleep."
                },
                {
                    "headline": "Pay attention to your body.",
                    "description": "Each person is different, and the amount of sleep they require can be 1 to 2 hours below and above these recommended thresholds. Decide how much sleep you require in order to feel well rested."
                },
                {
                    "headline": "Set a target bedtime and a target wake up time.",
                    "description": "You will want to stay within one and two hours of this time even on weekends in order to reset your Circadian rhythms."
                }
            ]
        },
        {
            "name": "Putting a Sleep Schedule into Practice",
            "steps": [
                {
                    "headline": "Go to sleep approximately 15 minutes earlier (or later) every night, until you hit your ideal bedtime.",
                    "description": "Plan to wake up 15 minutes earlier (or later) as well. This gradual change gives your body time to adjust to lights and develop a new sleep routine. Sticking to this gradual adjustment is important even on the weekends. Staying up too late or sleeping in will make it harder for your body to set a new schedule."
                },
                {
                    "headline": "Start your sleep schedule using alarms.",
                    "description": "For instance, set an alarm on your phone or fitness tracker to cue the start of your bedtime routine. Set a light alarm for the morning. If you follow your bedtime routine strictly, you can eventually stop using an alarm. Your body will wake when you feel rested."
                },
                {
                    "headline": "Open the curtains as soon as you wake up.",
                    "description": "Try to get outside and into the sun for even better results. If you live in a place that isn’t sunny or you get up before the sun rises, try using a sunlight lamp to tell your body it’s time to get up."
                },
                {
                    "headline": "Start a bedtime routine.",
                    "description": "Start to get ready for bed an hour before. Turn off all machines that emit blue light and keep them out of the bedroom. Successful bedtime routines can include a warm bath or shower, stretching, yoga, personal hygiene, meditation, deep breathing, reading or writing. Choose the habits that work best for you."
                },
                {
                    "headline": "Set a wakeup routine.",
                    "description": "Ban the snooze button so that you can sleep until you must get up and enjoy more uninterrupted sleep. Once you get up, ensure your morning includes rituals like coffee, a shower, breakfast and some form of movement, in order to get the blood flowing and your brain working."
                }
            ]
        },
        {
            "name": "Maintaining Good Sleep Hygiene",
            "steps": [
                {
                    "headline": "Plan your meals to get smaller throughout the day.",
                    "description": "Enjoy a big breakfast that includes protein, healthy fats and carbohydrates. You will draw on this energy throughout the day. Include light snacks and a lunch rich in protein to make you feel fuller longer. Have a light dinner, since you are going to generally use fewer calories at night. Eat your dinner at least three hours before you go to bed, so that you don’t suffer from heartburn or reflux."
                },
                {
                    "headline": "Avoid coffee, alcohol and other liquids in the evening.",
                    "description": "It is good to avoid all caffeine six hours before you go to bed. Limit the amount you drink in the evening to avoid waking up to use the bathroom. Alcohol, nicotine and even chocolate can have stimulating effects that prevent good sleep."
                },
                {
                    "headline": "Avoid naps.",
                    "description": "If you must nap, limit it to 20 minutes. This will help you get some refreshing rest, but it will keep you from a deep sleep that can keep you groggy and hurt your sleep schedule."
                },
                {
                    "headline": "Exercise each day.",
                    "description": "Doctors suggest 150 minutes per week to help you sleep well. Avoid working out intensely before bed, as it can hurt your sleep cycles. Try light exercise like stretching or yoga before bed."
                }
            ]
        }
    ],
    "tyn": [
        "Phone or activity tracker alarm",
        "Sunlight lamp",
        "Smartphone with night mode"
    ],
    "text": " Determining an Ideal Sleep Schedule Use your age to determine how long you should be sleeping. People in your household may require differing amounts of sleep. We gradually grow to require less sleep throughout our lives. Babies and children to two years old require between 11 and 17 hours of sleep, including nights and naps. School-aged children up to age 17 require eight to 13 hours of sleep. Young adults and adults require seven to nine hours of sleep. Adults over 65 require seven to eight hours of sleep. Pay attention to your body. Each person is different, and the amount of sleep they require can be 1 to 2 hours below and above these recommended thresholds. Decide how much sleep you require in order to feel well rested. Set a target bedtime and a target wake up time. You will want to stay within one and two hours of this time even on weekends in order to reset your Circadian rhythms. Putting a Sleep Schedule into Practice Go to sleep approximately 15 minutes earlier (or later) every night, until you hit your ideal bedtime. Plan to wake up 15 minutes earlier (or later) as well. This gradual change gives your body time to adjust to lights and develop a new sleep routine. Sticking to this gradual adjustment is important even on the weekends. Staying up too late or sleeping in will make it harder for your body to set a new schedule. Start your sleep schedule using alarms. For instance, set an alarm on your phone or fitness tracker to cue the start of your bedtime routine. Set a light alarm for the morning. If you follow your bedtime routine strictly, you can eventually stop using an alarm. Your body will wake when you feel rested. Open the curtains as soon as you wake up. Try to get outside and into the sun for even better results. If you live in a place that isn’t sunny or you get up before the sun rises, try using a sunlight lamp to tell your body it’s time to get up. Start a bedtime routine. Start to get ready for bed an hour before. Turn off all machines that emit blue light and keep them out of the bedroom. Successful bedtime routines can include a warm bath or shower, stretching, yoga, personal hygiene, meditation, deep breathing, reading or writing. Choose the habits that work best for you. Set a wakeup routine. Ban the snooze button so that you can sleep until you must get up and enjoy more uninterrupted sleep. Once you get up, ensure your morning includes rituals like coffee, a shower, breakfast and some form of movement, in order to get the blood flowing and your brain working. Maintaining Good Sleep Hygiene Plan your meals to get smaller throughout the day. Enjoy a big breakfast that includes protein, healthy fats and carbohydrates. You will draw on this energy throughout the day. Include light snacks and a lunch rich in protein to make you feel fuller longer. Have a light dinner, since you are going to generally use fewer calories at night. Eat your dinner at least three hours before you go to bed, so that you don’t suffer from heartburn or reflux. Avoid coffee, alcohol and other liquids in the evening. It is good to avoid all caffeine six hours before you go to bed. Limit the amount you drink in the evening to avoid waking up to use the bathroom. Alcohol, nicotine and even chocolate can have stimulating effects that prevent good sleep. Avoid naps. If you must nap, limit it to 20 minutes. This will help you get some refreshing rest, but it will keep you from a deep sleep that can keep you groggy and hurt your sleep schedule. Exercise each day. Doctors suggest 150 minutes per week to help you sleep well. Avoid working out intensely before bed, as it can hurt your sleep cycles. Try light exercise like stretching or yoga before bed.",
    "sentences": [
        " Determining an Ideal Sleep Schedule Use your age to determine how long you should be sleeping.",
        "People in your household may require differing amounts of sleep.",
        "We gradually grow to require less sleep throughout our lives.",
        "Babies and children to two years old require between 11 and 17 hours of sleep, including nights and naps.",
        "School-aged children up to age 17 require eight to 13 hours of sleep.",
        "Young adults and adults require seven to nine hours of sleep.",
        "Adults over 65 require seven to eight hours of sleep.",
        "Pay attention to your body.",
        "Each person is different, and the amount of sleep they require can be 1 to 2 hours below and above these recommended thresholds.",
        "Decide how much sleep you require in order to feel well rested.",
        "Set a target bedtime and a target wake up time.",
        "You will want to stay within one and two hours of this time even on weekends in order to reset your Circadian rhythms.",
        "Putting a Sleep Schedule into Practice Go to sleep approximately 15 minutes earlier (or later) every night, until you hit your ideal bedtime.",
        "Plan to wake up 15 minutes earlier (or later) as well.",
        "This gradual change gives your body time to adjust to lights and develop a new sleep routine.",
        "Sticking to this gradual adjustment is important even on the weekends.",
        "Staying up too late or sleeping in will make it harder for your body to set a new schedule.",
        "Start your sleep schedule using alarms.",
        "For instance, set an alarm on your phone or fitness tracker to cue the start of your bedtime routine.",
        "Set a light alarm for the morning.",
        "If you follow your bedtime routine strictly, you can eventually stop using an alarm.",
        "Your body will wake when you feel rested.",
        "Open the curtains as soon as you wake up.",
        "Try to get outside and into the sun for even better results.",
        "If you live in a place that isn’t sunny or you get up before the sun rises, try using a sunlight lamp to tell your body it’s time to get up.",
        "Start a bedtime routine.",
        "Start to get ready for bed an hour before.",
        "Turn off all machines that emit blue light and keep them out of the bedroom.",
        "Successful bedtime routines can include a warm bath or shower, stretching, yoga, personal hygiene, meditation, deep breathing, reading or writing.",
        "Choose the habits that work best for you.",
        "Set a wakeup routine.",
        "Ban the snooze button so that you can sleep until you must get up and enjoy more uninterrupted sleep.",
        "Once you get up, ensure your morning includes rituals like coffee, a shower, breakfast and some form of movement, in order to get the blood flowing and your brain working.",
        "Maintaining Good Sleep Hygiene Plan your meals to get smaller throughout the day.",
        "Enjoy a big breakfast that includes protein, healthy fats and carbohydrates.",
        "You will draw on this energy throughout the day.",
        "Include light snacks and a lunch rich in protein to make you feel fuller longer.",
        "Have a light dinner, since you are going to generally use fewer calories at night.",
        "Eat your dinner at least three hours before you go to bed, so that you don’t suffer from heartburn or reflux.",
        "Avoid coffee, alcohol and other liquids in the evening.",
        "It is good to avoid all caffeine six hours before you go to bed.",
        "Limit the amount you drink in the evening to avoid waking up to use the bathroom.",
        "Alcohol, nicotine and even chocolate can have stimulating effects that prevent good sleep.",
        "Avoid naps.",
        "If you must nap, limit it to 20 minutes.",
        "This will help you get some refreshing rest, but it will keep you from a deep sleep that can keep you groggy and hurt your sleep schedule.",
        "Exercise each day.",
        "Doctors suggest 150 minutes per week to help you sleep well.",
        "Avoid working out intensely before bed, as it can hurt your sleep cycles.",
        "Try light exercise like stretching or yoga before bed."
    ]
}