{
    "title": "How to Play Your Best Soccer Game",
    "url": "https://www.wikihow.com/Play-Your-Best-Soccer-Game",
    "category_hierarchy": [
        "Sports and Fitness",
        "Team Sports",
        "Soccer"
    ],
    "steps": [
        {
            "headline": "Stay in shape.",
            "description": "Try to prevent injuries from happening so that you are always 100% fit (a quality shin pad that fits your leg and socks designed for soccer should help). Run every day to stay in shape. Drink water as much as you can. And sleep enough before the match. You will not perform well (good pass, run, and shoot) if you're exhausted."
        },
        {
            "headline": "Practice.",
            "description": "You'll not only want to keep up your endurance but also your ability to handle the ball (get the ball: keep it or pass it)."
        },
        {
            "headline": "Be confident in yourself.",
            "description": "Tell yourself that you are a part of the best set of soccer players ever. Remember that soccer is all about team effort, so pass the ball every now and then and let everyone take a shot."
        },
        {
            "headline": "Play your best, regardless of the position that you play.",
            "description": "If you play goalkeeper, remember you are the last line of defense. Know what position you are playing and maintaining it. Fill others' position if they are not in theirs. Commit yourself to the ball—that includes diving and big smacks down the pitch."
        },
        {
            "headline": "Have fun!",
            "description": "Love the sport. Having fun is one thing that makes the game worthwhile. Learn to love the game, and practice all the time. You will slowly but surely get better and enjoy the game more."
        },
        {
            "headline": "Be determined.",
            "description": "Try your absolute hardest. Don't even bother if you aren't playing your complete best. Run as fast as you can. Shoot carefully. Pass well. Keep your head up. And never ever- give up. If you miss one shot, don't break down and get annoyed. Try again, try again. Think about what you did wrong and try again."
        }
    ],
    "tyn": [
        "Soccer Ball",
        "Shin Guards",
        "Cleats",
        "Soccer Goals",
        "Water",
        "A partner to pass with"
    ],
    "text": " Stay in shape. Try to prevent injuries from happening so that you are always 100% fit (a quality shin pad that fits your leg and socks designed for soccer should help). Run every day to stay in shape. Drink water as much as you can. And sleep enough before the match. You will not perform well (good pass, run, and shoot) if you're exhausted. Practice. You'll not only want to keep up your endurance but also your ability to handle the ball (get the ball: keep it or pass it). Be confident in yourself. Tell yourself that you are a part of the best set of soccer players ever. Remember that soccer is all about team effort, so pass the ball every now and then and let everyone take a shot. Play your best, regardless of the position that you play. If you play goalkeeper, remember you are the last line of defense. Know what position you are playing and maintaining it. Fill others' position if they are not in theirs. Commit yourself to the ball—that includes diving and big smacks down the pitch. Have fun! Love the sport. Having fun is one thing that makes the game worthwhile. Learn to love the game, and practice all the time. You will slowly but surely get better and enjoy the game more. Be determined. Try your absolute hardest. Don't even bother if you aren't playing your complete best. Run as fast as you can. Shoot carefully. Pass well. Keep your head up. And never ever- give up. If you miss one shot, don't break down and get annoyed. Try again, try again. Think about what you did wrong and try again.",
    "sentences": [
        " Stay in shape.",
        "Try to prevent injuries from happening so that you are always 100% fit (a quality shin pad that fits your leg and socks designed for soccer should help).",
        "Run every day to stay in shape.",
        "Drink water as much as you can.",
        "And sleep enough before the match.",
        "You will not perform well (good pass, run, and shoot) if you're exhausted.",
        "Practice.",
        "You'll not only want to keep up your endurance but also your ability to handle the ball (get the ball: keep it or pass it).",
        "Be confident in yourself.",
        "Tell yourself that you are a part of the best set of soccer players ever.",
        "Remember that soccer is all about team effort, so pass the ball every now and then and let everyone take a shot.",
        "Play your best, regardless of the position that you play.",
        "If you play goalkeeper, remember you are the last line of defense.",
        "Know what position you are playing and maintaining it.",
        "Fill others' position if they are not in theirs.",
        "Commit yourself to the ball—that includes diving and big smacks down the pitch.",
        "Have fun!",
        "Love the sport.",
        "Having fun is one thing that makes the game worthwhile.",
        "Learn to love the game, and practice all the time.",
        "You will slowly but surely get better and enjoy the game more.",
        "Be determined.",
        "Try your absolute hardest.",
        "Don't even bother if you aren't playing your complete best.",
        "Run as fast as you can.",
        "Shoot carefully.",
        "Pass well.",
        "Keep your head up.",
        "And never ever- give up.",
        "If you miss one shot, don't break down and get annoyed.",
        "Try again, try again.",
        "Think about what you did wrong and try again."
    ]
}