{
    "title": "How to Change a Suddenlink SSID and Password",
    "url": "https://www.wikihow.com/Change-a-Suddenlink-SSID-and-Password",
    "category_hierarchy": [
        "Computers and Electronics",
        "Internet",
        "Internet Security",
        "Internet Passwords and Usernames"
    ],
    "steps": [
        {
            "headline": "Log into the web interface of the router or modem by going to the gateway address.",
            "description": "For the Hitron CGNM-2250, the address is by default 192.168.0.1 and the Username/Password is cusadmin/password"
        },
        {
            "headline": "Open the menu in the top right and choose \"Wireless\" to navigate to the Wireless settings page.",
            "description": "Choose either 2.4G or 5G to edit the settings for that band. You may notice that the fields are not clickable, or editable. All they're doing is adding a disabled tag to the HTML, and we're going to remove that."
        },
        {
            "headline": "Right click on the SSID field, then choose \"Inspect.\"",
            "description": ""
        },
        {
            "headline": "Review the Chrome developer tools that open up.",
            "description": "There is lots of scary looking code here, but what we're looking for is the highlighted element, and the accompanying \"disabled\" tag. Right click the disabled tag to open the context menu for that attribute."
        },
        {
            "headline": "Click \"Edit attribute\" and delete the \"disabled\" tag by pressing the Delete key or Backspace.",
            "description": ""
        },
        {
            "headline": "Close the developer tools by clicking the close button (x) in the top right.",
            "description": ""
        },
        {
            "headline": "Look at the form now.",
            "description": "The SSID field will be editable now. Change it to whatever you want, because freedom."
        },
        {
            "headline": "Repeat the previous steps for any field you want to edit.",
            "description": "Then click Save Changes."
        }
    ],
    "tyn": [
        "Google Chrome"
    ],
    "text": " Log into the web interface of the router or modem by going to the gateway address. For the Hitron CGNM-2250, the address is by default 192.168.0.1 and the Username/Password is cusadmin/password Open the menu in the top right and choose \"Wireless\" to navigate to the Wireless settings page. Choose either 2.4G or 5G to edit the settings for that band. You may notice that the fields are not clickable, or editable. All they're doing is adding a disabled tag to the HTML, and we're going to remove that. Right click on the SSID field, then choose \"Inspect.\"  Review the Chrome developer tools that open up. There is lots of scary looking code here, but what we're looking for is the highlighted element, and the accompanying \"disabled\" tag. Right click the disabled tag to open the context menu for that attribute. Click \"Edit attribute\" and delete the \"disabled\" tag by pressing the Delete key or Backspace.  Close the developer tools by clicking the close button (x) in the top right.  Look at the form now. The SSID field will be editable now. Change it to whatever you want, because freedom. Repeat the previous steps for any field you want to edit. Then click Save Changes.",
    "sentences": [
        " Log into the web interface of the router or modem by going to the gateway address.",
        "For the Hitron CGNM-2250, the address is by default 192.168.0.1 and the Username/Password is cusadmin/password Open the menu in the top right and choose \"Wireless\" to navigate to the Wireless settings page.",
        "Choose either 2.4G or 5G to edit the settings for that band.",
        "You may notice that the fields are not clickable, or editable.",
        "All they're doing is adding a disabled tag to the HTML, and we're going to remove that.",
        "Right click on the SSID field, then choose \"Inspect.\"",
        "Review the Chrome developer tools that open up.",
        "There is lots of scary looking code here, but what we're looking for is the highlighted element, and the accompanying \"disabled\" tag.",
        "Right click the disabled tag to open the context menu for that attribute.",
        "Click \"Edit attribute\" and delete the \"disabled\" tag by pressing the Delete key or Backspace.",
        "Close the developer tools by clicking the close button (x) in the top right.",
        "Look at the form now.",
        "The SSID field will be editable now.",
        "Change it to whatever you want, because freedom.",
        "Repeat the previous steps for any field you want to edit.",
        "Then click Save Changes."
    ]
}