{
    "title": "How to Store Comic Books",
    "url": "https://www.wikihow.com/Store-Comic-Books",
    "category_hierarchy": [
        "Arts and Entertainment"
    ],
    "methods": [
        {
            "name": "Sealing Comic Books",
            "steps": [
                {
                    "headline": "Protect comic books in plastic book bags.",
                    "description": "Wrapping your collection in comic book bags will be more than enough to maintain its condition. Buy bags at your local comic or hobby shop or purchase them online, and when you do, keep these three main comic book sizes in mind:\nCurrent (1980 to present) size: 6 7/8″ x 10 1/2″\nSilver Age (1950 to 1980) size: 7 1/8″ x 10 1/2″\nGolden Age (pre-1950) size: 7 3/4” x 10 1/2”"
                },
                {
                    "headline": "Prevent creases in bagged books with cardboard backing.",
                    "description": "Cardboard backing can also be bought at most comic and hobby shops. Be sure to verify the backing you buy is acid free. Cardboard that has acid won’t likely give your comics superpowers – expect damage instead."
                },
                {
                    "headline": "Seal away rare comics in hard shell cases.",
                    "description": "Hard shell cases are going to cost you a couple dollars apiece, if not more. Because of this, it’s only really worth it to store rare or valuable comics in containers like these. Buy these cases from comic and hobby shops. Hard shell cases will be easier and safer to display. You may be able to attach an adhesive hook to the case so you can display the comic on a wall."
                },
                {
                    "headline": "Safeguard the value of comics with certification and slabbing.",
                    "description": "To have this done, you’ll need to send your comic in to a recognized authority in rare and vintage comics, like Certified Guarantee Company. Your comic will be returned to you safely encased in plastic with its condition certified by an expert. Each certified, slabbed comic should have a protective hologram and barcode. Should these be tampered with or damaged, the certification is invalidated."
                }
            ]
        },
        {
            "name": "Caching Your Comic Collection",
            "steps": [
                {
                    "headline": "Store regular editions in cardboard boxes.",
                    "description": "Cardboard is cheap and fairly durable as long as its kept dry, which makes it ideal for your less important books. Slide bagged books into boxes so they’re standing upright. Avoid acid treated cardboard and packing too many books in a box, as both can cause damage. Generally, you want enough space left in a box so you can comfortably separate comics with your fingers to read titles, but not so much space that the comics are loosely upright. Use a bookend or a suitable paper weight to hold comics in place for boxes with too few comics. Damage may occur if you allow books to flop around in the boxes."
                },
                {
                    "headline": "Use plastic containers in place of cardboard for valuable comics.",
                    "description": "Plastic containers will generally offer you a little more protection than cardboard. These are also more resilient to water damage, and some may even offer an airtight seal to protect your comics from the elements. Comic books should be stored in plastic containers similar to cardboard ones: upright and firmly, but not tightly, packed."
                },
                {
                    "headline": "Keep books out of sunlight and away from the elements.",
                    "description": "Sunlight causes pages to yellow and ink to fade. Too much moisture or dry heat, on the other hand, causes paper to warp or become brittle. A cool, dry, dark storage location will keep your comic books in the best condition for the longest time."
                },
                {
                    "headline": "Avoid stacking containers and storing them on the floor.",
                    "description": "Damage frequently occurs to comics when piled high stacks of containers collapse. Avoid stacking if it can be helped. Keep containers of comics off the floor with pallets and milk crates to prevent potential water damage. Even cement that is dry throughout the year will conduct cold and draw moisture to your books."
                }
            ]
        },
        {
            "name": "Protecting Your Books Further",
            "steps": [
                {
                    "headline": "Handle comics with clean hands, always.",
                    "description": "If you’re a collector, this needs to be your golden rule. After all, an errant speck of dirt or smudge of chocolate could drastically reduce the value of your collectible. Similarly, have any friends or prospective buyers wash their hands before touching comics. You may feel self-conscious making this simple request. Remember, you spent a lot of time and effort building your collection. Try saying, “This one’s pretty rare, would you mind washing your hands first?”"
                },
                {
                    "headline": "Control the storage environment.",
                    "description": "Temperatures that are too hot or cold could damage the glue in the binding of some comics or cause the quality of the paper to change unnaturally. Humidity, as you probably already know, is another enemy your comic book must be protected from. A dehumidifier in your comic book storage room is a great way of ensuring low humidity, which is ideal for book health. An indoor storage location might be best if you’re concerned about the condition of your collection. It’ll be much easier for you to control the climate."
                },
                {
                    "headline": "Keep books in a filing cabinet.",
                    "description": "A filing cabinet keep your bagged and backing boarded collection well-organized and protected from damage. If you have a filing cabinet with a lock, comic books stored inside will also be less likely to be stolen."
                },
                {
                    "headline": "Lock away ultra-valuable titles in safety deposit boxes.",
                    "description": "These books should still be bagged and boarded, at minimum. Though if a comic is rare enough to be kept in a safety deposit box, you should really look into having that beauty certified and slabbed."
                }
            ]
        }
    ],
    "tyn": [
        "Comics",
        "Mylar sleeves (or poly bags)",
        "Acid-free backing boards",
        "Acid-free comic boxes"
    ],
    "text": " Sealing Comic Books Protect comic books in plastic book bags. Wrapping your collection in comic book bags will be more than enough to maintain its condition. Buy bags at your local comic or hobby shop or purchase them online, and when you do, keep these three main comic book sizes in mind:\nCurrent (1980 to present) size: 6 7/8″ x 10 1/2″\nSilver Age (1950 to 1980) size: 7 1/8″ x 10 1/2″\nGolden Age (pre-1950) size: 7 3/4” x 10 1/2” Prevent creases in bagged books with cardboard backing. Cardboard backing can also be bought at most comic and hobby shops. Be sure to verify the backing you buy is acid free. Cardboard that has acid won’t likely give your comics superpowers – expect damage instead. Seal away rare comics in hard shell cases. Hard shell cases are going to cost you a couple dollars apiece, if not more. Because of this, it’s only really worth it to store rare or valuable comics in containers like these. Buy these cases from comic and hobby shops. Hard shell cases will be easier and safer to display. You may be able to attach an adhesive hook to the case so you can display the comic on a wall. Safeguard the value of comics with certification and slabbing. To have this done, you’ll need to send your comic in to a recognized authority in rare and vintage comics, like Certified Guarantee Company. Your comic will be returned to you safely encased in plastic with its condition certified by an expert. Each certified, slabbed comic should have a protective hologram and barcode. Should these be tampered with or damaged, the certification is invalidated. Caching Your Comic Collection Store regular editions in cardboard boxes. Cardboard is cheap and fairly durable as long as its kept dry, which makes it ideal for your less important books. Slide bagged books into boxes so they’re standing upright. Avoid acid treated cardboard and packing too many books in a box, as both can cause damage. Generally, you want enough space left in a box so you can comfortably separate comics with your fingers to read titles, but not so much space that the comics are loosely upright. Use a bookend or a suitable paper weight to hold comics in place for boxes with too few comics. Damage may occur if you allow books to flop around in the boxes. Use plastic containers in place of cardboard for valuable comics. Plastic containers will generally offer you a little more protection than cardboard. These are also more resilient to water damage, and some may even offer an airtight seal to protect your comics from the elements. Comic books should be stored in plastic containers similar to cardboard ones: upright and firmly, but not tightly, packed. Keep books out of sunlight and away from the elements. Sunlight causes pages to yellow and ink to fade. Too much moisture or dry heat, on the other hand, causes paper to warp or become brittle. A cool, dry, dark storage location will keep your comic books in the best condition for the longest time. Avoid stacking containers and storing them on the floor. Damage frequently occurs to comics when piled high stacks of containers collapse. Avoid stacking if it can be helped. Keep containers of comics off the floor with pallets and milk crates to prevent potential water damage. Even cement that is dry throughout the year will conduct cold and draw moisture to your books. Protecting Your Books Further Handle comics with clean hands, always. If you’re a collector, this needs to be your golden rule. After all, an errant speck of dirt or smudge of chocolate could drastically reduce the value of your collectible. Similarly, have any friends or prospective buyers wash their hands before touching comics. You may feel self-conscious making this simple request. Remember, you spent a lot of time and effort building your collection. Try saying, “This one’s pretty rare, would you mind washing your hands first?” Control the storage environment. Temperatures that are too hot or cold could damage the glue in the binding of some comics or cause the quality of the paper to change unnaturally. Humidity, as you probably already know, is another enemy your comic book must be protected from. A dehumidifier in your comic book storage room is a great way of ensuring low humidity, which is ideal for book health. An indoor storage location might be best if you’re concerned about the condition of your collection. It’ll be much easier for you to control the climate. Keep books in a filing cabinet. A filing cabinet keep your bagged and backing boarded collection well-organized and protected from damage. If you have a filing cabinet with a lock, comic books stored inside will also be less likely to be stolen. Lock away ultra-valuable titles in safety deposit boxes. These books should still be bagged and boarded, at minimum. Though if a comic is rare enough to be kept in a safety deposit box, you should really look into having that beauty certified and slabbed.",
    "sentences": [
        " Sealing Comic Books Protect comic books in plastic book bags.",
        "Wrapping your collection in comic book bags will be more than enough to maintain its condition.",
        "Buy bags at your local comic or hobby shop or purchase them online, and when you do, keep these three main comic book sizes in mind:\nCurrent (1980 to present) size: 6 7/8″ x 10 1/2″\nSilver Age (1950 to 1980) size: 7 1/8″ x 10 1/2″\nGolden Age (pre-1950) size: 7 3/4” x 10 1/2” Prevent creases in bagged books with cardboard backing.",
        "Cardboard backing can also be bought at most comic and hobby shops.",
        "Be sure to verify the backing you buy is acid free.",
        "Cardboard that has acid won’t likely give your comics superpowers – expect damage instead.",
        "Seal away rare comics in hard shell cases.",
        "Hard shell cases are going to cost you a couple dollars apiece, if not more.",
        "Because of this, it’s only really worth it to store rare or valuable comics in containers like these.",
        "Buy these cases from comic and hobby shops.",
        "Hard shell cases will be easier and safer to display.",
        "You may be able to attach an adhesive hook to the case so you can display the comic on a wall.",
        "Safeguard the value of comics with certification and slabbing.",
        "To have this done, you’ll need to send your comic in to a recognized authority in rare and vintage comics, like Certified Guarantee Company.",
        "Your comic will be returned to you safely encased in plastic with its condition certified by an expert.",
        "Each certified, slabbed comic should have a protective hologram and barcode.",
        "Should these be tampered with or damaged, the certification is invalidated.",
        "Caching Your Comic Collection Store regular editions in cardboard boxes.",
        "Cardboard is cheap and fairly durable as long as its kept dry, which makes it ideal for your less important books.",
        "Slide bagged books into boxes so they’re standing upright.",
        "Avoid acid treated cardboard and packing too many books in a box, as both can cause damage.",
        "Generally, you want enough space left in a box so you can comfortably separate comics with your fingers to read titles, but not so much space that the comics are loosely upright.",
        "Use a bookend or a suitable paper weight to hold comics in place for boxes with too few comics.",
        "Damage may occur if you allow books to flop around in the boxes.",
        "Use plastic containers in place of cardboard for valuable comics.",
        "Plastic containers will generally offer you a little more protection than cardboard.",
        "These are also more resilient to water damage, and some may even offer an airtight seal to protect your comics from the elements.",
        "Comic books should be stored in plastic containers similar to cardboard ones: upright and firmly, but not tightly, packed.",
        "Keep books out of sunlight and away from the elements.",
        "Sunlight causes pages to yellow and ink to fade.",
        "Too much moisture or dry heat, on the other hand, causes paper to warp or become brittle.",
        "A cool, dry, dark storage location will keep your comic books in the best condition for the longest time.",
        "Avoid stacking containers and storing them on the floor.",
        "Damage frequently occurs to comics when piled high stacks of containers collapse.",
        "Avoid stacking if it can be helped.",
        "Keep containers of comics off the floor with pallets and milk crates to prevent potential water damage.",
        "Even cement that is dry throughout the year will conduct cold and draw moisture to your books.",
        "Protecting Your Books Further Handle comics with clean hands, always.",
        "If you’re a collector, this needs to be your golden rule.",
        "After all, an errant speck of dirt or smudge of chocolate could drastically reduce the value of your collectible.",
        "Similarly, have any friends or prospective buyers wash their hands before touching comics.",
        "You may feel self-conscious making this simple request.",
        "Remember, you spent a lot of time and effort building your collection.",
        "Try saying, “This one’s pretty rare, would you mind washing your hands first?” Control the storage environment.",
        "Temperatures that are too hot or cold could damage the glue in the binding of some comics or cause the quality of the paper to change unnaturally.",
        "Humidity, as you probably already know, is another enemy your comic book must be protected from.",
        "A dehumidifier in your comic book storage room is a great way of ensuring low humidity, which is ideal for book health.",
        "An indoor storage location might be best if you’re concerned about the condition of your collection.",
        "It’ll be much easier for you to control the climate.",
        "Keep books in a filing cabinet.",
        "A filing cabinet keep your bagged and backing boarded collection well-organized and protected from damage.",
        "If you have a filing cabinet with a lock, comic books stored inside will also be less likely to be stolen.",
        "Lock away ultra-valuable titles in safety deposit boxes.",
        "These books should still be bagged and boarded, at minimum.",
        "Though if a comic is rare enough to be kept in a safety deposit box, you should really look into having that beauty certified and slabbed."
    ]
}