{
    "title": "How to Make a Greek Gyro",
    "url": "https://www.wikihow.com/Make-a-Greek-Gyro",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "European Cuisine",
        "Greek Cuisine"
    ],
    "parts": [
        {
            "name": "Cooking the Meat",
            "steps": [
                {
                    "headline": "Combine the lamb with the seasonings.",
                    "description": "Put 1 pound (453 g) of ground lamb or 85% lean ground beef into a medium bowl. Add 2 teaspoons (12 g) of kosher salt, 1/2 teaspoon (1 g) of freshly ground black pepper, and 2 tablespoons (5 g) of fresh oregano leaves. Use your fingers or a wooden spoon to mix the meat with the seasonings. If you don't have fresh oregano, you can use 1/2 teaspoon (0.5 g) of dried oregano. You can use any combination of ground meat that you like. For example, try a combination of ground turkey and ground pork or ground lamb and ground pork."
                },
                {
                    "headline": "Chill the lamb mixture for at least 1 hour.",
                    "description": "Cover the bowl of seasoned ground meat with plastic wrap. Refrigerate the meat for at least 1 hour. If you'd like to make the meat ahead of time, you can refrigerate it overnight."
                },
                {
                    "headline": "Preheat the oven and puree the gyro meat mixture.",
                    "description": "Turn the oven on to 300 degrees F (150 degrees C). Take the chilled meat out of the refrigerator and transfer it to a food processor. Add 1/2 of an onion that's been cut into 1-inch (2.5 cm) chunks, 1 sliced clove of garlic, and 5 slices of slab bacon that have been cut into 1-inch (2.5 cm) pieces. Puree the ingredients for 1 minute. The mixture should become smooth and very thick once it's combined. You might need to stop and scrape down the sides of the food processor."
                },
                {
                    "headline": "Spread the meat mixture on a baking sheet.",
                    "description": "Lay aluminum foil across the bottom of a rimmed baking sheet. Wet your hands and then scoop the gyro meat onto the foil. Use your moist hands to spread the meat into a large rectangle. The rectangle should be 8 inches (20 cm) long and 5 inches (12 cm) inches wide."
                },
                {
                    "headline": "Bake the gyro meat for 30 minutes.",
                    "description": "Put the sheet of gyro meat into the preheated oven and bake it for about 30 minutes. Insert an instant-read thermometer to check the temperature. It should be 155 degrees F (70 degrees C) once it's finished cooking."
                },
                {
                    "headline": "Cool the meat for 15 minutes.",
                    "description": "Remove the baking sheet from the oven and leave the meat to rest for 15 minutes before you slice it. If you'd like to make the gyro meat in advance, you can bake it, cool it, and refrigerate it for up to one week."
                },
                {
                    "headline": "Slice the gyro meat and broil it for 2 minutes.",
                    "description": "Turn your broiler on to high and move the rack to the top shelf of your oven. Slice the loaf of cooked gyro meat crosswise into thin strips and place the strips on the baking sheet lined with aluminum foil. Put the pan under the broiler and broil the strips for about 2 minutes. The edges of the meat should become crisp and golden. Cover the broiled gyro meat loosely with foil while you get out the ingredients to assemble your gyro. The strips should be 1/8 to 1/4-inch (3 to 6 mm) thick and about 5 inches (12 cm) long."
                }
            ]
        },
        {
            "name": "Making the Tzatziki Sauce",
            "steps": [
                {
                    "headline": "Strain the yogurt.",
                    "description": "Place a clean tea towel or cheesecloth in a fine mesh strainer. Set the strainer over a bowl and spoon 1 cup (245 g) of plain, unsweetened yogurt directly into the towel. Place the bowl with the strainer in the fridge for about 2 hours. As it sits, the liquid from the yogurt will drip into the bowl. Discard this liquid and use the strained yogurt in the towel for your sauce."
                },
                {
                    "headline": "Wash and cut the cucumber.",
                    "description": "Wash a medium-sized cucumber and cut it in half. Peel the cucumber and slice it in half lengthwise. Use a spoon to scoop out and discard the seeds. Take a sharp knife and carefully dice the cucumber into small pieces. You can save the other half of the cucumber to use in another recipe."
                },
                {
                    "headline": "Squeeze and strain the cucumber.",
                    "description": "Lay a clean tea towel on the counter and scoop the diced cucumber into the center of it. Gather up the ends of the towel so the cucumber is wrapped tightly in the towel. Squeeze the cucumber in the towel over a sink so any excess liquid comes out of the cucumber."
                },
                {
                    "headline": "Combine the tzatziki sauce.",
                    "description": "Open the towel and spoon the cucumbers into a medium bowl. Add the strained yogurt along with the rest of the sauce ingredients. Stir the sauce until it's combined. You can store leftover sauce in an airtight container for up to one week. You'll need to stir in:\n1 pinch kosher salt. 2 cloves minced garlic. 1/2 tablespoon (7 ml) olive oil. 1 teaspoon (5 ml) red wine vinegar. 2 to 3 fresh minced mint leaves."
                }
            ]
        },
        {
            "name": "Assembling the Gyro",
            "steps": [
                {
                    "headline": "Warm the pita bread.",
                    "description": "Take 4 pieces of soft pita and lay them on a rimmed baking sheet. Turn your broiler on to low and place the sheet a few inches under the broiler. Heat the pita for about 45 seconds and then flip them over. Broil the pita for about 45 seconds on the other side so they're warmed throughout. While Greek gyros aren't typically made with pocket pita, you can use it if you don't have flatbread-style pita."
                },
                {
                    "headline": "Spread the meat on the pita.",
                    "description": "Place about 1/4 pound (113 g) of the sliced gyro meat onto each warmed pita. Put the meat in the center of the bread so it's easier to fold in half or roll up."
                },
                {
                    "headline": "Add your favorite gyro toppings.",
                    "description": "Once you've placed the gyro meat on the pita, you can add any toppings you'd like. Spoon some of the tzatziki sauce on top and consider adding:\nChopped fresh tomato. Finely sliced onion. Cubed, peeled, and seeded cucumber. Hot sauce. Feta cheese."
                },
                {
                    "headline": "Fold and serve the gyro.",
                    "description": "To quickly serve the gyro, simply pick it up and fold it in half. Or you can wrap the sides around the center of the gyro so it's more secured. Wrap the bottom half of the gyro in a piece of aluminum foil. This will make it easier to handle while you eat it. Serve the gyros immediately."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Measuring cups and spoons",
        "Digital scale",
        "Knife and cutting board",
        "Vegetable peeler",
        "Spoon",
        "Food processor",
        "Wooden spoon",
        "Tea towels or cheesecloth",
        "Medium bowls",
        "Plastic wrap",
        "Aluminum foil",
        "Rimmed baking sheet",
        "Fine mesh strainer",
        "Instant-read thermometer"
    ],
    "text": " Cooking the Meat Combine the lamb with the seasonings. Put 1 pound (453 g) of ground lamb or 85% lean ground beef into a medium bowl. Add 2 teaspoons (12 g) of kosher salt, 1/2 teaspoon (1 g) of freshly ground black pepper, and 2 tablespoons (5 g) of fresh oregano leaves. Use your fingers or a wooden spoon to mix the meat with the seasonings. If you don't have fresh oregano, you can use 1/2 teaspoon (0.5 g) of dried oregano. You can use any combination of ground meat that you like. For example, try a combination of ground turkey and ground pork or ground lamb and ground pork. Chill the lamb mixture for at least 1 hour. Cover the bowl of seasoned ground meat with plastic wrap. Refrigerate the meat for at least 1 hour. If you'd like to make the meat ahead of time, you can refrigerate it overnight. Preheat the oven and puree the gyro meat mixture. Turn the oven on to 300 degrees F (150 degrees C). Take the chilled meat out of the refrigerator and transfer it to a food processor. Add 1/2 of an onion that's been cut into 1-inch (2.5 cm) chunks, 1 sliced clove of garlic, and 5 slices of slab bacon that have been cut into 1-inch (2.5 cm) pieces. Puree the ingredients for 1 minute. The mixture should become smooth and very thick once it's combined. You might need to stop and scrape down the sides of the food processor. Spread the meat mixture on a baking sheet. Lay aluminum foil across the bottom of a rimmed baking sheet. Wet your hands and then scoop the gyro meat onto the foil. Use your moist hands to spread the meat into a large rectangle. The rectangle should be 8 inches (20 cm) long and 5 inches (12 cm) inches wide. Bake the gyro meat for 30 minutes. Put the sheet of gyro meat into the preheated oven and bake it for about 30 minutes. Insert an instant-read thermometer to check the temperature. It should be 155 degrees F (70 degrees C) once it's finished cooking. Cool the meat for 15 minutes. Remove the baking sheet from the oven and leave the meat to rest for 15 minutes before you slice it. If you'd like to make the gyro meat in advance, you can bake it, cool it, and refrigerate it for up to one week. Slice the gyro meat and broil it for 2 minutes. Turn your broiler on to high and move the rack to the top shelf of your oven. Slice the loaf of cooked gyro meat crosswise into thin strips and place the strips on the baking sheet lined with aluminum foil. Put the pan under the broiler and broil the strips for about 2 minutes. The edges of the meat should become crisp and golden. Cover the broiled gyro meat loosely with foil while you get out the ingredients to assemble your gyro. The strips should be 1/8 to 1/4-inch (3 to 6 mm) thick and about 5 inches (12 cm) long. Making the Tzatziki Sauce Strain the yogurt. Place a clean tea towel or cheesecloth in a fine mesh strainer. Set the strainer over a bowl and spoon 1 cup (245 g) of plain, unsweetened yogurt directly into the towel. Place the bowl with the strainer in the fridge for about 2 hours. As it sits, the liquid from the yogurt will drip into the bowl. Discard this liquid and use the strained yogurt in the towel for your sauce. Wash and cut the cucumber. Wash a medium-sized cucumber and cut it in half. Peel the cucumber and slice it in half lengthwise. Use a spoon to scoop out and discard the seeds. Take a sharp knife and carefully dice the cucumber into small pieces. You can save the other half of the cucumber to use in another recipe. Squeeze and strain the cucumber. Lay a clean tea towel on the counter and scoop the diced cucumber into the center of it. Gather up the ends of the towel so the cucumber is wrapped tightly in the towel. Squeeze the cucumber in the towel over a sink so any excess liquid comes out of the cucumber. Combine the tzatziki sauce. Open the towel and spoon the cucumbers into a medium bowl. Add the strained yogurt along with the rest of the sauce ingredients. Stir the sauce until it's combined. You can store leftover sauce in an airtight container for up to one week. You'll need to stir in:\n1 pinch kosher salt. 2 cloves minced garlic. 1/2 tablespoon (7 ml) olive oil. 1 teaspoon (5 ml) red wine vinegar. 2 to 3 fresh minced mint leaves. Assembling the Gyro Warm the pita bread. Take 4 pieces of soft pita and lay them on a rimmed baking sheet. Turn your broiler on to low and place the sheet a few inches under the broiler. Heat the pita for about 45 seconds and then flip them over. Broil the pita for about 45 seconds on the other side so they're warmed throughout. While Greek gyros aren't typically made with pocket pita, you can use it if you don't have flatbread-style pita. Spread the meat on the pita. Place about 1/4 pound (113 g) of the sliced gyro meat onto each warmed pita. Put the meat in the center of the bread so it's easier to fold in half or roll up. Add your favorite gyro toppings. Once you've placed the gyro meat on the pita, you can add any toppings you'd like. Spoon some of the tzatziki sauce on top and consider adding:\nChopped fresh tomato. Finely sliced onion. Cubed, peeled, and seeded cucumber. Hot sauce. Feta cheese. Fold and serve the gyro. To quickly serve the gyro, simply pick it up and fold it in half. Or you can wrap the sides around the center of the gyro so it's more secured. Wrap the bottom half of the gyro in a piece of aluminum foil. This will make it easier to handle while you eat it. Serve the gyros immediately. Finished. ",
    "sentences": [
        " Cooking the Meat Combine the lamb with the seasonings.",
        "Put 1 pound (453 g) of ground lamb or 85% lean ground beef into a medium bowl.",
        "Add 2 teaspoons (12 g) of kosher salt, 1/2 teaspoon (1 g) of freshly ground black pepper, and 2 tablespoons (5 g) of fresh oregano leaves.",
        "Use your fingers or a wooden spoon to mix the meat with the seasonings.",
        "If you don't have fresh oregano, you can use 1/2 teaspoon (0.5 g) of dried oregano.",
        "You can use any combination of ground meat that you like.",
        "For example, try a combination of ground turkey and ground pork or ground lamb and ground pork.",
        "Chill the lamb mixture for at least 1 hour.",
        "Cover the bowl of seasoned ground meat with plastic wrap.",
        "Refrigerate the meat for at least 1 hour.",
        "If you'd like to make the meat ahead of time, you can refrigerate it overnight.",
        "Preheat the oven and puree the gyro meat mixture.",
        "Turn the oven on to 300 degrees F (150 degrees C).",
        "Take the chilled meat out of the refrigerator and transfer it to a food processor.",
        "Add 1/2 of an onion that's been cut into 1-inch (2.5 cm) chunks, 1 sliced clove of garlic, and 5 slices of slab bacon that have been cut into 1-inch (2.5 cm) pieces.",
        "Puree the ingredients for 1 minute.",
        "The mixture should become smooth and very thick once it's combined.",
        "You might need to stop and scrape down the sides of the food processor.",
        "Spread the meat mixture on a baking sheet.",
        "Lay aluminum foil across the bottom of a rimmed baking sheet.",
        "Wet your hands and then scoop the gyro meat onto the foil.",
        "Use your moist hands to spread the meat into a large rectangle.",
        "The rectangle should be 8 inches (20 cm) long and 5 inches (12 cm) inches wide.",
        "Bake the gyro meat for 30 minutes.",
        "Put the sheet of gyro meat into the preheated oven and bake it for about 30 minutes.",
        "Insert an instant-read thermometer to check the temperature.",
        "It should be 155 degrees F (70 degrees C) once it's finished cooking.",
        "Cool the meat for 15 minutes.",
        "Remove the baking sheet from the oven and leave the meat to rest for 15 minutes before you slice it.",
        "If you'd like to make the gyro meat in advance, you can bake it, cool it, and refrigerate it for up to one week.",
        "Slice the gyro meat and broil it for 2 minutes.",
        "Turn your broiler on to high and move the rack to the top shelf of your oven.",
        "Slice the loaf of cooked gyro meat crosswise into thin strips and place the strips on the baking sheet lined with aluminum foil.",
        "Put the pan under the broiler and broil the strips for about 2 minutes.",
        "The edges of the meat should become crisp and golden.",
        "Cover the broiled gyro meat loosely with foil while you get out the ingredients to assemble your gyro.",
        "The strips should be 1/8 to 1/4-inch (3 to 6 mm) thick and about 5 inches (12 cm) long.",
        "Making the Tzatziki Sauce Strain the yogurt.",
        "Place a clean tea towel or cheesecloth in a fine mesh strainer.",
        "Set the strainer over a bowl and spoon 1 cup (245 g) of plain, unsweetened yogurt directly into the towel.",
        "Place the bowl with the strainer in the fridge for about 2 hours.",
        "As it sits, the liquid from the yogurt will drip into the bowl.",
        "Discard this liquid and use the strained yogurt in the towel for your sauce.",
        "Wash and cut the cucumber.",
        "Wash a medium-sized cucumber and cut it in half.",
        "Peel the cucumber and slice it in half lengthwise.",
        "Use a spoon to scoop out and discard the seeds.",
        "Take a sharp knife and carefully dice the cucumber into small pieces.",
        "You can save the other half of the cucumber to use in another recipe.",
        "Squeeze and strain the cucumber.",
        "Lay a clean tea towel on the counter and scoop the diced cucumber into the center of it.",
        "Gather up the ends of the towel so the cucumber is wrapped tightly in the towel.",
        "Squeeze the cucumber in the towel over a sink so any excess liquid comes out of the cucumber.",
        "Combine the tzatziki sauce.",
        "Open the towel and spoon the cucumbers into a medium bowl.",
        "Add the strained yogurt along with the rest of the sauce ingredients.",
        "Stir the sauce until it's combined.",
        "You can store leftover sauce in an airtight container for up to one week.",
        "You'll need to stir in:\n1 pinch kosher salt.",
        "2 cloves minced garlic.",
        "1/2 tablespoon (7 ml) olive oil.",
        "1 teaspoon (5 ml) red wine vinegar.",
        "2 to 3 fresh minced mint leaves.",
        "Assembling the Gyro Warm the pita bread.",
        "Take 4 pieces of soft pita and lay them on a rimmed baking sheet.",
        "Turn your broiler on to low and place the sheet a few inches under the broiler.",
        "Heat the pita for about 45 seconds and then flip them over.",
        "Broil the pita for about 45 seconds on the other side so they're warmed throughout.",
        "While Greek gyros aren't typically made with pocket pita, you can use it if you don't have flatbread-style pita.",
        "Spread the meat on the pita.",
        "Place about 1/4 pound (113 g) of the sliced gyro meat onto each warmed pita.",
        "Put the meat in the center of the bread so it's easier to fold in half or roll up.",
        "Add your favorite gyro toppings.",
        "Once you've placed the gyro meat on the pita, you can add any toppings you'd like.",
        "Spoon some of the tzatziki sauce on top and consider adding:\nChopped fresh tomato.",
        "Finely sliced onion.",
        "Cubed, peeled, and seeded cucumber.",
        "Hot sauce.",
        "Feta cheese.",
        "Fold and serve the gyro.",
        "To quickly serve the gyro, simply pick it up and fold it in half.",
        "Or you can wrap the sides around the center of the gyro so it's more secured.",
        "Wrap the bottom half of the gyro in a piece of aluminum foil.",
        "This will make it easier to handle while you eat it.",
        "Serve the gyros immediately.",
        "Finished."
    ]
}