{
    "title": "How to Make Giant Grilled Cheese",
    "url": "https://www.wikihow.com/Make-Giant-Grilled-Cheese",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Sandwiches and Quick Meals",
        "Cheese Sandwiches"
    ],
    "methods": [
        {
            "name": "Putting Together A Giant Skillet Grilled Cheese",
            "steps": [
                {
                    "headline": "Preheat the oven.",
                    "description": "Even though the grilled cheese is cooked in a pan, you may need to put it in the oven briefly to melt the cheese completely. Make sure that the oven is hot enough in case you need it by preheating it to 350 degrees Fahrenheit (177 degrees Celsius), which should take approximately 10 to 15 minutes. Pay attention to the oven so you know when it’s ready. Most models will either beep or flash an indicator light to let you know that the right temperature has been reached."
                },
                {
                    "headline": "Cut the bread in half horizontally and trim the crusts.",
                    "description": "Take 1 loaf of round, crusty bread, and use a sharp knife to slice it in half horizontally. Trim the top and bottom crusts from the bread to create two large, round slices that are approximately 1 ½ inches (3.8 cm) thick. These types of round, crusty bread are sometimes called bread boules, and are often used to serve soups and dips in. It can be difficult to cut a round loaf of bread, so be careful to tuck your fingers under when you're slicing."
                },
                {
                    "headline": "Spread the mustard onto the bread and cover with cheese.",
                    "description": "Once the bread is cut, use a butter knife to spread the mustard of your choice over one slice. Cover the mustard with ¼ pound (114 g) of thinly sliced Swiss cheese and ¼ pound (114 g) thinly sliced Monterey Jack cheese. Spread mustard on the other piece of bread, and close the sandwich. The mustard is optional, but adds delicious flavor to the grilled cheese. You can use your favorite type, such as honey, dijon, or coarse-ground. You can use substitute any melting cheese that you like for the Swiss and Monterey Jack. Cheddar, American, pepper jack, or mozzarella are other options to consider. You can add other fillings to the grilled cheese if you like. Bacon and tomatoes are classic additions, but you can be as creative as you’d like. Try adding ham, pepperoni, roasted red peppers, sliced apples, or even crumbled potato chips to your sandwich."
                },
                {
                    "headline": "Heat the oil in a pan.",
                    "description": "Add 1 tablespoon (15 ml) of vegetable or olive oil to a large, heavy-bottomed 10- or 12-inch (25 to 30-cm) skillet that’s oven-safe. Allow it to heat on medium-low for 3 to 5 minutes, or until the oil starts to shimmer. You can substitute butter for the oil, but butter burns off much more quickly so you may find yourself needing to replace it as you fry the sandwich."
                },
                {
                    "headline": "Butter the outside of the bread and place it in the pan.",
                    "description": "When the oil is heated, use a butter knife to spread 2 tablespoons (28.5 g) of unsalted, softened butter over the top of the sandwich. Place the sandwich in the pan buttered side down, and apply another 2 tablespoons (28.5 g) of butter to the other side of the sandwich that’s now facing up."
                },
                {
                    "headline": "Cook the sandwich until golden brown on both sides.",
                    "description": "Allow the sandwich to cook  for approximately 3 to 4 minutes or until the bottom has become golden brown. Use a spatula to carefully flip the sandwich over so the cooked side is now face up. Cook the other side for another 2 to 3 minutes so it becomes golden brown too. Check the sandwich’s color regularly while it’s cooking on both sides to ensure that it doesn’t burn."
                },
                {
                    "headline": "Transfer the sandwich to a cookie sheet and bake it until the cheese melts.",
                    "description": "When both sides of the sandwich are golden brown, remove it from the skillet and place it on a cookie sheet. Because it is such a large sandwich, all of the cheese may not be melted so put the grilled cheese in the preheated oven and let it cook until the cheese is fully melted, which may take 3 to 8 minutes. If the cheese is mostly melted when you take the sandwich out of the skillet, you don’t necessarily have to put it in the oven. The cheese will continue to melt a little if you leave it the pan off the heat."
                },
                {
                    "headline": "Slice the sandwich into wedges and serve.",
                    "description": "When the cheese is completely melted, use a sharp knife to cut it into four wedges. Place the wedges on plates, and serve."
                }
            ]
        },
        {
            "name": "Whipping Up Focaccia Slab Grilled Cheese",
            "steps": [
                {
                    "headline": "Preheat the oven.",
                    "description": "Instead of cooking the grilled cheese in a skillet, this sandwich is baked in the oven. To ensure that it’s hot enough to melt the cheese, preheat the oven to 375 degrees Fahrenheit (190 degrees Celsius) and allow it to fully heat."
                },
                {
                    "headline": "Cut the focaccia in half and place it on a baking sheet.",
                    "description": "Take 1 large, rectangular loaf of focaccia bread, and use a sharp knife to slice it half horizontally. Place the bottom piece on a large cookie sheet with the cut side up, and leave the other aside for a moment. Ideally, you should use a foccacia that fits tightly on an 18-inch by 13-inch (46-cm by 33-cm) baking sheet."
                },
                {
                    "headline": "Sprinkle the cheese over the bread and add other fillings if desired.",
                    "description": "On top of the piece of bread on the cookie sheet, spread 1 ½ pounds (680 g) of grated cheddar cheese in an even layer. If you want to add any other fillings to the sandwich, such as crumbled bacon, sundried tomatoes, caramelized onions, or pesto, sprinkle them over the bread as well. You can substitute any cheese that you like for the cheddar. Just make sure that it melts well. Fontina, Gouda, provolone, mozzarella, and Colby are all cheese that melt well. If you’re planning to add other fillings to the grilled cheese, spread half of the cheese over the bread, lay down the fillings, and then cover them with the remaining cheese."
                },
                {
                    "headline": "Close the sandwich and weigh it down with a pan.",
                    "description": "Once you’ve added all the cheese and other fillings to the sandwich, place the other piece of foccacia on top with the cut side down. Set a large, heavy skillet that’s oven-safe on top of the sandwich to help weigh it down. If you only have smaller oven-safe skillets, use multiple pans to weigh down as much of the focaccia as possible."
                },
                {
                    "headline": "Place the sandwich in the oven and bake it until the cheese melts.",
                    "description": "With the heavy pan on top of the focaccia, set the baking sheet in the preheated oven. Allow it to bake until the cheese melts, which should take 8 to 10 minutes. Keep an eye on the sandwich to ensure that the focaccia doesn’t burn."
                },
                {
                    "headline": "Cut the sandwich into slices to serve.",
                    "description": "Once the cheese is completely melted, remove the grilled cheese from the oven. Use a sharp knife to slice the sandwich into 9 pieces, and serve. You can cut the grilled cheese into smaller pieces if you want to serve a larger crowd. Consider cutting the sandwich into bite-size pieces and using them as an appetizer at your next party."
                }
            ]
        },
        {
            "name": "Preparing Open-Faced Tomato Baguette Grilled Cheese",
            "steps": [
                {
                    "headline": "Preheat a grill pan.",
                    "description": "Place a large grill pan on your stove top, and turn the heat to medium-high. Allow the pan to heat for at least 5 minutes, so you can be sure that there are no hot spots that may burn the sandwich. You can also make the grilled cheese on a gas or charcoal outdoor grill or a tabletop grill."
                },
                {
                    "headline": "Mix the olive oil, oregano, red pepper, flakes, and salt.",
                    "description": "In a small bowl, combine 6 tablespoons (90 ml) of extra-virgin olive oil, 2 tablespoons (6 g) of chopped fresh oregano, ½ teaspoon (1 g) of red pepper flakes, and kosher salt to taste. Mix well to ensure that all of the ingredients are fully combined. You can substitute fresh chopped basil or parsley for the oregano if you prefer."
                },
                {
                    "headline": "Brush the cut sides of the baguette with the oil mixture and grill for several minutes.",
                    "description": "When you’ve flavored the oil, use a pastry brush to spread it over the cut sides of 1 baguette that’s been sliced in half horizontally. Place the baguette pieces cut side down in the grill pan, and grill them for approximately 4 minutes, or until they’re toasted. If you don’t have a pastry brush, use heavy duty napkins, paper towel, or coffee filters to spread the oil over the bread. Just make sure to use paper items that aren’t flimsy so they won’t leave bits of paper behind."
                },
                {
                    "headline": "Rub the garlic cloves over the grilled sides of the bread.",
                    "description": "When the baguette pieces are toasted, remove them from the grill pan. Flavor the bread further by rubbing down the cut sides with garlic. Use 1 large clove for each piece of bread. If you aren’t a fan of garlic, you can skip this step."
                },
                {
                    "headline": "Place the tomato slices on the bread and add the cheese.",
                    "description": "After you’ve flavored the baguette with the garlic, take 2 medium tomatoes that have been cut into ¼-inch (6.35-mm) slices and spread them evenly among the two baguette pieces. Next, layer ½ pound (228 g) of sliced provolone cheese over the tomatoes so they’re mostly covered. You may want to season the tomato slices with kosher salt to taste before adding the cheese."
                },
                {
                    "headline": "Grill the sandwich until the cheese melts.",
                    "description": "Place the baguette pieces in the grill pan again with the cover on. Allow the sandwich to cook until the cheese melts, which should take approximately 3 to 5 minutes."
                },
                {
                    "headline": "Season the sandwich with salt and drizzle the remaining oil over it.",
                    "description": "When the cheese on the sandwich is melted, remove it from the grill pan. Sprinkle a bit more kosher salt over it, and drizzle what’s left of the oil mixture over the top of the sandwich as well. You can omit the salt and/or the oil if you prefer."
                },
                {
                    "headline": "Cut the grilled cheese into slices to serve.",
                    "description": "Allow the sandwich to cool for 2 to 3 minutes, and then use a sharp knife to cut it into slices. Place the slices on a platter, and serve. Depending on how large you cut the slices, you should get 12 to 16 servings from the grilled cheese."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "A sharp knife",
        "A butter knife",
        "A large, heavy-bottomed, oven-safe skillet",
        "A spatula",
        "A large cookie sheet",
        "A large cookie sheet, preferably 18-inch by 13-inch (46-cm by 33-cm)",
        "A large, heavy, oven-safe skillet",
        "A large grill pan",
        "A small bowl",
        "A spoon",
        "A pastry brush"
    ],
    "text": " Putting Together A Giant Skillet Grilled Cheese Preheat the oven. Even though the grilled cheese is cooked in a pan, you may need to put it in the oven briefly to melt the cheese completely. Make sure that the oven is hot enough in case you need it by preheating it to 350 degrees Fahrenheit (177 degrees Celsius), which should take approximately 10 to 15 minutes. Pay attention to the oven so you know when it’s ready. Most models will either beep or flash an indicator light to let you know that the right temperature has been reached. Cut the bread in half horizontally and trim the crusts. Take 1 loaf of round, crusty bread, and use a sharp knife to slice it in half horizontally. Trim the top and bottom crusts from the bread to create two large, round slices that are approximately 1 ½ inches (3.8 cm) thick. These types of round, crusty bread are sometimes called bread boules, and are often used to serve soups and dips in. It can be difficult to cut a round loaf of bread, so be careful to tuck your fingers under when you're slicing. Spread the mustard onto the bread and cover with cheese. Once the bread is cut, use a butter knife to spread the mustard of your choice over one slice. Cover the mustard with ¼ pound (114 g) of thinly sliced Swiss cheese and ¼ pound (114 g) thinly sliced Monterey Jack cheese. Spread mustard on the other piece of bread, and close the sandwich. The mustard is optional, but adds delicious flavor to the grilled cheese. You can use your favorite type, such as honey, dijon, or coarse-ground. You can use substitute any melting cheese that you like for the Swiss and Monterey Jack. Cheddar, American, pepper jack, or mozzarella are other options to consider. You can add other fillings to the grilled cheese if you like. Bacon and tomatoes are classic additions, but you can be as creative as you’d like. Try adding ham, pepperoni, roasted red peppers, sliced apples, or even crumbled potato chips to your sandwich. Heat the oil in a pan. Add 1 tablespoon (15 ml) of vegetable or olive oil to a large, heavy-bottomed 10- or 12-inch (25 to 30-cm) skillet that’s oven-safe. Allow it to heat on medium-low for 3 to 5 minutes, or until the oil starts to shimmer. You can substitute butter for the oil, but butter burns off much more quickly so you may find yourself needing to replace it as you fry the sandwich. Butter the outside of the bread and place it in the pan. When the oil is heated, use a butter knife to spread 2 tablespoons (28.5 g) of unsalted, softened butter over the top of the sandwich. Place the sandwich in the pan buttered side down, and apply another 2 tablespoons (28.5 g) of butter to the other side of the sandwich that’s now facing up. Cook the sandwich until golden brown on both sides. Allow the sandwich to cook  for approximately 3 to 4 minutes or until the bottom has become golden brown. Use a spatula to carefully flip the sandwich over so the cooked side is now face up. Cook the other side for another 2 to 3 minutes so it becomes golden brown too. Check the sandwich’s color regularly while it’s cooking on both sides to ensure that it doesn’t burn. Transfer the sandwich to a cookie sheet and bake it until the cheese melts. When both sides of the sandwich are golden brown, remove it from the skillet and place it on a cookie sheet. Because it is such a large sandwich, all of the cheese may not be melted so put the grilled cheese in the preheated oven and let it cook until the cheese is fully melted, which may take 3 to 8 minutes. If the cheese is mostly melted when you take the sandwich out of the skillet, you don’t necessarily have to put it in the oven. The cheese will continue to melt a little if you leave it the pan off the heat. Slice the sandwich into wedges and serve. When the cheese is completely melted, use a sharp knife to cut it into four wedges. Place the wedges on plates, and serve. Whipping Up Focaccia Slab Grilled Cheese Preheat the oven. Instead of cooking the grilled cheese in a skillet, this sandwich is baked in the oven. To ensure that it’s hot enough to melt the cheese, preheat the oven to 375 degrees Fahrenheit (190 degrees Celsius) and allow it to fully heat. Cut the focaccia in half and place it on a baking sheet. Take 1 large, rectangular loaf of focaccia bread, and use a sharp knife to slice it half horizontally. Place the bottom piece on a large cookie sheet with the cut side up, and leave the other aside for a moment. Ideally, you should use a foccacia that fits tightly on an 18-inch by 13-inch (46-cm by 33-cm) baking sheet. Sprinkle the cheese over the bread and add other fillings if desired. On top of the piece of bread on the cookie sheet, spread 1 ½ pounds (680 g) of grated cheddar cheese in an even layer. If you want to add any other fillings to the sandwich, such as crumbled bacon, sundried tomatoes, caramelized onions, or pesto, sprinkle them over the bread as well. You can substitute any cheese that you like for the cheddar. Just make sure that it melts well. Fontina, Gouda, provolone, mozzarella, and Colby are all cheese that melt well. If you’re planning to add other fillings to the grilled cheese, spread half of the cheese over the bread, lay down the fillings, and then cover them with the remaining cheese. Close the sandwich and weigh it down with a pan. Once you’ve added all the cheese and other fillings to the sandwich, place the other piece of foccacia on top with the cut side down. Set a large, heavy skillet that’s oven-safe on top of the sandwich to help weigh it down. If you only have smaller oven-safe skillets, use multiple pans to weigh down as much of the focaccia as possible. Place the sandwich in the oven and bake it until the cheese melts. With the heavy pan on top of the focaccia, set the baking sheet in the preheated oven. Allow it to bake until the cheese melts, which should take 8 to 10 minutes. Keep an eye on the sandwich to ensure that the focaccia doesn’t burn. Cut the sandwich into slices to serve. Once the cheese is completely melted, remove the grilled cheese from the oven. Use a sharp knife to slice the sandwich into 9 pieces, and serve. You can cut the grilled cheese into smaller pieces if you want to serve a larger crowd. Consider cutting the sandwich into bite-size pieces and using them as an appetizer at your next party. Preparing Open-Faced Tomato Baguette Grilled Cheese Preheat a grill pan. Place a large grill pan on your stove top, and turn the heat to medium-high. Allow the pan to heat for at least 5 minutes, so you can be sure that there are no hot spots that may burn the sandwich. You can also make the grilled cheese on a gas or charcoal outdoor grill or a tabletop grill. Mix the olive oil, oregano, red pepper, flakes, and salt. In a small bowl, combine 6 tablespoons (90 ml) of extra-virgin olive oil, 2 tablespoons (6 g) of chopped fresh oregano, ½ teaspoon (1 g) of red pepper flakes, and kosher salt to taste. Mix well to ensure that all of the ingredients are fully combined. You can substitute fresh chopped basil or parsley for the oregano if you prefer. Brush the cut sides of the baguette with the oil mixture and grill for several minutes. When you’ve flavored the oil, use a pastry brush to spread it over the cut sides of 1 baguette that’s been sliced in half horizontally. Place the baguette pieces cut side down in the grill pan, and grill them for approximately 4 minutes, or until they’re toasted. If you don’t have a pastry brush, use heavy duty napkins, paper towel, or coffee filters to spread the oil over the bread. Just make sure to use paper items that aren’t flimsy so they won’t leave bits of paper behind. Rub the garlic cloves over the grilled sides of the bread. When the baguette pieces are toasted, remove them from the grill pan. Flavor the bread further by rubbing down the cut sides with garlic. Use 1 large clove for each piece of bread. If you aren’t a fan of garlic, you can skip this step. Place the tomato slices on the bread and add the cheese. After you’ve flavored the baguette with the garlic, take 2 medium tomatoes that have been cut into ¼-inch (6.35-mm) slices and spread them evenly among the two baguette pieces. Next, layer ½ pound (228 g) of sliced provolone cheese over the tomatoes so they’re mostly covered. You may want to season the tomato slices with kosher salt to taste before adding the cheese. Grill the sandwich until the cheese melts. Place the baguette pieces in the grill pan again with the cover on. Allow the sandwich to cook until the cheese melts, which should take approximately 3 to 5 minutes. Season the sandwich with salt and drizzle the remaining oil over it. When the cheese on the sandwich is melted, remove it from the grill pan. Sprinkle a bit more kosher salt over it, and drizzle what’s left of the oil mixture over the top of the sandwich as well. You can omit the salt and/or the oil if you prefer. Cut the grilled cheese into slices to serve. Allow the sandwich to cool for 2 to 3 minutes, and then use a sharp knife to cut it into slices. Place the slices on a platter, and serve. Depending on how large you cut the slices, you should get 12 to 16 servings from the grilled cheese. Finished. ",
    "sentences": [
        " Putting Together A Giant Skillet Grilled Cheese Preheat the oven.",
        "Even though the grilled cheese is cooked in a pan, you may need to put it in the oven briefly to melt the cheese completely.",
        "Make sure that the oven is hot enough in case you need it by preheating it to 350 degrees Fahrenheit (177 degrees Celsius), which should take approximately 10 to 15 minutes.",
        "Pay attention to the oven so you know when it’s ready.",
        "Most models will either beep or flash an indicator light to let you know that the right temperature has been reached.",
        "Cut the bread in half horizontally and trim the crusts.",
        "Take 1 loaf of round, crusty bread, and use a sharp knife to slice it in half horizontally.",
        "Trim the top and bottom crusts from the bread to create two large, round slices that are approximately 1 ½ inches (3.8 cm) thick.",
        "These types of round, crusty bread are sometimes called bread boules, and are often used to serve soups and dips in.",
        "It can be difficult to cut a round loaf of bread, so be careful to tuck your fingers under when you're slicing.",
        "Spread the mustard onto the bread and cover with cheese.",
        "Once the bread is cut, use a butter knife to spread the mustard of your choice over one slice.",
        "Cover the mustard with ¼ pound (114 g) of thinly sliced Swiss cheese and ¼ pound (114 g) thinly sliced Monterey Jack cheese.",
        "Spread mustard on the other piece of bread, and close the sandwich.",
        "The mustard is optional, but adds delicious flavor to the grilled cheese.",
        "You can use your favorite type, such as honey, dijon, or coarse-ground.",
        "You can use substitute any melting cheese that you like for the Swiss and Monterey Jack.",
        "Cheddar, American, pepper jack, or mozzarella are other options to consider.",
        "You can add other fillings to the grilled cheese if you like.",
        "Bacon and tomatoes are classic additions, but you can be as creative as you’d like.",
        "Try adding ham, pepperoni, roasted red peppers, sliced apples, or even crumbled potato chips to your sandwich.",
        "Heat the oil in a pan.",
        "Add 1 tablespoon (15 ml) of vegetable or olive oil to a large, heavy-bottomed 10- or 12-inch (25 to 30-cm) skillet that’s oven-safe.",
        "Allow it to heat on medium-low for 3 to 5 minutes, or until the oil starts to shimmer.",
        "You can substitute butter for the oil, but butter burns off much more quickly so you may find yourself needing to replace it as you fry the sandwich.",
        "Butter the outside of the bread and place it in the pan.",
        "When the oil is heated, use a butter knife to spread 2 tablespoons (28.5 g) of unsalted, softened butter over the top of the sandwich.",
        "Place the sandwich in the pan buttered side down, and apply another 2 tablespoons (28.5 g) of butter to the other side of the sandwich that’s now facing up.",
        "Cook the sandwich until golden brown on both sides.",
        "Allow the sandwich to cook  for approximately 3 to 4 minutes or until the bottom has become golden brown.",
        "Use a spatula to carefully flip the sandwich over so the cooked side is now face up.",
        "Cook the other side for another 2 to 3 minutes so it becomes golden brown too.",
        "Check the sandwich’s color regularly while it’s cooking on both sides to ensure that it doesn’t burn.",
        "Transfer the sandwich to a cookie sheet and bake it until the cheese melts.",
        "When both sides of the sandwich are golden brown, remove it from the skillet and place it on a cookie sheet.",
        "Because it is such a large sandwich, all of the cheese may not be melted so put the grilled cheese in the preheated oven and let it cook until the cheese is fully melted, which may take 3 to 8 minutes.",
        "If the cheese is mostly melted when you take the sandwich out of the skillet, you don’t necessarily have to put it in the oven.",
        "The cheese will continue to melt a little if you leave it the pan off the heat.",
        "Slice the sandwich into wedges and serve.",
        "When the cheese is completely melted, use a sharp knife to cut it into four wedges.",
        "Place the wedges on plates, and serve.",
        "Whipping Up Focaccia Slab Grilled Cheese Preheat the oven.",
        "Instead of cooking the grilled cheese in a skillet, this sandwich is baked in the oven.",
        "To ensure that it’s hot enough to melt the cheese, preheat the oven to 375 degrees Fahrenheit (190 degrees Celsius) and allow it to fully heat.",
        "Cut the focaccia in half and place it on a baking sheet.",
        "Take 1 large, rectangular loaf of focaccia bread, and use a sharp knife to slice it half horizontally.",
        "Place the bottom piece on a large cookie sheet with the cut side up, and leave the other aside for a moment.",
        "Ideally, you should use a foccacia that fits tightly on an 18-inch by 13-inch (46-cm by 33-cm) baking sheet.",
        "Sprinkle the cheese over the bread and add other fillings if desired.",
        "On top of the piece of bread on the cookie sheet, spread 1 ½ pounds (680 g) of grated cheddar cheese in an even layer.",
        "If you want to add any other fillings to the sandwich, such as crumbled bacon, sundried tomatoes, caramelized onions, or pesto, sprinkle them over the bread as well.",
        "You can substitute any cheese that you like for the cheddar.",
        "Just make sure that it melts well.",
        "Fontina, Gouda, provolone, mozzarella, and Colby are all cheese that melt well.",
        "If you’re planning to add other fillings to the grilled cheese, spread half of the cheese over the bread, lay down the fillings, and then cover them with the remaining cheese.",
        "Close the sandwich and weigh it down with a pan.",
        "Once you’ve added all the cheese and other fillings to the sandwich, place the other piece of foccacia on top with the cut side down.",
        "Set a large, heavy skillet that’s oven-safe on top of the sandwich to help weigh it down.",
        "If you only have smaller oven-safe skillets, use multiple pans to weigh down as much of the focaccia as possible.",
        "Place the sandwich in the oven and bake it until the cheese melts.",
        "With the heavy pan on top of the focaccia, set the baking sheet in the preheated oven.",
        "Allow it to bake until the cheese melts, which should take 8 to 10 minutes.",
        "Keep an eye on the sandwich to ensure that the focaccia doesn’t burn.",
        "Cut the sandwich into slices to serve.",
        "Once the cheese is completely melted, remove the grilled cheese from the oven.",
        "Use a sharp knife to slice the sandwich into 9 pieces, and serve.",
        "You can cut the grilled cheese into smaller pieces if you want to serve a larger crowd.",
        "Consider cutting the sandwich into bite-size pieces and using them as an appetizer at your next party.",
        "Preparing Open-Faced Tomato Baguette Grilled Cheese Preheat a grill pan.",
        "Place a large grill pan on your stove top, and turn the heat to medium-high.",
        "Allow the pan to heat for at least 5 minutes, so you can be sure that there are no hot spots that may burn the sandwich.",
        "You can also make the grilled cheese on a gas or charcoal outdoor grill or a tabletop grill.",
        "Mix the olive oil, oregano, red pepper, flakes, and salt.",
        "In a small bowl, combine 6 tablespoons (90 ml) of extra-virgin olive oil, 2 tablespoons (6 g) of chopped fresh oregano, ½ teaspoon (1 g) of red pepper flakes, and kosher salt to taste.",
        "Mix well to ensure that all of the ingredients are fully combined.",
        "You can substitute fresh chopped basil or parsley for the oregano if you prefer.",
        "Brush the cut sides of the baguette with the oil mixture and grill for several minutes.",
        "When you’ve flavored the oil, use a pastry brush to spread it over the cut sides of 1 baguette that’s been sliced in half horizontally.",
        "Place the baguette pieces cut side down in the grill pan, and grill them for approximately 4 minutes, or until they’re toasted.",
        "If you don’t have a pastry brush, use heavy duty napkins, paper towel, or coffee filters to spread the oil over the bread.",
        "Just make sure to use paper items that aren’t flimsy so they won’t leave bits of paper behind.",
        "Rub the garlic cloves over the grilled sides of the bread.",
        "When the baguette pieces are toasted, remove them from the grill pan.",
        "Flavor the bread further by rubbing down the cut sides with garlic.",
        "Use 1 large clove for each piece of bread.",
        "If you aren’t a fan of garlic, you can skip this step.",
        "Place the tomato slices on the bread and add the cheese.",
        "After you’ve flavored the baguette with the garlic, take 2 medium tomatoes that have been cut into ¼-inch (6.35-mm) slices and spread them evenly among the two baguette pieces.",
        "Next, layer ½ pound (228 g) of sliced provolone cheese over the tomatoes so they’re mostly covered.",
        "You may want to season the tomato slices with kosher salt to taste before adding the cheese.",
        "Grill the sandwich until the cheese melts.",
        "Place the baguette pieces in the grill pan again with the cover on.",
        "Allow the sandwich to cook until the cheese melts, which should take approximately 3 to 5 minutes.",
        "Season the sandwich with salt and drizzle the remaining oil over it.",
        "When the cheese on the sandwich is melted, remove it from the grill pan.",
        "Sprinkle a bit more kosher salt over it, and drizzle what’s left of the oil mixture over the top of the sandwich as well.",
        "You can omit the salt and/or the oil if you prefer.",
        "Cut the grilled cheese into slices to serve.",
        "Allow the sandwich to cool for 2 to 3 minutes, and then use a sharp knife to cut it into slices.",
        "Place the slices on a platter, and serve.",
        "Depending on how large you cut the slices, you should get 12 to 16 servings from the grilled cheese.",
        "Finished."
    ]
}