{
    "title": "How to Make a Fringed Table Runner",
    "url": "https://www.wikihow.com/Make-a-Fringed-Table-Runner",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping"
    ],
    "methods": [
        {
            "name": "Making a No Sew Table Runner",
            "steps": [
                {
                    "headline": "Start with utility burlap.",
                    "description": "Utility burlap is cheaper than other types of burlap. Even if utility burlap is not the exact color you want, you can decorate it after you purchase it to make an attractive table runner. Decorate your burlap if you want. Acrylic paint and a sponge brush can be used to decorate thick burlap. This works best if you're making a fringe table runner without pom-poms. You can dip a sponge brush in acrylic paint, which you can purchase at any craft store. Use the brush to add designs like circles, stars, hearts, or whatever shape you want. You can add seasonal shapes, like pumpkin shapes for Thanksgiving."
                },
                {
                    "headline": "Cut your fabric in the proper length.",
                    "description": "If you're not using burlap, figure what length of fabric you want for your table runner. This will depend on the length of your table. Your runner should be slightly longer than the full length of your table. Runners are usually thin strips of fabric, so strive for a rectangle-like shape. You should use a measuring stick to draw the lines of your rectangle to make sure you cut it straight. Cut a little more fabric than you intend to use, as you'll be fringing the edges slightly."
                },
                {
                    "headline": "Remove thread from the edge of the fabric with a seam ripper.",
                    "description": "To fringe the edges of your table, use your seam ripper. Pull out 2 to 4 threads from the edges of each side of the runner. If you want longer fringes, pull out more threads. Once you've loosened the threads with the seam ripper, use your fingers to pull them away from the fabric. Usually, threads will break as you pull. You will have to work your way down the thread, using the seam ripper to dislodge the threads and then gently pulling the loose threads out with your fingers."
                },
                {
                    "headline": "Trim the edges until they're an even length.",
                    "description": "Take a pair of sewing scissors. Trim the fringes on every edge of your runner. Trim them only slightly, especially if they're on the shorter side, until all the fringes are of roughly even length."
                }
            ]
        },
        {
            "name": "Sewing to Make a Pom-Fringed Table Runner",
            "steps": [
                {
                    "headline": "Measure your pom-pom trim.",
                    "description": "Measure the short sides of your table runner. Then, cut two strips of your pom-pom trim that are the exact length of your runner."
                },
                {
                    "headline": "Decide on the color palette you want before choosing the fringe to use.",
                    "description": "Think about the color scheme when choosing your supplies. You want to pick colors that go well together and with the color scheme of your kitchen. If you want to add two layers of pom-pom trim to each side, cut four strips of pom-pom trim."
                },
                {
                    "headline": "Lay your pom-pom trim on the edge of the runner.",
                    "description": "Lay one to two strips of pom-pom trim along each side of the runner. Secure the trim in place with pins. Go slowly and make sure to smooth out the trim before pinning it down. You do not want to cause wrinkles or bunches on the runner."
                },
                {
                    "headline": "Sew the trim in place.",
                    "description": "You want to use a running stitch. This means weaving the thread back and forth through the fabric. Sew the full length of the runner, keeping the pom-pom trim in place. Then, tie a knot at the end of the thread to hold it in place."
                }
            ]
        }
    ],
    "tyn": [
        "Natural fabric with a thick weave",
        "Scissors",
        "Seam ripper",
        "Pom-pom fringe",
        "Table runner",
        "Thread",
        "Needle"
    ],
    "text": " Making a No Sew Table Runner Start with utility burlap. Utility burlap is cheaper than other types of burlap. Even if utility burlap is not the exact color you want, you can decorate it after you purchase it to make an attractive table runner. Decorate your burlap if you want. Acrylic paint and a sponge brush can be used to decorate thick burlap. This works best if you're making a fringe table runner without pom-poms. You can dip a sponge brush in acrylic paint, which you can purchase at any craft store. Use the brush to add designs like circles, stars, hearts, or whatever shape you want. You can add seasonal shapes, like pumpkin shapes for Thanksgiving. Cut your fabric in the proper length. If you're not using burlap, figure what length of fabric you want for your table runner. This will depend on the length of your table. Your runner should be slightly longer than the full length of your table. Runners are usually thin strips of fabric, so strive for a rectangle-like shape. You should use a measuring stick to draw the lines of your rectangle to make sure you cut it straight. Cut a little more fabric than you intend to use, as you'll be fringing the edges slightly. Remove thread from the edge of the fabric with a seam ripper. To fringe the edges of your table, use your seam ripper. Pull out 2 to 4 threads from the edges of each side of the runner. If you want longer fringes, pull out more threads. Once you've loosened the threads with the seam ripper, use your fingers to pull them away from the fabric. Usually, threads will break as you pull. You will have to work your way down the thread, using the seam ripper to dislodge the threads and then gently pulling the loose threads out with your fingers. Trim the edges until they're an even length. Take a pair of sewing scissors. Trim the fringes on every edge of your runner. Trim them only slightly, especially if they're on the shorter side, until all the fringes are of roughly even length. Sewing to Make a Pom-Fringed Table Runner Measure your pom-pom trim. Measure the short sides of your table runner. Then, cut two strips of your pom-pom trim that are the exact length of your runner. Decide on the color palette you want before choosing the fringe to use. Think about the color scheme when choosing your supplies. You want to pick colors that go well together and with the color scheme of your kitchen. If you want to add two layers of pom-pom trim to each side, cut four strips of pom-pom trim. Lay your pom-pom trim on the edge of the runner. Lay one to two strips of pom-pom trim along each side of the runner. Secure the trim in place with pins. Go slowly and make sure to smooth out the trim before pinning it down. You do not want to cause wrinkles or bunches on the runner. Sew the trim in place. You want to use a running stitch. This means weaving the thread back and forth through the fabric. Sew the full length of the runner, keeping the pom-pom trim in place. Then, tie a knot at the end of the thread to hold it in place.",
    "sentences": [
        " Making a No Sew Table Runner Start with utility burlap.",
        "Utility burlap is cheaper than other types of burlap.",
        "Even if utility burlap is not the exact color you want, you can decorate it after you purchase it to make an attractive table runner.",
        "Decorate your burlap if you want.",
        "Acrylic paint and a sponge brush can be used to decorate thick burlap.",
        "This works best if you're making a fringe table runner without pom-poms.",
        "You can dip a sponge brush in acrylic paint, which you can purchase at any craft store.",
        "Use the brush to add designs like circles, stars, hearts, or whatever shape you want.",
        "You can add seasonal shapes, like pumpkin shapes for Thanksgiving.",
        "Cut your fabric in the proper length.",
        "If you're not using burlap, figure what length of fabric you want for your table runner.",
        "This will depend on the length of your table.",
        "Your runner should be slightly longer than the full length of your table.",
        "Runners are usually thin strips of fabric, so strive for a rectangle-like shape.",
        "You should use a measuring stick to draw the lines of your rectangle to make sure you cut it straight.",
        "Cut a little more fabric than you intend to use, as you'll be fringing the edges slightly.",
        "Remove thread from the edge of the fabric with a seam ripper.",
        "To fringe the edges of your table, use your seam ripper.",
        "Pull out 2 to 4 threads from the edges of each side of the runner.",
        "If you want longer fringes, pull out more threads.",
        "Once you've loosened the threads with the seam ripper, use your fingers to pull them away from the fabric.",
        "Usually, threads will break as you pull.",
        "You will have to work your way down the thread, using the seam ripper to dislodge the threads and then gently pulling the loose threads out with your fingers.",
        "Trim the edges until they're an even length.",
        "Take a pair of sewing scissors.",
        "Trim the fringes on every edge of your runner.",
        "Trim them only slightly, especially if they're on the shorter side, until all the fringes are of roughly even length.",
        "Sewing to Make a Pom-Fringed Table Runner Measure your pom-pom trim.",
        "Measure the short sides of your table runner.",
        "Then, cut two strips of your pom-pom trim that are the exact length of your runner.",
        "Decide on the color palette you want before choosing the fringe to use.",
        "Think about the color scheme when choosing your supplies.",
        "You want to pick colors that go well together and with the color scheme of your kitchen.",
        "If you want to add two layers of pom-pom trim to each side, cut four strips of pom-pom trim.",
        "Lay your pom-pom trim on the edge of the runner.",
        "Lay one to two strips of pom-pom trim along each side of the runner.",
        "Secure the trim in place with pins.",
        "Go slowly and make sure to smooth out the trim before pinning it down.",
        "You do not want to cause wrinkles or bunches on the runner.",
        "Sew the trim in place.",
        "You want to use a running stitch.",
        "This means weaving the thread back and forth through the fabric.",
        "Sew the full length of the runner, keeping the pom-pom trim in place.",
        "Then, tie a knot at the end of the thread to hold it in place."
    ]
}