{
    "title": "How to Make Christmas Stockings from Sweaters",
    "url": "https://www.wikihow.com/Make-Christmas-Stockings-from-Sweaters",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Christmas"
    ],
    "parts": [
        {
            "name": "Making the Pattern",
            "steps": [
                {
                    "headline": "Get a sweater.",
                    "description": "Choose a sweater with a wide, ribbed hem and an interesting pattern or cable-knit. Colors that work best include: white, ivory, red, and dark green. The ribbed hem will eventually make the cuff."
                },
                {
                    "headline": "Cut a large stocking shape out of paper.",
                    "description": "You can use kraft paper, wrapping paper, or even a paper bag for this. If you are having trouble getting the shape right, trace a Christmas stocking that you already own, or find a template online."
                },
                {
                    "headline": "Turn the sweater inside out and place the pattern on top.",
                    "description": "Align the top edge of your pattern just above the hem, where the sweater starts. This way, then you fold the hem down to make the cuff, the stocking won't be too short."
                },
                {
                    "headline": "Draw around the pattern, then set it aside.",
                    "description": "If your sweater is light-colored, use a marker. If your sweater is dark-colored, use chalk. Trace right along the outside edges of the pattern, without adding seam allowances. When you are done, set the pattern aside."
                }
            ]
        },
        {
            "name": "Sewing and Cutting the Stocking",
            "steps": [
                {
                    "headline": "Sew your stocking together, excluding the cuff.",
                    "description": "Pin the sweater together, starting just below the hem. Sew it together using a long stitch or a stretch stitch and a ½-inch (1.27-centimeter) seam allowance. Do not sew the hem part of the sweater just yet. This way, when you fold the cuff down, you don't see the seams. Remove the pins as you sew. If the material is fraying, go back, and sew along the edges (excluding the cuff) with a zigzag stitch."
                },
                {
                    "headline": "Cut two ½-inch (1.27-centimeter) slits into the seam.",
                    "description": "Cut the slits just above the start and end of your sewing, where the sweater ends and the hem starts. This will allow you to flip the cuff's seams out and sew them."
                },
                {
                    "headline": "Turn the stocking right-side out.",
                    "description": "If you need to, use your hands to push the sweater out from the inside, and reshape it. When you are done, your sweater should look like a stocking, with the cuff part un-sewn. Don't worry, you will fix that in a moment."
                },
                {
                    "headline": "Pin and sew the side edges of the cuff.",
                    "description": "Keeping the stocking turned right-side-out, pin the side edges of the cuff so that they are on the outside. Sew along them using a ½-inch (1.27-centimeter) seam allowance. It may look weird now, but once you fold the cuff down, you won't see the seams. If the material is fraying a lot, go back, and zigzag stitch over the raw edges."
                },
                {
                    "headline": "Fold the cuff down.",
                    "description": "This will hide the raw edges and the seams. If you need to, use a few drops of glue to keep the cuff down."
                }
            ]
        },
        {
            "name": "Adding the Finishing Touches",
            "steps": [
                {
                    "headline": "Cut a piece of ribbon or yarn to make the loop.",
                    "description": "How long you cut your ribbon or yarn depends on the size of your stocking. Bigger stockings will look better with bigger loops, and smaller stockings will look better with smaller ones. Be sure to use a color that matches your stocking! If your sweater's collar is narrow enough, you can use that instead."
                },
                {
                    "headline": "Tie the ends of the ribbon or yarn together to make a loop.",
                    "description": "If you are using a sweater collar, sew the ends of the collar together."
                },
                {
                    "headline": "Attach the loop to back seam of your stocking.",
                    "description": "Use a needle and thread to sew the loop to the inside seam of your stocking. Attach it about ½ to 1 inch (1.27 to 2.54 centimeters) below the top edge of the stocking. Don't have a needle and thread, or don't know how to sew? Use hot glue or fabric glue instead."
                },
                {
                    "headline": "Consider adding some pompoms for a final, cozy touch.",
                    "description": "Crochet a long chain using yarn in a matching or contrasting color. Tie it around the hanging loop of your stocking using a slipknot. Make two pompoms out of yarn, then glue them to each end of the cord. Don't know how to crochet? Braid three pieces of yarn together instead. Don't know how to make pompoms? Use store-bought ones instead. Weave the cord around the bottom edge of the cuff instead for a different look."
                }
            ]
        }
    ],
    "tyn": [
        "Sweater",
        "Fabric scissors",
        "Paper",
        "Dressmaker's pen or chalk",
        "Sewing pins",
        "Sewing machine",
        "Thread",
        "Ribbon or yarn"
    ],
    "text": " Making the Pattern Get a sweater. Choose a sweater with a wide, ribbed hem and an interesting pattern or cable-knit. Colors that work best include: white, ivory, red, and dark green. The ribbed hem will eventually make the cuff. Cut a large stocking shape out of paper. You can use kraft paper, wrapping paper, or even a paper bag for this. If you are having trouble getting the shape right, trace a Christmas stocking that you already own, or find a template online. Turn the sweater inside out and place the pattern on top. Align the top edge of your pattern just above the hem, where the sweater starts. This way, then you fold the hem down to make the cuff, the stocking won't be too short. Draw around the pattern, then set it aside. If your sweater is light-colored, use a marker. If your sweater is dark-colored, use chalk. Trace right along the outside edges of the pattern, without adding seam allowances. When you are done, set the pattern aside. Sewing and Cutting the Stocking Sew your stocking together, excluding the cuff. Pin the sweater together, starting just below the hem. Sew it together using a long stitch or a stretch stitch and a ½-inch (1.27-centimeter) seam allowance. Do not sew the hem part of the sweater just yet. This way, when you fold the cuff down, you don't see the seams. Remove the pins as you sew. If the material is fraying, go back, and sew along the edges (excluding the cuff) with a zigzag stitch. Cut two ½-inch (1.27-centimeter) slits into the seam. Cut the slits just above the start and end of your sewing, where the sweater ends and the hem starts. This will allow you to flip the cuff's seams out and sew them. Turn the stocking right-side out. If you need to, use your hands to push the sweater out from the inside, and reshape it. When you are done, your sweater should look like a stocking, with the cuff part un-sewn. Don't worry, you will fix that in a moment. Pin and sew the side edges of the cuff. Keeping the stocking turned right-side-out, pin the side edges of the cuff so that they are on the outside. Sew along them using a ½-inch (1.27-centimeter) seam allowance. It may look weird now, but once you fold the cuff down, you won't see the seams. If the material is fraying a lot, go back, and zigzag stitch over the raw edges. Fold the cuff down. This will hide the raw edges and the seams. If you need to, use a few drops of glue to keep the cuff down. Adding the Finishing Touches Cut a piece of ribbon or yarn to make the loop. How long you cut your ribbon or yarn depends on the size of your stocking. Bigger stockings will look better with bigger loops, and smaller stockings will look better with smaller ones. Be sure to use a color that matches your stocking! If your sweater's collar is narrow enough, you can use that instead. Tie the ends of the ribbon or yarn together to make a loop. If you are using a sweater collar, sew the ends of the collar together. Attach the loop to back seam of your stocking. Use a needle and thread to sew the loop to the inside seam of your stocking. Attach it about ½ to 1 inch (1.27 to 2.54 centimeters) below the top edge of the stocking. Don't have a needle and thread, or don't know how to sew? Use hot glue or fabric glue instead. Consider adding some pompoms for a final, cozy touch. Crochet a long chain using yarn in a matching or contrasting color. Tie it around the hanging loop of your stocking using a slipknot. Make two pompoms out of yarn, then glue them to each end of the cord. Don't know how to crochet? Braid three pieces of yarn together instead. Don't know how to make pompoms? Use store-bought ones instead. Weave the cord around the bottom edge of the cuff instead for a different look.",
    "sentences": [
        " Making the Pattern Get a sweater.",
        "Choose a sweater with a wide, ribbed hem and an interesting pattern or cable-knit.",
        "Colors that work best include: white, ivory, red, and dark green.",
        "The ribbed hem will eventually make the cuff.",
        "Cut a large stocking shape out of paper.",
        "You can use kraft paper, wrapping paper, or even a paper bag for this.",
        "If you are having trouble getting the shape right, trace a Christmas stocking that you already own, or find a template online.",
        "Turn the sweater inside out and place the pattern on top.",
        "Align the top edge of your pattern just above the hem, where the sweater starts.",
        "This way, then you fold the hem down to make the cuff, the stocking won't be too short.",
        "Draw around the pattern, then set it aside.",
        "If your sweater is light-colored, use a marker.",
        "If your sweater is dark-colored, use chalk.",
        "Trace right along the outside edges of the pattern, without adding seam allowances.",
        "When you are done, set the pattern aside.",
        "Sewing and Cutting the Stocking Sew your stocking together, excluding the cuff.",
        "Pin the sweater together, starting just below the hem.",
        "Sew it together using a long stitch or a stretch stitch and a ½-inch (1.27-centimeter) seam allowance.",
        "Do not sew the hem part of the sweater just yet.",
        "This way, when you fold the cuff down, you don't see the seams.",
        "Remove the pins as you sew.",
        "If the material is fraying, go back, and sew along the edges (excluding the cuff) with a zigzag stitch.",
        "Cut two ½-inch (1.27-centimeter) slits into the seam.",
        "Cut the slits just above the start and end of your sewing, where the sweater ends and the hem starts.",
        "This will allow you to flip the cuff's seams out and sew them.",
        "Turn the stocking right-side out.",
        "If you need to, use your hands to push the sweater out from the inside, and reshape it.",
        "When you are done, your sweater should look like a stocking, with the cuff part un-sewn.",
        "Don't worry, you will fix that in a moment.",
        "Pin and sew the side edges of the cuff.",
        "Keeping the stocking turned right-side-out, pin the side edges of the cuff so that they are on the outside.",
        "Sew along them using a ½-inch (1.27-centimeter) seam allowance.",
        "It may look weird now, but once you fold the cuff down, you won't see the seams.",
        "If the material is fraying a lot, go back, and zigzag stitch over the raw edges.",
        "Fold the cuff down.",
        "This will hide the raw edges and the seams.",
        "If you need to, use a few drops of glue to keep the cuff down.",
        "Adding the Finishing Touches Cut a piece of ribbon or yarn to make the loop.",
        "How long you cut your ribbon or yarn depends on the size of your stocking.",
        "Bigger stockings will look better with bigger loops, and smaller stockings will look better with smaller ones.",
        "Be sure to use a color that matches your stocking!",
        "If your sweater's collar is narrow enough, you can use that instead.",
        "Tie the ends of the ribbon or yarn together to make a loop.",
        "If you are using a sweater collar, sew the ends of the collar together.",
        "Attach the loop to back seam of your stocking.",
        "Use a needle and thread to sew the loop to the inside seam of your stocking.",
        "Attach it about ½ to 1 inch (1.27 to 2.54 centimeters) below the top edge of the stocking.",
        "Don't have a needle and thread, or don't know how to sew?",
        "Use hot glue or fabric glue instead.",
        "Consider adding some pompoms for a final, cozy touch.",
        "Crochet a long chain using yarn in a matching or contrasting color.",
        "Tie it around the hanging loop of your stocking using a slipknot.",
        "Make two pompoms out of yarn, then glue them to each end of the cord.",
        "Don't know how to crochet?",
        "Braid three pieces of yarn together instead.",
        "Don't know how to make pompoms?",
        "Use store-bought ones instead.",
        "Weave the cord around the bottom edge of the cuff instead for a different look."
    ]
}