{
    "title": "How to Make an Envelope Advent Calendar",
    "url": "https://www.wikihow.com/Make-an-Envelope-Advent-Calendar",
    "category_hierarchy": [
        "Philosophy and Religion",
        "Religion",
        "Christianity",
        "Christian Crafts"
    ],
    "parts": [
        {
            "name": "Making the Envelopes",
            "steps": [
                {
                    "headline": "Choose some paper for your envelopes.",
                    "description": "You can get really creative here. You can use the same color and pattern for each envelope, or you can mix-and-match. You can use solid-colored patter, patterned paper, or even double-sided paper. Scrapbooking paper is great for this, but so are kraft paper, old book pages, wrapping paper, and origami paper. You can use pre-made envelopes instead. If you wish to do this, click here to continue."
                },
                {
                    "headline": "Cut the papers into 25 squares.",
                    "description": "You can make your envelopes any size you want, but you need to start with squares. A great idea would be to make the envelopes all different sizes, with the biggest envelope reserved for December 25th."
                },
                {
                    "headline": "Fold the left and right corners towards the center of the sheet.",
                    "description": "Take your first sheet of paper and turn it so that it looks like a diamond. Fold the left and right corners towards the center. Run your fingernail or a bone folder along each crease to make them nice and crisp."
                },
                {
                    "headline": "Fold the bottom corner up just past the center.",
                    "description": "You want the edges to overlap the bottom edges of the side flaps slightly. Once again, run your fingernail or a bone folder along the crease to sharpen it. You can trim down the corner so that it doesn't stick out past the center."
                },
                {
                    "headline": "Secure the flaps with glue or double-sided tape.",
                    "description": "Pull the bottom flap down, and run a glue stick along the bottom edge of each side flap. You can also lay down strips of tape instead. Fold the bottom flap back down again, and run your finger across the seams. Tuck your hand inside the envelope to ensure that you didn't get any glue inside."
                },
                {
                    "headline": "Fold the top corner down just past the center of the page.",
                    "description": "You want it to overlap the side and bottom flaps slightly. Run your fingernail or a bone folder across the top crease to sharpen it."
                },
                {
                    "headline": "Number the envelopes 1 through 25.",
                    "description": "Save the biggest envelope for the 25th, the last day of the Advent calendar. You can write the numbers by hand using a marker, or you can use number stickers stamps. If you plan on gluing the envelopes down, put the number on the top flap. If you are using patterned envelopes, place the number on a white label first. This will make it stand out more."
                }
            ]
        },
        {
            "name": "Decorating the Envelopes",
            "steps": [
                {
                    "headline": "Consider decorating plain envelopes further.",
                    "description": "You might want to skip this section, however, if your envelopes already have patterns on them. If you add more decorations to patterned envelopes, they may end up looking too cluttered. You do not have to use all of the steps from this section to decorate your envelopes. Pick the ones that appeal the most to you."
                },
                {
                    "headline": "Give the envelopes a border with washi tape.",
                    "description": "Depending on the size of your envelopes, you may have to cut the tape in half lengthwise. Choose festive colors and themes, or use ones that match your envelopes. If you are putting tape on the back of the envelope, be careful not to tape the top flap shut!"
                },
                {
                    "headline": "Add color and design with festive stamps or stickers.",
                    "description": "Stamps would look create on brown, kraft paper envelopes, while stickers would look fantastic on plain red, green, or white envelopes. Don't get too carried away, however; less is often more! Pencil erasers make great polka dot stamps! Simply pat a brand-new pencil eraser into an ink pad, then stamp away! Use a Christmas sticker to keep the envelope shut."
                },
                {
                    "headline": "Hot glue found objects to the envelope.",
                    "description": "Buttons, gems, or small charms would all work great for this. You can even attach mini present bows to the envelopes to make them look more gift-like. Buttons will lend a rustic charm to your envelopes, while gemstones will make them look fancier."
                },
                {
                    "headline": "Draw simple designs.",
                    "description": "If you don't have a lot of time on your hands, you can always draw simple designs, such as stars, dots, snowflakes, or trees on your envelopes. You can draw these designs using markers, pens, colored pencils, paint, or even puff paint. Gold or silver markers are a great way to add some sparkle to your envelopes. Draw your designs in glue first, then shake some glitter onto the glue before it dries."
                },
                {
                    "headline": "Consider tying the envelops shut, but only after you fill them!",
                    "description": "Once you fill your envelopes, tie them shut using yarn, thin cord, or baker's twine. This will also give the envelopes a hint of rustic charm."
                }
            ]
        },
        {
            "name": "Filling the Envelopes",
            "steps": [
                {
                    "headline": "Consider filling your envelopes with an assortment of goodies.",
                    "description": "Most store-bought Advent calendars will contain the same type of item for each day. You can spice things up a bit by containing a different item for each day. For example, you can have chocolate for one day, a joke for the next, and a charm for the third. You do not have to use all of the ideas listed in this section. Pick and choose the ones that appeal the most to you."
                },
                {
                    "headline": "Go classic with chocolate or candy.",
                    "description": "Most store-bought Advent calendars contain chocolate. You can use chocolate bars in yours as well. If you don't like chocolate, try candy canes or starburst mints. Whatever you decide to use, try to keep it small and thin to reduce bulk. If this is for an adult, consider alcoholic chocolates! Give your calendars a hint of sparkle with chocolate coins. Keep the candy wrapped so that it doesn't melt."
                },
                {
                    "headline": "Fill envelopes with small goodies for young children.",
                    "description": "Many stores during the holiday season will have a dollar or stocking-stuffer section that contain small toys that are perfect for Advent calendars. Consider any of the following:\nStickers\nTemporary tattoos\nMini erasers\nMini jigsaw puzzles\nPlastic jewelry"
                },
                {
                    "headline": "Add some humor.",
                    "description": "Christmas-themed jokes and riddles are a great way to brighten up someone's day. Decorate small slips of cardstock, then write a joke or riddle on each one. Be sure to write the answer on the back! Insert one riddle into each envelope."
                },
                {
                    "headline": "Add some Christmas activities or acts of kindness.",
                    "description": "Decorate small slips of cardstock with festive borders and designs. Next, write a Christmas-themed activity on each slip of paper. Insert a slip of paper into each envelope. Here are some ideas to get you started:\nWatch a Christmas movie\nMake a Christmas craft\nVolunteer at a shelter\nDonate a toy or a blanket to a shelter. Spend time with a family member. Make a Christmas card to an active military member."
                }
            ]
        },
        {
            "name": "Hanging the Envelopes",
            "steps": [
                {
                    "headline": "Choose a way to display your Advent calendar.",
                    "description": "In this section, you will find lots of ways in which to display your Advent calendar. Pick one that appeals the most to you. You can hang the envelopes in numerical order, or you can hang them randomly. Part of the fun for many people is hunting for the right number!"
                },
                {
                    "headline": "Use a wooden hanger if you like to move things around.",
                    "description": "Paint a wooden hanger a festive color with spray paint or acrylic paint. Tie 5 pieces of ribbon or twine to bottom bar. Use mini wood clothespins to clip 5 envelopes to each one. Hang the Advent calendar from a hook or doorknob when you are done. Consider using washi tape or paint to make the clothespins look more festive."
                },
                {
                    "headline": "Turn it into a pennant banner.",
                    "description": "Cut a long piece of twine, and tie small loops to each end. Use the loops to hang the twine on your wall. Secure the envelopes to the twine using clothespins or paper clips."
                },
                {
                    "headline": "Get crafty with ribbon.",
                    "description": "Cut 5 pieces of ribbon. Glue 5 envelopes to each ribbon, with the flap facing outward. Tack the ribbons up in 5 horizontal rows on your wall or on a bulletin board."
                },
                {
                    "headline": "Attach the envelopes to a chalkboard.",
                    "description": "Get some magnetic tape, and cut it into smaller pieces. Add a strip to each envelope, then arrange the envelopes on a small chalkboard. If you'd like to, fill in the empty spaces between the envelopes with chalk. Can't find any magnetic tape? Use some festive magnets instead."
                },
                {
                    "headline": "Pin the envelopes to a bulletin board.",
                    "description": "Get a small bulletin board, and pin the envelopes to it using thumbtacks or pushpins. You can make your board look more festive by painting it or covering it with fabric first. Don't like the frame? Paint it or decorate it with washi tape. Can't find nice thumbtacks? Make your own by gluing charms to plain thumbtacks."
                },
                {
                    "headline": "Turn them into ornaments.",
                    "description": "Punch a hole into the corner of each envelope. Cut short pieces of string, ribbon, or twine. Thread each string through each hole, then tie the ends together to make loops. Hang the envelopes on a Christmas tree. You can use your current tree, or you can buy a mini tree, and use that instead."
                }
            ]
        }
    ],
    "tyn": [
        "Paper",
        "Glue stick or double-sided tape",
        "Scissors",
        "Decorative items (stamps, stickers, etc.)",
        "Something to hang the envelopes from (twine, clothespins, thumbtacks, etc.)"
    ],
    "text": " Making the Envelopes Choose some paper for your envelopes. You can get really creative here. You can use the same color and pattern for each envelope, or you can mix-and-match. You can use solid-colored patter, patterned paper, or even double-sided paper. Scrapbooking paper is great for this, but so are kraft paper, old book pages, wrapping paper, and origami paper. You can use pre-made envelopes instead. If you wish to do this, click here to continue. Cut the papers into 25 squares. You can make your envelopes any size you want, but you need to start with squares. A great idea would be to make the envelopes all different sizes, with the biggest envelope reserved for December 25th. Fold the left and right corners towards the center of the sheet. Take your first sheet of paper and turn it so that it looks like a diamond. Fold the left and right corners towards the center. Run your fingernail or a bone folder along each crease to make them nice and crisp. Fold the bottom corner up just past the center. You want the edges to overlap the bottom edges of the side flaps slightly. Once again, run your fingernail or a bone folder along the crease to sharpen it. You can trim down the corner so that it doesn't stick out past the center. Secure the flaps with glue or double-sided tape. Pull the bottom flap down, and run a glue stick along the bottom edge of each side flap. You can also lay down strips of tape instead. Fold the bottom flap back down again, and run your finger across the seams. Tuck your hand inside the envelope to ensure that you didn't get any glue inside. Fold the top corner down just past the center of the page. You want it to overlap the side and bottom flaps slightly. Run your fingernail or a bone folder across the top crease to sharpen it. Number the envelopes 1 through 25. Save the biggest envelope for the 25th, the last day of the Advent calendar. You can write the numbers by hand using a marker, or you can use number stickers stamps. If you plan on gluing the envelopes down, put the number on the top flap. If you are using patterned envelopes, place the number on a white label first. This will make it stand out more. Decorating the Envelopes Consider decorating plain envelopes further. You might want to skip this section, however, if your envelopes already have patterns on them. If you add more decorations to patterned envelopes, they may end up looking too cluttered. You do not have to use all of the steps from this section to decorate your envelopes. Pick the ones that appeal the most to you. Give the envelopes a border with washi tape. Depending on the size of your envelopes, you may have to cut the tape in half lengthwise. Choose festive colors and themes, or use ones that match your envelopes. If you are putting tape on the back of the envelope, be careful not to tape the top flap shut! Add color and design with festive stamps or stickers. Stamps would look create on brown, kraft paper envelopes, while stickers would look fantastic on plain red, green, or white envelopes. Don't get too carried away, however; less is often more! Pencil erasers make great polka dot stamps! Simply pat a brand-new pencil eraser into an ink pad, then stamp away! Use a Christmas sticker to keep the envelope shut. Hot glue found objects to the envelope. Buttons, gems, or small charms would all work great for this. You can even attach mini present bows to the envelopes to make them look more gift-like. Buttons will lend a rustic charm to your envelopes, while gemstones will make them look fancier. Draw simple designs. If you don't have a lot of time on your hands, you can always draw simple designs, such as stars, dots, snowflakes, or trees on your envelopes. You can draw these designs using markers, pens, colored pencils, paint, or even puff paint. Gold or silver markers are a great way to add some sparkle to your envelopes. Draw your designs in glue first, then shake some glitter onto the glue before it dries. Consider tying the envelops shut, but only after you fill them! Once you fill your envelopes, tie them shut using yarn, thin cord, or baker's twine. This will also give the envelopes a hint of rustic charm. Filling the Envelopes Consider filling your envelopes with an assortment of goodies. Most store-bought Advent calendars will contain the same type of item for each day. You can spice things up a bit by containing a different item for each day. For example, you can have chocolate for one day, a joke for the next, and a charm for the third. You do not have to use all of the ideas listed in this section. Pick and choose the ones that appeal the most to you. Go classic with chocolate or candy. Most store-bought Advent calendars contain chocolate. You can use chocolate bars in yours as well. If you don't like chocolate, try candy canes or starburst mints. Whatever you decide to use, try to keep it small and thin to reduce bulk. If this is for an adult, consider alcoholic chocolates! Give your calendars a hint of sparkle with chocolate coins. Keep the candy wrapped so that it doesn't melt. Fill envelopes with small goodies for young children. Many stores during the holiday season will have a dollar or stocking-stuffer section that contain small toys that are perfect for Advent calendars. Consider any of the following:\nStickers\nTemporary tattoos\nMini erasers\nMini jigsaw puzzles\nPlastic jewelry Add some humor. Christmas-themed jokes and riddles are a great way to brighten up someone's day. Decorate small slips of cardstock, then write a joke or riddle on each one. Be sure to write the answer on the back! Insert one riddle into each envelope. Add some Christmas activities or acts of kindness. Decorate small slips of cardstock with festive borders and designs. Next, write a Christmas-themed activity on each slip of paper. Insert a slip of paper into each envelope. Here are some ideas to get you started:\nWatch a Christmas movie\nMake a Christmas craft\nVolunteer at a shelter\nDonate a toy or a blanket to a shelter. Spend time with a family member. Make a Christmas card to an active military member. Hanging the Envelopes Choose a way to display your Advent calendar. In this section, you will find lots of ways in which to display your Advent calendar. Pick one that appeals the most to you. You can hang the envelopes in numerical order, or you can hang them randomly. Part of the fun for many people is hunting for the right number! Use a wooden hanger if you like to move things around. Paint a wooden hanger a festive color with spray paint or acrylic paint. Tie 5 pieces of ribbon or twine to bottom bar. Use mini wood clothespins to clip 5 envelopes to each one. Hang the Advent calendar from a hook or doorknob when you are done. Consider using washi tape or paint to make the clothespins look more festive. Turn it into a pennant banner. Cut a long piece of twine, and tie small loops to each end. Use the loops to hang the twine on your wall. Secure the envelopes to the twine using clothespins or paper clips. Get crafty with ribbon. Cut 5 pieces of ribbon. Glue 5 envelopes to each ribbon, with the flap facing outward. Tack the ribbons up in 5 horizontal rows on your wall or on a bulletin board. Attach the envelopes to a chalkboard. Get some magnetic tape, and cut it into smaller pieces. Add a strip to each envelope, then arrange the envelopes on a small chalkboard. If you'd like to, fill in the empty spaces between the envelopes with chalk. Can't find any magnetic tape? Use some festive magnets instead. Pin the envelopes to a bulletin board. Get a small bulletin board, and pin the envelopes to it using thumbtacks or pushpins. You can make your board look more festive by painting it or covering it with fabric first. Don't like the frame? Paint it or decorate it with washi tape. Can't find nice thumbtacks? Make your own by gluing charms to plain thumbtacks. Turn them into ornaments. Punch a hole into the corner of each envelope. Cut short pieces of string, ribbon, or twine. Thread each string through each hole, then tie the ends together to make loops. Hang the envelopes on a Christmas tree. You can use your current tree, or you can buy a mini tree, and use that instead.",
    "sentences": [
        " Making the Envelopes Choose some paper for your envelopes.",
        "You can get really creative here.",
        "You can use the same color and pattern for each envelope, or you can mix-and-match.",
        "You can use solid-colored patter, patterned paper, or even double-sided paper.",
        "Scrapbooking paper is great for this, but so are kraft paper, old book pages, wrapping paper, and origami paper.",
        "You can use pre-made envelopes instead.",
        "If you wish to do this, click here to continue.",
        "Cut the papers into 25 squares.",
        "You can make your envelopes any size you want, but you need to start with squares.",
        "A great idea would be to make the envelopes all different sizes, with the biggest envelope reserved for December 25th.",
        "Fold the left and right corners towards the center of the sheet.",
        "Take your first sheet of paper and turn it so that it looks like a diamond.",
        "Fold the left and right corners towards the center.",
        "Run your fingernail or a bone folder along each crease to make them nice and crisp.",
        "Fold the bottom corner up just past the center.",
        "You want the edges to overlap the bottom edges of the side flaps slightly.",
        "Once again, run your fingernail or a bone folder along the crease to sharpen it.",
        "You can trim down the corner so that it doesn't stick out past the center.",
        "Secure the flaps with glue or double-sided tape.",
        "Pull the bottom flap down, and run a glue stick along the bottom edge of each side flap.",
        "You can also lay down strips of tape instead.",
        "Fold the bottom flap back down again, and run your finger across the seams.",
        "Tuck your hand inside the envelope to ensure that you didn't get any glue inside.",
        "Fold the top corner down just past the center of the page.",
        "You want it to overlap the side and bottom flaps slightly.",
        "Run your fingernail or a bone folder across the top crease to sharpen it.",
        "Number the envelopes 1 through 25.",
        "Save the biggest envelope for the 25th, the last day of the Advent calendar.",
        "You can write the numbers by hand using a marker, or you can use number stickers stamps.",
        "If you plan on gluing the envelopes down, put the number on the top flap.",
        "If you are using patterned envelopes, place the number on a white label first.",
        "This will make it stand out more.",
        "Decorating the Envelopes Consider decorating plain envelopes further.",
        "You might want to skip this section, however, if your envelopes already have patterns on them.",
        "If you add more decorations to patterned envelopes, they may end up looking too cluttered.",
        "You do not have to use all of the steps from this section to decorate your envelopes.",
        "Pick the ones that appeal the most to you.",
        "Give the envelopes a border with washi tape.",
        "Depending on the size of your envelopes, you may have to cut the tape in half lengthwise.",
        "Choose festive colors and themes, or use ones that match your envelopes.",
        "If you are putting tape on the back of the envelope, be careful not to tape the top flap shut!",
        "Add color and design with festive stamps or stickers.",
        "Stamps would look create on brown, kraft paper envelopes, while stickers would look fantastic on plain red, green, or white envelopes.",
        "Don't get too carried away, however; less is often more!",
        "Pencil erasers make great polka dot stamps!",
        "Simply pat a brand-new pencil eraser into an ink pad, then stamp away!",
        "Use a Christmas sticker to keep the envelope shut.",
        "Hot glue found objects to the envelope.",
        "Buttons, gems, or small charms would all work great for this.",
        "You can even attach mini present bows to the envelopes to make them look more gift-like.",
        "Buttons will lend a rustic charm to your envelopes, while gemstones will make them look fancier.",
        "Draw simple designs.",
        "If you don't have a lot of time on your hands, you can always draw simple designs, such as stars, dots, snowflakes, or trees on your envelopes.",
        "You can draw these designs using markers, pens, colored pencils, paint, or even puff paint.",
        "Gold or silver markers are a great way to add some sparkle to your envelopes.",
        "Draw your designs in glue first, then shake some glitter onto the glue before it dries.",
        "Consider tying the envelops shut, but only after you fill them!",
        "Once you fill your envelopes, tie them shut using yarn, thin cord, or baker's twine.",
        "This will also give the envelopes a hint of rustic charm.",
        "Filling the Envelopes Consider filling your envelopes with an assortment of goodies.",
        "Most store-bought Advent calendars will contain the same type of item for each day.",
        "You can spice things up a bit by containing a different item for each day.",
        "For example, you can have chocolate for one day, a joke for the next, and a charm for the third.",
        "You do not have to use all of the ideas listed in this section.",
        "Pick and choose the ones that appeal the most to you.",
        "Go classic with chocolate or candy.",
        "Most store-bought Advent calendars contain chocolate.",
        "You can use chocolate bars in yours as well.",
        "If you don't like chocolate, try candy canes or starburst mints.",
        "Whatever you decide to use, try to keep it small and thin to reduce bulk.",
        "If this is for an adult, consider alcoholic chocolates!",
        "Give your calendars a hint of sparkle with chocolate coins.",
        "Keep the candy wrapped so that it doesn't melt.",
        "Fill envelopes with small goodies for young children.",
        "Many stores during the holiday season will have a dollar or stocking-stuffer section that contain small toys that are perfect for Advent calendars.",
        "Consider any of the following:\nStickers\nTemporary tattoos\nMini erasers\nMini jigsaw puzzles\nPlastic jewelry Add some humor.",
        "Christmas-themed jokes and riddles are a great way to brighten up someone's day.",
        "Decorate small slips of cardstock, then write a joke or riddle on each one.",
        "Be sure to write the answer on the back!",
        "Insert one riddle into each envelope.",
        "Add some Christmas activities or acts of kindness.",
        "Decorate small slips of cardstock with festive borders and designs.",
        "Next, write a Christmas-themed activity on each slip of paper.",
        "Insert a slip of paper into each envelope.",
        "Here are some ideas to get you started:\nWatch a Christmas movie\nMake a Christmas craft\nVolunteer at a shelter\nDonate a toy or a blanket to a shelter.",
        "Spend time with a family member.",
        "Make a Christmas card to an active military member.",
        "Hanging the Envelopes Choose a way to display your Advent calendar.",
        "In this section, you will find lots of ways in which to display your Advent calendar.",
        "Pick one that appeals the most to you.",
        "You can hang the envelopes in numerical order, or you can hang them randomly.",
        "Part of the fun for many people is hunting for the right number!",
        "Use a wooden hanger if you like to move things around.",
        "Paint a wooden hanger a festive color with spray paint or acrylic paint.",
        "Tie 5 pieces of ribbon or twine to bottom bar.",
        "Use mini wood clothespins to clip 5 envelopes to each one.",
        "Hang the Advent calendar from a hook or doorknob when you are done.",
        "Consider using washi tape or paint to make the clothespins look more festive.",
        "Turn it into a pennant banner.",
        "Cut a long piece of twine, and tie small loops to each end.",
        "Use the loops to hang the twine on your wall.",
        "Secure the envelopes to the twine using clothespins or paper clips.",
        "Get crafty with ribbon.",
        "Cut 5 pieces of ribbon.",
        "Glue 5 envelopes to each ribbon, with the flap facing outward.",
        "Tack the ribbons up in 5 horizontal rows on your wall or on a bulletin board.",
        "Attach the envelopes to a chalkboard.",
        "Get some magnetic tape, and cut it into smaller pieces.",
        "Add a strip to each envelope, then arrange the envelopes on a small chalkboard.",
        "If you'd like to, fill in the empty spaces between the envelopes with chalk.",
        "Can't find any magnetic tape?",
        "Use some festive magnets instead.",
        "Pin the envelopes to a bulletin board.",
        "Get a small bulletin board, and pin the envelopes to it using thumbtacks or pushpins.",
        "You can make your board look more festive by painting it or covering it with fabric first.",
        "Don't like the frame?",
        "Paint it or decorate it with washi tape.",
        "Can't find nice thumbtacks?",
        "Make your own by gluing charms to plain thumbtacks.",
        "Turn them into ornaments.",
        "Punch a hole into the corner of each envelope.",
        "Cut short pieces of string, ribbon, or twine.",
        "Thread each string through each hole, then tie the ends together to make loops.",
        "Hang the envelopes on a Christmas tree.",
        "You can use your current tree, or you can buy a mini tree, and use that instead."
    ]
}