{
    "title": "How to Make Ambrosia and Nectar",
    "url": "https://www.wikihow.com/Make-Ambrosia-and-Nectar",
    "category_hierarchy": [
        "Arts and Entertainment"
    ],
    "steps": [
        {
            "headline": "Add 1/2 cup of sour cream to the bowl.",
            "description": "This adds the little sour taste needed to make ambrosia. You could use either regular or fat free."
        },
        {
            "headline": "Combine an entire eight-ounce whipped topping container with the sour cream.",
            "description": "You get this at the frozen food isle but you'll need to thaw it out because you're going to have to work it in and mix it. Again, any regular or fat free will do."
        },
        {
            "headline": "Take a large spoon and mix the ingredients together.",
            "description": "Any solid spoon around one foot will be nice. For slotted spoons, small holes would be perfect. Mix until you are satisfied with the smooth look of the ambrosia"
        },
        {
            "headline": "Add any light or regular fruit cocktail to the ambrosia.",
            "description": "Some taste differences will occur if you use a light cocktail. Light fruit cocktail is sometimes packed in pear syrup from concentrate while regular is packed in heavy syrup. These often come in 15 ounce cans, so just dump the whole thing in."
        },
        {
            "headline": "Add mandarin oranges.",
            "description": "These also come in 15 ounce cans so again dump the whole thing in. You don't have to use the water that the mandarin oranges come in, so it's okay to drain out the water before putting it in."
        },
        {
            "headline": "Add the cherries.",
            "description": "You'll need to use the full 16 ounce jar for the solution. Again you'll need to dump the entire container in the ambrosia. Cherries in most stores are expensive, remember to select and store cherries the correct way."
        },
        {
            "headline": "Measure out one cup of flaked coconut and add it in the mix.",
            "description": "That is the very distinguishing quantity of ambrosia right there, or if you prefer \"secret ingredient\"."
        },
        {
            "headline": "Grab two cups of regular sized marshmallows and place it into the ambrosia.",
            "description": "Marshmallows make the sweet side of ambrosia a little sweeter. It makes the taste a little more enjoyable for children too. If you want to try a fun twist instead of buying these read make marshmallows"
        },
        {
            "headline": "Stir the solution together with that big one foot spoon.",
            "description": "A regular soup spoon isn't going to do much if you try to mix the ambrosia with it. Mix until you're satisfied with the way the marshmallows, sour cream and whipped topping lather up on the fruits."
        },
        {
            "headline": "Blend the ambrosia mix by depositing it in the blender.",
            "description": "Mix for about one minute until you're happy with the delicious thick outcome of the ambrosia."
        },
        {
            "headline": "Add in the nectar.",
            "description": "The nectar will be any kind of fruit that stores sell in nectar juice. Examples of that are apples, mangoes, pears, and peaches."
        },
        {
            "headline": "Blend away the ambrosia and nectar until you're happy with the thickness of the liquid.",
            "description": "30 seconds to two minutes should be enough."
        },
        {
            "headline": "Add in one tablespoon of sugar or more if desired.",
            "description": "The sweetness of ambrosia and nectar counts!"
        },
        {
            "headline": "Gulp down this refreshing delectable drink and enjoy!",
            "description": "It's perfect for hanging outside on a hot summer day by the pool or on the porch."
        },
        {
            "headline": "Finished.",
            "description": ""
        }
    ],
    "tyn": [
        "Large glass or plastic see-through bowl or any large bowl",
        "Solid spoon around one foot",
        "Measuring cup",
        "Blender"
    ],
    "text": " Add 1/2 cup of sour cream to the bowl. This adds the little sour taste needed to make ambrosia. You could use either regular or fat free. Combine an entire eight-ounce whipped topping container with the sour cream. You get this at the frozen food isle but you'll need to thaw it out because you're going to have to work it in and mix it. Again, any regular or fat free will do. Take a large spoon and mix the ingredients together. Any solid spoon around one foot will be nice. For slotted spoons, small holes would be perfect. Mix until you are satisfied with the smooth look of the ambrosia Add any light or regular fruit cocktail to the ambrosia. Some taste differences will occur if you use a light cocktail. Light fruit cocktail is sometimes packed in pear syrup from concentrate while regular is packed in heavy syrup. These often come in 15 ounce cans, so just dump the whole thing in. Add mandarin oranges. These also come in 15 ounce cans so again dump the whole thing in. You don't have to use the water that the mandarin oranges come in, so it's okay to drain out the water before putting it in. Add the cherries. You'll need to use the full 16 ounce jar for the solution. Again you'll need to dump the entire container in the ambrosia. Cherries in most stores are expensive, remember to select and store cherries the correct way. Measure out one cup of flaked coconut and add it in the mix. That is the very distinguishing quantity of ambrosia right there, or if you prefer \"secret ingredient\". Grab two cups of regular sized marshmallows and place it into the ambrosia. Marshmallows make the sweet side of ambrosia a little sweeter. It makes the taste a little more enjoyable for children too. If you want to try a fun twist instead of buying these read make marshmallows Stir the solution together with that big one foot spoon. A regular soup spoon isn't going to do much if you try to mix the ambrosia with it. Mix until you're satisfied with the way the marshmallows, sour cream and whipped topping lather up on the fruits. Blend the ambrosia mix by depositing it in the blender. Mix for about one minute until you're happy with the delicious thick outcome of the ambrosia. Add in the nectar. The nectar will be any kind of fruit that stores sell in nectar juice. Examples of that are apples, mangoes, pears, and peaches. Blend away the ambrosia and nectar until you're happy with the thickness of the liquid. 30 seconds to two minutes should be enough. Add in one tablespoon of sugar or more if desired. The sweetness of ambrosia and nectar counts! Gulp down this refreshing delectable drink and enjoy! It's perfect for hanging outside on a hot summer day by the pool or on the porch. Finished. ",
    "sentences": [
        " Add 1/2 cup of sour cream to the bowl.",
        "This adds the little sour taste needed to make ambrosia.",
        "You could use either regular or fat free.",
        "Combine an entire eight-ounce whipped topping container with the sour cream.",
        "You get this at the frozen food isle but you'll need to thaw it out because you're going to have to work it in and mix it.",
        "Again, any regular or fat free will do.",
        "Take a large spoon and mix the ingredients together.",
        "Any solid spoon around one foot will be nice.",
        "For slotted spoons, small holes would be perfect.",
        "Mix until you are satisfied with the smooth look of the ambrosia Add any light or regular fruit cocktail to the ambrosia.",
        "Some taste differences will occur if you use a light cocktail.",
        "Light fruit cocktail is sometimes packed in pear syrup from concentrate while regular is packed in heavy syrup.",
        "These often come in 15 ounce cans, so just dump the whole thing in.",
        "Add mandarin oranges.",
        "These also come in 15 ounce cans so again dump the whole thing in.",
        "You don't have to use the water that the mandarin oranges come in, so it's okay to drain out the water before putting it in.",
        "Add the cherries.",
        "You'll need to use the full 16 ounce jar for the solution.",
        "Again you'll need to dump the entire container in the ambrosia.",
        "Cherries in most stores are expensive, remember to select and store cherries the correct way.",
        "Measure out one cup of flaked coconut and add it in the mix.",
        "That is the very distinguishing quantity of ambrosia right there, or if you prefer \"secret ingredient\".",
        "Grab two cups of regular sized marshmallows and place it into the ambrosia.",
        "Marshmallows make the sweet side of ambrosia a little sweeter.",
        "It makes the taste a little more enjoyable for children too.",
        "If you want to try a fun twist instead of buying these read make marshmallows Stir the solution together with that big one foot spoon.",
        "A regular soup spoon isn't going to do much if you try to mix the ambrosia with it.",
        "Mix until you're satisfied with the way the marshmallows, sour cream and whipped topping lather up on the fruits.",
        "Blend the ambrosia mix by depositing it in the blender.",
        "Mix for about one minute until you're happy with the delicious thick outcome of the ambrosia.",
        "Add in the nectar.",
        "The nectar will be any kind of fruit that stores sell in nectar juice.",
        "Examples of that are apples, mangoes, pears, and peaches.",
        "Blend away the ambrosia and nectar until you're happy with the thickness of the liquid.",
        "30 seconds to two minutes should be enough.",
        "Add in one tablespoon of sugar or more if desired.",
        "The sweetness of ambrosia and nectar counts!",
        "Gulp down this refreshing delectable drink and enjoy!",
        "It's perfect for hanging outside on a hot summer day by the pool or on the porch.",
        "Finished."
    ]
}