{
    "title": "How to Make a Pom‐Pom Polar Bear",
    "url": "https://www.wikihow.com/Make-a-Pom%E2%80%90Pom-Polar-Bear",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "methods": [
        {
            "name": "Crafting an Adult Pom-Pom Polar Bear",
            "steps": [
                {
                    "headline": "Make the four legs.",
                    "description": "Take two white chenille stems and cut them in half. Then coil each half-stem around a half-inch (1.25 cm) diameter marker. You will wrap the stem around the marker about five times to create an individual leg. Repeat this process with the remaining stem halves and then glue them onto a two-inch (5 cm) white pom-pom so that they resemble the four legs and body of a polar bear. You can find the stems and the pom-poms at your local crafts store."
                },
                {
                    "headline": "Put together the head.",
                    "description": "Cut a chenille stem in half and twist it around the back of a one-inch (2.5 cm) white pom-pom. Coil the ends of the stem towards the pom-pom to create the bear’s ears."
                },
                {
                    "headline": "Glue the head to the body.",
                    "description": "Apply some glue to the back of the head where you attached the ears. This will give you plenty of space to make your bear’s face. Then attach it to the front side of the body."
                },
                {
                    "headline": "Add the face and tail.",
                    "description": "Glue a half-inch (1.25 cm) sparkly white pom-pom to the front lower section of the bear’s head. Take a mini black pom-pom and glue it to the front end of the sparkly pom-pom to create a nose. Then glue two mini black pom-poms above the nose to create the bear’s eyes. Finally, attach a half-inch (1.25 cm) white pom-pom to the back of the bear’s body to create a tail."
                }
            ]
        },
        {
            "name": "Making a Baby Pom-Pom Polar Bear",
            "steps": [
                {
                    "headline": "Glue together the body.",
                    "description": "With your hot glue gun, attach a half-inch (1.25 cm) white pom-pom to the bottom side of a one-inch (2.5 cm) white pom-pom. Add three more half-inch pom-poms to the same side to create the baby bear’s legs. Once attached, the legs should support the larger pom-pom and hold it off the ground."
                },
                {
                    "headline": "Attach the ears and head.",
                    "description": "With a pair of scissors, cut a three-inch (7.6 cm) piece of chenille stem. Bend the stem into a heart shape, with the ends curling in towards each other. Glue the heart-shaped stem between the front end of the body and a half-inch (1.25 cm) sparkly pom-pom to create the head."
                },
                {
                    "headline": "Make the face and tail.",
                    "description": "Glue a mini black pom-pom to the lower front section of the head to make a nose. Attach two mini-black pom-poms slightly above the nose to create the eyes. Cut a half-inch (1.25 cm) piece of white chenille and glue it to the back of the body to serve as a tail."
                }
            ]
        },
        {
            "name": "Building a Sitting Pom-Pom Polar Bear with a Scarf",
            "steps": [
                {
                    "headline": "Make the body.",
                    "description": "Glue a one-inch (2.5 cm) pom-pom to the top of a two-inch (5 cm) pom-pom to create the head and body of your bear. Then take two mini white pom-poms and glue them to the top of the head to make the ears. Be sure to keep a little space between the ears. You can find pom-poms, wiggly eyes and chenille stem at your local crafts store."
                },
                {
                    "headline": "Attach the face.",
                    "description": "Glue a mini black pom-pom to the lower front of the bear’s head. Slightly above the nose, attach two small wiggly eyes. The eyes should be about halfway between the ears and the nose."
                },
                {
                    "headline": "Add the limbs and a scarf.",
                    "description": "Glue four mini pom-poms to the front side of the bear’s body to make the legs. Attach a fifth mini pom-pom to the back for a tail. Make sure that the two bottom legs and the tail allow the bear to sit and keep it upright. Finally, wrap a three-inch (7.6 cm) piece of red or silver chenille stem around the bear’s neck to serve as a scarf. When you attach the scarf, do not get it so snug around the bear’s neck that it pops the head off."
                }
            ]
        }
    ],
    "tyn": [
        "Assorted sizes of white, black, and sparkly white pom-poms",
        "Silver and white chenille stems",
        "Wiggly eyes",
        "A hot glue gun or craft glue",
        "A half-inch (1.25 cm) diameter marker",
        "Scissors"
    ],
    "text": " Crafting an Adult Pom-Pom Polar Bear Make the four legs. Take two white chenille stems and cut them in half. Then coil each half-stem around a half-inch (1.25 cm) diameter marker. You will wrap the stem around the marker about five times to create an individual leg. Repeat this process with the remaining stem halves and then glue them onto a two-inch (5 cm) white pom-pom so that they resemble the four legs and body of a polar bear. You can find the stems and the pom-poms at your local crafts store. Put together the head. Cut a chenille stem in half and twist it around the back of a one-inch (2.5 cm) white pom-pom. Coil the ends of the stem towards the pom-pom to create the bear’s ears. Glue the head to the body. Apply some glue to the back of the head where you attached the ears. This will give you plenty of space to make your bear’s face. Then attach it to the front side of the body. Add the face and tail. Glue a half-inch (1.25 cm) sparkly white pom-pom to the front lower section of the bear’s head. Take a mini black pom-pom and glue it to the front end of the sparkly pom-pom to create a nose. Then glue two mini black pom-poms above the nose to create the bear’s eyes. Finally, attach a half-inch (1.25 cm) white pom-pom to the back of the bear’s body to create a tail. Making a Baby Pom-Pom Polar Bear Glue together the body. With your hot glue gun, attach a half-inch (1.25 cm) white pom-pom to the bottom side of a one-inch (2.5 cm) white pom-pom. Add three more half-inch pom-poms to the same side to create the baby bear’s legs. Once attached, the legs should support the larger pom-pom and hold it off the ground. Attach the ears and head. With a pair of scissors, cut a three-inch (7.6 cm) piece of chenille stem. Bend the stem into a heart shape, with the ends curling in towards each other. Glue the heart-shaped stem between the front end of the body and a half-inch (1.25 cm) sparkly pom-pom to create the head. Make the face and tail. Glue a mini black pom-pom to the lower front section of the head to make a nose. Attach two mini-black pom-poms slightly above the nose to create the eyes. Cut a half-inch (1.25 cm) piece of white chenille and glue it to the back of the body to serve as a tail. Building a Sitting Pom-Pom Polar Bear with a Scarf Make the body. Glue a one-inch (2.5 cm) pom-pom to the top of a two-inch (5 cm) pom-pom to create the head and body of your bear. Then take two mini white pom-poms and glue them to the top of the head to make the ears. Be sure to keep a little space between the ears. You can find pom-poms, wiggly eyes and chenille stem at your local crafts store. Attach the face. Glue a mini black pom-pom to the lower front of the bear’s head. Slightly above the nose, attach two small wiggly eyes. The eyes should be about halfway between the ears and the nose. Add the limbs and a scarf. Glue four mini pom-poms to the front side of the bear’s body to make the legs. Attach a fifth mini pom-pom to the back for a tail. Make sure that the two bottom legs and the tail allow the bear to sit and keep it upright. Finally, wrap a three-inch (7.6 cm) piece of red or silver chenille stem around the bear’s neck to serve as a scarf. When you attach the scarf, do not get it so snug around the bear’s neck that it pops the head off.",
    "sentences": [
        " Crafting an Adult Pom-Pom Polar Bear Make the four legs.",
        "Take two white chenille stems and cut them in half.",
        "Then coil each half-stem around a half-inch (1.25 cm) diameter marker.",
        "You will wrap the stem around the marker about five times to create an individual leg.",
        "Repeat this process with the remaining stem halves and then glue them onto a two-inch (5 cm) white pom-pom so that they resemble the four legs and body of a polar bear.",
        "You can find the stems and the pom-poms at your local crafts store.",
        "Put together the head.",
        "Cut a chenille stem in half and twist it around the back of a one-inch (2.5 cm) white pom-pom.",
        "Coil the ends of the stem towards the pom-pom to create the bear’s ears.",
        "Glue the head to the body.",
        "Apply some glue to the back of the head where you attached the ears.",
        "This will give you plenty of space to make your bear’s face.",
        "Then attach it to the front side of the body.",
        "Add the face and tail.",
        "Glue a half-inch (1.25 cm) sparkly white pom-pom to the front lower section of the bear’s head.",
        "Take a mini black pom-pom and glue it to the front end of the sparkly pom-pom to create a nose.",
        "Then glue two mini black pom-poms above the nose to create the bear’s eyes.",
        "Finally, attach a half-inch (1.25 cm) white pom-pom to the back of the bear’s body to create a tail.",
        "Making a Baby Pom-Pom Polar Bear Glue together the body.",
        "With your hot glue gun, attach a half-inch (1.25 cm) white pom-pom to the bottom side of a one-inch (2.5 cm) white pom-pom.",
        "Add three more half-inch pom-poms to the same side to create the baby bear’s legs.",
        "Once attached, the legs should support the larger pom-pom and hold it off the ground.",
        "Attach the ears and head.",
        "With a pair of scissors, cut a three-inch (7.6 cm) piece of chenille stem.",
        "Bend the stem into a heart shape, with the ends curling in towards each other.",
        "Glue the heart-shaped stem between the front end of the body and a half-inch (1.25 cm) sparkly pom-pom to create the head.",
        "Make the face and tail.",
        "Glue a mini black pom-pom to the lower front section of the head to make a nose.",
        "Attach two mini-black pom-poms slightly above the nose to create the eyes.",
        "Cut a half-inch (1.25 cm) piece of white chenille and glue it to the back of the body to serve as a tail.",
        "Building a Sitting Pom-Pom Polar Bear with a Scarf Make the body.",
        "Glue a one-inch (2.5 cm) pom-pom to the top of a two-inch (5 cm) pom-pom to create the head and body of your bear.",
        "Then take two mini white pom-poms and glue them to the top of the head to make the ears.",
        "Be sure to keep a little space between the ears.",
        "You can find pom-poms, wiggly eyes and chenille stem at your local crafts store.",
        "Attach the face.",
        "Glue a mini black pom-pom to the lower front of the bear’s head.",
        "Slightly above the nose, attach two small wiggly eyes.",
        "The eyes should be about halfway between the ears and the nose.",
        "Add the limbs and a scarf.",
        "Glue four mini pom-poms to the front side of the bear’s body to make the legs.",
        "Attach a fifth mini pom-pom to the back for a tail.",
        "Make sure that the two bottom legs and the tail allow the bear to sit and keep it upright.",
        "Finally, wrap a three-inch (7.6 cm) piece of red or silver chenille stem around the bear’s neck to serve as a scarf.",
        "When you attach the scarf, do not get it so snug around the bear’s neck that it pops the head off."
    ]
}