{
    "title": "How to Make Italian Chocolate Pizzette Cookies",
    "url": "https://www.wikihow.com/Make-Italian-Chocolate-Pizzette-Cookies",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking",
        "Cookies and Biscuits",
        "Chocolate Cookies and Biscuits"
    ],
    "parts": [
        {
            "name": "Mixing the Dough",
            "steps": [
                {
                    "headline": "Preheat the oven.",
                    "description": "To ensure that the oven is hot enough to bake the cookies, you must preheat it. Set the temperature to 375 degrees Fahrenheit (190 degrees Celsius), and allow it to fully heat. Pay attention to your oven so you know when it’s reached the right temperature. In most cases, it will flash a light or beep to alert you."
                },
                {
                    "headline": "Combine the flour, chocolate chips, almonds, and baking powder.",
                    "description": "Add 1 ½ cups (360 g) of all-purpose flour, 4 ounces (115 g) of bittersweet chocolate chips, ¾ cup (82 g) of finely chopped roasted almonds, and 1 teaspoon (5 g) of baking powder to a medium bowl. Use a wooden spoon to fully mix the ingredients. You can substitute walnuts for the almonds if you prefer."
                },
                {
                    "headline": "Mix the coffee and cocoa powder.",
                    "description": "Add ¼ cup (60 ml) of hot, strong coffee and ¼ cup (25 g) of unsweetened cocoa powder to a large bowl. Use a whisk to combine them until the mixture is smooth. You can use instant coffee or some reserved from a pot that you’ve brewed. Just make sure that it’s hot."
                },
                {
                    "headline": "Stir in the spices and salt.",
                    "description": "When the coffee and cocoa powder mixture is smooth, add ¾ teaspoon (2 ½ g) of ground cinnamon, ¾ teaspoon (2 ½ g) of ground cloves, ¾ teaspoon (2 ½ g) of ground nutmeg, and ½ teaspoon (3 g) of kosher salt. Blend well until the mixture is smooth once more. You can also add 1 teaspoon (2 g) of ground allspice if you want your pizzettes to be even spicier."
                },
                {
                    "headline": "Whisk in the egg, egg yolk, sugar, oil, and fruit zest.",
                    "description": "Once the spices and salt are mixed in, add 1 large egg, 1 large egg yolk, ½ cup (100 g) of granulated sugar, ⅓ cup (78 ml) of vegetable oil, 1 teaspoon (2 g) of finely grated lemon zest, and 1 teaspoon (2 g) of finely grated orange zest. Use a whisk to mix the ingredients in so they’re fully incorporated. You can substitute canola oil for the vegetable if you prefer. To separate the egg yolk from the white, crack the egg against the side of a dish.Separate  the egg into two halves, and let the yolk settle in the lower half. Move the yolk back and forth between the two halves over the bowl, allowing the white to drip down into the bowl. Once you’ve removed all of it, dump the yolk into the bowl with your cookie dough."
                },
                {
                    "headline": "Add the dry ingredients to the wet ingredients.",
                    "description": "When all of the wet ingredients are mixed, slowly add the dry ingredients to the bowl. Mix with a wooden spoon until the dry ingredients are just combined. Be careful not to overmix the dough. You can wind up with tough cookies."
                }
            ]
        },
        {
            "name": "Shaping the Cookies",
            "steps": [
                {
                    "headline": "Break off a piece of the dough and roll into a rope.",
                    "description": "When the dough is fully mixed, turn it out onto a floured work surface. Tear off a small piece of the dough, and roll it out with your hands into a rope that’s approximately 1 ½-inches (4-cm) thick. If you find that the dough is sticking to your hands, rub a small amount of canola or vegetable oil over them before rolling out the dough."
                },
                {
                    "headline": "Flatten the rope slightly.",
                    "description": "When you’re shaped the dough into a rope, use your hands to gently press down on it. You want to flatten the rope so it’s approximately 2-inches wide (5-cm)."
                },
                {
                    "headline": "Slice the rope into cookies.",
                    "description": "After you’ve flattened the rope, use a knife to cut it into pieces that are approximately 1-inch (2.5-cm) wide. Slice the cookies on an angle to give them a more decorative look. You can also use a pizza cutter to slice the cookies if you prefer."
                },
                {
                    "headline": "Repeat the process with all of the dough.",
                    "description": "When you’ve finished slicing the first rope into cookies, break off another piece of dough and repeat the entire process. Keep repeating until you’ve used up all of the dough."
                }
            ]
        },
        {
            "name": "Baking the Cookies",
            "steps": [
                {
                    "headline": "Transfer the cookies to a lined baking sheet.",
                    "description": "Once you’ve rolled and sliced all of the dough, line a baking sheet with a piece of parchment paper. Place the cookies on the sheet so they’re approximately 1-inch (2.5-cm) apart to prevent them from spreading into one another as they bake. You can substitute a silicone baking mat for the parchment paper if you prefer."
                },
                {
                    "headline": "Bake the cookies until they are firm around the edges.",
                    "description": "Place the cookies in the preheated oven. Allow them to bake for 8 to 10 minutes or until the edges are firm but the center is still soft. The cookies should have a moist, fudgy center similar to a brownie when they’re finished baking."
                },
                {
                    "headline": "Allow the cookies to cool.",
                    "description": "After you take the cookies out of the oven, transfer them to a wire cooling rack. Let the cookies cool for 15 to 20 minutes."
                }
            ]
        },
        {
            "name": "Frosting the Cookies",
            "steps": [
                {
                    "headline": "Melt the chocolate and butter in a double boiler.",
                    "description": "Add 4 ounces (115 g) of bittersweet chocolate chips and 1 tablespoon (14 g) of unsalted butter to a heatproof bowl. Place the bowl over a large saucepan with barely simmering water on medium to medium-low heat on the stove. Stir the mixture constantly until the chocolate is completely smooth. Make sure that the bowl doesn’t actually come into contact with the water. You can also melt the chocolate and butter in a microwave. Place them in a wide, shallow microwave-safe bowl, and heat it on medium-high for 60 seconds. Stir the contents well, and then continue heating them in 15 to 20 second intervals until the chocolate is smooth."
                },
                {
                    "headline": "Add the powdered sugar and boiling water.",
                    "description": "Use a whisk to blend 1 ¼ cups (167 g) of powdered sugar and 5 tablespoons (75 ml) of boiling water into the melted chocolate and butter. Continue mixing until the frosting is smooth. Powdered sugar is also known as confectioners’ sugar, icing sugar, or 10x sugar."
                },
                {
                    "headline": "Dip the tops of the cookies in the frosting and garnish.",
                    "description": "Once the frosting is completely mixed, take the cooled cookies and dip the tops of them into the frosting to coat them. Sprinkle the soft frosting with sprinkles or colored sugar if desired. Make sure that the cookies are cool before dipping them in the frosting. The frosting will melt off if they’re too hot. If you prefer, you can use a spoon to spread the frosting over the tops of the cookies."
                },
                {
                    "headline": "Allow the frosting to set completely before serving.",
                    "description": "When the cookies are covered with frosting, place them back on the wire cooling rack. Let them sit for approximately 2 hours or until the frosting has set completely. Store the cookies in an airtight container, and they should stay fresh for 3 to 5 days."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Medium bowl",
        "Whisk",
        "Large bowl",
        "Wooden spoon",
        "Knife",
        "Baking sheet",
        "Parchment paper",
        "Wire cooling rack",
        "Heatproof bowl",
        "Large saucepan"
    ],
    "text": " Mixing the Dough Preheat the oven. To ensure that the oven is hot enough to bake the cookies, you must preheat it. Set the temperature to 375 degrees Fahrenheit (190 degrees Celsius), and allow it to fully heat. Pay attention to your oven so you know when it’s reached the right temperature. In most cases, it will flash a light or beep to alert you. Combine the flour, chocolate chips, almonds, and baking powder. Add 1 ½ cups (360 g) of all-purpose flour, 4 ounces (115 g) of bittersweet chocolate chips, ¾ cup (82 g) of finely chopped roasted almonds, and 1 teaspoon (5 g) of baking powder to a medium bowl. Use a wooden spoon to fully mix the ingredients. You can substitute walnuts for the almonds if you prefer. Mix the coffee and cocoa powder. Add ¼ cup (60 ml) of hot, strong coffee and ¼ cup (25 g) of unsweetened cocoa powder to a large bowl. Use a whisk to combine them until the mixture is smooth. You can use instant coffee or some reserved from a pot that you’ve brewed. Just make sure that it’s hot. Stir in the spices and salt. When the coffee and cocoa powder mixture is smooth, add ¾ teaspoon (2 ½ g) of ground cinnamon, ¾ teaspoon (2 ½ g) of ground cloves, ¾ teaspoon (2 ½ g) of ground nutmeg, and ½ teaspoon (3 g) of kosher salt. Blend well until the mixture is smooth once more. You can also add 1 teaspoon (2 g) of ground allspice if you want your pizzettes to be even spicier. Whisk in the egg, egg yolk, sugar, oil, and fruit zest. Once the spices and salt are mixed in, add 1 large egg, 1 large egg yolk, ½ cup (100 g) of granulated sugar, ⅓ cup (78 ml) of vegetable oil, 1 teaspoon (2 g) of finely grated lemon zest, and 1 teaspoon (2 g) of finely grated orange zest. Use a whisk to mix the ingredients in so they’re fully incorporated. You can substitute canola oil for the vegetable if you prefer. To separate the egg yolk from the white, crack the egg against the side of a dish.Separate  the egg into two halves, and let the yolk settle in the lower half. Move the yolk back and forth between the two halves over the bowl, allowing the white to drip down into the bowl. Once you’ve removed all of it, dump the yolk into the bowl with your cookie dough. Add the dry ingredients to the wet ingredients. When all of the wet ingredients are mixed, slowly add the dry ingredients to the bowl. Mix with a wooden spoon until the dry ingredients are just combined. Be careful not to overmix the dough. You can wind up with tough cookies. Shaping the Cookies Break off a piece of the dough and roll into a rope. When the dough is fully mixed, turn it out onto a floured work surface. Tear off a small piece of the dough, and roll it out with your hands into a rope that’s approximately 1 ½-inches (4-cm) thick. If you find that the dough is sticking to your hands, rub a small amount of canola or vegetable oil over them before rolling out the dough. Flatten the rope slightly. When you’re shaped the dough into a rope, use your hands to gently press down on it. You want to flatten the rope so it’s approximately 2-inches wide (5-cm). Slice the rope into cookies. After you’ve flattened the rope, use a knife to cut it into pieces that are approximately 1-inch (2.5-cm) wide. Slice the cookies on an angle to give them a more decorative look. You can also use a pizza cutter to slice the cookies if you prefer. Repeat the process with all of the dough. When you’ve finished slicing the first rope into cookies, break off another piece of dough and repeat the entire process. Keep repeating until you’ve used up all of the dough. Baking the Cookies Transfer the cookies to a lined baking sheet. Once you’ve rolled and sliced all of the dough, line a baking sheet with a piece of parchment paper. Place the cookies on the sheet so they’re approximately 1-inch (2.5-cm) apart to prevent them from spreading into one another as they bake. You can substitute a silicone baking mat for the parchment paper if you prefer. Bake the cookies until they are firm around the edges. Place the cookies in the preheated oven. Allow them to bake for 8 to 10 minutes or until the edges are firm but the center is still soft. The cookies should have a moist, fudgy center similar to a brownie when they’re finished baking. Allow the cookies to cool. After you take the cookies out of the oven, transfer them to a wire cooling rack. Let the cookies cool for 15 to 20 minutes. Frosting the Cookies Melt the chocolate and butter in a double boiler. Add 4 ounces (115 g) of bittersweet chocolate chips and 1 tablespoon (14 g) of unsalted butter to a heatproof bowl. Place the bowl over a large saucepan with barely simmering water on medium to medium-low heat on the stove. Stir the mixture constantly until the chocolate is completely smooth. Make sure that the bowl doesn’t actually come into contact with the water. You can also melt the chocolate and butter in a microwave. Place them in a wide, shallow microwave-safe bowl, and heat it on medium-high for 60 seconds. Stir the contents well, and then continue heating them in 15 to 20 second intervals until the chocolate is smooth. Add the powdered sugar and boiling water. Use a whisk to blend 1 ¼ cups (167 g) of powdered sugar and 5 tablespoons (75 ml) of boiling water into the melted chocolate and butter. Continue mixing until the frosting is smooth. Powdered sugar is also known as confectioners’ sugar, icing sugar, or 10x sugar. Dip the tops of the cookies in the frosting and garnish. Once the frosting is completely mixed, take the cooled cookies and dip the tops of them into the frosting to coat them. Sprinkle the soft frosting with sprinkles or colored sugar if desired. Make sure that the cookies are cool before dipping them in the frosting. The frosting will melt off if they’re too hot. If you prefer, you can use a spoon to spread the frosting over the tops of the cookies. Allow the frosting to set completely before serving. When the cookies are covered with frosting, place them back on the wire cooling rack. Let them sit for approximately 2 hours or until the frosting has set completely. Store the cookies in an airtight container, and they should stay fresh for 3 to 5 days. Finished. ",
    "sentences": [
        " Mixing the Dough Preheat the oven.",
        "To ensure that the oven is hot enough to bake the cookies, you must preheat it.",
        "Set the temperature to 375 degrees Fahrenheit (190 degrees Celsius), and allow it to fully heat.",
        "Pay attention to your oven so you know when it’s reached the right temperature.",
        "In most cases, it will flash a light or beep to alert you.",
        "Combine the flour, chocolate chips, almonds, and baking powder.",
        "Add 1 ½ cups (360 g) of all-purpose flour, 4 ounces (115 g) of bittersweet chocolate chips, ¾ cup (82 g) of finely chopped roasted almonds, and 1 teaspoon (5 g) of baking powder to a medium bowl.",
        "Use a wooden spoon to fully mix the ingredients.",
        "You can substitute walnuts for the almonds if you prefer.",
        "Mix the coffee and cocoa powder.",
        "Add ¼ cup (60 ml) of hot, strong coffee and ¼ cup (25 g) of unsweetened cocoa powder to a large bowl.",
        "Use a whisk to combine them until the mixture is smooth.",
        "You can use instant coffee or some reserved from a pot that you’ve brewed.",
        "Just make sure that it’s hot.",
        "Stir in the spices and salt.",
        "When the coffee and cocoa powder mixture is smooth, add ¾ teaspoon (2 ½ g) of ground cinnamon, ¾ teaspoon (2 ½ g) of ground cloves, ¾ teaspoon (2 ½ g) of ground nutmeg, and ½ teaspoon (3 g) of kosher salt.",
        "Blend well until the mixture is smooth once more.",
        "You can also add 1 teaspoon (2 g) of ground allspice if you want your pizzettes to be even spicier.",
        "Whisk in the egg, egg yolk, sugar, oil, and fruit zest.",
        "Once the spices and salt are mixed in, add 1 large egg, 1 large egg yolk, ½ cup (100 g) of granulated sugar, ⅓ cup (78 ml) of vegetable oil, 1 teaspoon (2 g) of finely grated lemon zest, and 1 teaspoon (2 g) of finely grated orange zest.",
        "Use a whisk to mix the ingredients in so they’re fully incorporated.",
        "You can substitute canola oil for the vegetable if you prefer.",
        "To separate the egg yolk from the white, crack the egg against the side of a dish.Separate  the egg into two halves, and let the yolk settle in the lower half.",
        "Move the yolk back and forth between the two halves over the bowl, allowing the white to drip down into the bowl.",
        "Once you’ve removed all of it, dump the yolk into the bowl with your cookie dough.",
        "Add the dry ingredients to the wet ingredients.",
        "When all of the wet ingredients are mixed, slowly add the dry ingredients to the bowl.",
        "Mix with a wooden spoon until the dry ingredients are just combined.",
        "Be careful not to overmix the dough.",
        "You can wind up with tough cookies.",
        "Shaping the Cookies Break off a piece of the dough and roll into a rope.",
        "When the dough is fully mixed, turn it out onto a floured work surface.",
        "Tear off a small piece of the dough, and roll it out with your hands into a rope that’s approximately 1 ½-inches (4-cm) thick.",
        "If you find that the dough is sticking to your hands, rub a small amount of canola or vegetable oil over them before rolling out the dough.",
        "Flatten the rope slightly.",
        "When you’re shaped the dough into a rope, use your hands to gently press down on it.",
        "You want to flatten the rope so it’s approximately 2-inches wide (5-cm).",
        "Slice the rope into cookies.",
        "After you’ve flattened the rope, use a knife to cut it into pieces that are approximately 1-inch (2.5-cm) wide.",
        "Slice the cookies on an angle to give them a more decorative look.",
        "You can also use a pizza cutter to slice the cookies if you prefer.",
        "Repeat the process with all of the dough.",
        "When you’ve finished slicing the first rope into cookies, break off another piece of dough and repeat the entire process.",
        "Keep repeating until you’ve used up all of the dough.",
        "Baking the Cookies Transfer the cookies to a lined baking sheet.",
        "Once you’ve rolled and sliced all of the dough, line a baking sheet with a piece of parchment paper.",
        "Place the cookies on the sheet so they’re approximately 1-inch (2.5-cm) apart to prevent them from spreading into one another as they bake.",
        "You can substitute a silicone baking mat for the parchment paper if you prefer.",
        "Bake the cookies until they are firm around the edges.",
        "Place the cookies in the preheated oven.",
        "Allow them to bake for 8 to 10 minutes or until the edges are firm but the center is still soft.",
        "The cookies should have a moist, fudgy center similar to a brownie when they’re finished baking.",
        "Allow the cookies to cool.",
        "After you take the cookies out of the oven, transfer them to a wire cooling rack.",
        "Let the cookies cool for 15 to 20 minutes.",
        "Frosting the Cookies Melt the chocolate and butter in a double boiler.",
        "Add 4 ounces (115 g) of bittersweet chocolate chips and 1 tablespoon (14 g) of unsalted butter to a heatproof bowl.",
        "Place the bowl over a large saucepan with barely simmering water on medium to medium-low heat on the stove.",
        "Stir the mixture constantly until the chocolate is completely smooth.",
        "Make sure that the bowl doesn’t actually come into contact with the water.",
        "You can also melt the chocolate and butter in a microwave.",
        "Place them in a wide, shallow microwave-safe bowl, and heat it on medium-high for 60 seconds.",
        "Stir the contents well, and then continue heating them in 15 to 20 second intervals until the chocolate is smooth.",
        "Add the powdered sugar and boiling water.",
        "Use a whisk to blend 1 ¼ cups (167 g) of powdered sugar and 5 tablespoons (75 ml) of boiling water into the melted chocolate and butter.",
        "Continue mixing until the frosting is smooth.",
        "Powdered sugar is also known as confectioners’ sugar, icing sugar, or 10x sugar.",
        "Dip the tops of the cookies in the frosting and garnish.",
        "Once the frosting is completely mixed, take the cooled cookies and dip the tops of them into the frosting to coat them.",
        "Sprinkle the soft frosting with sprinkles or colored sugar if desired.",
        "Make sure that the cookies are cool before dipping them in the frosting.",
        "The frosting will melt off if they’re too hot.",
        "If you prefer, you can use a spoon to spread the frosting over the tops of the cookies.",
        "Allow the frosting to set completely before serving.",
        "When the cookies are covered with frosting, place them back on the wire cooling rack.",
        "Let them sit for approximately 2 hours or until the frosting has set completely.",
        "Store the cookies in an airtight container, and they should stay fresh for 3 to 5 days.",
        "Finished."
    ]
}