{
    "title": "How to Do Candy Cane Makeup",
    "url": "https://www.wikihow.com/Do-Candy-Cane-Makeup",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Makeup",
        "Eye Makeup",
        "Eye Makeup Styles"
    ],
    "methods": [
        {
            "name": "Doing Candy Cane Eyeliner",
            "steps": [
                {
                    "headline": "Prime your eye.",
                    "description": "Before you begin, it’s important to put a primer over your entire lid. A makeup primer will help smooth out and conceal any imperfections in your eyelid, and it will also create a smooth base for your makeup to stick to. It will prevent smudging and creasing in any look you create. Apply a dot of primer on your finger, and then gently dab it over your eyelid. After applying the primer, make sure to let it sit for a minute and really sink into the lid."
                },
                {
                    "headline": "Apply a shadow.",
                    "description": "You certainly don’t need to wear eyeshadow with this look, but you can. If you want to wear eyeshadow, choose a neutral color so that your candy cane liner is the star of the show. A taupe color or even a soft gold shimmer can look gorgeous with this liner. Blend it over your entire lid before moving on to the liner."
                },
                {
                    "headline": "Use white liquid liner on your top lash line.",
                    "description": "Liquid liner is the best type of liner to use for this look, because it will create the sharp, ultra-pigmented strip above your lashes that you need. Begin in the inside corner, moving carefully to the outer corner. Go over this line a few times until it is opaque, and make sure it is thick enough so that you have room to add red stripes. Then, create a wing. Adding a wing to your eyeliner will help highlight the candy cane effect that you’ll be creating. You can find white liquid eyeliner at your local beauty supply store."
                },
                {
                    "headline": "Add red stripes.",
                    "description": "The best way to do this is either with a red gel liner and a small eyeliner brush, or with a red liquid liner. You can find both of these at your local beauty supply store. With your small eyeliner brush, start creating little stripes along the white band you created. Add the stripes at a slight angle and space them ⁄4 inch (0.64 cm) apart. Add stripes along the entire lash lines as well as the wing. You can alternate between thin stripes and thick stripes for a fun variation."
                }
            ]
        },
        {
            "name": "Applying Candy Cane Eyeshadow",
            "steps": [
                {
                    "headline": "Prime your eyes.",
                    "description": "While this is an important first step for any eyeshadow look, it’s especially important for your candy cane look. If your careful stripes end up smudging or creasing, you will have an unrecognizable candy cane! Apply a primer to your entire lid using your fingertip. This will create a perfect base for your shadows to adhere to, and it will help prevent your shadows from slipping and sliding."
                },
                {
                    "headline": "Create a striped base with red and white eyeliners.",
                    "description": "You can purchase pencil eyeliners in red and white at a beauty supply store, and they will be perfect for creating your shadow base. Starting at the outer corner of your eye, create a red stripe extending diagonally from corner to crease. Then, go in with the white pencil and add a second stripe directly on top of the first. Again, it should go diagonally from your lash line to your eyelid crease. Continue doing this until you’ve created stripes along your entire eyelid. For a general idea of how thick your stripes should be, try to fit about three red stripes and three white stripes. Keep the stripes parallel to each other as you move across your eyelid. This base will be covered in eyeshadow, so don’t worry if it looks slightly patchy or imperfect. It won’t be left as-is!"
                },
                {
                    "headline": "Add red and white shadow over the eyeliner.",
                    "description": "Use a small shadow brush to carefully pat red eyeshadow over the red eyeliner, and white eyeshadow over the white eyeliner. The eyeliner serves three purposes: it serves as a rough draft for the shadows, it helps the shadows adhere to the lid, and it ensures the shadows will be pigmented and opaque enough. Use a patting motion to apply the shadow, focusing on pressing the powder into the lid rather than creating strokes. You can purchase red and white eyeshadow at any beauty supply store."
                },
                {
                    "headline": "Use a deep red shadow above your stripes.",
                    "description": "This will add a bit of dimension to your eyelid and smooth out the top of the stripes. With your darker shadow, you'll be outlining the shape of the stripes you just created, making the lid look more polished and cohesive. Use a fluffy brush to blend this shadow along the top of the candy cane stripes, following your crease."
                },
                {
                    "headline": "Apply a black eyeshadow to the crease and blend.",
                    "description": "After you’ve applied the red color, use a smaller shadow brush to apply black shadow solely to your crease. This will give your entire eye more intense definition. Blend the deep red and black shadows together with a fluffy brush, creating a blended, dark border to the candy cane stripes on the lid."
                },
                {
                    "headline": "Apply glitter.",
                    "description": "This step is optional. If your shadow contains glitter or if you’re content with your candy cane being matte, you certainly don’t need to do this. However if you want to add a bit of glitz to your look, you can pat on a bit of glitter. You can purchase loose cosmetic glitters in white and red at a beauty supply store, mix a bit with water or a setting spray, and then pat those onto your stripes with a shadow brush. If you don’t want to purchase red or white glitter, you can use a more versatile gold or silver sparkle over the entire lid."
                },
                {
                    "headline": "Finish with mascara.",
                    "description": "After your shadow is finished, you will complete the look with big, bold lashes. First, curl your lashes with an eyelash curler. Press and hold the curler at the base of your lashes for about five seconds, and release. Then, apply your favorite mascara. Start at the base of your lashes, and wiggle the wand as you move it from base to tip. For extra volume, apply two or three coats of the mascara. If you want more drama than your natural lashes can provide, you can also apply fake lashes to finish this look."
                }
            ]
        },
        {
            "name": "Creating Candy Cane Lips",
            "steps": [
                {
                    "headline": "Cover your lips with concealer.",
                    "description": "To create perfect candy cane lips, you want the white to be very pigmented and opaque. In order to achieve this, you want to conceal the natural redness of your lips that could show through the white lipstick. Use a makeup sponge to dab concealer over your lips, making sure to cover the entire surface."
                },
                {
                    "headline": "Press a translucent powder over your lips.",
                    "description": "After applying you concealer, it’s important to set it with a powder. Otherwise, you’ll be applying lip product over a creamy base, and you’ll end up with a smudged mess. Use your makeup sponge to press the powder into your lips, covering all of the concealer. Brush off any excess powder with a fluffy brush."
                },
                {
                    "headline": "Fill in your lips with white lip liner.",
                    "description": "You can purchase a white lip liner at any beauty supply store. First, outline your lips entirely. This is a helpful first step, because it will define the border that has been concealed. Instead of just lining your lips, however, you’re going to use the lip liner to fill in the entirety of your lips."
                },
                {
                    "headline": "Apply white lipstick.",
                    "description": "The white lip liner creates a really nice base for a white lipstick to adhere to. Carefully apply your white lipstick over the white eyeliner, making sure that every bit of your lips is opaque. If the white lipstick you use is creamy, dab it with translucent powder when you’re finished. If the lipstick is matte, you don’t need to do this."
                },
                {
                    "headline": "Create the stripes with red liquid lipstick.",
                    "description": "After your lips are completely white, it’s time to turn them into a candy cane! For this step, you’ll need red liquid lipstick and a small lip brush. Dip your lip brush into the liquid lipstick, and start creating diagonal stripes down your lips. Let your mouth rest naturally, so you can create lines that continue from the top lip straight down to the bottom lip. Alternate between thick stripes of red and thin stripes of red, to mimic the pattern of real candy canes. Continue creating these stripes diagonally across your lips until they are covered."
                }
            ]
        }
    ],
    "tyn": [
        "Candy Cane Eyeliner",
        "Primer",
        "Neutral eyeshadow (optional)",
        "White liquid eyeliner",
        "Red gel eyeliner & brush OR red liquid eyeliner",
        "Candy Cane Eyeshadow",
        "Red and white pencil eyeliners",
        "Red and white eyeshadow",
        "Deep red eyeshadow",
        "Black eyeshadow",
        "Glitter (optional)",
        "Mascara",
        "Candy Cane Lips",
        "Concealer",
        "Translucent powder",
        "White lip liner",
        "White lipstick",
        "Red liquid lipstick"
    ],
    "text": " Doing Candy Cane Eyeliner Prime your eye. Before you begin, it’s important to put a primer over your entire lid. A makeup primer will help smooth out and conceal any imperfections in your eyelid, and it will also create a smooth base for your makeup to stick to. It will prevent smudging and creasing in any look you create. Apply a dot of primer on your finger, and then gently dab it over your eyelid. After applying the primer, make sure to let it sit for a minute and really sink into the lid. Apply a shadow. You certainly don’t need to wear eyeshadow with this look, but you can. If you want to wear eyeshadow, choose a neutral color so that your candy cane liner is the star of the show. A taupe color or even a soft gold shimmer can look gorgeous with this liner. Blend it over your entire lid before moving on to the liner. Use white liquid liner on your top lash line. Liquid liner is the best type of liner to use for this look, because it will create the sharp, ultra-pigmented strip above your lashes that you need. Begin in the inside corner, moving carefully to the outer corner. Go over this line a few times until it is opaque, and make sure it is thick enough so that you have room to add red stripes. Then, create a wing. Adding a wing to your eyeliner will help highlight the candy cane effect that you’ll be creating. You can find white liquid eyeliner at your local beauty supply store. Add red stripes. The best way to do this is either with a red gel liner and a small eyeliner brush, or with a red liquid liner. You can find both of these at your local beauty supply store. With your small eyeliner brush, start creating little stripes along the white band you created. Add the stripes at a slight angle and space them ⁄4 inch (0.64 cm) apart. Add stripes along the entire lash lines as well as the wing. You can alternate between thin stripes and thick stripes for a fun variation. Applying Candy Cane Eyeshadow Prime your eyes. While this is an important first step for any eyeshadow look, it’s especially important for your candy cane look. If your careful stripes end up smudging or creasing, you will have an unrecognizable candy cane! Apply a primer to your entire lid using your fingertip. This will create a perfect base for your shadows to adhere to, and it will help prevent your shadows from slipping and sliding. Create a striped base with red and white eyeliners. You can purchase pencil eyeliners in red and white at a beauty supply store, and they will be perfect for creating your shadow base. Starting at the outer corner of your eye, create a red stripe extending diagonally from corner to crease. Then, go in with the white pencil and add a second stripe directly on top of the first. Again, it should go diagonally from your lash line to your eyelid crease. Continue doing this until you’ve created stripes along your entire eyelid. For a general idea of how thick your stripes should be, try to fit about three red stripes and three white stripes. Keep the stripes parallel to each other as you move across your eyelid. This base will be covered in eyeshadow, so don’t worry if it looks slightly patchy or imperfect. It won’t be left as-is! Add red and white shadow over the eyeliner. Use a small shadow brush to carefully pat red eyeshadow over the red eyeliner, and white eyeshadow over the white eyeliner. The eyeliner serves three purposes: it serves as a rough draft for the shadows, it helps the shadows adhere to the lid, and it ensures the shadows will be pigmented and opaque enough. Use a patting motion to apply the shadow, focusing on pressing the powder into the lid rather than creating strokes. You can purchase red and white eyeshadow at any beauty supply store. Use a deep red shadow above your stripes. This will add a bit of dimension to your eyelid and smooth out the top of the stripes. With your darker shadow, you'll be outlining the shape of the stripes you just created, making the lid look more polished and cohesive. Use a fluffy brush to blend this shadow along the top of the candy cane stripes, following your crease. Apply a black eyeshadow to the crease and blend. After you’ve applied the red color, use a smaller shadow brush to apply black shadow solely to your crease. This will give your entire eye more intense definition. Blend the deep red and black shadows together with a fluffy brush, creating a blended, dark border to the candy cane stripes on the lid. Apply glitter. This step is optional. If your shadow contains glitter or if you’re content with your candy cane being matte, you certainly don’t need to do this. However if you want to add a bit of glitz to your look, you can pat on a bit of glitter. You can purchase loose cosmetic glitters in white and red at a beauty supply store, mix a bit with water or a setting spray, and then pat those onto your stripes with a shadow brush. If you don’t want to purchase red or white glitter, you can use a more versatile gold or silver sparkle over the entire lid. Finish with mascara. After your shadow is finished, you will complete the look with big, bold lashes. First, curl your lashes with an eyelash curler. Press and hold the curler at the base of your lashes for about five seconds, and release. Then, apply your favorite mascara. Start at the base of your lashes, and wiggle the wand as you move it from base to tip. For extra volume, apply two or three coats of the mascara. If you want more drama than your natural lashes can provide, you can also apply fake lashes to finish this look. Creating Candy Cane Lips Cover your lips with concealer. To create perfect candy cane lips, you want the white to be very pigmented and opaque. In order to achieve this, you want to conceal the natural redness of your lips that could show through the white lipstick. Use a makeup sponge to dab concealer over your lips, making sure to cover the entire surface. Press a translucent powder over your lips. After applying you concealer, it’s important to set it with a powder. Otherwise, you’ll be applying lip product over a creamy base, and you’ll end up with a smudged mess. Use your makeup sponge to press the powder into your lips, covering all of the concealer. Brush off any excess powder with a fluffy brush. Fill in your lips with white lip liner. You can purchase a white lip liner at any beauty supply store. First, outline your lips entirely. This is a helpful first step, because it will define the border that has been concealed. Instead of just lining your lips, however, you’re going to use the lip liner to fill in the entirety of your lips. Apply white lipstick. The white lip liner creates a really nice base for a white lipstick to adhere to. Carefully apply your white lipstick over the white eyeliner, making sure that every bit of your lips is opaque. If the white lipstick you use is creamy, dab it with translucent powder when you’re finished. If the lipstick is matte, you don’t need to do this. Create the stripes with red liquid lipstick. After your lips are completely white, it’s time to turn them into a candy cane! For this step, you’ll need red liquid lipstick and a small lip brush. Dip your lip brush into the liquid lipstick, and start creating diagonal stripes down your lips. Let your mouth rest naturally, so you can create lines that continue from the top lip straight down to the bottom lip. Alternate between thick stripes of red and thin stripes of red, to mimic the pattern of real candy canes. Continue creating these stripes diagonally across your lips until they are covered.",
    "sentences": [
        " Doing Candy Cane Eyeliner Prime your eye.",
        "Before you begin, it’s important to put a primer over your entire lid.",
        "A makeup primer will help smooth out and conceal any imperfections in your eyelid, and it will also create a smooth base for your makeup to stick to.",
        "It will prevent smudging and creasing in any look you create.",
        "Apply a dot of primer on your finger, and then gently dab it over your eyelid.",
        "After applying the primer, make sure to let it sit for a minute and really sink into the lid.",
        "Apply a shadow.",
        "You certainly don’t need to wear eyeshadow with this look, but you can.",
        "If you want to wear eyeshadow, choose a neutral color so that your candy cane liner is the star of the show.",
        "A taupe color or even a soft gold shimmer can look gorgeous with this liner.",
        "Blend it over your entire lid before moving on to the liner.",
        "Use white liquid liner on your top lash line.",
        "Liquid liner is the best type of liner to use for this look, because it will create the sharp, ultra-pigmented strip above your lashes that you need.",
        "Begin in the inside corner, moving carefully to the outer corner.",
        "Go over this line a few times until it is opaque, and make sure it is thick enough so that you have room to add red stripes.",
        "Then, create a wing.",
        "Adding a wing to your eyeliner will help highlight the candy cane effect that you’ll be creating.",
        "You can find white liquid eyeliner at your local beauty supply store.",
        "Add red stripes.",
        "The best way to do this is either with a red gel liner and a small eyeliner brush, or with a red liquid liner.",
        "You can find both of these at your local beauty supply store.",
        "With your small eyeliner brush, start creating little stripes along the white band you created.",
        "Add the stripes at a slight angle and space them ⁄4 inch (0.64 cm) apart.",
        "Add stripes along the entire lash lines as well as the wing.",
        "You can alternate between thin stripes and thick stripes for a fun variation.",
        "Applying Candy Cane Eyeshadow Prime your eyes.",
        "While this is an important first step for any eyeshadow look, it’s especially important for your candy cane look.",
        "If your careful stripes end up smudging or creasing, you will have an unrecognizable candy cane!",
        "Apply a primer to your entire lid using your fingertip.",
        "This will create a perfect base for your shadows to adhere to, and it will help prevent your shadows from slipping and sliding.",
        "Create a striped base with red and white eyeliners.",
        "You can purchase pencil eyeliners in red and white at a beauty supply store, and they will be perfect for creating your shadow base.",
        "Starting at the outer corner of your eye, create a red stripe extending diagonally from corner to crease.",
        "Then, go in with the white pencil and add a second stripe directly on top of the first.",
        "Again, it should go diagonally from your lash line to your eyelid crease.",
        "Continue doing this until you’ve created stripes along your entire eyelid.",
        "For a general idea of how thick your stripes should be, try to fit about three red stripes and three white stripes.",
        "Keep the stripes parallel to each other as you move across your eyelid.",
        "This base will be covered in eyeshadow, so don’t worry if it looks slightly patchy or imperfect.",
        "It won’t be left as-is!",
        "Add red and white shadow over the eyeliner.",
        "Use a small shadow brush to carefully pat red eyeshadow over the red eyeliner, and white eyeshadow over the white eyeliner.",
        "The eyeliner serves three purposes: it serves as a rough draft for the shadows, it helps the shadows adhere to the lid, and it ensures the shadows will be pigmented and opaque enough.",
        "Use a patting motion to apply the shadow, focusing on pressing the powder into the lid rather than creating strokes.",
        "You can purchase red and white eyeshadow at any beauty supply store.",
        "Use a deep red shadow above your stripes.",
        "This will add a bit of dimension to your eyelid and smooth out the top of the stripes.",
        "With your darker shadow, you'll be outlining the shape of the stripes you just created, making the lid look more polished and cohesive.",
        "Use a fluffy brush to blend this shadow along the top of the candy cane stripes, following your crease.",
        "Apply a black eyeshadow to the crease and blend.",
        "After you’ve applied the red color, use a smaller shadow brush to apply black shadow solely to your crease.",
        "This will give your entire eye more intense definition.",
        "Blend the deep red and black shadows together with a fluffy brush, creating a blended, dark border to the candy cane stripes on the lid.",
        "Apply glitter.",
        "This step is optional.",
        "If your shadow contains glitter or if you’re content with your candy cane being matte, you certainly don’t need to do this.",
        "However if you want to add a bit of glitz to your look, you can pat on a bit of glitter.",
        "You can purchase loose cosmetic glitters in white and red at a beauty supply store, mix a bit with water or a setting spray, and then pat those onto your stripes with a shadow brush.",
        "If you don’t want to purchase red or white glitter, you can use a more versatile gold or silver sparkle over the entire lid.",
        "Finish with mascara.",
        "After your shadow is finished, you will complete the look with big, bold lashes.",
        "First, curl your lashes with an eyelash curler.",
        "Press and hold the curler at the base of your lashes for about five seconds, and release.",
        "Then, apply your favorite mascara.",
        "Start at the base of your lashes, and wiggle the wand as you move it from base to tip.",
        "For extra volume, apply two or three coats of the mascara.",
        "If you want more drama than your natural lashes can provide, you can also apply fake lashes to finish this look.",
        "Creating Candy Cane Lips Cover your lips with concealer.",
        "To create perfect candy cane lips, you want the white to be very pigmented and opaque.",
        "In order to achieve this, you want to conceal the natural redness of your lips that could show through the white lipstick.",
        "Use a makeup sponge to dab concealer over your lips, making sure to cover the entire surface.",
        "Press a translucent powder over your lips.",
        "After applying you concealer, it’s important to set it with a powder.",
        "Otherwise, you’ll be applying lip product over a creamy base, and you’ll end up with a smudged mess.",
        "Use your makeup sponge to press the powder into your lips, covering all of the concealer.",
        "Brush off any excess powder with a fluffy brush.",
        "Fill in your lips with white lip liner.",
        "You can purchase a white lip liner at any beauty supply store.",
        "First, outline your lips entirely.",
        "This is a helpful first step, because it will define the border that has been concealed.",
        "Instead of just lining your lips, however, you’re going to use the lip liner to fill in the entirety of your lips.",
        "Apply white lipstick.",
        "The white lip liner creates a really nice base for a white lipstick to adhere to.",
        "Carefully apply your white lipstick over the white eyeliner, making sure that every bit of your lips is opaque.",
        "If the white lipstick you use is creamy, dab it with translucent powder when you’re finished.",
        "If the lipstick is matte, you don’t need to do this.",
        "Create the stripes with red liquid lipstick.",
        "After your lips are completely white, it’s time to turn them into a candy cane!",
        "For this step, you’ll need red liquid lipstick and a small lip brush.",
        "Dip your lip brush into the liquid lipstick, and start creating diagonal stripes down your lips.",
        "Let your mouth rest naturally, so you can create lines that continue from the top lip straight down to the bottom lip.",
        "Alternate between thick stripes of red and thin stripes of red, to mimic the pattern of real candy canes.",
        "Continue creating these stripes diagonally across your lips until they are covered."
    ]
}