{
    "title": "How to Make an Egg Facial Mask",
    "url": "https://www.wikihow.com/Make-an-Egg-Facial-Mask",
    "category_hierarchy": [
        "Personal Care and Style",
        "Skin Care",
        "Face Care",
        "Facial Preparations",
        "Face Masks",
        "Egg Face Masks"
    ],
    "methods": [
        {
            "name": "Making a Simple Mask",
            "steps": [
                {
                    "headline": "Separate the egg.",
                    "description": "Crack an egg over a bowl, and transfer the yolk from shell to shell. Each time you transfer the yolk, a little bit of the egg white should flow into the bowl. Keep doing this until all of the egg white is in the bowl. The egg white not only help nourish and firm your skin, but it will also help tighten the pores Discard the egg yolk or save it for another recipe. You can use the egg yolk to make a nourishing face mask. Refer to the section in this article on making a nourishing face mask to learn how."
                },
                {
                    "headline": "Add lemon juice to the egg white.",
                    "description": "You will need 2 teaspoons of lemon juice. The lemon juice will act as a natural astringent and help get rid of the acne and blackhead-causing bacteria. It may also help lighten your skin."
                },
                {
                    "headline": "Mix the egg white and lemon juice.",
                    "description": "Using a fork, rapidly whisk the two ingredients until the egg white becomes foamy and frothy."
                },
                {
                    "headline": "Add the honey to the egg white and lemon juice, and mix everything again.",
                    "description": "You will need ½ tablespoon of honey. Make sure that it is the translucent, runny type. Honey is antibacterial and acts as a natural antiseptic. It is also moisturizing and helps replenish the skin."
                },
                {
                    "headline": "Prepare your face for the mask by washing it with warm water.",
                    "description": "This will open up your pores, which will improve the effectiveness of the mask. Since this mask has a tendency to get very messy, you can also pull your hair back into a ponytail, braid it, or pin it back. This will prevent it from getting sticky. To protect your clothes, consider draping a towel over your chest and shoulders."
                },
                {
                    "headline": "Apply the mask to your face.",
                    "description": "You can use your fingers, a cotton ball, or even a cloth. Avoid the areas around your nose, mouth, and eyes."
                },
                {
                    "headline": "Leave the mask on for 10 to 15 minutes.",
                    "description": "This mask is runny and may drip down your face. To prevent yourself from getting too messy, consider laying down or sitting back in a chair with your head tilted back. You can also use this mask in the bathtub while you are taking a relaxing bath."
                },
                {
                    "headline": "Wash the mask off and pat your face dry.",
                    "description": "Use lukewarm water and splash it onto your face. Gently wash the mask off and avoid scrubbing your face too hard. Use a soft, clean towel to pat your face dry."
                },
                {
                    "headline": "Consider following up with some moisturizer.",
                    "description": "The lemon in this mask may be a little drying for your skin. If you find that your face is a little dry, apply some moisturizer to your face."
                }
            ]
        },
        {
            "name": "Making a Nourishing Mask",
            "steps": [
                {
                    "headline": "Separate the egg and save the yolk.",
                    "description": "Crack open an egg over a bowl and transfer the yolk back and forth between the two shells. Each time the yolk falls into a shell, a little bit of the egg white should fall into the bowl. Keep doing this until all of the egg white is in the bowl. Save the egg yolk and discard the egg white (or save it for another recipe). Egg yolks not only help nourish and moisturize your skin, but they may also help reduce the appearance of blemishes. You can use the egg white to make a simple face mask. To learn how to make one, refer to the section in this article on making a simple mask."
                },
                {
                    "headline": "Add a mashed up banana to the egg yolk.",
                    "description": "Peel a banana open, and cut it to smaller pieces with a knife. Use a fork to mash it to a pulp. The banana will help nourish your face."
                },
                {
                    "headline": "Add the olive oil or coconut oil.",
                    "description": "You will need 2 teaspoons of olive oil. The olive oil will moisturize your face, leaving the skin feeling soft and smooth. If you do not have olive oil, you can use coconut oil instead, which is also very moisturizing."
                },
                {
                    "headline": "Prepare for the mask by washing your face and tying your hair back.",
                    "description": "Use warm water to help open up your pores. If you are wearing makeup, you will need to take it off using makeup remover. As this mask can get messy, it would be a good idea to tie or pin your hair back. You may also want to consider draping a towel over your chest and shoulders to protect your clothes."
                },
                {
                    "headline": "Apply the mask to your face.",
                    "description": "You can use your fingers, a cotton ball, or even a cloth. Avoid the areas around your nose, mouth, and eyes."
                },
                {
                    "headline": "Leave the mask on for 15 minutes.",
                    "description": "To prevent the mask from dripping everywhere, consider laying down or sitting in a comfortable chair with your head tilted back. You can also use this mask in the bathtub while you are soaking or taking a relaxing bath."
                },
                {
                    "headline": "Wash the mask off and pat your face dry.",
                    "description": "Use lukewarm water to rinse your face off. Try not to scrub too hard. Gently pat your face dry with a soft, clean towel."
                }
            ]
        }
    ],
    "tyn": [
        "Bowl",
        "Water",
        "Washcloth",
        "Headband (optional)"
    ],
    "text": " Making a Simple Mask Separate the egg. Crack an egg over a bowl, and transfer the yolk from shell to shell. Each time you transfer the yolk, a little bit of the egg white should flow into the bowl. Keep doing this until all of the egg white is in the bowl. The egg white not only help nourish and firm your skin, but it will also help tighten the pores Discard the egg yolk or save it for another recipe. You can use the egg yolk to make a nourishing face mask. Refer to the section in this article on making a nourishing face mask to learn how. Add lemon juice to the egg white. You will need 2 teaspoons of lemon juice. The lemon juice will act as a natural astringent and help get rid of the acne and blackhead-causing bacteria. It may also help lighten your skin. Mix the egg white and lemon juice. Using a fork, rapidly whisk the two ingredients until the egg white becomes foamy and frothy. Add the honey to the egg white and lemon juice, and mix everything again. You will need ½ tablespoon of honey. Make sure that it is the translucent, runny type. Honey is antibacterial and acts as a natural antiseptic. It is also moisturizing and helps replenish the skin. Prepare your face for the mask by washing it with warm water. This will open up your pores, which will improve the effectiveness of the mask. Since this mask has a tendency to get very messy, you can also pull your hair back into a ponytail, braid it, or pin it back. This will prevent it from getting sticky. To protect your clothes, consider draping a towel over your chest and shoulders. Apply the mask to your face. You can use your fingers, a cotton ball, or even a cloth. Avoid the areas around your nose, mouth, and eyes. Leave the mask on for 10 to 15 minutes. This mask is runny and may drip down your face. To prevent yourself from getting too messy, consider laying down or sitting back in a chair with your head tilted back. You can also use this mask in the bathtub while you are taking a relaxing bath. Wash the mask off and pat your face dry. Use lukewarm water and splash it onto your face. Gently wash the mask off and avoid scrubbing your face too hard. Use a soft, clean towel to pat your face dry. Consider following up with some moisturizer. The lemon in this mask may be a little drying for your skin. If you find that your face is a little dry, apply some moisturizer to your face. Making a Nourishing Mask Separate the egg and save the yolk. Crack open an egg over a bowl and transfer the yolk back and forth between the two shells. Each time the yolk falls into a shell, a little bit of the egg white should fall into the bowl. Keep doing this until all of the egg white is in the bowl. Save the egg yolk and discard the egg white (or save it for another recipe). Egg yolks not only help nourish and moisturize your skin, but they may also help reduce the appearance of blemishes. You can use the egg white to make a simple face mask. To learn how to make one, refer to the section in this article on making a simple mask. Add a mashed up banana to the egg yolk. Peel a banana open, and cut it to smaller pieces with a knife. Use a fork to mash it to a pulp. The banana will help nourish your face. Add the olive oil or coconut oil. You will need 2 teaspoons of olive oil. The olive oil will moisturize your face, leaving the skin feeling soft and smooth. If you do not have olive oil, you can use coconut oil instead, which is also very moisturizing. Prepare for the mask by washing your face and tying your hair back. Use warm water to help open up your pores. If you are wearing makeup, you will need to take it off using makeup remover. As this mask can get messy, it would be a good idea to tie or pin your hair back. You may also want to consider draping a towel over your chest and shoulders to protect your clothes. Apply the mask to your face. You can use your fingers, a cotton ball, or even a cloth. Avoid the areas around your nose, mouth, and eyes. Leave the mask on for 15 minutes. To prevent the mask from dripping everywhere, consider laying down or sitting in a comfortable chair with your head tilted back. You can also use this mask in the bathtub while you are soaking or taking a relaxing bath. Wash the mask off and pat your face dry. Use lukewarm water to rinse your face off. Try not to scrub too hard. Gently pat your face dry with a soft, clean towel.",
    "sentences": [
        " Making a Simple Mask Separate the egg.",
        "Crack an egg over a bowl, and transfer the yolk from shell to shell.",
        "Each time you transfer the yolk, a little bit of the egg white should flow into the bowl.",
        "Keep doing this until all of the egg white is in the bowl.",
        "The egg white not only help nourish and firm your skin, but it will also help tighten the pores Discard the egg yolk or save it for another recipe.",
        "You can use the egg yolk to make a nourishing face mask.",
        "Refer to the section in this article on making a nourishing face mask to learn how.",
        "Add lemon juice to the egg white.",
        "You will need 2 teaspoons of lemon juice.",
        "The lemon juice will act as a natural astringent and help get rid of the acne and blackhead-causing bacteria.",
        "It may also help lighten your skin.",
        "Mix the egg white and lemon juice.",
        "Using a fork, rapidly whisk the two ingredients until the egg white becomes foamy and frothy.",
        "Add the honey to the egg white and lemon juice, and mix everything again.",
        "You will need ½ tablespoon of honey.",
        "Make sure that it is the translucent, runny type.",
        "Honey is antibacterial and acts as a natural antiseptic.",
        "It is also moisturizing and helps replenish the skin.",
        "Prepare your face for the mask by washing it with warm water.",
        "This will open up your pores, which will improve the effectiveness of the mask.",
        "Since this mask has a tendency to get very messy, you can also pull your hair back into a ponytail, braid it, or pin it back.",
        "This will prevent it from getting sticky.",
        "To protect your clothes, consider draping a towel over your chest and shoulders.",
        "Apply the mask to your face.",
        "You can use your fingers, a cotton ball, or even a cloth.",
        "Avoid the areas around your nose, mouth, and eyes.",
        "Leave the mask on for 10 to 15 minutes.",
        "This mask is runny and may drip down your face.",
        "To prevent yourself from getting too messy, consider laying down or sitting back in a chair with your head tilted back.",
        "You can also use this mask in the bathtub while you are taking a relaxing bath.",
        "Wash the mask off and pat your face dry.",
        "Use lukewarm water and splash it onto your face.",
        "Gently wash the mask off and avoid scrubbing your face too hard.",
        "Use a soft, clean towel to pat your face dry.",
        "Consider following up with some moisturizer.",
        "The lemon in this mask may be a little drying for your skin.",
        "If you find that your face is a little dry, apply some moisturizer to your face.",
        "Making a Nourishing Mask Separate the egg and save the yolk.",
        "Crack open an egg over a bowl and transfer the yolk back and forth between the two shells.",
        "Each time the yolk falls into a shell, a little bit of the egg white should fall into the bowl.",
        "Keep doing this until all of the egg white is in the bowl.",
        "Save the egg yolk and discard the egg white (or save it for another recipe).",
        "Egg yolks not only help nourish and moisturize your skin, but they may also help reduce the appearance of blemishes.",
        "You can use the egg white to make a simple face mask.",
        "To learn how to make one, refer to the section in this article on making a simple mask.",
        "Add a mashed up banana to the egg yolk.",
        "Peel a banana open, and cut it to smaller pieces with a knife.",
        "Use a fork to mash it to a pulp.",
        "The banana will help nourish your face.",
        "Add the olive oil or coconut oil.",
        "You will need 2 teaspoons of olive oil.",
        "The olive oil will moisturize your face, leaving the skin feeling soft and smooth.",
        "If you do not have olive oil, you can use coconut oil instead, which is also very moisturizing.",
        "Prepare for the mask by washing your face and tying your hair back.",
        "Use warm water to help open up your pores.",
        "If you are wearing makeup, you will need to take it off using makeup remover.",
        "As this mask can get messy, it would be a good idea to tie or pin your hair back.",
        "You may also want to consider draping a towel over your chest and shoulders to protect your clothes.",
        "Apply the mask to your face.",
        "You can use your fingers, a cotton ball, or even a cloth.",
        "Avoid the areas around your nose, mouth, and eyes.",
        "Leave the mask on for 15 minutes.",
        "To prevent the mask from dripping everywhere, consider laying down or sitting in a comfortable chair with your head tilted back.",
        "You can also use this mask in the bathtub while you are soaking or taking a relaxing bath.",
        "Wash the mask off and pat your face dry.",
        "Use lukewarm water to rinse your face off.",
        "Try not to scrub too hard.",
        "Gently pat your face dry with a soft, clean towel."
    ]
}