{
    "title": "How to Make Sun Tea",
    "url": "https://www.wikihow.com/Make-Sun-Tea",
    "category_hierarchy": "",
    "methods": [
        {
            "name": "Classic Sun Tea",
            "steps": [
                {
                    "headline": "Choose a sun tea container.",
                    "description": "The container you use to make sun tea should be clear, to allow the sun's rays to penetrate to the tea bags and water. Choose a container that has a lid so you can prevent bugs and other outside particles from getting into your tea as it steeps. Make sure to use a container that is easy to clean. Don't use one that could easily harbor bacteria, like a container with a spigot that's difficult to wash.\nAvoid using plastic containers to make sun tea. Chemicals in the plastic can leach into the water, affecting the tea's taste and posing a health risk as well."
                },
                {
                    "headline": "Sanitize the container.",
                    "description": "Water heated by the sun reaches a maximum temperature of 130 degrees - the perfect temperature for bacteria to breed. To reduce the chance that your tea gets contaminated with bacteria, it's important to sanitize the container you're using. Bring a large pot of water to a boil on the stove. Place the container in the water and let it boil for a few minutes, then remove it with tongs and allow it to drain dry. If you'd prefer not to using the boiling method (after all, it's summer!) use soap and hot water to thoroughly cleanse the container and lid."
                },
                {
                    "headline": "Fill the container with 4 cups of cold water.",
                    "description": "As an additional precaution against bacterial growth, choose distilled water, which you can buy by the gallon at the grocery store. You could also use bottled spring water for the cleanest flavor."
                },
                {
                    "headline": "Add five teabags.",
                    "description": "Any kind of teabags make great sun tea. Choose black tea, green tea, or any variety of herbal tea. If you want the tea to be extra strong, add more than 5 teabags. You can always dilute it with more water to reduce its strength if necessary."
                },
                {
                    "headline": "Place the container in direct sunlight for 2 - 4 hours.",
                    "description": "You can put it in the windowsill or place it outside on a table. Just make sure it's in a place where the sun hits it directly and it's not obscured by shadows. Do not let the tea sit in the sun for over 4 hours. Leaving it out for a longer period of time encourages bacteria to grow. Avoid placing the container directly on the ground. Put it on a tray or another clean surface."
                },
                {
                    "headline": "Remove the teabags.",
                    "description": "After a few hours in the sun, your tea should look colorful and strong. Remove the tea bags and discard them. You can keep the tea in the same container if you wish to refrigerate it. Examine the surface of the tea for bacterial growth. If you see ropey strands or white spots, discard the tea. The tea shouldn't have a thick or syrupy consistency; if it does, discard it."
                },
                {
                    "headline": "Serve the sun tea.",
                    "description": "You can mix some sugar into the tea if you'd like. Fill some glasses with ice and pour the tea into the glasses."
                }
            ]
        },
        {
            "name": "Herbal Sun Tea",
            "steps": [
                {
                    "headline": "Choose herbs to use.",
                    "description": "What's your favorite herb? For many people the answer is mint, but you don't have to limit yourself to just one when you make herbal sun tea. Pick out one or more herbs that add up to about a cup - less if you want the flavor to be subtler. Experiment with different flavor combinations. Try lemon balm with chamomile, mint with rosemary, or basil with hibiscus, for example. Choose herbs that are at their fresh, healthy peak. Pick them fresh, if possible. If you buy them at the store, make sure they don't look wilted or discolored. Try to get organic herbs. Brewing tea with herbs that were treated with pesticides is not a healthy practice."
                },
                {
                    "headline": "Wash the herbs.",
                    "description": "Rinse them thoroughly in cold water. Run your fingers over the leaves and stems to help remove dirt and other debris. There is no need to chop the herbs or remove their stems."
                },
                {
                    "headline": "Fill the container with herbs and water.",
                    "description": "Place the herbs in your sterilized container and cover it with the 4 cups of distilled or spring water. Put the lid on the container."
                },
                {
                    "headline": "Let the tea steep in the sun.",
                    "description": "Set it in the windowsill or on a clean outside surface in direct sunlight. Let the tea steep for 2 - 4 hours. Remove it from the sunlight when the water has taken on a golden or green hue, depending on what herbs you're using."
                },
                {
                    "headline": "Drink the tea.",
                    "description": "Herbal sun tea is healthy and delicious. Pour it into glasses and sweeten it with honey or agave nectar. Serve it iced."
                }
            ]
        }
    ],
    "tyn": [
        "A clear glass container",
        "Tea bags or fresh herbs",
        "Distilled or spring water"
    ],
    "text": " Classic Sun Tea Choose a sun tea container. The container you use to make sun tea should be clear, to allow the sun's rays to penetrate to the tea bags and water. Choose a container that has a lid so you can prevent bugs and other outside particles from getting into your tea as it steeps. Make sure to use a container that is easy to clean. Don't use one that could easily harbor bacteria, like a container with a spigot that's difficult to wash.\nAvoid using plastic containers to make sun tea. Chemicals in the plastic can leach into the water, affecting the tea's taste and posing a health risk as well. Sanitize the container. Water heated by the sun reaches a maximum temperature of 130 degrees - the perfect temperature for bacteria to breed. To reduce the chance that your tea gets contaminated with bacteria, it's important to sanitize the container you're using. Bring a large pot of water to a boil on the stove. Place the container in the water and let it boil for a few minutes, then remove it with tongs and allow it to drain dry. If you'd prefer not to using the boiling method (after all, it's summer!) use soap and hot water to thoroughly cleanse the container and lid. Fill the container with 4 cups of cold water. As an additional precaution against bacterial growth, choose distilled water, which you can buy by the gallon at the grocery store. You could also use bottled spring water for the cleanest flavor. Add five teabags. Any kind of teabags make great sun tea. Choose black tea, green tea, or any variety of herbal tea. If you want the tea to be extra strong, add more than 5 teabags. You can always dilute it with more water to reduce its strength if necessary. Place the container in direct sunlight for 2 - 4 hours. You can put it in the windowsill or place it outside on a table. Just make sure it's in a place where the sun hits it directly and it's not obscured by shadows. Do not let the tea sit in the sun for over 4 hours. Leaving it out for a longer period of time encourages bacteria to grow. Avoid placing the container directly on the ground. Put it on a tray or another clean surface. Remove the teabags. After a few hours in the sun, your tea should look colorful and strong. Remove the tea bags and discard them. You can keep the tea in the same container if you wish to refrigerate it. Examine the surface of the tea for bacterial growth. If you see ropey strands or white spots, discard the tea. The tea shouldn't have a thick or syrupy consistency; if it does, discard it. Serve the sun tea. You can mix some sugar into the tea if you'd like. Fill some glasses with ice and pour the tea into the glasses. Herbal Sun Tea Choose herbs to use. What's your favorite herb? For many people the answer is mint, but you don't have to limit yourself to just one when you make herbal sun tea. Pick out one or more herbs that add up to about a cup - less if you want the flavor to be subtler. Experiment with different flavor combinations. Try lemon balm with chamomile, mint with rosemary, or basil with hibiscus, for example. Choose herbs that are at their fresh, healthy peak. Pick them fresh, if possible. If you buy them at the store, make sure they don't look wilted or discolored. Try to get organic herbs. Brewing tea with herbs that were treated with pesticides is not a healthy practice. Wash the herbs. Rinse them thoroughly in cold water. Run your fingers over the leaves and stems to help remove dirt and other debris. There is no need to chop the herbs or remove their stems. Fill the container with herbs and water. Place the herbs in your sterilized container and cover it with the 4 cups of distilled or spring water. Put the lid on the container. Let the tea steep in the sun. Set it in the windowsill or on a clean outside surface in direct sunlight. Let the tea steep for 2 - 4 hours. Remove it from the sunlight when the water has taken on a golden or green hue, depending on what herbs you're using. Drink the tea. Herbal sun tea is healthy and delicious. Pour it into glasses and sweeten it with honey or agave nectar. Serve it iced.",
    "sentences": [
        " Classic Sun Tea Choose a sun tea container.",
        "The container you use to make sun tea should be clear, to allow the sun's rays to penetrate to the tea bags and water.",
        "Choose a container that has a lid so you can prevent bugs and other outside particles from getting into your tea as it steeps.",
        "Make sure to use a container that is easy to clean.",
        "Don't use one that could easily harbor bacteria, like a container with a spigot that's difficult to wash.\nAvoid using plastic containers to make sun tea.",
        "Chemicals in the plastic can leach into the water, affecting the tea's taste and posing a health risk as well.",
        "Sanitize the container.",
        "Water heated by the sun reaches a maximum temperature of 130 degrees - the perfect temperature for bacteria to breed.",
        "To reduce the chance that your tea gets contaminated with bacteria, it's important to sanitize the container you're using.",
        "Bring a large pot of water to a boil on the stove.",
        "Place the container in the water and let it boil for a few minutes, then remove it with tongs and allow it to drain dry.",
        "If you'd prefer not to using the boiling method (after all, it's summer!)",
        "use soap and hot water to thoroughly cleanse the container and lid.",
        "Fill the container with 4 cups of cold water.",
        "As an additional precaution against bacterial growth, choose distilled water, which you can buy by the gallon at the grocery store.",
        "You could also use bottled spring water for the cleanest flavor.",
        "Add five teabags.",
        "Any kind of teabags make great sun tea.",
        "Choose black tea, green tea, or any variety of herbal tea.",
        "If you want the tea to be extra strong, add more than 5 teabags.",
        "You can always dilute it with more water to reduce its strength if necessary.",
        "Place the container in direct sunlight for 2 - 4 hours.",
        "You can put it in the windowsill or place it outside on a table.",
        "Just make sure it's in a place where the sun hits it directly and it's not obscured by shadows.",
        "Do not let the tea sit in the sun for over 4 hours.",
        "Leaving it out for a longer period of time encourages bacteria to grow.",
        "Avoid placing the container directly on the ground.",
        "Put it on a tray or another clean surface.",
        "Remove the teabags.",
        "After a few hours in the sun, your tea should look colorful and strong.",
        "Remove the tea bags and discard them.",
        "You can keep the tea in the same container if you wish to refrigerate it.",
        "Examine the surface of the tea for bacterial growth.",
        "If you see ropey strands or white spots, discard the tea.",
        "The tea shouldn't have a thick or syrupy consistency; if it does, discard it.",
        "Serve the sun tea.",
        "You can mix some sugar into the tea if you'd like.",
        "Fill some glasses with ice and pour the tea into the glasses.",
        "Herbal Sun Tea Choose herbs to use.",
        "What's your favorite herb?",
        "For many people the answer is mint, but you don't have to limit yourself to just one when you make herbal sun tea.",
        "Pick out one or more herbs that add up to about a cup - less if you want the flavor to be subtler.",
        "Experiment with different flavor combinations.",
        "Try lemon balm with chamomile, mint with rosemary, or basil with hibiscus, for example.",
        "Choose herbs that are at their fresh, healthy peak.",
        "Pick them fresh, if possible.",
        "If you buy them at the store, make sure they don't look wilted or discolored.",
        "Try to get organic herbs.",
        "Brewing tea with herbs that were treated with pesticides is not a healthy practice.",
        "Wash the herbs.",
        "Rinse them thoroughly in cold water.",
        "Run your fingers over the leaves and stems to help remove dirt and other debris.",
        "There is no need to chop the herbs or remove their stems.",
        "Fill the container with herbs and water.",
        "Place the herbs in your sterilized container and cover it with the 4 cups of distilled or spring water.",
        "Put the lid on the container.",
        "Let the tea steep in the sun.",
        "Set it in the windowsill or on a clean outside surface in direct sunlight.",
        "Let the tea steep for 2 - 4 hours.",
        "Remove it from the sunlight when the water has taken on a golden or green hue, depending on what herbs you're using.",
        "Drink the tea.",
        "Herbal sun tea is healthy and delicious.",
        "Pour it into glasses and sweeten it with honey or agave nectar.",
        "Serve it iced."
    ]
}