{
    "title": "How to Bake with Whole Grains",
    "url": "https://www.wikihow.com/Bake-with-Whole-Grains",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking"
    ],
    "methods": [
        {
            "name": "Choosing Which Flour(s) to Use",
            "steps": [
                {
                    "headline": "Decide between white and regular whole wheat.",
                    "description": "Regular whole wheat flour is arguably the most widely available whole grain flour, and perhaps the most often cited in recipes. However, be aware that it has a nutty and tannic flavor that may not always lend itself well to your baked goods. As an alternative, consider using white whole wheat instead, which has a milder flavor and can be used in direct ratios when substituting regular whole wheat or white flour in recipes. The difference between the two is which type of wheat berry is used to make them. Regular whole wheat flour comes from red wheat berries, while white whole wheat comes from white wheat berries."
                },
                {
                    "headline": "Opt for whole wheat pastry flour for lighter bakes.",
                    "description": "Both regular and white whole wheat flours tend to result in heavier finished products. If the baked good you’re making is supposed to be light and crumbly, but the only whole grain available is whole wheat, go with whole wheat pastry flour. Expect pastry flour to have less protein than regular flour, and therefore less gluten when baked, which is what weighs down the texture of baked goods."
                },
                {
                    "headline": "Start with spelt when branching out from wheat.",
                    "description": "If you’re looking to use flours other than whole wheat, begin with spelt. Utilize its sweet but mild flavor to avoid overpowering your baked goods, which is a risk with stronger grains that have bolder flavors. At the same time, eliminate the need to convert measurements in recipes, since spelt can be substituted in direct ratio to whole wheat flour."
                },
                {
                    "headline": "Add barley for creamy textures.",
                    "description": "If you want a baked good that melts in your mouth, go with barley. However, be aware that it’s texture is very soft, so don’t ditch the whole wheat or all-purpose flour entirely. Instead, use half of the original amount that the recipe calls for (or, if you’re using spelt, an equal measurement of that), and then substitute the other half with barley."
                },
                {
                    "headline": "Use oat to support chocolate, fruits, and nuts.",
                    "description": "Whole wheat flour usually results in a heavier baked good, which you often need to support the weight of solid add-ins (like chunks or whole pieces of chocolate, fruits, and nuts). However, if you want your baked good to be less dense while still mixing in these ingredients, substitute half of the whole wheat or all-purpose flour in your recipe with oat flour. This will result in a lighter bake that’s still sturdy enough to keep those ingredients from sinking to the bottom as it bakes."
                },
                {
                    "headline": "Avoid “multigrain.” If you’re looking to eliminate baking with white flour entirely, read the package of any flour labeled as multigrain.",
                    "description": "Obviously, “multigrain” means that it is a combination of multiple grains, including whole grains. However, expect to find white flour listed as one of the flours mixed into many varieties of this product."
                }
            ]
        },
        {
            "name": "Adjusting from White Flour to Whole Grains",
            "steps": [
                {
                    "headline": "Expect changes in flavor and texture.",
                    "description": "Keep in mind that using whole grains instead of white flour will affect your baked goods’ taste and consistency. This doesn’t mean that all baked goods will taste better or worse with whole grains--just different. That said, depending on the type of baked good you’re making and your own personal tastes, anticipate having to do some trial-and-error with some recipes before you nail it."
                },
                {
                    "headline": "Start with darker baked goods.",
                    "description": "Expect the difference in whole grains’ taste to be most striking when used in goods whose finished color really reflects the use of white flour. Because of this, start off with baked goods whose color tends to be on the dark side with or without white flour. Give your taste buds a chance to adjust before attempting a bake where the difference will be more noticeable. For instance, go with a chocolate cake instead of a vanilla cake if this is your first bake with whole grains"
                },
                {
                    "headline": "Ease into it with partial substitutions.",
                    "description": "When you first attempt to bake with whole grains, don’t ditch the white flour right away. Instead, use the white flour for half the total flour called for by the recipe, and use whole grains for the other half. Note the difference in flavor and texture of your first batch. From there, decide if you'd like to increase the percentage of whole grains used in your next bake, or if you'd like to try again with a different type of flour."
                },
                {
                    "headline": "Convert measurements when needed.",
                    "description": "Whole wheat and spelt flours can generally be used in equal measurements to the amount of white flour that a recipe calls for. However, expect other whole grain flours to require conversions. For example, if you’re branching out into nuts and using almond flour, you should use double the amount called for in white flour. Search online for conversion charts to determine what if any conversion is needed for the type of flour that you’ve chosen to work with, like this one:\nhttp://www.kingarthurflour.com/learn/ingredient-weight-chart.html"
                },
                {
                    "headline": "Add more liquid than called for.",
                    "description": "Be aware that whole grain flours absorb more moisture than white flour. If you’re using a recipe that calls for white flour, expect the finished product to be on the dry side if you substitute the white flour entirely with whole grains. To compensate, add two more teaspoons of each wet ingredient than specified for each cup of flour used."
                },
                {
                    "headline": "Give the dough more time to absorb moisture.",
                    "description": "At the very least, let it sit for 20 to 25 minutes after you make it before you go and knead it. For even better results, let it sit overnight. Additionally, try adding a tablespoon of lemon juice or another acidic ingredient. This allows the grains more time to soften while also breaking down more starch, which will make kneading easier."
                }
            ]
        },
        {
            "name": "Trying Whole Grain-Specific Recipes",
            "steps": [
                {
                    "headline": "Make whole wheat scones.",
                    "description": "First, preheat your oven to 325 degrees Fahrenheit (163 degrees Celsius). Then, in a large mixing bowl, combine your flour, baking powder, and salt. Cut your butter into half-inch cubes (1.25 cm) and then work them into the flour mix with your hands, pinching them together, until they form what looks like breadcrumbs. Next, stir in the brown sugar and raisins, followed by the buttermilk. Now that you have your dough:\nDust a surface with flour and then roll the dough into a rectangular shape approximately a quarter inch thick (0.64 cm). Cut it up into a dozen squares with each measuring about three inches, then roll any leftover trimmings together to make extra. Line a baking sheet with cooking oil. Fold each square diagonally so it turns into triangle, then place it on the baking sheet. Bake for a half hour, or until the tops brown to golden."
                },
                {
                    "headline": "Bake spelt cookies.",
                    "description": "First, move one oven rack down as low as possible and another to a higher position. Then set your oven to 375 degrees Fahrenheit (190 degrees Celsius). While it preheats, use an electric mixer to beat together your brown sugar, butter, egg, and vanilla extract in a large mixing bowl. In a second bowl, combine your spelt flour, baking soda, and salt. Add the second bowl’s contents to the first and stir to combine. To bake:\nUse a spoon to portion your dough out onto a baking sheet to form the size cookies you desire, leaving at least an inch (2.5 cm) between each one. Place the baking sheet on the lowest rack and bake for five minutes. Switch the sheet to the higher rack and bake for roughly five more, until the edges begin to brown a bit."
                },
                {
                    "headline": "Make barley buttermilk muffins.",
                    "description": "Let your oven preheat to 400 degrees Fahrenheit (204 Celsius). Then either spray your muffin pan with nonstick spray or line it with paper muffin cups. Next, stir together the barley flour, baking soda, baking powder, salt, and brown sugar in a medium mixing bowl. In a second bowl, use a whisk to combine the buttermilk, vegetable oil, and egg, then add the wet ingredients to the dry ones and stir  to combine. Fill the tins with the batter and bake for 18 to 20 minutes. The batter doesn’t need to be creamy smooth, so don't worry if it's a little lumpy."
                }
            ]
        }
    ],
    "tyn": [
        "Whole Wheat Scones",
        "Measuring cups and spoons",
        "Mixing bowl",
        "Knife",
        "Spoon for stirring",
        "Oven",
        "Baking sheet",
        "Cooking oil",
        "Spelt Cookies",
        "Electric mixer",
        "Spoon",
        "Barley Buttermilk Muffins",
        "Muffin tray",
        "Nonstick spray or paper liners",
        "Whisk"
    ],
    "text": " Choosing Which Flour(s) to Use Decide between white and regular whole wheat. Regular whole wheat flour is arguably the most widely available whole grain flour, and perhaps the most often cited in recipes. However, be aware that it has a nutty and tannic flavor that may not always lend itself well to your baked goods. As an alternative, consider using white whole wheat instead, which has a milder flavor and can be used in direct ratios when substituting regular whole wheat or white flour in recipes. The difference between the two is which type of wheat berry is used to make them. Regular whole wheat flour comes from red wheat berries, while white whole wheat comes from white wheat berries. Opt for whole wheat pastry flour for lighter bakes. Both regular and white whole wheat flours tend to result in heavier finished products. If the baked good you’re making is supposed to be light and crumbly, but the only whole grain available is whole wheat, go with whole wheat pastry flour. Expect pastry flour to have less protein than regular flour, and therefore less gluten when baked, which is what weighs down the texture of baked goods. Start with spelt when branching out from wheat. If you’re looking to use flours other than whole wheat, begin with spelt. Utilize its sweet but mild flavor to avoid overpowering your baked goods, which is a risk with stronger grains that have bolder flavors. At the same time, eliminate the need to convert measurements in recipes, since spelt can be substituted in direct ratio to whole wheat flour. Add barley for creamy textures. If you want a baked good that melts in your mouth, go with barley. However, be aware that it’s texture is very soft, so don’t ditch the whole wheat or all-purpose flour entirely. Instead, use half of the original amount that the recipe calls for (or, if you’re using spelt, an equal measurement of that), and then substitute the other half with barley. Use oat to support chocolate, fruits, and nuts. Whole wheat flour usually results in a heavier baked good, which you often need to support the weight of solid add-ins (like chunks or whole pieces of chocolate, fruits, and nuts). However, if you want your baked good to be less dense while still mixing in these ingredients, substitute half of the whole wheat or all-purpose flour in your recipe with oat flour. This will result in a lighter bake that’s still sturdy enough to keep those ingredients from sinking to the bottom as it bakes. Avoid “multigrain.” If you’re looking to eliminate baking with white flour entirely, read the package of any flour labeled as multigrain. Obviously, “multigrain” means that it is a combination of multiple grains, including whole grains. However, expect to find white flour listed as one of the flours mixed into many varieties of this product. Adjusting from White Flour to Whole Grains Expect changes in flavor and texture. Keep in mind that using whole grains instead of white flour will affect your baked goods’ taste and consistency. This doesn’t mean that all baked goods will taste better or worse with whole grains--just different. That said, depending on the type of baked good you’re making and your own personal tastes, anticipate having to do some trial-and-error with some recipes before you nail it. Start with darker baked goods. Expect the difference in whole grains’ taste to be most striking when used in goods whose finished color really reflects the use of white flour. Because of this, start off with baked goods whose color tends to be on the dark side with or without white flour. Give your taste buds a chance to adjust before attempting a bake where the difference will be more noticeable. For instance, go with a chocolate cake instead of a vanilla cake if this is your first bake with whole grains Ease into it with partial substitutions. When you first attempt to bake with whole grains, don’t ditch the white flour right away. Instead, use the white flour for half the total flour called for by the recipe, and use whole grains for the other half. Note the difference in flavor and texture of your first batch. From there, decide if you'd like to increase the percentage of whole grains used in your next bake, or if you'd like to try again with a different type of flour. Convert measurements when needed. Whole wheat and spelt flours can generally be used in equal measurements to the amount of white flour that a recipe calls for. However, expect other whole grain flours to require conversions. For example, if you’re branching out into nuts and using almond flour, you should use double the amount called for in white flour. Search online for conversion charts to determine what if any conversion is needed for the type of flour that you’ve chosen to work with, like this one:\nhttp://www.kingarthurflour.com/learn/ingredient-weight-chart.html Add more liquid than called for. Be aware that whole grain flours absorb more moisture than white flour. If you’re using a recipe that calls for white flour, expect the finished product to be on the dry side if you substitute the white flour entirely with whole grains. To compensate, add two more teaspoons of each wet ingredient than specified for each cup of flour used. Give the dough more time to absorb moisture. At the very least, let it sit for 20 to 25 minutes after you make it before you go and knead it. For even better results, let it sit overnight. Additionally, try adding a tablespoon of lemon juice or another acidic ingredient. This allows the grains more time to soften while also breaking down more starch, which will make kneading easier. Trying Whole Grain-Specific Recipes Make whole wheat scones. First, preheat your oven to 325 degrees Fahrenheit (163 degrees Celsius). Then, in a large mixing bowl, combine your flour, baking powder, and salt. Cut your butter into half-inch cubes (1.25 cm) and then work them into the flour mix with your hands, pinching them together, until they form what looks like breadcrumbs. Next, stir in the brown sugar and raisins, followed by the buttermilk. Now that you have your dough:\nDust a surface with flour and then roll the dough into a rectangular shape approximately a quarter inch thick (0.64 cm). Cut it up into a dozen squares with each measuring about three inches, then roll any leftover trimmings together to make extra. Line a baking sheet with cooking oil. Fold each square diagonally so it turns into triangle, then place it on the baking sheet. Bake for a half hour, or until the tops brown to golden. Bake spelt cookies. First, move one oven rack down as low as possible and another to a higher position. Then set your oven to 375 degrees Fahrenheit (190 degrees Celsius). While it preheats, use an electric mixer to beat together your brown sugar, butter, egg, and vanilla extract in a large mixing bowl. In a second bowl, combine your spelt flour, baking soda, and salt. Add the second bowl’s contents to the first and stir to combine. To bake:\nUse a spoon to portion your dough out onto a baking sheet to form the size cookies you desire, leaving at least an inch (2.5 cm) between each one. Place the baking sheet on the lowest rack and bake for five minutes. Switch the sheet to the higher rack and bake for roughly five more, until the edges begin to brown a bit. Make barley buttermilk muffins. Let your oven preheat to 400 degrees Fahrenheit (204 Celsius). Then either spray your muffin pan with nonstick spray or line it with paper muffin cups. Next, stir together the barley flour, baking soda, baking powder, salt, and brown sugar in a medium mixing bowl. In a second bowl, use a whisk to combine the buttermilk, vegetable oil, and egg, then add the wet ingredients to the dry ones and stir  to combine. Fill the tins with the batter and bake for 18 to 20 minutes. The batter doesn’t need to be creamy smooth, so don't worry if it's a little lumpy.",
    "sentences": [
        " Choosing Which Flour(s) to Use Decide between white and regular whole wheat.",
        "Regular whole wheat flour is arguably the most widely available whole grain flour, and perhaps the most often cited in recipes.",
        "However, be aware that it has a nutty and tannic flavor that may not always lend itself well to your baked goods.",
        "As an alternative, consider using white whole wheat instead, which has a milder flavor and can be used in direct ratios when substituting regular whole wheat or white flour in recipes.",
        "The difference between the two is which type of wheat berry is used to make them.",
        "Regular whole wheat flour comes from red wheat berries, while white whole wheat comes from white wheat berries.",
        "Opt for whole wheat pastry flour for lighter bakes.",
        "Both regular and white whole wheat flours tend to result in heavier finished products.",
        "If the baked good you’re making is supposed to be light and crumbly, but the only whole grain available is whole wheat, go with whole wheat pastry flour.",
        "Expect pastry flour to have less protein than regular flour, and therefore less gluten when baked, which is what weighs down the texture of baked goods.",
        "Start with spelt when branching out from wheat.",
        "If you’re looking to use flours other than whole wheat, begin with spelt.",
        "Utilize its sweet but mild flavor to avoid overpowering your baked goods, which is a risk with stronger grains that have bolder flavors.",
        "At the same time, eliminate the need to convert measurements in recipes, since spelt can be substituted in direct ratio to whole wheat flour.",
        "Add barley for creamy textures.",
        "If you want a baked good that melts in your mouth, go with barley.",
        "However, be aware that it’s texture is very soft, so don’t ditch the whole wheat or all-purpose flour entirely.",
        "Instead, use half of the original amount that the recipe calls for (or, if you’re using spelt, an equal measurement of that), and then substitute the other half with barley.",
        "Use oat to support chocolate, fruits, and nuts.",
        "Whole wheat flour usually results in a heavier baked good, which you often need to support the weight of solid add-ins (like chunks or whole pieces of chocolate, fruits, and nuts).",
        "However, if you want your baked good to be less dense while still mixing in these ingredients, substitute half of the whole wheat or all-purpose flour in your recipe with oat flour.",
        "This will result in a lighter bake that’s still sturdy enough to keep those ingredients from sinking to the bottom as it bakes.",
        "Avoid “multigrain.” If you’re looking to eliminate baking with white flour entirely, read the package of any flour labeled as multigrain.",
        "Obviously, “multigrain” means that it is a combination of multiple grains, including whole grains.",
        "However, expect to find white flour listed as one of the flours mixed into many varieties of this product.",
        "Adjusting from White Flour to Whole Grains Expect changes in flavor and texture.",
        "Keep in mind that using whole grains instead of white flour will affect your baked goods’ taste and consistency.",
        "This doesn’t mean that all baked goods will taste better or worse with whole grains--just different.",
        "That said, depending on the type of baked good you’re making and your own personal tastes, anticipate having to do some trial-and-error with some recipes before you nail it.",
        "Start with darker baked goods.",
        "Expect the difference in whole grains’ taste to be most striking when used in goods whose finished color really reflects the use of white flour.",
        "Because of this, start off with baked goods whose color tends to be on the dark side with or without white flour.",
        "Give your taste buds a chance to adjust before attempting a bake where the difference will be more noticeable.",
        "For instance, go with a chocolate cake instead of a vanilla cake if this is your first bake with whole grains Ease into it with partial substitutions.",
        "When you first attempt to bake with whole grains, don’t ditch the white flour right away.",
        "Instead, use the white flour for half the total flour called for by the recipe, and use whole grains for the other half.",
        "Note the difference in flavor and texture of your first batch.",
        "From there, decide if you'd like to increase the percentage of whole grains used in your next bake, or if you'd like to try again with a different type of flour.",
        "Convert measurements when needed.",
        "Whole wheat and spelt flours can generally be used in equal measurements to the amount of white flour that a recipe calls for.",
        "However, expect other whole grain flours to require conversions.",
        "For example, if you’re branching out into nuts and using almond flour, you should use double the amount called for in white flour.",
        "Search online for conversion charts to determine what if any conversion is needed for the type of flour that you’ve chosen to work with, like this one:\nhttp://www.kingarthurflour.com/learn/ingredient-weight-chart.html Add more liquid than called for.",
        "Be aware that whole grain flours absorb more moisture than white flour.",
        "If you’re using a recipe that calls for white flour, expect the finished product to be on the dry side if you substitute the white flour entirely with whole grains.",
        "To compensate, add two more teaspoons of each wet ingredient than specified for each cup of flour used.",
        "Give the dough more time to absorb moisture.",
        "At the very least, let it sit for 20 to 25 minutes after you make it before you go and knead it.",
        "For even better results, let it sit overnight.",
        "Additionally, try adding a tablespoon of lemon juice or another acidic ingredient.",
        "This allows the grains more time to soften while also breaking down more starch, which will make kneading easier.",
        "Trying Whole Grain-Specific Recipes Make whole wheat scones.",
        "First, preheat your oven to 325 degrees Fahrenheit (163 degrees Celsius).",
        "Then, in a large mixing bowl, combine your flour, baking powder, and salt.",
        "Cut your butter into half-inch cubes (1.25 cm) and then work them into the flour mix with your hands, pinching them together, until they form what looks like breadcrumbs.",
        "Next, stir in the brown sugar and raisins, followed by the buttermilk.",
        "Now that you have your dough:\nDust a surface with flour and then roll the dough into a rectangular shape approximately a quarter inch thick (0.64 cm).",
        "Cut it up into a dozen squares with each measuring about three inches, then roll any leftover trimmings together to make extra.",
        "Line a baking sheet with cooking oil.",
        "Fold each square diagonally so it turns into triangle, then place it on the baking sheet.",
        "Bake for a half hour, or until the tops brown to golden.",
        "Bake spelt cookies.",
        "First, move one oven rack down as low as possible and another to a higher position.",
        "Then set your oven to 375 degrees Fahrenheit (190 degrees Celsius).",
        "While it preheats, use an electric mixer to beat together your brown sugar, butter, egg, and vanilla extract in a large mixing bowl.",
        "In a second bowl, combine your spelt flour, baking soda, and salt.",
        "Add the second bowl’s contents to the first and stir to combine.",
        "To bake:\nUse a spoon to portion your dough out onto a baking sheet to form the size cookies you desire, leaving at least an inch (2.5 cm) between each one.",
        "Place the baking sheet on the lowest rack and bake for five minutes.",
        "Switch the sheet to the higher rack and bake for roughly five more, until the edges begin to brown a bit.",
        "Make barley buttermilk muffins.",
        "Let your oven preheat to 400 degrees Fahrenheit (204 Celsius).",
        "Then either spray your muffin pan with nonstick spray or line it with paper muffin cups.",
        "Next, stir together the barley flour, baking soda, baking powder, salt, and brown sugar in a medium mixing bowl.",
        "In a second bowl, use a whisk to combine the buttermilk, vegetable oil, and egg, then add the wet ingredients to the dry ones and stir  to combine.",
        "Fill the tins with the batter and bake for 18 to 20 minutes.",
        "The batter doesn’t need to be creamy smooth, so don't worry if it's a little lumpy."
    ]
}