{
    "title": "How to Break in High Heel Shoes",
    "url": "https://www.wikihow.com/Break-in-High-Heel-Shoes",
    "category_hierarchy": [
        "Personal Care and Style",
        "Footwear",
        "High Heeled Footwear"
    ],
    "methods": [
        {
            "name": "Breaking in High Heel Shoes Gradually",
            "steps": [
                {
                    "headline": "Wear them throughout the day.",
                    "description": "The first step to breaking in a new pair of high heel shoes is simply to wear them often. The more often you wear your heels, the more of an opportunity your heels have to stretch and conform to your feet. To avoid the awkwardness and potential danger of wearing new high heel shoes while out and about, start by wearing your shoes at home. You can wear them while watching television or folding laundry. You can wear them while cooking dinner. You can also take your heels with you to work. If have an office job, wear your shoes at your desk for a couple of hours. Once you feel comfortable wearing and walking short distances in your heels, take them out. Wear them on a short trip to the grocery store or to your local bank."
                },
                {
                    "headline": "Wear your heels with socks.",
                    "description": "Although this is considered a fashion faux pas, wearing socks with your new heels will help to break them in. You don't have to wear them while you're out and about, unless, of course, you actually like the look of it. You can wear them while you're hanging out at home, or while you're sitting at your desk at work. In order for your socks to stretch your shoes properly, they can't be too thin (they won't work) and they can't be too thick (they'll stretch your shoes too much and cause your feet to slip out when you are wearing your heels skin-to-shoe). A regular, everyday sock will do just fine. Do this for a few days and you'll notice that you are blister-free and your shoes are broken in, having molded to the shape of your foot."
                },
                {
                    "headline": "Bend and twist them.",
                    "description": "You can work out the stiffness of your new heels by bending and twisting them. Apply slight pressure as you bend the shoes upwards and downwards and twist them side to side. Don't do either method too hard or too quickly. You don't want to force the shoe into a position that it shouldn't be making. Doing so could damage the shoe or weaken it in places that should remain sturdy."
                },
                {
                    "headline": "Blast your heels with heat.",
                    "description": "Heat is an effective way to soften a material and make it more pliable. Carefully warm your heels using a blow dryer or a small heater for about a minute or two. Watch how your heels react to the heat because certain materials don't do so well under heat for long periods of time. You can bend and twist your heels while they're still warm. Or you can wait until they've cooled and put them on with a pair of socks to stretch them."
                },
                {
                    "headline": "Always keep your heels stuffed.",
                    "description": "Naturally your heels with shrink when they're not being worn. Since you don't want all of your breaking in efforts be in vain, keep them stuffed when you're not wearing them. You can stuff your shoes with the shoe paper and rod that come with the shoes when you buy them. You can keep them filled with shoe trees, which are inserts molded into the shape of the inside of your high heel shoes. Or you can simply stuff them with rags."
                },
                {
                    "headline": "Keep silica gel packets in your shoes when they're not being worn.",
                    "description": "Have you noticed after purchasing a pair of new shoes those little white packets containing tiny clear balls inside your shoe box? Those packets contain silica gel which absorb moisture and keep your shoes from shrinking. Hold on to those packets instead of throwing them away and stick them in your shoes when you're not wearing them. You can ask a shoe store associate for extras, if necessary."
                }
            ]
        },
        {
            "name": "Using Quick Fixes to Break in High Heel Shoes",
            "steps": [
                {
                    "headline": "Stick a peeled potato in your shoes.",
                    "description": "This may seem unusual and a little icky, but it can help stretch out your heels quickly. You'll need to select two potatoes large enough puff up your shoes once inserted. Peel the potatoes before inserting. Doing so will allow the moisture from the potatoes' juices to soften the material inside your shoes, which will make it easier to stretch. Leave the potatoes in your shoes overnight or for at least eight hours in order for the shoes to remain enlarged once the potatoes are removed. Make sure to wipe clean out your shoes afterwards to get rid of the potato residue."
                },
                {
                    "headline": "Rough up the bottoms of your heels.",
                    "description": "It's important that your shoes have a decent amount of traction on the bottom. Walking in high heels will be a lot easier and safer if you're not sliding around all over the place. New heels tend to have smoother bottoms that become rougher once scuffed. Speed up the process by roughing up the bottom of your heels using a piece of sandpaper. Rub the bottom of your heels for a minute or two, or until the bottoms feel noticeably rougher."
                },
                {
                    "headline": "Wet the insides of your high heel shoes to stretch them.",
                    "description": "Water can speed up the breaking in process by helping to mold the inside material of your shoes to your feet. Take a damp cloth and rub the insides of your high heels. Put them on while they're still moist and wear them for an hour or more. You can also dampen a pair of socks and wear them with your high heels for the same amount of time."
                },
                {
                    "headline": "Freeze a bag of water inside your shoes.",
                    "description": "Water expands when it freezes, making it a perfect method you can use to break in your high heels. You'll need a one-quart sized freezer bag. If you have smaller freezer bags available that's okay to use as well. Fill the freezer bag half way with water. Squeeze the air out of the bag and close it up. Toss the bag lightly in your hands to make sure it's closed all the way and that there are no leaks in the bag. Gently stuff the bag inside the shoe until it fills all of the empty space down to the toe. You may need more than one bag of water depending on the size of your shoe. Be sure to tuck the bag in places where the shoes feel too tight on your feet. Put the shoes into the freezer, and keep them there until the water freezes completely. Once the water is frozen, you can remove the bags and try on your shoes, which should now be stretched. Repeat the process if they still feel too tight."
                },
                {
                    "headline": "Cover the parts of your feet that are being pinched by your heels with moleskin, soak your feet in water, and then wear your heels for a few hours.",
                    "description": "Moleskin is basically a more comfortable bandage that comes in sheets that you can cut into any size. One side is sticky and one side is soft. It protects the areas of your feet that hurt when wearing your heels, which is typically where blisters might form. Dampening the moleskin and then wearing your shoes will help the insides of your shoes to mold more quickly to the shape of your foot. Cut pieces of moleskin large enough to cover the areas of your feet that hurt when wearing your new high heel shoes. Adhere the moleskin to your skin, like you would a bandage. Then to get maximum comfort, soak your feet in warm water for a few minutes while wearing the moleskin. The moleskin will expand. The extra padding will give your feet additional protection. And because the moleskin is damp, it will help to soften the material inside your shoes, making it more pliable and able to conform to the shape of your feet."
                },
                {
                    "headline": "Use shoe stretching supplies.",
                    "description": "If breaking in your heels is a battle you constantly find yourself fighting, you may want to invest in shoe stretching spray and a heel stretcher. You simply spray the insides of your shoes, and then insert the heel stretcher in your shoes overnight. You should be good to go in the morning."
                },
                {
                    "headline": "Use a shoe stretching machine.",
                    "description": "If trying to break in your high heel shoes doesn't seem to be working. Or if you simply don't have the time try various DIY methods, stop by a shoe repair shop for a quick fix. Shoe repair shops have machines specifically built to stretch your shoes. The machine applies the same techniques as common home remedies –pressure and heat –to stretch your shoe quickly."
                }
            ]
        }
    ],
    "tyn": [
        "High heels shoes",
        "Socks",
        "Blow dryer or small heater",
        "Shoe paper and shoe rods",
        "Rags or washcloths",
        "Sandpaper",
        "Moleskin",
        "Water",
        "Plastic freezer bags",
        "Two potatoes",
        "Handful of silica gel packets",
        "Shoe stretching spray",
        "Heel stretcher"
    ],
    "text": " Breaking in High Heel Shoes Gradually Wear them throughout the day. The first step to breaking in a new pair of high heel shoes is simply to wear them often. The more often you wear your heels, the more of an opportunity your heels have to stretch and conform to your feet. To avoid the awkwardness and potential danger of wearing new high heel shoes while out and about, start by wearing your shoes at home. You can wear them while watching television or folding laundry. You can wear them while cooking dinner. You can also take your heels with you to work. If have an office job, wear your shoes at your desk for a couple of hours. Once you feel comfortable wearing and walking short distances in your heels, take them out. Wear them on a short trip to the grocery store or to your local bank. Wear your heels with socks. Although this is considered a fashion faux pas, wearing socks with your new heels will help to break them in. You don't have to wear them while you're out and about, unless, of course, you actually like the look of it. You can wear them while you're hanging out at home, or while you're sitting at your desk at work. In order for your socks to stretch your shoes properly, they can't be too thin (they won't work) and they can't be too thick (they'll stretch your shoes too much and cause your feet to slip out when you are wearing your heels skin-to-shoe). A regular, everyday sock will do just fine. Do this for a few days and you'll notice that you are blister-free and your shoes are broken in, having molded to the shape of your foot. Bend and twist them. You can work out the stiffness of your new heels by bending and twisting them. Apply slight pressure as you bend the shoes upwards and downwards and twist them side to side. Don't do either method too hard or too quickly. You don't want to force the shoe into a position that it shouldn't be making. Doing so could damage the shoe or weaken it in places that should remain sturdy. Blast your heels with heat. Heat is an effective way to soften a material and make it more pliable. Carefully warm your heels using a blow dryer or a small heater for about a minute or two. Watch how your heels react to the heat because certain materials don't do so well under heat for long periods of time. You can bend and twist your heels while they're still warm. Or you can wait until they've cooled and put them on with a pair of socks to stretch them. Always keep your heels stuffed. Naturally your heels with shrink when they're not being worn. Since you don't want all of your breaking in efforts be in vain, keep them stuffed when you're not wearing them. You can stuff your shoes with the shoe paper and rod that come with the shoes when you buy them. You can keep them filled with shoe trees, which are inserts molded into the shape of the inside of your high heel shoes. Or you can simply stuff them with rags. Keep silica gel packets in your shoes when they're not being worn. Have you noticed after purchasing a pair of new shoes those little white packets containing tiny clear balls inside your shoe box? Those packets contain silica gel which absorb moisture and keep your shoes from shrinking. Hold on to those packets instead of throwing them away and stick them in your shoes when you're not wearing them. You can ask a shoe store associate for extras, if necessary. Using Quick Fixes to Break in High Heel Shoes Stick a peeled potato in your shoes. This may seem unusual and a little icky, but it can help stretch out your heels quickly. You'll need to select two potatoes large enough puff up your shoes once inserted. Peel the potatoes before inserting. Doing so will allow the moisture from the potatoes' juices to soften the material inside your shoes, which will make it easier to stretch. Leave the potatoes in your shoes overnight or for at least eight hours in order for the shoes to remain enlarged once the potatoes are removed. Make sure to wipe clean out your shoes afterwards to get rid of the potato residue. Rough up the bottoms of your heels. It's important that your shoes have a decent amount of traction on the bottom. Walking in high heels will be a lot easier and safer if you're not sliding around all over the place. New heels tend to have smoother bottoms that become rougher once scuffed. Speed up the process by roughing up the bottom of your heels using a piece of sandpaper. Rub the bottom of your heels for a minute or two, or until the bottoms feel noticeably rougher. Wet the insides of your high heel shoes to stretch them. Water can speed up the breaking in process by helping to mold the inside material of your shoes to your feet. Take a damp cloth and rub the insides of your high heels. Put them on while they're still moist and wear them for an hour or more. You can also dampen a pair of socks and wear them with your high heels for the same amount of time. Freeze a bag of water inside your shoes. Water expands when it freezes, making it a perfect method you can use to break in your high heels. You'll need a one-quart sized freezer bag. If you have smaller freezer bags available that's okay to use as well. Fill the freezer bag half way with water. Squeeze the air out of the bag and close it up. Toss the bag lightly in your hands to make sure it's closed all the way and that there are no leaks in the bag. Gently stuff the bag inside the shoe until it fills all of the empty space down to the toe. You may need more than one bag of water depending on the size of your shoe. Be sure to tuck the bag in places where the shoes feel too tight on your feet. Put the shoes into the freezer, and keep them there until the water freezes completely. Once the water is frozen, you can remove the bags and try on your shoes, which should now be stretched. Repeat the process if they still feel too tight. Cover the parts of your feet that are being pinched by your heels with moleskin, soak your feet in water, and then wear your heels for a few hours. Moleskin is basically a more comfortable bandage that comes in sheets that you can cut into any size. One side is sticky and one side is soft. It protects the areas of your feet that hurt when wearing your heels, which is typically where blisters might form. Dampening the moleskin and then wearing your shoes will help the insides of your shoes to mold more quickly to the shape of your foot. Cut pieces of moleskin large enough to cover the areas of your feet that hurt when wearing your new high heel shoes. Adhere the moleskin to your skin, like you would a bandage. Then to get maximum comfort, soak your feet in warm water for a few minutes while wearing the moleskin. The moleskin will expand. The extra padding will give your feet additional protection. And because the moleskin is damp, it will help to soften the material inside your shoes, making it more pliable and able to conform to the shape of your feet. Use shoe stretching supplies. If breaking in your heels is a battle you constantly find yourself fighting, you may want to invest in shoe stretching spray and a heel stretcher. You simply spray the insides of your shoes, and then insert the heel stretcher in your shoes overnight. You should be good to go in the morning. Use a shoe stretching machine. If trying to break in your high heel shoes doesn't seem to be working. Or if you simply don't have the time try various DIY methods, stop by a shoe repair shop for a quick fix. Shoe repair shops have machines specifically built to stretch your shoes. The machine applies the same techniques as common home remedies –pressure and heat –to stretch your shoe quickly.",
    "sentences": [
        " Breaking in High Heel Shoes Gradually Wear them throughout the day.",
        "The first step to breaking in a new pair of high heel shoes is simply to wear them often.",
        "The more often you wear your heels, the more of an opportunity your heels have to stretch and conform to your feet.",
        "To avoid the awkwardness and potential danger of wearing new high heel shoes while out and about, start by wearing your shoes at home.",
        "You can wear them while watching television or folding laundry.",
        "You can wear them while cooking dinner.",
        "You can also take your heels with you to work.",
        "If have an office job, wear your shoes at your desk for a couple of hours.",
        "Once you feel comfortable wearing and walking short distances in your heels, take them out.",
        "Wear them on a short trip to the grocery store or to your local bank.",
        "Wear your heels with socks.",
        "Although this is considered a fashion faux pas, wearing socks with your new heels will help to break them in.",
        "You don't have to wear them while you're out and about, unless, of course, you actually like the look of it.",
        "You can wear them while you're hanging out at home, or while you're sitting at your desk at work.",
        "In order for your socks to stretch your shoes properly, they can't be too thin (they won't work) and they can't be too thick (they'll stretch your shoes too much and cause your feet to slip out when you are wearing your heels skin-to-shoe).",
        "A regular, everyday sock will do just fine.",
        "Do this for a few days and you'll notice that you are blister-free and your shoes are broken in, having molded to the shape of your foot.",
        "Bend and twist them.",
        "You can work out the stiffness of your new heels by bending and twisting them.",
        "Apply slight pressure as you bend the shoes upwards and downwards and twist them side to side.",
        "Don't do either method too hard or too quickly.",
        "You don't want to force the shoe into a position that it shouldn't be making.",
        "Doing so could damage the shoe or weaken it in places that should remain sturdy.",
        "Blast your heels with heat.",
        "Heat is an effective way to soften a material and make it more pliable.",
        "Carefully warm your heels using a blow dryer or a small heater for about a minute or two.",
        "Watch how your heels react to the heat because certain materials don't do so well under heat for long periods of time.",
        "You can bend and twist your heels while they're still warm.",
        "Or you can wait until they've cooled and put them on with a pair of socks to stretch them.",
        "Always keep your heels stuffed.",
        "Naturally your heels with shrink when they're not being worn.",
        "Since you don't want all of your breaking in efforts be in vain, keep them stuffed when you're not wearing them.",
        "You can stuff your shoes with the shoe paper and rod that come with the shoes when you buy them.",
        "You can keep them filled with shoe trees, which are inserts molded into the shape of the inside of your high heel shoes.",
        "Or you can simply stuff them with rags.",
        "Keep silica gel packets in your shoes when they're not being worn.",
        "Have you noticed after purchasing a pair of new shoes those little white packets containing tiny clear balls inside your shoe box?",
        "Those packets contain silica gel which absorb moisture and keep your shoes from shrinking.",
        "Hold on to those packets instead of throwing them away and stick them in your shoes when you're not wearing them.",
        "You can ask a shoe store associate for extras, if necessary.",
        "Using Quick Fixes to Break in High Heel Shoes Stick a peeled potato in your shoes.",
        "This may seem unusual and a little icky, but it can help stretch out your heels quickly.",
        "You'll need to select two potatoes large enough puff up your shoes once inserted.",
        "Peel the potatoes before inserting.",
        "Doing so will allow the moisture from the potatoes' juices to soften the material inside your shoes, which will make it easier to stretch.",
        "Leave the potatoes in your shoes overnight or for at least eight hours in order for the shoes to remain enlarged once the potatoes are removed.",
        "Make sure to wipe clean out your shoes afterwards to get rid of the potato residue.",
        "Rough up the bottoms of your heels.",
        "It's important that your shoes have a decent amount of traction on the bottom.",
        "Walking in high heels will be a lot easier and safer if you're not sliding around all over the place.",
        "New heels tend to have smoother bottoms that become rougher once scuffed.",
        "Speed up the process by roughing up the bottom of your heels using a piece of sandpaper.",
        "Rub the bottom of your heels for a minute or two, or until the bottoms feel noticeably rougher.",
        "Wet the insides of your high heel shoes to stretch them.",
        "Water can speed up the breaking in process by helping to mold the inside material of your shoes to your feet.",
        "Take a damp cloth and rub the insides of your high heels.",
        "Put them on while they're still moist and wear them for an hour or more.",
        "You can also dampen a pair of socks and wear them with your high heels for the same amount of time.",
        "Freeze a bag of water inside your shoes.",
        "Water expands when it freezes, making it a perfect method you can use to break in your high heels.",
        "You'll need a one-quart sized freezer bag.",
        "If you have smaller freezer bags available that's okay to use as well.",
        "Fill the freezer bag half way with water.",
        "Squeeze the air out of the bag and close it up.",
        "Toss the bag lightly in your hands to make sure it's closed all the way and that there are no leaks in the bag.",
        "Gently stuff the bag inside the shoe until it fills all of the empty space down to the toe.",
        "You may need more than one bag of water depending on the size of your shoe.",
        "Be sure to tuck the bag in places where the shoes feel too tight on your feet.",
        "Put the shoes into the freezer, and keep them there until the water freezes completely.",
        "Once the water is frozen, you can remove the bags and try on your shoes, which should now be stretched.",
        "Repeat the process if they still feel too tight.",
        "Cover the parts of your feet that are being pinched by your heels with moleskin, soak your feet in water, and then wear your heels for a few hours.",
        "Moleskin is basically a more comfortable bandage that comes in sheets that you can cut into any size.",
        "One side is sticky and one side is soft.",
        "It protects the areas of your feet that hurt when wearing your heels, which is typically where blisters might form.",
        "Dampening the moleskin and then wearing your shoes will help the insides of your shoes to mold more quickly to the shape of your foot.",
        "Cut pieces of moleskin large enough to cover the areas of your feet that hurt when wearing your new high heel shoes.",
        "Adhere the moleskin to your skin, like you would a bandage.",
        "Then to get maximum comfort, soak your feet in warm water for a few minutes while wearing the moleskin.",
        "The moleskin will expand.",
        "The extra padding will give your feet additional protection.",
        "And because the moleskin is damp, it will help to soften the material inside your shoes, making it more pliable and able to conform to the shape of your feet.",
        "Use shoe stretching supplies.",
        "If breaking in your heels is a battle you constantly find yourself fighting, you may want to invest in shoe stretching spray and a heel stretcher.",
        "You simply spray the insides of your shoes, and then insert the heel stretcher in your shoes overnight.",
        "You should be good to go in the morning.",
        "Use a shoe stretching machine.",
        "If trying to break in your high heel shoes doesn't seem to be working.",
        "Or if you simply don't have the time try various DIY methods, stop by a shoe repair shop for a quick fix.",
        "Shoe repair shops have machines specifically built to stretch your shoes.",
        "The machine applies the same techniques as common home remedies –pressure and heat –to stretch your shoe quickly."
    ]
}