{
    "title": "How to Make Broccoli Grape Salad",
    "url": "https://www.wikihow.com/Make-Broccoli-Grape-Salad",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Salads"
    ],
    "methods": [
        {
            "name": "Making Your Salad with Crumbled Bacon",
            "steps": [
                {
                    "headline": "Cook your bacon.",
                    "description": "Lay all your strips of bacon in a large skillet on the stovetop. Turn the burner to medium-high. Flip the strips over every now and then once they begin to sizzle. Cook for roughly 10 minutes, or until both sides have browned evenly."
                },
                {
                    "headline": "Drain and divide your bacon.",
                    "description": "First, remove the strips from the skillet and lay them out on paper towels. Let the towels absorb the grease. If necessary, transfer your bacon to new sheets of towels if the first batch soaks through. Once they’re drained, set one strip aside from the others."
                },
                {
                    "headline": "Make your dry topping.",
                    "description": "Take the other seven strips and crumble them into bits. Place them into a sealable food storage bag. Add your sunflower seeds, then shake or flip your bag to mix the two ingredients until they appear evenly mixed. Set aside."
                },
                {
                    "headline": "Prep and mix your fruit and veggies.",
                    "description": "First, chop your head of lettuce into bite-size pieces. Next, dice your red onions. Finally, cut each grape in half. Transfer them to a large mixing bowl as you finish prepping each one, then stir to mix."
                },
                {
                    "headline": "Make your dressing.",
                    "description": "Take your last remaining bacon slice and crumble it up as you did with the others. Add your mayo, apple cider vinegar, sugar, and black pepper to a second mixing bowl. Whisk to combine. Then fold in your bacon crumbles."
                },
                {
                    "headline": "Dress and chill.",
                    "description": "Pour your dressing over the grapes and veggies. Toss your salad so the dressing distributes evenly. Seal the bowl with its lid, plastic wrap, or aluminum foil. Place the bowl in the refrigerator and chill for approximately two hours so the flavors wed."
                },
                {
                    "headline": "Add dry topping and serve.",
                    "description": "Once the salad is done chilling, remove it from the fridge and unseal the bowl. Top it with your dry bacon-seed and stir to mix. Serve immediately before the dry mix grows soggy from the dressing."
                }
            ]
        },
        {
            "name": "Beefing Your Salad Up with Pasta and Pecans",
            "steps": [
                {
                    "headline": "Bake your pecans.",
                    "description": "Set your oven to 350 degrees Fahrenheit (177 degrees Celsius) and let it preheat. Add your pecans to a shallow baking and spread them out so none are resting on top of the others. Once the oven’s ready, place the pan inside and cook for about 3 to 4 minutes. Remove the pan from heat, stir them up, and cook for another 2 to 3 minutes, or until they appear lightly toasted."
                },
                {
                    "headline": "Cook your bacon.",
                    "description": "Lay your strips in a large skillet and cook over medium-high heat. Begin flipping them over every so often once they start sizzling. Cook until all sides appear evenly browned (approximately 10 minutes). Once cooked, transfer them to paper towels to absorb the excess grease."
                },
                {
                    "headline": "Make your pasta.",
                    "description": "Refer to your pasta’s directions for precise water measurements and cooking times. Add the recommended amount of water to a large pot and bring it to a boil on the stovetop. Add the pasta and cook for the time specified in the directions, or to your liking. Drain the pasta in a strainer, then set aside."
                },
                {
                    "headline": "Cut your fruit and veggies.",
                    "description": "Chop your broccoli into small bite-size pieces. Dice your onion. Slice each grape in half."
                },
                {
                    "headline": "Make and chill your salad.",
                    "description": "First, add your mayo, sugar, onion, red wine vinegar, and salt to a large mixing bowl. Whisk to combine. Transfer your broccoli, pasta, and grapes to the bowl and stir to combine. Seal the bowl and refrigerate for about 3 hours."
                },
                {
                    "headline": "Add toppings and serve.",
                    "description": "Remove and unseal your salad. Crumble your bacon up and sprinkle it into the bowl. Add your pecans and stir the dry ingredients into your salad. Then serve and enjoy."
                }
            ]
        },
        {
            "name": "Whipping Up a Simple Salad with Cucumber",
            "steps": [
                {
                    "headline": "Prep your fruit and veggies.",
                    "description": "Chop your broccoli up into bite-size bits. Dice your onion, then your cucumber. Cut your grapes in half."
                },
                {
                    "headline": "Mix with your seeds.",
                    "description": "Once you’re done prepping those ingredients, transfer them to a medium-size mixing bowl. Add the sunflower seeds. Stir to combine."
                },
                {
                    "headline": "Make your dressing, mix, and serve.",
                    "description": "In a second mixing bowl, stir together your mayo, lemon juice, salt, and pepper. Pour this over your salad and stir to combine. Then serve and dig in."
                }
            ]
        }
    ],
    "tyn": [
        "Crumbled Bacon Recipe",
        "Measuring cups and spoons",
        "Large skillet",
        "Stove",
        "Paper towels",
        "Food storage bag",
        "Cutting board",
        "Knife",
        "2 mixing bowls",
        "Whisk",
        "Spoons for stirring and tossing",
        "Mixing bowl lid, plastic wrap, or foil",
        "Refrigerator",
        "Pasta & Pecan Recipe",
        "Oven",
        "Shallow baking pan",
        "Skillet",
        "Large pot",
        "Strainer",
        "Mixing bowl",
        "Lid, plastic wrap, or foil",
        "Spoon for stirring",
        "Simple Cucumber Recipe",
        "Mixing bowls",
        "Spoon for stirring."
    ],
    "text": " Making Your Salad with Crumbled Bacon Cook your bacon. Lay all your strips of bacon in a large skillet on the stovetop. Turn the burner to medium-high. Flip the strips over every now and then once they begin to sizzle. Cook for roughly 10 minutes, or until both sides have browned evenly. Drain and divide your bacon. First, remove the strips from the skillet and lay them out on paper towels. Let the towels absorb the grease. If necessary, transfer your bacon to new sheets of towels if the first batch soaks through. Once they’re drained, set one strip aside from the others. Make your dry topping. Take the other seven strips and crumble them into bits. Place them into a sealable food storage bag. Add your sunflower seeds, then shake or flip your bag to mix the two ingredients until they appear evenly mixed. Set aside. Prep and mix your fruit and veggies. First, chop your head of lettuce into bite-size pieces. Next, dice your red onions. Finally, cut each grape in half. Transfer them to a large mixing bowl as you finish prepping each one, then stir to mix. Make your dressing. Take your last remaining bacon slice and crumble it up as you did with the others. Add your mayo, apple cider vinegar, sugar, and black pepper to a second mixing bowl. Whisk to combine. Then fold in your bacon crumbles. Dress and chill. Pour your dressing over the grapes and veggies. Toss your salad so the dressing distributes evenly. Seal the bowl with its lid, plastic wrap, or aluminum foil. Place the bowl in the refrigerator and chill for approximately two hours so the flavors wed. Add dry topping and serve. Once the salad is done chilling, remove it from the fridge and unseal the bowl. Top it with your dry bacon-seed and stir to mix. Serve immediately before the dry mix grows soggy from the dressing. Beefing Your Salad Up with Pasta and Pecans Bake your pecans. Set your oven to 350 degrees Fahrenheit (177 degrees Celsius) and let it preheat. Add your pecans to a shallow baking and spread them out so none are resting on top of the others. Once the oven’s ready, place the pan inside and cook for about 3 to 4 minutes. Remove the pan from heat, stir them up, and cook for another 2 to 3 minutes, or until they appear lightly toasted. Cook your bacon. Lay your strips in a large skillet and cook over medium-high heat. Begin flipping them over every so often once they start sizzling. Cook until all sides appear evenly browned (approximately 10 minutes). Once cooked, transfer them to paper towels to absorb the excess grease. Make your pasta. Refer to your pasta’s directions for precise water measurements and cooking times. Add the recommended amount of water to a large pot and bring it to a boil on the stovetop. Add the pasta and cook for the time specified in the directions, or to your liking. Drain the pasta in a strainer, then set aside. Cut your fruit and veggies. Chop your broccoli into small bite-size pieces. Dice your onion. Slice each grape in half. Make and chill your salad. First, add your mayo, sugar, onion, red wine vinegar, and salt to a large mixing bowl. Whisk to combine. Transfer your broccoli, pasta, and grapes to the bowl and stir to combine. Seal the bowl and refrigerate for about 3 hours. Add toppings and serve. Remove and unseal your salad. Crumble your bacon up and sprinkle it into the bowl. Add your pecans and stir the dry ingredients into your salad. Then serve and enjoy. Whipping Up a Simple Salad with Cucumber Prep your fruit and veggies. Chop your broccoli up into bite-size bits. Dice your onion, then your cucumber. Cut your grapes in half. Mix with your seeds. Once you’re done prepping those ingredients, transfer them to a medium-size mixing bowl. Add the sunflower seeds. Stir to combine. Make your dressing, mix, and serve. In a second mixing bowl, stir together your mayo, lemon juice, salt, and pepper. Pour this over your salad and stir to combine. Then serve and dig in.",
    "sentences": [
        " Making Your Salad with Crumbled Bacon Cook your bacon.",
        "Lay all your strips of bacon in a large skillet on the stovetop.",
        "Turn the burner to medium-high.",
        "Flip the strips over every now and then once they begin to sizzle.",
        "Cook for roughly 10 minutes, or until both sides have browned evenly.",
        "Drain and divide your bacon.",
        "First, remove the strips from the skillet and lay them out on paper towels.",
        "Let the towels absorb the grease.",
        "If necessary, transfer your bacon to new sheets of towels if the first batch soaks through.",
        "Once they’re drained, set one strip aside from the others.",
        "Make your dry topping.",
        "Take the other seven strips and crumble them into bits.",
        "Place them into a sealable food storage bag.",
        "Add your sunflower seeds, then shake or flip your bag to mix the two ingredients until they appear evenly mixed.",
        "Set aside.",
        "Prep and mix your fruit and veggies.",
        "First, chop your head of lettuce into bite-size pieces.",
        "Next, dice your red onions.",
        "Finally, cut each grape in half.",
        "Transfer them to a large mixing bowl as you finish prepping each one, then stir to mix.",
        "Make your dressing.",
        "Take your last remaining bacon slice and crumble it up as you did with the others.",
        "Add your mayo, apple cider vinegar, sugar, and black pepper to a second mixing bowl.",
        "Whisk to combine.",
        "Then fold in your bacon crumbles.",
        "Dress and chill.",
        "Pour your dressing over the grapes and veggies.",
        "Toss your salad so the dressing distributes evenly.",
        "Seal the bowl with its lid, plastic wrap, or aluminum foil.",
        "Place the bowl in the refrigerator and chill for approximately two hours so the flavors wed. Add dry topping and serve.",
        "Once the salad is done chilling, remove it from the fridge and unseal the bowl.",
        "Top it with your dry bacon-seed and stir to mix.",
        "Serve immediately before the dry mix grows soggy from the dressing.",
        "Beefing Your Salad Up with Pasta and Pecans Bake your pecans.",
        "Set your oven to 350 degrees Fahrenheit (177 degrees Celsius) and let it preheat.",
        "Add your pecans to a shallow baking and spread them out so none are resting on top of the others.",
        "Once the oven’s ready, place the pan inside and cook for about 3 to 4 minutes.",
        "Remove the pan from heat, stir them up, and cook for another 2 to 3 minutes, or until they appear lightly toasted.",
        "Cook your bacon.",
        "Lay your strips in a large skillet and cook over medium-high heat.",
        "Begin flipping them over every so often once they start sizzling.",
        "Cook until all sides appear evenly browned (approximately 10 minutes).",
        "Once cooked, transfer them to paper towels to absorb the excess grease.",
        "Make your pasta.",
        "Refer to your pasta’s directions for precise water measurements and cooking times.",
        "Add the recommended amount of water to a large pot and bring it to a boil on the stovetop.",
        "Add the pasta and cook for the time specified in the directions, or to your liking.",
        "Drain the pasta in a strainer, then set aside.",
        "Cut your fruit and veggies.",
        "Chop your broccoli into small bite-size pieces.",
        "Dice your onion.",
        "Slice each grape in half.",
        "Make and chill your salad.",
        "First, add your mayo, sugar, onion, red wine vinegar, and salt to a large mixing bowl.",
        "Whisk to combine.",
        "Transfer your broccoli, pasta, and grapes to the bowl and stir to combine.",
        "Seal the bowl and refrigerate for about 3 hours.",
        "Add toppings and serve.",
        "Remove and unseal your salad.",
        "Crumble your bacon up and sprinkle it into the bowl.",
        "Add your pecans and stir the dry ingredients into your salad.",
        "Then serve and enjoy.",
        "Whipping Up a Simple Salad with Cucumber Prep your fruit and veggies.",
        "Chop your broccoli up into bite-size bits.",
        "Dice your onion, then your cucumber.",
        "Cut your grapes in half.",
        "Mix with your seeds.",
        "Once you’re done prepping those ingredients, transfer them to a medium-size mixing bowl.",
        "Add the sunflower seeds.",
        "Stir to combine.",
        "Make your dressing, mix, and serve.",
        "In a second mixing bowl, stir together your mayo, lemon juice, salt, and pepper.",
        "Pour this over your salad and stir to combine.",
        "Then serve and dig in."
    ]
}