{
    "title": "How to Make Marshmallow Buttercream Frosting",
    "url": "https://www.wikihow.com/Make-Marshmallow-Buttercream-Frosting",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking"
    ],
    "methods": [
        {
            "name": "Creating Homemade Marshmallow Fluff",
            "steps": [
                {
                    "headline": "Heat the water, sugar, and corn syrup.",
                    "description": "Add ¼ cup (59 ml) plus 2 tablespoons (30 ml) of water, ¾ cup (150 g) granulated sugar, and ¾ cup (225 g) of light corn syrup to a medium saucepan. Warm the mixture over medium-high heat until a candy thermometer reads 240 degrees Fahrenheit (116 degrees Celsius), which should take 10 to 15 minutes. If you don’t have a candy thermometer, fill a bowl with ice cold water. Drop some of the corn syrup mixture into the water. The mixture should easily form a soft, flexible ball in the water when it reaches the right temperature. If it forms thin threads instead, it isn’t hot enough yet. If it forms a hard ball, you’ve cooked it too long."
                },
                {
                    "headline": "Beat the egg whites until foamy.",
                    "description": "While the corn syrup mixture is heating, add the whites from 3 large eggs to the bowl of a stand mixer with a whisk attachment inserted. Whip the eggs whites on medium until they become foamy. To separate the egg whites from the yolks, crack the eggs against a flat surface, such as a counter or tabletop. Divide the eggs in two over a bowl, and let the yolks to fall into the lower half. Move the yolks back and forth between the halves, allowing the white to drip out into the bowl. Continue moving the yolks until all of the whites have dripped out. Save the yolks for another recipe. If you don’t have a stand mixer, you can use an electric hand mixer instead."
                },
                {
                    "headline": "Mix the cream of tartar and salt into the egg whites until peaks form.",
                    "description": "Once the whites are foamy, turn the mixer’s speed up to high. Add ½ teaspoon (2 g) of cream of tartar and a pinch of salt, and continue whipping until the mixture forms soft peaks, which typically takes 1 to 2 minutes. You want the egg white mixture to reach the right consistency just as the corn syrup mixture is finished heating. If the egg whites are coming along more quickly than the corn syrup, it’s okay to stop mixing them and wait for the corn syrup to reach the proper temperature."
                },
                {
                    "headline": "Remove the sugar mixture from the heat and allow it to rest.",
                    "description": "When the corn syrup mixture has reached 240 degrees Fahrenheit (116 degrees Celsius), remove the pan from the heat. Let the mixture rest for approximately 20 seconds so it cools slightly. Don’t allow the corn syrup mixture to cool any longer than 20 seconds. It may become too thick to incorporate into the egg white mixture."
                },
                {
                    "headline": "Add the sugar mixture to the egg whites.",
                    "description": "Turn your mixer on to high, and slowly pour the corn syrup mixture into the egg whites. The mixer bowl may get warm, but continue mixing the ingredients for 7 to 8 minutes, or until the outside of the bowl returns to room temperature again. Try not to pour the corn syrup mixture so it hits the whisk. Instead, aim for the side of the mixer bowl."
                },
                {
                    "headline": "Stir in the vanilla.",
                    "description": "When you’re finished mixing the corn syrup mixture into the egg whites, add 1 ½ teaspoons (7 ½ ml) of vanilla extract to the bowl. Continue blending the mixture until medium-stiff peaks form, which should take 1 to 2 minutes. The recipe makes 2 to 3 cups (200 to 300 g) of marshmallow fluff. You only need 2 cups (200 g) for the buttercream frosting, so store the leftover fluff in an airtight container in the refrigerator. It should keep for up to 2 weeks."
                }
            ]
        },
        {
            "name": "Whipping Up Marshmallow Buttercream",
            "steps": [
                {
                    "headline": "Beat the butter until smooth.",
                    "description": "Add 2 sticks (227 g) of unsalted butter that have been softened to room temperature to the bowl of a stand mixer with the paddle attachment inserted. Cream the butter on medium-high speed until it is light, fluffy, and smooth, which should take approximately 1 to 2 minutes. You can use an electric hand mixer to make the buttercream frosting if you prefer."
                },
                {
                    "headline": "Add marshmallow fluff and powdered sugar in intervals.",
                    "description": "Once the butter is light and fluffy, turn the mixer off and begin to add 2 cups (200 g) of marshmallow fluff and 1 ½ cups (188 g) of powdered sugar in ½ cup (50 g for the marshmallow fluff and 63 g for the sugar) increments. Mix on medium after each addition until all of the marshmallow fluff and powdered sugar are incorporated. Scrape down the sides of the bowl with a spatula as you’re mixing the frosting to ensure that all of the ingredients are fully combined."
                },
                {
                    "headline": "Mix in the salt and beat until combined.",
                    "description": "When the marshmallow fluff and powdered sugar are fully incorporated, add a pinch of kosher salt to the bowl. Beat the mixture on medium to incorporate the salt and create a light, fluffy frosting, which should take 1 to 2 minutes. You can use the buttercream to frost cupcakes, cakes, cookies, or your favorite baked goods. It’s a particularly tasty topping for chocolate-based sweets. Store any leftover frosting in an airtight container in the refrigerator."
                }
            ]
        },
        {
            "name": "Mixing Up Toasted Marshmallow Buttercream",
            "steps": [
                {
                    "headline": "Cream the butter.",
                    "description": "Add 1 cup (227 g) of butter that’s been softened to room temperature to the bowl of a stand mixer with the paddle attachment inserted. Beat the butter on medium-high until it is smooth and creamy, which should take 1 to 2 minutes. You can use an electric hand mixer to make the buttercream frosting if you prefer."
                },
                {
                    "headline": "Stir in the powdered sugar.",
                    "description": "When the butter is creamed, gradually add 4 cups (500 g) of powdered sugar to the butter. Continue mixing until the sugar is fully incorporated, which should take approximately 2 minutes. You may want to add the powdered sugar in increments and mix after each addition. That often makes it easier to blend it into the butter. Scrape down the sides of the bowl as you’re mixing to ensure that all of the powdered sugar is incorporated."
                },
                {
                    "headline": "Mix in the milk.",
                    "description": "Once the butter and powdered sugar are fully blended, add 2 tablespoons (30 ml) of milk to the bowl. Continue blending the mixture until it is completely smooth, which should take approximately 30 seconds to 1 minutes. For the richest buttercream frosting, use whole milk."
                },
                {
                    "headline": "Place the marshmallows on a lined baking sheet.",
                    "description": "When you’ve finished blending the butter mixture, line a large baking sheet with a piece of parchment paper. Spread a 10 ounce (284 g) bag of mini marshmallows over the baking sheet in a single, even layer. You can substitute a silicone baking mat for the parchment paper if you prefer."
                },
                {
                    "headline": "Broil the marshmallows until browned.",
                    "description": "Place the baking sheet with marshmallows under your oven’s broiler. Allow them to heat until they are puffed and brown, which should take approximately 45 seconds. Keep a close eye on the marshmallows because they can burn quickly."
                },
                {
                    "headline": "Combine the toasted marshmallows with the butter mixture.",
                    "description": "When the marshmallows are toasted, remove them from the oven and immediately add them to the butter mixture. Beat the frosting on medium until it is smooth. The marshmallows will melt into the frosting as you beat it, but you’ll still see little brown, toasted bits in the finished product."
                },
                {
                    "headline": "Allow the frosting to cool completely before using it.",
                    "description": "The frosting will be warm after mixing the marshmallows into it because they’ve been toasted. Let the frosting cool completely before spreading or piping it on your cake, cupcakes, or other baked goods. It’s best to use all of the frosting up right after you make it. Refrigerating it can cause the marshmallows to harden, so the frosting’s texture may change."
                }
            ]
        }
    ],
    "tyn": [
        "Homemade Marshmallow Fluff",
        "Medium saucepan",
        "Candy thermometer",
        "Stand mixer",
        "Marshmallow Buttercream",
        "Rubber spatula",
        "Toasted Marshmallow Buttercream",
        "Baking sheet",
        "Parchment paper"
    ],
    "text": " Creating Homemade Marshmallow Fluff Heat the water, sugar, and corn syrup. Add ¼ cup (59 ml) plus 2 tablespoons (30 ml) of water, ¾ cup (150 g) granulated sugar, and ¾ cup (225 g) of light corn syrup to a medium saucepan. Warm the mixture over medium-high heat until a candy thermometer reads 240 degrees Fahrenheit (116 degrees Celsius), which should take 10 to 15 minutes. If you don’t have a candy thermometer, fill a bowl with ice cold water. Drop some of the corn syrup mixture into the water. The mixture should easily form a soft, flexible ball in the water when it reaches the right temperature. If it forms thin threads instead, it isn’t hot enough yet. If it forms a hard ball, you’ve cooked it too long. Beat the egg whites until foamy. While the corn syrup mixture is heating, add the whites from 3 large eggs to the bowl of a stand mixer with a whisk attachment inserted. Whip the eggs whites on medium until they become foamy. To separate the egg whites from the yolks, crack the eggs against a flat surface, such as a counter or tabletop. Divide the eggs in two over a bowl, and let the yolks to fall into the lower half. Move the yolks back and forth between the halves, allowing the white to drip out into the bowl. Continue moving the yolks until all of the whites have dripped out. Save the yolks for another recipe. If you don’t have a stand mixer, you can use an electric hand mixer instead. Mix the cream of tartar and salt into the egg whites until peaks form. Once the whites are foamy, turn the mixer’s speed up to high. Add ½ teaspoon (2 g) of cream of tartar and a pinch of salt, and continue whipping until the mixture forms soft peaks, which typically takes 1 to 2 minutes. You want the egg white mixture to reach the right consistency just as the corn syrup mixture is finished heating. If the egg whites are coming along more quickly than the corn syrup, it’s okay to stop mixing them and wait for the corn syrup to reach the proper temperature. Remove the sugar mixture from the heat and allow it to rest. When the corn syrup mixture has reached 240 degrees Fahrenheit (116 degrees Celsius), remove the pan from the heat. Let the mixture rest for approximately 20 seconds so it cools slightly. Don’t allow the corn syrup mixture to cool any longer than 20 seconds. It may become too thick to incorporate into the egg white mixture. Add the sugar mixture to the egg whites. Turn your mixer on to high, and slowly pour the corn syrup mixture into the egg whites. The mixer bowl may get warm, but continue mixing the ingredients for 7 to 8 minutes, or until the outside of the bowl returns to room temperature again. Try not to pour the corn syrup mixture so it hits the whisk. Instead, aim for the side of the mixer bowl. Stir in the vanilla. When you’re finished mixing the corn syrup mixture into the egg whites, add 1 ½ teaspoons (7 ½ ml) of vanilla extract to the bowl. Continue blending the mixture until medium-stiff peaks form, which should take 1 to 2 minutes. The recipe makes 2 to 3 cups (200 to 300 g) of marshmallow fluff. You only need 2 cups (200 g) for the buttercream frosting, so store the leftover fluff in an airtight container in the refrigerator. It should keep for up to 2 weeks. Whipping Up Marshmallow Buttercream Beat the butter until smooth. Add 2 sticks (227 g) of unsalted butter that have been softened to room temperature to the bowl of a stand mixer with the paddle attachment inserted. Cream the butter on medium-high speed until it is light, fluffy, and smooth, which should take approximately 1 to 2 minutes. You can use an electric hand mixer to make the buttercream frosting if you prefer. Add marshmallow fluff and powdered sugar in intervals. Once the butter is light and fluffy, turn the mixer off and begin to add 2 cups (200 g) of marshmallow fluff and 1 ½ cups (188 g) of powdered sugar in ½ cup (50 g for the marshmallow fluff and 63 g for the sugar) increments. Mix on medium after each addition until all of the marshmallow fluff and powdered sugar are incorporated. Scrape down the sides of the bowl with a spatula as you’re mixing the frosting to ensure that all of the ingredients are fully combined. Mix in the salt and beat until combined. When the marshmallow fluff and powdered sugar are fully incorporated, add a pinch of kosher salt to the bowl. Beat the mixture on medium to incorporate the salt and create a light, fluffy frosting, which should take 1 to 2 minutes. You can use the buttercream to frost cupcakes, cakes, cookies, or your favorite baked goods. It’s a particularly tasty topping for chocolate-based sweets. Store any leftover frosting in an airtight container in the refrigerator. Mixing Up Toasted Marshmallow Buttercream Cream the butter. Add 1 cup (227 g) of butter that’s been softened to room temperature to the bowl of a stand mixer with the paddle attachment inserted. Beat the butter on medium-high until it is smooth and creamy, which should take 1 to 2 minutes. You can use an electric hand mixer to make the buttercream frosting if you prefer. Stir in the powdered sugar. When the butter is creamed, gradually add 4 cups (500 g) of powdered sugar to the butter. Continue mixing until the sugar is fully incorporated, which should take approximately 2 minutes. You may want to add the powdered sugar in increments and mix after each addition. That often makes it easier to blend it into the butter. Scrape down the sides of the bowl as you’re mixing to ensure that all of the powdered sugar is incorporated. Mix in the milk. Once the butter and powdered sugar are fully blended, add 2 tablespoons (30 ml) of milk to the bowl. Continue blending the mixture until it is completely smooth, which should take approximately 30 seconds to 1 minutes. For the richest buttercream frosting, use whole milk. Place the marshmallows on a lined baking sheet. When you’ve finished blending the butter mixture, line a large baking sheet with a piece of parchment paper. Spread a 10 ounce (284 g) bag of mini marshmallows over the baking sheet in a single, even layer. You can substitute a silicone baking mat for the parchment paper if you prefer. Broil the marshmallows until browned. Place the baking sheet with marshmallows under your oven’s broiler. Allow them to heat until they are puffed and brown, which should take approximately 45 seconds. Keep a close eye on the marshmallows because they can burn quickly. Combine the toasted marshmallows with the butter mixture. When the marshmallows are toasted, remove them from the oven and immediately add them to the butter mixture. Beat the frosting on medium until it is smooth. The marshmallows will melt into the frosting as you beat it, but you’ll still see little brown, toasted bits in the finished product. Allow the frosting to cool completely before using it. The frosting will be warm after mixing the marshmallows into it because they’ve been toasted. Let the frosting cool completely before spreading or piping it on your cake, cupcakes, or other baked goods. It’s best to use all of the frosting up right after you make it. Refrigerating it can cause the marshmallows to harden, so the frosting’s texture may change.",
    "sentences": [
        " Creating Homemade Marshmallow Fluff Heat the water, sugar, and corn syrup.",
        "Add ¼ cup (59 ml) plus 2 tablespoons (30 ml) of water, ¾ cup (150 g) granulated sugar, and ¾ cup (225 g) of light corn syrup to a medium saucepan.",
        "Warm the mixture over medium-high heat until a candy thermometer reads 240 degrees Fahrenheit (116 degrees Celsius), which should take 10 to 15 minutes.",
        "If you don’t have a candy thermometer, fill a bowl with ice cold water.",
        "Drop some of the corn syrup mixture into the water.",
        "The mixture should easily form a soft, flexible ball in the water when it reaches the right temperature.",
        "If it forms thin threads instead, it isn’t hot enough yet.",
        "If it forms a hard ball, you’ve cooked it too long.",
        "Beat the egg whites until foamy.",
        "While the corn syrup mixture is heating, add the whites from 3 large eggs to the bowl of a stand mixer with a whisk attachment inserted.",
        "Whip the eggs whites on medium until they become foamy.",
        "To separate the egg whites from the yolks, crack the eggs against a flat surface, such as a counter or tabletop.",
        "Divide the eggs in two over a bowl, and let the yolks to fall into the lower half.",
        "Move the yolks back and forth between the halves, allowing the white to drip out into the bowl.",
        "Continue moving the yolks until all of the whites have dripped out.",
        "Save the yolks for another recipe.",
        "If you don’t have a stand mixer, you can use an electric hand mixer instead.",
        "Mix the cream of tartar and salt into the egg whites until peaks form.",
        "Once the whites are foamy, turn the mixer’s speed up to high.",
        "Add ½ teaspoon (2 g) of cream of tartar and a pinch of salt, and continue whipping until the mixture forms soft peaks, which typically takes 1 to 2 minutes.",
        "You want the egg white mixture to reach the right consistency just as the corn syrup mixture is finished heating.",
        "If the egg whites are coming along more quickly than the corn syrup, it’s okay to stop mixing them and wait for the corn syrup to reach the proper temperature.",
        "Remove the sugar mixture from the heat and allow it to rest.",
        "When the corn syrup mixture has reached 240 degrees Fahrenheit (116 degrees Celsius), remove the pan from the heat.",
        "Let the mixture rest for approximately 20 seconds so it cools slightly.",
        "Don’t allow the corn syrup mixture to cool any longer than 20 seconds.",
        "It may become too thick to incorporate into the egg white mixture.",
        "Add the sugar mixture to the egg whites.",
        "Turn your mixer on to high, and slowly pour the corn syrup mixture into the egg whites.",
        "The mixer bowl may get warm, but continue mixing the ingredients for 7 to 8 minutes, or until the outside of the bowl returns to room temperature again.",
        "Try not to pour the corn syrup mixture so it hits the whisk.",
        "Instead, aim for the side of the mixer bowl.",
        "Stir in the vanilla.",
        "When you’re finished mixing the corn syrup mixture into the egg whites, add 1 ½ teaspoons (7 ½ ml) of vanilla extract to the bowl.",
        "Continue blending the mixture until medium-stiff peaks form, which should take 1 to 2 minutes.",
        "The recipe makes 2 to 3 cups (200 to 300 g) of marshmallow fluff.",
        "You only need 2 cups (200 g) for the buttercream frosting, so store the leftover fluff in an airtight container in the refrigerator.",
        "It should keep for up to 2 weeks.",
        "Whipping Up Marshmallow Buttercream Beat the butter until smooth.",
        "Add 2 sticks (227 g) of unsalted butter that have been softened to room temperature to the bowl of a stand mixer with the paddle attachment inserted.",
        "Cream the butter on medium-high speed until it is light, fluffy, and smooth, which should take approximately 1 to 2 minutes.",
        "You can use an electric hand mixer to make the buttercream frosting if you prefer.",
        "Add marshmallow fluff and powdered sugar in intervals.",
        "Once the butter is light and fluffy, turn the mixer off and begin to add 2 cups (200 g) of marshmallow fluff and 1 ½ cups (188 g) of powdered sugar in ½ cup (50 g for the marshmallow fluff and 63 g for the sugar) increments.",
        "Mix on medium after each addition until all of the marshmallow fluff and powdered sugar are incorporated.",
        "Scrape down the sides of the bowl with a spatula as you’re mixing the frosting to ensure that all of the ingredients are fully combined.",
        "Mix in the salt and beat until combined.",
        "When the marshmallow fluff and powdered sugar are fully incorporated, add a pinch of kosher salt to the bowl.",
        "Beat the mixture on medium to incorporate the salt and create a light, fluffy frosting, which should take 1 to 2 minutes.",
        "You can use the buttercream to frost cupcakes, cakes, cookies, or your favorite baked goods.",
        "It’s a particularly tasty topping for chocolate-based sweets.",
        "Store any leftover frosting in an airtight container in the refrigerator.",
        "Mixing Up Toasted Marshmallow Buttercream Cream the butter.",
        "Add 1 cup (227 g) of butter that’s been softened to room temperature to the bowl of a stand mixer with the paddle attachment inserted.",
        "Beat the butter on medium-high until it is smooth and creamy, which should take 1 to 2 minutes.",
        "You can use an electric hand mixer to make the buttercream frosting if you prefer.",
        "Stir in the powdered sugar.",
        "When the butter is creamed, gradually add 4 cups (500 g) of powdered sugar to the butter.",
        "Continue mixing until the sugar is fully incorporated, which should take approximately 2 minutes.",
        "You may want to add the powdered sugar in increments and mix after each addition.",
        "That often makes it easier to blend it into the butter.",
        "Scrape down the sides of the bowl as you’re mixing to ensure that all of the powdered sugar is incorporated.",
        "Mix in the milk.",
        "Once the butter and powdered sugar are fully blended, add 2 tablespoons (30 ml) of milk to the bowl.",
        "Continue blending the mixture until it is completely smooth, which should take approximately 30 seconds to 1 minutes.",
        "For the richest buttercream frosting, use whole milk.",
        "Place the marshmallows on a lined baking sheet.",
        "When you’ve finished blending the butter mixture, line a large baking sheet with a piece of parchment paper.",
        "Spread a 10 ounce (284 g) bag of mini marshmallows over the baking sheet in a single, even layer.",
        "You can substitute a silicone baking mat for the parchment paper if you prefer.",
        "Broil the marshmallows until browned.",
        "Place the baking sheet with marshmallows under your oven’s broiler.",
        "Allow them to heat until they are puffed and brown, which should take approximately 45 seconds.",
        "Keep a close eye on the marshmallows because they can burn quickly.",
        "Combine the toasted marshmallows with the butter mixture.",
        "When the marshmallows are toasted, remove them from the oven and immediately add them to the butter mixture.",
        "Beat the frosting on medium until it is smooth.",
        "The marshmallows will melt into the frosting as you beat it, but you’ll still see little brown, toasted bits in the finished product.",
        "Allow the frosting to cool completely before using it.",
        "The frosting will be warm after mixing the marshmallows into it because they’ve been toasted.",
        "Let the frosting cool completely before spreading or piping it on your cake, cupcakes, or other baked goods.",
        "It’s best to use all of the frosting up right after you make it.",
        "Refrigerating it can cause the marshmallows to harden, so the frosting’s texture may change."
    ]
}