{
    "title": "How to Get a Bleach Stain Out of a Carpet",
    "url": "https://www.wikihow.com/Get-a-Bleach-Stain-Out-of-a-Carpet",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Floors and Stairs",
        "Carpets and Rugs"
    ],
    "methods": [
        {
            "name": "Using Dish Detergent and Water",
            "steps": [
                {
                    "headline": "Blot away wet bleach with a cold, damp towel.",
                    "description": "If you’ve just spilled bleach on your carpet, there might still be time to save its color if you act quickly. Run a towel or cloth under cold water, squeeze it out, then use it to blot out the affected area. Take care to blot with repeated dabbing motions instead of scrubbing. Scrubbing will force the bleach deeper into the carpet fibers. Make sure to use a white towel or one that you don’t mind getting stained."
                },
                {
                    "headline": "Pour detergent and warm water over the stain.",
                    "description": "After blotting the stain with cold water, mix a half tablespoon of liquid dishwashing detergent with a cup (240 mL) of warm water. For larger stains, use the same ratio (for example, one tablespoon mixed with two cups or 480 ml of water) Let it sit for about five minutes. As an alternative to soap, you could substitute distilled white vinegar in the same ratio."
                },
                {
                    "headline": "Blot the area with a sponge or cloth.",
                    "description": "After five minutes, use a clean, damp sponge or cloth to blot the area you’ve soaked in the detergent solution. Be sure to use cold water to get your sponge or cloth damp. Repeat the process 2 more times to lift all of the residual bleach out from your carpet. When blotting, work from the outside of the stain toward the center to avoid spreading it. Depending on the amount of bleach and how many times you rinse the carpet, you may need to switch to a new rag."
                }
            ]
        },
        {
            "name": "Recoloring a Set Bleach Stain",
            "steps": [
                {
                    "headline": "Color the stain with a crayon that closely matches your carpet color.",
                    "description": "Look in your art supplies or take a few carpet fibers to a store to try to find a matching crayon. Work the crayon into the bleached area, taking care to color down to the base of the fibers. Try to stay within the lines of the stain and avoid coloring unbleached fibers. Marker pens may also sometimes be helpful."
                },
                {
                    "headline": "Dilute the colored patch with a damp towel.",
                    "description": "Coloring the bleached patch will likely result in a darker hue than the surrounding carpet. Use a damp towel to dilute the color and spread the pigment throughout the bleached area. Continue to color and dilute until you’ve blended the color to match your carpet."
                },
                {
                    "headline": "Try using interior paint.",
                    "description": "If the bleached spot is in an inconspicuous area, you can try using interior paint. Use a fine-tipped paintbrush to apply a thin coat over the stain, and try to paint each fiber from its base to the top. Apply more coats as necessary, but be sure to keep them thin. The best thing about using interior paint is that you can take some carpet fibers to your local home improvement store and have them match the color precisely. Avoid using interior paint in spots that are obvious or receive lots of foot traffic. The paint will make the carpet fibers stiff."
                },
                {
                    "headline": "Consult a professional carpet cleaner.",
                    "description": "Ask a professional for help if you’ve tried using crayons or paint without success, or if you don’t want to take the chance recoloring the stain on your own. A professional cleaner can attempt to:\nClean the stain\nCut out fibers\nCut out and replace the affected patch"
                }
            ]
        },
        {
            "name": "Taking Precautions",
            "steps": [
                {
                    "headline": "Read the bleach's label before cleaning the stain.",
                    "description": "Dish soap and vinegar should both be safe to use on a bleach stain, but even so, read the bleach's directions and warnings before using those or any other product on the stain. Many include lists of chemicals that should never be mixed with bleach, like ammonia, which can cause a toxic reaction. Double-check the ingredients of any cleaning or repair product that you intend to use to make sure it doesn't include any of those ingredients."
                },
                {
                    "headline": "Wear gloves.",
                    "description": "Keep in mind that bleach can harm your skin. Always wear protective gloves before trying to wash bleach out of your carpet by hand. Do so even if the bleach has dried, since the chemicals are still present even though the moisture isn't."
                },
                {
                    "headline": "Provide plenty of air-flow.",
                    "description": "Fumes from bleach can be overpowering, causing lightheadedness, nausea, and other ailments. If you're using vinegar to clean it up, expect the combined smell to be even more overwhelming. Open some windows and/or set up some fans to draw the fumes away from you while you work on the stain."
                }
            ]
        }
    ],
    "tyn": [
        "Dishwashing detergent",
        "Paper towels or a cloth",
        "Sponge",
        "White vinegar",
        "Baking soda",
        "Toothbrush",
        "Vacuum cleaner",
        "Crayon"
    ],
    "text": " Using Dish Detergent and Water Blot away wet bleach with a cold, damp towel. If you’ve just spilled bleach on your carpet, there might still be time to save its color if you act quickly. Run a towel or cloth under cold water, squeeze it out, then use it to blot out the affected area. Take care to blot with repeated dabbing motions instead of scrubbing. Scrubbing will force the bleach deeper into the carpet fibers. Make sure to use a white towel or one that you don’t mind getting stained. Pour detergent and warm water over the stain. After blotting the stain with cold water, mix a half tablespoon of liquid dishwashing detergent with a cup (240 mL) of warm water. For larger stains, use the same ratio (for example, one tablespoon mixed with two cups or 480 ml of water) Let it sit for about five minutes. As an alternative to soap, you could substitute distilled white vinegar in the same ratio. Blot the area with a sponge or cloth. After five minutes, use a clean, damp sponge or cloth to blot the area you’ve soaked in the detergent solution. Be sure to use cold water to get your sponge or cloth damp. Repeat the process 2 more times to lift all of the residual bleach out from your carpet. When blotting, work from the outside of the stain toward the center to avoid spreading it. Depending on the amount of bleach and how many times you rinse the carpet, you may need to switch to a new rag. Recoloring a Set Bleach Stain Color the stain with a crayon that closely matches your carpet color. Look in your art supplies or take a few carpet fibers to a store to try to find a matching crayon. Work the crayon into the bleached area, taking care to color down to the base of the fibers. Try to stay within the lines of the stain and avoid coloring unbleached fibers. Marker pens may also sometimes be helpful. Dilute the colored patch with a damp towel. Coloring the bleached patch will likely result in a darker hue than the surrounding carpet. Use a damp towel to dilute the color and spread the pigment throughout the bleached area. Continue to color and dilute until you’ve blended the color to match your carpet. Try using interior paint. If the bleached spot is in an inconspicuous area, you can try using interior paint. Use a fine-tipped paintbrush to apply a thin coat over the stain, and try to paint each fiber from its base to the top. Apply more coats as necessary, but be sure to keep them thin. The best thing about using interior paint is that you can take some carpet fibers to your local home improvement store and have them match the color precisely. Avoid using interior paint in spots that are obvious or receive lots of foot traffic. The paint will make the carpet fibers stiff. Consult a professional carpet cleaner. Ask a professional for help if you’ve tried using crayons or paint without success, or if you don’t want to take the chance recoloring the stain on your own. A professional cleaner can attempt to:\nClean the stain\nCut out fibers\nCut out and replace the affected patch Taking Precautions Read the bleach's label before cleaning the stain. Dish soap and vinegar should both be safe to use on a bleach stain, but even so, read the bleach's directions and warnings before using those or any other product on the stain. Many include lists of chemicals that should never be mixed with bleach, like ammonia, which can cause a toxic reaction. Double-check the ingredients of any cleaning or repair product that you intend to use to make sure it doesn't include any of those ingredients. Wear gloves. Keep in mind that bleach can harm your skin. Always wear protective gloves before trying to wash bleach out of your carpet by hand. Do so even if the bleach has dried, since the chemicals are still present even though the moisture isn't. Provide plenty of air-flow. Fumes from bleach can be overpowering, causing lightheadedness, nausea, and other ailments. If you're using vinegar to clean it up, expect the combined smell to be even more overwhelming. Open some windows and/or set up some fans to draw the fumes away from you while you work on the stain.",
    "sentences": [
        " Using Dish Detergent and Water Blot away wet bleach with a cold, damp towel.",
        "If you’ve just spilled bleach on your carpet, there might still be time to save its color if you act quickly.",
        "Run a towel or cloth under cold water, squeeze it out, then use it to blot out the affected area.",
        "Take care to blot with repeated dabbing motions instead of scrubbing.",
        "Scrubbing will force the bleach deeper into the carpet fibers.",
        "Make sure to use a white towel or one that you don’t mind getting stained.",
        "Pour detergent and warm water over the stain.",
        "After blotting the stain with cold water, mix a half tablespoon of liquid dishwashing detergent with a cup (240 mL) of warm water.",
        "For larger stains, use the same ratio (for example, one tablespoon mixed with two cups or 480 ml of water) Let it sit for about five minutes.",
        "As an alternative to soap, you could substitute distilled white vinegar in the same ratio.",
        "Blot the area with a sponge or cloth.",
        "After five minutes, use a clean, damp sponge or cloth to blot the area you’ve soaked in the detergent solution.",
        "Be sure to use cold water to get your sponge or cloth damp.",
        "Repeat the process 2 more times to lift all of the residual bleach out from your carpet.",
        "When blotting, work from the outside of the stain toward the center to avoid spreading it.",
        "Depending on the amount of bleach and how many times you rinse the carpet, you may need to switch to a new rag.",
        "Recoloring a Set Bleach Stain Color the stain with a crayon that closely matches your carpet color.",
        "Look in your art supplies or take a few carpet fibers to a store to try to find a matching crayon.",
        "Work the crayon into the bleached area, taking care to color down to the base of the fibers.",
        "Try to stay within the lines of the stain and avoid coloring unbleached fibers.",
        "Marker pens may also sometimes be helpful.",
        "Dilute the colored patch with a damp towel.",
        "Coloring the bleached patch will likely result in a darker hue than the surrounding carpet.",
        "Use a damp towel to dilute the color and spread the pigment throughout the bleached area.",
        "Continue to color and dilute until you’ve blended the color to match your carpet.",
        "Try using interior paint.",
        "If the bleached spot is in an inconspicuous area, you can try using interior paint.",
        "Use a fine-tipped paintbrush to apply a thin coat over the stain, and try to paint each fiber from its base to the top.",
        "Apply more coats as necessary, but be sure to keep them thin.",
        "The best thing about using interior paint is that you can take some carpet fibers to your local home improvement store and have them match the color precisely.",
        "Avoid using interior paint in spots that are obvious or receive lots of foot traffic.",
        "The paint will make the carpet fibers stiff.",
        "Consult a professional carpet cleaner.",
        "Ask a professional for help if you’ve tried using crayons or paint without success, or if you don’t want to take the chance recoloring the stain on your own.",
        "A professional cleaner can attempt to:\nClean the stain\nCut out fibers\nCut out and replace the affected patch Taking Precautions Read the bleach's label before cleaning the stain.",
        "Dish soap and vinegar should both be safe to use on a bleach stain, but even so, read the bleach's directions and warnings before using those or any other product on the stain.",
        "Many include lists of chemicals that should never be mixed with bleach, like ammonia, which can cause a toxic reaction.",
        "Double-check the ingredients of any cleaning or repair product that you intend to use to make sure it doesn't include any of those ingredients.",
        "Wear gloves.",
        "Keep in mind that bleach can harm your skin.",
        "Always wear protective gloves before trying to wash bleach out of your carpet by hand.",
        "Do so even if the bleach has dried, since the chemicals are still present even though the moisture isn't.",
        "Provide plenty of air-flow.",
        "Fumes from bleach can be overpowering, causing lightheadedness, nausea, and other ailments.",
        "If you're using vinegar to clean it up, expect the combined smell to be even more overwhelming.",
        "Open some windows and/or set up some fans to draw the fumes away from you while you work on the stain."
    ]
}