{
    "title": "How to Clean a Cast Iron BBQ Grill",
    "url": "https://www.wikihow.com/Clean-a-Cast-Iron-BBQ-Grill",
    "category_hierarchy": [
        "Food and Entertaining"
    ],
    "methods": [
        {
            "name": "Steps",
            "steps": [
                {
                    "headline": "Set up a cleaning station.",
                    "description": "Cleaning grill grates can get messy. You should do so outside. Lay down several sheets of newspaper on a flat surface, such as your deck or garage. Then, place the grill grates on the newspaper."
                },
                {
                    "headline": "Warm the grates and brush off excess foods.",
                    "description": "You should clean cast iron grill grates while they're slightly warm. Before beginning the cleaning process, turn on your grill and preheat it. When it's done preheating, you can switch the grill off and begin the cleaning process. You may want to wait a few minutes for the grates to cool off if they're very hot. Make sure to use gloves when handling the grates."
                },
                {
                    "headline": "Scrape off excess food.",
                    "description": "Use a paint scraper and wire brush. Scrape off excess food from the grates, as well as any set in grease or debris. Make sure to get as much debris off as possible before proceeding."
                },
                {
                    "headline": "Scrub the grates off with a brush and water.",
                    "description": "Use warm, soapy water to clean your grates. You can use a scrub brush or sponge for this. Wash the grill's gates down to remove any layers of grease or dirt. You should also get out any bits of food you could not remove earlier."
                },
                {
                    "headline": "Rinse your grates.",
                    "description": "Mix half a cup of vinegar into a large bucket of water. Use a clean sponge to rinse your grates. Make sure to get all the soap off. Keep rinsing until water from the brush runs clean. You do not want to leave soap residue on cast iron gates."
                }
            ]
        },
        {
            "name": "Cleaning the Grill",
            "steps": [
                {
                    "headline": "Prepare to clean.",
                    "description": "You should set your grill over some newspaper or trap outside. When you do things like remove grease from the lid, newspaper can catch dirt and debris as they fall."
                },
                {
                    "headline": "Remove any bits of food.",
                    "description": "Before you start cleaning the inside of the grill, examine the bottom of the grill. This is where food is likely to fall off during cooking. Put on a pair of gloves and remove any bits of charred, burnt food that are clearly visible."
                },
                {
                    "headline": "Clean the exterior with warm, soapy water.",
                    "description": "To start cleaning, clean the exterior of your grill. You do not need a specific cleaner. Warm water mixed with soap, such as dish soap, can easily be used to wipe down the exterior of the grill. Put on a pair of gloves. Dip a sponge in a bucket of warm, soapy water and gently wipe down the exterior of your grill. Get out any stains, such as bird droppings, as well as wiping off built up dirt and dust. Then, let your grill dry off. If there is buildup that is difficult to remove, use a mild glass cleaner and a terry cloth after applying soap and water. This should break down anything that isn't coming off."
                },
                {
                    "headline": "Remove grease from the top of the lid.",
                    "description": "When you open your lid, you will notice some built up grease. This a black, tarry substance you should remove from the top of the lid. You should be able to peel off most of the grease with your fingers. Peel off as much grease as you can and then brush any remaining grease off using a stainless steel grill brush."
                },
                {
                    "headline": "Sift out excess charcoal.",
                    "description": "At the bottom of your grill, you should find a handle you can turn that will sift out any excess charcoal into a removable container below the grill. Simply turn the levers until all the leftover charcoal is gone. Then, remove the container and discard the charcoal. Refer to your grill's instruction manual for specific directions regarding using the cleaning system."
                },
                {
                    "headline": "Clean the inside bowl.",
                    "description": "Clean the inside of the bowl using a stainless steel brush. Use this to scrape off any food particles and debris you missed earlier. Then, wipe down the interior of the grill with a sponge dipped in soapy water. This should clear off any built up dirt or grease along the side of the grill. When you're done, rinse off the grill's interior with a clean sponge dipped in plain water. Then, dry the grill's interior using a terrycloth."
                }
            ]
        },
        {
            "name": "Cleaning After Cooking",
            "steps": [
                {
                    "headline": "Scrape off excess food.",
                    "description": "You should always give your grill a quick cleaning after cooking. To start, use a scrub brush to scrape off any excess food and grease."
                },
                {
                    "headline": "Turn up the heat and scrape the grill again.",
                    "description": "Turn the heat to high. Allow the grill to heat up for about five minutes before proceeding. This will make the cleaning process easier. If there are any remaining traces of fat or food, scrape them off after heating the grill."
                },
                {
                    "headline": "Wipe down the grill.",
                    "description": "Wait for the grill to cool off. Use wipes specifically designed for cleaning grills, which you can buy at a hardware store. Wipe down the grill's lid and interior to remove any dirt, debris, or stuck on food."
                }
            ]
        }
    ],
    "tyn": [
        "Scrub brush",
        "Old rags",
        "Grill cleaner",
        "Soap",
        "Gloves",
        "Paint scraper",
        "Wire brush"
    ],
    "text": " Steps Set up a cleaning station. Cleaning grill grates can get messy. You should do so outside. Lay down several sheets of newspaper on a flat surface, such as your deck or garage. Then, place the grill grates on the newspaper. Warm the grates and brush off excess foods. You should clean cast iron grill grates while they're slightly warm. Before beginning the cleaning process, turn on your grill and preheat it. When it's done preheating, you can switch the grill off and begin the cleaning process. You may want to wait a few minutes for the grates to cool off if they're very hot. Make sure to use gloves when handling the grates. Scrape off excess food. Use a paint scraper and wire brush. Scrape off excess food from the grates, as well as any set in grease or debris. Make sure to get as much debris off as possible before proceeding. Scrub the grates off with a brush and water. Use warm, soapy water to clean your grates. You can use a scrub brush or sponge for this. Wash the grill's gates down to remove any layers of grease or dirt. You should also get out any bits of food you could not remove earlier. Rinse your grates. Mix half a cup of vinegar into a large bucket of water. Use a clean sponge to rinse your grates. Make sure to get all the soap off. Keep rinsing until water from the brush runs clean. You do not want to leave soap residue on cast iron gates. Cleaning the Grill Prepare to clean. You should set your grill over some newspaper or trap outside. When you do things like remove grease from the lid, newspaper can catch dirt and debris as they fall. Remove any bits of food. Before you start cleaning the inside of the grill, examine the bottom of the grill. This is where food is likely to fall off during cooking. Put on a pair of gloves and remove any bits of charred, burnt food that are clearly visible. Clean the exterior with warm, soapy water. To start cleaning, clean the exterior of your grill. You do not need a specific cleaner. Warm water mixed with soap, such as dish soap, can easily be used to wipe down the exterior of the grill. Put on a pair of gloves. Dip a sponge in a bucket of warm, soapy water and gently wipe down the exterior of your grill. Get out any stains, such as bird droppings, as well as wiping off built up dirt and dust. Then, let your grill dry off. If there is buildup that is difficult to remove, use a mild glass cleaner and a terry cloth after applying soap and water. This should break down anything that isn't coming off. Remove grease from the top of the lid. When you open your lid, you will notice some built up grease. This a black, tarry substance you should remove from the top of the lid. You should be able to peel off most of the grease with your fingers. Peel off as much grease as you can and then brush any remaining grease off using a stainless steel grill brush. Sift out excess charcoal. At the bottom of your grill, you should find a handle you can turn that will sift out any excess charcoal into a removable container below the grill. Simply turn the levers until all the leftover charcoal is gone. Then, remove the container and discard the charcoal. Refer to your grill's instruction manual for specific directions regarding using the cleaning system. Clean the inside bowl. Clean the inside of the bowl using a stainless steel brush. Use this to scrape off any food particles and debris you missed earlier. Then, wipe down the interior of the grill with a sponge dipped in soapy water. This should clear off any built up dirt or grease along the side of the grill. When you're done, rinse off the grill's interior with a clean sponge dipped in plain water. Then, dry the grill's interior using a terrycloth. Cleaning After Cooking Scrape off excess food. You should always give your grill a quick cleaning after cooking. To start, use a scrub brush to scrape off any excess food and grease. Turn up the heat and scrape the grill again. Turn the heat to high. Allow the grill to heat up for about five minutes before proceeding. This will make the cleaning process easier. If there are any remaining traces of fat or food, scrape them off after heating the grill. Wipe down the grill. Wait for the grill to cool off. Use wipes specifically designed for cleaning grills, which you can buy at a hardware store. Wipe down the grill's lid and interior to remove any dirt, debris, or stuck on food.",
    "sentences": [
        " Steps Set up a cleaning station.",
        "Cleaning grill grates can get messy.",
        "You should do so outside.",
        "Lay down several sheets of newspaper on a flat surface, such as your deck or garage.",
        "Then, place the grill grates on the newspaper.",
        "Warm the grates and brush off excess foods.",
        "You should clean cast iron grill grates while they're slightly warm.",
        "Before beginning the cleaning process, turn on your grill and preheat it.",
        "When it's done preheating, you can switch the grill off and begin the cleaning process.",
        "You may want to wait a few minutes for the grates to cool off if they're very hot.",
        "Make sure to use gloves when handling the grates.",
        "Scrape off excess food.",
        "Use a paint scraper and wire brush.",
        "Scrape off excess food from the grates, as well as any set in grease or debris.",
        "Make sure to get as much debris off as possible before proceeding.",
        "Scrub the grates off with a brush and water.",
        "Use warm, soapy water to clean your grates.",
        "You can use a scrub brush or sponge for this.",
        "Wash the grill's gates down to remove any layers of grease or dirt.",
        "You should also get out any bits of food you could not remove earlier.",
        "Rinse your grates.",
        "Mix half a cup of vinegar into a large bucket of water.",
        "Use a clean sponge to rinse your grates.",
        "Make sure to get all the soap off.",
        "Keep rinsing until water from the brush runs clean.",
        "You do not want to leave soap residue on cast iron gates.",
        "Cleaning the Grill Prepare to clean.",
        "You should set your grill over some newspaper or trap outside.",
        "When you do things like remove grease from the lid, newspaper can catch dirt and debris as they fall.",
        "Remove any bits of food.",
        "Before you start cleaning the inside of the grill, examine the bottom of the grill.",
        "This is where food is likely to fall off during cooking.",
        "Put on a pair of gloves and remove any bits of charred, burnt food that are clearly visible.",
        "Clean the exterior with warm, soapy water.",
        "To start cleaning, clean the exterior of your grill.",
        "You do not need a specific cleaner.",
        "Warm water mixed with soap, such as dish soap, can easily be used to wipe down the exterior of the grill.",
        "Put on a pair of gloves.",
        "Dip a sponge in a bucket of warm, soapy water and gently wipe down the exterior of your grill.",
        "Get out any stains, such as bird droppings, as well as wiping off built up dirt and dust.",
        "Then, let your grill dry off.",
        "If there is buildup that is difficult to remove, use a mild glass cleaner and a terry cloth after applying soap and water.",
        "This should break down anything that isn't coming off.",
        "Remove grease from the top of the lid.",
        "When you open your lid, you will notice some built up grease.",
        "This a black, tarry substance you should remove from the top of the lid.",
        "You should be able to peel off most of the grease with your fingers.",
        "Peel off as much grease as you can and then brush any remaining grease off using a stainless steel grill brush.",
        "Sift out excess charcoal.",
        "At the bottom of your grill, you should find a handle you can turn that will sift out any excess charcoal into a removable container below the grill.",
        "Simply turn the levers until all the leftover charcoal is gone.",
        "Then, remove the container and discard the charcoal.",
        "Refer to your grill's instruction manual for specific directions regarding using the cleaning system.",
        "Clean the inside bowl.",
        "Clean the inside of the bowl using a stainless steel brush.",
        "Use this to scrape off any food particles and debris you missed earlier.",
        "Then, wipe down the interior of the grill with a sponge dipped in soapy water.",
        "This should clear off any built up dirt or grease along the side of the grill.",
        "When you're done, rinse off the grill's interior with a clean sponge dipped in plain water.",
        "Then, dry the grill's interior using a terrycloth.",
        "Cleaning After Cooking Scrape off excess food.",
        "You should always give your grill a quick cleaning after cooking.",
        "To start, use a scrub brush to scrape off any excess food and grease.",
        "Turn up the heat and scrape the grill again.",
        "Turn the heat to high.",
        "Allow the grill to heat up for about five minutes before proceeding.",
        "This will make the cleaning process easier.",
        "If there are any remaining traces of fat or food, scrape them off after heating the grill.",
        "Wipe down the grill.",
        "Wait for the grill to cool off.",
        "Use wipes specifically designed for cleaning grills, which you can buy at a hardware store.",
        "Wipe down the grill's lid and interior to remove any dirt, debris, or stuck on food."
    ]
}