{
    "title": "How to Clean a Washing Machine with Vinegar",
    "url": "https://www.wikihow.com/Clean-a-Washing-Machine-with-Vinegar",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Laundry"
    ],
    "methods": [
        {
            "name": "Cleaning A Top Load Washing Machine",
            "steps": [
                {
                    "headline": "Set your washing machine to the hottest temperature and longest cycle.",
                    "description": "Run your washing machine and allow it to fill with hot water. Use the highest load size when doing this as well. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAshley Matuska\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado. She has worked in the cleaning industry for over 5 years. Ashley Matuska\t\t\tCleaning Guru\t\t\t\tWhat Our Expert Does: \"I recommend cleaning your washing machine with vinegar about every 3 months. An easy way to schedule this is around the seasons since they change 4 times a year!\""
                },
                {
                    "headline": "Add four cups (946.35 ml) of white vinegar to the washer.",
                    "description": "Open the lid while the washer is running. Use a measuring cup to measure and pour four cups (946.35 ml) of white vinegar into the washer as it fills."
                },
                {
                    "headline": "Pour a cup (236.58 ml) of baking soda to the water.",
                    "description": "For an even deeper cleaning, you can add baking soda to the water. Measure out a cup (236.58 ml) of baking soda and carefully pour it into the water in your machine."
                },
                {
                    "headline": "Close the lid and let the washing machine run for 5 minutes.",
                    "description": "Allowing your machine to run will let the vinegar and baking soda wash away a lot of the dirt and grime on the inside of your washing machine."
                },
                {
                    "headline": "Open the lid and pause the machine for an hour.",
                    "description": "Letting the hot water and vinegar sit in your washing machine for an hour will help pull away leftover grime and dirt from within the machine."
                },
                {
                    "headline": "Wipe the outside of your machine while your machine is paused.",
                    "description": "Use a clean cloth and citrus cleaner to wash down the rest of your washing machine. Citrus cleaners are great at removing limescale, soap scum and buildup. You can purchase citrus cleaners at the store or you can make them at home. Spray the cleaner in dirty areas and use the cloth to wipe up the grime and dirt. Citrus cleaners use the natural properties found in fruits like lemons, oranges, and limes to remove dirt. When cleaning, make sure to wipe off the fabric softener and bleach reservoirs that are on your washer. You can also use a toothbrush to get to hard to reach places."
                },
                {
                    "headline": "Finish the washing machine's cycle.",
                    "description": "Close the lid and finish the cycle in your washing machine. Wait until the cycle completes and all the water has drained from the machine."
                },
                {
                    "headline": "Wipe down the interior of the machine and repeat.",
                    "description": "Finish cleaning out the interior of the washing machine with a dry rag. Once it's dry, you can repeat the steps to finish cleaning the remaining dirt or gunk that's built up inside of your machine."
                }
            ]
        },
        {
            "name": "Cleaning A Front Load Washing Machine",
            "steps": [
                {
                    "headline": "Fill the detergent dispenser with white vinegar.",
                    "description": "Fill the detergent dispenser with 3/4 cup (177.44 ml) of vinegar or until the detergent dispenser is filled. The detergent dispenser is usually labeled and can be found on the top of your front load washing machine. Once it's filled, close the lid."
                },
                {
                    "headline": "Start a normal wash cycle on the hot water setting.",
                    "description": "If your front load washing machine doesn't have a hot water setting, select the \"whites\" setting or \"stain\" setting. Allow the cycle to run through completely."
                },
                {
                    "headline": "Wipe down the exterior of your washer.",
                    "description": "As the normal cycle runs, mix ½ cup (90 g) of baking soda and 1 quart (1 liter) of white vinegar in a bucket. Once the ingredients are incorporated, use the solution to dampen a rag and use the rag to wipe down the exterior of the washer."
                },
                {
                    "headline": "Run an additional rinse cycle.",
                    "description": "Run a rinse cycle with no added vinegar or detergent. This should remove the smell of vinegar and help remove any remaining dirt. Once you're done, the washer should be good to use."
                }
            ]
        }
    ],
    "tyn": [
        "White vinegar",
        "Rags",
        "Citrus Cleaner",
        "Bucket"
    ],
    "text": " Cleaning A Top Load Washing Machine Set your washing machine to the hottest temperature and longest cycle. Run your washing machine and allow it to fill with hot water. Use the highest load size when doing this as well. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAshley Matuska\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado. She has worked in the cleaning industry for over 5 years. Ashley Matuska\t\t\tCleaning Guru\t\t\t\tWhat Our Expert Does: \"I recommend cleaning your washing machine with vinegar about every 3 months. An easy way to schedule this is around the seasons since they change 4 times a year!\" Add four cups (946.35 ml) of white vinegar to the washer. Open the lid while the washer is running. Use a measuring cup to measure and pour four cups (946.35 ml) of white vinegar into the washer as it fills. Pour a cup (236.58 ml) of baking soda to the water. For an even deeper cleaning, you can add baking soda to the water. Measure out a cup (236.58 ml) of baking soda and carefully pour it into the water in your machine. Close the lid and let the washing machine run for 5 minutes. Allowing your machine to run will let the vinegar and baking soda wash away a lot of the dirt and grime on the inside of your washing machine. Open the lid and pause the machine for an hour. Letting the hot water and vinegar sit in your washing machine for an hour will help pull away leftover grime and dirt from within the machine. Wipe the outside of your machine while your machine is paused. Use a clean cloth and citrus cleaner to wash down the rest of your washing machine. Citrus cleaners are great at removing limescale, soap scum and buildup. You can purchase citrus cleaners at the store or you can make them at home. Spray the cleaner in dirty areas and use the cloth to wipe up the grime and dirt. Citrus cleaners use the natural properties found in fruits like lemons, oranges, and limes to remove dirt. When cleaning, make sure to wipe off the fabric softener and bleach reservoirs that are on your washer. You can also use a toothbrush to get to hard to reach places. Finish the washing machine's cycle. Close the lid and finish the cycle in your washing machine. Wait until the cycle completes and all the water has drained from the machine. Wipe down the interior of the machine and repeat. Finish cleaning out the interior of the washing machine with a dry rag. Once it's dry, you can repeat the steps to finish cleaning the remaining dirt or gunk that's built up inside of your machine. Cleaning A Front Load Washing Machine Fill the detergent dispenser with white vinegar. Fill the detergent dispenser with 3/4 cup (177.44 ml) of vinegar or until the detergent dispenser is filled. The detergent dispenser is usually labeled and can be found on the top of your front load washing machine. Once it's filled, close the lid. Start a normal wash cycle on the hot water setting. If your front load washing machine doesn't have a hot water setting, select the \"whites\" setting or \"stain\" setting. Allow the cycle to run through completely. Wipe down the exterior of your washer. As the normal cycle runs, mix ½ cup (90 g) of baking soda and 1 quart (1 liter) of white vinegar in a bucket. Once the ingredients are incorporated, use the solution to dampen a rag and use the rag to wipe down the exterior of the washer. Run an additional rinse cycle. Run a rinse cycle with no added vinegar or detergent. This should remove the smell of vinegar and help remove any remaining dirt. Once you're done, the washer should be good to use.",
    "sentences": [
        " Cleaning A Top Load Washing Machine Set your washing machine to the hottest temperature and longest cycle.",
        "Run your washing machine and allow it to fill with hot water.",
        "Use the highest load size when doing this as well.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAshley Matuska\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado.",
        "She has worked in the cleaning industry for over 5 years.",
        "Ashley Matuska\t\t\tCleaning Guru\t\t\t\tWhat Our Expert Does: \"I recommend cleaning your washing machine with vinegar about every 3 months.",
        "An easy way to schedule this is around the seasons since they change 4 times a year!\"",
        "Add four cups (946.35 ml) of white vinegar to the washer.",
        "Open the lid while the washer is running.",
        "Use a measuring cup to measure and pour four cups (946.35 ml) of white vinegar into the washer as it fills.",
        "Pour a cup (236.58 ml) of baking soda to the water.",
        "For an even deeper cleaning, you can add baking soda to the water.",
        "Measure out a cup (236.58 ml) of baking soda and carefully pour it into the water in your machine.",
        "Close the lid and let the washing machine run for 5 minutes.",
        "Allowing your machine to run will let the vinegar and baking soda wash away a lot of the dirt and grime on the inside of your washing machine.",
        "Open the lid and pause the machine for an hour.",
        "Letting the hot water and vinegar sit in your washing machine for an hour will help pull away leftover grime and dirt from within the machine.",
        "Wipe the outside of your machine while your machine is paused.",
        "Use a clean cloth and citrus cleaner to wash down the rest of your washing machine.",
        "Citrus cleaners are great at removing limescale, soap scum and buildup.",
        "You can purchase citrus cleaners at the store or you can make them at home.",
        "Spray the cleaner in dirty areas and use the cloth to wipe up the grime and dirt.",
        "Citrus cleaners use the natural properties found in fruits like lemons, oranges, and limes to remove dirt.",
        "When cleaning, make sure to wipe off the fabric softener and bleach reservoirs that are on your washer.",
        "You can also use a toothbrush to get to hard to reach places.",
        "Finish the washing machine's cycle.",
        "Close the lid and finish the cycle in your washing machine.",
        "Wait until the cycle completes and all the water has drained from the machine.",
        "Wipe down the interior of the machine and repeat.",
        "Finish cleaning out the interior of the washing machine with a dry rag.",
        "Once it's dry, you can repeat the steps to finish cleaning the remaining dirt or gunk that's built up inside of your machine.",
        "Cleaning A Front Load Washing Machine Fill the detergent dispenser with white vinegar.",
        "Fill the detergent dispenser with 3/4 cup (177.44 ml) of vinegar or until the detergent dispenser is filled.",
        "The detergent dispenser is usually labeled and can be found on the top of your front load washing machine.",
        "Once it's filled, close the lid.",
        "Start a normal wash cycle on the hot water setting.",
        "If your front load washing machine doesn't have a hot water setting, select the \"whites\" setting or \"stain\" setting.",
        "Allow the cycle to run through completely.",
        "Wipe down the exterior of your washer.",
        "As the normal cycle runs, mix ½ cup (90 g) of baking soda and 1 quart (1 liter) of white vinegar in a bucket.",
        "Once the ingredients are incorporated, use the solution to dampen a rag and use the rag to wipe down the exterior of the washer.",
        "Run an additional rinse cycle.",
        "Run a rinse cycle with no added vinegar or detergent.",
        "This should remove the smell of vinegar and help remove any remaining dirt.",
        "Once you're done, the washer should be good to use."
    ]
}