{
    "title": "How to Prepare Dark Chocolate Fondue",
    "url": "https://www.wikihow.com/Prepare-Dark-Chocolate-Fondue",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Eggs and Dairy",
        "Cheese",
        "Fondue"
    ],
    "methods": [
        {
            "name": "Making the Fondue",
            "steps": [
                {
                    "headline": "Make the easy dark chocolate fondue.",
                    "description": "Measure 1 cup (236 ml) of heavy whipping cream into a medium saucepan and turn the heat to medium. When the cream starts to bubble a little, turn off the heat and whisk in 12 ounces (340 g) of chopped dark chocolate and a pinch of salt. Keep whisking until the chocolate is melted. This fondue is basically a ganache, so it's important to transfer it to a fondue pot. This will keep it smooth enough to dip foods into."
                },
                {
                    "headline": "Create the dark chocolate coconut fondue.",
                    "description": "Pour one 13.5-ounce (398 ml) can of full-fat coconut milk into a medium saucepan. Turn the heat to medium, so the coconut milk liquefies. Stir in 2 teaspoons of vanilla extract and 2 cups (350 g) of high-quality dark chocolate chips until the chocolate melts. Transfer the fondue to a fondue pot. If you use low-fat coconut milk, the fondue may not thicken enough."
                },
                {
                    "headline": "Make Toblerone dark chocolate honey-almond fondue.",
                    "description": "Pour 6 tablespoons of whipping cream and 3 tablespoons of honey into a medium saucepan over medium heat. Once the liquid is simmering, chop and whisk in two 3.52-ounce (100 g) bars of Toblerone bittersweet chocolate. When the chocolate is melted you can whisk in 1 tablespoon of kirsch (clear cherry brandy), and 1/4 teaspoon of almond extract. Transfer the fondue to a fondue pot. If you don't have Toblerone bittersweet chocolate, you can substitute 7 ounces (100 g) of semisweet chocolate."
                },
                {
                    "headline": "Heat dark cocoa fondue.",
                    "description": "Pour 1 can (12 ounces or 355 ml) of fat-free evaporated milk into a medium saucepan. Whisk 1 tablespoon of cornstarch into it and turn the heat to low. Whisk in ½ cup (50 g) of unsweetened cocoa powder, ½ cup (100 g) of sugar, ½ teaspoon of vanilla extract, and ⅛ teaspoon of kosher salt. Whisk the fondue constantly for about 10 minutes. The fondue will thicken as the cornstarch cooks. You can then transfer the dark cocoa fondue to a fondue pot."
                },
                {
                    "headline": "Create the dark chocolate raspberry fondue.",
                    "description": "Measure 2/3 cup (160 ml) of whipping cream, 1/3 cup (110 g) of seedless raspberry preserves, and 1 tablespoon of honey into your fondue pot. Turn the heat on to the warm/simmer setting, so bubbles form along the edges of the pot. Stir the mixture every once in a while to keep it from sticking. Whisk in 2 cups (350 g) of high-quality dark chocolate chips until the chocolate melts completely. You can keep the fondue warm on the warm/simmer setting."
                }
            ]
        },
        {
            "name": "Serving the Fondue",
            "steps": [
                {
                    "headline": "Warm the fondue pot over a tea light candle.",
                    "description": "Run hot water into your clean fondue pot to warm it up a little. Dry the fondue pot completely and set it over a tea light. Light the tea light and transfer your prepared fondue to the pot. Set out skewers for you guests to dip food into the dark chocolate fondue. Since chocolate fondue only needs a little heat to stay warm and liquid, you only need the tea light. You don't need to use a gel or alcohol fuel for it."
                },
                {
                    "headline": "Cut up fresh fruit.",
                    "description": "Fresh fruit is a classic dipper for dark chocolate fondue. Try to cut the fruit just before serving, so it doesn't darken. Leave the fruit in large chunks, so people can dip them in or stick them on skewers. Some good fruits for dark chocolate fondue include:\nStrawberries\nBananas\nPears\nPineapples\nOrange segments"
                },
                {
                    "headline": "Dip desserts in the fondue.",
                    "description": "For a really decadent experience, set out desserts that are cut into large pieces. People can dip the dessert pieces directly in the fondue or stick them on skewers. You can set out:\nPound cake\nAngel food cake\nShortbread cookies\nBrownies\nRice krispy treats"
                },
                {
                    "headline": "Set out snacks to dip.",
                    "description": "If you want to offer fun, creative dippers, set out popular snack items. Several snack items pair well with dark chocolate and have a slightly salty bite. Great snack options include:\nPretzels\nPotato chips\nPopcorn clusters\nMarshmallows\nGraham crackers"
                }
            ]
        }
    ],
    "tyn": [
        "Measuring cups and spoons",
        "Fondue pot",
        "Tea light candle",
        "Lighter",
        "Skewers",
        "Knife and cutting board",
        "Medium saucepan",
        "Whisk"
    ],
    "text": " Making the Fondue Make the easy dark chocolate fondue. Measure 1 cup (236 ml) of heavy whipping cream into a medium saucepan and turn the heat to medium. When the cream starts to bubble a little, turn off the heat and whisk in 12 ounces (340 g) of chopped dark chocolate and a pinch of salt. Keep whisking until the chocolate is melted. This fondue is basically a ganache, so it's important to transfer it to a fondue pot. This will keep it smooth enough to dip foods into. Create the dark chocolate coconut fondue. Pour one 13.5-ounce (398 ml) can of full-fat coconut milk into a medium saucepan. Turn the heat to medium, so the coconut milk liquefies. Stir in 2 teaspoons of vanilla extract and 2 cups (350 g) of high-quality dark chocolate chips until the chocolate melts. Transfer the fondue to a fondue pot. If you use low-fat coconut milk, the fondue may not thicken enough. Make Toblerone dark chocolate honey-almond fondue. Pour 6 tablespoons of whipping cream and 3 tablespoons of honey into a medium saucepan over medium heat. Once the liquid is simmering, chop and whisk in two 3.52-ounce (100 g) bars of Toblerone bittersweet chocolate. When the chocolate is melted you can whisk in 1 tablespoon of kirsch (clear cherry brandy), and 1/4 teaspoon of almond extract. Transfer the fondue to a fondue pot. If you don't have Toblerone bittersweet chocolate, you can substitute 7 ounces (100 g) of semisweet chocolate. Heat dark cocoa fondue. Pour 1 can (12 ounces or 355 ml) of fat-free evaporated milk into a medium saucepan. Whisk 1 tablespoon of cornstarch into it and turn the heat to low. Whisk in ½ cup (50 g) of unsweetened cocoa powder, ½ cup (100 g) of sugar, ½ teaspoon of vanilla extract, and ⅛ teaspoon of kosher salt. Whisk the fondue constantly for about 10 minutes. The fondue will thicken as the cornstarch cooks. You can then transfer the dark cocoa fondue to a fondue pot. Create the dark chocolate raspberry fondue. Measure 2/3 cup (160 ml) of whipping cream, 1/3 cup (110 g) of seedless raspberry preserves, and 1 tablespoon of honey into your fondue pot. Turn the heat on to the warm/simmer setting, so bubbles form along the edges of the pot. Stir the mixture every once in a while to keep it from sticking. Whisk in 2 cups (350 g) of high-quality dark chocolate chips until the chocolate melts completely. You can keep the fondue warm on the warm/simmer setting. Serving the Fondue Warm the fondue pot over a tea light candle. Run hot water into your clean fondue pot to warm it up a little. Dry the fondue pot completely and set it over a tea light. Light the tea light and transfer your prepared fondue to the pot. Set out skewers for you guests to dip food into the dark chocolate fondue. Since chocolate fondue only needs a little heat to stay warm and liquid, you only need the tea light. You don't need to use a gel or alcohol fuel for it. Cut up fresh fruit. Fresh fruit is a classic dipper for dark chocolate fondue. Try to cut the fruit just before serving, so it doesn't darken. Leave the fruit in large chunks, so people can dip them in or stick them on skewers. Some good fruits for dark chocolate fondue include:\nStrawberries\nBananas\nPears\nPineapples\nOrange segments Dip desserts in the fondue. For a really decadent experience, set out desserts that are cut into large pieces. People can dip the dessert pieces directly in the fondue or stick them on skewers. You can set out:\nPound cake\nAngel food cake\nShortbread cookies\nBrownies\nRice krispy treats Set out snacks to dip. If you want to offer fun, creative dippers, set out popular snack items. Several snack items pair well with dark chocolate and have a slightly salty bite. Great snack options include:\nPretzels\nPotato chips\nPopcorn clusters\nMarshmallows\nGraham crackers",
    "sentences": [
        " Making the Fondue Make the easy dark chocolate fondue.",
        "Measure 1 cup (236 ml) of heavy whipping cream into a medium saucepan and turn the heat to medium.",
        "When the cream starts to bubble a little, turn off the heat and whisk in 12 ounces (340 g) of chopped dark chocolate and a pinch of salt.",
        "Keep whisking until the chocolate is melted.",
        "This fondue is basically a ganache, so it's important to transfer it to a fondue pot.",
        "This will keep it smooth enough to dip foods into.",
        "Create the dark chocolate coconut fondue.",
        "Pour one 13.5-ounce (398 ml) can of full-fat coconut milk into a medium saucepan.",
        "Turn the heat to medium, so the coconut milk liquefies.",
        "Stir in 2 teaspoons of vanilla extract and 2 cups (350 g) of high-quality dark chocolate chips until the chocolate melts.",
        "Transfer the fondue to a fondue pot.",
        "If you use low-fat coconut milk, the fondue may not thicken enough.",
        "Make Toblerone dark chocolate honey-almond fondue.",
        "Pour 6 tablespoons of whipping cream and 3 tablespoons of honey into a medium saucepan over medium heat.",
        "Once the liquid is simmering, chop and whisk in two 3.52-ounce (100 g) bars of Toblerone bittersweet chocolate.",
        "When the chocolate is melted you can whisk in 1 tablespoon of kirsch (clear cherry brandy), and 1/4 teaspoon of almond extract.",
        "Transfer the fondue to a fondue pot.",
        "If you don't have Toblerone bittersweet chocolate, you can substitute 7 ounces (100 g) of semisweet chocolate.",
        "Heat dark cocoa fondue.",
        "Pour 1 can (12 ounces or 355 ml) of fat-free evaporated milk into a medium saucepan.",
        "Whisk 1 tablespoon of cornstarch into it and turn the heat to low.",
        "Whisk in ½ cup (50 g) of unsweetened cocoa powder, ½ cup (100 g) of sugar, ½ teaspoon of vanilla extract, and ⅛ teaspoon of kosher salt.",
        "Whisk the fondue constantly for about 10 minutes.",
        "The fondue will thicken as the cornstarch cooks.",
        "You can then transfer the dark cocoa fondue to a fondue pot.",
        "Create the dark chocolate raspberry fondue.",
        "Measure 2/3 cup (160 ml) of whipping cream, 1/3 cup (110 g) of seedless raspberry preserves, and 1 tablespoon of honey into your fondue pot.",
        "Turn the heat on to the warm/simmer setting, so bubbles form along the edges of the pot.",
        "Stir the mixture every once in a while to keep it from sticking.",
        "Whisk in 2 cups (350 g) of high-quality dark chocolate chips until the chocolate melts completely.",
        "You can keep the fondue warm on the warm/simmer setting.",
        "Serving the Fondue Warm the fondue pot over a tea light candle.",
        "Run hot water into your clean fondue pot to warm it up a little.",
        "Dry the fondue pot completely and set it over a tea light.",
        "Light the tea light and transfer your prepared fondue to the pot.",
        "Set out skewers for you guests to dip food into the dark chocolate fondue.",
        "Since chocolate fondue only needs a little heat to stay warm and liquid, you only need the tea light.",
        "You don't need to use a gel or alcohol fuel for it.",
        "Cut up fresh fruit.",
        "Fresh fruit is a classic dipper for dark chocolate fondue.",
        "Try to cut the fruit just before serving, so it doesn't darken.",
        "Leave the fruit in large chunks, so people can dip them in or stick them on skewers.",
        "Some good fruits for dark chocolate fondue include:\nStrawberries\nBananas\nPears\nPineapples\nOrange segments Dip desserts in the fondue.",
        "For a really decadent experience, set out desserts that are cut into large pieces.",
        "People can dip the dessert pieces directly in the fondue or stick them on skewers.",
        "You can set out:\nPound cake\nAngel food cake\nShortbread cookies\nBrownies\nRice krispy treats Set out snacks to dip.",
        "If you want to offer fun, creative dippers, set out popular snack items.",
        "Several snack items pair well with dark chocolate and have a slightly salty bite.",
        "Great snack options include:\nPretzels\nPotato chips\nPopcorn clusters\nMarshmallows\nGraham crackers"
    ]
}