{
    "title": "How to Cook Baby Lima Beans",
    "url": "https://www.wikihow.com/Cook-Baby-Lima-Beans",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Rice and Beans"
    ],
    "methods": [
        {
            "name": "Making Basic Baby Lima Beans",
            "steps": [
                {
                    "headline": "Sort and rinse the beans.",
                    "description": "Fill up one cup (236.6 g) of lima beans and spread them out on a pan or towel. Pick through them for shriveled and broken beans or debris. Then, rinse the beans in cold water. You can use a colander to rinse them."
                },
                {
                    "headline": "Soak the beans overnight.",
                    "description": "Put the sorted beans into a bowl filled with two or three inches (5.1 or 7.6 cm) of water. The water should be at room temperature. Allow the beans to soak overnight. If you can’t soak them overnight, soak them for at least eight hours. Drain the bowl of all the water when the beans are finished soaking and rinse them in cool water one more time. Soak the beans in the refrigerator if your kitchen gets very warm. Soaking the beans helps to remove indigestible sugars."
                },
                {
                    "headline": "Put the beans in a saucepan.",
                    "description": "You can also use a pressure cooker to cook the beans. Add four cups (946.4 mL) of water to the one cup (236.6 g) of beans. The water should rise an inch or two (2.5 or 5.1 cm) over the beans. If you choose to cook more than one cup of beans, then add four cups of water for each additional cup of beans."
                },
                {
                    "headline": "Bring the water to a boil.",
                    "description": "Reduce the heat when the water begins to boil. Let the beans simmer for about 45 minutes. If you have a pressure cooker, allow the beans to cook for three to five minutes."
                },
                {
                    "headline": "Serve the cooked beans.",
                    "description": "You can serve the beans as a side, or you can mix them into a salad, soup, or casserole. If serving as a side, add a small amount of butter and/or pepper to the beans for flavor. Fresh baby lima beans can last up to one week if stored in a refrigerated area, but cooked beans will only be good for one day even when refrigerated."
                }
            ]
        },
        {
            "name": "Preparing Seasoned Baby Lima Beans",
            "steps": [
                {
                    "headline": "Wash the beans.",
                    "description": "Take the two pounds or a ten-ounce package of fresh beans out of the packaging. The frozen package is lighter because the beans have already been shelled. Make sure there isn’t any debris mixed in with the beans. Then, use a colander to wash the beans under cold water. Drain any excess water out of the bowl."
                },
                {
                    "headline": "Add water, salt, and beans to the saucepan .",
                    "description": "Put two cups (473.2 mL) of water in the saucepan. Add ½ tablespoon (2.47 mL) of salt to the water. Pour the beans into the pan."
                },
                {
                    "headline": "Turn the heat to a medium setting.",
                    "description": "Cook the beans until they are tender. Stir the beans around occasionally so that they don’t stick. This should take about thirty minutes."
                },
                {
                    "headline": "Drain the liquid.",
                    "description": "Drain the excess liquid from the saucepan when the beans are finished cooking. Add two tablespoons of butter to the beans. Stir the beans slightly so that the butter mixes in."
                },
                {
                    "headline": "Sprinkle black pepper.",
                    "description": "Add ¼ tablespoon of coarse ground pepper to the beans. You can then remove the beans from the saucepan. Serve the beans at whatever temperature you prefer."
                }
            ]
        },
        {
            "name": "Cooking Chicken Broth Baby Lima Beans",
            "steps": [
                {
                    "headline": "Heat the saucepan on the stove.",
                    "description": "Use a large saucepan. Turn the heat to a medium setting. Spray the cooking spray onto the pan. You can cover the beans and store them in the refrigerator, but for no more than a few days."
                },
                {
                    "headline": "Sauté onions.",
                    "description": "Use one half of a finely chopped onion. Put the chopped onion into the heated saucepan. Stir them occasionally. Sauté the onions until they become soft and turn translucent. This should take about 5 to 7 minutes."
                },
                {
                    "headline": "Pour in the chicken broth.",
                    "description": "Pour 1 ½ cups (354.9 mL) of chicken broth into the saucepan. You can use any type of chicken broth that you’d like. Bring the broth to a broil."
                },
                {
                    "headline": "Add in the lima beans.",
                    "description": "Pour one 16-ounce (170.1 g) bag of lima beans into the saucepan. You don’t need to sort, rinse, and soak them since they have been frozen. Add water to the pan. You should only add enough water to cover the beans."
                },
                {
                    "headline": "Turn the heat to a high setting.",
                    "description": "Bring the water to a boil. Turn the heat to a low setting once the broth begins boiling. Then, cover the saucepan. Allow the beans to simmer for thirty minutes until they are tender."
                }
            ]
        }
    ],
    "tyn": [
        "Saucepan",
        "Colander",
        "Big spoon (for stirring)",
        "Bowl for soaking",
        "Pot",
        "Medium saucepan"
    ],
    "text": " Making Basic Baby Lima Beans Sort and rinse the beans. Fill up one cup (236.6 g) of lima beans and spread them out on a pan or towel. Pick through them for shriveled and broken beans or debris. Then, rinse the beans in cold water. You can use a colander to rinse them. Soak the beans overnight. Put the sorted beans into a bowl filled with two or three inches (5.1 or 7.6 cm) of water. The water should be at room temperature. Allow the beans to soak overnight. If you can’t soak them overnight, soak them for at least eight hours. Drain the bowl of all the water when the beans are finished soaking and rinse them in cool water one more time. Soak the beans in the refrigerator if your kitchen gets very warm. Soaking the beans helps to remove indigestible sugars. Put the beans in a saucepan. You can also use a pressure cooker to cook the beans. Add four cups (946.4 mL) of water to the one cup (236.6 g) of beans. The water should rise an inch or two (2.5 or 5.1 cm) over the beans. If you choose to cook more than one cup of beans, then add four cups of water for each additional cup of beans. Bring the water to a boil. Reduce the heat when the water begins to boil. Let the beans simmer for about 45 minutes. If you have a pressure cooker, allow the beans to cook for three to five minutes. Serve the cooked beans. You can serve the beans as a side, or you can mix them into a salad, soup, or casserole. If serving as a side, add a small amount of butter and/or pepper to the beans for flavor. Fresh baby lima beans can last up to one week if stored in a refrigerated area, but cooked beans will only be good for one day even when refrigerated. Preparing Seasoned Baby Lima Beans Wash the beans. Take the two pounds or a ten-ounce package of fresh beans out of the packaging. The frozen package is lighter because the beans have already been shelled. Make sure there isn’t any debris mixed in with the beans. Then, use a colander to wash the beans under cold water. Drain any excess water out of the bowl. Add water, salt, and beans to the saucepan . Put two cups (473.2 mL) of water in the saucepan. Add ½ tablespoon (2.47 mL) of salt to the water. Pour the beans into the pan. Turn the heat to a medium setting. Cook the beans until they are tender. Stir the beans around occasionally so that they don’t stick. This should take about thirty minutes. Drain the liquid. Drain the excess liquid from the saucepan when the beans are finished cooking. Add two tablespoons of butter to the beans. Stir the beans slightly so that the butter mixes in. Sprinkle black pepper. Add ¼ tablespoon of coarse ground pepper to the beans. You can then remove the beans from the saucepan. Serve the beans at whatever temperature you prefer. Cooking Chicken Broth Baby Lima Beans Heat the saucepan on the stove. Use a large saucepan. Turn the heat to a medium setting. Spray the cooking spray onto the pan. You can cover the beans and store them in the refrigerator, but for no more than a few days. Sauté onions. Use one half of a finely chopped onion. Put the chopped onion into the heated saucepan. Stir them occasionally. Sauté the onions until they become soft and turn translucent. This should take about 5 to 7 minutes. Pour in the chicken broth. Pour 1 ½ cups (354.9 mL) of chicken broth into the saucepan. You can use any type of chicken broth that you’d like. Bring the broth to a broil. Add in the lima beans. Pour one 16-ounce (170.1 g) bag of lima beans into the saucepan. You don’t need to sort, rinse, and soak them since they have been frozen. Add water to the pan. You should only add enough water to cover the beans. Turn the heat to a high setting. Bring the water to a boil. Turn the heat to a low setting once the broth begins boiling. Then, cover the saucepan. Allow the beans to simmer for thirty minutes until they are tender.",
    "sentences": [
        " Making Basic Baby Lima Beans Sort and rinse the beans.",
        "Fill up one cup (236.6 g) of lima beans and spread them out on a pan or towel.",
        "Pick through them for shriveled and broken beans or debris.",
        "Then, rinse the beans in cold water.",
        "You can use a colander to rinse them.",
        "Soak the beans overnight.",
        "Put the sorted beans into a bowl filled with two or three inches (5.1 or 7.6 cm) of water.",
        "The water should be at room temperature.",
        "Allow the beans to soak overnight.",
        "If you can’t soak them overnight, soak them for at least eight hours.",
        "Drain the bowl of all the water when the beans are finished soaking and rinse them in cool water one more time.",
        "Soak the beans in the refrigerator if your kitchen gets very warm.",
        "Soaking the beans helps to remove indigestible sugars.",
        "Put the beans in a saucepan.",
        "You can also use a pressure cooker to cook the beans.",
        "Add four cups (946.4 mL) of water to the one cup (236.6 g) of beans.",
        "The water should rise an inch or two (2.5 or 5.1 cm) over the beans.",
        "If you choose to cook more than one cup of beans, then add four cups of water for each additional cup of beans.",
        "Bring the water to a boil.",
        "Reduce the heat when the water begins to boil.",
        "Let the beans simmer for about 45 minutes.",
        "If you have a pressure cooker, allow the beans to cook for three to five minutes.",
        "Serve the cooked beans.",
        "You can serve the beans as a side, or you can mix them into a salad, soup, or casserole.",
        "If serving as a side, add a small amount of butter and/or pepper to the beans for flavor.",
        "Fresh baby lima beans can last up to one week if stored in a refrigerated area, but cooked beans will only be good for one day even when refrigerated.",
        "Preparing Seasoned Baby Lima Beans Wash the beans.",
        "Take the two pounds or a ten-ounce package of fresh beans out of the packaging.",
        "The frozen package is lighter because the beans have already been shelled.",
        "Make sure there isn’t any debris mixed in with the beans.",
        "Then, use a colander to wash the beans under cold water.",
        "Drain any excess water out of the bowl.",
        "Add water, salt, and beans to the saucepan .",
        "Put two cups (473.2 mL) of water in the saucepan.",
        "Add ½ tablespoon (2.47 mL) of salt to the water.",
        "Pour the beans into the pan.",
        "Turn the heat to a medium setting.",
        "Cook the beans until they are tender.",
        "Stir the beans around occasionally so that they don’t stick.",
        "This should take about thirty minutes.",
        "Drain the liquid.",
        "Drain the excess liquid from the saucepan when the beans are finished cooking.",
        "Add two tablespoons of butter to the beans.",
        "Stir the beans slightly so that the butter mixes in.",
        "Sprinkle black pepper.",
        "Add ¼ tablespoon of coarse ground pepper to the beans.",
        "You can then remove the beans from the saucepan.",
        "Serve the beans at whatever temperature you prefer.",
        "Cooking Chicken Broth Baby Lima Beans Heat the saucepan on the stove.",
        "Use a large saucepan.",
        "Turn the heat to a medium setting.",
        "Spray the cooking spray onto the pan.",
        "You can cover the beans and store them in the refrigerator, but for no more than a few days.",
        "Sauté onions.",
        "Use one half of a finely chopped onion.",
        "Put the chopped onion into the heated saucepan.",
        "Stir them occasionally.",
        "Sauté the onions until they become soft and turn translucent.",
        "This should take about 5 to 7 minutes.",
        "Pour in the chicken broth.",
        "Pour 1 ½ cups (354.9 mL) of chicken broth into the saucepan.",
        "You can use any type of chicken broth that you’d like.",
        "Bring the broth to a broil.",
        "Add in the lima beans.",
        "Pour one 16-ounce (170.1 g) bag of lima beans into the saucepan.",
        "You don’t need to sort, rinse, and soak them since they have been frozen.",
        "Add water to the pan.",
        "You should only add enough water to cover the beans.",
        "Turn the heat to a high setting.",
        "Bring the water to a boil.",
        "Turn the heat to a low setting once the broth begins boiling.",
        "Then, cover the saucepan.",
        "Allow the beans to simmer for thirty minutes until they are tender."
    ]
}