{
    "title": "How to Make American Ginseng Tea",
    "url": "https://www.wikihow.com/Make-American-Ginseng-Tea",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Tea",
        "Herbal Tea"
    ],
    "methods": [
        {
            "name": "Kettle Tea",
            "steps": [
                {
                    "headline": "Place 1 tablespoon of finely chopped ginseng root into a mug.",
                    "description": "If you have a tea ball, you can put the root into that first. This way, you won't have to strain it out later. You can slice the fresh ginseng root using a sharp knife or a vegetable peeler."
                },
                {
                    "headline": "Boil some water in a kettle.",
                    "description": "Fill your kettle with water, then let it come to a boil. It is best if you use purified water for this. Because water evaporates as it cooks, boil more water than you think you might need."
                },
                {
                    "headline": "Let the water cool for 2 minutes.",
                    "description": "Once the water has come to a boil, take it off of the heat, and let it cool for 2 minutes. High levels of heat can destroy the beneficial properties of many herbs, including ginseng."
                },
                {
                    "headline": "Pour 1 cup (240 milliliters) of the boiled water into the cup.",
                    "description": "Measure out the water first, then pour it straight into the cup with the ginseng in it."
                },
                {
                    "headline": "Let the tea steep for 5 to 10 minutes.",
                    "description": "Some people like to place a saucer over the mug so that the tea doesn't cool down too much. The longer you steep the tea, the stronger it will be."
                },
                {
                    "headline": "Strain the tea.",
                    "description": "If you used a tea ball, simply pull the tea ball out and discard the root. If you did not use a tea ball, pour the tea through a fine mesh strainer into another mug."
                },
                {
                    "headline": "Drink the tea.",
                    "description": "It tastes best while it is still warm, but you can drink it cold too. If you are using this tea for medicinal purposes, you can take it 1 to 3 times daily for 3 to 4 weeks."
                }
            ]
        },
        {
            "name": "Saucepan Tea",
            "steps": [
                {
                    "headline": "Fill a saucepan with water.",
                    "description": "You will need 1 cup (240 milliliters) of water for each serving of tea that you will be making. This is a great option if you need to make several servings of tea at one time."
                },
                {
                    "headline": "Add the ginseng.",
                    "description": "You will need 1 tablespoon of dried ginseng root for each serving of tea."
                },
                {
                    "headline": "Heat the water over low heat.",
                    "description": "Do not let it come to a boil. Boiling water can destroy the beneficial properties of ginseng."
                },
                {
                    "headline": "Allow the ginseng to steep for up to 20 minutes.",
                    "description": "The longer you steep it, the stronger the tea will be. As the tea steeps, you can cover the pot with a lid; this way, the tea won't cool off too past."
                },
                {
                    "headline": "Pour the tea through a fine, mesh strainer into a mug.",
                    "description": "Discard the root that is caught in the strainer."
                },
                {
                    "headline": "Serve the tea.",
                    "description": "It tastes best while it is hot, but you can also drink it cold as well. If you want to, you can enhance its flavor with some lemon or honey."
                }
            ]
        }
    ],
    "tyn": [
        "Using a Kettle",
        "Kettle",
        "Tea cup",
        "Tea ball (optional)",
        "Fine, mesh strainer",
        "Using a Saucepan",
        "Saucepan"
    ],
    "text": " Kettle Tea Place 1 tablespoon of finely chopped ginseng root into a mug. If you have a tea ball, you can put the root into that first. This way, you won't have to strain it out later. You can slice the fresh ginseng root using a sharp knife or a vegetable peeler. Boil some water in a kettle. Fill your kettle with water, then let it come to a boil. It is best if you use purified water for this. Because water evaporates as it cooks, boil more water than you think you might need. Let the water cool for 2 minutes. Once the water has come to a boil, take it off of the heat, and let it cool for 2 minutes. High levels of heat can destroy the beneficial properties of many herbs, including ginseng. Pour 1 cup (240 milliliters) of the boiled water into the cup. Measure out the water first, then pour it straight into the cup with the ginseng in it. Let the tea steep for 5 to 10 minutes. Some people like to place a saucer over the mug so that the tea doesn't cool down too much. The longer you steep the tea, the stronger it will be. Strain the tea. If you used a tea ball, simply pull the tea ball out and discard the root. If you did not use a tea ball, pour the tea through a fine mesh strainer into another mug. Drink the tea. It tastes best while it is still warm, but you can drink it cold too. If you are using this tea for medicinal purposes, you can take it 1 to 3 times daily for 3 to 4 weeks. Saucepan Tea Fill a saucepan with water. You will need 1 cup (240 milliliters) of water for each serving of tea that you will be making. This is a great option if you need to make several servings of tea at one time. Add the ginseng. You will need 1 tablespoon of dried ginseng root for each serving of tea. Heat the water over low heat. Do not let it come to a boil. Boiling water can destroy the beneficial properties of ginseng. Allow the ginseng to steep for up to 20 minutes. The longer you steep it, the stronger the tea will be. As the tea steeps, you can cover the pot with a lid; this way, the tea won't cool off too past. Pour the tea through a fine, mesh strainer into a mug. Discard the root that is caught in the strainer. Serve the tea. It tastes best while it is hot, but you can also drink it cold as well. If you want to, you can enhance its flavor with some lemon or honey.",
    "sentences": [
        " Kettle Tea Place 1 tablespoon of finely chopped ginseng root into a mug.",
        "If you have a tea ball, you can put the root into that first.",
        "This way, you won't have to strain it out later.",
        "You can slice the fresh ginseng root using a sharp knife or a vegetable peeler.",
        "Boil some water in a kettle.",
        "Fill your kettle with water, then let it come to a boil.",
        "It is best if you use purified water for this.",
        "Because water evaporates as it cooks, boil more water than you think you might need.",
        "Let the water cool for 2 minutes.",
        "Once the water has come to a boil, take it off of the heat, and let it cool for 2 minutes.",
        "High levels of heat can destroy the beneficial properties of many herbs, including ginseng.",
        "Pour 1 cup (240 milliliters) of the boiled water into the cup.",
        "Measure out the water first, then pour it straight into the cup with the ginseng in it.",
        "Let the tea steep for 5 to 10 minutes.",
        "Some people like to place a saucer over the mug so that the tea doesn't cool down too much.",
        "The longer you steep the tea, the stronger it will be.",
        "Strain the tea.",
        "If you used a tea ball, simply pull the tea ball out and discard the root.",
        "If you did not use a tea ball, pour the tea through a fine mesh strainer into another mug.",
        "Drink the tea.",
        "It tastes best while it is still warm, but you can drink it cold too.",
        "If you are using this tea for medicinal purposes, you can take it 1 to 3 times daily for 3 to 4 weeks.",
        "Saucepan Tea Fill a saucepan with water.",
        "You will need 1 cup (240 milliliters) of water for each serving of tea that you will be making.",
        "This is a great option if you need to make several servings of tea at one time.",
        "Add the ginseng.",
        "You will need 1 tablespoon of dried ginseng root for each serving of tea.",
        "Heat the water over low heat.",
        "Do not let it come to a boil.",
        "Boiling water can destroy the beneficial properties of ginseng.",
        "Allow the ginseng to steep for up to 20 minutes.",
        "The longer you steep it, the stronger the tea will be.",
        "As the tea steeps, you can cover the pot with a lid; this way, the tea won't cool off too past.",
        "Pour the tea through a fine, mesh strainer into a mug.",
        "Discard the root that is caught in the strainer.",
        "Serve the tea.",
        "It tastes best while it is hot, but you can also drink it cold as well.",
        "If you want to, you can enhance its flavor with some lemon or honey."
    ]
}