{
    "title": "How to Make Skillet Dinner Rolls",
    "url": "https://www.wikihow.com/Make-Skillet-Dinner-Rolls",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking",
        "Breads",
        "Bread Rolls"
    ],
    "methods": [
        {
            "name": "Making Classic Skillet Dinner Rolls From Scratch",
            "steps": [
                {
                    "headline": "Combine the dry ingredients.",
                    "description": "Get out a large mixing bowl and measure 1 cup (125 g) of the all-purpose flour into it. Open two 0.25 ounce (7 g) envelopes of instant yeast and pour it into one side of the bowl. Put 3 tablespoons of sugar and 3/4 teaspoon of salt in the other side of the bowl. Whisk the dry ingredients for about 30 seconds to combine them. You don't want the yeast to come into direct contact with the salt. The salt can stop the yeast from activating. You can use instant or rapid rise yeast. If you'd like to use active dry yeast, you'll need to activate it in a liquid before adding it to the recipe."
                },
                {
                    "headline": "Heat the wet ingredients.",
                    "description": "Pour the wet ingredients into a small saucepan and heat them on low heat. Check the temperature occasionally and turn it off when the mixture reaches 120 to 130 degrees F (50 to 55 C). You'll need:\n1 cup (236 ml) water\n2 tablespoons vegetable oil\n4 tablespoons (57 g) of the butter"
                },
                {
                    "headline": "Beat the dough.",
                    "description": "Pour the warm liquid mixture into the bowl with the dry ingredients and stir them on low for about 30 seconds. Use a stand mixer to beat the dough for 2 minutes at medium speed. Gradually add 1/2 cup (62 g) of flour and keep beating the dough for another two minutes. The dough should begin to pull away from the sides of the bowl and form a dough. If the dough is still too sticky, add a little extra flour. If you don't have a stand mixer, you can beat the dough by hand. Just use a sturdy wooden spoon and beat the dough until a soft ball forms."
                },
                {
                    "headline": "Knead the dough and let it rest.",
                    "description": "Sprinkle a little flour on your work surface and dump the dough onto it. Knead the dough for about 5 to 7 minutes. The dough should become smooth and elastic. Lay a towel over the dough and let it rest for 10 minutes before you shape it. You can knead the dough any way you like. A good starter method is to use the palm of your hand to push the dough away from you. Fold the dough back over and turn the dough 45 degrees. Push it away from you again. Continue pushing, folding, and turning."
                },
                {
                    "headline": "Shape the dough into rolls.",
                    "description": "Remove the towel and divide the dough into 12 even pieces. You can use a bench scraper to easily cut the dough into pieces. Take each piece and gently roll it in the palm of your hand to form a ball. Do this for every piece of dough. Spray a 10 to 12-inch (25 to 30-cm) skillet with cooking spray and place all of the balls in the skillet. The rolls will spread into each other slightly as they bake."
                },
                {
                    "headline": "Prove the rolls and preheat the oven.",
                    "description": "Turn the oven on to 375 degrees F (190 C). Lay a towel or greased sheet of plastic wrap over the skillet. Let the rolls prove for about 30 to 45 minutes. They should double in volume. Put the rolls in a warm place to rest while the oven heats up."
                },
                {
                    "headline": "Brush the rolls with butter and bake them.",
                    "description": "Remove the covering from the skillet. Melt the last 2 tablespoons of butter in a small prep bowl. Dip a pastry brush in the butter and spread it over the rolls once they've risen. Put the skillet in the oven and bake them for 18 to 20 minutes. They should turn a little golden. You can serve the dinner rolls right out of the skillet or transfer them to a serving bowl."
                }
            ]
        },
        {
            "name": "Making Sea Salt and Herb Skillet Rolls From Scratch",
            "steps": [
                {
                    "headline": "Activate the yeast in the warm milk.",
                    "description": "Heat 1 cup (236 ml) of whole milk to 110 degrees F (40 C). Pour it into a mixing bowl and sprinkle 2 1/4 teaspoons (1 packet or 7 g) of active dry yeast and 1/2 teaspoon of sugar over the milk. Whisk the mixture a little and let it rest for 5 minutes. If the yeast has activated properly, the mixture will look a little frothy or foamy after 5 minutes. If it hasn't frothed at all, you will need to start again. Ensure that your active yeast hasn't expired."
                },
                {
                    "headline": "Combine the rest of the dough ingredients.",
                    "description": "While you can mix the dough by hand, it's easier to use a stand mixer. Turn the mixer on to low and stir in:\n2 tablespoons sugar\n1 large egg, at room temperature\n2 tablespoons butter\n1 teaspoon salt\n2 teaspoons dried rosemary\n2 teaspoons dried basil\n2 teaspoons dried parsley\n1 teaspoon garlic powder (or 1 1/2 teaspoons minced garlic)\n2 cups (250 g) of the bread flour"
                },
                {
                    "headline": "Beat the dough.",
                    "description": "Beat the dough for one minute on low and stir in the last one cup (125 g) of bread flour. Beat it for another minute as the dough comes together. The dough should begin to pull away from the sides of the bowl and form a shaggy mass. If the dough is still too sticky and clings to the sides, add one tablespoon of flour at a time until it pulls away."
                },
                {
                    "headline": "Knead the roll dough.",
                    "description": "Sprinkle a little flour on your work surface and dump the dough onto it. Knead the dough for 2 minutes. The dough should become smooth and elastic. You can knead the dough any way you like. A good starter method is to use the palm of your hand to push the dough away from you. Fold the dough back over and turn the dough 45 degrees. Push it away from you again. Continue pushing, folding, and turning."
                },
                {
                    "headline": "Prove the dough.",
                    "description": "Spray a large bowl with cooking spray and roll the dough in it, so the dough is completely coated in oil. You should also spray a sheet of plastic wrap and lay it over the bowl with the dough. Let the dough rest in a warm place for about 2 hours. It should double in volume. Proving, or resting the dough, just lets the yeast expand, so your dough rises."
                },
                {
                    "headline": "Punch down the dough and shape the rolls.",
                    "description": "Remove the plastic wrap and dump the dough onto a floured surface. Punch down right in the middle of the dough, so any air trapped in the dough is released. Use a bench scraper or knife to divide the dough into 12 pieces. Each piece should be about the size of a golf ball."
                },
                {
                    "headline": "Prove the rolls and preheat the oven.",
                    "description": "Turn the oven on to 350 degrees F (180 C). Spray a 10 to 12-inch (25 to 30-cm) skillet with cooking spray and place the rolls in it. Melt the last 2 tablespoons of butter in a small prep bowl and dip a pastry brush in it. Brush the rolls with the melted butter and sprinkle the tops with coarse sea salt. Lay the plastic wrap on top of the rolls and let them prove for 30 to 45 minutes. They should double in volume. Just set the same greased plastic wrap that you used before over the skillet. You don't need to cover the skillet tightly or the wrap may stick to the dough."
                },
                {
                    "headline": "Bake the sea salt and herb skillet rolls.",
                    "description": "Remove the plastic wrap and put the skillet in the oven. Bake the rolls for 25 to 28 minutes. They should become golden brown. Carefully remove them from the oven and serve them with leftover melted butter. You can store the leftover rolls in the refrigerator for up to one week. You can also freeze them in an airtight container for up to three months."
                }
            ]
        },
        {
            "name": "Making Buttered Rosemary or Honey Skillet Rolls Using Frozen Rolls",
            "steps": [
                {
                    "headline": "Preheat the oven and prepare the skillet.",
                    "description": "Turn the oven on to 400 degrees F (200 C). Spray a 10 to 12-inch (25 to 30-cm) skillet with cooking spray or brush it with olive oil. This will keep the rolls from sticking in the pan. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/a\\/ab\\/Make-Skillet-Dinner-Rolls-Step-16.jpg\",\"bigUrl\":\"\\/images\\/thumb\\/a\\/ab\\/Make-Skillet-Dinner-Rolls-Step-16.jpg\\/v4-190px-Make-Skillet-Dinner-Rolls-Step-16.jpg\",\"smallWidth\":460,\"smallHeight\":307,\"bigWidth\":\"190\",\"bigHeight\":\"127\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\nFollow the specific oven temperature on the package of dinner rolls you're using."
                },
                {
                    "headline": "Prove the dinner rolls.",
                    "description": "Place about 7 frozen, uncooked dinner rolls in the skillet. The rolls shouldn't be touching. Lay a clean cloth over the rolls and let them prove for one to 2 hours, so they double in size. Proving just lets the dough rest and expand in volume. Try to prove the dough in a warm, draft-free place."
                },
                {
                    "headline": "Prepare the buttered rosemary version.",
                    "description": "To make savory rolls, melt 4 tablespoons (57 g) of salted butter. Use a pastry brush to gently spread the butter over the rolls after they've risen. Coarsely chop 1 sprig of fresh rosemary and sprinkle it over the tops of the rolls along with several pinches of coarse sea salt. Save any leftover melted butter for brushing on the rolls after they've baked."
                },
                {
                    "headline": "Prepare the honey version.",
                    "description": "To make sweet skillet dinner rolls, melt 1 tablespoon of butter in a small prep bowl. Stir in 1/6 cup (33 g) of sugar, 1 tablespoon of honey, and 1 large egg white until the ingredients are combined. Use a pastry brush to spread the honey glaze over the rolls after they've risen."
                },
                {
                    "headline": "Bake the skillet dinner rolls.",
                    "description": "Put the skillet in the preheated oven and follow the manufacturer's instructions for bake times. For example, if your package recommends 400 degrees F (200 C), you'll probably want to bake the rolls for 15 to 20 minutes. Remove the rolls once they're a rich golden brown color and firm to the touch. Serve the rolls with additional melted butter or glaze."
                }
            ]
        }
    ],
    "tyn": [
        "Measuring cups and spoons",
        "10 to 12-inch (25 to 30-cm) skillet",
        "Cooking spray",
        "Pastry brush",
        "Small saucepan",
        "Stand mixer",
        "Knife and cutting board",
        "Mixing bowl (preferably clear)",
        "Thermometer",
        "Whisk",
        "Oven",
        "Bench scraper or kitchen shears",
        "Clean towel"
    ],
    "text": " Making Classic Skillet Dinner Rolls From Scratch Combine the dry ingredients. Get out a large mixing bowl and measure 1 cup (125 g) of the all-purpose flour into it. Open two 0.25 ounce (7 g) envelopes of instant yeast and pour it into one side of the bowl. Put 3 tablespoons of sugar and 3/4 teaspoon of salt in the other side of the bowl. Whisk the dry ingredients for about 30 seconds to combine them. You don't want the yeast to come into direct contact with the salt. The salt can stop the yeast from activating. You can use instant or rapid rise yeast. If you'd like to use active dry yeast, you'll need to activate it in a liquid before adding it to the recipe. Heat the wet ingredients. Pour the wet ingredients into a small saucepan and heat them on low heat. Check the temperature occasionally and turn it off when the mixture reaches 120 to 130 degrees F (50 to 55 C). You'll need:\n1 cup (236 ml) water\n2 tablespoons vegetable oil\n4 tablespoons (57 g) of the butter Beat the dough. Pour the warm liquid mixture into the bowl with the dry ingredients and stir them on low for about 30 seconds. Use a stand mixer to beat the dough for 2 minutes at medium speed. Gradually add 1/2 cup (62 g) of flour and keep beating the dough for another two minutes. The dough should begin to pull away from the sides of the bowl and form a dough. If the dough is still too sticky, add a little extra flour. If you don't have a stand mixer, you can beat the dough by hand. Just use a sturdy wooden spoon and beat the dough until a soft ball forms. Knead the dough and let it rest. Sprinkle a little flour on your work surface and dump the dough onto it. Knead the dough for about 5 to 7 minutes. The dough should become smooth and elastic. Lay a towel over the dough and let it rest for 10 minutes before you shape it. You can knead the dough any way you like. A good starter method is to use the palm of your hand to push the dough away from you. Fold the dough back over and turn the dough 45 degrees. Push it away from you again. Continue pushing, folding, and turning. Shape the dough into rolls. Remove the towel and divide the dough into 12 even pieces. You can use a bench scraper to easily cut the dough into pieces. Take each piece and gently roll it in the palm of your hand to form a ball. Do this for every piece of dough. Spray a 10 to 12-inch (25 to 30-cm) skillet with cooking spray and place all of the balls in the skillet. The rolls will spread into each other slightly as they bake. Prove the rolls and preheat the oven. Turn the oven on to 375 degrees F (190 C). Lay a towel or greased sheet of plastic wrap over the skillet. Let the rolls prove for about 30 to 45 minutes. They should double in volume. Put the rolls in a warm place to rest while the oven heats up. Brush the rolls with butter and bake them. Remove the covering from the skillet. Melt the last 2 tablespoons of butter in a small prep bowl. Dip a pastry brush in the butter and spread it over the rolls once they've risen. Put the skillet in the oven and bake them for 18 to 20 minutes. They should turn a little golden. You can serve the dinner rolls right out of the skillet or transfer them to a serving bowl. Making Sea Salt and Herb Skillet Rolls From Scratch Activate the yeast in the warm milk. Heat 1 cup (236 ml) of whole milk to 110 degrees F (40 C). Pour it into a mixing bowl and sprinkle 2 1/4 teaspoons (1 packet or 7 g) of active dry yeast and 1/2 teaspoon of sugar over the milk. Whisk the mixture a little and let it rest for 5 minutes. If the yeast has activated properly, the mixture will look a little frothy or foamy after 5 minutes. If it hasn't frothed at all, you will need to start again. Ensure that your active yeast hasn't expired. Combine the rest of the dough ingredients. While you can mix the dough by hand, it's easier to use a stand mixer. Turn the mixer on to low and stir in:\n2 tablespoons sugar\n1 large egg, at room temperature\n2 tablespoons butter\n1 teaspoon salt\n2 teaspoons dried rosemary\n2 teaspoons dried basil\n2 teaspoons dried parsley\n1 teaspoon garlic powder (or 1 1/2 teaspoons minced garlic)\n2 cups (250 g) of the bread flour Beat the dough. Beat the dough for one minute on low and stir in the last one cup (125 g) of bread flour. Beat it for another minute as the dough comes together. The dough should begin to pull away from the sides of the bowl and form a shaggy mass. If the dough is still too sticky and clings to the sides, add one tablespoon of flour at a time until it pulls away. Knead the roll dough. Sprinkle a little flour on your work surface and dump the dough onto it. Knead the dough for 2 minutes. The dough should become smooth and elastic. You can knead the dough any way you like. A good starter method is to use the palm of your hand to push the dough away from you. Fold the dough back over and turn the dough 45 degrees. Push it away from you again. Continue pushing, folding, and turning. Prove the dough. Spray a large bowl with cooking spray and roll the dough in it, so the dough is completely coated in oil. You should also spray a sheet of plastic wrap and lay it over the bowl with the dough. Let the dough rest in a warm place for about 2 hours. It should double in volume. Proving, or resting the dough, just lets the yeast expand, so your dough rises. Punch down the dough and shape the rolls. Remove the plastic wrap and dump the dough onto a floured surface. Punch down right in the middle of the dough, so any air trapped in the dough is released. Use a bench scraper or knife to divide the dough into 12 pieces. Each piece should be about the size of a golf ball. Prove the rolls and preheat the oven. Turn the oven on to 350 degrees F (180 C). Spray a 10 to 12-inch (25 to 30-cm) skillet with cooking spray and place the rolls in it. Melt the last 2 tablespoons of butter in a small prep bowl and dip a pastry brush in it. Brush the rolls with the melted butter and sprinkle the tops with coarse sea salt. Lay the plastic wrap on top of the rolls and let them prove for 30 to 45 minutes. They should double in volume. Just set the same greased plastic wrap that you used before over the skillet. You don't need to cover the skillet tightly or the wrap may stick to the dough. Bake the sea salt and herb skillet rolls. Remove the plastic wrap and put the skillet in the oven. Bake the rolls for 25 to 28 minutes. They should become golden brown. Carefully remove them from the oven and serve them with leftover melted butter. You can store the leftover rolls in the refrigerator for up to one week. You can also freeze them in an airtight container for up to three months. Making Buttered Rosemary or Honey Skillet Rolls Using Frozen Rolls Preheat the oven and prepare the skillet. Turn the oven on to 400 degrees F (200 C). Spray a 10 to 12-inch (25 to 30-cm) skillet with cooking spray or brush it with olive oil. This will keep the rolls from sticking in the pan. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/a\\/ab\\/Make-Skillet-Dinner-Rolls-Step-16.jpg\",\"bigUrl\":\"\\/images\\/thumb\\/a\\/ab\\/Make-Skillet-Dinner-Rolls-Step-16.jpg\\/v4-190px-Make-Skillet-Dinner-Rolls-Step-16.jpg\",\"smallWidth\":460,\"smallHeight\":307,\"bigWidth\":\"190\",\"bigHeight\":\"127\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\nFollow the specific oven temperature on the package of dinner rolls you're using. Prove the dinner rolls. Place about 7 frozen, uncooked dinner rolls in the skillet. The rolls shouldn't be touching. Lay a clean cloth over the rolls and let them prove for one to 2 hours, so they double in size. Proving just lets the dough rest and expand in volume. Try to prove the dough in a warm, draft-free place. Prepare the buttered rosemary version. To make savory rolls, melt 4 tablespoons (57 g) of salted butter. Use a pastry brush to gently spread the butter over the rolls after they've risen. Coarsely chop 1 sprig of fresh rosemary and sprinkle it over the tops of the rolls along with several pinches of coarse sea salt. Save any leftover melted butter for brushing on the rolls after they've baked. Prepare the honey version. To make sweet skillet dinner rolls, melt 1 tablespoon of butter in a small prep bowl. Stir in 1/6 cup (33 g) of sugar, 1 tablespoon of honey, and 1 large egg white until the ingredients are combined. Use a pastry brush to spread the honey glaze over the rolls after they've risen. Bake the skillet dinner rolls. Put the skillet in the preheated oven and follow the manufacturer's instructions for bake times. For example, if your package recommends 400 degrees F (200 C), you'll probably want to bake the rolls for 15 to 20 minutes. Remove the rolls once they're a rich golden brown color and firm to the touch. Serve the rolls with additional melted butter or glaze.",
    "sentences": [
        " Making Classic Skillet Dinner Rolls From Scratch Combine the dry ingredients.",
        "Get out a large mixing bowl and measure 1 cup (125 g) of the all-purpose flour into it.",
        "Open two 0.25 ounce (7 g) envelopes of instant yeast and pour it into one side of the bowl.",
        "Put 3 tablespoons of sugar and 3/4 teaspoon of salt in the other side of the bowl.",
        "Whisk the dry ingredients for about 30 seconds to combine them.",
        "You don't want the yeast to come into direct contact with the salt.",
        "The salt can stop the yeast from activating.",
        "You can use instant or rapid rise yeast.",
        "If you'd like to use active dry yeast, you'll need to activate it in a liquid before adding it to the recipe.",
        "Heat the wet ingredients.",
        "Pour the wet ingredients into a small saucepan and heat them on low heat.",
        "Check the temperature occasionally and turn it off when the mixture reaches 120 to 130 degrees F (50 to 55 C).",
        "You'll need:\n1 cup (236 ml) water\n2 tablespoons vegetable oil\n4 tablespoons (57 g) of the butter Beat the dough.",
        "Pour the warm liquid mixture into the bowl with the dry ingredients and stir them on low for about 30 seconds.",
        "Use a stand mixer to beat the dough for 2 minutes at medium speed.",
        "Gradually add 1/2 cup (62 g) of flour and keep beating the dough for another two minutes.",
        "The dough should begin to pull away from the sides of the bowl and form a dough.",
        "If the dough is still too sticky, add a little extra flour.",
        "If you don't have a stand mixer, you can beat the dough by hand.",
        "Just use a sturdy wooden spoon and beat the dough until a soft ball forms.",
        "Knead the dough and let it rest.",
        "Sprinkle a little flour on your work surface and dump the dough onto it.",
        "Knead the dough for about 5 to 7 minutes.",
        "The dough should become smooth and elastic.",
        "Lay a towel over the dough and let it rest for 10 minutes before you shape it.",
        "You can knead the dough any way you like.",
        "A good starter method is to use the palm of your hand to push the dough away from you.",
        "Fold the dough back over and turn the dough 45 degrees.",
        "Push it away from you again.",
        "Continue pushing, folding, and turning.",
        "Shape the dough into rolls.",
        "Remove the towel and divide the dough into 12 even pieces.",
        "You can use a bench scraper to easily cut the dough into pieces.",
        "Take each piece and gently roll it in the palm of your hand to form a ball.",
        "Do this for every piece of dough.",
        "Spray a 10 to 12-inch (25 to 30-cm) skillet with cooking spray and place all of the balls in the skillet.",
        "The rolls will spread into each other slightly as they bake.",
        "Prove the rolls and preheat the oven.",
        "Turn the oven on to 375 degrees F (190 C).",
        "Lay a towel or greased sheet of plastic wrap over the skillet.",
        "Let the rolls prove for about 30 to 45 minutes.",
        "They should double in volume.",
        "Put the rolls in a warm place to rest while the oven heats up.",
        "Brush the rolls with butter and bake them.",
        "Remove the covering from the skillet.",
        "Melt the last 2 tablespoons of butter in a small prep bowl.",
        "Dip a pastry brush in the butter and spread it over the rolls once they've risen.",
        "Put the skillet in the oven and bake them for 18 to 20 minutes.",
        "They should turn a little golden.",
        "You can serve the dinner rolls right out of the skillet or transfer them to a serving bowl.",
        "Making Sea Salt and Herb Skillet Rolls From Scratch Activate the yeast in the warm milk.",
        "Heat 1 cup (236 ml) of whole milk to 110 degrees F (40 C).",
        "Pour it into a mixing bowl and sprinkle 2 1/4 teaspoons (1 packet or 7 g) of active dry yeast and 1/2 teaspoon of sugar over the milk.",
        "Whisk the mixture a little and let it rest for 5 minutes.",
        "If the yeast has activated properly, the mixture will look a little frothy or foamy after 5 minutes.",
        "If it hasn't frothed at all, you will need to start again.",
        "Ensure that your active yeast hasn't expired.",
        "Combine the rest of the dough ingredients.",
        "While you can mix the dough by hand, it's easier to use a stand mixer.",
        "Turn the mixer on to low and stir in:\n2 tablespoons sugar\n1 large egg, at room temperature\n2 tablespoons butter\n1 teaspoon salt\n2 teaspoons dried rosemary\n2 teaspoons dried basil\n2 teaspoons dried parsley\n1 teaspoon garlic powder (or 1 1/2 teaspoons minced garlic)\n2 cups (250 g) of the bread flour Beat the dough.",
        "Beat the dough for one minute on low and stir in the last one cup (125 g) of bread flour.",
        "Beat it for another minute as the dough comes together.",
        "The dough should begin to pull away from the sides of the bowl and form a shaggy mass.",
        "If the dough is still too sticky and clings to the sides, add one tablespoon of flour at a time until it pulls away.",
        "Knead the roll dough.",
        "Sprinkle a little flour on your work surface and dump the dough onto it.",
        "Knead the dough for 2 minutes.",
        "The dough should become smooth and elastic.",
        "You can knead the dough any way you like.",
        "A good starter method is to use the palm of your hand to push the dough away from you.",
        "Fold the dough back over and turn the dough 45 degrees.",
        "Push it away from you again.",
        "Continue pushing, folding, and turning.",
        "Prove the dough.",
        "Spray a large bowl with cooking spray and roll the dough in it, so the dough is completely coated in oil.",
        "You should also spray a sheet of plastic wrap and lay it over the bowl with the dough.",
        "Let the dough rest in a warm place for about 2 hours.",
        "It should double in volume.",
        "Proving, or resting the dough, just lets the yeast expand, so your dough rises.",
        "Punch down the dough and shape the rolls.",
        "Remove the plastic wrap and dump the dough onto a floured surface.",
        "Punch down right in the middle of the dough, so any air trapped in the dough is released.",
        "Use a bench scraper or knife to divide the dough into 12 pieces.",
        "Each piece should be about the size of a golf ball.",
        "Prove the rolls and preheat the oven.",
        "Turn the oven on to 350 degrees F (180 C).",
        "Spray a 10 to 12-inch (25 to 30-cm) skillet with cooking spray and place the rolls in it.",
        "Melt the last 2 tablespoons of butter in a small prep bowl and dip a pastry brush in it.",
        "Brush the rolls with the melted butter and sprinkle the tops with coarse sea salt.",
        "Lay the plastic wrap on top of the rolls and let them prove for 30 to 45 minutes.",
        "They should double in volume.",
        "Just set the same greased plastic wrap that you used before over the skillet.",
        "You don't need to cover the skillet tightly or the wrap may stick to the dough.",
        "Bake the sea salt and herb skillet rolls.",
        "Remove the plastic wrap and put the skillet in the oven.",
        "Bake the rolls for 25 to 28 minutes.",
        "They should become golden brown.",
        "Carefully remove them from the oven and serve them with leftover melted butter.",
        "You can store the leftover rolls in the refrigerator for up to one week.",
        "You can also freeze them in an airtight container for up to three months.",
        "Making Buttered Rosemary or Honey Skillet Rolls Using Frozen Rolls Preheat the oven and prepare the skillet.",
        "Turn the oven on to 400 degrees F (200 C).",
        "Spray a 10 to 12-inch (25 to 30-cm) skillet with cooking spray or brush it with olive oil.",
        "This will keep the rolls from sticking in the pan.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/a\\/ab\\/Make-Skillet-Dinner-Rolls-Step-16.jpg\",\"bigUrl\":\"\\/images\\/thumb\\/a\\/ab\\/Make-Skillet-Dinner-Rolls-Step-16.jpg\\/v4-190px-Make-Skillet-Dinner-Rolls-Step-16.jpg\",\"smallWidth\":460,\"smallHeight\":307,\"bigWidth\":\"190\",\"bigHeight\":\"127\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\nFollow the specific oven temperature on the package of dinner rolls you're using.",
        "Prove the dinner rolls.",
        "Place about 7 frozen, uncooked dinner rolls in the skillet.",
        "The rolls shouldn't be touching.",
        "Lay a clean cloth over the rolls and let them prove for one to 2 hours, so they double in size.",
        "Proving just lets the dough rest and expand in volume.",
        "Try to prove the dough in a warm, draft-free place.",
        "Prepare the buttered rosemary version.",
        "To make savory rolls, melt 4 tablespoons (57 g) of salted butter.",
        "Use a pastry brush to gently spread the butter over the rolls after they've risen.",
        "Coarsely chop 1 sprig of fresh rosemary and sprinkle it over the tops of the rolls along with several pinches of coarse sea salt.",
        "Save any leftover melted butter for brushing on the rolls after they've baked.",
        "Prepare the honey version.",
        "To make sweet skillet dinner rolls, melt 1 tablespoon of butter in a small prep bowl.",
        "Stir in 1/6 cup (33 g) of sugar, 1 tablespoon of honey, and 1 large egg white until the ingredients are combined.",
        "Use a pastry brush to spread the honey glaze over the rolls after they've risen.",
        "Bake the skillet dinner rolls.",
        "Put the skillet in the preheated oven and follow the manufacturer's instructions for bake times.",
        "For example, if your package recommends 400 degrees F (200 C), you'll probably want to bake the rolls for 15 to 20 minutes.",
        "Remove the rolls once they're a rich golden brown color and firm to the touch.",
        "Serve the rolls with additional melted butter or glaze."
    ]
}