{
    "title": "How to Have a Squirt Gun Water Race",
    "url": "https://www.wikihow.com/Have-a-Squirt-Gun-Water-Race",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Backyard Games"
    ],
    "parts": [
        {
            "name": "Creating the Game",
            "steps": [
                {
                    "headline": "Gather your materials.",
                    "description": "You’ll need at least one plastic drinking cup for each player, but for more extensive races, you’ll need more cups. Also, choose a length of sturdy string that is not too thick. Kite string or string of similar thickness works well. You’ll also need duct tape and scissors or a sharp knife. The amount of string you need depends on how long you want the race to be. Be sure to include a little extra to account for hanging up the string."
                },
                {
                    "headline": "Cut a hole in the bottom of the cup(s).",
                    "description": "Use a sharp tool to cut a hole close to the edge of the bottom of the cup. Be sure the hole is large enough for the string you’ll use. A small drill cuts the hole quickly, but scissors or a razor knife work, too."
                },
                {
                    "headline": "Measure and cut the string.",
                    "description": "The length of string you use is completely up to you, depending on how long you want the race to be. A good distance for young players is 15-20 feet. If you want the race to have multiple sections, cut enough pieces of string for each one. Remember that taping or tying the string to endpoints will use up some of the length. When you decide how long you want the race distance to be, add a little extra string to account for this."
                },
                {
                    "headline": "Poke the string through the hole.",
                    "description": "Once the hole is cut in the cup and the string is cut to the desired length, stick the end of the string through the hole. Pull about a foot and a half (.45 m) of string through the hole to give you enough excess to hang the string in the next step."
                },
                {
                    "headline": "Attach the string to two sturdy endpoints.",
                    "description": "With the cup on the string, attach each end of the string to either a tree, a post, a wall, or some other fixed object. Place the string at a height that is easy to reach for the people playing. Use duct tape to attach the string, or tie the string around the object. Work with the surroundings you have available. If you are setting up the game in an open field with nothing to attach the string to, stick two broom handles in the ground for anchor points. Another option would be to have one person hold each side of the string if you have enough people available to help out and you have no other options."
                }
            ]
        },
        {
            "name": "Playing the Game",
            "steps": [
                {
                    "headline": "Give each participant a squirt gun.",
                    "description": "Make sure that each participant in the race uses the same squirt gun to ensure a fair competition. If players have brought their own squirt guns to use in the race, you may need to make adjustments as some guns are more powerful than others."
                },
                {
                    "headline": "Have each participant stand at the end of their string.",
                    "description": "With their squirt gun filled and ready to go, each player stands at the end of their designated string. Be sure that the inside of the cup is facing toward the player at the start of the race."
                },
                {
                    "headline": "Shoot water into the cup to move it along the string.",
                    "description": "The object of the race is to be the first player to move their cup from one end of the string to the other. Do this by shooting a continuous stream of water into the opening of the cup."
                },
                {
                    "headline": "Keep the end of the gun at least three feet (about 1 meter) from the cup.",
                    "description": "To keep the game challenging, players are not allowed to stand too close to the cup. It’s important that players have to aim the water stream from a distance away rather than right up close to the cup. For older players, stronger guns, or more of a challenge, increase the distance that players must stand from the cups."
                },
                {
                    "headline": "Hold a second race shooting water at the bottom of the cup.",
                    "description": "For an added challenge, repeat the race a second time moving the cup back to its starting place. Participants much shoot water at the bottom of the cup to make it move along the string."
                }
            ]
        },
        {
            "name": "Expanding the Race",
            "steps": [
                {
                    "headline": "Create a three part race.",
                    "description": "Using three separate lengths of string and three cups for each participant, set up a multi-part race. Each player races to be the first to move all three cups to the end of their string. Each section could be a little bit harder by being longer or at a different height. If you have a pool, hang a section of string across the length of the pool so that participants must swim while they shoot at their cup."
                },
                {
                    "headline": "Make contestants use their non-dominant hand.",
                    "description": "Players are most likely to use their writing hand to squeeze the trigger of the squirt gun. Make it more challenging by forcing them to use their weaker hand. They can still use their strong hand to help balance the squirt gun if necessary."
                },
                {
                    "headline": "Form teams and have a relay.",
                    "description": "If you have lots of people who want to race but limited materials and space, a relay is a great way to get everyone involved. Have players stand at each end of the string. The first player moves the cup to the opposite end and the second player moves the cup back to the starting point. If you set up two or more sections of string, each player can shoot the cup along one section. If players run out of water in their guns, this creates an added challenge for the race."
                }
            ]
        }
    ],
    "tyn": [
        "Plastic Cups",
        "Sturdy String",
        "Duct Tape",
        "Squirt Guns",
        "Somewhere to hang the string"
    ],
    "text": " Creating the Game Gather your materials. You’ll need at least one plastic drinking cup for each player, but for more extensive races, you’ll need more cups. Also, choose a length of sturdy string that is not too thick. Kite string or string of similar thickness works well. You’ll also need duct tape and scissors or a sharp knife. The amount of string you need depends on how long you want the race to be. Be sure to include a little extra to account for hanging up the string. Cut a hole in the bottom of the cup(s). Use a sharp tool to cut a hole close to the edge of the bottom of the cup. Be sure the hole is large enough for the string you’ll use. A small drill cuts the hole quickly, but scissors or a razor knife work, too. Measure and cut the string. The length of string you use is completely up to you, depending on how long you want the race to be. A good distance for young players is 15-20 feet. If you want the race to have multiple sections, cut enough pieces of string for each one. Remember that taping or tying the string to endpoints will use up some of the length. When you decide how long you want the race distance to be, add a little extra string to account for this. Poke the string through the hole. Once the hole is cut in the cup and the string is cut to the desired length, stick the end of the string through the hole. Pull about a foot and a half (.45 m) of string through the hole to give you enough excess to hang the string in the next step. Attach the string to two sturdy endpoints. With the cup on the string, attach each end of the string to either a tree, a post, a wall, or some other fixed object. Place the string at a height that is easy to reach for the people playing. Use duct tape to attach the string, or tie the string around the object. Work with the surroundings you have available. If you are setting up the game in an open field with nothing to attach the string to, stick two broom handles in the ground for anchor points. Another option would be to have one person hold each side of the string if you have enough people available to help out and you have no other options. Playing the Game Give each participant a squirt gun. Make sure that each participant in the race uses the same squirt gun to ensure a fair competition. If players have brought their own squirt guns to use in the race, you may need to make adjustments as some guns are more powerful than others. Have each participant stand at the end of their string. With their squirt gun filled and ready to go, each player stands at the end of their designated string. Be sure that the inside of the cup is facing toward the player at the start of the race. Shoot water into the cup to move it along the string. The object of the race is to be the first player to move their cup from one end of the string to the other. Do this by shooting a continuous stream of water into the opening of the cup. Keep the end of the gun at least three feet (about 1 meter) from the cup. To keep the game challenging, players are not allowed to stand too close to the cup. It’s important that players have to aim the water stream from a distance away rather than right up close to the cup. For older players, stronger guns, or more of a challenge, increase the distance that players must stand from the cups. Hold a second race shooting water at the bottom of the cup. For an added challenge, repeat the race a second time moving the cup back to its starting place. Participants much shoot water at the bottom of the cup to make it move along the string. Expanding the Race Create a three part race. Using three separate lengths of string and three cups for each participant, set up a multi-part race. Each player races to be the first to move all three cups to the end of their string. Each section could be a little bit harder by being longer or at a different height. If you have a pool, hang a section of string across the length of the pool so that participants must swim while they shoot at their cup. Make contestants use their non-dominant hand. Players are most likely to use their writing hand to squeeze the trigger of the squirt gun. Make it more challenging by forcing them to use their weaker hand. They can still use their strong hand to help balance the squirt gun if necessary. Form teams and have a relay. If you have lots of people who want to race but limited materials and space, a relay is a great way to get everyone involved. Have players stand at each end of the string. The first player moves the cup to the opposite end and the second player moves the cup back to the starting point. If you set up two or more sections of string, each player can shoot the cup along one section. If players run out of water in their guns, this creates an added challenge for the race.",
    "sentences": [
        " Creating the Game Gather your materials.",
        "You’ll need at least one plastic drinking cup for each player, but for more extensive races, you’ll need more cups.",
        "Also, choose a length of sturdy string that is not too thick.",
        "Kite string or string of similar thickness works well.",
        "You’ll also need duct tape and scissors or a sharp knife.",
        "The amount of string you need depends on how long you want the race to be.",
        "Be sure to include a little extra to account for hanging up the string.",
        "Cut a hole in the bottom of the cup(s).",
        "Use a sharp tool to cut a hole close to the edge of the bottom of the cup.",
        "Be sure the hole is large enough for the string you’ll use.",
        "A small drill cuts the hole quickly, but scissors or a razor knife work, too.",
        "Measure and cut the string.",
        "The length of string you use is completely up to you, depending on how long you want the race to be.",
        "A good distance for young players is 15-20 feet.",
        "If you want the race to have multiple sections, cut enough pieces of string for each one.",
        "Remember that taping or tying the string to endpoints will use up some of the length.",
        "When you decide how long you want the race distance to be, add a little extra string to account for this.",
        "Poke the string through the hole.",
        "Once the hole is cut in the cup and the string is cut to the desired length, stick the end of the string through the hole.",
        "Pull about a foot and a half (.45 m) of string through the hole to give you enough excess to hang the string in the next step.",
        "Attach the string to two sturdy endpoints.",
        "With the cup on the string, attach each end of the string to either a tree, a post, a wall, or some other fixed object.",
        "Place the string at a height that is easy to reach for the people playing.",
        "Use duct tape to attach the string, or tie the string around the object.",
        "Work with the surroundings you have available.",
        "If you are setting up the game in an open field with nothing to attach the string to, stick two broom handles in the ground for anchor points.",
        "Another option would be to have one person hold each side of the string if you have enough people available to help out and you have no other options.",
        "Playing the Game Give each participant a squirt gun.",
        "Make sure that each participant in the race uses the same squirt gun to ensure a fair competition.",
        "If players have brought their own squirt guns to use in the race, you may need to make adjustments as some guns are more powerful than others.",
        "Have each participant stand at the end of their string.",
        "With their squirt gun filled and ready to go, each player stands at the end of their designated string.",
        "Be sure that the inside of the cup is facing toward the player at the start of the race.",
        "Shoot water into the cup to move it along the string.",
        "The object of the race is to be the first player to move their cup from one end of the string to the other.",
        "Do this by shooting a continuous stream of water into the opening of the cup.",
        "Keep the end of the gun at least three feet (about 1 meter) from the cup.",
        "To keep the game challenging, players are not allowed to stand too close to the cup.",
        "It’s important that players have to aim the water stream from a distance away rather than right up close to the cup.",
        "For older players, stronger guns, or more of a challenge, increase the distance that players must stand from the cups.",
        "Hold a second race shooting water at the bottom of the cup.",
        "For an added challenge, repeat the race a second time moving the cup back to its starting place.",
        "Participants much shoot water at the bottom of the cup to make it move along the string.",
        "Expanding the Race Create a three part race.",
        "Using three separate lengths of string and three cups for each participant, set up a multi-part race.",
        "Each player races to be the first to move all three cups to the end of their string.",
        "Each section could be a little bit harder by being longer or at a different height.",
        "If you have a pool, hang a section of string across the length of the pool so that participants must swim while they shoot at their cup.",
        "Make contestants use their non-dominant hand.",
        "Players are most likely to use their writing hand to squeeze the trigger of the squirt gun.",
        "Make it more challenging by forcing them to use their weaker hand.",
        "They can still use their strong hand to help balance the squirt gun if necessary.",
        "Form teams and have a relay.",
        "If you have lots of people who want to race but limited materials and space, a relay is a great way to get everyone involved.",
        "Have players stand at each end of the string.",
        "The first player moves the cup to the opposite end and the second player moves the cup back to the starting point.",
        "If you set up two or more sections of string, each player can shoot the cup along one section.",
        "If players run out of water in their guns, this creates an added challenge for the race."
    ]
}