{
    "title": "How to Clean a PVC Fence",
    "url": "https://www.wikihow.com/Clean-a-PVC-Fence",
    "category_hierarchy": [
        "Home and Garden",
        "Yard and Outdoors",
        "Fences and Gates"
    ],
    "parts": [
        {
            "name": "Doing General Cleaning",
            "steps": [
                {
                    "headline": "Hose off a portion of the fence first.",
                    "description": "Attach a spray nozzle to your garden hose. Set it to its jet setting. Blast away as much debris as you can from a section of your fence. Start at the top and work your way down to the bottom of the fence so debris is forced downward. You’re going to scrub it next while it’s still wet, so only hose off a few feet at a time so it doesn’t dry off."
                },
                {
                    "headline": "Scrub while it’s still wet.",
                    "description": "Use a brush, sponge, or wet cloth. Scrub the area that you just hosed down. Wash off as much dirt, debris, or staining as you can with water alone. If you have one, you could use a long-handled brush that attaches to the hose to scrub down the fence."
                },
                {
                    "headline": "Repeat until the whole fence is finished.",
                    "description": "Move on to the next section of your fence. Hose it down and scrub away. Continue until the whole length of your fence has been hosed and scrubbed. Washing your fence with plain water once or twice a year should prevent buildup and the need for stronger cleaners."
                }
            ]
        },
        {
            "name": "Deciding Whether to Use Other Cleaners",
            "steps": [
                {
                    "headline": "Identify trouble areas.",
                    "description": "Take a step back and look at your handiwork. Assess which areas appear sufficiently clean and which require something tougher than plain water alone."
                },
                {
                    "headline": "Use other cleaners only where necessary.",
                    "description": "Expect most (if not all) cleaners to be harmful to any vegetation growing below and/or along the fence line. Protect your grass, flowers,  or other plants by using something harsher than plain water only when and where you really have to."
                },
                {
                    "headline": "Decide on a cleaner.",
                    "description": "If water alone doesn’t do the trick, don’t worry about having to go out and buy something special for the job. Expect common household items to do the trick. Use either:\nBleach\nVinegar\nMild dish detergent"
                },
                {
                    "headline": "Double-check recommendations from the fence’s manufacturer.",
                    "description": "Keep in mind that different manufacturers use different components to make their own PVC fences. Be aware that what’s safe to use on one may not be safe to use on another. Before you use any product other than water on your fence, refer to your owner’s manual or the manufacturer’s website to confirm what chemicals are safe to use."
                }
            ]
        },
        {
            "name": "Getting Rid of Tough Stains and Buildups",
            "steps": [
                {
                    "headline": "Start with a mild solution.",
                    "description": "Remember that many cleaning agents will kill vegetation along the fenceline. Play it safe and start by mixing a very small amount of bleach, vinegar, or dish detergent into a full bucket of water (like an ounce for every gallon of water). See how well this works before adding more. If the buildup in question is mold and mildew, opt for bleach. This will clean the present growth as well as prevent future buildup. However, remember that this may also harm underlying vegetation, and may not be recommended by particular manufacturers for your specific fence."
                },
                {
                    "headline": "Test it on a hidden portion of the fence.",
                    "description": "Before you start washing away with your cleaning solution, make sure it won’t adversely affect its appearance, especially if it’s painted a dark color. Pick an area hidden from view where a blemish won’t stick out. Wet your brush, sponge, or cloth in the solution and dab the fence with it. Let it dry and judge its appearance before washing elsewhere."
                },
                {
                    "headline": "Scrub and rinse.",
                    "description": "Soak your brush, sponge, or cloth in your solution. Wring out the excess. Scrub the trouble areas. Use your hose to rinse them off afterward. Alternatively, you could use a pump sprayer to apply cleaning solution to the fence. Then scrub the fence down and rinse it off."
                },
                {
                    "headline": "Scrape off any crusted or dried spots.",
                    "description": "If any stubborn spots appear to have dried or crusted over your fence, grab a soft plastic scraper if your brush, sponge, or cloth didn’t do the job. Wet the area again with your cleaning solution. Then pick away at them while being careful not to apply so much pressure that you scratch or otherwise damage the fence."
                },
                {
                    "headline": "Rinse again.",
                    "description": "Hose off each area of the fence where you used your cleaning solution. Wash away all traces of your cleaner. Get rid of any soapy film so new dirt doesn’t have a helping hand in clinging to your fence."
                }
            ]
        }
    ],
    "tyn": [
        "Hose",
        "Spray nozzle",
        "Water",
        "Bucket",
        "Brush, sponge, or cloth",
        "Bleach, vinegar, or dish detergent",
        "Plastic scraper",
        "Pump sprayer (optional)"
    ],
    "text": " Doing General Cleaning Hose off a portion of the fence first. Attach a spray nozzle to your garden hose. Set it to its jet setting. Blast away as much debris as you can from a section of your fence. Start at the top and work your way down to the bottom of the fence so debris is forced downward. You’re going to scrub it next while it’s still wet, so only hose off a few feet at a time so it doesn’t dry off. Scrub while it’s still wet. Use a brush, sponge, or wet cloth. Scrub the area that you just hosed down. Wash off as much dirt, debris, or staining as you can with water alone. If you have one, you could use a long-handled brush that attaches to the hose to scrub down the fence. Repeat until the whole fence is finished. Move on to the next section of your fence. Hose it down and scrub away. Continue until the whole length of your fence has been hosed and scrubbed. Washing your fence with plain water once or twice a year should prevent buildup and the need for stronger cleaners. Deciding Whether to Use Other Cleaners Identify trouble areas. Take a step back and look at your handiwork. Assess which areas appear sufficiently clean and which require something tougher than plain water alone. Use other cleaners only where necessary. Expect most (if not all) cleaners to be harmful to any vegetation growing below and/or along the fence line. Protect your grass, flowers,  or other plants by using something harsher than plain water only when and where you really have to. Decide on a cleaner. If water alone doesn’t do the trick, don’t worry about having to go out and buy something special for the job. Expect common household items to do the trick. Use either:\nBleach\nVinegar\nMild dish detergent Double-check recommendations from the fence’s manufacturer. Keep in mind that different manufacturers use different components to make their own PVC fences. Be aware that what’s safe to use on one may not be safe to use on another. Before you use any product other than water on your fence, refer to your owner’s manual or the manufacturer’s website to confirm what chemicals are safe to use. Getting Rid of Tough Stains and Buildups Start with a mild solution. Remember that many cleaning agents will kill vegetation along the fenceline. Play it safe and start by mixing a very small amount of bleach, vinegar, or dish detergent into a full bucket of water (like an ounce for every gallon of water). See how well this works before adding more. If the buildup in question is mold and mildew, opt for bleach. This will clean the present growth as well as prevent future buildup. However, remember that this may also harm underlying vegetation, and may not be recommended by particular manufacturers for your specific fence. Test it on a hidden portion of the fence. Before you start washing away with your cleaning solution, make sure it won’t adversely affect its appearance, especially if it’s painted a dark color. Pick an area hidden from view where a blemish won’t stick out. Wet your brush, sponge, or cloth in the solution and dab the fence with it. Let it dry and judge its appearance before washing elsewhere. Scrub and rinse. Soak your brush, sponge, or cloth in your solution. Wring out the excess. Scrub the trouble areas. Use your hose to rinse them off afterward. Alternatively, you could use a pump sprayer to apply cleaning solution to the fence. Then scrub the fence down and rinse it off. Scrape off any crusted or dried spots. If any stubborn spots appear to have dried or crusted over your fence, grab a soft plastic scraper if your brush, sponge, or cloth didn’t do the job. Wet the area again with your cleaning solution. Then pick away at them while being careful not to apply so much pressure that you scratch or otherwise damage the fence. Rinse again. Hose off each area of the fence where you used your cleaning solution. Wash away all traces of your cleaner. Get rid of any soapy film so new dirt doesn’t have a helping hand in clinging to your fence.",
    "sentences": [
        " Doing General Cleaning Hose off a portion of the fence first.",
        "Attach a spray nozzle to your garden hose.",
        "Set it to its jet setting.",
        "Blast away as much debris as you can from a section of your fence.",
        "Start at the top and work your way down to the bottom of the fence so debris is forced downward.",
        "You’re going to scrub it next while it’s still wet, so only hose off a few feet at a time so it doesn’t dry off.",
        "Scrub while it’s still wet.",
        "Use a brush, sponge, or wet cloth.",
        "Scrub the area that you just hosed down.",
        "Wash off as much dirt, debris, or staining as you can with water alone.",
        "If you have one, you could use a long-handled brush that attaches to the hose to scrub down the fence.",
        "Repeat until the whole fence is finished.",
        "Move on to the next section of your fence.",
        "Hose it down and scrub away.",
        "Continue until the whole length of your fence has been hosed and scrubbed.",
        "Washing your fence with plain water once or twice a year should prevent buildup and the need for stronger cleaners.",
        "Deciding Whether to Use Other Cleaners Identify trouble areas.",
        "Take a step back and look at your handiwork.",
        "Assess which areas appear sufficiently clean and which require something tougher than plain water alone.",
        "Use other cleaners only where necessary.",
        "Expect most (if not all) cleaners to be harmful to any vegetation growing below and/or along the fence line.",
        "Protect your grass, flowers,  or other plants by using something harsher than plain water only when and where you really have to.",
        "Decide on a cleaner.",
        "If water alone doesn’t do the trick, don’t worry about having to go out and buy something special for the job.",
        "Expect common household items to do the trick.",
        "Use either:\nBleach\nVinegar\nMild dish detergent Double-check recommendations from the fence’s manufacturer.",
        "Keep in mind that different manufacturers use different components to make their own PVC fences.",
        "Be aware that what’s safe to use on one may not be safe to use on another.",
        "Before you use any product other than water on your fence, refer to your owner’s manual or the manufacturer’s website to confirm what chemicals are safe to use.",
        "Getting Rid of Tough Stains and Buildups Start with a mild solution.",
        "Remember that many cleaning agents will kill vegetation along the fenceline.",
        "Play it safe and start by mixing a very small amount of bleach, vinegar, or dish detergent into a full bucket of water (like an ounce for every gallon of water).",
        "See how well this works before adding more.",
        "If the buildup in question is mold and mildew, opt for bleach.",
        "This will clean the present growth as well as prevent future buildup.",
        "However, remember that this may also harm underlying vegetation, and may not be recommended by particular manufacturers for your specific fence.",
        "Test it on a hidden portion of the fence.",
        "Before you start washing away with your cleaning solution, make sure it won’t adversely affect its appearance, especially if it’s painted a dark color.",
        "Pick an area hidden from view where a blemish won’t stick out.",
        "Wet your brush, sponge, or cloth in the solution and dab the fence with it.",
        "Let it dry and judge its appearance before washing elsewhere.",
        "Scrub and rinse.",
        "Soak your brush, sponge, or cloth in your solution.",
        "Wring out the excess.",
        "Scrub the trouble areas.",
        "Use your hose to rinse them off afterward.",
        "Alternatively, you could use a pump sprayer to apply cleaning solution to the fence.",
        "Then scrub the fence down and rinse it off.",
        "Scrape off any crusted or dried spots.",
        "If any stubborn spots appear to have dried or crusted over your fence, grab a soft plastic scraper if your brush, sponge, or cloth didn’t do the job.",
        "Wet the area again with your cleaning solution.",
        "Then pick away at them while being careful not to apply so much pressure that you scratch or otherwise damage the fence.",
        "Rinse again.",
        "Hose off each area of the fence where you used your cleaning solution.",
        "Wash away all traces of your cleaner.",
        "Get rid of any soapy film so new dirt doesn’t have a helping hand in clinging to your fence."
    ]
}