{
    "title": "How to Make a Mushroom Medley",
    "url": "https://www.wikihow.com/Make-a-Mushroom-Medley",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables",
        "Mushrooms"
    ],
    "methods": [
        {
            "name": "Cooking a Basic Mushroom Medley",
            "steps": [
                {
                    "headline": "Cook the mushrooms and peppers.",
                    "description": "Put olive or canola oil into a large frying pan or skillet. Turn the heat to high. Add the mushrooms and red peppers. Sauté them for about five minutes. Stir every so often."
                },
                {
                    "headline": "Put in garlic and green onions.",
                    "description": "Once the mushrooms and peppers have been cooked, add in the garlic and onions. Cook them for about 3 to 4 minutes. Stir the mixture together as it cooks."
                },
                {
                    "headline": "Stir in the herbs.",
                    "description": "You can add the herbs of your choice. Parsley and rosemary are common and tasty choices for a mushroom medley. After you've added in the herbs, add in some salt and pepper and your medley is complete."
                }
            ]
        },
        {
            "name": "Making Roasted Mushroom Medley",
            "steps": [
                {
                    "headline": "Clean and slice the mushrooms.",
                    "description": "Clean the mushrooms with a damp cloth. Trim the stems of the mushrooms. Then slice the mushrooms into chunks that do not exceed 2 inches in size. As you are doing this, preheat the oven to 350°F (176.7°C)."
                },
                {
                    "headline": "Add ingredients to a casserole dish.",
                    "description": "Put the garlic, herbs, and seasoning into an ovenproof casserole dish. Add in olive oil and mix it with the ingredients. Make sure that you're using a dish that will be large enough to fit the 2 pounds (907.2 g) of mushrooms."
                },
                {
                    "headline": "Add the mushrooms.",
                    "description": "Pour the mushrooms into the casserole dish. Mix the mushrooms in with the rest of the ingredients. Make sure the mushrooms get coated in the olive oil."
                },
                {
                    "headline": "Cook for 30 to 40 minutes.",
                    "description": "Put the casserole dish in the oven. Allow the medley to cook for 30 to 40 minutes. You can allow it to cook longer if it has not cooked through after 40 minutes."
                },
                {
                    "headline": "Remove from the oven.",
                    "description": "Take the casserole dish out of the oven once it has finished cooking. Drizzle the medley with balsamic vinegar. Allow it cool for a few minutes and then serve warm."
                }
            ]
        },
        {
            "name": "Making a Mushroom Medley with Spinach",
            "steps": [
                {
                    "headline": "Add pepper, ginger, and garlic.",
                    "description": "Turn the stove to medium-high heat. Heat the oriental sesame oil in a skillet. Put the bell pepper, ginger, and garlic into the skillet. Sauté them for one minute."
                },
                {
                    "headline": "Sauté the mushrooms.",
                    "description": "Add in all of the mushrooms (shitake, button, and oyster). Pour in 2 to 3 tablespoons (29.6 mL to 44.4 mL) of water if you are beginning with a dry mixture. Sauté them until they turn brown and become tender. This will take about 10 minutes."
                },
                {
                    "headline": "Mix in spinach and onions.",
                    "description": "Add in the spinach and onions once the mushrooms have turned brown and tender. Cook until the spinach begins to wilt. This should take about 2 minutes."
                },
                {
                    "headline": "Stir in the soy sauce and seasoning.",
                    "description": "Add in 1 tablespoon (14.8 mL) of soy sauce. Then, sprinkle some salt and pepper over the medley. Use a stirring utensil to mix all of the ingredients together thoroughly."
                },
                {
                    "headline": "Serve the finished meal.",
                    "description": "Transfer the finished medley to a bowl or serving dish. You can either squeeze a lemon wedge over the entirety of the medley, or allow each person to have the option of adding lemon juice. Serve while warm."
                }
            ]
        }
    ],
    "tyn": [
        "Large frying pan",
        "Stirring utensil",
        "Casserole dish",
        "Knife",
        "Cloth",
        "Skillet"
    ],
    "text": " Cooking a Basic Mushroom Medley Cook the mushrooms and peppers. Put olive or canola oil into a large frying pan or skillet. Turn the heat to high. Add the mushrooms and red peppers. Sauté them for about five minutes. Stir every so often. Put in garlic and green onions. Once the mushrooms and peppers have been cooked, add in the garlic and onions. Cook them for about 3 to 4 minutes. Stir the mixture together as it cooks. Stir in the herbs. You can add the herbs of your choice. Parsley and rosemary are common and tasty choices for a mushroom medley. After you've added in the herbs, add in some salt and pepper and your medley is complete. Making Roasted Mushroom Medley Clean and slice the mushrooms. Clean the mushrooms with a damp cloth. Trim the stems of the mushrooms. Then slice the mushrooms into chunks that do not exceed 2 inches in size. As you are doing this, preheat the oven to 350°F (176.7°C). Add ingredients to a casserole dish. Put the garlic, herbs, and seasoning into an ovenproof casserole dish. Add in olive oil and mix it with the ingredients. Make sure that you're using a dish that will be large enough to fit the 2 pounds (907.2 g) of mushrooms. Add the mushrooms. Pour the mushrooms into the casserole dish. Mix the mushrooms in with the rest of the ingredients. Make sure the mushrooms get coated in the olive oil. Cook for 30 to 40 minutes. Put the casserole dish in the oven. Allow the medley to cook for 30 to 40 minutes. You can allow it to cook longer if it has not cooked through after 40 minutes. Remove from the oven. Take the casserole dish out of the oven once it has finished cooking. Drizzle the medley with balsamic vinegar. Allow it cool for a few minutes and then serve warm. Making a Mushroom Medley with Spinach Add pepper, ginger, and garlic. Turn the stove to medium-high heat. Heat the oriental sesame oil in a skillet. Put the bell pepper, ginger, and garlic into the skillet. Sauté them for one minute. Sauté the mushrooms. Add in all of the mushrooms (shitake, button, and oyster). Pour in 2 to 3 tablespoons (29.6 mL to 44.4 mL) of water if you are beginning with a dry mixture. Sauté them until they turn brown and become tender. This will take about 10 minutes. Mix in spinach and onions. Add in the spinach and onions once the mushrooms have turned brown and tender. Cook until the spinach begins to wilt. This should take about 2 minutes. Stir in the soy sauce and seasoning. Add in 1 tablespoon (14.8 mL) of soy sauce. Then, sprinkle some salt and pepper over the medley. Use a stirring utensil to mix all of the ingredients together thoroughly. Serve the finished meal. Transfer the finished medley to a bowl or serving dish. You can either squeeze a lemon wedge over the entirety of the medley, or allow each person to have the option of adding lemon juice. Serve while warm.",
    "sentences": [
        " Cooking a Basic Mushroom Medley Cook the mushrooms and peppers.",
        "Put olive or canola oil into a large frying pan or skillet.",
        "Turn the heat to high.",
        "Add the mushrooms and red peppers.",
        "Sauté them for about five minutes.",
        "Stir every so often.",
        "Put in garlic and green onions.",
        "Once the mushrooms and peppers have been cooked, add in the garlic and onions.",
        "Cook them for about 3 to 4 minutes.",
        "Stir the mixture together as it cooks.",
        "Stir in the herbs.",
        "You can add the herbs of your choice.",
        "Parsley and rosemary are common and tasty choices for a mushroom medley.",
        "After you've added in the herbs, add in some salt and pepper and your medley is complete.",
        "Making Roasted Mushroom Medley Clean and slice the mushrooms.",
        "Clean the mushrooms with a damp cloth.",
        "Trim the stems of the mushrooms.",
        "Then slice the mushrooms into chunks that do not exceed 2 inches in size.",
        "As you are doing this, preheat the oven to 350°F (176.7°C).",
        "Add ingredients to a casserole dish.",
        "Put the garlic, herbs, and seasoning into an ovenproof casserole dish.",
        "Add in olive oil and mix it with the ingredients.",
        "Make sure that you're using a dish that will be large enough to fit the 2 pounds (907.2 g) of mushrooms.",
        "Add the mushrooms.",
        "Pour the mushrooms into the casserole dish.",
        "Mix the mushrooms in with the rest of the ingredients.",
        "Make sure the mushrooms get coated in the olive oil.",
        "Cook for 30 to 40 minutes.",
        "Put the casserole dish in the oven.",
        "Allow the medley to cook for 30 to 40 minutes.",
        "You can allow it to cook longer if it has not cooked through after 40 minutes.",
        "Remove from the oven.",
        "Take the casserole dish out of the oven once it has finished cooking.",
        "Drizzle the medley with balsamic vinegar.",
        "Allow it cool for a few minutes and then serve warm.",
        "Making a Mushroom Medley with Spinach Add pepper, ginger, and garlic.",
        "Turn the stove to medium-high heat.",
        "Heat the oriental sesame oil in a skillet.",
        "Put the bell pepper, ginger, and garlic into the skillet.",
        "Sauté them for one minute.",
        "Sauté the mushrooms.",
        "Add in all of the mushrooms (shitake, button, and oyster).",
        "Pour in 2 to 3 tablespoons (29.6 mL to 44.4 mL) of water if you are beginning with a dry mixture.",
        "Sauté them until they turn brown and become tender.",
        "This will take about 10 minutes.",
        "Mix in spinach and onions.",
        "Add in the spinach and onions once the mushrooms have turned brown and tender.",
        "Cook until the spinach begins to wilt.",
        "This should take about 2 minutes.",
        "Stir in the soy sauce and seasoning.",
        "Add in 1 tablespoon (14.8 mL) of soy sauce.",
        "Then, sprinkle some salt and pepper over the medley.",
        "Use a stirring utensil to mix all of the ingredients together thoroughly.",
        "Serve the finished meal.",
        "Transfer the finished medley to a bowl or serving dish.",
        "You can either squeeze a lemon wedge over the entirety of the medley, or allow each person to have the option of adding lemon juice.",
        "Serve while warm."
    ]
}