{
    "title": "How to Clean Ball Bearings",
    "url": "https://www.wikihow.com/Clean-Ball-Bearings",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Cleaning"
    ],
    "methods": [
        {
            "name": "Removing Skate Ball Bearings",
            "steps": [
                {
                    "headline": "Take the wheels off of your skates or skateboard.",
                    "description": "To remove wheels from a skateboard, loosen the nut using a socket wrench or skate tool. Use an Allen wrench to remove the wheels from a rollerblade casing. Be sure to store all nuts and washers in a safe place, such as a plastic bag or small container."
                },
                {
                    "headline": "Take the bearings off of your wheels.",
                    "description": "In addition to a socket that tightens and loosens nuts, most skate tools also have an attachment that pokes the bearing from the center of the wheel. While using a skate tool is the preferred method, you can also use a screwdriver to poke out the bearing casing. If you have a skateboard, you can use the axle to poke out the bearing casing. Hold the wheel against the axle so the side that would normally face outward faces in and touches the axle. Apply gentle pressure to pop out the bearing casing."
                },
                {
                    "headline": "Remove the rubber or metal seals.",
                    "description": "Once you’ve popped the bearing casings out from the wheels’ centers, you’ll need to remove the seal to expose the ball bearings. If your bearings have a rubber seal, use a paperclip to carefully pry off the seal. Alternatively, you might have a metal seal secured by a C-clip. Use a utility knife to pry out the C-clip, then tap the metal seal out. You’ll be able to see the outline of the C-clip if your metal seal is removable. If the seal is pressed with no visible seam or outline, the seal is not removable and you will not be able to access the ball bearings."
                }
            ]
        },
        {
            "name": "Cleaning Skate Ball Bearings",
            "steps": [
                {
                    "headline": "Use a skate bearing cleaning kit.",
                    "description": "The easiest way to clean skate ball bearings is to use a specially made kit, but you can also make your own kit at home. Grab a sports drink bottle and cut hole in the cap large enough for a bolt that’s a quarter inch (0.6 cm) wide and six inches (15 cm) long. Run a gasket down the bolt’s length until it’s flush with the head, insert the bolt through the cap, then secure it to the cap using a washer and a nut. You can cut a ballpoint pen casing into quarter inch (0.6 cm) wide cylinders to create spacers to place between the bearings. If you want to purchase a skate ball bearing cleaning kit, you can find one online or at a skate shop."
                },
                {
                    "headline": "Stack the bearings onto your cleaning kit.",
                    "description": "If you’re using a store bought kit, place a bearing casing onto the base, snap a spacer over it, then repeat the sequence until you’ve stacked all of the casings. If you’re using a homemade cleaning kit, slide the bearing casings down the bolt’s length and place a ballpoint pen spacer between each casing. Stacking the bearing casings instead of free washing them in a container will help prevent casings from scratching each other. It’ll also help keep the balls from falling out of the casings."
                },
                {
                    "headline": "Fill the cleaning container with citrus cleaner, alcohol, or solvent cleaner.",
                    "description": "After stacking the casings, fill your kit container or bottle with a cleaner. You can use a citrus-based cleaner, 90% pure isopropyl alcohol, or a solvent cleaner, such as acetone. Each cleaner has pros and cons. A citrus cleaner is the safest choice, but might leave a residue on the casings. Isopropyl alcohol and acetone are stronger and won’t leave residue, but are skin irritants and emit hazardous fumes. Be sure to wear gloves if you choose 90% pure isopropyl alcohol or a solvent cleaner. Don’t use WD-40 or oil to clean ball bearings or bearing casings. These will just cause buildup without actually removing any debris."
                },
                {
                    "headline": "Shake and soak the bearings.",
                    "description": "Insert the stacked bearings into the cleaner-filled container and secure the lid. Shake the container for a few seconds, then let it sit for five to ten minutes to cut through buildup. After letting it sit, give the container another shake."
                },
                {
                    "headline": "Dry and lubricate your bearings.",
                    "description": "Remove the casings from the container and unstack them. Use compressed air to thoroughly dry them. Once they’re dry, apply a few drops of lubricant using a hypodermic needle or pin. Use either a lubricant made for skate ball bearings, sewing machine lubricant, or lubricant made for electronic devices. These products typically come with a needle applicator."
                },
                {
                    "headline": "Reinstall your bearings and wheels.",
                    "description": "Once you’ve lubricated your ball bearings, you can reassemble your bearings and wheels. Snap the rubber or metal seals back onto the bearing casings. Use a skate tool to reinsert the bearing casings back into the wheels’ centers, then fasten the wheels back onto your skates or skateboard. You can use a skateboard axle to pop the bearing casing back into place, but you might risk damaging the casing. Using a skate tool is the preferred method."
                }
            ]
        },
        {
            "name": "Cleaning Bicycle Wheel Cartridge Bearings",
            "steps": [
                {
                    "headline": "Take the wheels off of the bike.",
                    "description": "Many bikes have a quick release lever that you simply pull and turn counterclockwise. In addition to the quick release lever, most mountain bikes also have an axle that you’ll slide out after unfastening the quick release. Some bikes have heavy nuts that secure the wheels in place, which you can remove using a wrench."
                },
                {
                    "headline": "Remove the axle endcaps and rear freehub body.",
                    "description": "Once you’ve taken the wheels off of the bicycle frame, you’ll need to expose the cartridge that holds the ball bearings. For the front wheel, just twist or pop off the axle endcaps at the hub, or center of the wheel. For the rear wheel, you’ll also need to pull out the freehub body as well. Simply pull it out of the center of the wheel."
                },
                {
                    "headline": "Pry off the seal on the cartridge bearing.",
                    "description": "Use a utility knife to carefully pry off the cartridge seal. Take care not to warp or damage the seal or the cartridge races, which hold the ball bearings in place. Be sure to store the seals and the other parts you removed in a safe place to avoid losing them."
                },
                {
                    "headline": "Degrease and wipe the cartridge bearing.",
                    "description": "Use a rag to wipe away as much debris as possible from the cartridge. Grab an aerosol degreaser with a small straw, spray into the cartridge, then wipe away the degreaser. Spray into the cartridge with WD-40 to eliminate any water residue, as the degreaser will contain some water, then wipe away excess WD-40."
                },
                {
                    "headline": "Use a grease gun to repack the cartridge with grease.",
                    "description": "Liberally repack the cartridge bearing with bicycle grease. A grease gun, which you can find online or at a bike shop, is the best way to access the cartridge’s tight spaces. If you live in a wet area, pack more grease into the cartridge to protect the bearings. Once you’ve cleaned and repacked one wheel, repeat the process on the other."
                },
                {
                    "headline": "Replace the cartridge seal and reinstall the wheels.",
                    "description": "Snap the seals back over the cartridge bearings. Reinsert the rear freehub body and pop the endcaps onto the wheel hubs. Realign the wheels with the bicycle frame and fasten them by tightening the quick releases or nuts."
                }
            ]
        },
        {
            "name": "Cleaning Bicycle Wheel Loose Bearings",
            "steps": [
                {
                    "headline": "Use cone spanners to remove the hub cone and axle.",
                    "description": "You’ll need a pair of thin cone spanners to disassemble a cup-and-cone hub. Place one cone spanner around the cone itself and the other spanner around the lug nut. Twist the lug counterclockwise to remove it. For the rear wheel, you’ll have to remove the cassette in order to access the cup-and-cone. You’ll need a cassette removal tool, which you can find online or at a bike shop, to fit into the cassette and loosen the locking nut. Set the lug nuts and any washers or spacers aside in proper order to make reassembly easier."
                },
                {
                    "headline": "Lift the ball bearings out each side of the hub.",
                    "description": "Once you’ve removed the cone, you can access the ball bearings, which sit on each side of the hub. Use a scalpel blade or narrow utility knife to carefully pull the balls out from the seat on each side. There are also magnet tools, which look like magnetic sticks, that make it much easier to pull out the ball bearings. If you use a blade, spray a little grease onto it so the balls will stick to it. That’ll make it easier to pull them out from their seat. Keep the ball bearings separate so you know which side is which."
                },
                {
                    "headline": "Degrease and wipe the balls and bearing seat.",
                    "description": "Spray the ball bearings with an aerosol degreaser and wipe them down with a rag. Fit a small straw into the nozzle of the aerosol degreaser and spray inside the bearing seat. Wipe inside the seat by wrapping your finger in a rag. Wear gloves when using a degreaser."
                },
                {
                    "headline": "Pack grease into the bearing seat before reassembling the hub.",
                    "description": "Use your grease gun to pack a thick layer of grease into the bearing seat. Any excess will simply work it’s way out, so pack liberally and don’t worry about adding too much. If necessary, use your finger to work grease all around the bearing seat."
                },
                {
                    "headline": "Insert the ball bearings back into each seat and add more grease.",
                    "description": "When replacing the ball bearings, it’s possible to miss the seat, causing the balls to drop through the hub and come out the other side. To prevent this, you can place the axle through the hub, but in the opposite way that it would normally fit. That way, the tip of the axle will prevent the ball bearings from falling through, making it easier to slide them into their seat. Pack even more grease into the bearing seat after you slide the ball bearings back into place. Once you’ve inserted the bearings one one side of the hub, repeat the process on the other side."
                },
                {
                    "headline": "Replace the cone, spacers, and lug nut.",
                    "description": "Slide the axle through the hub and place the cone over it. Replace any washers or spacers you removed. Twist the lug onto the threaded axle by hand, then tighten it until it’s snug with the cone spacers using the cone spanners. For the rear wheel, place the cassette back onto the hub and tighten its locking nut using the cassette tool."
                }
            ]
        }
    ],
    "tyn": [
        "Skate tool",
        "Utility knife",
        "Skate bearing cleaning kit (or a bottle, bolt, gasket, washer, nut, and pen casing)",
        "Citrus cleaner, 90% pure isopropyl alcohol, or acetone",
        "Compressed air",
        "Lubricant and applicator",
        "Cleaning rag",
        "Aerosol degreaser",
        "WD-40",
        "Bicycle grease",
        "Grease gun",
        "Bicycle cassette removal tool",
        "Cone spanners"
    ],
    "text": " Removing Skate Ball Bearings Take the wheels off of your skates or skateboard. To remove wheels from a skateboard, loosen the nut using a socket wrench or skate tool. Use an Allen wrench to remove the wheels from a rollerblade casing. Be sure to store all nuts and washers in a safe place, such as a plastic bag or small container. Take the bearings off of your wheels. In addition to a socket that tightens and loosens nuts, most skate tools also have an attachment that pokes the bearing from the center of the wheel. While using a skate tool is the preferred method, you can also use a screwdriver to poke out the bearing casing. If you have a skateboard, you can use the axle to poke out the bearing casing. Hold the wheel against the axle so the side that would normally face outward faces in and touches the axle. Apply gentle pressure to pop out the bearing casing. Remove the rubber or metal seals. Once you’ve popped the bearing casings out from the wheels’ centers, you’ll need to remove the seal to expose the ball bearings. If your bearings have a rubber seal, use a paperclip to carefully pry off the seal. Alternatively, you might have a metal seal secured by a C-clip. Use a utility knife to pry out the C-clip, then tap the metal seal out. You’ll be able to see the outline of the C-clip if your metal seal is removable. If the seal is pressed with no visible seam or outline, the seal is not removable and you will not be able to access the ball bearings. Cleaning Skate Ball Bearings Use a skate bearing cleaning kit. The easiest way to clean skate ball bearings is to use a specially made kit, but you can also make your own kit at home. Grab a sports drink bottle and cut hole in the cap large enough for a bolt that’s a quarter inch (0.6 cm) wide and six inches (15 cm) long. Run a gasket down the bolt’s length until it’s flush with the head, insert the bolt through the cap, then secure it to the cap using a washer and a nut. You can cut a ballpoint pen casing into quarter inch (0.6 cm) wide cylinders to create spacers to place between the bearings. If you want to purchase a skate ball bearing cleaning kit, you can find one online or at a skate shop. Stack the bearings onto your cleaning kit. If you’re using a store bought kit, place a bearing casing onto the base, snap a spacer over it, then repeat the sequence until you’ve stacked all of the casings. If you’re using a homemade cleaning kit, slide the bearing casings down the bolt’s length and place a ballpoint pen spacer between each casing. Stacking the bearing casings instead of free washing them in a container will help prevent casings from scratching each other. It’ll also help keep the balls from falling out of the casings. Fill the cleaning container with citrus cleaner, alcohol, or solvent cleaner. After stacking the casings, fill your kit container or bottle with a cleaner. You can use a citrus-based cleaner, 90% pure isopropyl alcohol, or a solvent cleaner, such as acetone. Each cleaner has pros and cons. A citrus cleaner is the safest choice, but might leave a residue on the casings. Isopropyl alcohol and acetone are stronger and won’t leave residue, but are skin irritants and emit hazardous fumes. Be sure to wear gloves if you choose 90% pure isopropyl alcohol or a solvent cleaner. Don’t use WD-40 or oil to clean ball bearings or bearing casings. These will just cause buildup without actually removing any debris. Shake and soak the bearings. Insert the stacked bearings into the cleaner-filled container and secure the lid. Shake the container for a few seconds, then let it sit for five to ten minutes to cut through buildup. After letting it sit, give the container another shake. Dry and lubricate your bearings. Remove the casings from the container and unstack them. Use compressed air to thoroughly dry them. Once they’re dry, apply a few drops of lubricant using a hypodermic needle or pin. Use either a lubricant made for skate ball bearings, sewing machine lubricant, or lubricant made for electronic devices. These products typically come with a needle applicator. Reinstall your bearings and wheels. Once you’ve lubricated your ball bearings, you can reassemble your bearings and wheels. Snap the rubber or metal seals back onto the bearing casings. Use a skate tool to reinsert the bearing casings back into the wheels’ centers, then fasten the wheels back onto your skates or skateboard. You can use a skateboard axle to pop the bearing casing back into place, but you might risk damaging the casing. Using a skate tool is the preferred method. Cleaning Bicycle Wheel Cartridge Bearings Take the wheels off of the bike. Many bikes have a quick release lever that you simply pull and turn counterclockwise. In addition to the quick release lever, most mountain bikes also have an axle that you’ll slide out after unfastening the quick release. Some bikes have heavy nuts that secure the wheels in place, which you can remove using a wrench. Remove the axle endcaps and rear freehub body. Once you’ve taken the wheels off of the bicycle frame, you’ll need to expose the cartridge that holds the ball bearings. For the front wheel, just twist or pop off the axle endcaps at the hub, or center of the wheel. For the rear wheel, you’ll also need to pull out the freehub body as well. Simply pull it out of the center of the wheel. Pry off the seal on the cartridge bearing. Use a utility knife to carefully pry off the cartridge seal. Take care not to warp or damage the seal or the cartridge races, which hold the ball bearings in place. Be sure to store the seals and the other parts you removed in a safe place to avoid losing them. Degrease and wipe the cartridge bearing. Use a rag to wipe away as much debris as possible from the cartridge. Grab an aerosol degreaser with a small straw, spray into the cartridge, then wipe away the degreaser. Spray into the cartridge with WD-40 to eliminate any water residue, as the degreaser will contain some water, then wipe away excess WD-40. Use a grease gun to repack the cartridge with grease. Liberally repack the cartridge bearing with bicycle grease. A grease gun, which you can find online or at a bike shop, is the best way to access the cartridge’s tight spaces. If you live in a wet area, pack more grease into the cartridge to protect the bearings. Once you’ve cleaned and repacked one wheel, repeat the process on the other. Replace the cartridge seal and reinstall the wheels. Snap the seals back over the cartridge bearings. Reinsert the rear freehub body and pop the endcaps onto the wheel hubs. Realign the wheels with the bicycle frame and fasten them by tightening the quick releases or nuts. Cleaning Bicycle Wheel Loose Bearings Use cone spanners to remove the hub cone and axle. You’ll need a pair of thin cone spanners to disassemble a cup-and-cone hub. Place one cone spanner around the cone itself and the other spanner around the lug nut. Twist the lug counterclockwise to remove it. For the rear wheel, you’ll have to remove the cassette in order to access the cup-and-cone. You’ll need a cassette removal tool, which you can find online or at a bike shop, to fit into the cassette and loosen the locking nut. Set the lug nuts and any washers or spacers aside in proper order to make reassembly easier. Lift the ball bearings out each side of the hub. Once you’ve removed the cone, you can access the ball bearings, which sit on each side of the hub. Use a scalpel blade or narrow utility knife to carefully pull the balls out from the seat on each side. There are also magnet tools, which look like magnetic sticks, that make it much easier to pull out the ball bearings. If you use a blade, spray a little grease onto it so the balls will stick to it. That’ll make it easier to pull them out from their seat. Keep the ball bearings separate so you know which side is which. Degrease and wipe the balls and bearing seat. Spray the ball bearings with an aerosol degreaser and wipe them down with a rag. Fit a small straw into the nozzle of the aerosol degreaser and spray inside the bearing seat. Wipe inside the seat by wrapping your finger in a rag. Wear gloves when using a degreaser. Pack grease into the bearing seat before reassembling the hub. Use your grease gun to pack a thick layer of grease into the bearing seat. Any excess will simply work it’s way out, so pack liberally and don’t worry about adding too much. If necessary, use your finger to work grease all around the bearing seat. Insert the ball bearings back into each seat and add more grease. When replacing the ball bearings, it’s possible to miss the seat, causing the balls to drop through the hub and come out the other side. To prevent this, you can place the axle through the hub, but in the opposite way that it would normally fit. That way, the tip of the axle will prevent the ball bearings from falling through, making it easier to slide them into their seat. Pack even more grease into the bearing seat after you slide the ball bearings back into place. Once you’ve inserted the bearings one one side of the hub, repeat the process on the other side. Replace the cone, spacers, and lug nut. Slide the axle through the hub and place the cone over it. Replace any washers or spacers you removed. Twist the lug onto the threaded axle by hand, then tighten it until it’s snug with the cone spacers using the cone spanners. For the rear wheel, place the cassette back onto the hub and tighten its locking nut using the cassette tool.",
    "sentences": [
        " Removing Skate Ball Bearings Take the wheels off of your skates or skateboard.",
        "To remove wheels from a skateboard, loosen the nut using a socket wrench or skate tool.",
        "Use an Allen wrench to remove the wheels from a rollerblade casing.",
        "Be sure to store all nuts and washers in a safe place, such as a plastic bag or small container.",
        "Take the bearings off of your wheels.",
        "In addition to a socket that tightens and loosens nuts, most skate tools also have an attachment that pokes the bearing from the center of the wheel.",
        "While using a skate tool is the preferred method, you can also use a screwdriver to poke out the bearing casing.",
        "If you have a skateboard, you can use the axle to poke out the bearing casing.",
        "Hold the wheel against the axle so the side that would normally face outward faces in and touches the axle.",
        "Apply gentle pressure to pop out the bearing casing.",
        "Remove the rubber or metal seals.",
        "Once you’ve popped the bearing casings out from the wheels’ centers, you’ll need to remove the seal to expose the ball bearings.",
        "If your bearings have a rubber seal, use a paperclip to carefully pry off the seal.",
        "Alternatively, you might have a metal seal secured by a C-clip.",
        "Use a utility knife to pry out the C-clip, then tap the metal seal out.",
        "You’ll be able to see the outline of the C-clip if your metal seal is removable.",
        "If the seal is pressed with no visible seam or outline, the seal is not removable and you will not be able to access the ball bearings.",
        "Cleaning Skate Ball Bearings Use a skate bearing cleaning kit.",
        "The easiest way to clean skate ball bearings is to use a specially made kit, but you can also make your own kit at home.",
        "Grab a sports drink bottle and cut hole in the cap large enough for a bolt that’s a quarter inch (0.6 cm) wide and six inches (15 cm) long.",
        "Run a gasket down the bolt’s length until it’s flush with the head, insert the bolt through the cap, then secure it to the cap using a washer and a nut.",
        "You can cut a ballpoint pen casing into quarter inch (0.6 cm) wide cylinders to create spacers to place between the bearings.",
        "If you want to purchase a skate ball bearing cleaning kit, you can find one online or at a skate shop.",
        "Stack the bearings onto your cleaning kit.",
        "If you’re using a store bought kit, place a bearing casing onto the base, snap a spacer over it, then repeat the sequence until you’ve stacked all of the casings.",
        "If you’re using a homemade cleaning kit, slide the bearing casings down the bolt’s length and place a ballpoint pen spacer between each casing.",
        "Stacking the bearing casings instead of free washing them in a container will help prevent casings from scratching each other.",
        "It’ll also help keep the balls from falling out of the casings.",
        "Fill the cleaning container with citrus cleaner, alcohol, or solvent cleaner.",
        "After stacking the casings, fill your kit container or bottle with a cleaner.",
        "You can use a citrus-based cleaner, 90% pure isopropyl alcohol, or a solvent cleaner, such as acetone.",
        "Each cleaner has pros and cons.",
        "A citrus cleaner is the safest choice, but might leave a residue on the casings.",
        "Isopropyl alcohol and acetone are stronger and won’t leave residue, but are skin irritants and emit hazardous fumes.",
        "Be sure to wear gloves if you choose 90% pure isopropyl alcohol or a solvent cleaner.",
        "Don’t use WD-40 or oil to clean ball bearings or bearing casings.",
        "These will just cause buildup without actually removing any debris.",
        "Shake and soak the bearings.",
        "Insert the stacked bearings into the cleaner-filled container and secure the lid.",
        "Shake the container for a few seconds, then let it sit for five to ten minutes to cut through buildup.",
        "After letting it sit, give the container another shake.",
        "Dry and lubricate your bearings.",
        "Remove the casings from the container and unstack them.",
        "Use compressed air to thoroughly dry them.",
        "Once they’re dry, apply a few drops of lubricant using a hypodermic needle or pin.",
        "Use either a lubricant made for skate ball bearings, sewing machine lubricant, or lubricant made for electronic devices.",
        "These products typically come with a needle applicator.",
        "Reinstall your bearings and wheels.",
        "Once you’ve lubricated your ball bearings, you can reassemble your bearings and wheels.",
        "Snap the rubber or metal seals back onto the bearing casings.",
        "Use a skate tool to reinsert the bearing casings back into the wheels’ centers, then fasten the wheels back onto your skates or skateboard.",
        "You can use a skateboard axle to pop the bearing casing back into place, but you might risk damaging the casing.",
        "Using a skate tool is the preferred method.",
        "Cleaning Bicycle Wheel Cartridge Bearings Take the wheels off of the bike.",
        "Many bikes have a quick release lever that you simply pull and turn counterclockwise.",
        "In addition to the quick release lever, most mountain bikes also have an axle that you’ll slide out after unfastening the quick release.",
        "Some bikes have heavy nuts that secure the wheels in place, which you can remove using a wrench.",
        "Remove the axle endcaps and rear freehub body.",
        "Once you’ve taken the wheels off of the bicycle frame, you’ll need to expose the cartridge that holds the ball bearings.",
        "For the front wheel, just twist or pop off the axle endcaps at the hub, or center of the wheel.",
        "For the rear wheel, you’ll also need to pull out the freehub body as well.",
        "Simply pull it out of the center of the wheel.",
        "Pry off the seal on the cartridge bearing.",
        "Use a utility knife to carefully pry off the cartridge seal.",
        "Take care not to warp or damage the seal or the cartridge races, which hold the ball bearings in place.",
        "Be sure to store the seals and the other parts you removed in a safe place to avoid losing them.",
        "Degrease and wipe the cartridge bearing.",
        "Use a rag to wipe away as much debris as possible from the cartridge.",
        "Grab an aerosol degreaser with a small straw, spray into the cartridge, then wipe away the degreaser.",
        "Spray into the cartridge with WD-40 to eliminate any water residue, as the degreaser will contain some water, then wipe away excess WD-40.",
        "Use a grease gun to repack the cartridge with grease.",
        "Liberally repack the cartridge bearing with bicycle grease.",
        "A grease gun, which you can find online or at a bike shop, is the best way to access the cartridge’s tight spaces.",
        "If you live in a wet area, pack more grease into the cartridge to protect the bearings.",
        "Once you’ve cleaned and repacked one wheel, repeat the process on the other.",
        "Replace the cartridge seal and reinstall the wheels.",
        "Snap the seals back over the cartridge bearings.",
        "Reinsert the rear freehub body and pop the endcaps onto the wheel hubs.",
        "Realign the wheels with the bicycle frame and fasten them by tightening the quick releases or nuts.",
        "Cleaning Bicycle Wheel Loose Bearings Use cone spanners to remove the hub cone and axle.",
        "You’ll need a pair of thin cone spanners to disassemble a cup-and-cone hub.",
        "Place one cone spanner around the cone itself and the other spanner around the lug nut.",
        "Twist the lug counterclockwise to remove it.",
        "For the rear wheel, you’ll have to remove the cassette in order to access the cup-and-cone.",
        "You’ll need a cassette removal tool, which you can find online or at a bike shop, to fit into the cassette and loosen the locking nut.",
        "Set the lug nuts and any washers or spacers aside in proper order to make reassembly easier.",
        "Lift the ball bearings out each side of the hub.",
        "Once you’ve removed the cone, you can access the ball bearings, which sit on each side of the hub.",
        "Use a scalpel blade or narrow utility knife to carefully pull the balls out from the seat on each side.",
        "There are also magnet tools, which look like magnetic sticks, that make it much easier to pull out the ball bearings.",
        "If you use a blade, spray a little grease onto it so the balls will stick to it.",
        "That’ll make it easier to pull them out from their seat.",
        "Keep the ball bearings separate so you know which side is which.",
        "Degrease and wipe the balls and bearing seat.",
        "Spray the ball bearings with an aerosol degreaser and wipe them down with a rag.",
        "Fit a small straw into the nozzle of the aerosol degreaser and spray inside the bearing seat.",
        "Wipe inside the seat by wrapping your finger in a rag.",
        "Wear gloves when using a degreaser.",
        "Pack grease into the bearing seat before reassembling the hub.",
        "Use your grease gun to pack a thick layer of grease into the bearing seat.",
        "Any excess will simply work it’s way out, so pack liberally and don’t worry about adding too much.",
        "If necessary, use your finger to work grease all around the bearing seat.",
        "Insert the ball bearings back into each seat and add more grease.",
        "When replacing the ball bearings, it’s possible to miss the seat, causing the balls to drop through the hub and come out the other side.",
        "To prevent this, you can place the axle through the hub, but in the opposite way that it would normally fit.",
        "That way, the tip of the axle will prevent the ball bearings from falling through, making it easier to slide them into their seat.",
        "Pack even more grease into the bearing seat after you slide the ball bearings back into place.",
        "Once you’ve inserted the bearings one one side of the hub, repeat the process on the other side.",
        "Replace the cone, spacers, and lug nut.",
        "Slide the axle through the hub and place the cone over it.",
        "Replace any washers or spacers you removed.",
        "Twist the lug onto the threaded axle by hand, then tighten it until it’s snug with the cone spacers using the cone spanners.",
        "For the rear wheel, place the cassette back onto the hub and tighten its locking nut using the cassette tool."
    ]
}