{
    "title": "How to Gauge Your Ears",
    "url": "https://www.wikihow.com/Gauge-Your-Ears",
    "category_hierarchy": [
        "Personal Care and Style",
        "Tattoos and Piercing",
        "Piercings",
        "Ear Piercing",
        "Ear Stretching"
    ],
    "parts": [
        {
            "name": "Inserting Your First Taper into Your Ear",
            "steps": [
                {
                    "headline": "Get your ears pierced at a trustworthy location.",
                    "description": "Although you can stretch your ears at home, you will need to get them pierced at a professional establishment. Piercing your ears at home increases your risk of infection, especially if you are stretching your ears afterward. You will be unable to use the same sterile equipment and technique as a licensed professional."
                },
                {
                    "headline": "Wait 6-10 weeks after piercing your ears to stretch them.",
                    "description": "Piercings must be fully healed before it is safe to stretch. If you do not want to wait the full ten weeks, watch for signs of healing. A healed ear piercing will not be tender to the touch and will not close if the piercing is removed for longer than several hours. Do not stretch your ears if your piercing is infected. Signs of infection include swelling, yellow or greenish discharge, redness, irritation, and bleeding."
                },
                {
                    "headline": "Begin stretching your ear with a size 16 or 14 gauge.",
                    "description": "Ears are typically pierced using an 18 or 20 gauge, so 14 is the largest size you can start on and avoid damaging your ears. Starting at any larger than this size puts your ear at-risk of tearing. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJef Saunders\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Piercing Expert\t\t\t\t\t\t\t\tJef Saunders has been piercing professionally for over 20 years. He is the Public Relations Coordinator for the Association of Professional Piercers (APP), an international non-profit dedicated to the educating the public on vital health and body piercing safety, and he teaches piercing for the Fakir Intensives. In 2014, Jef was elected to the Association of Professional Piercer’s Board of Directors. In 2015, Jef received the APP President’s Award from Brian Skellie. Jef Saunders\t\t\tProfessional Piercing Expert\t\t\t\tYou should stretch your ears slowly — using large plugs too soon can tear your ears. The best way to stretch your ears is to work with a piercer who can look at your anatomy and give you good advice about tapering."
                },
                {
                    "headline": "Purchase a set of ear tapers at a piercing studio.",
                    "description": "Many piercing studios offer a \"stretching kit\" of ear tapers in various sizes. Start with your size 16-14 ear taper, depending on your chosen gauge. Make sure that the stretching kit has your starting taper size before you purchase it."
                },
                {
                    "headline": "Massage an oil lubricant around your piercing.",
                    "description": "The lubricant will help the taper slide into your piercing easily and without tearing your ear. Coconut oil or jojoba oil works especially well for stretching ears. Avoid using petroleum oil, which can get clogged in your piercing and cause infections. Wash your hands before you massage the lubricant into your ears."
                },
                {
                    "headline": "Push your taper through your piercing.",
                    "description": "Most piercing tapers are smaller at one end. Push the smaller end into your piercing, paying attention to how your ear feels as you do so. Work slowly, and stop pushing the taper in if you feel any strong resistance. Pushing the taper in may hurt but should not bleed. If your ear begins to bleed, you may have chosen too large of a taper. Remove the taper, treat and disinfect from the wound, and wait until the wound has healed before inserting a smaller taper later on. When your ear has stopped bleeding, place the earring back in to prevent the hole from closing up."
                },
                {
                    "headline": "Replace the taper with your plug or tunnels.",
                    "description": "Align your jewelry with the large end of the taper, hold the taper behind your ear pushing the plug or tunnel through your ear until you push it all the way through and the taper has fallen out. Add the \"O\" rings then repeat these steps with the other ear if desired. Once you have inserted the taper into your piercing, it can be replaced immediately with the plug or tunnel. Tapers are not designed to be worn as jewelry. Do not wear your tapers for any longer than several hours."
                }
            ]
        },
        {
            "name": "Stretching Your Ear Further",
            "steps": [
                {
                    "headline": "Wait six weeks in between stretches.",
                    "description": "Do not remove your first set of plugs or tunnels for at least a week after stretching, and only remove it for the first month while cleaning them. Give your earlobes at least six weeks before stretching your ear with a taper or other method so your earlobes have time to heal."
                },
                {
                    "headline": "Use surgical tape to gradually increase the size over time.",
                    "description": "After you've used 3 or 4 tapers to stretch your piercing, you can use the taping method to continue increasing your size. Wrap your plugs or tunnels with a thin layer of surgical tape and place it back in your ear. Try this method if you have run out of tapers and don't want to purchase more. Increase the layers of tape around your plugs or tunnels every six weeks so your ear has time to heal."
                },
                {
                    "headline": "Use ear weights to stretch your piercing in a short amount of time.",
                    "description": "Weighted plugs or tunnels can stretch your ears quickly but usually do so at an uneven pace. Use ear weights for short-term stretching, but never wear them overnight. Replace them with unweighted plugs or tunnels after several hours to avoid damaging your ear."
                },
                {
                    "headline": "Try tapered claws to painlessly stretch your ears.",
                    "description": "Tapered claws or talons are used to slowly push through your piercing, much like regular tapers, but are created to be worn as jewelry. Tapered claws are usually the easiest and least painful method of stretching because they involve less inserting and removing."
                }
            ]
        },
        {
            "name": "Caring for Stretched Ears",
            "steps": [
                {
                    "headline": "Clean your ears with antibacterial soap twice a day.",
                    "description": "Wash your hands before touching your ears to prevent infection. Apply antibacterial cream around the rim of your piercing to further prevent infection. Any more than two times a day can irritate your piercing. Use a cotton swab to remove any dried skin or crust around your piercing."
                },
                {
                    "headline": "Massage your earlobe for five minutes every day.",
                    "description": "Massage your ear once or twice a day, preferably right after you have washed your ear. This will help your ear heal and accommodate to its new stretched size. Apply jojoba or vitamin-E oil as you massage your ears to keep your piercing soft and stretchy."
                },
                {
                    "headline": "Remove your plugs or tunnels for cleaning after a week.",
                    "description": "To prevent your piercing from smelling bad or getting infected, remove your plugs or tunnels a week after you last stretched your ear and wash it with an antibacterial soap. Rinse the plugs or tunnels before inserting it back in your ear. While your ear plug or tunnel is out, rub some jojoba or vitamin-E oil in and around your piercing. Once you are finished stretching your ears and six weeks have passed since your last stretching session, you can insert and remove your plugs and tunnels as you please without risking shrinkage."
                },
                {
                    "headline": "Watch for signs of infection.",
                    "description": "Redness, swelling, and green or yellow discharge are the most common signs of infection. Not all of these signs necessarily mean your ears are infected: you may just have minor ear irritation. But if you notice two or more infection symptoms, visit a piercer or medical professional for treatment. See a doctor immediately if you notice any severe infection symptoms, such as thick, bad-smelling discharge; red streaks coming from your piercing; fever or chills; nausea; dizziness or disorientation; or any minor infection symptoms for more than a week. If you notice any signs of infection, check your lymph nodes. Swollen lymph nodes are another sign of infection."
                }
            ]
        }
    ],
    "tyn": [
        "Stretching kit with tapers, plugs, tunnels and \"O\" rings for each size. Preferably surgical steel or acrylic (if on a budget). Never silicone.",
        "Cotton buds",
        "Jojoba, coconut, or vitamin-E oil",
        "Surgical tape",
        "Antibacterial soap"
    ],
    "text": " Inserting Your First Taper into Your Ear Get your ears pierced at a trustworthy location. Although you can stretch your ears at home, you will need to get them pierced at a professional establishment. Piercing your ears at home increases your risk of infection, especially if you are stretching your ears afterward. You will be unable to use the same sterile equipment and technique as a licensed professional. Wait 6-10 weeks after piercing your ears to stretch them. Piercings must be fully healed before it is safe to stretch. If you do not want to wait the full ten weeks, watch for signs of healing. A healed ear piercing will not be tender to the touch and will not close if the piercing is removed for longer than several hours. Do not stretch your ears if your piercing is infected. Signs of infection include swelling, yellow or greenish discharge, redness, irritation, and bleeding. Begin stretching your ear with a size 16 or 14 gauge. Ears are typically pierced using an 18 or 20 gauge, so 14 is the largest size you can start on and avoid damaging your ears. Starting at any larger than this size puts your ear at-risk of tearing. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJef Saunders\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Piercing Expert\t\t\t\t\t\t\t\tJef Saunders has been piercing professionally for over 20 years. He is the Public Relations Coordinator for the Association of Professional Piercers (APP), an international non-profit dedicated to the educating the public on vital health and body piercing safety, and he teaches piercing for the Fakir Intensives. In 2014, Jef was elected to the Association of Professional Piercer’s Board of Directors. In 2015, Jef received the APP President’s Award from Brian Skellie. Jef Saunders\t\t\tProfessional Piercing Expert\t\t\t\tYou should stretch your ears slowly — using large plugs too soon can tear your ears. The best way to stretch your ears is to work with a piercer who can look at your anatomy and give you good advice about tapering. Purchase a set of ear tapers at a piercing studio. Many piercing studios offer a \"stretching kit\" of ear tapers in various sizes. Start with your size 16-14 ear taper, depending on your chosen gauge. Make sure that the stretching kit has your starting taper size before you purchase it. Massage an oil lubricant around your piercing. The lubricant will help the taper slide into your piercing easily and without tearing your ear. Coconut oil or jojoba oil works especially well for stretching ears. Avoid using petroleum oil, which can get clogged in your piercing and cause infections. Wash your hands before you massage the lubricant into your ears. Push your taper through your piercing. Most piercing tapers are smaller at one end. Push the smaller end into your piercing, paying attention to how your ear feels as you do so. Work slowly, and stop pushing the taper in if you feel any strong resistance. Pushing the taper in may hurt but should not bleed. If your ear begins to bleed, you may have chosen too large of a taper. Remove the taper, treat and disinfect from the wound, and wait until the wound has healed before inserting a smaller taper later on. When your ear has stopped bleeding, place the earring back in to prevent the hole from closing up. Replace the taper with your plug or tunnels. Align your jewelry with the large end of the taper, hold the taper behind your ear pushing the plug or tunnel through your ear until you push it all the way through and the taper has fallen out. Add the \"O\" rings then repeat these steps with the other ear if desired. Once you have inserted the taper into your piercing, it can be replaced immediately with the plug or tunnel. Tapers are not designed to be worn as jewelry. Do not wear your tapers for any longer than several hours. Stretching Your Ear Further Wait six weeks in between stretches. Do not remove your first set of plugs or tunnels for at least a week after stretching, and only remove it for the first month while cleaning them. Give your earlobes at least six weeks before stretching your ear with a taper or other method so your earlobes have time to heal. Use surgical tape to gradually increase the size over time. After you've used 3 or 4 tapers to stretch your piercing, you can use the taping method to continue increasing your size. Wrap your plugs or tunnels with a thin layer of surgical tape and place it back in your ear. Try this method if you have run out of tapers and don't want to purchase more. Increase the layers of tape around your plugs or tunnels every six weeks so your ear has time to heal. Use ear weights to stretch your piercing in a short amount of time. Weighted plugs or tunnels can stretch your ears quickly but usually do so at an uneven pace. Use ear weights for short-term stretching, but never wear them overnight. Replace them with unweighted plugs or tunnels after several hours to avoid damaging your ear. Try tapered claws to painlessly stretch your ears. Tapered claws or talons are used to slowly push through your piercing, much like regular tapers, but are created to be worn as jewelry. Tapered claws are usually the easiest and least painful method of stretching because they involve less inserting and removing. Caring for Stretched Ears Clean your ears with antibacterial soap twice a day. Wash your hands before touching your ears to prevent infection. Apply antibacterial cream around the rim of your piercing to further prevent infection. Any more than two times a day can irritate your piercing. Use a cotton swab to remove any dried skin or crust around your piercing. Massage your earlobe for five minutes every day. Massage your ear once or twice a day, preferably right after you have washed your ear. This will help your ear heal and accommodate to its new stretched size. Apply jojoba or vitamin-E oil as you massage your ears to keep your piercing soft and stretchy. Remove your plugs or tunnels for cleaning after a week. To prevent your piercing from smelling bad or getting infected, remove your plugs or tunnels a week after you last stretched your ear and wash it with an antibacterial soap. Rinse the plugs or tunnels before inserting it back in your ear. While your ear plug or tunnel is out, rub some jojoba or vitamin-E oil in and around your piercing. Once you are finished stretching your ears and six weeks have passed since your last stretching session, you can insert and remove your plugs and tunnels as you please without risking shrinkage. Watch for signs of infection. Redness, swelling, and green or yellow discharge are the most common signs of infection. Not all of these signs necessarily mean your ears are infected: you may just have minor ear irritation. But if you notice two or more infection symptoms, visit a piercer or medical professional for treatment. See a doctor immediately if you notice any severe infection symptoms, such as thick, bad-smelling discharge; red streaks coming from your piercing; fever or chills; nausea; dizziness or disorientation; or any minor infection symptoms for more than a week. If you notice any signs of infection, check your lymph nodes. Swollen lymph nodes are another sign of infection.",
    "sentences": [
        " Inserting Your First Taper into Your Ear Get your ears pierced at a trustworthy location.",
        "Although you can stretch your ears at home, you will need to get them pierced at a professional establishment.",
        "Piercing your ears at home increases your risk of infection, especially if you are stretching your ears afterward.",
        "You will be unable to use the same sterile equipment and technique as a licensed professional.",
        "Wait 6-10 weeks after piercing your ears to stretch them.",
        "Piercings must be fully healed before it is safe to stretch.",
        "If you do not want to wait the full ten weeks, watch for signs of healing.",
        "A healed ear piercing will not be tender to the touch and will not close if the piercing is removed for longer than several hours.",
        "Do not stretch your ears if your piercing is infected.",
        "Signs of infection include swelling, yellow or greenish discharge, redness, irritation, and bleeding.",
        "Begin stretching your ear with a size 16 or 14 gauge.",
        "Ears are typically pierced using an 18 or 20 gauge, so 14 is the largest size you can start on and avoid damaging your ears.",
        "Starting at any larger than this size puts your ear at-risk of tearing.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJef Saunders\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Piercing Expert\t\t\t\t\t\t\t\tJef Saunders has been piercing professionally for over 20 years.",
        "He is the Public Relations Coordinator for the Association of Professional Piercers (APP), an international non-profit dedicated to the educating the public on vital health and body piercing safety, and he teaches piercing for the Fakir Intensives.",
        "In 2014, Jef was elected to the Association of Professional Piercer’s Board of Directors.",
        "In 2015, Jef received the APP President’s Award from Brian Skellie.",
        "Jef Saunders\t\t\tProfessional Piercing Expert\t\t\t\tYou should stretch your ears slowly — using large plugs too soon can tear your ears.",
        "The best way to stretch your ears is to work with a piercer who can look at your anatomy and give you good advice about tapering.",
        "Purchase a set of ear tapers at a piercing studio.",
        "Many piercing studios offer a \"stretching kit\" of ear tapers in various sizes.",
        "Start with your size 16-14 ear taper, depending on your chosen gauge.",
        "Make sure that the stretching kit has your starting taper size before you purchase it.",
        "Massage an oil lubricant around your piercing.",
        "The lubricant will help the taper slide into your piercing easily and without tearing your ear.",
        "Coconut oil or jojoba oil works especially well for stretching ears.",
        "Avoid using petroleum oil, which can get clogged in your piercing and cause infections.",
        "Wash your hands before you massage the lubricant into your ears.",
        "Push your taper through your piercing.",
        "Most piercing tapers are smaller at one end.",
        "Push the smaller end into your piercing, paying attention to how your ear feels as you do so.",
        "Work slowly, and stop pushing the taper in if you feel any strong resistance.",
        "Pushing the taper in may hurt but should not bleed.",
        "If your ear begins to bleed, you may have chosen too large of a taper.",
        "Remove the taper, treat and disinfect from the wound, and wait until the wound has healed before inserting a smaller taper later on.",
        "When your ear has stopped bleeding, place the earring back in to prevent the hole from closing up.",
        "Replace the taper with your plug or tunnels.",
        "Align your jewelry with the large end of the taper, hold the taper behind your ear pushing the plug or tunnel through your ear until you push it all the way through and the taper has fallen out.",
        "Add the \"O\" rings then repeat these steps with the other ear if desired.",
        "Once you have inserted the taper into your piercing, it can be replaced immediately with the plug or tunnel.",
        "Tapers are not designed to be worn as jewelry.",
        "Do not wear your tapers for any longer than several hours.",
        "Stretching Your Ear Further Wait six weeks in between stretches.",
        "Do not remove your first set of plugs or tunnels for at least a week after stretching, and only remove it for the first month while cleaning them.",
        "Give your earlobes at least six weeks before stretching your ear with a taper or other method so your earlobes have time to heal.",
        "Use surgical tape to gradually increase the size over time.",
        "After you've used 3 or 4 tapers to stretch your piercing, you can use the taping method to continue increasing your size.",
        "Wrap your plugs or tunnels with a thin layer of surgical tape and place it back in your ear.",
        "Try this method if you have run out of tapers and don't want to purchase more.",
        "Increase the layers of tape around your plugs or tunnels every six weeks so your ear has time to heal.",
        "Use ear weights to stretch your piercing in a short amount of time.",
        "Weighted plugs or tunnels can stretch your ears quickly but usually do so at an uneven pace.",
        "Use ear weights for short-term stretching, but never wear them overnight.",
        "Replace them with unweighted plugs or tunnels after several hours to avoid damaging your ear.",
        "Try tapered claws to painlessly stretch your ears.",
        "Tapered claws or talons are used to slowly push through your piercing, much like regular tapers, but are created to be worn as jewelry.",
        "Tapered claws are usually the easiest and least painful method of stretching because they involve less inserting and removing.",
        "Caring for Stretched Ears Clean your ears with antibacterial soap twice a day.",
        "Wash your hands before touching your ears to prevent infection.",
        "Apply antibacterial cream around the rim of your piercing to further prevent infection.",
        "Any more than two times a day can irritate your piercing.",
        "Use a cotton swab to remove any dried skin or crust around your piercing.",
        "Massage your earlobe for five minutes every day.",
        "Massage your ear once or twice a day, preferably right after you have washed your ear.",
        "This will help your ear heal and accommodate to its new stretched size.",
        "Apply jojoba or vitamin-E oil as you massage your ears to keep your piercing soft and stretchy.",
        "Remove your plugs or tunnels for cleaning after a week.",
        "To prevent your piercing from smelling bad or getting infected, remove your plugs or tunnels a week after you last stretched your ear and wash it with an antibacterial soap.",
        "Rinse the plugs or tunnels before inserting it back in your ear.",
        "While your ear plug or tunnel is out, rub some jojoba or vitamin-E oil in and around your piercing.",
        "Once you are finished stretching your ears and six weeks have passed since your last stretching session, you can insert and remove your plugs and tunnels as you please without risking shrinkage.",
        "Watch for signs of infection.",
        "Redness, swelling, and green or yellow discharge are the most common signs of infection.",
        "Not all of these signs necessarily mean your ears are infected: you may just have minor ear irritation.",
        "But if you notice two or more infection symptoms, visit a piercer or medical professional for treatment.",
        "See a doctor immediately if you notice any severe infection symptoms, such as thick, bad-smelling discharge; red streaks coming from your piercing; fever or chills; nausea; dizziness or disorientation; or any minor infection symptoms for more than a week.",
        "If you notice any signs of infection, check your lymph nodes.",
        "Swollen lymph nodes are another sign of infection."
    ]
}