{
    "title": "How to Prepare Make‐Ahead Breakfast Bowls",
    "url": "https://www.wikihow.com/Prepare-Make%E2%80%90Ahead-Breakfast-Bowls",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Meal Planning"
    ],
    "methods": [
        {
            "name": "Preparing Oatmeal Bowls",
            "steps": [
                {
                    "headline": "Combine all of the ingredients in a large bowl.",
                    "description": "Pour the milk, rolled oats, and salt into a large bowl. For extra flavor and nutrients, add some shredded coconut and chia seeds. Stir everything together with a rubber spatula to combine. If you don't like chia seeds and/or coconut, you can leave them out. If you don't like milk at all, you can use plain water instead."
                },
                {
                    "headline": "Cover the bowl and let it sit for 10 minutes.",
                    "description": "During this time, the oats and chia seeds (if you are using them) will absorb the milk."
                },
                {
                    "headline": "Divide the oatmeal between four containers.",
                    "description": "Don't worry if it looks soggy. The oatmeal will continue to thicken overnight."
                },
                {
                    "headline": "Cover and refrigerate the oatmeal.",
                    "description": "The oatmeal will last up to four days in the fridge."
                },
                {
                    "headline": "Serve the oatmeal chilled.",
                    "description": "You can garnish the oatmeal before you serve it to make it even more flavorful. You can add things such as shredded coconut, berries, nuts, or pieces of dried fruit. You can also sweeten it with honey, maple syrup, or agave nectar. Another delicious option would be a sprinkle of cinnamon."
                }
            ]
        },
        {
            "name": "Preparing Quinoa Bowls",
            "steps": [
                {
                    "headline": "Drain and rinse the quinoa.",
                    "description": "If you have not yet already, soak the quinoa for 1 hour. Drain it, then rinse it off."
                },
                {
                    "headline": "Place the quinoa and other ingredients into a saucepan.",
                    "description": "This includes the milk, water, cinnamon, maple syrup, vanilla and salt. You can use any type of milk you want, including coconut milk, regular milk, or even almond milk. If you don't have maple syrup, you could try agave nectar or honey instead."
                },
                {
                    "headline": "Cook the mixture until the liquid is gone.",
                    "description": "Bring the mixture to a boil over high heat. Once it comes to a boil, reduce the heat to low, and cover the saucepan with a lid. Let the mixture cook until the liquid is gone and the quinoa is tender. This will take about 20 to 25 minutes."
                },
                {
                    "headline": "Divide the mixture between six containers.",
                    "description": "You will be able to fill each container with about 1 cup (185 grams) of quinoa."
                },
                {
                    "headline": "Let the mixtures cool before covering and storing them in the fridge.",
                    "description": "They should last for 5 to 7 days."
                },
                {
                    "headline": "Garnish the bowls before eating them.",
                    "description": "You can eat them as they are, or you can garnish them further with tasty things like: milk, fresh fruit, coconut flakes, etc. Other great garnishes include blueberries, nuts, sliced bananas, and sliced strawberries. Only garnish the bowls you are about to eat, otherwise the garnishes will grow soft and soggy. You can use non-dairy milk, such as almond milk, as well."
                }
            ]
        },
        {
            "name": "Preparing Roasted Potato and Egg Bowls",
            "steps": [
                {
                    "headline": "Preheat your oven to 425°F (219°C).",
                    "description": ""
                },
                {
                    "headline": "Prepare the vegetables.",
                    "description": "Wash the potatoes and peppers, then peel the potatoes and onions. Chop the potatoes, peppers, and onions into 1-inch (2.54-centimeter) cubes."
                },
                {
                    "headline": "Season the vegetables with oil, salt, and pepper.",
                    "description": "Place the chopped potatoes, peppers, and onions into a large mixing bowl. Drizzle them with extra-virgin olive oil, then season them with salt and pepper. Toss them to combine everything."
                },
                {
                    "headline": "Bake the vegetables for 30 to 40 minutes.",
                    "description": "Divide the vegetables between two large baking sheets. Place both of the baking sheets into the oven. Bake the vegetables for 30 to 40 minutes, or until the potatoes are golden. Half way through the baking process, rotate the pans and give the vegetables a stir."
                },
                {
                    "headline": "Whisk and season the eggs.",
                    "description": "Crack the eggs into a large mixing bowl. Add some salt and pepper. Whisk them until the yolks break and the color turns even."
                },
                {
                    "headline": "Fry the scrambled eggs over a skillet.",
                    "description": "Coat a large skillet with nonstick cooking spray or butter. Heat it over medium heat, then add the eggs. Scramble the eggs until they are just cooked through, about 3 to 4 minutes. Transfer them to a plate, then set them aside. The eggs will continue to cook even after you take them off the skillet."
                },
                {
                    "headline": "Divide the vegetables and eggs between six containers.",
                    "description": "You can get as creative as you want with the layering. You even also mix and match with different combinations of vegetables and eggs. If your containers have lids, leave them off for now. Consider adding 1 to 2 pounds (cc to cc grams) of sausage for a heartier meal. Cook the sausage over medium-high heat for 8 to 10 minutes, or until it's browned and cooked through."
                },
                {
                    "headline": "Allow the bowls to cool before you garnish them.",
                    "description": "You can get really creative here. Great choices for garnishes include shredded cheese and green onions. You can also add some pico de gallo or salsa, if you'd like."
                },
                {
                    "headline": "Cover and refrigerate the bowls.",
                    "description": "You can also keep them in the freezer instead."
                },
                {
                    "headline": "Reheat the bowls in the microwave when you are ready to eat them.",
                    "description": "Cook them at half powder for about 1 minute and 30 seconds. Give the bowl a stir, then cook it at 10-second intervals until it's warm; stir between each interval. Add some extras on top after reheating, such as sliced avocado. If you don't eat the bowls within three days, put them into the freezer."
                }
            ]
        }
    ],
    "tyn": [
        "Preparing Oatmeal Bowls",
        "Large mixing bowl",
        "Rubber spatula",
        "4 Tupperware or glass containers with lids",
        "Preparing Quinoa Bowls",
        "Saucepan",
        "6 Tupperware or glass containers with lids",
        "Roasted Potato and Egg Bowls",
        "2 large baking sheets",
        "Wooden spoon or rubber spatula"
    ],
    "text": " Preparing Oatmeal Bowls Combine all of the ingredients in a large bowl. Pour the milk, rolled oats, and salt into a large bowl. For extra flavor and nutrients, add some shredded coconut and chia seeds. Stir everything together with a rubber spatula to combine. If you don't like chia seeds and/or coconut, you can leave them out. If you don't like milk at all, you can use plain water instead. Cover the bowl and let it sit for 10 minutes. During this time, the oats and chia seeds (if you are using them) will absorb the milk. Divide the oatmeal between four containers. Don't worry if it looks soggy. The oatmeal will continue to thicken overnight. Cover and refrigerate the oatmeal. The oatmeal will last up to four days in the fridge. Serve the oatmeal chilled. You can garnish the oatmeal before you serve it to make it even more flavorful. You can add things such as shredded coconut, berries, nuts, or pieces of dried fruit. You can also sweeten it with honey, maple syrup, or agave nectar. Another delicious option would be a sprinkle of cinnamon. Preparing Quinoa Bowls Drain and rinse the quinoa. If you have not yet already, soak the quinoa for 1 hour. Drain it, then rinse it off. Place the quinoa and other ingredients into a saucepan. This includes the milk, water, cinnamon, maple syrup, vanilla and salt. You can use any type of milk you want, including coconut milk, regular milk, or even almond milk. If you don't have maple syrup, you could try agave nectar or honey instead. Cook the mixture until the liquid is gone. Bring the mixture to a boil over high heat. Once it comes to a boil, reduce the heat to low, and cover the saucepan with a lid. Let the mixture cook until the liquid is gone and the quinoa is tender. This will take about 20 to 25 minutes. Divide the mixture between six containers. You will be able to fill each container with about 1 cup (185 grams) of quinoa. Let the mixtures cool before covering and storing them in the fridge. They should last for 5 to 7 days. Garnish the bowls before eating them. You can eat them as they are, or you can garnish them further with tasty things like: milk, fresh fruit, coconut flakes, etc. Other great garnishes include blueberries, nuts, sliced bananas, and sliced strawberries. Only garnish the bowls you are about to eat, otherwise the garnishes will grow soft and soggy. You can use non-dairy milk, such as almond milk, as well. Preparing Roasted Potato and Egg Bowls Preheat your oven to 425°F (219°C).  Prepare the vegetables. Wash the potatoes and peppers, then peel the potatoes and onions. Chop the potatoes, peppers, and onions into 1-inch (2.54-centimeter) cubes. Season the vegetables with oil, salt, and pepper. Place the chopped potatoes, peppers, and onions into a large mixing bowl. Drizzle them with extra-virgin olive oil, then season them with salt and pepper. Toss them to combine everything. Bake the vegetables for 30 to 40 minutes. Divide the vegetables between two large baking sheets. Place both of the baking sheets into the oven. Bake the vegetables for 30 to 40 minutes, or until the potatoes are golden. Half way through the baking process, rotate the pans and give the vegetables a stir. Whisk and season the eggs. Crack the eggs into a large mixing bowl. Add some salt and pepper. Whisk them until the yolks break and the color turns even. Fry the scrambled eggs over a skillet. Coat a large skillet with nonstick cooking spray or butter. Heat it over medium heat, then add the eggs. Scramble the eggs until they are just cooked through, about 3 to 4 minutes. Transfer them to a plate, then set them aside. The eggs will continue to cook even after you take them off the skillet. Divide the vegetables and eggs between six containers. You can get as creative as you want with the layering. You even also mix and match with different combinations of vegetables and eggs. If your containers have lids, leave them off for now. Consider adding 1 to 2 pounds (cc to cc grams) of sausage for a heartier meal. Cook the sausage over medium-high heat for 8 to 10 minutes, or until it's browned and cooked through. Allow the bowls to cool before you garnish them. You can get really creative here. Great choices for garnishes include shredded cheese and green onions. You can also add some pico de gallo or salsa, if you'd like. Cover and refrigerate the bowls. You can also keep them in the freezer instead. Reheat the bowls in the microwave when you are ready to eat them. Cook them at half powder for about 1 minute and 30 seconds. Give the bowl a stir, then cook it at 10-second intervals until it's warm; stir between each interval. Add some extras on top after reheating, such as sliced avocado. If you don't eat the bowls within three days, put them into the freezer.",
    "sentences": [
        " Preparing Oatmeal Bowls Combine all of the ingredients in a large bowl.",
        "Pour the milk, rolled oats, and salt into a large bowl.",
        "For extra flavor and nutrients, add some shredded coconut and chia seeds.",
        "Stir everything together with a rubber spatula to combine.",
        "If you don't like chia seeds and/or coconut, you can leave them out.",
        "If you don't like milk at all, you can use plain water instead.",
        "Cover the bowl and let it sit for 10 minutes.",
        "During this time, the oats and chia seeds (if you are using them) will absorb the milk.",
        "Divide the oatmeal between four containers.",
        "Don't worry if it looks soggy.",
        "The oatmeal will continue to thicken overnight.",
        "Cover and refrigerate the oatmeal.",
        "The oatmeal will last up to four days in the fridge.",
        "Serve the oatmeal chilled.",
        "You can garnish the oatmeal before you serve it to make it even more flavorful.",
        "You can add things such as shredded coconut, berries, nuts, or pieces of dried fruit.",
        "You can also sweeten it with honey, maple syrup, or agave nectar.",
        "Another delicious option would be a sprinkle of cinnamon.",
        "Preparing Quinoa Bowls Drain and rinse the quinoa.",
        "If you have not yet already, soak the quinoa for 1 hour.",
        "Drain it, then rinse it off.",
        "Place the quinoa and other ingredients into a saucepan.",
        "This includes the milk, water, cinnamon, maple syrup, vanilla and salt.",
        "You can use any type of milk you want, including coconut milk, regular milk, or even almond milk.",
        "If you don't have maple syrup, you could try agave nectar or honey instead.",
        "Cook the mixture until the liquid is gone.",
        "Bring the mixture to a boil over high heat.",
        "Once it comes to a boil, reduce the heat to low, and cover the saucepan with a lid.",
        "Let the mixture cook until the liquid is gone and the quinoa is tender.",
        "This will take about 20 to 25 minutes.",
        "Divide the mixture between six containers.",
        "You will be able to fill each container with about 1 cup (185 grams) of quinoa.",
        "Let the mixtures cool before covering and storing them in the fridge.",
        "They should last for 5 to 7 days.",
        "Garnish the bowls before eating them.",
        "You can eat them as they are, or you can garnish them further with tasty things like: milk, fresh fruit, coconut flakes, etc.",
        "Other great garnishes include blueberries, nuts, sliced bananas, and sliced strawberries.",
        "Only garnish the bowls you are about to eat, otherwise the garnishes will grow soft and soggy.",
        "You can use non-dairy milk, such as almond milk, as well.",
        "Preparing Roasted Potato and Egg Bowls Preheat your oven to 425°F (219°C).",
        "Prepare the vegetables.",
        "Wash the potatoes and peppers, then peel the potatoes and onions.",
        "Chop the potatoes, peppers, and onions into 1-inch (2.54-centimeter) cubes.",
        "Season the vegetables with oil, salt, and pepper.",
        "Place the chopped potatoes, peppers, and onions into a large mixing bowl.",
        "Drizzle them with extra-virgin olive oil, then season them with salt and pepper.",
        "Toss them to combine everything.",
        "Bake the vegetables for 30 to 40 minutes.",
        "Divide the vegetables between two large baking sheets.",
        "Place both of the baking sheets into the oven.",
        "Bake the vegetables for 30 to 40 minutes, or until the potatoes are golden.",
        "Half way through the baking process, rotate the pans and give the vegetables a stir.",
        "Whisk and season the eggs.",
        "Crack the eggs into a large mixing bowl.",
        "Add some salt and pepper.",
        "Whisk them until the yolks break and the color turns even.",
        "Fry the scrambled eggs over a skillet.",
        "Coat a large skillet with nonstick cooking spray or butter.",
        "Heat it over medium heat, then add the eggs.",
        "Scramble the eggs until they are just cooked through, about 3 to 4 minutes.",
        "Transfer them to a plate, then set them aside.",
        "The eggs will continue to cook even after you take them off the skillet.",
        "Divide the vegetables and eggs between six containers.",
        "You can get as creative as you want with the layering.",
        "You even also mix and match with different combinations of vegetables and eggs.",
        "If your containers have lids, leave them off for now.",
        "Consider adding 1 to 2 pounds (cc to cc grams) of sausage for a heartier meal.",
        "Cook the sausage over medium-high heat for 8 to 10 minutes, or until it's browned and cooked through.",
        "Allow the bowls to cool before you garnish them.",
        "You can get really creative here.",
        "Great choices for garnishes include shredded cheese and green onions.",
        "You can also add some pico de gallo or salsa, if you'd like.",
        "Cover and refrigerate the bowls.",
        "You can also keep them in the freezer instead.",
        "Reheat the bowls in the microwave when you are ready to eat them.",
        "Cook them at half powder for about 1 minute and 30 seconds.",
        "Give the bowl a stir, then cook it at 10-second intervals until it's warm; stir between each interval.",
        "Add some extras on top after reheating, such as sliced avocado.",
        "If you don't eat the bowls within three days, put them into the freezer."
    ]
}