{
    "title": "How to Make Homemade Pill Pockets for Your Dog",
    "url": "https://www.wikihow.com/Make-Homemade-Pill-Pockets-for-Your-Dog",
    "category_hierarchy": [
        "Pets and Animals",
        "Dogs",
        "Canine Health",
        "Dog Medication"
    ],
    "methods": [
        {
            "name": "Making Basic Pill Pockets",
            "steps": [
                {
                    "headline": "Place 2 tablespoons (15 grams) of flour into a bowl.",
                    "description": "If you don't have any all-purpose flour at home, you can also try one of the following: barley, brown rice, coconut, spelt, or whole wheat."
                },
                {
                    "headline": "Pour in 1 tablespoon (15 milliliters) of milk.",
                    "description": "If your dog is lactose intolerant, try almond milk or coconut milk. You can also use coconut oil instead."
                },
                {
                    "headline": "Add 1 tablespoon (15 grams) of smooth peanut butter.",
                    "description": "Make sure that the peanut butter is unsalted and does not contain xylitol. Xylitol is a substitute sweetener and can be deadly to dogs."
                },
                {
                    "headline": "Stir everything together with a spoon.",
                    "description": "Once everything comes together, knead the dough with your fingers."
                },
                {
                    "headline": "Divide the mixture into small balls.",
                    "description": "You can also make them square or oval-shaped instead, but make sure that they can fit your dog's pills. You should be able to make 9 to 12 pill pockets, depending on the size of the pills. If the dough is getting too sticky to work with, roll the balls in a little flour before moving on."
                },
                {
                    "headline": "Make a hole in each pocket, about ½ to ¾ of the way deep.",
                    "description": "You can use the end of a wooden spoon, a chopstick, a pencil eraser, or even a thermometer to make the pocket. It needs to be large enough for the pill to slide into."
                },
                {
                    "headline": "Store the pill pockets in a zippered bag.",
                    "description": "They will last in the fridge for about 1 week, and in the freezer for 3 months. If you want to freeze the pill pockets, freeze them on a baking sheet lined with parchment paper of wax paper for 1 hour first, then transfer them to a freezer-safe container. If you used milk in the pockets, use the pills by the expiration date on the carton. If you used coconut oil, the pill pockets will last about 3 months."
                }
            ]
        },
        {
            "name": "Making Chicken-Flavored Pill Pockets",
            "steps": [
                {
                    "headline": "Place 2 tablespoons (15 grams) of chicken powder into a small bowl.",
                    "description": "Chicken powder is simply powdered chicken bouillon. If you can't find any, you can crush up low-sodium chicken bouillon and use that instead. If your dog doesn't like chicken, try another flavor, such as beef or pork."
                },
                {
                    "headline": "Add 1 tablespoon (15 milliliters) of meat broth or baby food.",
                    "description": "Any flavor will do: beef, chicken, pork, etc. Choose one that your dog likes best."
                },
                {
                    "headline": "Add 1 tablespoon (15 grams) of peanut butter or bacon grease.",
                    "description": "You can also use burger grease instead. If you are using peanut butter, make sure that it is unsalted and does not contain xylitol. Xylitol is a substitute sweetener found in some sugar-free products and can be deadly to dogs."
                },
                {
                    "headline": "Combine the ingredients to form a dough.",
                    "description": "Stir them together with a spoon first. Once everything comes together, start kneading them by hand until they form a dough."
                },
                {
                    "headline": "Form the dough into 9 to 12 balls.",
                    "description": "They need to be big enough to fit your dog's pills. How many balls you end up making depends on how big the pills are. The smaller the pill, the more balls you'll be able to make."
                },
                {
                    "headline": "Make a small hole part of the way through each pill pocket.",
                    "description": "The hole needs to go only ½ to ¾ of the way through each ball. You can use just about anything to make them, such as chopsticks, pencil erasers, thermometers, or even the end of a small, wooden spoon."
                },
                {
                    "headline": "Store the pill pockets in an airtight baggie in the fridge.",
                    "description": "They will last about 1 week. If you won't use all of them in that time, you will need to freeze the rest. Begin by lining the pill pockets on a baking sheet lined with parchment paper or wax paper, then freeze them for 1 hour. After that, you can transfer them to a freezer-safe container."
                }
            ]
        },
        {
            "name": "Making Healthy Pill Pockets",
            "steps": [
                {
                    "headline": "Pour ¾ cup (75 grams) oat or oatmeal flour into a mixing bowl.",
                    "description": "This will be your base. If you can't find any oat or oatmeal flour, you can make your own by grinding up oatmeal to a fine powder in a blender or food processor. You can also try using another type of flour instead."
                },
                {
                    "headline": "Add ¼ cup (25 grams) of gelatin powder.",
                    "description": "Try to get beef gelatin powder, if you can. It is beneficial to a dog's joints."
                },
                {
                    "headline": "Add some flavor with 3 tablespoons (45 grams) of peanut butter.",
                    "description": "What dog doesn't like peanut butter? Just make sure that you get the smooth, unsalted kind. More importantly, make sure that it doesn't contain xylitol. Xylitol is a substitute sweetener commonly added to sugar-free products. It can be deadly to dogs."
                },
                {
                    "headline": "Scoop ⅓ cup (75 grams) of coconut oil into the bowl.",
                    "description": "Coconut oil is great not just for you, but for your dog as well. It can help make your dog's coat glossy and smooth."
                },
                {
                    "headline": "Pour in ½ cup (120 milliliters) of chicken stock.",
                    "description": "You can use the store-bought kind, but make sure that it is low-sodium. If you have extra time, however, you could make your own at home. This way, you can ensure that it is as low in sodium as possible."
                },
                {
                    "headline": "Stir everything together until combined.",
                    "description": "Once the dry ingredients soak up all of the wet ones, switch to kneading the dough with your hands. Be careful not to over-work it, however, or the coconut oil will turn too soft."
                },
                {
                    "headline": "Shape the dough into small balls.",
                    "description": "The balls need to be big enough to completely cover your dogs pills. How many you end up making depends on the size of the pills. The smaller the pills are, the more pill pockets you'll be able to make. Wet your hands first. This will make the dough easier to work with."
                },
                {
                    "headline": "Poke a hole part of the way through each ball.",
                    "description": "You can make these holes using just about anything, from a chopstick to a pencil eraser. The holes need to be wide enough to fit the pill. Also, make sure that they only go ½ to ¾ of the way through each pill."
                },
                {
                    "headline": "Store the pill pockets in the fridge.",
                    "description": "They will last about 1 week. If you won't use all of the pills during that time, you will need to freeze them. Line them up on a baking sheet lined with wax paper or parchment paper. Freeze them for 1 hour, then transfer them to a freezer-safe container. They will last about 3 months in the freezer."
                }
            ]
        }
    ],
    "tyn": [
        "Mixing bowl",
        "Spoon",
        "Plastic container or zippered baggie",
        "Chopstick, wooden spoon, pencil eraser, etc."
    ],
    "text": " Making Basic Pill Pockets Place 2 tablespoons (15 grams) of flour into a bowl. If you don't have any all-purpose flour at home, you can also try one of the following: barley, brown rice, coconut, spelt, or whole wheat. Pour in 1 tablespoon (15 milliliters) of milk. If your dog is lactose intolerant, try almond milk or coconut milk. You can also use coconut oil instead. Add 1 tablespoon (15 grams) of smooth peanut butter. Make sure that the peanut butter is unsalted and does not contain xylitol. Xylitol is a substitute sweetener and can be deadly to dogs. Stir everything together with a spoon. Once everything comes together, knead the dough with your fingers. Divide the mixture into small balls. You can also make them square or oval-shaped instead, but make sure that they can fit your dog's pills. You should be able to make 9 to 12 pill pockets, depending on the size of the pills. If the dough is getting too sticky to work with, roll the balls in a little flour before moving on. Make a hole in each pocket, about ½ to ¾ of the way deep. You can use the end of a wooden spoon, a chopstick, a pencil eraser, or even a thermometer to make the pocket. It needs to be large enough for the pill to slide into. Store the pill pockets in a zippered bag. They will last in the fridge for about 1 week, and in the freezer for 3 months. If you want to freeze the pill pockets, freeze them on a baking sheet lined with parchment paper of wax paper for 1 hour first, then transfer them to a freezer-safe container. If you used milk in the pockets, use the pills by the expiration date on the carton. If you used coconut oil, the pill pockets will last about 3 months. Making Chicken-Flavored Pill Pockets Place 2 tablespoons (15 grams) of chicken powder into a small bowl. Chicken powder is simply powdered chicken bouillon. If you can't find any, you can crush up low-sodium chicken bouillon and use that instead. If your dog doesn't like chicken, try another flavor, such as beef or pork. Add 1 tablespoon (15 milliliters) of meat broth or baby food. Any flavor will do: beef, chicken, pork, etc. Choose one that your dog likes best. Add 1 tablespoon (15 grams) of peanut butter or bacon grease. You can also use burger grease instead. If you are using peanut butter, make sure that it is unsalted and does not contain xylitol. Xylitol is a substitute sweetener found in some sugar-free products and can be deadly to dogs. Combine the ingredients to form a dough. Stir them together with a spoon first. Once everything comes together, start kneading them by hand until they form a dough. Form the dough into 9 to 12 balls. They need to be big enough to fit your dog's pills. How many balls you end up making depends on how big the pills are. The smaller the pill, the more balls you'll be able to make. Make a small hole part of the way through each pill pocket. The hole needs to go only ½ to ¾ of the way through each ball. You can use just about anything to make them, such as chopsticks, pencil erasers, thermometers, or even the end of a small, wooden spoon. Store the pill pockets in an airtight baggie in the fridge. They will last about 1 week. If you won't use all of them in that time, you will need to freeze the rest. Begin by lining the pill pockets on a baking sheet lined with parchment paper or wax paper, then freeze them for 1 hour. After that, you can transfer them to a freezer-safe container. Making Healthy Pill Pockets Pour ¾ cup (75 grams) oat or oatmeal flour into a mixing bowl. This will be your base. If you can't find any oat or oatmeal flour, you can make your own by grinding up oatmeal to a fine powder in a blender or food processor. You can also try using another type of flour instead. Add ¼ cup (25 grams) of gelatin powder. Try to get beef gelatin powder, if you can. It is beneficial to a dog's joints. Add some flavor with 3 tablespoons (45 grams) of peanut butter. What dog doesn't like peanut butter? Just make sure that you get the smooth, unsalted kind. More importantly, make sure that it doesn't contain xylitol. Xylitol is a substitute sweetener commonly added to sugar-free products. It can be deadly to dogs. Scoop ⅓ cup (75 grams) of coconut oil into the bowl. Coconut oil is great not just for you, but for your dog as well. It can help make your dog's coat glossy and smooth. Pour in ½ cup (120 milliliters) of chicken stock. You can use the store-bought kind, but make sure that it is low-sodium. If you have extra time, however, you could make your own at home. This way, you can ensure that it is as low in sodium as possible. Stir everything together until combined. Once the dry ingredients soak up all of the wet ones, switch to kneading the dough with your hands. Be careful not to over-work it, however, or the coconut oil will turn too soft. Shape the dough into small balls. The balls need to be big enough to completely cover your dogs pills. How many you end up making depends on the size of the pills. The smaller the pills are, the more pill pockets you'll be able to make. Wet your hands first. This will make the dough easier to work with. Poke a hole part of the way through each ball. You can make these holes using just about anything, from a chopstick to a pencil eraser. The holes need to be wide enough to fit the pill. Also, make sure that they only go ½ to ¾ of the way through each pill. Store the pill pockets in the fridge. They will last about 1 week. If you won't use all of the pills during that time, you will need to freeze them. Line them up on a baking sheet lined with wax paper or parchment paper. Freeze them for 1 hour, then transfer them to a freezer-safe container. They will last about 3 months in the freezer.",
    "sentences": [
        " Making Basic Pill Pockets Place 2 tablespoons (15 grams) of flour into a bowl.",
        "If you don't have any all-purpose flour at home, you can also try one of the following: barley, brown rice, coconut, spelt, or whole wheat.",
        "Pour in 1 tablespoon (15 milliliters) of milk.",
        "If your dog is lactose intolerant, try almond milk or coconut milk.",
        "You can also use coconut oil instead.",
        "Add 1 tablespoon (15 grams) of smooth peanut butter.",
        "Make sure that the peanut butter is unsalted and does not contain xylitol.",
        "Xylitol is a substitute sweetener and can be deadly to dogs.",
        "Stir everything together with a spoon.",
        "Once everything comes together, knead the dough with your fingers.",
        "Divide the mixture into small balls.",
        "You can also make them square or oval-shaped instead, but make sure that they can fit your dog's pills.",
        "You should be able to make 9 to 12 pill pockets, depending on the size of the pills.",
        "If the dough is getting too sticky to work with, roll the balls in a little flour before moving on.",
        "Make a hole in each pocket, about ½ to ¾ of the way deep.",
        "You can use the end of a wooden spoon, a chopstick, a pencil eraser, or even a thermometer to make the pocket.",
        "It needs to be large enough for the pill to slide into.",
        "Store the pill pockets in a zippered bag.",
        "They will last in the fridge for about 1 week, and in the freezer for 3 months.",
        "If you want to freeze the pill pockets, freeze them on a baking sheet lined with parchment paper of wax paper for 1 hour first, then transfer them to a freezer-safe container.",
        "If you used milk in the pockets, use the pills by the expiration date on the carton.",
        "If you used coconut oil, the pill pockets will last about 3 months.",
        "Making Chicken-Flavored Pill Pockets Place 2 tablespoons (15 grams) of chicken powder into a small bowl.",
        "Chicken powder is simply powdered chicken bouillon.",
        "If you can't find any, you can crush up low-sodium chicken bouillon and use that instead.",
        "If your dog doesn't like chicken, try another flavor, such as beef or pork.",
        "Add 1 tablespoon (15 milliliters) of meat broth or baby food.",
        "Any flavor will do: beef, chicken, pork, etc.",
        "Choose one that your dog likes best.",
        "Add 1 tablespoon (15 grams) of peanut butter or bacon grease.",
        "You can also use burger grease instead.",
        "If you are using peanut butter, make sure that it is unsalted and does not contain xylitol.",
        "Xylitol is a substitute sweetener found in some sugar-free products and can be deadly to dogs.",
        "Combine the ingredients to form a dough.",
        "Stir them together with a spoon first.",
        "Once everything comes together, start kneading them by hand until they form a dough.",
        "Form the dough into 9 to 12 balls.",
        "They need to be big enough to fit your dog's pills.",
        "How many balls you end up making depends on how big the pills are.",
        "The smaller the pill, the more balls you'll be able to make.",
        "Make a small hole part of the way through each pill pocket.",
        "The hole needs to go only ½ to ¾ of the way through each ball.",
        "You can use just about anything to make them, such as chopsticks, pencil erasers, thermometers, or even the end of a small, wooden spoon.",
        "Store the pill pockets in an airtight baggie in the fridge.",
        "They will last about 1 week.",
        "If you won't use all of them in that time, you will need to freeze the rest.",
        "Begin by lining the pill pockets on a baking sheet lined with parchment paper or wax paper, then freeze them for 1 hour.",
        "After that, you can transfer them to a freezer-safe container.",
        "Making Healthy Pill Pockets Pour ¾ cup (75 grams) oat or oatmeal flour into a mixing bowl.",
        "This will be your base.",
        "If you can't find any oat or oatmeal flour, you can make your own by grinding up oatmeal to a fine powder in a blender or food processor.",
        "You can also try using another type of flour instead.",
        "Add ¼ cup (25 grams) of gelatin powder.",
        "Try to get beef gelatin powder, if you can.",
        "It is beneficial to a dog's joints.",
        "Add some flavor with 3 tablespoons (45 grams) of peanut butter.",
        "What dog doesn't like peanut butter?",
        "Just make sure that you get the smooth, unsalted kind.",
        "More importantly, make sure that it doesn't contain xylitol.",
        "Xylitol is a substitute sweetener commonly added to sugar-free products.",
        "It can be deadly to dogs.",
        "Scoop ⅓ cup (75 grams) of coconut oil into the bowl.",
        "Coconut oil is great not just for you, but for your dog as well.",
        "It can help make your dog's coat glossy and smooth.",
        "Pour in ½ cup (120 milliliters) of chicken stock.",
        "You can use the store-bought kind, but make sure that it is low-sodium.",
        "If you have extra time, however, you could make your own at home.",
        "This way, you can ensure that it is as low in sodium as possible.",
        "Stir everything together until combined.",
        "Once the dry ingredients soak up all of the wet ones, switch to kneading the dough with your hands.",
        "Be careful not to over-work it, however, or the coconut oil will turn too soft.",
        "Shape the dough into small balls.",
        "The balls need to be big enough to completely cover your dogs pills.",
        "How many you end up making depends on the size of the pills.",
        "The smaller the pills are, the more pill pockets you'll be able to make.",
        "Wet your hands first.",
        "This will make the dough easier to work with.",
        "Poke a hole part of the way through each ball.",
        "You can make these holes using just about anything, from a chopstick to a pencil eraser.",
        "The holes need to be wide enough to fit the pill.",
        "Also, make sure that they only go ½ to ¾ of the way through each pill.",
        "Store the pill pockets in the fridge.",
        "They will last about 1 week.",
        "If you won't use all of the pills during that time, you will need to freeze them.",
        "Line them up on a baking sheet lined with wax paper or parchment paper.",
        "Freeze them for 1 hour, then transfer them to a freezer-safe container.",
        "They will last about 3 months in the freezer."
    ]
}