{
    "title": "How to Clean a Mr Coffee",
    "url": "https://www.wikihow.com/Clean-a-Mr-Coffee",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Coffee",
        "Coffee Accessories"
    ],
    "methods": [
        {
            "name": "Cleaning After Each Use",
            "steps": [
                {
                    "headline": "Clean the carafe.",
                    "description": "Pour out the old coffee. Spray the interior of the carafe with tap water. Add a bit of mild dish soap. Swish the soapy water around the interior of the carafe. Empty and rinse the carafe so it is clean for your next brew. If you see any stains, sprinkle baking powder into the carafe. Scrub off the stains with a dishwashing brush or sponge and some warm water."
                },
                {
                    "headline": "Empty and clean the filter basket.",
                    "description": "Open the lid on top of the Mr. Coffee machine. Pull out the filter basket and empty the contents into the compost. Use the spray nozzle or tap in your kitchen sink to rinse out the filter basket. You can use some mild dish soap and warm water to remove any stains. Rinse out the filter and put it back in your coffee machine."
                },
                {
                    "headline": "Clean the lid.",
                    "description": "The inside of your coffee lid should be cleaned on a daily basis. Use a sponge to wipe off the inside and outside of the lid on your Mr. Coffee machine. On the inside of the lid, you will see the spray heads that pour water onto the coffee grounds. You should use a clean rag or sponge to thoroughly clean these spray heads."
                },
                {
                    "headline": "Wipe off the spout.",
                    "description": "The coffee pours into the carafe from a spout. Remove the carafe and use a clean sponge or rag to wipe off the spout. You can use warm water and some mild dish soap. Then, rinse it off with a clean sponge and replace the carafe."
                },
                {
                    "headline": "Polish the outside of the machine.",
                    "description": "Use a clean sponge to clean the outside of the machine, such as the control panel and the base of the coffee machine. Dry it off with a clean towel."
                }
            ]
        },
        {
            "name": "Doing a Deep Cleaning",
            "steps": [
                {
                    "headline": "Do a deep cleaning once per month.",
                    "description": "Hard water deposits gradually build up in your coffee maker. Yeast, mold and bacteria also tend to accumulate in coffee makers. Once per month, you will need to decalcify minerals and remove grime with water and vinegar."
                },
                {
                    "headline": "Unplug the machine.",
                    "description": "Let the machine cool off for a few minutes. Then, get your cleaning supplies together, such as your sponge, vinegar and dish soap."
                },
                {
                    "headline": "Empty the carafe and the filter.",
                    "description": "Start by emptying the leftover coffee from your carafe. Then, empty the contents of the filter. Use a clean sponge, hot water and mild dish soap to clean the carafe and the filter. Replace the filter when you are done cleaning it."
                },
                {
                    "headline": "Mix a solution of equal parts vinegar and water.",
                    "description": "To get the hard water out of your coffee maker, you will need to mix a solution of equal parts vinegar and water. If your carafe has measuring indicators, you can use it to mix the solution. Then, pour the solution into the reservoir. You could also use a measuring cup to mix the vinegar and water solution."
                },
                {
                    "headline": "Use the cleaning function to remove hard water deposits.",
                    "description": "Put a new filter in the filter basket. Put the carafe in the warming tray. Then, press the “select” button on your Mr. Coffee machine until it lights up the clean function. Once it is selected, your Mr. Coffee machine will start cleaning the machine. The process takes one hour."
                },
                {
                    "headline": "Rinse your coffee maker.",
                    "description": "Remove the filter from the filter basket. Empty the vinegar from the carafe. Pour clean water in the reservoir. Then, press “brew.” After one brewing cycle is complete, you can empty the water from the carafe. Finally, rinse out the carafe. If you like, you can repeat this step to get the machine well rinsed."
                }
            ]
        }
    ],
    "tyn": [
        "Vinegar",
        "Mild dish soap",
        "Clean sponge",
        "Clean kitchen towel",
        "Coffee filters"
    ],
    "text": " Cleaning After Each Use Clean the carafe. Pour out the old coffee. Spray the interior of the carafe with tap water. Add a bit of mild dish soap. Swish the soapy water around the interior of the carafe. Empty and rinse the carafe so it is clean for your next brew. If you see any stains, sprinkle baking powder into the carafe. Scrub off the stains with a dishwashing brush or sponge and some warm water. Empty and clean the filter basket. Open the lid on top of the Mr. Coffee machine. Pull out the filter basket and empty the contents into the compost. Use the spray nozzle or tap in your kitchen sink to rinse out the filter basket. You can use some mild dish soap and warm water to remove any stains. Rinse out the filter and put it back in your coffee machine. Clean the lid. The inside of your coffee lid should be cleaned on a daily basis. Use a sponge to wipe off the inside and outside of the lid on your Mr. Coffee machine. On the inside of the lid, you will see the spray heads that pour water onto the coffee grounds. You should use a clean rag or sponge to thoroughly clean these spray heads. Wipe off the spout. The coffee pours into the carafe from a spout. Remove the carafe and use a clean sponge or rag to wipe off the spout. You can use warm water and some mild dish soap. Then, rinse it off with a clean sponge and replace the carafe. Polish the outside of the machine. Use a clean sponge to clean the outside of the machine, such as the control panel and the base of the coffee machine. Dry it off with a clean towel. Doing a Deep Cleaning Do a deep cleaning once per month. Hard water deposits gradually build up in your coffee maker. Yeast, mold and bacteria also tend to accumulate in coffee makers. Once per month, you will need to decalcify minerals and remove grime with water and vinegar. Unplug the machine. Let the machine cool off for a few minutes. Then, get your cleaning supplies together, such as your sponge, vinegar and dish soap. Empty the carafe and the filter. Start by emptying the leftover coffee from your carafe. Then, empty the contents of the filter. Use a clean sponge, hot water and mild dish soap to clean the carafe and the filter. Replace the filter when you are done cleaning it. Mix a solution of equal parts vinegar and water. To get the hard water out of your coffee maker, you will need to mix a solution of equal parts vinegar and water. If your carafe has measuring indicators, you can use it to mix the solution. Then, pour the solution into the reservoir. You could also use a measuring cup to mix the vinegar and water solution. Use the cleaning function to remove hard water deposits. Put a new filter in the filter basket. Put the carafe in the warming tray. Then, press the “select” button on your Mr. Coffee machine until it lights up the clean function. Once it is selected, your Mr. Coffee machine will start cleaning the machine. The process takes one hour. Rinse your coffee maker. Remove the filter from the filter basket. Empty the vinegar from the carafe. Pour clean water in the reservoir. Then, press “brew.” After one brewing cycle is complete, you can empty the water from the carafe. Finally, rinse out the carafe. If you like, you can repeat this step to get the machine well rinsed.",
    "sentences": [
        " Cleaning After Each Use Clean the carafe.",
        "Pour out the old coffee.",
        "Spray the interior of the carafe with tap water.",
        "Add a bit of mild dish soap.",
        "Swish the soapy water around the interior of the carafe.",
        "Empty and rinse the carafe so it is clean for your next brew.",
        "If you see any stains, sprinkle baking powder into the carafe.",
        "Scrub off the stains with a dishwashing brush or sponge and some warm water.",
        "Empty and clean the filter basket.",
        "Open the lid on top of the Mr. Coffee machine.",
        "Pull out the filter basket and empty the contents into the compost.",
        "Use the spray nozzle or tap in your kitchen sink to rinse out the filter basket.",
        "You can use some mild dish soap and warm water to remove any stains.",
        "Rinse out the filter and put it back in your coffee machine.",
        "Clean the lid.",
        "The inside of your coffee lid should be cleaned on a daily basis.",
        "Use a sponge to wipe off the inside and outside of the lid on your Mr. Coffee machine.",
        "On the inside of the lid, you will see the spray heads that pour water onto the coffee grounds.",
        "You should use a clean rag or sponge to thoroughly clean these spray heads.",
        "Wipe off the spout.",
        "The coffee pours into the carafe from a spout.",
        "Remove the carafe and use a clean sponge or rag to wipe off the spout.",
        "You can use warm water and some mild dish soap.",
        "Then, rinse it off with a clean sponge and replace the carafe.",
        "Polish the outside of the machine.",
        "Use a clean sponge to clean the outside of the machine, such as the control panel and the base of the coffee machine.",
        "Dry it off with a clean towel.",
        "Doing a Deep Cleaning Do a deep cleaning once per month.",
        "Hard water deposits gradually build up in your coffee maker.",
        "Yeast, mold and bacteria also tend to accumulate in coffee makers.",
        "Once per month, you will need to decalcify minerals and remove grime with water and vinegar.",
        "Unplug the machine.",
        "Let the machine cool off for a few minutes.",
        "Then, get your cleaning supplies together, such as your sponge, vinegar and dish soap.",
        "Empty the carafe and the filter.",
        "Start by emptying the leftover coffee from your carafe.",
        "Then, empty the contents of the filter.",
        "Use a clean sponge, hot water and mild dish soap to clean the carafe and the filter.",
        "Replace the filter when you are done cleaning it.",
        "Mix a solution of equal parts vinegar and water.",
        "To get the hard water out of your coffee maker, you will need to mix a solution of equal parts vinegar and water.",
        "If your carafe has measuring indicators, you can use it to mix the solution.",
        "Then, pour the solution into the reservoir.",
        "You could also use a measuring cup to mix the vinegar and water solution.",
        "Use the cleaning function to remove hard water deposits.",
        "Put a new filter in the filter basket.",
        "Put the carafe in the warming tray.",
        "Then, press the “select” button on your Mr. Coffee machine until it lights up the clean function.",
        "Once it is selected, your Mr. Coffee machine will start cleaning the machine.",
        "The process takes one hour.",
        "Rinse your coffee maker.",
        "Remove the filter from the filter basket.",
        "Empty the vinegar from the carafe.",
        "Pour clean water in the reservoir.",
        "Then, press “brew.” After one brewing cycle is complete, you can empty the water from the carafe.",
        "Finally, rinse out the carafe.",
        "If you like, you can repeat this step to get the machine well rinsed."
    ]
}