{
    "title": "How to Reduce Frown Lines",
    "url": "https://www.wikihow.com/Reduce-Frown-Lines",
    "category_hierarchy": [
        "Health",
        "Integumentary System Health",
        "Skin Health"
    ],
    "methods": [
        {
            "name": "Moisturizing Your Skin",
            "steps": [
                {
                    "headline": "Apply a day cream.",
                    "description": "Moisturizing is easy to do, pretty cheap, and it’s important no matter what condition your skin is in. Dry skin is prone to sagging, which produces lines. So make sure you apply a light moisturizer in the morning before you start your day. Simply rub the moisturizer into your skin using small, circular motions. A moisturizer with SPF in it is ideal so that you can prevent new lines from forming without having to buy another product. You can look for a light moisturizer that is ideal for your skin. Research moisturizers that are best for skin types such as oily, wrinkled, depending on what your skin is like."
                },
                {
                    "headline": "Use a thicker cream at night.",
                    "description": "A thicker and more intense cream is best for when you’re winding down your day and preparing for bed. A cream that contains retinol is ideal to use. The vitamin A in retinol helps plump up the skin, which reduces fine lines and wrinkles. You can buy a cream that contains retinol, or have a stronger retinol prescribed by your doctor. Apply extra moisturizer to the frown lines between your brows."
                },
                {
                    "headline": "Use natural oils.",
                    "description": "Natural oils not only smell great, but they can also be really great for your skin! Buy a bottle of pure almond, grapeseed, or jojoba oil at your local health food store. Along with their antibacterial and anti-oxidant properties, natural oils are awesome because they provide many of the same benefits as expensive moisturizers at a much lower cost. Apply a small amount to your face and rub it in using small, circular motions. Natural oils are also great because they provide a barrier for your skin during harsh and cold weather."
                },
                {
                    "headline": "Try a humectant if you have oily skin.",
                    "description": "Keeping moisturized can be frustrating if you have oily skin. No one with that skin type wants to add even more oil. A product containing a humectant is a good solution for that problem. A few humectants are glycerin, propylene glycol, urea, and sorbitol. Apply the product to your skin daily, nightly, or whenever you feel the need to moisturize."
                },
                {
                    "headline": "Drink plenty of water.",
                    "description": "Keeping hydrated is an important part of keeping your skin moisturized. This may be something you already do, and if so, good job! Don’t worry if you don’t drink a lot of water right now. This is something you can accomplish easily. Try to drink at least 8 cups of water per day. If drinking plain water is difficult for you, infuse the water with lemon or other fruits, like strawberries."
                },
                {
                    "headline": "Use a sheet mask.",
                    "description": "Sheet masks seem like all the rage right now, and that is for a reason! Masks are a quick way to add moisture to your skin, and they are so relaxing. You can use a sheet mask, or one that comes in a cream form. Use a mask about once a week, or twice a week if your skin is very dry. Apply the mask, sit back, and relax with your favorite music for 10 to 20 minutes. You can buy masks online, at your local beauty store, or at many supermarkets with a beauty section."
                }
            ]
        },
        {
            "name": "Massaging Your Skin",
            "steps": [
                {
                    "headline": "Do the massage before bed.",
                    "description": "You can do a massage pretty much whenever you want to, but the ideal time is before you go to sleep. This is because your face relaxes as you sleep, so a massage can boost the process of reducing wrinkles. Give yourself a massage every night before you go to bed. You may want to do a massage only two or three times a week if you have sensitive skin, though."
                },
                {
                    "headline": "Apply a serum to your face.",
                    "description": "It is okay to massage your face without any product, but using a natural oil while you do it is best. You can use your regular moisturizer or a natural oil. Natural oils are a cheap, good-smelling, and usually pretty relaxing. First, make sure your face and hands are clean. Then, apply an oil, like coconut oil, to your face. You can also choose to use a serum that contains retinol."
                },
                {
                    "headline": "Use firm pressure as you massage.",
                    "description": "Carry out this simple massage technique by pressing firmly against the muscles. Using both of your hands, start at the center of your temples and work outwards. Repeat this exercise eight times. Take some deep breaths while you do this to enjoy the massage as you work those wrinkles away."
                },
                {
                    "headline": "Rub your fingers quickly up and down.",
                    "description": "Another easy technique is to use friction to reduce frown lines. Start at the center of your forehead and quickly rub your fingers up and down. You should work outwards toward your temples as well. You may feel a little silly while you do this, but remember that you are helping your wrinkles fade away. Your skin will turn pink if you’re doing it correctly. Don’t use so much force or massage for so long that you begin to chafe the skin or bleed."
                },
                {
                    "headline": "Try an aimed massage.",
                    "description": "An aimed massage means that you focus on one part of your face, which is the area between your eyebrows in this case. Put your fingertips on those annoying frown lines and press down. Rub this are firmly for about one minute."
                },
                {
                    "headline": "Do a patting massage in the morning.",
                    "description": "This is one massage technique that is great for the morning because it wakes your skin up. Get up out of bed, put your feet shoulder-width apart, and lean forward a little bit. Then, start lightly patting your face. Do this for about 20 seconds for tightened skin and a fresh glow."
                }
            ]
        },
        {
            "name": "Going for a Professional Treatment",
            "steps": [
                {
                    "headline": "Ask about laser resurfacing.",
                    "description": "Sometimes home treatments don’t work as well as you’d hope, and that’s okay. The next step is to ask a professional for advice. Laser resurfacing is option. Basically, a laser will stimulate the production of collagen in your skin. There are several different types of laser treatments. Ask your doctor what type is best for your skin. You will need to take some time to rest after laser resurfacing so that your skin can heal."
                },
                {
                    "headline": "Get ultrasound therapy for a noninvasive technique.",
                    "description": "Ultrasound therapy is a technique to consider if invasive techniques make you a little nervous. This therapy would lift and tighten the parts of skin you consider “problem areas,” like your frown lines."
                },
                {
                    "headline": "Go for a peel.",
                    "description": "A chemical peel is exactly what it sounds like—layers of damaged skin are removed from your skin. This may sound scary, but it’s a pretty common practice. The dead layers are exfoliated away, revealing fresher, smoother skin. You can choose to get a glycolic acid peel if you’re looking for a lighter peel that will help with fine wrinkles. Or, choose a deep peel using chemicals like salicylic acid to reduce coarse wrinkles. Deep peels requires a long recovery times, and it is not ideal for people with heart problems and dark skin due to potential skin discoloration."
                },
                {
                    "headline": "Consider dermabrasion.",
                    "description": "If done by an experienced professional, this technique can produce some great results. Dermabrasion is done by “sanding” the skin, or using controlled surgical scraping to reduce wrinkles, although it is also used to remove problems like scarring after an accident. Recovery time is usually between a few days to a week. This is not a good option for those with darker skin because it can cause discoloration. You can combine this technique with a chemical peel."
                },
                {
                    "headline": "Ask about Botox injections.",
                    "description": "An injection, like Botox, is an option that definitely produces results, but only lasts for several months. The Botox is injected into the skin, relaxing the muscles produce frown lines. This is a good option if you are looking for quick results. Make an appointment with your doctor to ask about this method."
                },
                {
                    "headline": "Get plastic surgery.",
                    "description": "Plastic surgery could mean a facelift or a brow lift to improve frown lines. This is another method that produces quick results, but this method will last. There’s absolutely nothing wrong with choosing this technique, but you should take some time to consider it since you would have to have surgery. Talk to your doctor for advice."
                }
            ]
        },
        {
            "name": "Preventing Frown Lines",
            "steps": [
                {
                    "headline": "Eat foods that are rich in antioxidants.",
                    "description": "We all wish we could eat yummy foods like brownies and pizza to improve our skin, but usually, healthy food is the way to go to accomplish that goal. Eating the right foods can promote skin plumping, which is definitely motivation to healthier. Some good choices for antioxidant rich foods are berries, broccoli, carrots, honey, and yogurt. These foods keep your levels of collagen and elastin strong and less susceptible to damage."
                },
                {
                    "headline": "Wear sunscreen.",
                    "description": "Basking in the sun can make you look and feel good temporarily, but it will age your skin faster in the long run. Exposure to the sun is a large reason why skin begins to thin and wrinkle. Keep your youthful glow for longer by incorporating a sunscreen with an SPF of at least 30 into your morning skincare routine. Apply the sunscreen before you outside, even on cloudy days. Look for oil-free sunscreen that is specifically made for the face if breakouts are a concern."
                },
                {
                    "headline": "Take vitamins.",
                    "description": "Vitamins are good for your inner health and outer appearance. Vitamin A is a contributor to collagen production, which plumps the skin. Vitamin C and E are good choices for adding moisture and radiance to your skin. Take your vitamins every morning and instantly feel like you’ve done something productive for the day. You can get vitamins out of eating well, but taking supplements is an easy way to get enough vitamins if you are lacking. Consult with your doctor before taking too many vitamin supplements."
                },
                {
                    "headline": "Maintain your weight.",
                    "description": "This doesn’t necessarily mean that you have to lose weight; it just means to stay at the weight that makes you feel healthy and confident. Maintaining a healthy weight is good for your general health, but it is also good for your skin. Too much weight fluctuation can cause a loss of elasticity in the skin. Eat well and exercise at least three times a week to maintain a healthy weight."
                },
                {
                    "headline": "Get enough sleep.",
                    "description": "Who can argue with getting enough sleep to help your skin say young and glowing? Sleep is important to feel good and look good. Adequate sleep promotes the production of collagen and elastic. Eight hours a night is a good amount of sleep to strive for, though you may need slightly less or more, depending on your age."
                }
            ]
        }
    ],
    "tyn": [
        "Light moisturizer",
        "Thick moisturizer",
        "Natural oils",
        "Water",
        "Sunscreen",
        "Vitamins (A, C, E)",
        "Anti-oxidant rich food"
    ],
    "text": " Moisturizing Your Skin Apply a day cream. Moisturizing is easy to do, pretty cheap, and it’s important no matter what condition your skin is in. Dry skin is prone to sagging, which produces lines. So make sure you apply a light moisturizer in the morning before you start your day. Simply rub the moisturizer into your skin using small, circular motions. A moisturizer with SPF in it is ideal so that you can prevent new lines from forming without having to buy another product. You can look for a light moisturizer that is ideal for your skin. Research moisturizers that are best for skin types such as oily, wrinkled, depending on what your skin is like. Use a thicker cream at night. A thicker and more intense cream is best for when you’re winding down your day and preparing for bed. A cream that contains retinol is ideal to use. The vitamin A in retinol helps plump up the skin, which reduces fine lines and wrinkles. You can buy a cream that contains retinol, or have a stronger retinol prescribed by your doctor. Apply extra moisturizer to the frown lines between your brows. Use natural oils. Natural oils not only smell great, but they can also be really great for your skin! Buy a bottle of pure almond, grapeseed, or jojoba oil at your local health food store. Along with their antibacterial and anti-oxidant properties, natural oils are awesome because they provide many of the same benefits as expensive moisturizers at a much lower cost. Apply a small amount to your face and rub it in using small, circular motions. Natural oils are also great because they provide a barrier for your skin during harsh and cold weather. Try a humectant if you have oily skin. Keeping moisturized can be frustrating if you have oily skin. No one with that skin type wants to add even more oil. A product containing a humectant is a good solution for that problem. A few humectants are glycerin, propylene glycol, urea, and sorbitol. Apply the product to your skin daily, nightly, or whenever you feel the need to moisturize. Drink plenty of water. Keeping hydrated is an important part of keeping your skin moisturized. This may be something you already do, and if so, good job! Don’t worry if you don’t drink a lot of water right now. This is something you can accomplish easily. Try to drink at least 8 cups of water per day. If drinking plain water is difficult for you, infuse the water with lemon or other fruits, like strawberries. Use a sheet mask. Sheet masks seem like all the rage right now, and that is for a reason! Masks are a quick way to add moisture to your skin, and they are so relaxing. You can use a sheet mask, or one that comes in a cream form. Use a mask about once a week, or twice a week if your skin is very dry. Apply the mask, sit back, and relax with your favorite music for 10 to 20 minutes. You can buy masks online, at your local beauty store, or at many supermarkets with a beauty section. Massaging Your Skin Do the massage before bed. You can do a massage pretty much whenever you want to, but the ideal time is before you go to sleep. This is because your face relaxes as you sleep, so a massage can boost the process of reducing wrinkles. Give yourself a massage every night before you go to bed. You may want to do a massage only two or three times a week if you have sensitive skin, though. Apply a serum to your face. It is okay to massage your face without any product, but using a natural oil while you do it is best. You can use your regular moisturizer or a natural oil. Natural oils are a cheap, good-smelling, and usually pretty relaxing. First, make sure your face and hands are clean. Then, apply an oil, like coconut oil, to your face. You can also choose to use a serum that contains retinol. Use firm pressure as you massage. Carry out this simple massage technique by pressing firmly against the muscles. Using both of your hands, start at the center of your temples and work outwards. Repeat this exercise eight times. Take some deep breaths while you do this to enjoy the massage as you work those wrinkles away. Rub your fingers quickly up and down. Another easy technique is to use friction to reduce frown lines. Start at the center of your forehead and quickly rub your fingers up and down. You should work outwards toward your temples as well. You may feel a little silly while you do this, but remember that you are helping your wrinkles fade away. Your skin will turn pink if you’re doing it correctly. Don’t use so much force or massage for so long that you begin to chafe the skin or bleed. Try an aimed massage. An aimed massage means that you focus on one part of your face, which is the area between your eyebrows in this case. Put your fingertips on those annoying frown lines and press down. Rub this are firmly for about one minute. Do a patting massage in the morning. This is one massage technique that is great for the morning because it wakes your skin up. Get up out of bed, put your feet shoulder-width apart, and lean forward a little bit. Then, start lightly patting your face. Do this for about 20 seconds for tightened skin and a fresh glow. Going for a Professional Treatment Ask about laser resurfacing. Sometimes home treatments don’t work as well as you’d hope, and that’s okay. The next step is to ask a professional for advice. Laser resurfacing is option. Basically, a laser will stimulate the production of collagen in your skin. There are several different types of laser treatments. Ask your doctor what type is best for your skin. You will need to take some time to rest after laser resurfacing so that your skin can heal. Get ultrasound therapy for a noninvasive technique. Ultrasound therapy is a technique to consider if invasive techniques make you a little nervous. This therapy would lift and tighten the parts of skin you consider “problem areas,” like your frown lines. Go for a peel. A chemical peel is exactly what it sounds like—layers of damaged skin are removed from your skin. This may sound scary, but it’s a pretty common practice. The dead layers are exfoliated away, revealing fresher, smoother skin. You can choose to get a glycolic acid peel if you’re looking for a lighter peel that will help with fine wrinkles. Or, choose a deep peel using chemicals like salicylic acid to reduce coarse wrinkles. Deep peels requires a long recovery times, and it is not ideal for people with heart problems and dark skin due to potential skin discoloration. Consider dermabrasion. If done by an experienced professional, this technique can produce some great results. Dermabrasion is done by “sanding” the skin, or using controlled surgical scraping to reduce wrinkles, although it is also used to remove problems like scarring after an accident. Recovery time is usually between a few days to a week. This is not a good option for those with darker skin because it can cause discoloration. You can combine this technique with a chemical peel. Ask about Botox injections. An injection, like Botox, is an option that definitely produces results, but only lasts for several months. The Botox is injected into the skin, relaxing the muscles produce frown lines. This is a good option if you are looking for quick results. Make an appointment with your doctor to ask about this method. Get plastic surgery. Plastic surgery could mean a facelift or a brow lift to improve frown lines. This is another method that produces quick results, but this method will last. There’s absolutely nothing wrong with choosing this technique, but you should take some time to consider it since you would have to have surgery. Talk to your doctor for advice. Preventing Frown Lines Eat foods that are rich in antioxidants. We all wish we could eat yummy foods like brownies and pizza to improve our skin, but usually, healthy food is the way to go to accomplish that goal. Eating the right foods can promote skin plumping, which is definitely motivation to healthier. Some good choices for antioxidant rich foods are berries, broccoli, carrots, honey, and yogurt. These foods keep your levels of collagen and elastin strong and less susceptible to damage. Wear sunscreen. Basking in the sun can make you look and feel good temporarily, but it will age your skin faster in the long run. Exposure to the sun is a large reason why skin begins to thin and wrinkle. Keep your youthful glow for longer by incorporating a sunscreen with an SPF of at least 30 into your morning skincare routine. Apply the sunscreen before you outside, even on cloudy days. Look for oil-free sunscreen that is specifically made for the face if breakouts are a concern. Take vitamins. Vitamins are good for your inner health and outer appearance. Vitamin A is a contributor to collagen production, which plumps the skin. Vitamin C and E are good choices for adding moisture and radiance to your skin. Take your vitamins every morning and instantly feel like you’ve done something productive for the day. You can get vitamins out of eating well, but taking supplements is an easy way to get enough vitamins if you are lacking. Consult with your doctor before taking too many vitamin supplements. Maintain your weight. This doesn’t necessarily mean that you have to lose weight; it just means to stay at the weight that makes you feel healthy and confident. Maintaining a healthy weight is good for your general health, but it is also good for your skin. Too much weight fluctuation can cause a loss of elasticity in the skin. Eat well and exercise at least three times a week to maintain a healthy weight. Get enough sleep. Who can argue with getting enough sleep to help your skin say young and glowing? Sleep is important to feel good and look good. Adequate sleep promotes the production of collagen and elastic. Eight hours a night is a good amount of sleep to strive for, though you may need slightly less or more, depending on your age.",
    "sentences": [
        " Moisturizing Your Skin Apply a day cream.",
        "Moisturizing is easy to do, pretty cheap, and it’s important no matter what condition your skin is in.",
        "Dry skin is prone to sagging, which produces lines.",
        "So make sure you apply a light moisturizer in the morning before you start your day.",
        "Simply rub the moisturizer into your skin using small, circular motions.",
        "A moisturizer with SPF in it is ideal so that you can prevent new lines from forming without having to buy another product.",
        "You can look for a light moisturizer that is ideal for your skin.",
        "Research moisturizers that are best for skin types such as oily, wrinkled, depending on what your skin is like.",
        "Use a thicker cream at night.",
        "A thicker and more intense cream is best for when you’re winding down your day and preparing for bed.",
        "A cream that contains retinol is ideal to use.",
        "The vitamin A in retinol helps plump up the skin, which reduces fine lines and wrinkles.",
        "You can buy a cream that contains retinol, or have a stronger retinol prescribed by your doctor.",
        "Apply extra moisturizer to the frown lines between your brows.",
        "Use natural oils.",
        "Natural oils not only smell great, but they can also be really great for your skin!",
        "Buy a bottle of pure almond, grapeseed, or jojoba oil at your local health food store.",
        "Along with their antibacterial and anti-oxidant properties, natural oils are awesome because they provide many of the same benefits as expensive moisturizers at a much lower cost.",
        "Apply a small amount to your face and rub it in using small, circular motions.",
        "Natural oils are also great because they provide a barrier for your skin during harsh and cold weather.",
        "Try a humectant if you have oily skin.",
        "Keeping moisturized can be frustrating if you have oily skin.",
        "No one with that skin type wants to add even more oil.",
        "A product containing a humectant is a good solution for that problem.",
        "A few humectants are glycerin, propylene glycol, urea, and sorbitol.",
        "Apply the product to your skin daily, nightly, or whenever you feel the need to moisturize.",
        "Drink plenty of water.",
        "Keeping hydrated is an important part of keeping your skin moisturized.",
        "This may be something you already do, and if so, good job!",
        "Don’t worry if you don’t drink a lot of water right now.",
        "This is something you can accomplish easily.",
        "Try to drink at least 8 cups of water per day.",
        "If drinking plain water is difficult for you, infuse the water with lemon or other fruits, like strawberries.",
        "Use a sheet mask.",
        "Sheet masks seem like all the rage right now, and that is for a reason!",
        "Masks are a quick way to add moisture to your skin, and they are so relaxing.",
        "You can use a sheet mask, or one that comes in a cream form.",
        "Use a mask about once a week, or twice a week if your skin is very dry.",
        "Apply the mask, sit back, and relax with your favorite music for 10 to 20 minutes.",
        "You can buy masks online, at your local beauty store, or at many supermarkets with a beauty section.",
        "Massaging Your Skin Do the massage before bed.",
        "You can do a massage pretty much whenever you want to, but the ideal time is before you go to sleep.",
        "This is because your face relaxes as you sleep, so a massage can boost the process of reducing wrinkles.",
        "Give yourself a massage every night before you go to bed.",
        "You may want to do a massage only two or three times a week if you have sensitive skin, though.",
        "Apply a serum to your face.",
        "It is okay to massage your face without any product, but using a natural oil while you do it is best.",
        "You can use your regular moisturizer or a natural oil.",
        "Natural oils are a cheap, good-smelling, and usually pretty relaxing.",
        "First, make sure your face and hands are clean.",
        "Then, apply an oil, like coconut oil, to your face.",
        "You can also choose to use a serum that contains retinol.",
        "Use firm pressure as you massage.",
        "Carry out this simple massage technique by pressing firmly against the muscles.",
        "Using both of your hands, start at the center of your temples and work outwards.",
        "Repeat this exercise eight times.",
        "Take some deep breaths while you do this to enjoy the massage as you work those wrinkles away.",
        "Rub your fingers quickly up and down.",
        "Another easy technique is to use friction to reduce frown lines.",
        "Start at the center of your forehead and quickly rub your fingers up and down.",
        "You should work outwards toward your temples as well.",
        "You may feel a little silly while you do this, but remember that you are helping your wrinkles fade away.",
        "Your skin will turn pink if you’re doing it correctly.",
        "Don’t use so much force or massage for so long that you begin to chafe the skin or bleed.",
        "Try an aimed massage.",
        "An aimed massage means that you focus on one part of your face, which is the area between your eyebrows in this case.",
        "Put your fingertips on those annoying frown lines and press down.",
        "Rub this are firmly for about one minute.",
        "Do a patting massage in the morning.",
        "This is one massage technique that is great for the morning because it wakes your skin up.",
        "Get up out of bed, put your feet shoulder-width apart, and lean forward a little bit.",
        "Then, start lightly patting your face.",
        "Do this for about 20 seconds for tightened skin and a fresh glow.",
        "Going for a Professional Treatment Ask about laser resurfacing.",
        "Sometimes home treatments don’t work as well as you’d hope, and that’s okay.",
        "The next step is to ask a professional for advice.",
        "Laser resurfacing is option.",
        "Basically, a laser will stimulate the production of collagen in your skin.",
        "There are several different types of laser treatments.",
        "Ask your doctor what type is best for your skin.",
        "You will need to take some time to rest after laser resurfacing so that your skin can heal.",
        "Get ultrasound therapy for a noninvasive technique.",
        "Ultrasound therapy is a technique to consider if invasive techniques make you a little nervous.",
        "This therapy would lift and tighten the parts of skin you consider “problem areas,” like your frown lines.",
        "Go for a peel.",
        "A chemical peel is exactly what it sounds like—layers of damaged skin are removed from your skin.",
        "This may sound scary, but it’s a pretty common practice.",
        "The dead layers are exfoliated away, revealing fresher, smoother skin.",
        "You can choose to get a glycolic acid peel if you’re looking for a lighter peel that will help with fine wrinkles.",
        "Or, choose a deep peel using chemicals like salicylic acid to reduce coarse wrinkles.",
        "Deep peels requires a long recovery times, and it is not ideal for people with heart problems and dark skin due to potential skin discoloration.",
        "Consider dermabrasion.",
        "If done by an experienced professional, this technique can produce some great results.",
        "Dermabrasion is done by “sanding” the skin, or using controlled surgical scraping to reduce wrinkles, although it is also used to remove problems like scarring after an accident.",
        "Recovery time is usually between a few days to a week.",
        "This is not a good option for those with darker skin because it can cause discoloration.",
        "You can combine this technique with a chemical peel.",
        "Ask about Botox injections.",
        "An injection, like Botox, is an option that definitely produces results, but only lasts for several months.",
        "The Botox is injected into the skin, relaxing the muscles produce frown lines.",
        "This is a good option if you are looking for quick results.",
        "Make an appointment with your doctor to ask about this method.",
        "Get plastic surgery.",
        "Plastic surgery could mean a facelift or a brow lift to improve frown lines.",
        "This is another method that produces quick results, but this method will last.",
        "There’s absolutely nothing wrong with choosing this technique, but you should take some time to consider it since you would have to have surgery.",
        "Talk to your doctor for advice.",
        "Preventing Frown Lines Eat foods that are rich in antioxidants.",
        "We all wish we could eat yummy foods like brownies and pizza to improve our skin, but usually, healthy food is the way to go to accomplish that goal.",
        "Eating the right foods can promote skin plumping, which is definitely motivation to healthier.",
        "Some good choices for antioxidant rich foods are berries, broccoli, carrots, honey, and yogurt.",
        "These foods keep your levels of collagen and elastin strong and less susceptible to damage.",
        "Wear sunscreen.",
        "Basking in the sun can make you look and feel good temporarily, but it will age your skin faster in the long run.",
        "Exposure to the sun is a large reason why skin begins to thin and wrinkle.",
        "Keep your youthful glow for longer by incorporating a sunscreen with an SPF of at least 30 into your morning skincare routine.",
        "Apply the sunscreen before you outside, even on cloudy days.",
        "Look for oil-free sunscreen that is specifically made for the face if breakouts are a concern.",
        "Take vitamins.",
        "Vitamins are good for your inner health and outer appearance.",
        "Vitamin A is a contributor to collagen production, which plumps the skin.",
        "Vitamin C and E are good choices for adding moisture and radiance to your skin.",
        "Take your vitamins every morning and instantly feel like you’ve done something productive for the day.",
        "You can get vitamins out of eating well, but taking supplements is an easy way to get enough vitamins if you are lacking.",
        "Consult with your doctor before taking too many vitamin supplements.",
        "Maintain your weight.",
        "This doesn’t necessarily mean that you have to lose weight; it just means to stay at the weight that makes you feel healthy and confident.",
        "Maintaining a healthy weight is good for your general health, but it is also good for your skin.",
        "Too much weight fluctuation can cause a loss of elasticity in the skin.",
        "Eat well and exercise at least three times a week to maintain a healthy weight.",
        "Get enough sleep.",
        "Who can argue with getting enough sleep to help your skin say young and glowing?",
        "Sleep is important to feel good and look good.",
        "Adequate sleep promotes the production of collagen and elastic.",
        "Eight hours a night is a good amount of sleep to strive for, though you may need slightly less or more, depending on your age."
    ]
}