{
    "title": "How to Make a Gardener's Apron",
    "url": "https://www.wikihow.com/Make-a-Gardener%27s-Apron",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "methods": [
        {
            "name": "Sewing an Apron",
            "steps": [
                {
                    "headline": "Cut a large rectangle for the apron base.",
                    "description": "It needs to be 24 inches (60.96 centimeters) wide and 19½ inches (49.53 centimeters) tall. You can use plain or patterned cotton canvas fabric. If you are using patterned canvas, however, be aware that both the right and wrong sides will be visible on the front of the apron. You can also find a pattern online to suit your needs and style, if you’re not comfortable designing your own apron."
                },
                {
                    "headline": "Fold cotton webbing along one of the long edges.",
                    "description": "Cut a piece of 1-inch (2.54-centimeter) wide cotton webbing down to 24 inches (60.96 centimeters). Fold it in half lengthwise, then iron it to make a crease. Tuck it over one of the 24-inch (60.96-centimeter) long edges. Make sure that the raw, cut edge of the canvas is nestled right inside the crease, then pin it in place. Cotton webbing is a thick, woven strip made from cotton. It is similar to backpack straps. Choose a bright, contrasting color for the cotton webbing. You can also use twill tape instead. You can use ½-inch (1.27-centimeter) bias tape instead of cotton webbing or twill tape. You don't need to fold it."
                },
                {
                    "headline": "Topstitch the webbing down.",
                    "description": "Sew as close to the inside edge of the webbing as possible, about ⅛-inch (0.32-centimeter) seam allowance. Remove the pins as you sew, then trim off any excess webbing from the sides. Use a heavy-duty, denim or jeans-weight sewing needle."
                },
                {
                    "headline": "Fold the bound edge up by 7½ inches (19.05 centimeters).",
                    "description": "Turn the canvas so that the edge you just bound is facing you. Fold the edge upward by 7½ inches (19.05 centimeters) and press it flat with an iron. This is your pocket. If you are using patterned canvas, you can have the right or wrong side facing you. It depends on what part you want to have the pattern on it."
                },
                {
                    "headline": "Decorate the apron, if desired.",
                    "description": "You can leave the apron blank, if you wish, or you can decorate it further. For example, you can paint designs onto the apron using stencils and fabric paint. You can also draw designs on using puffy paint/dimensional paint. You don't need to decorate patterned canvas since it is already colorful."
                }
            ]
        },
        {
            "name": "Creating Apron Pockets",
            "steps": [
                {
                    "headline": "Mark off the smaller pockets.",
                    "description": "Keeping the canvas folded, place a ruler along the bottom edge. Starting at the left side, make a mark with a fabric pen in the following places: 5½ inches, 9½ inches, 15½ inches, and 19½ inches (13.97, 24.13, 39.37, and 49.53 centimeters). Move the ruler to the top, bound edge of the pocket, and repeat the marks."
                },
                {
                    "headline": "Connect the marks with vertical lines.",
                    "description": "Use a ruler and fabric marker to connect the top mark to the matching bottom mark. You will have a series of four vertical lines along your pocket. These will be your sewing guidelines."
                },
                {
                    "headline": "Sew along the vertical lines that you drew.",
                    "description": "Start sewing at the top, bound edge and finish sewing at the bottom, folded edge. You can use a thread color that matches the cotton webbing, or a thread color that matches the canvas. Backstitch at the start and end of your sewing a few times for extra strength."
                },
                {
                    "headline": "Cut and fold two strips of cotton webbing for the sides.",
                    "description": "Cut two pieces of 1-inch (2.54-centimeter) wide cotton webbing down to 12½ inches (31.75 centimeters). You can use the same color as you did to bind the top edge of the pocket, or a different color. Fold the bottom edge of each strip by ½ inch (1.27 centimeters), and press it flat with an iron."
                },
                {
                    "headline": "Fold the cotton webbing over the side edges of your apron.",
                    "description": "Take one of the cotton webbing strips, and align the bottom, folded edge with the bottom, folded edge of your apron. Fold the sides of the cotton webbing over the sides of the apron, just like you did the top edge of the pocket. Pin it in place and trim off any excess webbing from the top edge. Repeat this step for the other side edge of the apron."
                },
                {
                    "headline": "Topstitch the cotton webbing down.",
                    "description": "Begin sewing at the bottom edge of the apron and finish sewing at the top edge. Sew as close as possible to the inside edge of the webbing, about ⅛-inch (0.32-centimeter). Use a thread color that matches the cotton webbing and remember to backstitch at the start and end of your sewing. Remove the pins as you sew."
                }
            ]
        },
        {
            "name": "Making Apron Ties",
            "steps": [
                {
                    "headline": "Cut some webbing for the apron ties.",
                    "description": "You will need at least 78 inches (198.12 centimeters) of 1-inch (2.54-centimeter) wide cotton webbing for this. It can be the same color as the ones you used to bind the edges of the pocket/apron, or a contrasting color."
                },
                {
                    "headline": "Find the center of the webbing, then fold it over the top edge of the apron.",
                    "description": "Fold the webbing in half first to find the center, then mark it with a pin. Fold the webbing over the top of the apron and pin it in place, just like you did when binding the top edge of the pocket. Leave the webbing outside the apron unfolded."
                },
                {
                    "headline": "Topstitch the webbing down.",
                    "description": "Start sewing at the webbing at the left, side edge of your apron, and finish sewing at the right edge. Sew as close as possible to the bottom edge of the webbing, and remember to backstitch. Use a thread color that matches the webbing and remove the pins as you sew. Do not start sewing at the end of the webbing. You want the webbing to go from being 1 inch (2.54 centimeters) wide, to ½ inch (1.27 centimeters) wide as it meets the apron, then back to 1 inch (2.54 centimeters)."
                },
                {
                    "headline": "Finish the ends of the webbing, if desired.",
                    "description": "You can leave the ends of the webbing raw, or you can fold them over for a neater finish. If you want a neater finish, fold one of the ends over twice by ¼ to ½ inch (0.64 to 1.27 centimeters). Topstitch it down several times for extra strength, then repeat the process for the other end. Make sure that you are folding the ends on the same side."
                }
            ]
        },
        {
            "name": "Making a No-Sew Apron",
            "steps": [
                {
                    "headline": "Find an old pair of jeans.",
                    "description": "The jeans should be 1 to 2 sizes larger than you. You want them to sit comfortably around your hips without sliding off or feeling too tight. Choose jeans with large, roomy back pockets. Men's jeans are great for this."
                },
                {
                    "headline": "Cut the legs off just below the back pockets.",
                    "description": "Start by cutting one of the legs off, 1 inch (2.54 centimeters) below the back pocket. Fold the jeans over and use the cut leg as a guide for the second one. Use a ruler and marker to draw a guideline across the bottom of the jeans, if needed."
                },
                {
                    "headline": "Cut up the side seams on the front of the jeans.",
                    "description": "Turn the jeans so that the zipper and front pockets are facing you. Cut up both of the side seams from the bottom cut edge all the way up to the bottom of the waistband. Leave the folded/topstitched part of the seam attacked to the back of the jeans. They will become part of the design."
                },
                {
                    "headline": "Cut the front part of the waistband away from the jeans.",
                    "description": "Begin cutting at the zipper and finish cutting at the side seam. Try to cut as close to the bottom edge of the waistband as you can; use the seam as a guide. Leave the button and button hole. You will need these to secure the apron. The front pockets will fall away as they will have nothing to hold on to. Set them aside for another project or recycle them. When you reach the belt loops, you can cut under them so that they are still attached to the waist band. You can also cut them off entirely."
                },
                {
                    "headline": "Clean up the bottom edge of the apron.",
                    "description": "Sometimes, when you cut the legs off of a pair of jeans, the crotch part sticks out in a little triangle. Use a sharp pair of fabric scissors to cut this triangle off."
                },
                {
                    "headline": "Decorate the apron, if desired.",
                    "description": "You can leave your apron plain if you want to, or you can decorate it further. Choose garden themed motifs and designs, such as flowers, bees, or butterflies. Here are some simple design ideas that would work well on a denim apron:\nIron a patch onto a pocket or the corner of the apron. Decorate the apron using puff paint or dimensional fabric paint. Use stencils and fabric paint to add images, such as butterflies or flowers."
                },
                {
                    "headline": "Use the apron.",
                    "description": "Fill the pockets with seed packets, then wrap the apron around your waist. Use the button to secure the apron."
                }
            ]
        }
    ],
    "tyn": [
        "Sewing an Apron",
        "½ yard (0.45 meter) cotton canvas",
        "1-inch (2.54-centimeter) wide cotton webbing",
        "Jeans-weight sewing machine needle",
        "Thread",
        "Ruler",
        "Fabric pen",
        "Sewing pins",
        "Fabric scissors",
        "Sewing machine",
        "Patches, fabric paint, puff paint, etc (optional)",
        "Making a No-Sew Apron",
        "Old jeans",
        "Ruler and marker (optional)"
    ],
    "text": " Sewing an Apron Cut a large rectangle for the apron base. It needs to be 24 inches (60.96 centimeters) wide and 19½ inches (49.53 centimeters) tall. You can use plain or patterned cotton canvas fabric. If you are using patterned canvas, however, be aware that both the right and wrong sides will be visible on the front of the apron. You can also find a pattern online to suit your needs and style, if you’re not comfortable designing your own apron. Fold cotton webbing along one of the long edges. Cut a piece of 1-inch (2.54-centimeter) wide cotton webbing down to 24 inches (60.96 centimeters). Fold it in half lengthwise, then iron it to make a crease. Tuck it over one of the 24-inch (60.96-centimeter) long edges. Make sure that the raw, cut edge of the canvas is nestled right inside the crease, then pin it in place. Cotton webbing is a thick, woven strip made from cotton. It is similar to backpack straps. Choose a bright, contrasting color for the cotton webbing. You can also use twill tape instead. You can use ½-inch (1.27-centimeter) bias tape instead of cotton webbing or twill tape. You don't need to fold it. Topstitch the webbing down. Sew as close to the inside edge of the webbing as possible, about ⅛-inch (0.32-centimeter) seam allowance. Remove the pins as you sew, then trim off any excess webbing from the sides. Use a heavy-duty, denim or jeans-weight sewing needle. Fold the bound edge up by 7½ inches (19.05 centimeters). Turn the canvas so that the edge you just bound is facing you. Fold the edge upward by 7½ inches (19.05 centimeters) and press it flat with an iron. This is your pocket. If you are using patterned canvas, you can have the right or wrong side facing you. It depends on what part you want to have the pattern on it. Decorate the apron, if desired. You can leave the apron blank, if you wish, or you can decorate it further. For example, you can paint designs onto the apron using stencils and fabric paint. You can also draw designs on using puffy paint/dimensional paint. You don't need to decorate patterned canvas since it is already colorful. Creating Apron Pockets Mark off the smaller pockets. Keeping the canvas folded, place a ruler along the bottom edge. Starting at the left side, make a mark with a fabric pen in the following places: 5½ inches, 9½ inches, 15½ inches, and 19½ inches (13.97, 24.13, 39.37, and 49.53 centimeters). Move the ruler to the top, bound edge of the pocket, and repeat the marks. Connect the marks with vertical lines. Use a ruler and fabric marker to connect the top mark to the matching bottom mark. You will have a series of four vertical lines along your pocket. These will be your sewing guidelines. Sew along the vertical lines that you drew. Start sewing at the top, bound edge and finish sewing at the bottom, folded edge. You can use a thread color that matches the cotton webbing, or a thread color that matches the canvas. Backstitch at the start and end of your sewing a few times for extra strength. Cut and fold two strips of cotton webbing for the sides. Cut two pieces of 1-inch (2.54-centimeter) wide cotton webbing down to 12½ inches (31.75 centimeters). You can use the same color as you did to bind the top edge of the pocket, or a different color. Fold the bottom edge of each strip by ½ inch (1.27 centimeters), and press it flat with an iron. Fold the cotton webbing over the side edges of your apron. Take one of the cotton webbing strips, and align the bottom, folded edge with the bottom, folded edge of your apron. Fold the sides of the cotton webbing over the sides of the apron, just like you did the top edge of the pocket. Pin it in place and trim off any excess webbing from the top edge. Repeat this step for the other side edge of the apron. Topstitch the cotton webbing down. Begin sewing at the bottom edge of the apron and finish sewing at the top edge. Sew as close as possible to the inside edge of the webbing, about ⅛-inch (0.32-centimeter). Use a thread color that matches the cotton webbing and remember to backstitch at the start and end of your sewing. Remove the pins as you sew. Making Apron Ties Cut some webbing for the apron ties. You will need at least 78 inches (198.12 centimeters) of 1-inch (2.54-centimeter) wide cotton webbing for this. It can be the same color as the ones you used to bind the edges of the pocket/apron, or a contrasting color. Find the center of the webbing, then fold it over the top edge of the apron. Fold the webbing in half first to find the center, then mark it with a pin. Fold the webbing over the top of the apron and pin it in place, just like you did when binding the top edge of the pocket. Leave the webbing outside the apron unfolded. Topstitch the webbing down. Start sewing at the webbing at the left, side edge of your apron, and finish sewing at the right edge. Sew as close as possible to the bottom edge of the webbing, and remember to backstitch. Use a thread color that matches the webbing and remove the pins as you sew. Do not start sewing at the end of the webbing. You want the webbing to go from being 1 inch (2.54 centimeters) wide, to ½ inch (1.27 centimeters) wide as it meets the apron, then back to 1 inch (2.54 centimeters). Finish the ends of the webbing, if desired. You can leave the ends of the webbing raw, or you can fold them over for a neater finish. If you want a neater finish, fold one of the ends over twice by ¼ to ½ inch (0.64 to 1.27 centimeters). Topstitch it down several times for extra strength, then repeat the process for the other end. Make sure that you are folding the ends on the same side. Making a No-Sew Apron Find an old pair of jeans. The jeans should be 1 to 2 sizes larger than you. You want them to sit comfortably around your hips without sliding off or feeling too tight. Choose jeans with large, roomy back pockets. Men's jeans are great for this. Cut the legs off just below the back pockets. Start by cutting one of the legs off, 1 inch (2.54 centimeters) below the back pocket. Fold the jeans over and use the cut leg as a guide for the second one. Use a ruler and marker to draw a guideline across the bottom of the jeans, if needed. Cut up the side seams on the front of the jeans. Turn the jeans so that the zipper and front pockets are facing you. Cut up both of the side seams from the bottom cut edge all the way up to the bottom of the waistband. Leave the folded/topstitched part of the seam attacked to the back of the jeans. They will become part of the design. Cut the front part of the waistband away from the jeans. Begin cutting at the zipper and finish cutting at the side seam. Try to cut as close to the bottom edge of the waistband as you can; use the seam as a guide. Leave the button and button hole. You will need these to secure the apron. The front pockets will fall away as they will have nothing to hold on to. Set them aside for another project or recycle them. When you reach the belt loops, you can cut under them so that they are still attached to the waist band. You can also cut them off entirely. Clean up the bottom edge of the apron. Sometimes, when you cut the legs off of a pair of jeans, the crotch part sticks out in a little triangle. Use a sharp pair of fabric scissors to cut this triangle off. Decorate the apron, if desired. You can leave your apron plain if you want to, or you can decorate it further. Choose garden themed motifs and designs, such as flowers, bees, or butterflies. Here are some simple design ideas that would work well on a denim apron:\nIron a patch onto a pocket or the corner of the apron. Decorate the apron using puff paint or dimensional fabric paint. Use stencils and fabric paint to add images, such as butterflies or flowers. Use the apron. Fill the pockets with seed packets, then wrap the apron around your waist. Use the button to secure the apron.",
    "sentences": [
        " Sewing an Apron Cut a large rectangle for the apron base.",
        "It needs to be 24 inches (60.96 centimeters) wide and 19½ inches (49.53 centimeters) tall.",
        "You can use plain or patterned cotton canvas fabric.",
        "If you are using patterned canvas, however, be aware that both the right and wrong sides will be visible on the front of the apron.",
        "You can also find a pattern online to suit your needs and style, if you’re not comfortable designing your own apron.",
        "Fold cotton webbing along one of the long edges.",
        "Cut a piece of 1-inch (2.54-centimeter) wide cotton webbing down to 24 inches (60.96 centimeters).",
        "Fold it in half lengthwise, then iron it to make a crease.",
        "Tuck it over one of the 24-inch (60.96-centimeter) long edges.",
        "Make sure that the raw, cut edge of the canvas is nestled right inside the crease, then pin it in place.",
        "Cotton webbing is a thick, woven strip made from cotton.",
        "It is similar to backpack straps.",
        "Choose a bright, contrasting color for the cotton webbing.",
        "You can also use twill tape instead.",
        "You can use ½-inch (1.27-centimeter) bias tape instead of cotton webbing or twill tape.",
        "You don't need to fold it.",
        "Topstitch the webbing down.",
        "Sew as close to the inside edge of the webbing as possible, about ⅛-inch (0.32-centimeter) seam allowance.",
        "Remove the pins as you sew, then trim off any excess webbing from the sides.",
        "Use a heavy-duty, denim or jeans-weight sewing needle.",
        "Fold the bound edge up by 7½ inches (19.05 centimeters).",
        "Turn the canvas so that the edge you just bound is facing you.",
        "Fold the edge upward by 7½ inches (19.05 centimeters) and press it flat with an iron.",
        "This is your pocket.",
        "If you are using patterned canvas, you can have the right or wrong side facing you.",
        "It depends on what part you want to have the pattern on it.",
        "Decorate the apron, if desired.",
        "You can leave the apron blank, if you wish, or you can decorate it further.",
        "For example, you can paint designs onto the apron using stencils and fabric paint.",
        "You can also draw designs on using puffy paint/dimensional paint.",
        "You don't need to decorate patterned canvas since it is already colorful.",
        "Creating Apron Pockets Mark off the smaller pockets.",
        "Keeping the canvas folded, place a ruler along the bottom edge.",
        "Starting at the left side, make a mark with a fabric pen in the following places: 5½ inches, 9½ inches, 15½ inches, and 19½ inches (13.97, 24.13, 39.37, and 49.53 centimeters).",
        "Move the ruler to the top, bound edge of the pocket, and repeat the marks.",
        "Connect the marks with vertical lines.",
        "Use a ruler and fabric marker to connect the top mark to the matching bottom mark.",
        "You will have a series of four vertical lines along your pocket.",
        "These will be your sewing guidelines.",
        "Sew along the vertical lines that you drew.",
        "Start sewing at the top, bound edge and finish sewing at the bottom, folded edge.",
        "You can use a thread color that matches the cotton webbing, or a thread color that matches the canvas.",
        "Backstitch at the start and end of your sewing a few times for extra strength.",
        "Cut and fold two strips of cotton webbing for the sides.",
        "Cut two pieces of 1-inch (2.54-centimeter) wide cotton webbing down to 12½ inches (31.75 centimeters).",
        "You can use the same color as you did to bind the top edge of the pocket, or a different color.",
        "Fold the bottom edge of each strip by ½ inch (1.27 centimeters), and press it flat with an iron.",
        "Fold the cotton webbing over the side edges of your apron.",
        "Take one of the cotton webbing strips, and align the bottom, folded edge with the bottom, folded edge of your apron.",
        "Fold the sides of the cotton webbing over the sides of the apron, just like you did the top edge of the pocket.",
        "Pin it in place and trim off any excess webbing from the top edge.",
        "Repeat this step for the other side edge of the apron.",
        "Topstitch the cotton webbing down.",
        "Begin sewing at the bottom edge of the apron and finish sewing at the top edge.",
        "Sew as close as possible to the inside edge of the webbing, about ⅛-inch (0.32-centimeter).",
        "Use a thread color that matches the cotton webbing and remember to backstitch at the start and end of your sewing.",
        "Remove the pins as you sew.",
        "Making Apron Ties Cut some webbing for the apron ties.",
        "You will need at least 78 inches (198.12 centimeters) of 1-inch (2.54-centimeter) wide cotton webbing for this.",
        "It can be the same color as the ones you used to bind the edges of the pocket/apron, or a contrasting color.",
        "Find the center of the webbing, then fold it over the top edge of the apron.",
        "Fold the webbing in half first to find the center, then mark it with a pin.",
        "Fold the webbing over the top of the apron and pin it in place, just like you did when binding the top edge of the pocket.",
        "Leave the webbing outside the apron unfolded.",
        "Topstitch the webbing down.",
        "Start sewing at the webbing at the left, side edge of your apron, and finish sewing at the right edge.",
        "Sew as close as possible to the bottom edge of the webbing, and remember to backstitch.",
        "Use a thread color that matches the webbing and remove the pins as you sew.",
        "Do not start sewing at the end of the webbing.",
        "You want the webbing to go from being 1 inch (2.54 centimeters) wide, to ½ inch (1.27 centimeters) wide as it meets the apron, then back to 1 inch (2.54 centimeters).",
        "Finish the ends of the webbing, if desired.",
        "You can leave the ends of the webbing raw, or you can fold them over for a neater finish.",
        "If you want a neater finish, fold one of the ends over twice by ¼ to ½ inch (0.64 to 1.27 centimeters).",
        "Topstitch it down several times for extra strength, then repeat the process for the other end.",
        "Make sure that you are folding the ends on the same side.",
        "Making a No-Sew Apron Find an old pair of jeans.",
        "The jeans should be 1 to 2 sizes larger than you.",
        "You want them to sit comfortably around your hips without sliding off or feeling too tight.",
        "Choose jeans with large, roomy back pockets.",
        "Men's jeans are great for this.",
        "Cut the legs off just below the back pockets.",
        "Start by cutting one of the legs off, 1 inch (2.54 centimeters) below the back pocket.",
        "Fold the jeans over and use the cut leg as a guide for the second one.",
        "Use a ruler and marker to draw a guideline across the bottom of the jeans, if needed.",
        "Cut up the side seams on the front of the jeans.",
        "Turn the jeans so that the zipper and front pockets are facing you.",
        "Cut up both of the side seams from the bottom cut edge all the way up to the bottom of the waistband.",
        "Leave the folded/topstitched part of the seam attacked to the back of the jeans.",
        "They will become part of the design.",
        "Cut the front part of the waistband away from the jeans.",
        "Begin cutting at the zipper and finish cutting at the side seam.",
        "Try to cut as close to the bottom edge of the waistband as you can; use the seam as a guide.",
        "Leave the button and button hole.",
        "You will need these to secure the apron.",
        "The front pockets will fall away as they will have nothing to hold on to.",
        "Set them aside for another project or recycle them.",
        "When you reach the belt loops, you can cut under them so that they are still attached to the waist band.",
        "You can also cut them off entirely.",
        "Clean up the bottom edge of the apron.",
        "Sometimes, when you cut the legs off of a pair of jeans, the crotch part sticks out in a little triangle.",
        "Use a sharp pair of fabric scissors to cut this triangle off.",
        "Decorate the apron, if desired.",
        "You can leave your apron plain if you want to, or you can decorate it further.",
        "Choose garden themed motifs and designs, such as flowers, bees, or butterflies.",
        "Here are some simple design ideas that would work well on a denim apron:\nIron a patch onto a pocket or the corner of the apron.",
        "Decorate the apron using puff paint or dimensional fabric paint.",
        "Use stencils and fabric paint to add images, such as butterflies or flowers.",
        "Use the apron.",
        "Fill the pockets with seed packets, then wrap the apron around your waist.",
        "Use the button to secure the apron."
    ]
}