{
    "title": "How to Brown Ground Turkey",
    "url": "https://www.wikihow.com/Brown-Ground-Turkey",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Poultry Recipes"
    ],
    "methods": [
        {
            "name": "Browning on the Stove Top",
            "steps": [
                {
                    "headline": "Defrost the meat, if needed.",
                    "description": "If you're starting with ground turkey that's frozen, you'll need to defrost it before you brown it. To defrost the ground turkey in the refrigerator, place it in the refrigerator 24 hours before you plan to cook it. You could also remove the ground turkey from its packaging and place it in a microwave-safe dish. Use the defrost setting on your microwave for the specific weight of ground turkey you want to defrost. To prevent food spoilage, you'll need to brown the ground turkey immediately after you've defrosted it in the microwave. If you don't have time to defrost the meat, you can safely cook it straight from frozen. It will just take more time to brown and be more difficult to stir."
                },
                {
                    "headline": "Heat a skillet.",
                    "description": "Preheat a large skillet over medium-high heat. If you're using very lean ground turkey, you may want to add a few teaspoons of vegetable oil to the skillet. This will keep the ground turkey from sticking to the pan."
                },
                {
                    "headline": "Add the ground turkey to the pan and stir it.",
                    "description": "Remove the ground turkey from its packaging and place it in the preheated skillet. Use a spoon to break up the ground turkey and stir it well."
                },
                {
                    "headline": "Cook the ground turkey for 14 to 16 minutes.",
                    "description": "Stir the ground turkey occasionally and let it cook for 14 to 16 minutes. The turkey should turn a white gray color and then begin to brown a little as it caramelizes."
                },
                {
                    "headline": "Check the temperature of the browned ground turkey.",
                    "description": "Insert a thermometer and check the temperature of the meat. It should be 165 degrees F (70 degrees C) before it's safe to use in a recipe."
                },
                {
                    "headline": "Drain the ground turkey.",
                    "description": "Place a few paper towels on a large plate. Scoop the cooked meat onto the paper towels so you leave the grease in the skillet and the paper towels absorb the excess grease."
                }
            ]
        },
        {
            "name": "Browning in the Microwave",
            "steps": [
                {
                    "headline": "Place the ground turkey in a microwave-safe dish.",
                    "description": "Remove the ground turkey from the package and set it in a microwave-safe dish. If the dish comes with a lid, fasten it on the dish. Or you can tear a sheet of plastic wrap and loosely place it over the dish. Covering the ground turkey is important because it traps heat in the dish. This will kill harmful bacteria. If your ground turkey is frozen, you'll need to use the defrost setting on your microwave before you cook the ground turkey. Cook the defrosted ground turkey immediately."
                },
                {
                    "headline": "Microwave the ground turkey for 2 1/2 minutes.",
                    "description": "Place the covered dish in the microwave and heat the ground turkey for 2 1/2 minutes. Keep in mind that the ground turkey won't be completely cooked at this point."
                },
                {
                    "headline": "Stir the ground turkey and microwave it for another 2 1/2 minutes.",
                    "description": "Carefully remove the dish of ground turkey from the microwave. Remove the lid and stir the meat to break it up and ensure that it cooks evenly. Put the lid back on and return the dish to the microwave. Heat the meat for another 2 1/2 minutes."
                },
                {
                    "headline": "Check the temperature before you use the ground turkey.",
                    "description": "Remove the ground turkey from the microwave and insert a thermometer into the meat. The ground turkey is safe to use once it's reached 165 degrees F (70 degrees C). You can season the ground turkey and use it in your favorite recipe. If you need to drain the ground turkey, place a few paper towels on a large plate. Scoop the cooked meat onto the paper towels so you leave the grease in the microwave-safe dish while the paper towels absorb the excess grease."
                }
            ]
        },
        {
            "name": "Using Browned Ground Turkey",
            "steps": [
                {
                    "headline": "Add ground turkey to soups.",
                    "description": "Ground turkey is a great way to include lean protein in your soups. Stir some browned ground turkey into your favorite vegetable soup or chili. Simmer the soup or chili until your vegetables or beans are tender. You can also use ground turkey in flavorful curries. These are great when you serve them with rice or flatbread."
                },
                {
                    "headline": "Use ground turkey in casseroles.",
                    "description": "You can replace ground pork or ground beef with ground turkey in your favorite casserole. For example, make a lighter turkey stroganoff, shepherd's pie, or lasagna. If you're pressed for time, you could also make traditional spaghetti in meat sauce, just use ground turkey."
                },
                {
                    "headline": "Make turkey tacos or stir fried rice.",
                    "description": "For a few quick meals, fill hard or soft taco shells with ground turkey. Season the ground turkey with taco or Mexican seasonings. Or for another fast meal, fry cooked rice in a skillet with mixed vegetables. Add some ground turkey and serve the stir fried rice with soy sauce. For an even lighter meal, make a fresh green salad and top it with seasoned ground turkey. Slice extra vegetables to serve on top."
                },
                {
                    "headline": "Stuff peppers or make loose meat sandwiches.",
                    "description": "Instead of using ground beef to make sloppy joes, use browned ground turkey for a lower-fat option. If you're trying to eat more veggies, combine ground turkey with cheese and sauce. Stuff hollowed out bell peppers with the ground turkey mixture and bake until the peppers are soft. You can also replace ground beef with ground turkey on homemade pizzas."
                }
            ]
        }
    ],
    "tyn": [
        "Skillet",
        "Spoon",
        "Plate",
        "Plastic wrap",
        "Paper towels",
        "Microwave-safe container with lid",
        "Microwave",
        "Thermometer"
    ],
    "text": " Browning on the Stove Top Defrost the meat, if needed. If you're starting with ground turkey that's frozen, you'll need to defrost it before you brown it. To defrost the ground turkey in the refrigerator, place it in the refrigerator 24 hours before you plan to cook it. You could also remove the ground turkey from its packaging and place it in a microwave-safe dish. Use the defrost setting on your microwave for the specific weight of ground turkey you want to defrost. To prevent food spoilage, you'll need to brown the ground turkey immediately after you've defrosted it in the microwave. If you don't have time to defrost the meat, you can safely cook it straight from frozen. It will just take more time to brown and be more difficult to stir. Heat a skillet. Preheat a large skillet over medium-high heat. If you're using very lean ground turkey, you may want to add a few teaspoons of vegetable oil to the skillet. This will keep the ground turkey from sticking to the pan. Add the ground turkey to the pan and stir it. Remove the ground turkey from its packaging and place it in the preheated skillet. Use a spoon to break up the ground turkey and stir it well. Cook the ground turkey for 14 to 16 minutes. Stir the ground turkey occasionally and let it cook for 14 to 16 minutes. The turkey should turn a white gray color and then begin to brown a little as it caramelizes. Check the temperature of the browned ground turkey. Insert a thermometer and check the temperature of the meat. It should be 165 degrees F (70 degrees C) before it's safe to use in a recipe. Drain the ground turkey. Place a few paper towels on a large plate. Scoop the cooked meat onto the paper towels so you leave the grease in the skillet and the paper towels absorb the excess grease. Browning in the Microwave Place the ground turkey in a microwave-safe dish. Remove the ground turkey from the package and set it in a microwave-safe dish. If the dish comes with a lid, fasten it on the dish. Or you can tear a sheet of plastic wrap and loosely place it over the dish. Covering the ground turkey is important because it traps heat in the dish. This will kill harmful bacteria. If your ground turkey is frozen, you'll need to use the defrost setting on your microwave before you cook the ground turkey. Cook the defrosted ground turkey immediately. Microwave the ground turkey for 2 1/2 minutes. Place the covered dish in the microwave and heat the ground turkey for 2 1/2 minutes. Keep in mind that the ground turkey won't be completely cooked at this point. Stir the ground turkey and microwave it for another 2 1/2 minutes. Carefully remove the dish of ground turkey from the microwave. Remove the lid and stir the meat to break it up and ensure that it cooks evenly. Put the lid back on and return the dish to the microwave. Heat the meat for another 2 1/2 minutes. Check the temperature before you use the ground turkey. Remove the ground turkey from the microwave and insert a thermometer into the meat. The ground turkey is safe to use once it's reached 165 degrees F (70 degrees C). You can season the ground turkey and use it in your favorite recipe. If you need to drain the ground turkey, place a few paper towels on a large plate. Scoop the cooked meat onto the paper towels so you leave the grease in the microwave-safe dish while the paper towels absorb the excess grease. Using Browned Ground Turkey Add ground turkey to soups. Ground turkey is a great way to include lean protein in your soups. Stir some browned ground turkey into your favorite vegetable soup or chili. Simmer the soup or chili until your vegetables or beans are tender. You can also use ground turkey in flavorful curries. These are great when you serve them with rice or flatbread. Use ground turkey in casseroles. You can replace ground pork or ground beef with ground turkey in your favorite casserole. For example, make a lighter turkey stroganoff, shepherd's pie, or lasagna. If you're pressed for time, you could also make traditional spaghetti in meat sauce, just use ground turkey. Make turkey tacos or stir fried rice. For a few quick meals, fill hard or soft taco shells with ground turkey. Season the ground turkey with taco or Mexican seasonings. Or for another fast meal, fry cooked rice in a skillet with mixed vegetables. Add some ground turkey and serve the stir fried rice with soy sauce. For an even lighter meal, make a fresh green salad and top it with seasoned ground turkey. Slice extra vegetables to serve on top. Stuff peppers or make loose meat sandwiches. Instead of using ground beef to make sloppy joes, use browned ground turkey for a lower-fat option. If you're trying to eat more veggies, combine ground turkey with cheese and sauce. Stuff hollowed out bell peppers with the ground turkey mixture and bake until the peppers are soft. You can also replace ground beef with ground turkey on homemade pizzas.",
    "sentences": [
        " Browning on the Stove Top Defrost the meat, if needed.",
        "If you're starting with ground turkey that's frozen, you'll need to defrost it before you brown it.",
        "To defrost the ground turkey in the refrigerator, place it in the refrigerator 24 hours before you plan to cook it.",
        "You could also remove the ground turkey from its packaging and place it in a microwave-safe dish.",
        "Use the defrost setting on your microwave for the specific weight of ground turkey you want to defrost.",
        "To prevent food spoilage, you'll need to brown the ground turkey immediately after you've defrosted it in the microwave.",
        "If you don't have time to defrost the meat, you can safely cook it straight from frozen.",
        "It will just take more time to brown and be more difficult to stir.",
        "Heat a skillet.",
        "Preheat a large skillet over medium-high heat.",
        "If you're using very lean ground turkey, you may want to add a few teaspoons of vegetable oil to the skillet.",
        "This will keep the ground turkey from sticking to the pan.",
        "Add the ground turkey to the pan and stir it.",
        "Remove the ground turkey from its packaging and place it in the preheated skillet.",
        "Use a spoon to break up the ground turkey and stir it well.",
        "Cook the ground turkey for 14 to 16 minutes.",
        "Stir the ground turkey occasionally and let it cook for 14 to 16 minutes.",
        "The turkey should turn a white gray color and then begin to brown a little as it caramelizes.",
        "Check the temperature of the browned ground turkey.",
        "Insert a thermometer and check the temperature of the meat.",
        "It should be 165 degrees F (70 degrees C) before it's safe to use in a recipe.",
        "Drain the ground turkey.",
        "Place a few paper towels on a large plate.",
        "Scoop the cooked meat onto the paper towels so you leave the grease in the skillet and the paper towels absorb the excess grease.",
        "Browning in the Microwave Place the ground turkey in a microwave-safe dish.",
        "Remove the ground turkey from the package and set it in a microwave-safe dish.",
        "If the dish comes with a lid, fasten it on the dish.",
        "Or you can tear a sheet of plastic wrap and loosely place it over the dish.",
        "Covering the ground turkey is important because it traps heat in the dish.",
        "This will kill harmful bacteria.",
        "If your ground turkey is frozen, you'll need to use the defrost setting on your microwave before you cook the ground turkey.",
        "Cook the defrosted ground turkey immediately.",
        "Microwave the ground turkey for 2 1/2 minutes.",
        "Place the covered dish in the microwave and heat the ground turkey for 2 1/2 minutes.",
        "Keep in mind that the ground turkey won't be completely cooked at this point.",
        "Stir the ground turkey and microwave it for another 2 1/2 minutes.",
        "Carefully remove the dish of ground turkey from the microwave.",
        "Remove the lid and stir the meat to break it up and ensure that it cooks evenly.",
        "Put the lid back on and return the dish to the microwave.",
        "Heat the meat for another 2 1/2 minutes.",
        "Check the temperature before you use the ground turkey.",
        "Remove the ground turkey from the microwave and insert a thermometer into the meat.",
        "The ground turkey is safe to use once it's reached 165 degrees F (70 degrees C).",
        "You can season the ground turkey and use it in your favorite recipe.",
        "If you need to drain the ground turkey, place a few paper towels on a large plate.",
        "Scoop the cooked meat onto the paper towels so you leave the grease in the microwave-safe dish while the paper towels absorb the excess grease.",
        "Using Browned Ground Turkey Add ground turkey to soups.",
        "Ground turkey is a great way to include lean protein in your soups.",
        "Stir some browned ground turkey into your favorite vegetable soup or chili.",
        "Simmer the soup or chili until your vegetables or beans are tender.",
        "You can also use ground turkey in flavorful curries.",
        "These are great when you serve them with rice or flatbread.",
        "Use ground turkey in casseroles.",
        "You can replace ground pork or ground beef with ground turkey in your favorite casserole.",
        "For example, make a lighter turkey stroganoff, shepherd's pie, or lasagna.",
        "If you're pressed for time, you could also make traditional spaghetti in meat sauce, just use ground turkey.",
        "Make turkey tacos or stir fried rice.",
        "For a few quick meals, fill hard or soft taco shells with ground turkey.",
        "Season the ground turkey with taco or Mexican seasonings.",
        "Or for another fast meal, fry cooked rice in a skillet with mixed vegetables.",
        "Add some ground turkey and serve the stir fried rice with soy sauce.",
        "For an even lighter meal, make a fresh green salad and top it with seasoned ground turkey.",
        "Slice extra vegetables to serve on top.",
        "Stuff peppers or make loose meat sandwiches.",
        "Instead of using ground beef to make sloppy joes, use browned ground turkey for a lower-fat option.",
        "If you're trying to eat more veggies, combine ground turkey with cheese and sauce.",
        "Stuff hollowed out bell peppers with the ground turkey mixture and bake until the peppers are soft.",
        "You can also replace ground beef with ground turkey on homemade pizzas."
    ]
}