{
    "title": "How to Cook Farfalle Pasta",
    "url": "https://www.wikihow.com/Cook-Farfalle-Pasta",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Pasta and Noodles"
    ],
    "parts": [
        {
            "name": "Making the Dough",
            "steps": [
                {
                    "headline": "Combine the flours in a mound with a hole in the center.",
                    "description": "Add ⅔ cup (83 g) of all-purpose flour and ⅔ cup (111 g) semolina flour to a medium bowl. Whisk the two together to mix them, and then use your hands to shape them into a mound with a well in the center. The mound that you form with the hole in the center should resemble a volcano. You don’t necessarily need to use a bowl to mix the dough. Traditional Italian cooks often mix the flour together on a flat work surface, such as a wooden cutting board."
                },
                {
                    "headline": "Crack the eggs into the flour and season with salt.",
                    "description": "With the flour shaped into a mound, break 2 large eggs into the well in the center. Next, sprinkle a pinch of salt to taste over the eggs."
                },
                {
                    "headline": "Stir the flour into the eggs slowly.",
                    "description": "After you’ve broken the eggs into the mound of flour, gently mix the flour into them. Use a fork to add small amounts of the flour from the walls of the mound to the egg center, working a little more flour in each time."
                },
                {
                    "headline": "Incorporate the rest of the flour with your hands and knead for several minutes.",
                    "description": "Once you’ve mixed about half or three-quarters of the flour into the eggs, you should be able to work the dough with clean hands. Mix in the rest of the loose flour by hand to form a ball, and then knead it for 5 to 10 minutes. The dough should feel smooth but still soft when you’re done kneading it. If the dough feels too sticky, sprinkle a little more flour over it and work it in."
                },
                {
                    "headline": "Cover the dough and allow it to rest for half an hour.",
                    "description": "When you’re finished kneading the dough, place a clean kitchen towel over the ball. Allow the pasta dough to rest for approximately 30 minutes so it’s easier to work with. You can cover the dough with plastic wrap if you prefer."
                }
            ]
        },
        {
            "name": "Cutting the Farfalle",
            "steps": [
                {
                    "headline": "Divide the dough into four pieces.",
                    "description": "Once the pasta dough has rested for a half hour, remove the towel. With a sharp knife, cut the ball into four equal pieces."
                },
                {
                    "headline": "Roll one part of the dough into a rectangle.",
                    "description": "Remove one piece of the dough from the bowl, leaving the remaining pieces covered so they don’t dry out. Use a rolling pin to roll out the dough piece into a rectangle shape that’s approximately 1 mm thick. If you don’t have a rolling pin, you can use any heavy cylindrical object, such as a wine bottle, thermos, or can of food, to roll out the dough. If you find that the dough is sticking to your work surface or rolling pin, you can lightly dust them with flour."
                },
                {
                    "headline": "Cut the dough into small rectangles.",
                    "description": "When you’ve rolled the dough out into a rectangle, use a sharp knife to cut it into smaller rectangles. Each rectangle should be approximately 1 ½- by 1-inch (4- by 2.5-cm). If you’d like your farfalle to have a more decorative look, you can use a pastry crimper to cut the rectangles so they have scalloped edges."
                },
                {
                    "headline": "Pinch each rectangle in the center to form a bow.",
                    "description": "After you’ve finished cutting dough, use clean fingers to carefully pinch the center of each rectangle along the long side. Press fairly hard to form the trademark bow shape for the farfalle."
                },
                {
                    "headline": "Cover the farfalle and repeat the process with the rest of the dough.",
                    "description": "Place all of the shaped farfalle on a cookie sheet lined with wax or parchment paper, and cover them with a clean kitchen towel. Remove another piece of dough from the bowl, and repeat the process until you’ve shaped all of it into farfalle."
                }
            ]
        },
        {
            "name": "Boiling the Pasta",
            "steps": [
                {
                    "headline": "Salt a large pot of water.",
                    "description": "To cook the farfalle, fill a large pot approximately three-quarters full with water. Sprinkle a pinch or two of salt into the pot to season the water."
                },
                {
                    "headline": "Bring the water to a boil.",
                    "description": "Place the pot on the stove, and heat it over high heat. Allow the pot to come to a boil, which should take approximately 7 to 10 minutes."
                },
                {
                    "headline": "Add the farfalle and cook it until it’s al dente.",
                    "description": "When the water is boiling, add the fresh farfalle to the pot. Allow the pasta to cook for 2 to 4 minutes or until it’s al dente, which means it should still be slightly firm when you bite into it. While the pasta is boiling, stir it occasionally with a wooden spoon to ensure that it cooks evenly."
                },
                {
                    "headline": "Drain the pasta.",
                    "description": "Once the farfalle is al dente, turn off the heat and remove the pot from the stove. Next, pour the pasta into a colander in the sink to drain the water. Depending on what type of sauce you’re serving with the farfalle, you may want to save some of the pasta water to help the thin out the sauce if necessary."
                },
                {
                    "headline": "Toss the farfalle with sauce and serve.",
                    "description": "Once the pasta is drained, you can return it the pot that you cooked it in. Add your favorite sauce, and toss the farfalle well so it’s evenly coated. Transfer it to a serving platter, and serve it while it’s still warm. You can use whatever sauce you like with farfalle, but because it’s a larger pasta and has pleats, it holds up well to heavier sauces. Try it with pesto, Alfredo, or Bolognese sauce."
                }
            ]
        }
    ],
    "tyn": [
        "Medium bowl",
        "Whisk",
        "Fork",
        "Kitchen towel",
        "Rolling pin",
        "Sharp knife",
        "Cookie sheet",
        "Wax or parchment paper",
        "Large pot",
        "Wooden spoon",
        "Colander"
    ],
    "text": " Making the Dough Combine the flours in a mound with a hole in the center. Add ⅔ cup (83 g) of all-purpose flour and ⅔ cup (111 g) semolina flour to a medium bowl. Whisk the two together to mix them, and then use your hands to shape them into a mound with a well in the center. The mound that you form with the hole in the center should resemble a volcano. You don’t necessarily need to use a bowl to mix the dough. Traditional Italian cooks often mix the flour together on a flat work surface, such as a wooden cutting board. Crack the eggs into the flour and season with salt. With the flour shaped into a mound, break 2 large eggs into the well in the center. Next, sprinkle a pinch of salt to taste over the eggs. Stir the flour into the eggs slowly. After you’ve broken the eggs into the mound of flour, gently mix the flour into them. Use a fork to add small amounts of the flour from the walls of the mound to the egg center, working a little more flour in each time. Incorporate the rest of the flour with your hands and knead for several minutes. Once you’ve mixed about half or three-quarters of the flour into the eggs, you should be able to work the dough with clean hands. Mix in the rest of the loose flour by hand to form a ball, and then knead it for 5 to 10 minutes. The dough should feel smooth but still soft when you’re done kneading it. If the dough feels too sticky, sprinkle a little more flour over it and work it in. Cover the dough and allow it to rest for half an hour. When you’re finished kneading the dough, place a clean kitchen towel over the ball. Allow the pasta dough to rest for approximately 30 minutes so it’s easier to work with. You can cover the dough with plastic wrap if you prefer. Cutting the Farfalle Divide the dough into four pieces. Once the pasta dough has rested for a half hour, remove the towel. With a sharp knife, cut the ball into four equal pieces. Roll one part of the dough into a rectangle. Remove one piece of the dough from the bowl, leaving the remaining pieces covered so they don’t dry out. Use a rolling pin to roll out the dough piece into a rectangle shape that’s approximately 1 mm thick. If you don’t have a rolling pin, you can use any heavy cylindrical object, such as a wine bottle, thermos, or can of food, to roll out the dough. If you find that the dough is sticking to your work surface or rolling pin, you can lightly dust them with flour. Cut the dough into small rectangles. When you’ve rolled the dough out into a rectangle, use a sharp knife to cut it into smaller rectangles. Each rectangle should be approximately 1 ½- by 1-inch (4- by 2.5-cm). If you’d like your farfalle to have a more decorative look, you can use a pastry crimper to cut the rectangles so they have scalloped edges. Pinch each rectangle in the center to form a bow. After you’ve finished cutting dough, use clean fingers to carefully pinch the center of each rectangle along the long side. Press fairly hard to form the trademark bow shape for the farfalle. Cover the farfalle and repeat the process with the rest of the dough. Place all of the shaped farfalle on a cookie sheet lined with wax or parchment paper, and cover them with a clean kitchen towel. Remove another piece of dough from the bowl, and repeat the process until you’ve shaped all of it into farfalle. Boiling the Pasta Salt a large pot of water. To cook the farfalle, fill a large pot approximately three-quarters full with water. Sprinkle a pinch or two of salt into the pot to season the water. Bring the water to a boil. Place the pot on the stove, and heat it over high heat. Allow the pot to come to a boil, which should take approximately 7 to 10 minutes. Add the farfalle and cook it until it’s al dente. When the water is boiling, add the fresh farfalle to the pot. Allow the pasta to cook for 2 to 4 minutes or until it’s al dente, which means it should still be slightly firm when you bite into it. While the pasta is boiling, stir it occasionally with a wooden spoon to ensure that it cooks evenly. Drain the pasta. Once the farfalle is al dente, turn off the heat and remove the pot from the stove. Next, pour the pasta into a colander in the sink to drain the water. Depending on what type of sauce you’re serving with the farfalle, you may want to save some of the pasta water to help the thin out the sauce if necessary. Toss the farfalle with sauce and serve. Once the pasta is drained, you can return it the pot that you cooked it in. Add your favorite sauce, and toss the farfalle well so it’s evenly coated. Transfer it to a serving platter, and serve it while it’s still warm. You can use whatever sauce you like with farfalle, but because it’s a larger pasta and has pleats, it holds up well to heavier sauces. Try it with pesto, Alfredo, or Bolognese sauce.",
    "sentences": [
        " Making the Dough Combine the flours in a mound with a hole in the center.",
        "Add ⅔ cup (83 g) of all-purpose flour and ⅔ cup (111 g) semolina flour to a medium bowl.",
        "Whisk the two together to mix them, and then use your hands to shape them into a mound with a well in the center.",
        "The mound that you form with the hole in the center should resemble a volcano.",
        "You don’t necessarily need to use a bowl to mix the dough.",
        "Traditional Italian cooks often mix the flour together on a flat work surface, such as a wooden cutting board.",
        "Crack the eggs into the flour and season with salt.",
        "With the flour shaped into a mound, break 2 large eggs into the well in the center.",
        "Next, sprinkle a pinch of salt to taste over the eggs.",
        "Stir the flour into the eggs slowly.",
        "After you’ve broken the eggs into the mound of flour, gently mix the flour into them.",
        "Use a fork to add small amounts of the flour from the walls of the mound to the egg center, working a little more flour in each time.",
        "Incorporate the rest of the flour with your hands and knead for several minutes.",
        "Once you’ve mixed about half or three-quarters of the flour into the eggs, you should be able to work the dough with clean hands.",
        "Mix in the rest of the loose flour by hand to form a ball, and then knead it for 5 to 10 minutes.",
        "The dough should feel smooth but still soft when you’re done kneading it.",
        "If the dough feels too sticky, sprinkle a little more flour over it and work it in.",
        "Cover the dough and allow it to rest for half an hour.",
        "When you’re finished kneading the dough, place a clean kitchen towel over the ball.",
        "Allow the pasta dough to rest for approximately 30 minutes so it’s easier to work with.",
        "You can cover the dough with plastic wrap if you prefer.",
        "Cutting the Farfalle Divide the dough into four pieces.",
        "Once the pasta dough has rested for a half hour, remove the towel.",
        "With a sharp knife, cut the ball into four equal pieces.",
        "Roll one part of the dough into a rectangle.",
        "Remove one piece of the dough from the bowl, leaving the remaining pieces covered so they don’t dry out.",
        "Use a rolling pin to roll out the dough piece into a rectangle shape that’s approximately 1 mm thick.",
        "If you don’t have a rolling pin, you can use any heavy cylindrical object, such as a wine bottle, thermos, or can of food, to roll out the dough.",
        "If you find that the dough is sticking to your work surface or rolling pin, you can lightly dust them with flour.",
        "Cut the dough into small rectangles.",
        "When you’ve rolled the dough out into a rectangle, use a sharp knife to cut it into smaller rectangles.",
        "Each rectangle should be approximately 1 ½- by 1-inch (4- by 2.5-cm).",
        "If you’d like your farfalle to have a more decorative look, you can use a pastry crimper to cut the rectangles so they have scalloped edges.",
        "Pinch each rectangle in the center to form a bow.",
        "After you’ve finished cutting dough, use clean fingers to carefully pinch the center of each rectangle along the long side.",
        "Press fairly hard to form the trademark bow shape for the farfalle.",
        "Cover the farfalle and repeat the process with the rest of the dough.",
        "Place all of the shaped farfalle on a cookie sheet lined with wax or parchment paper, and cover them with a clean kitchen towel.",
        "Remove another piece of dough from the bowl, and repeat the process until you’ve shaped all of it into farfalle.",
        "Boiling the Pasta Salt a large pot of water.",
        "To cook the farfalle, fill a large pot approximately three-quarters full with water.",
        "Sprinkle a pinch or two of salt into the pot to season the water.",
        "Bring the water to a boil.",
        "Place the pot on the stove, and heat it over high heat.",
        "Allow the pot to come to a boil, which should take approximately 7 to 10 minutes.",
        "Add the farfalle and cook it until it’s al dente.",
        "When the water is boiling, add the fresh farfalle to the pot.",
        "Allow the pasta to cook for 2 to 4 minutes or until it’s al dente, which means it should still be slightly firm when you bite into it.",
        "While the pasta is boiling, stir it occasionally with a wooden spoon to ensure that it cooks evenly.",
        "Drain the pasta.",
        "Once the farfalle is al dente, turn off the heat and remove the pot from the stove.",
        "Next, pour the pasta into a colander in the sink to drain the water.",
        "Depending on what type of sauce you’re serving with the farfalle, you may want to save some of the pasta water to help the thin out the sauce if necessary.",
        "Toss the farfalle with sauce and serve.",
        "Once the pasta is drained, you can return it the pot that you cooked it in.",
        "Add your favorite sauce, and toss the farfalle well so it’s evenly coated.",
        "Transfer it to a serving platter, and serve it while it’s still warm.",
        "You can use whatever sauce you like with farfalle, but because it’s a larger pasta and has pleats, it holds up well to heavier sauces.",
        "Try it with pesto, Alfredo, or Bolognese sauce."
    ]
}