{
    "title": "How to Make Simple Syrup",
    "url": "https://www.wikihow.com/Make-Simple-Syrup",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments",
        "Syrups"
    ],
    "methods": [
        {
            "name": "Making Simple Syrup",
            "steps": [
                {
                    "headline": "Fill a saucepan with equal amounts of water and sugar and stir.",
                    "description": "Remember that the sugar will dissolve, so you will end up with a little bit less than you think. If you started with 1 cup (225 grams) of sugar and 1 cup (240 milliliters) of water, you will end up with 1½ cup (360 milliliters) of simple syrup. If you need more/less simple syrup than that, adjust the ratios accordingly."
                },
                {
                    "headline": "Bring the mixture to a boil.",
                    "description": "Turn the heat to medium or medium high, and let the mixture come to a boil. Stir occasionally to help the sugar dissolve."
                },
                {
                    "headline": "Simmer the mixture over low heat until the sugar dissolves and the mixture turns clear.",
                    "description": "Stir the mixture occasionally with a whisk or spoon. This will may take anywhere between 3 to 5 minutes."
                },
                {
                    "headline": "Remove the mixture from heat and let it cool.",
                    "description": "If you are making the simple syrup for a recipe, you can use it as soon as it cools down. If not, read on to learn how to store it."
                },
                {
                    "headline": "Pour the simple syrup into a glass jar or bottle.",
                    "description": "If you choose to use a bottle, stick a funnel down the neck of the bottle first. This will make pouring the simple syrup in easier."
                },
                {
                    "headline": "Store the simple syrup in the fridge.",
                    "description": "You can now use it to sweeten iced teas, coffees, lemonades, and cocktails. It will last about 4 weeks."
                }
            ]
        },
        {
            "name": "Making Flavored Simple Syrup",
            "steps": [
                {
                    "headline": "Fill a saucepan with equal amounts of sugar and water.",
                    "description": "Start with 1 cup (225 grams) of sugar and 1 cup (240 milliliters) of water. Stir the two together."
                },
                {
                    "headline": "Bring the mixture to a boil, then simmer it until the sugar dissolves.",
                    "description": "This will take about 3 to 5 minutes. Stir the mixture occasionally."
                },
                {
                    "headline": "Remove the saucepan from heat and add some spices or fresh herbs.",
                    "description": "You can use crushed, dried herbs, but avoid using ground spices; they will be too hard to filter out. If you'd like to make several different flavors, pour the simple syrup into jars first, then add your desired herbs or spices. Here are some ideas to get you started:\n4 cinnamon sticks, broken in half. 1 tablespoon lemon, lime, grapefruit, or orange zest. 1 tablespoon dried herbs, such as thyme, lavender, or rose petals. 3 to 4 fresh rosemary, thyme, or lavender sprigs. 1 cup (25 grams) fresh mint or basil leaves. ½ vanilla bean pod, seeds scraped and added in."
                },
                {
                    "headline": "Cover the saucepan tightly with a lid and wait 30 minutes.",
                    "description": "During this time, the herbs, spices, or flowers you added will steep and release their flavors into the simple syrup."
                },
                {
                    "headline": "Strain out the herbs, spices, or flowers.",
                    "description": "They may look pretty in the jar, but they will shorten the shelf life of the syrup. Place a fine, mesh strainer or sieve over a glass jar or bottle, and pour the simple syrup through it. Discard the herbs, spices, or flowers that get caught in the strainer. If you are filling a bottle, you might want to stick a funnel down the neck of the bottle first."
                },
                {
                    "headline": "Close the jar or bottle tightly, and store the simple syrup in the fridge.",
                    "description": "Use it to sweeten or flavor iced teas, coffees, lemonades, and cocktails. It will last about 1 to 2 weeks."
                }
            ]
        }
    ],
    "tyn": [
        "Simple Syrup",
        "Saucepan",
        "Spoon or whisk",
        "Funnel (optional)",
        "Glass jar or bottle",
        "Flavored Simple Syrup",
        "Fine, mesh sieve or strainer"
    ],
    "text": " Making Simple Syrup Fill a saucepan with equal amounts of water and sugar and stir. Remember that the sugar will dissolve, so you will end up with a little bit less than you think. If you started with 1 cup (225 grams) of sugar and 1 cup (240 milliliters) of water, you will end up with 1½ cup (360 milliliters) of simple syrup. If you need more/less simple syrup than that, adjust the ratios accordingly. Bring the mixture to a boil. Turn the heat to medium or medium high, and let the mixture come to a boil. Stir occasionally to help the sugar dissolve. Simmer the mixture over low heat until the sugar dissolves and the mixture turns clear. Stir the mixture occasionally with a whisk or spoon. This will may take anywhere between 3 to 5 minutes. Remove the mixture from heat and let it cool. If you are making the simple syrup for a recipe, you can use it as soon as it cools down. If not, read on to learn how to store it. Pour the simple syrup into a glass jar or bottle. If you choose to use a bottle, stick a funnel down the neck of the bottle first. This will make pouring the simple syrup in easier. Store the simple syrup in the fridge. You can now use it to sweeten iced teas, coffees, lemonades, and cocktails. It will last about 4 weeks. Making Flavored Simple Syrup Fill a saucepan with equal amounts of sugar and water. Start with 1 cup (225 grams) of sugar and 1 cup (240 milliliters) of water. Stir the two together. Bring the mixture to a boil, then simmer it until the sugar dissolves. This will take about 3 to 5 minutes. Stir the mixture occasionally. Remove the saucepan from heat and add some spices or fresh herbs. You can use crushed, dried herbs, but avoid using ground spices; they will be too hard to filter out. If you'd like to make several different flavors, pour the simple syrup into jars first, then add your desired herbs or spices. Here are some ideas to get you started:\n4 cinnamon sticks, broken in half. 1 tablespoon lemon, lime, grapefruit, or orange zest. 1 tablespoon dried herbs, such as thyme, lavender, or rose petals. 3 to 4 fresh rosemary, thyme, or lavender sprigs. 1 cup (25 grams) fresh mint or basil leaves. ½ vanilla bean pod, seeds scraped and added in. Cover the saucepan tightly with a lid and wait 30 minutes. During this time, the herbs, spices, or flowers you added will steep and release their flavors into the simple syrup. Strain out the herbs, spices, or flowers. They may look pretty in the jar, but they will shorten the shelf life of the syrup. Place a fine, mesh strainer or sieve over a glass jar or bottle, and pour the simple syrup through it. Discard the herbs, spices, or flowers that get caught in the strainer. If you are filling a bottle, you might want to stick a funnel down the neck of the bottle first. Close the jar or bottle tightly, and store the simple syrup in the fridge. Use it to sweeten or flavor iced teas, coffees, lemonades, and cocktails. It will last about 1 to 2 weeks.",
    "sentences": [
        " Making Simple Syrup Fill a saucepan with equal amounts of water and sugar and stir.",
        "Remember that the sugar will dissolve, so you will end up with a little bit less than you think.",
        "If you started with 1 cup (225 grams) of sugar and 1 cup (240 milliliters) of water, you will end up with 1½ cup (360 milliliters) of simple syrup.",
        "If you need more/less simple syrup than that, adjust the ratios accordingly.",
        "Bring the mixture to a boil.",
        "Turn the heat to medium or medium high, and let the mixture come to a boil.",
        "Stir occasionally to help the sugar dissolve.",
        "Simmer the mixture over low heat until the sugar dissolves and the mixture turns clear.",
        "Stir the mixture occasionally with a whisk or spoon.",
        "This will may take anywhere between 3 to 5 minutes.",
        "Remove the mixture from heat and let it cool.",
        "If you are making the simple syrup for a recipe, you can use it as soon as it cools down.",
        "If not, read on to learn how to store it.",
        "Pour the simple syrup into a glass jar or bottle.",
        "If you choose to use a bottle, stick a funnel down the neck of the bottle first.",
        "This will make pouring the simple syrup in easier.",
        "Store the simple syrup in the fridge.",
        "You can now use it to sweeten iced teas, coffees, lemonades, and cocktails.",
        "It will last about 4 weeks.",
        "Making Flavored Simple Syrup Fill a saucepan with equal amounts of sugar and water.",
        "Start with 1 cup (225 grams) of sugar and 1 cup (240 milliliters) of water.",
        "Stir the two together.",
        "Bring the mixture to a boil, then simmer it until the sugar dissolves.",
        "This will take about 3 to 5 minutes.",
        "Stir the mixture occasionally.",
        "Remove the saucepan from heat and add some spices or fresh herbs.",
        "You can use crushed, dried herbs, but avoid using ground spices; they will be too hard to filter out.",
        "If you'd like to make several different flavors, pour the simple syrup into jars first, then add your desired herbs or spices.",
        "Here are some ideas to get you started:\n4 cinnamon sticks, broken in half.",
        "1 tablespoon lemon, lime, grapefruit, or orange zest.",
        "1 tablespoon dried herbs, such as thyme, lavender, or rose petals.",
        "3 to 4 fresh rosemary, thyme, or lavender sprigs.",
        "1 cup (25 grams) fresh mint or basil leaves.",
        "½ vanilla bean pod, seeds scraped and added in.",
        "Cover the saucepan tightly with a lid and wait 30 minutes.",
        "During this time, the herbs, spices, or flowers you added will steep and release their flavors into the simple syrup.",
        "Strain out the herbs, spices, or flowers.",
        "They may look pretty in the jar, but they will shorten the shelf life of the syrup.",
        "Place a fine, mesh strainer or sieve over a glass jar or bottle, and pour the simple syrup through it.",
        "Discard the herbs, spices, or flowers that get caught in the strainer.",
        "If you are filling a bottle, you might want to stick a funnel down the neck of the bottle first.",
        "Close the jar or bottle tightly, and store the simple syrup in the fridge.",
        "Use it to sweeten or flavor iced teas, coffees, lemonades, and cocktails.",
        "It will last about 1 to 2 weeks."
    ]
}