{
    "title": "How to Thicken Liquid with Cornstarch",
    "url": "https://www.wikihow.com/Thicken-Liquid-with-Cornstarch",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills"
    ],
    "parts": [
        {
            "name": "Mixing Cornstarch and Water",
            "steps": [
                {
                    "headline": "Combine one tablespoon of cornstarch with 1/4 cup of cold water.",
                    "description": "Begin by pouring one tablespoon (14.18 g) of cornstarch and 1/4 cup (59 mL) of water into a cup or bowl. This mixture will create a medium-thick sauce. If you need a thicker or thinner mixture, you should use slightly more or less cornstarch. Cornstarch mixes the best with cold water. It may take some experimentation to create the consistency you desire. Don’t worry if the mixture is a little too thick. You can thin it out later with water."
                },
                {
                    "headline": "Whisk the mixture.",
                    "description": "The sauce may not turn out as good as it could be if you don’t thoroughly combine the water and cornstarch. Use a whisk to mix the ingredients together. There shouldn’t be any lumps left when the mixture has been properly combined."
                },
                {
                    "headline": "Test the thickness of the cornstarch mixture.",
                    "description": "Make sure it’s sufficient for thickening. You can test it simply by spooning out some of the mixture and pouring it slowly back into the bowl. Or, you can add it to a small portion of a soup or sauce to see what it does."
                }
            ]
        },
        {
            "name": "Cooking the Mixture",
            "steps": [
                {
                    "headline": "Add a cooked cornstarch mixture to liquids for more control.",
                    "description": "Cooking the cornstarch first and then adding it to the mixture is an easy way to thicken a sauce or soup if you’ve found that it isn’t thick enough. Cooking the cornstarch mixture alone isn’t really any different than cooking it with the mixture. You should essentially follow the same instructions. The only difference is that you pour the cornstarch mixture into an empty pot and then add it to the liquid after it has started to bubble. After cooking the cornstarch mixture, add it to a heated up liquid. You have more control because you can as little or as much mixture to the liquid as you’d like."
                },
                {
                    "headline": "Add an uncooked cornstarch mixture to liquids for a quick fix.",
                    "description": "This is the easiest and fastest method for thickening a liquid. It is best to use this method if you know for sure that you need to thicken your liquid. It is best to add the cornstarch mixture to a liquid that is only a few minutes away from being finished."
                },
                {
                    "headline": "Turn the stove to a medium heat setting.",
                    "description": "Add the cornstarch mixture to a liquid that has been thoroughly stirred and simmering. Turn up the setting to a medium heat setting because the cornstarch mixture will thicken the best when it is lightly boiling. Using too much heat, however, can thin out and break down the sauce. If you are only cooking the cornstarch mixture, you should pour it in a pan and turn it to medium heat."
                },
                {
                    "headline": "Cook until the cornstarch and liquid mixture begins to bubble.",
                    "description": "Allow the cornstarch and liquid mixture to lightly boil for 5 or 10 minutes. After this amount of time, it should begin to bubble and thicken. Let it cook for longer if it doesn’t appear to have thickened."
                },
                {
                    "headline": "Stir the cornstarch and liquid mixture for two more minutes.",
                    "description": "Use a stirring utensil, like a wooden spoon, once the cornstarch and liquid mixture begins to bubble. Stir the cornstarch and liquid for about two more minutes. This will allow the cornstarch to be completely cooked. Then, remove the pot from the heat."
                }
            ]
        },
        {
            "name": "Completing the Process",
            "steps": [
                {
                    "headline": "Check the consistency of the cornstarch and liquid mixture.",
                    "description": "Use a spoon to check the thickness of this mixture. Allow it a few minutes to cool if you want to do a taste test. If you are happy with the taste and consistency, then you are done. If you are not happy with the consistency, then you can thin it out with water or thicken it with more cornstarch."
                },
                {
                    "headline": "Thin out the cornstarch and liquid mixture with water.",
                    "description": "If you find that the sauce created by the cornstarch and liquid is too thick, you can add some water to thin it out. Start by adding another 1/4 cup (59 mL) of water. Taste it and then add more water if needed. You may need to heat up and stir the mixture again after you add water."
                },
                {
                    "headline": "Add more cornstarch to the recipe.",
                    "description": "You can add more cornstarch to the sauce if you find that it is not thick enough. Simply repeat the process, but use slightly less cornstarch and water than you initially used. Keep in mind that repeating this process too many times can break down the recipe due to the use of heat."
                },
                {
                    "headline": "Alter the taste of the recipe if necessary.",
                    "description": "Cornstarch is one of the thickening agents that contains the least amount of fat. Fat often adds flavor to a recipe, so you may find that the recipe is less flavorful than desired after it has been thickened. If this is the case, add extra seasoning or other ingredients to the recipe to make the flavor more pleasing. Add seasoning, like salt, in small increments to avoid over-salting or over-seasoning the recipe."
                }
            ]
        }
    ],
    "tyn": [
        "Cornstarch",
        "Water",
        "Whisk",
        "Liquid of your choice",
        "Pot",
        "Stirring utensil"
    ],
    "text": " Mixing Cornstarch and Water Combine one tablespoon of cornstarch with 1/4 cup of cold water. Begin by pouring one tablespoon (14.18 g) of cornstarch and 1/4 cup (59 mL) of water into a cup or bowl. This mixture will create a medium-thick sauce. If you need a thicker or thinner mixture, you should use slightly more or less cornstarch. Cornstarch mixes the best with cold water. It may take some experimentation to create the consistency you desire. Don’t worry if the mixture is a little too thick. You can thin it out later with water. Whisk the mixture. The sauce may not turn out as good as it could be if you don’t thoroughly combine the water and cornstarch. Use a whisk to mix the ingredients together. There shouldn’t be any lumps left when the mixture has been properly combined. Test the thickness of the cornstarch mixture. Make sure it’s sufficient for thickening. You can test it simply by spooning out some of the mixture and pouring it slowly back into the bowl. Or, you can add it to a small portion of a soup or sauce to see what it does. Cooking the Mixture Add a cooked cornstarch mixture to liquids for more control. Cooking the cornstarch first and then adding it to the mixture is an easy way to thicken a sauce or soup if you’ve found that it isn’t thick enough. Cooking the cornstarch mixture alone isn’t really any different than cooking it with the mixture. You should essentially follow the same instructions. The only difference is that you pour the cornstarch mixture into an empty pot and then add it to the liquid after it has started to bubble. After cooking the cornstarch mixture, add it to a heated up liquid. You have more control because you can as little or as much mixture to the liquid as you’d like. Add an uncooked cornstarch mixture to liquids for a quick fix. This is the easiest and fastest method for thickening a liquid. It is best to use this method if you know for sure that you need to thicken your liquid. It is best to add the cornstarch mixture to a liquid that is only a few minutes away from being finished. Turn the stove to a medium heat setting. Add the cornstarch mixture to a liquid that has been thoroughly stirred and simmering. Turn up the setting to a medium heat setting because the cornstarch mixture will thicken the best when it is lightly boiling. Using too much heat, however, can thin out and break down the sauce. If you are only cooking the cornstarch mixture, you should pour it in a pan and turn it to medium heat. Cook until the cornstarch and liquid mixture begins to bubble. Allow the cornstarch and liquid mixture to lightly boil for 5 or 10 minutes. After this amount of time, it should begin to bubble and thicken. Let it cook for longer if it doesn’t appear to have thickened. Stir the cornstarch and liquid mixture for two more minutes. Use a stirring utensil, like a wooden spoon, once the cornstarch and liquid mixture begins to bubble. Stir the cornstarch and liquid for about two more minutes. This will allow the cornstarch to be completely cooked. Then, remove the pot from the heat. Completing the Process Check the consistency of the cornstarch and liquid mixture. Use a spoon to check the thickness of this mixture. Allow it a few minutes to cool if you want to do a taste test. If you are happy with the taste and consistency, then you are done. If you are not happy with the consistency, then you can thin it out with water or thicken it with more cornstarch. Thin out the cornstarch and liquid mixture with water. If you find that the sauce created by the cornstarch and liquid is too thick, you can add some water to thin it out. Start by adding another 1/4 cup (59 mL) of water. Taste it and then add more water if needed. You may need to heat up and stir the mixture again after you add water. Add more cornstarch to the recipe. You can add more cornstarch to the sauce if you find that it is not thick enough. Simply repeat the process, but use slightly less cornstarch and water than you initially used. Keep in mind that repeating this process too many times can break down the recipe due to the use of heat. Alter the taste of the recipe if necessary. Cornstarch is one of the thickening agents that contains the least amount of fat. Fat often adds flavor to a recipe, so you may find that the recipe is less flavorful than desired after it has been thickened. If this is the case, add extra seasoning or other ingredients to the recipe to make the flavor more pleasing. Add seasoning, like salt, in small increments to avoid over-salting or over-seasoning the recipe.",
    "sentences": [
        " Mixing Cornstarch and Water Combine one tablespoon of cornstarch with 1/4 cup of cold water.",
        "Begin by pouring one tablespoon (14.18 g) of cornstarch and 1/4 cup (59 mL) of water into a cup or bowl.",
        "This mixture will create a medium-thick sauce.",
        "If you need a thicker or thinner mixture, you should use slightly more or less cornstarch.",
        "Cornstarch mixes the best with cold water.",
        "It may take some experimentation to create the consistency you desire.",
        "Don’t worry if the mixture is a little too thick.",
        "You can thin it out later with water.",
        "Whisk the mixture.",
        "The sauce may not turn out as good as it could be if you don’t thoroughly combine the water and cornstarch.",
        "Use a whisk to mix the ingredients together.",
        "There shouldn’t be any lumps left when the mixture has been properly combined.",
        "Test the thickness of the cornstarch mixture.",
        "Make sure it’s sufficient for thickening.",
        "You can test it simply by spooning out some of the mixture and pouring it slowly back into the bowl.",
        "Or, you can add it to a small portion of a soup or sauce to see what it does.",
        "Cooking the Mixture Add a cooked cornstarch mixture to liquids for more control.",
        "Cooking the cornstarch first and then adding it to the mixture is an easy way to thicken a sauce or soup if you’ve found that it isn’t thick enough.",
        "Cooking the cornstarch mixture alone isn’t really any different than cooking it with the mixture.",
        "You should essentially follow the same instructions.",
        "The only difference is that you pour the cornstarch mixture into an empty pot and then add it to the liquid after it has started to bubble.",
        "After cooking the cornstarch mixture, add it to a heated up liquid.",
        "You have more control because you can as little or as much mixture to the liquid as you’d like.",
        "Add an uncooked cornstarch mixture to liquids for a quick fix.",
        "This is the easiest and fastest method for thickening a liquid.",
        "It is best to use this method if you know for sure that you need to thicken your liquid.",
        "It is best to add the cornstarch mixture to a liquid that is only a few minutes away from being finished.",
        "Turn the stove to a medium heat setting.",
        "Add the cornstarch mixture to a liquid that has been thoroughly stirred and simmering.",
        "Turn up the setting to a medium heat setting because the cornstarch mixture will thicken the best when it is lightly boiling.",
        "Using too much heat, however, can thin out and break down the sauce.",
        "If you are only cooking the cornstarch mixture, you should pour it in a pan and turn it to medium heat.",
        "Cook until the cornstarch and liquid mixture begins to bubble.",
        "Allow the cornstarch and liquid mixture to lightly boil for 5 or 10 minutes.",
        "After this amount of time, it should begin to bubble and thicken.",
        "Let it cook for longer if it doesn’t appear to have thickened.",
        "Stir the cornstarch and liquid mixture for two more minutes.",
        "Use a stirring utensil, like a wooden spoon, once the cornstarch and liquid mixture begins to bubble.",
        "Stir the cornstarch and liquid for about two more minutes.",
        "This will allow the cornstarch to be completely cooked.",
        "Then, remove the pot from the heat.",
        "Completing the Process Check the consistency of the cornstarch and liquid mixture.",
        "Use a spoon to check the thickness of this mixture.",
        "Allow it a few minutes to cool if you want to do a taste test.",
        "If you are happy with the taste and consistency, then you are done.",
        "If you are not happy with the consistency, then you can thin it out with water or thicken it with more cornstarch.",
        "Thin out the cornstarch and liquid mixture with water.",
        "If you find that the sauce created by the cornstarch and liquid is too thick, you can add some water to thin it out.",
        "Start by adding another 1/4 cup (59 mL) of water.",
        "Taste it and then add more water if needed.",
        "You may need to heat up and stir the mixture again after you add water.",
        "Add more cornstarch to the recipe.",
        "You can add more cornstarch to the sauce if you find that it is not thick enough.",
        "Simply repeat the process, but use slightly less cornstarch and water than you initially used.",
        "Keep in mind that repeating this process too many times can break down the recipe due to the use of heat.",
        "Alter the taste of the recipe if necessary.",
        "Cornstarch is one of the thickening agents that contains the least amount of fat.",
        "Fat often adds flavor to a recipe, so you may find that the recipe is less flavorful than desired after it has been thickened.",
        "If this is the case, add extra seasoning or other ingredients to the recipe to make the flavor more pleasing.",
        "Add seasoning, like salt, in small increments to avoid over-salting or over-seasoning the recipe."
    ]
}