{
    "title": "How to Fade a Beard",
    "url": "https://www.wikihow.com/Fade-a-Beard",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Body Hair",
        "Facial Hair",
        "Beards"
    ],
    "parts": [
        {
            "name": "Thinning Your Beard",
            "steps": [
                {
                    "headline": "Trim your beard to your desired length.",
                    "description": "To start, simply do a routine trimming. Take your shears and trim your beard like you normally would, snipping the ends so the beard is the rough length you want."
                },
                {
                    "headline": "Set your trimmer to a lower setting and trim the bottom beard.",
                    "description": "You should target your beard just below the Adam's apple first. This is where you'll start to fade out the ends of your beard hair. Switch your trimmer to a lower setting than normal, like two or three, and trim the hair from your Adam's apple to neckline."
                },
                {
                    "headline": "Finish off the beard on a two or one setting.",
                    "description": "Reduce the trimmer's setting to one of the lowest settings possible. Trim any remaining bits of beard below the Adam's apple and neckline. This will help finish off the gradient effect. You should also target any thinner areas around your cheeks."
                },
                {
                    "headline": "Tidy up your cheeks.",
                    "description": "Some scraggly hairs are usually left on the cheeks after you trim your beard. Remove the guard from your razor. Use it to remove any loose hairs that fall outside of your beard. You don't need to form a straight line with your razor if you're fading your beard. You just need to remove any hairs that fall far outside your natural beard."
                },
                {
                    "headline": "Trim your mustache.",
                    "description": "Keep your trimmer at the two or one setting. Use it to remove any bits of mustache falling over your lip."
                }
            ]
        },
        {
            "name": "Creating the Fade Effect",
            "steps": [
                {
                    "headline": "Trim the longest section of your beard on the jawline.",
                    "description": "Look at how your beard runs along your jawline. Find the section where the hair is the longest. Set your trimmer to one of the lower settings (i.e., two or three) and start trimming on the longest section."
                },
                {
                    "headline": "Move up an inch (2.5 centimeters) and shorten the trimmers.",
                    "description": "Focus on one side of your face at first. Move upward about an inch from the section where the hair is longest. Then, shorten the trimmer by one or two levels."
                },
                {
                    "headline": "Move up another inch (2.5 centimeters) and shorten the trimmer.",
                    "description": "Continue to move up your beard. After moving up another inch, shorten the trimmer again."
                },
                {
                    "headline": "Continue until you reach your hair.",
                    "description": "Continue the pattern of shortening your trimmer and moving up an inch on your beard. Keep going until your beard meets the hair on your head. This should create a nice, faded effect."
                },
                {
                    "headline": "Repeat on the other side.",
                    "description": "Once one side of your beard is faded, repeat the exact process on the other side. Start on the area where your hair is longest on your jawline. Move the trimmer up an inch, shorten them, and then repeat this pattern until you reach your hair."
                }
            ]
        },
        {
            "name": "Caring for Your Beard",
            "steps": [
                {
                    "headline": "Trim your beard once a week.",
                    "description": "Once your beard is where you want it length-wise, weekly trimming is necessary. This will maintain the faded look and prevent your beard from growing longer than you want."
                },
                {
                    "headline": "Experiment with products until you find one that works for you.",
                    "description": "You should always apply a shaving cream or gel during the shaving process. However, it can take some experimentation to find a gel that works for you and keeps your skin moisturized. Experiment with a variety of products from a local drugstore until you find one that works for you. You can buy travel sized products so you don't end up with too much of a product you dislike. For sensitive skin, gels tend to work better than foams."
                },
                {
                    "headline": "Apply products to wet skin only.",
                    "description": "Before applying any product, such as moisturizer or gel, wet your skin. This helps raise your hairs slightly, which results in a smoother, cleaner shave."
                },
                {
                    "headline": "Moisturize after shaving.",
                    "description": "Shaving can leave skin under your beard dried out. After a shave, apply a facial moisturizer to your face, targeting the skin under the beard especially. It will take some experimentation to find the right moisturizer for you. Try buying a variety of travel-sized moisturizers so you try a small sample of a variety of moisturizers. Gel-based moisturizers tend to work best for very oily skin."
                }
            ]
        }
    ],
    "tyn": [
        "Beard trimmer",
        "Moisturizer",
        "Shaving cream"
    ],
    "text": " Thinning Your Beard Trim your beard to your desired length. To start, simply do a routine trimming. Take your shears and trim your beard like you normally would, snipping the ends so the beard is the rough length you want. Set your trimmer to a lower setting and trim the bottom beard. You should target your beard just below the Adam's apple first. This is where you'll start to fade out the ends of your beard hair. Switch your trimmer to a lower setting than normal, like two or three, and trim the hair from your Adam's apple to neckline. Finish off the beard on a two or one setting. Reduce the trimmer's setting to one of the lowest settings possible. Trim any remaining bits of beard below the Adam's apple and neckline. This will help finish off the gradient effect. You should also target any thinner areas around your cheeks. Tidy up your cheeks. Some scraggly hairs are usually left on the cheeks after you trim your beard. Remove the guard from your razor. Use it to remove any loose hairs that fall outside of your beard. You don't need to form a straight line with your razor if you're fading your beard. You just need to remove any hairs that fall far outside your natural beard. Trim your mustache. Keep your trimmer at the two or one setting. Use it to remove any bits of mustache falling over your lip. Creating the Fade Effect Trim the longest section of your beard on the jawline. Look at how your beard runs along your jawline. Find the section where the hair is the longest. Set your trimmer to one of the lower settings (i.e., two or three) and start trimming on the longest section. Move up an inch (2.5 centimeters) and shorten the trimmers. Focus on one side of your face at first. Move upward about an inch from the section where the hair is longest. Then, shorten the trimmer by one or two levels. Move up another inch (2.5 centimeters) and shorten the trimmer. Continue to move up your beard. After moving up another inch, shorten the trimmer again. Continue until you reach your hair. Continue the pattern of shortening your trimmer and moving up an inch on your beard. Keep going until your beard meets the hair on your head. This should create a nice, faded effect. Repeat on the other side. Once one side of your beard is faded, repeat the exact process on the other side. Start on the area where your hair is longest on your jawline. Move the trimmer up an inch, shorten them, and then repeat this pattern until you reach your hair. Caring for Your Beard Trim your beard once a week. Once your beard is where you want it length-wise, weekly trimming is necessary. This will maintain the faded look and prevent your beard from growing longer than you want. Experiment with products until you find one that works for you. You should always apply a shaving cream or gel during the shaving process. However, it can take some experimentation to find a gel that works for you and keeps your skin moisturized. Experiment with a variety of products from a local drugstore until you find one that works for you. You can buy travel sized products so you don't end up with too much of a product you dislike. For sensitive skin, gels tend to work better than foams. Apply products to wet skin only. Before applying any product, such as moisturizer or gel, wet your skin. This helps raise your hairs slightly, which results in a smoother, cleaner shave. Moisturize after shaving. Shaving can leave skin under your beard dried out. After a shave, apply a facial moisturizer to your face, targeting the skin under the beard especially. It will take some experimentation to find the right moisturizer for you. Try buying a variety of travel-sized moisturizers so you try a small sample of a variety of moisturizers. Gel-based moisturizers tend to work best for very oily skin.",
    "sentences": [
        " Thinning Your Beard Trim your beard to your desired length.",
        "To start, simply do a routine trimming.",
        "Take your shears and trim your beard like you normally would, snipping the ends so the beard is the rough length you want.",
        "Set your trimmer to a lower setting and trim the bottom beard.",
        "You should target your beard just below the Adam's apple first.",
        "This is where you'll start to fade out the ends of your beard hair.",
        "Switch your trimmer to a lower setting than normal, like two or three, and trim the hair from your Adam's apple to neckline.",
        "Finish off the beard on a two or one setting.",
        "Reduce the trimmer's setting to one of the lowest settings possible.",
        "Trim any remaining bits of beard below the Adam's apple and neckline.",
        "This will help finish off the gradient effect.",
        "You should also target any thinner areas around your cheeks.",
        "Tidy up your cheeks.",
        "Some scraggly hairs are usually left on the cheeks after you trim your beard.",
        "Remove the guard from your razor.",
        "Use it to remove any loose hairs that fall outside of your beard.",
        "You don't need to form a straight line with your razor if you're fading your beard.",
        "You just need to remove any hairs that fall far outside your natural beard.",
        "Trim your mustache.",
        "Keep your trimmer at the two or one setting.",
        "Use it to remove any bits of mustache falling over your lip.",
        "Creating the Fade Effect Trim the longest section of your beard on the jawline.",
        "Look at how your beard runs along your jawline.",
        "Find the section where the hair is the longest.",
        "Set your trimmer to one of the lower settings (i.e., two or three) and start trimming on the longest section.",
        "Move up an inch (2.5 centimeters) and shorten the trimmers.",
        "Focus on one side of your face at first.",
        "Move upward about an inch from the section where the hair is longest.",
        "Then, shorten the trimmer by one or two levels.",
        "Move up another inch (2.5 centimeters) and shorten the trimmer.",
        "Continue to move up your beard.",
        "After moving up another inch, shorten the trimmer again.",
        "Continue until you reach your hair.",
        "Continue the pattern of shortening your trimmer and moving up an inch on your beard.",
        "Keep going until your beard meets the hair on your head.",
        "This should create a nice, faded effect.",
        "Repeat on the other side.",
        "Once one side of your beard is faded, repeat the exact process on the other side.",
        "Start on the area where your hair is longest on your jawline.",
        "Move the trimmer up an inch, shorten them, and then repeat this pattern until you reach your hair.",
        "Caring for Your Beard Trim your beard once a week.",
        "Once your beard is where you want it length-wise, weekly trimming is necessary.",
        "This will maintain the faded look and prevent your beard from growing longer than you want.",
        "Experiment with products until you find one that works for you.",
        "You should always apply a shaving cream or gel during the shaving process.",
        "However, it can take some experimentation to find a gel that works for you and keeps your skin moisturized.",
        "Experiment with a variety of products from a local drugstore until you find one that works for you.",
        "You can buy travel sized products so you don't end up with too much of a product you dislike.",
        "For sensitive skin, gels tend to work better than foams.",
        "Apply products to wet skin only.",
        "Before applying any product, such as moisturizer or gel, wet your skin.",
        "This helps raise your hairs slightly, which results in a smoother, cleaner shave.",
        "Moisturize after shaving.",
        "Shaving can leave skin under your beard dried out.",
        "After a shave, apply a facial moisturizer to your face, targeting the skin under the beard especially.",
        "It will take some experimentation to find the right moisturizer for you.",
        "Try buying a variety of travel-sized moisturizers so you try a small sample of a variety of moisturizers.",
        "Gel-based moisturizers tend to work best for very oily skin."
    ]
}