{
    "title": "How to Install a Bathroom Fan",
    "url": "https://www.wikihow.com/Install-a-Bathroom-Fan",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Bathrooms"
    ],
    "methods": [
        {
            "name": "Steps",
            "steps": [
                {
                    "headline": "Determine the correct CFM rating for your bathroom.",
                    "description": "The first thing you need to do when installing a new bathroom fan is determine the CFM rating for your bathroom,  so you can buy the appropriate strength fan. CFM stands for \"Cubic Feet per Minute\" and refers to how much air the fan can move per minute. Small bathrooms will need low CFM fans, while larger bathrooms may require fans with a much higher CFM. To calculate the CFM for your bathroom, multiply the room's cubic footage (length x width x height). For example, if your bathroom measured 120 square feet, you would multiply that by the height of the ceiling (say 8') to get 960. THEN divide by 7.5 to get a CFM rating of 128. You will find the CFM rating of a new fan printed on its box."
                },
                {
                    "headline": "Consider the sound rating of your fan.",
                    "description": "The next thing to consider is the sound rating of your new fan, which is measured in sones. New fans usually have a sound rating somewhere between 0.5 (very quiet) and 6 (very loud) sones. Some people prefer to have very quiet fans, while others value the privacy offered by louder fans, especially in public areas of the home. Like the CFM, the sone ratings of new fans will be printed on the box"
                },
                {
                    "headline": "Choose the location of the fan.",
                    "description": "The location of your bathroom fan is important. It should be installed at the center point between your shower and toilet for optimum ventilation. However, if your bathroom is very large, you may need to install more than one fan. If you are installing a new fan, you will need to consider the layout of your attic, where the bulk of the fan will be located. It should be placed in the the space between two joists, in an area free from any pipes or other obstructions. If you are replacing an old fan, the easiest thing to do is just to put the new fan in same location (unless you have a very good reason for wanting it in a different spot)."
                },
                {
                    "headline": "Gather the required tools.",
                    "description": "Installing a bathroom fan is a manageable DIY project for homeowners with basic carpentry and electrical skills. Before you begin, it's a good idea to have all of the required tools and materials easily at hand. In terms of tools, you will need some basic hand tools such as a screwdriver and a combination pliers, in addition to a power drill and a jigsaw. In terms of materials, you will need a length of flexible duct pipe, a vent cap, screws, caulk and wire nuts. If you're running the duct pip out through the roof you will also need roofing cement, shingles and roofing nails. You will also need a stepladder in order to reach the fan from below, safety goggles and a respirator to wear while drilling, and roof brackets, roof cleats or a safety harness for potential roof work."
                }
            ]
        },
        {
            "name": "Installation",
            "steps": [
                {
                    "headline": "Drill a reference hole and mark the ceiling.",
                    "description": "Take your power drill and use an extra-long, ⁄4 inch (1.9 cm) spade bit to drill a reference hole in the ceiling, where you intend to place the fan. Measure the vent fan housing. Head up to the attic, find the reference hole and clear away the insulation surrounding it. Use the the fan housing measurements to ensure that the fan will fit in the chosen spot, between two joists. Go back to the bathroom and measure the fan's intake port. You will need these dimensions to cut the appropriate sized hole in your ceiling. Use a framing square and pencil to mark the outline of the fan's intake port on the ceiling, using the measurements you just took."
                },
                {
                    "headline": "Cut the intake-port hole.",
                    "description": "Use your jigsaw to cut out the portion of ceiling you just marked. If you don't have a jigsaw, you could also use a reciprocating or drywall saw. Don't let the cut section of ceiling fall to the floor after cutting, as it could pull additional pieces of drywall or plaster with it. Use your free hand to support the rectangular piece of ceiling and gently lower it to the floor. Remember to wear safety goggles and a respirator while sawing through plaster and drywall to protect your eyes and lungs."
                },
                {
                    "headline": "Put the fan in position.",
                    "description": "Before you lower the fan into the hole you just cut, attach a 90 degree duct elbow (to which you will later attach the duct pipe) to the appropriate outlet port using foil duct tape. Insert a cable connector through the removable knockout hole on the side of the fan's housing, then slide the supporting metal brackets into place. Center the fan over the ceiling hole and lower it into place, making sure any connection points are oriented correctly."
                },
                {
                    "headline": "Secure the fan to the joists.",
                    "description": "Once the fan is positioned correctly, extend each of the metal brackets until they reach the joists on either side of the housing unit. Use drywall screws to firmly secure each bracket end to the joist. Now that the fan is secure, take the length of flexible duct pipe and attach one end to the 90 degree duct elbow protruding from fan housing using foil duct tape. Now is also a good time to run an existing or new electrical cable through the connector on the fan housing. You can secure the cable by tightening the screw on the connector. Be aware that you'll need to use a three-wire cable if your new fan includes a light."
                },
                {
                    "headline": "Find a suitable exit point for the duct pipe.",
                    "description": "The next step is to find the shortest, straightest route from the housing fan to the outside. The longer the duct pipe is, the less efficient the fan will be. It is essential to vent the fan exhaust outdoors. Venting it directly into the attic would promote mold growth and potentially cause the rafters to mold. You can run the vent through the sidewall or roof, whichever is most convenient. Just make sure the duct pipe is as straight as possible and that it won't be stretched too tightly."
                },
                {
                    "headline": "Attach the vent cap.",
                    "description": "The process for attaching the vent cap will vary depending on whether the exit point is on the roof or sidewall. If your exit point is on the sidewall, pick a point between two wall studs and take some reference measurements on the inside so you can locate the same point on the outside. Use a 4-inch hole saw to cut through wall from the outside, then secure the vent cap in place. If your exit point is on the roof, draw an appropriate sized circle on the inside and use a reciprocating saw to cut it out. Then get on the roof (taking all of the proper safety precautions) and remove the shingles covering the newly cut hole. Install the vent cap, using roofing cement and roofing nails, then replace any loose shingles. Move back into the attic and attach the end of the duct pipe to the vent cap's connector duct using foil duct tape."
                },
                {
                    "headline": "Wire the connections in the housing unit.",
                    "description": "Depending on the type of fan, you may need to wire the connections from the attic or from the bathroom. Make sure to read the manufacturer's instructions and double check that the power is off before proceeding. Open up the housing unit and pull out the fan wires from the electrical splice unit. Strip ⁄8 inch (1.6 cm) back from each of the wires on both the fan cable and the electrical cable you inserted earlier. Twist the same color wires together (usually white to white and black or red to black) and add the connectors. Wrap the bare copper wire around the green grounding clip or screw and tighten to secure. Place the wires back in the electrical splice unit and reattach the cover. If you don't feel confident about doing the wiring yourself, don't hesitate to call in a licensed electrician to install the fan or simply inspect your work when you're done. Also be aware that aluminum (rather than copper) wiring requires special handling and any electrical work involving this type of wiring should be undertaken by a professional."
                },
                {
                    "headline": "Attach the grille.",
                    "description": "Now you're almost finished. Plug the blower motor into the electrical receptacle and secure it with the screws provided. Install the decorative plastic grille by slipping its mounting wires into the available slots in the housing unit. Make sure it sits snugly against the ceiling -- spread the mounting wires a little to create more tension, if necessary. Turn the power back on and test your new bathroom fan to make sure it's working."
                }
            ]
        },
        {
            "name": "Replacement",
            "steps": [
                {
                    "headline": "Turn off the power.",
                    "description": "Before you begin, you will need to turn off the power to the fan from the circuit breaker box."
                },
                {
                    "headline": "Unplug the motor and disconnect the wiring.",
                    "description": "Put on a pair of gloves, safety goggles and a respirator and remove the grille covering from the old fan. You may be shocked at the amount of dirt and debris that fall out of it! Unscrew or unplug the motor blower assembly from the housing unit, then open up the electrical splice unit and carefully pull out the wires. Remove the connectors and untwist the wires to disconnect them. It's a good idea to double check that power to the wires is off before doing this. Loosen the cable clamp to free the electrical cable from the fan housing."
                },
                {
                    "headline": "Go to the attic and remove the housing.",
                    "description": "In the attic, detach the duct pipe from both the housing unit and the vent cap connector duct. Pull the electrical cable and wiring free from the housing unit. Use a power drill to remove the screws securing the old fan's brackets to the joists, then lift the old fan from the ceiling."
                },
                {
                    "headline": "Install the new fan.",
                    "description": "Head back down to your bathroom and remove the new fan from its packaging. If it has the same measurements as your old fan, you will be able to install it immediately. But if the new fan is bigger than the old one, you will need to enlarge the hole in your ceiling. You can do this by tracing the outline of your new fan onto the ceiling, then  cutting around the outline with a drywall saw. If your new fan is smaller than the old one, you can caulk around the edges of the housing unit to fill in any gaps once the fan is installed. Go to the attic and lower the new fan into the preexisting or newly enlarged hole. Make sure the unit is properly oriented for all electrical and duct work connections. Slide out the extendable mounting brackets and secure them to the joists using your power drill and 1 inch (2.5 cm) drywall screws. You may need a helper to hold the fan in place from below as you do this."
                },
                {
                    "headline": "Attach the duct.",
                    "description": "Once the fan is in place, connect a 90 degree duct elbow to the fan's exhaust port using sheet metal screws. Then attach a new 4 to 6 inch (10.2 to 15.2 cm) duct pipe to the duct elbow. It is possible to use the duct pipe from the old fan, but if it is less than 4 inches (10.2 cm) in diameter you will need to install a duct pipe reducer before reattaching the pipe. However be aware that using a smaller, older duct pipe will prevent the fan from working as efficiently."
                },
                {
                    "headline": "Connect the wiring.",
                    "description": "Insert the electrical cable through the new fans connector and secure it with a cable clamp. Open up the electrical splice box (from either the attic or the bathroom, depending on the model) and pull out the fan wires. Attach the electrical wires to the fan wires by twisting same color wires together (white to white and black or red to black) and attaching a wire connector. Wrap the bare copper wire under the ground clip or screw and tighten to secure. Tuck all of the wires back into the electrical splice box and replace the cover."
                },
                {
                    "headline": "Complete the outdoor work.",
                    "description": "If you replaced your old duct pipe with a newer, bigger pipe, you will also need to install a larger vent cap on your roof or sidewall. Take whatever safety precautions are necessary for working at a height. Remove the old vent cap and use a saw to enlarge the opening to the size of the new duct pipe. Pull the end of the duct pipe through the hole until ⁄4 inch (1.9 cm) extends beyond the edge of the roof or sidewall. Secure in place with sheet metal screws and seal around the edges with caulk. Secure the new vent cap over the end of the duct pipe. If the vent pipe is on the roof, replace any shingles that may have come loose."
                },
                {
                    "headline": "Attach the grille.",
                    "description": "Return to the bathroom and install the motor blower assembly by plugging it into the receptacle and screwing to secure. Attach the decorative plastic grille, then turn the power back on to test if your new bathroom fan is working."
                }
            ]
        }
    ],
    "tyn": [
        "Bathroom fan.",
        "Drywall saw or rotary saw",
        "Electrical supplies (wire, boxes, housing clamps, etc.)",
        "Exhaust duct (for new installs)",
        "Razor knife",
        "Green board or drywall",
        "Drywall tape",
        "Joint compound",
        "Masking tape",
        "Light bulbs for light/bathroom fan.",
        "Stepladder (non-conductive if possible)",
        "Power Cut-Off"
    ],
    "text": " Steps Determine the correct CFM rating for your bathroom. The first thing you need to do when installing a new bathroom fan is determine the CFM rating for your bathroom,  so you can buy the appropriate strength fan. CFM stands for \"Cubic Feet per Minute\" and refers to how much air the fan can move per minute. Small bathrooms will need low CFM fans, while larger bathrooms may require fans with a much higher CFM. To calculate the CFM for your bathroom, multiply the room's cubic footage (length x width x height). For example, if your bathroom measured 120 square feet, you would multiply that by the height of the ceiling (say 8') to get 960. THEN divide by 7.5 to get a CFM rating of 128. You will find the CFM rating of a new fan printed on its box. Consider the sound rating of your fan. The next thing to consider is the sound rating of your new fan, which is measured in sones. New fans usually have a sound rating somewhere between 0.5 (very quiet) and 6 (very loud) sones. Some people prefer to have very quiet fans, while others value the privacy offered by louder fans, especially in public areas of the home. Like the CFM, the sone ratings of new fans will be printed on the box Choose the location of the fan. The location of your bathroom fan is important. It should be installed at the center point between your shower and toilet for optimum ventilation. However, if your bathroom is very large, you may need to install more than one fan. If you are installing a new fan, you will need to consider the layout of your attic, where the bulk of the fan will be located. It should be placed in the the space between two joists, in an area free from any pipes or other obstructions. If you are replacing an old fan, the easiest thing to do is just to put the new fan in same location (unless you have a very good reason for wanting it in a different spot). Gather the required tools. Installing a bathroom fan is a manageable DIY project for homeowners with basic carpentry and electrical skills. Before you begin, it's a good idea to have all of the required tools and materials easily at hand. In terms of tools, you will need some basic hand tools such as a screwdriver and a combination pliers, in addition to a power drill and a jigsaw. In terms of materials, you will need a length of flexible duct pipe, a vent cap, screws, caulk and wire nuts. If you're running the duct pip out through the roof you will also need roofing cement, shingles and roofing nails. You will also need a stepladder in order to reach the fan from below, safety goggles and a respirator to wear while drilling, and roof brackets, roof cleats or a safety harness for potential roof work. Installation Drill a reference hole and mark the ceiling. Take your power drill and use an extra-long, ⁄4 inch (1.9 cm) spade bit to drill a reference hole in the ceiling, where you intend to place the fan. Measure the vent fan housing. Head up to the attic, find the reference hole and clear away the insulation surrounding it. Use the the fan housing measurements to ensure that the fan will fit in the chosen spot, between two joists. Go back to the bathroom and measure the fan's intake port. You will need these dimensions to cut the appropriate sized hole in your ceiling. Use a framing square and pencil to mark the outline of the fan's intake port on the ceiling, using the measurements you just took. Cut the intake-port hole. Use your jigsaw to cut out the portion of ceiling you just marked. If you don't have a jigsaw, you could also use a reciprocating or drywall saw. Don't let the cut section of ceiling fall to the floor after cutting, as it could pull additional pieces of drywall or plaster with it. Use your free hand to support the rectangular piece of ceiling and gently lower it to the floor. Remember to wear safety goggles and a respirator while sawing through plaster and drywall to protect your eyes and lungs. Put the fan in position. Before you lower the fan into the hole you just cut, attach a 90 degree duct elbow (to which you will later attach the duct pipe) to the appropriate outlet port using foil duct tape. Insert a cable connector through the removable knockout hole on the side of the fan's housing, then slide the supporting metal brackets into place. Center the fan over the ceiling hole and lower it into place, making sure any connection points are oriented correctly. Secure the fan to the joists. Once the fan is positioned correctly, extend each of the metal brackets until they reach the joists on either side of the housing unit. Use drywall screws to firmly secure each bracket end to the joist. Now that the fan is secure, take the length of flexible duct pipe and attach one end to the 90 degree duct elbow protruding from fan housing using foil duct tape. Now is also a good time to run an existing or new electrical cable through the connector on the fan housing. You can secure the cable by tightening the screw on the connector. Be aware that you'll need to use a three-wire cable if your new fan includes a light. Find a suitable exit point for the duct pipe. The next step is to find the shortest, straightest route from the housing fan to the outside. The longer the duct pipe is, the less efficient the fan will be. It is essential to vent the fan exhaust outdoors. Venting it directly into the attic would promote mold growth and potentially cause the rafters to mold. You can run the vent through the sidewall or roof, whichever is most convenient. Just make sure the duct pipe is as straight as possible and that it won't be stretched too tightly. Attach the vent cap. The process for attaching the vent cap will vary depending on whether the exit point is on the roof or sidewall. If your exit point is on the sidewall, pick a point between two wall studs and take some reference measurements on the inside so you can locate the same point on the outside. Use a 4-inch hole saw to cut through wall from the outside, then secure the vent cap in place. If your exit point is on the roof, draw an appropriate sized circle on the inside and use a reciprocating saw to cut it out. Then get on the roof (taking all of the proper safety precautions) and remove the shingles covering the newly cut hole. Install the vent cap, using roofing cement and roofing nails, then replace any loose shingles. Move back into the attic and attach the end of the duct pipe to the vent cap's connector duct using foil duct tape. Wire the connections in the housing unit. Depending on the type of fan, you may need to wire the connections from the attic or from the bathroom. Make sure to read the manufacturer's instructions and double check that the power is off before proceeding. Open up the housing unit and pull out the fan wires from the electrical splice unit. Strip ⁄8 inch (1.6 cm) back from each of the wires on both the fan cable and the electrical cable you inserted earlier. Twist the same color wires together (usually white to white and black or red to black) and add the connectors. Wrap the bare copper wire around the green grounding clip or screw and tighten to secure. Place the wires back in the electrical splice unit and reattach the cover. If you don't feel confident about doing the wiring yourself, don't hesitate to call in a licensed electrician to install the fan or simply inspect your work when you're done. Also be aware that aluminum (rather than copper) wiring requires special handling and any electrical work involving this type of wiring should be undertaken by a professional. Attach the grille. Now you're almost finished. Plug the blower motor into the electrical receptacle and secure it with the screws provided. Install the decorative plastic grille by slipping its mounting wires into the available slots in the housing unit. Make sure it sits snugly against the ceiling -- spread the mounting wires a little to create more tension, if necessary. Turn the power back on and test your new bathroom fan to make sure it's working. Replacement Turn off the power. Before you begin, you will need to turn off the power to the fan from the circuit breaker box. Unplug the motor and disconnect the wiring. Put on a pair of gloves, safety goggles and a respirator and remove the grille covering from the old fan. You may be shocked at the amount of dirt and debris that fall out of it! Unscrew or unplug the motor blower assembly from the housing unit, then open up the electrical splice unit and carefully pull out the wires. Remove the connectors and untwist the wires to disconnect them. It's a good idea to double check that power to the wires is off before doing this. Loosen the cable clamp to free the electrical cable from the fan housing. Go to the attic and remove the housing. In the attic, detach the duct pipe from both the housing unit and the vent cap connector duct. Pull the electrical cable and wiring free from the housing unit. Use a power drill to remove the screws securing the old fan's brackets to the joists, then lift the old fan from the ceiling. Install the new fan. Head back down to your bathroom and remove the new fan from its packaging. If it has the same measurements as your old fan, you will be able to install it immediately. But if the new fan is bigger than the old one, you will need to enlarge the hole in your ceiling. You can do this by tracing the outline of your new fan onto the ceiling, then  cutting around the outline with a drywall saw. If your new fan is smaller than the old one, you can caulk around the edges of the housing unit to fill in any gaps once the fan is installed. Go to the attic and lower the new fan into the preexisting or newly enlarged hole. Make sure the unit is properly oriented for all electrical and duct work connections. Slide out the extendable mounting brackets and secure them to the joists using your power drill and 1 inch (2.5 cm) drywall screws. You may need a helper to hold the fan in place from below as you do this. Attach the duct. Once the fan is in place, connect a 90 degree duct elbow to the fan's exhaust port using sheet metal screws. Then attach a new 4 to 6 inch (10.2 to 15.2 cm) duct pipe to the duct elbow. It is possible to use the duct pipe from the old fan, but if it is less than 4 inches (10.2 cm) in diameter you will need to install a duct pipe reducer before reattaching the pipe. However be aware that using a smaller, older duct pipe will prevent the fan from working as efficiently. Connect the wiring. Insert the electrical cable through the new fans connector and secure it with a cable clamp. Open up the electrical splice box (from either the attic or the bathroom, depending on the model) and pull out the fan wires. Attach the electrical wires to the fan wires by twisting same color wires together (white to white and black or red to black) and attaching a wire connector. Wrap the bare copper wire under the ground clip or screw and tighten to secure. Tuck all of the wires back into the electrical splice box and replace the cover. Complete the outdoor work. If you replaced your old duct pipe with a newer, bigger pipe, you will also need to install a larger vent cap on your roof or sidewall. Take whatever safety precautions are necessary for working at a height. Remove the old vent cap and use a saw to enlarge the opening to the size of the new duct pipe. Pull the end of the duct pipe through the hole until ⁄4 inch (1.9 cm) extends beyond the edge of the roof or sidewall. Secure in place with sheet metal screws and seal around the edges with caulk. Secure the new vent cap over the end of the duct pipe. If the vent pipe is on the roof, replace any shingles that may have come loose. Attach the grille. Return to the bathroom and install the motor blower assembly by plugging it into the receptacle and screwing to secure. Attach the decorative plastic grille, then turn the power back on to test if your new bathroom fan is working.",
    "sentences": [
        " Steps Determine the correct CFM rating for your bathroom.",
        "The first thing you need to do when installing a new bathroom fan is determine the CFM rating for your bathroom,  so you can buy the appropriate strength fan.",
        "CFM stands for \"Cubic Feet per Minute\" and refers to how much air the fan can move per minute.",
        "Small bathrooms will need low CFM fans, while larger bathrooms may require fans with a much higher CFM.",
        "To calculate the CFM for your bathroom, multiply the room's cubic footage (length x width x height).",
        "For example, if your bathroom measured 120 square feet, you would multiply that by the height of the ceiling (say 8') to get 960.",
        "THEN divide by 7.5 to get a CFM rating of 128.",
        "You will find the CFM rating of a new fan printed on its box.",
        "Consider the sound rating of your fan.",
        "The next thing to consider is the sound rating of your new fan, which is measured in sones.",
        "New fans usually have a sound rating somewhere between 0.5 (very quiet) and 6 (very loud) sones.",
        "Some people prefer to have very quiet fans, while others value the privacy offered by louder fans, especially in public areas of the home.",
        "Like the CFM, the sone ratings of new fans will be printed on the box Choose the location of the fan.",
        "The location of your bathroom fan is important.",
        "It should be installed at the center point between your shower and toilet for optimum ventilation.",
        "However, if your bathroom is very large, you may need to install more than one fan.",
        "If you are installing a new fan, you will need to consider the layout of your attic, where the bulk of the fan will be located.",
        "It should be placed in the the space between two joists, in an area free from any pipes or other obstructions.",
        "If you are replacing an old fan, the easiest thing to do is just to put the new fan in same location (unless you have a very good reason for wanting it in a different spot).",
        "Gather the required tools.",
        "Installing a bathroom fan is a manageable DIY project for homeowners with basic carpentry and electrical skills.",
        "Before you begin, it's a good idea to have all of the required tools and materials easily at hand.",
        "In terms of tools, you will need some basic hand tools such as a screwdriver and a combination pliers, in addition to a power drill and a jigsaw.",
        "In terms of materials, you will need a length of flexible duct pipe, a vent cap, screws, caulk and wire nuts.",
        "If you're running the duct pip out through the roof you will also need roofing cement, shingles and roofing nails.",
        "You will also need a stepladder in order to reach the fan from below, safety goggles and a respirator to wear while drilling, and roof brackets, roof cleats or a safety harness for potential roof work.",
        "Installation Drill a reference hole and mark the ceiling.",
        "Take your power drill and use an extra-long, ⁄4 inch (1.9 cm) spade bit to drill a reference hole in the ceiling, where you intend to place the fan.",
        "Measure the vent fan housing.",
        "Head up to the attic, find the reference hole and clear away the insulation surrounding it.",
        "Use the the fan housing measurements to ensure that the fan will fit in the chosen spot, between two joists.",
        "Go back to the bathroom and measure the fan's intake port.",
        "You will need these dimensions to cut the appropriate sized hole in your ceiling.",
        "Use a framing square and pencil to mark the outline of the fan's intake port on the ceiling, using the measurements you just took.",
        "Cut the intake-port hole.",
        "Use your jigsaw to cut out the portion of ceiling you just marked.",
        "If you don't have a jigsaw, you could also use a reciprocating or drywall saw.",
        "Don't let the cut section of ceiling fall to the floor after cutting, as it could pull additional pieces of drywall or plaster with it.",
        "Use your free hand to support the rectangular piece of ceiling and gently lower it to the floor.",
        "Remember to wear safety goggles and a respirator while sawing through plaster and drywall to protect your eyes and lungs.",
        "Put the fan in position.",
        "Before you lower the fan into the hole you just cut, attach a 90 degree duct elbow (to which you will later attach the duct pipe) to the appropriate outlet port using foil duct tape.",
        "Insert a cable connector through the removable knockout hole on the side of the fan's housing, then slide the supporting metal brackets into place.",
        "Center the fan over the ceiling hole and lower it into place, making sure any connection points are oriented correctly.",
        "Secure the fan to the joists.",
        "Once the fan is positioned correctly, extend each of the metal brackets until they reach the joists on either side of the housing unit.",
        "Use drywall screws to firmly secure each bracket end to the joist.",
        "Now that the fan is secure, take the length of flexible duct pipe and attach one end to the 90 degree duct elbow protruding from fan housing using foil duct tape.",
        "Now is also a good time to run an existing or new electrical cable through the connector on the fan housing.",
        "You can secure the cable by tightening the screw on the connector.",
        "Be aware that you'll need to use a three-wire cable if your new fan includes a light.",
        "Find a suitable exit point for the duct pipe.",
        "The next step is to find the shortest, straightest route from the housing fan to the outside.",
        "The longer the duct pipe is, the less efficient the fan will be.",
        "It is essential to vent the fan exhaust outdoors.",
        "Venting it directly into the attic would promote mold growth and potentially cause the rafters to mold.",
        "You can run the vent through the sidewall or roof, whichever is most convenient.",
        "Just make sure the duct pipe is as straight as possible and that it won't be stretched too tightly.",
        "Attach the vent cap.",
        "The process for attaching the vent cap will vary depending on whether the exit point is on the roof or sidewall.",
        "If your exit point is on the sidewall, pick a point between two wall studs and take some reference measurements on the inside so you can locate the same point on the outside.",
        "Use a 4-inch hole saw to cut through wall from the outside, then secure the vent cap in place.",
        "If your exit point is on the roof, draw an appropriate sized circle on the inside and use a reciprocating saw to cut it out.",
        "Then get on the roof (taking all of the proper safety precautions) and remove the shingles covering the newly cut hole.",
        "Install the vent cap, using roofing cement and roofing nails, then replace any loose shingles.",
        "Move back into the attic and attach the end of the duct pipe to the vent cap's connector duct using foil duct tape.",
        "Wire the connections in the housing unit.",
        "Depending on the type of fan, you may need to wire the connections from the attic or from the bathroom.",
        "Make sure to read the manufacturer's instructions and double check that the power is off before proceeding.",
        "Open up the housing unit and pull out the fan wires from the electrical splice unit.",
        "Strip ⁄8 inch (1.6 cm) back from each of the wires on both the fan cable and the electrical cable you inserted earlier.",
        "Twist the same color wires together (usually white to white and black or red to black) and add the connectors.",
        "Wrap the bare copper wire around the green grounding clip or screw and tighten to secure.",
        "Place the wires back in the electrical splice unit and reattach the cover.",
        "If you don't feel confident about doing the wiring yourself, don't hesitate to call in a licensed electrician to install the fan or simply inspect your work when you're done.",
        "Also be aware that aluminum (rather than copper) wiring requires special handling and any electrical work involving this type of wiring should be undertaken by a professional.",
        "Attach the grille.",
        "Now you're almost finished.",
        "Plug the blower motor into the electrical receptacle and secure it with the screws provided.",
        "Install the decorative plastic grille by slipping its mounting wires into the available slots in the housing unit.",
        "Make sure it sits snugly against the ceiling -- spread the mounting wires a little to create more tension, if necessary.",
        "Turn the power back on and test your new bathroom fan to make sure it's working.",
        "Replacement Turn off the power.",
        "Before you begin, you will need to turn off the power to the fan from the circuit breaker box.",
        "Unplug the motor and disconnect the wiring.",
        "Put on a pair of gloves, safety goggles and a respirator and remove the grille covering from the old fan.",
        "You may be shocked at the amount of dirt and debris that fall out of it!",
        "Unscrew or unplug the motor blower assembly from the housing unit, then open up the electrical splice unit and carefully pull out the wires.",
        "Remove the connectors and untwist the wires to disconnect them.",
        "It's a good idea to double check that power to the wires is off before doing this.",
        "Loosen the cable clamp to free the electrical cable from the fan housing.",
        "Go to the attic and remove the housing.",
        "In the attic, detach the duct pipe from both the housing unit and the vent cap connector duct.",
        "Pull the electrical cable and wiring free from the housing unit.",
        "Use a power drill to remove the screws securing the old fan's brackets to the joists, then lift the old fan from the ceiling.",
        "Install the new fan.",
        "Head back down to your bathroom and remove the new fan from its packaging.",
        "If it has the same measurements as your old fan, you will be able to install it immediately.",
        "But if the new fan is bigger than the old one, you will need to enlarge the hole in your ceiling.",
        "You can do this by tracing the outline of your new fan onto the ceiling, then  cutting around the outline with a drywall saw.",
        "If your new fan is smaller than the old one, you can caulk around the edges of the housing unit to fill in any gaps once the fan is installed.",
        "Go to the attic and lower the new fan into the preexisting or newly enlarged hole.",
        "Make sure the unit is properly oriented for all electrical and duct work connections.",
        "Slide out the extendable mounting brackets and secure them to the joists using your power drill and 1 inch (2.5 cm) drywall screws.",
        "You may need a helper to hold the fan in place from below as you do this.",
        "Attach the duct.",
        "Once the fan is in place, connect a 90 degree duct elbow to the fan's exhaust port using sheet metal screws.",
        "Then attach a new 4 to 6 inch (10.2 to 15.2 cm) duct pipe to the duct elbow.",
        "It is possible to use the duct pipe from the old fan, but if it is less than 4 inches (10.2 cm) in diameter you will need to install a duct pipe reducer before reattaching the pipe.",
        "However be aware that using a smaller, older duct pipe will prevent the fan from working as efficiently.",
        "Connect the wiring.",
        "Insert the electrical cable through the new fans connector and secure it with a cable clamp.",
        "Open up the electrical splice box (from either the attic or the bathroom, depending on the model) and pull out the fan wires.",
        "Attach the electrical wires to the fan wires by twisting same color wires together (white to white and black or red to black) and attaching a wire connector.",
        "Wrap the bare copper wire under the ground clip or screw and tighten to secure.",
        "Tuck all of the wires back into the electrical splice box and replace the cover.",
        "Complete the outdoor work.",
        "If you replaced your old duct pipe with a newer, bigger pipe, you will also need to install a larger vent cap on your roof or sidewall.",
        "Take whatever safety precautions are necessary for working at a height.",
        "Remove the old vent cap and use a saw to enlarge the opening to the size of the new duct pipe.",
        "Pull the end of the duct pipe through the hole until ⁄4 inch (1.9 cm) extends beyond the edge of the roof or sidewall.",
        "Secure in place with sheet metal screws and seal around the edges with caulk.",
        "Secure the new vent cap over the end of the duct pipe.",
        "If the vent pipe is on the roof, replace any shingles that may have come loose.",
        "Attach the grille.",
        "Return to the bathroom and install the motor blower assembly by plugging it into the receptacle and screwing to secure.",
        "Attach the decorative plastic grille, then turn the power back on to test if your new bathroom fan is working."
    ]
}