{
    "title": "How to Beat Boredom at the Beach",
    "url": "https://www.wikihow.com/Beat-Boredom-at-the-Beach",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Fun Activities",
        "Boredom Busters",
        "Seasonal and Holiday Boredom"
    ],
    "steps": [
        {
            "headline": "Go for a paddle or take a swim in the sea, if it is warn enough and safe to do so.",
            "description": "Check the flag/s to see if it is safe first and check you are allowed to swim where you are in the beach. Remember swimming in the sea is not same as swimming in a pool so if you're not a confident swimmer, make sure you don't put yourself in danger. Go into the sea in a group and at a deep enough point, see who can tread water the longest. See if you can spot any sea creatures. Practice all the swimming strokes you know. Have swimming races."
        },
        {
            "headline": "Make sandcastles.",
            "description": "You are never too old to make sandcastles. You can have fun making moats and decorating it with shells. You could even knock it over afterwards just for the fun of it. You can make a whole sand village if you are feeling ambitious. Imagine people with different personalities in each house and create rooms for them to live in."
        },
        {
            "headline": "Read a book or magazine.",
            "description": "If you took along some reading material you can find a place on the beach to sit and read. Beach themed books are great, as you can almost see, hear and feel the story. You can write a story based on your surroundings. Find something that inspires you."
        },
        {
            "headline": "Collect shells and other washed up objects.",
            "description": "Find the most interesting shells, china pieces, fossils, driftwood and glass fragments. Keep your eyes open for messages in bottles, or maybe just the odd coin a fellow beach goer has dropped. Finders keepers if it's less than a buck! Start a special collection of interesting items that you find at the beach. Have a challenge against your siblings/friends to see who can collect the most interesting object on the beach."
        },
        {
            "headline": "Stack stones.",
            "description": "If you are on a stony beach you can stack stones, arrange them into patterns or pictures or sort them into groups of size, shape or colour. See how tall you can stack your tower before it falls."
        },
        {
            "headline": "Take photos.",
            "description": "At the beach you'll find lots of interesting things to take a photo of. Take pictures for the memories. You can print them our and make a scrapbook of them. If you have a drone you could fly it over the sea and take some nice photos in the air."
        },
        {
            "headline": "Play a game.",
            "description": "There are many good games. Tig and tag\nVolleyball\nFootball\nI spy\nSharks and seaweed\nShark attack\nHave a brainstorming session. Your friends could create a great game!"
        },
        {
            "headline": "Play with your dog if you have one.",
            "description": "Just make sure they don't run wild."
        },
        {
            "headline": "Fly a kite if there's enough wind.",
            "description": "It may sound dull but it actually can be very fascinating to look at. Make sure you don't let go of it or it may fly away."
        },
        {
            "headline": "Have a picnic.",
            "description": "Watch out for seagulls though. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/d\\/d4\\/Picnic-basket.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/d\\/d4\\/Picnic-basket.jpg\",\"smallWidth\":460,\"smallHeight\":389,\"bigWidth\":760,\"bigHeight\":643.0769230769231,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
            "headline": "Climb up rocks.",
            "description": "If you know for definite it is safe why not? Do not climb up them if they are slippery or very high; it is better to be safe than sorry."
        },
        {
            "headline": "Count the gulls.",
            "description": "You probably didn't give it that much thought but why not find out how many there are and what different types you can see? You can give them names too. See if any seagulls are doing anything amusing like fighting over some food."
        },
        {
            "headline": "Explore any rock pools.",
            "description": "Look for star fish, sea urchins, crabs and other creatures in the shallow pools amongst the rocks. Draw them and observe them, then put them back in their homes."
        },
        {
            "headline": "Write and draw in the sand.",
            "description": "You can just doodle with a stick, or your toe, draw a picture or write you first name in the sand. You can add some shells or stones to your art as well."
        },
        {
            "headline": "Dig a hole in the sand.",
            "description": "It works best when the sand is wet as the water will come through, making a little puddle. You don't need a spade you can use your hands or a stick. Watch the water slowly sway from side to side and relax."
        },
        {
            "headline": "Send out a message in a bottle.",
            "description": "It can be a great activity to do with friends and you might even get a reply!"
        },
        {
            "headline": "Fish or forage for edible seaweed and sea food.",
            "description": "If fishing is permitted at the beach you are on, try casting your rod. You can also look for shell fish or edible seaweed, just don't more than is permitted."
        },
        {
            "headline": "Try a beach spa.",
            "description": "Damp sand makes a great foot scrub. Use a moisturising sun lotion, towel dry your hair after swimming in the sea for the authentic beach-hair look. Work on your tan, taking sensible precautions."
        },
        {
            "headline": "Look around you at your surroundings.",
            "description": "See what you can see at the beach. There may be an event on such as a treasure hunt you can join in with. A group might be picking up litter or doing a research project you can join in with - talk to people your age, you might make some new friends."
        }
    ],
    "tyn": [
        "Reading material",
        "Kite",
        "Picnic",
        "Bucket and spade",
        "Camera",
        "Ball / beach ball"
    ],
    "text": " Go for a paddle or take a swim in the sea, if it is warn enough and safe to do so. Check the flag/s to see if it is safe first and check you are allowed to swim where you are in the beach. Remember swimming in the sea is not same as swimming in a pool so if you're not a confident swimmer, make sure you don't put yourself in danger. Go into the sea in a group and at a deep enough point, see who can tread water the longest. See if you can spot any sea creatures. Practice all the swimming strokes you know. Have swimming races. Make sandcastles. You are never too old to make sandcastles. You can have fun making moats and decorating it with shells. You could even knock it over afterwards just for the fun of it. You can make a whole sand village if you are feeling ambitious. Imagine people with different personalities in each house and create rooms for them to live in. Read a book or magazine. If you took along some reading material you can find a place on the beach to sit and read. Beach themed books are great, as you can almost see, hear and feel the story. You can write a story based on your surroundings. Find something that inspires you. Collect shells and other washed up objects. Find the most interesting shells, china pieces, fossils, driftwood and glass fragments. Keep your eyes open for messages in bottles, or maybe just the odd coin a fellow beach goer has dropped. Finders keepers if it's less than a buck! Start a special collection of interesting items that you find at the beach. Have a challenge against your siblings/friends to see who can collect the most interesting object on the beach. Stack stones. If you are on a stony beach you can stack stones, arrange them into patterns or pictures or sort them into groups of size, shape or colour. See how tall you can stack your tower before it falls. Take photos. At the beach you'll find lots of interesting things to take a photo of. Take pictures for the memories. You can print them our and make a scrapbook of them. If you have a drone you could fly it over the sea and take some nice photos in the air. Play a game. There are many good games. Tig and tag\nVolleyball\nFootball\nI spy\nSharks and seaweed\nShark attack\nHave a brainstorming session. Your friends could create a great game! Play with your dog if you have one. Just make sure they don't run wild. Fly a kite if there's enough wind. It may sound dull but it actually can be very fascinating to look at. Make sure you don't let go of it or it may fly away. Have a picnic. Watch out for seagulls though. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/d\\/d4\\/Picnic-basket.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/d\\/d4\\/Picnic-basket.jpg\",\"smallWidth\":460,\"smallHeight\":389,\"bigWidth\":760,\"bigHeight\":643.0769230769231,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Climb up rocks. If you know for definite it is safe why not? Do not climb up them if they are slippery or very high; it is better to be safe than sorry. Count the gulls. You probably didn't give it that much thought but why not find out how many there are and what different types you can see? You can give them names too. See if any seagulls are doing anything amusing like fighting over some food. Explore any rock pools. Look for star fish, sea urchins, crabs and other creatures in the shallow pools amongst the rocks. Draw them and observe them, then put them back in their homes. Write and draw in the sand. You can just doodle with a stick, or your toe, draw a picture or write you first name in the sand. You can add some shells or stones to your art as well. Dig a hole in the sand. It works best when the sand is wet as the water will come through, making a little puddle. You don't need a spade you can use your hands or a stick. Watch the water slowly sway from side to side and relax. Send out a message in a bottle. It can be a great activity to do with friends and you might even get a reply! Fish or forage for edible seaweed and sea food. If fishing is permitted at the beach you are on, try casting your rod. You can also look for shell fish or edible seaweed, just don't more than is permitted. Try a beach spa. Damp sand makes a great foot scrub. Use a moisturising sun lotion, towel dry your hair after swimming in the sea for the authentic beach-hair look. Work on your tan, taking sensible precautions. Look around you at your surroundings. See what you can see at the beach. There may be an event on such as a treasure hunt you can join in with. A group might be picking up litter or doing a research project you can join in with - talk to people your age, you might make some new friends.",
    "sentences": [
        " Go for a paddle or take a swim in the sea, if it is warn enough and safe to do so.",
        "Check the flag/s to see if it is safe first and check you are allowed to swim where you are in the beach.",
        "Remember swimming in the sea is not same as swimming in a pool so if you're not a confident swimmer, make sure you don't put yourself in danger.",
        "Go into the sea in a group and at a deep enough point, see who can tread water the longest.",
        "See if you can spot any sea creatures.",
        "Practice all the swimming strokes you know.",
        "Have swimming races.",
        "Make sandcastles.",
        "You are never too old to make sandcastles.",
        "You can have fun making moats and decorating it with shells.",
        "You could even knock it over afterwards just for the fun of it.",
        "You can make a whole sand village if you are feeling ambitious.",
        "Imagine people with different personalities in each house and create rooms for them to live in.",
        "Read a book or magazine.",
        "If you took along some reading material you can find a place on the beach to sit and read.",
        "Beach themed books are great, as you can almost see, hear and feel the story.",
        "You can write a story based on your surroundings.",
        "Find something that inspires you.",
        "Collect shells and other washed up objects.",
        "Find the most interesting shells, china pieces, fossils, driftwood and glass fragments.",
        "Keep your eyes open for messages in bottles, or maybe just the odd coin a fellow beach goer has dropped.",
        "Finders keepers if it's less than a buck!",
        "Start a special collection of interesting items that you find at the beach.",
        "Have a challenge against your siblings/friends to see who can collect the most interesting object on the beach.",
        "Stack stones.",
        "If you are on a stony beach you can stack stones, arrange them into patterns or pictures or sort them into groups of size, shape or colour.",
        "See how tall you can stack your tower before it falls.",
        "Take photos.",
        "At the beach you'll find lots of interesting things to take a photo of.",
        "Take pictures for the memories.",
        "You can print them our and make a scrapbook of them.",
        "If you have a drone you could fly it over the sea and take some nice photos in the air.",
        "Play a game.",
        "There are many good games.",
        "Tig and tag\nVolleyball\nFootball\nI spy\nSharks and seaweed\nShark attack\nHave a brainstorming session.",
        "Your friends could create a great game!",
        "Play with your dog if you have one.",
        "Just make sure they don't run wild.",
        "Fly a kite if there's enough wind.",
        "It may sound dull but it actually can be very fascinating to look at.",
        "Make sure you don't let go of it or it may fly away.",
        "Have a picnic.",
        "Watch out for seagulls though.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/d\\/d4\\/Picnic-basket.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/d\\/d4\\/Picnic-basket.jpg\",\"smallWidth\":460,\"smallHeight\":389,\"bigWidth\":760,\"bigHeight\":643.0769230769231,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Climb up rocks.",
        "If you know for definite it is safe why not?",
        "Do not climb up them if they are slippery or very high; it is better to be safe than sorry.",
        "Count the gulls.",
        "You probably didn't give it that much thought but why not find out how many there are and what different types you can see?",
        "You can give them names too.",
        "See if any seagulls are doing anything amusing like fighting over some food.",
        "Explore any rock pools.",
        "Look for star fish, sea urchins, crabs and other creatures in the shallow pools amongst the rocks.",
        "Draw them and observe them, then put them back in their homes.",
        "Write and draw in the sand.",
        "You can just doodle with a stick, or your toe, draw a picture or write you first name in the sand.",
        "You can add some shells or stones to your art as well.",
        "Dig a hole in the sand.",
        "It works best when the sand is wet as the water will come through, making a little puddle.",
        "You don't need a spade you can use your hands or a stick.",
        "Watch the water slowly sway from side to side and relax.",
        "Send out a message in a bottle.",
        "It can be a great activity to do with friends and you might even get a reply!",
        "Fish or forage for edible seaweed and sea food.",
        "If fishing is permitted at the beach you are on, try casting your rod.",
        "You can also look for shell fish or edible seaweed, just don't more than is permitted.",
        "Try a beach spa.",
        "Damp sand makes a great foot scrub.",
        "Use a moisturising sun lotion, towel dry your hair after swimming in the sea for the authentic beach-hair look.",
        "Work on your tan, taking sensible precautions.",
        "Look around you at your surroundings.",
        "See what you can see at the beach.",
        "There may be an event on such as a treasure hunt you can join in with.",
        "A group might be picking up litter or doing a research project you can join in with - talk to people your age, you might make some new friends."
    ]
}