{
    "title": "How to Do a Caesar Haircut",
    "url": "https://www.wikihow.com/Do-a-Caesar-Haircut",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Haircuts"
    ],
    "parts": [
        {
            "name": "Laying Down the Base",
            "steps": [
                {
                    "headline": "Decide how long you want your hair to be.",
                    "description": "The Caesar haircut is the same length all around, typically between 1 to 2 inches (2.54 to 5.08 centimeters) long. If you have natural or textured hair, consider going for a \"Dark Caesar\" instead, which is a little shorter. Have reference pictures of the exact style you are going for handy. They can be from a magazine, a print-out, or even on your phone."
                },
                {
                    "headline": "Wash and comb your hair.",
                    "description": "You always want to wash your hair before cutting it. Once your hair is washed, pat it dry with a towel so that it is no longer dripping, then comb it out."
                },
                {
                    "headline": "Put on a hair dressing cape.",
                    "description": "Some people like to wrap a folded sheet of tissue paper around their neck (like a collar) as well. You don't have to do this, but it will help keep all of those tiny, spiky bits of hair off your clothing and neck."
                },
                {
                    "headline": "Trim your hair down to a more manageable length, if needed.",
                    "description": "If your hair is long, cut it down until it is a few inches/centimeters long. This will make the Caesar style easier to cut because you won't have as much hair getting in the way. If your hair is already a few inches/centimeters long, you can leave it as-is."
                },
                {
                    "headline": "Insert your desired guard into your clippers.",
                    "description": "The Caesar is between 1 and 2 inches (2.54 and 5.08 centimeters) long, so choose a guard that will give you the right length. A #1 guard will work great for very short hair, while a #4 guard will work better for longer hair. If you are cutting natural or textured hair for a \"Dark Caesar,\" try a ¼-inch (0.64-centimeter) attachment or blade."
                },
                {
                    "headline": "Cut the hair an even length all around, going with the grain of the hair.",
                    "description": "Begin shaving the hair at the top of the head, starting from the back and moving to the front. Do the sides next, also going back-to-front, but at a slight, downward angle. Do the back of the head last, going straight down, from top-to-bottom. The \"grain\" of the hair is the direction that the hair is growing in. Your hair may not all grow in the same direction. Comb the hair every couple of strokes to get rid of any tiny cut pieces of hair. Leave a 2–3 inches (5.1–7.6 cm) strip of hair at the front of your hairline. This strip will be the bangs."
                },
                {
                    "headline": "Comb the hair forward then cut the bangs.",
                    "description": "Brush or comb all of the hair on top of the head forward so that it covers the hairline. Cut straight across the bangs, making sure that they are even. If you are doing this by hand, start from the middle of the bangs and slowly work your way to the outer edges. For a Dark Caesar, sculpt the hairline with the clippers instead. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLaura Martin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLicensed Cosmetologist\t\t\t\t\t\t\t\tLaura Martin is a Licensed Cosmetologist in Georgia. She has been a hair stylist since 2007 and a cosmetology teacher since 2013. Laura Martin\t\t\tLicensed Cosmetologist\t\t\t\tLeave your bangs a little longer to get a French Crop. Licensed cosmetologist Laura Martin says, “The French Crop is a cut with tapered sides and back, a relatively short top, and a long fringe. The main difference between the French Crop and the Caesar cut is the length at the front, which is longer in the French Crop.”"
                },
                {
                    "headline": "Blend the bangs in with the rest of the hair on top of your head.",
                    "description": "Hold the bangs up with your hand and use scissors to lightly trim some of the hairs so they're shorter. When you're finished, your bangs should blend in with the shorter hair on the top of your head."
                }
            ]
        },
        {
            "name": "Blending and Refining the Cut",
            "steps": [
                {
                    "headline": "Blend the hair between the sides and the round of the head.",
                    "description": "Comb the trimmer upwards through the hair, working your way around the head, from temple to temple. Start at the bottom and work your way to the top. For a more modern take, cut the sides shorter for an undercut or a fade."
                },
                {
                    "headline": "Even out the hair around the ears using short, downward strokes.",
                    "description": "You should use the same clipper length as the surrounding hair. This means that if you added an undercut or fade to your Caesar with a shorter guard, you should use that shorter guard here."
                },
                {
                    "headline": "Even out the hair around the temples and sideburns, if needed.",
                    "description": "If you left your hair long, you may not need to do this. If you went for a Dark Caesar or cut your hair very short, doing this is recommended because it will give you a cleaner look. Shave away from the hairline, just as before."
                },
                {
                    "headline": "Smooth the hair out with a shaver if you are cutting natural or textured hair.",
                    "description": "Straight, curly, or wavy hair won't need this, but natural or texture hair will. Simply run a shaver across the top of the hair all around the head. This will give the hair a smoother look. Remember to go with the grain of the hair."
                }
            ]
        },
        {
            "name": "Finishing and Styling the Cut",
            "steps": [
                {
                    "headline": "Brush off the excess hair.",
                    "description": "If there are lots of tiny hairs stuck to your neck, you may need to take a shower first. Dry off your hair if you took a shower/"
                },
                {
                    "headline": "Comb the hair with the grain.",
                    "description": "Brush the hair on top straight towards the hairline. Comb it downwards at an angle towards the chin when you get to the sides. Brush it straight down at the back of the head. Use a brush or comb for straight or wavy hair, depending on the length. Use a boar bristle brush for natural or textured hair. You can use this on very short hair too."
                },
                {
                    "headline": "Finish the style off with some styling products.",
                    "description": "For straight or wavy hair, try a little bit of styling wax or pomade is all you need. Allow the hair to dry on its own, or speed it up with a blow drier. You can also brush it while blow drying it to make it lay more smoothly. Remember to brush and dry your hair in the same direction it is growing in."
                },
                {
                    "headline": "Style the Dark Caesar with hair oil or moisturizing cream.",
                    "description": "Natural or textured hair tends to be very dry, so apply some moisturizing cream or hair oil to it first. Blow dry the hair while combing it with a boar bristle brush. Remember to comb in the same direction that the hair is growing in."
                }
            ]
        }
    ],
    "tyn": [
        "Brush or comb",
        "Clippers with guard",
        "Hair dressing cape",
        "Hair wax, pomade, oil, or moisturizing cream"
    ],
    "text": " Laying Down the Base Decide how long you want your hair to be. The Caesar haircut is the same length all around, typically between 1 to 2 inches (2.54 to 5.08 centimeters) long. If you have natural or textured hair, consider going for a \"Dark Caesar\" instead, which is a little shorter. Have reference pictures of the exact style you are going for handy. They can be from a magazine, a print-out, or even on your phone. Wash and comb your hair. You always want to wash your hair before cutting it. Once your hair is washed, pat it dry with a towel so that it is no longer dripping, then comb it out. Put on a hair dressing cape. Some people like to wrap a folded sheet of tissue paper around their neck (like a collar) as well. You don't have to do this, but it will help keep all of those tiny, spiky bits of hair off your clothing and neck. Trim your hair down to a more manageable length, if needed. If your hair is long, cut it down until it is a few inches/centimeters long. This will make the Caesar style easier to cut because you won't have as much hair getting in the way. If your hair is already a few inches/centimeters long, you can leave it as-is. Insert your desired guard into your clippers. The Caesar is between 1 and 2 inches (2.54 and 5.08 centimeters) long, so choose a guard that will give you the right length. A #1 guard will work great for very short hair, while a #4 guard will work better for longer hair. If you are cutting natural or textured hair for a \"Dark Caesar,\" try a ¼-inch (0.64-centimeter) attachment or blade. Cut the hair an even length all around, going with the grain of the hair. Begin shaving the hair at the top of the head, starting from the back and moving to the front. Do the sides next, also going back-to-front, but at a slight, downward angle. Do the back of the head last, going straight down, from top-to-bottom. The \"grain\" of the hair is the direction that the hair is growing in. Your hair may not all grow in the same direction. Comb the hair every couple of strokes to get rid of any tiny cut pieces of hair. Leave a 2–3 inches (5.1–7.6 cm) strip of hair at the front of your hairline. This strip will be the bangs. Comb the hair forward then cut the bangs. Brush or comb all of the hair on top of the head forward so that it covers the hairline. Cut straight across the bangs, making sure that they are even. If you are doing this by hand, start from the middle of the bangs and slowly work your way to the outer edges. For a Dark Caesar, sculpt the hairline with the clippers instead. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLaura Martin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLicensed Cosmetologist\t\t\t\t\t\t\t\tLaura Martin is a Licensed Cosmetologist in Georgia. She has been a hair stylist since 2007 and a cosmetology teacher since 2013. Laura Martin\t\t\tLicensed Cosmetologist\t\t\t\tLeave your bangs a little longer to get a French Crop. Licensed cosmetologist Laura Martin says, “The French Crop is a cut with tapered sides and back, a relatively short top, and a long fringe. The main difference between the French Crop and the Caesar cut is the length at the front, which is longer in the French Crop.” Blend the bangs in with the rest of the hair on top of your head. Hold the bangs up with your hand and use scissors to lightly trim some of the hairs so they're shorter. When you're finished, your bangs should blend in with the shorter hair on the top of your head. Blending and Refining the Cut Blend the hair between the sides and the round of the head. Comb the trimmer upwards through the hair, working your way around the head, from temple to temple. Start at the bottom and work your way to the top. For a more modern take, cut the sides shorter for an undercut or a fade. Even out the hair around the ears using short, downward strokes. You should use the same clipper length as the surrounding hair. This means that if you added an undercut or fade to your Caesar with a shorter guard, you should use that shorter guard here. Even out the hair around the temples and sideburns, if needed. If you left your hair long, you may not need to do this. If you went for a Dark Caesar or cut your hair very short, doing this is recommended because it will give you a cleaner look. Shave away from the hairline, just as before. Smooth the hair out with a shaver if you are cutting natural or textured hair. Straight, curly, or wavy hair won't need this, but natural or texture hair will. Simply run a shaver across the top of the hair all around the head. This will give the hair a smoother look. Remember to go with the grain of the hair. Finishing and Styling the Cut Brush off the excess hair. If there are lots of tiny hairs stuck to your neck, you may need to take a shower first. Dry off your hair if you took a shower/ Comb the hair with the grain. Brush the hair on top straight towards the hairline. Comb it downwards at an angle towards the chin when you get to the sides. Brush it straight down at the back of the head. Use a brush or comb for straight or wavy hair, depending on the length. Use a boar bristle brush for natural or textured hair. You can use this on very short hair too. Finish the style off with some styling products. For straight or wavy hair, try a little bit of styling wax or pomade is all you need. Allow the hair to dry on its own, or speed it up with a blow drier. You can also brush it while blow drying it to make it lay more smoothly. Remember to brush and dry your hair in the same direction it is growing in. Style the Dark Caesar with hair oil or moisturizing cream. Natural or textured hair tends to be very dry, so apply some moisturizing cream or hair oil to it first. Blow dry the hair while combing it with a boar bristle brush. Remember to comb in the same direction that the hair is growing in.",
    "sentences": [
        " Laying Down the Base Decide how long you want your hair to be.",
        "The Caesar haircut is the same length all around, typically between 1 to 2 inches (2.54 to 5.08 centimeters) long.",
        "If you have natural or textured hair, consider going for a \"Dark Caesar\" instead, which is a little shorter.",
        "Have reference pictures of the exact style you are going for handy.",
        "They can be from a magazine, a print-out, or even on your phone.",
        "Wash and comb your hair.",
        "You always want to wash your hair before cutting it.",
        "Once your hair is washed, pat it dry with a towel so that it is no longer dripping, then comb it out.",
        "Put on a hair dressing cape.",
        "Some people like to wrap a folded sheet of tissue paper around their neck (like a collar) as well.",
        "You don't have to do this, but it will help keep all of those tiny, spiky bits of hair off your clothing and neck.",
        "Trim your hair down to a more manageable length, if needed.",
        "If your hair is long, cut it down until it is a few inches/centimeters long.",
        "This will make the Caesar style easier to cut because you won't have as much hair getting in the way.",
        "If your hair is already a few inches/centimeters long, you can leave it as-is.",
        "Insert your desired guard into your clippers.",
        "The Caesar is between 1 and 2 inches (2.54 and 5.08 centimeters) long, so choose a guard that will give you the right length.",
        "A #1 guard will work great for very short hair, while a #4 guard will work better for longer hair.",
        "If you are cutting natural or textured hair for a \"Dark Caesar,\" try a ¼-inch (0.64-centimeter) attachment or blade.",
        "Cut the hair an even length all around, going with the grain of the hair.",
        "Begin shaving the hair at the top of the head, starting from the back and moving to the front.",
        "Do the sides next, also going back-to-front, but at a slight, downward angle.",
        "Do the back of the head last, going straight down, from top-to-bottom.",
        "The \"grain\" of the hair is the direction that the hair is growing in.",
        "Your hair may not all grow in the same direction.",
        "Comb the hair every couple of strokes to get rid of any tiny cut pieces of hair.",
        "Leave a 2–3 inches (5.1–7.6 cm) strip of hair at the front of your hairline.",
        "This strip will be the bangs.",
        "Comb the hair forward then cut the bangs.",
        "Brush or comb all of the hair on top of the head forward so that it covers the hairline.",
        "Cut straight across the bangs, making sure that they are even.",
        "If you are doing this by hand, start from the middle of the bangs and slowly work your way to the outer edges.",
        "For a Dark Caesar, sculpt the hairline with the clippers instead.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLaura Martin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLicensed Cosmetologist\t\t\t\t\t\t\t\tLaura Martin is a Licensed Cosmetologist in Georgia.",
        "She has been a hair stylist since 2007 and a cosmetology teacher since 2013.",
        "Laura Martin\t\t\tLicensed Cosmetologist\t\t\t\tLeave your bangs a little longer to get a French Crop.",
        "Licensed cosmetologist Laura Martin says, “The French Crop is a cut with tapered sides and back, a relatively short top, and a long fringe.",
        "The main difference between the French Crop and the Caesar cut is the length at the front, which is longer in the French Crop.” Blend the bangs in with the rest of the hair on top of your head.",
        "Hold the bangs up with your hand and use scissors to lightly trim some of the hairs so they're shorter.",
        "When you're finished, your bangs should blend in with the shorter hair on the top of your head.",
        "Blending and Refining the Cut Blend the hair between the sides and the round of the head.",
        "Comb the trimmer upwards through the hair, working your way around the head, from temple to temple.",
        "Start at the bottom and work your way to the top.",
        "For a more modern take, cut the sides shorter for an undercut or a fade.",
        "Even out the hair around the ears using short, downward strokes.",
        "You should use the same clipper length as the surrounding hair.",
        "This means that if you added an undercut or fade to your Caesar with a shorter guard, you should use that shorter guard here.",
        "Even out the hair around the temples and sideburns, if needed.",
        "If you left your hair long, you may not need to do this.",
        "If you went for a Dark Caesar or cut your hair very short, doing this is recommended because it will give you a cleaner look.",
        "Shave away from the hairline, just as before.",
        "Smooth the hair out with a shaver if you are cutting natural or textured hair.",
        "Straight, curly, or wavy hair won't need this, but natural or texture hair will.",
        "Simply run a shaver across the top of the hair all around the head.",
        "This will give the hair a smoother look.",
        "Remember to go with the grain of the hair.",
        "Finishing and Styling the Cut Brush off the excess hair.",
        "If there are lots of tiny hairs stuck to your neck, you may need to take a shower first.",
        "Dry off your hair if you took a shower/ Comb the hair with the grain.",
        "Brush the hair on top straight towards the hairline.",
        "Comb it downwards at an angle towards the chin when you get to the sides.",
        "Brush it straight down at the back of the head.",
        "Use a brush or comb for straight or wavy hair, depending on the length.",
        "Use a boar bristle brush for natural or textured hair.",
        "You can use this on very short hair too.",
        "Finish the style off with some styling products.",
        "For straight or wavy hair, try a little bit of styling wax or pomade is all you need.",
        "Allow the hair to dry on its own, or speed it up with a blow drier.",
        "You can also brush it while blow drying it to make it lay more smoothly.",
        "Remember to brush and dry your hair in the same direction it is growing in.",
        "Style the Dark Caesar with hair oil or moisturizing cream.",
        "Natural or textured hair tends to be very dry, so apply some moisturizing cream or hair oil to it first.",
        "Blow dry the hair while combing it with a boar bristle brush.",
        "Remember to comb in the same direction that the hair is growing in."
    ]
}