{
    "title": "How to Cook or Grill a Whole Fish",
    "url": "https://www.wikihow.com/Cook-or-Grill-a-Whole-Fish",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fish and Seafood"
    ],
    "parts": [
        {
            "name": "Preparing Your Fish for the Grill",
            "steps": [
                {
                    "headline": "Scale your fish.",
                    "description": "Set the fish on a flat surface, like a clean countertop. Press the flat side of the knife against the fish, with the knife bent at a 45 degree angle. Pointing the flat end of the knife against the grain of the scales, scrape the knife over the fish's body in long, even strokes until all the scales are removed. Flip the fish over and repeat on the other side. Then, run the fish under cold water to remove excess scales. If you're having trouble getting a good grip on your fish, wear rubber gloves while scaling."
                },
                {
                    "headline": "Remove the guts.",
                    "description": "Place your knife's tip into the small hole found just before the fish's tail. Make a cut from the tail to the jaw bone, deep enough that you can see the fish's internal organs but no so deep you cut the fish in half. Depth will vary depending on the fish. Put on a pair of gloves and pull out all the organs using your hands. Throw away the organs and rinse the inside of the fish under cool water."
                },
                {
                    "headline": "Pat the fish dry with paper towels.",
                    "description": "Place the fish on a cutting board or similar surface. Gently pat down both sides of the fish using clean paper towels from your kitchen to remove any excess water. Then, open the fish slightly. Pat down the inside of the fish as well."
                },
                {
                    "headline": "Salt and oil the fish.",
                    "description": "Sprinkle a generous amount of salt on either side of the fish. Apply some canola or peanut oil to a paper towel and rub down the fish on either side. This helps prevent it from sticking to the grill. It does not matter which type of oil you use. It's a matter of personal taste."
                },
                {
                    "headline": "Stuff the fish with seasoning.",
                    "description": "You can use fresh herbs, such as parsley and cilantro. You can also try thin slices of lemon and oranges. Stuff the fish with your chosen spice or flavoring until the inner cavity is full. For example, try stuffing your fish with minced cloves of garlic and four minced cilantro sprigs. If you have a bigger fish, try slicing one whole lemon and one whole orange. Stuff the fish with that."
                },
                {
                    "headline": "Try seasoning the fish on the outside.",
                    "description": "Smaller fish, such as sardines, should be seasoned on the outside. You can sprinkle herbs, such as garlic or parsley, along either side of the fish. You can also slice vegetables, such as onions, and place them on top of the fish prior to cooking. Try sprinkling two tablespoons of freshly chopped parsley over the fish with a spritz of lemon juice from a fresh lemon. For a spicy blend, add two tablespoons of chile powder."
                }
            ]
        },
        {
            "name": "Readying Your Grill",
            "steps": [
                {
                    "headline": "Heat the charcoal or gas grill.",
                    "description": "Turn on the grill so it can heat up while you're preparing the grate for cooking. Fish should be cooked at 400 degrees Fahrenheit (204 degrees Celsius). When using a charcoal grill, let the coals burn until they ash. This takes about 15 minutes. Leave the bottom vents closed to keep the heat high and use a thermometer to measure the heat."
                },
                {
                    "headline": "Clean the grate.",
                    "description": "After the grate has been heated for about five minutes, remove it from the grill. Wipe down the grate with a grill brush or scouring pad to remove any stuck-on bits of food. It's a good idea to remove the grate with tongs, as it will already be a little hot."
                },
                {
                    "headline": "Oil the grill.",
                    "description": "Take a paper towel and dip it in a small amount of your choice of oil. Run the paper towel along the bars of the grill grate. This will help prevent the fish from sticking to the grill. As you already oiled down the fish, you don't need to use a lot of oil for the grill itself. Too much oil could also cause flare ups. A small amount goes a long way."
                }
            ]
        },
        {
            "name": "Cooking Your Fish",
            "steps": [
                {
                    "headline": "Get the fish to room temperature.",
                    "description": "If your fish has been in the refrigerator, leave it sitting out in your kitchen for 20 to 30 minutes. This should bring your fish to room temperature, preventing condensation that can cause the fish to stick to the grill."
                },
                {
                    "headline": "Place the fish on the grill.",
                    "description": "Set the fish in the grill, over a spot with medium-high heat. You can hold your hand over the grill to find a spot that's hot, but not scalding, to place your fish. Keep your hand about a foot away from the grill to avoid burns."
                },
                {
                    "headline": "Cook the fish on one side for five minutes.",
                    "description": "At this point, all you need to do is wait five minutes. This should cook the first side of the fish. Do not turn the fish prematurely, as the skin may stick if it's turned too soon."
                },
                {
                    "headline": "Flip the fish and cook for an additional three to five minutes.",
                    "description": "Use a spatula or, if needed, two spatulas to flip the fish. Cook the fish for another three to five minutes. The fish should be crispy on both sides when the cooking process is done."
                },
                {
                    "headline": "Check the temperature.",
                    "description": "Insert a meat thermometer into the thickest portion of the fish. Fish should be at least 145 °F (62.8 °C) before they're safe to eat. If your fish has not reached that temperature yet, you'll need to cook it longer."
                },
                {
                    "headline": "Cover and cook the fish (if necessary).",
                    "description": "If the fish needs to be cooked more, move the fish to a colder spot on the grill. Cover the grill and cook the fish for five more minutes."
                },
                {
                    "headline": "Remove and serve your fish.",
                    "description": "Once the fish has reached a safe temperature, use tongs or a spatula to remove it from the grill. Place it on a platter and, if you want, garnish it with lemon slices or sprigs of herbs, like parsley, cilantro, or rosemary. A whole fish is best when served immediately."
                },
                {
                    "headline": "Save leftovers.",
                    "description": "Any leftovers can be saved by wrapping them tightly in aluminum foil and storing them in the coldest portion of the fridge. When stored properly, fish will keep for two to three days in the refrigerator."
                }
            ]
        }
    ],
    "tyn": [
        "Grill",
        "Thermometer",
        "Tongs",
        "Meat thermometer",
        "Paper towel",
        "Grill brush",
        "Knife",
        "Gloves",
        "Cutting board"
    ],
    "text": " Preparing Your Fish for the Grill Scale your fish. Set the fish on a flat surface, like a clean countertop. Press the flat side of the knife against the fish, with the knife bent at a 45 degree angle. Pointing the flat end of the knife against the grain of the scales, scrape the knife over the fish's body in long, even strokes until all the scales are removed. Flip the fish over and repeat on the other side. Then, run the fish under cold water to remove excess scales. If you're having trouble getting a good grip on your fish, wear rubber gloves while scaling. Remove the guts. Place your knife's tip into the small hole found just before the fish's tail. Make a cut from the tail to the jaw bone, deep enough that you can see the fish's internal organs but no so deep you cut the fish in half. Depth will vary depending on the fish. Put on a pair of gloves and pull out all the organs using your hands. Throw away the organs and rinse the inside of the fish under cool water. Pat the fish dry with paper towels. Place the fish on a cutting board or similar surface. Gently pat down both sides of the fish using clean paper towels from your kitchen to remove any excess water. Then, open the fish slightly. Pat down the inside of the fish as well. Salt and oil the fish. Sprinkle a generous amount of salt on either side of the fish. Apply some canola or peanut oil to a paper towel and rub down the fish on either side. This helps prevent it from sticking to the grill. It does not matter which type of oil you use. It's a matter of personal taste. Stuff the fish with seasoning. You can use fresh herbs, such as parsley and cilantro. You can also try thin slices of lemon and oranges. Stuff the fish with your chosen spice or flavoring until the inner cavity is full. For example, try stuffing your fish with minced cloves of garlic and four minced cilantro sprigs. If you have a bigger fish, try slicing one whole lemon and one whole orange. Stuff the fish with that. Try seasoning the fish on the outside. Smaller fish, such as sardines, should be seasoned on the outside. You can sprinkle herbs, such as garlic or parsley, along either side of the fish. You can also slice vegetables, such as onions, and place them on top of the fish prior to cooking. Try sprinkling two tablespoons of freshly chopped parsley over the fish with a spritz of lemon juice from a fresh lemon. For a spicy blend, add two tablespoons of chile powder. Readying Your Grill Heat the charcoal or gas grill. Turn on the grill so it can heat up while you're preparing the grate for cooking. Fish should be cooked at 400 degrees Fahrenheit (204 degrees Celsius). When using a charcoal grill, let the coals burn until they ash. This takes about 15 minutes. Leave the bottom vents closed to keep the heat high and use a thermometer to measure the heat. Clean the grate. After the grate has been heated for about five minutes, remove it from the grill. Wipe down the grate with a grill brush or scouring pad to remove any stuck-on bits of food. It's a good idea to remove the grate with tongs, as it will already be a little hot. Oil the grill. Take a paper towel and dip it in a small amount of your choice of oil. Run the paper towel along the bars of the grill grate. This will help prevent the fish from sticking to the grill. As you already oiled down the fish, you don't need to use a lot of oil for the grill itself. Too much oil could also cause flare ups. A small amount goes a long way. Cooking Your Fish Get the fish to room temperature. If your fish has been in the refrigerator, leave it sitting out in your kitchen for 20 to 30 minutes. This should bring your fish to room temperature, preventing condensation that can cause the fish to stick to the grill. Place the fish on the grill. Set the fish in the grill, over a spot with medium-high heat. You can hold your hand over the grill to find a spot that's hot, but not scalding, to place your fish. Keep your hand about a foot away from the grill to avoid burns. Cook the fish on one side for five minutes. At this point, all you need to do is wait five minutes. This should cook the first side of the fish. Do not turn the fish prematurely, as the skin may stick if it's turned too soon. Flip the fish and cook for an additional three to five minutes. Use a spatula or, if needed, two spatulas to flip the fish. Cook the fish for another three to five minutes. The fish should be crispy on both sides when the cooking process is done. Check the temperature. Insert a meat thermometer into the thickest portion of the fish. Fish should be at least 145 °F (62.8 °C) before they're safe to eat. If your fish has not reached that temperature yet, you'll need to cook it longer. Cover and cook the fish (if necessary). If the fish needs to be cooked more, move the fish to a colder spot on the grill. Cover the grill and cook the fish for five more minutes. Remove and serve your fish. Once the fish has reached a safe temperature, use tongs or a spatula to remove it from the grill. Place it on a platter and, if you want, garnish it with lemon slices or sprigs of herbs, like parsley, cilantro, or rosemary. A whole fish is best when served immediately. Save leftovers. Any leftovers can be saved by wrapping them tightly in aluminum foil and storing them in the coldest portion of the fridge. When stored properly, fish will keep for two to three days in the refrigerator.",
    "sentences": [
        " Preparing Your Fish for the Grill Scale your fish.",
        "Set the fish on a flat surface, like a clean countertop.",
        "Press the flat side of the knife against the fish, with the knife bent at a 45 degree angle.",
        "Pointing the flat end of the knife against the grain of the scales, scrape the knife over the fish's body in long, even strokes until all the scales are removed.",
        "Flip the fish over and repeat on the other side.",
        "Then, run the fish under cold water to remove excess scales.",
        "If you're having trouble getting a good grip on your fish, wear rubber gloves while scaling.",
        "Remove the guts.",
        "Place your knife's tip into the small hole found just before the fish's tail.",
        "Make a cut from the tail to the jaw bone, deep enough that you can see the fish's internal organs but no so deep you cut the fish in half.",
        "Depth will vary depending on the fish.",
        "Put on a pair of gloves and pull out all the organs using your hands.",
        "Throw away the organs and rinse the inside of the fish under cool water.",
        "Pat the fish dry with paper towels.",
        "Place the fish on a cutting board or similar surface.",
        "Gently pat down both sides of the fish using clean paper towels from your kitchen to remove any excess water.",
        "Then, open the fish slightly.",
        "Pat down the inside of the fish as well.",
        "Salt and oil the fish.",
        "Sprinkle a generous amount of salt on either side of the fish.",
        "Apply some canola or peanut oil to a paper towel and rub down the fish on either side.",
        "This helps prevent it from sticking to the grill.",
        "It does not matter which type of oil you use.",
        "It's a matter of personal taste.",
        "Stuff the fish with seasoning.",
        "You can use fresh herbs, such as parsley and cilantro.",
        "You can also try thin slices of lemon and oranges.",
        "Stuff the fish with your chosen spice or flavoring until the inner cavity is full.",
        "For example, try stuffing your fish with minced cloves of garlic and four minced cilantro sprigs.",
        "If you have a bigger fish, try slicing one whole lemon and one whole orange.",
        "Stuff the fish with that.",
        "Try seasoning the fish on the outside.",
        "Smaller fish, such as sardines, should be seasoned on the outside.",
        "You can sprinkle herbs, such as garlic or parsley, along either side of the fish.",
        "You can also slice vegetables, such as onions, and place them on top of the fish prior to cooking.",
        "Try sprinkling two tablespoons of freshly chopped parsley over the fish with a spritz of lemon juice from a fresh lemon.",
        "For a spicy blend, add two tablespoons of chile powder.",
        "Readying Your Grill Heat the charcoal or gas grill.",
        "Turn on the grill so it can heat up while you're preparing the grate for cooking.",
        "Fish should be cooked at 400 degrees Fahrenheit (204 degrees Celsius).",
        "When using a charcoal grill, let the coals burn until they ash.",
        "This takes about 15 minutes.",
        "Leave the bottom vents closed to keep the heat high and use a thermometer to measure the heat.",
        "Clean the grate.",
        "After the grate has been heated for about five minutes, remove it from the grill.",
        "Wipe down the grate with a grill brush or scouring pad to remove any stuck-on bits of food.",
        "It's a good idea to remove the grate with tongs, as it will already be a little hot.",
        "Oil the grill.",
        "Take a paper towel and dip it in a small amount of your choice of oil.",
        "Run the paper towel along the bars of the grill grate.",
        "This will help prevent the fish from sticking to the grill.",
        "As you already oiled down the fish, you don't need to use a lot of oil for the grill itself.",
        "Too much oil could also cause flare ups.",
        "A small amount goes a long way.",
        "Cooking Your Fish Get the fish to room temperature.",
        "If your fish has been in the refrigerator, leave it sitting out in your kitchen for 20 to 30 minutes.",
        "This should bring your fish to room temperature, preventing condensation that can cause the fish to stick to the grill.",
        "Place the fish on the grill.",
        "Set the fish in the grill, over a spot with medium-high heat.",
        "You can hold your hand over the grill to find a spot that's hot, but not scalding, to place your fish.",
        "Keep your hand about a foot away from the grill to avoid burns.",
        "Cook the fish on one side for five minutes.",
        "At this point, all you need to do is wait five minutes.",
        "This should cook the first side of the fish.",
        "Do not turn the fish prematurely, as the skin may stick if it's turned too soon.",
        "Flip the fish and cook for an additional three to five minutes.",
        "Use a spatula or, if needed, two spatulas to flip the fish.",
        "Cook the fish for another three to five minutes.",
        "The fish should be crispy on both sides when the cooking process is done.",
        "Check the temperature.",
        "Insert a meat thermometer into the thickest portion of the fish.",
        "Fish should be at least 145 °F (62.8 °C) before they're safe to eat.",
        "If your fish has not reached that temperature yet, you'll need to cook it longer.",
        "Cover and cook the fish (if necessary).",
        "If the fish needs to be cooked more, move the fish to a colder spot on the grill.",
        "Cover the grill and cook the fish for five more minutes.",
        "Remove and serve your fish.",
        "Once the fish has reached a safe temperature, use tongs or a spatula to remove it from the grill.",
        "Place it on a platter and, if you want, garnish it with lemon slices or sprigs of herbs, like parsley, cilantro, or rosemary.",
        "A whole fish is best when served immediately.",
        "Save leftovers.",
        "Any leftovers can be saved by wrapping them tightly in aluminum foil and storing them in the coldest portion of the fridge.",
        "When stored properly, fish will keep for two to three days in the refrigerator."
    ]
}