{
    "title": "How to Fry Oysters",
    "url": "https://www.wikihow.com/Fry-Oysters",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fish and Seafood"
    ],
    "parts": [
        {
            "name": "Selecting the Oysters",
            "steps": [
                {
                    "headline": "Shop for oysters from September to April.",
                    "description": "Select oysters during spawning season when they are their milkiest and most delicious. While oysters are available year-round, the best are available during this window. Shop for oysters at fish specialty markets for the freshest selection. Your local organic grocer may also have fresh oysters."
                },
                {
                    "headline": "Look for oysters with a closed shell.",
                    "description": "Inspect the lip of each oyster to ensure all edges are tightly shut. A shut shell means that the oyster inside is alive and fresh. Avoid oysters that are open."
                },
                {
                    "headline": "Choose oysters that feel heavy for their size.",
                    "description": "Pick up oysters to feel for a full, heavy shell. A heavy shell means a healthy oyster with lots of juice is inside. A light shell may mean the oyster inside is dry or ill. Different kinds of oysters have different “ideal” weights. If you’re having trouble figuring out if an oyster feels heavy for how big it is, compare a few in your hands. You can also ask your fishmonger to help you choose some good ones. They know what to look for."
                },
                {
                    "headline": "Look at the harvest date.",
                    "description": "Choose oysters with a harvest date within the last week—the more recent the better. By law, a shipment of oysters has to have a tag indicating the date of harvest. You can ask your fishmonger when they were harvested, if it’s not obvious to you."
                },
                {
                    "headline": "Store oysters in the fridge with a damp towel over them.",
                    "description": "Arrange your oysters in the fridge so the flat side faces up and the rounder side faces down. A damp towel will keep their shells from drying out."
                },
                {
                    "headline": "Cook or eat oysters within a day or two of purchase.",
                    "description": "Eat oysters soon after you buy them for both food safety and freshness. Avoid freezing oysters, which changes their texture and makes them more difficult to fry."
                }
            ]
        },
        {
            "name": "Cleaning the Oysters",
            "steps": [
                {
                    "headline": "Set up your workstation.",
                    "description": "Get a clean bowl and set it in a larger bowl full of ice. You will keep the meats of your oysters cool in the smaller bowl while you work. Place a trashcan close by so you can discard any shells as you go."
                },
                {
                    "headline": "Wrap the hand you’ll be using to hold the oyster in a towel.",
                    "description": "Protect your hand by wrapping it in a tea towel or wear a heavy-duty glove. It’s easy to slip shucking an oyster, and wrapping your hand will provide extra protection."
                },
                {
                    "headline": "Hold the oyster to be cleaned against a flat surface.",
                    "description": "Take an oyster in your wrapped hand, and hold it flat side up against something firm, such as the table. It’s best to avoid shucking the oyster in the palm of your hand, as you might slip and cut yourself. A towel or cutting board underneath the oyster can give you a better grip."
                },
                {
                    "headline": "Pop the hinge of the oyster with a sharp knife.",
                    "description": "Use a sturdy, sharp knife to pierce the hinge at the top of the oyster. Once your knife enters the shell, twist the knife, which will pry the hinge of the shell open."
                },
                {
                    "headline": "Give a quick sniff to ensure each oyster smells fresh.",
                    "description": "The juice inside should be clear and smell briny. If the juice inside is cloudy or the oyster smells sour or funky, toss it."
                },
                {
                    "headline": "Separate the two sides of the oyster.",
                    "description": "Run your knife between the top and bottom shells of the oyster to separate the two sides. As you do this, angle your knife towards the bottom of the shell to cut around the oyster meat and not into it. Twisting the knife near the hinge can help separate the top and bottom shells from one another. Remove and discard the top shell so that the oyster is in the bottom shell."
                },
                {
                    "headline": "Cut the oyster free.",
                    "description": "Cut the muscle holding the oyster to its shell by sliding the tip of your knife beneath the oyster. Avoid cutting loose interior pieces of the shell, which can make your oyster gritty."
                },
                {
                    "headline": "Scoop the oyster meat into your clean bowl and discard the shells.",
                    "description": "Use an oyster fork or a clean finger to gently slip the oyster meat into your bowl on ice. Clean up your workspace and throw away any shells or other debris."
                }
            ]
        },
        {
            "name": "Frying the Oysters",
            "steps": [
                {
                    "headline": "Pat your oysters dry.",
                    "description": "Use a clean kitchen towel to dry the outside of your oysters thoroughly. This will ensure your batter sticks to the oysters well and doesn’t flake off during frying. If you don’t dry your oysters well, they will give off more water and spit hot grease while frying."
                },
                {
                    "headline": "Dust the oysters with flour.",
                    "description": "Place your cleaned, dried oysters on a plate and dust them with a handful of flour. Use a spoon to roll the oysters gently in the flour so they are coated on all sides. Shake off any extra four by tapping each oyster gently on the side of the plate."
                },
                {
                    "headline": "Create a dredge.",
                    "description": "In a bowl, mix together: 1 1/2 cups (192 g) of all-purpose flour, 3/4 teaspoons (4.26 g) of salt, 2 tablespoons (30 g) of baking powder, 2 tablespoons (30 ml) of peanut oil, and 10 oz (295 ml) of cold water. This is the batter you will dip your oysters into."
                },
                {
                    "headline": "Line a colander with paper towels.",
                    "description": "Set up a frying rack or a colander with a paper towel in the bottom so you have a place to put your hot fried oysters. You don’t want to be dripping hot grease on your kitchen floor while you figure out where to put them."
                },
                {
                    "headline": "Heat up your oil to 375 degrees F (190 degrees C).",
                    "description": "Pour 5 cups of peanut oil into a deep pot or wok, and turn your burner on high. Use a heat-safe cooking thermometer to keep an eye on the temperature as it goes up. When it reaches 375 degrees F (190 degrees C), it’s time to fry your oysters. Take care around hot oil, which can cause severe burns."
                },
                {
                    "headline": "Batter five oysters.",
                    "description": "While your oil is heating up, dip five oysters in the batter and place them on a clean plate. You can use a fork to dip the oysters, or use clean fingers."
                },
                {
                    "headline": "Place the oysters in the hot oil.",
                    "description": "When your oil has reached temperature, you will see a whisp of white smoke. Gently lower the oysters into the oil with a frying spider or one by one with a fork. Take care not to splash the hot oil, as you might burn yourself. Set a timer for 3 minutes. Keep an eye on the oysters as they fry. If they look like they are browning too quickly, turn down the temperature of your oil a bit. If they look like they are frying too slowly, turn it up a little. Adding cold oysters to your oil will naturally lower the temperature of the oil a little. While the oysters fry, batter five more. Repeat this process as you go."
                },
                {
                    "headline": "Remove the oysters once they are light golden brown.",
                    "description": "When the timer is up, remove the oysters gently with a frying spider or a metal slotted spoon to avoid disturbing the breading. Place them on the prepared colander or frying rack to let the excess oil drip off."
                },
                {
                    "headline": "Fry the oysters a final time for 2 minutes.",
                    "description": "Once you’ve done a first fry on all the oysters, fry them a final time to a golden brown for 2 minutes in batches of five. Using a metal slotted spoon or frying spider, lower the oysters into your hot oil once more. Set a timer, and while your oysters fry, change out the paper towels in your colander or under your frying rack to absorb any excess oil. Your finished oysters should be a deep golden brown. This last fry ensures all your oysters are hot and ready to serve at around the same time."
                },
                {
                    "headline": "Serve your oysters.",
                    "description": "Garnish your oysters with lemon, parsley or any other accompaniments you like. They’re best eaten hot! It’s difficult to properly reheat oysters in a food-safe way. Plan on eating all your oysters right after you cook them."
                }
            ]
        }
    ],
    "tyn": [
        "Oysters",
        "Tea towel or heavy work glove",
        "Clean bowls",
        "Ice",
        "All purpose flour",
        "Cold water",
        "Salt",
        "Peanut oil",
        "Frying spider or metal slotted spoon",
        "Clean plate",
        "Garnishes"
    ],
    "text": " Selecting the Oysters Shop for oysters from September to April. Select oysters during spawning season when they are their milkiest and most delicious. While oysters are available year-round, the best are available during this window. Shop for oysters at fish specialty markets for the freshest selection. Your local organic grocer may also have fresh oysters. Look for oysters with a closed shell. Inspect the lip of each oyster to ensure all edges are tightly shut. A shut shell means that the oyster inside is alive and fresh. Avoid oysters that are open. Choose oysters that feel heavy for their size. Pick up oysters to feel for a full, heavy shell. A heavy shell means a healthy oyster with lots of juice is inside. A light shell may mean the oyster inside is dry or ill. Different kinds of oysters have different “ideal” weights. If you’re having trouble figuring out if an oyster feels heavy for how big it is, compare a few in your hands. You can also ask your fishmonger to help you choose some good ones. They know what to look for. Look at the harvest date. Choose oysters with a harvest date within the last week—the more recent the better. By law, a shipment of oysters has to have a tag indicating the date of harvest. You can ask your fishmonger when they were harvested, if it’s not obvious to you. Store oysters in the fridge with a damp towel over them. Arrange your oysters in the fridge so the flat side faces up and the rounder side faces down. A damp towel will keep their shells from drying out. Cook or eat oysters within a day or two of purchase. Eat oysters soon after you buy them for both food safety and freshness. Avoid freezing oysters, which changes their texture and makes them more difficult to fry. Cleaning the Oysters Set up your workstation. Get a clean bowl and set it in a larger bowl full of ice. You will keep the meats of your oysters cool in the smaller bowl while you work. Place a trashcan close by so you can discard any shells as you go. Wrap the hand you’ll be using to hold the oyster in a towel. Protect your hand by wrapping it in a tea towel or wear a heavy-duty glove. It’s easy to slip shucking an oyster, and wrapping your hand will provide extra protection. Hold the oyster to be cleaned against a flat surface. Take an oyster in your wrapped hand, and hold it flat side up against something firm, such as the table. It’s best to avoid shucking the oyster in the palm of your hand, as you might slip and cut yourself. A towel or cutting board underneath the oyster can give you a better grip. Pop the hinge of the oyster with a sharp knife. Use a sturdy, sharp knife to pierce the hinge at the top of the oyster. Once your knife enters the shell, twist the knife, which will pry the hinge of the shell open. Give a quick sniff to ensure each oyster smells fresh. The juice inside should be clear and smell briny. If the juice inside is cloudy or the oyster smells sour or funky, toss it. Separate the two sides of the oyster. Run your knife between the top and bottom shells of the oyster to separate the two sides. As you do this, angle your knife towards the bottom of the shell to cut around the oyster meat and not into it. Twisting the knife near the hinge can help separate the top and bottom shells from one another. Remove and discard the top shell so that the oyster is in the bottom shell. Cut the oyster free. Cut the muscle holding the oyster to its shell by sliding the tip of your knife beneath the oyster. Avoid cutting loose interior pieces of the shell, which can make your oyster gritty. Scoop the oyster meat into your clean bowl and discard the shells. Use an oyster fork or a clean finger to gently slip the oyster meat into your bowl on ice. Clean up your workspace and throw away any shells or other debris. Frying the Oysters Pat your oysters dry. Use a clean kitchen towel to dry the outside of your oysters thoroughly. This will ensure your batter sticks to the oysters well and doesn’t flake off during frying. If you don’t dry your oysters well, they will give off more water and spit hot grease while frying. Dust the oysters with flour. Place your cleaned, dried oysters on a plate and dust them with a handful of flour. Use a spoon to roll the oysters gently in the flour so they are coated on all sides. Shake off any extra four by tapping each oyster gently on the side of the plate. Create a dredge. In a bowl, mix together: 1 1/2 cups (192 g) of all-purpose flour, 3/4 teaspoons (4.26 g) of salt, 2 tablespoons (30 g) of baking powder, 2 tablespoons (30 ml) of peanut oil, and 10 oz (295 ml) of cold water. This is the batter you will dip your oysters into. Line a colander with paper towels. Set up a frying rack or a colander with a paper towel in the bottom so you have a place to put your hot fried oysters. You don’t want to be dripping hot grease on your kitchen floor while you figure out where to put them. Heat up your oil to 375 degrees F (190 degrees C). Pour 5 cups of peanut oil into a deep pot or wok, and turn your burner on high. Use a heat-safe cooking thermometer to keep an eye on the temperature as it goes up. When it reaches 375 degrees F (190 degrees C), it’s time to fry your oysters. Take care around hot oil, which can cause severe burns. Batter five oysters. While your oil is heating up, dip five oysters in the batter and place them on a clean plate. You can use a fork to dip the oysters, or use clean fingers. Place the oysters in the hot oil. When your oil has reached temperature, you will see a whisp of white smoke. Gently lower the oysters into the oil with a frying spider or one by one with a fork. Take care not to splash the hot oil, as you might burn yourself. Set a timer for 3 minutes. Keep an eye on the oysters as they fry. If they look like they are browning too quickly, turn down the temperature of your oil a bit. If they look like they are frying too slowly, turn it up a little. Adding cold oysters to your oil will naturally lower the temperature of the oil a little. While the oysters fry, batter five more. Repeat this process as you go. Remove the oysters once they are light golden brown. When the timer is up, remove the oysters gently with a frying spider or a metal slotted spoon to avoid disturbing the breading. Place them on the prepared colander or frying rack to let the excess oil drip off. Fry the oysters a final time for 2 minutes. Once you’ve done a first fry on all the oysters, fry them a final time to a golden brown for 2 minutes in batches of five. Using a metal slotted spoon or frying spider, lower the oysters into your hot oil once more. Set a timer, and while your oysters fry, change out the paper towels in your colander or under your frying rack to absorb any excess oil. Your finished oysters should be a deep golden brown. This last fry ensures all your oysters are hot and ready to serve at around the same time. Serve your oysters. Garnish your oysters with lemon, parsley or any other accompaniments you like. They’re best eaten hot! It’s difficult to properly reheat oysters in a food-safe way. Plan on eating all your oysters right after you cook them.",
    "sentences": [
        " Selecting the Oysters Shop for oysters from September to April.",
        "Select oysters during spawning season when they are their milkiest and most delicious.",
        "While oysters are available year-round, the best are available during this window.",
        "Shop for oysters at fish specialty markets for the freshest selection.",
        "Your local organic grocer may also have fresh oysters.",
        "Look for oysters with a closed shell.",
        "Inspect the lip of each oyster to ensure all edges are tightly shut.",
        "A shut shell means that the oyster inside is alive and fresh.",
        "Avoid oysters that are open.",
        "Choose oysters that feel heavy for their size.",
        "Pick up oysters to feel for a full, heavy shell.",
        "A heavy shell means a healthy oyster with lots of juice is inside.",
        "A light shell may mean the oyster inside is dry or ill.",
        "Different kinds of oysters have different “ideal” weights.",
        "If you’re having trouble figuring out if an oyster feels heavy for how big it is, compare a few in your hands.",
        "You can also ask your fishmonger to help you choose some good ones.",
        "They know what to look for.",
        "Look at the harvest date.",
        "Choose oysters with a harvest date within the last week—the more recent the better.",
        "By law, a shipment of oysters has to have a tag indicating the date of harvest.",
        "You can ask your fishmonger when they were harvested, if it’s not obvious to you.",
        "Store oysters in the fridge with a damp towel over them.",
        "Arrange your oysters in the fridge so the flat side faces up and the rounder side faces down.",
        "A damp towel will keep their shells from drying out.",
        "Cook or eat oysters within a day or two of purchase.",
        "Eat oysters soon after you buy them for both food safety and freshness.",
        "Avoid freezing oysters, which changes their texture and makes them more difficult to fry.",
        "Cleaning the Oysters Set up your workstation.",
        "Get a clean bowl and set it in a larger bowl full of ice.",
        "You will keep the meats of your oysters cool in the smaller bowl while you work.",
        "Place a trashcan close by so you can discard any shells as you go.",
        "Wrap the hand you’ll be using to hold the oyster in a towel.",
        "Protect your hand by wrapping it in a tea towel or wear a heavy-duty glove.",
        "It’s easy to slip shucking an oyster, and wrapping your hand will provide extra protection.",
        "Hold the oyster to be cleaned against a flat surface.",
        "Take an oyster in your wrapped hand, and hold it flat side up against something firm, such as the table.",
        "It’s best to avoid shucking the oyster in the palm of your hand, as you might slip and cut yourself.",
        "A towel or cutting board underneath the oyster can give you a better grip.",
        "Pop the hinge of the oyster with a sharp knife.",
        "Use a sturdy, sharp knife to pierce the hinge at the top of the oyster.",
        "Once your knife enters the shell, twist the knife, which will pry the hinge of the shell open.",
        "Give a quick sniff to ensure each oyster smells fresh.",
        "The juice inside should be clear and smell briny.",
        "If the juice inside is cloudy or the oyster smells sour or funky, toss it.",
        "Separate the two sides of the oyster.",
        "Run your knife between the top and bottom shells of the oyster to separate the two sides.",
        "As you do this, angle your knife towards the bottom of the shell to cut around the oyster meat and not into it.",
        "Twisting the knife near the hinge can help separate the top and bottom shells from one another.",
        "Remove and discard the top shell so that the oyster is in the bottom shell.",
        "Cut the oyster free.",
        "Cut the muscle holding the oyster to its shell by sliding the tip of your knife beneath the oyster.",
        "Avoid cutting loose interior pieces of the shell, which can make your oyster gritty.",
        "Scoop the oyster meat into your clean bowl and discard the shells.",
        "Use an oyster fork or a clean finger to gently slip the oyster meat into your bowl on ice.",
        "Clean up your workspace and throw away any shells or other debris.",
        "Frying the Oysters Pat your oysters dry.",
        "Use a clean kitchen towel to dry the outside of your oysters thoroughly.",
        "This will ensure your batter sticks to the oysters well and doesn’t flake off during frying.",
        "If you don’t dry your oysters well, they will give off more water and spit hot grease while frying.",
        "Dust the oysters with flour.",
        "Place your cleaned, dried oysters on a plate and dust them with a handful of flour.",
        "Use a spoon to roll the oysters gently in the flour so they are coated on all sides.",
        "Shake off any extra four by tapping each oyster gently on the side of the plate.",
        "Create a dredge.",
        "In a bowl, mix together: 1 1/2 cups (192 g) of all-purpose flour, 3/4 teaspoons (4.26 g) of salt, 2 tablespoons (30 g) of baking powder, 2 tablespoons (30 ml) of peanut oil, and 10 oz (295 ml) of cold water.",
        "This is the batter you will dip your oysters into.",
        "Line a colander with paper towels.",
        "Set up a frying rack or a colander with a paper towel in the bottom so you have a place to put your hot fried oysters.",
        "You don’t want to be dripping hot grease on your kitchen floor while you figure out where to put them.",
        "Heat up your oil to 375 degrees F (190 degrees C).",
        "Pour 5 cups of peanut oil into a deep pot or wok, and turn your burner on high.",
        "Use a heat-safe cooking thermometer to keep an eye on the temperature as it goes up.",
        "When it reaches 375 degrees F (190 degrees C), it’s time to fry your oysters.",
        "Take care around hot oil, which can cause severe burns.",
        "Batter five oysters.",
        "While your oil is heating up, dip five oysters in the batter and place them on a clean plate.",
        "You can use a fork to dip the oysters, or use clean fingers.",
        "Place the oysters in the hot oil.",
        "When your oil has reached temperature, you will see a whisp of white smoke.",
        "Gently lower the oysters into the oil with a frying spider or one by one with a fork.",
        "Take care not to splash the hot oil, as you might burn yourself.",
        "Set a timer for 3 minutes.",
        "Keep an eye on the oysters as they fry.",
        "If they look like they are browning too quickly, turn down the temperature of your oil a bit.",
        "If they look like they are frying too slowly, turn it up a little.",
        "Adding cold oysters to your oil will naturally lower the temperature of the oil a little.",
        "While the oysters fry, batter five more.",
        "Repeat this process as you go.",
        "Remove the oysters once they are light golden brown.",
        "When the timer is up, remove the oysters gently with a frying spider or a metal slotted spoon to avoid disturbing the breading.",
        "Place them on the prepared colander or frying rack to let the excess oil drip off.",
        "Fry the oysters a final time for 2 minutes.",
        "Once you’ve done a first fry on all the oysters, fry them a final time to a golden brown for 2 minutes in batches of five.",
        "Using a metal slotted spoon or frying spider, lower the oysters into your hot oil once more.",
        "Set a timer, and while your oysters fry, change out the paper towels in your colander or under your frying rack to absorb any excess oil.",
        "Your finished oysters should be a deep golden brown.",
        "This last fry ensures all your oysters are hot and ready to serve at around the same time.",
        "Serve your oysters.",
        "Garnish your oysters with lemon, parsley or any other accompaniments you like.",
        "They’re best eaten hot!",
        "It’s difficult to properly reheat oysters in a food-safe way.",
        "Plan on eating all your oysters right after you cook them."
    ]
}