{
    "title": "How to Make Freeze Dried Ice Cream",
    "url": "https://www.wikihow.com/Make-Freeze-Dried-Ice-Cream",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Desserts and Sweets",
        "Ice Cream and Frozen Desserts"
    ],
    "methods": [
        {
            "name": "Freeze Dryer Ice Cream",
            "steps": [
                {
                    "headline": "Place the ice cream on the freeze dryer tray.",
                    "description": "You can use 1.5 quarts (1.4 l) of homemade or store-bought ice cream in the flavor of your choice. Use an ice cream scoop to place individual servings of the ice cream on the tray from your freeze dryer or soften the ice cream slightly so you can spread it in a thin layer across the tray. If you spread the ice cream in a layer across the freeze dryer tray, you can then break it into individual pieces once it’s freeze dried. If you have multiple trays for your freeze dryer, you can freeze dry more than 1.5 quarts (1.4 l) of ice cream."
                },
                {
                    "headline": "Chill the ice cream in the freezer for a bit.",
                    "description": "While the freeze dryer will freeze the ice cream to a temperature as low as -30°F (-34°C), it helps to place the tray with the ice cream in your freezer for 1 to 2 hours. This will allow you to reduce the freeze time in the freeze dryer by 1 to 1 ½ hours. This step is optional. You can place the ice cream directly in the freeze dryer if you prefer. Cover the ice cream with plastic wrap before you place the tray in the freezer to keep it from picking up other flavors or scents."
                },
                {
                    "headline": "Load the tray in the freeze dryer and set the appropriate freeze and dry times.",
                    "description": "Slide the tray into the freeze dryer so it’s securely in place. Turn the appliance on, and choose the appropriate freeze and dry times for the ice cream according to the manufacturer’s instructions. You can experiment with different times to find which settings you like best for freeze dried ice cream. The proper freeze and dry time may depend on the freeze dryer that you’re using, so it’s important to consult the manual to get better idea of what settings are appropriate. If you’re not sure what freeze and dry times to use, start with 12 hours of freeze time and 12 hours of dry time and see how you like the results. You can also just use the default setting the first time that you freeze dry the ice cream and see how it turns out."
                },
                {
                    "headline": "Allow the dryer to run.",
                    "description": "It will take a while for the ice cream to freeze dry. In some cases, it may take a day or more. Don’t open the dryer to check on the ice cream while it’s running because you’ll interrupt the freeze drying process and wind up with ice cream that isn’t properly freeze dried."
                },
                {
                    "headline": "Test the ice cream for dryness.",
                    "description": "When the freeze dryer has finished its freezing and drying cycles, remove the tray from the appliance. Find one of the thickest parts of the ice cream and break it in half or taste it. If there’s any moisture left, you will notice coldness and wetness."
                },
                {
                    "headline": "Add more dry time if necessary.",
                    "description": "If you notice that there’s still moisture left in the ice cream, set the freezer dryer to add more drying time. Another couple of hours should be sufficient to finish drying the ice cream, depending on how long you originally set it to dry."
                },
                {
                    "headline": "Remove the ice cream from the tray and enjoy.",
                    "description": "Once the ice cream is dry, you can remove it from the tray. If you spread it in a single layer on the tray, use a knife or fork to break it into individual pieces. You can eat the ice cream right away or place it in airtight containers for storage. There’s no need to refrigerate freeze dried ice cream. It can last up to 25 years at room temperature."
                }
            ]
        },
        {
            "name": "Making Faux Freeze Dried Ice Cream",
            "steps": [
                {
                    "headline": "Preheat the oven and arrange the racks.",
                    "description": "Set your oven’s temperature to 200°F (93°C) or the Low setting, and allow it to fully heat. Make sure that the racks are positioned in the upper and lower thirds of the oven as well."
                },
                {
                    "headline": "Line a baking sheet.",
                    "description": "You’ll need a baking sheet to bake the meringue in the oven and dry out the pieces. Placing a piece of parchment paper on the baking sheet keeps the meringue scoops from sticking during baking. You can substitute a silicone baking mat for the parchment paper if you prefer."
                },
                {
                    "headline": "Beat the egg whites until frothy.",
                    "description": "Add 4 large egg whites that are at room temperature to a large bowl. Whip the whites with an electric mixer on medium-low speed until they just get frothy, which should take about 45 seconds. To separate the egg whites from the yolk, break the egg against a flat surface, such as a countertop. Hold it over a bowl and break it open, so the yolk falls into the bottom half of the shell. Move the yolk back and forth between the halves, letting the white drip into the bowl below. Continue moving the yolk until all of the white is removed. You can save the yolk in the refrigerator for another recipe that requires it or discard it. You can also use a stand mixer to make the meringue."
                },
                {
                    "headline": "Mix in the cream of tartar and beat the mixture until thick.",
                    "description": "Add ¼ teaspoon (1 g) of cream of tartar to the egg whites. Raise the electric mixer’s speed to medium-high, and beat the mixture until the whites are the consistency of shaving cream, which should take about 2 minutes."
                },
                {
                    "headline": "Stir in the sugar and extract.",
                    "description": "Sprinkle 1 cup (200 g) of sugar and 1 tablespoon (15 ml) of a flavoring extract of your choice, such as vanilla, into the egg white mixture. If you like, you can also add a few drops of gel food coloring to color the meringue. Continue beating the mixture on medium-high until the sugar, extract, and coloring are fully incorporated. Be sure to use a flavoring extract, not an oil. If you’re using a more flavorful extract, such as peppermint or lemon, you may want to add a little less depending on how intense you want the flavor to be."
                },
                {
                    "headline": "Beat the mixture until stiff peaks form.",
                    "description": "When the sugar and extract are incorporated, continue whipping the egg white mixture on medium-high until stiff peaks form. You’ll know that the consistency is right if you turn the beater upside down and the peaks don’t droop."
                },
                {
                    "headline": "Drop the meringues in scoops on the baking sheet.",
                    "description": "Use a cookie scoop to create individual mounds of the meringue mixture and set them down on the parchment paper liner. If the meringue is sticking to the scoop, dip it in room temperature water and shake off the excess before scooping. You should use approximately 1 tablespoon (3 g) of meringue for each scoop. When you drop the meringue on the baking sheet, the mounds should resemble ice cream scoops."
                },
                {
                    "headline": "Smooth the meringues if necessary.",
                    "description": "If the mounds have any peaks or jagged bits, dip a spoon in water and run it over the area to flatten it. Make sure to shake the excess water off the spoon, though, so you don’t get the mounds too wet."
                },
                {
                    "headline": "Bake the meringues for 2 hours.",
                    "description": "Place the baking sheet in the preheated oven, and allow them to bake until they are dry and airy. Keep a close eye on the “ice cream” near the end of the baking time so they don’t take on any golden brown color."
                },
                {
                    "headline": "Cool the “ice cream” and serve.",
                    "description": "When the meringue mounds are finished baking, remove them from the oven and let them cool on the baking sheet for 5 to 10 minutes. Lift them off the sheet and serve immediately. You can store any leftover “ice cream” in an airtight container. It should stay fresh for up to 3 weeks."
                }
            ]
        }
    ],
    "tyn": [
        "Freeze Dryer Ice Cream",
        "Freeze dryer",
        "Freeze dryer tray",
        "Spoon (optional)",
        "Plastic wrap (optional)",
        "Airtight container for storage",
        "Faux Freeze Dried Ice Cream",
        "Baking sheet",
        "Parchment paper",
        "Large bowl",
        "Electric mixer",
        "Cookie scoop",
        "Spoon"
    ],
    "text": " Freeze Dryer Ice Cream Place the ice cream on the freeze dryer tray. You can use 1.5 quarts (1.4 l) of homemade or store-bought ice cream in the flavor of your choice. Use an ice cream scoop to place individual servings of the ice cream on the tray from your freeze dryer or soften the ice cream slightly so you can spread it in a thin layer across the tray. If you spread the ice cream in a layer across the freeze dryer tray, you can then break it into individual pieces once it’s freeze dried. If you have multiple trays for your freeze dryer, you can freeze dry more than 1.5 quarts (1.4 l) of ice cream. Chill the ice cream in the freezer for a bit. While the freeze dryer will freeze the ice cream to a temperature as low as -30°F (-34°C), it helps to place the tray with the ice cream in your freezer for 1 to 2 hours. This will allow you to reduce the freeze time in the freeze dryer by 1 to 1 ½ hours. This step is optional. You can place the ice cream directly in the freeze dryer if you prefer. Cover the ice cream with plastic wrap before you place the tray in the freezer to keep it from picking up other flavors or scents. Load the tray in the freeze dryer and set the appropriate freeze and dry times. Slide the tray into the freeze dryer so it’s securely in place. Turn the appliance on, and choose the appropriate freeze and dry times for the ice cream according to the manufacturer’s instructions. You can experiment with different times to find which settings you like best for freeze dried ice cream. The proper freeze and dry time may depend on the freeze dryer that you’re using, so it’s important to consult the manual to get better idea of what settings are appropriate. If you’re not sure what freeze and dry times to use, start with 12 hours of freeze time and 12 hours of dry time and see how you like the results. You can also just use the default setting the first time that you freeze dry the ice cream and see how it turns out. Allow the dryer to run. It will take a while for the ice cream to freeze dry. In some cases, it may take a day or more. Don’t open the dryer to check on the ice cream while it’s running because you’ll interrupt the freeze drying process and wind up with ice cream that isn’t properly freeze dried. Test the ice cream for dryness. When the freeze dryer has finished its freezing and drying cycles, remove the tray from the appliance. Find one of the thickest parts of the ice cream and break it in half or taste it. If there’s any moisture left, you will notice coldness and wetness. Add more dry time if necessary. If you notice that there’s still moisture left in the ice cream, set the freezer dryer to add more drying time. Another couple of hours should be sufficient to finish drying the ice cream, depending on how long you originally set it to dry. Remove the ice cream from the tray and enjoy. Once the ice cream is dry, you can remove it from the tray. If you spread it in a single layer on the tray, use a knife or fork to break it into individual pieces. You can eat the ice cream right away or place it in airtight containers for storage. There’s no need to refrigerate freeze dried ice cream. It can last up to 25 years at room temperature. Making Faux Freeze Dried Ice Cream Preheat the oven and arrange the racks. Set your oven’s temperature to 200°F (93°C) or the Low setting, and allow it to fully heat. Make sure that the racks are positioned in the upper and lower thirds of the oven as well. Line a baking sheet. You’ll need a baking sheet to bake the meringue in the oven and dry out the pieces. Placing a piece of parchment paper on the baking sheet keeps the meringue scoops from sticking during baking. You can substitute a silicone baking mat for the parchment paper if you prefer. Beat the egg whites until frothy. Add 4 large egg whites that are at room temperature to a large bowl. Whip the whites with an electric mixer on medium-low speed until they just get frothy, which should take about 45 seconds. To separate the egg whites from the yolk, break the egg against a flat surface, such as a countertop. Hold it over a bowl and break it open, so the yolk falls into the bottom half of the shell. Move the yolk back and forth between the halves, letting the white drip into the bowl below. Continue moving the yolk until all of the white is removed. You can save the yolk in the refrigerator for another recipe that requires it or discard it. You can also use a stand mixer to make the meringue. Mix in the cream of tartar and beat the mixture until thick. Add ¼ teaspoon (1 g) of cream of tartar to the egg whites. Raise the electric mixer’s speed to medium-high, and beat the mixture until the whites are the consistency of shaving cream, which should take about 2 minutes. Stir in the sugar and extract. Sprinkle 1 cup (200 g) of sugar and 1 tablespoon (15 ml) of a flavoring extract of your choice, such as vanilla, into the egg white mixture. If you like, you can also add a few drops of gel food coloring to color the meringue. Continue beating the mixture on medium-high until the sugar, extract, and coloring are fully incorporated. Be sure to use a flavoring extract, not an oil. If you’re using a more flavorful extract, such as peppermint or lemon, you may want to add a little less depending on how intense you want the flavor to be. Beat the mixture until stiff peaks form. When the sugar and extract are incorporated, continue whipping the egg white mixture on medium-high until stiff peaks form. You’ll know that the consistency is right if you turn the beater upside down and the peaks don’t droop. Drop the meringues in scoops on the baking sheet. Use a cookie scoop to create individual mounds of the meringue mixture and set them down on the parchment paper liner. If the meringue is sticking to the scoop, dip it in room temperature water and shake off the excess before scooping. You should use approximately 1 tablespoon (3 g) of meringue for each scoop. When you drop the meringue on the baking sheet, the mounds should resemble ice cream scoops. Smooth the meringues if necessary. If the mounds have any peaks or jagged bits, dip a spoon in water and run it over the area to flatten it. Make sure to shake the excess water off the spoon, though, so you don’t get the mounds too wet. Bake the meringues for 2 hours. Place the baking sheet in the preheated oven, and allow them to bake until they are dry and airy. Keep a close eye on the “ice cream” near the end of the baking time so they don’t take on any golden brown color. Cool the “ice cream” and serve. When the meringue mounds are finished baking, remove them from the oven and let them cool on the baking sheet for 5 to 10 minutes. Lift them off the sheet and serve immediately. You can store any leftover “ice cream” in an airtight container. It should stay fresh for up to 3 weeks.",
    "sentences": [
        " Freeze Dryer Ice Cream Place the ice cream on the freeze dryer tray.",
        "You can use 1.5 quarts (1.4 l) of homemade or store-bought ice cream in the flavor of your choice.",
        "Use an ice cream scoop to place individual servings of the ice cream on the tray from your freeze dryer or soften the ice cream slightly so you can spread it in a thin layer across the tray.",
        "If you spread the ice cream in a layer across the freeze dryer tray, you can then break it into individual pieces once it’s freeze dried.",
        "If you have multiple trays for your freeze dryer, you can freeze dry more than 1.5 quarts (1.4 l) of ice cream.",
        "Chill the ice cream in the freezer for a bit.",
        "While the freeze dryer will freeze the ice cream to a temperature as low as -30°F (-34°C), it helps to place the tray with the ice cream in your freezer for 1 to 2 hours.",
        "This will allow you to reduce the freeze time in the freeze dryer by 1 to 1 ½ hours.",
        "This step is optional.",
        "You can place the ice cream directly in the freeze dryer if you prefer.",
        "Cover the ice cream with plastic wrap before you place the tray in the freezer to keep it from picking up other flavors or scents.",
        "Load the tray in the freeze dryer and set the appropriate freeze and dry times.",
        "Slide the tray into the freeze dryer so it’s securely in place.",
        "Turn the appliance on, and choose the appropriate freeze and dry times for the ice cream according to the manufacturer’s instructions.",
        "You can experiment with different times to find which settings you like best for freeze dried ice cream.",
        "The proper freeze and dry time may depend on the freeze dryer that you’re using, so it’s important to consult the manual to get better idea of what settings are appropriate.",
        "If you’re not sure what freeze and dry times to use, start with 12 hours of freeze time and 12 hours of dry time and see how you like the results.",
        "You can also just use the default setting the first time that you freeze dry the ice cream and see how it turns out.",
        "Allow the dryer to run.",
        "It will take a while for the ice cream to freeze dry.",
        "In some cases, it may take a day or more.",
        "Don’t open the dryer to check on the ice cream while it’s running because you’ll interrupt the freeze drying process and wind up with ice cream that isn’t properly freeze dried.",
        "Test the ice cream for dryness.",
        "When the freeze dryer has finished its freezing and drying cycles, remove the tray from the appliance.",
        "Find one of the thickest parts of the ice cream and break it in half or taste it.",
        "If there’s any moisture left, you will notice coldness and wetness.",
        "Add more dry time if necessary.",
        "If you notice that there’s still moisture left in the ice cream, set the freezer dryer to add more drying time.",
        "Another couple of hours should be sufficient to finish drying the ice cream, depending on how long you originally set it to dry.",
        "Remove the ice cream from the tray and enjoy.",
        "Once the ice cream is dry, you can remove it from the tray.",
        "If you spread it in a single layer on the tray, use a knife or fork to break it into individual pieces.",
        "You can eat the ice cream right away or place it in airtight containers for storage.",
        "There’s no need to refrigerate freeze dried ice cream.",
        "It can last up to 25 years at room temperature.",
        "Making Faux Freeze Dried Ice Cream Preheat the oven and arrange the racks.",
        "Set your oven’s temperature to 200°F (93°C) or the Low setting, and allow it to fully heat.",
        "Make sure that the racks are positioned in the upper and lower thirds of the oven as well.",
        "Line a baking sheet.",
        "You’ll need a baking sheet to bake the meringue in the oven and dry out the pieces.",
        "Placing a piece of parchment paper on the baking sheet keeps the meringue scoops from sticking during baking.",
        "You can substitute a silicone baking mat for the parchment paper if you prefer.",
        "Beat the egg whites until frothy.",
        "Add 4 large egg whites that are at room temperature to a large bowl.",
        "Whip the whites with an electric mixer on medium-low speed until they just get frothy, which should take about 45 seconds.",
        "To separate the egg whites from the yolk, break the egg against a flat surface, such as a countertop.",
        "Hold it over a bowl and break it open, so the yolk falls into the bottom half of the shell.",
        "Move the yolk back and forth between the halves, letting the white drip into the bowl below.",
        "Continue moving the yolk until all of the white is removed.",
        "You can save the yolk in the refrigerator for another recipe that requires it or discard it.",
        "You can also use a stand mixer to make the meringue.",
        "Mix in the cream of tartar and beat the mixture until thick.",
        "Add ¼ teaspoon (1 g) of cream of tartar to the egg whites.",
        "Raise the electric mixer’s speed to medium-high, and beat the mixture until the whites are the consistency of shaving cream, which should take about 2 minutes.",
        "Stir in the sugar and extract.",
        "Sprinkle 1 cup (200 g) of sugar and 1 tablespoon (15 ml) of a flavoring extract of your choice, such as vanilla, into the egg white mixture.",
        "If you like, you can also add a few drops of gel food coloring to color the meringue.",
        "Continue beating the mixture on medium-high until the sugar, extract, and coloring are fully incorporated.",
        "Be sure to use a flavoring extract, not an oil.",
        "If you’re using a more flavorful extract, such as peppermint or lemon, you may want to add a little less depending on how intense you want the flavor to be.",
        "Beat the mixture until stiff peaks form.",
        "When the sugar and extract are incorporated, continue whipping the egg white mixture on medium-high until stiff peaks form.",
        "You’ll know that the consistency is right if you turn the beater upside down and the peaks don’t droop.",
        "Drop the meringues in scoops on the baking sheet.",
        "Use a cookie scoop to create individual mounds of the meringue mixture and set them down on the parchment paper liner.",
        "If the meringue is sticking to the scoop, dip it in room temperature water and shake off the excess before scooping.",
        "You should use approximately 1 tablespoon (3 g) of meringue for each scoop.",
        "When you drop the meringue on the baking sheet, the mounds should resemble ice cream scoops.",
        "Smooth the meringues if necessary.",
        "If the mounds have any peaks or jagged bits, dip a spoon in water and run it over the area to flatten it.",
        "Make sure to shake the excess water off the spoon, though, so you don’t get the mounds too wet.",
        "Bake the meringues for 2 hours.",
        "Place the baking sheet in the preheated oven, and allow them to bake until they are dry and airy.",
        "Keep a close eye on the “ice cream” near the end of the baking time so they don’t take on any golden brown color.",
        "Cool the “ice cream” and serve.",
        "When the meringue mounds are finished baking, remove them from the oven and let them cool on the baking sheet for 5 to 10 minutes.",
        "Lift them off the sheet and serve immediately.",
        "You can store any leftover “ice cream” in an airtight container.",
        "It should stay fresh for up to 3 weeks."
    ]
}