{
    "title": "How to Make a Mimosa Bar",
    "url": "https://www.wikihow.com/Make-a-Mimosa-Bar",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Alcoholic Drinks"
    ],
    "parts": [
        {
            "name": "Picking Your Mimosa Ingredients",
            "steps": [
                {
                    "headline": "Choose a few types of sparkling wine.",
                    "description": "No mimosa is complete without the bubbly. Start by selecting a few types of sparkling wine for your bar to accommodate different tastes and mix with different juices. Try wines like:\nA Cava or Brut for a dry taste\nProsecco for a light but sweet flavor\nChampagne for a rich and creamy flavor\nSparkling rosé for floral and fruity notes"
                },
                {
                    "headline": "Figure out the amount of wine you need.",
                    "description": "The average bottle of sparkling wine is enough to make about 6-8 mimosas. Beyond that, it is always a good idea to have an extra bottle or 2 in case 1 breaks or your guests have a heavy hand. That means that for a party of 10 people to have 3 drinks each, you would need 5 bottles, plus 1 or 2 on reserve."
                },
                {
                    "headline": "Have a non-alcoholic wine substitute.",
                    "description": "Some of your guests may appreciate having a non-alcoholic option in addition to sparkling wine. Club soda, sparkling apple cider, and sparkling grape juice are all great substitutes for those who don’t wish to partake."
                },
                {
                    "headline": "Pick your juices.",
                    "description": "A traditional mimosa is sparkling wine and orange juice, but you don’t have to stop there. Having a variety of juices lets guests customize their cocktails and create new, delicious drinks. You can even make some fresh-squeezed juice if you have a juicer at home. Other juices to consider include:\nOrange mango\nLemonade or pink lemonade\nCranberry\nBlackberry or raspberry\nGrapefruit\nPomegranate\nPeach"
                },
                {
                    "headline": "Find fresh fruit for garnish.",
                    "description": "No mimosa is complete without fresh fruit for garnish. Some, like berries, can be served whole. Others, like oranges, do better sliced so that they can fit into the glass. Fruit options can include:\nStrawberries\nRaspberries or blackberries\nBlueberries\nPomegranate seeds\nOrange slices\nApple slices\nPineapple slices\nPeach slices"
                },
                {
                    "headline": "Include some snacks.",
                    "description": "If you are not doing your mimosa bar as an addition to a meal like brunch or an event with hors-d'oeuvres, include a few snacks. Cake pops or cupcakes, pretzels, a cheese plate, fruit and veggie platters, and crackers can all help your guests keep away their munchies while they enjoy their mimosas."
                }
            ]
        },
        {
            "name": "Preparing Your Bar",
            "steps": [
                {
                    "headline": "Put your sparkling wines on ice.",
                    "description": "Fill a few coolers or a large, decorative tub about three-quarters of the way with ice. Add your sparkling wine bottles to the ice, gently pushing some up around the base to keep the wine cool. If you don’t have wine coolers, a large, decorative vase or a painted flower pot can be used in its place. Have 2 or 3 bottles out at your bar at a time. Keep the rest in the fridge and bring them out as guests go through the chilled bottles."
                },
                {
                    "headline": "Pour your juices into pitchers.",
                    "description": "There is absolutely nothing wrong with putting your juices out in their bottles. If you want a more uniform look, though, pour your juices into a few matching pitchers or carafes. These are readily available at a broad variety of price points from home goods stores, dollar stores, and online. Add decorative labels to your pitchers to let guests know what they’re drinking. Tie a die cut label to a piece of ribbon or twine around the neck or handle of the pitcher."
                },
                {
                    "headline": "Slice and plate your fruit.",
                    "description": "Slice and peel fruits as necessary before your guests arrive. Then, set it out on a plate or in dishes in whatever arrangement looks good to you. Decorative serving bowls are good options for berries and small fruits, while slices might be easier to get on a platter. Set out utensils such as spoons or tongs so to make serving easy and sanitary. Alternatively, wooden, plastic, or bamboo stirring sticks can be used to skewer fruit. You can even find fun, decorative stirrers that match your party’s theme or decor."
                },
                {
                    "headline": "Put out your champagne flutes.",
                    "description": "If you have 10 or 20 champagne flutes at your house, all you need to do is put them out. Otherwise, you may need to assemble some plastic flutes. Snap the base onto the flute and set them out on your table. Make things a bit more decorative by adding some colored or patterned straws to the glasses."
                }
            ]
        },
        {
            "name": "Staging Your Bar Table",
            "steps": [
                {
                    "headline": "Lay out a tablecloth.",
                    "description": "Tablecloths give your table a clean look, and they make cleanup easier for you. Lay out a tablecloth before you put out your mimosa ingredients. Use a disposable one if you want an especially quick and easy cleanup once your event is done. You can also add a decorative table runner to give your bar a bit more color. A stretch of colored or patterned fabric works perfectly. Opt for burlap to give your table a rustic chic feel, or a runner of chalkboard paper along with some paint makers for your guests to doodle on and make a decorative guest book."
                },
                {
                    "headline": "Set out your ingredients in order of use.",
                    "description": "Make things easy on your guests and yourself by creating a flow to your table. Set your mimosa components out in order of use: glasses, sparkling wine, juice, fruit."
                },
                {
                    "headline": "Set out your stirrers and straws in decorative containers.",
                    "description": "Uses vases, glasses, or mason jars to set out your stirrers and straws. Tie ribbons or small tissue paper garlands around the containers to add a bit of extra flare."
                },
                {
                    "headline": "Set up flowers in a vase.",
                    "description": "Flowers are a great accent for a mimosa bar. You can add single flowers to a bud vase or a bouquet to a vase or mason jar. You can even put out potted succulents or cacti if you want a more contemporary aesthetic. Add 1 or 2 floral pieces to your table as you see fit. Choose flowers with no smell like sunflowers, dahlias, and hibiscus if you can. Fragrance can impact how your drinks taste, so getting fragrance-free flowers keeps your drinks at their best. It’s also kind for guests with allergies."
                },
                {
                    "headline": "Put out a basic mimosa recipe.",
                    "description": "You can paint, print, or otherwise decorate a basic mimosa recipe. This will help your guests get the flow of your mimosa bar. Keep in mind that generally, a mimosa is one-third juice and two-thirds champagne. Put the recipe in a dollar store frame and prop it up on your table. Steps may include:\nGrab a glass\nFill it up one-third of the way with juice\nTop it off with some bubbly\nAdd in some fresh fruit\nDrink and enjoy!"
                },
                {
                    "headline": "Add table decorations that match your theme.",
                    "description": "Small table decorations like framed welcome signs, ceramic figurines of things like fruit, and paper decorations like banners are all welcome additions. Add decor that fits the size of your table and the color scheme or theme of your event. Look online for pictures of other mimosa bars to help you find inspiration for your own decor."
                }
            ]
        }
    ],
    "tyn": [
        "Sparkling wine",
        "Non-alcoholic sparkling juices",
        "A selection of fruit juices",
        "A variety of fresh fruits",
        "Plastic champagne flutes",
        "Wine coolers",
        "Decorative vases",
        "Decorative jars",
        "Colored straws",
        "Tablecloth",
        "Flowers",
        "Ribbons or twine",
        "Die cut labels",
        "Table decorations",
        "Wooden or plastic stirring sticks"
    ],
    "text": " Picking Your Mimosa Ingredients Choose a few types of sparkling wine. No mimosa is complete without the bubbly. Start by selecting a few types of sparkling wine for your bar to accommodate different tastes and mix with different juices. Try wines like:\nA Cava or Brut for a dry taste\nProsecco for a light but sweet flavor\nChampagne for a rich and creamy flavor\nSparkling rosé for floral and fruity notes Figure out the amount of wine you need. The average bottle of sparkling wine is enough to make about 6-8 mimosas. Beyond that, it is always a good idea to have an extra bottle or 2 in case 1 breaks or your guests have a heavy hand. That means that for a party of 10 people to have 3 drinks each, you would need 5 bottles, plus 1 or 2 on reserve. Have a non-alcoholic wine substitute. Some of your guests may appreciate having a non-alcoholic option in addition to sparkling wine. Club soda, sparkling apple cider, and sparkling grape juice are all great substitutes for those who don’t wish to partake. Pick your juices. A traditional mimosa is sparkling wine and orange juice, but you don’t have to stop there. Having a variety of juices lets guests customize their cocktails and create new, delicious drinks. You can even make some fresh-squeezed juice if you have a juicer at home. Other juices to consider include:\nOrange mango\nLemonade or pink lemonade\nCranberry\nBlackberry or raspberry\nGrapefruit\nPomegranate\nPeach Find fresh fruit for garnish. No mimosa is complete without fresh fruit for garnish. Some, like berries, can be served whole. Others, like oranges, do better sliced so that they can fit into the glass. Fruit options can include:\nStrawberries\nRaspberries or blackberries\nBlueberries\nPomegranate seeds\nOrange slices\nApple slices\nPineapple slices\nPeach slices Include some snacks. If you are not doing your mimosa bar as an addition to a meal like brunch or an event with hors-d'oeuvres, include a few snacks. Cake pops or cupcakes, pretzels, a cheese plate, fruit and veggie platters, and crackers can all help your guests keep away their munchies while they enjoy their mimosas. Preparing Your Bar Put your sparkling wines on ice. Fill a few coolers or a large, decorative tub about three-quarters of the way with ice. Add your sparkling wine bottles to the ice, gently pushing some up around the base to keep the wine cool. If you don’t have wine coolers, a large, decorative vase or a painted flower pot can be used in its place. Have 2 or 3 bottles out at your bar at a time. Keep the rest in the fridge and bring them out as guests go through the chilled bottles. Pour your juices into pitchers. There is absolutely nothing wrong with putting your juices out in their bottles. If you want a more uniform look, though, pour your juices into a few matching pitchers or carafes. These are readily available at a broad variety of price points from home goods stores, dollar stores, and online. Add decorative labels to your pitchers to let guests know what they’re drinking. Tie a die cut label to a piece of ribbon or twine around the neck or handle of the pitcher. Slice and plate your fruit. Slice and peel fruits as necessary before your guests arrive. Then, set it out on a plate or in dishes in whatever arrangement looks good to you. Decorative serving bowls are good options for berries and small fruits, while slices might be easier to get on a platter. Set out utensils such as spoons or tongs so to make serving easy and sanitary. Alternatively, wooden, plastic, or bamboo stirring sticks can be used to skewer fruit. You can even find fun, decorative stirrers that match your party’s theme or decor. Put out your champagne flutes. If you have 10 or 20 champagne flutes at your house, all you need to do is put them out. Otherwise, you may need to assemble some plastic flutes. Snap the base onto the flute and set them out on your table. Make things a bit more decorative by adding some colored or patterned straws to the glasses. Staging Your Bar Table Lay out a tablecloth. Tablecloths give your table a clean look, and they make cleanup easier for you. Lay out a tablecloth before you put out your mimosa ingredients. Use a disposable one if you want an especially quick and easy cleanup once your event is done. You can also add a decorative table runner to give your bar a bit more color. A stretch of colored or patterned fabric works perfectly. Opt for burlap to give your table a rustic chic feel, or a runner of chalkboard paper along with some paint makers for your guests to doodle on and make a decorative guest book. Set out your ingredients in order of use. Make things easy on your guests and yourself by creating a flow to your table. Set your mimosa components out in order of use: glasses, sparkling wine, juice, fruit. Set out your stirrers and straws in decorative containers. Uses vases, glasses, or mason jars to set out your stirrers and straws. Tie ribbons or small tissue paper garlands around the containers to add a bit of extra flare. Set up flowers in a vase. Flowers are a great accent for a mimosa bar. You can add single flowers to a bud vase or a bouquet to a vase or mason jar. You can even put out potted succulents or cacti if you want a more contemporary aesthetic. Add 1 or 2 floral pieces to your table as you see fit. Choose flowers with no smell like sunflowers, dahlias, and hibiscus if you can. Fragrance can impact how your drinks taste, so getting fragrance-free flowers keeps your drinks at their best. It’s also kind for guests with allergies. Put out a basic mimosa recipe. You can paint, print, or otherwise decorate a basic mimosa recipe. This will help your guests get the flow of your mimosa bar. Keep in mind that generally, a mimosa is one-third juice and two-thirds champagne. Put the recipe in a dollar store frame and prop it up on your table. Steps may include:\nGrab a glass\nFill it up one-third of the way with juice\nTop it off with some bubbly\nAdd in some fresh fruit\nDrink and enjoy! Add table decorations that match your theme. Small table decorations like framed welcome signs, ceramic figurines of things like fruit, and paper decorations like banners are all welcome additions. Add decor that fits the size of your table and the color scheme or theme of your event. Look online for pictures of other mimosa bars to help you find inspiration for your own decor.",
    "sentences": [
        " Picking Your Mimosa Ingredients Choose a few types of sparkling wine.",
        "No mimosa is complete without the bubbly.",
        "Start by selecting a few types of sparkling wine for your bar to accommodate different tastes and mix with different juices.",
        "Try wines like:\nA Cava or Brut for a dry taste\nProsecco for a light but sweet flavor\nChampagne for a rich and creamy flavor\nSparkling rosé for floral and fruity notes Figure out the amount of wine you need.",
        "The average bottle of sparkling wine is enough to make about 6-8 mimosas.",
        "Beyond that, it is always a good idea to have an extra bottle or 2 in case 1 breaks or your guests have a heavy hand.",
        "That means that for a party of 10 people to have 3 drinks each, you would need 5 bottles, plus 1 or 2 on reserve.",
        "Have a non-alcoholic wine substitute.",
        "Some of your guests may appreciate having a non-alcoholic option in addition to sparkling wine.",
        "Club soda, sparkling apple cider, and sparkling grape juice are all great substitutes for those who don’t wish to partake.",
        "Pick your juices.",
        "A traditional mimosa is sparkling wine and orange juice, but you don’t have to stop there.",
        "Having a variety of juices lets guests customize their cocktails and create new, delicious drinks.",
        "You can even make some fresh-squeezed juice if you have a juicer at home.",
        "Other juices to consider include:\nOrange mango\nLemonade or pink lemonade\nCranberry\nBlackberry or raspberry\nGrapefruit\nPomegranate\nPeach Find fresh fruit for garnish.",
        "No mimosa is complete without fresh fruit for garnish.",
        "Some, like berries, can be served whole.",
        "Others, like oranges, do better sliced so that they can fit into the glass.",
        "Fruit options can include:\nStrawberries\nRaspberries or blackberries\nBlueberries\nPomegranate seeds\nOrange slices\nApple slices\nPineapple slices\nPeach slices Include some snacks.",
        "If you are not doing your mimosa bar as an addition to a meal like brunch or an event with hors-d'oeuvres, include a few snacks.",
        "Cake pops or cupcakes, pretzels, a cheese plate, fruit and veggie platters, and crackers can all help your guests keep away their munchies while they enjoy their mimosas.",
        "Preparing Your Bar Put your sparkling wines on ice.",
        "Fill a few coolers or a large, decorative tub about three-quarters of the way with ice.",
        "Add your sparkling wine bottles to the ice, gently pushing some up around the base to keep the wine cool.",
        "If you don’t have wine coolers, a large, decorative vase or a painted flower pot can be used in its place.",
        "Have 2 or 3 bottles out at your bar at a time.",
        "Keep the rest in the fridge and bring them out as guests go through the chilled bottles.",
        "Pour your juices into pitchers.",
        "There is absolutely nothing wrong with putting your juices out in their bottles.",
        "If you want a more uniform look, though, pour your juices into a few matching pitchers or carafes.",
        "These are readily available at a broad variety of price points from home goods stores, dollar stores, and online.",
        "Add decorative labels to your pitchers to let guests know what they’re drinking.",
        "Tie a die cut label to a piece of ribbon or twine around the neck or handle of the pitcher.",
        "Slice and plate your fruit.",
        "Slice and peel fruits as necessary before your guests arrive.",
        "Then, set it out on a plate or in dishes in whatever arrangement looks good to you.",
        "Decorative serving bowls are good options for berries and small fruits, while slices might be easier to get on a platter.",
        "Set out utensils such as spoons or tongs so to make serving easy and sanitary.",
        "Alternatively, wooden, plastic, or bamboo stirring sticks can be used to skewer fruit.",
        "You can even find fun, decorative stirrers that match your party’s theme or decor.",
        "Put out your champagne flutes.",
        "If you have 10 or 20 champagne flutes at your house, all you need to do is put them out.",
        "Otherwise, you may need to assemble some plastic flutes.",
        "Snap the base onto the flute and set them out on your table.",
        "Make things a bit more decorative by adding some colored or patterned straws to the glasses.",
        "Staging Your Bar Table Lay out a tablecloth.",
        "Tablecloths give your table a clean look, and they make cleanup easier for you.",
        "Lay out a tablecloth before you put out your mimosa ingredients.",
        "Use a disposable one if you want an especially quick and easy cleanup once your event is done.",
        "You can also add a decorative table runner to give your bar a bit more color.",
        "A stretch of colored or patterned fabric works perfectly.",
        "Opt for burlap to give your table a rustic chic feel, or a runner of chalkboard paper along with some paint makers for your guests to doodle on and make a decorative guest book.",
        "Set out your ingredients in order of use.",
        "Make things easy on your guests and yourself by creating a flow to your table.",
        "Set your mimosa components out in order of use: glasses, sparkling wine, juice, fruit.",
        "Set out your stirrers and straws in decorative containers.",
        "Uses vases, glasses, or mason jars to set out your stirrers and straws.",
        "Tie ribbons or small tissue paper garlands around the containers to add a bit of extra flare.",
        "Set up flowers in a vase.",
        "Flowers are a great accent for a mimosa bar.",
        "You can add single flowers to a bud vase or a bouquet to a vase or mason jar.",
        "You can even put out potted succulents or cacti if you want a more contemporary aesthetic.",
        "Add 1 or 2 floral pieces to your table as you see fit.",
        "Choose flowers with no smell like sunflowers, dahlias, and hibiscus if you can.",
        "Fragrance can impact how your drinks taste, so getting fragrance-free flowers keeps your drinks at their best.",
        "It’s also kind for guests with allergies.",
        "Put out a basic mimosa recipe.",
        "You can paint, print, or otherwise decorate a basic mimosa recipe.",
        "This will help your guests get the flow of your mimosa bar.",
        "Keep in mind that generally, a mimosa is one-third juice and two-thirds champagne.",
        "Put the recipe in a dollar store frame and prop it up on your table.",
        "Steps may include:\nGrab a glass\nFill it up one-third of the way with juice\nTop it off with some bubbly\nAdd in some fresh fruit\nDrink and enjoy!",
        "Add table decorations that match your theme.",
        "Small table decorations like framed welcome signs, ceramic figurines of things like fruit, and paper decorations like banners are all welcome additions.",
        "Add decor that fits the size of your table and the color scheme or theme of your event.",
        "Look online for pictures of other mimosa bars to help you find inspiration for your own decor."
    ]
}