{
    "title": "How to Fill Nail Holes in Trim",
    "url": "https://www.wikihow.com/Fill-Nail-Holes-in-Trim",
    "category_hierarchy": [
        "Home and Garden",
        "Tools"
    ],
    "parts": [
        {
            "name": "Smoothing Over the Nail Holes",
            "steps": [
                {
                    "headline": "Hammer in any nails that are protruding from the trim with a nail set.",
                    "description": "You can find a nail set at your local hardware store if you don’t have one. Hold the pointed end of the nail set on the head of the nail. Hammer the nail set so the nail goes into the trim. If the trim is held on with staples, use a flat-head screwdriver approximately the same size as the staples to tap them into the trim. Use a putty knife or painter’s 5-in-1 tool to pry up any staples or nails that are bent into the wood. Then, use needle-nose pliers to remove the staple or nail from the trim."
                },
                {
                    "headline": "Use a putty knife to scrape off any raised fragments around the holes.",
                    "description": "Sometimes nail holes in trim can form a raised edge. It’s important to get rid of these edges on the trim or they’ll show after you fill the holes. Scrape the putty knife across the surface of the nail hole a few times to smooth out the area around the hole. Be gentle when you’re using the putty knife. You don’t want to cause damage to the trim around the nail holes. If the trim has ridges or raised edges, use a butter knife to remove the fragments so you don’t damage the details."
                },
                {
                    "headline": "Smooth down the nail holes with fine-grit sandpaper.",
                    "description": "Any sandpaper with a grade between 120 and 220 will work. The sandpaper should be able to get off any raised fragments on the trim that the putty knife couldn’t. Brush the sandpaper across the surface of the nail holes a few times until they feel smooth."
                }
            ]
        },
        {
            "name": "Applying the Spackling",
            "steps": [
                {
                    "headline": "Get shrink-free spackling.",
                    "description": "Shrink-free spackling won’t shrink when it dries in the holes on the trim. Avoid spackling that shrinks or you could end up with dips in the holes you fill in. You can find shrink-free spackling online or at your local hardware store. You can use painter’s caulk or water-based wood filler as alternatives."
                },
                {
                    "headline": "Scoop out some spackling from the container with a putty knife.",
                    "description": "You don’t need a lot. You just want enough on the knife to fill in a nail hole. Scoop out the spackle with the end of the knife so it’s easier to press into a hole."
                },
                {
                    "headline": "Press the spackling on the knife into one of the nail holes.",
                    "description": "Start with the edge of the knife on one side of the hole at a 45-degree angle. Scrape the knife across the surface of the hole to the other side. Press firmly down on the knife so the spackling completely fills in the nail hole. Scrape across the surface of the hole two or three times to make sure the spackling is flat. To smooth out the spackling and/or fill the holes, you can also use your finger."
                },
                {
                    "headline": "Use a damp cloth to wipe away any excess spackling around the hole.",
                    "description": "Do this immediately after you spackle all the holes in the trim so the spackling doesn’t have time to dry."
                },
                {
                    "headline": "Let the spackling dry for 2-3 hours.",
                    "description": "Check back on the spackling after a few hours to see if it’s dry. If it’s not, let it continue drying. If you notice a dip in the spackling inside the nail hole, apply another coat and wait 2-3 more hours for the new coat of spackling to dry."
                },
                {
                    "headline": "Sand off excess spackling with a fine-grit sandpaper.",
                    "description": "Lightly brush the sandpaper across the surface of the trim where the hole is until the spackling is flush with the trim."
                }
            ]
        },
        {
            "name": "Painting Over the Holes",
            "steps": [
                {
                    "headline": "Wipe down and vacuum the trim so there’s no leftover dust.",
                    "description": "Any dust particles left on the trim may be visible after you finish painting. Use a paintbrush or cloth to wipe down the surface of the trim, and attach a brush head to the vacuum for the best results."
                },
                {
                    "headline": "Apply a spot primer over the spackled nail holes.",
                    "description": "Spot primer will prevent the spackling spots on the trim from looking different from the rest of the trim when they get painted over. Use a paintbrush to apply a thin coat of spot primer over each filled-in nail hole. You can find spot primer at your local hardware store."
                },
                {
                    "headline": "Put painter’s tape on any surfaces you don’t want paint to get on.",
                    "description": "Cover the parts of the walls directly around the trim. Apply a strip of painter’s tape to the floor if you’re painting a baseboard."
                },
                {
                    "headline": "Paint the trim using a paintbrush.",
                    "description": "Use the same paint that was used on the rest of the trim. You may need to do multiple coats before the paint looks even on the trim. If you sanded down the filled nail holes and primed them with a spot primer, they should be completely hidden behind the fresh paint."
                }
            ]
        }
    ],
    "tyn": [
        "Hammer",
        "Nail set",
        "Putty knife",
        "Fine-grit sandpaper",
        "Shrink-free spackling, painter’s caulk, or water-based wood filler",
        "Cloth",
        "Vacuum",
        "Spot primer",
        "Painter’s tape",
        "Paint",
        "Paint brush",
        "5-in-1 painter’s tool (optional)",
        "Needle-nose pliers (optional)",
        "Flat-head screwdriver (optional)",
        "Butter knife (optional)"
    ],
    "text": " Smoothing Over the Nail Holes Hammer in any nails that are protruding from the trim with a nail set. You can find a nail set at your local hardware store if you don’t have one. Hold the pointed end of the nail set on the head of the nail. Hammer the nail set so the nail goes into the trim. If the trim is held on with staples, use a flat-head screwdriver approximately the same size as the staples to tap them into the trim. Use a putty knife or painter’s 5-in-1 tool to pry up any staples or nails that are bent into the wood. Then, use needle-nose pliers to remove the staple or nail from the trim. Use a putty knife to scrape off any raised fragments around the holes. Sometimes nail holes in trim can form a raised edge. It’s important to get rid of these edges on the trim or they’ll show after you fill the holes. Scrape the putty knife across the surface of the nail hole a few times to smooth out the area around the hole. Be gentle when you’re using the putty knife. You don’t want to cause damage to the trim around the nail holes. If the trim has ridges or raised edges, use a butter knife to remove the fragments so you don’t damage the details. Smooth down the nail holes with fine-grit sandpaper. Any sandpaper with a grade between 120 and 220 will work. The sandpaper should be able to get off any raised fragments on the trim that the putty knife couldn’t. Brush the sandpaper across the surface of the nail holes a few times until they feel smooth. Applying the Spackling Get shrink-free spackling. Shrink-free spackling won’t shrink when it dries in the holes on the trim. Avoid spackling that shrinks or you could end up with dips in the holes you fill in. You can find shrink-free spackling online or at your local hardware store. You can use painter’s caulk or water-based wood filler as alternatives. Scoop out some spackling from the container with a putty knife. You don’t need a lot. You just want enough on the knife to fill in a nail hole. Scoop out the spackle with the end of the knife so it’s easier to press into a hole. Press the spackling on the knife into one of the nail holes. Start with the edge of the knife on one side of the hole at a 45-degree angle. Scrape the knife across the surface of the hole to the other side. Press firmly down on the knife so the spackling completely fills in the nail hole. Scrape across the surface of the hole two or three times to make sure the spackling is flat. To smooth out the spackling and/or fill the holes, you can also use your finger. Use a damp cloth to wipe away any excess spackling around the hole. Do this immediately after you spackle all the holes in the trim so the spackling doesn’t have time to dry. Let the spackling dry for 2-3 hours. Check back on the spackling after a few hours to see if it’s dry. If it’s not, let it continue drying. If you notice a dip in the spackling inside the nail hole, apply another coat and wait 2-3 more hours for the new coat of spackling to dry. Sand off excess spackling with a fine-grit sandpaper. Lightly brush the sandpaper across the surface of the trim where the hole is until the spackling is flush with the trim. Painting Over the Holes Wipe down and vacuum the trim so there’s no leftover dust. Any dust particles left on the trim may be visible after you finish painting. Use a paintbrush or cloth to wipe down the surface of the trim, and attach a brush head to the vacuum for the best results. Apply a spot primer over the spackled nail holes. Spot primer will prevent the spackling spots on the trim from looking different from the rest of the trim when they get painted over. Use a paintbrush to apply a thin coat of spot primer over each filled-in nail hole. You can find spot primer at your local hardware store. Put painter’s tape on any surfaces you don’t want paint to get on. Cover the parts of the walls directly around the trim. Apply a strip of painter’s tape to the floor if you’re painting a baseboard. Paint the trim using a paintbrush. Use the same paint that was used on the rest of the trim. You may need to do multiple coats before the paint looks even on the trim. If you sanded down the filled nail holes and primed them with a spot primer, they should be completely hidden behind the fresh paint.",
    "sentences": [
        " Smoothing Over the Nail Holes Hammer in any nails that are protruding from the trim with a nail set.",
        "You can find a nail set at your local hardware store if you don’t have one.",
        "Hold the pointed end of the nail set on the head of the nail.",
        "Hammer the nail set so the nail goes into the trim.",
        "If the trim is held on with staples, use a flat-head screwdriver approximately the same size as the staples to tap them into the trim.",
        "Use a putty knife or painter’s 5-in-1 tool to pry up any staples or nails that are bent into the wood.",
        "Then, use needle-nose pliers to remove the staple or nail from the trim.",
        "Use a putty knife to scrape off any raised fragments around the holes.",
        "Sometimes nail holes in trim can form a raised edge.",
        "It’s important to get rid of these edges on the trim or they’ll show after you fill the holes.",
        "Scrape the putty knife across the surface of the nail hole a few times to smooth out the area around the hole.",
        "Be gentle when you’re using the putty knife.",
        "You don’t want to cause damage to the trim around the nail holes.",
        "If the trim has ridges or raised edges, use a butter knife to remove the fragments so you don’t damage the details.",
        "Smooth down the nail holes with fine-grit sandpaper.",
        "Any sandpaper with a grade between 120 and 220 will work.",
        "The sandpaper should be able to get off any raised fragments on the trim that the putty knife couldn’t.",
        "Brush the sandpaper across the surface of the nail holes a few times until they feel smooth.",
        "Applying the Spackling Get shrink-free spackling.",
        "Shrink-free spackling won’t shrink when it dries in the holes on the trim.",
        "Avoid spackling that shrinks or you could end up with dips in the holes you fill in.",
        "You can find shrink-free spackling online or at your local hardware store.",
        "You can use painter’s caulk or water-based wood filler as alternatives.",
        "Scoop out some spackling from the container with a putty knife.",
        "You don’t need a lot.",
        "You just want enough on the knife to fill in a nail hole.",
        "Scoop out the spackle with the end of the knife so it’s easier to press into a hole.",
        "Press the spackling on the knife into one of the nail holes.",
        "Start with the edge of the knife on one side of the hole at a 45-degree angle.",
        "Scrape the knife across the surface of the hole to the other side.",
        "Press firmly down on the knife so the spackling completely fills in the nail hole.",
        "Scrape across the surface of the hole two or three times to make sure the spackling is flat.",
        "To smooth out the spackling and/or fill the holes, you can also use your finger.",
        "Use a damp cloth to wipe away any excess spackling around the hole.",
        "Do this immediately after you spackle all the holes in the trim so the spackling doesn’t have time to dry.",
        "Let the spackling dry for 2-3 hours.",
        "Check back on the spackling after a few hours to see if it’s dry.",
        "If it’s not, let it continue drying.",
        "If you notice a dip in the spackling inside the nail hole, apply another coat and wait 2-3 more hours for the new coat of spackling to dry.",
        "Sand off excess spackling with a fine-grit sandpaper.",
        "Lightly brush the sandpaper across the surface of the trim where the hole is until the spackling is flush with the trim.",
        "Painting Over the Holes Wipe down and vacuum the trim so there’s no leftover dust.",
        "Any dust particles left on the trim may be visible after you finish painting.",
        "Use a paintbrush or cloth to wipe down the surface of the trim, and attach a brush head to the vacuum for the best results.",
        "Apply a spot primer over the spackled nail holes.",
        "Spot primer will prevent the spackling spots on the trim from looking different from the rest of the trim when they get painted over.",
        "Use a paintbrush to apply a thin coat of spot primer over each filled-in nail hole.",
        "You can find spot primer at your local hardware store.",
        "Put painter’s tape on any surfaces you don’t want paint to get on.",
        "Cover the parts of the walls directly around the trim.",
        "Apply a strip of painter’s tape to the floor if you’re painting a baseboard.",
        "Paint the trim using a paintbrush.",
        "Use the same paint that was used on the rest of the trim.",
        "You may need to do multiple coats before the paint looks even on the trim.",
        "If you sanded down the filled nail holes and primed them with a spot primer, they should be completely hidden behind the fresh paint."
    ]
}