{
    "title": "How to Make Avocado Body Butter",
    "url": "https://www.wikihow.com/Make-Avocado-Body-Butter",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Handmade Cosmetics"
    ],
    "methods": [
        {
            "name": "Using Avocado Butter",
            "steps": [
                {
                    "headline": "Cut the avocado butter into chunks.",
                    "description": "Weigh out 14 ounces (400 grams) of avocado butter. If the avocado butter came in block form, use a knife, grater, or food processor to cut it up into chunks. This will make it easier to whip."
                },
                {
                    "headline": "Whip the avocado in a mixer until it is light, fluffy, and creamy.",
                    "description": "Start with a low speed setting for about 1 minute, then finish off with a high speed setting. You are ready for the next step when the avocado butter turns light and fluffy, like whipped cream."
                },
                {
                    "headline": "Pour in the meadowfoam oil and green tea extract.",
                    "description": "You will need 5 ounces (150 milliliters) of meadowfoam oil and 1 ounce (30 milliliters) of green tea extract."
                },
                {
                    "headline": "Add in the essential oil and tapioca powder.",
                    "description": "You will need about 120 drops (6 milliliters) of lemongrass essential oil and 5 teaspoons of tapioca powder. The tapioca powder will help soak up any excess oils and prevent the body butter from feeling too greasy. If you can't find any tapioca powder, you can use modified cornstarch instead."
                },
                {
                    "headline": "Fold everything together with a rubber spatula.",
                    "description": "Don't worry about mixing thoroughly at this point. Just use a rubber spatula to fold the ingredients together until they are just combined."
                },
                {
                    "headline": "Whip the ingredients together until they turn fluffy and creamy.",
                    "description": "Start on a low speed setting, then gradually work your way up to a medium setting then a high setting. Do this over the span of 2 minutes, or until peaks form."
                },
                {
                    "headline": "Transfer the butter into glass mason jars.",
                    "description": "An 8-ounce (240-milliliter) jar will work the best, but you can divide it up between smaller jars too. The body butter will last up to 3 weeks at room temperature. It can last up to 12 months if stored in a cool, dry place, however."
                }
            ]
        },
        {
            "name": "Using Avocado Oil",
            "steps": [
                {
                    "headline": "Blend the shea butter in a food processor.",
                    "description": "Weigh out 16 ounces (455 grams) of raw shea butter. If it is not already cut into cubes, take a moment to do so, then toss it into a food processor. Pulse it for a few seconds to break it down further."
                },
                {
                    "headline": "Add in the avocado oil and vegetable glycerin and continue blending.",
                    "description": "While the food processor is still running, pour in ¼ cup (60 milliliters) of hexane-free avocado oil and 2 tablespoons (30 milliliters) of vegetable glycerin. Once everything is mixed together, pause the food processor."
                },
                {
                    "headline": "Melt the cocoa butter in a double-boiler.",
                    "description": "Fill a pot with a few inches/centimeters of hot water, then place a heat-safe glass measuring cup or jar into it. Add 4 ounces (115 grams) of raw, shaved cocoa butter into the cup or jar, and let it melt. Do not let the water get into the cup or jar. Do not let the cocoa butter heat up pat 118°F (48°C). If the cocoa butter did not come shaved, you can shave it yourself using a grater."
                },
                {
                    "headline": "Stir the melted cocoa butter, then add it to the food processor.",
                    "description": "Give the cocoa butter a quick stir with a rubber spatula to help melt any remaining chunks. Pour it into the food processor, making sure to distribute it evenly."
                },
                {
                    "headline": "Blend the ingredients together.",
                    "description": "Start the food processor on low, then work your way up to a medium, then high speed setting. Keep it running until all of the ingredients are evenly mixed together. If you need to, pause the food processor, and scrape any unmixed lotion down the sides, towards the blades."
                },
                {
                    "headline": "Scoop the lotion into glass jars and let it cool.",
                    "description": "Use a rubber spatula to transfer the lotion into 8-ounce (240-milliliter) or 4-ounce (120-milliliter) glass mason jars. Let the lotion cool and solidify before using it. The lotion will last for a few months at room temperature, but you can help it last longer by keeping it in the fridge. This lotion is greasy, but it will absorb quickly into your skin."
                }
            ]
        }
    ],
    "tyn": [
        "Using Avocado Butter",
        "14 ounces (400 grams) avocado butter",
        "5 ounces (150 milliliters) meadowfoam oil",
        "1 ounce (30 milliliters) green tea extract",
        "120 drops (6 milliliters) lemongrass essential oil",
        "5 teaspoons tapioca powder",
        "Scale",
        "Mixer",
        "Food processor, grater, or knife",
        "Rubber spatula",
        "Glass mason jars",
        "Using Avocado Oil",
        "16 ounces (455 grams) raw shea butter, cubed",
        "4 ounces (115 grams) raw cocoa butter, shaved",
        "¼ cup (60 milliliters) avocado oil (hexane-free)",
        "2 tablespoons (30 milliliters) vegetable glycerin",
        "Food processor",
        "Glass measuring cup or jar",
        "Pot or saucepan"
    ],
    "text": " Using Avocado Butter Cut the avocado butter into chunks. Weigh out 14 ounces (400 grams) of avocado butter. If the avocado butter came in block form, use a knife, grater, or food processor to cut it up into chunks. This will make it easier to whip. Whip the avocado in a mixer until it is light, fluffy, and creamy. Start with a low speed setting for about 1 minute, then finish off with a high speed setting. You are ready for the next step when the avocado butter turns light and fluffy, like whipped cream. Pour in the meadowfoam oil and green tea extract. You will need 5 ounces (150 milliliters) of meadowfoam oil and 1 ounce (30 milliliters) of green tea extract. Add in the essential oil and tapioca powder. You will need about 120 drops (6 milliliters) of lemongrass essential oil and 5 teaspoons of tapioca powder. The tapioca powder will help soak up any excess oils and prevent the body butter from feeling too greasy. If you can't find any tapioca powder, you can use modified cornstarch instead. Fold everything together with a rubber spatula. Don't worry about mixing thoroughly at this point. Just use a rubber spatula to fold the ingredients together until they are just combined. Whip the ingredients together until they turn fluffy and creamy. Start on a low speed setting, then gradually work your way up to a medium setting then a high setting. Do this over the span of 2 minutes, or until peaks form. Transfer the butter into glass mason jars. An 8-ounce (240-milliliter) jar will work the best, but you can divide it up between smaller jars too. The body butter will last up to 3 weeks at room temperature. It can last up to 12 months if stored in a cool, dry place, however. Using Avocado Oil Blend the shea butter in a food processor. Weigh out 16 ounces (455 grams) of raw shea butter. If it is not already cut into cubes, take a moment to do so, then toss it into a food processor. Pulse it for a few seconds to break it down further. Add in the avocado oil and vegetable glycerin and continue blending. While the food processor is still running, pour in ¼ cup (60 milliliters) of hexane-free avocado oil and 2 tablespoons (30 milliliters) of vegetable glycerin. Once everything is mixed together, pause the food processor. Melt the cocoa butter in a double-boiler. Fill a pot with a few inches/centimeters of hot water, then place a heat-safe glass measuring cup or jar into it. Add 4 ounces (115 grams) of raw, shaved cocoa butter into the cup or jar, and let it melt. Do not let the water get into the cup or jar. Do not let the cocoa butter heat up pat 118°F (48°C). If the cocoa butter did not come shaved, you can shave it yourself using a grater. Stir the melted cocoa butter, then add it to the food processor. Give the cocoa butter a quick stir with a rubber spatula to help melt any remaining chunks. Pour it into the food processor, making sure to distribute it evenly. Blend the ingredients together. Start the food processor on low, then work your way up to a medium, then high speed setting. Keep it running until all of the ingredients are evenly mixed together. If you need to, pause the food processor, and scrape any unmixed lotion down the sides, towards the blades. Scoop the lotion into glass jars and let it cool. Use a rubber spatula to transfer the lotion into 8-ounce (240-milliliter) or 4-ounce (120-milliliter) glass mason jars. Let the lotion cool and solidify before using it. The lotion will last for a few months at room temperature, but you can help it last longer by keeping it in the fridge. This lotion is greasy, but it will absorb quickly into your skin.",
    "sentences": [
        " Using Avocado Butter Cut the avocado butter into chunks.",
        "Weigh out 14 ounces (400 grams) of avocado butter.",
        "If the avocado butter came in block form, use a knife, grater, or food processor to cut it up into chunks.",
        "This will make it easier to whip.",
        "Whip the avocado in a mixer until it is light, fluffy, and creamy.",
        "Start with a low speed setting for about 1 minute, then finish off with a high speed setting.",
        "You are ready for the next step when the avocado butter turns light and fluffy, like whipped cream.",
        "Pour in the meadowfoam oil and green tea extract.",
        "You will need 5 ounces (150 milliliters) of meadowfoam oil and 1 ounce (30 milliliters) of green tea extract.",
        "Add in the essential oil and tapioca powder.",
        "You will need about 120 drops (6 milliliters) of lemongrass essential oil and 5 teaspoons of tapioca powder.",
        "The tapioca powder will help soak up any excess oils and prevent the body butter from feeling too greasy.",
        "If you can't find any tapioca powder, you can use modified cornstarch instead.",
        "Fold everything together with a rubber spatula.",
        "Don't worry about mixing thoroughly at this point.",
        "Just use a rubber spatula to fold the ingredients together until they are just combined.",
        "Whip the ingredients together until they turn fluffy and creamy.",
        "Start on a low speed setting, then gradually work your way up to a medium setting then a high setting.",
        "Do this over the span of 2 minutes, or until peaks form.",
        "Transfer the butter into glass mason jars.",
        "An 8-ounce (240-milliliter) jar will work the best, but you can divide it up between smaller jars too.",
        "The body butter will last up to 3 weeks at room temperature.",
        "It can last up to 12 months if stored in a cool, dry place, however.",
        "Using Avocado Oil Blend the shea butter in a food processor.",
        "Weigh out 16 ounces (455 grams) of raw shea butter.",
        "If it is not already cut into cubes, take a moment to do so, then toss it into a food processor.",
        "Pulse it for a few seconds to break it down further.",
        "Add in the avocado oil and vegetable glycerin and continue blending.",
        "While the food processor is still running, pour in ¼ cup (60 milliliters) of hexane-free avocado oil and 2 tablespoons (30 milliliters) of vegetable glycerin.",
        "Once everything is mixed together, pause the food processor.",
        "Melt the cocoa butter in a double-boiler.",
        "Fill a pot with a few inches/centimeters of hot water, then place a heat-safe glass measuring cup or jar into it.",
        "Add 4 ounces (115 grams) of raw, shaved cocoa butter into the cup or jar, and let it melt.",
        "Do not let the water get into the cup or jar.",
        "Do not let the cocoa butter heat up pat 118°F (48°C).",
        "If the cocoa butter did not come shaved, you can shave it yourself using a grater.",
        "Stir the melted cocoa butter, then add it to the food processor.",
        "Give the cocoa butter a quick stir with a rubber spatula to help melt any remaining chunks.",
        "Pour it into the food processor, making sure to distribute it evenly.",
        "Blend the ingredients together.",
        "Start the food processor on low, then work your way up to a medium, then high speed setting.",
        "Keep it running until all of the ingredients are evenly mixed together.",
        "If you need to, pause the food processor, and scrape any unmixed lotion down the sides, towards the blades.",
        "Scoop the lotion into glass jars and let it cool.",
        "Use a rubber spatula to transfer the lotion into 8-ounce (240-milliliter) or 4-ounce (120-milliliter) glass mason jars.",
        "Let the lotion cool and solidify before using it.",
        "The lotion will last for a few months at room temperature, but you can help it last longer by keeping it in the fridge.",
        "This lotion is greasy, but it will absorb quickly into your skin."
    ]
}