{
    "title": "How to Do a Man Bun",
    "url": "https://www.wikihow.com/Do-a-Man-Bun",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Hairstyles",
        "Hairstyles for Men"
    ],
    "methods": [
        {
            "name": "Preparing Your Hair for the Bun",
            "steps": [
                {
                    "headline": "Shampoo and condition.",
                    "description": "A man bun looks best when your hair is clean. Shampoo your hair as you normally would and apply conditioner after you shampoo it. This will make your hair more healthy and prevent it from drying out. Greasy and dirty hair can make man buns look unappealing. If you have greasy hair, you may need to shampoo and condition it daily. Shampooing hair more than three times a week may cause it to dry out if you have naturally dry hair."
                },
                {
                    "headline": "Comb or brush your hair after getting out of the shower.",
                    "description": "Work all the knots out of your hair so that it’s as smooth as possible. Getting the knots out first will make your man bun look cleaner and neater."
                },
                {
                    "headline": "Dry your hair off with a towel or let it air dry.",
                    "description": "Pat your hair dry instead of rubbing it when using a towel. Rubbing your hair too much with a towel could make it frizzy."
                },
                {
                    "headline": "Apply a leave-in conditioner or hair oil to your hair.",
                    "description": "Put a dime sized amount of leave-in conditioner or hair oil into the palm of your hand. Rub your hands together and rub the moisturizer into your hair from the root to the tips. If your leave-in conditioner comes in a spray, spritz it all over your hair."
                }
            ]
        },
        {
            "name": "Creating a Quick and Messy Bun",
            "steps": [
                {
                    "headline": "Run your fingers in your hair and bunch it up in the back of your head.",
                    "description": "Grab as much hair as you can from the front and top of your head. Slick your hair back and collect it below the crown of your head. With this style you can let the hair on the back of your head hang or you can tie it up into the bun."
                },
                {
                    "headline": "Pull your hair halfway through a hair tie.",
                    "description": "Your hair should fold in half and form a bun as you pull it halfway through. This style looks best if you have hair that is shoulder-length or shorter. If your hair is longer, then folding your ponytail may look too saggy to be a bun."
                },
                {
                    "headline": "Twist and wrap the hair tie around the bun another time.",
                    "description": "With the hair still pulled halfway through, twist and wrap the hair tie around the bun. Wrapping the hair tie a second time will tighten the bun and secure it in place. This a great solution if you’re in a rush and need to put your hair up quickly."
                }
            ]
        },
        {
            "name": "Making a Full Bun",
            "steps": [
                {
                    "headline": "Grow your hair out to at least 9–16 inches (23–41 cm).",
                    "description": "A full man bun uses all the hair on your head and requires more hair than the other styles. If you don’t have 9–16 inches (23–41 cm) of hair, choose a different style. A full man bun is the best kind of bun to wear for formal occasions."
                },
                {
                    "headline": "Pull your hair back and bunch it up towards the crown of your head.",
                    "description": "The crown of your head is where the back and top of your head meet. Most buns will be in between the crown of your head and the center of the back of your head. Run your fingers through your hair and bunch all of your hair to the area where you want the man bun to be. This will include all the hair on the back and sides of your head as well. Don’t pull your hair back too tightly or it may be uncomfortable. If you don't want a messy bun, run a comb through your hair before you style it."
                },
                {
                    "headline": "Wrap the hair twice with a hair tie.",
                    "description": "Pull the hair that you have in your hand through a hair tie, then twist the hair tie and pull your hair through the new hole. This will give you a pony tail."
                },
                {
                    "headline": "Twist the hair tie a third time and pull the hair through half way.",
                    "description": "Instead of pulling the hair all the way through like you did before, pull it through the hair tie halfway. This should create a tight bun on your head. Part of your hair will form a loop, while the rest is loose ends. If the bun isn’t tight enough, you may need to pull your hair through the hair tie for a third time, then pull it through halfway on the fourth time."
                },
                {
                    "headline": "Wrap a couple strands of hair around the elastic band to hide it.",
                    "description": "Doing this will give your bun an even more refined look, but isn’t always required. Leave out a couple of strands of hair when you tie the bun initially and wrap those strands around the bun and hair tie. Secure the extra piece of hair by pulling it through the tightened hair tie. If your hair is too short or straight to stay wrapped around the bun and hair tie, you could use a firm hold hair spray or a pomade to lock your hair in place."
                }
            ]
        },
        {
            "name": "Tying  a Top Knot",
            "steps": [
                {
                    "headline": "Grab the hair on the top of your head.",
                    "description": "A top knot looks best on hairstyles that are short on the sides and back and longer on the top. Run your fingers back through your hair. Bunch the hair up on the top of your head and grab it. The top knot should be located towards the center on the top of your head. You only need 6–7 inches (15–18 cm) of hair to create this bun."
                },
                {
                    "headline": "Pull the hair through a hair tie.",
                    "description": "Get an elastic hair tie and pull the hair through it. The tie should lie snugly against your head."
                },
                {
                    "headline": "Twist the hair tie and pull your hair through the new loop.",
                    "description": "Once you wrap the hair with the hair tie a second time, it should look like a ponytail or rattail on the top of your head."
                },
                {
                    "headline": "Twist the hair tie again and pull your hair halfway through the loop.",
                    "description": "Not pulling the hair all the way through the new loop should create a small bun on the top of your head. Once the bun is secured in place, you’ve successfully given yourself a top knot man bun."
                }
            ]
        }
    ],
    "tyn": [
        "Shampoo and conditioner",
        "Comb or brush",
        "Towel (optional)",
        "Elastic hair ties"
    ],
    "text": " Preparing Your Hair for the Bun Shampoo and condition. A man bun looks best when your hair is clean. Shampoo your hair as you normally would and apply conditioner after you shampoo it. This will make your hair more healthy and prevent it from drying out. Greasy and dirty hair can make man buns look unappealing. If you have greasy hair, you may need to shampoo and condition it daily. Shampooing hair more than three times a week may cause it to dry out if you have naturally dry hair. Comb or brush your hair after getting out of the shower. Work all the knots out of your hair so that it’s as smooth as possible. Getting the knots out first will make your man bun look cleaner and neater. Dry your hair off with a towel or let it air dry. Pat your hair dry instead of rubbing it when using a towel. Rubbing your hair too much with a towel could make it frizzy. Apply a leave-in conditioner or hair oil to your hair. Put a dime sized amount of leave-in conditioner or hair oil into the palm of your hand. Rub your hands together and rub the moisturizer into your hair from the root to the tips. If your leave-in conditioner comes in a spray, spritz it all over your hair. Creating a Quick and Messy Bun Run your fingers in your hair and bunch it up in the back of your head. Grab as much hair as you can from the front and top of your head. Slick your hair back and collect it below the crown of your head. With this style you can let the hair on the back of your head hang or you can tie it up into the bun. Pull your hair halfway through a hair tie. Your hair should fold in half and form a bun as you pull it halfway through. This style looks best if you have hair that is shoulder-length or shorter. If your hair is longer, then folding your ponytail may look too saggy to be a bun. Twist and wrap the hair tie around the bun another time. With the hair still pulled halfway through, twist and wrap the hair tie around the bun. Wrapping the hair tie a second time will tighten the bun and secure it in place. This a great solution if you’re in a rush and need to put your hair up quickly. Making a Full Bun Grow your hair out to at least 9–16 inches (23–41 cm). A full man bun uses all the hair on your head and requires more hair than the other styles. If you don’t have 9–16 inches (23–41 cm) of hair, choose a different style. A full man bun is the best kind of bun to wear for formal occasions. Pull your hair back and bunch it up towards the crown of your head. The crown of your head is where the back and top of your head meet. Most buns will be in between the crown of your head and the center of the back of your head. Run your fingers through your hair and bunch all of your hair to the area where you want the man bun to be. This will include all the hair on the back and sides of your head as well. Don’t pull your hair back too tightly or it may be uncomfortable. If you don't want a messy bun, run a comb through your hair before you style it. Wrap the hair twice with a hair tie. Pull the hair that you have in your hand through a hair tie, then twist the hair tie and pull your hair through the new hole. This will give you a pony tail. Twist the hair tie a third time and pull the hair through half way. Instead of pulling the hair all the way through like you did before, pull it through the hair tie halfway. This should create a tight bun on your head. Part of your hair will form a loop, while the rest is loose ends. If the bun isn’t tight enough, you may need to pull your hair through the hair tie for a third time, then pull it through halfway on the fourth time. Wrap a couple strands of hair around the elastic band to hide it. Doing this will give your bun an even more refined look, but isn’t always required. Leave out a couple of strands of hair when you tie the bun initially and wrap those strands around the bun and hair tie. Secure the extra piece of hair by pulling it through the tightened hair tie. If your hair is too short or straight to stay wrapped around the bun and hair tie, you could use a firm hold hair spray or a pomade to lock your hair in place. Tying  a Top Knot Grab the hair on the top of your head. A top knot looks best on hairstyles that are short on the sides and back and longer on the top. Run your fingers back through your hair. Bunch the hair up on the top of your head and grab it. The top knot should be located towards the center on the top of your head. You only need 6–7 inches (15–18 cm) of hair to create this bun. Pull the hair through a hair tie. Get an elastic hair tie and pull the hair through it. The tie should lie snugly against your head. Twist the hair tie and pull your hair through the new loop. Once you wrap the hair with the hair tie a second time, it should look like a ponytail or rattail on the top of your head. Twist the hair tie again and pull your hair halfway through the loop. Not pulling the hair all the way through the new loop should create a small bun on the top of your head. Once the bun is secured in place, you’ve successfully given yourself a top knot man bun.",
    "sentences": [
        " Preparing Your Hair for the Bun Shampoo and condition.",
        "A man bun looks best when your hair is clean.",
        "Shampoo your hair as you normally would and apply conditioner after you shampoo it.",
        "This will make your hair more healthy and prevent it from drying out.",
        "Greasy and dirty hair can make man buns look unappealing.",
        "If you have greasy hair, you may need to shampoo and condition it daily.",
        "Shampooing hair more than three times a week may cause it to dry out if you have naturally dry hair.",
        "Comb or brush your hair after getting out of the shower.",
        "Work all the knots out of your hair so that it’s as smooth as possible.",
        "Getting the knots out first will make your man bun look cleaner and neater.",
        "Dry your hair off with a towel or let it air dry.",
        "Pat your hair dry instead of rubbing it when using a towel.",
        "Rubbing your hair too much with a towel could make it frizzy.",
        "Apply a leave-in conditioner or hair oil to your hair.",
        "Put a dime sized amount of leave-in conditioner or hair oil into the palm of your hand.",
        "Rub your hands together and rub the moisturizer into your hair from the root to the tips.",
        "If your leave-in conditioner comes in a spray, spritz it all over your hair.",
        "Creating a Quick and Messy Bun Run your fingers in your hair and bunch it up in the back of your head.",
        "Grab as much hair as you can from the front and top of your head.",
        "Slick your hair back and collect it below the crown of your head.",
        "With this style you can let the hair on the back of your head hang or you can tie it up into the bun.",
        "Pull your hair halfway through a hair tie.",
        "Your hair should fold in half and form a bun as you pull it halfway through.",
        "This style looks best if you have hair that is shoulder-length or shorter.",
        "If your hair is longer, then folding your ponytail may look too saggy to be a bun.",
        "Twist and wrap the hair tie around the bun another time.",
        "With the hair still pulled halfway through, twist and wrap the hair tie around the bun.",
        "Wrapping the hair tie a second time will tighten the bun and secure it in place.",
        "This a great solution if you’re in a rush and need to put your hair up quickly.",
        "Making a Full Bun Grow your hair out to at least 9–16 inches (23–41 cm).",
        "A full man bun uses all the hair on your head and requires more hair than the other styles.",
        "If you don’t have 9–16 inches (23–41 cm) of hair, choose a different style.",
        "A full man bun is the best kind of bun to wear for formal occasions.",
        "Pull your hair back and bunch it up towards the crown of your head.",
        "The crown of your head is where the back and top of your head meet.",
        "Most buns will be in between the crown of your head and the center of the back of your head.",
        "Run your fingers through your hair and bunch all of your hair to the area where you want the man bun to be.",
        "This will include all the hair on the back and sides of your head as well.",
        "Don’t pull your hair back too tightly or it may be uncomfortable.",
        "If you don't want a messy bun, run a comb through your hair before you style it.",
        "Wrap the hair twice with a hair tie.",
        "Pull the hair that you have in your hand through a hair tie, then twist the hair tie and pull your hair through the new hole.",
        "This will give you a pony tail.",
        "Twist the hair tie a third time and pull the hair through half way.",
        "Instead of pulling the hair all the way through like you did before, pull it through the hair tie halfway.",
        "This should create a tight bun on your head.",
        "Part of your hair will form a loop, while the rest is loose ends.",
        "If the bun isn’t tight enough, you may need to pull your hair through the hair tie for a third time, then pull it through halfway on the fourth time.",
        "Wrap a couple strands of hair around the elastic band to hide it.",
        "Doing this will give your bun an even more refined look, but isn’t always required.",
        "Leave out a couple of strands of hair when you tie the bun initially and wrap those strands around the bun and hair tie.",
        "Secure the extra piece of hair by pulling it through the tightened hair tie.",
        "If your hair is too short or straight to stay wrapped around the bun and hair tie, you could use a firm hold hair spray or a pomade to lock your hair in place.",
        "Tying  a Top Knot Grab the hair on the top of your head.",
        "A top knot looks best on hairstyles that are short on the sides and back and longer on the top.",
        "Run your fingers back through your hair.",
        "Bunch the hair up on the top of your head and grab it.",
        "The top knot should be located towards the center on the top of your head.",
        "You only need 6–7 inches (15–18 cm) of hair to create this bun.",
        "Pull the hair through a hair tie.",
        "Get an elastic hair tie and pull the hair through it.",
        "The tie should lie snugly against your head.",
        "Twist the hair tie and pull your hair through the new loop.",
        "Once you wrap the hair with the hair tie a second time, it should look like a ponytail or rattail on the top of your head.",
        "Twist the hair tie again and pull your hair halfway through the loop.",
        "Not pulling the hair all the way through the new loop should create a small bun on the top of your head.",
        "Once the bun is secured in place, you’ve successfully given yourself a top knot man bun."
    ]
}