{
    "title": "How to Clean Rubies",
    "url": "https://www.wikihow.com/Clean-Rubies",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Cleaning"
    ],
    "methods": [
        {
            "name": "Cleaning Your Ruby with Soapy Water",
            "steps": [
                {
                    "headline": "Fill a small bowl or container.",
                    "description": "Add a couple of drops of gentle liquid soap with warm, not hot, water and let the stone soak for 15 to 20 minutes. Be mindful if you’re cleaning multiple stones or pieces at once as to not overcrowd your cleaning dish."
                },
                {
                    "headline": "Scrub away the grime.",
                    "description": "Using a soft bristle brush or cloth, gently rub the stone to loosen up any debris or dirt from the stone and setting. Don’t scrub too hard and avoid getting too deep between crevices so the ruby doesn’t become unsecure."
                },
                {
                    "headline": "Add it back to the water.",
                    "description": "Take a good look at the stone to see how much more cleaning it needs. If it looks shiny and clean, swish it around in the water solution one last time to get rid of any lingering dirt. If it’s still a bit dirty, refill your bowl with clean water and solution and let it soak one more time before scrubbing again."
                },
                {
                    "headline": "Dry your ruby thoroughly.",
                    "description": "Wipe the stone clean with a dry, lint-free cloth. Place it on a rag or cloth to let fully dry before wearing or storing."
                }
            ]
        },
        {
            "name": "Using an Ultrasonic Cleaner",
            "steps": [
                {
                    "headline": "Purchase an ultrasonic cleaner.",
                    "description": "Ultrasonic jewelry cleaners can range in price from less than $50 to more than $200. While there are no specific cleaners for rubies, consider the size, hassle and features when purchasing a model. Some tanks are spacious enough to clean sunglasses or watches and can hold numerous items at once. Cleaners with timers offer a stress-free cleaning experience. You choose the time, set the device, and can walk away. High-end devices can include steamers, which offer an additional level of cleaning. This option is good if you have many precious items and plan to clean them regularly to keep their shine. It can, however, run about $200. Check to see if the ultrasonic cleaner requires solution, as some do not. Some cleaners run at the same frequency (42,000 Hz is standard) while others offer different settings to accommodate different types of material."
                },
                {
                    "headline": "Check your ruby before cleaning it.",
                    "description": "Unless your ruby stone is fracture-filled or coated to enhance its hue, it should be safe to use in an ultrasonic cleaner. Ask your jeweler to ensure it is untreated, heat-treated or lattice diffusion treated. Rubies and sapphires are strong enough for an ultrasonic cleaner. Opaque gemstones, opals and organic gems like pearls and ambers are too delicate. Metals like gold and platinum are safe to clean in ultrasonic devices."
                },
                {
                    "headline": "Make your solution.",
                    "description": "Add hot water and a couple drops of dishwashing liquid to the ultrasonic cleaner tank. You can also purchase a nontoxic gem-cleaning solution instead of making your own for about $5 to $10. Any standard jewelry cleaner works, but check the label to be sure there are no exceptions."
                },
                {
                    "headline": "Mix up the solution.",
                    "description": "Once the solution is in the device, let it run for 5 to 10 minutes to mix the solution entirely before using."
                },
                {
                    "headline": "Add your rubies to the cleaner.",
                    "description": "Be sure to only add a few pieces at once into the cleaner in order to avoid scratches during the process."
                },
                {
                    "headline": "Run the device.",
                    "description": "Depending on the dirtiness of the ruby, you’ll run the cleaner up to 20 minutes. If it’s your first time cleaning your stone, start with a shorter time frame and add on if it’s still dirty."
                },
                {
                    "headline": "Let your jewelry sit in the cleaner.",
                    "description": "After the ultrasonic cleaner runs, let your rubies sit in there for 5 to 10 minutes before removing. This will help to ensure that the loosened dirt and grime falls to the bottom of the device."
                },
                {
                    "headline": "Gently scrub your ruby.",
                    "description": "There might be some dirt and grime still stuck to your ruby, so grab a soft bristle brush to remove anything lingering. Carefully scrub the stone. Once it’s fully cleaned, dry your ruby with a lint-free cloth."
                }
            ]
        },
        {
            "name": "Maintaining Your Ruby’s Radiance",
            "steps": [
                {
                    "headline": "Protect your ruby.",
                    "description": "Avoid wearing ruby rings or jewelry while using harsh chemicals like cleaning supplies or hair spray. To maintain the shine, keep the ruby away from makeup debris, dirt, dust and other grime that can easily get caught in the setting."
                },
                {
                    "headline": "Take your ruby jewelry off.",
                    "description": "Before doing any high-impact or intensive work like going to the gym, working with tools and moving around heavy furniture, leave your ruby in a safe place to protect against knocking or rubbing the stone."
                },
                {
                    "headline": "Check your stone for damage regularly.",
                    "description": "Even when you’re careful, it’s possible to cause damage to a ruby stone. Make a habit out of checking your jewelry, especially if it’s worn regularly, to ensure you can quickly detect nicks, scratches and loose parts of the setting."
                },
                {
                    "headline": "Store rubies properly.",
                    "description": "Always keep rubies away from other jewelry to avoid possible scratches and nicks. When you’re storing your jewelry, wrap it in a cloth or keep it in its own pouch or section of your jewelry box."
                },
                {
                    "headline": "Take your ruby to the jeweler.",
                    "description": "Sometimes it’s just best to visit a professional. If you notice your ring is especially dirty, has any loose parts or has any major damage, a jeweler will be able to detect any serious problems or risks."
                }
            ]
        }
    ],
    "tyn": [
        "Soft makeup brush or very soft bristle toothbrush.",
        "Soapy water.",
        "Soft cloth for drying.",
        "Ultrasonic cleaner."
    ],
    "text": " Cleaning Your Ruby with Soapy Water Fill a small bowl or container. Add a couple of drops of gentle liquid soap with warm, not hot, water and let the stone soak for 15 to 20 minutes. Be mindful if you’re cleaning multiple stones or pieces at once as to not overcrowd your cleaning dish. Scrub away the grime. Using a soft bristle brush or cloth, gently rub the stone to loosen up any debris or dirt from the stone and setting. Don’t scrub too hard and avoid getting too deep between crevices so the ruby doesn’t become unsecure. Add it back to the water. Take a good look at the stone to see how much more cleaning it needs. If it looks shiny and clean, swish it around in the water solution one last time to get rid of any lingering dirt. If it’s still a bit dirty, refill your bowl with clean water and solution and let it soak one more time before scrubbing again. Dry your ruby thoroughly. Wipe the stone clean with a dry, lint-free cloth. Place it on a rag or cloth to let fully dry before wearing or storing. Using an Ultrasonic Cleaner Purchase an ultrasonic cleaner. Ultrasonic jewelry cleaners can range in price from less than $50 to more than $200. While there are no specific cleaners for rubies, consider the size, hassle and features when purchasing a model. Some tanks are spacious enough to clean sunglasses or watches and can hold numerous items at once. Cleaners with timers offer a stress-free cleaning experience. You choose the time, set the device, and can walk away. High-end devices can include steamers, which offer an additional level of cleaning. This option is good if you have many precious items and plan to clean them regularly to keep their shine. It can, however, run about $200. Check to see if the ultrasonic cleaner requires solution, as some do not. Some cleaners run at the same frequency (42,000 Hz is standard) while others offer different settings to accommodate different types of material. Check your ruby before cleaning it. Unless your ruby stone is fracture-filled or coated to enhance its hue, it should be safe to use in an ultrasonic cleaner. Ask your jeweler to ensure it is untreated, heat-treated or lattice diffusion treated. Rubies and sapphires are strong enough for an ultrasonic cleaner. Opaque gemstones, opals and organic gems like pearls and ambers are too delicate. Metals like gold and platinum are safe to clean in ultrasonic devices. Make your solution. Add hot water and a couple drops of dishwashing liquid to the ultrasonic cleaner tank. You can also purchase a nontoxic gem-cleaning solution instead of making your own for about $5 to $10. Any standard jewelry cleaner works, but check the label to be sure there are no exceptions. Mix up the solution. Once the solution is in the device, let it run for 5 to 10 minutes to mix the solution entirely before using. Add your rubies to the cleaner. Be sure to only add a few pieces at once into the cleaner in order to avoid scratches during the process. Run the device. Depending on the dirtiness of the ruby, you’ll run the cleaner up to 20 minutes. If it’s your first time cleaning your stone, start with a shorter time frame and add on if it’s still dirty. Let your jewelry sit in the cleaner. After the ultrasonic cleaner runs, let your rubies sit in there for 5 to 10 minutes before removing. This will help to ensure that the loosened dirt and grime falls to the bottom of the device. Gently scrub your ruby. There might be some dirt and grime still stuck to your ruby, so grab a soft bristle brush to remove anything lingering. Carefully scrub the stone. Once it’s fully cleaned, dry your ruby with a lint-free cloth. Maintaining Your Ruby’s Radiance Protect your ruby. Avoid wearing ruby rings or jewelry while using harsh chemicals like cleaning supplies or hair spray. To maintain the shine, keep the ruby away from makeup debris, dirt, dust and other grime that can easily get caught in the setting. Take your ruby jewelry off. Before doing any high-impact or intensive work like going to the gym, working with tools and moving around heavy furniture, leave your ruby in a safe place to protect against knocking or rubbing the stone. Check your stone for damage regularly. Even when you’re careful, it’s possible to cause damage to a ruby stone. Make a habit out of checking your jewelry, especially if it’s worn regularly, to ensure you can quickly detect nicks, scratches and loose parts of the setting. Store rubies properly. Always keep rubies away from other jewelry to avoid possible scratches and nicks. When you’re storing your jewelry, wrap it in a cloth or keep it in its own pouch or section of your jewelry box. Take your ruby to the jeweler. Sometimes it’s just best to visit a professional. If you notice your ring is especially dirty, has any loose parts or has any major damage, a jeweler will be able to detect any serious problems or risks.",
    "sentences": [
        " Cleaning Your Ruby with Soapy Water Fill a small bowl or container.",
        "Add a couple of drops of gentle liquid soap with warm, not hot, water and let the stone soak for 15 to 20 minutes.",
        "Be mindful if you’re cleaning multiple stones or pieces at once as to not overcrowd your cleaning dish.",
        "Scrub away the grime.",
        "Using a soft bristle brush or cloth, gently rub the stone to loosen up any debris or dirt from the stone and setting.",
        "Don’t scrub too hard and avoid getting too deep between crevices so the ruby doesn’t become unsecure.",
        "Add it back to the water.",
        "Take a good look at the stone to see how much more cleaning it needs.",
        "If it looks shiny and clean, swish it around in the water solution one last time to get rid of any lingering dirt.",
        "If it’s still a bit dirty, refill your bowl with clean water and solution and let it soak one more time before scrubbing again.",
        "Dry your ruby thoroughly.",
        "Wipe the stone clean with a dry, lint-free cloth.",
        "Place it on a rag or cloth to let fully dry before wearing or storing.",
        "Using an Ultrasonic Cleaner Purchase an ultrasonic cleaner.",
        "Ultrasonic jewelry cleaners can range in price from less than $50 to more than $200.",
        "While there are no specific cleaners for rubies, consider the size, hassle and features when purchasing a model.",
        "Some tanks are spacious enough to clean sunglasses or watches and can hold numerous items at once.",
        "Cleaners with timers offer a stress-free cleaning experience.",
        "You choose the time, set the device, and can walk away.",
        "High-end devices can include steamers, which offer an additional level of cleaning.",
        "This option is good if you have many precious items and plan to clean them regularly to keep their shine.",
        "It can, however, run about $200.",
        "Check to see if the ultrasonic cleaner requires solution, as some do not.",
        "Some cleaners run at the same frequency (42,000 Hz is standard) while others offer different settings to accommodate different types of material.",
        "Check your ruby before cleaning it.",
        "Unless your ruby stone is fracture-filled or coated to enhance its hue, it should be safe to use in an ultrasonic cleaner.",
        "Ask your jeweler to ensure it is untreated, heat-treated or lattice diffusion treated.",
        "Rubies and sapphires are strong enough for an ultrasonic cleaner.",
        "Opaque gemstones, opals and organic gems like pearls and ambers are too delicate.",
        "Metals like gold and platinum are safe to clean in ultrasonic devices.",
        "Make your solution.",
        "Add hot water and a couple drops of dishwashing liquid to the ultrasonic cleaner tank.",
        "You can also purchase a nontoxic gem-cleaning solution instead of making your own for about $5 to $10.",
        "Any standard jewelry cleaner works, but check the label to be sure there are no exceptions.",
        "Mix up the solution.",
        "Once the solution is in the device, let it run for 5 to 10 minutes to mix the solution entirely before using.",
        "Add your rubies to the cleaner.",
        "Be sure to only add a few pieces at once into the cleaner in order to avoid scratches during the process.",
        "Run the device.",
        "Depending on the dirtiness of the ruby, you’ll run the cleaner up to 20 minutes.",
        "If it’s your first time cleaning your stone, start with a shorter time frame and add on if it’s still dirty.",
        "Let your jewelry sit in the cleaner.",
        "After the ultrasonic cleaner runs, let your rubies sit in there for 5 to 10 minutes before removing.",
        "This will help to ensure that the loosened dirt and grime falls to the bottom of the device.",
        "Gently scrub your ruby.",
        "There might be some dirt and grime still stuck to your ruby, so grab a soft bristle brush to remove anything lingering.",
        "Carefully scrub the stone.",
        "Once it’s fully cleaned, dry your ruby with a lint-free cloth.",
        "Maintaining Your Ruby’s Radiance Protect your ruby.",
        "Avoid wearing ruby rings or jewelry while using harsh chemicals like cleaning supplies or hair spray.",
        "To maintain the shine, keep the ruby away from makeup debris, dirt, dust and other grime that can easily get caught in the setting.",
        "Take your ruby jewelry off.",
        "Before doing any high-impact or intensive work like going to the gym, working with tools and moving around heavy furniture, leave your ruby in a safe place to protect against knocking or rubbing the stone.",
        "Check your stone for damage regularly.",
        "Even when you’re careful, it’s possible to cause damage to a ruby stone.",
        "Make a habit out of checking your jewelry, especially if it’s worn regularly, to ensure you can quickly detect nicks, scratches and loose parts of the setting.",
        "Store rubies properly.",
        "Always keep rubies away from other jewelry to avoid possible scratches and nicks.",
        "When you’re storing your jewelry, wrap it in a cloth or keep it in its own pouch or section of your jewelry box.",
        "Take your ruby to the jeweler.",
        "Sometimes it’s just best to visit a professional.",
        "If you notice your ring is especially dirty, has any loose parts or has any major damage, a jeweler will be able to detect any serious problems or risks."
    ]
}