{
    "title": "How to Make Panko Breaded Fish",
    "url": "https://www.wikihow.com/Make-Panko-Breaded-Fish",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fish and Seafood"
    ],
    "methods": [
        {
            "name": "Baking Panko Crusted Fish",
            "steps": [
                {
                    "headline": "Preheat the oven and prepare a baking sheet.",
                    "description": "Turn the oven on to 425 °F (218 °C). Get out a baking sheet and lay a piece of parchment paper on it. Spray the parchment paper with nonstick cooking spray and set it aside."
                },
                {
                    "headline": "Combine the seasoned panko mixture.",
                    "description": "Set a shallow bowl or plate on your work surface and measure ½ cup (30 g) of panko breadcrumbs into it. Add ½ teaspoon (1 g) of lemon zest, and ¼ teaspoon (1.5 g) of salt. Use your fingers to stir the mixture until the seasonings are combined with the panko. Set the mixture aside."
                },
                {
                    "headline": "Season the fish and dip them in beaten egg.",
                    "description": "Get out another shallow plate or bowl and crack 1 egg into it. Beat the egg with a fork. Sprinkle 2 fish fillets with salt and pepper according to your taste and dip the fish in the beaten egg. You can use your favorite fish for this recipe. Try salmon, cod, halibut, mahi mahi, or rockfish."
                },
                {
                    "headline": "Roll the fish in the seasoned panko mixture.",
                    "description": "Lift the fish fillets out of the egg and let the excess egg drip off. Lay the fish in the seasoned panko and roll the fillets gently. The panko should stick to the sides of the fish."
                },
                {
                    "headline": "Bake the panko crusted fish for 14 to 16 minutes.",
                    "description": "Lay the fish in a single layer on the prepared baking sheet. Put the fish in the preheated oven and bake the fillets for 14 to 16 minutes. The fish should flake easily when you run a fork across the top."
                },
                {
                    "headline": "Serve the panko crusted fish.",
                    "description": "Remove the fish from the oven and sprinkle a little fresh parsley over the top. Consider serving the fish with steamed vegetables and rice. Garnish the fish with slices or wedges of fresh lemon on the side. While you can store the cooked fish in the refrigerator for 3 to 4 days, it will become soggy as it's stored."
                }
            ]
        },
        {
            "name": "Frying Crispy Panko Breaded Fish",
            "steps": [
                {
                    "headline": "Set up a dredging station.",
                    "description": "Set 3 shallow bowls on your work surface. Measure 4/5 cup (100 g) of flour into one bowl. Crack 2 eggs in the next bowl and beat them with a little salt. Measure 3 3/4 cups (230 g) of panko breadcrumbs into the last bowl."
                },
                {
                    "headline": "Heat the oil in a large skillet.",
                    "description": "Pour 1/2 cup (120 ml) of the vegetable oil into a large skillet and turn the heat to medium-high. The oil should reach about 355 °F (179 °C) or begin to shimmer once it's hot enough."
                },
                {
                    "headline": "Coat the fish in the flour, beaten egg, and panko breadcrumbs.",
                    "description": "Take 4 fillets of white fish and set each one in the flour. Turn the pieces to coat them and shake the excess flour off. Place the floured pieces in the beaten egg, so they're completely coated. Put the fish in the panko breadcrumbs and turn them until they're covered. You can use your favorite white fish. For example, try lemon sole, plaice, haddock or cod."
                },
                {
                    "headline": "Fry the fish for 3 minutes.",
                    "description": "Slowly lower 2 pieces of panko breaded fish into the hot oil. Let the fish fry over medium-high heat for 3 minutes. It should turn golden brown on one side."
                },
                {
                    "headline": "Flip and fry the fish for 3 more minutes.",
                    "description": "Use a fish spatula or turner to slowly flip both pieces of fish over. Fry the fish for 3 minutes, so they're completely browned on both sides and cooked through."
                },
                {
                    "headline": "Heat the oil again and fry the rest of the fish.",
                    "description": "Lay a paper towel over a plate and set it next to the skillet. Lift the fried fish out of the skillet and place it on the paper towel to drain. Let the oil heat back up until it's shimmering and then fry the last 2 pieces of coated fish."
                },
                {
                    "headline": "Serve the crispy panko breaded fish.",
                    "description": "Serve the fish while the pieces are still hot and crispy. Sprinkle the fish with flaky sea salt according to your taste. Consider serving them with tartar sauce and slices of lemon. Avoid storing the crispy fish because the coating will become soggy."
                }
            ]
        },
        {
            "name": "Pan-Searing Panko Coated Fish",
            "steps": [
                {
                    "headline": "Preheat the oven and season the fish.",
                    "description": "Turn the oven on to 300 °F (149 °C). Get out four 5 to 8-ounce pieces of fish. Use thick fillets or fish steaks. Pat them dry with a paper towel and season them with kosher salt and ground pepper according to your taste. Set the fish aside. You can use your favorite fish in this recipe, or try halibut, striped bass, sea bass, or swordfish."
                },
                {
                    "headline": "Create a dredging station.",
                    "description": "Set three shallow bowls on your work surface. Place 1/2 cup (60 g) of all-purpose flour in one bowl, 1 large egg in the next bowl, and 1 1/2 cups (93 g) of panko breadcrumbs in the last bowl. Beat the egg with a fork and sprinkle a little salt and pepper over each each bowl."
                },
                {
                    "headline": "Coat the fish in the flour, egg, and panko breadcrumbs.",
                    "description": "Hold 1 fish steak or fillet and dip one side in the flour. Lift the fish up and dip the floured side in the beaten egg. Lift the fish up and press the coated side into the panko breadcrumbs. The panko should stick to that side of the fish. Set the fish on a plate and coat the remaining fillets or fish steaks. Keep in mind that this method gives you a crispy crust on just one side of the fish."
                },
                {
                    "headline": "Heat the oil in a skillet over medium heat.",
                    "description": "Pour 3 tablespoons (45 ml) of vegetable, canola, or peanut oil into a large oven-safe skillet. Turn the heat on to medium and let the oil heat. It should shimmer when it's ready."
                },
                {
                    "headline": "Sear one side of the fish for 5 minutes.",
                    "description": "Lay each piece of fish in the skillet so the panko breaded side is down in the oil. Cook the fish over medium heat for 5 minutes and swirl the oil in the pan occasionally. This will help the fish get a golden brown crust."
                },
                {
                    "headline": "Flip the fish and bake it for 5 minutes.",
                    "description": "Use a fish spatula or turner and slowly flip each fish steak or fillet over. Put the skillet in the preheated oven and bake the fish for 5 minutes. The fish should be completely cooked."
                },
                {
                    "headline": "Check the temperature and serve the fish.",
                    "description": "Insert an instant-read thermometer into the thickest part of the fish. It should be at 140 °F (60 °C) once it's finished cooking. Plate up the fish while it's hot and serve it with lemon wedges or tartar sauce. While you can store the cooked fish in the refrigerator for 3 to 4 days, it will become soggy the longer it's stored."
                }
            ]
        }
    ],
    "tyn": [
        "Baked Panko Crusted Fish",
        "Measuring cups and spoons",
        "Digital scale",
        "Baking sheet",
        "Parchment paper",
        "Nonstick cooking spray",
        "Shallow plates or bowls",
        "Fork",
        "Crispy Panko Breaded Fish",
        "Large skillet",
        "3 shallow bowls",
        "Fish turner or spatula",
        "Plate",
        "Paper towels",
        "Instant-read thermometer, optional",
        "Pan-Seared Panko Coated Fish",
        "Instant-read thermometer",
        "Oven mitts",
        "Large oven-safe skillet"
    ],
    "text": " Baking Panko Crusted Fish Preheat the oven and prepare a baking sheet. Turn the oven on to 425 °F (218 °C). Get out a baking sheet and lay a piece of parchment paper on it. Spray the parchment paper with nonstick cooking spray and set it aside. Combine the seasoned panko mixture. Set a shallow bowl or plate on your work surface and measure ½ cup (30 g) of panko breadcrumbs into it. Add ½ teaspoon (1 g) of lemon zest, and ¼ teaspoon (1.5 g) of salt. Use your fingers to stir the mixture until the seasonings are combined with the panko. Set the mixture aside. Season the fish and dip them in beaten egg. Get out another shallow plate or bowl and crack 1 egg into it. Beat the egg with a fork. Sprinkle 2 fish fillets with salt and pepper according to your taste and dip the fish in the beaten egg. You can use your favorite fish for this recipe. Try salmon, cod, halibut, mahi mahi, or rockfish. Roll the fish in the seasoned panko mixture. Lift the fish fillets out of the egg and let the excess egg drip off. Lay the fish in the seasoned panko and roll the fillets gently. The panko should stick to the sides of the fish. Bake the panko crusted fish for 14 to 16 minutes. Lay the fish in a single layer on the prepared baking sheet. Put the fish in the preheated oven and bake the fillets for 14 to 16 minutes. The fish should flake easily when you run a fork across the top. Serve the panko crusted fish. Remove the fish from the oven and sprinkle a little fresh parsley over the top. Consider serving the fish with steamed vegetables and rice. Garnish the fish with slices or wedges of fresh lemon on the side. While you can store the cooked fish in the refrigerator for 3 to 4 days, it will become soggy as it's stored. Frying Crispy Panko Breaded Fish Set up a dredging station. Set 3 shallow bowls on your work surface. Measure 4/5 cup (100 g) of flour into one bowl. Crack 2 eggs in the next bowl and beat them with a little salt. Measure 3 3/4 cups (230 g) of panko breadcrumbs into the last bowl. Heat the oil in a large skillet. Pour 1/2 cup (120 ml) of the vegetable oil into a large skillet and turn the heat to medium-high. The oil should reach about 355 °F (179 °C) or begin to shimmer once it's hot enough. Coat the fish in the flour, beaten egg, and panko breadcrumbs. Take 4 fillets of white fish and set each one in the flour. Turn the pieces to coat them and shake the excess flour off. Place the floured pieces in the beaten egg, so they're completely coated. Put the fish in the panko breadcrumbs and turn them until they're covered. You can use your favorite white fish. For example, try lemon sole, plaice, haddock or cod. Fry the fish for 3 minutes. Slowly lower 2 pieces of panko breaded fish into the hot oil. Let the fish fry over medium-high heat for 3 minutes. It should turn golden brown on one side. Flip and fry the fish for 3 more minutes. Use a fish spatula or turner to slowly flip both pieces of fish over. Fry the fish for 3 minutes, so they're completely browned on both sides and cooked through. Heat the oil again and fry the rest of the fish. Lay a paper towel over a plate and set it next to the skillet. Lift the fried fish out of the skillet and place it on the paper towel to drain. Let the oil heat back up until it's shimmering and then fry the last 2 pieces of coated fish. Serve the crispy panko breaded fish. Serve the fish while the pieces are still hot and crispy. Sprinkle the fish with flaky sea salt according to your taste. Consider serving them with tartar sauce and slices of lemon. Avoid storing the crispy fish because the coating will become soggy. Pan-Searing Panko Coated Fish Preheat the oven and season the fish. Turn the oven on to 300 °F (149 °C). Get out four 5 to 8-ounce pieces of fish. Use thick fillets or fish steaks. Pat them dry with a paper towel and season them with kosher salt and ground pepper according to your taste. Set the fish aside. You can use your favorite fish in this recipe, or try halibut, striped bass, sea bass, or swordfish. Create a dredging station. Set three shallow bowls on your work surface. Place 1/2 cup (60 g) of all-purpose flour in one bowl, 1 large egg in the next bowl, and 1 1/2 cups (93 g) of panko breadcrumbs in the last bowl. Beat the egg with a fork and sprinkle a little salt and pepper over each each bowl. Coat the fish in the flour, egg, and panko breadcrumbs. Hold 1 fish steak or fillet and dip one side in the flour. Lift the fish up and dip the floured side in the beaten egg. Lift the fish up and press the coated side into the panko breadcrumbs. The panko should stick to that side of the fish. Set the fish on a plate and coat the remaining fillets or fish steaks. Keep in mind that this method gives you a crispy crust on just one side of the fish. Heat the oil in a skillet over medium heat. Pour 3 tablespoons (45 ml) of vegetable, canola, or peanut oil into a large oven-safe skillet. Turn the heat on to medium and let the oil heat. It should shimmer when it's ready. Sear one side of the fish for 5 minutes. Lay each piece of fish in the skillet so the panko breaded side is down in the oil. Cook the fish over medium heat for 5 minutes and swirl the oil in the pan occasionally. This will help the fish get a golden brown crust. Flip the fish and bake it for 5 minutes. Use a fish spatula or turner and slowly flip each fish steak or fillet over. Put the skillet in the preheated oven and bake the fish for 5 minutes. The fish should be completely cooked. Check the temperature and serve the fish. Insert an instant-read thermometer into the thickest part of the fish. It should be at 140 °F (60 °C) once it's finished cooking. Plate up the fish while it's hot and serve it with lemon wedges or tartar sauce. While you can store the cooked fish in the refrigerator for 3 to 4 days, it will become soggy the longer it's stored.",
    "sentences": [
        " Baking Panko Crusted Fish Preheat the oven and prepare a baking sheet.",
        "Turn the oven on to 425 °F (218 °C).",
        "Get out a baking sheet and lay a piece of parchment paper on it.",
        "Spray the parchment paper with nonstick cooking spray and set it aside.",
        "Combine the seasoned panko mixture.",
        "Set a shallow bowl or plate on your work surface and measure ½ cup (30 g) of panko breadcrumbs into it.",
        "Add ½ teaspoon (1 g) of lemon zest, and ¼ teaspoon (1.5 g) of salt.",
        "Use your fingers to stir the mixture until the seasonings are combined with the panko.",
        "Set the mixture aside.",
        "Season the fish and dip them in beaten egg.",
        "Get out another shallow plate or bowl and crack 1 egg into it.",
        "Beat the egg with a fork.",
        "Sprinkle 2 fish fillets with salt and pepper according to your taste and dip the fish in the beaten egg.",
        "You can use your favorite fish for this recipe.",
        "Try salmon, cod, halibut, mahi mahi, or rockfish.",
        "Roll the fish in the seasoned panko mixture.",
        "Lift the fish fillets out of the egg and let the excess egg drip off.",
        "Lay the fish in the seasoned panko and roll the fillets gently.",
        "The panko should stick to the sides of the fish.",
        "Bake the panko crusted fish for 14 to 16 minutes.",
        "Lay the fish in a single layer on the prepared baking sheet.",
        "Put the fish in the preheated oven and bake the fillets for 14 to 16 minutes.",
        "The fish should flake easily when you run a fork across the top.",
        "Serve the panko crusted fish.",
        "Remove the fish from the oven and sprinkle a little fresh parsley over the top.",
        "Consider serving the fish with steamed vegetables and rice.",
        "Garnish the fish with slices or wedges of fresh lemon on the side.",
        "While you can store the cooked fish in the refrigerator for 3 to 4 days, it will become soggy as it's stored.",
        "Frying Crispy Panko Breaded Fish Set up a dredging station.",
        "Set 3 shallow bowls on your work surface.",
        "Measure 4/5 cup (100 g) of flour into one bowl.",
        "Crack 2 eggs in the next bowl and beat them with a little salt.",
        "Measure 3 3/4 cups (230 g) of panko breadcrumbs into the last bowl.",
        "Heat the oil in a large skillet.",
        "Pour 1/2 cup (120 ml) of the vegetable oil into a large skillet and turn the heat to medium-high.",
        "The oil should reach about 355 °F (179 °C) or begin to shimmer once it's hot enough.",
        "Coat the fish in the flour, beaten egg, and panko breadcrumbs.",
        "Take 4 fillets of white fish and set each one in the flour.",
        "Turn the pieces to coat them and shake the excess flour off.",
        "Place the floured pieces in the beaten egg, so they're completely coated.",
        "Put the fish in the panko breadcrumbs and turn them until they're covered.",
        "You can use your favorite white fish.",
        "For example, try lemon sole, plaice, haddock or cod.",
        "Fry the fish for 3 minutes.",
        "Slowly lower 2 pieces of panko breaded fish into the hot oil.",
        "Let the fish fry over medium-high heat for 3 minutes.",
        "It should turn golden brown on one side.",
        "Flip and fry the fish for 3 more minutes.",
        "Use a fish spatula or turner to slowly flip both pieces of fish over.",
        "Fry the fish for 3 minutes, so they're completely browned on both sides and cooked through.",
        "Heat the oil again and fry the rest of the fish.",
        "Lay a paper towel over a plate and set it next to the skillet.",
        "Lift the fried fish out of the skillet and place it on the paper towel to drain.",
        "Let the oil heat back up until it's shimmering and then fry the last 2 pieces of coated fish.",
        "Serve the crispy panko breaded fish.",
        "Serve the fish while the pieces are still hot and crispy.",
        "Sprinkle the fish with flaky sea salt according to your taste.",
        "Consider serving them with tartar sauce and slices of lemon.",
        "Avoid storing the crispy fish because the coating will become soggy.",
        "Pan-Searing Panko Coated Fish Preheat the oven and season the fish.",
        "Turn the oven on to 300 °F (149 °C).",
        "Get out four 5 to 8-ounce pieces of fish.",
        "Use thick fillets or fish steaks.",
        "Pat them dry with a paper towel and season them with kosher salt and ground pepper according to your taste.",
        "Set the fish aside.",
        "You can use your favorite fish in this recipe, or try halibut, striped bass, sea bass, or swordfish.",
        "Create a dredging station.",
        "Set three shallow bowls on your work surface.",
        "Place 1/2 cup (60 g) of all-purpose flour in one bowl, 1 large egg in the next bowl, and 1 1/2 cups (93 g) of panko breadcrumbs in the last bowl.",
        "Beat the egg with a fork and sprinkle a little salt and pepper over each each bowl.",
        "Coat the fish in the flour, egg, and panko breadcrumbs.",
        "Hold 1 fish steak or fillet and dip one side in the flour.",
        "Lift the fish up and dip the floured side in the beaten egg.",
        "Lift the fish up and press the coated side into the panko breadcrumbs.",
        "The panko should stick to that side of the fish.",
        "Set the fish on a plate and coat the remaining fillets or fish steaks.",
        "Keep in mind that this method gives you a crispy crust on just one side of the fish.",
        "Heat the oil in a skillet over medium heat.",
        "Pour 3 tablespoons (45 ml) of vegetable, canola, or peanut oil into a large oven-safe skillet.",
        "Turn the heat on to medium and let the oil heat.",
        "It should shimmer when it's ready.",
        "Sear one side of the fish for 5 minutes.",
        "Lay each piece of fish in the skillet so the panko breaded side is down in the oil.",
        "Cook the fish over medium heat for 5 minutes and swirl the oil in the pan occasionally.",
        "This will help the fish get a golden brown crust.",
        "Flip the fish and bake it for 5 minutes.",
        "Use a fish spatula or turner and slowly flip each fish steak or fillet over.",
        "Put the skillet in the preheated oven and bake the fish for 5 minutes.",
        "The fish should be completely cooked.",
        "Check the temperature and serve the fish.",
        "Insert an instant-read thermometer into the thickest part of the fish.",
        "It should be at 140 °F (60 °C) once it's finished cooking.",
        "Plate up the fish while it's hot and serve it with lemon wedges or tartar sauce.",
        "While you can store the cooked fish in the refrigerator for 3 to 4 days, it will become soggy the longer it's stored."
    ]
}