{
    "title": "How to Burn Palo Santo Wood",
    "url": "https://www.wikihow.com/Burn-Palo-Santo-Wood",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Woodworking",
        "Wood"
    ],
    "parts": [
        {
            "name": "Burning Palo Santo",
            "steps": [
                {
                    "headline": "Obtain some palo santo wood.",
                    "description": "You can often find palo santo at aromatherapy stores, bohemian shops, yoga and massage studios and places where holistic medical supplies are sold. The wood usually comes in bundles, with 5-6 sticks per bundle. It is naturally bold and fragrant, with hints of citrus, spice, and mint. If you’re having trouble tracking down palo santo locally, try ordering it from holistic lifestyle websites online. The wood is also available in cone form, making it suitable for incense burners and scent diffusers."
                },
                {
                    "headline": "Light the palo santo over an open flame.",
                    "description": "Take hold of one end of the stick and hold the opposite end to a fire, candle, or lighter. Rotate the stick back and forth slowly in the flame. Palo santo is a dense wood that doesn’t burn easily, so it may take a few seconds for it to catch. Watch for a glowing ember to form at the end of the stick."
                },
                {
                    "headline": "Blow out the flame.",
                    "description": "Once you’ve successfully lit the wood, let it burn for about 30 seconds, then give it a forceful gust to snuff the fire engulfing the tip. It will continue to smolder until it goes out on its own or you decide to extinguish it."
                },
                {
                    "headline": "Fan the stick to keep it lit.",
                    "description": "If the ember looks like it’s in danger of dying before the wood has begun to emit smoke, a little air will help reignite it. Shake or blow on the stick gently to get it going again. This may only work as a temporary measure, however—even with some assistance, it might need to be relit several times before it has burned out completely. Be careful not to blow so hard that you extinguish the flame accidentally."
                },
                {
                    "headline": "Waft the smoke around the room.",
                    "description": "Wave the stick through the air in all directions to release the pungent smoke. As it continues to burn, it will fill the room with a mild and pleasant aroma. Guide the wood over any areas you want to purify, including corners, corridors, and inside closets. Avoid bringing the palo santo too close to your hair, clothing, or body while you’re holding it. Have an ashtray or similar receptacle on hand to catch the ash that falls from the burnt wood."
                },
                {
                    "headline": "Extinguish the stick in a metal, glass, or ceramic bowl.",
                    "description": "When you’re ready to put out the palo santo, grind the lit tip into a fireproof receptacle that won’t melt or leave behind any unsightly marks. A thin layer of sand or ashes will help snuff the wood faster. Check to make sure the stick has stopped burning before you walk away and leave it unattended. Many palo santo users recommend metal containers over glass and ceramic, which have been known to crack or shatter when exposed to intense heat\nSince it burns so slowly, a single stick of palo santo can give you up to half an hour of use, depending on its size and thickness."
                }
            ]
        },
        {
            "name": "Finding Different Uses for Palo Santo",
            "steps": [
                {
                    "headline": "Use palo santo to destress and recenter.",
                    "description": "The wood’s delicate, calming smoke makes it a perfect addition to a home aromatherapy session. Light a stick and place it in a safe receptacle a few feet away to continue burning. Inhale the scent as you meditate, practice yoga, or simply ease your mind after a long day. Palo santo makes a simple yet exotic alternative to scented candles and ordinary varieties of incense. Bring a stick and ashtray along with you while you take a long, relaxing soak in the tub."
                },
                {
                    "headline": "Ward off bugs.",
                    "description": "Palo santo is an exceptional natural insect repellent—in fact, that was one of its original uses. The next time you’re having a backyard barbecue or entertaining guests on the patio, leave a stick or two of the wood smoldering nearby. You’ll be able to enjoy your engagement without the constant buzzing and biting. The sharp fragrance of palo santo is very effective for keeping persistent pests like flies, gnats, and mosquitoes at bay. Try burning palo santo in your porch or foyer to drive out bugs that have already found their way inside."
                },
                {
                    "headline": "Cleanse the atmosphere in your home.",
                    "description": "Many enthusiasts believe that palo santo is imbued with powerful spiritual properties that can clear away negative energies. To restore balance in your home, carry a burning stick from room to room, letting the smoke spread to the ceiling. Focus on sending peaceful, loving vibrations radiating outward with the smoke. To dispel stubborn lingering energies, combine a stick of palo santo with a bundle of dried sage—another potent item that’s commonly employed in cleansing rituals."
                },
                {
                    "headline": "Purify your aura.",
                    "description": "Just as palo santo can be used to banish negative influences from your personal space, it can also work wonders on your mood. Guide the stick slowly up and down the length of your body several times, letting the smoke hover a few inches away from you. Imagine your anxiety, fear, and anger dissipating with each pass. When you’re done, allow the wood to burn out on its own. If you wish, you can recite a prayer of healing or wisdom while smudging. Remember to keep the palo santo a safe distance from you at all times."
                },
                {
                    "headline": "Treat the symptoms of a minor illness.",
                    "description": "Another possible application for palo santo is as a safe, all-natural home remedy. The essences of the smoke act similarly to compounds like camphor and menthol, and have the ability to reduce the severity of nausea, sinus congestion, and headaches. Avoid breathing the burning wood too deeply, or it could irritate your nose, throat, and lungs. It’s the fragrance you want, not the smoke. Palo santo and other holistic remedies should not be considered a substitute for the advice of a qualified physician. If you’re really sick, see a doctor."
                }
            ]
        }
    ],
    "tyn": [
        "Palo santo wood sticks",
        "Ashtray or fireproof receptacle (metal, glass, or ceramic)",
        "Lighter or candle",
        "Incense burner or scent diffuser (optional)"
    ],
    "text": " Burning Palo Santo Obtain some palo santo wood. You can often find palo santo at aromatherapy stores, bohemian shops, yoga and massage studios and places where holistic medical supplies are sold. The wood usually comes in bundles, with 5-6 sticks per bundle. It is naturally bold and fragrant, with hints of citrus, spice, and mint. If you’re having trouble tracking down palo santo locally, try ordering it from holistic lifestyle websites online. The wood is also available in cone form, making it suitable for incense burners and scent diffusers. Light the palo santo over an open flame. Take hold of one end of the stick and hold the opposite end to a fire, candle, or lighter. Rotate the stick back and forth slowly in the flame. Palo santo is a dense wood that doesn’t burn easily, so it may take a few seconds for it to catch. Watch for a glowing ember to form at the end of the stick. Blow out the flame. Once you’ve successfully lit the wood, let it burn for about 30 seconds, then give it a forceful gust to snuff the fire engulfing the tip. It will continue to smolder until it goes out on its own or you decide to extinguish it. Fan the stick to keep it lit. If the ember looks like it’s in danger of dying before the wood has begun to emit smoke, a little air will help reignite it. Shake or blow on the stick gently to get it going again. This may only work as a temporary measure, however—even with some assistance, it might need to be relit several times before it has burned out completely. Be careful not to blow so hard that you extinguish the flame accidentally. Waft the smoke around the room. Wave the stick through the air in all directions to release the pungent smoke. As it continues to burn, it will fill the room with a mild and pleasant aroma. Guide the wood over any areas you want to purify, including corners, corridors, and inside closets. Avoid bringing the palo santo too close to your hair, clothing, or body while you’re holding it. Have an ashtray or similar receptacle on hand to catch the ash that falls from the burnt wood. Extinguish the stick in a metal, glass, or ceramic bowl. When you’re ready to put out the palo santo, grind the lit tip into a fireproof receptacle that won’t melt or leave behind any unsightly marks. A thin layer of sand or ashes will help snuff the wood faster. Check to make sure the stick has stopped burning before you walk away and leave it unattended. Many palo santo users recommend metal containers over glass and ceramic, which have been known to crack or shatter when exposed to intense heat\nSince it burns so slowly, a single stick of palo santo can give you up to half an hour of use, depending on its size and thickness. Finding Different Uses for Palo Santo Use palo santo to destress and recenter. The wood’s delicate, calming smoke makes it a perfect addition to a home aromatherapy session. Light a stick and place it in a safe receptacle a few feet away to continue burning. Inhale the scent as you meditate, practice yoga, or simply ease your mind after a long day. Palo santo makes a simple yet exotic alternative to scented candles and ordinary varieties of incense. Bring a stick and ashtray along with you while you take a long, relaxing soak in the tub. Ward off bugs. Palo santo is an exceptional natural insect repellent—in fact, that was one of its original uses. The next time you’re having a backyard barbecue or entertaining guests on the patio, leave a stick or two of the wood smoldering nearby. You’ll be able to enjoy your engagement without the constant buzzing and biting. The sharp fragrance of palo santo is very effective for keeping persistent pests like flies, gnats, and mosquitoes at bay. Try burning palo santo in your porch or foyer to drive out bugs that have already found their way inside. Cleanse the atmosphere in your home. Many enthusiasts believe that palo santo is imbued with powerful spiritual properties that can clear away negative energies. To restore balance in your home, carry a burning stick from room to room, letting the smoke spread to the ceiling. Focus on sending peaceful, loving vibrations radiating outward with the smoke. To dispel stubborn lingering energies, combine a stick of palo santo with a bundle of dried sage—another potent item that’s commonly employed in cleansing rituals. Purify your aura. Just as palo santo can be used to banish negative influences from your personal space, it can also work wonders on your mood. Guide the stick slowly up and down the length of your body several times, letting the smoke hover a few inches away from you. Imagine your anxiety, fear, and anger dissipating with each pass. When you’re done, allow the wood to burn out on its own. If you wish, you can recite a prayer of healing or wisdom while smudging. Remember to keep the palo santo a safe distance from you at all times. Treat the symptoms of a minor illness. Another possible application for palo santo is as a safe, all-natural home remedy. The essences of the smoke act similarly to compounds like camphor and menthol, and have the ability to reduce the severity of nausea, sinus congestion, and headaches. Avoid breathing the burning wood too deeply, or it could irritate your nose, throat, and lungs. It’s the fragrance you want, not the smoke. Palo santo and other holistic remedies should not be considered a substitute for the advice of a qualified physician. If you’re really sick, see a doctor.",
    "sentences": [
        " Burning Palo Santo Obtain some palo santo wood.",
        "You can often find palo santo at aromatherapy stores, bohemian shops, yoga and massage studios and places where holistic medical supplies are sold.",
        "The wood usually comes in bundles, with 5-6 sticks per bundle.",
        "It is naturally bold and fragrant, with hints of citrus, spice, and mint.",
        "If you’re having trouble tracking down palo santo locally, try ordering it from holistic lifestyle websites online.",
        "The wood is also available in cone form, making it suitable for incense burners and scent diffusers.",
        "Light the palo santo over an open flame.",
        "Take hold of one end of the stick and hold the opposite end to a fire, candle, or lighter.",
        "Rotate the stick back and forth slowly in the flame.",
        "Palo santo is a dense wood that doesn’t burn easily, so it may take a few seconds for it to catch.",
        "Watch for a glowing ember to form at the end of the stick.",
        "Blow out the flame.",
        "Once you’ve successfully lit the wood, let it burn for about 30 seconds, then give it a forceful gust to snuff the fire engulfing the tip.",
        "It will continue to smolder until it goes out on its own or you decide to extinguish it.",
        "Fan the stick to keep it lit.",
        "If the ember looks like it’s in danger of dying before the wood has begun to emit smoke, a little air will help reignite it.",
        "Shake or blow on the stick gently to get it going again.",
        "This may only work as a temporary measure, however—even with some assistance, it might need to be relit several times before it has burned out completely.",
        "Be careful not to blow so hard that you extinguish the flame accidentally.",
        "Waft the smoke around the room.",
        "Wave the stick through the air in all directions to release the pungent smoke.",
        "As it continues to burn, it will fill the room with a mild and pleasant aroma.",
        "Guide the wood over any areas you want to purify, including corners, corridors, and inside closets.",
        "Avoid bringing the palo santo too close to your hair, clothing, or body while you’re holding it.",
        "Have an ashtray or similar receptacle on hand to catch the ash that falls from the burnt wood.",
        "Extinguish the stick in a metal, glass, or ceramic bowl.",
        "When you’re ready to put out the palo santo, grind the lit tip into a fireproof receptacle that won’t melt or leave behind any unsightly marks.",
        "A thin layer of sand or ashes will help snuff the wood faster.",
        "Check to make sure the stick has stopped burning before you walk away and leave it unattended.",
        "Many palo santo users recommend metal containers over glass and ceramic, which have been known to crack or shatter when exposed to intense heat\nSince it burns so slowly, a single stick of palo santo can give you up to half an hour of use, depending on its size and thickness.",
        "Finding Different Uses for Palo Santo Use palo santo to destress and recenter.",
        "The wood’s delicate, calming smoke makes it a perfect addition to a home aromatherapy session.",
        "Light a stick and place it in a safe receptacle a few feet away to continue burning.",
        "Inhale the scent as you meditate, practice yoga, or simply ease your mind after a long day.",
        "Palo santo makes a simple yet exotic alternative to scented candles and ordinary varieties of incense.",
        "Bring a stick and ashtray along with you while you take a long, relaxing soak in the tub.",
        "Ward off bugs.",
        "Palo santo is an exceptional natural insect repellent—in fact, that was one of its original uses.",
        "The next time you’re having a backyard barbecue or entertaining guests on the patio, leave a stick or two of the wood smoldering nearby.",
        "You’ll be able to enjoy your engagement without the constant buzzing and biting.",
        "The sharp fragrance of palo santo is very effective for keeping persistent pests like flies, gnats, and mosquitoes at bay.",
        "Try burning palo santo in your porch or foyer to drive out bugs that have already found their way inside.",
        "Cleanse the atmosphere in your home.",
        "Many enthusiasts believe that palo santo is imbued with powerful spiritual properties that can clear away negative energies.",
        "To restore balance in your home, carry a burning stick from room to room, letting the smoke spread to the ceiling.",
        "Focus on sending peaceful, loving vibrations radiating outward with the smoke.",
        "To dispel stubborn lingering energies, combine a stick of palo santo with a bundle of dried sage—another potent item that’s commonly employed in cleansing rituals.",
        "Purify your aura.",
        "Just as palo santo can be used to banish negative influences from your personal space, it can also work wonders on your mood.",
        "Guide the stick slowly up and down the length of your body several times, letting the smoke hover a few inches away from you.",
        "Imagine your anxiety, fear, and anger dissipating with each pass.",
        "When you’re done, allow the wood to burn out on its own.",
        "If you wish, you can recite a prayer of healing or wisdom while smudging.",
        "Remember to keep the palo santo a safe distance from you at all times.",
        "Treat the symptoms of a minor illness.",
        "Another possible application for palo santo is as a safe, all-natural home remedy.",
        "The essences of the smoke act similarly to compounds like camphor and menthol, and have the ability to reduce the severity of nausea, sinus congestion, and headaches.",
        "Avoid breathing the burning wood too deeply, or it could irritate your nose, throat, and lungs.",
        "It’s the fragrance you want, not the smoke.",
        "Palo santo and other holistic remedies should not be considered a substitute for the advice of a qualified physician.",
        "If you’re really sick, see a doctor."
    ]
}