{
    "title": "How to Fix a Laptop Screen",
    "url": "https://www.wikihow.com/Fix-a-Laptop-Screen",
    "category_hierarchy": [
        "Computers and Electronics",
        "Computers",
        "Laptops",
        "Laptop Maintenance and Repair"
    ],
    "parts": [
        {
            "name": "Taking Off the Old Laptop Screen",
            "steps": [
                {
                    "headline": "Unplug the laptop and remove the battery.",
                    "description": "Make sure there is no power going into the laptop, as you do not want to work with any live wires or electricity. Slide out the battery so the computer is not on or powered. Keep the battery in a safe spot, as you will need to put it back in later."
                },
                {
                    "headline": "Remove the rubber screw covers on the screen.",
                    "description": "Most laptops will have small screw covers made of rubber around the screen to protect the screws. Use the tip of a screwdriver or a safety pin to pry off the rubber covers so you can see the bezel screws. Place the rubber covers in a small plastic bag or a small bowl so you do not lose them."
                },
                {
                    "headline": "Use a screwdriver to remove the bezel screws.",
                    "description": "Look on the front of the screen’s frame for the bezel screws. Some laptop models will have the screws along the side of the screen. Use the screwdriver to remove the screws one at a time. There are usually 4-6 bezel screws. Place the screws in the same plastic bag or bowl with the rubber covers so all the components are together in a safe place."
                },
                {
                    "headline": "Detach the bezel from the screen.",
                    "description": "Place your fingers at the bottom center of the laptop screen. Then, gently slide your fingers between the bezel and the screen. Pull the bezel with your fingers. It should snap loose. If it does not, try pulling it gently in different directions until it comes loose. Work your fingers around the bezel until it detaches from the screen. If the bezel does not pop or slide off with a bit of pulling, you may have missed a bezel screw. Check the screen to confirm you removed all the bezel screws so the bezel can slide off."
                },
                {
                    "headline": "Disconnect the cables connected to the screen.",
                    "description": "Locate the video cable, which is a long ribbon cable taped to the back of the screen. Peel off the tape and unplug the connector from the back of the screen. You will also need to remove the power cable on the back of the screen. Depending on your laptop model, you may also have to remove screws along the side of the screen that attach it to the metal frame. Use a screwdriver to do this. Keep the screws in a safe place."
                },
                {
                    "headline": "Remove the laptop screen.",
                    "description": "Now that the bezel and cables have been removed, the screen should be loose in a metal frame. Tilt the screen forward and carefully remove it from the frame. Place the screen on a flat surface so you can examine it later. Be careful of any broken glass or plastic on the screen as you remove it."
                }
            ]
        },
        {
            "name": "Putting On the New Screen",
            "steps": [
                {
                    "headline": "Check the label on the screen for the manufacturer’s label and model number.",
                    "description": "There should be a label on the side or back of the screen that has a bar code as well as the manufacturer’s label and the model number of the computer. The model number is usually a series of letters and numbers. Use the manufacturer’s label and the model number to order a replacement screen for the laptop. For example, if your manufacturer’s label is Dell and the model number is DE156FW1, you can search this information to find the right replacement screen."
                },
                {
                    "headline": "Buy a replacement screen online or at a computer parts store.",
                    "description": "Search online retailers like eBay and Amazon for a replacement screen. Make sure the replacement screen is the same manufacturer and model number so it will fit in your laptop correctly. You can also buy a replacement screen at a computer parts store, but it may be more expensive than buying it online. The cost of the screen will depend on the brand and type of laptop. Replacement screens can range in price from $100-$300 USD."
                },
                {
                    "headline": "Place the screen in the metal frame on the laptop.",
                    "description": "Once you get the replacement screen, set it in place in the metal frame. Make sure it is facing the right way and slides easily into the frame. Have the bezel screws and rubber covers on hand in a bag or bowl so you can put them on the new screen."
                },
                {
                    "headline": "Reconnect the cables to the new screen.",
                    "description": "Use your fingers to carefully attach the video cable and the power cable onto the back of the new screen. Check that the cables are secure and fit properly onto the new screen. If you got the right manufacturer and model number, the cables should fit properly."
                }
            ]
        },
        {
            "name": "Confirming the Laptop Screen is Fixed",
            "steps": [
                {
                    "headline": "Put the battery back into the laptop and plug it in.",
                    "description": "Before you screw in the screen, make sure it works. Connect the laptop to a power source so you can test it."
                },
                {
                    "headline": "Check that the screen works properly.",
                    "description": "Look at the laptop screen as you click on your desktop and open a browser. Check that there are no blurry lines, cracks, or distorted images on the screen. The screen should be clear and function like new."
                },
                {
                    "headline": "Put in the bezel and the bezel screws to secure the new screen.",
                    "description": "Attach the bezel by snapping it over the screen. Then, put the bezel screws in, tightening them with a screwdriver so the screen is held in place. Finish by putting on the rubber covers on the bezel screws so the screws are secure and protected."
                }
            ]
        }
    ],
    "tyn": [
        "A screw driver",
        "A safety pin",
        "A replacement screen",
        "Plastic bag or bowl"
    ],
    "text": " Taking Off the Old Laptop Screen Unplug the laptop and remove the battery. Make sure there is no power going into the laptop, as you do not want to work with any live wires or electricity. Slide out the battery so the computer is not on or powered. Keep the battery in a safe spot, as you will need to put it back in later. Remove the rubber screw covers on the screen. Most laptops will have small screw covers made of rubber around the screen to protect the screws. Use the tip of a screwdriver or a safety pin to pry off the rubber covers so you can see the bezel screws. Place the rubber covers in a small plastic bag or a small bowl so you do not lose them. Use a screwdriver to remove the bezel screws. Look on the front of the screen’s frame for the bezel screws. Some laptop models will have the screws along the side of the screen. Use the screwdriver to remove the screws one at a time. There are usually 4-6 bezel screws. Place the screws in the same plastic bag or bowl with the rubber covers so all the components are together in a safe place. Detach the bezel from the screen. Place your fingers at the bottom center of the laptop screen. Then, gently slide your fingers between the bezel and the screen. Pull the bezel with your fingers. It should snap loose. If it does not, try pulling it gently in different directions until it comes loose. Work your fingers around the bezel until it detaches from the screen. If the bezel does not pop or slide off with a bit of pulling, you may have missed a bezel screw. Check the screen to confirm you removed all the bezel screws so the bezel can slide off. Disconnect the cables connected to the screen. Locate the video cable, which is a long ribbon cable taped to the back of the screen. Peel off the tape and unplug the connector from the back of the screen. You will also need to remove the power cable on the back of the screen. Depending on your laptop model, you may also have to remove screws along the side of the screen that attach it to the metal frame. Use a screwdriver to do this. Keep the screws in a safe place. Remove the laptop screen. Now that the bezel and cables have been removed, the screen should be loose in a metal frame. Tilt the screen forward and carefully remove it from the frame. Place the screen on a flat surface so you can examine it later. Be careful of any broken glass or plastic on the screen as you remove it. Putting On the New Screen Check the label on the screen for the manufacturer’s label and model number. There should be a label on the side or back of the screen that has a bar code as well as the manufacturer’s label and the model number of the computer. The model number is usually a series of letters and numbers. Use the manufacturer’s label and the model number to order a replacement screen for the laptop. For example, if your manufacturer’s label is Dell and the model number is DE156FW1, you can search this information to find the right replacement screen. Buy a replacement screen online or at a computer parts store. Search online retailers like eBay and Amazon for a replacement screen. Make sure the replacement screen is the same manufacturer and model number so it will fit in your laptop correctly. You can also buy a replacement screen at a computer parts store, but it may be more expensive than buying it online. The cost of the screen will depend on the brand and type of laptop. Replacement screens can range in price from $100-$300 USD. Place the screen in the metal frame on the laptop. Once you get the replacement screen, set it in place in the metal frame. Make sure it is facing the right way and slides easily into the frame. Have the bezel screws and rubber covers on hand in a bag or bowl so you can put them on the new screen. Reconnect the cables to the new screen. Use your fingers to carefully attach the video cable and the power cable onto the back of the new screen. Check that the cables are secure and fit properly onto the new screen. If you got the right manufacturer and model number, the cables should fit properly. Confirming the Laptop Screen is Fixed Put the battery back into the laptop and plug it in. Before you screw in the screen, make sure it works. Connect the laptop to a power source so you can test it. Check that the screen works properly. Look at the laptop screen as you click on your desktop and open a browser. Check that there are no blurry lines, cracks, or distorted images on the screen. The screen should be clear and function like new. Put in the bezel and the bezel screws to secure the new screen. Attach the bezel by snapping it over the screen. Then, put the bezel screws in, tightening them with a screwdriver so the screen is held in place. Finish by putting on the rubber covers on the bezel screws so the screws are secure and protected.",
    "sentences": [
        " Taking Off the Old Laptop Screen Unplug the laptop and remove the battery.",
        "Make sure there is no power going into the laptop, as you do not want to work with any live wires or electricity.",
        "Slide out the battery so the computer is not on or powered.",
        "Keep the battery in a safe spot, as you will need to put it back in later.",
        "Remove the rubber screw covers on the screen.",
        "Most laptops will have small screw covers made of rubber around the screen to protect the screws.",
        "Use the tip of a screwdriver or a safety pin to pry off the rubber covers so you can see the bezel screws.",
        "Place the rubber covers in a small plastic bag or a small bowl so you do not lose them.",
        "Use a screwdriver to remove the bezel screws.",
        "Look on the front of the screen’s frame for the bezel screws.",
        "Some laptop models will have the screws along the side of the screen.",
        "Use the screwdriver to remove the screws one at a time.",
        "There are usually 4-6 bezel screws.",
        "Place the screws in the same plastic bag or bowl with the rubber covers so all the components are together in a safe place.",
        "Detach the bezel from the screen.",
        "Place your fingers at the bottom center of the laptop screen.",
        "Then, gently slide your fingers between the bezel and the screen.",
        "Pull the bezel with your fingers.",
        "It should snap loose.",
        "If it does not, try pulling it gently in different directions until it comes loose.",
        "Work your fingers around the bezel until it detaches from the screen.",
        "If the bezel does not pop or slide off with a bit of pulling, you may have missed a bezel screw.",
        "Check the screen to confirm you removed all the bezel screws so the bezel can slide off.",
        "Disconnect the cables connected to the screen.",
        "Locate the video cable, which is a long ribbon cable taped to the back of the screen.",
        "Peel off the tape and unplug the connector from the back of the screen.",
        "You will also need to remove the power cable on the back of the screen.",
        "Depending on your laptop model, you may also have to remove screws along the side of the screen that attach it to the metal frame.",
        "Use a screwdriver to do this.",
        "Keep the screws in a safe place.",
        "Remove the laptop screen.",
        "Now that the bezel and cables have been removed, the screen should be loose in a metal frame.",
        "Tilt the screen forward and carefully remove it from the frame.",
        "Place the screen on a flat surface so you can examine it later.",
        "Be careful of any broken glass or plastic on the screen as you remove it.",
        "Putting On the New Screen Check the label on the screen for the manufacturer’s label and model number.",
        "There should be a label on the side or back of the screen that has a bar code as well as the manufacturer’s label and the model number of the computer.",
        "The model number is usually a series of letters and numbers.",
        "Use the manufacturer’s label and the model number to order a replacement screen for the laptop.",
        "For example, if your manufacturer’s label is Dell and the model number is DE156FW1, you can search this information to find the right replacement screen.",
        "Buy a replacement screen online or at a computer parts store.",
        "Search online retailers like eBay and Amazon for a replacement screen.",
        "Make sure the replacement screen is the same manufacturer and model number so it will fit in your laptop correctly.",
        "You can also buy a replacement screen at a computer parts store, but it may be more expensive than buying it online.",
        "The cost of the screen will depend on the brand and type of laptop.",
        "Replacement screens can range in price from $100-$300 USD.",
        "Place the screen in the metal frame on the laptop.",
        "Once you get the replacement screen, set it in place in the metal frame.",
        "Make sure it is facing the right way and slides easily into the frame.",
        "Have the bezel screws and rubber covers on hand in a bag or bowl so you can put them on the new screen.",
        "Reconnect the cables to the new screen.",
        "Use your fingers to carefully attach the video cable and the power cable onto the back of the new screen.",
        "Check that the cables are secure and fit properly onto the new screen.",
        "If you got the right manufacturer and model number, the cables should fit properly.",
        "Confirming the Laptop Screen is Fixed Put the battery back into the laptop and plug it in.",
        "Before you screw in the screen, make sure it works.",
        "Connect the laptop to a power source so you can test it.",
        "Check that the screen works properly.",
        "Look at the laptop screen as you click on your desktop and open a browser.",
        "Check that there are no blurry lines, cracks, or distorted images on the screen.",
        "The screen should be clear and function like new.",
        "Put in the bezel and the bezel screws to secure the new screen.",
        "Attach the bezel by snapping it over the screen.",
        "Then, put the bezel screws in, tightening them with a screwdriver so the screen is held in place.",
        "Finish by putting on the rubber covers on the bezel screws so the screws are secure and protected."
    ]
}