{
    "title": "How to Cook Veal",
    "url": "https://www.wikihow.com/Cook-Veal",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Beef and Lamb"
    ],
    "methods": [
        {
            "name": "Selecting Veal",
            "steps": [
                {
                    "headline": "Buy veal that is fine grained and has a healthy pink color.",
                    "description": "When you are shopping for veal, make sure that the meat is a creamy pink color. It should have a fine-grained texture that is visible to the eye. There should be very little fat marbling on veal, as it is a very lean type of meat. Make sure that you purchase veal that is adequately refrigerated and well-wrapped to ensure quality."
                },
                {
                    "headline": "Choose the cut of veal you'd prefer.",
                    "description": "Select the cut of veal you want to buy based on the meal you have in mind. While many recipes for veal use simple cutlets, such as veal Milanese or wiener schnitzel, there are other interesting cuts of the meat to choose from. Take a stab at cooking:\nVeal short ribs, which are affordable and easily cooked by searing them and slowly baking them in the oven. Veal chops from the loin or rack, which are best served medium-rare. Veal shank, a bone-in cut taken from the lower leg of the calf. Ground veal, which is a very lean alternative to beef or pork."
                }
            ]
        },
        {
            "name": "Making Breaded Veal Scallops",
            "steps": [
                {
                    "headline": "Thin out the cutlets if necessary.",
                    "description": "If you do not like the thickness of your veal, slice it into thinner pieces. If you want to make schnitzel, a very thin version of veal scallops, use a meat hammer to gently pound the veal until it is flattened to your liking. For the best results, do this on a wooden cutting board."
                },
                {
                    "headline": "Trim off excess fat.",
                    "description": "Extra fat around the edges of your veal may cause curling when you fry it. Before battering your cutlets, use a small, sharp knife to trim extra fat. Brace each piece with one hand and trace around the edges carefully until the pieces are perfect."
                },
                {
                    "headline": "Dip veal cutlets in flour.",
                    "description": "Begin the breading process by coating veal pieces in regular, all-purpose flour. Next, dip them in a bowl of raw egg until they are fully covered. Finally, place the cutlets into a bowl of breadcrumbs, which will stick to the flour and egg coating very easily."
                },
                {
                    "headline": "Sautée the cutlets.",
                    "description": "Place a dab of butter or into a 1 tablespoon (15 ml) of cooking oil into a sautée pan and set it to a medium heat. Place your cutlets it the plan. Cook them for 2–3 minutes, turning once halfway through. Adjust the cooking time for thicker cutlets. Use a meat thermometer if you are not sure if they are cooked through."
                },
                {
                    "headline": "Serve the veal with vegetables or pasta.",
                    "description": "For a complete meal, serve breaded veal scallops with roasted vegetables like potatoes, carrots, zucchini, and red peppers. You can also serve them with spaghetti or other pasta for a satisfying supper. To boost the flavor of your meal, top your breaded veal scallops with a garlic cream sauce or tomato sauce."
                }
            ]
        },
        {
            "name": "Grilling Veal Chops, Medallions, or Burgers",
            "steps": [
                {
                    "headline": "Prepare the veal.",
                    "description": "Season your piece of veal however to your taste. To keep things simple, rub the meat with a few drops of cooking oil and as much salt and pepper as you wish. You can also use chopped garlic, steak spice, or experiment with other seasonings."
                },
                {
                    "headline": "Preheat the barbecue or grill.",
                    "description": "Avoid putting your veal on a grill or barbecue that is not properly heated. If you are cooking with a gas barbecue, start it and let it heat up for approximately 10 minutes. If you are using a charcoal grill, light it with a charcoal chimney and let it heat for about 20 minutes."
                },
                {
                    "headline": "Place the meat on the grill or barbecue.",
                    "description": "Use barbecue tongs to place your veal on the grill. Leave a few inches between each piece to make it easier to turn them. Place a meat thermometer nearby to periodically check how the veal is cooking."
                },
                {
                    "headline": "Flip and cook the veal for 12–14 minutes.",
                    "description": "Use the barbecue tongs to turn over the pieces of veal every few minutes, which will prevent sticking. This will also ensure even cooking. As a general rule, veal chops and burgers reach medium doneness after 12–14 minutes on the grill. To avoid overcooking, check the veal's temperature  with a digital meat thermometer around 10-minute mark. The veal should each an internal temperature of around 155 °F (68 °C)."
                }
            ]
        },
        {
            "name": "Braising Veal",
            "steps": [
                {
                    "headline": "Sear the veal in a heavy pan to brown it.",
                    "description": "Heat 1 tablespoon (15 ml) of cooking oil in a heavy pan. Using tongs, place the veal in the oil. Sear it for 1–2 minutes until it is browned, turning it halfway through."
                },
                {
                    "headline": "Add liquid to the pan and cover it.",
                    "description": "Remove the pan from heat. Add 1 cup (240 ml) of broth or water to the pan. Cover it with a lid or aluminum foil."
                },
                {
                    "headline": "Cook the veal at 325 °F (163 °C).",
                    "description": "Cook for the veal in the oven for 1.5 to 2.5 hours, depending on the size of your veal cut. Avoid overcooking the meat by checking its temperature at the 1.5 hour mark, and every 15–20 minutes after. Insert a digital meat thermometer into the thickest part of the meat to get an accurate reading."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Making Breaded Veal Scallops",
        "Sharp knife",
        "3 medium-sized bowls",
        "Sautée pan",
        "Meat hammer (optional)",
        "Grilling Veal Chops, Medallions, or Burgers",
        "Gas barbecue or charcoal grill",
        "Charcoal chimney (for the charcoal grill only)",
        "Barbecue tongs",
        "Digital meat thermometer",
        "Braising Veal",
        "Heavy pan",
        "Tongs",
        "Aluminum foil"
    ],
    "text": " Selecting Veal Buy veal that is fine grained and has a healthy pink color. When you are shopping for veal, make sure that the meat is a creamy pink color. It should have a fine-grained texture that is visible to the eye. There should be very little fat marbling on veal, as it is a very lean type of meat. Make sure that you purchase veal that is adequately refrigerated and well-wrapped to ensure quality. Choose the cut of veal you'd prefer. Select the cut of veal you want to buy based on the meal you have in mind. While many recipes for veal use simple cutlets, such as veal Milanese or wiener schnitzel, there are other interesting cuts of the meat to choose from. Take a stab at cooking:\nVeal short ribs, which are affordable and easily cooked by searing them and slowly baking them in the oven. Veal chops from the loin or rack, which are best served medium-rare. Veal shank, a bone-in cut taken from the lower leg of the calf. Ground veal, which is a very lean alternative to beef or pork. Making Breaded Veal Scallops Thin out the cutlets if necessary. If you do not like the thickness of your veal, slice it into thinner pieces. If you want to make schnitzel, a very thin version of veal scallops, use a meat hammer to gently pound the veal until it is flattened to your liking. For the best results, do this on a wooden cutting board. Trim off excess fat. Extra fat around the edges of your veal may cause curling when you fry it. Before battering your cutlets, use a small, sharp knife to trim extra fat. Brace each piece with one hand and trace around the edges carefully until the pieces are perfect. Dip veal cutlets in flour. Begin the breading process by coating veal pieces in regular, all-purpose flour. Next, dip them in a bowl of raw egg until they are fully covered. Finally, place the cutlets into a bowl of breadcrumbs, which will stick to the flour and egg coating very easily. Sautée the cutlets. Place a dab of butter or into a 1 tablespoon (15 ml) of cooking oil into a sautée pan and set it to a medium heat. Place your cutlets it the plan. Cook them for 2–3 minutes, turning once halfway through. Adjust the cooking time for thicker cutlets. Use a meat thermometer if you are not sure if they are cooked through. Serve the veal with vegetables or pasta. For a complete meal, serve breaded veal scallops with roasted vegetables like potatoes, carrots, zucchini, and red peppers. You can also serve them with spaghetti or other pasta for a satisfying supper. To boost the flavor of your meal, top your breaded veal scallops with a garlic cream sauce or tomato sauce. Grilling Veal Chops, Medallions, or Burgers Prepare the veal. Season your piece of veal however to your taste. To keep things simple, rub the meat with a few drops of cooking oil and as much salt and pepper as you wish. You can also use chopped garlic, steak spice, or experiment with other seasonings. Preheat the barbecue or grill. Avoid putting your veal on a grill or barbecue that is not properly heated. If you are cooking with a gas barbecue, start it and let it heat up for approximately 10 minutes. If you are using a charcoal grill, light it with a charcoal chimney and let it heat for about 20 minutes. Place the meat on the grill or barbecue. Use barbecue tongs to place your veal on the grill. Leave a few inches between each piece to make it easier to turn them. Place a meat thermometer nearby to periodically check how the veal is cooking. Flip and cook the veal for 12–14 minutes. Use the barbecue tongs to turn over the pieces of veal every few minutes, which will prevent sticking. This will also ensure even cooking. As a general rule, veal chops and burgers reach medium doneness after 12–14 minutes on the grill. To avoid overcooking, check the veal's temperature  with a digital meat thermometer around 10-minute mark. The veal should each an internal temperature of around 155 °F (68 °C). Braising Veal Sear the veal in a heavy pan to brown it. Heat 1 tablespoon (15 ml) of cooking oil in a heavy pan. Using tongs, place the veal in the oil. Sear it for 1–2 minutes until it is browned, turning it halfway through. Add liquid to the pan and cover it. Remove the pan from heat. Add 1 cup (240 ml) of broth or water to the pan. Cover it with a lid or aluminum foil. Cook the veal at 325 °F (163 °C). Cook for the veal in the oven for 1.5 to 2.5 hours, depending on the size of your veal cut. Avoid overcooking the meat by checking its temperature at the 1.5 hour mark, and every 15–20 minutes after. Insert a digital meat thermometer into the thickest part of the meat to get an accurate reading. Finished. ",
    "sentences": [
        " Selecting Veal Buy veal that is fine grained and has a healthy pink color.",
        "When you are shopping for veal, make sure that the meat is a creamy pink color.",
        "It should have a fine-grained texture that is visible to the eye.",
        "There should be very little fat marbling on veal, as it is a very lean type of meat.",
        "Make sure that you purchase veal that is adequately refrigerated and well-wrapped to ensure quality.",
        "Choose the cut of veal you'd prefer.",
        "Select the cut of veal you want to buy based on the meal you have in mind.",
        "While many recipes for veal use simple cutlets, such as veal Milanese or wiener schnitzel, there are other interesting cuts of the meat to choose from.",
        "Take a stab at cooking:\nVeal short ribs, which are affordable and easily cooked by searing them and slowly baking them in the oven.",
        "Veal chops from the loin or rack, which are best served medium-rare.",
        "Veal shank, a bone-in cut taken from the lower leg of the calf.",
        "Ground veal, which is a very lean alternative to beef or pork.",
        "Making Breaded Veal Scallops Thin out the cutlets if necessary.",
        "If you do not like the thickness of your veal, slice it into thinner pieces.",
        "If you want to make schnitzel, a very thin version of veal scallops, use a meat hammer to gently pound the veal until it is flattened to your liking.",
        "For the best results, do this on a wooden cutting board.",
        "Trim off excess fat.",
        "Extra fat around the edges of your veal may cause curling when you fry it.",
        "Before battering your cutlets, use a small, sharp knife to trim extra fat.",
        "Brace each piece with one hand and trace around the edges carefully until the pieces are perfect.",
        "Dip veal cutlets in flour.",
        "Begin the breading process by coating veal pieces in regular, all-purpose flour.",
        "Next, dip them in a bowl of raw egg until they are fully covered.",
        "Finally, place the cutlets into a bowl of breadcrumbs, which will stick to the flour and egg coating very easily.",
        "Sautée the cutlets.",
        "Place a dab of butter or into a 1 tablespoon (15 ml) of cooking oil into a sautée pan and set it to a medium heat.",
        "Place your cutlets it the plan.",
        "Cook them for 2–3 minutes, turning once halfway through.",
        "Adjust the cooking time for thicker cutlets.",
        "Use a meat thermometer if you are not sure if they are cooked through.",
        "Serve the veal with vegetables or pasta.",
        "For a complete meal, serve breaded veal scallops with roasted vegetables like potatoes, carrots, zucchini, and red peppers.",
        "You can also serve them with spaghetti or other pasta for a satisfying supper.",
        "To boost the flavor of your meal, top your breaded veal scallops with a garlic cream sauce or tomato sauce.",
        "Grilling Veal Chops, Medallions, or Burgers Prepare the veal.",
        "Season your piece of veal however to your taste.",
        "To keep things simple, rub the meat with a few drops of cooking oil and as much salt and pepper as you wish.",
        "You can also use chopped garlic, steak spice, or experiment with other seasonings.",
        "Preheat the barbecue or grill.",
        "Avoid putting your veal on a grill or barbecue that is not properly heated.",
        "If you are cooking with a gas barbecue, start it and let it heat up for approximately 10 minutes.",
        "If you are using a charcoal grill, light it with a charcoal chimney and let it heat for about 20 minutes.",
        "Place the meat on the grill or barbecue.",
        "Use barbecue tongs to place your veal on the grill.",
        "Leave a few inches between each piece to make it easier to turn them.",
        "Place a meat thermometer nearby to periodically check how the veal is cooking.",
        "Flip and cook the veal for 12–14 minutes.",
        "Use the barbecue tongs to turn over the pieces of veal every few minutes, which will prevent sticking.",
        "This will also ensure even cooking.",
        "As a general rule, veal chops and burgers reach medium doneness after 12–14 minutes on the grill.",
        "To avoid overcooking, check the veal's temperature  with a digital meat thermometer around 10-minute mark.",
        "The veal should each an internal temperature of around 155 °F (68 °C).",
        "Braising Veal Sear the veal in a heavy pan to brown it.",
        "Heat 1 tablespoon (15 ml) of cooking oil in a heavy pan.",
        "Using tongs, place the veal in the oil.",
        "Sear it for 1–2 minutes until it is browned, turning it halfway through.",
        "Add liquid to the pan and cover it.",
        "Remove the pan from heat.",
        "Add 1 cup (240 ml) of broth or water to the pan.",
        "Cover it with a lid or aluminum foil.",
        "Cook the veal at 325 °F (163 °C).",
        "Cook for the veal in the oven for 1.5 to 2.5 hours, depending on the size of your veal cut.",
        "Avoid overcooking the meat by checking its temperature at the 1.5 hour mark, and every 15–20 minutes after.",
        "Insert a digital meat thermometer into the thickest part of the meat to get an accurate reading.",
        "Finished."
    ]
}