{
    "title": "How to Install a Sliding Glass Door",
    "url": "https://www.wikihow.com/Install-a-Sliding-Glass-Door",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Doors and Windows",
        "Door Types",
        "Sliding Doors"
    ],
    "parts": [
        {
            "name": "Removing the Old Door",
            "steps": [
                {
                    "headline": "Cut away the interior and exterior trim.",
                    "description": "Use a utility knife to cut through the caulk and paint holding the interior trim in place. Once the caulk is cut, work a pry bar into the opening. Put pressure on this to pull the interior trim away from the wall, removing it slowly so you can deal with any caulk, paint or glue that might still be present. There may be staples holding the top piece of trim to the side pieces as well. Repeat the same steps on the exterior trim. Don’t skip cutting the caulk. If you pry the trim away without cutting the caulk first, you risk damaging the wall. Set the trim aside. You’ll need to re-attach it once the door has been installed."
                },
                {
                    "headline": "Lift the doors out of place.",
                    "description": "Grasp each section of the door firmly with both hands. Lift it straight up out of the running track, and pull the door backwards out of the frame. The doors are heavy, so should be removed one at a time. Each section of the door can weigh about 100 pounds (45 kg). If you’re not comfortable lifting that much on your own, ask a friend to help you with the door removal and installation process. If you notice the bottom rollers are hanging up as you lift the door, get an assistant to pry them up gently as you move the door up and out."
                },
                {
                    "headline": "Remove nails holding the door frame in place.",
                    "description": "Once the trim has been removed, you can remove any nails that are left behind. Then, use a screwdriver to remove the screws which hold the frame of the sliding door to the wooden door frame. Remove screws on the left, right, top, and bottom sides of the sliding door. Although you can use any screwdriver for this step, it’ll be more efficient to use an electric screwdriver. If the door is older, its screws may be stripped or caked with paint or caulk, making them difficult to remove with a screwdriver. Instead, have someone hold the door to stop it from falling while you use a reciprocating saw with a bimetal blade to cut between the door frame and the framing and quickly slice through any screws and nails."
                }
            ]
        },
        {
            "name": "Purchasing a New Glass Door",
            "steps": [
                {
                    "headline": "Measure the opening for your glass door.",
                    "description": "Before you shop for a door, you’ll need to know the exact size of the opening that the door needs to fill. Use a tape measure to measure the full width of the hole. Measure from stud to stud. Measure both the width and height of the opening. Write down these measurements so you can refer to them when shopping for a door. Before you measure, make sure to remove any boards or shims that may have been added to make the old door fit."
                },
                {
                    "headline": "Purchase a sliding glass door.",
                    "description": "Visit a home-supply store—such as Home Depot or Lowe’s—and look through their selection of glass doors. Make sure to bring your tape measure with you to confirm that the door you choose will fit well within the opening in your house. Glass door frames can be made of various materials, including wood, vinyl, or aluminum. The material and quality of the door will determine its cost. A simple 6 feet (1.8 m) glass door will cost around $300. A pre-hung glass door (which is the easiest type to install) will range between $1,000 and $4,000 USD. Pre-hung sliding glass doors can be installed as a single unit. You won’t need to assemble the frame before installing it in your wall."
                },
                {
                    "headline": "Clean up and adjust the opening.",
                    "description": "At this point, the opening that you pulled the old door out of will likely be cluttered and rough. Remove any leftover nails or torn material. You may also need to adjust the opening. Use a carpenter’s level to make sure that the top, bottom, and side frames of the opening area all level. If any aren’t level, you can use a shim to even out the door frame. If the frame is slightly too large for the sliding door you purchased, nail in one or more strips of 1x3 plywood to adjust the size of the opening."
                }
            ]
        },
        {
            "name": "Installing the New Glass Door",
            "steps": [
                {
                    "headline": "Apply flashing to the door frame.",
                    "description": "Flashing is a type of adhesive, waterproof tape that will protect the door frame and lower edges of the sliding glass door from water damage. Flashing will also prevent water from entering around the edges. Apply a layer of flashing along the bottom sill of the doorframe. Let the tape hang over the outer edge of the doorframe, so you can bend the tape over and press it down on the external side. Also apply a single layer of flashing about 6 inches (15 cm) up the doorjamb on both sides. You can purchase flashing at any hardware store or home-supply store."
                },
                {
                    "headline": "Set the door frame in place.",
                    "description": "Have a friend help you lift and carry the door frame inside the house, and push it into position in the large opening. Be sure not to install the door backwards. The side with the small track for the sliding screen should face outwards. Some inexpensive vinyl sliding door models may need to be assembled."
                },
                {
                    "headline": "Screw the frame in place and add insulation.",
                    "description": "Use the same screws that you removed from the sides, top, and bottom of the old door frame. Screw these through the material of the new door frame, and tighten until they’re securely embedded in the door frame. Use of a level is essential to ensure the frame is perfectly straight on all sides as you screw it in and if you are working on an older home have door shims handy to correct if necessary. Otherwise, the doors may not fit properly. If there are sizeable gaps above and on the sides of the door frame, stuff a sheet or two of fiberglass insulation into these spaces. This will prevent your house from losing heat around the frame."
                },
                {
                    "headline": "Install the sliding glass panels and handle.",
                    "description": "First, carefully clean all debris from the rails to get a good fit. Then, have a friend help you lift the first section of the sliding door. Set the bottom in place on the track in the door frame, and then press the top portion of the door in place too. Repeat with the second section of the sliding door. At this point, you can also attach the metal handles that came with the sliding glass door. These handles should come with screws provided, which you’ll screw into indicated holes on the front and back of the glass door. You can attach the lock clasp at this point as well. This is the small plastic bit that allows the lock on the door to hold it in place against the frame."
                },
                {
                    "headline": "Re-attach the interior and exterior trim.",
                    "description": "Now that the door is securely in place, you can nail the interior and exterior trim back in place as well. Attach these to the same locations from which you removed them at the beginning of the process. Once the trim is hung, you won’t be able to see the sides of the door frame or the studs to which you screwed the door."
                },
                {
                    "headline": "Put up the screen.",
                    "description": "As the final step in installing your glass door, put in the screen. Snap it into place on both the top and bottom running tracks. Make sure that the screen slides open and shut without difficulty. At this point, your door is installed and ready for use."
                }
            ]
        }
    ],
    "tyn": [
        "Utility knife",
        "Pry bar",
        "Screwdriver",
        "Hammer",
        "Tape measure",
        "Sliding glass door",
        "Level",
        "Shims or plywood strips (optional)",
        "Nails",
        "Flashing tape",
        "Insulation (optional)"
    ],
    "text": " Removing the Old Door Cut away the interior and exterior trim. Use a utility knife to cut through the caulk and paint holding the interior trim in place. Once the caulk is cut, work a pry bar into the opening. Put pressure on this to pull the interior trim away from the wall, removing it slowly so you can deal with any caulk, paint or glue that might still be present. There may be staples holding the top piece of trim to the side pieces as well. Repeat the same steps on the exterior trim. Don’t skip cutting the caulk. If you pry the trim away without cutting the caulk first, you risk damaging the wall. Set the trim aside. You’ll need to re-attach it once the door has been installed. Lift the doors out of place. Grasp each section of the door firmly with both hands. Lift it straight up out of the running track, and pull the door backwards out of the frame. The doors are heavy, so should be removed one at a time. Each section of the door can weigh about 100 pounds (45 kg). If you’re not comfortable lifting that much on your own, ask a friend to help you with the door removal and installation process. If you notice the bottom rollers are hanging up as you lift the door, get an assistant to pry them up gently as you move the door up and out. Remove nails holding the door frame in place. Once the trim has been removed, you can remove any nails that are left behind. Then, use a screwdriver to remove the screws which hold the frame of the sliding door to the wooden door frame. Remove screws on the left, right, top, and bottom sides of the sliding door. Although you can use any screwdriver for this step, it’ll be more efficient to use an electric screwdriver. If the door is older, its screws may be stripped or caked with paint or caulk, making them difficult to remove with a screwdriver. Instead, have someone hold the door to stop it from falling while you use a reciprocating saw with a bimetal blade to cut between the door frame and the framing and quickly slice through any screws and nails. Purchasing a New Glass Door Measure the opening for your glass door. Before you shop for a door, you’ll need to know the exact size of the opening that the door needs to fill. Use a tape measure to measure the full width of the hole. Measure from stud to stud. Measure both the width and height of the opening. Write down these measurements so you can refer to them when shopping for a door. Before you measure, make sure to remove any boards or shims that may have been added to make the old door fit. Purchase a sliding glass door. Visit a home-supply store—such as Home Depot or Lowe’s—and look through their selection of glass doors. Make sure to bring your tape measure with you to confirm that the door you choose will fit well within the opening in your house. Glass door frames can be made of various materials, including wood, vinyl, or aluminum. The material and quality of the door will determine its cost. A simple 6 feet (1.8 m) glass door will cost around $300. A pre-hung glass door (which is the easiest type to install) will range between $1,000 and $4,000 USD. Pre-hung sliding glass doors can be installed as a single unit. You won’t need to assemble the frame before installing it in your wall. Clean up and adjust the opening. At this point, the opening that you pulled the old door out of will likely be cluttered and rough. Remove any leftover nails or torn material. You may also need to adjust the opening. Use a carpenter’s level to make sure that the top, bottom, and side frames of the opening area all level. If any aren’t level, you can use a shim to even out the door frame. If the frame is slightly too large for the sliding door you purchased, nail in one or more strips of 1x3 plywood to adjust the size of the opening. Installing the New Glass Door Apply flashing to the door frame. Flashing is a type of adhesive, waterproof tape that will protect the door frame and lower edges of the sliding glass door from water damage. Flashing will also prevent water from entering around the edges. Apply a layer of flashing along the bottom sill of the doorframe. Let the tape hang over the outer edge of the doorframe, so you can bend the tape over and press it down on the external side. Also apply a single layer of flashing about 6 inches (15 cm) up the doorjamb on both sides. You can purchase flashing at any hardware store or home-supply store. Set the door frame in place. Have a friend help you lift and carry the door frame inside the house, and push it into position in the large opening. Be sure not to install the door backwards. The side with the small track for the sliding screen should face outwards. Some inexpensive vinyl sliding door models may need to be assembled. Screw the frame in place and add insulation. Use the same screws that you removed from the sides, top, and bottom of the old door frame. Screw these through the material of the new door frame, and tighten until they’re securely embedded in the door frame. Use of a level is essential to ensure the frame is perfectly straight on all sides as you screw it in and if you are working on an older home have door shims handy to correct if necessary. Otherwise, the doors may not fit properly. If there are sizeable gaps above and on the sides of the door frame, stuff a sheet or two of fiberglass insulation into these spaces. This will prevent your house from losing heat around the frame. Install the sliding glass panels and handle. First, carefully clean all debris from the rails to get a good fit. Then, have a friend help you lift the first section of the sliding door. Set the bottom in place on the track in the door frame, and then press the top portion of the door in place too. Repeat with the second section of the sliding door. At this point, you can also attach the metal handles that came with the sliding glass door. These handles should come with screws provided, which you’ll screw into indicated holes on the front and back of the glass door. You can attach the lock clasp at this point as well. This is the small plastic bit that allows the lock on the door to hold it in place against the frame. Re-attach the interior and exterior trim. Now that the door is securely in place, you can nail the interior and exterior trim back in place as well. Attach these to the same locations from which you removed them at the beginning of the process. Once the trim is hung, you won’t be able to see the sides of the door frame or the studs to which you screwed the door. Put up the screen. As the final step in installing your glass door, put in the screen. Snap it into place on both the top and bottom running tracks. Make sure that the screen slides open and shut without difficulty. At this point, your door is installed and ready for use.",
    "sentences": [
        " Removing the Old Door Cut away the interior and exterior trim.",
        "Use a utility knife to cut through the caulk and paint holding the interior trim in place.",
        "Once the caulk is cut, work a pry bar into the opening.",
        "Put pressure on this to pull the interior trim away from the wall, removing it slowly so you can deal with any caulk, paint or glue that might still be present.",
        "There may be staples holding the top piece of trim to the side pieces as well.",
        "Repeat the same steps on the exterior trim.",
        "Don’t skip cutting the caulk.",
        "If you pry the trim away without cutting the caulk first, you risk damaging the wall.",
        "Set the trim aside.",
        "You’ll need to re-attach it once the door has been installed.",
        "Lift the doors out of place.",
        "Grasp each section of the door firmly with both hands.",
        "Lift it straight up out of the running track, and pull the door backwards out of the frame.",
        "The doors are heavy, so should be removed one at a time.",
        "Each section of the door can weigh about 100 pounds (45 kg).",
        "If you’re not comfortable lifting that much on your own, ask a friend to help you with the door removal and installation process.",
        "If you notice the bottom rollers are hanging up as you lift the door, get an assistant to pry them up gently as you move the door up and out.",
        "Remove nails holding the door frame in place.",
        "Once the trim has been removed, you can remove any nails that are left behind.",
        "Then, use a screwdriver to remove the screws which hold the frame of the sliding door to the wooden door frame.",
        "Remove screws on the left, right, top, and bottom sides of the sliding door.",
        "Although you can use any screwdriver for this step, it’ll be more efficient to use an electric screwdriver.",
        "If the door is older, its screws may be stripped or caked with paint or caulk, making them difficult to remove with a screwdriver.",
        "Instead, have someone hold the door to stop it from falling while you use a reciprocating saw with a bimetal blade to cut between the door frame and the framing and quickly slice through any screws and nails.",
        "Purchasing a New Glass Door Measure the opening for your glass door.",
        "Before you shop for a door, you’ll need to know the exact size of the opening that the door needs to fill.",
        "Use a tape measure to measure the full width of the hole.",
        "Measure from stud to stud.",
        "Measure both the width and height of the opening.",
        "Write down these measurements so you can refer to them when shopping for a door.",
        "Before you measure, make sure to remove any boards or shims that may have been added to make the old door fit.",
        "Purchase a sliding glass door.",
        "Visit a home-supply store—such as Home Depot or Lowe’s—and look through their selection of glass doors.",
        "Make sure to bring your tape measure with you to confirm that the door you choose will fit well within the opening in your house.",
        "Glass door frames can be made of various materials, including wood, vinyl, or aluminum.",
        "The material and quality of the door will determine its cost.",
        "A simple 6 feet (1.8 m) glass door will cost around $300.",
        "A pre-hung glass door (which is the easiest type to install) will range between $1,000 and $4,000 USD.",
        "Pre-hung sliding glass doors can be installed as a single unit.",
        "You won’t need to assemble the frame before installing it in your wall.",
        "Clean up and adjust the opening.",
        "At this point, the opening that you pulled the old door out of will likely be cluttered and rough.",
        "Remove any leftover nails or torn material.",
        "You may also need to adjust the opening.",
        "Use a carpenter’s level to make sure that the top, bottom, and side frames of the opening area all level.",
        "If any aren’t level, you can use a shim to even out the door frame.",
        "If the frame is slightly too large for the sliding door you purchased, nail in one or more strips of 1x3 plywood to adjust the size of the opening.",
        "Installing the New Glass Door Apply flashing to the door frame.",
        "Flashing is a type of adhesive, waterproof tape that will protect the door frame and lower edges of the sliding glass door from water damage.",
        "Flashing will also prevent water from entering around the edges.",
        "Apply a layer of flashing along the bottom sill of the doorframe.",
        "Let the tape hang over the outer edge of the doorframe, so you can bend the tape over and press it down on the external side.",
        "Also apply a single layer of flashing about 6 inches (15 cm) up the doorjamb on both sides.",
        "You can purchase flashing at any hardware store or home-supply store.",
        "Set the door frame in place.",
        "Have a friend help you lift and carry the door frame inside the house, and push it into position in the large opening.",
        "Be sure not to install the door backwards.",
        "The side with the small track for the sliding screen should face outwards.",
        "Some inexpensive vinyl sliding door models may need to be assembled.",
        "Screw the frame in place and add insulation.",
        "Use the same screws that you removed from the sides, top, and bottom of the old door frame.",
        "Screw these through the material of the new door frame, and tighten until they’re securely embedded in the door frame.",
        "Use of a level is essential to ensure the frame is perfectly straight on all sides as you screw it in and if you are working on an older home have door shims handy to correct if necessary.",
        "Otherwise, the doors may not fit properly.",
        "If there are sizeable gaps above and on the sides of the door frame, stuff a sheet or two of fiberglass insulation into these spaces.",
        "This will prevent your house from losing heat around the frame.",
        "Install the sliding glass panels and handle.",
        "First, carefully clean all debris from the rails to get a good fit.",
        "Then, have a friend help you lift the first section of the sliding door.",
        "Set the bottom in place on the track in the door frame, and then press the top portion of the door in place too.",
        "Repeat with the second section of the sliding door.",
        "At this point, you can also attach the metal handles that came with the sliding glass door.",
        "These handles should come with screws provided, which you’ll screw into indicated holes on the front and back of the glass door.",
        "You can attach the lock clasp at this point as well.",
        "This is the small plastic bit that allows the lock on the door to hold it in place against the frame.",
        "Re-attach the interior and exterior trim.",
        "Now that the door is securely in place, you can nail the interior and exterior trim back in place as well.",
        "Attach these to the same locations from which you removed them at the beginning of the process.",
        "Once the trim is hung, you won’t be able to see the sides of the door frame or the studs to which you screwed the door.",
        "Put up the screen.",
        "As the final step in installing your glass door, put in the screen.",
        "Snap it into place on both the top and bottom running tracks.",
        "Make sure that the screen slides open and shut without difficulty.",
        "At this point, your door is installed and ready for use."
    ]
}