{
    "title": "How to Use a Wood Filler",
    "url": "https://www.wikihow.com/Use-a-Wood-Filler",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Preparing the Surface",
            "steps": [
                {
                    "headline": "Buy or make an appropriate filler.",
                    "description": "Stainable wood fillers are designed to be stained so you can match them to the rest of the wood. Some water-based wood fillers are also stainable, but they are specifically meant to be used indoors. You can also make your own wood filler by adding sawdust to carpenter's glue to form a paste. Another option is epoxy designed for wood, which is hard-wearing and can be carved."
                },
                {
                    "headline": "Remove paint chips and wood splinters.",
                    "description": "If you see paint chips falling off, you need to take them off before repairing the wood. Flake them off with a scraper, getting off as much as you can. Similarly, scrape off any large splinters you see."
                },
                {
                    "headline": "Sand down the area.",
                    "description": "Rough edges can be detrimental when you're applying filler. Sanding those edges down will make the process go smoother for you. Check for rough edges directly around the damaged area."
                },
                {
                    "headline": "Remove any debris.",
                    "description": "If you leave any loose debris or sawdust behind, the filler won't stick as well. Wipe it down with a damp tack cloth and then let it dry thoroughly. You can also use a shop vac if you have one."
                }
            ]
        },
        {
            "name": "Filling the Hole",
            "steps": [
                {
                    "headline": "Squeeze the filler into the hole.",
                    "description": "Use the tube to squeeze the filler into the area, making sure to fill in the deepest area by pressing the end down into it. Start at one end and gradually work your way to the other end. If you don't have a tube, use a putty knife to apply it."
                },
                {
                    "headline": "Overfill the hole.",
                    "description": "When adding the wood filler, you need to fill it a bit more than level with the rest of the wood. That's because the filler shrinks a bit as it dries, so it will end up flush with the wood if you overfill it. You only need to overfill it a little bit, maybe 5%."
                },
                {
                    "headline": "Smooth the filler out with a putty knife.",
                    "description": "Go over the filler with a putty knife to make a smooth area. Wipe off the knife and go over the area again if the first pass didn't get it as smooth as you'd like. Keep in mind you'll be sanding it later, so it doesn't have to be absolutely perfect."
                },
                {
                    "headline": "Wait for the filler to dry.",
                    "description": "Once you've got the hole filled to your satisfaction, let the filler dry completely. It will be hard to the touch when it is dry. It may take up to 8 hours on a large or deep area, though it can dry in under half an hour. Check the packaging for wood filler for specific drying times."
                }
            ]
        },
        {
            "name": "Finishing the Area",
            "steps": [
                {
                    "headline": "Sand down the area until it is smooth and even with the wood.",
                    "description": "Use an orbital sander or standard sandpaper to sand down the area. Sand until the filler is evened out and it is level with the surrounding wood. Wipe it down to remove dust before painting or staining."
                },
                {
                    "headline": "Check that the hole is filled in.",
                    "description": "Run your hand over the repaired area to see if it's smooth. Also, make sure you have filled in the hole and that it's level with the wood. Even if you filled in the hole completely, it may have settled out and left a depression or hole. If you haven't completely filled in the hole, repeat the process by adding more wood filler."
                },
                {
                    "headline": "Apply primer if you're painting the area.",
                    "description": "Most wood fillers can be painted, but fillers may affect how the paint looks. If you use primer first, it can help even out the look of the area. This process works particularly well if you're painting a whole piece of furniture that you've repaired holes on."
                },
                {
                    "headline": "Paint or stain the area.",
                    "description": "Once you've got the repaired area perfectly level with the rest of the wood, you can apply paint or stain to match the rest of the wood. If you're not sure of the paint or stain, you may want to test it first in an inconspicuous area to make sure it matches. You can also test stain on a piece of scrap wood."
                }
            ]
        }
    ],
    "tyn": [
        "Wood filler",
        "Putty knife",
        "Tack cloth",
        "Sandpaper",
        "Primer, optional",
        "Paint or wood stain, optional",
        "Paintbrush, optional"
    ],
    "text": " Preparing the Surface Buy or make an appropriate filler. Stainable wood fillers are designed to be stained so you can match them to the rest of the wood. Some water-based wood fillers are also stainable, but they are specifically meant to be used indoors. You can also make your own wood filler by adding sawdust to carpenter's glue to form a paste. Another option is epoxy designed for wood, which is hard-wearing and can be carved. Remove paint chips and wood splinters. If you see paint chips falling off, you need to take them off before repairing the wood. Flake them off with a scraper, getting off as much as you can. Similarly, scrape off any large splinters you see. Sand down the area. Rough edges can be detrimental when you're applying filler. Sanding those edges down will make the process go smoother for you. Check for rough edges directly around the damaged area. Remove any debris. If you leave any loose debris or sawdust behind, the filler won't stick as well. Wipe it down with a damp tack cloth and then let it dry thoroughly. You can also use a shop vac if you have one. Filling the Hole Squeeze the filler into the hole. Use the tube to squeeze the filler into the area, making sure to fill in the deepest area by pressing the end down into it. Start at one end and gradually work your way to the other end. If you don't have a tube, use a putty knife to apply it. Overfill the hole. When adding the wood filler, you need to fill it a bit more than level with the rest of the wood. That's because the filler shrinks a bit as it dries, so it will end up flush with the wood if you overfill it. You only need to overfill it a little bit, maybe 5%. Smooth the filler out with a putty knife. Go over the filler with a putty knife to make a smooth area. Wipe off the knife and go over the area again if the first pass didn't get it as smooth as you'd like. Keep in mind you'll be sanding it later, so it doesn't have to be absolutely perfect. Wait for the filler to dry. Once you've got the hole filled to your satisfaction, let the filler dry completely. It will be hard to the touch when it is dry. It may take up to 8 hours on a large or deep area, though it can dry in under half an hour. Check the packaging for wood filler for specific drying times. Finishing the Area Sand down the area until it is smooth and even with the wood. Use an orbital sander or standard sandpaper to sand down the area. Sand until the filler is evened out and it is level with the surrounding wood. Wipe it down to remove dust before painting or staining. Check that the hole is filled in. Run your hand over the repaired area to see if it's smooth. Also, make sure you have filled in the hole and that it's level with the wood. Even if you filled in the hole completely, it may have settled out and left a depression or hole. If you haven't completely filled in the hole, repeat the process by adding more wood filler. Apply primer if you're painting the area. Most wood fillers can be painted, but fillers may affect how the paint looks. If you use primer first, it can help even out the look of the area. This process works particularly well if you're painting a whole piece of furniture that you've repaired holes on. Paint or stain the area. Once you've got the repaired area perfectly level with the rest of the wood, you can apply paint or stain to match the rest of the wood. If you're not sure of the paint or stain, you may want to test it first in an inconspicuous area to make sure it matches. You can also test stain on a piece of scrap wood.",
    "sentences": [
        " Preparing the Surface Buy or make an appropriate filler.",
        "Stainable wood fillers are designed to be stained so you can match them to the rest of the wood.",
        "Some water-based wood fillers are also stainable, but they are specifically meant to be used indoors.",
        "You can also make your own wood filler by adding sawdust to carpenter's glue to form a paste.",
        "Another option is epoxy designed for wood, which is hard-wearing and can be carved.",
        "Remove paint chips and wood splinters.",
        "If you see paint chips falling off, you need to take them off before repairing the wood.",
        "Flake them off with a scraper, getting off as much as you can.",
        "Similarly, scrape off any large splinters you see.",
        "Sand down the area.",
        "Rough edges can be detrimental when you're applying filler.",
        "Sanding those edges down will make the process go smoother for you.",
        "Check for rough edges directly around the damaged area.",
        "Remove any debris.",
        "If you leave any loose debris or sawdust behind, the filler won't stick as well.",
        "Wipe it down with a damp tack cloth and then let it dry thoroughly.",
        "You can also use a shop vac if you have one.",
        "Filling the Hole Squeeze the filler into the hole.",
        "Use the tube to squeeze the filler into the area, making sure to fill in the deepest area by pressing the end down into it.",
        "Start at one end and gradually work your way to the other end.",
        "If you don't have a tube, use a putty knife to apply it.",
        "Overfill the hole.",
        "When adding the wood filler, you need to fill it a bit more than level with the rest of the wood.",
        "That's because the filler shrinks a bit as it dries, so it will end up flush with the wood if you overfill it.",
        "You only need to overfill it a little bit, maybe 5%.",
        "Smooth the filler out with a putty knife.",
        "Go over the filler with a putty knife to make a smooth area.",
        "Wipe off the knife and go over the area again if the first pass didn't get it as smooth as you'd like.",
        "Keep in mind you'll be sanding it later, so it doesn't have to be absolutely perfect.",
        "Wait for the filler to dry.",
        "Once you've got the hole filled to your satisfaction, let the filler dry completely.",
        "It will be hard to the touch when it is dry.",
        "It may take up to 8 hours on a large or deep area, though it can dry in under half an hour.",
        "Check the packaging for wood filler for specific drying times.",
        "Finishing the Area Sand down the area until it is smooth and even with the wood.",
        "Use an orbital sander or standard sandpaper to sand down the area.",
        "Sand until the filler is evened out and it is level with the surrounding wood.",
        "Wipe it down to remove dust before painting or staining.",
        "Check that the hole is filled in.",
        "Run your hand over the repaired area to see if it's smooth.",
        "Also, make sure you have filled in the hole and that it's level with the wood.",
        "Even if you filled in the hole completely, it may have settled out and left a depression or hole.",
        "If you haven't completely filled in the hole, repeat the process by adding more wood filler.",
        "Apply primer if you're painting the area.",
        "Most wood fillers can be painted, but fillers may affect how the paint looks.",
        "If you use primer first, it can help even out the look of the area.",
        "This process works particularly well if you're painting a whole piece of furniture that you've repaired holes on.",
        "Paint or stain the area.",
        "Once you've got the repaired area perfectly level with the rest of the wood, you can apply paint or stain to match the rest of the wood.",
        "If you're not sure of the paint or stain, you may want to test it first in an inconspicuous area to make sure it matches.",
        "You can also test stain on a piece of scrap wood."
    ]
}