{
    "title": "How to Remove Rust from a Bike",
    "url": "https://www.wikihow.com/Remove-Rust-from-a-Bike",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Cleaning"
    ],
    "methods": [
        {
            "name": "Using Baking Soda on Minor Rust",
            "steps": [
                {
                    "headline": "Mix baking soda and water in a bowl.",
                    "description": "Combine a 50/50 mixture of baking soda and water in a bowl and mix until it becomes a thick paste. You will need enough of the paste to completely cover the rust, so keep the bowl, baking soda, and water nearby in case you need to make more. Baking soda is generally best at minor rust removal. Severe rusting may respond better to other methods. Add a squirt of lemon juice to the paste for strengthened removal properties."
                },
                {
                    "headline": "Put the paste directly on the rust for about 15 minutes.",
                    "description": "Dab the paste on a brush or sponge and apply it to the rusty bike. Do not scrub or remove the paste immediately: it will need time to set and break down the rust. Let the paste sit for about 10 to 15 minutes. The baking soda paste should be thick enough to evenly coat the rust patch without dripping off of the bike."
                },
                {
                    "headline": "Scrub the baking soda with a scrub pad.",
                    "description": "Using a plastic scrubber or steel wool, scrub the baking soda solution. As you scrub, you should notice the rust breaking down and detaching from the bike. If you do not notice this, add more of the baking soda paste to the bike and scrub with more force. Use a toothbrush as an alternative if no scrub pads are available."
                },
                {
                    "headline": "Wait about 10 minutes before wiping off the baking soda.",
                    "description": "After you are finished scrubbing, leave the baking soda on for about 10-15 minutes to reach stubborn rust. Then, wipe off the paste with a dry microfiber cloth. Make sure the bicycle is completely dry to prevent further rusting. Store the bike in a cool, dry place to keep the rust from returning. If there is still some rust left over, repeat the same process again or try another method. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJonas Jackel\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOwner, Huckleberry Bicycles\t\t\t\t\t\t\t\tJonas Jackel is the Owner of Huckleberry Bicycles, a bicycle retail store based in San Francisco, California. Jonas has over 20 years of experience managing bicycle retail stores and has operated Huckleberry Bicycles since 2011. Huckleberry Bicycles specializes in servicing, repairing, and custom building road, cross, gravel, touring, folding, and e-bikes. Jonas was also previously sat on the Board of Directors for Bike East Bay, a bicycle-advocacy non-profit organization based in Oakland, California. Jonas Jackel\t\t\tOwner, Huckleberry Bicycles\t\t\t\tExpert Trick: If your chain is rusty because your bike has been outside, inspect it and see if the links are tight and not moving. If you don't have any stiff links, you can usually just oil the chain and wipe it down to remove surface rust. However a stiff link will cause the chain to skip as it goes through the drivetrain, so it's probably worth getting a new chain at that point."
                }
            ]
        },
        {
            "name": "Using Vinegar on Stubborn Rust",
            "steps": [
                {
                    "headline": "Pour white vinegar into a spray bottle.",
                    "description": "White vinegar is best at rust removal because it is more acidic than other varieties. Although you can dab the vinegar onto the bike rust directly, spray bottles are ideal to ensure an even coating of the liquid. Add a small spoonful of baking soda to the mixture for a more corrosive solution."
                },
                {
                    "headline": "Spritz or coat the rust on your bike in vinegar.",
                    "description": "If you put the vinegar in a spray bottle, spray it evenly around the entire rust patch. Apply the vinegar with a sponge or ball of tinfoil if you decide to directly coat it. Tinfoil is especially effective because it can also function as a scrub brush while you apply the vinegar. If desired, you may soak removable bike parts in a vinegar solution as an alternative."
                },
                {
                    "headline": "Rinse the vinegar off of your bike after 10-15 minutes.",
                    "description": "Vinegar can continue corroding your bike metal after removing the rust. To prevent this from happening, use a hose to wash the bike down after the rust has dissolved. If vinegar does not remove the rust, you may need to use a chemical cleaner."
                },
                {
                    "headline": "Dry the bike off before storing it again.",
                    "description": "Leaving moisture on the bike can cause rust to return. Rub your bike down with a cloth soaked in denatured alcohol to remove excess moisture. Store your bike in a cool, dry place to prevent future rusting."
                }
            ]
        },
        {
            "name": "Trying a Chemical Rust Remover",
            "steps": [
                {
                    "headline": "Use chemical rust remover if no other method works.",
                    "description": "In some cases, household items might not be strong enough to remove rust. Try baking soda and vinegar first, but if neither work, purchase a rust remover from your local hardware store or bike shop. Do not mix chemical removers with baking soda, vinegar, citric acid, or other cleaners. Some mixtures can be deadly."
                },
                {
                    "headline": "Put on protective gloves and glasses before handling rust remover.",
                    "description": "Chemical removers are more potent to use than other methods and can harm your eyes or skin. Read the instruction label carefully before using to make sure you're using it safely. If the cleaner touches your eyes or skin, rinse it off thoroughly and contact poison control for further instructions. Avoid using chemical cleaners in confined spaces. Open a window or door for ventilation, and exit the room immediately if you feel dizzy and/or lightheaded."
                },
                {
                    "headline": "Brush the chemical cleaner on as directed.",
                    "description": "How long you leave the cleaner on will depend on the chemical. Suggested times can range from 30 minutes to overnight. Read the directions for specific instructions and follow them carefully for the best results. If you need a cleaner that will remove rust quickly, read the label instructions while you're at the store and choose one with a quick setting time."
                },
                {
                    "headline": "Remove the cleaner after the suggested time has passed.",
                    "description": "Because chemical cleaners are corrosive, wipe it away completely with a cheap cloth after it has finished removing the rust. Store remaining cleaners wherever you keep other chemicals in case you need to remove more rust later on. Throw the cloth away after use to prevent contaminating other fabrics."
                }
            ]
        }
    ],
    "tyn": [
        "Baking soda",
        "Water",
        "Lemon (optional)",
        "Scrub pad or toothbrush",
        "Brush",
        "Sponge",
        "Tinfoil",
        "White vinegar",
        "Spray bottle",
        "Microfiber cloth",
        "Chemical rust remover",
        "Protective gloves",
        "Goggles"
    ],
    "text": " Using Baking Soda on Minor Rust Mix baking soda and water in a bowl. Combine a 50/50 mixture of baking soda and water in a bowl and mix until it becomes a thick paste. You will need enough of the paste to completely cover the rust, so keep the bowl, baking soda, and water nearby in case you need to make more. Baking soda is generally best at minor rust removal. Severe rusting may respond better to other methods. Add a squirt of lemon juice to the paste for strengthened removal properties. Put the paste directly on the rust for about 15 minutes. Dab the paste on a brush or sponge and apply it to the rusty bike. Do not scrub or remove the paste immediately: it will need time to set and break down the rust. Let the paste sit for about 10 to 15 minutes. The baking soda paste should be thick enough to evenly coat the rust patch without dripping off of the bike. Scrub the baking soda with a scrub pad. Using a plastic scrubber or steel wool, scrub the baking soda solution. As you scrub, you should notice the rust breaking down and detaching from the bike. If you do not notice this, add more of the baking soda paste to the bike and scrub with more force. Use a toothbrush as an alternative if no scrub pads are available. Wait about 10 minutes before wiping off the baking soda. After you are finished scrubbing, leave the baking soda on for about 10-15 minutes to reach stubborn rust. Then, wipe off the paste with a dry microfiber cloth. Make sure the bicycle is completely dry to prevent further rusting. Store the bike in a cool, dry place to keep the rust from returning. If there is still some rust left over, repeat the same process again or try another method. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJonas Jackel\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOwner, Huckleberry Bicycles\t\t\t\t\t\t\t\tJonas Jackel is the Owner of Huckleberry Bicycles, a bicycle retail store based in San Francisco, California. Jonas has over 20 years of experience managing bicycle retail stores and has operated Huckleberry Bicycles since 2011. Huckleberry Bicycles specializes in servicing, repairing, and custom building road, cross, gravel, touring, folding, and e-bikes. Jonas was also previously sat on the Board of Directors for Bike East Bay, a bicycle-advocacy non-profit organization based in Oakland, California. Jonas Jackel\t\t\tOwner, Huckleberry Bicycles\t\t\t\tExpert Trick: If your chain is rusty because your bike has been outside, inspect it and see if the links are tight and not moving. If you don't have any stiff links, you can usually just oil the chain and wipe it down to remove surface rust. However a stiff link will cause the chain to skip as it goes through the drivetrain, so it's probably worth getting a new chain at that point. Using Vinegar on Stubborn Rust Pour white vinegar into a spray bottle. White vinegar is best at rust removal because it is more acidic than other varieties. Although you can dab the vinegar onto the bike rust directly, spray bottles are ideal to ensure an even coating of the liquid. Add a small spoonful of baking soda to the mixture for a more corrosive solution. Spritz or coat the rust on your bike in vinegar. If you put the vinegar in a spray bottle, spray it evenly around the entire rust patch. Apply the vinegar with a sponge or ball of tinfoil if you decide to directly coat it. Tinfoil is especially effective because it can also function as a scrub brush while you apply the vinegar. If desired, you may soak removable bike parts in a vinegar solution as an alternative. Rinse the vinegar off of your bike after 10-15 minutes. Vinegar can continue corroding your bike metal after removing the rust. To prevent this from happening, use a hose to wash the bike down after the rust has dissolved. If vinegar does not remove the rust, you may need to use a chemical cleaner. Dry the bike off before storing it again. Leaving moisture on the bike can cause rust to return. Rub your bike down with a cloth soaked in denatured alcohol to remove excess moisture. Store your bike in a cool, dry place to prevent future rusting. Trying a Chemical Rust Remover Use chemical rust remover if no other method works. In some cases, household items might not be strong enough to remove rust. Try baking soda and vinegar first, but if neither work, purchase a rust remover from your local hardware store or bike shop. Do not mix chemical removers with baking soda, vinegar, citric acid, or other cleaners. Some mixtures can be deadly. Put on protective gloves and glasses before handling rust remover. Chemical removers are more potent to use than other methods and can harm your eyes or skin. Read the instruction label carefully before using to make sure you're using it safely. If the cleaner touches your eyes or skin, rinse it off thoroughly and contact poison control for further instructions. Avoid using chemical cleaners in confined spaces. Open a window or door for ventilation, and exit the room immediately if you feel dizzy and/or lightheaded. Brush the chemical cleaner on as directed. How long you leave the cleaner on will depend on the chemical. Suggested times can range from 30 minutes to overnight. Read the directions for specific instructions and follow them carefully for the best results. If you need a cleaner that will remove rust quickly, read the label instructions while you're at the store and choose one with a quick setting time. Remove the cleaner after the suggested time has passed. Because chemical cleaners are corrosive, wipe it away completely with a cheap cloth after it has finished removing the rust. Store remaining cleaners wherever you keep other chemicals in case you need to remove more rust later on. Throw the cloth away after use to prevent contaminating other fabrics.",
    "sentences": [
        " Using Baking Soda on Minor Rust Mix baking soda and water in a bowl.",
        "Combine a 50/50 mixture of baking soda and water in a bowl and mix until it becomes a thick paste.",
        "You will need enough of the paste to completely cover the rust, so keep the bowl, baking soda, and water nearby in case you need to make more.",
        "Baking soda is generally best at minor rust removal.",
        "Severe rusting may respond better to other methods.",
        "Add a squirt of lemon juice to the paste for strengthened removal properties.",
        "Put the paste directly on the rust for about 15 minutes.",
        "Dab the paste on a brush or sponge and apply it to the rusty bike.",
        "Do not scrub or remove the paste immediately: it will need time to set and break down the rust.",
        "Let the paste sit for about 10 to 15 minutes.",
        "The baking soda paste should be thick enough to evenly coat the rust patch without dripping off of the bike.",
        "Scrub the baking soda with a scrub pad.",
        "Using a plastic scrubber or steel wool, scrub the baking soda solution.",
        "As you scrub, you should notice the rust breaking down and detaching from the bike.",
        "If you do not notice this, add more of the baking soda paste to the bike and scrub with more force.",
        "Use a toothbrush as an alternative if no scrub pads are available.",
        "Wait about 10 minutes before wiping off the baking soda.",
        "After you are finished scrubbing, leave the baking soda on for about 10-15 minutes to reach stubborn rust.",
        "Then, wipe off the paste with a dry microfiber cloth.",
        "Make sure the bicycle is completely dry to prevent further rusting.",
        "Store the bike in a cool, dry place to keep the rust from returning.",
        "If there is still some rust left over, repeat the same process again or try another method.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJonas Jackel\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOwner, Huckleberry Bicycles\t\t\t\t\t\t\t\tJonas Jackel is the Owner of Huckleberry Bicycles, a bicycle retail store based in San Francisco, California.",
        "Jonas has over 20 years of experience managing bicycle retail stores and has operated Huckleberry Bicycles since 2011.",
        "Huckleberry Bicycles specializes in servicing, repairing, and custom building road, cross, gravel, touring, folding, and e-bikes.",
        "Jonas was also previously sat on the Board of Directors for Bike East Bay, a bicycle-advocacy non-profit organization based in Oakland, California.",
        "Jonas Jackel\t\t\tOwner, Huckleberry Bicycles\t\t\t\tExpert Trick: If your chain is rusty because your bike has been outside, inspect it and see if the links are tight and not moving.",
        "If you don't have any stiff links, you can usually just oil the chain and wipe it down to remove surface rust.",
        "However a stiff link will cause the chain to skip as it goes through the drivetrain, so it's probably worth getting a new chain at that point.",
        "Using Vinegar on Stubborn Rust Pour white vinegar into a spray bottle.",
        "White vinegar is best at rust removal because it is more acidic than other varieties.",
        "Although you can dab the vinegar onto the bike rust directly, spray bottles are ideal to ensure an even coating of the liquid.",
        "Add a small spoonful of baking soda to the mixture for a more corrosive solution.",
        "Spritz or coat the rust on your bike in vinegar.",
        "If you put the vinegar in a spray bottle, spray it evenly around the entire rust patch.",
        "Apply the vinegar with a sponge or ball of tinfoil if you decide to directly coat it.",
        "Tinfoil is especially effective because it can also function as a scrub brush while you apply the vinegar.",
        "If desired, you may soak removable bike parts in a vinegar solution as an alternative.",
        "Rinse the vinegar off of your bike after 10-15 minutes.",
        "Vinegar can continue corroding your bike metal after removing the rust.",
        "To prevent this from happening, use a hose to wash the bike down after the rust has dissolved.",
        "If vinegar does not remove the rust, you may need to use a chemical cleaner.",
        "Dry the bike off before storing it again.",
        "Leaving moisture on the bike can cause rust to return.",
        "Rub your bike down with a cloth soaked in denatured alcohol to remove excess moisture.",
        "Store your bike in a cool, dry place to prevent future rusting.",
        "Trying a Chemical Rust Remover Use chemical rust remover if no other method works.",
        "In some cases, household items might not be strong enough to remove rust.",
        "Try baking soda and vinegar first, but if neither work, purchase a rust remover from your local hardware store or bike shop.",
        "Do not mix chemical removers with baking soda, vinegar, citric acid, or other cleaners.",
        "Some mixtures can be deadly.",
        "Put on protective gloves and glasses before handling rust remover.",
        "Chemical removers are more potent to use than other methods and can harm your eyes or skin.",
        "Read the instruction label carefully before using to make sure you're using it safely.",
        "If the cleaner touches your eyes or skin, rinse it off thoroughly and contact poison control for further instructions.",
        "Avoid using chemical cleaners in confined spaces.",
        "Open a window or door for ventilation, and exit the room immediately if you feel dizzy and/or lightheaded.",
        "Brush the chemical cleaner on as directed.",
        "How long you leave the cleaner on will depend on the chemical.",
        "Suggested times can range from 30 minutes to overnight.",
        "Read the directions for specific instructions and follow them carefully for the best results.",
        "If you need a cleaner that will remove rust quickly, read the label instructions while you're at the store and choose one with a quick setting time.",
        "Remove the cleaner after the suggested time has passed.",
        "Because chemical cleaners are corrosive, wipe it away completely with a cheap cloth after it has finished removing the rust.",
        "Store remaining cleaners wherever you keep other chemicals in case you need to remove more rust later on.",
        "Throw the cloth away after use to prevent contaminating other fabrics."
    ]
}