{
    "title": "How to Wash Coconut Oil Out of Hair",
    "url": "https://www.wikihow.com/Wash-Coconut-Oil-Out-of-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Personal Hygiene"
    ],
    "methods": [
        {
            "name": "Rinsing with Natural Solutions",
            "steps": [
                {
                    "headline": "Cut through the oil with the citric acid in lemon juice.",
                    "description": "Squeeze the juice of 2 fresh lemons into a bowl, then mix in 8 fluid ounces (240 ml) of water. Pour this mixture over your hair and scalp, wait a few minutes, and then rinse it out with warm water. The excess coconut oil should wash out with it. You can also add a few tablespoons of honey to the mixture to soften your hair."
                },
                {
                    "headline": "Add 1 teaspoon (4.9 mL) of aloe vera gel to your normal shampoo.",
                    "description": "Work the mixture through your hair and scalp, into a lather. Let it sit for 10-15 minutes, then wash it out. The coconut oil should rinse out with the aloe and shampoo."
                },
                {
                    "headline": "Use an egg wash to remove the oil and boost healthy hair protein.",
                    "description": "Beat 2-3 eggs together in a bowl. Add 32 fluid ounces (950 ml) of water and mix together, forming an egg wash. Pour this egg wash over dry hair and rub it in. Let it sit for 5-10 minutes, then wash it out with lukewarm water. The coconut oil should be gone by the time you finish rinsing. Do not use hot or even lukewarm water to rinse the egg wash out, because the heat will cook the eggs in your hair. To avoid the scrambled egg effect, make sure the water is cool."
                },
                {
                    "headline": "Make a baking soda paste for your scalp.",
                    "description": "Mix 1-2 tablespoons (7-14 g) of baking soda with just enough water to form a fairly thick paste. While your hair is dry, apply the paste to your roots and scalp. Focus on the oiliest areas, like the crown of the head. Once you’ve covered the oily areas, rinse out the paste with warm water. It should wash out easily and take the coconut oil with it. Don’t work this paste through the rest of your hair--focus only on your scalp. The baking soda will bond with the coconut oil, but won’t stick too firmly to your hair."
                }
            ]
        },
        {
            "name": "Using a No-Rinse Powder Solution",
            "steps": [
                {
                    "headline": "Choose a dry shampoo or powder to soak up the oil.",
                    "description": "Whether in aerosol or powder form, dry shampoo is perfect for refreshing your hair and getting rid of the excess coconut oil. For a more natural solution, you can also use cornstarch, baking soda, arrowroot powder, or baby powder. Avoid products with talc, which has been linked to extreme health issues."
                },
                {
                    "headline": "Apply the powder to your roots.",
                    "description": "When your hair is completely dry, sprinkle some powder around the crown of the head. Start with a small amount and add more as needed, up to 1 teaspoon. Focus on the roots, since this is where most of the oil will be. Don’t add more than a teaspoon of dry shampoo because it will dry out the scalp."
                },
                {
                    "headline": "Comb through your hair until the powder soaks up the oil.",
                    "description": "Keep combing until the powder blends into your hair and you achieve the level of shine you want. If you have darker hair, these lighter powders may leave a white residue or cast to your hair. To get rid of this white cast, use a liquid shampoo to lather and rinse your hair."
                }
            ]
        }
    ],
    "tyn": [
        "2 lemons",
        "2-3 eggs",
        "Baking soda",
        "Dry shampoo",
        "Cornstarch/baby powder/baking soda/arrowroot powder"
    ],
    "text": " Rinsing with Natural Solutions Cut through the oil with the citric acid in lemon juice. Squeeze the juice of 2 fresh lemons into a bowl, then mix in 8 fluid ounces (240 ml) of water. Pour this mixture over your hair and scalp, wait a few minutes, and then rinse it out with warm water. The excess coconut oil should wash out with it. You can also add a few tablespoons of honey to the mixture to soften your hair. Add 1 teaspoon (4.9 mL) of aloe vera gel to your normal shampoo. Work the mixture through your hair and scalp, into a lather. Let it sit for 10-15 minutes, then wash it out. The coconut oil should rinse out with the aloe and shampoo. Use an egg wash to remove the oil and boost healthy hair protein. Beat 2-3 eggs together in a bowl. Add 32 fluid ounces (950 ml) of water and mix together, forming an egg wash. Pour this egg wash over dry hair and rub it in. Let it sit for 5-10 minutes, then wash it out with lukewarm water. The coconut oil should be gone by the time you finish rinsing. Do not use hot or even lukewarm water to rinse the egg wash out, because the heat will cook the eggs in your hair. To avoid the scrambled egg effect, make sure the water is cool. Make a baking soda paste for your scalp. Mix 1-2 tablespoons (7-14 g) of baking soda with just enough water to form a fairly thick paste. While your hair is dry, apply the paste to your roots and scalp. Focus on the oiliest areas, like the crown of the head. Once you’ve covered the oily areas, rinse out the paste with warm water. It should wash out easily and take the coconut oil with it. Don’t work this paste through the rest of your hair--focus only on your scalp. The baking soda will bond with the coconut oil, but won’t stick too firmly to your hair. Using a No-Rinse Powder Solution Choose a dry shampoo or powder to soak up the oil. Whether in aerosol or powder form, dry shampoo is perfect for refreshing your hair and getting rid of the excess coconut oil. For a more natural solution, you can also use cornstarch, baking soda, arrowroot powder, or baby powder. Avoid products with talc, which has been linked to extreme health issues. Apply the powder to your roots. When your hair is completely dry, sprinkle some powder around the crown of the head. Start with a small amount and add more as needed, up to 1 teaspoon. Focus on the roots, since this is where most of the oil will be. Don’t add more than a teaspoon of dry shampoo because it will dry out the scalp. Comb through your hair until the powder soaks up the oil. Keep combing until the powder blends into your hair and you achieve the level of shine you want. If you have darker hair, these lighter powders may leave a white residue or cast to your hair. To get rid of this white cast, use a liquid shampoo to lather and rinse your hair.",
    "sentences": [
        " Rinsing with Natural Solutions Cut through the oil with the citric acid in lemon juice.",
        "Squeeze the juice of 2 fresh lemons into a bowl, then mix in 8 fluid ounces (240 ml) of water.",
        "Pour this mixture over your hair and scalp, wait a few minutes, and then rinse it out with warm water.",
        "The excess coconut oil should wash out with it.",
        "You can also add a few tablespoons of honey to the mixture to soften your hair.",
        "Add 1 teaspoon (4.9 mL) of aloe vera gel to your normal shampoo.",
        "Work the mixture through your hair and scalp, into a lather.",
        "Let it sit for 10-15 minutes, then wash it out.",
        "The coconut oil should rinse out with the aloe and shampoo.",
        "Use an egg wash to remove the oil and boost healthy hair protein.",
        "Beat 2-3 eggs together in a bowl.",
        "Add 32 fluid ounces (950 ml) of water and mix together, forming an egg wash. Pour this egg wash over dry hair and rub it in.",
        "Let it sit for 5-10 minutes, then wash it out with lukewarm water.",
        "The coconut oil should be gone by the time you finish rinsing.",
        "Do not use hot or even lukewarm water to rinse the egg wash out, because the heat will cook the eggs in your hair.",
        "To avoid the scrambled egg effect, make sure the water is cool.",
        "Make a baking soda paste for your scalp.",
        "Mix 1-2 tablespoons (7-14 g) of baking soda with just enough water to form a fairly thick paste.",
        "While your hair is dry, apply the paste to your roots and scalp.",
        "Focus on the oiliest areas, like the crown of the head.",
        "Once you’ve covered the oily areas, rinse out the paste with warm water.",
        "It should wash out easily and take the coconut oil with it.",
        "Don’t work this paste through the rest of your hair--focus only on your scalp.",
        "The baking soda will bond with the coconut oil, but won’t stick too firmly to your hair.",
        "Using a No-Rinse Powder Solution Choose a dry shampoo or powder to soak up the oil.",
        "Whether in aerosol or powder form, dry shampoo is perfect for refreshing your hair and getting rid of the excess coconut oil.",
        "For a more natural solution, you can also use cornstarch, baking soda, arrowroot powder, or baby powder.",
        "Avoid products with talc, which has been linked to extreme health issues.",
        "Apply the powder to your roots.",
        "When your hair is completely dry, sprinkle some powder around the crown of the head.",
        "Start with a small amount and add more as needed, up to 1 teaspoon.",
        "Focus on the roots, since this is where most of the oil will be.",
        "Don’t add more than a teaspoon of dry shampoo because it will dry out the scalp.",
        "Comb through your hair until the powder soaks up the oil.",
        "Keep combing until the powder blends into your hair and you achieve the level of shine you want.",
        "If you have darker hair, these lighter powders may leave a white residue or cast to your hair.",
        "To get rid of this white cast, use a liquid shampoo to lather and rinse your hair."
    ]
}