{
    "title": "How to Replace a Door Trim",
    "url": "https://www.wikihow.com/Replace-a-Door-Trim",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Doors and Windows",
        "Door Replacement"
    ],
    "parts": [
        {
            "name": "Removing Old Trim",
            "steps": [
                {
                    "headline": "Cut through the caulking with a utility knife.",
                    "description": "Work your knife’s blade under the outside edge of the trim. You may also cut through some paint while doing this, but that’s okay. Cut all the way around the trim to free it. Make sure to cut all the way through the caulking to avoid damaging the paint when you pry off the trim."
                },
                {
                    "headline": "Use a pry bar to pull off the trim.",
                    "description": "Slide the edge of the pry bar under the trim near a nail. You can tap a hammer against the back of the bar to help wedge it in. Pull back one piece of trim at a time, taking care not to damage the walls and door jamb. It doesn’t matter which side you start on, as long as you remove all the pieces you want to replace. To protect the walls, hold a scrap of wood against the wall and rest the back of the pry bar against it as you work. There’s not really a way to protect the jamb besides being very careful when leveraging the trim."
                },
                {
                    "headline": "Scrape off any remaining caulking with a knife.",
                    "description": "Use the utility knife or a chisel to remove any old caulk left over. You may also need to scrape down thick layers of paint to level out the space where the new trim will rest."
                }
            ]
        },
        {
            "name": "Cutting the New Trim",
            "steps": [
                {
                    "headline": "Measure the new trim against the door.",
                    "description": "First, purchase some trim from the home improvement store. Most trim comes in 8 or 10 ft (2.4 or 3.0 m) sections. Use your old trim as a sizing guide or hold the new trim against the door frame. Mark the measurements with a pencil so you know how to size the trim. You can always measure out the space around the door with a tape measure if the other options aren’t possible. Measure out the length and width of the trim space on all sides of the door to find out how much trim you need. Narrower trim can be a good choice for simplicity and appearance, but make sure you leave enough material to cover the gap between the door frame and wall. Wider trim stands out more, but it’ll cover more of the wall. Make sure you have enough space for it."
                },
                {
                    "headline": "Put on ear and eye protection before sawing.",
                    "description": "Cover your eyes with a pair of polycarbonate safety glasses. Miter saws are loud, so also put on a pair of earmuffs or foam earplugs. Avoid putting on gloves or any other loose clothing that could get caught in the saw."
                },
                {
                    "headline": "Cut the trim pieces with a miter saw.",
                    "description": "Set the miter saw to cut at an angle of exactly 45°. Line up the trim and cut from the inside edge diagonally upwards to the outside edge. Cut a large piece of trim into the top piece and one of the sides. It’s okay to leave the trim a little long at first. You can adjust this as needed later. It’s helpful to practice using the miter saw on scrap wood first. You are usually able to adjust the saw more than you expect to get a better-fitting joint."
                },
                {
                    "headline": "Cut the side trim to length.",
                    "description": "Line up the side pieces of trim against the door. If the trim is long, measure up from the bottom to mark how much length needs to be removed. Cut the bottoms of the side trim pieces evenly so they match and fit on the door frame."
                },
                {
                    "headline": "Cut the top trim to the appropriate size.",
                    "description": "Hold the header against the 2 side pieces. This piece has miter joints on both sides, which should fit snugly against the rest of the trim. If you have to reduce the header, make sure the miter is set at a 45° angle. Redo the cut until the header fits in place."
                }
            ]
        },
        {
            "name": "Installing the New Trim",
            "steps": [
                {
                    "headline": "Position the trim against the wall.",
                    "description": "Place the pieces without attaching them to double-check the fit. Pay attention to how the header piece fits on top of the side pieces. Make any adjustments needed by further cutting down the size of the trim."
                },
                {
                    "headline": "Nail the side trim in place.",
                    "description": "Use a finish nailer to secure the trim. On the inside part, which covers the door jamb, use 4d or 1.5 in (3.8 cm) finishing nails. On the outside part, which attaches to the wall, use 6d or 2 in (5.1 cm) finishing nails to secure the trim. Avoid placing the nails close to the ends of the trim. Depending on the thickness of your trim, you may need larger nails. Hold the nails up to the trim to see if they're long enough to go all the way through to the wall."
                },
                {
                    "headline": "Drill and nail the header in place.",
                    "description": "Stand on a stepstool to reach the top part of the door. Place the top trim, checking one last time to make sure it’s the right size. When finished, attach it the same way you did the other pieces."
                },
                {
                    "headline": "Pre-drill holes in the trim’s corners.",
                    "description": "Push the trim pieces together to tighten them a little more. Measure about 1 in (2.5 cm) from the sides of the header. Drill a ⁄16 in (1.6 mm) hole down through the top of the header. Measure down the side pieces and drill a hole through each from the outside edge. Hold a piece of cardboard against the wall to prevent your tools from damaging it."
                },
                {
                    "headline": "Nail the trim pieces in place.",
                    "description": "Stick 3d or 1.25 in (3.2 cm) nails in each hole. Start on one side of the door. Alternate striking the top and side nails so that the trim doesn’t fall out of alignment. When finished, move on to the other side."
                },
                {
                    "headline": "Caulk the holes, joints, and edges of the trim.",
                    "description": "The holes and miter joints can be filled with painter’s putty, wood filler, or a paintable acrylic or silicone caulk as needed. Spread it using a putty knife or your fingers. Then go around the outside of the trim, squeezing a small bead of caulk between the trim and the wall. Run your finger along the bead of caulk to smooth it out, then wipe it clean on a wet rag. You’ll need to let the caulk dry before painting or staining. Check the label information to find out how long this takes."
                },
                {
                    "headline": "Sand, prime, and paint the door frame.",
                    "description": "Sand the door frame lightly to make it smooth and even. You can further customize your trim by staining or painting it. The trim can be colored with primer and a layer of paint. You can also retain the appearance of wood trim by using a commercial staining product to color it. Use an oil or latex-based primer before painting over wood."
                }
            ]
        }
    ],
    "tyn": [
        "Tape measure",
        "Miter saw",
        "Safety glasses",
        "Hearing protection",
        "Drill",
        "Hammer",
        "Pry bar",
        "Utility knife",
        "Nails",
        "Caulk",
        "Wood putty for wood trim",
        "Trim"
    ],
    "text": " Removing Old Trim Cut through the caulking with a utility knife. Work your knife’s blade under the outside edge of the trim. You may also cut through some paint while doing this, but that’s okay. Cut all the way around the trim to free it. Make sure to cut all the way through the caulking to avoid damaging the paint when you pry off the trim. Use a pry bar to pull off the trim. Slide the edge of the pry bar under the trim near a nail. You can tap a hammer against the back of the bar to help wedge it in. Pull back one piece of trim at a time, taking care not to damage the walls and door jamb. It doesn’t matter which side you start on, as long as you remove all the pieces you want to replace. To protect the walls, hold a scrap of wood against the wall and rest the back of the pry bar against it as you work. There’s not really a way to protect the jamb besides being very careful when leveraging the trim. Scrape off any remaining caulking with a knife. Use the utility knife or a chisel to remove any old caulk left over. You may also need to scrape down thick layers of paint to level out the space where the new trim will rest. Cutting the New Trim Measure the new trim against the door. First, purchase some trim from the home improvement store. Most trim comes in 8 or 10 ft (2.4 or 3.0 m) sections. Use your old trim as a sizing guide or hold the new trim against the door frame. Mark the measurements with a pencil so you know how to size the trim. You can always measure out the space around the door with a tape measure if the other options aren’t possible. Measure out the length and width of the trim space on all sides of the door to find out how much trim you need. Narrower trim can be a good choice for simplicity and appearance, but make sure you leave enough material to cover the gap between the door frame and wall. Wider trim stands out more, but it’ll cover more of the wall. Make sure you have enough space for it. Put on ear and eye protection before sawing. Cover your eyes with a pair of polycarbonate safety glasses. Miter saws are loud, so also put on a pair of earmuffs or foam earplugs. Avoid putting on gloves or any other loose clothing that could get caught in the saw. Cut the trim pieces with a miter saw. Set the miter saw to cut at an angle of exactly 45°. Line up the trim and cut from the inside edge diagonally upwards to the outside edge. Cut a large piece of trim into the top piece and one of the sides. It’s okay to leave the trim a little long at first. You can adjust this as needed later. It’s helpful to practice using the miter saw on scrap wood first. You are usually able to adjust the saw more than you expect to get a better-fitting joint. Cut the side trim to length. Line up the side pieces of trim against the door. If the trim is long, measure up from the bottom to mark how much length needs to be removed. Cut the bottoms of the side trim pieces evenly so they match and fit on the door frame. Cut the top trim to the appropriate size. Hold the header against the 2 side pieces. This piece has miter joints on both sides, which should fit snugly against the rest of the trim. If you have to reduce the header, make sure the miter is set at a 45° angle. Redo the cut until the header fits in place. Installing the New Trim Position the trim against the wall. Place the pieces without attaching them to double-check the fit. Pay attention to how the header piece fits on top of the side pieces. Make any adjustments needed by further cutting down the size of the trim. Nail the side trim in place. Use a finish nailer to secure the trim. On the inside part, which covers the door jamb, use 4d or 1.5 in (3.8 cm) finishing nails. On the outside part, which attaches to the wall, use 6d or 2 in (5.1 cm) finishing nails to secure the trim. Avoid placing the nails close to the ends of the trim. Depending on the thickness of your trim, you may need larger nails. Hold the nails up to the trim to see if they're long enough to go all the way through to the wall. Drill and nail the header in place. Stand on a stepstool to reach the top part of the door. Place the top trim, checking one last time to make sure it’s the right size. When finished, attach it the same way you did the other pieces. Pre-drill holes in the trim’s corners. Push the trim pieces together to tighten them a little more. Measure about 1 in (2.5 cm) from the sides of the header. Drill a ⁄16 in (1.6 mm) hole down through the top of the header. Measure down the side pieces and drill a hole through each from the outside edge. Hold a piece of cardboard against the wall to prevent your tools from damaging it. Nail the trim pieces in place. Stick 3d or 1.25 in (3.2 cm) nails in each hole. Start on one side of the door. Alternate striking the top and side nails so that the trim doesn’t fall out of alignment. When finished, move on to the other side. Caulk the holes, joints, and edges of the trim. The holes and miter joints can be filled with painter’s putty, wood filler, or a paintable acrylic or silicone caulk as needed. Spread it using a putty knife or your fingers. Then go around the outside of the trim, squeezing a small bead of caulk between the trim and the wall. Run your finger along the bead of caulk to smooth it out, then wipe it clean on a wet rag. You’ll need to let the caulk dry before painting or staining. Check the label information to find out how long this takes. Sand, prime, and paint the door frame. Sand the door frame lightly to make it smooth and even. You can further customize your trim by staining or painting it. The trim can be colored with primer and a layer of paint. You can also retain the appearance of wood trim by using a commercial staining product to color it. Use an oil or latex-based primer before painting over wood.",
    "sentences": [
        " Removing Old Trim Cut through the caulking with a utility knife.",
        "Work your knife’s blade under the outside edge of the trim.",
        "You may also cut through some paint while doing this, but that’s okay.",
        "Cut all the way around the trim to free it.",
        "Make sure to cut all the way through the caulking to avoid damaging the paint when you pry off the trim.",
        "Use a pry bar to pull off the trim.",
        "Slide the edge of the pry bar under the trim near a nail.",
        "You can tap a hammer against the back of the bar to help wedge it in.",
        "Pull back one piece of trim at a time, taking care not to damage the walls and door jamb.",
        "It doesn’t matter which side you start on, as long as you remove all the pieces you want to replace.",
        "To protect the walls, hold a scrap of wood against the wall and rest the back of the pry bar against it as you work.",
        "There’s not really a way to protect the jamb besides being very careful when leveraging the trim.",
        "Scrape off any remaining caulking with a knife.",
        "Use the utility knife or a chisel to remove any old caulk left over.",
        "You may also need to scrape down thick layers of paint to level out the space where the new trim will rest.",
        "Cutting the New Trim Measure the new trim against the door.",
        "First, purchase some trim from the home improvement store.",
        "Most trim comes in 8 or 10 ft (2.4 or 3.0 m) sections.",
        "Use your old trim as a sizing guide or hold the new trim against the door frame.",
        "Mark the measurements with a pencil so you know how to size the trim.",
        "You can always measure out the space around the door with a tape measure if the other options aren’t possible.",
        "Measure out the length and width of the trim space on all sides of the door to find out how much trim you need.",
        "Narrower trim can be a good choice for simplicity and appearance, but make sure you leave enough material to cover the gap between the door frame and wall.",
        "Wider trim stands out more, but it’ll cover more of the wall.",
        "Make sure you have enough space for it.",
        "Put on ear and eye protection before sawing.",
        "Cover your eyes with a pair of polycarbonate safety glasses.",
        "Miter saws are loud, so also put on a pair of earmuffs or foam earplugs.",
        "Avoid putting on gloves or any other loose clothing that could get caught in the saw.",
        "Cut the trim pieces with a miter saw.",
        "Set the miter saw to cut at an angle of exactly 45°.",
        "Line up the trim and cut from the inside edge diagonally upwards to the outside edge.",
        "Cut a large piece of trim into the top piece and one of the sides.",
        "It’s okay to leave the trim a little long at first.",
        "You can adjust this as needed later.",
        "It’s helpful to practice using the miter saw on scrap wood first.",
        "You are usually able to adjust the saw more than you expect to get a better-fitting joint.",
        "Cut the side trim to length.",
        "Line up the side pieces of trim against the door.",
        "If the trim is long, measure up from the bottom to mark how much length needs to be removed.",
        "Cut the bottoms of the side trim pieces evenly so they match and fit on the door frame.",
        "Cut the top trim to the appropriate size.",
        "Hold the header against the 2 side pieces.",
        "This piece has miter joints on both sides, which should fit snugly against the rest of the trim.",
        "If you have to reduce the header, make sure the miter is set at a 45° angle.",
        "Redo the cut until the header fits in place.",
        "Installing the New Trim Position the trim against the wall.",
        "Place the pieces without attaching them to double-check the fit.",
        "Pay attention to how the header piece fits on top of the side pieces.",
        "Make any adjustments needed by further cutting down the size of the trim.",
        "Nail the side trim in place.",
        "Use a finish nailer to secure the trim.",
        "On the inside part, which covers the door jamb, use 4d or 1.5 in (3.8 cm) finishing nails.",
        "On the outside part, which attaches to the wall, use 6d or 2 in (5.1 cm) finishing nails to secure the trim.",
        "Avoid placing the nails close to the ends of the trim.",
        "Depending on the thickness of your trim, you may need larger nails.",
        "Hold the nails up to the trim to see if they're long enough to go all the way through to the wall.",
        "Drill and nail the header in place.",
        "Stand on a stepstool to reach the top part of the door.",
        "Place the top trim, checking one last time to make sure it’s the right size.",
        "When finished, attach it the same way you did the other pieces.",
        "Pre-drill holes in the trim’s corners.",
        "Push the trim pieces together to tighten them a little more.",
        "Measure about 1 in (2.5 cm) from the sides of the header.",
        "Drill a ⁄16 in (1.6 mm) hole down through the top of the header.",
        "Measure down the side pieces and drill a hole through each from the outside edge.",
        "Hold a piece of cardboard against the wall to prevent your tools from damaging it.",
        "Nail the trim pieces in place.",
        "Stick 3d or 1.25 in (3.2 cm) nails in each hole.",
        "Start on one side of the door.",
        "Alternate striking the top and side nails so that the trim doesn’t fall out of alignment.",
        "When finished, move on to the other side.",
        "Caulk the holes, joints, and edges of the trim.",
        "The holes and miter joints can be filled with painter’s putty, wood filler, or a paintable acrylic or silicone caulk as needed.",
        "Spread it using a putty knife or your fingers.",
        "Then go around the outside of the trim, squeezing a small bead of caulk between the trim and the wall.",
        "Run your finger along the bead of caulk to smooth it out, then wipe it clean on a wet rag.",
        "You’ll need to let the caulk dry before painting or staining.",
        "Check the label information to find out how long this takes.",
        "Sand, prime, and paint the door frame.",
        "Sand the door frame lightly to make it smooth and even.",
        "You can further customize your trim by staining or painting it.",
        "The trim can be colored with primer and a layer of paint.",
        "You can also retain the appearance of wood trim by using a commercial staining product to color it.",
        "Use an oil or latex-based primer before painting over wood."
    ]
}