{
    "title": "How to Measure Peanut Butter",
    "url": "https://www.wikihow.com/Measure-Peanut-Butter",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills"
    ],
    "methods": [
        {
            "name": "Using a Measuring Cup",
            "steps": [
                {
                    "headline": "Spray the interior of the measuring cup with a non-stick cooking spray.",
                    "description": "Use measuring cups that you would normally use for dry ingredients. Select a measuring cup that corresponds to the amount of peanut butter you need. Spraying the inside of the measuring cup will prevent the peanut butter from sticking to the inside of the cup. You can also use cooking oil or melted butter as an alternative to cooking spray. Peanut butter that gets stuck to your kitchen tools will reduce the amount of peanut butter you’re using in your dishes."
                },
                {
                    "headline": "Spray the spatula or spoon that you’re using to scoop the peanut butter.",
                    "description": "Similar to your measuring cup, peanut butter that gets stuck to your kitchen tools will throw off your recipes. Spraying the spatula or spoon will make it slippery and prevent peanut butter from getting stuck on it. You can also use oil or melted butter for your spoon or spatula."
                },
                {
                    "headline": "Fill the measuring cup with peanut butter.",
                    "description": "Level off the top of the peanut butter so that it runs flush with the edges of the measuring cup. You should now be able to easily incorporate it into your recipe without a lot of waste. If you don’t level the top of the peanut butter, your measurement will be inaccurate."
                }
            ]
        },
        {
            "name": "Measuring the Weight of Peanut Butter",
            "steps": [
                {
                    "headline": "Purchase a flat kitchen or digital scale.",
                    "description": "You can buy a digital scale online or at some department stores. Make sure that the scale has a flat top so that you can weigh the peanut butter."
                },
                {
                    "headline": "Spray your measuring cup and spatula or spoon with non-stick spray.",
                    "description": "If you don't want peanut butter to stick to your measuring cup or kitchen tools, use a non-stick kitchen spray to lubricate them before working with the peanut butter."
                },
                {
                    "headline": "Place the empty measuring cup on the scale and hit tare.",
                    "description": "Weighing the empty measuring cup will give you the weight of the cup itself. The tare button will zero out the scale so that you can weigh the peanut butter minus the weight of the measuring cup. If your scale doesn’t have a tare button, you’ll have to subtract the weight of your measuring cup from the overall weight to get the weight of the peanut butter."
                },
                {
                    "headline": "Fill the measuring cup with peanut butter.",
                    "description": "Leave the cup on the scale as you fill it up. Continue to add peanut butter until the display matches the amount you want. If you add too much, remove some peanut butter from the container."
                }
            ]
        },
        {
            "name": "Measuring Peanut Butter with Water",
            "steps": [
                {
                    "headline": "Fill a measuring cup with 2-cups (473.176 ml) of water.",
                    "description": "Peanut butter is hard to measure in a traditional liquid measuring cup because it's sticky and tends to ball up. If you fill up a container with water first, you can measure the amount of peanut butter without having to level it out. Fill up a measuring cup made for liquids with 2-cups (473.1 ml) of water."
                },
                {
                    "headline": "Spoon peanut butter into the measuring cup.",
                    "description": "If you don’t want the peanut butter to stick to the spoon or spatula that you’re using, spray it down with non-stick cooking spray, butter, or oil beforehand. Otherwise, just add peanut butter to the water in the measuring cup."
                },
                {
                    "headline": "Subtract 2 cups (473.176 ml) from the water measurement.",
                    "description": "The peanut butter will cause the water to rise in your measuring cup. Once the water rises to the 3-cups (709.7 ml) mark, you’ll have 1-cup (236.58 mg) of peanut butter. Continue to scoop the peanut butter into the measuring cup until you have the amount you need."
                }
            ]
        }
    ],
    "tyn": [
        "Using a Measuring Cup",
        "Measuring cup",
        "Spoon or spatula",
        "Non-stick cooking spray, butter, or oil",
        "Measuring the Weight of Peanut Butter",
        "Kitchen scale",
        "Spatula or spoon",
        "Measuring Peanut Butter with Water",
        "Water",
        "Spoon",
        "Non-stick cooking spray, butter, or oil (optional)"
    ],
    "text": " Using a Measuring Cup Spray the interior of the measuring cup with a non-stick cooking spray. Use measuring cups that you would normally use for dry ingredients. Select a measuring cup that corresponds to the amount of peanut butter you need. Spraying the inside of the measuring cup will prevent the peanut butter from sticking to the inside of the cup. You can also use cooking oil or melted butter as an alternative to cooking spray. Peanut butter that gets stuck to your kitchen tools will reduce the amount of peanut butter you’re using in your dishes. Spray the spatula or spoon that you’re using to scoop the peanut butter. Similar to your measuring cup, peanut butter that gets stuck to your kitchen tools will throw off your recipes. Spraying the spatula or spoon will make it slippery and prevent peanut butter from getting stuck on it. You can also use oil or melted butter for your spoon or spatula. Fill the measuring cup with peanut butter. Level off the top of the peanut butter so that it runs flush with the edges of the measuring cup. You should now be able to easily incorporate it into your recipe without a lot of waste. If you don’t level the top of the peanut butter, your measurement will be inaccurate. Measuring the Weight of Peanut Butter Purchase a flat kitchen or digital scale. You can buy a digital scale online or at some department stores. Make sure that the scale has a flat top so that you can weigh the peanut butter. Spray your measuring cup and spatula or spoon with non-stick spray. If you don't want peanut butter to stick to your measuring cup or kitchen tools, use a non-stick kitchen spray to lubricate them before working with the peanut butter. Place the empty measuring cup on the scale and hit tare. Weighing the empty measuring cup will give you the weight of the cup itself. The tare button will zero out the scale so that you can weigh the peanut butter minus the weight of the measuring cup. If your scale doesn’t have a tare button, you’ll have to subtract the weight of your measuring cup from the overall weight to get the weight of the peanut butter. Fill the measuring cup with peanut butter. Leave the cup on the scale as you fill it up. Continue to add peanut butter until the display matches the amount you want. If you add too much, remove some peanut butter from the container. Measuring Peanut Butter with Water Fill a measuring cup with 2-cups (473.176 ml) of water. Peanut butter is hard to measure in a traditional liquid measuring cup because it's sticky and tends to ball up. If you fill up a container with water first, you can measure the amount of peanut butter without having to level it out. Fill up a measuring cup made for liquids with 2-cups (473.1 ml) of water. Spoon peanut butter into the measuring cup. If you don’t want the peanut butter to stick to the spoon or spatula that you’re using, spray it down with non-stick cooking spray, butter, or oil beforehand. Otherwise, just add peanut butter to the water in the measuring cup. Subtract 2 cups (473.176 ml) from the water measurement. The peanut butter will cause the water to rise in your measuring cup. Once the water rises to the 3-cups (709.7 ml) mark, you’ll have 1-cup (236.58 mg) of peanut butter. Continue to scoop the peanut butter into the measuring cup until you have the amount you need.",
    "sentences": [
        " Using a Measuring Cup Spray the interior of the measuring cup with a non-stick cooking spray.",
        "Use measuring cups that you would normally use for dry ingredients.",
        "Select a measuring cup that corresponds to the amount of peanut butter you need.",
        "Spraying the inside of the measuring cup will prevent the peanut butter from sticking to the inside of the cup.",
        "You can also use cooking oil or melted butter as an alternative to cooking spray.",
        "Peanut butter that gets stuck to your kitchen tools will reduce the amount of peanut butter you’re using in your dishes.",
        "Spray the spatula or spoon that you’re using to scoop the peanut butter.",
        "Similar to your measuring cup, peanut butter that gets stuck to your kitchen tools will throw off your recipes.",
        "Spraying the spatula or spoon will make it slippery and prevent peanut butter from getting stuck on it.",
        "You can also use oil or melted butter for your spoon or spatula.",
        "Fill the measuring cup with peanut butter.",
        "Level off the top of the peanut butter so that it runs flush with the edges of the measuring cup.",
        "You should now be able to easily incorporate it into your recipe without a lot of waste.",
        "If you don’t level the top of the peanut butter, your measurement will be inaccurate.",
        "Measuring the Weight of Peanut Butter Purchase a flat kitchen or digital scale.",
        "You can buy a digital scale online or at some department stores.",
        "Make sure that the scale has a flat top so that you can weigh the peanut butter.",
        "Spray your measuring cup and spatula or spoon with non-stick spray.",
        "If you don't want peanut butter to stick to your measuring cup or kitchen tools, use a non-stick kitchen spray to lubricate them before working with the peanut butter.",
        "Place the empty measuring cup on the scale and hit tare.",
        "Weighing the empty measuring cup will give you the weight of the cup itself.",
        "The tare button will zero out the scale so that you can weigh the peanut butter minus the weight of the measuring cup.",
        "If your scale doesn’t have a tare button, you’ll have to subtract the weight of your measuring cup from the overall weight to get the weight of the peanut butter.",
        "Fill the measuring cup with peanut butter.",
        "Leave the cup on the scale as you fill it up.",
        "Continue to add peanut butter until the display matches the amount you want.",
        "If you add too much, remove some peanut butter from the container.",
        "Measuring Peanut Butter with Water Fill a measuring cup with 2-cups (473.176 ml) of water.",
        "Peanut butter is hard to measure in a traditional liquid measuring cup because it's sticky and tends to ball up.",
        "If you fill up a container with water first, you can measure the amount of peanut butter without having to level it out.",
        "Fill up a measuring cup made for liquids with 2-cups (473.1 ml) of water.",
        "Spoon peanut butter into the measuring cup.",
        "If you don’t want the peanut butter to stick to the spoon or spatula that you’re using, spray it down with non-stick cooking spray, butter, or oil beforehand.",
        "Otherwise, just add peanut butter to the water in the measuring cup.",
        "Subtract 2 cups (473.176 ml) from the water measurement.",
        "The peanut butter will cause the water to rise in your measuring cup.",
        "Once the water rises to the 3-cups (709.7 ml) mark, you’ll have 1-cup (236.58 mg) of peanut butter.",
        "Continue to scoop the peanut butter into the measuring cup until you have the amount you need."
    ]
}