{
    "title": "How to Cook Ostrich Steak",
    "url": "https://www.wikihow.com/Cook-Ostrich-Steak",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Beef and Lamb",
        "Steak Dishes"
    ],
    "methods": [
        {
            "name": "Making Pan-Fried Ostrich Steak",
            "steps": [
                {
                    "headline": "Melt the butter over medium heat.",
                    "description": "Put 1 tablespoon (14 g) of butter into a large skillet and turn the heat to medium. The butter should melt within 1 minute. Use a skillet that's at least 12 inches (30 cm)."
                },
                {
                    "headline": "Season and cook the ostrich steaks for 2 minutes.",
                    "description": "Slowly lower 4 5-to 7-ounce (150 to 200 g) ostrich steaks into the butter in the skillet. Sprinkle them with salt and pepper to taste. Cook the steaks without moving them in the pan until they become crisp and lightly browned on the bottom. Avoid rinsing and drying the ostrich steaks before cooking them."
                },
                {
                    "headline": "Flip and cook the ostrich steaks for 2 more minutes.",
                    "description": "Use tongs to gently lift and flip the ostrich steaks over and cook them until they brown on the other side."
                },
                {
                    "headline": "Check the temperature of the ostrich steaks.",
                    "description": "Insert an instant-read meat thermometer into the thickest part of a steak. The temperature should reach 145 °F (63 °C) once the ostrich steak is done. The ostrich steak should be medium-rare to medium in the center. For well done steak, cook them for 2 to 3 more minutes."
                },
                {
                    "headline": "Rest the steaks for 5 minutes before you serve them.",
                    "description": "Transfer the ostrich steaks to a large plate or cutting board and cover them loosely with a sheet of aluminum foil. As the steaks rest, the juices will redistribute within the meat. Serve the steaks while they're still hot. Consider serving the steaks with your favorite steak sauce, wine sauce, or creamy mustard. Place the leftover ostrich steaks in an airtight container. Refrigerate them for 3 to 4 days."
                }
            ]
        },
        {
            "name": "Making Marinated Ostrich Steak Kebabs",
            "steps": [
                {
                    "headline": "Preheat a grill to high heat.",
                    "description": "Turn on a gas grill to high heat. If you're using a charcoal grill, fill a chimney with charcoal briquettes. Heat the charcoal until the coals glow and become ashy. Dump the coals onto the grate."
                },
                {
                    "headline": "Cut the ostrich steak into 1 inch (2.5 cm) cubes.",
                    "description": "Place 1.1 pounds (500 g) of ostrich steak on a cutting board. Use a sharp knife to cut the meat into 1 inch (2.5 cm) cubes. Place the cubed meat into a large bowl."
                },
                {
                    "headline": "Cut the mushrooms and peppers.",
                    "description": "Wipe 4 cups (300 g) of small brown mushrooms with a paper towel to remove any dirt. Trim away the ends of the stems. Cut away the stems from 1 red and 1 green bell pepper. Rinse away the seeds from the center. Chop the peppers into 1 inch (2.5 cm) pieces. Transfer the whole mushrooms and chopped peppers into the bowl with the ostrich meat."
                },
                {
                    "headline": "Mix together the marinade.",
                    "description": "Measure 2/3 cup (150 ml) of coconut milk and 1/4 cup (60 ml) of beef stock into a small bowl. Whisk or stir in 5/8 cup (30 g) of chopped fresh cilantro, 2 1/2 tablespoons (30 g) of brown sugar, 1/8 cup (20 g) of red curry paste, 3 tablespoons (45 ml) of fish sauce, and 4 teaspoons (20 ml) of oil."
                },
                {
                    "headline": "Pour the marinade in the bowl and marinate the ingredients for 2 to 3 hours.",
                    "description": "Cover the bowl with a piece of plastic wrap and put it in the refrigerator. Chill the meat and vegetables in the marinade for 2 to 3 hours."
                },
                {
                    "headline": "Assemble the kebabs.",
                    "description": "Remove the bowl of marinated meat and vegetables from the refrigerator. Push one piece of ostrich meat onto a long skewer before you thread a piece of mushroom or pepper onto it. Continue to alternate a piece of meat with a vegetable until the skewer is filled. Repeat this with as many skewers as you can fill. You should get at least 6 skewers depending on how long they are."
                },
                {
                    "headline": "Grill the ostrich steak kebabs for 5 minutes.",
                    "description": "Lay the assembled kebabs on the grill grate directly over the hot coals. Use long tongs to turn the kebabs frequently, so they cook evenly. The kebabs should become charred and well-cooked on the outside. The ostrich should be medium-rare to medium once it's finished cooking. Avoid overcooking the meat or it will be tough."
                },
                {
                    "headline": "Remove and serve the ostrich steak kebabs.",
                    "description": "Place the kebabs on a serving plate and serve them immediately with rice, peanut sauce, and fresh vegetables. Store the leftover kebabs in an airtight container in the refrigerator for 3 to 4 days."
                }
            ]
        },
        {
            "name": "Making Spicy Ostrich and Mixed Peppers",
            "steps": [
                {
                    "headline": "Preheat the oven to 300 °F (149 °C) and cut the ostrich steak into pieces.",
                    "description": "Set a 6 ounce (170 g) of ostrich steak on a cutting board. Use a sharp knife to cut the meat into 1 inch (2.5 cm) pieces."
                },
                {
                    "headline": "Toss the ostrich meat with flour, salt, and pepper.",
                    "description": "Place 2 tablespoons (15.5 g) of flour into a shallow plate or dish. Add salt and pepper according to your taste and mix it in. Add the ostrich pieces to the plate and use your fingers to toss the meat until it's coated."
                },
                {
                    "headline": "Sauté the ostrich pieces over medium heat for 2 to 4 minutes.",
                    "description": "Pour 2 tablespoons (30 ml) of vegetable oil into a skillet and turn the heat to medium. Lift the ostrich pieces out of the flour and shake them a little to remove the excess flour. Place the meat in the hot oil and cook them for 2 to 4 minutes. Stir the meat occasionally so it browns all over."
                },
                {
                    "headline": "Cut the peppers and red onion.",
                    "description": "Trim away and discard the stems from 1 red bell pepper, 1 green or yellow bell pepper, and 1 medium red chili. Rinse away the seeds and use a sharp knife to slice the peppers into strips about ⁄4 inch (0.64 cm) thick. Peel 1/2 of a small red onion and slice it into ⁄4 inch (0.64 cm) strips."
                },
                {
                    "headline": "Combine the ostrich pieces, vegetables, and chicken stock.",
                    "description": "Transfer the sliced vegetables into a baking dish and add the sautéed ostrich meat. Stir in 2 cups (473 ml) of chicken stock until the ingredients are combined. Use a baking dish that's at least 3.5 quarts (3.3 liters)."
                },
                {
                    "headline": "Cover and bake the ostrich meat with vegetables for 1 1/2 hours.",
                    "description": "Put the lid on the baking dish and place it in the preheated oven. Bake the casserole until the meat becomes tender and the vegetables soften."
                },
                {
                    "headline": "Rest the dish for 5 to 10 minutes before you serve it.",
                    "description": "Remove the baking dish from the oven and set it aside to rest so it cools a little and finishes cooking. Garnish the ostrich with shredded fresh basil. Serve the hot spicy ostrich with peppers over cooked rice. Refrigerate the leftover ostrich and peppers in an airtight container for 3 to 4 days. You can flavor your rice with turmeric which will also give it a bright yellow color."
                }
            ]
        }
    ],
    "tyn": [
        "Pan-Fried Ostrich Steak",
        "Skillet at least 12 inches (30 cm) across",
        "Instant-read meat thermometer",
        "Tongs",
        "Marinated Ostrich Steak Kebabs",
        "Measuring cups and spoons",
        "Digital scale",
        "Large bowl",
        "Knife and cutting board",
        "Plastic wrap",
        "Gas or charcoal grill with briquettes",
        "Long tongs",
        "Serving plate",
        "Skewers",
        "Spicy Ostrich and Mixed Peppers",
        "Baking dish at least 3.5 quarts (3.3 liters) in size with a lid",
        "Spoon",
        "Shallow plate or dish",
        "Skillet"
    ],
    "text": " Making Pan-Fried Ostrich Steak Melt the butter over medium heat. Put 1 tablespoon (14 g) of butter into a large skillet and turn the heat to medium. The butter should melt within 1 minute. Use a skillet that's at least 12 inches (30 cm). Season and cook the ostrich steaks for 2 minutes. Slowly lower 4 5-to 7-ounce (150 to 200 g) ostrich steaks into the butter in the skillet. Sprinkle them with salt and pepper to taste. Cook the steaks without moving them in the pan until they become crisp and lightly browned on the bottom. Avoid rinsing and drying the ostrich steaks before cooking them. Flip and cook the ostrich steaks for 2 more minutes. Use tongs to gently lift and flip the ostrich steaks over and cook them until they brown on the other side. Check the temperature of the ostrich steaks. Insert an instant-read meat thermometer into the thickest part of a steak. The temperature should reach 145 °F (63 °C) once the ostrich steak is done. The ostrich steak should be medium-rare to medium in the center. For well done steak, cook them for 2 to 3 more minutes. Rest the steaks for 5 minutes before you serve them. Transfer the ostrich steaks to a large plate or cutting board and cover them loosely with a sheet of aluminum foil. As the steaks rest, the juices will redistribute within the meat. Serve the steaks while they're still hot. Consider serving the steaks with your favorite steak sauce, wine sauce, or creamy mustard. Place the leftover ostrich steaks in an airtight container. Refrigerate them for 3 to 4 days. Making Marinated Ostrich Steak Kebabs Preheat a grill to high heat. Turn on a gas grill to high heat. If you're using a charcoal grill, fill a chimney with charcoal briquettes. Heat the charcoal until the coals glow and become ashy. Dump the coals onto the grate. Cut the ostrich steak into 1 inch (2.5 cm) cubes. Place 1.1 pounds (500 g) of ostrich steak on a cutting board. Use a sharp knife to cut the meat into 1 inch (2.5 cm) cubes. Place the cubed meat into a large bowl. Cut the mushrooms and peppers. Wipe 4 cups (300 g) of small brown mushrooms with a paper towel to remove any dirt. Trim away the ends of the stems. Cut away the stems from 1 red and 1 green bell pepper. Rinse away the seeds from the center. Chop the peppers into 1 inch (2.5 cm) pieces. Transfer the whole mushrooms and chopped peppers into the bowl with the ostrich meat. Mix together the marinade. Measure 2/3 cup (150 ml) of coconut milk and 1/4 cup (60 ml) of beef stock into a small bowl. Whisk or stir in 5/8 cup (30 g) of chopped fresh cilantro, 2 1/2 tablespoons (30 g) of brown sugar, 1/8 cup (20 g) of red curry paste, 3 tablespoons (45 ml) of fish sauce, and 4 teaspoons (20 ml) of oil. Pour the marinade in the bowl and marinate the ingredients for 2 to 3 hours. Cover the bowl with a piece of plastic wrap and put it in the refrigerator. Chill the meat and vegetables in the marinade for 2 to 3 hours. Assemble the kebabs. Remove the bowl of marinated meat and vegetables from the refrigerator. Push one piece of ostrich meat onto a long skewer before you thread a piece of mushroom or pepper onto it. Continue to alternate a piece of meat with a vegetable until the skewer is filled. Repeat this with as many skewers as you can fill. You should get at least 6 skewers depending on how long they are. Grill the ostrich steak kebabs for 5 minutes. Lay the assembled kebabs on the grill grate directly over the hot coals. Use long tongs to turn the kebabs frequently, so they cook evenly. The kebabs should become charred and well-cooked on the outside. The ostrich should be medium-rare to medium once it's finished cooking. Avoid overcooking the meat or it will be tough. Remove and serve the ostrich steak kebabs. Place the kebabs on a serving plate and serve them immediately with rice, peanut sauce, and fresh vegetables. Store the leftover kebabs in an airtight container in the refrigerator for 3 to 4 days. Making Spicy Ostrich and Mixed Peppers Preheat the oven to 300 °F (149 °C) and cut the ostrich steak into pieces. Set a 6 ounce (170 g) of ostrich steak on a cutting board. Use a sharp knife to cut the meat into 1 inch (2.5 cm) pieces. Toss the ostrich meat with flour, salt, and pepper. Place 2 tablespoons (15.5 g) of flour into a shallow plate or dish. Add salt and pepper according to your taste and mix it in. Add the ostrich pieces to the plate and use your fingers to toss the meat until it's coated. Sauté the ostrich pieces over medium heat for 2 to 4 minutes. Pour 2 tablespoons (30 ml) of vegetable oil into a skillet and turn the heat to medium. Lift the ostrich pieces out of the flour and shake them a little to remove the excess flour. Place the meat in the hot oil and cook them for 2 to 4 minutes. Stir the meat occasionally so it browns all over. Cut the peppers and red onion. Trim away and discard the stems from 1 red bell pepper, 1 green or yellow bell pepper, and 1 medium red chili. Rinse away the seeds and use a sharp knife to slice the peppers into strips about ⁄4 inch (0.64 cm) thick. Peel 1/2 of a small red onion and slice it into ⁄4 inch (0.64 cm) strips. Combine the ostrich pieces, vegetables, and chicken stock. Transfer the sliced vegetables into a baking dish and add the sautéed ostrich meat. Stir in 2 cups (473 ml) of chicken stock until the ingredients are combined. Use a baking dish that's at least 3.5 quarts (3.3 liters). Cover and bake the ostrich meat with vegetables for 1 1/2 hours. Put the lid on the baking dish and place it in the preheated oven. Bake the casserole until the meat becomes tender and the vegetables soften. Rest the dish for 5 to 10 minutes before you serve it. Remove the baking dish from the oven and set it aside to rest so it cools a little and finishes cooking. Garnish the ostrich with shredded fresh basil. Serve the hot spicy ostrich with peppers over cooked rice. Refrigerate the leftover ostrich and peppers in an airtight container for 3 to 4 days. You can flavor your rice with turmeric which will also give it a bright yellow color.",
    "sentences": [
        " Making Pan-Fried Ostrich Steak Melt the butter over medium heat.",
        "Put 1 tablespoon (14 g) of butter into a large skillet and turn the heat to medium.",
        "The butter should melt within 1 minute.",
        "Use a skillet that's at least 12 inches (30 cm).",
        "Season and cook the ostrich steaks for 2 minutes.",
        "Slowly lower 4 5-to 7-ounce (150 to 200 g) ostrich steaks into the butter in the skillet.",
        "Sprinkle them with salt and pepper to taste.",
        "Cook the steaks without moving them in the pan until they become crisp and lightly browned on the bottom.",
        "Avoid rinsing and drying the ostrich steaks before cooking them.",
        "Flip and cook the ostrich steaks for 2 more minutes.",
        "Use tongs to gently lift and flip the ostrich steaks over and cook them until they brown on the other side.",
        "Check the temperature of the ostrich steaks.",
        "Insert an instant-read meat thermometer into the thickest part of a steak.",
        "The temperature should reach 145 °F (63 °C) once the ostrich steak is done.",
        "The ostrich steak should be medium-rare to medium in the center.",
        "For well done steak, cook them for 2 to 3 more minutes.",
        "Rest the steaks for 5 minutes before you serve them.",
        "Transfer the ostrich steaks to a large plate or cutting board and cover them loosely with a sheet of aluminum foil.",
        "As the steaks rest, the juices will redistribute within the meat.",
        "Serve the steaks while they're still hot.",
        "Consider serving the steaks with your favorite steak sauce, wine sauce, or creamy mustard.",
        "Place the leftover ostrich steaks in an airtight container.",
        "Refrigerate them for 3 to 4 days.",
        "Making Marinated Ostrich Steak Kebabs Preheat a grill to high heat.",
        "Turn on a gas grill to high heat.",
        "If you're using a charcoal grill, fill a chimney with charcoal briquettes.",
        "Heat the charcoal until the coals glow and become ashy.",
        "Dump the coals onto the grate.",
        "Cut the ostrich steak into 1 inch (2.5 cm) cubes.",
        "Place 1.1 pounds (500 g) of ostrich steak on a cutting board.",
        "Use a sharp knife to cut the meat into 1 inch (2.5 cm) cubes.",
        "Place the cubed meat into a large bowl.",
        "Cut the mushrooms and peppers.",
        "Wipe 4 cups (300 g) of small brown mushrooms with a paper towel to remove any dirt.",
        "Trim away the ends of the stems.",
        "Cut away the stems from 1 red and 1 green bell pepper.",
        "Rinse away the seeds from the center.",
        "Chop the peppers into 1 inch (2.5 cm) pieces.",
        "Transfer the whole mushrooms and chopped peppers into the bowl with the ostrich meat.",
        "Mix together the marinade.",
        "Measure 2/3 cup (150 ml) of coconut milk and 1/4 cup (60 ml) of beef stock into a small bowl.",
        "Whisk or stir in 5/8 cup (30 g) of chopped fresh cilantro, 2 1/2 tablespoons (30 g) of brown sugar, 1/8 cup (20 g) of red curry paste, 3 tablespoons (45 ml) of fish sauce, and 4 teaspoons (20 ml) of oil.",
        "Pour the marinade in the bowl and marinate the ingredients for 2 to 3 hours.",
        "Cover the bowl with a piece of plastic wrap and put it in the refrigerator.",
        "Chill the meat and vegetables in the marinade for 2 to 3 hours.",
        "Assemble the kebabs.",
        "Remove the bowl of marinated meat and vegetables from the refrigerator.",
        "Push one piece of ostrich meat onto a long skewer before you thread a piece of mushroom or pepper onto it.",
        "Continue to alternate a piece of meat with a vegetable until the skewer is filled.",
        "Repeat this with as many skewers as you can fill.",
        "You should get at least 6 skewers depending on how long they are.",
        "Grill the ostrich steak kebabs for 5 minutes.",
        "Lay the assembled kebabs on the grill grate directly over the hot coals.",
        "Use long tongs to turn the kebabs frequently, so they cook evenly.",
        "The kebabs should become charred and well-cooked on the outside.",
        "The ostrich should be medium-rare to medium once it's finished cooking.",
        "Avoid overcooking the meat or it will be tough.",
        "Remove and serve the ostrich steak kebabs.",
        "Place the kebabs on a serving plate and serve them immediately with rice, peanut sauce, and fresh vegetables.",
        "Store the leftover kebabs in an airtight container in the refrigerator for 3 to 4 days.",
        "Making Spicy Ostrich and Mixed Peppers Preheat the oven to 300 °F (149 °C) and cut the ostrich steak into pieces.",
        "Set a 6 ounce (170 g) of ostrich steak on a cutting board.",
        "Use a sharp knife to cut the meat into 1 inch (2.5 cm) pieces.",
        "Toss the ostrich meat with flour, salt, and pepper.",
        "Place 2 tablespoons (15.5 g) of flour into a shallow plate or dish.",
        "Add salt and pepper according to your taste and mix it in.",
        "Add the ostrich pieces to the plate and use your fingers to toss the meat until it's coated.",
        "Sauté the ostrich pieces over medium heat for 2 to 4 minutes.",
        "Pour 2 tablespoons (30 ml) of vegetable oil into a skillet and turn the heat to medium.",
        "Lift the ostrich pieces out of the flour and shake them a little to remove the excess flour.",
        "Place the meat in the hot oil and cook them for 2 to 4 minutes.",
        "Stir the meat occasionally so it browns all over.",
        "Cut the peppers and red onion.",
        "Trim away and discard the stems from 1 red bell pepper, 1 green or yellow bell pepper, and 1 medium red chili.",
        "Rinse away the seeds and use a sharp knife to slice the peppers into strips about ⁄4 inch (0.64 cm) thick.",
        "Peel 1/2 of a small red onion and slice it into ⁄4 inch (0.64 cm) strips.",
        "Combine the ostrich pieces, vegetables, and chicken stock.",
        "Transfer the sliced vegetables into a baking dish and add the sautéed ostrich meat.",
        "Stir in 2 cups (473 ml) of chicken stock until the ingredients are combined.",
        "Use a baking dish that's at least 3.5 quarts (3.3 liters).",
        "Cover and bake the ostrich meat with vegetables for 1 1/2 hours.",
        "Put the lid on the baking dish and place it in the preheated oven.",
        "Bake the casserole until the meat becomes tender and the vegetables soften.",
        "Rest the dish for 5 to 10 minutes before you serve it.",
        "Remove the baking dish from the oven and set it aside to rest so it cools a little and finishes cooking.",
        "Garnish the ostrich with shredded fresh basil.",
        "Serve the hot spicy ostrich with peppers over cooked rice.",
        "Refrigerate the leftover ostrich and peppers in an airtight container for 3 to 4 days.",
        "You can flavor your rice with turmeric which will also give it a bright yellow color."
    ]
}