{
    "title": "How to Identify Bacteria",
    "url": "https://www.wikihow.com/Identify-Bacteria",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science",
        "Biology"
    ],
    "methods": [
        {
            "name": "Identifying Bacteria with Gram Staining",
            "steps": [
                {
                    "headline": "Use Gram staining to see if bacteria are Gram positive or Gram negative.",
                    "description": "Gram staining is a procedure that allows you to divide bacteria into 2 common types: Gram positive, and Gram negative. Gram positive bacteria have an extra thick cellular wall (made of a polymer called peptidoglycan) that holds a dye stain better than the thinner cell walls of Gram negative bacteria.Common Gram positive bacteria genera include Staphylococcus, Streptococcus, Micrococcus, and Listeria. Common Gram negative bacteria genera include Neisseria, Moraxella, Acinetobacter, Enterobacteriaceae, Haemophilus, Vibrio, Campylobacter, and Fusobacterium."
                },
                {
                    "headline": "Use safety precautions.",
                    "description": "The bacteria and chemicals that you will be handling during a Gram stain procedure are all potentially dangerous. Wear goggles, disposable nitrile gloves, and a lab coat while performing the stain. Put your disposable gloves and any other contaminated waste materials in a biohazard bag when you are done. Follow your lab's procedures for disposing of the biohazard bag."
                },
                {
                    "headline": "Make a slide of your bacterial sample.",
                    "description": "To begin the process, place a small drop or piece of your bacterial sample on a sterile slide. Pass the slide through the flame of a Bunsen burner 3 times to heat fix the sample. This will prevent the sample from washing away when you add reagents or rinse the slide."
                },
                {
                    "headline": "Add 5 drops of crystal violet to the slide.",
                    "description": "Place the drops of crystal violet dye on the heat-fixed culture. Let the sample soak in the crystal violet dye for 1 minute.To avoid staining your hand, you may wish to hold the slide in place with a clothes pin."
                },
                {
                    "headline": "Gently rinse the slide to remove the stain.",
                    "description": "Use a very gentle stream of water from a sink or squirt bottle. Don't rinse for more than 5 seconds. This process will remove any dye that is not bound to the sample."
                },
                {
                    "headline": "Add 5 drops of Gram's Iodine to the slide.",
                    "description": "Gram's Iodine is a solution of iodine, potassium iodide, and sodium bicarbonate. This solution will cause the crystal violet dye to become fused to the cell walls of the bacteria. Add about 5 drops, and let it sit for 1 minute."
                },
                {
                    "headline": "Rinse the sample with alcohol or acetone.",
                    "description": "Alcohol and acetone are decolorizing agents. If your bacteria are a Gram negative strain, these agents will remove the stain from the bacterial cell walls. Allow a few drops of the decolorizing agent to trickle over the sample, and let it sit for no more than 3 seconds. Gently rinse with water for no more than 5 seconds to remove the alcohol or acetone.If you let the decolorizing agent sit on the sample too long, it may strip the stain out of Gram positive bacteria, causing a false Gram negative result."
                },
                {
                    "headline": "Counterstain the solution with safranin.",
                    "description": "Safranin is a red dye, which will act as a counterstain to the crystal violet and dye any bacteria that did not hold the violet stain. Add about 5 drops of safranin solution to the sample, and let it sit for 1 minute. Rinse very gently with water for 5 seconds."
                },
                {
                    "headline": "View your sample under the microscope at 1000X magnification.",
                    "description": "If the bacteria are a Gram positive strain, they will appear purple or violet under the microscope. Gram negative bacteria will appear red from the safranin counterstain."
                }
            ]
        },
        {
            "name": "Using the Ziehl-Neelsen Stain Technique",
            "steps": [
                {
                    "headline": "Use Ziehl-Neelsen staining to detect acid-fast bacteria.",
                    "description": "Acid-fast bacteria contain a higher amount of lipid than other types of bacteria, making them resistant to the coloring agents used in Gram staining. Acid-fast bacteria belong to the genus Mycobacterium, which includes the bacterium that causes tuberculosis (M. tuberculosis). Acid-fast bacteria can be stained with a red carbol-fuchsin dye, which will resist being rinsed out with an acid alcohol or sulfuric acid solution."
                },
                {
                    "headline": "Take proper safety precautions.",
                    "description": "The chemicals and biological materials used during a Ziehl-Neelsen staining procedure can be hazardous. You will also be using heat sources, such as a Bunsen burner, spirit lamp, or electric slide heater. Take the following precautions while performing this procedure:Wear goggles, nitrile gloves, and a lab coat. Take care not to inhale any fumes from the staining and decolorizing solutions, or get them on your skin or in your eyes. Keep any open containers under a fume hood. Use great care when heating your slide, as many of the chemicals you will be using are flammable. There may also be traces of flammable chemicals on slide racks and other equipment."
                },
                {
                    "headline": "Prepare a slide.",
                    "description": "Spread a smear of your sample evenly over the center of a sterile slide, using circular motions. Your smear should be about 10 mm (0.4 inches) by 20 mm (0.8 inches)."
                },
                {
                    "headline": "Dry your slide.",
                    "description": "Place the slide on a drying rack smear-side up. Allow it to air dry for 30 minutes. Do not attempt to blot the slide dry."
                },
                {
                    "headline": "Heat fix your smear.",
                    "description": "You can heat fix the sample by passing the slide over the flame of a Bunsen burner 2-3 times, smear-side up. Alternatively, place the slide on an electric slide warmer at 65°-75° C (149°-167° F) for at least 2 hours. Take care not to scorch or boil the sample."
                },
                {
                    "headline": "Add carbol-fuchsin stain to your slide.",
                    "description": "Put several drops of carbol-fuchsin solution on the slide. Add enough to completely cover the smear."
                },
                {
                    "headline": "Heat the stained slide to fix the stain to the smear.",
                    "description": "Gently heat the slide over a Bunsen burner or spirit lamp, smear-side up, or place it on an electric slide heater. Heat the slide until it reaches 60° C (140° F). You should see vapor beginning to rise. Let the heated stain sit on the slide for 5 minutes.If you are using an electric slide warmer, set it to 60° C (140° F). If you are using a Bunsen burner or spirit lamp, you will need to watch carefully for the appearance of steam or vapor. To keep the slide at the desired temperature for a full 5 minutes, apply heat intermittently. Take care not to boil, scorch, or completely dry out your stained smear."
                },
                {
                    "headline": "Rinse the slide with cool water.",
                    "description": "Let the slide cool for about 5 minutes, then very gently rinse for a few seconds with clean water from a tap or squeeze bottle to remove any stain that is not bonded to the sample."
                },
                {
                    "headline": "Cover the smear with acid alcohol or sulfuric acid.",
                    "description": "Add enough 3% volume over volume (v/v) acid alcohol or 20% sulfuric acid to completely cover the smear. Leave the acid on the slide until the stain has faded to a very pale pink. This typically takes at least 10 minutes."
                },
                {
                    "headline": "Rinse the slide with clean water.",
                    "description": "Rinse gently with water from a tap or squeeze bottle, making sure to wash away all the acid and any remaining traces of dye."
                },
                {
                    "headline": "Add counterstain to the slide.",
                    "description": "Once the slide is rinsed, cover your stain with malachite green or Loeffler's methylene blue solution. These solutions create a green or blue “background” that helps the red-dyed bacteria stand out, and will also stain any other biological material on the slide (such as human cells and bacteria that are not acid-fast). Let the stain stand for 1-2 minutes."
                },
                {
                    "headline": "Rinse and dry the slide.",
                    "description": "Wash the slide gently with clean water to remove any excess counterstain. When you are done, wipe the back of the slide with a clean cloth and place the slide on a rack to air dry."
                },
                {
                    "headline": "Examine the slide under a microscope at 1000X magnification.",
                    "description": "Acid-fast bacteria should appear red or hot pink. Non-acid-fast bacteria, non-bacterial cells, and the background will appear blue or green."
                }
            ]
        },
        {
            "name": "Observing Bacterial Appearance and Behavior",
            "steps": [
                {
                    "headline": "Observe the shape of the bacteria.",
                    "description": "Once you have used staining to determine whether your bacteria are Gram positive, Gram negative, or acid-fast, it's time to narrow down the type of bacteria. The first step is to observe the shape(s) of the bacteria on the slide. The 3 most common shapes are coccus (spherical), bacillus (rod-shaped), and spiral.There are numerous variations on all of these shapes. For example, coccus bacteria may appear in various formations, such as fused pairs (diplococcus), chains, clusters, or groups of 4 (tetrads)."
                },
                {
                    "headline": "Determine if the bacteria are aerobic or anaerobic.",
                    "description": "Take 2 samples of the bacteria and create 2 separate cultures. 1 culture should be anaerobic (grown without oxygen) and the other should be aerobic (grown with oxygen). Store your anaerobic culture in an oxygen-free environment at 35° C (95° F) for at least 48 hours before you attempt to observe bacterial growth.If your bacteria grow in the oxygen-free environment, but not when exposed to oxygen, they are anaerobic. Bacteria that grow when exposed to oxygen, but not when kept in an oxygen-free environment, are aerobic. Bacteria that can grow in both environments are called facultative anaerobes."
                },
                {
                    "headline": "Do a motility test to find out if your bacteria are motile.",
                    "description": "Motile bacteria can move on their own by using 1 or more flagella to propel themselves around. Motility, or lack of motility, can be an important factor in identifying a strain of bacteria. There are several types of motility tests, but the semisolid medium test is the safest and easiest to read."
                },
                {
                    "headline": "Create a culture for your motility test.",
                    "description": "Prepare a culture of bacteria in a nutrient broth. Prepare the broth according to the directions for your preferred broth medium."
                },
                {
                    "headline": "Inoculate a tube of semisolid motility agar with your culture.",
                    "description": "Coat a sterile inoculating needle with some of the broth culture. Carefully stab the needle straight into a tube of semisolid agar formulated for motility testing (such as TTC agar). The needle should go about 2/3 of the way into the agar.When you are done, carefully withdraw the needle, taking care not to break the original “stab line.”\nIncubate the tube at 30° C (86° F) for 48 hours."
                },
                {
                    "headline": "Read the results of the motility test.",
                    "description": "Motility agar turns red when it comes into contact with bacteria. If your bacteria are motile, a red or pink color will be diffused throughout the agar. If they are non-motile, you will only see the red color along the original stab line."
                }
            ]
        },
        {
            "name": "Putting It All Together",
            "steps": [
                {
                    "headline": "Put your observations together.",
                    "description": "To narrow down the genus of bacteria, you will need to combine the information from your stains, cultures, and observations of bacterial shape. If you are testing a culture from a patient, information about their symptoms can also be useful for narrowing the field.For example, if your tests reveal that your bacteria are Gram negative, anaerobic, non-motile bacilli, and they are associated with abdominal pain, nausea, and vomiting in the patient, they are likely to be Bacteroides fragilis."
                },
                {
                    "headline": "Consult a database of bacteria.",
                    "description": "Since there are so many species of bacteria, it is impossible to remember or recognize all of them on your own. You will probably need to consult a clinical microbiology textbook or an online database and search for bacteria with all the characteristics of your sample. Good online resources for identifying bacteria include the Pathosystems Resource Integration Center (patricbrc.org) and the Pathogenic Bacteria database at GlobalRPh (globalrph.com/bacterial-strains.htm)."
                },
                {
                    "headline": "Use genetic testing to determine the exact species of bacteria.",
                    "description": "In some cases, it may be necessary to identify the exact species of bacteria. The fastest and most effective way to do this is with DNA testing. DNA testing is also helpful for identifying bacteria that resist traditional forms of culturing or staining. Modern microbial DNA testing can be done very quickly, sometimes in as little as 2 hours.If you do not have access to a lab that does microbial genome sequencing, send a sample to a specialist facility, such as MIDI Labs or CD Genomics."
                }
            ]
        }
    ],
    "tyn": [
        "Identifying Bacteria with Gram Staining",
        "Bacterial samples",
        "Safety goggles",
        "Nitrile gloves",
        "Lab coat",
        "Microscope slides",
        "Slide drying rack",
        "Bunsen burner",
        "Spirit lamp or electric slide heater",
        "Clothes pin",
        "Water bottle",
        "Gram crystal violet solution",
        "Gram iodine solution",
        "Ethanol or acetone solution",
        "Gram safranin solution",
        "Microscope capable of 1000X magnification",
        "Using the Ziehl-Neelsen Stain Technique",
        "Fume hood",
        "Carbol-fuchsin solution",
        "20% sulfuric acid or 3% v/v acid alcohol",
        "Malachite green or Loeffler's methylene blue solution",
        "Observing Bacterial Appearance and Behavior",
        "Aerobic and anaerobic bacterial cultures",
        "Nutrient broth medium",
        "Semisolid motility agar",
        "Inoculating needle"
    ],
    "text": " Identifying Bacteria with Gram Staining Use Gram staining to see if bacteria are Gram positive or Gram negative. Gram staining is a procedure that allows you to divide bacteria into 2 common types: Gram positive, and Gram negative. Gram positive bacteria have an extra thick cellular wall (made of a polymer called peptidoglycan) that holds a dye stain better than the thinner cell walls of Gram negative bacteria.Common Gram positive bacteria genera include Staphylococcus, Streptococcus, Micrococcus, and Listeria. Common Gram negative bacteria genera include Neisseria, Moraxella, Acinetobacter, Enterobacteriaceae, Haemophilus, Vibrio, Campylobacter, and Fusobacterium. Use safety precautions. The bacteria and chemicals that you will be handling during a Gram stain procedure are all potentially dangerous. Wear goggles, disposable nitrile gloves, and a lab coat while performing the stain. Put your disposable gloves and any other contaminated waste materials in a biohazard bag when you are done. Follow your lab's procedures for disposing of the biohazard bag. Make a slide of your bacterial sample. To begin the process, place a small drop or piece of your bacterial sample on a sterile slide. Pass the slide through the flame of a Bunsen burner 3 times to heat fix the sample. This will prevent the sample from washing away when you add reagents or rinse the slide. Add 5 drops of crystal violet to the slide. Place the drops of crystal violet dye on the heat-fixed culture. Let the sample soak in the crystal violet dye for 1 minute.To avoid staining your hand, you may wish to hold the slide in place with a clothes pin. Gently rinse the slide to remove the stain. Use a very gentle stream of water from a sink or squirt bottle. Don't rinse for more than 5 seconds. This process will remove any dye that is not bound to the sample. Add 5 drops of Gram's Iodine to the slide. Gram's Iodine is a solution of iodine, potassium iodide, and sodium bicarbonate. This solution will cause the crystal violet dye to become fused to the cell walls of the bacteria. Add about 5 drops, and let it sit for 1 minute. Rinse the sample with alcohol or acetone. Alcohol and acetone are decolorizing agents. If your bacteria are a Gram negative strain, these agents will remove the stain from the bacterial cell walls. Allow a few drops of the decolorizing agent to trickle over the sample, and let it sit for no more than 3 seconds. Gently rinse with water for no more than 5 seconds to remove the alcohol or acetone.If you let the decolorizing agent sit on the sample too long, it may strip the stain out of Gram positive bacteria, causing a false Gram negative result. Counterstain the solution with safranin. Safranin is a red dye, which will act as a counterstain to the crystal violet and dye any bacteria that did not hold the violet stain. Add about 5 drops of safranin solution to the sample, and let it sit for 1 minute. Rinse very gently with water for 5 seconds. View your sample under the microscope at 1000X magnification. If the bacteria are a Gram positive strain, they will appear purple or violet under the microscope. Gram negative bacteria will appear red from the safranin counterstain. Using the Ziehl-Neelsen Stain Technique Use Ziehl-Neelsen staining to detect acid-fast bacteria. Acid-fast bacteria contain a higher amount of lipid than other types of bacteria, making them resistant to the coloring agents used in Gram staining. Acid-fast bacteria belong to the genus Mycobacterium, which includes the bacterium that causes tuberculosis (M. tuberculosis). Acid-fast bacteria can be stained with a red carbol-fuchsin dye, which will resist being rinsed out with an acid alcohol or sulfuric acid solution. Take proper safety precautions. The chemicals and biological materials used during a Ziehl-Neelsen staining procedure can be hazardous. You will also be using heat sources, such as a Bunsen burner, spirit lamp, or electric slide heater. Take the following precautions while performing this procedure:Wear goggles, nitrile gloves, and a lab coat. Take care not to inhale any fumes from the staining and decolorizing solutions, or get them on your skin or in your eyes. Keep any open containers under a fume hood. Use great care when heating your slide, as many of the chemicals you will be using are flammable. There may also be traces of flammable chemicals on slide racks and other equipment. Prepare a slide. Spread a smear of your sample evenly over the center of a sterile slide, using circular motions. Your smear should be about 10 mm (0.4 inches) by 20 mm (0.8 inches). Dry your slide. Place the slide on a drying rack smear-side up. Allow it to air dry for 30 minutes. Do not attempt to blot the slide dry. Heat fix your smear. You can heat fix the sample by passing the slide over the flame of a Bunsen burner 2-3 times, smear-side up. Alternatively, place the slide on an electric slide warmer at 65°-75° C (149°-167° F) for at least 2 hours. Take care not to scorch or boil the sample. Add carbol-fuchsin stain to your slide. Put several drops of carbol-fuchsin solution on the slide. Add enough to completely cover the smear. Heat the stained slide to fix the stain to the smear. Gently heat the slide over a Bunsen burner or spirit lamp, smear-side up, or place it on an electric slide heater. Heat the slide until it reaches 60° C (140° F). You should see vapor beginning to rise. Let the heated stain sit on the slide for 5 minutes.If you are using an electric slide warmer, set it to 60° C (140° F). If you are using a Bunsen burner or spirit lamp, you will need to watch carefully for the appearance of steam or vapor. To keep the slide at the desired temperature for a full 5 minutes, apply heat intermittently. Take care not to boil, scorch, or completely dry out your stained smear. Rinse the slide with cool water. Let the slide cool for about 5 minutes, then very gently rinse for a few seconds with clean water from a tap or squeeze bottle to remove any stain that is not bonded to the sample. Cover the smear with acid alcohol or sulfuric acid. Add enough 3% volume over volume (v/v) acid alcohol or 20% sulfuric acid to completely cover the smear. Leave the acid on the slide until the stain has faded to a very pale pink. This typically takes at least 10 minutes. Rinse the slide with clean water. Rinse gently with water from a tap or squeeze bottle, making sure to wash away all the acid and any remaining traces of dye. Add counterstain to the slide. Once the slide is rinsed, cover your stain with malachite green or Loeffler's methylene blue solution. These solutions create a green or blue “background” that helps the red-dyed bacteria stand out, and will also stain any other biological material on the slide (such as human cells and bacteria that are not acid-fast). Let the stain stand for 1-2 minutes. Rinse and dry the slide. Wash the slide gently with clean water to remove any excess counterstain. When you are done, wipe the back of the slide with a clean cloth and place the slide on a rack to air dry. Examine the slide under a microscope at 1000X magnification. Acid-fast bacteria should appear red or hot pink. Non-acid-fast bacteria, non-bacterial cells, and the background will appear blue or green. Observing Bacterial Appearance and Behavior Observe the shape of the bacteria. Once you have used staining to determine whether your bacteria are Gram positive, Gram negative, or acid-fast, it's time to narrow down the type of bacteria. The first step is to observe the shape(s) of the bacteria on the slide. The 3 most common shapes are coccus (spherical), bacillus (rod-shaped), and spiral.There are numerous variations on all of these shapes. For example, coccus bacteria may appear in various formations, such as fused pairs (diplococcus), chains, clusters, or groups of 4 (tetrads). Determine if the bacteria are aerobic or anaerobic. Take 2 samples of the bacteria and create 2 separate cultures. 1 culture should be anaerobic (grown without oxygen) and the other should be aerobic (grown with oxygen). Store your anaerobic culture in an oxygen-free environment at 35° C (95° F) for at least 48 hours before you attempt to observe bacterial growth.If your bacteria grow in the oxygen-free environment, but not when exposed to oxygen, they are anaerobic. Bacteria that grow when exposed to oxygen, but not when kept in an oxygen-free environment, are aerobic. Bacteria that can grow in both environments are called facultative anaerobes. Do a motility test to find out if your bacteria are motile. Motile bacteria can move on their own by using 1 or more flagella to propel themselves around. Motility, or lack of motility, can be an important factor in identifying a strain of bacteria. There are several types of motility tests, but the semisolid medium test is the safest and easiest to read. Create a culture for your motility test. Prepare a culture of bacteria in a nutrient broth. Prepare the broth according to the directions for your preferred broth medium. Inoculate a tube of semisolid motility agar with your culture. Coat a sterile inoculating needle with some of the broth culture. Carefully stab the needle straight into a tube of semisolid agar formulated for motility testing (such as TTC agar). The needle should go about 2/3 of the way into the agar.When you are done, carefully withdraw the needle, taking care not to break the original “stab line.”\nIncubate the tube at 30° C (86° F) for 48 hours. Read the results of the motility test. Motility agar turns red when it comes into contact with bacteria. If your bacteria are motile, a red or pink color will be diffused throughout the agar. If they are non-motile, you will only see the red color along the original stab line. Putting It All Together Put your observations together. To narrow down the genus of bacteria, you will need to combine the information from your stains, cultures, and observations of bacterial shape. If you are testing a culture from a patient, information about their symptoms can also be useful for narrowing the field.For example, if your tests reveal that your bacteria are Gram negative, anaerobic, non-motile bacilli, and they are associated with abdominal pain, nausea, and vomiting in the patient, they are likely to be Bacteroides fragilis. Consult a database of bacteria. Since there are so many species of bacteria, it is impossible to remember or recognize all of them on your own. You will probably need to consult a clinical microbiology textbook or an online database and search for bacteria with all the characteristics of your sample. Good online resources for identifying bacteria include the Pathosystems Resource Integration Center (patricbrc.org) and the Pathogenic Bacteria database at GlobalRPh (globalrph.com/bacterial-strains.htm). Use genetic testing to determine the exact species of bacteria. In some cases, it may be necessary to identify the exact species of bacteria. The fastest and most effective way to do this is with DNA testing. DNA testing is also helpful for identifying bacteria that resist traditional forms of culturing or staining. Modern microbial DNA testing can be done very quickly, sometimes in as little as 2 hours.If you do not have access to a lab that does microbial genome sequencing, send a sample to a specialist facility, such as MIDI Labs or CD Genomics.",
    "sentences": [
        " Identifying Bacteria with Gram Staining Use Gram staining to see if bacteria are Gram positive or Gram negative.",
        "Gram staining is a procedure that allows you to divide bacteria into 2 common types: Gram positive, and Gram negative.",
        "Gram positive bacteria have an extra thick cellular wall (made of a polymer called peptidoglycan) that holds a dye stain better than the thinner cell walls of Gram negative bacteria.Common Gram positive bacteria genera include Staphylococcus, Streptococcus, Micrococcus, and Listeria.",
        "Common Gram negative bacteria genera include Neisseria, Moraxella, Acinetobacter, Enterobacteriaceae, Haemophilus, Vibrio, Campylobacter, and Fusobacterium.",
        "Use safety precautions.",
        "The bacteria and chemicals that you will be handling during a Gram stain procedure are all potentially dangerous.",
        "Wear goggles, disposable nitrile gloves, and a lab coat while performing the stain.",
        "Put your disposable gloves and any other contaminated waste materials in a biohazard bag when you are done.",
        "Follow your lab's procedures for disposing of the biohazard bag.",
        "Make a slide of your bacterial sample.",
        "To begin the process, place a small drop or piece of your bacterial sample on a sterile slide.",
        "Pass the slide through the flame of a Bunsen burner 3 times to heat fix the sample.",
        "This will prevent the sample from washing away when you add reagents or rinse the slide.",
        "Add 5 drops of crystal violet to the slide.",
        "Place the drops of crystal violet dye on the heat-fixed culture.",
        "Let the sample soak in the crystal violet dye for 1 minute.To avoid staining your hand, you may wish to hold the slide in place with a clothes pin.",
        "Gently rinse the slide to remove the stain.",
        "Use a very gentle stream of water from a sink or squirt bottle.",
        "Don't rinse for more than 5 seconds.",
        "This process will remove any dye that is not bound to the sample.",
        "Add 5 drops of Gram's Iodine to the slide.",
        "Gram's Iodine is a solution of iodine, potassium iodide, and sodium bicarbonate.",
        "This solution will cause the crystal violet dye to become fused to the cell walls of the bacteria.",
        "Add about 5 drops, and let it sit for 1 minute.",
        "Rinse the sample with alcohol or acetone.",
        "Alcohol and acetone are decolorizing agents.",
        "If your bacteria are a Gram negative strain, these agents will remove the stain from the bacterial cell walls.",
        "Allow a few drops of the decolorizing agent to trickle over the sample, and let it sit for no more than 3 seconds.",
        "Gently rinse with water for no more than 5 seconds to remove the alcohol or acetone.If you let the decolorizing agent sit on the sample too long, it may strip the stain out of Gram positive bacteria, causing a false Gram negative result.",
        "Counterstain the solution with safranin.",
        "Safranin is a red dye, which will act as a counterstain to the crystal violet and dye any bacteria that did not hold the violet stain.",
        "Add about 5 drops of safranin solution to the sample, and let it sit for 1 minute.",
        "Rinse very gently with water for 5 seconds.",
        "View your sample under the microscope at 1000X magnification.",
        "If the bacteria are a Gram positive strain, they will appear purple or violet under the microscope.",
        "Gram negative bacteria will appear red from the safranin counterstain.",
        "Using the Ziehl-Neelsen Stain Technique Use Ziehl-Neelsen staining to detect acid-fast bacteria.",
        "Acid-fast bacteria contain a higher amount of lipid than other types of bacteria, making them resistant to the coloring agents used in Gram staining.",
        "Acid-fast bacteria belong to the genus Mycobacterium, which includes the bacterium that causes tuberculosis (M. tuberculosis).",
        "Acid-fast bacteria can be stained with a red carbol-fuchsin dye, which will resist being rinsed out with an acid alcohol or sulfuric acid solution.",
        "Take proper safety precautions.",
        "The chemicals and biological materials used during a Ziehl-Neelsen staining procedure can be hazardous.",
        "You will also be using heat sources, such as a Bunsen burner, spirit lamp, or electric slide heater.",
        "Take the following precautions while performing this procedure:Wear goggles, nitrile gloves, and a lab coat.",
        "Take care not to inhale any fumes from the staining and decolorizing solutions, or get them on your skin or in your eyes.",
        "Keep any open containers under a fume hood.",
        "Use great care when heating your slide, as many of the chemicals you will be using are flammable.",
        "There may also be traces of flammable chemicals on slide racks and other equipment.",
        "Prepare a slide.",
        "Spread a smear of your sample evenly over the center of a sterile slide, using circular motions.",
        "Your smear should be about 10 mm (0.4 inches) by 20 mm (0.8 inches).",
        "Dry your slide.",
        "Place the slide on a drying rack smear-side up.",
        "Allow it to air dry for 30 minutes.",
        "Do not attempt to blot the slide dry.",
        "Heat fix your smear.",
        "You can heat fix the sample by passing the slide over the flame of a Bunsen burner 2-3 times, smear-side up.",
        "Alternatively, place the slide on an electric slide warmer at 65°-75° C (149°-167° F) for at least 2 hours.",
        "Take care not to scorch or boil the sample.",
        "Add carbol-fuchsin stain to your slide.",
        "Put several drops of carbol-fuchsin solution on the slide.",
        "Add enough to completely cover the smear.",
        "Heat the stained slide to fix the stain to the smear.",
        "Gently heat the slide over a Bunsen burner or spirit lamp, smear-side up, or place it on an electric slide heater.",
        "Heat the slide until it reaches 60° C (140° F).",
        "You should see vapor beginning to rise.",
        "Let the heated stain sit on the slide for 5 minutes.If you are using an electric slide warmer, set it to 60° C (140° F).",
        "If you are using a Bunsen burner or spirit lamp, you will need to watch carefully for the appearance of steam or vapor.",
        "To keep the slide at the desired temperature for a full 5 minutes, apply heat intermittently.",
        "Take care not to boil, scorch, or completely dry out your stained smear.",
        "Rinse the slide with cool water.",
        "Let the slide cool for about 5 minutes, then very gently rinse for a few seconds with clean water from a tap or squeeze bottle to remove any stain that is not bonded to the sample.",
        "Cover the smear with acid alcohol or sulfuric acid.",
        "Add enough 3% volume over volume (v/v) acid alcohol or 20% sulfuric acid to completely cover the smear.",
        "Leave the acid on the slide until the stain has faded to a very pale pink.",
        "This typically takes at least 10 minutes.",
        "Rinse the slide with clean water.",
        "Rinse gently with water from a tap or squeeze bottle, making sure to wash away all the acid and any remaining traces of dye.",
        "Add counterstain to the slide.",
        "Once the slide is rinsed, cover your stain with malachite green or Loeffler's methylene blue solution.",
        "These solutions create a green or blue “background” that helps the red-dyed bacteria stand out, and will also stain any other biological material on the slide (such as human cells and bacteria that are not acid-fast).",
        "Let the stain stand for 1-2 minutes.",
        "Rinse and dry the slide.",
        "Wash the slide gently with clean water to remove any excess counterstain.",
        "When you are done, wipe the back of the slide with a clean cloth and place the slide on a rack to air dry.",
        "Examine the slide under a microscope at 1000X magnification.",
        "Acid-fast bacteria should appear red or hot pink.",
        "Non-acid-fast bacteria, non-bacterial cells, and the background will appear blue or green.",
        "Observing Bacterial Appearance and Behavior Observe the shape of the bacteria.",
        "Once you have used staining to determine whether your bacteria are Gram positive, Gram negative, or acid-fast, it's time to narrow down the type of bacteria.",
        "The first step is to observe the shape(s) of the bacteria on the slide.",
        "The 3 most common shapes are coccus (spherical), bacillus (rod-shaped), and spiral.There are numerous variations on all of these shapes.",
        "For example, coccus bacteria may appear in various formations, such as fused pairs (diplococcus), chains, clusters, or groups of 4 (tetrads).",
        "Determine if the bacteria are aerobic or anaerobic.",
        "Take 2 samples of the bacteria and create 2 separate cultures.",
        "1 culture should be anaerobic (grown without oxygen) and the other should be aerobic (grown with oxygen).",
        "Store your anaerobic culture in an oxygen-free environment at 35° C (95° F) for at least 48 hours before you attempt to observe bacterial growth.If your bacteria grow in the oxygen-free environment, but not when exposed to oxygen, they are anaerobic.",
        "Bacteria that grow when exposed to oxygen, but not when kept in an oxygen-free environment, are aerobic.",
        "Bacteria that can grow in both environments are called facultative anaerobes.",
        "Do a motility test to find out if your bacteria are motile.",
        "Motile bacteria can move on their own by using 1 or more flagella to propel themselves around.",
        "Motility, or lack of motility, can be an important factor in identifying a strain of bacteria.",
        "There are several types of motility tests, but the semisolid medium test is the safest and easiest to read.",
        "Create a culture for your motility test.",
        "Prepare a culture of bacteria in a nutrient broth.",
        "Prepare the broth according to the directions for your preferred broth medium.",
        "Inoculate a tube of semisolid motility agar with your culture.",
        "Coat a sterile inoculating needle with some of the broth culture.",
        "Carefully stab the needle straight into a tube of semisolid agar formulated for motility testing (such as TTC agar).",
        "The needle should go about 2/3 of the way into the agar.When you are done, carefully withdraw the needle, taking care not to break the original “stab line.”\nIncubate the tube at 30° C (86° F) for 48 hours.",
        "Read the results of the motility test.",
        "Motility agar turns red when it comes into contact with bacteria.",
        "If your bacteria are motile, a red or pink color will be diffused throughout the agar.",
        "If they are non-motile, you will only see the red color along the original stab line.",
        "Putting It All Together Put your observations together.",
        "To narrow down the genus of bacteria, you will need to combine the information from your stains, cultures, and observations of bacterial shape.",
        "If you are testing a culture from a patient, information about their symptoms can also be useful for narrowing the field.For example, if your tests reveal that your bacteria are Gram negative, anaerobic, non-motile bacilli, and they are associated with abdominal pain, nausea, and vomiting in the patient, they are likely to be Bacteroides fragilis.",
        "Consult a database of bacteria.",
        "Since there are so many species of bacteria, it is impossible to remember or recognize all of them on your own.",
        "You will probably need to consult a clinical microbiology textbook or an online database and search for bacteria with all the characteristics of your sample.",
        "Good online resources for identifying bacteria include the Pathosystems Resource Integration Center (patricbrc.org) and the Pathogenic Bacteria database at GlobalRPh (globalrph.com/bacterial-strains.htm).",
        "Use genetic testing to determine the exact species of bacteria.",
        "In some cases, it may be necessary to identify the exact species of bacteria.",
        "The fastest and most effective way to do this is with DNA testing.",
        "DNA testing is also helpful for identifying bacteria that resist traditional forms of culturing or staining.",
        "Modern microbial DNA testing can be done very quickly, sometimes in as little as 2 hours.If you do not have access to a lab that does microbial genome sequencing, send a sample to a specialist facility, such as MIDI Labs or CD Genomics."
    ]
}