{
    "title": "How to Replace a Zipper Pull",
    "url": "https://www.wikihow.com/Replace-a-Zipper-Pull",
    "category_hierarchy": [
        "Home and Garden",
        "Tools",
        "Fastening Tools"
    ],
    "methods": [
        {
            "name": "Replacing a Pull Tab",
            "steps": [
                {
                    "headline": "Buy a replacement zipper pull tab.",
                    "description": "You can find these online and in fabric stores. Some well-stocked craft stores may also carry them. They come in all sorts of shapes and sizes, so buy a zipper pull tab that is proportionate to your zipper slider. If you have a large, heavy duty zipper, you should buy a large pull tab. If you have a smaller garment zipper, like what you would find on a dress, buy a small pull tab instead. You can also salvage a replacement pull tab from another zipper. If you don't know what size to get, bring the original pull tab or zipper into the store with you."
                },
                {
                    "headline": "Pry off the loop on top of the slider, if needed.",
                    "description": "If the loop is closed from end-to-end, you will need to pry it off. Grab the loop by the base with a pair of pliers or metal snips, then pull the loop off. Be aware that this may damage some zipper sliders. Skip this step if the loop is open, like a hook. You may be able to fit the pull tab under the slit."
                },
                {
                    "headline": "Remove the old zipper pull tab, if needed.",
                    "description": "If you pulled the top part of the slider off, there is nothing holding the old pull tab in place. Simply lift it off of the zipper. If your zipper slider has a hook-type loop instead, grab the old zipper pull tab and wriggle it out. You made have to lift it up so that it is perpendicular to the zipper slider first. If you still can't get the old pull tab out of the hook-type loop, pry the hook open with a flat-head screw driver. You may have to use a pair of pliers to grab and twist broken pull tabs."
                },
                {
                    "headline": "Insert the replacement pull tab.",
                    "description": "After you have removed the loop, you'll notice 2 stubs on each side of the zipper slider; the loop was attached to these stubs. Position your replacement pull tab on top of the zipper slider. Make sure that one of the stubs is inside the loop at the top of the zipper pull tab. If you have a hook-type loop, slide the replacement pull tab under the slit. If the slit is too small, pry it open a little with a flat-head screwdriver."
                },
                {
                    "headline": "Replace the loop and snap it shut.",
                    "description": "Place the loop back on top of the zipper slider, making sure to fit the teeth into the grooves. Press down on it with your finger. If you need to, use a block or the end of a marker to press it down. If you are working with a hook-type loop, you are set. If you are worried about the pull tab falling out, you can clamp the loop shut with pliers."
                }
            ]
        },
        {
            "name": "Using Makeshift Pull Tabs",
            "steps": [
                {
                    "headline": "Take the old zipper pull tab out, if needed.",
                    "description": "If your zipper slider's loop is shaped like a hook, you may be able to simply wriggle the old pull tab out. If you can't, pry the hook open a little with a flat-head screw driver. Pinch the hook shut with pliers once you have the pull tab out. If your zipper slider's loop is solid and has no gap in it, click here to learn how to remove it."
                },
                {
                    "headline": "Move the locking mechanism out of the way, if needed.",
                    "description": "Some types of zippers have a locking mechanism. You can see this mechanism if you look closely at the zipper from the side, then move it up and down. You'll notice a lock moving up and down inside the loop that the zipper pull was attached to. The locking mechanism needs to be out of the loop. If you can see the lock inside the loop, then move the zipper slider slowly until the loop is clear."
                },
                {
                    "headline": "Slip a paper clip through the loop for a temporary option.",
                    "description": "Find the end on the outside of your paper clip. Feed it through the loop on your zipper. Rotate the paper clip so that both of the U-shaped loops are facing away from the zipper. A metal paper clip will work fine for this. You can also use a colored paper clip if you want the pull tab to match the zipper slider."
                },
                {
                    "headline": "Thread a key ring onto the zipper slider for a sturdier option.",
                    "description": "Find a small key ring that is less than 1 inch (2.5 cm) in diameter. Pry open the end with your fingernail, a flat-head screwdriver, or a knife. Slide the end of the key ring into the loop. Feed the key ring through the loop until it is completely attached and closes by itself. A key ring is a great option for jean zippers that won't stay shut. Zipper up your jeans, slide the key ring over the button, then close the button. Avoid using key rings that are too large, or they will look clunky."
                },
                {
                    "headline": "Use a thin cord if you need something quick and easy.",
                    "description": "Find some cord that is thick enough to fit through the loop on your zipper pull. Cut a short piece, then feed it through the loop. Tie the ends of the cord into an overhand knot, about ⁄2 to 1 inch (1.3 to 2.5 cm) away from the loop. Cut the rest of the string off. If you are using nylon cording, you can melt the cut ends with a lighter or a candle flame for a smoother finish. Match the color of the cording to the zipper, if possible."
                },
                {
                    "headline": "Use a thin ribbon if you want a nicer touch.",
                    "description": "Choose satin or grosgrain ribbon thin enough to fit through the loop on your zipper pull. Cut it down to 2 to 3 inches (5.1 to 7.6 cm), then feed it through the loop. Match up the ends of the ribbon to make sure that it is centered, then finish it in 1 of the following ways:\nTie the ends together in an overhand knot to make a loop. Sew across the ends 2 to 3 times using a zigzag stitch to create a loop. Use hot glue or fabric glue to glue both ribbon halves together to form a single strip."
                },
                {
                    "headline": "Twist a wire through the loop for something more like a pull tab.",
                    "description": "Cut a short piece of wire. Slip it through the loop on the zipper, then twist the ends together to form a stem. Leave some space between the twisted part and the loop so that you can move the pull tab up and down. Trim the excess wire off with wire cutters so that it is between ⁄2 and 1 inch (1.3 and 2.5 cm) long. You can use pipe cleaners, unfolded paper clips, or even twist ties from garbage bags. If you want the pull tab to match the zipper slider, use a colored paper clip instead."
                },
                {
                    "headline": "Use heavy-duty jump rings to attach charms if you want a fancy pull tab.",
                    "description": "Use a pair of pliers to open a heavy-duty jump ring. Slide 1 end of the jump ring through the loop on your charm. Slide the other end of the jump ring through the loop on the zipper slider. Use the pliers again to close the jump ring. Choose a jump ring that is between ⁄4 and ⁄2 inch (0.64 and 1.27 cm) wide, and made from thick wire. Use a charm that is easy to hold between your thumb and index finger. Hold each side of the jump ring with a pair of pliers. Pull the ends past each other to open the jump ring, and towards each other to close it, just like a door. Do not pull the ends of the jump ring away from each other like sliding open a drawer. This will distort the shape of the jump ring."
                }
            ]
        }
    ],
    "tyn": [
        "Replacing a Pull Tab",
        "Pliers",
        "Flat-head screw driver (optional)",
        "Replacement pull tab",
        "Using Makeshift Pull Tabs",
        "Paperclip",
        "Key ring",
        "Thin cord",
        "Ribbon",
        "Wire",
        "Jump ring and charm"
    ],
    "text": " Replacing a Pull Tab Buy a replacement zipper pull tab. You can find these online and in fabric stores. Some well-stocked craft stores may also carry them. They come in all sorts of shapes and sizes, so buy a zipper pull tab that is proportionate to your zipper slider. If you have a large, heavy duty zipper, you should buy a large pull tab. If you have a smaller garment zipper, like what you would find on a dress, buy a small pull tab instead. You can also salvage a replacement pull tab from another zipper. If you don't know what size to get, bring the original pull tab or zipper into the store with you. Pry off the loop on top of the slider, if needed. If the loop is closed from end-to-end, you will need to pry it off. Grab the loop by the base with a pair of pliers or metal snips, then pull the loop off. Be aware that this may damage some zipper sliders. Skip this step if the loop is open, like a hook. You may be able to fit the pull tab under the slit. Remove the old zipper pull tab, if needed. If you pulled the top part of the slider off, there is nothing holding the old pull tab in place. Simply lift it off of the zipper. If your zipper slider has a hook-type loop instead, grab the old zipper pull tab and wriggle it out. You made have to lift it up so that it is perpendicular to the zipper slider first. If you still can't get the old pull tab out of the hook-type loop, pry the hook open with a flat-head screw driver. You may have to use a pair of pliers to grab and twist broken pull tabs. Insert the replacement pull tab. After you have removed the loop, you'll notice 2 stubs on each side of the zipper slider; the loop was attached to these stubs. Position your replacement pull tab on top of the zipper slider. Make sure that one of the stubs is inside the loop at the top of the zipper pull tab. If you have a hook-type loop, slide the replacement pull tab under the slit. If the slit is too small, pry it open a little with a flat-head screwdriver. Replace the loop and snap it shut. Place the loop back on top of the zipper slider, making sure to fit the teeth into the grooves. Press down on it with your finger. If you need to, use a block or the end of a marker to press it down. If you are working with a hook-type loop, you are set. If you are worried about the pull tab falling out, you can clamp the loop shut with pliers. Using Makeshift Pull Tabs Take the old zipper pull tab out, if needed. If your zipper slider's loop is shaped like a hook, you may be able to simply wriggle the old pull tab out. If you can't, pry the hook open a little with a flat-head screw driver. Pinch the hook shut with pliers once you have the pull tab out. If your zipper slider's loop is solid and has no gap in it, click here to learn how to remove it. Move the locking mechanism out of the way, if needed. Some types of zippers have a locking mechanism. You can see this mechanism if you look closely at the zipper from the side, then move it up and down. You'll notice a lock moving up and down inside the loop that the zipper pull was attached to. The locking mechanism needs to be out of the loop. If you can see the lock inside the loop, then move the zipper slider slowly until the loop is clear. Slip a paper clip through the loop for a temporary option. Find the end on the outside of your paper clip. Feed it through the loop on your zipper. Rotate the paper clip so that both of the U-shaped loops are facing away from the zipper. A metal paper clip will work fine for this. You can also use a colored paper clip if you want the pull tab to match the zipper slider. Thread a key ring onto the zipper slider for a sturdier option. Find a small key ring that is less than 1 inch (2.5 cm) in diameter. Pry open the end with your fingernail, a flat-head screwdriver, or a knife. Slide the end of the key ring into the loop. Feed the key ring through the loop until it is completely attached and closes by itself. A key ring is a great option for jean zippers that won't stay shut. Zipper up your jeans, slide the key ring over the button, then close the button. Avoid using key rings that are too large, or they will look clunky. Use a thin cord if you need something quick and easy. Find some cord that is thick enough to fit through the loop on your zipper pull. Cut a short piece, then feed it through the loop. Tie the ends of the cord into an overhand knot, about ⁄2 to 1 inch (1.3 to 2.5 cm) away from the loop. Cut the rest of the string off. If you are using nylon cording, you can melt the cut ends with a lighter or a candle flame for a smoother finish. Match the color of the cording to the zipper, if possible. Use a thin ribbon if you want a nicer touch. Choose satin or grosgrain ribbon thin enough to fit through the loop on your zipper pull. Cut it down to 2 to 3 inches (5.1 to 7.6 cm), then feed it through the loop. Match up the ends of the ribbon to make sure that it is centered, then finish it in 1 of the following ways:\nTie the ends together in an overhand knot to make a loop. Sew across the ends 2 to 3 times using a zigzag stitch to create a loop. Use hot glue or fabric glue to glue both ribbon halves together to form a single strip. Twist a wire through the loop for something more like a pull tab. Cut a short piece of wire. Slip it through the loop on the zipper, then twist the ends together to form a stem. Leave some space between the twisted part and the loop so that you can move the pull tab up and down. Trim the excess wire off with wire cutters so that it is between ⁄2 and 1 inch (1.3 and 2.5 cm) long. You can use pipe cleaners, unfolded paper clips, or even twist ties from garbage bags. If you want the pull tab to match the zipper slider, use a colored paper clip instead. Use heavy-duty jump rings to attach charms if you want a fancy pull tab. Use a pair of pliers to open a heavy-duty jump ring. Slide 1 end of the jump ring through the loop on your charm. Slide the other end of the jump ring through the loop on the zipper slider. Use the pliers again to close the jump ring. Choose a jump ring that is between ⁄4 and ⁄2 inch (0.64 and 1.27 cm) wide, and made from thick wire. Use a charm that is easy to hold between your thumb and index finger. Hold each side of the jump ring with a pair of pliers. Pull the ends past each other to open the jump ring, and towards each other to close it, just like a door. Do not pull the ends of the jump ring away from each other like sliding open a drawer. This will distort the shape of the jump ring.",
    "sentences": [
        " Replacing a Pull Tab Buy a replacement zipper pull tab.",
        "You can find these online and in fabric stores.",
        "Some well-stocked craft stores may also carry them.",
        "They come in all sorts of shapes and sizes, so buy a zipper pull tab that is proportionate to your zipper slider.",
        "If you have a large, heavy duty zipper, you should buy a large pull tab.",
        "If you have a smaller garment zipper, like what you would find on a dress, buy a small pull tab instead.",
        "You can also salvage a replacement pull tab from another zipper.",
        "If you don't know what size to get, bring the original pull tab or zipper into the store with you.",
        "Pry off the loop on top of the slider, if needed.",
        "If the loop is closed from end-to-end, you will need to pry it off.",
        "Grab the loop by the base with a pair of pliers or metal snips, then pull the loop off.",
        "Be aware that this may damage some zipper sliders.",
        "Skip this step if the loop is open, like a hook.",
        "You may be able to fit the pull tab under the slit.",
        "Remove the old zipper pull tab, if needed.",
        "If you pulled the top part of the slider off, there is nothing holding the old pull tab in place.",
        "Simply lift it off of the zipper.",
        "If your zipper slider has a hook-type loop instead, grab the old zipper pull tab and wriggle it out.",
        "You made have to lift it up so that it is perpendicular to the zipper slider first.",
        "If you still can't get the old pull tab out of the hook-type loop, pry the hook open with a flat-head screw driver.",
        "You may have to use a pair of pliers to grab and twist broken pull tabs.",
        "Insert the replacement pull tab.",
        "After you have removed the loop, you'll notice 2 stubs on each side of the zipper slider; the loop was attached to these stubs.",
        "Position your replacement pull tab on top of the zipper slider.",
        "Make sure that one of the stubs is inside the loop at the top of the zipper pull tab.",
        "If you have a hook-type loop, slide the replacement pull tab under the slit.",
        "If the slit is too small, pry it open a little with a flat-head screwdriver.",
        "Replace the loop and snap it shut.",
        "Place the loop back on top of the zipper slider, making sure to fit the teeth into the grooves.",
        "Press down on it with your finger.",
        "If you need to, use a block or the end of a marker to press it down.",
        "If you are working with a hook-type loop, you are set.",
        "If you are worried about the pull tab falling out, you can clamp the loop shut with pliers.",
        "Using Makeshift Pull Tabs Take the old zipper pull tab out, if needed.",
        "If your zipper slider's loop is shaped like a hook, you may be able to simply wriggle the old pull tab out.",
        "If you can't, pry the hook open a little with a flat-head screw driver.",
        "Pinch the hook shut with pliers once you have the pull tab out.",
        "If your zipper slider's loop is solid and has no gap in it, click here to learn how to remove it.",
        "Move the locking mechanism out of the way, if needed.",
        "Some types of zippers have a locking mechanism.",
        "You can see this mechanism if you look closely at the zipper from the side, then move it up and down.",
        "You'll notice a lock moving up and down inside the loop that the zipper pull was attached to.",
        "The locking mechanism needs to be out of the loop.",
        "If you can see the lock inside the loop, then move the zipper slider slowly until the loop is clear.",
        "Slip a paper clip through the loop for a temporary option.",
        "Find the end on the outside of your paper clip.",
        "Feed it through the loop on your zipper.",
        "Rotate the paper clip so that both of the U-shaped loops are facing away from the zipper.",
        "A metal paper clip will work fine for this.",
        "You can also use a colored paper clip if you want the pull tab to match the zipper slider.",
        "Thread a key ring onto the zipper slider for a sturdier option.",
        "Find a small key ring that is less than 1 inch (2.5 cm) in diameter.",
        "Pry open the end with your fingernail, a flat-head screwdriver, or a knife.",
        "Slide the end of the key ring into the loop.",
        "Feed the key ring through the loop until it is completely attached and closes by itself.",
        "A key ring is a great option for jean zippers that won't stay shut.",
        "Zipper up your jeans, slide the key ring over the button, then close the button.",
        "Avoid using key rings that are too large, or they will look clunky.",
        "Use a thin cord if you need something quick and easy.",
        "Find some cord that is thick enough to fit through the loop on your zipper pull.",
        "Cut a short piece, then feed it through the loop.",
        "Tie the ends of the cord into an overhand knot, about ⁄2 to 1 inch (1.3 to 2.5 cm) away from the loop.",
        "Cut the rest of the string off.",
        "If you are using nylon cording, you can melt the cut ends with a lighter or a candle flame for a smoother finish.",
        "Match the color of the cording to the zipper, if possible.",
        "Use a thin ribbon if you want a nicer touch.",
        "Choose satin or grosgrain ribbon thin enough to fit through the loop on your zipper pull.",
        "Cut it down to 2 to 3 inches (5.1 to 7.6 cm), then feed it through the loop.",
        "Match up the ends of the ribbon to make sure that it is centered, then finish it in 1 of the following ways:\nTie the ends together in an overhand knot to make a loop.",
        "Sew across the ends 2 to 3 times using a zigzag stitch to create a loop.",
        "Use hot glue or fabric glue to glue both ribbon halves together to form a single strip.",
        "Twist a wire through the loop for something more like a pull tab.",
        "Cut a short piece of wire.",
        "Slip it through the loop on the zipper, then twist the ends together to form a stem.",
        "Leave some space between the twisted part and the loop so that you can move the pull tab up and down.",
        "Trim the excess wire off with wire cutters so that it is between ⁄2 and 1 inch (1.3 and 2.5 cm) long.",
        "You can use pipe cleaners, unfolded paper clips, or even twist ties from garbage bags.",
        "If you want the pull tab to match the zipper slider, use a colored paper clip instead.",
        "Use heavy-duty jump rings to attach charms if you want a fancy pull tab.",
        "Use a pair of pliers to open a heavy-duty jump ring.",
        "Slide 1 end of the jump ring through the loop on your charm.",
        "Slide the other end of the jump ring through the loop on the zipper slider.",
        "Use the pliers again to close the jump ring.",
        "Choose a jump ring that is between ⁄4 and ⁄2 inch (0.64 and 1.27 cm) wide, and made from thick wire.",
        "Use a charm that is easy to hold between your thumb and index finger.",
        "Hold each side of the jump ring with a pair of pliers.",
        "Pull the ends past each other to open the jump ring, and towards each other to close it, just like a door.",
        "Do not pull the ends of the jump ring away from each other like sliding open a drawer.",
        "This will distort the shape of the jump ring."
    ]
}