{
    "title": "How to Sew Velcro by Hand",
    "url": "https://www.wikihow.com/Sew-Velcro-by-Hand",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Sewing"
    ],
    "parts": [
        {
            "name": "Choosing the Right Supplies",
            "steps": [
                {
                    "headline": "Find out what type of Velcro your project needs.",
                    "description": "If you are following a pattern, read the pattern's supply list to find out what color and width of Velcro you should buy. If you are not following a pattern, then use your best judgement in terms of size and color. The smaller the garment, the thinner the Velcro should be. A doll's dress might use 1⁄4-in (0.64-cm) Velcro, but a backpack might use 1-in (2.5-cm) Velcro. Match the color of the Velcro to the color of the fabric when possible. If you can't find the matching color, use white Velcro for light colored fabric and black for dark."
                },
                {
                    "headline": "Buy good-quality, non-adhesive Velcro.",
                    "description": "Adhesive Velcro may seem convenient, but the adhesive is not strong enough to be permanent. It can also gum up your needle and thread, and make sewing difficult. Unless your project specifies round Velcro dots (which are usually self-adhesive), stick with the regular, non-adhesive Velcro. Remember, you can always cut Velcro into squares or rectangles. For best results, choose Velcro that has a soft, flexible strip. It will be easier to sew than stiff, heavy-duty Velcro. Try to get Velcro that has seams on each side. This will make it easier to sew the Velcro on."
                },
                {
                    "headline": "Choose polyester thread that matches the color of the Velcro.",
                    "description": "When possible, match the thread color to the Velcro color. If the stitching will be visible from the front of the fabric, however, match the thread to the fabric instead. Polyester thread is the best choice because it is strong and durable."
                },
                {
                    "headline": "Get a sharp, thick needle.",
                    "description": "Avoid needles that are too thin, as they are more likely to snap or break as you are pulling them through the Velcro. For best results, use a general/universal needle in size 14 or 16 (90 or 100 in Europe). It would be a good idea to pick up a thimble as well; this will make it easier on your finger when pushing the needle through the Velcro."
                }
            ]
        },
        {
            "name": "Cutting and Positioning the Velcro",
            "steps": [
                {
                    "headline": "Cut the Velcro down to the right length.",
                    "description": "Cut the scratchy hook piece first, then use it as a guide for cutting the fuzzy loop piece. Slide the blade of your scissors through the hooks/loops on the Velcro so that you don't accidentally cut through them. If the pieces are stuck together, pull them apart. Do not cut through both pieces at the same time, or you may end up cutting through the hooks and loops. If you don't have a pattern, use your best judgement. A 1-in (2.5-cm) square would work great for a purse, but a longer strip would work better for a jacket."
                },
                {
                    "headline": "Cut the corners on the side seams of each Velcro strip.",
                    "description": "If you look closely at a strip of Velcro, you'll notice that the hooks and loops don't extend to the side edges; there is a slight seam on each side. Cut the corners off of these seams so that they are angled instead of straight. This will give your Velcro a nicer finish and prevent it from poking your skin. If your Velcro doesn't have any side seams, use a pair of small, pointed scissors to trim the hooks and loops down on each side to create seams."
                },
                {
                    "headline": "Position the Velcro so that the hook side faces away from your skin.",
                    "description": "Velcro is positioned between 2 overlapping pieces of fabric. Place the soft Velcro on the underside of the upper fabric piece. Place the scratchy Velcro on top of the lower fabric piece. This way, the scratchy Velcro will be facing away from your skin. Avoid placing the Velcro right against the edge of the fabric, otherwise the tape may scratch your skin."
                },
                {
                    "headline": "Pin the Velcro to your project.",
                    "description": "A single sewing pin through the middle of the strip should be enough for most pieces of Velcro. If you are sewing a very long strip of Velcro, like on a jacket, then you may want to add a sewing pin every couple of inches/centimeters. If you can't push the pins through the Velcro without bending them, use strips of masking tape instead. If this is a non-garment project, it does not matter which side of Velcro you use for each piece."
                },
                {
                    "headline": "Coat the needle with beeswax or a needle lubricant, if desired.",
                    "description": "While not necessary, this will make it easier for the needle to pass through the Velcro. Simply run the needle over a block of beeswax or needle lubricant. You can find both in the sewing or beading section of a craft store. Fabric stores may also carry them."
                }
            ]
        },
        {
            "name": "Sewing the Velcro",
            "steps": [
                {
                    "headline": "Thread the needle and knot the ends of the thread together.",
                    "description": "Cut an 18- to 20-in (46- to 51-cm) piece of thread. Push it through the eye of your needle, then bring the ends together. Treating the ends as a single strand, roll them into a small loop, then pass the end of the thread through that loop. Pull on the ends to tighten the knot. Cut your thread at an angle. This will give it a sharp point and make it easier to push through the eye of your needle! Pull the thread through a block of beeswax (after threading the needle) to make it stronger, if desired. It is better to work with shorter pieces of thread than longer ones; they are less-likely to tangle and break."
                },
                {
                    "headline": "Push the needle through the back of the Velcro to anchor the knot.",
                    "description": "Place the needle behind the strip of Velcro. Push it until it comes out the front, then pull on the thread until the knot touches the back of the Velcro. This will anchor the knot as well as conceal it from view. You can start sewing the Velcro wherever you want. Some people find it easier to start at a corner while others prefer starting along a side edge. Use a thimble on the finger that is pushing the needle. The end of a needle can be sharp."
                },
                {
                    "headline": "Sew around the Velcro using a straight stitch.",
                    "description": "A straight stitch is where you weave the needle up and down through the fabric. Use the smallest stitches you can manage, and sew as close to the edge of the Velcro as you can. If you sew too close to the hooks or loops, you risk the thread snagging. If you used masking tape instead of sewing pins, move the tape aside as you sew. If your Velcro does not have side seams, and if you did not cut any in, pull on each strand of thread to even out the tension."
                },
                {
                    "headline": "Tie the thread off when you are back to where you started.",
                    "description": "Make a small stitch, pulling the thread only partway so that it makes a small loop. Pull your needle through this loop, creating a second loop. Pull the needle through this second loop, then tug on it to tighten both loops and make a knot. Position the knot on the fabric side of your project rather than the Velcro. This will prevent the Velcro from accidentally snagging the knot."
                },
                {
                    "headline": "Cut the thread as close to the knot as possible.",
                    "description": "If you are worried about the knot coming undone, push the needle back through the fabric and Velcro, then cut the thread next to the Velcro. If you used sewing pins, be sure to pull them out at this point."
                }
            ]
        }
    ],
    "tyn": [
        "Soft, non-adhesive Velcro",
        "Strong thread",
        "Needle size 14 or 16 (90 or 100 in Europe)",
        "Sewing pins or masking tape",
        "Scissors",
        "Thimble (optional, but recommended)",
        "Beeswax (optional, but recommended)"
    ],
    "text": " Choosing the Right Supplies Find out what type of Velcro your project needs. If you are following a pattern, read the pattern's supply list to find out what color and width of Velcro you should buy. If you are not following a pattern, then use your best judgement in terms of size and color. The smaller the garment, the thinner the Velcro should be. A doll's dress might use 1⁄4-in (0.64-cm) Velcro, but a backpack might use 1-in (2.5-cm) Velcro. Match the color of the Velcro to the color of the fabric when possible. If you can't find the matching color, use white Velcro for light colored fabric and black for dark. Buy good-quality, non-adhesive Velcro. Adhesive Velcro may seem convenient, but the adhesive is not strong enough to be permanent. It can also gum up your needle and thread, and make sewing difficult. Unless your project specifies round Velcro dots (which are usually self-adhesive), stick with the regular, non-adhesive Velcro. Remember, you can always cut Velcro into squares or rectangles. For best results, choose Velcro that has a soft, flexible strip. It will be easier to sew than stiff, heavy-duty Velcro. Try to get Velcro that has seams on each side. This will make it easier to sew the Velcro on. Choose polyester thread that matches the color of the Velcro. When possible, match the thread color to the Velcro color. If the stitching will be visible from the front of the fabric, however, match the thread to the fabric instead. Polyester thread is the best choice because it is strong and durable. Get a sharp, thick needle. Avoid needles that are too thin, as they are more likely to snap or break as you are pulling them through the Velcro. For best results, use a general/universal needle in size 14 or 16 (90 or 100 in Europe). It would be a good idea to pick up a thimble as well; this will make it easier on your finger when pushing the needle through the Velcro. Cutting and Positioning the Velcro Cut the Velcro down to the right length. Cut the scratchy hook piece first, then use it as a guide for cutting the fuzzy loop piece. Slide the blade of your scissors through the hooks/loops on the Velcro so that you don't accidentally cut through them. If the pieces are stuck together, pull them apart. Do not cut through both pieces at the same time, or you may end up cutting through the hooks and loops. If you don't have a pattern, use your best judgement. A 1-in (2.5-cm) square would work great for a purse, but a longer strip would work better for a jacket. Cut the corners on the side seams of each Velcro strip. If you look closely at a strip of Velcro, you'll notice that the hooks and loops don't extend to the side edges; there is a slight seam on each side. Cut the corners off of these seams so that they are angled instead of straight. This will give your Velcro a nicer finish and prevent it from poking your skin. If your Velcro doesn't have any side seams, use a pair of small, pointed scissors to trim the hooks and loops down on each side to create seams. Position the Velcro so that the hook side faces away from your skin. Velcro is positioned between 2 overlapping pieces of fabric. Place the soft Velcro on the underside of the upper fabric piece. Place the scratchy Velcro on top of the lower fabric piece. This way, the scratchy Velcro will be facing away from your skin. Avoid placing the Velcro right against the edge of the fabric, otherwise the tape may scratch your skin. Pin the Velcro to your project. A single sewing pin through the middle of the strip should be enough for most pieces of Velcro. If you are sewing a very long strip of Velcro, like on a jacket, then you may want to add a sewing pin every couple of inches/centimeters. If you can't push the pins through the Velcro without bending them, use strips of masking tape instead. If this is a non-garment project, it does not matter which side of Velcro you use for each piece. Coat the needle with beeswax or a needle lubricant, if desired. While not necessary, this will make it easier for the needle to pass through the Velcro. Simply run the needle over a block of beeswax or needle lubricant. You can find both in the sewing or beading section of a craft store. Fabric stores may also carry them. Sewing the Velcro Thread the needle and knot the ends of the thread together. Cut an 18- to 20-in (46- to 51-cm) piece of thread. Push it through the eye of your needle, then bring the ends together. Treating the ends as a single strand, roll them into a small loop, then pass the end of the thread through that loop. Pull on the ends to tighten the knot. Cut your thread at an angle. This will give it a sharp point and make it easier to push through the eye of your needle! Pull the thread through a block of beeswax (after threading the needle) to make it stronger, if desired. It is better to work with shorter pieces of thread than longer ones; they are less-likely to tangle and break. Push the needle through the back of the Velcro to anchor the knot. Place the needle behind the strip of Velcro. Push it until it comes out the front, then pull on the thread until the knot touches the back of the Velcro. This will anchor the knot as well as conceal it from view. You can start sewing the Velcro wherever you want. Some people find it easier to start at a corner while others prefer starting along a side edge. Use a thimble on the finger that is pushing the needle. The end of a needle can be sharp. Sew around the Velcro using a straight stitch. A straight stitch is where you weave the needle up and down through the fabric. Use the smallest stitches you can manage, and sew as close to the edge of the Velcro as you can. If you sew too close to the hooks or loops, you risk the thread snagging. If you used masking tape instead of sewing pins, move the tape aside as you sew. If your Velcro does not have side seams, and if you did not cut any in, pull on each strand of thread to even out the tension. Tie the thread off when you are back to where you started. Make a small stitch, pulling the thread only partway so that it makes a small loop. Pull your needle through this loop, creating a second loop. Pull the needle through this second loop, then tug on it to tighten both loops and make a knot. Position the knot on the fabric side of your project rather than the Velcro. This will prevent the Velcro from accidentally snagging the knot. Cut the thread as close to the knot as possible. If you are worried about the knot coming undone, push the needle back through the fabric and Velcro, then cut the thread next to the Velcro. If you used sewing pins, be sure to pull them out at this point.",
    "sentences": [
        " Choosing the Right Supplies Find out what type of Velcro your project needs.",
        "If you are following a pattern, read the pattern's supply list to find out what color and width of Velcro you should buy.",
        "If you are not following a pattern, then use your best judgement in terms of size and color.",
        "The smaller the garment, the thinner the Velcro should be.",
        "A doll's dress might use 1⁄4-in (0.64-cm) Velcro, but a backpack might use 1-in (2.5-cm) Velcro.",
        "Match the color of the Velcro to the color of the fabric when possible.",
        "If you can't find the matching color, use white Velcro for light colored fabric and black for dark.",
        "Buy good-quality, non-adhesive Velcro.",
        "Adhesive Velcro may seem convenient, but the adhesive is not strong enough to be permanent.",
        "It can also gum up your needle and thread, and make sewing difficult.",
        "Unless your project specifies round Velcro dots (which are usually self-adhesive), stick with the regular, non-adhesive Velcro.",
        "Remember, you can always cut Velcro into squares or rectangles.",
        "For best results, choose Velcro that has a soft, flexible strip.",
        "It will be easier to sew than stiff, heavy-duty Velcro.",
        "Try to get Velcro that has seams on each side.",
        "This will make it easier to sew the Velcro on.",
        "Choose polyester thread that matches the color of the Velcro.",
        "When possible, match the thread color to the Velcro color.",
        "If the stitching will be visible from the front of the fabric, however, match the thread to the fabric instead.",
        "Polyester thread is the best choice because it is strong and durable.",
        "Get a sharp, thick needle.",
        "Avoid needles that are too thin, as they are more likely to snap or break as you are pulling them through the Velcro.",
        "For best results, use a general/universal needle in size 14 or 16 (90 or 100 in Europe).",
        "It would be a good idea to pick up a thimble as well; this will make it easier on your finger when pushing the needle through the Velcro.",
        "Cutting and Positioning the Velcro Cut the Velcro down to the right length.",
        "Cut the scratchy hook piece first, then use it as a guide for cutting the fuzzy loop piece.",
        "Slide the blade of your scissors through the hooks/loops on the Velcro so that you don't accidentally cut through them.",
        "If the pieces are stuck together, pull them apart.",
        "Do not cut through both pieces at the same time, or you may end up cutting through the hooks and loops.",
        "If you don't have a pattern, use your best judgement.",
        "A 1-in (2.5-cm) square would work great for a purse, but a longer strip would work better for a jacket.",
        "Cut the corners on the side seams of each Velcro strip.",
        "If you look closely at a strip of Velcro, you'll notice that the hooks and loops don't extend to the side edges; there is a slight seam on each side.",
        "Cut the corners off of these seams so that they are angled instead of straight.",
        "This will give your Velcro a nicer finish and prevent it from poking your skin.",
        "If your Velcro doesn't have any side seams, use a pair of small, pointed scissors to trim the hooks and loops down on each side to create seams.",
        "Position the Velcro so that the hook side faces away from your skin.",
        "Velcro is positioned between 2 overlapping pieces of fabric.",
        "Place the soft Velcro on the underside of the upper fabric piece.",
        "Place the scratchy Velcro on top of the lower fabric piece.",
        "This way, the scratchy Velcro will be facing away from your skin.",
        "Avoid placing the Velcro right against the edge of the fabric, otherwise the tape may scratch your skin.",
        "Pin the Velcro to your project.",
        "A single sewing pin through the middle of the strip should be enough for most pieces of Velcro.",
        "If you are sewing a very long strip of Velcro, like on a jacket, then you may want to add a sewing pin every couple of inches/centimeters.",
        "If you can't push the pins through the Velcro without bending them, use strips of masking tape instead.",
        "If this is a non-garment project, it does not matter which side of Velcro you use for each piece.",
        "Coat the needle with beeswax or a needle lubricant, if desired.",
        "While not necessary, this will make it easier for the needle to pass through the Velcro.",
        "Simply run the needle over a block of beeswax or needle lubricant.",
        "You can find both in the sewing or beading section of a craft store.",
        "Fabric stores may also carry them.",
        "Sewing the Velcro Thread the needle and knot the ends of the thread together.",
        "Cut an 18- to 20-in (46- to 51-cm) piece of thread.",
        "Push it through the eye of your needle, then bring the ends together.",
        "Treating the ends as a single strand, roll them into a small loop, then pass the end of the thread through that loop.",
        "Pull on the ends to tighten the knot.",
        "Cut your thread at an angle.",
        "This will give it a sharp point and make it easier to push through the eye of your needle!",
        "Pull the thread through a block of beeswax (after threading the needle) to make it stronger, if desired.",
        "It is better to work with shorter pieces of thread than longer ones; they are less-likely to tangle and break.",
        "Push the needle through the back of the Velcro to anchor the knot.",
        "Place the needle behind the strip of Velcro.",
        "Push it until it comes out the front, then pull on the thread until the knot touches the back of the Velcro.",
        "This will anchor the knot as well as conceal it from view.",
        "You can start sewing the Velcro wherever you want.",
        "Some people find it easier to start at a corner while others prefer starting along a side edge.",
        "Use a thimble on the finger that is pushing the needle.",
        "The end of a needle can be sharp.",
        "Sew around the Velcro using a straight stitch.",
        "A straight stitch is where you weave the needle up and down through the fabric.",
        "Use the smallest stitches you can manage, and sew as close to the edge of the Velcro as you can.",
        "If you sew too close to the hooks or loops, you risk the thread snagging.",
        "If you used masking tape instead of sewing pins, move the tape aside as you sew.",
        "If your Velcro does not have side seams, and if you did not cut any in, pull on each strand of thread to even out the tension.",
        "Tie the thread off when you are back to where you started.",
        "Make a small stitch, pulling the thread only partway so that it makes a small loop.",
        "Pull your needle through this loop, creating a second loop.",
        "Pull the needle through this second loop, then tug on it to tighten both loops and make a knot.",
        "Position the knot on the fabric side of your project rather than the Velcro.",
        "This will prevent the Velcro from accidentally snagging the knot.",
        "Cut the thread as close to the knot as possible.",
        "If you are worried about the knot coming undone, push the needle back through the fabric and Velcro, then cut the thread next to the Velcro.",
        "If you used sewing pins, be sure to pull them out at this point."
    ]
}