{
    "title": "How to Cook Elbow Macaroni",
    "url": "https://www.wikihow.com/Cook-Elbow-Macaroni",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Pasta and Noodles",
        "Macaroni and Cheese"
    ],
    "methods": [
        {
            "name": "Boiling Elbow Macaroni",
            "steps": [
                {
                    "headline": "Bring 4 to 6 quarts (3.8 to 5.7 liters) of salted water to a boil.",
                    "description": "Pour the water into a large pot and add several pinches of salt. Put the lid on the pot and turn the burner to high. Heat the water until it begins to boil and steam escapes from under the lid. To make a single serving, heat 2 to 3 quarts (1.9 to 2.3 liters) of water and reduce the amount of elbow macaroni between 1/2 cup to 1 cup (42 to 84 g)."
                },
                {
                    "headline": "Stir in a 16-ounce (454 g) package of dry elbow macaroni noodles.",
                    "description": "Use a spoon to stir the noodles so they don't clump together as they cook. The water will stop bubbling right after you add the noodles."
                },
                {
                    "headline": "Bring the water back to a boil and cook the noodles for 7 to 8 minutes.",
                    "description": "Keep the lid off the pot and heat the noodles over high heat. The water should start to bubble vigorously. Stir the noodles occasionally and cook the elbow macaroni until it's al dente. This should take 7 minutes. If you want softer noodles, cook them for 1 more minute."
                },
                {
                    "headline": "Drain the noodles.",
                    "description": "Turn off the burner and set a colander in the sink. Carefully pour the noodles into the colander so the water drains. Use the noodles while they're still hot. If you want to make the noodles ahead of time, refrigerate them in an airtight container for 3 to 4 days. Reheat the noodles in your favorite sauce or casserole."
                }
            ]
        },
        {
            "name": "Simmering Elbow Macaroni in Milk",
            "steps": [
                {
                    "headline": "Combine the milk and water.",
                    "description": "Measure 2 1/2 cups (590 ml) of milk and 1/4 cup (60 ml) of water into a large pot on the stove. To make a single serving, cut the amount of milk, water, and noodles in half. You can use low-fat milk for this recipe, but whole milk will make creamier pasta."
                },
                {
                    "headline": "Bring the liquids to a boil over medium heat.",
                    "description": "Keep the lid off of the pot and heat the liquids, so they begin to bubble vigorously. Avoid heating the liquids over high heat or the milk will scorch on the bottom of the pot."
                },
                {
                    "headline": "Reduce the heat and stir in the elbow macaroni.",
                    "description": "Turn the burner down to low and stir in 2 cups (168 g) of elbow macaroni noodles."
                },
                {
                    "headline": "Simmer the noodles for 20 minutes.",
                    "description": "Keep the lid off the pot and let the noodles bubble gently until they're as soft as you like. Stir the noodles every few minutes to prevent them from clumping or burning. If the liquid evaporates, add 1/4 cup (60 ml) of milk whenever the liquid level looks low."
                },
                {
                    "headline": "Drain the noodles.",
                    "description": "Decide if you want to use the hot milk in the recipe you're making or if you want to drain it. If you want to save the milk, set a large bowl in the sink and place a strainer or colander over it. If you don't want to save the milk, don't place a bowl below the colander. Carefully pour the cooked noodles into the colander."
                },
                {
                    "headline": "Use the cooked elbow noodles.",
                    "description": "Use the hot elbow noodles immediately in your recipe or put them in an airtight container. Refrigerate the noodles and use them within 3 or 4 days. If you'd like to use the hot milk, consider thickening it with a roux and stirring in shredded cheese. Toss the noodles into this simple cheese sauce for an easy macaroni and cheese."
                }
            ]
        },
        {
            "name": "Microwaving Elbow Macaroni",
            "steps": [
                {
                    "headline": "Place the elbow macaroni into a large bowl and pour water over it.",
                    "description": "Measure 1/2 cup to 1 cup (42 to 84 g) of dry elbow macaroni noodles into a microwave-safe bowl. Pour enough water to cover the noodles by 2 inches (5 cm). The noodles will absorb the water as they cook, so use a bowl that's large enough for them to expand. This will make 1 to 2 servings. If you'd like to double the amount, use a larger bowl and add more water."
                },
                {
                    "headline": "Set the bowl on a plate and put it in the microwave.",
                    "description": "Place a microwave-safe plate under the bowl to catch any water that might boil over. Put the plate and bowl in the microwave."
                },
                {
                    "headline": "Microwave the elbow macaroni for 11 to 12 minutes.",
                    "description": "Turn on the microwave and heat the noodles so the water begins to boil and the noodles soften. Once the timer beeps, check the noodles to see if they're as soft as you want. If you want softer noodles, microwave them for another 1 to 2 minutes."
                },
                {
                    "headline": "Drain the elbow macaroni.",
                    "description": "Set a colander or strainer in the sink. Wear oven mitts to remove the bowl of cooked elbow macaroni from the microwave. Pour the noodles and water into the colander so the water drains."
                },
                {
                    "headline": "Use the cooked elbow macaroni.",
                    "description": "Stir the cooked elbow macaroni into your favorite sauce or soup. Refrigerate the leftover elbow macaroni in an airtight container for 3 to 4 days."
                }
            ]
        },
        {
            "name": "Using the Cooked Elbow Macaroni",
            "steps": [
                {
                    "headline": "Make macaroni and cheese.",
                    "description": "Cook melted butter with flour in a saucepan to make a paste. Whisk in milk and butter to make a simple white sauce. Stir in your favorite shredded cheese and mix in the cooked elbow macaroni noodles. You can serve the macaroni and cheese immediately or transfer it to a baking dish. Cook the macaroni and cheese until it's bubbly."
                },
                {
                    "headline": "Bake a casserole.",
                    "description": "Combine the cooked elbow macaroni with shredded chicken, chopped ham, or canned tuna. Stir in diced vegetables and your favorite seasonings. Mix in canned soup, pasta sauce, or beaten eggs to hold the casserole together and transfer the mixture to a greased baking dish. Bake the casserole until it's golden and bubbly."
                },
                {
                    "headline": "Create a cold pasta salad.",
                    "description": "Cool the elbow macaroni noodles and stir them with salad dressing. Stir in diced crunchy vegetables, shredded cheese, and boiled eggs or cooked meats. Refrigerate the pasta salad for a few hours before serving it."
                },
                {
                    "headline": "Spread pasta sauce over the noodles.",
                    "description": "For a quick meal, heat your favorite pasta sauce such as marinara or alfredo sauce. Spoon the sauce on the cooked elbow macaroni and sprinkle it with grated Parmesan cheese. You can also stir in cooked ground beef, sautéed shrimp, or meatballs."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Boiled Elbow Macaroni",
        "Large pot with lid",
        "Spoon",
        "Colander",
        "Elbow Macaroni in Milk",
        "Large pot",
        "Measuring cups",
        "Bowl",
        "Colander or strainer",
        "Microwaved Elbow Macaroni",
        "Measuring cup",
        "Microwave-safe bowl",
        "Microwave",
        "Microwave-safe plate"
    ],
    "text": " Boiling Elbow Macaroni Bring 4 to 6 quarts (3.8 to 5.7 liters) of salted water to a boil. Pour the water into a large pot and add several pinches of salt. Put the lid on the pot and turn the burner to high. Heat the water until it begins to boil and steam escapes from under the lid. To make a single serving, heat 2 to 3 quarts (1.9 to 2.3 liters) of water and reduce the amount of elbow macaroni between 1/2 cup to 1 cup (42 to 84 g). Stir in a 16-ounce (454 g) package of dry elbow macaroni noodles. Use a spoon to stir the noodles so they don't clump together as they cook. The water will stop bubbling right after you add the noodles. Bring the water back to a boil and cook the noodles for 7 to 8 minutes. Keep the lid off the pot and heat the noodles over high heat. The water should start to bubble vigorously. Stir the noodles occasionally and cook the elbow macaroni until it's al dente. This should take 7 minutes. If you want softer noodles, cook them for 1 more minute. Drain the noodles. Turn off the burner and set a colander in the sink. Carefully pour the noodles into the colander so the water drains. Use the noodles while they're still hot. If you want to make the noodles ahead of time, refrigerate them in an airtight container for 3 to 4 days. Reheat the noodles in your favorite sauce or casserole. Simmering Elbow Macaroni in Milk Combine the milk and water. Measure 2 1/2 cups (590 ml) of milk and 1/4 cup (60 ml) of water into a large pot on the stove. To make a single serving, cut the amount of milk, water, and noodles in half. You can use low-fat milk for this recipe, but whole milk will make creamier pasta. Bring the liquids to a boil over medium heat. Keep the lid off of the pot and heat the liquids, so they begin to bubble vigorously. Avoid heating the liquids over high heat or the milk will scorch on the bottom of the pot. Reduce the heat and stir in the elbow macaroni. Turn the burner down to low and stir in 2 cups (168 g) of elbow macaroni noodles. Simmer the noodles for 20 minutes. Keep the lid off the pot and let the noodles bubble gently until they're as soft as you like. Stir the noodles every few minutes to prevent them from clumping or burning. If the liquid evaporates, add 1/4 cup (60 ml) of milk whenever the liquid level looks low. Drain the noodles. Decide if you want to use the hot milk in the recipe you're making or if you want to drain it. If you want to save the milk, set a large bowl in the sink and place a strainer or colander over it. If you don't want to save the milk, don't place a bowl below the colander. Carefully pour the cooked noodles into the colander. Use the cooked elbow noodles. Use the hot elbow noodles immediately in your recipe or put them in an airtight container. Refrigerate the noodles and use them within 3 or 4 days. If you'd like to use the hot milk, consider thickening it with a roux and stirring in shredded cheese. Toss the noodles into this simple cheese sauce for an easy macaroni and cheese. Microwaving Elbow Macaroni Place the elbow macaroni into a large bowl and pour water over it. Measure 1/2 cup to 1 cup (42 to 84 g) of dry elbow macaroni noodles into a microwave-safe bowl. Pour enough water to cover the noodles by 2 inches (5 cm). The noodles will absorb the water as they cook, so use a bowl that's large enough for them to expand. This will make 1 to 2 servings. If you'd like to double the amount, use a larger bowl and add more water. Set the bowl on a plate and put it in the microwave. Place a microwave-safe plate under the bowl to catch any water that might boil over. Put the plate and bowl in the microwave. Microwave the elbow macaroni for 11 to 12 minutes. Turn on the microwave and heat the noodles so the water begins to boil and the noodles soften. Once the timer beeps, check the noodles to see if they're as soft as you want. If you want softer noodles, microwave them for another 1 to 2 minutes. Drain the elbow macaroni. Set a colander or strainer in the sink. Wear oven mitts to remove the bowl of cooked elbow macaroni from the microwave. Pour the noodles and water into the colander so the water drains. Use the cooked elbow macaroni. Stir the cooked elbow macaroni into your favorite sauce or soup. Refrigerate the leftover elbow macaroni in an airtight container for 3 to 4 days. Using the Cooked Elbow Macaroni Make macaroni and cheese. Cook melted butter with flour in a saucepan to make a paste. Whisk in milk and butter to make a simple white sauce. Stir in your favorite shredded cheese and mix in the cooked elbow macaroni noodles. You can serve the macaroni and cheese immediately or transfer it to a baking dish. Cook the macaroni and cheese until it's bubbly. Bake a casserole. Combine the cooked elbow macaroni with shredded chicken, chopped ham, or canned tuna. Stir in diced vegetables and your favorite seasonings. Mix in canned soup, pasta sauce, or beaten eggs to hold the casserole together and transfer the mixture to a greased baking dish. Bake the casserole until it's golden and bubbly. Create a cold pasta salad. Cool the elbow macaroni noodles and stir them with salad dressing. Stir in diced crunchy vegetables, shredded cheese, and boiled eggs or cooked meats. Refrigerate the pasta salad for a few hours before serving it. Spread pasta sauce over the noodles. For a quick meal, heat your favorite pasta sauce such as marinara or alfredo sauce. Spoon the sauce on the cooked elbow macaroni and sprinkle it with grated Parmesan cheese. You can also stir in cooked ground beef, sautéed shrimp, or meatballs. Finished. ",
    "sentences": [
        " Boiling Elbow Macaroni Bring 4 to 6 quarts (3.8 to 5.7 liters) of salted water to a boil.",
        "Pour the water into a large pot and add several pinches of salt.",
        "Put the lid on the pot and turn the burner to high.",
        "Heat the water until it begins to boil and steam escapes from under the lid.",
        "To make a single serving, heat 2 to 3 quarts (1.9 to 2.3 liters) of water and reduce the amount of elbow macaroni between 1/2 cup to 1 cup (42 to 84 g).",
        "Stir in a 16-ounce (454 g) package of dry elbow macaroni noodles.",
        "Use a spoon to stir the noodles so they don't clump together as they cook.",
        "The water will stop bubbling right after you add the noodles.",
        "Bring the water back to a boil and cook the noodles for 7 to 8 minutes.",
        "Keep the lid off the pot and heat the noodles over high heat.",
        "The water should start to bubble vigorously.",
        "Stir the noodles occasionally and cook the elbow macaroni until it's al dente.",
        "This should take 7 minutes.",
        "If you want softer noodles, cook them for 1 more minute.",
        "Drain the noodles.",
        "Turn off the burner and set a colander in the sink.",
        "Carefully pour the noodles into the colander so the water drains.",
        "Use the noodles while they're still hot.",
        "If you want to make the noodles ahead of time, refrigerate them in an airtight container for 3 to 4 days.",
        "Reheat the noodles in your favorite sauce or casserole.",
        "Simmering Elbow Macaroni in Milk Combine the milk and water.",
        "Measure 2 1/2 cups (590 ml) of milk and 1/4 cup (60 ml) of water into a large pot on the stove.",
        "To make a single serving, cut the amount of milk, water, and noodles in half.",
        "You can use low-fat milk for this recipe, but whole milk will make creamier pasta.",
        "Bring the liquids to a boil over medium heat.",
        "Keep the lid off of the pot and heat the liquids, so they begin to bubble vigorously.",
        "Avoid heating the liquids over high heat or the milk will scorch on the bottom of the pot.",
        "Reduce the heat and stir in the elbow macaroni.",
        "Turn the burner down to low and stir in 2 cups (168 g) of elbow macaroni noodles.",
        "Simmer the noodles for 20 minutes.",
        "Keep the lid off the pot and let the noodles bubble gently until they're as soft as you like.",
        "Stir the noodles every few minutes to prevent them from clumping or burning.",
        "If the liquid evaporates, add 1/4 cup (60 ml) of milk whenever the liquid level looks low.",
        "Drain the noodles.",
        "Decide if you want to use the hot milk in the recipe you're making or if you want to drain it.",
        "If you want to save the milk, set a large bowl in the sink and place a strainer or colander over it.",
        "If you don't want to save the milk, don't place a bowl below the colander.",
        "Carefully pour the cooked noodles into the colander.",
        "Use the cooked elbow noodles.",
        "Use the hot elbow noodles immediately in your recipe or put them in an airtight container.",
        "Refrigerate the noodles and use them within 3 or 4 days.",
        "If you'd like to use the hot milk, consider thickening it with a roux and stirring in shredded cheese.",
        "Toss the noodles into this simple cheese sauce for an easy macaroni and cheese.",
        "Microwaving Elbow Macaroni Place the elbow macaroni into a large bowl and pour water over it.",
        "Measure 1/2 cup to 1 cup (42 to 84 g) of dry elbow macaroni noodles into a microwave-safe bowl.",
        "Pour enough water to cover the noodles by 2 inches (5 cm).",
        "The noodles will absorb the water as they cook, so use a bowl that's large enough for them to expand.",
        "This will make 1 to 2 servings.",
        "If you'd like to double the amount, use a larger bowl and add more water.",
        "Set the bowl on a plate and put it in the microwave.",
        "Place a microwave-safe plate under the bowl to catch any water that might boil over.",
        "Put the plate and bowl in the microwave.",
        "Microwave the elbow macaroni for 11 to 12 minutes.",
        "Turn on the microwave and heat the noodles so the water begins to boil and the noodles soften.",
        "Once the timer beeps, check the noodles to see if they're as soft as you want.",
        "If you want softer noodles, microwave them for another 1 to 2 minutes.",
        "Drain the elbow macaroni.",
        "Set a colander or strainer in the sink.",
        "Wear oven mitts to remove the bowl of cooked elbow macaroni from the microwave.",
        "Pour the noodles and water into the colander so the water drains.",
        "Use the cooked elbow macaroni.",
        "Stir the cooked elbow macaroni into your favorite sauce or soup.",
        "Refrigerate the leftover elbow macaroni in an airtight container for 3 to 4 days.",
        "Using the Cooked Elbow Macaroni Make macaroni and cheese.",
        "Cook melted butter with flour in a saucepan to make a paste.",
        "Whisk in milk and butter to make a simple white sauce.",
        "Stir in your favorite shredded cheese and mix in the cooked elbow macaroni noodles.",
        "You can serve the macaroni and cheese immediately or transfer it to a baking dish.",
        "Cook the macaroni and cheese until it's bubbly.",
        "Bake a casserole.",
        "Combine the cooked elbow macaroni with shredded chicken, chopped ham, or canned tuna.",
        "Stir in diced vegetables and your favorite seasonings.",
        "Mix in canned soup, pasta sauce, or beaten eggs to hold the casserole together and transfer the mixture to a greased baking dish.",
        "Bake the casserole until it's golden and bubbly.",
        "Create a cold pasta salad.",
        "Cool the elbow macaroni noodles and stir them with salad dressing.",
        "Stir in diced crunchy vegetables, shredded cheese, and boiled eggs or cooked meats.",
        "Refrigerate the pasta salad for a few hours before serving it.",
        "Spread pasta sauce over the noodles.",
        "For a quick meal, heat your favorite pasta sauce such as marinara or alfredo sauce.",
        "Spoon the sauce on the cooked elbow macaroni and sprinkle it with grated Parmesan cheese.",
        "You can also stir in cooked ground beef, sautéed shrimp, or meatballs.",
        "Finished."
    ]
}