{
    "title": "How to Make a Saline Solution",
    "url": "https://www.wikihow.com/Make-a-Saline-Solution",
    "category_hierarchy": [
        "Health",
        "First Aid and Emergency Health Care",
        "First Aid Kits"
    ],
    "methods": [
        {
            "name": "In the Microwave",
            "steps": [
                {
                    "headline": "Purchase either regular table salt or sea salt.",
                    "description": "Do not buy fancy, scented, coloured or flavoured salts; the salt needs to be as pure as possible. Make sure it's iodine-free and lacks preservatives -- if it's anything but salt it could irritate your skin/nasal lining / whatever you're using it for."
                },
                {
                    "headline": "Put a 1/2 teaspoon (2.5g) of salt into a cup.",
                    "description": "You want to mimic the concentration of salt or tears by creating a normal (the actual term) solution that's 0.9% saline. 1/2 tsp is about right for fine table salt, but not for coarse sea salt, where the volume needed to obtain 2.5 g can be up to twice that of fine salt. For kids, stay on the less-salty side; for adults, a bit saltier is okay. But just a bit! If you like, some recipes say to add 1/2 a teaspoon or so of baking soda. However, a normal solution doesn't need it. This is for 8 ounces of water. If you're using more water, use more salt."
                },
                {
                    "headline": "Add 8 ounces (1 cup) of hot water and stir well.",
                    "description": "Zap it in the microwave for a minute or so, set it in your kettle, or otherwise somehow get it to a point where it's hot but not boiling. You will need to run the microwave significantly longer than 1 minute to ensure sterility. Using a covered pyrex bowl works more quickly, but the top may become displaced by buildup of steam if heating is prolonged. Grab a spoon and help it dissolve. Make sure it's stirred well! If it's cloudy or dirty, throw it out. If you want to be extra careful, use distilled water (or water that has actually reached a boil). This makes sure everything is sterile and hygienic."
                },
                {
                    "headline": "Depending on your situation either cleanse, submerge or gargle the saline solution.",
                    "description": "But make sure not to swallow it! For the record, it's not intended for open wounds, either. For piercings, do not submerge in water. Cleanse the area only, as the saline solution can leave the surrounding areas quite dry. Speak to a licensed professional for the best way to care for your new piercing. For nail infections or other skin related infections (not open wounds) submerge the appendage in the saline 4 times a day. This method can take days to weeks to work, see a medical professional before it spreads, and if you see a red line traveling up your appendage go to the ER. For a sore throat gargle morning and night, do not ingest the solution, though doing so by mistake will not harm you. If the sore throat persists after 2 days see a doctor."
                }
            ]
        },
        {
            "name": "On the Stove",
            "steps": [
                {
                    "headline": "Place 1 cup of water and 1/2 teaspoon of salt into a pan.",
                    "description": "That's 8 ounces of water and about 2.5 grams of salt. Make sure the salt is iodide-free and lacks preservatives, coloring, scent, or any other fancy stuff that's unnecessary. 1/2 a teaspoon doesn't seem like much, does it? For adults, it's safe to add a bit more, but just a bit. You want to have a solution that's similar to your own tears -- that's 0.9% saline."
                },
                {
                    "headline": "Bring to a boil for 15 minutes.",
                    "description": "Place the lid on from the start. If you do not use a lid, too much of the water will boil away and the solution will be too salty. Set the timer and walk away. If you need to prep something else at this juncture (like a neti pot or jar), do so now."
                },
                {
                    "headline": "Use your solution.",
                    "description": "The most common use for saline solution is to clear the sinuses, help a sore throat or to rinse contact lenses. Just make sure it's safe and appropriate for whatever means you want to use it for. If you're gargling it, wait for it to cool down a tad so it doesn't burn your throat -- it should be very warm -- not searingly hot. Same goes for using it in your nasal passageway or on your skin; you don't want to exacerbate your problem!"
                },
                {
                    "headline": "Pour the rest into a sterile jar, bottle, or cup.",
                    "description": "If you have extras that is. Make sure your container is sterile to ensure the solution stays effective. You can be sure it is by boiling it, too."
                }
            ]
        }
    ],
    "tyn": [
        "Method One: In the Microwave",
        "Pure table salt or sea salt",
        "Baking soda (optional)",
        "Mug",
        "Water",
        "Spoon",
        "Method Two: On the Stove",
        "Pot with lid",
        "Container (with lid, if keeping)"
    ],
    "text": " In the Microwave Purchase either regular table salt or sea salt. Do not buy fancy, scented, coloured or flavoured salts; the salt needs to be as pure as possible. Make sure it's iodine-free and lacks preservatives -- if it's anything but salt it could irritate your skin/nasal lining / whatever you're using it for. Put a 1/2 teaspoon (2.5g) of salt into a cup. You want to mimic the concentration of salt or tears by creating a normal (the actual term) solution that's 0.9% saline. 1/2 tsp is about right for fine table salt, but not for coarse sea salt, where the volume needed to obtain 2.5 g can be up to twice that of fine salt. For kids, stay on the less-salty side; for adults, a bit saltier is okay. But just a bit! If you like, some recipes say to add 1/2 a teaspoon or so of baking soda. However, a normal solution doesn't need it. This is for 8 ounces of water. If you're using more water, use more salt. Add 8 ounces (1 cup) of hot water and stir well. Zap it in the microwave for a minute or so, set it in your kettle, or otherwise somehow get it to a point where it's hot but not boiling. You will need to run the microwave significantly longer than 1 minute to ensure sterility. Using a covered pyrex bowl works more quickly, but the top may become displaced by buildup of steam if heating is prolonged. Grab a spoon and help it dissolve. Make sure it's stirred well! If it's cloudy or dirty, throw it out. If you want to be extra careful, use distilled water (or water that has actually reached a boil). This makes sure everything is sterile and hygienic. Depending on your situation either cleanse, submerge or gargle the saline solution. But make sure not to swallow it! For the record, it's not intended for open wounds, either. For piercings, do not submerge in water. Cleanse the area only, as the saline solution can leave the surrounding areas quite dry. Speak to a licensed professional for the best way to care for your new piercing. For nail infections or other skin related infections (not open wounds) submerge the appendage in the saline 4 times a day. This method can take days to weeks to work, see a medical professional before it spreads, and if you see a red line traveling up your appendage go to the ER. For a sore throat gargle morning and night, do not ingest the solution, though doing so by mistake will not harm you. If the sore throat persists after 2 days see a doctor. On the Stove Place 1 cup of water and 1/2 teaspoon of salt into a pan. That's 8 ounces of water and about 2.5 grams of salt. Make sure the salt is iodide-free and lacks preservatives, coloring, scent, or any other fancy stuff that's unnecessary. 1/2 a teaspoon doesn't seem like much, does it? For adults, it's safe to add a bit more, but just a bit. You want to have a solution that's similar to your own tears -- that's 0.9% saline. Bring to a boil for 15 minutes. Place the lid on from the start. If you do not use a lid, too much of the water will boil away and the solution will be too salty. Set the timer and walk away. If you need to prep something else at this juncture (like a neti pot or jar), do so now. Use your solution. The most common use for saline solution is to clear the sinuses, help a sore throat or to rinse contact lenses. Just make sure it's safe and appropriate for whatever means you want to use it for. If you're gargling it, wait for it to cool down a tad so it doesn't burn your throat -- it should be very warm -- not searingly hot. Same goes for using it in your nasal passageway or on your skin; you don't want to exacerbate your problem! Pour the rest into a sterile jar, bottle, or cup. If you have extras that is. Make sure your container is sterile to ensure the solution stays effective. You can be sure it is by boiling it, too.",
    "sentences": [
        " In the Microwave Purchase either regular table salt or sea salt.",
        "Do not buy fancy, scented, coloured or flavoured salts; the salt needs to be as pure as possible.",
        "Make sure it's iodine-free and lacks preservatives -- if it's anything but salt it could irritate your skin/nasal lining / whatever you're using it for.",
        "Put a 1/2 teaspoon (2.5g) of salt into a cup.",
        "You want to mimic the concentration of salt or tears by creating a normal (the actual term) solution that's 0.9% saline.",
        "1/2 tsp is about right for fine table salt, but not for coarse sea salt, where the volume needed to obtain 2.5 g can be up to twice that of fine salt.",
        "For kids, stay on the less-salty side; for adults, a bit saltier is okay.",
        "But just a bit!",
        "If you like, some recipes say to add 1/2 a teaspoon or so of baking soda.",
        "However, a normal solution doesn't need it.",
        "This is for 8 ounces of water.",
        "If you're using more water, use more salt.",
        "Add 8 ounces (1 cup) of hot water and stir well.",
        "Zap it in the microwave for a minute or so, set it in your kettle, or otherwise somehow get it to a point where it's hot but not boiling.",
        "You will need to run the microwave significantly longer than 1 minute to ensure sterility.",
        "Using a covered pyrex bowl works more quickly, but the top may become displaced by buildup of steam if heating is prolonged.",
        "Grab a spoon and help it dissolve.",
        "Make sure it's stirred well!",
        "If it's cloudy or dirty, throw it out.",
        "If you want to be extra careful, use distilled water (or water that has actually reached a boil).",
        "This makes sure everything is sterile and hygienic.",
        "Depending on your situation either cleanse, submerge or gargle the saline solution.",
        "But make sure not to swallow it!",
        "For the record, it's not intended for open wounds, either.",
        "For piercings, do not submerge in water.",
        "Cleanse the area only, as the saline solution can leave the surrounding areas quite dry.",
        "Speak to a licensed professional for the best way to care for your new piercing.",
        "For nail infections or other skin related infections (not open wounds) submerge the appendage in the saline 4 times a day.",
        "This method can take days to weeks to work, see a medical professional before it spreads, and if you see a red line traveling up your appendage go to the ER.",
        "For a sore throat gargle morning and night, do not ingest the solution, though doing so by mistake will not harm you.",
        "If the sore throat persists after 2 days see a doctor.",
        "On the Stove Place 1 cup of water and 1/2 teaspoon of salt into a pan.",
        "That's 8 ounces of water and about 2.5 grams of salt.",
        "Make sure the salt is iodide-free and lacks preservatives, coloring, scent, or any other fancy stuff that's unnecessary.",
        "1/2 a teaspoon doesn't seem like much, does it?",
        "For adults, it's safe to add a bit more, but just a bit.",
        "You want to have a solution that's similar to your own tears -- that's 0.9% saline.",
        "Bring to a boil for 15 minutes.",
        "Place the lid on from the start.",
        "If you do not use a lid, too much of the water will boil away and the solution will be too salty.",
        "Set the timer and walk away.",
        "If you need to prep something else at this juncture (like a neti pot or jar), do so now.",
        "Use your solution.",
        "The most common use for saline solution is to clear the sinuses, help a sore throat or to rinse contact lenses.",
        "Just make sure it's safe and appropriate for whatever means you want to use it for.",
        "If you're gargling it, wait for it to cool down a tad so it doesn't burn your throat -- it should be very warm -- not searingly hot.",
        "Same goes for using it in your nasal passageway or on your skin; you don't want to exacerbate your problem!",
        "Pour the rest into a sterile jar, bottle, or cup.",
        "If you have extras that is.",
        "Make sure your container is sterile to ensure the solution stays effective.",
        "You can be sure it is by boiling it, too."
    ]
}