{
    "title": "How to Apply Annie Sloan Wax",
    "url": "https://www.wikihow.com/Apply-Annie-Sloan-Wax",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Getting the Wax Ready",
            "steps": [
                {
                    "headline": "Allow the chalk paint to dry before applying the wax.",
                    "description": "Annie Sloan wax is meant to give an extra sheen to furniture that has already been painted with chalk paint. Read through the painting instructions and apply several coats to your furniture before you begin waxing it. Aim for even coverage when using your chalk paint. Thin, level coats will make applying the wax easier."
                },
                {
                    "headline": "Smear the wax onto a paper plate.",
                    "description": "Scoop the wax onto a knife and put it on a paper plate. This will give you open access to the wax while you're using it and allow you to mix it with other products as needed. Although you can keep the wax in its packaging, you may not be able to mix the amount you need with mineral spirits."
                },
                {
                    "headline": "Mix your wax with mineral spirits if it is hard to work with.",
                    "description": "Mineral spirits are a type of paint thinner that can help make the wax more pliable. The ratio of wax to mineral spirits should be about 9:1. Add a small amount of mineral spirits to your wax and mix it in with your knife if is difficult to spread. When working with mineral spirits, read the label carefully and take all safety precautions that are directed on the label."
                },
                {
                    "headline": "Dab a wax brush into the wax.",
                    "description": "The wax should lightly coat the tip of your brush. If you do not have a wax brush, you can use a lint-free cloth as an alternative. Wax brushes, however, will provide more even coats. Wax brushes can be purchased at most craft or hardware stores."
                }
            ]
        },
        {
            "name": "Applying the Wax",
            "steps": [
                {
                    "headline": "Massage the wax onto a small section of the furniture.",
                    "description": "Choose a small area of your furniture, like a quarter of the tabletop or one leg on the chair, to apply the wax first. Apply the wax to the furniture in circular motions. Massage in the direction of the grain to thoroughly coat the furniture in wax. Because Annie Sloan wax enhances the color of chalk paint, the wax should appear to \"darken\" your color slightly."
                },
                {
                    "headline": "Wipe a cloth in the direction of the grain to remove excess wax.",
                    "description": "Using a separate lint-free cloth, press it along the furniture in the direction of the grain. This will remove any extra wax to keep your furniture from having a sticky texture."
                },
                {
                    "headline": "Repeat this process on all areas of the furniture.",
                    "description": "Continue coating the furniture in its first layer of wax until you have covered the entire surface. After you think you've covered the entire piece of furniture, do a quick check before applying the second layer of wax. You will want to apply all wax coatings evenly."
                },
                {
                    "headline": "Apply second and third layers of wax.",
                    "description": "For most pieces of furniture, 2-3 layers is sufficient. Add more layers to the furniture in exactly the same way you applied the first coating. Continue applying coats until you are satisfied with the wax's color. You do not need to wait for the wax to dry in between coats."
                }
            ]
        },
        {
            "name": "Adding Finishing Touches",
            "steps": [
                {
                    "headline": "Let the wax dry for 24 hours.",
                    "description": "After applying your last coat of wax, let it dry for at least 24 hours before buffing or using your furniture. This will give the wax time to adhere to the furniture and last longer."
                },
                {
                    "headline": "Use a lint-free cloth to buff the furniture.",
                    "description": "After 24 hours have passed, take a clean, lint-free cloth and rub it around the furniture in circles. This should bring out a glossier shine in your wax. If you prefer a more matte look, skip the buffing process and begin using your furniture after the wax has dried."
                },
                {
                    "headline": "Reapply the wax later, as needed.",
                    "description": "Annie Sloan wax is meant to be temporary and periodically applied. If you notice that your furniture looks dull or is more prone to fingerprints, the wax may have worn off. Apply another layer as soon as you can to keep your furniture clean and the chalk paint undamaged. How long a wax application will last depends on how often the piece of furniture is used and how roughly it is handled."
                }
            ]
        }
    ],
    "tyn": [
        "Annie Sloan wax",
        "Knife",
        "Paper plate",
        "Mineral spirits",
        "Wax brush",
        "Lint-free cloth"
    ],
    "text": " Getting the Wax Ready Allow the chalk paint to dry before applying the wax. Annie Sloan wax is meant to give an extra sheen to furniture that has already been painted with chalk paint. Read through the painting instructions and apply several coats to your furniture before you begin waxing it. Aim for even coverage when using your chalk paint. Thin, level coats will make applying the wax easier. Smear the wax onto a paper plate. Scoop the wax onto a knife and put it on a paper plate. This will give you open access to the wax while you're using it and allow you to mix it with other products as needed. Although you can keep the wax in its packaging, you may not be able to mix the amount you need with mineral spirits. Mix your wax with mineral spirits if it is hard to work with. Mineral spirits are a type of paint thinner that can help make the wax more pliable. The ratio of wax to mineral spirits should be about 9:1. Add a small amount of mineral spirits to your wax and mix it in with your knife if is difficult to spread. When working with mineral spirits, read the label carefully and take all safety precautions that are directed on the label. Dab a wax brush into the wax. The wax should lightly coat the tip of your brush. If you do not have a wax brush, you can use a lint-free cloth as an alternative. Wax brushes, however, will provide more even coats. Wax brushes can be purchased at most craft or hardware stores. Applying the Wax Massage the wax onto a small section of the furniture. Choose a small area of your furniture, like a quarter of the tabletop or one leg on the chair, to apply the wax first. Apply the wax to the furniture in circular motions. Massage in the direction of the grain to thoroughly coat the furniture in wax. Because Annie Sloan wax enhances the color of chalk paint, the wax should appear to \"darken\" your color slightly. Wipe a cloth in the direction of the grain to remove excess wax. Using a separate lint-free cloth, press it along the furniture in the direction of the grain. This will remove any extra wax to keep your furniture from having a sticky texture. Repeat this process on all areas of the furniture. Continue coating the furniture in its first layer of wax until you have covered the entire surface. After you think you've covered the entire piece of furniture, do a quick check before applying the second layer of wax. You will want to apply all wax coatings evenly. Apply second and third layers of wax. For most pieces of furniture, 2-3 layers is sufficient. Add more layers to the furniture in exactly the same way you applied the first coating. Continue applying coats until you are satisfied with the wax's color. You do not need to wait for the wax to dry in between coats. Adding Finishing Touches Let the wax dry for 24 hours. After applying your last coat of wax, let it dry for at least 24 hours before buffing or using your furniture. This will give the wax time to adhere to the furniture and last longer. Use a lint-free cloth to buff the furniture. After 24 hours have passed, take a clean, lint-free cloth and rub it around the furniture in circles. This should bring out a glossier shine in your wax. If you prefer a more matte look, skip the buffing process and begin using your furniture after the wax has dried. Reapply the wax later, as needed. Annie Sloan wax is meant to be temporary and periodically applied. If you notice that your furniture looks dull or is more prone to fingerprints, the wax may have worn off. Apply another layer as soon as you can to keep your furniture clean and the chalk paint undamaged. How long a wax application will last depends on how often the piece of furniture is used and how roughly it is handled.",
    "sentences": [
        " Getting the Wax Ready Allow the chalk paint to dry before applying the wax.",
        "Annie Sloan wax is meant to give an extra sheen to furniture that has already been painted with chalk paint.",
        "Read through the painting instructions and apply several coats to your furniture before you begin waxing it.",
        "Aim for even coverage when using your chalk paint.",
        "Thin, level coats will make applying the wax easier.",
        "Smear the wax onto a paper plate.",
        "Scoop the wax onto a knife and put it on a paper plate.",
        "This will give you open access to the wax while you're using it and allow you to mix it with other products as needed.",
        "Although you can keep the wax in its packaging, you may not be able to mix the amount you need with mineral spirits.",
        "Mix your wax with mineral spirits if it is hard to work with.",
        "Mineral spirits are a type of paint thinner that can help make the wax more pliable.",
        "The ratio of wax to mineral spirits should be about 9:1.",
        "Add a small amount of mineral spirits to your wax and mix it in with your knife if is difficult to spread.",
        "When working with mineral spirits, read the label carefully and take all safety precautions that are directed on the label.",
        "Dab a wax brush into the wax.",
        "The wax should lightly coat the tip of your brush.",
        "If you do not have a wax brush, you can use a lint-free cloth as an alternative.",
        "Wax brushes, however, will provide more even coats.",
        "Wax brushes can be purchased at most craft or hardware stores.",
        "Applying the Wax Massage the wax onto a small section of the furniture.",
        "Choose a small area of your furniture, like a quarter of the tabletop or one leg on the chair, to apply the wax first.",
        "Apply the wax to the furniture in circular motions.",
        "Massage in the direction of the grain to thoroughly coat the furniture in wax.",
        "Because Annie Sloan wax enhances the color of chalk paint, the wax should appear to \"darken\" your color slightly.",
        "Wipe a cloth in the direction of the grain to remove excess wax.",
        "Using a separate lint-free cloth, press it along the furniture in the direction of the grain.",
        "This will remove any extra wax to keep your furniture from having a sticky texture.",
        "Repeat this process on all areas of the furniture.",
        "Continue coating the furniture in its first layer of wax until you have covered the entire surface.",
        "After you think you've covered the entire piece of furniture, do a quick check before applying the second layer of wax.",
        "You will want to apply all wax coatings evenly.",
        "Apply second and third layers of wax.",
        "For most pieces of furniture, 2-3 layers is sufficient.",
        "Add more layers to the furniture in exactly the same way you applied the first coating.",
        "Continue applying coats until you are satisfied with the wax's color.",
        "You do not need to wait for the wax to dry in between coats.",
        "Adding Finishing Touches Let the wax dry for 24 hours.",
        "After applying your last coat of wax, let it dry for at least 24 hours before buffing or using your furniture.",
        "This will give the wax time to adhere to the furniture and last longer.",
        "Use a lint-free cloth to buff the furniture.",
        "After 24 hours have passed, take a clean, lint-free cloth and rub it around the furniture in circles.",
        "This should bring out a glossier shine in your wax.",
        "If you prefer a more matte look, skip the buffing process and begin using your furniture after the wax has dried.",
        "Reapply the wax later, as needed.",
        "Annie Sloan wax is meant to be temporary and periodically applied.",
        "If you notice that your furniture looks dull or is more prone to fingerprints, the wax may have worn off.",
        "Apply another layer as soon as you can to keep your furniture clean and the chalk paint undamaged.",
        "How long a wax application will last depends on how often the piece of furniture is used and how roughly it is handled."
    ]
}