{
    "title": "How to Make Body Wash",
    "url": "https://www.wikihow.com/Make-Body-Wash",
    "category_hierarchy": [
        "Personal Care and Style",
        "Personal Hygiene",
        "Washing the Body",
        "Bathing"
    ],
    "methods": [
        {
            "name": "Making a Honey Body Wash",
            "steps": [
                {
                    "headline": "Gather your supplies.",
                    "description": "For this honey-based body wash, you will need 2/3 cup (150 milliliters) of unscented liquid Castile soap, ¼ cup (56.25 milliliters) of raw honey, 2 teaspoons of oil, and 50 – 60 drops of essential oil. You will also need a container with a tight-fitting lid, such as a bottle, mason jar, or even an old body wash bottle. You can use any natural oil, such as: castor, coconut, grape seed, jojoba, extra light olive, sesame, sunflower, or sweet almond. For additional benefits, add 1 teaspoon of Vitamin E oil. It will not only moisturize and nourish your skin, but also help extend the shelf-life of your body wash."
                },
                {
                    "headline": "Open your container and pour in your soap and honey.",
                    "description": "If your container has a small mouth, such as a bottle or old body wash bottle, then you can put a funnel over the mouth first. This will make it easier to pour everything in and prevent any spills from happening."
                },
                {
                    "headline": "Choose your natural oil and pour it in.",
                    "description": "You will need 2 teaspoons of a natural oil. The type of oil you use will depend on what you have available and your preference. Different types of oils, however, are more beneficial to certain skin types, so you could consider using an oil that would be the most helpful for your skin. Here are some suggestions:\nIf you have dry skin, consider using extra moisturizing oils, such as: almond, argan, avocado, canola, extra light olive oil, jojoba, and safflower oil. If you have oily skin, consider using a lighter oil in your body wash, such as: grape seed, sesame, and sunflower oil. If you have sensitive skin, use a nourishing oil such as: avocado, coconut, and flaxseed oil."
                },
                {
                    "headline": "Choose your essential oil and add it in.",
                    "description": "You can use any type of essential oil you'd like, but keep in mind that certain scents may contrast with the honey and base oil that you use. Other oils, such as peppermint, are very strong and may require smaller amounts. Here are some oils and combinations that you can use:\nCombine 45 drops of lavender essential oil and 15 drops of geranium for a fragrant, floral blend. Lavender is a classical scent that works well for all skin types. It may also help reduce stress and anxiety. Geranium  has a floral scent. It is especially great of oily and mature skin. Chamomile has a delicate scent that pairs well with honey. It is ideal for sensitive skin. Rosemary pairs well with lavender. It is refreshing and effective on acne. For a refreshing blend, consider using grapefruit, lemon, orange, or sweet orange."
                },
                {
                    "headline": "Close the container tightly and shake.",
                    "description": "You will need to do this for a few minutes until everything is mixed together."
                },
                {
                    "headline": "Consider decorating your container.",
                    "description": "You can leave the bottle or jar as it is, or you can make it extra special by embellishing it with labels, twine, and other decorations. You can even make a large batch of body wash, put it into smaller containers, and distribute it as party favors. Here are some ideas:\nPrint out a label and stick it on the bottle or jar. Make a mason jar extra cute by tying a piece of twine or ribbon around the lid. Decorate the bottle or jar with stick-on gemstones. Decorate the cork or lid. You can paint a jar lid with acrylic paint. You can also decorate your lid or cork by hot gluing rhinestones and fancy buttons onto it."
                },
                {
                    "headline": "Use your body wash. You can use this as any other store-bought body wash. Because you used natural ingredients, however, try to use this body wash within one year.",
                    "description": "You will have to shake the container each time before you use it, as the ingredients will settle."
                }
            ]
        },
        {
            "name": "Making a Milk 'n Honey Body Wash",
            "steps": [
                {
                    "headline": "Gather your ingredients.",
                    "description": "For this body wash, you will need ½ cup (112.50 milliliters) of coconut milk, ½ cup (112.50 milliliters) of unscented liquid Castile soap, ⅓ cup (75 milliliters) of raw honey, and 7 drops of essential oil. You will also need a container with a tight-fitting lid, such as a bottle, mason jar, or even an old body wash bottle."
                },
                {
                    "headline": "Pour in your coconut milk, Castile soap, and honey.",
                    "description": "Open your container and pour everything in. If your are using a container with a small mouth, such as a bottle or an old body wash container, then you can put a funnel over the mouth before pouring everything in. The funnel will help guide all of your ingredients into the container and prevent any spills."
                },
                {
                    "headline": "Choose and add your essential oil.",
                    "description": "You can use any essential oil that you like. Lavender essential oil blends especially well with coconut and honey. For an even sweeter scent, consider using vanilla essential oil."
                },
                {
                    "headline": "Close the container tightly and shake.",
                    "description": "Do this for a few minutes until everything is blended together."
                },
                {
                    "headline": "Consider decorating your container.",
                    "description": "You can leave the bottle or jar plain, or you can decorate it with labels, twine, and other decorations. Because this body wash is perishable, it is not recommended to distributed as party favors. Here are some decorating ideas:\nPrint out a label and stick it on the bottle or jar. Tie a piece of twine or ribbon around the lid of the jar. Glue gemstones onto the bottle or jar. Decorate the cork or lid. You can do this by painting the jar lid with acrylic paint. You can also decorate your lid or cork by hot gluing rhinestones and fancy buttons onto it."
                },
                {
                    "headline": "Use your body wash. You can use this as any other store-bought body wash. Because the ingredients you have used in this body wash are perishable, you will need to use it within two weeks or keep it in the refrigerator.",
                    "description": "You will have to shake the container each time before you use it, as the ingredients will settle."
                }
            ]
        },
        {
            "name": "Making a Romantic Rose Body Wash",
            "steps": [
                {
                    "headline": "Gather your ingredients.",
                    "description": "For this body wash, you will need 2 cups (450 milliliters) of unscented liquid Castile soap, 1 cup (225 milliliters) of rose water, 3 tablespoons of melted coconut oil, and 15-20 drops lavender essential oil. You will also need a quart-sized mason jar for mixing the body wash. If you do not have rose water, you can make you own by adding 12 drops of rose oil to 1 cup (225 milliliters) of distilled water, and mixing. After you have mixed your body wash, you can transfer it into smaller bottles or old body wash containers."
                },
                {
                    "headline": "Melt your coconut oil.",
                    "description": "Unlike most oils, coconut oil is very thick and solid. You will need to soften it before you can use it in this recipe. You can do this by heating it in the microwave for a few seconds or warming it in a double boiler."
                },
                {
                    "headline": "Pour all of your ingredients into your mason jar.",
                    "description": "You can transfer all of your ingredients into a smaller container later. If you are mixing your own rose water, you will need to do that first in a separate container before adding it to the coconut oil, essential oil, and soap."
                },
                {
                    "headline": "Close the container tightly and shake.",
                    "description": "Keep shaking until all of the ingredients are combined."
                },
                {
                    "headline": "Consider transferring your body wash into smaller containers.",
                    "description": "The quart-sized mason jar might be cumbersome to handle to the shower. You can pour your body wash into smaller containers, such as mini mason jars, small glass bottles, or even old body wash bottles. If your new container has a small mouth, such as a bottle, then you can place a funnel over the mouth of the small container first before pouring in the body wash. The funnel will make sure that everything goes into the new container and that nothing gets spilt or goes to waste."
                },
                {
                    "headline": "Consider decorating your containers.",
                    "description": "You can leave the smaller containers as they are, or you can give them a personal touch by embellishing them with labels, twine, and other decorations. You can even pour the body wash into tiny bottles and use them as party favors. Here are some decorating ideas:\nPrint out a label and stick it on the bottle or jar. Tie a piece of twine or ribbon around the jar lid. Decorate the bottle or jar with gemstones. You can glue them on using hot glue or purchase stick-on gemstones. Decorate the cork or lid. You can paint the jar lid with acrylic paint. You can also decorate the lid or cork by hot gluing rhinestones and fancy buttons onto it."
                },
                {
                    "headline": "Use your body wash. You can use this as any other store-bought body wash. Be sure to shake it each time before you use it, as the ingredients will settle.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Things You'll Need for a Honey Body Wash",
        "[9]",
        "X",
        "Research source",
        "2/3 cup (150 milliliters) liquid Castile soap, unscented",
        "¼ cup (56.25 milliliters) raw honey",
        "2 teaspoons of oil",
        "1 teaspoon Vitamin E oil (optional)",
        "50 – 60 drops essential oil",
        "Things You'll Need for a Milk 'n Honey Body Wash",
        "[10]",
        "½ cup (112.50 milliliters) coconut milk",
        "½ cup (112.50 milliliters) liquid Castile soap, unscented",
        "⅓ cup (75 milliliters) raw honey",
        "7 drops of essential oil",
        "Things You'll Need for a Romantic Rose Body Wash",
        "[11]",
        "2 cups (450 milliliters) liquid Castile soap, unscented",
        "1 cup (225 milliliters) rose water",
        "3 tablespoons coconut oil (melted)",
        "15-20 drops lavender essential oil"
    ],
    "text": " Making a Honey Body Wash Gather your supplies. For this honey-based body wash, you will need 2/3 cup (150 milliliters) of unscented liquid Castile soap, ¼ cup (56.25 milliliters) of raw honey, 2 teaspoons of oil, and 50 – 60 drops of essential oil. You will also need a container with a tight-fitting lid, such as a bottle, mason jar, or even an old body wash bottle. You can use any natural oil, such as: castor, coconut, grape seed, jojoba, extra light olive, sesame, sunflower, or sweet almond. For additional benefits, add 1 teaspoon of Vitamin E oil. It will not only moisturize and nourish your skin, but also help extend the shelf-life of your body wash. Open your container and pour in your soap and honey. If your container has a small mouth, such as a bottle or old body wash bottle, then you can put a funnel over the mouth first. This will make it easier to pour everything in and prevent any spills from happening. Choose your natural oil and pour it in. You will need 2 teaspoons of a natural oil. The type of oil you use will depend on what you have available and your preference. Different types of oils, however, are more beneficial to certain skin types, so you could consider using an oil that would be the most helpful for your skin. Here are some suggestions:\nIf you have dry skin, consider using extra moisturizing oils, such as: almond, argan, avocado, canola, extra light olive oil, jojoba, and safflower oil. If you have oily skin, consider using a lighter oil in your body wash, such as: grape seed, sesame, and sunflower oil. If you have sensitive skin, use a nourishing oil such as: avocado, coconut, and flaxseed oil. Choose your essential oil and add it in. You can use any type of essential oil you'd like, but keep in mind that certain scents may contrast with the honey and base oil that you use. Other oils, such as peppermint, are very strong and may require smaller amounts. Here are some oils and combinations that you can use:\nCombine 45 drops of lavender essential oil and 15 drops of geranium for a fragrant, floral blend. Lavender is a classical scent that works well for all skin types. It may also help reduce stress and anxiety. Geranium  has a floral scent. It is especially great of oily and mature skin. Chamomile has a delicate scent that pairs well with honey. It is ideal for sensitive skin. Rosemary pairs well with lavender. It is refreshing and effective on acne. For a refreshing blend, consider using grapefruit, lemon, orange, or sweet orange. Close the container tightly and shake. You will need to do this for a few minutes until everything is mixed together. Consider decorating your container. You can leave the bottle or jar as it is, or you can make it extra special by embellishing it with labels, twine, and other decorations. You can even make a large batch of body wash, put it into smaller containers, and distribute it as party favors. Here are some ideas:\nPrint out a label and stick it on the bottle or jar. Make a mason jar extra cute by tying a piece of twine or ribbon around the lid. Decorate the bottle or jar with stick-on gemstones. Decorate the cork or lid. You can paint a jar lid with acrylic paint. You can also decorate your lid or cork by hot gluing rhinestones and fancy buttons onto it. Use your body wash. You can use this as any other store-bought body wash. Because you used natural ingredients, however, try to use this body wash within one year. You will have to shake the container each time before you use it, as the ingredients will settle. Making a Milk 'n Honey Body Wash Gather your ingredients. For this body wash, you will need ½ cup (112.50 milliliters) of coconut milk, ½ cup (112.50 milliliters) of unscented liquid Castile soap, ⅓ cup (75 milliliters) of raw honey, and 7 drops of essential oil. You will also need a container with a tight-fitting lid, such as a bottle, mason jar, or even an old body wash bottle. Pour in your coconut milk, Castile soap, and honey. Open your container and pour everything in. If your are using a container with a small mouth, such as a bottle or an old body wash container, then you can put a funnel over the mouth before pouring everything in. The funnel will help guide all of your ingredients into the container and prevent any spills. Choose and add your essential oil. You can use any essential oil that you like. Lavender essential oil blends especially well with coconut and honey. For an even sweeter scent, consider using vanilla essential oil. Close the container tightly and shake. Do this for a few minutes until everything is blended together. Consider decorating your container. You can leave the bottle or jar plain, or you can decorate it with labels, twine, and other decorations. Because this body wash is perishable, it is not recommended to distributed as party favors. Here are some decorating ideas:\nPrint out a label and stick it on the bottle or jar. Tie a piece of twine or ribbon around the lid of the jar. Glue gemstones onto the bottle or jar. Decorate the cork or lid. You can do this by painting the jar lid with acrylic paint. You can also decorate your lid or cork by hot gluing rhinestones and fancy buttons onto it. Use your body wash. You can use this as any other store-bought body wash. Because the ingredients you have used in this body wash are perishable, you will need to use it within two weeks or keep it in the refrigerator. You will have to shake the container each time before you use it, as the ingredients will settle. Making a Romantic Rose Body Wash Gather your ingredients. For this body wash, you will need 2 cups (450 milliliters) of unscented liquid Castile soap, 1 cup (225 milliliters) of rose water, 3 tablespoons of melted coconut oil, and 15-20 drops lavender essential oil. You will also need a quart-sized mason jar for mixing the body wash. If you do not have rose water, you can make you own by adding 12 drops of rose oil to 1 cup (225 milliliters) of distilled water, and mixing. After you have mixed your body wash, you can transfer it into smaller bottles or old body wash containers. Melt your coconut oil. Unlike most oils, coconut oil is very thick and solid. You will need to soften it before you can use it in this recipe. You can do this by heating it in the microwave for a few seconds or warming it in a double boiler. Pour all of your ingredients into your mason jar. You can transfer all of your ingredients into a smaller container later. If you are mixing your own rose water, you will need to do that first in a separate container before adding it to the coconut oil, essential oil, and soap. Close the container tightly and shake. Keep shaking until all of the ingredients are combined. Consider transferring your body wash into smaller containers. The quart-sized mason jar might be cumbersome to handle to the shower. You can pour your body wash into smaller containers, such as mini mason jars, small glass bottles, or even old body wash bottles. If your new container has a small mouth, such as a bottle, then you can place a funnel over the mouth of the small container first before pouring in the body wash. The funnel will make sure that everything goes into the new container and that nothing gets spilt or goes to waste. Consider decorating your containers. You can leave the smaller containers as they are, or you can give them a personal touch by embellishing them with labels, twine, and other decorations. You can even pour the body wash into tiny bottles and use them as party favors. Here are some decorating ideas:\nPrint out a label and stick it on the bottle or jar. Tie a piece of twine or ribbon around the jar lid. Decorate the bottle or jar with gemstones. You can glue them on using hot glue or purchase stick-on gemstones. Decorate the cork or lid. You can paint the jar lid with acrylic paint. You can also decorate the lid or cork by hot gluing rhinestones and fancy buttons onto it. Use your body wash. You can use this as any other store-bought body wash. Be sure to shake it each time before you use it, as the ingredients will settle. ",
    "sentences": [
        " Making a Honey Body Wash Gather your supplies.",
        "For this honey-based body wash, you will need 2/3 cup (150 milliliters) of unscented liquid Castile soap, ¼ cup (56.25 milliliters) of raw honey, 2 teaspoons of oil, and 50 – 60 drops of essential oil.",
        "You will also need a container with a tight-fitting lid, such as a bottle, mason jar, or even an old body wash bottle.",
        "You can use any natural oil, such as: castor, coconut, grape seed, jojoba, extra light olive, sesame, sunflower, or sweet almond.",
        "For additional benefits, add 1 teaspoon of Vitamin E oil.",
        "It will not only moisturize and nourish your skin, but also help extend the shelf-life of your body wash. Open your container and pour in your soap and honey.",
        "If your container has a small mouth, such as a bottle or old body wash bottle, then you can put a funnel over the mouth first.",
        "This will make it easier to pour everything in and prevent any spills from happening.",
        "Choose your natural oil and pour it in.",
        "You will need 2 teaspoons of a natural oil.",
        "The type of oil you use will depend on what you have available and your preference.",
        "Different types of oils, however, are more beneficial to certain skin types, so you could consider using an oil that would be the most helpful for your skin.",
        "Here are some suggestions:\nIf you have dry skin, consider using extra moisturizing oils, such as: almond, argan, avocado, canola, extra light olive oil, jojoba, and safflower oil.",
        "If you have oily skin, consider using a lighter oil in your body wash, such as: grape seed, sesame, and sunflower oil.",
        "If you have sensitive skin, use a nourishing oil such as: avocado, coconut, and flaxseed oil.",
        "Choose your essential oil and add it in.",
        "You can use any type of essential oil you'd like, but keep in mind that certain scents may contrast with the honey and base oil that you use.",
        "Other oils, such as peppermint, are very strong and may require smaller amounts.",
        "Here are some oils and combinations that you can use:\nCombine 45 drops of lavender essential oil and 15 drops of geranium for a fragrant, floral blend.",
        "Lavender is a classical scent that works well for all skin types.",
        "It may also help reduce stress and anxiety.",
        "Geranium  has a floral scent.",
        "It is especially great of oily and mature skin.",
        "Chamomile has a delicate scent that pairs well with honey.",
        "It is ideal for sensitive skin.",
        "Rosemary pairs well with lavender.",
        "It is refreshing and effective on acne.",
        "For a refreshing blend, consider using grapefruit, lemon, orange, or sweet orange.",
        "Close the container tightly and shake.",
        "You will need to do this for a few minutes until everything is mixed together.",
        "Consider decorating your container.",
        "You can leave the bottle or jar as it is, or you can make it extra special by embellishing it with labels, twine, and other decorations.",
        "You can even make a large batch of body wash, put it into smaller containers, and distribute it as party favors.",
        "Here are some ideas:\nPrint out a label and stick it on the bottle or jar.",
        "Make a mason jar extra cute by tying a piece of twine or ribbon around the lid.",
        "Decorate the bottle or jar with stick-on gemstones.",
        "Decorate the cork or lid.",
        "You can paint a jar lid with acrylic paint.",
        "You can also decorate your lid or cork by hot gluing rhinestones and fancy buttons onto it.",
        "Use your body wash. You can use this as any other store-bought body wash. Because you used natural ingredients, however, try to use this body wash within one year.",
        "You will have to shake the container each time before you use it, as the ingredients will settle.",
        "Making a Milk 'n Honey Body Wash Gather your ingredients.",
        "For this body wash, you will need ½ cup (112.50 milliliters) of coconut milk, ½ cup (112.50 milliliters) of unscented liquid Castile soap, ⅓ cup (75 milliliters) of raw honey, and 7 drops of essential oil.",
        "You will also need a container with a tight-fitting lid, such as a bottle, mason jar, or even an old body wash bottle.",
        "Pour in your coconut milk, Castile soap, and honey.",
        "Open your container and pour everything in.",
        "If your are using a container with a small mouth, such as a bottle or an old body wash container, then you can put a funnel over the mouth before pouring everything in.",
        "The funnel will help guide all of your ingredients into the container and prevent any spills.",
        "Choose and add your essential oil.",
        "You can use any essential oil that you like.",
        "Lavender essential oil blends especially well with coconut and honey.",
        "For an even sweeter scent, consider using vanilla essential oil.",
        "Close the container tightly and shake.",
        "Do this for a few minutes until everything is blended together.",
        "Consider decorating your container.",
        "You can leave the bottle or jar plain, or you can decorate it with labels, twine, and other decorations.",
        "Because this body wash is perishable, it is not recommended to distributed as party favors.",
        "Here are some decorating ideas:\nPrint out a label and stick it on the bottle or jar.",
        "Tie a piece of twine or ribbon around the lid of the jar.",
        "Glue gemstones onto the bottle or jar.",
        "Decorate the cork or lid.",
        "You can do this by painting the jar lid with acrylic paint.",
        "You can also decorate your lid or cork by hot gluing rhinestones and fancy buttons onto it.",
        "Use your body wash. You can use this as any other store-bought body wash. Because the ingredients you have used in this body wash are perishable, you will need to use it within two weeks or keep it in the refrigerator.",
        "You will have to shake the container each time before you use it, as the ingredients will settle.",
        "Making a Romantic Rose Body Wash Gather your ingredients.",
        "For this body wash, you will need 2 cups (450 milliliters) of unscented liquid Castile soap, 1 cup (225 milliliters) of rose water, 3 tablespoons of melted coconut oil, and 15-20 drops lavender essential oil.",
        "You will also need a quart-sized mason jar for mixing the body wash.",
        "If you do not have rose water, you can make you own by adding 12 drops of rose oil to 1 cup (225 milliliters) of distilled water, and mixing.",
        "After you have mixed your body wash, you can transfer it into smaller bottles or old body wash containers.",
        "Melt your coconut oil.",
        "Unlike most oils, coconut oil is very thick and solid.",
        "You will need to soften it before you can use it in this recipe.",
        "You can do this by heating it in the microwave for a few seconds or warming it in a double boiler.",
        "Pour all of your ingredients into your mason jar.",
        "You can transfer all of your ingredients into a smaller container later.",
        "If you are mixing your own rose water, you will need to do that first in a separate container before adding it to the coconut oil, essential oil, and soap.",
        "Close the container tightly and shake.",
        "Keep shaking until all of the ingredients are combined.",
        "Consider transferring your body wash into smaller containers.",
        "The quart-sized mason jar might be cumbersome to handle to the shower.",
        "You can pour your body wash into smaller containers, such as mini mason jars, small glass bottles, or even old body wash bottles.",
        "If your new container has a small mouth, such as a bottle, then you can place a funnel over the mouth of the small container first before pouring in the body wash.",
        "The funnel will make sure that everything goes into the new container and that nothing gets spilt or goes to waste.",
        "Consider decorating your containers.",
        "You can leave the smaller containers as they are, or you can give them a personal touch by embellishing them with labels, twine, and other decorations.",
        "You can even pour the body wash into tiny bottles and use them as party favors.",
        "Here are some decorating ideas:\nPrint out a label and stick it on the bottle or jar.",
        "Tie a piece of twine or ribbon around the jar lid.",
        "Decorate the bottle or jar with gemstones.",
        "You can glue them on using hot glue or purchase stick-on gemstones.",
        "Decorate the cork or lid.",
        "You can paint the jar lid with acrylic paint.",
        "You can also decorate the lid or cork by hot gluing rhinestones and fancy buttons onto it.",
        "Use your body wash. You can use this as any other store-bought body wash. Be sure to shake it each time before you use it, as the ingredients will settle."
    ]
}