{
    "title": "How to Clean Oculus Rift Lenses",
    "url": "https://www.wikihow.com/Clean-Oculus-Rift-Lenses",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Cleaning"
    ],
    "parts": [
        {
            "name": "Cleaning the Sensor and Headset Lenses",
            "steps": [
                {
                    "headline": "Use compressed air to clear any dust from the lens.",
                    "description": "Your lens will accumulate dust after sitting out for a while, and it’s best to remove the dust before wiping off the lens. A few shots of air should be enough to clean off any dust on the lens. Cans of compressed air are available at most electronic supply shops and hardware stores. The can should come with a thin straw that can be inserted in the spray spout for greater accuracy."
                },
                {
                    "headline": "Wipe the lens with a dry microfiber cloth.",
                    "description": "An optical lens microfiber cloth, like those used to clean eyeglasses, is ideal. Never use liquid cleaners or water on your lenses, as moisture can damage the electronic components."
                },
                {
                    "headline": "Start in the center of the lens and wipe in a circular motion.",
                    "description": "Use the microfiber cloth to wipe a small circle in the center of the lens. Then wipe in increasingly larger circles until you reach the outer edge of the lens. Do this 2 or 3 times if necessary."
                },
                {
                    "headline": "Cut phone screen protectors to fit the lenses for extra protection.",
                    "description": "If you want to protect your lenses from dust and oils, it can be a good idea to use plastic protectors like those used on phone screens. You can do this by buying phone screen protectors and cutting them to fit the shape of your lenses. Change them whenever they become dirty, streaked or dusty."
                }
            ]
        },
        {
            "name": "Cleaning the Face Cushion and Headphones",
            "steps": [
                {
                    "headline": "Remove any dust with compressed air.",
                    "description": "Your headset can become dusty over time, especially if you haven’t used it for a while. Compressed air will remove dust quickly without leaving streaks or residue."
                },
                {
                    "headline": "Wipe the surfaces down with skin-safe anti-bacterial wipes.",
                    "description": "Baby wipes, makeup removal cloths, or hand wipes are good choices for cleaning your headset. Make sure the product you use is meant for skin, since it will be in contact with your face. Avoid using anything that contains alcohol."
                },
                {
                    "headline": "Let the headset air-dry thoroughly before using it again.",
                    "description": "After you wipe down the headset, it may be slightly moist. Wait until it’s dry to the touch before you wear it again. It should only take a few moments."
                },
                {
                    "headline": "Buy a replacement face cushion if yours is extremely dirty or worn.",
                    "description": "Many headsets have removable face cushions. If you buy a replacement, you can remove your old one and clean it thoroughly with water and dish detergent, then let it dry. When your new face cushion becomes dirty, you can swap them again."
                }
            ]
        },
        {
            "name": "Taking Care of Your Headset",
            "steps": [
                {
                    "headline": "Clean your lenses, face cushion, and headphones at least once a month.",
                    "description": "If you use your Oculus Rift regularly, it’s a good idea to clean it on a monthly basis even if it doesn’t look dirty. Dust, grease, and skin dander may not always be visible when they accumulate on your gear. If any part of your headset seems dirty between monthly cleanings, go ahead and clean it as soon as you notice it’s dirty."
                },
                {
                    "headline": "Clean your face with a skin-safe anti-bacterial wipe before playing.",
                    "description": "To reduce the amount of oils, grease, and dead skin that ends up on your headset, it’s a good idea to clean your face before you put the headset on. Remove any makeup and wash your face thoroughly with soap and water or a skin-safe anti-bacterial wipe."
                },
                {
                    "headline": "Use a fan or air conditioning when you play to reduce sweating.",
                    "description": "When you wear your headset, sweat and oil tend to accumulate on your face cushion and headphones. You can help reduce this by keeping your face as cool and dry as possible while you play. Keep the air conditioning on or position a fan to blow towards you while you are wearing the headset."
                },
                {
                    "headline": "Keep your headset in a drawer or cloth bag to protect it from dust.",
                    "description": "Leaving your headset out can cause it to accumulate dust, even if you use it often. A box, drawer, drawstring bag, or even backpack can be a good way to keep your headset clear of dust."
                },
                {
                    "headline": "Place a cloth over the bridge of your nose to reduce fogging.",
                    "description": "Some players experience foggy lenses when the hot air exhaled through their nose gets into their headset. You can help reduce this effect by placing a thin cloth or sleeping mask between the headset and the bridge of your nose. This will create a small gap for your breath to escape through and reduce fogging on your lenses."
                },
                {
                    "headline": "Buy a removable headset cover.",
                    "description": "Some companies, such as VR Cover, offer removable, machine-washable cotton headset covers. These often absorb sweat and oils better than the faux leather that many headsets come with, and can be replaced when they become too dirty."
                }
            ]
        }
    ],
    "tyn": [
        "Compressed air",
        "Skin-safe anti-bacterial wipes",
        "Cloth bag for storing headset (optional)",
        "Cloth or sleeping mask (optional)",
        "Microfiber cloth",
        "Phone screen protectors (optional)"
    ],
    "text": " Cleaning the Sensor and Headset Lenses Use compressed air to clear any dust from the lens. Your lens will accumulate dust after sitting out for a while, and it’s best to remove the dust before wiping off the lens. A few shots of air should be enough to clean off any dust on the lens. Cans of compressed air are available at most electronic supply shops and hardware stores. The can should come with a thin straw that can be inserted in the spray spout for greater accuracy. Wipe the lens with a dry microfiber cloth. An optical lens microfiber cloth, like those used to clean eyeglasses, is ideal. Never use liquid cleaners or water on your lenses, as moisture can damage the electronic components. Start in the center of the lens and wipe in a circular motion. Use the microfiber cloth to wipe a small circle in the center of the lens. Then wipe in increasingly larger circles until you reach the outer edge of the lens. Do this 2 or 3 times if necessary. Cut phone screen protectors to fit the lenses for extra protection. If you want to protect your lenses from dust and oils, it can be a good idea to use plastic protectors like those used on phone screens. You can do this by buying phone screen protectors and cutting them to fit the shape of your lenses. Change them whenever they become dirty, streaked or dusty. Cleaning the Face Cushion and Headphones Remove any dust with compressed air. Your headset can become dusty over time, especially if you haven’t used it for a while. Compressed air will remove dust quickly without leaving streaks or residue. Wipe the surfaces down with skin-safe anti-bacterial wipes. Baby wipes, makeup removal cloths, or hand wipes are good choices for cleaning your headset. Make sure the product you use is meant for skin, since it will be in contact with your face. Avoid using anything that contains alcohol. Let the headset air-dry thoroughly before using it again. After you wipe down the headset, it may be slightly moist. Wait until it’s dry to the touch before you wear it again. It should only take a few moments. Buy a replacement face cushion if yours is extremely dirty or worn. Many headsets have removable face cushions. If you buy a replacement, you can remove your old one and clean it thoroughly with water and dish detergent, then let it dry. When your new face cushion becomes dirty, you can swap them again. Taking Care of Your Headset Clean your lenses, face cushion, and headphones at least once a month. If you use your Oculus Rift regularly, it’s a good idea to clean it on a monthly basis even if it doesn’t look dirty. Dust, grease, and skin dander may not always be visible when they accumulate on your gear. If any part of your headset seems dirty between monthly cleanings, go ahead and clean it as soon as you notice it’s dirty. Clean your face with a skin-safe anti-bacterial wipe before playing. To reduce the amount of oils, grease, and dead skin that ends up on your headset, it’s a good idea to clean your face before you put the headset on. Remove any makeup and wash your face thoroughly with soap and water or a skin-safe anti-bacterial wipe. Use a fan or air conditioning when you play to reduce sweating. When you wear your headset, sweat and oil tend to accumulate on your face cushion and headphones. You can help reduce this by keeping your face as cool and dry as possible while you play. Keep the air conditioning on or position a fan to blow towards you while you are wearing the headset. Keep your headset in a drawer or cloth bag to protect it from dust. Leaving your headset out can cause it to accumulate dust, even if you use it often. A box, drawer, drawstring bag, or even backpack can be a good way to keep your headset clear of dust. Place a cloth over the bridge of your nose to reduce fogging. Some players experience foggy lenses when the hot air exhaled through their nose gets into their headset. You can help reduce this effect by placing a thin cloth or sleeping mask between the headset and the bridge of your nose. This will create a small gap for your breath to escape through and reduce fogging on your lenses. Buy a removable headset cover. Some companies, such as VR Cover, offer removable, machine-washable cotton headset covers. These often absorb sweat and oils better than the faux leather that many headsets come with, and can be replaced when they become too dirty.",
    "sentences": [
        " Cleaning the Sensor and Headset Lenses Use compressed air to clear any dust from the lens.",
        "Your lens will accumulate dust after sitting out for a while, and it’s best to remove the dust before wiping off the lens.",
        "A few shots of air should be enough to clean off any dust on the lens.",
        "Cans of compressed air are available at most electronic supply shops and hardware stores.",
        "The can should come with a thin straw that can be inserted in the spray spout for greater accuracy.",
        "Wipe the lens with a dry microfiber cloth.",
        "An optical lens microfiber cloth, like those used to clean eyeglasses, is ideal.",
        "Never use liquid cleaners or water on your lenses, as moisture can damage the electronic components.",
        "Start in the center of the lens and wipe in a circular motion.",
        "Use the microfiber cloth to wipe a small circle in the center of the lens.",
        "Then wipe in increasingly larger circles until you reach the outer edge of the lens.",
        "Do this 2 or 3 times if necessary.",
        "Cut phone screen protectors to fit the lenses for extra protection.",
        "If you want to protect your lenses from dust and oils, it can be a good idea to use plastic protectors like those used on phone screens.",
        "You can do this by buying phone screen protectors and cutting them to fit the shape of your lenses.",
        "Change them whenever they become dirty, streaked or dusty.",
        "Cleaning the Face Cushion and Headphones Remove any dust with compressed air.",
        "Your headset can become dusty over time, especially if you haven’t used it for a while.",
        "Compressed air will remove dust quickly without leaving streaks or residue.",
        "Wipe the surfaces down with skin-safe anti-bacterial wipes.",
        "Baby wipes, makeup removal cloths, or hand wipes are good choices for cleaning your headset.",
        "Make sure the product you use is meant for skin, since it will be in contact with your face.",
        "Avoid using anything that contains alcohol.",
        "Let the headset air-dry thoroughly before using it again.",
        "After you wipe down the headset, it may be slightly moist.",
        "Wait until it’s dry to the touch before you wear it again.",
        "It should only take a few moments.",
        "Buy a replacement face cushion if yours is extremely dirty or worn.",
        "Many headsets have removable face cushions.",
        "If you buy a replacement, you can remove your old one and clean it thoroughly with water and dish detergent, then let it dry.",
        "When your new face cushion becomes dirty, you can swap them again.",
        "Taking Care of Your Headset Clean your lenses, face cushion, and headphones at least once a month.",
        "If you use your Oculus Rift regularly, it’s a good idea to clean it on a monthly basis even if it doesn’t look dirty.",
        "Dust, grease, and skin dander may not always be visible when they accumulate on your gear.",
        "If any part of your headset seems dirty between monthly cleanings, go ahead and clean it as soon as you notice it’s dirty.",
        "Clean your face with a skin-safe anti-bacterial wipe before playing.",
        "To reduce the amount of oils, grease, and dead skin that ends up on your headset, it’s a good idea to clean your face before you put the headset on.",
        "Remove any makeup and wash your face thoroughly with soap and water or a skin-safe anti-bacterial wipe.",
        "Use a fan or air conditioning when you play to reduce sweating.",
        "When you wear your headset, sweat and oil tend to accumulate on your face cushion and headphones.",
        "You can help reduce this by keeping your face as cool and dry as possible while you play.",
        "Keep the air conditioning on or position a fan to blow towards you while you are wearing the headset.",
        "Keep your headset in a drawer or cloth bag to protect it from dust.",
        "Leaving your headset out can cause it to accumulate dust, even if you use it often.",
        "A box, drawer, drawstring bag, or even backpack can be a good way to keep your headset clear of dust.",
        "Place a cloth over the bridge of your nose to reduce fogging.",
        "Some players experience foggy lenses when the hot air exhaled through their nose gets into their headset.",
        "You can help reduce this effect by placing a thin cloth or sleeping mask between the headset and the bridge of your nose.",
        "This will create a small gap for your breath to escape through and reduce fogging on your lenses.",
        "Buy a removable headset cover.",
        "Some companies, such as VR Cover, offer removable, machine-washable cotton headset covers.",
        "These often absorb sweat and oils better than the faux leather that many headsets come with, and can be replaced when they become too dirty."
    ]
}