{
    "title": "How to Rip a Phonebook in Half",
    "url": "https://www.wikihow.com/Rip-a-Phonebook-in-Half",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Performing Arts",
        "Magic and Illusion Performance"
    ],
    "methods": [
        {
            "name": "Traditional Method",
            "steps": [
                {
                    "headline": "Move your hands as far out toward the corners of the book as possible.",
                    "description": "Make sure all your fingers still fit on the book. If it's a small, narrow phone book, your thumbs may be touching in the middle, but if it's a large, broad book you will probably have some space between your hands."
                },
                {
                    "headline": "Use your thumbs to bend down the center of the phone book.",
                    "description": "Put your thumbs close together in the middle (though still along the top edge) of the book. Push down with your thumbs so that the center of the book bends down to form a sort of crease."
                },
                {
                    "headline": "Place your index fingers to the sides of the fold.",
                    "description": "While your thumbs will be on the top side (the front) of the book, your other fingers will all be folded over the edge so that they grip the bottom side (in other words, the back) of the book. Your index fingers (also called pointer fingers) should be right against the sides of the fold your thumbs have created."
                },
                {
                    "headline": "Bend the side edges of the book downward with your fingers.",
                    "description": "Keeping your thumbs (and the crease) in position, begin to bend the corners of the book down while also pushing inward on the crease. You'll feel your chest (pectoral) muscles being used if you're doing it right. The crease in the book will become more accentuated, and if you look carefully at the crease, you'll be able to see pockets of air form between the pages."
                },
                {
                    "headline": "Rotate your hands to tear the book.",
                    "description": "Twist the right side of the book up with your right hand while twisting the left side down with your left hand (this can be reversed depending on what's comfortable for you). Maintain a firm grip on the book at all times, and use your pectoral muscles to keep firm inward pressure on the book. The book should begin to tear."
                },
                {
                    "headline": "Tear through the book.",
                    "description": "If you're strong enough and maintain a good grip on the book, you may be able to rip the book all the way down the center of its length in one shot. Otherwise you may need to reposition your hands and continue ripping less gracefully. Either way, it will be impressive. Now, if you want to be able to rip ANY paperback glued book in two, then just rip it vertically along the spine! If it´s a bit thick, break the spine by knocking/kicking the book backwards along the spine."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Oven Method",
            "steps": [
                {
                    "headline": "Bake the book, 200 degrees Fahrenheit (93 degrees Celsius) for about 2 hours.",
                    "description": "Paper burns at 451 F (233 Celsius). Do not cook above 300ºF, that will set your oven on fire. Watch the oven for the entire 2 hours to reduce fire risk."
                },
                {
                    "headline": "Let it cool, it will be really hot.",
                    "description": ""
                },
                {
                    "headline": "Once cool, stash it back with the other books.",
                    "description": "It will look exactly the same as it did before."
                },
                {
                    "headline": "Invite some friends over.",
                    "description": "At some point make a big show about \"hulk being angry\" then pull out the book."
                },
                {
                    "headline": "Tear it!",
                    "description": "(It won't be hard at all.) Ripped phone book, no muscle required, only science."
                }
            ]
        }
    ],
    "tyn": [
        "A phone book",
        "Two hands",
        "(optional) Oven"
    ],
    "text": " Traditional Method Move your hands as far out toward the corners of the book as possible. Make sure all your fingers still fit on the book. If it's a small, narrow phone book, your thumbs may be touching in the middle, but if it's a large, broad book you will probably have some space between your hands. Use your thumbs to bend down the center of the phone book. Put your thumbs close together in the middle (though still along the top edge) of the book. Push down with your thumbs so that the center of the book bends down to form a sort of crease. Place your index fingers to the sides of the fold. While your thumbs will be on the top side (the front) of the book, your other fingers will all be folded over the edge so that they grip the bottom side (in other words, the back) of the book. Your index fingers (also called pointer fingers) should be right against the sides of the fold your thumbs have created. Bend the side edges of the book downward with your fingers. Keeping your thumbs (and the crease) in position, begin to bend the corners of the book down while also pushing inward on the crease. You'll feel your chest (pectoral) muscles being used if you're doing it right. The crease in the book will become more accentuated, and if you look carefully at the crease, you'll be able to see pockets of air form between the pages. Rotate your hands to tear the book. Twist the right side of the book up with your right hand while twisting the left side down with your left hand (this can be reversed depending on what's comfortable for you). Maintain a firm grip on the book at all times, and use your pectoral muscles to keep firm inward pressure on the book. The book should begin to tear. Tear through the book. If you're strong enough and maintain a good grip on the book, you may be able to rip the book all the way down the center of its length in one shot. Otherwise you may need to reposition your hands and continue ripping less gracefully. Either way, it will be impressive. Now, if you want to be able to rip ANY paperback glued book in two, then just rip it vertically along the spine! If it´s a bit thick, break the spine by knocking/kicking the book backwards along the spine. Finished.  Oven Method Bake the book, 200 degrees Fahrenheit (93 degrees Celsius) for about 2 hours. Paper burns at 451 F (233 Celsius). Do not cook above 300ºF, that will set your oven on fire. Watch the oven for the entire 2 hours to reduce fire risk. Let it cool, it will be really hot.  Once cool, stash it back with the other books. It will look exactly the same as it did before. Invite some friends over. At some point make a big show about \"hulk being angry\" then pull out the book. Tear it! (It won't be hard at all.) Ripped phone book, no muscle required, only science.",
    "sentences": [
        " Traditional Method Move your hands as far out toward the corners of the book as possible.",
        "Make sure all your fingers still fit on the book.",
        "If it's a small, narrow phone book, your thumbs may be touching in the middle, but if it's a large, broad book you will probably have some space between your hands.",
        "Use your thumbs to bend down the center of the phone book.",
        "Put your thumbs close together in the middle (though still along the top edge) of the book.",
        "Push down with your thumbs so that the center of the book bends down to form a sort of crease.",
        "Place your index fingers to the sides of the fold.",
        "While your thumbs will be on the top side (the front) of the book, your other fingers will all be folded over the edge so that they grip the bottom side (in other words, the back) of the book.",
        "Your index fingers (also called pointer fingers) should be right against the sides of the fold your thumbs have created.",
        "Bend the side edges of the book downward with your fingers.",
        "Keeping your thumbs (and the crease) in position, begin to bend the corners of the book down while also pushing inward on the crease.",
        "You'll feel your chest (pectoral) muscles being used if you're doing it right.",
        "The crease in the book will become more accentuated, and if you look carefully at the crease, you'll be able to see pockets of air form between the pages.",
        "Rotate your hands to tear the book.",
        "Twist the right side of the book up with your right hand while twisting the left side down with your left hand (this can be reversed depending on what's comfortable for you).",
        "Maintain a firm grip on the book at all times, and use your pectoral muscles to keep firm inward pressure on the book.",
        "The book should begin to tear.",
        "Tear through the book.",
        "If you're strong enough and maintain a good grip on the book, you may be able to rip the book all the way down the center of its length in one shot.",
        "Otherwise you may need to reposition your hands and continue ripping less gracefully.",
        "Either way, it will be impressive.",
        "Now, if you want to be able to rip ANY paperback glued book in two, then just rip it vertically along the spine!",
        "If it´s a bit thick, break the spine by knocking/kicking the book backwards along the spine.",
        "Finished.",
        "Oven Method Bake the book, 200 degrees Fahrenheit (93 degrees Celsius) for about 2 hours.",
        "Paper burns at 451 F (233 Celsius).",
        "Do not cook above 300ºF, that will set your oven on fire.",
        "Watch the oven for the entire 2 hours to reduce fire risk.",
        "Let it cool, it will be really hot.",
        "Once cool, stash it back with the other books.",
        "It will look exactly the same as it did before.",
        "Invite some friends over.",
        "At some point make a big show about \"hulk being angry\" then pull out the book.",
        "Tear it!",
        "(It won't be hard at all.)",
        "Ripped phone book, no muscle required, only science."
    ]
}