{
    "title": "How to Keep Dress Shoes from Creasing",
    "url": "https://www.wikihow.com/Keep-Dress-Shoes-from-Creasing",
    "category_hierarchy": [
        "Personal Care and Style",
        "Clothing",
        "Clothes by Type"
    ],
    "methods": [
        {
            "name": "Preventing Creases",
            "steps": [
                {
                    "headline": "Choose shoes that fit you well.",
                    "description": "If there is a gap between your foot and the shoe, the leather will bend more. This is the reason that most shoes crease. This is especially common around the toe box, so look for a pair of dress shoes that fit your foot closely without being too snug."
                },
                {
                    "headline": "Apply water repellent before you wear your shoes for the first time.",
                    "description": "Water repellent will help protect your shoes from moisture in the environment or unexpected water on the ground, which can make your shoes more susceptible to creasing. You can buy water repellent wherever you purchase fine shoes. Water repellent will not make your shoes waterproof, so if you can, you should always avoid situations where your dress shoes will get wet. You may want to reapply the water repellent about once a year."
                },
                {
                    "headline": "Wear your shoes in dry conditions for the first few outings.",
                    "description": "Most leather shoes need about 24 hours of wear before they are fully broken in. You should always avoid getting your dress shoes wet, but getting your shoes wet while you are breaking them in will make them more likely to form creases at the place where your toes bend. Even after your shoes are broken in, avoid getting them wet as it may discolor the leather."
                },
                {
                    "headline": "Use a shoe horn when you put on your dress shoes.",
                    "description": "A shoe horn is a long, flat object that helps you slip the heel of your shoe over your foot. Using a shoe horn will help keep the back of your shoe from breaking down and creasing. You can buy a shoe horn at almost any shoe store."
                },
                {
                    "headline": "Put your dress shoes on a shoe tree as soon as you take them off.",
                    "description": "Shoe trees are inserted into your shoe to absorb moisture and help them hold their shape. Keeping your shoes on the shoe tree when you’re not wearing them is the most important thing you can do to keep your shoes from creasing. You can find shoe trees at most find shoe stores. If you don’t have a shoe tree, stuff your shoes with balled-up tissue paper or newspaper to help them hold their shape."
                },
                {
                    "headline": "Don’t wear the same pair of dress shoes 2 days in a row.",
                    "description": "Give your shoes a whole day to dry out after you wear them. When you wear them on consecutive days, moisture from your feet can settle into the leather, causing creases to form."
                },
                {
                    "headline": "Add toe taps if your dress shoes have a pointed toe.",
                    "description": "Toe taps are small discs which are attached to the very end of the sole on a pointed-toe shoe. They help prevent wear on the tip of the sole, which is where these shoes tend to wear out first. Damage to the sole can cause the upper part of the shoe to become deformed and creased. Toe taps are usually nailed to the sole of the shoe. To ensure your toe taps are affixed correctly, have them put on by a professional cobbler."
                },
                {
                    "headline": "Stuff the inside of your shoes with rolled-up socks before you pack them.",
                    "description": "If you’re going to be traveling, stuffing your dress shoes with socks will help them hold their shape while they’re in your suitcase."
                },
                {
                    "headline": "Condition the leather every 3-6 months.",
                    "description": "Leather conditioner is used to keep the upper portion of your shoe soft and supple, allowing to bend without leaving a permanent crease. The conditioner is similar to a lotion which you gently rub into the leather. Although every 3-6 months is adequate for most people, if you live in an area with a very dry climate, you may want to condition your shoes more often."
                }
            ]
        },
        {
            "name": "Removing Creases with Leather Oil",
            "steps": [
                {
                    "headline": "Moisten the crease with a special leather oil.",
                    "description": "Make sure to really saturate the wrinkle with the oil so the leather around it will become supple. The oil will help protect your shoe from damage when you apply heat to the leather. You can buy leather oil, such as mink oil or neatsfoot oil, at a specialty leather shop or wherever leather shoes are sold."
                },
                {
                    "headline": "Use a heat gun or blow dryer to soften the leather on the top of your shoe.",
                    "description": "Move the nozzle of the heat gun around, never staying in one place for more than 2-3 seconds. The whole process will probably take about a minute. Lighter leathers are susceptible to discoloration when they’re exposed to heat, so test a small area on the heel of the shoe before applying heat to more visible areas."
                },
                {
                    "headline": "Massage the leather until the crease disappears.",
                    "description": "The combination of oil and heat should make the leather pliable. Use your hands to stretch and smooth the crease until it starts to fade."
                },
                {
                    "headline": "Leave the shoe on a shoe tree as it cools.",
                    "description": "Insert the shoe tree as tightly into the shoe as you can. As your shoe cools, the smooth texture will become permanent. Be sure not to tighten the shoe tree too much. Since the leather is hot, it will be prone to stretching."
                }
            ]
        }
    ],
    "tyn": [
        "Leather oil",
        "Heat gun or blow dryer",
        "Shoe tree"
    ],
    "text": " Preventing Creases Choose shoes that fit you well. If there is a gap between your foot and the shoe, the leather will bend more. This is the reason that most shoes crease. This is especially common around the toe box, so look for a pair of dress shoes that fit your foot closely without being too snug. Apply water repellent before you wear your shoes for the first time. Water repellent will help protect your shoes from moisture in the environment or unexpected water on the ground, which can make your shoes more susceptible to creasing. You can buy water repellent wherever you purchase fine shoes. Water repellent will not make your shoes waterproof, so if you can, you should always avoid situations where your dress shoes will get wet. You may want to reapply the water repellent about once a year. Wear your shoes in dry conditions for the first few outings. Most leather shoes need about 24 hours of wear before they are fully broken in. You should always avoid getting your dress shoes wet, but getting your shoes wet while you are breaking them in will make them more likely to form creases at the place where your toes bend. Even after your shoes are broken in, avoid getting them wet as it may discolor the leather. Use a shoe horn when you put on your dress shoes. A shoe horn is a long, flat object that helps you slip the heel of your shoe over your foot. Using a shoe horn will help keep the back of your shoe from breaking down and creasing. You can buy a shoe horn at almost any shoe store. Put your dress shoes on a shoe tree as soon as you take them off. Shoe trees are inserted into your shoe to absorb moisture and help them hold their shape. Keeping your shoes on the shoe tree when you’re not wearing them is the most important thing you can do to keep your shoes from creasing. You can find shoe trees at most find shoe stores. If you don’t have a shoe tree, stuff your shoes with balled-up tissue paper or newspaper to help them hold their shape. Don’t wear the same pair of dress shoes 2 days in a row. Give your shoes a whole day to dry out after you wear them. When you wear them on consecutive days, moisture from your feet can settle into the leather, causing creases to form. Add toe taps if your dress shoes have a pointed toe. Toe taps are small discs which are attached to the very end of the sole on a pointed-toe shoe. They help prevent wear on the tip of the sole, which is where these shoes tend to wear out first. Damage to the sole can cause the upper part of the shoe to become deformed and creased. Toe taps are usually nailed to the sole of the shoe. To ensure your toe taps are affixed correctly, have them put on by a professional cobbler. Stuff the inside of your shoes with rolled-up socks before you pack them. If you’re going to be traveling, stuffing your dress shoes with socks will help them hold their shape while they’re in your suitcase. Condition the leather every 3-6 months. Leather conditioner is used to keep the upper portion of your shoe soft and supple, allowing to bend without leaving a permanent crease. The conditioner is similar to a lotion which you gently rub into the leather. Although every 3-6 months is adequate for most people, if you live in an area with a very dry climate, you may want to condition your shoes more often. Removing Creases with Leather Oil Moisten the crease with a special leather oil. Make sure to really saturate the wrinkle with the oil so the leather around it will become supple. The oil will help protect your shoe from damage when you apply heat to the leather. You can buy leather oil, such as mink oil or neatsfoot oil, at a specialty leather shop or wherever leather shoes are sold. Use a heat gun or blow dryer to soften the leather on the top of your shoe. Move the nozzle of the heat gun around, never staying in one place for more than 2-3 seconds. The whole process will probably take about a minute. Lighter leathers are susceptible to discoloration when they’re exposed to heat, so test a small area on the heel of the shoe before applying heat to more visible areas. Massage the leather until the crease disappears. The combination of oil and heat should make the leather pliable. Use your hands to stretch and smooth the crease until it starts to fade. Leave the shoe on a shoe tree as it cools. Insert the shoe tree as tightly into the shoe as you can. As your shoe cools, the smooth texture will become permanent. Be sure not to tighten the shoe tree too much. Since the leather is hot, it will be prone to stretching.",
    "sentences": [
        " Preventing Creases Choose shoes that fit you well.",
        "If there is a gap between your foot and the shoe, the leather will bend more.",
        "This is the reason that most shoes crease.",
        "This is especially common around the toe box, so look for a pair of dress shoes that fit your foot closely without being too snug.",
        "Apply water repellent before you wear your shoes for the first time.",
        "Water repellent will help protect your shoes from moisture in the environment or unexpected water on the ground, which can make your shoes more susceptible to creasing.",
        "You can buy water repellent wherever you purchase fine shoes.",
        "Water repellent will not make your shoes waterproof, so if you can, you should always avoid situations where your dress shoes will get wet.",
        "You may want to reapply the water repellent about once a year.",
        "Wear your shoes in dry conditions for the first few outings.",
        "Most leather shoes need about 24 hours of wear before they are fully broken in.",
        "You should always avoid getting your dress shoes wet, but getting your shoes wet while you are breaking them in will make them more likely to form creases at the place where your toes bend.",
        "Even after your shoes are broken in, avoid getting them wet as it may discolor the leather.",
        "Use a shoe horn when you put on your dress shoes.",
        "A shoe horn is a long, flat object that helps you slip the heel of your shoe over your foot.",
        "Using a shoe horn will help keep the back of your shoe from breaking down and creasing.",
        "You can buy a shoe horn at almost any shoe store.",
        "Put your dress shoes on a shoe tree as soon as you take them off.",
        "Shoe trees are inserted into your shoe to absorb moisture and help them hold their shape.",
        "Keeping your shoes on the shoe tree when you’re not wearing them is the most important thing you can do to keep your shoes from creasing.",
        "You can find shoe trees at most find shoe stores.",
        "If you don’t have a shoe tree, stuff your shoes with balled-up tissue paper or newspaper to help them hold their shape.",
        "Don’t wear the same pair of dress shoes 2 days in a row.",
        "Give your shoes a whole day to dry out after you wear them.",
        "When you wear them on consecutive days, moisture from your feet can settle into the leather, causing creases to form.",
        "Add toe taps if your dress shoes have a pointed toe.",
        "Toe taps are small discs which are attached to the very end of the sole on a pointed-toe shoe.",
        "They help prevent wear on the tip of the sole, which is where these shoes tend to wear out first.",
        "Damage to the sole can cause the upper part of the shoe to become deformed and creased.",
        "Toe taps are usually nailed to the sole of the shoe.",
        "To ensure your toe taps are affixed correctly, have them put on by a professional cobbler.",
        "Stuff the inside of your shoes with rolled-up socks before you pack them.",
        "If you’re going to be traveling, stuffing your dress shoes with socks will help them hold their shape while they’re in your suitcase.",
        "Condition the leather every 3-6 months.",
        "Leather conditioner is used to keep the upper portion of your shoe soft and supple, allowing to bend without leaving a permanent crease.",
        "The conditioner is similar to a lotion which you gently rub into the leather.",
        "Although every 3-6 months is adequate for most people, if you live in an area with a very dry climate, you may want to condition your shoes more often.",
        "Removing Creases with Leather Oil Moisten the crease with a special leather oil.",
        "Make sure to really saturate the wrinkle with the oil so the leather around it will become supple.",
        "The oil will help protect your shoe from damage when you apply heat to the leather.",
        "You can buy leather oil, such as mink oil or neatsfoot oil, at a specialty leather shop or wherever leather shoes are sold.",
        "Use a heat gun or blow dryer to soften the leather on the top of your shoe.",
        "Move the nozzle of the heat gun around, never staying in one place for more than 2-3 seconds.",
        "The whole process will probably take about a minute.",
        "Lighter leathers are susceptible to discoloration when they’re exposed to heat, so test a small area on the heel of the shoe before applying heat to more visible areas.",
        "Massage the leather until the crease disappears.",
        "The combination of oil and heat should make the leather pliable.",
        "Use your hands to stretch and smooth the crease until it starts to fade.",
        "Leave the shoe on a shoe tree as it cools.",
        "Insert the shoe tree as tightly into the shoe as you can.",
        "As your shoe cools, the smooth texture will become permanent.",
        "Be sure not to tighten the shoe tree too much.",
        "Since the leather is hot, it will be prone to stretching."
    ]
}