{
    "title": "How to Clean a Cricut Mat",
    "url": "https://www.wikihow.com/Clean-a-Cricut-Mat",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Cleaning"
    ],
    "methods": [
        {
            "name": "Cleaning a Traditional Cricut Mat",
            "steps": [
                {
                    "headline": "Give your mat a light cleaning when it loses some of its stickiness.",
                    "description": "In order to keep your mat sticky for as long as possible, it's a good idea to clean it regularly. First scrape it off with a plastic scraper, either Cricut brand or any other type of hard plastic scraper. Then wipe an alcohol-free baby wipe or roll a lint roller over the surface. A lint roller is usually stickier than the mat, so it's able to remove any debris that is stuck to the mat. The baby wipes are able to gently wet down the surface and remove debris without damaging the mat."
                },
                {
                    "headline": "Rub the surface with soap and water.",
                    "description": "If you have used your mat repeatedly and it is really lacking stickiness, the surface may need a light scrub. Put a small amount of dish soap and warm water over the surface and scrub it lightly with a soft brush. Then rinse the surface off with warm water. If you want to use a sponge on the surface, try a Magic Eraser. This type of sponge will be gentle enough on the surface and it is good at removing residue."
                },
                {
                    "headline": "Spray a degreaser on the mat.",
                    "description": "If your mat is very dirty and has no stickiness left, you will need to use a stronger cleaner. Degreasers will cut through whatever is on the surface and remove it. However, they can leave a residue, so the mat needs to be cleaned with soap and water after using a degreaser. Using a strong degreaser may diminish the stickiness of the mat. However, you can replenish the stickiness after it is clean and dry."
                },
                {
                    "headline": "Let the mat air dry.",
                    "description": "Once clean, put the mat on a drying rack or hang it up so that both sides of it are able to dry completely. Whatever type of cleaning you do, it's important to let the mat dry before using it in the machine again. Any remaining moisture will minimize its stickiness and could damage the machine. Do not use a towel to dry the mat. Rubbing a towel over the sticky surface will cover it with fibers, minimizing its effectiveness."
                }
            ]
        },
        {
            "name": "Cleaning Cricut Cake Mats",
            "steps": [
                {
                    "headline": "Remove all frosting, fondant, or gum paste.",
                    "description": "There are some Cricut machines that are made specifically to cut decorative pieces out of gum paste, frosting sheets, and fondant. Once the decorative pieces have been cut and pulled off the mat, you will need to remove all excess gum paste, frosting, or fondant by pulling it off the mat with your fingers. In some cases, the excess can be reconstituted and reused."
                },
                {
                    "headline": "Scrape off excess shortening with a plastic scraper.",
                    "description": "The decorative food sheets cut with these special Cricut machines are held on to the cutting mat with a thick layer of shortening, not a sticky mat. Once you are done cutting a sheet, scrape as much of this shortening off as possible. Cricut sells plastic scrapers that can be used on their mats. However, any small plastic scraper, such as those sold for cleaning dishes, will work."
                },
                {
                    "headline": "Use warm soapy water to clean the mat.",
                    "description": "Once you cover the mat in dish soap and warm water, scrub it to remove the excess shortening. You may need to scrub the surface of the mat a bit with a normal dish sponge or brush to remove any excess shortening. You should only use cleaners on it that are non-toxic and safe for contact with kitchen equipment, so using warm water and dish soap works well on these mats."
                },
                {
                    "headline": "Let the mat air dry.",
                    "description": "Like all other Cricut mats, the Cricut Cake mats should be left out to dry after they are washed. Once completely dry, they can be used again in your machine. Don't use a towel to dry your mat. This can leave fibers on the surface of the mat, which will be transferred to the frosting, fondant, or gum paste you cut."
                }
            ]
        },
        {
            "name": "Making a Cricut Mat Sticky Again",
            "steps": [
                {
                    "headline": "Remove the original sticky layer with rubbing alcohol or stickiness remover.",
                    "description": "To get new adhesive to stick to your mat, it's a good idea to remove the layer that has lost its stickiness. You can do this by covering the surface with rubbing alcohol or a stickiness removing product, such as Goo Gone. You may need to use a scrapper, such as the one included in the Cricut tools pack, to get the old surface to come off."
                },
                {
                    "headline": "Tape off the edges of the mat.",
                    "description": "The edges of a Cricut mat need to be free of stickiness, as this is the part of the mat that is pulled through the machine's rollers. To ensure that you don't get any adhesive on these areas, you should tape them off with painter's tape or masking tape. The area that you need to tape off is clearly marked on the mat with color. The colored areas are on all 4 edges outside of the grid pattern."
                },
                {
                    "headline": "Cover the surface with a repositionable adhesive.",
                    "description": "There are a variety of adhesive products that people use to rejuvenate their mats. They are available at craft stores and from online retailers. Some can be sprayed over the surface and some need to be brushed on, but all should be applied in 2-3 coats. Some adhesives that work well include:\nRepositionable scrapbooking glue\nRepositionable glue sticks\nQuilt basting spray\nTacky glue thinned out with an equal part of water\nRepositionable spray adhesive"
                },
                {
                    "headline": "Let the adhesive dry thoroughly.",
                    "description": "This will ensure that the adhesive is bonded to the mat properly and that it doesn't stick too much to the paper you are cutting. Once the mat is dry, remove the tape and use the mat."
                }
            ]
        }
    ],
    "tyn": [
        "Cleaning a Traditional Cricut Mat",
        "Plastic scraper",
        "Alcohol-free baby wipe",
        "Lint roller",
        "Dish soap",
        "Magic eraser",
        "Degreaser",
        "Cleaning Cricut Cake Mats",
        "Sponge",
        "Dish brush",
        "Making a Cricut Mat Sticky Again",
        "Rubbing alcohol",
        "Stickiness remover",
        "Painter's tape or masking tape",
        "Repositionable adhesive"
    ],
    "text": " Cleaning a Traditional Cricut Mat Give your mat a light cleaning when it loses some of its stickiness. In order to keep your mat sticky for as long as possible, it's a good idea to clean it regularly. First scrape it off with a plastic scraper, either Cricut brand or any other type of hard plastic scraper. Then wipe an alcohol-free baby wipe or roll a lint roller over the surface. A lint roller is usually stickier than the mat, so it's able to remove any debris that is stuck to the mat. The baby wipes are able to gently wet down the surface and remove debris without damaging the mat. Rub the surface with soap and water. If you have used your mat repeatedly and it is really lacking stickiness, the surface may need a light scrub. Put a small amount of dish soap and warm water over the surface and scrub it lightly with a soft brush. Then rinse the surface off with warm water. If you want to use a sponge on the surface, try a Magic Eraser. This type of sponge will be gentle enough on the surface and it is good at removing residue. Spray a degreaser on the mat. If your mat is very dirty and has no stickiness left, you will need to use a stronger cleaner. Degreasers will cut through whatever is on the surface and remove it. However, they can leave a residue, so the mat needs to be cleaned with soap and water after using a degreaser. Using a strong degreaser may diminish the stickiness of the mat. However, you can replenish the stickiness after it is clean and dry. Let the mat air dry. Once clean, put the mat on a drying rack or hang it up so that both sides of it are able to dry completely. Whatever type of cleaning you do, it's important to let the mat dry before using it in the machine again. Any remaining moisture will minimize its stickiness and could damage the machine. Do not use a towel to dry the mat. Rubbing a towel over the sticky surface will cover it with fibers, minimizing its effectiveness. Cleaning Cricut Cake Mats Remove all frosting, fondant, or gum paste. There are some Cricut machines that are made specifically to cut decorative pieces out of gum paste, frosting sheets, and fondant. Once the decorative pieces have been cut and pulled off the mat, you will need to remove all excess gum paste, frosting, or fondant by pulling it off the mat with your fingers. In some cases, the excess can be reconstituted and reused. Scrape off excess shortening with a plastic scraper. The decorative food sheets cut with these special Cricut machines are held on to the cutting mat with a thick layer of shortening, not a sticky mat. Once you are done cutting a sheet, scrape as much of this shortening off as possible. Cricut sells plastic scrapers that can be used on their mats. However, any small plastic scraper, such as those sold for cleaning dishes, will work. Use warm soapy water to clean the mat. Once you cover the mat in dish soap and warm water, scrub it to remove the excess shortening. You may need to scrub the surface of the mat a bit with a normal dish sponge or brush to remove any excess shortening. You should only use cleaners on it that are non-toxic and safe for contact with kitchen equipment, so using warm water and dish soap works well on these mats. Let the mat air dry. Like all other Cricut mats, the Cricut Cake mats should be left out to dry after they are washed. Once completely dry, they can be used again in your machine. Don't use a towel to dry your mat. This can leave fibers on the surface of the mat, which will be transferred to the frosting, fondant, or gum paste you cut. Making a Cricut Mat Sticky Again Remove the original sticky layer with rubbing alcohol or stickiness remover. To get new adhesive to stick to your mat, it's a good idea to remove the layer that has lost its stickiness. You can do this by covering the surface with rubbing alcohol or a stickiness removing product, such as Goo Gone. You may need to use a scrapper, such as the one included in the Cricut tools pack, to get the old surface to come off. Tape off the edges of the mat. The edges of a Cricut mat need to be free of stickiness, as this is the part of the mat that is pulled through the machine's rollers. To ensure that you don't get any adhesive on these areas, you should tape them off with painter's tape or masking tape. The area that you need to tape off is clearly marked on the mat with color. The colored areas are on all 4 edges outside of the grid pattern. Cover the surface with a repositionable adhesive. There are a variety of adhesive products that people use to rejuvenate their mats. They are available at craft stores and from online retailers. Some can be sprayed over the surface and some need to be brushed on, but all should be applied in 2-3 coats. Some adhesives that work well include:\nRepositionable scrapbooking glue\nRepositionable glue sticks\nQuilt basting spray\nTacky glue thinned out with an equal part of water\nRepositionable spray adhesive Let the adhesive dry thoroughly. This will ensure that the adhesive is bonded to the mat properly and that it doesn't stick too much to the paper you are cutting. Once the mat is dry, remove the tape and use the mat.",
    "sentences": [
        " Cleaning a Traditional Cricut Mat Give your mat a light cleaning when it loses some of its stickiness.",
        "In order to keep your mat sticky for as long as possible, it's a good idea to clean it regularly.",
        "First scrape it off with a plastic scraper, either Cricut brand or any other type of hard plastic scraper.",
        "Then wipe an alcohol-free baby wipe or roll a lint roller over the surface.",
        "A lint roller is usually stickier than the mat, so it's able to remove any debris that is stuck to the mat.",
        "The baby wipes are able to gently wet down the surface and remove debris without damaging the mat.",
        "Rub the surface with soap and water.",
        "If you have used your mat repeatedly and it is really lacking stickiness, the surface may need a light scrub.",
        "Put a small amount of dish soap and warm water over the surface and scrub it lightly with a soft brush.",
        "Then rinse the surface off with warm water.",
        "If you want to use a sponge on the surface, try a Magic Eraser.",
        "This type of sponge will be gentle enough on the surface and it is good at removing residue.",
        "Spray a degreaser on the mat.",
        "If your mat is very dirty and has no stickiness left, you will need to use a stronger cleaner.",
        "Degreasers will cut through whatever is on the surface and remove it.",
        "However, they can leave a residue, so the mat needs to be cleaned with soap and water after using a degreaser.",
        "Using a strong degreaser may diminish the stickiness of the mat.",
        "However, you can replenish the stickiness after it is clean and dry.",
        "Let the mat air dry.",
        "Once clean, put the mat on a drying rack or hang it up so that both sides of it are able to dry completely.",
        "Whatever type of cleaning you do, it's important to let the mat dry before using it in the machine again.",
        "Any remaining moisture will minimize its stickiness and could damage the machine.",
        "Do not use a towel to dry the mat.",
        "Rubbing a towel over the sticky surface will cover it with fibers, minimizing its effectiveness.",
        "Cleaning Cricut Cake Mats Remove all frosting, fondant, or gum paste.",
        "There are some Cricut machines that are made specifically to cut decorative pieces out of gum paste, frosting sheets, and fondant.",
        "Once the decorative pieces have been cut and pulled off the mat, you will need to remove all excess gum paste, frosting, or fondant by pulling it off the mat with your fingers.",
        "In some cases, the excess can be reconstituted and reused.",
        "Scrape off excess shortening with a plastic scraper.",
        "The decorative food sheets cut with these special Cricut machines are held on to the cutting mat with a thick layer of shortening, not a sticky mat.",
        "Once you are done cutting a sheet, scrape as much of this shortening off as possible.",
        "Cricut sells plastic scrapers that can be used on their mats.",
        "However, any small plastic scraper, such as those sold for cleaning dishes, will work.",
        "Use warm soapy water to clean the mat.",
        "Once you cover the mat in dish soap and warm water, scrub it to remove the excess shortening.",
        "You may need to scrub the surface of the mat a bit with a normal dish sponge or brush to remove any excess shortening.",
        "You should only use cleaners on it that are non-toxic and safe for contact with kitchen equipment, so using warm water and dish soap works well on these mats.",
        "Let the mat air dry.",
        "Like all other Cricut mats, the Cricut Cake mats should be left out to dry after they are washed.",
        "Once completely dry, they can be used again in your machine.",
        "Don't use a towel to dry your mat.",
        "This can leave fibers on the surface of the mat, which will be transferred to the frosting, fondant, or gum paste you cut.",
        "Making a Cricut Mat Sticky Again Remove the original sticky layer with rubbing alcohol or stickiness remover.",
        "To get new adhesive to stick to your mat, it's a good idea to remove the layer that has lost its stickiness.",
        "You can do this by covering the surface with rubbing alcohol or a stickiness removing product, such as Goo Gone.",
        "You may need to use a scrapper, such as the one included in the Cricut tools pack, to get the old surface to come off.",
        "Tape off the edges of the mat.",
        "The edges of a Cricut mat need to be free of stickiness, as this is the part of the mat that is pulled through the machine's rollers.",
        "To ensure that you don't get any adhesive on these areas, you should tape them off with painter's tape or masking tape.",
        "The area that you need to tape off is clearly marked on the mat with color.",
        "The colored areas are on all 4 edges outside of the grid pattern.",
        "Cover the surface with a repositionable adhesive.",
        "There are a variety of adhesive products that people use to rejuvenate their mats.",
        "They are available at craft stores and from online retailers.",
        "Some can be sprayed over the surface and some need to be brushed on, but all should be applied in 2-3 coats.",
        "Some adhesives that work well include:\nRepositionable scrapbooking glue\nRepositionable glue sticks\nQuilt basting spray\nTacky glue thinned out with an equal part of water\nRepositionable spray adhesive Let the adhesive dry thoroughly.",
        "This will ensure that the adhesive is bonded to the mat properly and that it doesn't stick too much to the paper you are cutting.",
        "Once the mat is dry, remove the tape and use the mat."
    ]
}