{
    "title": "How to Make Chocolate Diaper Poo for a Baby Shower",
    "url": "https://www.wikihow.com/Make-Chocolate-Diaper-Poo-for-a-Baby-Shower",
    "category_hierarchy": [
        "Family Life",
        "Parenting",
        "Development Stages",
        "Babies and Infants"
    ],
    "parts": [
        {
            "name": "Filling the Diapers with “Poo”",
            "steps": [
                {
                    "headline": "Choose 5-6 different kinds of chocolate candy bars.",
                    "description": "Buy chocolate bars with nuts, plain milk chocolate, nougat centers, caramel, coconut—aim for a variety! It will be easier to use fun-size chocolate bars for this project, but if you only have access to full-size bars, you can easily cut them into smaller pieces. You’ll need 2 fun-size bars for each diaper. If you’re using 5 different kinds of chocolate, you’ll need a total of 10 fun-size bars. To make the game more challenging, use less recognizable candy bars like 100 Grand, Mars, Krackle, and 5th Avenue."
                },
                {
                    "headline": "List the candy bar names on a piece of paper and number them.",
                    "description": "Create a master list with the names of every chocolate bar on it. Then, assign each candy bar a number. For example, if you’re using 6 different kinds of candy bars, number your list from 1 to 6."
                },
                {
                    "headline": "Place the chocolate bars into 5-6 microwave-safe bowls.",
                    "description": "Unwrap the chocolate bars and place them into bowls. Use 2 fun-size chocolate bars per bowl. Put only 1 type of candy bar into each bowl. Don’t put different types of candy bars together in the same bowl! If you’re using a full-size candy bar, place about half of it into the bowl. Cut the piece you’re using in half again, since smaller pieces melt faster."
                },
                {
                    "headline": "Heat each bowl of chocolate in the microwave for 30-45 seconds.",
                    "description": "You don’t need to melt the chocolate completely into a liquid for this game. Aim for a softened, gooey mound that’s still partially solid. This usually takes about 30-45 seconds if your microwave is set to HIGH. Microwave 1 bowl of chocolate at a time to stay organized.Warning: Never place disposable diapers inside the microwave. They could catch on fire or the plastic might melt considerably. Always microwave the candy bars in bowls and then scoop the “poo” into the diapers."
                },
                {
                    "headline": "Scoop the first softened chocolate bar into a diaper.",
                    "description": "Spoon the softened chocolate from the bowl and spread it in the bottom of the diaper. Mash it around a bit so that it looks realistic. At this point, you’re probably going to start giggling! Use newborn size diapers to stay consistent with the baby shower theme."
                },
                {
                    "headline": "Write the candy bar's number on the outside of the diaper.",
                    "description": "After you scoop 1 kind of chocolate bar into the diaper, check the list to see what number it is. Then, write that number on the outside of the diaper with a permanent marker."
                },
                {
                    "headline": "Fill the remaining diapers with chocolate and number them.",
                    "description": "Finish filling the remaining diapers the same way—melt the chocolate in the microwave, scoop it into the diaper, and write the corresponding number on the diaper with a permanent marker. Then, fold the master list of candy bars and set it aside so that none of the players can see it. Once you’ve filled and numbered every diaper, line them up on a flat surface until it’s time to play."
                }
            ]
        },
        {
            "name": "Playing the Game",
            "steps": [
                {
                    "headline": "Give each guest a piece of paper and something to write with.",
                    "description": "Any kind of paper will work fine for this. If you want to be consistent with the baby shower’s color scheme, you can always hand out colored sheets of paper. You can also use any kind of writing utensil for this. Tell everyone to write their name at the top of their paper."
                },
                {
                    "headline": "Pass Diaper #1 around the room for each player to investigate.",
                    "description": "Guests can examine and sniff the diapers to figure out what kind of candy bar they’re looking at. You should remind everyone not to sample the chocolate diaper poo, since that would provide an unfair advantage!"
                },
                {
                    "headline": "Instruct each player to write their guess on their piece of paper.",
                    "description": "After they examine the diaper and decide on an answer, they should pass the diaper to the next player and write down their guess. Tell everyone to write down the number and the candy bar name. Remind them to put their name on their paper if they haven’t already."
                },
                {
                    "headline": "Hand out the remaining diapers to the players in the room.",
                    "description": "Once everyone is finished with Diaper #1, set it aside and pass around Diaper #2. Ask the guests to write down their guesses just like they did before. Keep doing this until you run out of diapers."
                },
                {
                    "headline": "Collect each player’s paper in a basket.",
                    "description": "They can fold their paper if they want to or just place it in the basket. Be sure to collect entries from all of your guests."
                },
                {
                    "headline": "Check the entries against the master list to figure out who won.",
                    "description": "The guest who matches the most “poo” to the correct candy bars wins the game. Give the winner a party favor bag filled with an assortment of the chocolate candy bars that you used in the game!Tip: If you have multiple correct entries, then draw for a winner!"
                }
            ]
        }
    ],
    "tyn": [
        "5 to 6 candy bars",
        "Newborn-sized diapers",
        "Table",
        "Permanent marker",
        "5 to 6 microwave-safe bowls",
        "Spoon",
        "Paper that lists each variety of candy bar",
        "Basket for entries",
        "Bag of chocolate candy for winner"
    ],
    "text": " Filling the Diapers with “Poo” Choose 5-6 different kinds of chocolate candy bars. Buy chocolate bars with nuts, plain milk chocolate, nougat centers, caramel, coconut—aim for a variety! It will be easier to use fun-size chocolate bars for this project, but if you only have access to full-size bars, you can easily cut them into smaller pieces. You’ll need 2 fun-size bars for each diaper. If you’re using 5 different kinds of chocolate, you’ll need a total of 10 fun-size bars. To make the game more challenging, use less recognizable candy bars like 100 Grand, Mars, Krackle, and 5th Avenue. List the candy bar names on a piece of paper and number them. Create a master list with the names of every chocolate bar on it. Then, assign each candy bar a number. For example, if you’re using 6 different kinds of candy bars, number your list from 1 to 6. Place the chocolate bars into 5-6 microwave-safe bowls. Unwrap the chocolate bars and place them into bowls. Use 2 fun-size chocolate bars per bowl. Put only 1 type of candy bar into each bowl. Don’t put different types of candy bars together in the same bowl! If you’re using a full-size candy bar, place about half of it into the bowl. Cut the piece you’re using in half again, since smaller pieces melt faster. Heat each bowl of chocolate in the microwave for 30-45 seconds. You don’t need to melt the chocolate completely into a liquid for this game. Aim for a softened, gooey mound that’s still partially solid. This usually takes about 30-45 seconds if your microwave is set to HIGH. Microwave 1 bowl of chocolate at a time to stay organized.Warning: Never place disposable diapers inside the microwave. They could catch on fire or the plastic might melt considerably. Always microwave the candy bars in bowls and then scoop the “poo” into the diapers. Scoop the first softened chocolate bar into a diaper. Spoon the softened chocolate from the bowl and spread it in the bottom of the diaper. Mash it around a bit so that it looks realistic. At this point, you’re probably going to start giggling! Use newborn size diapers to stay consistent with the baby shower theme. Write the candy bar's number on the outside of the diaper. After you scoop 1 kind of chocolate bar into the diaper, check the list to see what number it is. Then, write that number on the outside of the diaper with a permanent marker. Fill the remaining diapers with chocolate and number them. Finish filling the remaining diapers the same way—melt the chocolate in the microwave, scoop it into the diaper, and write the corresponding number on the diaper with a permanent marker. Then, fold the master list of candy bars and set it aside so that none of the players can see it. Once you’ve filled and numbered every diaper, line them up on a flat surface until it’s time to play. Playing the Game Give each guest a piece of paper and something to write with. Any kind of paper will work fine for this. If you want to be consistent with the baby shower’s color scheme, you can always hand out colored sheets of paper. You can also use any kind of writing utensil for this. Tell everyone to write their name at the top of their paper. Pass Diaper #1 around the room for each player to investigate. Guests can examine and sniff the diapers to figure out what kind of candy bar they’re looking at. You should remind everyone not to sample the chocolate diaper poo, since that would provide an unfair advantage! Instruct each player to write their guess on their piece of paper. After they examine the diaper and decide on an answer, they should pass the diaper to the next player and write down their guess. Tell everyone to write down the number and the candy bar name. Remind them to put their name on their paper if they haven’t already. Hand out the remaining diapers to the players in the room. Once everyone is finished with Diaper #1, set it aside and pass around Diaper #2. Ask the guests to write down their guesses just like they did before. Keep doing this until you run out of diapers. Collect each player’s paper in a basket. They can fold their paper if they want to or just place it in the basket. Be sure to collect entries from all of your guests. Check the entries against the master list to figure out who won. The guest who matches the most “poo” to the correct candy bars wins the game. Give the winner a party favor bag filled with an assortment of the chocolate candy bars that you used in the game!Tip: If you have multiple correct entries, then draw for a winner!",
    "sentences": [
        " Filling the Diapers with “Poo” Choose 5-6 different kinds of chocolate candy bars.",
        "Buy chocolate bars with nuts, plain milk chocolate, nougat centers, caramel, coconut—aim for a variety!",
        "It will be easier to use fun-size chocolate bars for this project, but if you only have access to full-size bars, you can easily cut them into smaller pieces.",
        "You’ll need 2 fun-size bars for each diaper.",
        "If you’re using 5 different kinds of chocolate, you’ll need a total of 10 fun-size bars.",
        "To make the game more challenging, use less recognizable candy bars like 100 Grand, Mars, Krackle, and 5th Avenue.",
        "List the candy bar names on a piece of paper and number them.",
        "Create a master list with the names of every chocolate bar on it.",
        "Then, assign each candy bar a number.",
        "For example, if you’re using 6 different kinds of candy bars, number your list from 1 to 6.",
        "Place the chocolate bars into 5-6 microwave-safe bowls.",
        "Unwrap the chocolate bars and place them into bowls.",
        "Use 2 fun-size chocolate bars per bowl.",
        "Put only 1 type of candy bar into each bowl.",
        "Don’t put different types of candy bars together in the same bowl!",
        "If you’re using a full-size candy bar, place about half of it into the bowl.",
        "Cut the piece you’re using in half again, since smaller pieces melt faster.",
        "Heat each bowl of chocolate in the microwave for 30-45 seconds.",
        "You don’t need to melt the chocolate completely into a liquid for this game.",
        "Aim for a softened, gooey mound that’s still partially solid.",
        "This usually takes about 30-45 seconds if your microwave is set to HIGH.",
        "Microwave 1 bowl of chocolate at a time to stay organized.Warning: Never place disposable diapers inside the microwave.",
        "They could catch on fire or the plastic might melt considerably.",
        "Always microwave the candy bars in bowls and then scoop the “poo” into the diapers.",
        "Scoop the first softened chocolate bar into a diaper.",
        "Spoon the softened chocolate from the bowl and spread it in the bottom of the diaper.",
        "Mash it around a bit so that it looks realistic.",
        "At this point, you’re probably going to start giggling!",
        "Use newborn size diapers to stay consistent with the baby shower theme.",
        "Write the candy bar's number on the outside of the diaper.",
        "After you scoop 1 kind of chocolate bar into the diaper, check the list to see what number it is.",
        "Then, write that number on the outside of the diaper with a permanent marker.",
        "Fill the remaining diapers with chocolate and number them.",
        "Finish filling the remaining diapers the same way—melt the chocolate in the microwave, scoop it into the diaper, and write the corresponding number on the diaper with a permanent marker.",
        "Then, fold the master list of candy bars and set it aside so that none of the players can see it.",
        "Once you’ve filled and numbered every diaper, line them up on a flat surface until it’s time to play.",
        "Playing the Game Give each guest a piece of paper and something to write with.",
        "Any kind of paper will work fine for this.",
        "If you want to be consistent with the baby shower’s color scheme, you can always hand out colored sheets of paper.",
        "You can also use any kind of writing utensil for this.",
        "Tell everyone to write their name at the top of their paper.",
        "Pass Diaper #1 around the room for each player to investigate.",
        "Guests can examine and sniff the diapers to figure out what kind of candy bar they’re looking at.",
        "You should remind everyone not to sample the chocolate diaper poo, since that would provide an unfair advantage!",
        "Instruct each player to write their guess on their piece of paper.",
        "After they examine the diaper and decide on an answer, they should pass the diaper to the next player and write down their guess.",
        "Tell everyone to write down the number and the candy bar name.",
        "Remind them to put their name on their paper if they haven’t already.",
        "Hand out the remaining diapers to the players in the room.",
        "Once everyone is finished with Diaper #1, set it aside and pass around Diaper #2.",
        "Ask the guests to write down their guesses just like they did before.",
        "Keep doing this until you run out of diapers.",
        "Collect each player’s paper in a basket.",
        "They can fold their paper if they want to or just place it in the basket.",
        "Be sure to collect entries from all of your guests.",
        "Check the entries against the master list to figure out who won.",
        "The guest who matches the most “poo” to the correct candy bars wins the game.",
        "Give the winner a party favor bag filled with an assortment of the chocolate candy bars that you used in the game!Tip: If you have multiple correct entries, then draw for a winner!"
    ]
}