{
    "title": "How to Freeze Apricots",
    "url": "https://www.wikihow.com/Freeze-Apricots",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables"
    ],
    "methods": [
        {
            "name": "Blanching and Slicing Ripe Apricots",
            "steps": [
                {
                    "headline": "Choose fruit that is fully ripe but still firm.",
                    "description": "When you squeeze it, a ripe apricot should indent slightly beneath your fingers, but it should not be overly soft. You can also smell near the fruit’s stem, since a ripe apricot will have a sweet scent. Although the color of the fruit will depend on the variety, a ripe apricot should be uniform with no green patches. Avoid fruit with large bruises, as these will be mushy and have no flavor."
                },
                {
                    "headline": "Wash the apricots with a mixture of 3 parts water and 1 part vinegar.",
                    "description": "This rinse will help to remove any bacteria from the fruit. Rinse the apricots under cool running water and pat dry. Washing the apricots before you boil them keeps contaminants from cooking into the fruit."
                },
                {
                    "headline": "Blanch the apricots in boiling water if you are leaving the peels on.",
                    "description": "Bring a large stockpot of water to a boil, then drop the apricots into the water for between 30 seconds and 1 minute. This keeps the skins from becoming tough during the freezing process. Do not overcook the apricots, especially if you are planning on freezing the fruit while it is fresh. If you are peeling the apricots, you don’t have to blanch them. However, it does make removing the peels easier. If you are freezing a large quantity of apricots, you may want to blanch them in smaller batches, depending on the size of your stock pot."
                },
                {
                    "headline": "Dip the apricots in ice-cold water after you blanch them, then drain and dry.",
                    "description": "After the apricots have boiled for 30-60 seconds, use a slotted spoon to remove the apricots from the boiling water. Plunge them into ice-cold water right away to immediately stop the cooking process, then drain them and pat them dry."
                },
                {
                    "headline": "Peel the apricots unless you plan to leave the skins on.",
                    "description": "If you blanched the apricots, or if they are especially ripe, you should be able to easily remove the skins with your fingers. Otherwise, you can use a sharp paring knife to peel the fruit. If you’re pureeing the apricots, you will need to remove the skins."
                },
                {
                    "headline": "Slice the apricots in half and remove the pits.",
                    "description": "Use a small paring knife to slice through the fruit, sliding it around the pit. Twist the halves of the apricot to separate it, then use your fingers or a spoon to scoop out the pit. If you’re freezing the apricots fresh, you can leave them in halves, or you can cut them into quarters or slices if you prefer."
                }
            ]
        },
        {
            "name": "Freezing Sliced Apricots",
            "steps": [
                {
                    "headline": "Dip the apricots in lemon or pineapple juice.",
                    "description": "Apricots have a tendency to become discolored when they are exposed to air. By dipping them in a shallow plate filled with a citrus juice like lemon or pineapple juice, you can prevent them from blackening. You can use any ascorbic acid or citrus juice, including powdered ascorbic acid or vitamin C tablets. However, lemon or pineapple juice will give the apricots a pleasing flavor and they are easy to find. You’ll only need a splash of juice for each apricot, so a 1 quart (0.95 L) jar should be sufficient for a moderately-sized batch."
                },
                {
                    "headline": "Layer the apricots in freezer-safe containers.",
                    "description": "The best containers for freezing apricots are plastic containers with tight-fitting lids, especially if you’re going to pack the fruit in syrup. You can pack the apricots as tightly as your like without crushing them. Leave at least ⁄4 inch (0.64 cm) of headroom in the container to allow the apricots room to expand. If you’re not packing the apricots in syrup, you can place them in freezer-safe bags if you prefer."
                },
                {
                    "headline": "Label the containers with the name of the fruit and the date it was prepared.",
                    "description": "Using a stick-on label or a permanent marker, you should indicate that the fruit you're freezing is apricot, because it can be hard to differentiate fruit slices once they're frozen. Including the date on the label will help you keep track of when the apricots will expire. Fresh apricots which are not packed in syrup will last in the freezer for up to 3 months."
                },
                {
                    "headline": "Pack the apricots in syrup for a longer shelf life.",
                    "description": "To prepare a heavy syrup for apricots, prepare a mixture of 80% water and 20% sugar. Mix the water and sugar together and bring to a boil, then pour over the raw fruits in the freezer-safe containers. Use 1 cup (240 mL) of syrup for each 1 quart (0.95 L) of prepared fruit \nThis isn't necessary, but it will prolong how long you can store the apricots in the freezer, and it will help preserve the flavor of the apricots. You can keep apricots in the freezer for up to a year if they are packed in syrup."
                }
            ]
        },
        {
            "name": "Freezing Apricot Puree",
            "steps": [
                {
                    "headline": "Slice the fruit into small chunks.",
                    "description": "Once you have washed, peeled, and pitted the apricots, use your paring knife to slice it into small pieces. The cuts don’t have to be perfectly even, since you’ll be pureeing the fruit after you cook it, but aim for pieces that are roughly 1 inch (2.5 cm) square."
                },
                {
                    "headline": "Simmer 1 pound (0.45 kg) chopped apricot with 4 US tbsp (59 mL) of water.",
                    "description": "Place the mixture in a saucepan, cover it, and turn it to medium-low heat. Allow the apricots to simmer until they are soft. Depending on the ripeness, this may take anywhere from 5-15 minutes."
                },
                {
                    "headline": "Stir in 3-4 oz (85-115g) of sugar if you want to sweeten the puree.",
                    "description": "Apricots are tart, so you may want to add a little sugar to balance out the flavor of your puree. Use a long-handled spoon to stir the sugar into the mixture, and allow the apricots to continue simmering until the sugar is dissolved. You can also use honey, brown sugar, or corn syrup if you prefer."
                },
                {
                    "headline": "Allow the mixture to cool, then puree it in a food processor or blender.",
                    "description": "Blend the mixture until it’s smooth, although you can leave it a little chunky if that’s the consistency you prefer. You can also mash with a potato masher if you prefer a chunky puree or if you don’t have a food processor."
                },
                {
                    "headline": "Pour the puree into plastic containers, leaving a little head room at the top.",
                    "description": "When the puree freezes, the moisture in the apricots will expand. Try to leave at least ⁄4 inch (0.64 cm) of space at the top of the container to account for this. Apricot puree will keep in the freezer for 6-8 months."
                }
            ]
        }
    ],
    "tyn": [
        "Preparing the Apricots",
        "Ripe apricots",
        "Vinegar",
        "Water",
        "Stock pot",
        "Bowl",
        "Slotted Spoon",
        "Paring knife",
        "spoon",
        "Storing Fresh Apricots",
        "Shallow plate",
        "Freezer-safe containers or bags",
        "Freezing Apricot Puree",
        "Saucepan",
        "Blender, food processor, or potato masher",
        "Plastic freezer containers"
    ],
    "text": " Blanching and Slicing Ripe Apricots Choose fruit that is fully ripe but still firm. When you squeeze it, a ripe apricot should indent slightly beneath your fingers, but it should not be overly soft. You can also smell near the fruit’s stem, since a ripe apricot will have a sweet scent. Although the color of the fruit will depend on the variety, a ripe apricot should be uniform with no green patches. Avoid fruit with large bruises, as these will be mushy and have no flavor. Wash the apricots with a mixture of 3 parts water and 1 part vinegar. This rinse will help to remove any bacteria from the fruit. Rinse the apricots under cool running water and pat dry. Washing the apricots before you boil them keeps contaminants from cooking into the fruit. Blanch the apricots in boiling water if you are leaving the peels on. Bring a large stockpot of water to a boil, then drop the apricots into the water for between 30 seconds and 1 minute. This keeps the skins from becoming tough during the freezing process. Do not overcook the apricots, especially if you are planning on freezing the fruit while it is fresh. If you are peeling the apricots, you don’t have to blanch them. However, it does make removing the peels easier. If you are freezing a large quantity of apricots, you may want to blanch them in smaller batches, depending on the size of your stock pot. Dip the apricots in ice-cold water after you blanch them, then drain and dry. After the apricots have boiled for 30-60 seconds, use a slotted spoon to remove the apricots from the boiling water. Plunge them into ice-cold water right away to immediately stop the cooking process, then drain them and pat them dry. Peel the apricots unless you plan to leave the skins on. If you blanched the apricots, or if they are especially ripe, you should be able to easily remove the skins with your fingers. Otherwise, you can use a sharp paring knife to peel the fruit. If you’re pureeing the apricots, you will need to remove the skins. Slice the apricots in half and remove the pits. Use a small paring knife to slice through the fruit, sliding it around the pit. Twist the halves of the apricot to separate it, then use your fingers or a spoon to scoop out the pit. If you’re freezing the apricots fresh, you can leave them in halves, or you can cut them into quarters or slices if you prefer. Freezing Sliced Apricots Dip the apricots in lemon or pineapple juice. Apricots have a tendency to become discolored when they are exposed to air. By dipping them in a shallow plate filled with a citrus juice like lemon or pineapple juice, you can prevent them from blackening. You can use any ascorbic acid or citrus juice, including powdered ascorbic acid or vitamin C tablets. However, lemon or pineapple juice will give the apricots a pleasing flavor and they are easy to find. You’ll only need a splash of juice for each apricot, so a 1 quart (0.95 L) jar should be sufficient for a moderately-sized batch. Layer the apricots in freezer-safe containers. The best containers for freezing apricots are plastic containers with tight-fitting lids, especially if you’re going to pack the fruit in syrup. You can pack the apricots as tightly as your like without crushing them. Leave at least ⁄4 inch (0.64 cm) of headroom in the container to allow the apricots room to expand. If you’re not packing the apricots in syrup, you can place them in freezer-safe bags if you prefer. Label the containers with the name of the fruit and the date it was prepared. Using a stick-on label or a permanent marker, you should indicate that the fruit you're freezing is apricot, because it can be hard to differentiate fruit slices once they're frozen. Including the date on the label will help you keep track of when the apricots will expire. Fresh apricots which are not packed in syrup will last in the freezer for up to 3 months. Pack the apricots in syrup for a longer shelf life. To prepare a heavy syrup for apricots, prepare a mixture of 80% water and 20% sugar. Mix the water and sugar together and bring to a boil, then pour over the raw fruits in the freezer-safe containers. Use 1 cup (240 mL) of syrup for each 1 quart (0.95 L) of prepared fruit \nThis isn't necessary, but it will prolong how long you can store the apricots in the freezer, and it will help preserve the flavor of the apricots. You can keep apricots in the freezer for up to a year if they are packed in syrup. Freezing Apricot Puree Slice the fruit into small chunks. Once you have washed, peeled, and pitted the apricots, use your paring knife to slice it into small pieces. The cuts don’t have to be perfectly even, since you’ll be pureeing the fruit after you cook it, but aim for pieces that are roughly 1 inch (2.5 cm) square. Simmer 1 pound (0.45 kg) chopped apricot with 4 US tbsp (59 mL) of water. Place the mixture in a saucepan, cover it, and turn it to medium-low heat. Allow the apricots to simmer until they are soft. Depending on the ripeness, this may take anywhere from 5-15 minutes. Stir in 3-4 oz (85-115g) of sugar if you want to sweeten the puree. Apricots are tart, so you may want to add a little sugar to balance out the flavor of your puree. Use a long-handled spoon to stir the sugar into the mixture, and allow the apricots to continue simmering until the sugar is dissolved. You can also use honey, brown sugar, or corn syrup if you prefer. Allow the mixture to cool, then puree it in a food processor or blender. Blend the mixture until it’s smooth, although you can leave it a little chunky if that’s the consistency you prefer. You can also mash with a potato masher if you prefer a chunky puree or if you don’t have a food processor. Pour the puree into plastic containers, leaving a little head room at the top. When the puree freezes, the moisture in the apricots will expand. Try to leave at least ⁄4 inch (0.64 cm) of space at the top of the container to account for this. Apricot puree will keep in the freezer for 6-8 months.",
    "sentences": [
        " Blanching and Slicing Ripe Apricots Choose fruit that is fully ripe but still firm.",
        "When you squeeze it, a ripe apricot should indent slightly beneath your fingers, but it should not be overly soft.",
        "You can also smell near the fruit’s stem, since a ripe apricot will have a sweet scent.",
        "Although the color of the fruit will depend on the variety, a ripe apricot should be uniform with no green patches.",
        "Avoid fruit with large bruises, as these will be mushy and have no flavor.",
        "Wash the apricots with a mixture of 3 parts water and 1 part vinegar.",
        "This rinse will help to remove any bacteria from the fruit.",
        "Rinse the apricots under cool running water and pat dry.",
        "Washing the apricots before you boil them keeps contaminants from cooking into the fruit.",
        "Blanch the apricots in boiling water if you are leaving the peels on.",
        "Bring a large stockpot of water to a boil, then drop the apricots into the water for between 30 seconds and 1 minute.",
        "This keeps the skins from becoming tough during the freezing process.",
        "Do not overcook the apricots, especially if you are planning on freezing the fruit while it is fresh.",
        "If you are peeling the apricots, you don’t have to blanch them.",
        "However, it does make removing the peels easier.",
        "If you are freezing a large quantity of apricots, you may want to blanch them in smaller batches, depending on the size of your stock pot.",
        "Dip the apricots in ice-cold water after you blanch them, then drain and dry.",
        "After the apricots have boiled for 30-60 seconds, use a slotted spoon to remove the apricots from the boiling water.",
        "Plunge them into ice-cold water right away to immediately stop the cooking process, then drain them and pat them dry.",
        "Peel the apricots unless you plan to leave the skins on.",
        "If you blanched the apricots, or if they are especially ripe, you should be able to easily remove the skins with your fingers.",
        "Otherwise, you can use a sharp paring knife to peel the fruit.",
        "If you’re pureeing the apricots, you will need to remove the skins.",
        "Slice the apricots in half and remove the pits.",
        "Use a small paring knife to slice through the fruit, sliding it around the pit.",
        "Twist the halves of the apricot to separate it, then use your fingers or a spoon to scoop out the pit.",
        "If you’re freezing the apricots fresh, you can leave them in halves, or you can cut them into quarters or slices if you prefer.",
        "Freezing Sliced Apricots Dip the apricots in lemon or pineapple juice.",
        "Apricots have a tendency to become discolored when they are exposed to air.",
        "By dipping them in a shallow plate filled with a citrus juice like lemon or pineapple juice, you can prevent them from blackening.",
        "You can use any ascorbic acid or citrus juice, including powdered ascorbic acid or vitamin C tablets.",
        "However, lemon or pineapple juice will give the apricots a pleasing flavor and they are easy to find.",
        "You’ll only need a splash of juice for each apricot, so a 1 quart (0.95 L) jar should be sufficient for a moderately-sized batch.",
        "Layer the apricots in freezer-safe containers.",
        "The best containers for freezing apricots are plastic containers with tight-fitting lids, especially if you’re going to pack the fruit in syrup.",
        "You can pack the apricots as tightly as your like without crushing them.",
        "Leave at least ⁄4 inch (0.64 cm) of headroom in the container to allow the apricots room to expand.",
        "If you’re not packing the apricots in syrup, you can place them in freezer-safe bags if you prefer.",
        "Label the containers with the name of the fruit and the date it was prepared.",
        "Using a stick-on label or a permanent marker, you should indicate that the fruit you're freezing is apricot, because it can be hard to differentiate fruit slices once they're frozen.",
        "Including the date on the label will help you keep track of when the apricots will expire.",
        "Fresh apricots which are not packed in syrup will last in the freezer for up to 3 months.",
        "Pack the apricots in syrup for a longer shelf life.",
        "To prepare a heavy syrup for apricots, prepare a mixture of 80% water and 20% sugar.",
        "Mix the water and sugar together and bring to a boil, then pour over the raw fruits in the freezer-safe containers.",
        "Use 1 cup (240 mL) of syrup for each 1 quart (0.95 L) of prepared fruit \nThis isn't necessary, but it will prolong how long you can store the apricots in the freezer, and it will help preserve the flavor of the apricots.",
        "You can keep apricots in the freezer for up to a year if they are packed in syrup.",
        "Freezing Apricot Puree Slice the fruit into small chunks.",
        "Once you have washed, peeled, and pitted the apricots, use your paring knife to slice it into small pieces.",
        "The cuts don’t have to be perfectly even, since you’ll be pureeing the fruit after you cook it, but aim for pieces that are roughly 1 inch (2.5 cm) square.",
        "Simmer 1 pound (0.45 kg) chopped apricot with 4 US tbsp (59 mL) of water.",
        "Place the mixture in a saucepan, cover it, and turn it to medium-low heat.",
        "Allow the apricots to simmer until they are soft.",
        "Depending on the ripeness, this may take anywhere from 5-15 minutes.",
        "Stir in 3-4 oz (85-115g) of sugar if you want to sweeten the puree.",
        "Apricots are tart, so you may want to add a little sugar to balance out the flavor of your puree.",
        "Use a long-handled spoon to stir the sugar into the mixture, and allow the apricots to continue simmering until the sugar is dissolved.",
        "You can also use honey, brown sugar, or corn syrup if you prefer.",
        "Allow the mixture to cool, then puree it in a food processor or blender.",
        "Blend the mixture until it’s smooth, although you can leave it a little chunky if that’s the consistency you prefer.",
        "You can also mash with a potato masher if you prefer a chunky puree or if you don’t have a food processor.",
        "Pour the puree into plastic containers, leaving a little head room at the top.",
        "When the puree freezes, the moisture in the apricots will expand.",
        "Try to leave at least ⁄4 inch (0.64 cm) of space at the top of the container to account for this.",
        "Apricot puree will keep in the freezer for 6-8 months."
    ]
}