{
    "title": "How to Hang Paper Flowers",
    "url": "https://www.wikihow.com/Hang-Paper-Flowers",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Nature Crafts",
        "Leaf and Flower Crafts"
    ],
    "parts": [
        {
            "name": "Hanging Paper Flowers from the Ceiling",
            "steps": [
                {
                    "headline": "Glue or tape string to the backside of the flower.",
                    "description": "Flip the flower upside down and place it on a table or flat surface. Cut a length of string about 1–2 feet (0.30–0.61 m) long, depending on how low you want the flower to hang from the ceiling. Use hot glue or painter's tape to secure the string to the top of the flower's back. If you use glue, let it dry before hanging your flower up. Try choosing a string or ribbon color that matches your flower's color scheme. If your flower is pink and yellow, for example, use a yellow ribbon to make its color pop."
                },
                {
                    "headline": "Attach sticky tack or painter's tape to the other end of the string.",
                    "description": "Place a coin-sized piece of sticky tack or a similarly-sized piece of painter's tape on the opposite end of the string. Squeeze your finger and thumb between the adhesive material and the string to secure it in place. Painter's tape is ideal because it won't damage the ceiling. If you want something less noticeable, however, you can use mounting tape instead."
                },
                {
                    "headline": "Stick the paper flower to the ceiling.",
                    "description": "Hold the end of the string with the adhesive material and press it against the ceiling. If the paper flower falls off, apply more sticky tack or tape and reapply it. If you're hanging multiple flowers, space them evenly around the ceiling. Hang them at different lengths for a dimensional, more dynamic look."
                }
            ]
        },
        {
            "name": "Securing Paper Flowers to a Wall",
            "steps": [
                {
                    "headline": "Flip the flower upside down and attach a string to the back.",
                    "description": "Place your upside-down flower on a flat, secure surface. Cut a piece of string about 3 inches (7.6 cm) long and fold it in half. Place the loop on the center of the flower's back and hold it in place with your hand. Choose a durable string to help the flower withstand regular use as a decoration."
                },
                {
                    "headline": "Secure a paper circle to the back of the paper flower.",
                    "description": "Cut out a paper circle approximately the same size as the flower's back. Place hot glue along one side of the circle and place it over the back and the ends of the string. Adjust the string loop to prevent the paper circle from covering it. Give the hot glue time to dry before securing the flower to the wall. It should set completely in 30-60 minutes."
                },
                {
                    "headline": "Loop the string over a nail, thumb tack, or hook.",
                    "description": "Pinch both sides of the loop out and hang it over a nail, thumb tack, or hook. If your string has a strong hold, your paper flower should hang securely on the wall. To test the string's hold before securing it to the wall, try holding up the flower by its loop. Add more hot glue if it seems too loose or if the string falls off. If you make multiple flowers, space them evenly along the wall or in a shape, like a circle or a heart."
                },
                {
                    "headline": "Use sticky tack as a hole-free alternative.",
                    "description": "If you do not want to make a hole in your wall, attach sticky tack to the flower's string loop. Set the sticky tack and loop in place on the wall, pressing it with your fingers to keep it in place. You can also use painter's tape in lieu of sticky tack."
                }
            ]
        },
        {
            "name": "Pinning Paper Flowers to Fabric",
            "steps": [
                {
                    "headline": "Purchase self-adhesive bar pins from a craft store.",
                    "description": "Self-adhesive bar pins are ideal for hanging paper flowers to fabrics without damaging them. Buy bar pins online or from the jewelry section of a nearby craft store. If you cannot find adhesive bar pins, you can use hot glue to secure non-adhesive bar pins in place."
                },
                {
                    "headline": "Press the bar pin's backing against the paper flower.",
                    "description": "Turn the flower upside down and place it on a table or other flat surface. Take off the bar pin's backing and attach it to the center of the paper flower's back. Add hot glue to its backing for a stronger hold or if you purchased non-adhesive bar pins."
                },
                {
                    "headline": "Let the paper flower dry for 30-60 minutes before using it as a decoration.",
                    "description": "If you used hot glue on the bar pin's backing, let it dry for up to an hour. The bar pin may fall off if you try to hang the paper flower before the hot glue has dried."
                },
                {
                    "headline": "Open the bar pin and attach it to the fabric object.",
                    "description": "Press down on one end of the bar pin and move the needle to the side to open it. Stick the needle through the fabric, then move the needle back to the side to secure its hold. If pinning multiple flowers to the fabric, space them out evenly for an organized look."
                }
            ]
        }
    ],
    "tyn": [
        "Hanging Paper Flowers from the Ceiling",
        "String or ribbon",
        "Hot glue",
        "Scissors",
        "Sticky tack",
        "Painter's tape",
        "Securing Paper Flowers to a Wall",
        "String",
        "Paper",
        "Nail, thumb tack, or hook",
        "Sticky tack (optional)",
        "Painter's tape (optional)",
        "Pinning Paper Flowers to Fabric",
        "Adhesive bar pins"
    ],
    "text": " Hanging Paper Flowers from the Ceiling Glue or tape string to the backside of the flower. Flip the flower upside down and place it on a table or flat surface. Cut a length of string about 1–2 feet (0.30–0.61 m) long, depending on how low you want the flower to hang from the ceiling. Use hot glue or painter's tape to secure the string to the top of the flower's back. If you use glue, let it dry before hanging your flower up. Try choosing a string or ribbon color that matches your flower's color scheme. If your flower is pink and yellow, for example, use a yellow ribbon to make its color pop. Attach sticky tack or painter's tape to the other end of the string. Place a coin-sized piece of sticky tack or a similarly-sized piece of painter's tape on the opposite end of the string. Squeeze your finger and thumb between the adhesive material and the string to secure it in place. Painter's tape is ideal because it won't damage the ceiling. If you want something less noticeable, however, you can use mounting tape instead. Stick the paper flower to the ceiling. Hold the end of the string with the adhesive material and press it against the ceiling. If the paper flower falls off, apply more sticky tack or tape and reapply it. If you're hanging multiple flowers, space them evenly around the ceiling. Hang them at different lengths for a dimensional, more dynamic look. Securing Paper Flowers to a Wall Flip the flower upside down and attach a string to the back. Place your upside-down flower on a flat, secure surface. Cut a piece of string about 3 inches (7.6 cm) long and fold it in half. Place the loop on the center of the flower's back and hold it in place with your hand. Choose a durable string to help the flower withstand regular use as a decoration. Secure a paper circle to the back of the paper flower. Cut out a paper circle approximately the same size as the flower's back. Place hot glue along one side of the circle and place it over the back and the ends of the string. Adjust the string loop to prevent the paper circle from covering it. Give the hot glue time to dry before securing the flower to the wall. It should set completely in 30-60 minutes. Loop the string over a nail, thumb tack, or hook. Pinch both sides of the loop out and hang it over a nail, thumb tack, or hook. If your string has a strong hold, your paper flower should hang securely on the wall. To test the string's hold before securing it to the wall, try holding up the flower by its loop. Add more hot glue if it seems too loose or if the string falls off. If you make multiple flowers, space them evenly along the wall or in a shape, like a circle or a heart. Use sticky tack as a hole-free alternative. If you do not want to make a hole in your wall, attach sticky tack to the flower's string loop. Set the sticky tack and loop in place on the wall, pressing it with your fingers to keep it in place. You can also use painter's tape in lieu of sticky tack. Pinning Paper Flowers to Fabric Purchase self-adhesive bar pins from a craft store. Self-adhesive bar pins are ideal for hanging paper flowers to fabrics without damaging them. Buy bar pins online or from the jewelry section of a nearby craft store. If you cannot find adhesive bar pins, you can use hot glue to secure non-adhesive bar pins in place. Press the bar pin's backing against the paper flower. Turn the flower upside down and place it on a table or other flat surface. Take off the bar pin's backing and attach it to the center of the paper flower's back. Add hot glue to its backing for a stronger hold or if you purchased non-adhesive bar pins. Let the paper flower dry for 30-60 minutes before using it as a decoration. If you used hot glue on the bar pin's backing, let it dry for up to an hour. The bar pin may fall off if you try to hang the paper flower before the hot glue has dried. Open the bar pin and attach it to the fabric object. Press down on one end of the bar pin and move the needle to the side to open it. Stick the needle through the fabric, then move the needle back to the side to secure its hold. If pinning multiple flowers to the fabric, space them out evenly for an organized look.",
    "sentences": [
        " Hanging Paper Flowers from the Ceiling Glue or tape string to the backside of the flower.",
        "Flip the flower upside down and place it on a table or flat surface.",
        "Cut a length of string about 1–2 feet (0.30–0.61 m) long, depending on how low you want the flower to hang from the ceiling.",
        "Use hot glue or painter's tape to secure the string to the top of the flower's back.",
        "If you use glue, let it dry before hanging your flower up.",
        "Try choosing a string or ribbon color that matches your flower's color scheme.",
        "If your flower is pink and yellow, for example, use a yellow ribbon to make its color pop.",
        "Attach sticky tack or painter's tape to the other end of the string.",
        "Place a coin-sized piece of sticky tack or a similarly-sized piece of painter's tape on the opposite end of the string.",
        "Squeeze your finger and thumb between the adhesive material and the string to secure it in place.",
        "Painter's tape is ideal because it won't damage the ceiling.",
        "If you want something less noticeable, however, you can use mounting tape instead.",
        "Stick the paper flower to the ceiling.",
        "Hold the end of the string with the adhesive material and press it against the ceiling.",
        "If the paper flower falls off, apply more sticky tack or tape and reapply it.",
        "If you're hanging multiple flowers, space them evenly around the ceiling.",
        "Hang them at different lengths for a dimensional, more dynamic look.",
        "Securing Paper Flowers to a Wall Flip the flower upside down and attach a string to the back.",
        "Place your upside-down flower on a flat, secure surface.",
        "Cut a piece of string about 3 inches (7.6 cm) long and fold it in half.",
        "Place the loop on the center of the flower's back and hold it in place with your hand.",
        "Choose a durable string to help the flower withstand regular use as a decoration.",
        "Secure a paper circle to the back of the paper flower.",
        "Cut out a paper circle approximately the same size as the flower's back.",
        "Place hot glue along one side of the circle and place it over the back and the ends of the string.",
        "Adjust the string loop to prevent the paper circle from covering it.",
        "Give the hot glue time to dry before securing the flower to the wall.",
        "It should set completely in 30-60 minutes.",
        "Loop the string over a nail, thumb tack, or hook.",
        "Pinch both sides of the loop out and hang it over a nail, thumb tack, or hook.",
        "If your string has a strong hold, your paper flower should hang securely on the wall.",
        "To test the string's hold before securing it to the wall, try holding up the flower by its loop.",
        "Add more hot glue if it seems too loose or if the string falls off.",
        "If you make multiple flowers, space them evenly along the wall or in a shape, like a circle or a heart.",
        "Use sticky tack as a hole-free alternative.",
        "If you do not want to make a hole in your wall, attach sticky tack to the flower's string loop.",
        "Set the sticky tack and loop in place on the wall, pressing it with your fingers to keep it in place.",
        "You can also use painter's tape in lieu of sticky tack.",
        "Pinning Paper Flowers to Fabric Purchase self-adhesive bar pins from a craft store.",
        "Self-adhesive bar pins are ideal for hanging paper flowers to fabrics without damaging them.",
        "Buy bar pins online or from the jewelry section of a nearby craft store.",
        "If you cannot find adhesive bar pins, you can use hot glue to secure non-adhesive bar pins in place.",
        "Press the bar pin's backing against the paper flower.",
        "Turn the flower upside down and place it on a table or other flat surface.",
        "Take off the bar pin's backing and attach it to the center of the paper flower's back.",
        "Add hot glue to its backing for a stronger hold or if you purchased non-adhesive bar pins.",
        "Let the paper flower dry for 30-60 minutes before using it as a decoration.",
        "If you used hot glue on the bar pin's backing, let it dry for up to an hour.",
        "The bar pin may fall off if you try to hang the paper flower before the hot glue has dried.",
        "Open the bar pin and attach it to the fabric object.",
        "Press down on one end of the bar pin and move the needle to the side to open it.",
        "Stick the needle through the fabric, then move the needle back to the side to secure its hold.",
        "If pinning multiple flowers to the fabric, space them out evenly for an organized look."
    ]
}