{
    "title": "How to Stop Erosion on a River Bank",
    "url": "https://www.wikihow.com/Stop-Erosion-on-a-River-Bank",
    "category_hierarchy": [
        "Education and Communications",
        "Social Activism",
        "Environmental Awareness"
    ],
    "methods": [
        {
            "name": "Installing Coir Netting",
            "steps": [
                {
                    "headline": "Use coir netting that's 700-900 grams per square meter (GSM).",
                    "description": "Coir netting is made from coconut fibers and is biodegradable. Normal or heavy duty netting should be used when there is a large amount of water flow. Coir netting can be purchased online or from specialty landscaping and yardwork stores. Depending on the climate conditions in your area, coir netting can last from 24 to 48 months. Use a measuring tape to find the size of the area you need to cover with netting so you how much to buy."
                },
                {
                    "headline": "Remove grass, weeds, and debris from the river bank.",
                    "description": "Expose the soil on the river bank using a hoe or a sod cutter. Dig 2 inches (5.1 cm) deep to remove the roots. This ensures that the netting lays flat and covers the soil entirely."
                },
                {
                    "headline": "Add 5 centimetres (2.0 in) of topsoil.",
                    "description": "Cover the river bank with soil so you have a healthy base to plant vegetation. Rake and fertilize the soil so it’s prepared for planting. The soil should not have clumps since the coir netting needs to lay flat. You can apply grass seed to this topsoil so it grows through the spaces of the netting. You do not need to fertilize the soil if you don’t plan on planting anything."
                },
                {
                    "headline": "Dig a trench 15 cm (5.9 in) deep by 15 cm (5.9 in) wide at the top of the slope.",
                    "description": "Use a shovel or a trench digger across the entirety of the area you're placing the netting. The trench serves as an anchor point and prevents water from flowing under the netting."
                },
                {
                    "headline": "Line the trench with the netting.",
                    "description": "Make sure the netting lays flush with both of the walls and the bottom of the trench. Leave an extra 30 cm (12 in) of netting on the side of the trench furthest from the river bank. This will be folded over and secured later on."
                },
                {
                    "headline": "Drive U-shaped pins 30 cm (12 in) apart into the netting in the trench.",
                    "description": "Use a rubber mallet to secure the pins. The top of each pin should be flush to the ground. Stagger the pins by 5 centimetres (2.0 in) so they hold the netting taut. The pin length will depend on the firmness of your soil. If you have loose soil, use pins at least 45 centimetres (18 in) long. If the soil is firm and compact, use pins 30 centimetres (12 in) long. These can easily be found at most hardware stores. Though the netting will degrade over time, the pins will not."
                },
                {
                    "headline": "Fill the trench with compacted dirt.",
                    "description": "Once secured, press dirt back into the trench to compact it. Once it has been filled, take the extra netting left on top and fold it over the dirt. Secure it to the ground with pins every 30 centimetres (12 in) between the first set of pins. Plant grass seeds in the dirt you used to fill the trench before folding the netting."
                },
                {
                    "headline": "Roll the rest of the netting down the slope.",
                    "description": "Once you have reached the bottom of the slope, cut the netting with a pair of scissors. Have someone help with the netting since it usually comes in a 5 by 25 m (16 by 82 ft) roll."
                },
                {
                    "headline": "Hammer at least 4 pins per 1 square metre (11 sq ft).",
                    "description": "Stagger the pins 40 to 60 centimetres (1.3 to 2.0 ft) across the netting. Make sure that they are flush with the surface of the soil and the netting is held secure. If you’re putting netting on harsher slopes, use 8 pins per 1 square metre (11 sq ft)."
                },
                {
                    "headline": "Overlap netting by 10 centimetres (3.9 in) on each side.",
                    "description": "This prevents water from flowing underneath and washing away your soil. Stagger the pins so it secures both sides of the overlap."
                }
            ]
        },
        {
            "name": "Planting Vegetation",
            "steps": [
                {
                    "headline": "Pick trees like alders and willows.",
                    "description": "Purchase saplings from your local nursery. These trees are able to survive in the moist soils on the river bank. These trees also serve as natural habitats for birds and insects near the river. It will take time for them to fully establish and protect against erosion. Use trees that are native to your area so you don’t disrupt the local ecosystem. Find trees further along the riverbank to get an idea of what species you should plant."
                },
                {
                    "headline": "Plant vegetation that has already established.",
                    "description": "Since the river could cause the soil to erode, don’t plant seeds directly near the river. Go to a local nursery and purchase saplings that have germinated and grown in pots. It is recommended to pick a diverse number of species that represent what naturally grows in the area."
                },
                {
                    "headline": "Keep vegetation at least 1 metre (3.3 ft) away from the river.",
                    "description": "Planting larger vegetation like trees and shrubs closer to the water can actually be more damaging to the soil. As the roots grow, they will expand and protect the soil closer to the river."
                },
                {
                    "headline": "Dig a hole 2 inches (5.1 cm) deeper and wider than the root system.",
                    "description": "Use a shovel or spade to make the hole. The extra depth and width gives you extra space to fill the dirt back in."
                },
                {
                    "headline": "Put the vegetation in the hole and refill it.",
                    "description": "Make sure the root system comes into contact with the soil. Gently compact and firm up the soil with your foot as you fill it in so your tree has a sturdy base. Cover the entire root system with soil. Space the plants at least 2 metres (6.6 ft) apart from one another."
                }
            ]
        },
        {
            "name": "Building a Riprap Wall",
            "steps": [
                {
                    "headline": "Determine the velocity of the river to determine what size rocks you need.",
                    "description": "Drop a wood chip into the stream and count the number of seconds it takes for it to travel 50 feet (15 m). Divide 50 feet (15 m) by the number of seconds it took to find the velocity. For example, if it takes 12 seconds for the wood chip to travel 50 feet (15 m), the velocity of the water is 4.16 feet (1.27 m) per second. For water that moves 2 to 4 feet (0.61 to 1.22 m) per second, use rocks 3 to 6 inches (7.6 to 15.2 cm) wide. For water that moves 4 to 6 feet (1.2 to 1.8 m) per second, use rocks 4 to 12 inches (10 to 30 cm) wide. For water that moves 6 to 12 feet (1.8 to 3.7 m) per second, use rocks 5 to 18 inches (13 to 46 cm) wide."
                },
                {
                    "headline": "Use granite or limestone.",
                    "description": "Pick angular and blocky shaped rocks since they leave less open space than if you use round rocks. Granite and limestone are commonly used since they are resilient and can withstand cycles of freezing and thawing. Broken concrete can also be used as long as it varies in size and no longer has steel rebar. Purchase the rocks from a landscaping store and ask them how many you may need for the area."
                },
                {
                    "headline": "Slope the river bank so it is twice as long as it is wide.",
                    "description": "Hire a professional or rent a mini-bulldozer to scrape away layers of soil. Your riprap wall should be tall enough so that it can handle the river at its highest point. Imagine a right triangle where the sloped side is the riprap. The bottom should be 2 times longer than the height. For example, if you need to build your riprap 6 feet (1.8 m) high, it should extend a total of 12 feet (3.7 m). Your total slope length, then, would be approximately 13.5 feet (4.1 m). The slope should extend down to the top of the river bank for the most erosion protection."
                },
                {
                    "headline": "Lay geotextile fabric on the slope to stabilize the soil.",
                    "description": "A roll of fabric like coir or jute can be purchased online or at specialty stores. Lay it over the entire slope. Secure the netting down with U-shaped pins every 30 centimetres (12 in). For added protection, you can also layer 6 inches (15 cm) of gravel on top of the fabric."
                },
                {
                    "headline": "Layer the rocks so the riprap is 12 to 18 inches (0.30 to 0.46 m) thick.",
                    "description": "Place the largest rocks as the bottom layer. Fill in the areas between them with smaller stones. Make the rocks fit together as close as possible so water cannot move around or through them. Use a variety of stone sizes to fill in the space as much as possible."
                }
            ]
        }
    ],
    "tyn": [
        "Coir Netting",
        "700 or 900 GSM coir netting",
        "Rake",
        "Shovel or trench digger",
        "U-shaped pins",
        "Rubber mallet",
        "Scissors",
        "Planting Vegetation",
        "Shovel",
        "Saplings",
        "Riprap",
        "Granite or limestone in various sizes",
        "Bulldozer",
        "Geotextile fabric, like coir or jute",
        "Pins",
        "Gravel (optional)"
    ],
    "text": " Installing Coir Netting Use coir netting that's 700-900 grams per square meter (GSM). Coir netting is made from coconut fibers and is biodegradable. Normal or heavy duty netting should be used when there is a large amount of water flow. Coir netting can be purchased online or from specialty landscaping and yardwork stores. Depending on the climate conditions in your area, coir netting can last from 24 to 48 months. Use a measuring tape to find the size of the area you need to cover with netting so you how much to buy. Remove grass, weeds, and debris from the river bank. Expose the soil on the river bank using a hoe or a sod cutter. Dig 2 inches (5.1 cm) deep to remove the roots. This ensures that the netting lays flat and covers the soil entirely. Add 5 centimetres (2.0 in) of topsoil. Cover the river bank with soil so you have a healthy base to plant vegetation. Rake and fertilize the soil so it’s prepared for planting. The soil should not have clumps since the coir netting needs to lay flat. You can apply grass seed to this topsoil so it grows through the spaces of the netting. You do not need to fertilize the soil if you don’t plan on planting anything. Dig a trench 15 cm (5.9 in) deep by 15 cm (5.9 in) wide at the top of the slope. Use a shovel or a trench digger across the entirety of the area you're placing the netting. The trench serves as an anchor point and prevents water from flowing under the netting. Line the trench with the netting. Make sure the netting lays flush with both of the walls and the bottom of the trench. Leave an extra 30 cm (12 in) of netting on the side of the trench furthest from the river bank. This will be folded over and secured later on. Drive U-shaped pins 30 cm (12 in) apart into the netting in the trench. Use a rubber mallet to secure the pins. The top of each pin should be flush to the ground. Stagger the pins by 5 centimetres (2.0 in) so they hold the netting taut. The pin length will depend on the firmness of your soil. If you have loose soil, use pins at least 45 centimetres (18 in) long. If the soil is firm and compact, use pins 30 centimetres (12 in) long. These can easily be found at most hardware stores. Though the netting will degrade over time, the pins will not. Fill the trench with compacted dirt. Once secured, press dirt back into the trench to compact it. Once it has been filled, take the extra netting left on top and fold it over the dirt. Secure it to the ground with pins every 30 centimetres (12 in) between the first set of pins. Plant grass seeds in the dirt you used to fill the trench before folding the netting. Roll the rest of the netting down the slope. Once you have reached the bottom of the slope, cut the netting with a pair of scissors. Have someone help with the netting since it usually comes in a 5 by 25 m (16 by 82 ft) roll. Hammer at least 4 pins per 1 square metre (11 sq ft). Stagger the pins 40 to 60 centimetres (1.3 to 2.0 ft) across the netting. Make sure that they are flush with the surface of the soil and the netting is held secure. If you’re putting netting on harsher slopes, use 8 pins per 1 square metre (11 sq ft). Overlap netting by 10 centimetres (3.9 in) on each side. This prevents water from flowing underneath and washing away your soil. Stagger the pins so it secures both sides of the overlap. Planting Vegetation Pick trees like alders and willows. Purchase saplings from your local nursery. These trees are able to survive in the moist soils on the river bank. These trees also serve as natural habitats for birds and insects near the river. It will take time for them to fully establish and protect against erosion. Use trees that are native to your area so you don’t disrupt the local ecosystem. Find trees further along the riverbank to get an idea of what species you should plant. Plant vegetation that has already established. Since the river could cause the soil to erode, don’t plant seeds directly near the river. Go to a local nursery and purchase saplings that have germinated and grown in pots. It is recommended to pick a diverse number of species that represent what naturally grows in the area. Keep vegetation at least 1 metre (3.3 ft) away from the river. Planting larger vegetation like trees and shrubs closer to the water can actually be more damaging to the soil. As the roots grow, they will expand and protect the soil closer to the river. Dig a hole 2 inches (5.1 cm) deeper and wider than the root system. Use a shovel or spade to make the hole. The extra depth and width gives you extra space to fill the dirt back in. Put the vegetation in the hole and refill it. Make sure the root system comes into contact with the soil. Gently compact and firm up the soil with your foot as you fill it in so your tree has a sturdy base. Cover the entire root system with soil. Space the plants at least 2 metres (6.6 ft) apart from one another. Building a Riprap Wall Determine the velocity of the river to determine what size rocks you need. Drop a wood chip into the stream and count the number of seconds it takes for it to travel 50 feet (15 m). Divide 50 feet (15 m) by the number of seconds it took to find the velocity. For example, if it takes 12 seconds for the wood chip to travel 50 feet (15 m), the velocity of the water is 4.16 feet (1.27 m) per second. For water that moves 2 to 4 feet (0.61 to 1.22 m) per second, use rocks 3 to 6 inches (7.6 to 15.2 cm) wide. For water that moves 4 to 6 feet (1.2 to 1.8 m) per second, use rocks 4 to 12 inches (10 to 30 cm) wide. For water that moves 6 to 12 feet (1.8 to 3.7 m) per second, use rocks 5 to 18 inches (13 to 46 cm) wide. Use granite or limestone. Pick angular and blocky shaped rocks since they leave less open space than if you use round rocks. Granite and limestone are commonly used since they are resilient and can withstand cycles of freezing and thawing. Broken concrete can also be used as long as it varies in size and no longer has steel rebar. Purchase the rocks from a landscaping store and ask them how many you may need for the area. Slope the river bank so it is twice as long as it is wide. Hire a professional or rent a mini-bulldozer to scrape away layers of soil. Your riprap wall should be tall enough so that it can handle the river at its highest point. Imagine a right triangle where the sloped side is the riprap. The bottom should be 2 times longer than the height. For example, if you need to build your riprap 6 feet (1.8 m) high, it should extend a total of 12 feet (3.7 m). Your total slope length, then, would be approximately 13.5 feet (4.1 m). The slope should extend down to the top of the river bank for the most erosion protection. Lay geotextile fabric on the slope to stabilize the soil. A roll of fabric like coir or jute can be purchased online or at specialty stores. Lay it over the entire slope. Secure the netting down with U-shaped pins every 30 centimetres (12 in). For added protection, you can also layer 6 inches (15 cm) of gravel on top of the fabric. Layer the rocks so the riprap is 12 to 18 inches (0.30 to 0.46 m) thick. Place the largest rocks as the bottom layer. Fill in the areas between them with smaller stones. Make the rocks fit together as close as possible so water cannot move around or through them. Use a variety of stone sizes to fill in the space as much as possible.",
    "sentences": [
        " Installing Coir Netting Use coir netting that's 700-900 grams per square meter (GSM).",
        "Coir netting is made from coconut fibers and is biodegradable.",
        "Normal or heavy duty netting should be used when there is a large amount of water flow.",
        "Coir netting can be purchased online or from specialty landscaping and yardwork stores.",
        "Depending on the climate conditions in your area, coir netting can last from 24 to 48 months.",
        "Use a measuring tape to find the size of the area you need to cover with netting so you how much to buy.",
        "Remove grass, weeds, and debris from the river bank.",
        "Expose the soil on the river bank using a hoe or a sod cutter.",
        "Dig 2 inches (5.1 cm) deep to remove the roots.",
        "This ensures that the netting lays flat and covers the soil entirely.",
        "Add 5 centimetres (2.0 in) of topsoil.",
        "Cover the river bank with soil so you have a healthy base to plant vegetation.",
        "Rake and fertilize the soil so it’s prepared for planting.",
        "The soil should not have clumps since the coir netting needs to lay flat.",
        "You can apply grass seed to this topsoil so it grows through the spaces of the netting.",
        "You do not need to fertilize the soil if you don’t plan on planting anything.",
        "Dig a trench 15 cm (5.9 in) deep by 15 cm (5.9 in) wide at the top of the slope.",
        "Use a shovel or a trench digger across the entirety of the area you're placing the netting.",
        "The trench serves as an anchor point and prevents water from flowing under the netting.",
        "Line the trench with the netting.",
        "Make sure the netting lays flush with both of the walls and the bottom of the trench.",
        "Leave an extra 30 cm (12 in) of netting on the side of the trench furthest from the river bank.",
        "This will be folded over and secured later on.",
        "Drive U-shaped pins 30 cm (12 in) apart into the netting in the trench.",
        "Use a rubber mallet to secure the pins.",
        "The top of each pin should be flush to the ground.",
        "Stagger the pins by 5 centimetres (2.0 in) so they hold the netting taut.",
        "The pin length will depend on the firmness of your soil.",
        "If you have loose soil, use pins at least 45 centimetres (18 in) long.",
        "If the soil is firm and compact, use pins 30 centimetres (12 in) long.",
        "These can easily be found at most hardware stores.",
        "Though the netting will degrade over time, the pins will not.",
        "Fill the trench with compacted dirt.",
        "Once secured, press dirt back into the trench to compact it.",
        "Once it has been filled, take the extra netting left on top and fold it over the dirt.",
        "Secure it to the ground with pins every 30 centimetres (12 in) between the first set of pins.",
        "Plant grass seeds in the dirt you used to fill the trench before folding the netting.",
        "Roll the rest of the netting down the slope.",
        "Once you have reached the bottom of the slope, cut the netting with a pair of scissors.",
        "Have someone help with the netting since it usually comes in a 5 by 25 m (16 by 82 ft) roll.",
        "Hammer at least 4 pins per 1 square metre (11 sq ft).",
        "Stagger the pins 40 to 60 centimetres (1.3 to 2.0 ft) across the netting.",
        "Make sure that they are flush with the surface of the soil and the netting is held secure.",
        "If you’re putting netting on harsher slopes, use 8 pins per 1 square metre (11 sq ft).",
        "Overlap netting by 10 centimetres (3.9 in) on each side.",
        "This prevents water from flowing underneath and washing away your soil.",
        "Stagger the pins so it secures both sides of the overlap.",
        "Planting Vegetation Pick trees like alders and willows.",
        "Purchase saplings from your local nursery.",
        "These trees are able to survive in the moist soils on the river bank.",
        "These trees also serve as natural habitats for birds and insects near the river.",
        "It will take time for them to fully establish and protect against erosion.",
        "Use trees that are native to your area so you don’t disrupt the local ecosystem.",
        "Find trees further along the riverbank to get an idea of what species you should plant.",
        "Plant vegetation that has already established.",
        "Since the river could cause the soil to erode, don’t plant seeds directly near the river.",
        "Go to a local nursery and purchase saplings that have germinated and grown in pots.",
        "It is recommended to pick a diverse number of species that represent what naturally grows in the area.",
        "Keep vegetation at least 1 metre (3.3 ft) away from the river.",
        "Planting larger vegetation like trees and shrubs closer to the water can actually be more damaging to the soil.",
        "As the roots grow, they will expand and protect the soil closer to the river.",
        "Dig a hole 2 inches (5.1 cm) deeper and wider than the root system.",
        "Use a shovel or spade to make the hole.",
        "The extra depth and width gives you extra space to fill the dirt back in.",
        "Put the vegetation in the hole and refill it.",
        "Make sure the root system comes into contact with the soil.",
        "Gently compact and firm up the soil with your foot as you fill it in so your tree has a sturdy base.",
        "Cover the entire root system with soil.",
        "Space the plants at least 2 metres (6.6 ft) apart from one another.",
        "Building a Riprap Wall Determine the velocity of the river to determine what size rocks you need.",
        "Drop a wood chip into the stream and count the number of seconds it takes for it to travel 50 feet (15 m).",
        "Divide 50 feet (15 m) by the number of seconds it took to find the velocity.",
        "For example, if it takes 12 seconds for the wood chip to travel 50 feet (15 m), the velocity of the water is 4.16 feet (1.27 m) per second.",
        "For water that moves 2 to 4 feet (0.61 to 1.22 m) per second, use rocks 3 to 6 inches (7.6 to 15.2 cm) wide.",
        "For water that moves 4 to 6 feet (1.2 to 1.8 m) per second, use rocks 4 to 12 inches (10 to 30 cm) wide.",
        "For water that moves 6 to 12 feet (1.8 to 3.7 m) per second, use rocks 5 to 18 inches (13 to 46 cm) wide.",
        "Use granite or limestone.",
        "Pick angular and blocky shaped rocks since they leave less open space than if you use round rocks.",
        "Granite and limestone are commonly used since they are resilient and can withstand cycles of freezing and thawing.",
        "Broken concrete can also be used as long as it varies in size and no longer has steel rebar.",
        "Purchase the rocks from a landscaping store and ask them how many you may need for the area.",
        "Slope the river bank so it is twice as long as it is wide.",
        "Hire a professional or rent a mini-bulldozer to scrape away layers of soil.",
        "Your riprap wall should be tall enough so that it can handle the river at its highest point.",
        "Imagine a right triangle where the sloped side is the riprap.",
        "The bottom should be 2 times longer than the height.",
        "For example, if you need to build your riprap 6 feet (1.8 m) high, it should extend a total of 12 feet (3.7 m).",
        "Your total slope length, then, would be approximately 13.5 feet (4.1 m).",
        "The slope should extend down to the top of the river bank for the most erosion protection.",
        "Lay geotextile fabric on the slope to stabilize the soil.",
        "A roll of fabric like coir or jute can be purchased online or at specialty stores.",
        "Lay it over the entire slope.",
        "Secure the netting down with U-shaped pins every 30 centimetres (12 in).",
        "For added protection, you can also layer 6 inches (15 cm) of gravel on top of the fabric.",
        "Layer the rocks so the riprap is 12 to 18 inches (0.30 to 0.46 m) thick.",
        "Place the largest rocks as the bottom layer.",
        "Fill in the areas between them with smaller stones.",
        "Make the rocks fit together as close as possible so water cannot move around or through them.",
        "Use a variety of stone sizes to fill in the space as much as possible."
    ]
}