{
    "title": "How to Harvest Chaga",
    "url": "https://www.wikihow.com/Harvest-Chaga",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Harvest and Storage"
    ],
    "parts": [
        {
            "name": "Locating Chaga",
            "steps": [
                {
                    "headline": "Harvest chaga in the late fall or winter.",
                    "description": "Wait until temperatures are consistently below 5 °C (41 °F) for at least 3 weeks. At this time, the trees that chaga grow on have gone dormant and the mushroom has the peak amount of nutrients. In the summer, the chaga will have the most water content and all of the nutrients will be flushed out until the following fall."
                },
                {
                    "headline": "Look for birch trees in cold northern areas.",
                    "description": "Identify birch trees by their curly, paper-like bark. Chaga is parasitic and grows exclusively on living trees in birch forests in the northern hemisphere. Look for paper birch, yellow birch, cherry birch, or heart-leaved birch when you look for chaga."
                },
                {
                    "headline": "Find large knobby growths on the trunk that resemble black charcoal.",
                    "description": "You’ll typically find the chaga shaped like domes or cones, but they grow in all shapes and sizes on the trees. Look for dark black knobs with cracks running through it. The exterior of the chaga mushroom is also known as the sclerotium. Chaga can grow anywhere on the trunk of the tree, so consider bringing a ladder for out of reach places."
                },
                {
                    "headline": "Cut open the growth with a knife to see if is rust-colored inside.",
                    "description": "Use a knife to cut off a small portion of the exterior. The inner part of the chaga will be softer than the exterior and have a yellow or brown color if it’s healthy."
                }
            ]
        },
        {
            "name": "Removing Chaga from the Tree",
            "steps": [
                {
                    "headline": "Use a hatchet or a large outdoor knife to harvest chaga.",
                    "description": "You need a sharp tool to puncture through the hard exterior of the chaga. A small hatchet or a larger machete-type knife will work best to break through the chaga. You can purchase a hatchet or outdoor knife at any outdoors specialty stores or online."
                },
                {
                    "headline": "Collect chaga that has grown larger than a grapefruit.",
                    "description": "Make sure the chaga is large enough so you don’t damage the tree once you start chopping it. This ensures that you are able to leave enough chaga for the tree to survive and so the chaga can regrow. Put your hand on the chaga to see if you feel any tree bark on your fingertips. If you do, it’s best to leave the chaga to grow for a few more years."
                },
                {
                    "headline": "Chop the chaga from the side of the growth.",
                    "description": "Firmly hold the ax in your dominant hand and swing near the outer edge of the chaga. It will take a few strong blows from the ax to remove the chaga. Let the chaga fall to the ground before you put it in a plastic bag. Avoid hitting near the base of the tree so you don’t cause any damage."
                },
                {
                    "headline": "Leave at least 20 percent of the chaga on the tree.",
                    "description": "Chaga can regrow after it’s been removed, so make sure to leave a portion of it attached. This helps the tree and chaga survive longer so you can continue to harvest from it! If a tree has multiple chaga growths, leave at least 1 of them completely intact."
                }
            ]
        },
        {
            "name": "Drying and Storing Chaga",
            "steps": [
                {
                    "headline": "Remove any tree bark from your chaga.",
                    "description": "Gently clean the exterior of the chaga with your hands or a soft-bristled brush. Make sure there are no insects or residual tree bark left on the chaga, or else it could develop mold."
                },
                {
                    "headline": "Break chunks of chaga into pieces 1 by 1 in (2.5 by 2.5 cm) or smaller in size.",
                    "description": "Larger pieces of chaga will take longer to dry out and could possibly develop mold. Use a knife to cut the chaga into pieces so they will dry out more efficiently. The pieces do not need to be uniform in shape, but they should be relatively similar in size. You can cut the pieces thinner if you want them to dry more quickly."
                },
                {
                    "headline": "Place the pieces on a tray on a sunny windowsill to dry them.",
                    "description": "Try to use a grated tray so air can flow on all sides of the chaga pieces. Leave them on the windowsill for 3 days until they feel hard and dry. Do not use the oven to dry out mushrooms. If you have access to a dehydrator, set the temperature to 120 °F (49 °C) or lower to dry the mushrooms."
                },
                {
                    "headline": "Store the pieces in an airtight glass jar in a dark place for up to 1 year.",
                    "description": "Dump all the pieces of the chaga into the jar and keep it in a cupboard or closed pantry. Chaga can be stored throughout the year. Most times, 1 grapefruit-sized portion of chaga will be enough for a full year unless you use it multiple times a day. The chunks can be ground into a powder with a mortar and pestle after they have been dried."
                }
            ]
        },
        {
            "name": "Making Chaga Tea",
            "steps": [
                {
                    "headline": "Boil water in a medium pot of water and drop a handful of chaga in.",
                    "description": "Use up to 1 litre (0.26 US gal) of water in a pot. Put 1 handful of dried chaga, or about 10 pieces, into the pot so the nutrients can steep."
                },
                {
                    "headline": "Reduce the pot to medium heat and simmer the chaga for 1 hour.",
                    "description": "The water will become a dark reddish-brown color as it steeps. The longer you let the chaga steep, the more bioactive ingredients will be extracted. Cover the pot if you want to contain heat. This will make chaga steep faster."
                },
                {
                    "headline": "Strain the tea into a mug.",
                    "description": "Use a strainer or colander over your mug to catch the chaga as you pour the tea into the mug. Add honey or maple syrup to taste if you want to sweeten the tea. You could also remove the chaga pieces with a slotted spoon and place them on a paper towel."
                },
                {
                    "headline": "Place the chaga pieces on a tray to dry out and reuse them.",
                    "description": "Put the tray in a warm area with good air flow to let them dry. The chaga can be used at least 3 times to make tea before you dispose of it. Store used chaga in a separate container or sealed bag so it does not mix with unused chaga."
                }
            ]
        }
    ],
    "tyn": [
        "Removing Chaga from the Tree",
        "Hatchet",
        "Outdoor knife",
        "Plastic bags",
        "Ladder (optional)",
        "Drying and Storing Chaga",
        "Tray",
        "A sunny, dry place like a windowsill",
        "Resealable glass jar",
        "Dehydrator (optional)",
        "Mortar and pestle (optional)",
        "Chaga Tea",
        "Stove",
        "Medium pot",
        "Mug",
        "Strainer"
    ],
    "text": " Locating Chaga Harvest chaga in the late fall or winter. Wait until temperatures are consistently below 5 °C (41 °F) for at least 3 weeks. At this time, the trees that chaga grow on have gone dormant and the mushroom has the peak amount of nutrients. In the summer, the chaga will have the most water content and all of the nutrients will be flushed out until the following fall. Look for birch trees in cold northern areas. Identify birch trees by their curly, paper-like bark. Chaga is parasitic and grows exclusively on living trees in birch forests in the northern hemisphere. Look for paper birch, yellow birch, cherry birch, or heart-leaved birch when you look for chaga. Find large knobby growths on the trunk that resemble black charcoal. You’ll typically find the chaga shaped like domes or cones, but they grow in all shapes and sizes on the trees. Look for dark black knobs with cracks running through it. The exterior of the chaga mushroom is also known as the sclerotium. Chaga can grow anywhere on the trunk of the tree, so consider bringing a ladder for out of reach places. Cut open the growth with a knife to see if is rust-colored inside. Use a knife to cut off a small portion of the exterior. The inner part of the chaga will be softer than the exterior and have a yellow or brown color if it’s healthy. Removing Chaga from the Tree Use a hatchet or a large outdoor knife to harvest chaga. You need a sharp tool to puncture through the hard exterior of the chaga. A small hatchet or a larger machete-type knife will work best to break through the chaga. You can purchase a hatchet or outdoor knife at any outdoors specialty stores or online. Collect chaga that has grown larger than a grapefruit. Make sure the chaga is large enough so you don’t damage the tree once you start chopping it. This ensures that you are able to leave enough chaga for the tree to survive and so the chaga can regrow. Put your hand on the chaga to see if you feel any tree bark on your fingertips. If you do, it’s best to leave the chaga to grow for a few more years. Chop the chaga from the side of the growth. Firmly hold the ax in your dominant hand and swing near the outer edge of the chaga. It will take a few strong blows from the ax to remove the chaga. Let the chaga fall to the ground before you put it in a plastic bag. Avoid hitting near the base of the tree so you don’t cause any damage. Leave at least 20 percent of the chaga on the tree. Chaga can regrow after it’s been removed, so make sure to leave a portion of it attached. This helps the tree and chaga survive longer so you can continue to harvest from it! If a tree has multiple chaga growths, leave at least 1 of them completely intact. Drying and Storing Chaga Remove any tree bark from your chaga. Gently clean the exterior of the chaga with your hands or a soft-bristled brush. Make sure there are no insects or residual tree bark left on the chaga, or else it could develop mold. Break chunks of chaga into pieces 1 by 1 in (2.5 by 2.5 cm) or smaller in size. Larger pieces of chaga will take longer to dry out and could possibly develop mold. Use a knife to cut the chaga into pieces so they will dry out more efficiently. The pieces do not need to be uniform in shape, but they should be relatively similar in size. You can cut the pieces thinner if you want them to dry more quickly. Place the pieces on a tray on a sunny windowsill to dry them. Try to use a grated tray so air can flow on all sides of the chaga pieces. Leave them on the windowsill for 3 days until they feel hard and dry. Do not use the oven to dry out mushrooms. If you have access to a dehydrator, set the temperature to 120 °F (49 °C) or lower to dry the mushrooms. Store the pieces in an airtight glass jar in a dark place for up to 1 year. Dump all the pieces of the chaga into the jar and keep it in a cupboard or closed pantry. Chaga can be stored throughout the year. Most times, 1 grapefruit-sized portion of chaga will be enough for a full year unless you use it multiple times a day. The chunks can be ground into a powder with a mortar and pestle after they have been dried. Making Chaga Tea Boil water in a medium pot of water and drop a handful of chaga in. Use up to 1 litre (0.26 US gal) of water in a pot. Put 1 handful of dried chaga, or about 10 pieces, into the pot so the nutrients can steep. Reduce the pot to medium heat and simmer the chaga for 1 hour. The water will become a dark reddish-brown color as it steeps. The longer you let the chaga steep, the more bioactive ingredients will be extracted. Cover the pot if you want to contain heat. This will make chaga steep faster. Strain the tea into a mug. Use a strainer or colander over your mug to catch the chaga as you pour the tea into the mug. Add honey or maple syrup to taste if you want to sweeten the tea. You could also remove the chaga pieces with a slotted spoon and place them on a paper towel. Place the chaga pieces on a tray to dry out and reuse them. Put the tray in a warm area with good air flow to let them dry. The chaga can be used at least 3 times to make tea before you dispose of it. Store used chaga in a separate container or sealed bag so it does not mix with unused chaga.",
    "sentences": [
        " Locating Chaga Harvest chaga in the late fall or winter.",
        "Wait until temperatures are consistently below 5 °C (41 °F) for at least 3 weeks.",
        "At this time, the trees that chaga grow on have gone dormant and the mushroom has the peak amount of nutrients.",
        "In the summer, the chaga will have the most water content and all of the nutrients will be flushed out until the following fall.",
        "Look for birch trees in cold northern areas.",
        "Identify birch trees by their curly, paper-like bark.",
        "Chaga is parasitic and grows exclusively on living trees in birch forests in the northern hemisphere.",
        "Look for paper birch, yellow birch, cherry birch, or heart-leaved birch when you look for chaga.",
        "Find large knobby growths on the trunk that resemble black charcoal.",
        "You’ll typically find the chaga shaped like domes or cones, but they grow in all shapes and sizes on the trees.",
        "Look for dark black knobs with cracks running through it.",
        "The exterior of the chaga mushroom is also known as the sclerotium.",
        "Chaga can grow anywhere on the trunk of the tree, so consider bringing a ladder for out of reach places.",
        "Cut open the growth with a knife to see if is rust-colored inside.",
        "Use a knife to cut off a small portion of the exterior.",
        "The inner part of the chaga will be softer than the exterior and have a yellow or brown color if it’s healthy.",
        "Removing Chaga from the Tree Use a hatchet or a large outdoor knife to harvest chaga.",
        "You need a sharp tool to puncture through the hard exterior of the chaga.",
        "A small hatchet or a larger machete-type knife will work best to break through the chaga.",
        "You can purchase a hatchet or outdoor knife at any outdoors specialty stores or online.",
        "Collect chaga that has grown larger than a grapefruit.",
        "Make sure the chaga is large enough so you don’t damage the tree once you start chopping it.",
        "This ensures that you are able to leave enough chaga for the tree to survive and so the chaga can regrow.",
        "Put your hand on the chaga to see if you feel any tree bark on your fingertips.",
        "If you do, it’s best to leave the chaga to grow for a few more years.",
        "Chop the chaga from the side of the growth.",
        "Firmly hold the ax in your dominant hand and swing near the outer edge of the chaga.",
        "It will take a few strong blows from the ax to remove the chaga.",
        "Let the chaga fall to the ground before you put it in a plastic bag.",
        "Avoid hitting near the base of the tree so you don’t cause any damage.",
        "Leave at least 20 percent of the chaga on the tree.",
        "Chaga can regrow after it’s been removed, so make sure to leave a portion of it attached.",
        "This helps the tree and chaga survive longer so you can continue to harvest from it!",
        "If a tree has multiple chaga growths, leave at least 1 of them completely intact.",
        "Drying and Storing Chaga Remove any tree bark from your chaga.",
        "Gently clean the exterior of the chaga with your hands or a soft-bristled brush.",
        "Make sure there are no insects or residual tree bark left on the chaga, or else it could develop mold.",
        "Break chunks of chaga into pieces 1 by 1 in (2.5 by 2.5 cm) or smaller in size.",
        "Larger pieces of chaga will take longer to dry out and could possibly develop mold.",
        "Use a knife to cut the chaga into pieces so they will dry out more efficiently.",
        "The pieces do not need to be uniform in shape, but they should be relatively similar in size.",
        "You can cut the pieces thinner if you want them to dry more quickly.",
        "Place the pieces on a tray on a sunny windowsill to dry them.",
        "Try to use a grated tray so air can flow on all sides of the chaga pieces.",
        "Leave them on the windowsill for 3 days until they feel hard and dry.",
        "Do not use the oven to dry out mushrooms.",
        "If you have access to a dehydrator, set the temperature to 120 °F (49 °C) or lower to dry the mushrooms.",
        "Store the pieces in an airtight glass jar in a dark place for up to 1 year.",
        "Dump all the pieces of the chaga into the jar and keep it in a cupboard or closed pantry.",
        "Chaga can be stored throughout the year.",
        "Most times, 1 grapefruit-sized portion of chaga will be enough for a full year unless you use it multiple times a day.",
        "The chunks can be ground into a powder with a mortar and pestle after they have been dried.",
        "Making Chaga Tea Boil water in a medium pot of water and drop a handful of chaga in.",
        "Use up to 1 litre (0.26 US gal) of water in a pot.",
        "Put 1 handful of dried chaga, or about 10 pieces, into the pot so the nutrients can steep.",
        "Reduce the pot to medium heat and simmer the chaga for 1 hour.",
        "The water will become a dark reddish-brown color as it steeps.",
        "The longer you let the chaga steep, the more bioactive ingredients will be extracted.",
        "Cover the pot if you want to contain heat.",
        "This will make chaga steep faster.",
        "Strain the tea into a mug.",
        "Use a strainer or colander over your mug to catch the chaga as you pour the tea into the mug.",
        "Add honey or maple syrup to taste if you want to sweeten the tea.",
        "You could also remove the chaga pieces with a slotted spoon and place them on a paper towel.",
        "Place the chaga pieces on a tray to dry out and reuse them.",
        "Put the tray in a warm area with good air flow to let them dry.",
        "The chaga can be used at least 3 times to make tea before you dispose of it.",
        "Store used chaga in a separate container or sealed bag so it does not mix with unused chaga."
    ]
}