{
    "title": "How to Plant the Three Sisters",
    "url": "https://www.wikihow.com/Plant-the-Three-Sisters",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Planting and Growing",
        "Growing Vegetables",
        "Growing Squashes"
    ],
    "parts": [
        {
            "name": "Setting up Your Garden",
            "steps": [
                {
                    "headline": "Choose a large spot that receives at least 6 hours of full sunlight.",
                    "description": "The three sisters need plenty of space to grow to their fullest potential. Ideally, the plot should be at least 10 by 10 feet (3.0 m × 3.0 m) large. The plot should not be near any tree, sheds, walls, or other shaded areas."
                },
                {
                    "headline": "Test the soil for a pH between 5.5 and 7.",
                    "description": "A neutral pH is ideal for growing corn, squash, and beans. Contact your local extension office or gardening store for a soil pH testing kit. If you need to, amend the soil before planting to get it to the right pH. If you need to raise the pH, mix lime into the soil. If you need to lower it, add sulfur. These can be bought at garden stores and nurseries."
                },
                {
                    "headline": "Select heirloom varieties of corn, beans, and squash.",
                    "description": "Heirloom varieties are more traditional, and they grow well together. Non-heirloom varieties of beans, in particular, may grow too large and overwhelm the other plants if used. Choose flint, dent, or flour corn varieties. While you can plant sweet corn, you will have to harvest it much earlier than the other plants. Choose pole or runner beans instead of bush beans. Dry beans, such as pinto or kidney beans, or green beans work well. Pumpkin or squash works well in this configuration. Winter squash and sugar pumpkins are ideal."
                },
                {
                    "headline": "Create mounds for each plot of plants.",
                    "description": "Use your hands to push and pack dirt into mounds. Flatten out the top of each mound. Each mound should be 1 foot (0.30 m) high and 3–4 feet (0.91–1.22 m) wide. Keep each mound 3–4 feet (0.91–1.22 m) apart. Mark the center of each mound with a stick. This will help you measure and find your mounds. When you plant the vegetables, corn will grow in the mound with beans around the corn and squash around the beans."
                },
                {
                    "headline": "Fertilize the soil with traditional or organic fertilizers.",
                    "description": "Many people plant the three sisters because they grow well organically. To keep up with this practice, prepare the soil by applying an organic high-nitrogen fertilizer around the mound. You can use manure, fish emulsion, or—for a very traditional approach—fish scraps. If you decide that you don’t want an organic garden, you can use a basic 10-10-10 fertilizer."
                }
            ]
        },
        {
            "name": "Planting the Corn",
            "steps": [
                {
                    "headline": "Start planting the corn in late spring.",
                    "description": "Generally, you want to plant the sisters about 4-6 weeks after the last frost. For most places, this will be in May. To learn the frost dates in your area, contact a local weather service or extension office. You can also consult an almanac."
                },
                {
                    "headline": "Soak the corn for seeds for 4-6 hours before planting.",
                    "description": "Fill a bowl with water and sprinkle the seeds into it. Soak about 5-7 seeds for every mound that you plan to plant. Do not soak the seeds for more than 8 hours, or they may rot."
                },
                {
                    "headline": "Plant 5-7 seeds in each mound.",
                    "description": "Each seed should be evenly spaced about 6 inches apart. Stick the seeds down to a depth of about 1–1.5 inches (2.5–3.8 cm). Cover them with soil afterwards."
                },
                {
                    "headline": "Water the mound thoroughly after planting.",
                    "description": "Water until the soil is damp. Afterwards, continue to water the mound about 1 inch (2.5 cm) of water a week. This is roughly .6 gallons (2.3 l; 0.50 imp gal) per square foot."
                },
                {
                    "headline": "Thin the seedlings once they are 3–4 inches (7.6–10.2 cm) tall.",
                    "description": "Keep 3 or 4 seedlings. Choose the larger and stronger seedlings while weeding out the smaller seedings. The seedlings should now be about 8–12 inches (20–30 cm) apart."
                }
            ]
        },
        {
            "name": "Planting the Beans and Squash",
            "steps": [
                {
                    "headline": "Wait until the corn is at least 4–6 inches (10–15 cm) high.",
                    "description": "It may take a few weeks for the corn to grow to the right height. Once it is roughly this height, however, you can start planting the beans and squash."
                },
                {
                    "headline": "Weed the patch before planting the beans.",
                    "description": "Pull up any weeds or grass that have ground around the mound. Make sure to remove their roots with your hands or a trowel. This will clear the soil for your beans."
                },
                {
                    "headline": "Plant 4 bean seeds evenly spaced around each stalk of corn.",
                    "description": "Plant the beans in a circle around the corn. Keep each bean seed evenly spaced about 6 inches (15 cm) away from the corn. Read the packet of your bean variety to learn how deep the seed should be planted. You do not need to stake the pole beans. They will naturally grow up around the corn. This is another benefit of growing corn and beans together!"
                },
                {
                    "headline": "Plant 6 squash seeds when the beans have sprouted.",
                    "description": "Little green sprouts should appear from the bean seeds after about 1 week. When this happens, plant the squash (or pumpkin) evenly spaced around the edges of the mound. The squash needs the most sun out of any of the plants, so make sure they are not in the shade. Plant the squash about 1 foot (0.30 m) away from the beans. If you are planting pumpkins and you have more than 1 mound, consider only planting the pumpkins in every other mound. This will prevent your garden from becoming overwhelmed with pumpkin vines."
                }
            ]
        },
        {
            "name": "Maintaining Each Plot",
            "steps": [
                {
                    "headline": "Water the plot about 1 inch (2.5 cm) a week.",
                    "description": "This is roughly .6 gallons (2.3 l; 0.50 imp gal) for every 1 foot (0.30 m) of the garden. You only need to water the garden yourself if it doesn’t rain in your area during the week."
                },
                {
                    "headline": "Add mulch between each mound to prevent weeds.",
                    "description": "If you live in a dry area, mulch will prevent the soil from drying out. You can use mulches containing wood shavings, leaf mold, or straw. You do not need to mulch the area around each individual plant, however, as the squash vines provide a natural ground covering. If you are trying to do an “authentic” Native American three sisters plot, you may wish to skip the mulch, as it isn’t traditional."
                },
                {
                    "headline": "Harvest each plant when it matures.",
                    "description": "The harvest depends on what variety of plant you chose. Generally, you will harvest the vegetables in fall. Plan to harvest your vegetables on a dry day to prevent the spread of disease. Corn is ready to be harvested when the outer husks have turned dry. If you cut open an end kernel, it will release a milky fluid when it is ready. Dry beans are ready for harvest when they have turned hard and dry. Green beans, on the other hand, should be tender when you harvest them. Harvest winter squash and pumpkins once the outer flesh has hardened. If you can’t puncture the skin with a fingernail, you can pick it."
                },
                {
                    "headline": "Allow the beans to decompose in the soil over the winter.",
                    "description": "This process adds nitrogen to the soil, which will make your three sisters crop more successful in the second year. Instead of removing the dead plants, leave them alone."
                }
            ]
        }
    ],
    "tyn": [
        "Soil testing kit",
        "Gardening gloves",
        "Corn seeds",
        "Bean seeds",
        "Squash or pumpkin seeds",
        "Manure or fish emulsion fertilizer",
        "Garden hose",
        "Trowel",
        "Mulch"
    ],
    "text": " Setting up Your Garden Choose a large spot that receives at least 6 hours of full sunlight. The three sisters need plenty of space to grow to their fullest potential. Ideally, the plot should be at least 10 by 10 feet (3.0 m × 3.0 m) large. The plot should not be near any tree, sheds, walls, or other shaded areas. Test the soil for a pH between 5.5 and 7. A neutral pH is ideal for growing corn, squash, and beans. Contact your local extension office or gardening store for a soil pH testing kit. If you need to, amend the soil before planting to get it to the right pH. If you need to raise the pH, mix lime into the soil. If you need to lower it, add sulfur. These can be bought at garden stores and nurseries. Select heirloom varieties of corn, beans, and squash. Heirloom varieties are more traditional, and they grow well together. Non-heirloom varieties of beans, in particular, may grow too large and overwhelm the other plants if used. Choose flint, dent, or flour corn varieties. While you can plant sweet corn, you will have to harvest it much earlier than the other plants. Choose pole or runner beans instead of bush beans. Dry beans, such as pinto or kidney beans, or green beans work well. Pumpkin or squash works well in this configuration. Winter squash and sugar pumpkins are ideal. Create mounds for each plot of plants. Use your hands to push and pack dirt into mounds. Flatten out the top of each mound. Each mound should be 1 foot (0.30 m) high and 3–4 feet (0.91–1.22 m) wide. Keep each mound 3–4 feet (0.91–1.22 m) apart. Mark the center of each mound with a stick. This will help you measure and find your mounds. When you plant the vegetables, corn will grow in the mound with beans around the corn and squash around the beans. Fertilize the soil with traditional or organic fertilizers. Many people plant the three sisters because they grow well organically. To keep up with this practice, prepare the soil by applying an organic high-nitrogen fertilizer around the mound. You can use manure, fish emulsion, or—for a very traditional approach—fish scraps. If you decide that you don’t want an organic garden, you can use a basic 10-10-10 fertilizer. Planting the Corn Start planting the corn in late spring. Generally, you want to plant the sisters about 4-6 weeks after the last frost. For most places, this will be in May. To learn the frost dates in your area, contact a local weather service or extension office. You can also consult an almanac. Soak the corn for seeds for 4-6 hours before planting. Fill a bowl with water and sprinkle the seeds into it. Soak about 5-7 seeds for every mound that you plan to plant. Do not soak the seeds for more than 8 hours, or they may rot. Plant 5-7 seeds in each mound. Each seed should be evenly spaced about 6 inches apart. Stick the seeds down to a depth of about 1–1.5 inches (2.5–3.8 cm). Cover them with soil afterwards. Water the mound thoroughly after planting. Water until the soil is damp. Afterwards, continue to water the mound about 1 inch (2.5 cm) of water a week. This is roughly .6 gallons (2.3 l; 0.50 imp gal) per square foot. Thin the seedlings once they are 3–4 inches (7.6–10.2 cm) tall. Keep 3 or 4 seedlings. Choose the larger and stronger seedlings while weeding out the smaller seedings. The seedlings should now be about 8–12 inches (20–30 cm) apart. Planting the Beans and Squash Wait until the corn is at least 4–6 inches (10–15 cm) high. It may take a few weeks for the corn to grow to the right height. Once it is roughly this height, however, you can start planting the beans and squash. Weed the patch before planting the beans. Pull up any weeds or grass that have ground around the mound. Make sure to remove their roots with your hands or a trowel. This will clear the soil for your beans. Plant 4 bean seeds evenly spaced around each stalk of corn. Plant the beans in a circle around the corn. Keep each bean seed evenly spaced about 6 inches (15 cm) away from the corn. Read the packet of your bean variety to learn how deep the seed should be planted. You do not need to stake the pole beans. They will naturally grow up around the corn. This is another benefit of growing corn and beans together! Plant 6 squash seeds when the beans have sprouted. Little green sprouts should appear from the bean seeds after about 1 week. When this happens, plant the squash (or pumpkin) evenly spaced around the edges of the mound. The squash needs the most sun out of any of the plants, so make sure they are not in the shade. Plant the squash about 1 foot (0.30 m) away from the beans. If you are planting pumpkins and you have more than 1 mound, consider only planting the pumpkins in every other mound. This will prevent your garden from becoming overwhelmed with pumpkin vines. Maintaining Each Plot Water the plot about 1 inch (2.5 cm) a week. This is roughly .6 gallons (2.3 l; 0.50 imp gal) for every 1 foot (0.30 m) of the garden. You only need to water the garden yourself if it doesn’t rain in your area during the week. Add mulch between each mound to prevent weeds. If you live in a dry area, mulch will prevent the soil from drying out. You can use mulches containing wood shavings, leaf mold, or straw. You do not need to mulch the area around each individual plant, however, as the squash vines provide a natural ground covering. If you are trying to do an “authentic” Native American three sisters plot, you may wish to skip the mulch, as it isn’t traditional. Harvest each plant when it matures. The harvest depends on what variety of plant you chose. Generally, you will harvest the vegetables in fall. Plan to harvest your vegetables on a dry day to prevent the spread of disease. Corn is ready to be harvested when the outer husks have turned dry. If you cut open an end kernel, it will release a milky fluid when it is ready. Dry beans are ready for harvest when they have turned hard and dry. Green beans, on the other hand, should be tender when you harvest them. Harvest winter squash and pumpkins once the outer flesh has hardened. If you can’t puncture the skin with a fingernail, you can pick it. Allow the beans to decompose in the soil over the winter. This process adds nitrogen to the soil, which will make your three sisters crop more successful in the second year. Instead of removing the dead plants, leave them alone.",
    "sentences": [
        " Setting up Your Garden Choose a large spot that receives at least 6 hours of full sunlight.",
        "The three sisters need plenty of space to grow to their fullest potential.",
        "Ideally, the plot should be at least 10 by 10 feet (3.0 m × 3.0 m) large.",
        "The plot should not be near any tree, sheds, walls, or other shaded areas.",
        "Test the soil for a pH between 5.5 and 7.",
        "A neutral pH is ideal for growing corn, squash, and beans.",
        "Contact your local extension office or gardening store for a soil pH testing kit.",
        "If you need to, amend the soil before planting to get it to the right pH.",
        "If you need to raise the pH, mix lime into the soil.",
        "If you need to lower it, add sulfur.",
        "These can be bought at garden stores and nurseries.",
        "Select heirloom varieties of corn, beans, and squash.",
        "Heirloom varieties are more traditional, and they grow well together.",
        "Non-heirloom varieties of beans, in particular, may grow too large and overwhelm the other plants if used.",
        "Choose flint, dent, or flour corn varieties.",
        "While you can plant sweet corn, you will have to harvest it much earlier than the other plants.",
        "Choose pole or runner beans instead of bush beans.",
        "Dry beans, such as pinto or kidney beans, or green beans work well.",
        "Pumpkin or squash works well in this configuration.",
        "Winter squash and sugar pumpkins are ideal.",
        "Create mounds for each plot of plants.",
        "Use your hands to push and pack dirt into mounds.",
        "Flatten out the top of each mound.",
        "Each mound should be 1 foot (0.30 m) high and 3–4 feet (0.91–1.22 m) wide.",
        "Keep each mound 3–4 feet (0.91–1.22 m) apart.",
        "Mark the center of each mound with a stick.",
        "This will help you measure and find your mounds.",
        "When you plant the vegetables, corn will grow in the mound with beans around the corn and squash around the beans.",
        "Fertilize the soil with traditional or organic fertilizers.",
        "Many people plant the three sisters because they grow well organically.",
        "To keep up with this practice, prepare the soil by applying an organic high-nitrogen fertilizer around the mound.",
        "You can use manure, fish emulsion, or—for a very traditional approach—fish scraps.",
        "If you decide that you don’t want an organic garden, you can use a basic 10-10-10 fertilizer.",
        "Planting the Corn Start planting the corn in late spring.",
        "Generally, you want to plant the sisters about 4-6 weeks after the last frost.",
        "For most places, this will be in May.",
        "To learn the frost dates in your area, contact a local weather service or extension office.",
        "You can also consult an almanac.",
        "Soak the corn for seeds for 4-6 hours before planting.",
        "Fill a bowl with water and sprinkle the seeds into it.",
        "Soak about 5-7 seeds for every mound that you plan to plant.",
        "Do not soak the seeds for more than 8 hours, or they may rot.",
        "Plant 5-7 seeds in each mound.",
        "Each seed should be evenly spaced about 6 inches apart.",
        "Stick the seeds down to a depth of about 1–1.5 inches (2.5–3.8 cm).",
        "Cover them with soil afterwards.",
        "Water the mound thoroughly after planting.",
        "Water until the soil is damp.",
        "Afterwards, continue to water the mound about 1 inch (2.5 cm) of water a week.",
        "This is roughly .6 gallons (2.3 l; 0.50 imp gal) per square foot.",
        "Thin the seedlings once they are 3–4 inches (7.6–10.2 cm) tall.",
        "Keep 3 or 4 seedlings.",
        "Choose the larger and stronger seedlings while weeding out the smaller seedings.",
        "The seedlings should now be about 8–12 inches (20–30 cm) apart.",
        "Planting the Beans and Squash Wait until the corn is at least 4–6 inches (10–15 cm) high.",
        "It may take a few weeks for the corn to grow to the right height.",
        "Once it is roughly this height, however, you can start planting the beans and squash.",
        "Weed the patch before planting the beans.",
        "Pull up any weeds or grass that have ground around the mound.",
        "Make sure to remove their roots with your hands or a trowel.",
        "This will clear the soil for your beans.",
        "Plant 4 bean seeds evenly spaced around each stalk of corn.",
        "Plant the beans in a circle around the corn.",
        "Keep each bean seed evenly spaced about 6 inches (15 cm) away from the corn.",
        "Read the packet of your bean variety to learn how deep the seed should be planted.",
        "You do not need to stake the pole beans.",
        "They will naturally grow up around the corn.",
        "This is another benefit of growing corn and beans together!",
        "Plant 6 squash seeds when the beans have sprouted.",
        "Little green sprouts should appear from the bean seeds after about 1 week.",
        "When this happens, plant the squash (or pumpkin) evenly spaced around the edges of the mound.",
        "The squash needs the most sun out of any of the plants, so make sure they are not in the shade.",
        "Plant the squash about 1 foot (0.30 m) away from the beans.",
        "If you are planting pumpkins and you have more than 1 mound, consider only planting the pumpkins in every other mound.",
        "This will prevent your garden from becoming overwhelmed with pumpkin vines.",
        "Maintaining Each Plot Water the plot about 1 inch (2.5 cm) a week.",
        "This is roughly .6 gallons (2.3 l; 0.50 imp gal) for every 1 foot (0.30 m) of the garden.",
        "You only need to water the garden yourself if it doesn’t rain in your area during the week.",
        "Add mulch between each mound to prevent weeds.",
        "If you live in a dry area, mulch will prevent the soil from drying out.",
        "You can use mulches containing wood shavings, leaf mold, or straw.",
        "You do not need to mulch the area around each individual plant, however, as the squash vines provide a natural ground covering.",
        "If you are trying to do an “authentic” Native American three sisters plot, you may wish to skip the mulch, as it isn’t traditional.",
        "Harvest each plant when it matures.",
        "The harvest depends on what variety of plant you chose.",
        "Generally, you will harvest the vegetables in fall.",
        "Plan to harvest your vegetables on a dry day to prevent the spread of disease.",
        "Corn is ready to be harvested when the outer husks have turned dry.",
        "If you cut open an end kernel, it will release a milky fluid when it is ready.",
        "Dry beans are ready for harvest when they have turned hard and dry.",
        "Green beans, on the other hand, should be tender when you harvest them.",
        "Harvest winter squash and pumpkins once the outer flesh has hardened.",
        "If you can’t puncture the skin with a fingernail, you can pick it.",
        "Allow the beans to decompose in the soil over the winter.",
        "This process adds nitrogen to the soil, which will make your three sisters crop more successful in the second year.",
        "Instead of removing the dead plants, leave them alone."
    ]
}