{
    "title": "How to Grow English Ivy Indoors",
    "url": "https://www.wikihow.com/Grow-English-Ivy-Indoors",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Planting and Growing"
    ],
    "methods": [
        {
            "name": "Choosing a Container and Location",
            "steps": [
                {
                    "headline": "Plant the ivy in a wide, shallow container.",
                    "description": "Because the roots of an English Ivy don't grow very deep, you can put the plant into any wide, shallow container you have. Choose a container that has holes in the bottom for water drainage. If the plant becomes too big for its container, you can cut it back and start new plants. Consider using plastic or clay pots, but keep in mind that clay pots won't hold the moisture in the soil for as long."
                },
                {
                    "headline": "Give the plant 6 to 8 hours of indirect light.",
                    "description": "English ivy needs a lot of steady light to put on new growth, especially in winter. Avoid putting the plant near a window where it will get direct light because this can make the leaves burn and wilt. To give the plant enough light in the winter, you can move it to a space where it gets more direct light or set up artificial lights."
                },
                {
                    "headline": "Keep the temperatures in the 60s (F) or 15s (C).",
                    "description": "Try to keep the indoor temperatures warm during the day. It's fine if the nighttime temperature drops or you want to turn down the thermostat at night. It's a good idea to have a movable indoor thermometer so you can monitor the temperatures of each room."
                },
                {
                    "headline": "Adjust the plant's location as necessary.",
                    "description": "Pay attention to the health of your plant to determine if you need to move it. If your plant isn't putting on new growth or the leaves begin to wilt, change its location to see if it improves. If your plant's leaves begin to wilt, it may be getting too much direct sunlight, so move it to a shadier spot in your house. For example, check the temperature in your house and move the English Ivy plant if the temperature drops into the 50s (F) or 10s (C). Position your plant away from cool drafts, such as an air conditioner vent."
                }
            ]
        },
        {
            "name": "Feeding and Watering",
            "steps": [
                {
                    "headline": "Use a standard potting soil for the plant.",
                    "description": "Potting soil provides proper drainage for your indoor plant. You can find potting soil at any gardening store or online. Mix compost into the potting soil to increase the nutrients from organic matter. If your soil has a lot of clay, break it up with compost or sand before planting the ivy in the container. If you want to use soil from your garden, you need to mix it with potting soil, creating a 50/50 mix. However, it's best to stick to potting soil."
                },
                {
                    "headline": "Water the ivy plant once the soil is dry.",
                    "description": "Drag your finger in the soil at the base of the plant to check the soil's moisture level. If it's dry, water the soil until it's saturated and wait to water again until the soil dries out. You'll probably have to water the plant 2 times a week. Avoid watering the plant so much that water pools in the bottom of the container. Over-watering  can cause root rot."
                },
                {
                    "headline": "Mist the leaves of the plant during dry seasons.",
                    "description": "To keep the leaves of your English ivy plant healthy and green, use a spray bottle to mist them 1 to 2 times a week. Mist the leaves during warm summer months or if you live in a climate with low humidity."
                },
                {
                    "headline": "Fertilize once a month during spring, summer, and fall.",
                    "description": "Buy a slow-releasing nitrogen fertilizer and mix 1 teaspoon (5 ml) into 1 gallon (3,800 ml) of water. Pour enough of the mixture around the roots so the soil is saturated. Choose a house plant fertilizer for foliage plants that has high levels of nitrogen. Avoid fertilizing the English ivy during the winter when it's dormant. It doesn't need fertilizer when it's not growing. Don't let the fertilizer come into contact with the plant's leaves or they could cause fertilizer burn. Follow all of the instructions on your fertilizer label."
                }
            ]
        },
        {
            "name": "Keeping the Ivy Alive",
            "steps": [
                {
                    "headline": "Wash the plant if you see spider mites.",
                    "description": "Look for yellow specks or spots on the leaves to identify early spider mite infestation. The leaves may already be yellow or you'll see webs if the spider mites have been active for a while. To treat the plant, wipe the leaves with a gentle cleansing solution. To make the cleansing solution, add a few drops of dish washing soap to 1 gallon (3,800 ml) of water. You can mist your ivy with neem oil to kill pests, as well. Spray the leaves often, then wipe them off with a damp towel."
                },
                {
                    "headline": "Increase the humidity if your plant's leaves begin to wilt.",
                    "description": "Limp or yellow leaves can be a sign that your plant needs higher humidity, especially if it's winter. To increase moisture, place the plant in a tray filled with pebbles. Pour water halfway up the side of the pebbles. This will increase the humidity of the air around your plant. If you prefer, move the plant to a room with higher humidity and see if the leaves improve after a few days. Additionally, keep a spray bottle of water near the plant so that you can mist your plants often."
                },
                {
                    "headline": "Remove damaged or diseased leaves.",
                    "description": "Since English ivy leaves won't recover if insects begin to eat them, take clean scissors and cut off the damaged leaves. You should also remove leaves that have fungus, holes, small black dots, or has shriveled leaves. Some leaves will dry and crumble off if they're infected with a disease."
                },
                {
                    "headline": "Propagate the ivy if it grows too large for the container.",
                    "description": "If the ivy becomes too big, use clean scissors and cut a stem of the plant right below a node, which is the junction of the leaf and the stem. Take a 5 in (12.5 cm) cutting and pull off the leaves from the bottom 2 in (5 cm). Then stick the stem in a small container filled with water. Leave the ivy to begin growing new roots. Plant the cutting once the roots are 2 in (5 cm) to 3 in (7.5 cm) long. Make as many cuttings as you like to reduce the size of the English ivy. You can prune up to 1/3 of the ivy at a time, which will help you prevent overgrowth of your plant."
                },
                {
                    "headline": "Wipe the leaves if they become dusty.",
                    "description": "Large English ivy plants that have been growing in the same space for a while may become dusty over time. Dip a clean cloth or sponge in water and wring it out. Gently wipe each leaf with the damp cloth or sponge to remove the dust."
                }
            ]
        }
    ],
    "tyn": [
        "Plant container",
        "Movable thermometer",
        "Slow-releasing nitrogen fertilizer",
        "Potting soil",
        "Scissors",
        "Pebble tray (optional)",
        "Neem oil (optional)"
    ],
    "text": " Choosing a Container and Location Plant the ivy in a wide, shallow container. Because the roots of an English Ivy don't grow very deep, you can put the plant into any wide, shallow container you have. Choose a container that has holes in the bottom for water drainage. If the plant becomes too big for its container, you can cut it back and start new plants. Consider using plastic or clay pots, but keep in mind that clay pots won't hold the moisture in the soil for as long. Give the plant 6 to 8 hours of indirect light. English ivy needs a lot of steady light to put on new growth, especially in winter. Avoid putting the plant near a window where it will get direct light because this can make the leaves burn and wilt. To give the plant enough light in the winter, you can move it to a space where it gets more direct light or set up artificial lights. Keep the temperatures in the 60s (F) or 15s (C). Try to keep the indoor temperatures warm during the day. It's fine if the nighttime temperature drops or you want to turn down the thermostat at night. It's a good idea to have a movable indoor thermometer so you can monitor the temperatures of each room. Adjust the plant's location as necessary. Pay attention to the health of your plant to determine if you need to move it. If your plant isn't putting on new growth or the leaves begin to wilt, change its location to see if it improves. If your plant's leaves begin to wilt, it may be getting too much direct sunlight, so move it to a shadier spot in your house. For example, check the temperature in your house and move the English Ivy plant if the temperature drops into the 50s (F) or 10s (C). Position your plant away from cool drafts, such as an air conditioner vent. Feeding and Watering Use a standard potting soil for the plant. Potting soil provides proper drainage for your indoor plant. You can find potting soil at any gardening store or online. Mix compost into the potting soil to increase the nutrients from organic matter. If your soil has a lot of clay, break it up with compost or sand before planting the ivy in the container. If you want to use soil from your garden, you need to mix it with potting soil, creating a 50/50 mix. However, it's best to stick to potting soil. Water the ivy plant once the soil is dry. Drag your finger in the soil at the base of the plant to check the soil's moisture level. If it's dry, water the soil until it's saturated and wait to water again until the soil dries out. You'll probably have to water the plant 2 times a week. Avoid watering the plant so much that water pools in the bottom of the container. Over-watering  can cause root rot. Mist the leaves of the plant during dry seasons. To keep the leaves of your English ivy plant healthy and green, use a spray bottle to mist them 1 to 2 times a week. Mist the leaves during warm summer months or if you live in a climate with low humidity. Fertilize once a month during spring, summer, and fall. Buy a slow-releasing nitrogen fertilizer and mix 1 teaspoon (5 ml) into 1 gallon (3,800 ml) of water. Pour enough of the mixture around the roots so the soil is saturated. Choose a house plant fertilizer for foliage plants that has high levels of nitrogen. Avoid fertilizing the English ivy during the winter when it's dormant. It doesn't need fertilizer when it's not growing. Don't let the fertilizer come into contact with the plant's leaves or they could cause fertilizer burn. Follow all of the instructions on your fertilizer label. Keeping the Ivy Alive Wash the plant if you see spider mites. Look for yellow specks or spots on the leaves to identify early spider mite infestation. The leaves may already be yellow or you'll see webs if the spider mites have been active for a while. To treat the plant, wipe the leaves with a gentle cleansing solution. To make the cleansing solution, add a few drops of dish washing soap to 1 gallon (3,800 ml) of water. You can mist your ivy with neem oil to kill pests, as well. Spray the leaves often, then wipe them off with a damp towel. Increase the humidity if your plant's leaves begin to wilt. Limp or yellow leaves can be a sign that your plant needs higher humidity, especially if it's winter. To increase moisture, place the plant in a tray filled with pebbles. Pour water halfway up the side of the pebbles. This will increase the humidity of the air around your plant. If you prefer, move the plant to a room with higher humidity and see if the leaves improve after a few days. Additionally, keep a spray bottle of water near the plant so that you can mist your plants often. Remove damaged or diseased leaves. Since English ivy leaves won't recover if insects begin to eat them, take clean scissors and cut off the damaged leaves. You should also remove leaves that have fungus, holes, small black dots, or has shriveled leaves. Some leaves will dry and crumble off if they're infected with a disease. Propagate the ivy if it grows too large for the container. If the ivy becomes too big, use clean scissors and cut a stem of the plant right below a node, which is the junction of the leaf and the stem. Take a 5 in (12.5 cm) cutting and pull off the leaves from the bottom 2 in (5 cm). Then stick the stem in a small container filled with water. Leave the ivy to begin growing new roots. Plant the cutting once the roots are 2 in (5 cm) to 3 in (7.5 cm) long. Make as many cuttings as you like to reduce the size of the English ivy. You can prune up to 1/3 of the ivy at a time, which will help you prevent overgrowth of your plant. Wipe the leaves if they become dusty. Large English ivy plants that have been growing in the same space for a while may become dusty over time. Dip a clean cloth or sponge in water and wring it out. Gently wipe each leaf with the damp cloth or sponge to remove the dust.",
    "sentences": [
        " Choosing a Container and Location Plant the ivy in a wide, shallow container.",
        "Because the roots of an English Ivy don't grow very deep, you can put the plant into any wide, shallow container you have.",
        "Choose a container that has holes in the bottom for water drainage.",
        "If the plant becomes too big for its container, you can cut it back and start new plants.",
        "Consider using plastic or clay pots, but keep in mind that clay pots won't hold the moisture in the soil for as long.",
        "Give the plant 6 to 8 hours of indirect light.",
        "English ivy needs a lot of steady light to put on new growth, especially in winter.",
        "Avoid putting the plant near a window where it will get direct light because this can make the leaves burn and wilt.",
        "To give the plant enough light in the winter, you can move it to a space where it gets more direct light or set up artificial lights.",
        "Keep the temperatures in the 60s (F) or 15s (C).",
        "Try to keep the indoor temperatures warm during the day.",
        "It's fine if the nighttime temperature drops or you want to turn down the thermostat at night.",
        "It's a good idea to have a movable indoor thermometer so you can monitor the temperatures of each room.",
        "Adjust the plant's location as necessary.",
        "Pay attention to the health of your plant to determine if you need to move it.",
        "If your plant isn't putting on new growth or the leaves begin to wilt, change its location to see if it improves.",
        "If your plant's leaves begin to wilt, it may be getting too much direct sunlight, so move it to a shadier spot in your house.",
        "For example, check the temperature in your house and move the English Ivy plant if the temperature drops into the 50s (F) or 10s (C).",
        "Position your plant away from cool drafts, such as an air conditioner vent.",
        "Feeding and Watering Use a standard potting soil for the plant.",
        "Potting soil provides proper drainage for your indoor plant.",
        "You can find potting soil at any gardening store or online.",
        "Mix compost into the potting soil to increase the nutrients from organic matter.",
        "If your soil has a lot of clay, break it up with compost or sand before planting the ivy in the container.",
        "If you want to use soil from your garden, you need to mix it with potting soil, creating a 50/50 mix.",
        "However, it's best to stick to potting soil.",
        "Water the ivy plant once the soil is dry.",
        "Drag your finger in the soil at the base of the plant to check the soil's moisture level.",
        "If it's dry, water the soil until it's saturated and wait to water again until the soil dries out.",
        "You'll probably have to water the plant 2 times a week.",
        "Avoid watering the plant so much that water pools in the bottom of the container.",
        "Over-watering  can cause root rot.",
        "Mist the leaves of the plant during dry seasons.",
        "To keep the leaves of your English ivy plant healthy and green, use a spray bottle to mist them 1 to 2 times a week.",
        "Mist the leaves during warm summer months or if you live in a climate with low humidity.",
        "Fertilize once a month during spring, summer, and fall.",
        "Buy a slow-releasing nitrogen fertilizer and mix 1 teaspoon (5 ml) into 1 gallon (3,800 ml) of water.",
        "Pour enough of the mixture around the roots so the soil is saturated.",
        "Choose a house plant fertilizer for foliage plants that has high levels of nitrogen.",
        "Avoid fertilizing the English ivy during the winter when it's dormant.",
        "It doesn't need fertilizer when it's not growing.",
        "Don't let the fertilizer come into contact with the plant's leaves or they could cause fertilizer burn.",
        "Follow all of the instructions on your fertilizer label.",
        "Keeping the Ivy Alive Wash the plant if you see spider mites.",
        "Look for yellow specks or spots on the leaves to identify early spider mite infestation.",
        "The leaves may already be yellow or you'll see webs if the spider mites have been active for a while.",
        "To treat the plant, wipe the leaves with a gentle cleansing solution.",
        "To make the cleansing solution, add a few drops of dish washing soap to 1 gallon (3,800 ml) of water.",
        "You can mist your ivy with neem oil to kill pests, as well.",
        "Spray the leaves often, then wipe them off with a damp towel.",
        "Increase the humidity if your plant's leaves begin to wilt.",
        "Limp or yellow leaves can be a sign that your plant needs higher humidity, especially if it's winter.",
        "To increase moisture, place the plant in a tray filled with pebbles.",
        "Pour water halfway up the side of the pebbles.",
        "This will increase the humidity of the air around your plant.",
        "If you prefer, move the plant to a room with higher humidity and see if the leaves improve after a few days.",
        "Additionally, keep a spray bottle of water near the plant so that you can mist your plants often.",
        "Remove damaged or diseased leaves.",
        "Since English ivy leaves won't recover if insects begin to eat them, take clean scissors and cut off the damaged leaves.",
        "You should also remove leaves that have fungus, holes, small black dots, or has shriveled leaves.",
        "Some leaves will dry and crumble off if they're infected with a disease.",
        "Propagate the ivy if it grows too large for the container.",
        "If the ivy becomes too big, use clean scissors and cut a stem of the plant right below a node, which is the junction of the leaf and the stem.",
        "Take a 5 in (12.5 cm) cutting and pull off the leaves from the bottom 2 in (5 cm).",
        "Then stick the stem in a small container filled with water.",
        "Leave the ivy to begin growing new roots.",
        "Plant the cutting once the roots are 2 in (5 cm) to 3 in (7.5 cm) long.",
        "Make as many cuttings as you like to reduce the size of the English ivy.",
        "You can prune up to 1/3 of the ivy at a time, which will help you prevent overgrowth of your plant.",
        "Wipe the leaves if they become dusty.",
        "Large English ivy plants that have been growing in the same space for a while may become dusty over time.",
        "Dip a clean cloth or sponge in water and wring it out.",
        "Gently wipe each leaf with the damp cloth or sponge to remove the dust."
    ]
}