{
    "title": "How to Recycle Silver",
    "url": "https://www.wikihow.com/Recycle-Silver",
    "category_hierarchy": [
        "Sports and Fitness",
        "Outdoor Recreation",
        "Enjoying the Great Outdoors"
    ],
    "methods": [
        {
            "name": "Melting the Silver",
            "steps": [
                {
                    "headline": "Gather your silver and equipment you will need in one place.",
                    "description": "Melting metals involves high heat and is potentially dangerous so you need to make sure you’ve got the right things. Most of what you need can be purchased from online retailers or a local hardware or casting supply shop."
                },
                {
                    "headline": "Heat the silver with your torch.",
                    "description": "Arrange the silver in small piles on your soldering brick and heat it until it turns into liquid. The hottest part of the torch’s flame is near the end of the blue flame. Try to keep that part on the silver you are melting. Remember that silver gets very hot at melting point, more than 960 °C (1,760 °F) so be very careful when handling it."
                },
                {
                    "headline": "Nudge any stray pieces of silver back to the middle.",
                    "description": "Tweezers are handy at this point to keep the silver pieces together on your soldering block."
                },
                {
                    "headline": "Rest the melted silver for a few moments.",
                    "description": "The silver needs to solidify before you can handle it. Wait until you can no longer see a glow before using your tweezers to pick it up."
                },
                {
                    "headline": "Quench your silver by immersing it in water.",
                    "description": "This is an important step to cool and harden the metal before you work with it to form something new. Molten metal can remain hot even after quenching so be careful when handling with your bare hands. Wait a few moments before removing it from the water."
                },
                {
                    "headline": "Transform your silver into something new.",
                    "description": "You can use your hammer or a roller to make it flat before cutting it. Heat it gently as you go to keep it soft and workable. Depending on how much silver you have, you can tackle projects like rings, earrings, pendants or ornaments. If you aren't sure what to make, or this is your first time making jewellery, you could have a look online or in local shops for inspiration."
                }
            ]
        },
        {
            "name": "Selling or Donating the Silver",
            "steps": [
                {
                    "headline": "Sell your silver online to get the best price.",
                    "description": "If listing on an online auction site, make sure to include as much information as you can and as many photos as possible. You’ll need a seller’s account to list your item and to manage your listing. Do your research so you don't make a bad deal - check your silver carefully to see if it is valuable sterling silver or just silver plated and look up the current price of silver online. If you are dealing with silver tableware, there will be a mark on it indicating if it’s sterling. Sterling silver jewellery will have a marking on it with the numbers 925."
                },
                {
                    "headline": "Sell your silver to a pawn shop for a quick sale.",
                    "description": "You might be able to get cash for your silver by selling it or pawning it at a pawn shop. If you pawn it, this means you leave it at the pawn shop for an agreed time in exchange for a loan. Once you’ve paid that back, you will get your silver back. If you want to sell it, then try and make it appear as appealing to a customer as possible by polishing it up. Research the item you are selling to get the best price and research the pawn shop online by reading reviews. This way, you can be sure you are getting a fair deal."
                },
                {
                    "headline": "Donate your silver to a charity to do some good.",
                    "description": "With a little online research or calling around, you can find local charities that are interested in jewellery or tableware donations. Some charities occasionally have appeals where they ask for unwanted items of value to be donated. The charity will then sell the item and use the money for its work."
                }
            ]
        }
    ],
    "tyn": [
        "Soldering board",
        "Soldering brick",
        "Butane torch",
        "Fuel",
        "Metal tongs",
        "Industrial grade apron",
        "Goggles",
        "Gloves",
        "Face mask",
        "Hammer",
        "Steel block"
    ],
    "text": " Melting the Silver Gather your silver and equipment you will need in one place. Melting metals involves high heat and is potentially dangerous so you need to make sure you’ve got the right things. Most of what you need can be purchased from online retailers or a local hardware or casting supply shop. Heat the silver with your torch. Arrange the silver in small piles on your soldering brick and heat it until it turns into liquid. The hottest part of the torch’s flame is near the end of the blue flame. Try to keep that part on the silver you are melting. Remember that silver gets very hot at melting point, more than 960 °C (1,760 °F) so be very careful when handling it. Nudge any stray pieces of silver back to the middle. Tweezers are handy at this point to keep the silver pieces together on your soldering block. Rest the melted silver for a few moments. The silver needs to solidify before you can handle it. Wait until you can no longer see a glow before using your tweezers to pick it up. Quench your silver by immersing it in water. This is an important step to cool and harden the metal before you work with it to form something new. Molten metal can remain hot even after quenching so be careful when handling with your bare hands. Wait a few moments before removing it from the water. Transform your silver into something new. You can use your hammer or a roller to make it flat before cutting it. Heat it gently as you go to keep it soft and workable. Depending on how much silver you have, you can tackle projects like rings, earrings, pendants or ornaments. If you aren't sure what to make, or this is your first time making jewellery, you could have a look online or in local shops for inspiration. Selling or Donating the Silver Sell your silver online to get the best price. If listing on an online auction site, make sure to include as much information as you can and as many photos as possible. You’ll need a seller’s account to list your item and to manage your listing. Do your research so you don't make a bad deal - check your silver carefully to see if it is valuable sterling silver or just silver plated and look up the current price of silver online. If you are dealing with silver tableware, there will be a mark on it indicating if it’s sterling. Sterling silver jewellery will have a marking on it with the numbers 925. Sell your silver to a pawn shop for a quick sale. You might be able to get cash for your silver by selling it or pawning it at a pawn shop. If you pawn it, this means you leave it at the pawn shop for an agreed time in exchange for a loan. Once you’ve paid that back, you will get your silver back. If you want to sell it, then try and make it appear as appealing to a customer as possible by polishing it up. Research the item you are selling to get the best price and research the pawn shop online by reading reviews. This way, you can be sure you are getting a fair deal. Donate your silver to a charity to do some good. With a little online research or calling around, you can find local charities that are interested in jewellery or tableware donations. Some charities occasionally have appeals where they ask for unwanted items of value to be donated. The charity will then sell the item and use the money for its work.",
    "sentences": [
        " Melting the Silver Gather your silver and equipment you will need in one place.",
        "Melting metals involves high heat and is potentially dangerous so you need to make sure you’ve got the right things.",
        "Most of what you need can be purchased from online retailers or a local hardware or casting supply shop.",
        "Heat the silver with your torch.",
        "Arrange the silver in small piles on your soldering brick and heat it until it turns into liquid.",
        "The hottest part of the torch’s flame is near the end of the blue flame.",
        "Try to keep that part on the silver you are melting.",
        "Remember that silver gets very hot at melting point, more than 960 °C (1,760 °F) so be very careful when handling it.",
        "Nudge any stray pieces of silver back to the middle.",
        "Tweezers are handy at this point to keep the silver pieces together on your soldering block.",
        "Rest the melted silver for a few moments.",
        "The silver needs to solidify before you can handle it.",
        "Wait until you can no longer see a glow before using your tweezers to pick it up.",
        "Quench your silver by immersing it in water.",
        "This is an important step to cool and harden the metal before you work with it to form something new.",
        "Molten metal can remain hot even after quenching so be careful when handling with your bare hands.",
        "Wait a few moments before removing it from the water.",
        "Transform your silver into something new.",
        "You can use your hammer or a roller to make it flat before cutting it.",
        "Heat it gently as you go to keep it soft and workable.",
        "Depending on how much silver you have, you can tackle projects like rings, earrings, pendants or ornaments.",
        "If you aren't sure what to make, or this is your first time making jewellery, you could have a look online or in local shops for inspiration.",
        "Selling or Donating the Silver Sell your silver online to get the best price.",
        "If listing on an online auction site, make sure to include as much information as you can and as many photos as possible.",
        "You’ll need a seller’s account to list your item and to manage your listing.",
        "Do your research so you don't make a bad deal - check your silver carefully to see if it is valuable sterling silver or just silver plated and look up the current price of silver online.",
        "If you are dealing with silver tableware, there will be a mark on it indicating if it’s sterling.",
        "Sterling silver jewellery will have a marking on it with the numbers 925.",
        "Sell your silver to a pawn shop for a quick sale.",
        "You might be able to get cash for your silver by selling it or pawning it at a pawn shop.",
        "If you pawn it, this means you leave it at the pawn shop for an agreed time in exchange for a loan.",
        "Once you’ve paid that back, you will get your silver back.",
        "If you want to sell it, then try and make it appear as appealing to a customer as possible by polishing it up.",
        "Research the item you are selling to get the best price and research the pawn shop online by reading reviews.",
        "This way, you can be sure you are getting a fair deal.",
        "Donate your silver to a charity to do some good.",
        "With a little online research or calling around, you can find local charities that are interested in jewellery or tableware donations.",
        "Some charities occasionally have appeals where they ask for unwanted items of value to be donated.",
        "The charity will then sell the item and use the money for its work."
    ]
}