{
    "title": "How to Make Tonic Water",
    "url": "https://www.wikihow.com/Make-Tonic-Water",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Making a Simple Tonic Syrup",
            "steps": [
                {
                    "headline": "Place a medium saucepan with water and sugar over high heat.",
                    "description": "Add 4 cups (950 mL) of water to the pan, and pour in 3 cups (710 mL) of natural cane sugar. Then, turn the burner heat up to the highest possible setting. Make sure you’re using a non-reactive saucepan, which can change the flavor of the liquid. Avoid using copper, aluminum, or cast iron saucepans to make your tonic water."
                },
                {
                    "headline": "Bring the water to a boil, stirring frequently until the sugar is dissolved.",
                    "description": "Wait for the water to boil, which can take 10-15 minutes. Once it reaches a rolling boil, stir the mixture to encourage the sugar to dissolve. Don’t lower the heat before the sugar is completely dissolved. This can leave tiny sugar granules in the water, which can affect the taste of the tonic."
                },
                {
                    "headline": "Lower the heat to a simmer and add chopped cinchona bark.",
                    "description": "Cinchona bark gives the tonic a bitter taste, and can be found in the herb section of your local grocery store or online. Once the water has calmed to a simmer, stir in ¼ cup (28 grams) of chopped cinchona bark. Alternatively, if you can’t locate cinchona bark, you can use the powdered version, called quinine. Add 3 tablespoons (44 mL) of the quinine to the water and stir thoroughly to combine. Keep in mind that ingesting too much quinine can be hazardous to your health, so don’t add more quinine than needed. In general, cinchona bark is safer, as it is easier to filter from the tonic. If you can’t find quinine or cinchona bark in the herb aisle of your local grocery store, look in your local natural health store."
                }
            ]
        },
        {
            "name": "Adding Citrus Flavors",
            "steps": [
                {
                    "headline": "Zest and juice 1 grapefruit, 1 lemon, and 1 lime into the water.",
                    "description": "Use a zester to finely shred the skin of the grapefruit, lemon, and lime into the water to diffuse. Then, extract as much juice as possible from each fruit, and add it to the water to make the citrus flavors more potent. If you want to use only one of the fruits to make your tonic, use 3 of the same fruit. For example, if you wanted to make a lemon tonic, you would zest and juice 3 lemons into the water."
                },
                {
                    "headline": "Chop a piece of ginger finely and add it to the water.",
                    "description": "The ginger helps to balance out the strength of the citrus fruits, and adds a more muted and savory taste. Be sure to chop it into very small pieces so that the flavor can diffuse throughout the water. If you don’t want to chop the ginger, use a grater to shred it into smaller pieces. It can be more time consuming, but is often easier than chopping."
                },
                {
                    "headline": "Simmer for 25 minutes until the syrup becomes thin.",
                    "description": "Stir the mixture frequently with a wooden spoon to combine the ingredients thoroughly. Let it sit uncovered as the water continues to simmer. After 25 minutes, the tonic should be runny. If it’s thick like syrup, let it simmer for another 5 minutes."
                },
                {
                    "headline": "Remove the pan from heat and let it cool.",
                    "description": "Turn the burner off and place the pan on a potholder or other heat-resistant surface to cool. After 10 minutes, dip a finger into the tonic to make sure that it has cooled enough to strain. If the liquid is too hot to dip your finger into, wait an additional 5-10 minutes to strain the tonic."
                }
            ]
        },
        {
            "name": "Straining and Storing the Tonic",
            "steps": [
                {
                    "headline": "Strain the tonic with a French press or coffee filters.",
                    "description": "If you have a French press coffee maker, pour the tonic into the glass and push the plunger to strain it. If you don’t have a press, cover the top of a bowl with a coffee filter, and slowly pour the tonic onto the filter and let the liquid drip through. When using coffee filters, be patient and work slowly. Make sure the filter is secured over the top of the bowl by wrapping a rubber band around the outside or taping it in place. If you don’t have coffee filters or a french press, use a piece of cheesecloth or muslin."
                },
                {
                    "headline": "Pass the liquid through the strainer 3-4 times to remove any large particles.",
                    "description": "To make sure the tonic is completely cleaned, run it through your straining method at least 3 times. Be sure to replace the filter or rinse out the press after each pass. The first few strains will contain the larger pieces, like the zest and ginger. Keep straining the tonic until there are no solid pieces left to remove."
                },
                {
                    "headline": "Funnel the tonic into sterilized, lidded jars.",
                    "description": "Place a funnel into the jar, and carefully pour the tonic in until the liquid reaches the brim of the jar. Remove the funnel and seal the lid to ensure that it’s airtight. Once you remove the funnel, the level of the tonic will drop slightly, leaving some headspace. You can find sterilized, lidded jars at most grocery stores and craft stores. They’re often used for canning, and come in a variety of different sizes."
                },
                {
                    "headline": "Store the jars of tonic in the refrigerator for up to 3 weeks.",
                    "description": "Keep the tonic fresh by storing it on a shelf in the refrigerator. After 3 weeks, pour any leftover tonic down the drain, and wash the jars thoroughly before reusing them. Depending on how well you strained the tonic, you may need to shake the jars once every 3-4 days to ensure that there are no large particles sitting on the bottom of the jar."
                }
            ]
        }
    ],
    "tyn": [
        "Medium non-reactive saucepan",
        "Zester",
        "Kitchen knife",
        "Wooden spoon",
        "Water",
        "Natural cane sugar",
        "Cinchona bark",
        "Grapefruit",
        "Lemon",
        "Lime",
        "Ginger",
        "French press or coffee filters",
        "Funnel",
        "Sterilized, lidded jars"
    ],
    "text": " Making a Simple Tonic Syrup Place a medium saucepan with water and sugar over high heat. Add 4 cups (950 mL) of water to the pan, and pour in 3 cups (710 mL) of natural cane sugar. Then, turn the burner heat up to the highest possible setting. Make sure you’re using a non-reactive saucepan, which can change the flavor of the liquid. Avoid using copper, aluminum, or cast iron saucepans to make your tonic water. Bring the water to a boil, stirring frequently until the sugar is dissolved. Wait for the water to boil, which can take 10-15 minutes. Once it reaches a rolling boil, stir the mixture to encourage the sugar to dissolve. Don’t lower the heat before the sugar is completely dissolved. This can leave tiny sugar granules in the water, which can affect the taste of the tonic. Lower the heat to a simmer and add chopped cinchona bark. Cinchona bark gives the tonic a bitter taste, and can be found in the herb section of your local grocery store or online. Once the water has calmed to a simmer, stir in ¼ cup (28 grams) of chopped cinchona bark. Alternatively, if you can’t locate cinchona bark, you can use the powdered version, called quinine. Add 3 tablespoons (44 mL) of the quinine to the water and stir thoroughly to combine. Keep in mind that ingesting too much quinine can be hazardous to your health, so don’t add more quinine than needed. In general, cinchona bark is safer, as it is easier to filter from the tonic. If you can’t find quinine or cinchona bark in the herb aisle of your local grocery store, look in your local natural health store. Adding Citrus Flavors Zest and juice 1 grapefruit, 1 lemon, and 1 lime into the water. Use a zester to finely shred the skin of the grapefruit, lemon, and lime into the water to diffuse. Then, extract as much juice as possible from each fruit, and add it to the water to make the citrus flavors more potent. If you want to use only one of the fruits to make your tonic, use 3 of the same fruit. For example, if you wanted to make a lemon tonic, you would zest and juice 3 lemons into the water. Chop a piece of ginger finely and add it to the water. The ginger helps to balance out the strength of the citrus fruits, and adds a more muted and savory taste. Be sure to chop it into very small pieces so that the flavor can diffuse throughout the water. If you don’t want to chop the ginger, use a grater to shred it into smaller pieces. It can be more time consuming, but is often easier than chopping. Simmer for 25 minutes until the syrup becomes thin. Stir the mixture frequently with a wooden spoon to combine the ingredients thoroughly. Let it sit uncovered as the water continues to simmer. After 25 minutes, the tonic should be runny. If it’s thick like syrup, let it simmer for another 5 minutes. Remove the pan from heat and let it cool. Turn the burner off and place the pan on a potholder or other heat-resistant surface to cool. After 10 minutes, dip a finger into the tonic to make sure that it has cooled enough to strain. If the liquid is too hot to dip your finger into, wait an additional 5-10 minutes to strain the tonic. Straining and Storing the Tonic Strain the tonic with a French press or coffee filters. If you have a French press coffee maker, pour the tonic into the glass and push the plunger to strain it. If you don’t have a press, cover the top of a bowl with a coffee filter, and slowly pour the tonic onto the filter and let the liquid drip through. When using coffee filters, be patient and work slowly. Make sure the filter is secured over the top of the bowl by wrapping a rubber band around the outside or taping it in place. If you don’t have coffee filters or a french press, use a piece of cheesecloth or muslin. Pass the liquid through the strainer 3-4 times to remove any large particles. To make sure the tonic is completely cleaned, run it through your straining method at least 3 times. Be sure to replace the filter or rinse out the press after each pass. The first few strains will contain the larger pieces, like the zest and ginger. Keep straining the tonic until there are no solid pieces left to remove. Funnel the tonic into sterilized, lidded jars. Place a funnel into the jar, and carefully pour the tonic in until the liquid reaches the brim of the jar. Remove the funnel and seal the lid to ensure that it’s airtight. Once you remove the funnel, the level of the tonic will drop slightly, leaving some headspace. You can find sterilized, lidded jars at most grocery stores and craft stores. They’re often used for canning, and come in a variety of different sizes. Store the jars of tonic in the refrigerator for up to 3 weeks. Keep the tonic fresh by storing it on a shelf in the refrigerator. After 3 weeks, pour any leftover tonic down the drain, and wash the jars thoroughly before reusing them. Depending on how well you strained the tonic, you may need to shake the jars once every 3-4 days to ensure that there are no large particles sitting on the bottom of the jar.",
    "sentences": [
        " Making a Simple Tonic Syrup Place a medium saucepan with water and sugar over high heat.",
        "Add 4 cups (950 mL) of water to the pan, and pour in 3 cups (710 mL) of natural cane sugar.",
        "Then, turn the burner heat up to the highest possible setting.",
        "Make sure you’re using a non-reactive saucepan, which can change the flavor of the liquid.",
        "Avoid using copper, aluminum, or cast iron saucepans to make your tonic water.",
        "Bring the water to a boil, stirring frequently until the sugar is dissolved.",
        "Wait for the water to boil, which can take 10-15 minutes.",
        "Once it reaches a rolling boil, stir the mixture to encourage the sugar to dissolve.",
        "Don’t lower the heat before the sugar is completely dissolved.",
        "This can leave tiny sugar granules in the water, which can affect the taste of the tonic.",
        "Lower the heat to a simmer and add chopped cinchona bark.",
        "Cinchona bark gives the tonic a bitter taste, and can be found in the herb section of your local grocery store or online.",
        "Once the water has calmed to a simmer, stir in ¼ cup (28 grams) of chopped cinchona bark.",
        "Alternatively, if you can’t locate cinchona bark, you can use the powdered version, called quinine.",
        "Add 3 tablespoons (44 mL) of the quinine to the water and stir thoroughly to combine.",
        "Keep in mind that ingesting too much quinine can be hazardous to your health, so don’t add more quinine than needed.",
        "In general, cinchona bark is safer, as it is easier to filter from the tonic.",
        "If you can’t find quinine or cinchona bark in the herb aisle of your local grocery store, look in your local natural health store.",
        "Adding Citrus Flavors Zest and juice 1 grapefruit, 1 lemon, and 1 lime into the water.",
        "Use a zester to finely shred the skin of the grapefruit, lemon, and lime into the water to diffuse.",
        "Then, extract as much juice as possible from each fruit, and add it to the water to make the citrus flavors more potent.",
        "If you want to use only one of the fruits to make your tonic, use 3 of the same fruit.",
        "For example, if you wanted to make a lemon tonic, you would zest and juice 3 lemons into the water.",
        "Chop a piece of ginger finely and add it to the water.",
        "The ginger helps to balance out the strength of the citrus fruits, and adds a more muted and savory taste.",
        "Be sure to chop it into very small pieces so that the flavor can diffuse throughout the water.",
        "If you don’t want to chop the ginger, use a grater to shred it into smaller pieces.",
        "It can be more time consuming, but is often easier than chopping.",
        "Simmer for 25 minutes until the syrup becomes thin.",
        "Stir the mixture frequently with a wooden spoon to combine the ingredients thoroughly.",
        "Let it sit uncovered as the water continues to simmer.",
        "After 25 minutes, the tonic should be runny.",
        "If it’s thick like syrup, let it simmer for another 5 minutes.",
        "Remove the pan from heat and let it cool.",
        "Turn the burner off and place the pan on a potholder or other heat-resistant surface to cool.",
        "After 10 minutes, dip a finger into the tonic to make sure that it has cooled enough to strain.",
        "If the liquid is too hot to dip your finger into, wait an additional 5-10 minutes to strain the tonic.",
        "Straining and Storing the Tonic Strain the tonic with a French press or coffee filters.",
        "If you have a French press coffee maker, pour the tonic into the glass and push the plunger to strain it.",
        "If you don’t have a press, cover the top of a bowl with a coffee filter, and slowly pour the tonic onto the filter and let the liquid drip through.",
        "When using coffee filters, be patient and work slowly.",
        "Make sure the filter is secured over the top of the bowl by wrapping a rubber band around the outside or taping it in place.",
        "If you don’t have coffee filters or a french press, use a piece of cheesecloth or muslin.",
        "Pass the liquid through the strainer 3-4 times to remove any large particles.",
        "To make sure the tonic is completely cleaned, run it through your straining method at least 3 times.",
        "Be sure to replace the filter or rinse out the press after each pass.",
        "The first few strains will contain the larger pieces, like the zest and ginger.",
        "Keep straining the tonic until there are no solid pieces left to remove.",
        "Funnel the tonic into sterilized, lidded jars.",
        "Place a funnel into the jar, and carefully pour the tonic in until the liquid reaches the brim of the jar.",
        "Remove the funnel and seal the lid to ensure that it’s airtight.",
        "Once you remove the funnel, the level of the tonic will drop slightly, leaving some headspace.",
        "You can find sterilized, lidded jars at most grocery stores and craft stores.",
        "They’re often used for canning, and come in a variety of different sizes.",
        "Store the jars of tonic in the refrigerator for up to 3 weeks.",
        "Keep the tonic fresh by storing it on a shelf in the refrigerator.",
        "After 3 weeks, pour any leftover tonic down the drain, and wash the jars thoroughly before reusing them.",
        "Depending on how well you strained the tonic, you may need to shake the jars once every 3-4 days to ensure that there are no large particles sitting on the bottom of the jar."
    ]
}