{
    "title": "How to Cook Dried Fava Beans",
    "url": "https://www.wikihow.com/Cook-Dried-Fava-Beans",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Rice and Beans"
    ],
    "parts": [
        {
            "name": "Rehydrating the Fava Beans",
            "steps": [
                {
                    "headline": "Rinse the dried beans under cold water to clean them.",
                    "description": "Place the dried fava beans in a colander. Run them under a stream of cold water in the kitchen sink. Gently turn the beans with your fingers to ensure that they are clean. Dried beans may contain dust and dirt that should be removed before cooking."
                },
                {
                    "headline": "Soak dried beans in water overnight.",
                    "description": "Pour your dried fava beans in a large pot or bowl. For each 1 pound (0.45 kg) of beans, add 10 cups (2.4 L) of water. Let the beans soak overnight for approximately 8 hours. Once the beans have soaked enough, you will notice that they have expanded in size."
                },
                {
                    "headline": "Do a \"quick soak\" and boil the beans slightly if you are pressed for time.",
                    "description": "Place your dried fava beans in a pot of water so that they are fully submerged. Place the pot on the stove and bring it to a boil for 3 minutes. Let the beans soak for 1 hour to fully rehydrate. The dried beans will need at least 3–4 inches (7.6–10.2 cm) of water above them as they will expand as they soak."
                },
                {
                    "headline": "Drain the beans over the sink.",
                    "description": "After doing a quick or overnight soak of your fava beans, bring them to the side of your sink. Position a large colander in the sink and pour the beans out into it. Lift the colander and shake it back and forth slowly to remove excess water. The water used to soak the beans contains residue released by the beans that can cause digestive upset if consumed."
                }
            ]
        },
        {
            "name": "Cooking Plain Fava Beans",
            "steps": [
                {
                    "headline": "Remove the skin by squeezing the beans between your fingers.",
                    "description": "After rinsing and soaking the dried beans, pinch each individual bean between your fingers. The skin should slip off easily. Discard the skins. Avoid cooking fava beans with the skin on as it is very tough and leathery."
                },
                {
                    "headline": "Place the peeled beans in a large pot with water.",
                    "description": "For each 1 pound (0.45 kg) of beans that you are going to cook, add 10 cups (2.4 L) of water to the pot. This is the same ratio that should be used for the overnight soak of your dried beans. Do this with fresh water with a pinch of salt added to it."
                },
                {
                    "headline": "Bring the beans to a boil and let them simmer for at least 10 minutes.",
                    "description": "Place the pot on the stove. Bring the water to a boil, then reduce the heat. Let the beans simmer until they are cooked through. Check the beans every 10 minutes by poking one with a fork. The fork should pierce the bean easily to indicate that it is fully cooked. It may take up to 45 minutes for fava beans to cook."
                },
                {
                    "headline": "Pour the beans into a colander to drain them.",
                    "description": "Place your colander in the sink. Pour your cooked, peeled beans into it to drain the water. Lift the colander and shake it back and forth very gently to get rid of extra water. Shaking the beans in the colander too vigorously may cause them to break or get mushy."
                },
                {
                    "headline": "Use the peeled fava beans right away after cooking them.",
                    "description": "For the best results, eat cooked fava beans or use them in a recipe right after preparing them. Peeled fava beans will lose some of their flavor and texture if they are stored after cooking. If you want to store fava beans, rehydrate them and refrigerate them with their skins still on."
                }
            ]
        },
        {
            "name": "Making Fava Bean Dishes",
            "steps": [
                {
                    "headline": "Sauté fava beans with garlic.",
                    "description": "Melt together the butter and olive oil over medium heat in a skillet pan. Add chopped garlic to the pan and sauté it for 1 minute. Add your cooked, peeled fava beans and continue sautéing for 5-7 minutes. Add salt and pepper as desired after cooking."
                },
                {
                    "headline": "Make a fava bean puree.",
                    "description": "Add 5 cups (1.2 L) of fava beans to a food processor. Add 1 peeled clove of garlic, 1 tablespoon (15 ml) of lemon juice, 1 tablespoon (15 ml) of olive oil, and a dash of salt and pepper. Emulsify the mixture and serve it immediately. Serve this appetizer with crackers or crudités."
                },
                {
                    "headline": "Add cooked fava beans to salads for extra protein.",
                    "description": "Add cooled, cooked fava beans to your favorite salad mixture. Toss with the dressing of your choice and serve it immediately. Fava beans can add lean protein and fiber to your already healthy dish."
                },
                {
                    "headline": "Include cooked fava beans with a pasta dish.",
                    "description": "Add cooked, peeled fava beans to your favorite combination of pasta and sauce. Toss the mixture together. Season it as desired with salt and pepper or fresh parmesan cheese. For instance, make a fettucine primavera with cream sauce and fava beans, peas, and arugula."
                }
            ]
        }
    ],
    "tyn": [
        "Colander",
        "Large pot or bowl",
        "Salt",
        "Fork",
        "Sauté pan",
        "Food processor"
    ],
    "text": " Rehydrating the Fava Beans Rinse the dried beans under cold water to clean them. Place the dried fava beans in a colander. Run them under a stream of cold water in the kitchen sink. Gently turn the beans with your fingers to ensure that they are clean. Dried beans may contain dust and dirt that should be removed before cooking. Soak dried beans in water overnight. Pour your dried fava beans in a large pot or bowl. For each 1 pound (0.45 kg) of beans, add 10 cups (2.4 L) of water. Let the beans soak overnight for approximately 8 hours. Once the beans have soaked enough, you will notice that they have expanded in size. Do a \"quick soak\" and boil the beans slightly if you are pressed for time. Place your dried fava beans in a pot of water so that they are fully submerged. Place the pot on the stove and bring it to a boil for 3 minutes. Let the beans soak for 1 hour to fully rehydrate. The dried beans will need at least 3–4 inches (7.6–10.2 cm) of water above them as they will expand as they soak. Drain the beans over the sink. After doing a quick or overnight soak of your fava beans, bring them to the side of your sink. Position a large colander in the sink and pour the beans out into it. Lift the colander and shake it back and forth slowly to remove excess water. The water used to soak the beans contains residue released by the beans that can cause digestive upset if consumed. Cooking Plain Fava Beans Remove the skin by squeezing the beans between your fingers. After rinsing and soaking the dried beans, pinch each individual bean between your fingers. The skin should slip off easily. Discard the skins. Avoid cooking fava beans with the skin on as it is very tough and leathery. Place the peeled beans in a large pot with water. For each 1 pound (0.45 kg) of beans that you are going to cook, add 10 cups (2.4 L) of water to the pot. This is the same ratio that should be used for the overnight soak of your dried beans. Do this with fresh water with a pinch of salt added to it. Bring the beans to a boil and let them simmer for at least 10 minutes. Place the pot on the stove. Bring the water to a boil, then reduce the heat. Let the beans simmer until they are cooked through. Check the beans every 10 minutes by poking one with a fork. The fork should pierce the bean easily to indicate that it is fully cooked. It may take up to 45 minutes for fava beans to cook. Pour the beans into a colander to drain them. Place your colander in the sink. Pour your cooked, peeled beans into it to drain the water. Lift the colander and shake it back and forth very gently to get rid of extra water. Shaking the beans in the colander too vigorously may cause them to break or get mushy. Use the peeled fava beans right away after cooking them. For the best results, eat cooked fava beans or use them in a recipe right after preparing them. Peeled fava beans will lose some of their flavor and texture if they are stored after cooking. If you want to store fava beans, rehydrate them and refrigerate them with their skins still on. Making Fava Bean Dishes Sauté fava beans with garlic. Melt together the butter and olive oil over medium heat in a skillet pan. Add chopped garlic to the pan and sauté it for 1 minute. Add your cooked, peeled fava beans and continue sautéing for 5-7 minutes. Add salt and pepper as desired after cooking. Make a fava bean puree. Add 5 cups (1.2 L) of fava beans to a food processor. Add 1 peeled clove of garlic, 1 tablespoon (15 ml) of lemon juice, 1 tablespoon (15 ml) of olive oil, and a dash of salt and pepper. Emulsify the mixture and serve it immediately. Serve this appetizer with crackers or crudités. Add cooked fava beans to salads for extra protein. Add cooled, cooked fava beans to your favorite salad mixture. Toss with the dressing of your choice and serve it immediately. Fava beans can add lean protein and fiber to your already healthy dish. Include cooked fava beans with a pasta dish. Add cooked, peeled fava beans to your favorite combination of pasta and sauce. Toss the mixture together. Season it as desired with salt and pepper or fresh parmesan cheese. For instance, make a fettucine primavera with cream sauce and fava beans, peas, and arugula.",
    "sentences": [
        " Rehydrating the Fava Beans Rinse the dried beans under cold water to clean them.",
        "Place the dried fava beans in a colander.",
        "Run them under a stream of cold water in the kitchen sink.",
        "Gently turn the beans with your fingers to ensure that they are clean.",
        "Dried beans may contain dust and dirt that should be removed before cooking.",
        "Soak dried beans in water overnight.",
        "Pour your dried fava beans in a large pot or bowl.",
        "For each 1 pound (0.45 kg) of beans, add 10 cups (2.4 L) of water.",
        "Let the beans soak overnight for approximately 8 hours.",
        "Once the beans have soaked enough, you will notice that they have expanded in size.",
        "Do a \"quick soak\" and boil the beans slightly if you are pressed for time.",
        "Place your dried fava beans in a pot of water so that they are fully submerged.",
        "Place the pot on the stove and bring it to a boil for 3 minutes.",
        "Let the beans soak for 1 hour to fully rehydrate.",
        "The dried beans will need at least 3–4 inches (7.6–10.2 cm) of water above them as they will expand as they soak.",
        "Drain the beans over the sink.",
        "After doing a quick or overnight soak of your fava beans, bring them to the side of your sink.",
        "Position a large colander in the sink and pour the beans out into it.",
        "Lift the colander and shake it back and forth slowly to remove excess water.",
        "The water used to soak the beans contains residue released by the beans that can cause digestive upset if consumed.",
        "Cooking Plain Fava Beans Remove the skin by squeezing the beans between your fingers.",
        "After rinsing and soaking the dried beans, pinch each individual bean between your fingers.",
        "The skin should slip off easily.",
        "Discard the skins.",
        "Avoid cooking fava beans with the skin on as it is very tough and leathery.",
        "Place the peeled beans in a large pot with water.",
        "For each 1 pound (0.45 kg) of beans that you are going to cook, add 10 cups (2.4 L) of water to the pot.",
        "This is the same ratio that should be used for the overnight soak of your dried beans.",
        "Do this with fresh water with a pinch of salt added to it.",
        "Bring the beans to a boil and let them simmer for at least 10 minutes.",
        "Place the pot on the stove.",
        "Bring the water to a boil, then reduce the heat.",
        "Let the beans simmer until they are cooked through.",
        "Check the beans every 10 minutes by poking one with a fork.",
        "The fork should pierce the bean easily to indicate that it is fully cooked.",
        "It may take up to 45 minutes for fava beans to cook.",
        "Pour the beans into a colander to drain them.",
        "Place your colander in the sink.",
        "Pour your cooked, peeled beans into it to drain the water.",
        "Lift the colander and shake it back and forth very gently to get rid of extra water.",
        "Shaking the beans in the colander too vigorously may cause them to break or get mushy.",
        "Use the peeled fava beans right away after cooking them.",
        "For the best results, eat cooked fava beans or use them in a recipe right after preparing them.",
        "Peeled fava beans will lose some of their flavor and texture if they are stored after cooking.",
        "If you want to store fava beans, rehydrate them and refrigerate them with their skins still on.",
        "Making Fava Bean Dishes Sauté fava beans with garlic.",
        "Melt together the butter and olive oil over medium heat in a skillet pan.",
        "Add chopped garlic to the pan and sauté it for 1 minute.",
        "Add your cooked, peeled fava beans and continue sautéing for 5-7 minutes.",
        "Add salt and pepper as desired after cooking.",
        "Make a fava bean puree.",
        "Add 5 cups (1.2 L) of fava beans to a food processor.",
        "Add 1 peeled clove of garlic, 1 tablespoon (15 ml) of lemon juice, 1 tablespoon (15 ml) of olive oil, and a dash of salt and pepper.",
        "Emulsify the mixture and serve it immediately.",
        "Serve this appetizer with crackers or crudités.",
        "Add cooked fava beans to salads for extra protein.",
        "Add cooled, cooked fava beans to your favorite salad mixture.",
        "Toss with the dressing of your choice and serve it immediately.",
        "Fava beans can add lean protein and fiber to your already healthy dish.",
        "Include cooked fava beans with a pasta dish.",
        "Add cooked, peeled fava beans to your favorite combination of pasta and sauce.",
        "Toss the mixture together.",
        "Season it as desired with salt and pepper or fresh parmesan cheese.",
        "For instance, make a fettucine primavera with cream sauce and fava beans, peas, and arugula."
    ]
}