{
    "title": "How to Enable Developer Mode on a Chromebook",
    "url": "https://www.wikihow.com/Enable-Developer-Mode-on-a-Chromebook",
    "category_hierarchy": [
        "Computers and Electronics",
        "Computers",
        "Laptops",
        "Laptops by Type",
        "Chromebook"
    ],
    "steps": [
        {
            "headline": "Back up any data or files you want to keep, first.",
            "description": "This process will remove all your accounts and files. Then turn off your Chromebook."
        },
        {
            "headline": "Push the Escape, Refresh (circular arrow), and Power buttons on your keyboard at the same time.",
            "description": "Wait for the computer to enter recovery mode. You should see an orange exclamation mark and text saying \"Chrome OS is missing or damaged.\""
        },
        {
            "headline": "Press Ctrl+D at the same time.",
            "description": ""
        },
        {
            "headline": "Press ↵ Enter.",
            "description": ""
        },
        {
            "headline": "Wait for your Chromebook to load up.",
            "description": "When it's done, you should see a screen saying that OS verification is off with a picture of a laptop with an orange exclamation mark. This is there to warn you that your system is less secure in Developer Mode."
        },
        {
            "headline": "Wait for your Chromebook to start up.",
            "description": "Then sign in with your Google account."
        },
        {
            "headline": "Disable Developer Mode again when you need to.",
            "description": "To do this, reboot your Chromebook, then hit the Spacebar when you see the \"OS verification is off\" message."
        }
    ],
    "tyn": [
        "A Chromebook"
    ],
    "text": " Back up any data or files you want to keep, first. This process will remove all your accounts and files. Then turn off your Chromebook. Push the Escape, Refresh (circular arrow), and Power buttons on your keyboard at the same time. Wait for the computer to enter recovery mode. You should see an orange exclamation mark and text saying \"Chrome OS is missing or damaged.\" Press Ctrl+D at the same time.  Press ↵ Enter.  Wait for your Chromebook to load up. When it's done, you should see a screen saying that OS verification is off with a picture of a laptop with an orange exclamation mark. This is there to warn you that your system is less secure in Developer Mode. Wait for your Chromebook to start up. Then sign in with your Google account. Disable Developer Mode again when you need to. To do this, reboot your Chromebook, then hit the Spacebar when you see the \"OS verification is off\" message.",
    "sentences": [
        " Back up any data or files you want to keep, first.",
        "This process will remove all your accounts and files.",
        "Then turn off your Chromebook.",
        "Push the Escape, Refresh (circular arrow), and Power buttons on your keyboard at the same time.",
        "Wait for the computer to enter recovery mode.",
        "You should see an orange exclamation mark and text saying \"Chrome OS is missing or damaged.\"",
        "Press Ctrl+D at the same time.",
        "Press ↵ Enter.",
        "Wait for your Chromebook to load up.",
        "When it's done, you should see a screen saying that OS verification is off with a picture of a laptop with an orange exclamation mark.",
        "This is there to warn you that your system is less secure in Developer Mode.",
        "Wait for your Chromebook to start up.",
        "Then sign in with your Google account.",
        "Disable Developer Mode again when you need to.",
        "To do this, reboot your Chromebook, then hit the Spacebar when you see the \"OS verification is off\" message."
    ]
}