{
    "title": "How to Find Alternatives to Sitting in a Desk",
    "url": "https://www.wikihow.com/Find-Alternatives-to-Sitting-in-a-Desk",
    "category_hierarchy": [
        "Health"
    ],
    "methods": [
        {
            "name": "Choosing Different Standing Options",
            "steps": [
                {
                    "headline": "Buy a standing desk for an easy solution.",
                    "description": "Standing desks help reduce back pain, posture problems, and can help lower your risk of weight gain. Standing desks have become more popular in the last few years and more and more companies have started selling them. Buy a relatively cheap standing desk at your local hardware store if you don't want to make one at home. The cost of a standing desk depends on what you're looking for. The more basic models can be bought for $100 or so. You'll pay more for an adjustable desk compared to one fixed in height. You can spend up to $6000 on a top of the line standing desk."
                },
                {
                    "headline": "Purchase a standing desk converter to make use of your existing desk.",
                    "description": "A standing desk converter is a device that allows you to customize your normal desk and turn it into a standing one. The converter is essentially another desk that you can stack on your existing desk. Standing desk converters tend to cost the same as a basic standing desk. Standing desk converters come in various types:\nZ-lift converters are Z-shaped and normally come pre-assembled. X-lift converters are X-shaped and are more sturdier than the Z-lift. Post and base converters are simply a large pole and stand that you place on your desk and attach your computer to."
                },
                {
                    "headline": "Get a treadmill desk to incorporate exercise into your workday.",
                    "description": "This is definitely the most expensive alternative but it's also the healthiest one. Treadmill desks keep you walking all day, or as long as you have the treadmill on. You won't be able to make one of these at home as they only function well if they're custom built for this purpose. You should check with your boss first if you're considering buying a treadmill desk. They tend to make a lot of noise and it's unlikely that you'll be as productive using one of these as you would be if you were sitting."
                }
            ]
        },
        {
            "name": "Using Alternative Sitting Options",
            "steps": [
                {
                    "headline": "Use a balance ball to reduce back problems.",
                    "description": "While you will still technically be sitting when using a balance ball, they are great for your core and your posture. It might be uncomfortable at first but you'll get used to using the balance ball after a while. The balance ball will force you to sit in an upright and stable position. Balance balls can be bought for cheaper than $10 in some stores. To inflate the balance ball, find the valve on the balance ball. it's a small, rubber patch. Stick the needle on a pump through the hole in the rubber patch and pump the balance ball. Don't pump the ball until it's about to burst. It should be 95% inflated."
                },
                {
                    "headline": "Kneel at your desk to improve your posture.",
                    "description": "Sitting at a desk all day makes it easy for you to slouch or hunch your back. Lay a towel or mat on the floor and kneel on top of it. Kneeling will make you keep your back straight while at your desk and you won't be able to slouch. Kneeling might be sore on your knees. If it is, use a thick, soft cushion. If you need a break, you can always sit back in your chair for a few minutes."
                },
                {
                    "headline": "Get a balance disc to use at your desk to reduce back strain.",
                    "description": "Balance discs force you to engage your core and keep your back straight when you're at your desk. This will reduce pressure and tension on your back. You can buy a balance disc at your local sports store for between $40 and $50. A balance disc is a rubber disc that people use at the gym to improve their balance. Its uneven surface means you will have to sit in a straight, upright, position to stay steady at your desk."
                }
            ]
        },
        {
            "name": "Making a Standing Desk",
            "steps": [
                {
                    "headline": "Gather your materials if you want to make your own standing desk.",
                    "description": "Buy 1 pine board 1 inch (2.5 cm) in thickness, 2 feet (0.61 m) in length, and 6 feet (1.8 m) wide. Buy another pine board with the same thickness and length, but 5 feet (1.5 m) in width. You can also buy a large sheet of pine board and cut it into these dimensions later. You will also need 7 4 in × 4 in (10 cm × 10 cm) shelf brackets, 1 1/2″ x 8s countersunk/roundhead screws, a saw, a drill, a spirit level, sandpaper, a hand sander, and a clean cloth. You can find all of these items at your local hardware store."
                },
                {
                    "headline": "Measure the space where you want the desk.",
                    "description": "Since you'll be attaching the desk to the wall, you'll need to measure the area of the wall you want the desk to take up. Use measuring tape to find out how long across the wall you want the desk to stretch. Write down the measurements. Use a ruler or measuring tape to mark the length of the desk on the pine board. Mark an outline of how long and wide you want your desk to be on the pine board."
                },
                {
                    "headline": "Cut your pine board to fit your dimensions.",
                    "description": "Use a handheld saw or a power saw to cut your pine boards along the outline. Make sure you wear a dust mask and safety goggles when sawing wood as the dust could get into your mouth or eyes. If you want your desk to fit into a corner, cut your pine boards at an angle so they fit together in the corner."
                },
                {
                    "headline": "Sand the wood then wipe it down with a damp cloth.",
                    "description": "Rub 240-grit sandpaper on the top and bottom of the desk. If using a hand sander, make sure you place the wood on a stable surface. Use medium pressure to remove any imperfections from the wood and ensure the entire surface is as smooth as possible. Use a cloth to wipe any leftover dust from the wood. Wipe the sides and the top and bottom of the wood to make sure it's completely free of any dust. Don't forget to sand the parts of the wood that you just cut as these will be the roughest parts of the wood."
                },
                {
                    "headline": "Varnish your wood if you want to give it a stained look.",
                    "description": "Apply your first coat of varnish to the wood and leave it dry for 24 hours. Then sand it again and wipe the surface of the wood with a damp cloth. Apply the second coat of varnish after the surface has dried, painting with the grain of the wood. After the second coat has been applied, inspect the wood to see if it needs another. If it does, sand it, wipe it, and paint the next coat. Give the last coat you apply 24 hours to dry before sanding it and wiping it with a damp cloth once more."
                },
                {
                    "headline": "Buy stud finders at your local hardware store.",
                    "description": "A stud finder is a small, electronic device that you can use to find framing studs located behind drywall. Move the stud finder across the wall until it beeps. The beep means that spot is a good place for a bracket. The ideal position for a standing desk is slightly above waist height. Find out what half your height is and attach the brackets at that height. Use a pencil to mark the places your stud beeps at. After, use a spirit level to make sure they're all at an even height. If you can't get a stud finder, simply knock on the wall. Try to find the least hollow sounding parts of the wall. These places are the best parts of the wall to attach your brackets to."
                },
                {
                    "headline": "Attach the shelf brackets to the wall at half your height.",
                    "description": "You move the stud finder across the wall until it beeps, which indicates that spot is a good place for a bracket. Space the shelf brackets out evenly across the space you plan to put your desk in. Line your brackets up with the pencil marks and mark where the holes in the brackets line up with a pencil. Use your level to make sure all these marks are at an even height. Drill holes at these second marks using your drill. Line each bracket up again and insert the screws into your drilled holes using a screwdriver. Drill 1.5 in (3.8 cm) holes. Turn the screw to the right to tighten and left to make it looser."
                },
                {
                    "headline": "Place your wood on the brackets and secure it with a screwdriver.",
                    "description": "Put your wood on top of the brackets and drill into the wood where the hole on the bracket is lined up. Once that's done, use your screwdriver to secure the brackets to the wood."
                },
                {
                    "headline": "Set up your computer and work station.",
                    "description": "You can test the strength of your desk by placing books on it and leaving them over night. The desk should be very secure by now. Place your desktop or laptop on your new standing desk."
                }
            ]
        }
    ],
    "tyn": [
        "Building a Standing Desk",
        "1 pine boards 1 inch (2.5 cm) x 2 feet (0.61 m) x 6 feet (1.8 m)",
        "1 pine boards 1 inch (2.5 cm) x 2 feet (0.61 m) x 5 feet (1.5 m)",
        "7 4 by 4 inches (10 cm × 10 cm) shelf brackets",
        "1.5 inches (3.8 cm) x 8s countersunk / roundhead screws",
        "A screwdriver",
        "A drill",
        "A saw",
        "Varnish",
        "A pencil",
        "A stud finder",
        "240-grit and paper or a hand sander",
        "A cloth",
        "Using a Balance Ball",
        "A balance ball",
        "A pump"
    ],
    "text": " Choosing Different Standing Options Buy a standing desk for an easy solution. Standing desks help reduce back pain, posture problems, and can help lower your risk of weight gain. Standing desks have become more popular in the last few years and more and more companies have started selling them. Buy a relatively cheap standing desk at your local hardware store if you don't want to make one at home. The cost of a standing desk depends on what you're looking for. The more basic models can be bought for $100 or so. You'll pay more for an adjustable desk compared to one fixed in height. You can spend up to $6000 on a top of the line standing desk. Purchase a standing desk converter to make use of your existing desk. A standing desk converter is a device that allows you to customize your normal desk and turn it into a standing one. The converter is essentially another desk that you can stack on your existing desk. Standing desk converters tend to cost the same as a basic standing desk. Standing desk converters come in various types:\nZ-lift converters are Z-shaped and normally come pre-assembled. X-lift converters are X-shaped and are more sturdier than the Z-lift. Post and base converters are simply a large pole and stand that you place on your desk and attach your computer to. Get a treadmill desk to incorporate exercise into your workday. This is definitely the most expensive alternative but it's also the healthiest one. Treadmill desks keep you walking all day, or as long as you have the treadmill on. You won't be able to make one of these at home as they only function well if they're custom built for this purpose. You should check with your boss first if you're considering buying a treadmill desk. They tend to make a lot of noise and it's unlikely that you'll be as productive using one of these as you would be if you were sitting. Using Alternative Sitting Options Use a balance ball to reduce back problems. While you will still technically be sitting when using a balance ball, they are great for your core and your posture. It might be uncomfortable at first but you'll get used to using the balance ball after a while. The balance ball will force you to sit in an upright and stable position. Balance balls can be bought for cheaper than $10 in some stores. To inflate the balance ball, find the valve on the balance ball. it's a small, rubber patch. Stick the needle on a pump through the hole in the rubber patch and pump the balance ball. Don't pump the ball until it's about to burst. It should be 95% inflated. Kneel at your desk to improve your posture. Sitting at a desk all day makes it easy for you to slouch or hunch your back. Lay a towel or mat on the floor and kneel on top of it. Kneeling will make you keep your back straight while at your desk and you won't be able to slouch. Kneeling might be sore on your knees. If it is, use a thick, soft cushion. If you need a break, you can always sit back in your chair for a few minutes. Get a balance disc to use at your desk to reduce back strain. Balance discs force you to engage your core and keep your back straight when you're at your desk. This will reduce pressure and tension on your back. You can buy a balance disc at your local sports store for between $40 and $50. A balance disc is a rubber disc that people use at the gym to improve their balance. Its uneven surface means you will have to sit in a straight, upright, position to stay steady at your desk. Making a Standing Desk Gather your materials if you want to make your own standing desk. Buy 1 pine board 1 inch (2.5 cm) in thickness, 2 feet (0.61 m) in length, and 6 feet (1.8 m) wide. Buy another pine board with the same thickness and length, but 5 feet (1.5 m) in width. You can also buy a large sheet of pine board and cut it into these dimensions later. You will also need 7 4 in × 4 in (10 cm × 10 cm) shelf brackets, 1 1/2″ x 8s countersunk/roundhead screws, a saw, a drill, a spirit level, sandpaper, a hand sander, and a clean cloth. You can find all of these items at your local hardware store. Measure the space where you want the desk. Since you'll be attaching the desk to the wall, you'll need to measure the area of the wall you want the desk to take up. Use measuring tape to find out how long across the wall you want the desk to stretch. Write down the measurements. Use a ruler or measuring tape to mark the length of the desk on the pine board. Mark an outline of how long and wide you want your desk to be on the pine board. Cut your pine board to fit your dimensions. Use a handheld saw or a power saw to cut your pine boards along the outline. Make sure you wear a dust mask and safety goggles when sawing wood as the dust could get into your mouth or eyes. If you want your desk to fit into a corner, cut your pine boards at an angle so they fit together in the corner. Sand the wood then wipe it down with a damp cloth. Rub 240-grit sandpaper on the top and bottom of the desk. If using a hand sander, make sure you place the wood on a stable surface. Use medium pressure to remove any imperfections from the wood and ensure the entire surface is as smooth as possible. Use a cloth to wipe any leftover dust from the wood. Wipe the sides and the top and bottom of the wood to make sure it's completely free of any dust. Don't forget to sand the parts of the wood that you just cut as these will be the roughest parts of the wood. Varnish your wood if you want to give it a stained look. Apply your first coat of varnish to the wood and leave it dry for 24 hours. Then sand it again and wipe the surface of the wood with a damp cloth. Apply the second coat of varnish after the surface has dried, painting with the grain of the wood. After the second coat has been applied, inspect the wood to see if it needs another. If it does, sand it, wipe it, and paint the next coat. Give the last coat you apply 24 hours to dry before sanding it and wiping it with a damp cloth once more. Buy stud finders at your local hardware store. A stud finder is a small, electronic device that you can use to find framing studs located behind drywall. Move the stud finder across the wall until it beeps. The beep means that spot is a good place for a bracket. The ideal position for a standing desk is slightly above waist height. Find out what half your height is and attach the brackets at that height. Use a pencil to mark the places your stud beeps at. After, use a spirit level to make sure they're all at an even height. If you can't get a stud finder, simply knock on the wall. Try to find the least hollow sounding parts of the wall. These places are the best parts of the wall to attach your brackets to. Attach the shelf brackets to the wall at half your height. You move the stud finder across the wall until it beeps, which indicates that spot is a good place for a bracket. Space the shelf brackets out evenly across the space you plan to put your desk in. Line your brackets up with the pencil marks and mark where the holes in the brackets line up with a pencil. Use your level to make sure all these marks are at an even height. Drill holes at these second marks using your drill. Line each bracket up again and insert the screws into your drilled holes using a screwdriver. Drill 1.5 in (3.8 cm) holes. Turn the screw to the right to tighten and left to make it looser. Place your wood on the brackets and secure it with a screwdriver. Put your wood on top of the brackets and drill into the wood where the hole on the bracket is lined up. Once that's done, use your screwdriver to secure the brackets to the wood. Set up your computer and work station. You can test the strength of your desk by placing books on it and leaving them over night. The desk should be very secure by now. Place your desktop or laptop on your new standing desk.",
    "sentences": [
        " Choosing Different Standing Options Buy a standing desk for an easy solution.",
        "Standing desks help reduce back pain, posture problems, and can help lower your risk of weight gain.",
        "Standing desks have become more popular in the last few years and more and more companies have started selling them.",
        "Buy a relatively cheap standing desk at your local hardware store if you don't want to make one at home.",
        "The cost of a standing desk depends on what you're looking for.",
        "The more basic models can be bought for $100 or so.",
        "You'll pay more for an adjustable desk compared to one fixed in height.",
        "You can spend up to $6000 on a top of the line standing desk.",
        "Purchase a standing desk converter to make use of your existing desk.",
        "A standing desk converter is a device that allows you to customize your normal desk and turn it into a standing one.",
        "The converter is essentially another desk that you can stack on your existing desk.",
        "Standing desk converters tend to cost the same as a basic standing desk.",
        "Standing desk converters come in various types:\nZ-lift converters are Z-shaped and normally come pre-assembled.",
        "X-lift converters are X-shaped and are more sturdier than the Z-lift.",
        "Post and base converters are simply a large pole and stand that you place on your desk and attach your computer to.",
        "Get a treadmill desk to incorporate exercise into your workday.",
        "This is definitely the most expensive alternative but it's also the healthiest one.",
        "Treadmill desks keep you walking all day, or as long as you have the treadmill on.",
        "You won't be able to make one of these at home as they only function well if they're custom built for this purpose.",
        "You should check with your boss first if you're considering buying a treadmill desk.",
        "They tend to make a lot of noise and it's unlikely that you'll be as productive using one of these as you would be if you were sitting.",
        "Using Alternative Sitting Options Use a balance ball to reduce back problems.",
        "While you will still technically be sitting when using a balance ball, they are great for your core and your posture.",
        "It might be uncomfortable at first but you'll get used to using the balance ball after a while.",
        "The balance ball will force you to sit in an upright and stable position.",
        "Balance balls can be bought for cheaper than $10 in some stores.",
        "To inflate the balance ball, find the valve on the balance ball.",
        "it's a small, rubber patch.",
        "Stick the needle on a pump through the hole in the rubber patch and pump the balance ball.",
        "Don't pump the ball until it's about to burst.",
        "It should be 95% inflated.",
        "Kneel at your desk to improve your posture.",
        "Sitting at a desk all day makes it easy for you to slouch or hunch your back.",
        "Lay a towel or mat on the floor and kneel on top of it.",
        "Kneeling will make you keep your back straight while at your desk and you won't be able to slouch.",
        "Kneeling might be sore on your knees.",
        "If it is, use a thick, soft cushion.",
        "If you need a break, you can always sit back in your chair for a few minutes.",
        "Get a balance disc to use at your desk to reduce back strain.",
        "Balance discs force you to engage your core and keep your back straight when you're at your desk.",
        "This will reduce pressure and tension on your back.",
        "You can buy a balance disc at your local sports store for between $40 and $50.",
        "A balance disc is a rubber disc that people use at the gym to improve their balance.",
        "Its uneven surface means you will have to sit in a straight, upright, position to stay steady at your desk.",
        "Making a Standing Desk Gather your materials if you want to make your own standing desk.",
        "Buy 1 pine board 1 inch (2.5 cm) in thickness, 2 feet (0.61 m) in length, and 6 feet (1.8 m) wide.",
        "Buy another pine board with the same thickness and length, but 5 feet (1.5 m) in width.",
        "You can also buy a large sheet of pine board and cut it into these dimensions later.",
        "You will also need 7 4 in × 4 in (10 cm × 10 cm) shelf brackets, 1 1/2″ x 8s countersunk/roundhead screws, a saw, a drill, a spirit level, sandpaper, a hand sander, and a clean cloth.",
        "You can find all of these items at your local hardware store.",
        "Measure the space where you want the desk.",
        "Since you'll be attaching the desk to the wall, you'll need to measure the area of the wall you want the desk to take up.",
        "Use measuring tape to find out how long across the wall you want the desk to stretch.",
        "Write down the measurements.",
        "Use a ruler or measuring tape to mark the length of the desk on the pine board.",
        "Mark an outline of how long and wide you want your desk to be on the pine board.",
        "Cut your pine board to fit your dimensions.",
        "Use a handheld saw or a power saw to cut your pine boards along the outline.",
        "Make sure you wear a dust mask and safety goggles when sawing wood as the dust could get into your mouth or eyes.",
        "If you want your desk to fit into a corner, cut your pine boards at an angle so they fit together in the corner.",
        "Sand the wood then wipe it down with a damp cloth.",
        "Rub 240-grit sandpaper on the top and bottom of the desk.",
        "If using a hand sander, make sure you place the wood on a stable surface.",
        "Use medium pressure to remove any imperfections from the wood and ensure the entire surface is as smooth as possible.",
        "Use a cloth to wipe any leftover dust from the wood.",
        "Wipe the sides and the top and bottom of the wood to make sure it's completely free of any dust.",
        "Don't forget to sand the parts of the wood that you just cut as these will be the roughest parts of the wood.",
        "Varnish your wood if you want to give it a stained look.",
        "Apply your first coat of varnish to the wood and leave it dry for 24 hours.",
        "Then sand it again and wipe the surface of the wood with a damp cloth.",
        "Apply the second coat of varnish after the surface has dried, painting with the grain of the wood.",
        "After the second coat has been applied, inspect the wood to see if it needs another.",
        "If it does, sand it, wipe it, and paint the next coat.",
        "Give the last coat you apply 24 hours to dry before sanding it and wiping it with a damp cloth once more.",
        "Buy stud finders at your local hardware store.",
        "A stud finder is a small, electronic device that you can use to find framing studs located behind drywall.",
        "Move the stud finder across the wall until it beeps.",
        "The beep means that spot is a good place for a bracket.",
        "The ideal position for a standing desk is slightly above waist height.",
        "Find out what half your height is and attach the brackets at that height.",
        "Use a pencil to mark the places your stud beeps at.",
        "After, use a spirit level to make sure they're all at an even height.",
        "If you can't get a stud finder, simply knock on the wall.",
        "Try to find the least hollow sounding parts of the wall.",
        "These places are the best parts of the wall to attach your brackets to.",
        "Attach the shelf brackets to the wall at half your height.",
        "You move the stud finder across the wall until it beeps, which indicates that spot is a good place for a bracket.",
        "Space the shelf brackets out evenly across the space you plan to put your desk in.",
        "Line your brackets up with the pencil marks and mark where the holes in the brackets line up with a pencil.",
        "Use your level to make sure all these marks are at an even height.",
        "Drill holes at these second marks using your drill.",
        "Line each bracket up again and insert the screws into your drilled holes using a screwdriver.",
        "Drill 1.5 in (3.8 cm) holes.",
        "Turn the screw to the right to tighten and left to make it looser.",
        "Place your wood on the brackets and secure it with a screwdriver.",
        "Put your wood on top of the brackets and drill into the wood where the hole on the bracket is lined up.",
        "Once that's done, use your screwdriver to secure the brackets to the wood.",
        "Set up your computer and work station.",
        "You can test the strength of your desk by placing books on it and leaving them over night.",
        "The desk should be very secure by now.",
        "Place your desktop or laptop on your new standing desk."
    ]
}