{
    "title": "How to Cook Kingfish",
    "url": "https://www.wikihow.com/Cook-Kingfish",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fish and Seafood"
    ],
    "methods": [
        {
            "name": "Frying Kingfish in a Pan",
            "steps": [
                {
                    "headline": "Mix together the garlic, ginger, tumeric, salt, pepper, and lemon juice.",
                    "description": "In a medium bowl, pour in the 2 teaspoons (9.9 mL) of garlic paste, 1 teaspoon (4.9 mL) of grated ginger, ⁄4 teaspoon (1.2 mL) of turmeric powder, and 1 tablespoon (15 mL) of lemon juice. Add salt and pepper to your liking. Stir the ingredients together with a spoon. If you want, you can skip the spices and just use salt and pepper."
                },
                {
                    "headline": "Rub the mixture into both sides of the kingfish steaks.",
                    "description": "Place the kingfish steaks into the mixture. Use your fingers to massage it into the steaks. Let it sit for a few minutes to soak up the flavors. If you're skipping the spices, just add salt and pepper to the fish when it's in the pan."
                },
                {
                    "headline": "Heat the oil in a pan.",
                    "description": "Place a pan over medium-high heat. Pour the olive oil into the pan, and let it heat up. Move the pan around so the olive oil covers the whole surface; that way, your fish won't stick. To test to see if the oil is hot enough, drop a bit of water in the pan. If it sizzles, the oil is hot enough."
                },
                {
                    "headline": "Fry the fish for 2-3 minutes on each side.",
                    "description": "Place the fish into the pan. Let it heat for a couple of minutes on the first side, then flip the fish over. Cook the fish on the other side until it becomes more opaque and it flakes easily. Try serving this fish with caramelized onions and a tomato sauce. Save any leftovers in an airtight container in the fridge. Eat them within 3 days."
                }
            ]
        },
        {
            "name": "Grilling Kingfish Belly",
            "steps": [
                {
                    "headline": "Coat the kingfish belly in olive oil.",
                    "description": "Use about 1/5 of the olive oil (enough to coat the fish), and brush it all over the surface of the fish. Sprinkle salt and pepper all over the fish to your taste and preference. If you don't have kingfish belly, you can use a fillet or even skewered chunks of kingfish."
                },
                {
                    "headline": "Grill the fish and limes over medium heat.",
                    "description": "Cook the kingfish belly for about 2 minutes on each side, until it flakes easily. Place the finger limes on the grill at the same time you do the fish. Cook the limes for about 1 minute altogether. Finger limes are native to Australia, and the pulp of the fruit is like little balls of caviar. If you can't find these limes, try substituting key limes instead."
                },
                {
                    "headline": "Create a fennel salad with the lime and olive oil.",
                    "description": "Slice the fennel very thin on a mandolin or with a sharp knife. You can also add the fronds of the fennel if you'd like. Toss the fennel with the juice and zest from 1/2 lime in a bowl, along with the rest of the olive oil. Add a few dashes of sea salt to the salad to flavor it."
                },
                {
                    "headline": "Slice and serve the kingfish.",
                    "description": "Cut the kingfish against the grain, and lay the pieces out on a platter. Spread the fennel salad out on top. Cut the finger limes along one side, and release the citrus pearls along the kingfish. If you're using key limes, dice the pulp and sprinkle it over the fish. \"Against the grain\" means cutting perpendicular to the lines you see in the fish, which make up the grain of the fish. Put leftovers in the fridge in an airtight container and consume them within 3 days."
                }
            ]
        },
        {
            "name": "Baking Kingfish",
            "steps": [
                {
                    "headline": "Mix the dry ingredients together and heat the oven to 400 °F (204 °C).",
                    "description": "In a bowl, combine the ⁄2 cup (120 mL) of flour or multi-grain breadcrumbs, the ⁄4 cup (59 mL) of chopped fresh parsley, the ⁄3 cup (79 mL) of grated Parmesan cheese, and the zest from half a lemon. Stir the ingredients to combine them. Breadcrumbs will give the fish a heavier crunch, but flour will work if you don't have any breadcrumbs."
                },
                {
                    "headline": "Add the 1 teaspoon (4.9 mL) of olive oil oil to the dry ingredients.",
                    "description": "The oil will help the coating stick to the fish and crisp up. Mix it into the dry ingredients until it is well incorporated."
                },
                {
                    "headline": "Coat the fish with the breadcrumb mixture.",
                    "description": "Sprinkle salt and pepper over the fish. Use your hands to press the breadcrumb mixture into each side of the fish. You can use gloves if you're a bit squeamish or press the mixture with the back of a spoon."
                },
                {
                    "headline": "Set the fish on a lightly oiled pan, skin-side down and coat it in oil.",
                    "description": "If your fish still has the skin, it should go against the oiled tray. Coat the fish lightly in oil, either by gently brushing it on or using spray oil. You want just enough oil that the breadcrumbs can get crispy."
                },
                {
                    "headline": "Bake the fish for 15 minutes.",
                    "description": "Place the tray in the oven, and leave it to bake. The fish is done when it flakes easily and the crumbs are golden brown. Pull the fish out of the oven and serve immediately. Try serving it with lemon slices and a sprinkling of fresh parsley on top. Store any leftovers in an airtight container in the refrigerator and use within 3 days."
                }
            ]
        }
    ],
    "tyn": [
        "Frying Kingfish",
        "Pan",
        "Medium bowl",
        "Spoon",
        "Spatula",
        "Grilling Kingfish Belly",
        "Grill",
        "Kitchen brush",
        "Bowl",
        "Sharp knife",
        "Baking Kingfish",
        "Zester",
        "Baking pan"
    ],
    "text": " Frying Kingfish in a Pan Mix together the garlic, ginger, tumeric, salt, pepper, and lemon juice. In a medium bowl, pour in the 2 teaspoons (9.9 mL) of garlic paste, 1 teaspoon (4.9 mL) of grated ginger, ⁄4 teaspoon (1.2 mL) of turmeric powder, and 1 tablespoon (15 mL) of lemon juice. Add salt and pepper to your liking. Stir the ingredients together with a spoon. If you want, you can skip the spices and just use salt and pepper. Rub the mixture into both sides of the kingfish steaks. Place the kingfish steaks into the mixture. Use your fingers to massage it into the steaks. Let it sit for a few minutes to soak up the flavors. If you're skipping the spices, just add salt and pepper to the fish when it's in the pan. Heat the oil in a pan. Place a pan over medium-high heat. Pour the olive oil into the pan, and let it heat up. Move the pan around so the olive oil covers the whole surface; that way, your fish won't stick. To test to see if the oil is hot enough, drop a bit of water in the pan. If it sizzles, the oil is hot enough. Fry the fish for 2-3 minutes on each side. Place the fish into the pan. Let it heat for a couple of minutes on the first side, then flip the fish over. Cook the fish on the other side until it becomes more opaque and it flakes easily. Try serving this fish with caramelized onions and a tomato sauce. Save any leftovers in an airtight container in the fridge. Eat them within 3 days. Grilling Kingfish Belly Coat the kingfish belly in olive oil. Use about 1/5 of the olive oil (enough to coat the fish), and brush it all over the surface of the fish. Sprinkle salt and pepper all over the fish to your taste and preference. If you don't have kingfish belly, you can use a fillet or even skewered chunks of kingfish. Grill the fish and limes over medium heat. Cook the kingfish belly for about 2 minutes on each side, until it flakes easily. Place the finger limes on the grill at the same time you do the fish. Cook the limes for about 1 minute altogether. Finger limes are native to Australia, and the pulp of the fruit is like little balls of caviar. If you can't find these limes, try substituting key limes instead. Create a fennel salad with the lime and olive oil. Slice the fennel very thin on a mandolin or with a sharp knife. You can also add the fronds of the fennel if you'd like. Toss the fennel with the juice and zest from 1/2 lime in a bowl, along with the rest of the olive oil. Add a few dashes of sea salt to the salad to flavor it. Slice and serve the kingfish. Cut the kingfish against the grain, and lay the pieces out on a platter. Spread the fennel salad out on top. Cut the finger limes along one side, and release the citrus pearls along the kingfish. If you're using key limes, dice the pulp and sprinkle it over the fish. \"Against the grain\" means cutting perpendicular to the lines you see in the fish, which make up the grain of the fish. Put leftovers in the fridge in an airtight container and consume them within 3 days. Baking Kingfish Mix the dry ingredients together and heat the oven to 400 °F (204 °C). In a bowl, combine the ⁄2 cup (120 mL) of flour or multi-grain breadcrumbs, the ⁄4 cup (59 mL) of chopped fresh parsley, the ⁄3 cup (79 mL) of grated Parmesan cheese, and the zest from half a lemon. Stir the ingredients to combine them. Breadcrumbs will give the fish a heavier crunch, but flour will work if you don't have any breadcrumbs. Add the 1 teaspoon (4.9 mL) of olive oil oil to the dry ingredients. The oil will help the coating stick to the fish and crisp up. Mix it into the dry ingredients until it is well incorporated. Coat the fish with the breadcrumb mixture. Sprinkle salt and pepper over the fish. Use your hands to press the breadcrumb mixture into each side of the fish. You can use gloves if you're a bit squeamish or press the mixture with the back of a spoon. Set the fish on a lightly oiled pan, skin-side down and coat it in oil. If your fish still has the skin, it should go against the oiled tray. Coat the fish lightly in oil, either by gently brushing it on or using spray oil. You want just enough oil that the breadcrumbs can get crispy. Bake the fish for 15 minutes. Place the tray in the oven, and leave it to bake. The fish is done when it flakes easily and the crumbs are golden brown. Pull the fish out of the oven and serve immediately. Try serving it with lemon slices and a sprinkling of fresh parsley on top. Store any leftovers in an airtight container in the refrigerator and use within 3 days.",
    "sentences": [
        " Frying Kingfish in a Pan Mix together the garlic, ginger, tumeric, salt, pepper, and lemon juice.",
        "In a medium bowl, pour in the 2 teaspoons (9.9 mL) of garlic paste, 1 teaspoon (4.9 mL) of grated ginger, ⁄4 teaspoon (1.2 mL) of turmeric powder, and 1 tablespoon (15 mL) of lemon juice.",
        "Add salt and pepper to your liking.",
        "Stir the ingredients together with a spoon.",
        "If you want, you can skip the spices and just use salt and pepper.",
        "Rub the mixture into both sides of the kingfish steaks.",
        "Place the kingfish steaks into the mixture.",
        "Use your fingers to massage it into the steaks.",
        "Let it sit for a few minutes to soak up the flavors.",
        "If you're skipping the spices, just add salt and pepper to the fish when it's in the pan.",
        "Heat the oil in a pan.",
        "Place a pan over medium-high heat.",
        "Pour the olive oil into the pan, and let it heat up.",
        "Move the pan around so the olive oil covers the whole surface; that way, your fish won't stick.",
        "To test to see if the oil is hot enough, drop a bit of water in the pan.",
        "If it sizzles, the oil is hot enough.",
        "Fry the fish for 2-3 minutes on each side.",
        "Place the fish into the pan.",
        "Let it heat for a couple of minutes on the first side, then flip the fish over.",
        "Cook the fish on the other side until it becomes more opaque and it flakes easily.",
        "Try serving this fish with caramelized onions and a tomato sauce.",
        "Save any leftovers in an airtight container in the fridge.",
        "Eat them within 3 days.",
        "Grilling Kingfish Belly Coat the kingfish belly in olive oil.",
        "Use about 1/5 of the olive oil (enough to coat the fish), and brush it all over the surface of the fish.",
        "Sprinkle salt and pepper all over the fish to your taste and preference.",
        "If you don't have kingfish belly, you can use a fillet or even skewered chunks of kingfish.",
        "Grill the fish and limes over medium heat.",
        "Cook the kingfish belly for about 2 minutes on each side, until it flakes easily.",
        "Place the finger limes on the grill at the same time you do the fish.",
        "Cook the limes for about 1 minute altogether.",
        "Finger limes are native to Australia, and the pulp of the fruit is like little balls of caviar.",
        "If you can't find these limes, try substituting key limes instead.",
        "Create a fennel salad with the lime and olive oil.",
        "Slice the fennel very thin on a mandolin or with a sharp knife.",
        "You can also add the fronds of the fennel if you'd like.",
        "Toss the fennel with the juice and zest from 1/2 lime in a bowl, along with the rest of the olive oil.",
        "Add a few dashes of sea salt to the salad to flavor it.",
        "Slice and serve the kingfish.",
        "Cut the kingfish against the grain, and lay the pieces out on a platter.",
        "Spread the fennel salad out on top.",
        "Cut the finger limes along one side, and release the citrus pearls along the kingfish.",
        "If you're using key limes, dice the pulp and sprinkle it over the fish.",
        "\"Against the grain\" means cutting perpendicular to the lines you see in the fish, which make up the grain of the fish.",
        "Put leftovers in the fridge in an airtight container and consume them within 3 days.",
        "Baking Kingfish Mix the dry ingredients together and heat the oven to 400 °F (204 °C).",
        "In a bowl, combine the ⁄2 cup (120 mL) of flour or multi-grain breadcrumbs, the ⁄4 cup (59 mL) of chopped fresh parsley, the ⁄3 cup (79 mL) of grated Parmesan cheese, and the zest from half a lemon.",
        "Stir the ingredients to combine them.",
        "Breadcrumbs will give the fish a heavier crunch, but flour will work if you don't have any breadcrumbs.",
        "Add the 1 teaspoon (4.9 mL) of olive oil oil to the dry ingredients.",
        "The oil will help the coating stick to the fish and crisp up.",
        "Mix it into the dry ingredients until it is well incorporated.",
        "Coat the fish with the breadcrumb mixture.",
        "Sprinkle salt and pepper over the fish.",
        "Use your hands to press the breadcrumb mixture into each side of the fish.",
        "You can use gloves if you're a bit squeamish or press the mixture with the back of a spoon.",
        "Set the fish on a lightly oiled pan, skin-side down and coat it in oil.",
        "If your fish still has the skin, it should go against the oiled tray.",
        "Coat the fish lightly in oil, either by gently brushing it on or using spray oil.",
        "You want just enough oil that the breadcrumbs can get crispy.",
        "Bake the fish for 15 minutes.",
        "Place the tray in the oven, and leave it to bake.",
        "The fish is done when it flakes easily and the crumbs are golden brown.",
        "Pull the fish out of the oven and serve immediately.",
        "Try serving it with lemon slices and a sprinkling of fresh parsley on top.",
        "Store any leftovers in an airtight container in the refrigerator and use within 3 days."
    ]
}