{
    "title": "How to Bake Scallops",
    "url": "https://www.wikihow.com/Bake-Scallops",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fish and Seafood"
    ],
    "parts": [
        {
            "name": "Picking and Washing the Scallops",
            "steps": [
                {
                    "headline": "Purchase 2 pounds (910 g) of fresh scallops.",
                    "description": "Pick scallops that are white, pearly, and have moist and springy meat. Try to avoid scallops that are squished or torn. Torn and squished scallops are often mishandled and not fresh. Wet-packed scallops are the most commonly sold and are more affordable. However, their meat is typically tougher because they’ve absorbed more water. Dry-packed scallops are very fresh when they’re sold, but spoil more quickly. Diver-caught scallops are very expensive but environmentally friendly. Instead of dredging up the ocean floor to collect scallops, the divers hand pick them. Bay scallops are smaller and sweeter than sea scallops but aren’t as common. You can also buy frozen scallops, but they’re less likely to be fresh. If you buy frozen scallops, make sure to thaw them by leaving them overnight in the refrigerator or sealing them in a plastic bag and running cold water over them."
                },
                {
                    "headline": "Wash the scallops and pat them dry.",
                    "description": "Just rinse the scallops under cold water for a few seconds. Then, set them in between 2 paper towels and pat them dry. If they aren’t completely dry, they won’t cook properly in the oven. Wash your hands before handling the scallops. You can use a clean kitchen towel if you don’t have paper towels."
                },
                {
                    "headline": "Remove the side muscle on the scallops.",
                    "description": "Pinch the muscle between your thumb and pointer finger and rip it off. The muscle will feel rectangular and tougher than the rest of the scallop. You’ll find it on the side of the scallop. Don't worry if you can’t find the side muscle. It sometimes get removed during the harvesting process."
                }
            ]
        },
        {
            "name": "Seasoning the Scallops",
            "steps": [
                {
                    "headline": "Grease a baking dish with butter.",
                    "description": "Cut off around 0.5 inches (1.3 cm) of butter and use your hands to rub it over the dish. Choose a large and shallow baking dish that is big enough to have 1 single layer of scallops. You may need to use more than 1 dish. Wash your hands before touching the butter. If you don’t want to get butter on your hands, then wrap the butter in a paper towel."
                },
                {
                    "headline": "Place 1 layer of scallops in the baking dish.",
                    "description": "Use your hands to gently place the scallops in the baking dish. While the scallops should touch, they shouldn’t be on top of each other."
                },
                {
                    "headline": "Pour 0.5 cups (120 mL) of butter over the scallops.",
                    "description": "Try to pour the butter evenly over the scallops. Then, use your hands to coat the scallops entirely in butter. If you want to keep your hands clean, consider using a kitchen spoon to mix the scallops. Just be careful not to tear or squish the seafood."
                },
                {
                    "headline": "Sprinkle the scallops with the parsley, dried basil, salt, and pepper.",
                    "description": "Evenly cover the scallops in 3 tablespoons (44 mL) of finely chopped parsley, 1.5 teaspoons (7.4 mL) of crumbled and dried basil leaf, 1 teaspoon (4.9 mL) of salt, and 0.25 teaspoons (1.2 mL) of pepper. For more texture, you can add breadcrumbs during the baking process."
                }
            ]
        },
        {
            "name": "Cooking the Scallops",
            "steps": [
                {
                    "headline": "Preheat the oven to 350 °F (177 °C).",
                    "description": "Let your oven heat while you prepare the scallops to speed up the whole process. Set a timer to let you know when the oven is ready."
                },
                {
                    "headline": "Bake the scallops for 5 minutes.",
                    "description": "Place the dish with the scallops in it in the oven carefully. Use an alarm to remind you to take the scallops out of the oven. When taking the scallops out of the oven, use heat protection. Keep children and pets away from the oven when it’s open."
                },
                {
                    "headline": "Stir the scallops to keep them moist.",
                    "description": "Take your scallops out of the oven and use a kitchen spoon to stir the dish gently. Keep stirring carefully until you’ve redistributed the moisture to fully recoat the scallops in the butter and herbs. For more texture, sprinkle bread crumbs or panko over the top of the dish. You can make the layer as thin or thick as you like."
                },
                {
                    "headline": "Bake the dish for 15 to 20 minutes.",
                    "description": "Carefully put the dish back in the oven and let it cook for up to 20 minutes. By the 20 minute mark, the scallops should be cooked through, but still moist. To tell if your scallops are done cooking, poke them with a fork. If the fork bounces back slightly and the scallops are opaque, then they’re done cooking. It is better to undercook than overcook scallops because overcooked scallop meat is really tough. If you used breadcrumbs or panko, the crumbs should look toasted and brown, not burnt."
                },
                {
                    "headline": "Serve your baked scallops immediately.",
                    "description": "Do this quickly so they don’t get cold! You can also drizzle them in lemon, eat them plain, with pasta, vegetables, or rice. Just use heat protection and be careful when moving the scallops from the oven dish to plates. To preserve your cooked scallops, store them in an airtight container and put the container in the refrigerator for 3 to 4 days. You can also put the container in the freezer for up to 3 to 4 months."
                }
            ]
        }
    ],
    "tyn": [
        "Baking dish",
        "Oven",
        "Oven mitts"
    ],
    "text": " Picking and Washing the Scallops Purchase 2 pounds (910 g) of fresh scallops. Pick scallops that are white, pearly, and have moist and springy meat. Try to avoid scallops that are squished or torn. Torn and squished scallops are often mishandled and not fresh. Wet-packed scallops are the most commonly sold and are more affordable. However, their meat is typically tougher because they’ve absorbed more water. Dry-packed scallops are very fresh when they’re sold, but spoil more quickly. Diver-caught scallops are very expensive but environmentally friendly. Instead of dredging up the ocean floor to collect scallops, the divers hand pick them. Bay scallops are smaller and sweeter than sea scallops but aren’t as common. You can also buy frozen scallops, but they’re less likely to be fresh. If you buy frozen scallops, make sure to thaw them by leaving them overnight in the refrigerator or sealing them in a plastic bag and running cold water over them. Wash the scallops and pat them dry. Just rinse the scallops under cold water for a few seconds. Then, set them in between 2 paper towels and pat them dry. If they aren’t completely dry, they won’t cook properly in the oven. Wash your hands before handling the scallops. You can use a clean kitchen towel if you don’t have paper towels. Remove the side muscle on the scallops. Pinch the muscle between your thumb and pointer finger and rip it off. The muscle will feel rectangular and tougher than the rest of the scallop. You’ll find it on the side of the scallop. Don't worry if you can’t find the side muscle. It sometimes get removed during the harvesting process. Seasoning the Scallops Grease a baking dish with butter. Cut off around 0.5 inches (1.3 cm) of butter and use your hands to rub it over the dish. Choose a large and shallow baking dish that is big enough to have 1 single layer of scallops. You may need to use more than 1 dish. Wash your hands before touching the butter. If you don’t want to get butter on your hands, then wrap the butter in a paper towel. Place 1 layer of scallops in the baking dish. Use your hands to gently place the scallops in the baking dish. While the scallops should touch, they shouldn’t be on top of each other. Pour 0.5 cups (120 mL) of butter over the scallops. Try to pour the butter evenly over the scallops. Then, use your hands to coat the scallops entirely in butter. If you want to keep your hands clean, consider using a kitchen spoon to mix the scallops. Just be careful not to tear or squish the seafood. Sprinkle the scallops with the parsley, dried basil, salt, and pepper. Evenly cover the scallops in 3 tablespoons (44 mL) of finely chopped parsley, 1.5 teaspoons (7.4 mL) of crumbled and dried basil leaf, 1 teaspoon (4.9 mL) of salt, and 0.25 teaspoons (1.2 mL) of pepper. For more texture, you can add breadcrumbs during the baking process. Cooking the Scallops Preheat the oven to 350 °F (177 °C). Let your oven heat while you prepare the scallops to speed up the whole process. Set a timer to let you know when the oven is ready. Bake the scallops for 5 minutes. Place the dish with the scallops in it in the oven carefully. Use an alarm to remind you to take the scallops out of the oven. When taking the scallops out of the oven, use heat protection. Keep children and pets away from the oven when it’s open. Stir the scallops to keep them moist. Take your scallops out of the oven and use a kitchen spoon to stir the dish gently. Keep stirring carefully until you’ve redistributed the moisture to fully recoat the scallops in the butter and herbs. For more texture, sprinkle bread crumbs or panko over the top of the dish. You can make the layer as thin or thick as you like. Bake the dish for 15 to 20 minutes. Carefully put the dish back in the oven and let it cook for up to 20 minutes. By the 20 minute mark, the scallops should be cooked through, but still moist. To tell if your scallops are done cooking, poke them with a fork. If the fork bounces back slightly and the scallops are opaque, then they’re done cooking. It is better to undercook than overcook scallops because overcooked scallop meat is really tough. If you used breadcrumbs or panko, the crumbs should look toasted and brown, not burnt. Serve your baked scallops immediately. Do this quickly so they don’t get cold! You can also drizzle them in lemon, eat them plain, with pasta, vegetables, or rice. Just use heat protection and be careful when moving the scallops from the oven dish to plates. To preserve your cooked scallops, store them in an airtight container and put the container in the refrigerator for 3 to 4 days. You can also put the container in the freezer for up to 3 to 4 months.",
    "sentences": [
        " Picking and Washing the Scallops Purchase 2 pounds (910 g) of fresh scallops.",
        "Pick scallops that are white, pearly, and have moist and springy meat.",
        "Try to avoid scallops that are squished or torn.",
        "Torn and squished scallops are often mishandled and not fresh.",
        "Wet-packed scallops are the most commonly sold and are more affordable.",
        "However, their meat is typically tougher because they’ve absorbed more water.",
        "Dry-packed scallops are very fresh when they’re sold, but spoil more quickly.",
        "Diver-caught scallops are very expensive but environmentally friendly.",
        "Instead of dredging up the ocean floor to collect scallops, the divers hand pick them.",
        "Bay scallops are smaller and sweeter than sea scallops but aren’t as common.",
        "You can also buy frozen scallops, but they’re less likely to be fresh.",
        "If you buy frozen scallops, make sure to thaw them by leaving them overnight in the refrigerator or sealing them in a plastic bag and running cold water over them.",
        "Wash the scallops and pat them dry.",
        "Just rinse the scallops under cold water for a few seconds.",
        "Then, set them in between 2 paper towels and pat them dry.",
        "If they aren’t completely dry, they won’t cook properly in the oven.",
        "Wash your hands before handling the scallops.",
        "You can use a clean kitchen towel if you don’t have paper towels.",
        "Remove the side muscle on the scallops.",
        "Pinch the muscle between your thumb and pointer finger and rip it off.",
        "The muscle will feel rectangular and tougher than the rest of the scallop.",
        "You’ll find it on the side of the scallop.",
        "Don't worry if you can’t find the side muscle.",
        "It sometimes get removed during the harvesting process.",
        "Seasoning the Scallops Grease a baking dish with butter.",
        "Cut off around 0.5 inches (1.3 cm) of butter and use your hands to rub it over the dish.",
        "Choose a large and shallow baking dish that is big enough to have 1 single layer of scallops.",
        "You may need to use more than 1 dish.",
        "Wash your hands before touching the butter.",
        "If you don’t want to get butter on your hands, then wrap the butter in a paper towel.",
        "Place 1 layer of scallops in the baking dish.",
        "Use your hands to gently place the scallops in the baking dish.",
        "While the scallops should touch, they shouldn’t be on top of each other.",
        "Pour 0.5 cups (120 mL) of butter over the scallops.",
        "Try to pour the butter evenly over the scallops.",
        "Then, use your hands to coat the scallops entirely in butter.",
        "If you want to keep your hands clean, consider using a kitchen spoon to mix the scallops.",
        "Just be careful not to tear or squish the seafood.",
        "Sprinkle the scallops with the parsley, dried basil, salt, and pepper.",
        "Evenly cover the scallops in 3 tablespoons (44 mL) of finely chopped parsley, 1.5 teaspoons (7.4 mL) of crumbled and dried basil leaf, 1 teaspoon (4.9 mL) of salt, and 0.25 teaspoons (1.2 mL) of pepper.",
        "For more texture, you can add breadcrumbs during the baking process.",
        "Cooking the Scallops Preheat the oven to 350 °F (177 °C).",
        "Let your oven heat while you prepare the scallops to speed up the whole process.",
        "Set a timer to let you know when the oven is ready.",
        "Bake the scallops for 5 minutes.",
        "Place the dish with the scallops in it in the oven carefully.",
        "Use an alarm to remind you to take the scallops out of the oven.",
        "When taking the scallops out of the oven, use heat protection.",
        "Keep children and pets away from the oven when it’s open.",
        "Stir the scallops to keep them moist.",
        "Take your scallops out of the oven and use a kitchen spoon to stir the dish gently.",
        "Keep stirring carefully until you’ve redistributed the moisture to fully recoat the scallops in the butter and herbs.",
        "For more texture, sprinkle bread crumbs or panko over the top of the dish.",
        "You can make the layer as thin or thick as you like.",
        "Bake the dish for 15 to 20 minutes.",
        "Carefully put the dish back in the oven and let it cook for up to 20 minutes.",
        "By the 20 minute mark, the scallops should be cooked through, but still moist.",
        "To tell if your scallops are done cooking, poke them with a fork.",
        "If the fork bounces back slightly and the scallops are opaque, then they’re done cooking.",
        "It is better to undercook than overcook scallops because overcooked scallop meat is really tough.",
        "If you used breadcrumbs or panko, the crumbs should look toasted and brown, not burnt.",
        "Serve your baked scallops immediately.",
        "Do this quickly so they don’t get cold!",
        "You can also drizzle them in lemon, eat them plain, with pasta, vegetables, or rice.",
        "Just use heat protection and be careful when moving the scallops from the oven dish to plates.",
        "To preserve your cooked scallops, store them in an airtight container and put the container in the refrigerator for 3 to 4 days.",
        "You can also put the container in the freezer for up to 3 to 4 months."
    ]
}