{
    "title": "How to Prepare Glycerol Stock",
    "url": "https://www.wikihow.com/Prepare-Glycerol-Stock",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science"
    ],
    "parts": [
        {
            "name": "Mixing the Glycerol Solution",
            "steps": [
                {
                    "headline": "Prepare a liquid culture of the bacteria you want to store.",
                    "description": "In order for a glycerol stock to be effective, it must be combined with a liquid bacterial culture. Producing a liquid culture will require you to incubate a bacterial sample overnight in an Erlenmeyer flask filled with lysogeny broth and the correct concentration of antibiotic. Once you’ve prepared a liquid culture, you can put the bacteria into storage or proceed to isolate the plasmid DNA. Lysogeny broth (also known as “LB broth” and “LB liquid”) is a type of nutrient-rich fluid used to propagate bacteria rapidly. It can be purchased from a retailer that sells laboratory equipment and materials. Incubating bacterial cultures is a highly technical process involving many different variables. For this reason, it’s best performed by a trained technician in a controlled laboratory setting."
                },
                {
                    "headline": "Dilute pure glycerol in distilled water to create a 50% glycerol solution.",
                    "description": "Use a sterile pipette to measure out 10 mL of both liquids and combine them in a single flask. Stir or shake the flask thoroughly until the liquids are evenly mixed. Diluting the glycerol is necessary to prevent it from damaging the bacterial cells. Some scientists prefer to use a glycerol solution as low as 15-40% in order to avoid compromising the bacterial culture. However, a 50% mixture will provide maximum longevity in storage."
                },
                {
                    "headline": "Transfer 50 microliters of the 50% glycerol solution to a microfuge tube.",
                    "description": "Move the diluted glycerol over to the new vial carefully to avoid spills. You’ll use this same container to infuse the glycerol solution with the liquid bacterial culture and place the sample into cold storage. If possible, use a tube with a screw top rather than one with a snap top. Snap top tubes have been known to come open accidentally during mixing and prolonged storage."
                }
            ]
        },
        {
            "name": "Adding the Bacterial Culture",
            "steps": [
                {
                    "headline": "Add 50 microliters of your liquid bacterial culture to the solution.",
                    "description": "Use a fresh pipette to measure out an equal quantity of the liquid culture and pour it directly into the glycerol solution in the tube. The final proportions of your glycerol stock should be 50% bacteria and 50% diluted glycerol. Using disproportionate amounts of glycerol and liquid culture could affect the hardiness of the bacteria and reduce the amount of time it’s able to survive in cold storage. If you’re using a glycerol solution with a lower concentration, you’ll need to adjust the quantity of the bacterial culture accordingly. Consult the literature relating to the exact strain you’re storing for more information."
                },
                {
                    "headline": "Place the lid on the tube.",
                    "description": "Screw the lid into place, or push down until you hear a soft click if you’re using a snap top tube. Confirm that the lid is secure before moving on."
                },
                {
                    "headline": "Shake the tube gently to mix the bacterial culture and glycerol.",
                    "description": "Whisk the tube back and forth a few times until both liquids are evenly distributed. At this point, the bacterial cells will slowly begin to absorb the glycerol solution, which will stabilize and protect the cell membrane from deterioration and temperature-related damage. Keep your thumb pressed firmly against the lid of the microfuge tube while shaking to make sure it doesn’t come loose."
                }
            ]
        },
        {
            "name": "Storing and Reviving Bacterial Cultures",
            "steps": [
                {
                    "headline": "Label the bacterial sample.",
                    "description": "Write the name of the culture on a small test tube label or strip of masking tape and stick it to the microfuge tube where it will be plainly visible. You can also jot the bacteria’s classification info directly onto the lid using a felt-tipped marker. Be sure to also record any other information that may prove useful during analysis, such as the exact strain of the sample or its origin. Labeling your sample containers is an indispensable step in the collection process, as it enables you to keep track of their contents as they’re shuffled around in and out of storage."
                },
                {
                    "headline": "Freeze the sample at −80 °C (−112 °F).",
                    "description": "Place the labelled sample in an supercooled laboratory freezer set to a constant temperature of −80 °C (−112 °F). When kept under these conditions, the bacterial culture will stay viable for multiple years. It’s critical that the temperature of the freezer remain fixed at −80 °C (−112 °F). If it’s set any warmer, the preserved bacteria may die."
                },
                {
                    "headline": "Scrape up a small amount of frozen bacteria to prepare it for analysis.",
                    "description": "When it comes time to revive your sample, remove the microfuge tube from the freezer and open the lid. Use a sterile inoculation loop, toothpick, or pipette tip to collect a small amount of frozen material from the top of the sample and streak the bacteria onto an LB agar plate for examination or testing. Be careful not to let the bacteria scraping thaw. It may help to keep the stock tube on dry ice until you’ve completed your tests. Only pull your sample out of the freezer when absolutely necessary. Repeated thawing and refreezing will decrease its lifespan considerably."
                }
            ]
        }
    ],
    "tyn": [
        "Bacterial culture",
        "LB broth",
        "Erlenmeyer flask",
        "Screw top microfuge tube",
        "Sterile pipette",
        "Supercooled laboratory freezer",
        "LB agar plate",
        "Inoculation loop or toothpick",
        "Test tube label or masking tape",
        "Felt-tipped marker or ink pen"
    ],
    "text": " Mixing the Glycerol Solution Prepare a liquid culture of the bacteria you want to store. In order for a glycerol stock to be effective, it must be combined with a liquid bacterial culture. Producing a liquid culture will require you to incubate a bacterial sample overnight in an Erlenmeyer flask filled with lysogeny broth and the correct concentration of antibiotic. Once you’ve prepared a liquid culture, you can put the bacteria into storage or proceed to isolate the plasmid DNA. Lysogeny broth (also known as “LB broth” and “LB liquid”) is a type of nutrient-rich fluid used to propagate bacteria rapidly. It can be purchased from a retailer that sells laboratory equipment and materials. Incubating bacterial cultures is a highly technical process involving many different variables. For this reason, it’s best performed by a trained technician in a controlled laboratory setting. Dilute pure glycerol in distilled water to create a 50% glycerol solution. Use a sterile pipette to measure out 10 mL of both liquids and combine them in a single flask. Stir or shake the flask thoroughly until the liquids are evenly mixed. Diluting the glycerol is necessary to prevent it from damaging the bacterial cells. Some scientists prefer to use a glycerol solution as low as 15-40% in order to avoid compromising the bacterial culture. However, a 50% mixture will provide maximum longevity in storage. Transfer 50 microliters of the 50% glycerol solution to a microfuge tube. Move the diluted glycerol over to the new vial carefully to avoid spills. You’ll use this same container to infuse the glycerol solution with the liquid bacterial culture and place the sample into cold storage. If possible, use a tube with a screw top rather than one with a snap top. Snap top tubes have been known to come open accidentally during mixing and prolonged storage. Adding the Bacterial Culture Add 50 microliters of your liquid bacterial culture to the solution. Use a fresh pipette to measure out an equal quantity of the liquid culture and pour it directly into the glycerol solution in the tube. The final proportions of your glycerol stock should be 50% bacteria and 50% diluted glycerol. Using disproportionate amounts of glycerol and liquid culture could affect the hardiness of the bacteria and reduce the amount of time it’s able to survive in cold storage. If you’re using a glycerol solution with a lower concentration, you’ll need to adjust the quantity of the bacterial culture accordingly. Consult the literature relating to the exact strain you’re storing for more information. Place the lid on the tube. Screw the lid into place, or push down until you hear a soft click if you’re using a snap top tube. Confirm that the lid is secure before moving on. Shake the tube gently to mix the bacterial culture and glycerol. Whisk the tube back and forth a few times until both liquids are evenly distributed. At this point, the bacterial cells will slowly begin to absorb the glycerol solution, which will stabilize and protect the cell membrane from deterioration and temperature-related damage. Keep your thumb pressed firmly against the lid of the microfuge tube while shaking to make sure it doesn’t come loose. Storing and Reviving Bacterial Cultures Label the bacterial sample. Write the name of the culture on a small test tube label or strip of masking tape and stick it to the microfuge tube where it will be plainly visible. You can also jot the bacteria’s classification info directly onto the lid using a felt-tipped marker. Be sure to also record any other information that may prove useful during analysis, such as the exact strain of the sample or its origin. Labeling your sample containers is an indispensable step in the collection process, as it enables you to keep track of their contents as they’re shuffled around in and out of storage. Freeze the sample at −80 °C (−112 °F). Place the labelled sample in an supercooled laboratory freezer set to a constant temperature of −80 °C (−112 °F). When kept under these conditions, the bacterial culture will stay viable for multiple years. It’s critical that the temperature of the freezer remain fixed at −80 °C (−112 °F). If it’s set any warmer, the preserved bacteria may die. Scrape up a small amount of frozen bacteria to prepare it for analysis. When it comes time to revive your sample, remove the microfuge tube from the freezer and open the lid. Use a sterile inoculation loop, toothpick, or pipette tip to collect a small amount of frozen material from the top of the sample and streak the bacteria onto an LB agar plate for examination or testing. Be careful not to let the bacteria scraping thaw. It may help to keep the stock tube on dry ice until you’ve completed your tests. Only pull your sample out of the freezer when absolutely necessary. Repeated thawing and refreezing will decrease its lifespan considerably.",
    "sentences": [
        " Mixing the Glycerol Solution Prepare a liquid culture of the bacteria you want to store.",
        "In order for a glycerol stock to be effective, it must be combined with a liquid bacterial culture.",
        "Producing a liquid culture will require you to incubate a bacterial sample overnight in an Erlenmeyer flask filled with lysogeny broth and the correct concentration of antibiotic.",
        "Once you’ve prepared a liquid culture, you can put the bacteria into storage or proceed to isolate the plasmid DNA.",
        "Lysogeny broth (also known as “LB broth” and “LB liquid”) is a type of nutrient-rich fluid used to propagate bacteria rapidly.",
        "It can be purchased from a retailer that sells laboratory equipment and materials.",
        "Incubating bacterial cultures is a highly technical process involving many different variables.",
        "For this reason, it’s best performed by a trained technician in a controlled laboratory setting.",
        "Dilute pure glycerol in distilled water to create a 50% glycerol solution.",
        "Use a sterile pipette to measure out 10 mL of both liquids and combine them in a single flask.",
        "Stir or shake the flask thoroughly until the liquids are evenly mixed.",
        "Diluting the glycerol is necessary to prevent it from damaging the bacterial cells.",
        "Some scientists prefer to use a glycerol solution as low as 15-40% in order to avoid compromising the bacterial culture.",
        "However, a 50% mixture will provide maximum longevity in storage.",
        "Transfer 50 microliters of the 50% glycerol solution to a microfuge tube.",
        "Move the diluted glycerol over to the new vial carefully to avoid spills.",
        "You’ll use this same container to infuse the glycerol solution with the liquid bacterial culture and place the sample into cold storage.",
        "If possible, use a tube with a screw top rather than one with a snap top.",
        "Snap top tubes have been known to come open accidentally during mixing and prolonged storage.",
        "Adding the Bacterial Culture Add 50 microliters of your liquid bacterial culture to the solution.",
        "Use a fresh pipette to measure out an equal quantity of the liquid culture and pour it directly into the glycerol solution in the tube.",
        "The final proportions of your glycerol stock should be 50% bacteria and 50% diluted glycerol.",
        "Using disproportionate amounts of glycerol and liquid culture could affect the hardiness of the bacteria and reduce the amount of time it’s able to survive in cold storage.",
        "If you’re using a glycerol solution with a lower concentration, you’ll need to adjust the quantity of the bacterial culture accordingly.",
        "Consult the literature relating to the exact strain you’re storing for more information.",
        "Place the lid on the tube.",
        "Screw the lid into place, or push down until you hear a soft click if you’re using a snap top tube.",
        "Confirm that the lid is secure before moving on.",
        "Shake the tube gently to mix the bacterial culture and glycerol.",
        "Whisk the tube back and forth a few times until both liquids are evenly distributed.",
        "At this point, the bacterial cells will slowly begin to absorb the glycerol solution, which will stabilize and protect the cell membrane from deterioration and temperature-related damage.",
        "Keep your thumb pressed firmly against the lid of the microfuge tube while shaking to make sure it doesn’t come loose.",
        "Storing and Reviving Bacterial Cultures Label the bacterial sample.",
        "Write the name of the culture on a small test tube label or strip of masking tape and stick it to the microfuge tube where it will be plainly visible.",
        "You can also jot the bacteria’s classification info directly onto the lid using a felt-tipped marker.",
        "Be sure to also record any other information that may prove useful during analysis, such as the exact strain of the sample or its origin.",
        "Labeling your sample containers is an indispensable step in the collection process, as it enables you to keep track of their contents as they’re shuffled around in and out of storage.",
        "Freeze the sample at −80 °C (−112 °F).",
        "Place the labelled sample in an supercooled laboratory freezer set to a constant temperature of −80 °C (−112 °F).",
        "When kept under these conditions, the bacterial culture will stay viable for multiple years.",
        "It’s critical that the temperature of the freezer remain fixed at −80 °C (−112 °F).",
        "If it’s set any warmer, the preserved bacteria may die.",
        "Scrape up a small amount of frozen bacteria to prepare it for analysis.",
        "When it comes time to revive your sample, remove the microfuge tube from the freezer and open the lid.",
        "Use a sterile inoculation loop, toothpick, or pipette tip to collect a small amount of frozen material from the top of the sample and streak the bacteria onto an LB agar plate for examination or testing.",
        "Be careful not to let the bacteria scraping thaw.",
        "It may help to keep the stock tube on dry ice until you’ve completed your tests.",
        "Only pull your sample out of the freezer when absolutely necessary.",
        "Repeated thawing and refreezing will decrease its lifespan considerably."
    ]
}