{
    "title": "How to Measure Wrist Size",
    "url": "https://www.wikihow.com/Measure-Wrist-Size",
    "category_hierarchy": [
        "Personal Care and Style",
        "Jewelry",
        "Watches"
    ],
    "methods": [
        {
            "name": "Measuring for a Watch or Bracelet",
            "steps": [
                {
                    "headline": "Find your wrist circumference if you’re measuring for a watch or standard bracelet.",
                    "description": "Standard link watches and bracelets wrap completely around your wrist, so take the circumference measurement when you need to find the correct size. Choose the spot on your wrist where you normally would put your jewelry so you can take an accurate measurement, which tends to be around the widest part of your wrist or just below the bone next to your hand. If you’re measuring for a heart rate monitor, take the measurement about ⁄2–⁄4 in (1.3–1.9 cm) up from your wrist bone so you can get the most accurate heart rate readings."
                },
                {
                    "headline": "Measure the width of your wrist for an open loop bracelet.",
                    "description": "Open loop bracelets have a gap in them so you can slide the bracelet over your wrist. Choose the widest spot on your wrist, which is usually where you feel the knobby bones on either side of your arm. When you measure for an open loop bracelet, you only need to measure the width from one side of your wrist to the other."
                },
                {
                    "headline": "Measure around your knuckles for closed loop bangles.",
                    "description": "Closed loop bangles have a rigid shape and must slide over your hand when you put them on. If you’re measuring your wrist to find the right bangle size, then hold your hand in front of you with your palm face up. Move your thumb to touch the tip of your pinky so your hand is the same shape as it would be when you put on a bangle. Find the circumference of your hand around the knuckles. Be careful not to move your pinky or else you’ll have an inaccurate measurement."
                },
                {
                    "headline": "Wrap a string around your wrist or hand depending on what jewelry you’re measuring for.",
                    "description": "Use a piece of string that’s about 1 foot (30 cm) long so there’s enough excess to wrap around your wrist. Lay the string on a flat surface so it’s straight and set your wrist on top of it so your palm is face up. Wrap the ends over your wrist so it’s snug against your skin and so it overlaps in the middle. If you’re measuring your wrist width for an open loop bracelet, then lay the string on top of your wrist so the end starts on the knobby bone on one side of your wrist and extends to the other. If you’re measuring for a closed loop bangle, start the string on top of your knuckles and wrap it around your hand so it goes over the base of your thumb. You can also use a flexible measuring tape to find your wrist size if you have one.Tip: If you don’t have a string, you can also cut a ⁄2 in (1.3 cm) wide strip of paper to wrap around your wrist instead. Some websites offer printable rulers so you can see the measurement when you wrap it around your wrist."
                },
                {
                    "headline": "Mark a point on the string where it overlaps on your wrist.",
                    "description": "Make sure the string fits snugly against your skin before you make your mark. Use a marker to draw dots on the string where it overlaps itself. Make sure to mark both ends of the string so you can take an accurate measurement. If you’re using a flexible measuring tape, look what number lines up with the 0 end. If you’re measuring wrist width, mark the string where it touches the knobby bone on the inside of your arm."
                },
                {
                    "headline": "Hold the string against a ruler to find the measurement.",
                    "description": "Stretch out the string so it’s straight again and place it next to a ruler. Line up one of the marks you made on the string with the end of the ruler, and find the distance to your second mark. Write down your measurement so you don’t forget it. You can also use a tape measure if you don’t have a ruler."
                },
                {
                    "headline": "Add ⁄2 in (1.3 cm) to the length so your jewelry isn’t too tight.",
                    "description": "Bracelets or watches can get uncomfortable when you wear them if they’re too tight. Put an additional ⁄2 in (1.3 cm) to the measurement you found so the watch or bracelet fits looser. For example, if your wrist circumference was 5 ⁄2 inches (14 cm), then the final measurement will be 6 inches (15 cm). Don’t add anything to your measurement if you’re measuring for a heart rate monitor since it needs to be snug on your skin to get an accurate reading."
                }
            ]
        },
        {
            "name": "Finding Your Body Frame Size",
            "steps": [
                {
                    "headline": "Measure your wrist circumference just above the bone.",
                    "description": "Feel your wrist to locate the knobby bones on either side of your arm and place your string on the side just above it. Wrap the string around your wrist until it’s snug and mark where it overlaps the end. Straighten out the string and hold it against a ruler to find your measurement. Write the measurement down so you don’t forget. Don’t add any additional length to your measurement. You can also use a flexible tape measure if you have one. Look where the tape overlaps the 0 mark at the end to record your measurement."
                },
                {
                    "headline": "Find your height using a tape measure or ruler.",
                    "description": "Stand straight up with your back against a wall and look straight ahead. Keep your feet flat and together so your heels touch the wall as well. Have a helper mark your height against the wall so it lines up with the top of your head. Step away from the wall and use a tape measure from the floor to the mark to find your height. Make sure you’re standing on a hard floor rather than carpet since it could affect your height measurement.Tip: Don’t include your hair when you take the height measurement. Instead, end your measurement at the top of your skull."
                },
                {
                    "headline": "Compare your wrist measurement to your height using a body frame size chart.",
                    "description": "Look for a body frame size chart online and find your height within the ranges. Then compare your wrist size to your height to find if you have a small, medium, or large frame. For example, if you’re a woman between 62–65 inches (160–170 cm) tall, you have a small frame if your wrist is smaller than 6 inches (15 cm), a medium frame if it’s between 6–6 ⁄4 inches (15–16 cm), and a large frame if it’s larger than 6 ⁄4 inches (16 cm). You can find a body frame size chart here: https://medlineplus.gov/ency/imagepages/17182.htm. Talk to your primary care provider about what your frame size means for your ideal weight or body mass index."
                }
            ]
        }
    ],
    "tyn": [
        "Measuring for a Watch or Bracelet",
        "String",
        "Marker",
        "Ruler",
        "Finding Your Body Frame Size",
        "String or flexible tape measure"
    ],
    "text": " Measuring for a Watch or Bracelet Find your wrist circumference if you’re measuring for a watch or standard bracelet. Standard link watches and bracelets wrap completely around your wrist, so take the circumference measurement when you need to find the correct size. Choose the spot on your wrist where you normally would put your jewelry so you can take an accurate measurement, which tends to be around the widest part of your wrist or just below the bone next to your hand. If you’re measuring for a heart rate monitor, take the measurement about ⁄2–⁄4 in (1.3–1.9 cm) up from your wrist bone so you can get the most accurate heart rate readings. Measure the width of your wrist for an open loop bracelet. Open loop bracelets have a gap in them so you can slide the bracelet over your wrist. Choose the widest spot on your wrist, which is usually where you feel the knobby bones on either side of your arm. When you measure for an open loop bracelet, you only need to measure the width from one side of your wrist to the other. Measure around your knuckles for closed loop bangles. Closed loop bangles have a rigid shape and must slide over your hand when you put them on. If you’re measuring your wrist to find the right bangle size, then hold your hand in front of you with your palm face up. Move your thumb to touch the tip of your pinky so your hand is the same shape as it would be when you put on a bangle. Find the circumference of your hand around the knuckles. Be careful not to move your pinky or else you’ll have an inaccurate measurement. Wrap a string around your wrist or hand depending on what jewelry you’re measuring for. Use a piece of string that’s about 1 foot (30 cm) long so there’s enough excess to wrap around your wrist. Lay the string on a flat surface so it’s straight and set your wrist on top of it so your palm is face up. Wrap the ends over your wrist so it’s snug against your skin and so it overlaps in the middle. If you’re measuring your wrist width for an open loop bracelet, then lay the string on top of your wrist so the end starts on the knobby bone on one side of your wrist and extends to the other. If you’re measuring for a closed loop bangle, start the string on top of your knuckles and wrap it around your hand so it goes over the base of your thumb. You can also use a flexible measuring tape to find your wrist size if you have one.Tip: If you don’t have a string, you can also cut a ⁄2 in (1.3 cm) wide strip of paper to wrap around your wrist instead. Some websites offer printable rulers so you can see the measurement when you wrap it around your wrist. Mark a point on the string where it overlaps on your wrist. Make sure the string fits snugly against your skin before you make your mark. Use a marker to draw dots on the string where it overlaps itself. Make sure to mark both ends of the string so you can take an accurate measurement. If you’re using a flexible measuring tape, look what number lines up with the 0 end. If you’re measuring wrist width, mark the string where it touches the knobby bone on the inside of your arm. Hold the string against a ruler to find the measurement. Stretch out the string so it’s straight again and place it next to a ruler. Line up one of the marks you made on the string with the end of the ruler, and find the distance to your second mark. Write down your measurement so you don’t forget it. You can also use a tape measure if you don’t have a ruler. Add ⁄2 in (1.3 cm) to the length so your jewelry isn’t too tight. Bracelets or watches can get uncomfortable when you wear them if they’re too tight. Put an additional ⁄2 in (1.3 cm) to the measurement you found so the watch or bracelet fits looser. For example, if your wrist circumference was 5 ⁄2 inches (14 cm), then the final measurement will be 6 inches (15 cm). Don’t add anything to your measurement if you’re measuring for a heart rate monitor since it needs to be snug on your skin to get an accurate reading. Finding Your Body Frame Size Measure your wrist circumference just above the bone. Feel your wrist to locate the knobby bones on either side of your arm and place your string on the side just above it. Wrap the string around your wrist until it’s snug and mark where it overlaps the end. Straighten out the string and hold it against a ruler to find your measurement. Write the measurement down so you don’t forget. Don’t add any additional length to your measurement. You can also use a flexible tape measure if you have one. Look where the tape overlaps the 0 mark at the end to record your measurement. Find your height using a tape measure or ruler. Stand straight up with your back against a wall and look straight ahead. Keep your feet flat and together so your heels touch the wall as well. Have a helper mark your height against the wall so it lines up with the top of your head. Step away from the wall and use a tape measure from the floor to the mark to find your height. Make sure you’re standing on a hard floor rather than carpet since it could affect your height measurement.Tip: Don’t include your hair when you take the height measurement. Instead, end your measurement at the top of your skull. Compare your wrist measurement to your height using a body frame size chart. Look for a body frame size chart online and find your height within the ranges. Then compare your wrist size to your height to find if you have a small, medium, or large frame. For example, if you’re a woman between 62–65 inches (160–170 cm) tall, you have a small frame if your wrist is smaller than 6 inches (15 cm), a medium frame if it’s between 6–6 ⁄4 inches (15–16 cm), and a large frame if it’s larger than 6 ⁄4 inches (16 cm). You can find a body frame size chart here: https://medlineplus.gov/ency/imagepages/17182.htm. Talk to your primary care provider about what your frame size means for your ideal weight or body mass index.",
    "sentences": [
        " Measuring for a Watch or Bracelet Find your wrist circumference if you’re measuring for a watch or standard bracelet.",
        "Standard link watches and bracelets wrap completely around your wrist, so take the circumference measurement when you need to find the correct size.",
        "Choose the spot on your wrist where you normally would put your jewelry so you can take an accurate measurement, which tends to be around the widest part of your wrist or just below the bone next to your hand.",
        "If you’re measuring for a heart rate monitor, take the measurement about ⁄2–⁄4 in (1.3–1.9 cm) up from your wrist bone so you can get the most accurate heart rate readings.",
        "Measure the width of your wrist for an open loop bracelet.",
        "Open loop bracelets have a gap in them so you can slide the bracelet over your wrist.",
        "Choose the widest spot on your wrist, which is usually where you feel the knobby bones on either side of your arm.",
        "When you measure for an open loop bracelet, you only need to measure the width from one side of your wrist to the other.",
        "Measure around your knuckles for closed loop bangles.",
        "Closed loop bangles have a rigid shape and must slide over your hand when you put them on.",
        "If you’re measuring your wrist to find the right bangle size, then hold your hand in front of you with your palm face up.",
        "Move your thumb to touch the tip of your pinky so your hand is the same shape as it would be when you put on a bangle.",
        "Find the circumference of your hand around the knuckles.",
        "Be careful not to move your pinky or else you’ll have an inaccurate measurement.",
        "Wrap a string around your wrist or hand depending on what jewelry you’re measuring for.",
        "Use a piece of string that’s about 1 foot (30 cm) long so there’s enough excess to wrap around your wrist.",
        "Lay the string on a flat surface so it’s straight and set your wrist on top of it so your palm is face up.",
        "Wrap the ends over your wrist so it’s snug against your skin and so it overlaps in the middle.",
        "If you’re measuring your wrist width for an open loop bracelet, then lay the string on top of your wrist so the end starts on the knobby bone on one side of your wrist and extends to the other.",
        "If you’re measuring for a closed loop bangle, start the string on top of your knuckles and wrap it around your hand so it goes over the base of your thumb.",
        "You can also use a flexible measuring tape to find your wrist size if you have one.Tip: If you don’t have a string, you can also cut a ⁄2 in (1.3 cm) wide strip of paper to wrap around your wrist instead.",
        "Some websites offer printable rulers so you can see the measurement when you wrap it around your wrist.",
        "Mark a point on the string where it overlaps on your wrist.",
        "Make sure the string fits snugly against your skin before you make your mark.",
        "Use a marker to draw dots on the string where it overlaps itself.",
        "Make sure to mark both ends of the string so you can take an accurate measurement.",
        "If you’re using a flexible measuring tape, look what number lines up with the 0 end.",
        "If you’re measuring wrist width, mark the string where it touches the knobby bone on the inside of your arm.",
        "Hold the string against a ruler to find the measurement.",
        "Stretch out the string so it’s straight again and place it next to a ruler.",
        "Line up one of the marks you made on the string with the end of the ruler, and find the distance to your second mark.",
        "Write down your measurement so you don’t forget it.",
        "You can also use a tape measure if you don’t have a ruler.",
        "Add ⁄2 in (1.3 cm) to the length so your jewelry isn’t too tight.",
        "Bracelets or watches can get uncomfortable when you wear them if they’re too tight.",
        "Put an additional ⁄2 in (1.3 cm) to the measurement you found so the watch or bracelet fits looser.",
        "For example, if your wrist circumference was 5 ⁄2 inches (14 cm), then the final measurement will be 6 inches (15 cm).",
        "Don’t add anything to your measurement if you’re measuring for a heart rate monitor since it needs to be snug on your skin to get an accurate reading.",
        "Finding Your Body Frame Size Measure your wrist circumference just above the bone.",
        "Feel your wrist to locate the knobby bones on either side of your arm and place your string on the side just above it.",
        "Wrap the string around your wrist until it’s snug and mark where it overlaps the end.",
        "Straighten out the string and hold it against a ruler to find your measurement.",
        "Write the measurement down so you don’t forget.",
        "Don’t add any additional length to your measurement.",
        "You can also use a flexible tape measure if you have one.",
        "Look where the tape overlaps the 0 mark at the end to record your measurement.",
        "Find your height using a tape measure or ruler.",
        "Stand straight up with your back against a wall and look straight ahead.",
        "Keep your feet flat and together so your heels touch the wall as well.",
        "Have a helper mark your height against the wall so it lines up with the top of your head.",
        "Step away from the wall and use a tape measure from the floor to the mark to find your height.",
        "Make sure you’re standing on a hard floor rather than carpet since it could affect your height measurement.Tip: Don’t include your hair when you take the height measurement.",
        "Instead, end your measurement at the top of your skull.",
        "Compare your wrist measurement to your height using a body frame size chart.",
        "Look for a body frame size chart online and find your height within the ranges.",
        "Then compare your wrist size to your height to find if you have a small, medium, or large frame.",
        "For example, if you’re a woman between 62–65 inches (160–170 cm) tall, you have a small frame if your wrist is smaller than 6 inches (15 cm), a medium frame if it’s between 6–6 ⁄4 inches (15–16 cm), and a large frame if it’s larger than 6 ⁄4 inches (16 cm).",
        "You can find a body frame size chart here: https://medlineplus.gov/ency/imagepages/17182.htm.",
        "Talk to your primary care provider about what your frame size means for your ideal weight or body mass index."
    ]
}