{
    "title": "How to Save Yourself at Jesus's Next Coming According to the Bible",
    "url": "https://www.wikihow.com/Save-Yourself-at-Jesus%27s-Next-Coming-According-to-the-Bible",
    "category_hierarchy": [
        "Philosophy and Religion",
        "Religion",
        "Christianity"
    ],
    "parts": [
        {
            "name": "Understanding the Day of the Judgement",
            "steps": [
                {
                    "headline": "Recognize what is eternal and what is temporary.",
                    "description": "God is eternal; anything that doesn't prepare you for God is temporary. Don't chase after temporary things that lead you away from God, e.g., filling all your time with TV and the Internet instead of spending an adequate amount of time praying or reading Scripture. Chasing pleasures gives temporary satisfaction. These are temporary because you don't feel as fulfilled by what you have and end up feeling dissatisfied and frustrated. On the other hand, if you rely on God for happiness by obeying Him, doing what is good and fair, and offering your heart, body, mind, and soul to the service of God, He will give you peace and satisfaction that keeps you content and wanting to serve more. \"Yes, joyful are those who live like this! Joyful indeed are those whose God is the Lord\" (Psalm 144:15). His gifts set you free and let you explore truth and love to their fullest. Such an experience means living a fuller life in the light and path of God. Know the nature of your current focus and identify the temptations that lead your mind and heart away from God. Once you identify those distractions, you can avoid them to begin living with God and following His chosen path for you. For example, if you get consumed by social media and neglect your faith because of it, look for ways to limit your social media use so that you give more time to God."
                },
                {
                    "headline": "Study Revelations.",
                    "description": "The book of Revelation from the New Testament talks about a series of events. John of Patmos was shown seven seals that will be opened before Jesus's final day of judgement. These seals discuss the events that God foretold. The predictions are alarming but true believers will be kept safe by Jesus. Revelation 6:1-17 and 8:1-5 describe the seven seals."
                },
                {
                    "headline": "Understand why there will be a Judgement Day.",
                    "description": "Many innocent ones have been suffering from slavery of various kinds like poverty, assault, abuse, etc. God wants an end to all the injustice done to His people in the hands of the evil. \"For God did not appoint us to suffer wrath but to receive salvation through our Lord Jesus Christ\" (1 Thessalonians 5:9). The Judgement Day will bring redemption and freedom from evil and death forever."
                },
                {
                    "headline": "Know what to expect after the Judgement.",
                    "description": "Those who worked against God and His people face inevitable damnation, unless they turned to Jesus before they die. Not only people who worked against God will face damnation - those who went through life \"on the fence\" can expect the same - as it says in Revelation 3:16 KJV: \"So then because thou art lukewarm, and neither cold nor hot, I will spue thee out of my mouth.\" God will live with humans in the new world. There will be no evil."
                }
            ]
        },
        {
            "name": "Learning From The Exodus",
            "steps": [
                {
                    "headline": "Avoid disobedience.",
                    "description": "Have good intentions and resolve to never sin again. Deuteronomy 34 prophesies that Moses led the Israelites to the Promised Land. He obeyed God, performed miracles and saved the chosen ones. However, he couldn't enter the Promised Land. The Israelites could have avoided distrusting God and making complaints against Him during the Exodus, which led to Moses losing his patience. Even when God sent food from heaven, they were not grateful. Moses dies before entering the Promised Land. According to Deuteronomy 32:51-52, God told Moses that neither he nor Aaron would see the Promised Land \"...because both of you broke faith with me in the presence of the Israelites at the waters of Meribah Kadesh in the Desert of Zin and because you did not uphold my holiness among the Israelites. Therefore, you will see the land only from a distance; you will not enter the land I am giving to the people of Israel.\" This refers to an incident during which Moses, in frustration at the Israelites, disobeyed God by bringing the people water in a way contrary to the instructions God provided. Do not have this happen to the next one who will be in charge of taking you to Jerusalem. Make up your mind to prepare for and face the troubles that may occur during the present exodus."
                },
                {
                    "headline": "Ponder over the life of Moses.",
                    "description": "Moses was separated from his family. Exodus 2 narrates that he was raised by his own mother in Pharaoh's palace which might have been the most unsafe place for him had they known that he was an Israelite. However, he gave up all the luxuries of the palace because he was moved by the plight of Israelites."
                },
                {
                    "headline": "Adjust to your circumstances.",
                    "description": "Moses obeyed the word of the Lord and went through hardships. The very people he was helping in the Exodus were in turn constantly hurting him through disobedience, grumbling, and more.. Follow the word of the Lord and help your loved ones do so, too. For example, the Bible says in Exodus 17:2-3, \"So the people contended with Moses, and they said, 'Give us water to drink!' Moses said to them, 'Why do you contend with me? Why do you test the Lord?' But the people were very thirsty there for water, and they murmured against Moses and said, 'Why in the world did you bring us up from Egypt – to kill us and our children and our cattle with thirst?'\" Rather than trusting in God who delivered them out of captivity in Egypt, and trusting Moses to continue leading them, the people lacked faith and were ready to turn against both Moses and God."
                },
                {
                    "headline": "Know that only two lived to see the Promised Land.",
                    "description": "Don't take it for granted. Of all the people who left Egypt, only two survived the years of journey. God loved all. But not all survived. Decide not to take salvation lightly. Just as the believers will be saved or forgiven, Romans 2:6-11 explains that those who do wrong and speak badly about God will face what they call upon themselves. Replace negativity with love. 1 Corinthians 13:4-8 says, \"Love endures with patience and serenity, love is kind and thoughtful, and is not jealous or envious; love does not brag and is not proud or arrogant. It is not rude; it is not self-seeking, it is not provoked [nor overly sensitive and easily angered]; it does not take into account a wrong endured\". If you try freeing your mind of hurtful emotions, towards yourself or others, you may still feel tempted in the future. Try to be more loving, so you don't feel well if you find yourself being hateful or envious. \"If I speak in the tongues of men and of angels, but have not love, I am only a resounding gong or a clanging cymbal\" (1 Corinthians 13:1). God likes genuine actions. Merely following the herd, without having an honest relationship with Jesus apart from the world and gatherings, may not reach Him. Merely doing it like a regular, traditional practice of fasting, praying, and obeying while lacking a personal connection may not please Him. Think of how you would like your true friends to know you. Feel it and try to know who God is, and demonstrate truthfulness in your worship of Him by worshiping God with love."
                }
            ]
        },
        {
            "name": "Mending Your Ways",
            "steps": [
                {
                    "headline": "Read the Bible.",
                    "description": "In particular, peruse the end time prophecy in the Bible. Jesus' coming is the Last Judgement Day, and on that day, He will judge all the people. Just like He ascended to His Heavenly abode on the clouds, He will return this day on the clouds. No one knows the exact date of His return. As Matthew 24:36 says, \"But about that day or hour no one knows, not even the angels in heaven, nor the Son, but only the Father.\""
                },
                {
                    "headline": "Live modestly.",
                    "description": "Humble yourself and seek not worldly pleasures more than spiritual growth. Seek silence and calm and get used to making efforts for peace that may get you spiritually connected to Jesus deeper. Let this connection help you learn living right, according to Him. Many pleasures and comforts make you overlook God's message. Balance your societal role so you don't obey the society, but have the power to say 'No' when you must. Keep yourself occupied and directed towards productive work instead of being idle. An idle mind is a devil's workshop. Appreciate your work and draw a line between productivity and greed. Man has gone far and wide in the stream of science, music, literature, research, etc. Believe in your ways. Make use of your skills and build something worthwhile with your resources."
                },
                {
                    "headline": "Put your field of work to use.",
                    "description": "For example, if you are a student, learn more about God through related study material. Ask questions and use your sense of reason to understand more about God's ways. If you are a professional employee, on the other hand, be a good employee and don't support fraudulent means to gain profit. Exercise self-control and enjoy the little joys of your labour. If you are a housewife, teach your family examples from the Bible about how your family may apply God's commandments in their actions. Do not consider yourself less important. Empower yourself and help others. God sees it all and rewards accordingly."
                },
                {
                    "headline": "Steer clear of conspiracy theories.",
                    "description": "There are many theories that try to confuse believers. These views may stir up demonic thoughts that may lead to chaos and confusion, and could also weaken the body, soul, and mind. Pay no heed to such ideas. Walk on the right path without getting distracted by provocations. If something bothers you, ask God for answers and be watchful of what you find. For example, some may claim that Jesus is the same as Zeus or Horus. Doing a more in-depth study of these stories and histories, however, can reveal why these misconceptions are false."
                },
                {
                    "headline": "Obey the law.",
                    "description": "God follows the law. He died on the cross for a price to be paid for saving us. Follow the law and take pride in doing the right things, whether it be at school, work, or home. The law defines each action and its consequences. \"Blessed are the pure in heart, for they shall see God\" (Matthew 5:8). Do good deeds, \"...and is well known for her good deeds, such as bringing up children, showing hospitality, washing the feet of the Lord’s people, helping those in trouble and devoting herself to all kinds of good deeds\" (1 Timothy 5:10). Our good actions work for us while the bad ones get us judged, accordingly."
                },
                {
                    "headline": "Address your fears.",
                    "description": "Feeling fear is not evil. Acting evil because you are scared is. Do not run away from fears. Fear is unavoidable. It is so among the holy as well. There were many during biblical times who were shrouded with fear while following God's command. Forgive yourself and face your fears. Pray to God for strength that you may overcome jealousy, envy, gluttony, plotting against the good, surrendering to something blindly, becoming a slave of certain luxuries, etc. When Joseph got scared of hearing the conception of Virgin Mary, an angel strengthened him to take care of Mary and God's child, Yehoshua/Jesus (Matthew 1:18-25). The disciples got scared of Jesus when they saw Him after He rose from the dead (Luke 24:36-38). Moses doubted his communication skills when ordered by the Lord to go to Egypt to demand that the Israelites be released from slavery. So God allowed him to take along his brother Aaron, as a spokesperson (Exodus 4:10-16). Peter abandoned Jesus when he was questioned by the soldiers who came to arrest Him (Luke 22:54-62). Fear is a possibility. But it is neither the end nor a deciding factor. Ask God to help you when fear tries your faith. Affirm your faith in the Lord and fight your demons. The Lord will keep you going. Don't fear your challenges. It might be about facing a school or office bully, being left out, or missing out on the earthly pleasures in order to follow God. When you make a decision to be righteous, you will understand whether the chase to be popular was more fulfilling or following Jesus."
                },
                {
                    "headline": "Don't try to fool the righteous deliberately.",
                    "description": "Don't think of asking believers twisted questions just so you catch them without an answer. And don't talk unnecessarily or without knowing what you are talking about. On the mountain when Peter saw Jesus talking to Moses's spirit, he didn't know what he was saying when he expressed his desire to build a house for the Lord (Matthew 17:1–13). The disciples didn't know about Jesus's crucifixion and being betrayed by one among them until their last supper. They were told about it at the table, where they questioned Jesus about it (Matthew 26:17-30). There is a way, a path and a light to follow. Walk on it diligently and believe that it will guide you."
                },
                {
                    "headline": "Question yourself.",
                    "description": "Ask yourself if you believe that Jesus died for your sins? \"Greater love has no one than this to lay down one’s life for one’s friends\" (John 15:13). Be clear about your faith in His rising from the dead. Believe that He will come again to save you and believe in heaven. God will fulfill His promise and give you a free and eternal life. Jesus and His disciples were judged and killed. Many people believed and accepted them when they were gone. Ask God to help you believe in your redemption. You may still be in doubt. You may be of any religion, but God does not distinguish between people. He is waiting to accept all who seek Him. He turned Saul to Paul, from killing God's people to protecting them (Acts 9). He can turn anyone else to His ways as He pleases. \"He will fight all the beasts and conquer over them forever\" (Revelation 19:11–21). Expect peace, holiness and love like never before in the new world thereafter (Revelation 21:2–4)."
                },
                {
                    "headline": "Accept the forerunner.",
                    "description": "The previous forerunner, John the Baptist, Jesus's cousin, spoke the truth and lived a simple life. He baptised the believers in the river Jordan along with Jesus. Accept the next forerunner and prepare to help them as they announce Jesus' next coming. Believe that since God appointed them, they will take the believers to safety. “For then there will be great tribulation, such as has not been since the beginning of the world until this time, no, nor ever shall be. And unless those days were shortened, no flesh would be saved; but for the elect’s sake those days will be shortened” (Matthew 24:21-22). Answer in the affirmative when asked about your faith in Jesus and His death on the cross for you. Affirm your faith regarding your belief in His next coming. Say that you believe that He will come again to save you."
                },
                {
                    "headline": "Be righteous and follow the law.",
                    "description": "Man changes his mind every so often. An atheist may become a theist. When creation changes its course, the Creator does it too. The law keeps working itself out. When you break the law, you are judged. When you stop doing wrong and do good instead, the judgement changes accordingly. Submit to God in your own words. Speak with God and entrust your life to Him. Do not worry, and instead, rely on God's word to save you. Ask God what you should be doing to believe in and understand His word. Ask Him to guide you about what you need to do and how you need to think about saving yourself and your loved ones. Try to submit to God and be an instrument of God. Fulfill your responsibilities daily. Follow the Ten Commandments. Remember, also, what Jesus said in Matthew 22:36-40 about the greatest commandment: \"'Love the Lord your God with all your heart and with all your soul and with all your mind.' This is the first and greatest commandment. And the second is like it: 'Love your neighbor as yourself.' All the Law and the Prophets hang on these two commandments\""
                },
                {
                    "headline": "Do not be self-righteous.",
                    "description": "We've learned the importance of nature the hard way, by making immense progress and ending up at a dead end. Endless materialistic progress led us to know that we need to take measures to reduce what is left, like electronic waste and carbon footprint. This shows that God created everything with a balance."
                },
                {
                    "headline": "Avoid tempting situations.",
                    "description": "Evil is working hard to make others go against righteousness and humanity. Those who welcome temptations in the form of anger, lust, greed, chaos, or confusion draw away from each other and from the Lord. Some call this force demonic and some chaotic. Jesus will battle and defeat this evil that is against us. Control your desires to do unhealthy activities like smoking, luring others into doing wrong and envying others. Don't give undue importance to flirting, flaunting or popularity as you age. Ask God to help you understand your confusion about various situations in life."
                },
                {
                    "headline": "Do God's work tirelessly.",
                    "description": "As you toil in obedience to God, do not complain or malign your labour. Instead, allow yourself to be fully engrossed in Him and deny shifting focus to relieve this stress. Stress of the world and money causes worry of the wrong kind. Godly pain only heals you."
                }
            ]
        },
        {
            "name": "Being Righteous",
            "steps": [
                {
                    "headline": "Take up a supportive attitude.",
                    "description": "Aside from genuinely being supportive of others, one may never turn from the so-called human nature of deceit and selfishness. Accept and support those who seek your help to walk on the right path. Jesus knows your pain and the conflict in your heart. He will make sure that you and your loved ones are okay. Avoid teaching others in a way that would lead to conflict with them. Patiently hold back your judgements, and let go of the those who adamantly refuse help lest you aggravate their anger. Help if you are asked for it and be kind when approached by someone for guidance; this is the best time to bring about a change. Do the good that you know you should do. Don't be indifferent. As James 4:17 states, \"If anyone, then, knows the good they ought to do and doesn't do it, it is sin for them.\" Serve man to serve God: \"The greatest among you will be your servant\" (Matthew 23:11). In doing so, you'll be following the example Jesus gave to us: \"For even the Son of Man did not come to be served, but to serve, and to give his life as a ransom for many\" (Mark 10:45). Know that you are not worthless, and don't give up on doing the good work you've been called to do. As stated in 2 Chronicles 15:7, \"But as for you, be strong and do not give up, for your work will be rewarded.\""
                },
                {
                    "headline": "Control your urge to curse others.",
                    "description": "You may come across those who don't accept Christianity or practice a different faith, but do not cause anger or guilt when you talk to them about these differences in belief. Do not aggressively question those who do not seem to care about God. Let them be, and instead, guide them only if they ask you for help. Do not look down on others or say that they will suffer. Let God be the judge. Don't show a hateful attitude while speaking about the Lord. Remember that John the Baptist was beheaded because he spoke outwardly of evildoers. While John the Baptist was correct in calling sinners to repent, this event illustrates that one can be directed on the right path but never forced. Be accepting of those who disagree with you, yet honestly seek the truth and don't persecute you. The Lord said in Mark 9:38-42, \"Whoever is not against us is for us.\". So, be accepting."
                },
                {
                    "headline": "Don't justify your loved ones' mistakes.",
                    "description": "Feeling pity at the wrong time can encourage someone to continue practicing evil ways, leading to judgement both on yourself and others. Allow yourself to objectively discern good from evil. If you constantly support those who do wrong, you encourage wrongdoings. Do not fall prey to such a bait and practice self-control. Hold back your protectiveness as it won't prevent God's law from applying to them. Help when you can. Don't be late about helping when you see something that needs attention. A stitch in time saves nine. Do what you must but don't force your knowledge on others. Allow others to face the consequences of their misdeeds, especially if they are unresponsive to your help."
                },
                {
                    "headline": "Help others through prayer.",
                    "description": "Not everyone is aware of Jesus's word. Have faith that you will discern between good and evil. Pray for non-believers, the doubtful and those who are otherwise away from God. Pray for the saints and all those who are toiling for deliverance. Pray for the dead who died in faith. Pray for those who are dismayed. Indeed, the waiting may have withered some souls and disappointed them. Pray for the unaware, children, and those who have no one to pray for them. Include the lonely and lost in your prayers. Pray for the eternal kingdom of the Lord. Pray the 'Our Father' as Jesus instructed, and pray in this way because Jesus died for us. Pray for an end to the killing of those who are righteous."
                }
            ]
        },
        {
            "name": "Loving Jesus",
            "steps": [
                {
                    "headline": "Love God.",
                    "description": "Know the power of love, and know that God is love. Connect with the Lord and look forward to meeting your Saviour. Just like you feel hurt when you feel Jesus didn’t answer your prayers and He has forgotten you, Jesus feels good or bad, happy and sad based on our thoughts and actions. Be eager to meet God and think of God daily so you feel emotionally connected to Him. Just because Jesus is God, does not mean He is emotionless. He can feel happy when you love Him; He can feel upset if you try to escape or fight Him. As 1 Corinthians 13:13 states, \"And now these three remain: faith, hope and love. But the greatest of these is love.\" Love is the greatest of these three theological virtues. Practice loving God through devotion to Him and by loving others."
                },
                {
                    "headline": "Hold high Jesus's path.",
                    "description": "Jesus, being God, was powerful enough to turn away from crucifixion. John 18:37 reads, “The reason I was born and came into the world is to testify to the truth.” He gave His life to prove His love. Recognize this as the gift that it is, and follow His example by devoting your life to truth and love."
                },
                {
                    "headline": "Prove your love to Jesus.",
                    "description": "Obey God's laws and instructions in gratitude and love for Him, and regularly remind yourself of the hope of Heaven. As Matthew 5:17-18 says, \"Do not think that I have come to abolish the Law or the Prophets; I have not come to abolish them but to fulfill them. For truly I tell you, until heaven and earth disappear, not the smallest letter, not the least stroke of a pen, will by any means disappear from the Law until everything is accomplished.\" Plan and visualize a better tomorrow and be hopeful of what He plans for your redemption. Prepare for a good world and see yourself and your loved ones living a good life. Whenever you are very disappointed in your present life, remind yourself that God has planned an eternal life without evil. Anticipate such a life so that you will be driven towards realising and accepting it with grace when it happens. Begin living your present life with your eyes set on the eternal life to come, and do your best to live out heavenly virtues in your present life with the help of God's grace."
                },
                {
                    "headline": "Praise and thank Him regularly.",
                    "description": "Recognize that God ultimately desires your good; in particular, He desires your eternal salvation. \"'For I know the plans I have for you,' declares the LORD, 'plans to prosper you and not to harm you, plans to give you hope and a future'\" (Jeremiah 29:11). Regularly praise God for His goodness, and thank Him for all the good He's working in your life. Prepare for holy miracles, and when you witness those miracles, bow down and show your reverence. Praise Him every day, and not only when you witness a miracle. Thank Him for all you have and be grateful to Him. When you see that the word is getting fulfilled, praise the Lord."
                }
            ]
        }
    ],
    "tyn": [
        "The Holy Bible."
    ],
    "text": " Understanding the Day of the Judgement Recognize what is eternal and what is temporary. God is eternal; anything that doesn't prepare you for God is temporary. Don't chase after temporary things that lead you away from God, e.g., filling all your time with TV and the Internet instead of spending an adequate amount of time praying or reading Scripture. Chasing pleasures gives temporary satisfaction. These are temporary because you don't feel as fulfilled by what you have and end up feeling dissatisfied and frustrated. On the other hand, if you rely on God for happiness by obeying Him, doing what is good and fair, and offering your heart, body, mind, and soul to the service of God, He will give you peace and satisfaction that keeps you content and wanting to serve more. \"Yes, joyful are those who live like this! Joyful indeed are those whose God is the Lord\" (Psalm 144:15). His gifts set you free and let you explore truth and love to their fullest. Such an experience means living a fuller life in the light and path of God. Know the nature of your current focus and identify the temptations that lead your mind and heart away from God. Once you identify those distractions, you can avoid them to begin living with God and following His chosen path for you. For example, if you get consumed by social media and neglect your faith because of it, look for ways to limit your social media use so that you give more time to God. Study Revelations. The book of Revelation from the New Testament talks about a series of events. John of Patmos was shown seven seals that will be opened before Jesus's final day of judgement. These seals discuss the events that God foretold. The predictions are alarming but true believers will be kept safe by Jesus. Revelation 6:1-17 and 8:1-5 describe the seven seals. Understand why there will be a Judgement Day. Many innocent ones have been suffering from slavery of various kinds like poverty, assault, abuse, etc. God wants an end to all the injustice done to His people in the hands of the evil. \"For God did not appoint us to suffer wrath but to receive salvation through our Lord Jesus Christ\" (1 Thessalonians 5:9). The Judgement Day will bring redemption and freedom from evil and death forever. Know what to expect after the Judgement. Those who worked against God and His people face inevitable damnation, unless they turned to Jesus before they die. Not only people who worked against God will face damnation - those who went through life \"on the fence\" can expect the same - as it says in Revelation 3:16 KJV: \"So then because thou art lukewarm, and neither cold nor hot, I will spue thee out of my mouth.\" God will live with humans in the new world. There will be no evil. Learning From The Exodus Avoid disobedience. Have good intentions and resolve to never sin again. Deuteronomy 34 prophesies that Moses led the Israelites to the Promised Land. He obeyed God, performed miracles and saved the chosen ones. However, he couldn't enter the Promised Land. The Israelites could have avoided distrusting God and making complaints against Him during the Exodus, which led to Moses losing his patience. Even when God sent food from heaven, they were not grateful. Moses dies before entering the Promised Land. According to Deuteronomy 32:51-52, God told Moses that neither he nor Aaron would see the Promised Land \"...because both of you broke faith with me in the presence of the Israelites at the waters of Meribah Kadesh in the Desert of Zin and because you did not uphold my holiness among the Israelites. Therefore, you will see the land only from a distance; you will not enter the land I am giving to the people of Israel.\" This refers to an incident during which Moses, in frustration at the Israelites, disobeyed God by bringing the people water in a way contrary to the instructions God provided. Do not have this happen to the next one who will be in charge of taking you to Jerusalem. Make up your mind to prepare for and face the troubles that may occur during the present exodus. Ponder over the life of Moses. Moses was separated from his family. Exodus 2 narrates that he was raised by his own mother in Pharaoh's palace which might have been the most unsafe place for him had they known that he was an Israelite. However, he gave up all the luxuries of the palace because he was moved by the plight of Israelites. Adjust to your circumstances. Moses obeyed the word of the Lord and went through hardships. The very people he was helping in the Exodus were in turn constantly hurting him through disobedience, grumbling, and more.. Follow the word of the Lord and help your loved ones do so, too. For example, the Bible says in Exodus 17:2-3, \"So the people contended with Moses, and they said, 'Give us water to drink!' Moses said to them, 'Why do you contend with me? Why do you test the Lord?' But the people were very thirsty there for water, and they murmured against Moses and said, 'Why in the world did you bring us up from Egypt – to kill us and our children and our cattle with thirst?'\" Rather than trusting in God who delivered them out of captivity in Egypt, and trusting Moses to continue leading them, the people lacked faith and were ready to turn against both Moses and God. Know that only two lived to see the Promised Land. Don't take it for granted. Of all the people who left Egypt, only two survived the years of journey. God loved all. But not all survived. Decide not to take salvation lightly. Just as the believers will be saved or forgiven, Romans 2:6-11 explains that those who do wrong and speak badly about God will face what they call upon themselves. Replace negativity with love. 1 Corinthians 13:4-8 says, \"Love endures with patience and serenity, love is kind and thoughtful, and is not jealous or envious; love does not brag and is not proud or arrogant. It is not rude; it is not self-seeking, it is not provoked [nor overly sensitive and easily angered]; it does not take into account a wrong endured\". If you try freeing your mind of hurtful emotions, towards yourself or others, you may still feel tempted in the future. Try to be more loving, so you don't feel well if you find yourself being hateful or envious. \"If I speak in the tongues of men and of angels, but have not love, I am only a resounding gong or a clanging cymbal\" (1 Corinthians 13:1). God likes genuine actions. Merely following the herd, without having an honest relationship with Jesus apart from the world and gatherings, may not reach Him. Merely doing it like a regular, traditional practice of fasting, praying, and obeying while lacking a personal connection may not please Him. Think of how you would like your true friends to know you. Feel it and try to know who God is, and demonstrate truthfulness in your worship of Him by worshiping God with love. Mending Your Ways Read the Bible. In particular, peruse the end time prophecy in the Bible. Jesus' coming is the Last Judgement Day, and on that day, He will judge all the people. Just like He ascended to His Heavenly abode on the clouds, He will return this day on the clouds. No one knows the exact date of His return. As Matthew 24:36 says, \"But about that day or hour no one knows, not even the angels in heaven, nor the Son, but only the Father.\" Live modestly. Humble yourself and seek not worldly pleasures more than spiritual growth. Seek silence and calm and get used to making efforts for peace that may get you spiritually connected to Jesus deeper. Let this connection help you learn living right, according to Him. Many pleasures and comforts make you overlook God's message. Balance your societal role so you don't obey the society, but have the power to say 'No' when you must. Keep yourself occupied and directed towards productive work instead of being idle. An idle mind is a devil's workshop. Appreciate your work and draw a line between productivity and greed. Man has gone far and wide in the stream of science, music, literature, research, etc. Believe in your ways. Make use of your skills and build something worthwhile with your resources. Put your field of work to use. For example, if you are a student, learn more about God through related study material. Ask questions and use your sense of reason to understand more about God's ways. If you are a professional employee, on the other hand, be a good employee and don't support fraudulent means to gain profit. Exercise self-control and enjoy the little joys of your labour. If you are a housewife, teach your family examples from the Bible about how your family may apply God's commandments in their actions. Do not consider yourself less important. Empower yourself and help others. God sees it all and rewards accordingly. Steer clear of conspiracy theories. There are many theories that try to confuse believers. These views may stir up demonic thoughts that may lead to chaos and confusion, and could also weaken the body, soul, and mind. Pay no heed to such ideas. Walk on the right path without getting distracted by provocations. If something bothers you, ask God for answers and be watchful of what you find. For example, some may claim that Jesus is the same as Zeus or Horus. Doing a more in-depth study of these stories and histories, however, can reveal why these misconceptions are false. Obey the law. God follows the law. He died on the cross for a price to be paid for saving us. Follow the law and take pride in doing the right things, whether it be at school, work, or home. The law defines each action and its consequences. \"Blessed are the pure in heart, for they shall see God\" (Matthew 5:8). Do good deeds, \"...and is well known for her good deeds, such as bringing up children, showing hospitality, washing the feet of the Lord’s people, helping those in trouble and devoting herself to all kinds of good deeds\" (1 Timothy 5:10). Our good actions work for us while the bad ones get us judged, accordingly. Address your fears. Feeling fear is not evil. Acting evil because you are scared is. Do not run away from fears. Fear is unavoidable. It is so among the holy as well. There were many during biblical times who were shrouded with fear while following God's command. Forgive yourself and face your fears. Pray to God for strength that you may overcome jealousy, envy, gluttony, plotting against the good, surrendering to something blindly, becoming a slave of certain luxuries, etc. When Joseph got scared of hearing the conception of Virgin Mary, an angel strengthened him to take care of Mary and God's child, Yehoshua/Jesus (Matthew 1:18-25). The disciples got scared of Jesus when they saw Him after He rose from the dead (Luke 24:36-38). Moses doubted his communication skills when ordered by the Lord to go to Egypt to demand that the Israelites be released from slavery. So God allowed him to take along his brother Aaron, as a spokesperson (Exodus 4:10-16). Peter abandoned Jesus when he was questioned by the soldiers who came to arrest Him (Luke 22:54-62). Fear is a possibility. But it is neither the end nor a deciding factor. Ask God to help you when fear tries your faith. Affirm your faith in the Lord and fight your demons. The Lord will keep you going. Don't fear your challenges. It might be about facing a school or office bully, being left out, or missing out on the earthly pleasures in order to follow God. When you make a decision to be righteous, you will understand whether the chase to be popular was more fulfilling or following Jesus. Don't try to fool the righteous deliberately. Don't think of asking believers twisted questions just so you catch them without an answer. And don't talk unnecessarily or without knowing what you are talking about. On the mountain when Peter saw Jesus talking to Moses's spirit, he didn't know what he was saying when he expressed his desire to build a house for the Lord (Matthew 17:1–13). The disciples didn't know about Jesus's crucifixion and being betrayed by one among them until their last supper. They were told about it at the table, where they questioned Jesus about it (Matthew 26:17-30). There is a way, a path and a light to follow. Walk on it diligently and believe that it will guide you. Question yourself. Ask yourself if you believe that Jesus died for your sins? \"Greater love has no one than this to lay down one’s life for one’s friends\" (John 15:13). Be clear about your faith in His rising from the dead. Believe that He will come again to save you and believe in heaven. God will fulfill His promise and give you a free and eternal life. Jesus and His disciples were judged and killed. Many people believed and accepted them when they were gone. Ask God to help you believe in your redemption. You may still be in doubt. You may be of any religion, but God does not distinguish between people. He is waiting to accept all who seek Him. He turned Saul to Paul, from killing God's people to protecting them (Acts 9). He can turn anyone else to His ways as He pleases. \"He will fight all the beasts and conquer over them forever\" (Revelation 19:11–21). Expect peace, holiness and love like never before in the new world thereafter (Revelation 21:2–4). Accept the forerunner. The previous forerunner, John the Baptist, Jesus's cousin, spoke the truth and lived a simple life. He baptised the believers in the river Jordan along with Jesus. Accept the next forerunner and prepare to help them as they announce Jesus' next coming. Believe that since God appointed them, they will take the believers to safety. “For then there will be great tribulation, such as has not been since the beginning of the world until this time, no, nor ever shall be. And unless those days were shortened, no flesh would be saved; but for the elect’s sake those days will be shortened” (Matthew 24:21-22). Answer in the affirmative when asked about your faith in Jesus and His death on the cross for you. Affirm your faith regarding your belief in His next coming. Say that you believe that He will come again to save you. Be righteous and follow the law. Man changes his mind every so often. An atheist may become a theist. When creation changes its course, the Creator does it too. The law keeps working itself out. When you break the law, you are judged. When you stop doing wrong and do good instead, the judgement changes accordingly. Submit to God in your own words. Speak with God and entrust your life to Him. Do not worry, and instead, rely on God's word to save you. Ask God what you should be doing to believe in and understand His word. Ask Him to guide you about what you need to do and how you need to think about saving yourself and your loved ones. Try to submit to God and be an instrument of God. Fulfill your responsibilities daily. Follow the Ten Commandments. Remember, also, what Jesus said in Matthew 22:36-40 about the greatest commandment: \"'Love the Lord your God with all your heart and with all your soul and with all your mind.' This is the first and greatest commandment. And the second is like it: 'Love your neighbor as yourself.' All the Law and the Prophets hang on these two commandments\" Do not be self-righteous. We've learned the importance of nature the hard way, by making immense progress and ending up at a dead end. Endless materialistic progress led us to know that we need to take measures to reduce what is left, like electronic waste and carbon footprint. This shows that God created everything with a balance. Avoid tempting situations. Evil is working hard to make others go against righteousness and humanity. Those who welcome temptations in the form of anger, lust, greed, chaos, or confusion draw away from each other and from the Lord. Some call this force demonic and some chaotic. Jesus will battle and defeat this evil that is against us. Control your desires to do unhealthy activities like smoking, luring others into doing wrong and envying others. Don't give undue importance to flirting, flaunting or popularity as you age. Ask God to help you understand your confusion about various situations in life. Do God's work tirelessly. As you toil in obedience to God, do not complain or malign your labour. Instead, allow yourself to be fully engrossed in Him and deny shifting focus to relieve this stress. Stress of the world and money causes worry of the wrong kind. Godly pain only heals you. Being Righteous Take up a supportive attitude. Aside from genuinely being supportive of others, one may never turn from the so-called human nature of deceit and selfishness. Accept and support those who seek your help to walk on the right path. Jesus knows your pain and the conflict in your heart. He will make sure that you and your loved ones are okay. Avoid teaching others in a way that would lead to conflict with them. Patiently hold back your judgements, and let go of the those who adamantly refuse help lest you aggravate their anger. Help if you are asked for it and be kind when approached by someone for guidance; this is the best time to bring about a change. Do the good that you know you should do. Don't be indifferent. As James 4:17 states, \"If anyone, then, knows the good they ought to do and doesn't do it, it is sin for them.\" Serve man to serve God: \"The greatest among you will be your servant\" (Matthew 23:11). In doing so, you'll be following the example Jesus gave to us: \"For even the Son of Man did not come to be served, but to serve, and to give his life as a ransom for many\" (Mark 10:45). Know that you are not worthless, and don't give up on doing the good work you've been called to do. As stated in 2 Chronicles 15:7, \"But as for you, be strong and do not give up, for your work will be rewarded.\" Control your urge to curse others. You may come across those who don't accept Christianity or practice a different faith, but do not cause anger or guilt when you talk to them about these differences in belief. Do not aggressively question those who do not seem to care about God. Let them be, and instead, guide them only if they ask you for help. Do not look down on others or say that they will suffer. Let God be the judge. Don't show a hateful attitude while speaking about the Lord. Remember that John the Baptist was beheaded because he spoke outwardly of evildoers. While John the Baptist was correct in calling sinners to repent, this event illustrates that one can be directed on the right path but never forced. Be accepting of those who disagree with you, yet honestly seek the truth and don't persecute you. The Lord said in Mark 9:38-42, \"Whoever is not against us is for us.\". So, be accepting. Don't justify your loved ones' mistakes. Feeling pity at the wrong time can encourage someone to continue practicing evil ways, leading to judgement both on yourself and others. Allow yourself to objectively discern good from evil. If you constantly support those who do wrong, you encourage wrongdoings. Do not fall prey to such a bait and practice self-control. Hold back your protectiveness as it won't prevent God's law from applying to them. Help when you can. Don't be late about helping when you see something that needs attention. A stitch in time saves nine. Do what you must but don't force your knowledge on others. Allow others to face the consequences of their misdeeds, especially if they are unresponsive to your help. Help others through prayer. Not everyone is aware of Jesus's word. Have faith that you will discern between good and evil. Pray for non-believers, the doubtful and those who are otherwise away from God. Pray for the saints and all those who are toiling for deliverance. Pray for the dead who died in faith. Pray for those who are dismayed. Indeed, the waiting may have withered some souls and disappointed them. Pray for the unaware, children, and those who have no one to pray for them. Include the lonely and lost in your prayers. Pray for the eternal kingdom of the Lord. Pray the 'Our Father' as Jesus instructed, and pray in this way because Jesus died for us. Pray for an end to the killing of those who are righteous. Loving Jesus Love God. Know the power of love, and know that God is love. Connect with the Lord and look forward to meeting your Saviour. Just like you feel hurt when you feel Jesus didn’t answer your prayers and He has forgotten you, Jesus feels good or bad, happy and sad based on our thoughts and actions. Be eager to meet God and think of God daily so you feel emotionally connected to Him. Just because Jesus is God, does not mean He is emotionless. He can feel happy when you love Him; He can feel upset if you try to escape or fight Him. As 1 Corinthians 13:13 states, \"And now these three remain: faith, hope and love. But the greatest of these is love.\" Love is the greatest of these three theological virtues. Practice loving God through devotion to Him and by loving others. Hold high Jesus's path. Jesus, being God, was powerful enough to turn away from crucifixion. John 18:37 reads, “The reason I was born and came into the world is to testify to the truth.” He gave His life to prove His love. Recognize this as the gift that it is, and follow His example by devoting your life to truth and love. Prove your love to Jesus. Obey God's laws and instructions in gratitude and love for Him, and regularly remind yourself of the hope of Heaven. As Matthew 5:17-18 says, \"Do not think that I have come to abolish the Law or the Prophets; I have not come to abolish them but to fulfill them. For truly I tell you, until heaven and earth disappear, not the smallest letter, not the least stroke of a pen, will by any means disappear from the Law until everything is accomplished.\" Plan and visualize a better tomorrow and be hopeful of what He plans for your redemption. Prepare for a good world and see yourself and your loved ones living a good life. Whenever you are very disappointed in your present life, remind yourself that God has planned an eternal life without evil. Anticipate such a life so that you will be driven towards realising and accepting it with grace when it happens. Begin living your present life with your eyes set on the eternal life to come, and do your best to live out heavenly virtues in your present life with the help of God's grace. Praise and thank Him regularly. Recognize that God ultimately desires your good; in particular, He desires your eternal salvation. \"'For I know the plans I have for you,' declares the LORD, 'plans to prosper you and not to harm you, plans to give you hope and a future'\" (Jeremiah 29:11). Regularly praise God for His goodness, and thank Him for all the good He's working in your life. Prepare for holy miracles, and when you witness those miracles, bow down and show your reverence. Praise Him every day, and not only when you witness a miracle. Thank Him for all you have and be grateful to Him. When you see that the word is getting fulfilled, praise the Lord.",
    "sentences": [
        " Understanding the Day of the Judgement Recognize what is eternal and what is temporary.",
        "God is eternal; anything that doesn't prepare you for God is temporary.",
        "Don't chase after temporary things that lead you away from God, e.g., filling all your time with TV and the Internet instead of spending an adequate amount of time praying or reading Scripture.",
        "Chasing pleasures gives temporary satisfaction.",
        "These are temporary because you don't feel as fulfilled by what you have and end up feeling dissatisfied and frustrated.",
        "On the other hand, if you rely on God for happiness by obeying Him, doing what is good and fair, and offering your heart, body, mind, and soul to the service of God, He will give you peace and satisfaction that keeps you content and wanting to serve more.",
        "\"Yes, joyful are those who live like this!",
        "Joyful indeed are those whose God is the Lord\" (Psalm 144:15).",
        "His gifts set you free and let you explore truth and love to their fullest.",
        "Such an experience means living a fuller life in the light and path of God.",
        "Know the nature of your current focus and identify the temptations that lead your mind and heart away from God.",
        "Once you identify those distractions, you can avoid them to begin living with God and following His chosen path for you.",
        "For example, if you get consumed by social media and neglect your faith because of it, look for ways to limit your social media use so that you give more time to God.",
        "Study Revelations.",
        "The book of Revelation from the New Testament talks about a series of events.",
        "John of Patmos was shown seven seals that will be opened before Jesus's final day of judgement.",
        "These seals discuss the events that God foretold.",
        "The predictions are alarming but true believers will be kept safe by Jesus.",
        "Revelation 6:1-17 and 8:1-5 describe the seven seals.",
        "Understand why there will be a Judgement Day.",
        "Many innocent ones have been suffering from slavery of various kinds like poverty, assault, abuse, etc.",
        "God wants an end to all the injustice done to His people in the hands of the evil.",
        "\"For God did not appoint us to suffer wrath but to receive salvation through our Lord Jesus Christ\" (1 Thessalonians 5:9).",
        "The Judgement Day will bring redemption and freedom from evil and death forever.",
        "Know what to expect after the Judgement.",
        "Those who worked against God and His people face inevitable damnation, unless they turned to Jesus before they die.",
        "Not only people who worked against God will face damnation - those who went through life \"on the fence\" can expect the same - as it says in Revelation 3:16 KJV: \"So then because thou art lukewarm, and neither cold nor hot, I will spue thee out of my mouth.\"",
        "God will live with humans in the new world.",
        "There will be no evil.",
        "Learning From The Exodus Avoid disobedience.",
        "Have good intentions and resolve to never sin again.",
        "Deuteronomy 34 prophesies that Moses led the Israelites to the Promised Land.",
        "He obeyed God, performed miracles and saved the chosen ones.",
        "However, he couldn't enter the Promised Land.",
        "The Israelites could have avoided distrusting God and making complaints against Him during the Exodus, which led to Moses losing his patience.",
        "Even when God sent food from heaven, they were not grateful.",
        "Moses dies before entering the Promised Land.",
        "According to Deuteronomy 32:51-52, God told Moses that neither he nor Aaron would see the Promised Land \"...because both of you broke faith with me in the presence of the Israelites at the waters of Meribah Kadesh in the Desert of Zin and because you did not uphold my holiness among the Israelites.",
        "Therefore, you will see the land only from a distance; you will not enter the land I am giving to the people of Israel.\"",
        "This refers to an incident during which Moses, in frustration at the Israelites, disobeyed God by bringing the people water in a way contrary to the instructions God provided.",
        "Do not have this happen to the next one who will be in charge of taking you to Jerusalem.",
        "Make up your mind to prepare for and face the troubles that may occur during the present exodus.",
        "Ponder over the life of Moses.",
        "Moses was separated from his family.",
        "Exodus 2 narrates that he was raised by his own mother in Pharaoh's palace which might have been the most unsafe place for him had they known that he was an Israelite.",
        "However, he gave up all the luxuries of the palace because he was moved by the plight of Israelites.",
        "Adjust to your circumstances.",
        "Moses obeyed the word of the Lord and went through hardships.",
        "The very people he was helping in the Exodus were in turn constantly hurting him through disobedience, grumbling, and more..",
        "Follow the word of the Lord and help your loved ones do so, too.",
        "For example, the Bible says in Exodus 17:2-3, \"So the people contended with Moses, and they said, 'Give us water to drink!'",
        "Moses said to them, 'Why do you contend with me?",
        "Why do you test the Lord?'",
        "But the people were very thirsty there for water, and they murmured against Moses and said, 'Why in the world did you bring us up from Egypt – to kill us and our children and our cattle with thirst?'\"",
        "Rather than trusting in God who delivered them out of captivity in Egypt, and trusting Moses to continue leading them, the people lacked faith and were ready to turn against both Moses and God.",
        "Know that only two lived to see the Promised Land.",
        "Don't take it for granted.",
        "Of all the people who left Egypt, only two survived the years of journey.",
        "God loved all.",
        "But not all survived.",
        "Decide not to take salvation lightly.",
        "Just as the believers will be saved or forgiven, Romans 2:6-11 explains that those who do wrong and speak badly about God will face what they call upon themselves.",
        "Replace negativity with love.",
        "1 Corinthians 13:4-8 says, \"Love endures with patience and serenity, love is kind and thoughtful, and is not jealous or envious; love does not brag and is not proud or arrogant.",
        "It is not rude; it is not self-seeking, it is not provoked [nor overly sensitive and easily angered]; it does not take into account a wrong endured\".",
        "If you try freeing your mind of hurtful emotions, towards yourself or others, you may still feel tempted in the future.",
        "Try to be more loving, so you don't feel well if you find yourself being hateful or envious.",
        "\"If I speak in the tongues of men and of angels, but have not love, I am only a resounding gong or a clanging cymbal\" (1 Corinthians 13:1).",
        "God likes genuine actions.",
        "Merely following the herd, without having an honest relationship with Jesus apart from the world and gatherings, may not reach Him.",
        "Merely doing it like a regular, traditional practice of fasting, praying, and obeying while lacking a personal connection may not please Him.",
        "Think of how you would like your true friends to know you.",
        "Feel it and try to know who God is, and demonstrate truthfulness in your worship of Him by worshiping God with love.",
        "Mending Your Ways Read the Bible.",
        "In particular, peruse the end time prophecy in the Bible.",
        "Jesus' coming is the Last Judgement Day, and on that day, He will judge all the people.",
        "Just like He ascended to His Heavenly abode on the clouds, He will return this day on the clouds.",
        "No one knows the exact date of His return.",
        "As Matthew 24:36 says, \"But about that day or hour no one knows, not even the angels in heaven, nor the Son, but only the Father.\"",
        "Live modestly.",
        "Humble yourself and seek not worldly pleasures more than spiritual growth.",
        "Seek silence and calm and get used to making efforts for peace that may get you spiritually connected to Jesus deeper.",
        "Let this connection help you learn living right, according to Him.",
        "Many pleasures and comforts make you overlook God's message.",
        "Balance your societal role so you don't obey the society, but have the power to say 'No' when you must.",
        "Keep yourself occupied and directed towards productive work instead of being idle.",
        "An idle mind is a devil's workshop.",
        "Appreciate your work and draw a line between productivity and greed.",
        "Man has gone far and wide in the stream of science, music, literature, research, etc.",
        "Believe in your ways.",
        "Make use of your skills and build something worthwhile with your resources.",
        "Put your field of work to use.",
        "For example, if you are a student, learn more about God through related study material.",
        "Ask questions and use your sense of reason to understand more about God's ways.",
        "If you are a professional employee, on the other hand, be a good employee and don't support fraudulent means to gain profit.",
        "Exercise self-control and enjoy the little joys of your labour.",
        "If you are a housewife, teach your family examples from the Bible about how your family may apply God's commandments in their actions.",
        "Do not consider yourself less important.",
        "Empower yourself and help others.",
        "God sees it all and rewards accordingly.",
        "Steer clear of conspiracy theories.",
        "There are many theories that try to confuse believers.",
        "These views may stir up demonic thoughts that may lead to chaos and confusion, and could also weaken the body, soul, and mind.",
        "Pay no heed to such ideas.",
        "Walk on the right path without getting distracted by provocations.",
        "If something bothers you, ask God for answers and be watchful of what you find.",
        "For example, some may claim that Jesus is the same as Zeus or Horus.",
        "Doing a more in-depth study of these stories and histories, however, can reveal why these misconceptions are false.",
        "Obey the law.",
        "God follows the law.",
        "He died on the cross for a price to be paid for saving us.",
        "Follow the law and take pride in doing the right things, whether it be at school, work, or home.",
        "The law defines each action and its consequences.",
        "\"Blessed are the pure in heart, for they shall see God\" (Matthew 5:8).",
        "Do good deeds, \"...and is well known for her good deeds, such as bringing up children, showing hospitality, washing the feet of the Lord’s people, helping those in trouble and devoting herself to all kinds of good deeds\" (1 Timothy 5:10).",
        "Our good actions work for us while the bad ones get us judged, accordingly.",
        "Address your fears.",
        "Feeling fear is not evil.",
        "Acting evil because you are scared is.",
        "Do not run away from fears.",
        "Fear is unavoidable.",
        "It is so among the holy as well.",
        "There were many during biblical times who were shrouded with fear while following God's command.",
        "Forgive yourself and face your fears.",
        "Pray to God for strength that you may overcome jealousy, envy, gluttony, plotting against the good, surrendering to something blindly, becoming a slave of certain luxuries, etc.",
        "When Joseph got scared of hearing the conception of Virgin Mary, an angel strengthened him to take care of Mary and God's child, Yehoshua/Jesus (Matthew 1:18-25).",
        "The disciples got scared of Jesus when they saw Him after He rose from the dead (Luke 24:36-38).",
        "Moses doubted his communication skills when ordered by the Lord to go to Egypt to demand that the Israelites be released from slavery.",
        "So God allowed him to take along his brother Aaron, as a spokesperson (Exodus 4:10-16).",
        "Peter abandoned Jesus when he was questioned by the soldiers who came to arrest Him (Luke 22:54-62).",
        "Fear is a possibility.",
        "But it is neither the end nor a deciding factor.",
        "Ask God to help you when fear tries your faith.",
        "Affirm your faith in the Lord and fight your demons.",
        "The Lord will keep you going.",
        "Don't fear your challenges.",
        "It might be about facing a school or office bully, being left out, or missing out on the earthly pleasures in order to follow God.",
        "When you make a decision to be righteous, you will understand whether the chase to be popular was more fulfilling or following Jesus.",
        "Don't try to fool the righteous deliberately.",
        "Don't think of asking believers twisted questions just so you catch them without an answer.",
        "And don't talk unnecessarily or without knowing what you are talking about.",
        "On the mountain when Peter saw Jesus talking to Moses's spirit, he didn't know what he was saying when he expressed his desire to build a house for the Lord (Matthew 17:1–13).",
        "The disciples didn't know about Jesus's crucifixion and being betrayed by one among them until their last supper.",
        "They were told about it at the table, where they questioned Jesus about it (Matthew 26:17-30).",
        "There is a way, a path and a light to follow.",
        "Walk on it diligently and believe that it will guide you.",
        "Question yourself.",
        "Ask yourself if you believe that Jesus died for your sins?",
        "\"Greater love has no one than this to lay down one’s life for one’s friends\" (John 15:13).",
        "Be clear about your faith in His rising from the dead.",
        "Believe that He will come again to save you and believe in heaven.",
        "God will fulfill His promise and give you a free and eternal life.",
        "Jesus and His disciples were judged and killed.",
        "Many people believed and accepted them when they were gone.",
        "Ask God to help you believe in your redemption.",
        "You may still be in doubt.",
        "You may be of any religion, but God does not distinguish between people.",
        "He is waiting to accept all who seek Him.",
        "He turned Saul to Paul, from killing God's people to protecting them (Acts 9).",
        "He can turn anyone else to His ways as He pleases.",
        "\"He will fight all the beasts and conquer over them forever\" (Revelation 19:11–21).",
        "Expect peace, holiness and love like never before in the new world thereafter (Revelation 21:2–4).",
        "Accept the forerunner.",
        "The previous forerunner, John the Baptist, Jesus's cousin, spoke the truth and lived a simple life.",
        "He baptised the believers in the river Jordan along with Jesus.",
        "Accept the next forerunner and prepare to help them as they announce Jesus' next coming.",
        "Believe that since God appointed them, they will take the believers to safety.",
        "“For then there will be great tribulation, such as has not been since the beginning of the world until this time, no, nor ever shall be.",
        "And unless those days were shortened, no flesh would be saved; but for the elect’s sake those days will be shortened” (Matthew 24:21-22).",
        "Answer in the affirmative when asked about your faith in Jesus and His death on the cross for you.",
        "Affirm your faith regarding your belief in His next coming.",
        "Say that you believe that He will come again to save you.",
        "Be righteous and follow the law.",
        "Man changes his mind every so often.",
        "An atheist may become a theist.",
        "When creation changes its course, the Creator does it too.",
        "The law keeps working itself out.",
        "When you break the law, you are judged.",
        "When you stop doing wrong and do good instead, the judgement changes accordingly.",
        "Submit to God in your own words.",
        "Speak with God and entrust your life to Him.",
        "Do not worry, and instead, rely on God's word to save you.",
        "Ask God what you should be doing to believe in and understand His word.",
        "Ask Him to guide you about what you need to do and how you need to think about saving yourself and your loved ones.",
        "Try to submit to God and be an instrument of God.",
        "Fulfill your responsibilities daily.",
        "Follow the Ten Commandments.",
        "Remember, also, what Jesus said in Matthew 22:36-40 about the greatest commandment: \"'Love the Lord your God with all your heart and with all your soul and with all your mind.'",
        "This is the first and greatest commandment.",
        "And the second is like it: 'Love your neighbor as yourself.'",
        "All the Law and the Prophets hang on these two commandments\" Do not be self-righteous.",
        "We've learned the importance of nature the hard way, by making immense progress and ending up at a dead end.",
        "Endless materialistic progress led us to know that we need to take measures to reduce what is left, like electronic waste and carbon footprint.",
        "This shows that God created everything with a balance.",
        "Avoid tempting situations.",
        "Evil is working hard to make others go against righteousness and humanity.",
        "Those who welcome temptations in the form of anger, lust, greed, chaos, or confusion draw away from each other and from the Lord.",
        "Some call this force demonic and some chaotic.",
        "Jesus will battle and defeat this evil that is against us.",
        "Control your desires to do unhealthy activities like smoking, luring others into doing wrong and envying others.",
        "Don't give undue importance to flirting, flaunting or popularity as you age.",
        "Ask God to help you understand your confusion about various situations in life.",
        "Do God's work tirelessly.",
        "As you toil in obedience to God, do not complain or malign your labour.",
        "Instead, allow yourself to be fully engrossed in Him and deny shifting focus to relieve this stress.",
        "Stress of the world and money causes worry of the wrong kind.",
        "Godly pain only heals you.",
        "Being Righteous Take up a supportive attitude.",
        "Aside from genuinely being supportive of others, one may never turn from the so-called human nature of deceit and selfishness.",
        "Accept and support those who seek your help to walk on the right path.",
        "Jesus knows your pain and the conflict in your heart.",
        "He will make sure that you and your loved ones are okay.",
        "Avoid teaching others in a way that would lead to conflict with them.",
        "Patiently hold back your judgements, and let go of the those who adamantly refuse help lest you aggravate their anger.",
        "Help if you are asked for it and be kind when approached by someone for guidance; this is the best time to bring about a change.",
        "Do the good that you know you should do.",
        "Don't be indifferent.",
        "As James 4:17 states, \"If anyone, then, knows the good they ought to do and doesn't do it, it is sin for them.\"",
        "Serve man to serve God: \"The greatest among you will be your servant\" (Matthew 23:11).",
        "In doing so, you'll be following the example Jesus gave to us: \"For even the Son of Man did not come to be served, but to serve, and to give his life as a ransom for many\" (Mark 10:45).",
        "Know that you are not worthless, and don't give up on doing the good work you've been called to do.",
        "As stated in 2 Chronicles 15:7, \"But as for you, be strong and do not give up, for your work will be rewarded.\"",
        "Control your urge to curse others.",
        "You may come across those who don't accept Christianity or practice a different faith, but do not cause anger or guilt when you talk to them about these differences in belief.",
        "Do not aggressively question those who do not seem to care about God.",
        "Let them be, and instead, guide them only if they ask you for help.",
        "Do not look down on others or say that they will suffer.",
        "Let God be the judge.",
        "Don't show a hateful attitude while speaking about the Lord.",
        "Remember that John the Baptist was beheaded because he spoke outwardly of evildoers.",
        "While John the Baptist was correct in calling sinners to repent, this event illustrates that one can be directed on the right path but never forced.",
        "Be accepting of those who disagree with you, yet honestly seek the truth and don't persecute you.",
        "The Lord said in Mark 9:38-42, \"Whoever is not against us is for us.\".",
        "So, be accepting.",
        "Don't justify your loved ones' mistakes.",
        "Feeling pity at the wrong time can encourage someone to continue practicing evil ways, leading to judgement both on yourself and others.",
        "Allow yourself to objectively discern good from evil.",
        "If you constantly support those who do wrong, you encourage wrongdoings.",
        "Do not fall prey to such a bait and practice self-control.",
        "Hold back your protectiveness as it won't prevent God's law from applying to them.",
        "Help when you can.",
        "Don't be late about helping when you see something that needs attention.",
        "A stitch in time saves nine.",
        "Do what you must but don't force your knowledge on others.",
        "Allow others to face the consequences of their misdeeds, especially if they are unresponsive to your help.",
        "Help others through prayer.",
        "Not everyone is aware of Jesus's word.",
        "Have faith that you will discern between good and evil.",
        "Pray for non-believers, the doubtful and those who are otherwise away from God.",
        "Pray for the saints and all those who are toiling for deliverance.",
        "Pray for the dead who died in faith.",
        "Pray for those who are dismayed.",
        "Indeed, the waiting may have withered some souls and disappointed them.",
        "Pray for the unaware, children, and those who have no one to pray for them.",
        "Include the lonely and lost in your prayers.",
        "Pray for the eternal kingdom of the Lord.",
        "Pray the 'Our Father' as Jesus instructed, and pray in this way because Jesus died for us.",
        "Pray for an end to the killing of those who are righteous.",
        "Loving Jesus Love God.",
        "Know the power of love, and know that God is love.",
        "Connect with the Lord and look forward to meeting your Saviour.",
        "Just like you feel hurt when you feel Jesus didn’t answer your prayers and He has forgotten you, Jesus feels good or bad, happy and sad based on our thoughts and actions.",
        "Be eager to meet God and think of God daily so you feel emotionally connected to Him.",
        "Just because Jesus is God, does not mean He is emotionless.",
        "He can feel happy when you love Him; He can feel upset if you try to escape or fight Him.",
        "As 1 Corinthians 13:13 states, \"And now these three remain: faith, hope and love.",
        "But the greatest of these is love.\"",
        "Love is the greatest of these three theological virtues.",
        "Practice loving God through devotion to Him and by loving others.",
        "Hold high Jesus's path.",
        "Jesus, being God, was powerful enough to turn away from crucifixion.",
        "John 18:37 reads, “The reason I was born and came into the world is to testify to the truth.” He gave His life to prove His love.",
        "Recognize this as the gift that it is, and follow His example by devoting your life to truth and love.",
        "Prove your love to Jesus.",
        "Obey God's laws and instructions in gratitude and love for Him, and regularly remind yourself of the hope of Heaven.",
        "As Matthew 5:17-18 says, \"Do not think that I have come to abolish the Law or the Prophets; I have not come to abolish them but to fulfill them.",
        "For truly I tell you, until heaven and earth disappear, not the smallest letter, not the least stroke of a pen, will by any means disappear from the Law until everything is accomplished.\"",
        "Plan and visualize a better tomorrow and be hopeful of what He plans for your redemption.",
        "Prepare for a good world and see yourself and your loved ones living a good life.",
        "Whenever you are very disappointed in your present life, remind yourself that God has planned an eternal life without evil.",
        "Anticipate such a life so that you will be driven towards realising and accepting it with grace when it happens.",
        "Begin living your present life with your eyes set on the eternal life to come, and do your best to live out heavenly virtues in your present life with the help of God's grace.",
        "Praise and thank Him regularly.",
        "Recognize that God ultimately desires your good; in particular, He desires your eternal salvation.",
        "\"'For I know the plans I have for you,' declares the LORD, 'plans to prosper you and not to harm you, plans to give you hope and a future'\" (Jeremiah 29:11).",
        "Regularly praise God for His goodness, and thank Him for all the good He's working in your life.",
        "Prepare for holy miracles, and when you witness those miracles, bow down and show your reverence.",
        "Praise Him every day, and not only when you witness a miracle.",
        "Thank Him for all you have and be grateful to Him.",
        "When you see that the word is getting fulfilled, praise the Lord."
    ]
}