{
    "title": "How to Shrink Shoes",
    "url": "https://www.wikihow.com/Shrink-Shoes",
    "category_hierarchy": [
        "Personal Care and Style",
        "Footwear",
        "Shoes"
    ],
    "methods": [
        {
            "name": "Shrinking Leather, Suede, and Canvas Shoes",
            "steps": [
                {
                    "headline": "Try on the shoes to see which parts need to be smaller.",
                    "description": "Put the shoes on and stand with your feet flat on the floor, and then take a few steps. Check to see which places on the shoe aren’t touching your foot, and decide which parts need to be smaller for the shoes to fit more snugly. If you bought the shoe in your size, you probably won’t need to shrink the entire shoe. Instead, you’re just going to be focusing on shrinking one area of the shoe at a time. For instance, you may want to make the sides of a canvas shoe slightly smaller so your foot doesn’t slip out while you walk."
                },
                {
                    "headline": "Dab an ill-fitting area of the shoe with water until it is damp but not saturated.",
                    "description": "Dip your fingers into cool water and pat the water onto the shoe. Continue this until the fabric is damp but not dripping wet. Focus the water on the areas that are the most stretched. Avoid getting water on the insole of the shoe, as this can cause it to become smelly, cracked, or discolored. For a leather or suede shoe, focus the water around the top edge of the shoe, which tends to be the stretchiest area. Adding water and heat to shoes like patent leather heels, coated leather sneakers, or larger shoes, like boots, won’t be effective for shrinking them. In those cases, you’ll need to use inserts to get a better fit."
                },
                {
                    "headline": "Apply heat to the wet fabric with a blow dryer on the medium setting.",
                    "description": "Hold a blow dryer about 6 inches (15 cm) away from the area where you applied the water. Turn the dryer on and set the heat at the medium level. Leave the dryer on until the fabric is dry to the touch. Don’t hold the blow dryer too close to the fabric. The concentrated heat from the dryer discolor lighter canvas fabrics. For leather and suede, continuously move the dryer around the top edge of the shoe to heat the leather, causing it to contract and shrink. If the leather starts to smell or crack while you’re applying heat, turn the blow dryer off and let the shoes air dry."
                },
                {
                    "headline": "Put on the shoe to see if the fit has improved.",
                    "description": "Once the area is dry, put the shoe back on your fut and stand up with your feet flat on the floor. Take a few steps to see if the the fabric feels tighter. If it does, your shoe has shrunk. If it still feels loose, re-apply the water to the area and continue blow drying. If they feel too tight, wear a pair of thick socks with them to stretch them out slightly without making them too large. You may need to shrink multiple areas on the shoe, like the sides and the top lip, before you start to see results."
                },
                {
                    "headline": "Use leather conditioner to protect leather and suede shoes.",
                    "description": "Put a pea-sized amount of leather conditioner onto a clean cloth. Then, rub it all over the shoes to restore moisture to the material. Check the packaging to see how long you should let the conditioner soak into the material before you can wear the shoes. You can purchase leather conditioner at most supermarkets or shoe stores."
                }
            ]
        },
        {
            "name": "Getting a Tighter Fit in Sneakers, Boots, and Dress Shoes",
            "steps": [
                {
                    "headline": "Put on a pair of thick socks for a tighter fit all around.",
                    "description": "If you’re wearing tennis shoes, boots, or other shoes where your feet are covered, you can fill the extra space with your socks. Look for a thick pair of hiking socks, or put on 2 or 3 pairs of thinner socks before you put on your shoes. For shoes like heels or ballet flats, this might not be a good option because your feet are mostly exposed."
                },
                {
                    "headline": "Place a cushion at the back heel of the shoe if the shoes are too long.",
                    "description": "Heel cushions are normally used for making shoes feel more comfortable, but you can also use them to inconspicuously improve the fit of a pair of heels or dress shoes. Pull off the protective paper from the back of the cushion and stick it along the back side of the shoe, where the back of your heel would normally touch the shoe. The cushions are about ⁄6 inch (0.42 cm) thick, so they take up a small enough amount of space that it won’t look like there’s a big gap between your heel and the shoe. You can find heel cushions at most supermarkets, pharmacies, and shoe stores."
                },
                {
                    "headline": "Use ball of foot cushions to fill the toe area of the shoes.",
                    "description": "If your dress shoes or heels aren't fitting well, you might have too much space in the toe area. Peel the protective paper off of the back of the cushions, and stick them to the insole of the shoe where your toes normally rest in the shoe. This helps to keep your toes in the same place when you walk. If you have a lot of space in the toe of your shoe, the ball of your foot can slide forward into the shoe, causing the heel of your shoe to slip off when you walk."
                },
                {
                    "headline": "Add an extra insole into the shoe to elevate your foot.",
                    "description": "If there’s a gap between your foot and the top of your shoe, your foot can slip out of the shoe. To fix this, take an insole out of a different shoe of the same size and style, and lay it on top of the insole that’s already in the shoe. Then, try on the shoe to make sure your foot touches the top of the shoe. If you don’t have an extra insole, you can purchase inserts at the supermarket, pharmacy, or shoe store. This is a useful method for tennis shoes, boots, dress shoes, and heels since no one will be able to see the insole in the shoe."
                }
            ]
        }
    ],
    "tyn": [
        "Fixing Stretched Out Shoes",
        "Water",
        "Blow dryer",
        "Shrinking Leather Shoes",
        "Leather conditioner",
        "Getting a Tighter Fit",
        "Thick socks",
        "Heel cushions",
        "Insoles"
    ],
    "text": " Shrinking Leather, Suede, and Canvas Shoes Try on the shoes to see which parts need to be smaller. Put the shoes on and stand with your feet flat on the floor, and then take a few steps. Check to see which places on the shoe aren’t touching your foot, and decide which parts need to be smaller for the shoes to fit more snugly. If you bought the shoe in your size, you probably won’t need to shrink the entire shoe. Instead, you’re just going to be focusing on shrinking one area of the shoe at a time. For instance, you may want to make the sides of a canvas shoe slightly smaller so your foot doesn’t slip out while you walk. Dab an ill-fitting area of the shoe with water until it is damp but not saturated. Dip your fingers into cool water and pat the water onto the shoe. Continue this until the fabric is damp but not dripping wet. Focus the water on the areas that are the most stretched. Avoid getting water on the insole of the shoe, as this can cause it to become smelly, cracked, or discolored. For a leather or suede shoe, focus the water around the top edge of the shoe, which tends to be the stretchiest area. Adding water and heat to shoes like patent leather heels, coated leather sneakers, or larger shoes, like boots, won’t be effective for shrinking them. In those cases, you’ll need to use inserts to get a better fit. Apply heat to the wet fabric with a blow dryer on the medium setting. Hold a blow dryer about 6 inches (15 cm) away from the area where you applied the water. Turn the dryer on and set the heat at the medium level. Leave the dryer on until the fabric is dry to the touch. Don’t hold the blow dryer too close to the fabric. The concentrated heat from the dryer discolor lighter canvas fabrics. For leather and suede, continuously move the dryer around the top edge of the shoe to heat the leather, causing it to contract and shrink. If the leather starts to smell or crack while you’re applying heat, turn the blow dryer off and let the shoes air dry. Put on the shoe to see if the fit has improved. Once the area is dry, put the shoe back on your fut and stand up with your feet flat on the floor. Take a few steps to see if the the fabric feels tighter. If it does, your shoe has shrunk. If it still feels loose, re-apply the water to the area and continue blow drying. If they feel too tight, wear a pair of thick socks with them to stretch them out slightly without making them too large. You may need to shrink multiple areas on the shoe, like the sides and the top lip, before you start to see results. Use leather conditioner to protect leather and suede shoes. Put a pea-sized amount of leather conditioner onto a clean cloth. Then, rub it all over the shoes to restore moisture to the material. Check the packaging to see how long you should let the conditioner soak into the material before you can wear the shoes. You can purchase leather conditioner at most supermarkets or shoe stores. Getting a Tighter Fit in Sneakers, Boots, and Dress Shoes Put on a pair of thick socks for a tighter fit all around. If you’re wearing tennis shoes, boots, or other shoes where your feet are covered, you can fill the extra space with your socks. Look for a thick pair of hiking socks, or put on 2 or 3 pairs of thinner socks before you put on your shoes. For shoes like heels or ballet flats, this might not be a good option because your feet are mostly exposed. Place a cushion at the back heel of the shoe if the shoes are too long. Heel cushions are normally used for making shoes feel more comfortable, but you can also use them to inconspicuously improve the fit of a pair of heels or dress shoes. Pull off the protective paper from the back of the cushion and stick it along the back side of the shoe, where the back of your heel would normally touch the shoe. The cushions are about ⁄6 inch (0.42 cm) thick, so they take up a small enough amount of space that it won’t look like there’s a big gap between your heel and the shoe. You can find heel cushions at most supermarkets, pharmacies, and shoe stores. Use ball of foot cushions to fill the toe area of the shoes. If your dress shoes or heels aren't fitting well, you might have too much space in the toe area. Peel the protective paper off of the back of the cushions, and stick them to the insole of the shoe where your toes normally rest in the shoe. This helps to keep your toes in the same place when you walk. If you have a lot of space in the toe of your shoe, the ball of your foot can slide forward into the shoe, causing the heel of your shoe to slip off when you walk. Add an extra insole into the shoe to elevate your foot. If there’s a gap between your foot and the top of your shoe, your foot can slip out of the shoe. To fix this, take an insole out of a different shoe of the same size and style, and lay it on top of the insole that’s already in the shoe. Then, try on the shoe to make sure your foot touches the top of the shoe. If you don’t have an extra insole, you can purchase inserts at the supermarket, pharmacy, or shoe store. This is a useful method for tennis shoes, boots, dress shoes, and heels since no one will be able to see the insole in the shoe.",
    "sentences": [
        " Shrinking Leather, Suede, and Canvas Shoes Try on the shoes to see which parts need to be smaller.",
        "Put the shoes on and stand with your feet flat on the floor, and then take a few steps.",
        "Check to see which places on the shoe aren’t touching your foot, and decide which parts need to be smaller for the shoes to fit more snugly.",
        "If you bought the shoe in your size, you probably won’t need to shrink the entire shoe.",
        "Instead, you’re just going to be focusing on shrinking one area of the shoe at a time.",
        "For instance, you may want to make the sides of a canvas shoe slightly smaller so your foot doesn’t slip out while you walk.",
        "Dab an ill-fitting area of the shoe with water until it is damp but not saturated.",
        "Dip your fingers into cool water and pat the water onto the shoe.",
        "Continue this until the fabric is damp but not dripping wet.",
        "Focus the water on the areas that are the most stretched.",
        "Avoid getting water on the insole of the shoe, as this can cause it to become smelly, cracked, or discolored.",
        "For a leather or suede shoe, focus the water around the top edge of the shoe, which tends to be the stretchiest area.",
        "Adding water and heat to shoes like patent leather heels, coated leather sneakers, or larger shoes, like boots, won’t be effective for shrinking them.",
        "In those cases, you’ll need to use inserts to get a better fit.",
        "Apply heat to the wet fabric with a blow dryer on the medium setting.",
        "Hold a blow dryer about 6 inches (15 cm) away from the area where you applied the water.",
        "Turn the dryer on and set the heat at the medium level.",
        "Leave the dryer on until the fabric is dry to the touch.",
        "Don’t hold the blow dryer too close to the fabric.",
        "The concentrated heat from the dryer discolor lighter canvas fabrics.",
        "For leather and suede, continuously move the dryer around the top edge of the shoe to heat the leather, causing it to contract and shrink.",
        "If the leather starts to smell or crack while you’re applying heat, turn the blow dryer off and let the shoes air dry.",
        "Put on the shoe to see if the fit has improved.",
        "Once the area is dry, put the shoe back on your fut and stand up with your feet flat on the floor.",
        "Take a few steps to see if the the fabric feels tighter.",
        "If it does, your shoe has shrunk.",
        "If it still feels loose, re-apply the water to the area and continue blow drying.",
        "If they feel too tight, wear a pair of thick socks with them to stretch them out slightly without making them too large.",
        "You may need to shrink multiple areas on the shoe, like the sides and the top lip, before you start to see results.",
        "Use leather conditioner to protect leather and suede shoes.",
        "Put a pea-sized amount of leather conditioner onto a clean cloth.",
        "Then, rub it all over the shoes to restore moisture to the material.",
        "Check the packaging to see how long you should let the conditioner soak into the material before you can wear the shoes.",
        "You can purchase leather conditioner at most supermarkets or shoe stores.",
        "Getting a Tighter Fit in Sneakers, Boots, and Dress Shoes Put on a pair of thick socks for a tighter fit all around.",
        "If you’re wearing tennis shoes, boots, or other shoes where your feet are covered, you can fill the extra space with your socks.",
        "Look for a thick pair of hiking socks, or put on 2 or 3 pairs of thinner socks before you put on your shoes.",
        "For shoes like heels or ballet flats, this might not be a good option because your feet are mostly exposed.",
        "Place a cushion at the back heel of the shoe if the shoes are too long.",
        "Heel cushions are normally used for making shoes feel more comfortable, but you can also use them to inconspicuously improve the fit of a pair of heels or dress shoes.",
        "Pull off the protective paper from the back of the cushion and stick it along the back side of the shoe, where the back of your heel would normally touch the shoe.",
        "The cushions are about ⁄6 inch (0.42 cm) thick, so they take up a small enough amount of space that it won’t look like there’s a big gap between your heel and the shoe.",
        "You can find heel cushions at most supermarkets, pharmacies, and shoe stores.",
        "Use ball of foot cushions to fill the toe area of the shoes.",
        "If your dress shoes or heels aren't fitting well, you might have too much space in the toe area.",
        "Peel the protective paper off of the back of the cushions, and stick them to the insole of the shoe where your toes normally rest in the shoe.",
        "This helps to keep your toes in the same place when you walk.",
        "If you have a lot of space in the toe of your shoe, the ball of your foot can slide forward into the shoe, causing the heel of your shoe to slip off when you walk.",
        "Add an extra insole into the shoe to elevate your foot.",
        "If there’s a gap between your foot and the top of your shoe, your foot can slip out of the shoe.",
        "To fix this, take an insole out of a different shoe of the same size and style, and lay it on top of the insole that’s already in the shoe.",
        "Then, try on the shoe to make sure your foot touches the top of the shoe.",
        "If you don’t have an extra insole, you can purchase inserts at the supermarket, pharmacy, or shoe store.",
        "This is a useful method for tennis shoes, boots, dress shoes, and heels since no one will be able to see the insole in the shoe."
    ]
}