{
    "title": "How to Change the Color of a Celery Stalk",
    "url": "https://www.wikihow.com/Change-the-Color-of-a-Celery-Stalk",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables",
        "Celery"
    ],
    "parts": [
        {
            "name": "Changing the Color of the Celery",
            "steps": [
                {
                    "headline": "Gather the necessary materials.",
                    "description": "To perform this experiment you will need 4 celery stalks, food coloring, water, a knife/scissors, and 4 small glasses. The number of glasses you need is dependent upon how many colors you want to use to change the celery. Make sure your celery stalks still have the leafy tops on them. If you only have 1 stalk of celery, you can it lengthwise into multiple pieces. Blue and red food coloring work best for this experiment, but you can use any combination of colors you would like."
                },
                {
                    "headline": "Fill the glass halfway with water and add food coloring.",
                    "description": "Use at least 2 different glasses to have some variety in the colors. If you have more than 2 glasses, try combining the colors together to make purple or orange. The more color you add, the more vibrant the color of the celery stalk will so be generous with the number of drops you add. Red and blue combine to make purple; yellow and red combine to make orange."
                },
                {
                    "headline": "Cut the bottom off the celery stalk.",
                    "description": "You want to use a fresh part of the stalk and expose the bottom so that it can take up the most water. Ask a parent to assist with this step. Using scissors or a knife, trim the curved part of the bottom of the stalk off. Leave the leafy top on the stalk. The leafy parts will change color as well."
                },
                {
                    "headline": "Make “before” observations.",
                    "description": "To add a little more education to the experiment, ask some questions and make some observations of the celery before beginning. What color is the celery? What do the leaves look like? What are the features of the bottom of the stalk? Does every stalk look the same? Make predictions on what you think will happen over time to the stalk and the leaves of the celery. Take note of the observations for each stalk and which one goes into each color."
                },
                {
                    "headline": "Place 1 piece of celery in each cup and let sit undisturbed for at least 24 hours.",
                    "description": "After trimming each stalk, place 1 stalk per glass into the colored solution. It takes time for the celery stalk to take up the water and transport it to the top, so leave the cups undisturbed for at least 24 hrs. You can check on the celery every few hours to observe the progress of the color change. Leaving the celery for more time will result in a more vibrant color change."
                },
                {
                    "headline": "Observe the results of the experiment.",
                    "description": "As time passes, the colored water will work its way up the celery stalk and into the leaves. After 24 hours you should notice that the color of the leaves has changed to match that of the water in the glass. If you look at the bottom of the stalk, you should see that it is also colored. Break the stalk in half and see what the inside looks like. You should see the color all throughout the stalk. Write down your results as “after” observations. Compare them to your notes before you started. If you don't see a color change, try adding more food coloring or using a new piece of celery."
                }
            ]
        },
        {
            "name": "Mixing Two Colors with One Celery Stalk",
            "steps": [
                {
                    "headline": "Gather the necessary materials.",
                    "description": "This is a variant of the original experiment where you will cut one stalk partially in half leaving the leafy top part intact. Each half will then be placed in a different color liquid to see what happens. To do this, you will need 1 stalk of celery, 2 glasses, water, scissors, and 2 different colors of food coloring. Make sure the celery still has the leafy bits at the top. Parental supervision/assistance is recommended for cutting the celery."
                },
                {
                    "headline": "Trim the bottom of the celery stalk.",
                    "description": "To expose the xylem of the celery and give it the best access to the water, trim the curved end of the stalk. After trimming, the bottom of the stalk should be flat and you should be able to see small dots. What do you think the small dots are?"
                },
                {
                    "headline": "Cut the stalk in half, up to 1 inch (2.5 cm) from the top of the leafy part.",
                    "description": "Using the scissors, cut the celery stalk in half, but stop about 1 inch (2.5 cm) below the leafy top. You want to make sure the stalk is still connected at the top and that the leaves will be getting water from both halves of the stalk. If you cut too far up, just get a new stalk and try again. Parental assistance is recommended for this step."
                },
                {
                    "headline": "Fill the glasses half-full with water and add food coloring.",
                    "description": "Using regular tap water, fill each glass about halfway. Add a few drops of different food coloring to each glass. The more drops you add, the more vibrant the celery stalk will become with that color. Use 2 colors that blend well such as red and blue to make purple or red and yellow to make orange."
                },
                {
                    "headline": "Place half of each stalk into a separate glass.",
                    "description": "Take one half of the celery stalk and place it in the first glass and stick the second half in the second glass of colored water. Leave the celery in the colored water for at least 24 hours. While you wait, make some predictions about the celery. What color do you think the leaves at the top will be? Will half be 1 color and half the other or will the 2 colors blend together? What color will each half of the stalk be?"
                },
                {
                    "headline": "Observe the results.",
                    "description": "After 24 hours have passed, check on your celery and look at the results. What happened? Write down your observations about the celery. You should notice that the colors have blended together at the top and the leaves are this blended color. Were your predictions correct? How is this experiment different than just having the whole stalk in 1 color?"
                }
            ]
        },
        {
            "name": "Experimenting with Other Plants",
            "steps": [
                {
                    "headline": "Gather other plants and flowers to test.",
                    "description": "Do you think this experiment will work with other plants? Get some white flowers such as carnations or roses. Trim the ends of the flower at an angle to help them soak up more water. If you use a red flower and soak it in blue water, do you think the flower will turn purple?"
                },
                {
                    "headline": "Fill glasses with colored water.",
                    "description": "Just as you did with the celery, fill each glass halfway and add some food coloring. Because you are using white flowers, you should be able to see the color change very well. Use bright color combinations for your flowers. The more food coloring you add, the brighter the flower will be."
                },
                {
                    "headline": "Place 1 flower into each glass of water and observe the changes.",
                    "description": "Over time, the petals will take up the color of the water in the glass. The longer you wait, the more color the petals will develop.Try mixing up the flowers and putting them in a different colored glass each day. What happens to the color of the petals? You can repeat this experiment with any plant you'd like."
                }
            ]
        }
    ],
    "tyn": [
        "Long stalk of celery with many leaves",
        "Measuring cup",
        "Red, blue, and yellow food coloring",
        "4 small drinking glasses (preferably made out of glass)",
        "Scissors"
    ],
    "text": " Changing the Color of the Celery Gather the necessary materials. To perform this experiment you will need 4 celery stalks, food coloring, water, a knife/scissors, and 4 small glasses. The number of glasses you need is dependent upon how many colors you want to use to change the celery. Make sure your celery stalks still have the leafy tops on them. If you only have 1 stalk of celery, you can it lengthwise into multiple pieces. Blue and red food coloring work best for this experiment, but you can use any combination of colors you would like. Fill the glass halfway with water and add food coloring. Use at least 2 different glasses to have some variety in the colors. If you have more than 2 glasses, try combining the colors together to make purple or orange. The more color you add, the more vibrant the color of the celery stalk will so be generous with the number of drops you add. Red and blue combine to make purple; yellow and red combine to make orange. Cut the bottom off the celery stalk. You want to use a fresh part of the stalk and expose the bottom so that it can take up the most water. Ask a parent to assist with this step. Using scissors or a knife, trim the curved part of the bottom of the stalk off. Leave the leafy top on the stalk. The leafy parts will change color as well. Make “before” observations. To add a little more education to the experiment, ask some questions and make some observations of the celery before beginning. What color is the celery? What do the leaves look like? What are the features of the bottom of the stalk? Does every stalk look the same? Make predictions on what you think will happen over time to the stalk and the leaves of the celery. Take note of the observations for each stalk and which one goes into each color. Place 1 piece of celery in each cup and let sit undisturbed for at least 24 hours. After trimming each stalk, place 1 stalk per glass into the colored solution. It takes time for the celery stalk to take up the water and transport it to the top, so leave the cups undisturbed for at least 24 hrs. You can check on the celery every few hours to observe the progress of the color change. Leaving the celery for more time will result in a more vibrant color change. Observe the results of the experiment. As time passes, the colored water will work its way up the celery stalk and into the leaves. After 24 hours you should notice that the color of the leaves has changed to match that of the water in the glass. If you look at the bottom of the stalk, you should see that it is also colored. Break the stalk in half and see what the inside looks like. You should see the color all throughout the stalk. Write down your results as “after” observations. Compare them to your notes before you started. If you don't see a color change, try adding more food coloring or using a new piece of celery. Mixing Two Colors with One Celery Stalk Gather the necessary materials. This is a variant of the original experiment where you will cut one stalk partially in half leaving the leafy top part intact. Each half will then be placed in a different color liquid to see what happens. To do this, you will need 1 stalk of celery, 2 glasses, water, scissors, and 2 different colors of food coloring. Make sure the celery still has the leafy bits at the top. Parental supervision/assistance is recommended for cutting the celery. Trim the bottom of the celery stalk. To expose the xylem of the celery and give it the best access to the water, trim the curved end of the stalk. After trimming, the bottom of the stalk should be flat and you should be able to see small dots. What do you think the small dots are? Cut the stalk in half, up to 1 inch (2.5 cm) from the top of the leafy part. Using the scissors, cut the celery stalk in half, but stop about 1 inch (2.5 cm) below the leafy top. You want to make sure the stalk is still connected at the top and that the leaves will be getting water from both halves of the stalk. If you cut too far up, just get a new stalk and try again. Parental assistance is recommended for this step. Fill the glasses half-full with water and add food coloring. Using regular tap water, fill each glass about halfway. Add a few drops of different food coloring to each glass. The more drops you add, the more vibrant the celery stalk will become with that color. Use 2 colors that blend well such as red and blue to make purple or red and yellow to make orange. Place half of each stalk into a separate glass. Take one half of the celery stalk and place it in the first glass and stick the second half in the second glass of colored water. Leave the celery in the colored water for at least 24 hours. While you wait, make some predictions about the celery. What color do you think the leaves at the top will be? Will half be 1 color and half the other or will the 2 colors blend together? What color will each half of the stalk be? Observe the results. After 24 hours have passed, check on your celery and look at the results. What happened? Write down your observations about the celery. You should notice that the colors have blended together at the top and the leaves are this blended color. Were your predictions correct? How is this experiment different than just having the whole stalk in 1 color? Experimenting with Other Plants Gather other plants and flowers to test. Do you think this experiment will work with other plants? Get some white flowers such as carnations or roses. Trim the ends of the flower at an angle to help them soak up more water. If you use a red flower and soak it in blue water, do you think the flower will turn purple? Fill glasses with colored water. Just as you did with the celery, fill each glass halfway and add some food coloring. Because you are using white flowers, you should be able to see the color change very well. Use bright color combinations for your flowers. The more food coloring you add, the brighter the flower will be. Place 1 flower into each glass of water and observe the changes. Over time, the petals will take up the color of the water in the glass. The longer you wait, the more color the petals will develop.Try mixing up the flowers and putting them in a different colored glass each day. What happens to the color of the petals? You can repeat this experiment with any plant you'd like.",
    "sentences": [
        " Changing the Color of the Celery Gather the necessary materials.",
        "To perform this experiment you will need 4 celery stalks, food coloring, water, a knife/scissors, and 4 small glasses.",
        "The number of glasses you need is dependent upon how many colors you want to use to change the celery.",
        "Make sure your celery stalks still have the leafy tops on them.",
        "If you only have 1 stalk of celery, you can it lengthwise into multiple pieces.",
        "Blue and red food coloring work best for this experiment, but you can use any combination of colors you would like.",
        "Fill the glass halfway with water and add food coloring.",
        "Use at least 2 different glasses to have some variety in the colors.",
        "If you have more than 2 glasses, try combining the colors together to make purple or orange.",
        "The more color you add, the more vibrant the color of the celery stalk will so be generous with the number of drops you add.",
        "Red and blue combine to make purple; yellow and red combine to make orange.",
        "Cut the bottom off the celery stalk.",
        "You want to use a fresh part of the stalk and expose the bottom so that it can take up the most water.",
        "Ask a parent to assist with this step.",
        "Using scissors or a knife, trim the curved part of the bottom of the stalk off.",
        "Leave the leafy top on the stalk.",
        "The leafy parts will change color as well.",
        "Make “before” observations.",
        "To add a little more education to the experiment, ask some questions and make some observations of the celery before beginning.",
        "What color is the celery?",
        "What do the leaves look like?",
        "What are the features of the bottom of the stalk?",
        "Does every stalk look the same?",
        "Make predictions on what you think will happen over time to the stalk and the leaves of the celery.",
        "Take note of the observations for each stalk and which one goes into each color.",
        "Place 1 piece of celery in each cup and let sit undisturbed for at least 24 hours.",
        "After trimming each stalk, place 1 stalk per glass into the colored solution.",
        "It takes time for the celery stalk to take up the water and transport it to the top, so leave the cups undisturbed for at least 24 hrs.",
        "You can check on the celery every few hours to observe the progress of the color change.",
        "Leaving the celery for more time will result in a more vibrant color change.",
        "Observe the results of the experiment.",
        "As time passes, the colored water will work its way up the celery stalk and into the leaves.",
        "After 24 hours you should notice that the color of the leaves has changed to match that of the water in the glass.",
        "If you look at the bottom of the stalk, you should see that it is also colored.",
        "Break the stalk in half and see what the inside looks like.",
        "You should see the color all throughout the stalk.",
        "Write down your results as “after” observations.",
        "Compare them to your notes before you started.",
        "If you don't see a color change, try adding more food coloring or using a new piece of celery.",
        "Mixing Two Colors with One Celery Stalk Gather the necessary materials.",
        "This is a variant of the original experiment where you will cut one stalk partially in half leaving the leafy top part intact.",
        "Each half will then be placed in a different color liquid to see what happens.",
        "To do this, you will need 1 stalk of celery, 2 glasses, water, scissors, and 2 different colors of food coloring.",
        "Make sure the celery still has the leafy bits at the top.",
        "Parental supervision/assistance is recommended for cutting the celery.",
        "Trim the bottom of the celery stalk.",
        "To expose the xylem of the celery and give it the best access to the water, trim the curved end of the stalk.",
        "After trimming, the bottom of the stalk should be flat and you should be able to see small dots.",
        "What do you think the small dots are?",
        "Cut the stalk in half, up to 1 inch (2.5 cm) from the top of the leafy part.",
        "Using the scissors, cut the celery stalk in half, but stop about 1 inch (2.5 cm) below the leafy top.",
        "You want to make sure the stalk is still connected at the top and that the leaves will be getting water from both halves of the stalk.",
        "If you cut too far up, just get a new stalk and try again.",
        "Parental assistance is recommended for this step.",
        "Fill the glasses half-full with water and add food coloring.",
        "Using regular tap water, fill each glass about halfway.",
        "Add a few drops of different food coloring to each glass.",
        "The more drops you add, the more vibrant the celery stalk will become with that color.",
        "Use 2 colors that blend well such as red and blue to make purple or red and yellow to make orange.",
        "Place half of each stalk into a separate glass.",
        "Take one half of the celery stalk and place it in the first glass and stick the second half in the second glass of colored water.",
        "Leave the celery in the colored water for at least 24 hours.",
        "While you wait, make some predictions about the celery.",
        "What color do you think the leaves at the top will be?",
        "Will half be 1 color and half the other or will the 2 colors blend together?",
        "What color will each half of the stalk be?",
        "Observe the results.",
        "After 24 hours have passed, check on your celery and look at the results.",
        "What happened?",
        "Write down your observations about the celery.",
        "You should notice that the colors have blended together at the top and the leaves are this blended color.",
        "Were your predictions correct?",
        "How is this experiment different than just having the whole stalk in 1 color?",
        "Experimenting with Other Plants Gather other plants and flowers to test.",
        "Do you think this experiment will work with other plants?",
        "Get some white flowers such as carnations or roses.",
        "Trim the ends of the flower at an angle to help them soak up more water.",
        "If you use a red flower and soak it in blue water, do you think the flower will turn purple?",
        "Fill glasses with colored water.",
        "Just as you did with the celery, fill each glass halfway and add some food coloring.",
        "Because you are using white flowers, you should be able to see the color change very well.",
        "Use bright color combinations for your flowers.",
        "The more food coloring you add, the brighter the flower will be.",
        "Place 1 flower into each glass of water and observe the changes.",
        "Over time, the petals will take up the color of the water in the glass.",
        "The longer you wait, the more color the petals will develop.Try mixing up the flowers and putting them in a different colored glass each day.",
        "What happens to the color of the petals?",
        "You can repeat this experiment with any plant you'd like."
    ]
}