{
    "title": "How to Knit an Ear Warmer Headband",
    "url": "https://www.wikihow.com/Knit-an-Ear-Warmer-Headband",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Knitting and Crochet",
        "Knitting"
    ],
    "methods": [
        {
            "name": "Knitting a Strip Headband",
            "steps": [
                {
                    "headline": "Make a slipknot.",
                    "description": "Loop the yarn around your index and ring finger twice, and then pull the first loop over the second loop. Tighten the tail around the base of the loop and slide it onto your right-hand needle. Then, pull the tail to tighten this loop around the needle. This counts as your first cast on stitch. Using a yarn that has a bit of stretch may help to give your headband some extra stretch. However, just about any type of yarn will work well for this project."
                },
                {
                    "headline": "Cast on the desired number of stitches.",
                    "description": "Loop the yarn around the left-hand needle and insert the right-hand needle into this loop. Loop the yarn over your left-hand knitting needle, and then pull the yarn through this loop to create your second cast on stitch. Keep casting on in this way until you have the desired number of cast on stitches. The number of stitches you cast on will determine the width of the headband. You can make the headband as wide as you like to cover your ears. For example, if you use a super bulky yarn with US size 11 (9 mm) knitting needles, you can cast on 11 stitches for your headband."
                },
                {
                    "headline": "Knit across all rows until the headband is the desired length.",
                    "description": "Insert your right-hand needle through the first stitch on the left-hand needle. Loop the yarn over the left-hand needle and pull this yarn through the stitch. Let the old stitch slide off the end of the needle as the new stitch replaces it. Continue knitting to the end of the row. Knit the other rows in the same way to continue the strip."
                },
                {
                    "headline": "Measure the strip around your head when it is almost finished.",
                    "description": "When the strip looks like it is almost the ideal length, try measuring it around your head to see if it fits. If it is a little too small, knit a few more rows and check again. 18 inches (46 cm) is usually a good length for an adult-sized headband."
                },
                {
                    "headline": "Bind off the last row.",
                    "description": "Once the strip is the desired length to fit around your head, begin your bind off row. Knit the first 2 stitches in the row. Then, use the left-hand needle to lift the first stitch on the right-hand needle over the second stitch. Knit 1 stitch, and then lift the first stitch over the second stitch again. Continue binding off in this way to the end of the row."
                },
                {
                    "headline": "Sew the ends of the headband together.",
                    "description": "Fold the headband in half so the short ends of the headband are lining up. Then, insert the end of the threaded yarn needle through the 2 end stitches, pull the thread until it is taut, and then insert the needle in through the second stitch in the row and out the other side. Keep sewing through the stitches in this way until the ends are secured. Then, tie a knot through the last stitch to secure it, and cut the excess yarn 0.5 inches (1.3 cm) from the knot."
                }
            ]
        },
        {
            "name": "Knitting a Headband in the Round",
            "steps": [
                {
                    "headline": "Cast on 45 stitches in a super bulky yarn.",
                    "description": "Cast on your stitches as you normally would. Make a slipknot and slip it onto the right-hand needle. Then, loop the yarn around the left-hand needle and insert the right-hand needle into the loop. Wrap the working around the tip of the right-hand needle 1 time, and pull this yarn through the loop to create a cast on stitch. Keep casting on until you have 45 stitches."
                },
                {
                    "headline": "Knit the next round as you normally would.",
                    "description": "Insert the right-hand needle through the first cast on stitch on your left-hand needle, and then loop the yarn over the tip of the right-hand needle. Pull this yarn through the loop to create a new stitch. Repeat this to the end of the row."
                },
                {
                    "headline": "Continue knitting until the headband is the desired width.",
                    "description": "This will take around 16 to 20 rounds. You can hold the headband up to your ears to check the width. When the headband is the desired width, start your cast off round."
                },
                {
                    "headline": "Cast off after the last round.",
                    "description": "Knit the first 2 stitches in the round, and then use the left-hand needle to lift the first stitch off of the second stitch. Knit another stitch, and then lift the first stitch over the second stitch again. Keep knitting 1 and bringing the first stitch over the second stitch to bind off all of the stitches."
                },
                {
                    "headline": "Tie off and cut the excess yarn at the end.",
                    "description": "When you are finished binding off your stitches, cut the yarn about 6 inches (15 cm) from the last stitch. Tie a knot through the last stitch using this strand. Then, cut the excess yarn about 0.5 in (1.3 cm) from the last stitch to finish your headband. Try it on and see how it looks!"
                }
            ]
        },
        {
            "name": "Customizing Your Headband",
            "steps": [
                {
                    "headline": "Use a special stitch to add interest.",
                    "description": "If you want to try something more intricate than a basic knit or garter stitch, there are many different stitches to choose from. Some good options include:\nLoopy stitch\nBrioche stitch\nWaffle stitch\nMoss stitch"
                },
                {
                    "headline": "Opt for a textured or variegated yarn.",
                    "description": "Using a special type of yarn can also help you to customize your headband. Look at yarns in different textures and colors to find something that appeals to you. Try using a fluffy yarn for a soft, touchable headband. Opt for a yarn that has metallic thread woven into it for a sparkly headband. Choose a yarn that features different colors throughout."
                },
                {
                    "headline": "Change yarn colors as often as you like.",
                    "description": "If desired, you can also change yarn colors to give the headband a colorful look. Tie the new yarn to the base of the old yarn, cut the old strand about 3 inches (7.6 cm) from the stitch, and then weave the tail in with the new yarn as you continue knitting. Switch colors after you have worked half of the headband if you want to use 2 colors, or switch after every couple of rows for a multi-color striped look."
                },
                {
                    "headline": "Add embellishments to compliment your headband.",
                    "description": "You can sew a button onto your headband as an accent, add a bow in the center of the headband, or weave in some beads! Add whatever you want to make your headband unique. Choose embellishments that will compliment the yarn color. For example, if you knit a purple headband, then you could weave in some yellow beads, add a pink bow, or find a matching purple button. Select embellishments that work well with the yarn’s texture. For example, if you are using a fluffy yarn, make sure to choose an embellishment that will stand out, such as a large gemstone or button."
                }
            ]
        }
    ],
    "tyn": [
        "Knitting a Strip Headband",
        "Yarn",
        "Knitting needles that will work with your yarn (check the yarn label for a size recommendation)",
        "Scissors",
        "Yarn needle",
        "Knitting a Headband in the Round",
        "Circular or double-pointed knitting needles that will work with your yarn (check the yarn label for a size recommendation)"
    ],
    "text": " Knitting a Strip Headband Make a slipknot. Loop the yarn around your index and ring finger twice, and then pull the first loop over the second loop. Tighten the tail around the base of the loop and slide it onto your right-hand needle. Then, pull the tail to tighten this loop around the needle. This counts as your first cast on stitch. Using a yarn that has a bit of stretch may help to give your headband some extra stretch. However, just about any type of yarn will work well for this project. Cast on the desired number of stitches. Loop the yarn around the left-hand needle and insert the right-hand needle into this loop. Loop the yarn over your left-hand knitting needle, and then pull the yarn through this loop to create your second cast on stitch. Keep casting on in this way until you have the desired number of cast on stitches. The number of stitches you cast on will determine the width of the headband. You can make the headband as wide as you like to cover your ears. For example, if you use a super bulky yarn with US size 11 (9 mm) knitting needles, you can cast on 11 stitches for your headband. Knit across all rows until the headband is the desired length. Insert your right-hand needle through the first stitch on the left-hand needle. Loop the yarn over the left-hand needle and pull this yarn through the stitch. Let the old stitch slide off the end of the needle as the new stitch replaces it. Continue knitting to the end of the row. Knit the other rows in the same way to continue the strip. Measure the strip around your head when it is almost finished. When the strip looks like it is almost the ideal length, try measuring it around your head to see if it fits. If it is a little too small, knit a few more rows and check again. 18 inches (46 cm) is usually a good length for an adult-sized headband. Bind off the last row. Once the strip is the desired length to fit around your head, begin your bind off row. Knit the first 2 stitches in the row. Then, use the left-hand needle to lift the first stitch on the right-hand needle over the second stitch. Knit 1 stitch, and then lift the first stitch over the second stitch again. Continue binding off in this way to the end of the row. Sew the ends of the headband together. Fold the headband in half so the short ends of the headband are lining up. Then, insert the end of the threaded yarn needle through the 2 end stitches, pull the thread until it is taut, and then insert the needle in through the second stitch in the row and out the other side. Keep sewing through the stitches in this way until the ends are secured. Then, tie a knot through the last stitch to secure it, and cut the excess yarn 0.5 inches (1.3 cm) from the knot. Knitting a Headband in the Round Cast on 45 stitches in a super bulky yarn. Cast on your stitches as you normally would. Make a slipknot and slip it onto the right-hand needle. Then, loop the yarn around the left-hand needle and insert the right-hand needle into the loop. Wrap the working around the tip of the right-hand needle 1 time, and pull this yarn through the loop to create a cast on stitch. Keep casting on until you have 45 stitches. Knit the next round as you normally would. Insert the right-hand needle through the first cast on stitch on your left-hand needle, and then loop the yarn over the tip of the right-hand needle. Pull this yarn through the loop to create a new stitch. Repeat this to the end of the row. Continue knitting until the headband is the desired width. This will take around 16 to 20 rounds. You can hold the headband up to your ears to check the width. When the headband is the desired width, start your cast off round. Cast off after the last round. Knit the first 2 stitches in the round, and then use the left-hand needle to lift the first stitch off of the second stitch. Knit another stitch, and then lift the first stitch over the second stitch again. Keep knitting 1 and bringing the first stitch over the second stitch to bind off all of the stitches. Tie off and cut the excess yarn at the end. When you are finished binding off your stitches, cut the yarn about 6 inches (15 cm) from the last stitch. Tie a knot through the last stitch using this strand. Then, cut the excess yarn about 0.5 in (1.3 cm) from the last stitch to finish your headband. Try it on and see how it looks! Customizing Your Headband Use a special stitch to add interest. If you want to try something more intricate than a basic knit or garter stitch, there are many different stitches to choose from. Some good options include:\nLoopy stitch\nBrioche stitch\nWaffle stitch\nMoss stitch Opt for a textured or variegated yarn. Using a special type of yarn can also help you to customize your headband. Look at yarns in different textures and colors to find something that appeals to you. Try using a fluffy yarn for a soft, touchable headband. Opt for a yarn that has metallic thread woven into it for a sparkly headband. Choose a yarn that features different colors throughout. Change yarn colors as often as you like. If desired, you can also change yarn colors to give the headband a colorful look. Tie the new yarn to the base of the old yarn, cut the old strand about 3 inches (7.6 cm) from the stitch, and then weave the tail in with the new yarn as you continue knitting. Switch colors after you have worked half of the headband if you want to use 2 colors, or switch after every couple of rows for a multi-color striped look. Add embellishments to compliment your headband. You can sew a button onto your headband as an accent, add a bow in the center of the headband, or weave in some beads! Add whatever you want to make your headband unique. Choose embellishments that will compliment the yarn color. For example, if you knit a purple headband, then you could weave in some yellow beads, add a pink bow, or find a matching purple button. Select embellishments that work well with the yarn’s texture. For example, if you are using a fluffy yarn, make sure to choose an embellishment that will stand out, such as a large gemstone or button.",
    "sentences": [
        " Knitting a Strip Headband Make a slipknot.",
        "Loop the yarn around your index and ring finger twice, and then pull the first loop over the second loop.",
        "Tighten the tail around the base of the loop and slide it onto your right-hand needle.",
        "Then, pull the tail to tighten this loop around the needle.",
        "This counts as your first cast on stitch.",
        "Using a yarn that has a bit of stretch may help to give your headband some extra stretch.",
        "However, just about any type of yarn will work well for this project.",
        "Cast on the desired number of stitches.",
        "Loop the yarn around the left-hand needle and insert the right-hand needle into this loop.",
        "Loop the yarn over your left-hand knitting needle, and then pull the yarn through this loop to create your second cast on stitch.",
        "Keep casting on in this way until you have the desired number of cast on stitches.",
        "The number of stitches you cast on will determine the width of the headband.",
        "You can make the headband as wide as you like to cover your ears.",
        "For example, if you use a super bulky yarn with US size 11 (9 mm) knitting needles, you can cast on 11 stitches for your headband.",
        "Knit across all rows until the headband is the desired length.",
        "Insert your right-hand needle through the first stitch on the left-hand needle.",
        "Loop the yarn over the left-hand needle and pull this yarn through the stitch.",
        "Let the old stitch slide off the end of the needle as the new stitch replaces it.",
        "Continue knitting to the end of the row.",
        "Knit the other rows in the same way to continue the strip.",
        "Measure the strip around your head when it is almost finished.",
        "When the strip looks like it is almost the ideal length, try measuring it around your head to see if it fits.",
        "If it is a little too small, knit a few more rows and check again.",
        "18 inches (46 cm) is usually a good length for an adult-sized headband.",
        "Bind off the last row.",
        "Once the strip is the desired length to fit around your head, begin your bind off row.",
        "Knit the first 2 stitches in the row.",
        "Then, use the left-hand needle to lift the first stitch on the right-hand needle over the second stitch.",
        "Knit 1 stitch, and then lift the first stitch over the second stitch again.",
        "Continue binding off in this way to the end of the row.",
        "Sew the ends of the headband together.",
        "Fold the headband in half so the short ends of the headband are lining up.",
        "Then, insert the end of the threaded yarn needle through the 2 end stitches, pull the thread until it is taut, and then insert the needle in through the second stitch in the row and out the other side.",
        "Keep sewing through the stitches in this way until the ends are secured.",
        "Then, tie a knot through the last stitch to secure it, and cut the excess yarn 0.5 inches (1.3 cm) from the knot.",
        "Knitting a Headband in the Round Cast on 45 stitches in a super bulky yarn.",
        "Cast on your stitches as you normally would.",
        "Make a slipknot and slip it onto the right-hand needle.",
        "Then, loop the yarn around the left-hand needle and insert the right-hand needle into the loop.",
        "Wrap the working around the tip of the right-hand needle 1 time, and pull this yarn through the loop to create a cast on stitch.",
        "Keep casting on until you have 45 stitches.",
        "Knit the next round as you normally would.",
        "Insert the right-hand needle through the first cast on stitch on your left-hand needle, and then loop the yarn over the tip of the right-hand needle.",
        "Pull this yarn through the loop to create a new stitch.",
        "Repeat this to the end of the row.",
        "Continue knitting until the headband is the desired width.",
        "This will take around 16 to 20 rounds.",
        "You can hold the headband up to your ears to check the width.",
        "When the headband is the desired width, start your cast off round.",
        "Cast off after the last round.",
        "Knit the first 2 stitches in the round, and then use the left-hand needle to lift the first stitch off of the second stitch.",
        "Knit another stitch, and then lift the first stitch over the second stitch again.",
        "Keep knitting 1 and bringing the first stitch over the second stitch to bind off all of the stitches.",
        "Tie off and cut the excess yarn at the end.",
        "When you are finished binding off your stitches, cut the yarn about 6 inches (15 cm) from the last stitch.",
        "Tie a knot through the last stitch using this strand.",
        "Then, cut the excess yarn about 0.5 in (1.3 cm) from the last stitch to finish your headband.",
        "Try it on and see how it looks!",
        "Customizing Your Headband Use a special stitch to add interest.",
        "If you want to try something more intricate than a basic knit or garter stitch, there are many different stitches to choose from.",
        "Some good options include:\nLoopy stitch\nBrioche stitch\nWaffle stitch\nMoss stitch Opt for a textured or variegated yarn.",
        "Using a special type of yarn can also help you to customize your headband.",
        "Look at yarns in different textures and colors to find something that appeals to you.",
        "Try using a fluffy yarn for a soft, touchable headband.",
        "Opt for a yarn that has metallic thread woven into it for a sparkly headband.",
        "Choose a yarn that features different colors throughout.",
        "Change yarn colors as often as you like.",
        "If desired, you can also change yarn colors to give the headband a colorful look.",
        "Tie the new yarn to the base of the old yarn, cut the old strand about 3 inches (7.6 cm) from the stitch, and then weave the tail in with the new yarn as you continue knitting.",
        "Switch colors after you have worked half of the headband if you want to use 2 colors, or switch after every couple of rows for a multi-color striped look.",
        "Add embellishments to compliment your headband.",
        "You can sew a button onto your headband as an accent, add a bow in the center of the headband, or weave in some beads!",
        "Add whatever you want to make your headband unique.",
        "Choose embellishments that will compliment the yarn color.",
        "For example, if you knit a purple headband, then you could weave in some yellow beads, add a pink bow, or find a matching purple button.",
        "Select embellishments that work well with the yarn’s texture.",
        "For example, if you are using a fluffy yarn, make sure to choose an embellishment that will stand out, such as a large gemstone or button."
    ]
}