{
    "title": "How to Start Yoga at Home",
    "url": "https://www.wikihow.com/Start-Yoga-at-Home",
    "category_hierarchy": [
        "Health",
        "Alternative Health",
        "Yoga"
    ],
    "methods": [
        {
            "name": "Creating a Relaxing Space",
            "steps": [
                {
                    "headline": "Use a quiet room free of distractions.",
                    "description": "Choose a room in your home where you can do yoga sessions for 20-30 minutes at a time. Try to find a place where other members of your household won’t distract you. Keep your room at a consistent and comfortable temperature. Pick a room that has hardwood or tile flooring if you can. That way, you can feel more balanced than if you were practicing on carpet. If you don’t have a room you can dedicate to yoga, use a quiet corner in a bedroom where you have space to stretch out."
                },
                {
                    "headline": "Turn on soft lights to set a relaxing mood throughout your space.",
                    "description": "Lights that are too harsh can affect your mood and make it more difficult to focus. Pick soft lighting options, like candles or incandescent bulbs, to keep around the room where you plan on practicing yoga. Try to find a space with large windows so you get natural lighting while you do yoga. If the sun gets too bright, use a sheer curtain to filter the light."
                },
                {
                    "headline": "Choose nature sounds or calming music to play while you do yoga.",
                    "description": "Find music or sounds that have an atmospheric quality so you can feel relaxed. Consider listening to nature sounds, relaxing hand drums, or Eastern-influenced music. Keep your speakers in a part of your room where the sound distributes evenly.. Turn off any phones or alarms that may cause distracting sounds while you’re doing yoga. Avoid using pop or rock music since it may be too energetic while trying to do yoga."
                },
                {
                    "headline": "Put a focal point in your room for a place to focus on.",
                    "description": "If your room is empty, you may get restless while you’re practicing yoga. Choose a point in your room, such as a calming painting or figure, so you have an area to focus on when you’re holding poses. Stick to using blues and earth tones so you don’t get distracted by bright colors. Avoid putting too many things in your room since it will seem cluttered and less calming.Tip: If you have a room dedicated to practicing yoga, put focal points in the north, south, east, and west directions so you have a focal point to look at no matter the pose you’re holding."
                },
                {
                    "headline": "Lay a yoga mat on the floor where you have room to stretch out.",
                    "description": "Pick out a thick yoga mat that has grips on the bottom so it doesn’t move around while you’re holding poses. Lay the mat out in a place where you’re able to fully extend your arms around you. Yoga mats can be purchased from any fitness store or online. If you don’t have a room that’s dedicated to practicing yoga, roll up your mat after each session so it doesn’t take up the space. If you don’t have a yoga mat, you can still practice yoga if you lay another non-slip material on your floor."
                }
            ]
        },
        {
            "name": "Practicing Basic Yoga Poses",
            "steps": [
                {
                    "headline": "Try the mountain pose to feel more grounded.",
                    "description": "Stand with your feet close together or spread out to hip width. Lift up your toes and spread them out as far as you can. Keep your weight balanced so you aren’t leaning to one side. Relax your shoulders and keep your hands at your sides. Hold the pose for 5-8 breaths. Mountain pose helps improve posture and stability."
                },
                {
                    "headline": "Practice the tree pose to develop a sense of balance.",
                    "description": "Balance your weight on one of your feet and lift the opposite leg in front of you. Grab onto your knee and pull it to the side of your body. Set your raised foot against the leg you’re balancing on above or below your knee. Put your hands in front of your chest in a prayer position so your elbows point out and your shoulders are relaxed. Hold the pose for 3-5 breaths. Avoid pressing on your knee joint so you don’t cause any strain."
                },
                {
                    "headline": "Do warrior poses to stretch your hips and thighs.",
                    "description": "From a standing position, spread your legs 3–4 ft (91–122 cm) apart and turn your front foot 90 degrees. Lower your body so your front leg makes a 90-degree angle at the knee and your back foot is flat on the ground. Slowly raise your arms over your head so your palms are touching. Hold the pose for 5-8 breaths before switching legs. Trying Warrior Pose II\nWhile you’re in your warrior pose, instead of raising your arms over your head, extend them straight out on each side of your body. Hold the pose for 8-10 breaths before switching your front foot."
                },
                {
                    "headline": "Try the child’s pose to relieve stress.",
                    "description": "Kneel on your yoga mat so your knees are as wide as your mat and your big toes are touching. Lean forward so your belly is on your thighs and your arms are fully extended in front of you. Rest your head on the mat and hold the pose for 5-8 breaths. You may also keep your arms on your sides pointing behind you if you don’t want to stretch your back."
                },
                {
                    "headline": "Use the downward dog pose to stretch the entire body.",
                    "description": "From your child’s pose position, walk your feet underneath your legs and press on the ground with your hands. Keep your feet hip-width apart and your legs straight so your body forms a 90-degree angle to the ground. Hold the child’s pose for 4-8 breaths. Don’t do the downward dog pose if you have chronic pain in your back, hips, arms, or shoulders."
                },
                {
                    "headline": "Stretch your back using the bridge pose.",
                    "description": "Lie on your back so your knees are up and your feet are flat on the ground near your buttocks. Lift your tailbone up so your knees make a 90-degree angle, putting pressure on your heels. Lace your fingers on the floor underneath you for extra support. Hold the pose for 4-5 breaths. Do not do the bridge pose if you have chronic back pain."
                }
            ]
        },
        {
            "name": "Following a Routine",
            "steps": [
                {
                    "headline": "Try to do yoga at least 3 times per week.",
                    "description": "Make a regular routine out of doing yoga at a set time for 3 days out of the week. Make sure you have enough time to practice a few poses with each session so you can destress and stretch. Let other people in your household know when you plan on doing yoga so they know to stay quiet so you can relax. If you feel comfortable doing it, you may also practice yoga every day."
                },
                {
                    "headline": "Try doing different poses each session.",
                    "description": "Start your yoga routine with 2-3 poses that you’re familiar with and comfortable doing. Then, try new poses that you haven’t done before so you can keep learning and progressing. After you try a pose for the first time, include it in your routine more often so you have a chance to practice and perfect it. Once can do a certain pose with ease, cycle it out of your routine for a few sessions so you have time to practice new poses."
                },
                {
                    "headline": "Look for yoga videos online to follow along with.",
                    "description": "Many yoga instructors offer free videos online that you can follow along with if you don’t have a set routine. Look for sessions that are in your skill level so you don’t put extra strain on your body. Practice your poses through the entire video, including the warm up and cool down. Many yoga videos can be found on YouTube, and they are great ways to learn new poses to practice."
                },
                {
                    "headline": "Consider signing up for virtual yoga classes online.",
                    "description": "If you want to stay home rather than going to a studio, you can find various classes online. Some of the classes are free while others may require a subscription fee. Look for classes at your skill level so you don’t get overwhelmed or have poses that you can’t perform. Some popular online classes can be found on DoYogaWithMe or Yoga International. Many online yoga classes will have set goals so you can track your progress.Tip: Some phone apps, such as Yoga Studio, Down Dog, or Pocket Yoga, are great sources for yoga routines as well."
                }
            ]
        }
    ],
    "tyn": [
        "Soft lights",
        "Candles",
        "Speaker or music player",
        "Yoga mat"
    ],
    "text": " Creating a Relaxing Space Use a quiet room free of distractions. Choose a room in your home where you can do yoga sessions for 20-30 minutes at a time. Try to find a place where other members of your household won’t distract you. Keep your room at a consistent and comfortable temperature. Pick a room that has hardwood or tile flooring if you can. That way, you can feel more balanced than if you were practicing on carpet. If you don’t have a room you can dedicate to yoga, use a quiet corner in a bedroom where you have space to stretch out. Turn on soft lights to set a relaxing mood throughout your space. Lights that are too harsh can affect your mood and make it more difficult to focus. Pick soft lighting options, like candles or incandescent bulbs, to keep around the room where you plan on practicing yoga. Try to find a space with large windows so you get natural lighting while you do yoga. If the sun gets too bright, use a sheer curtain to filter the light. Choose nature sounds or calming music to play while you do yoga. Find music or sounds that have an atmospheric quality so you can feel relaxed. Consider listening to nature sounds, relaxing hand drums, or Eastern-influenced music. Keep your speakers in a part of your room where the sound distributes evenly.. Turn off any phones or alarms that may cause distracting sounds while you’re doing yoga. Avoid using pop or rock music since it may be too energetic while trying to do yoga. Put a focal point in your room for a place to focus on. If your room is empty, you may get restless while you’re practicing yoga. Choose a point in your room, such as a calming painting or figure, so you have an area to focus on when you’re holding poses. Stick to using blues and earth tones so you don’t get distracted by bright colors. Avoid putting too many things in your room since it will seem cluttered and less calming.Tip: If you have a room dedicated to practicing yoga, put focal points in the north, south, east, and west directions so you have a focal point to look at no matter the pose you’re holding. Lay a yoga mat on the floor where you have room to stretch out. Pick out a thick yoga mat that has grips on the bottom so it doesn’t move around while you’re holding poses. Lay the mat out in a place where you’re able to fully extend your arms around you. Yoga mats can be purchased from any fitness store or online. If you don’t have a room that’s dedicated to practicing yoga, roll up your mat after each session so it doesn’t take up the space. If you don’t have a yoga mat, you can still practice yoga if you lay another non-slip material on your floor. Practicing Basic Yoga Poses Try the mountain pose to feel more grounded. Stand with your feet close together or spread out to hip width. Lift up your toes and spread them out as far as you can. Keep your weight balanced so you aren’t leaning to one side. Relax your shoulders and keep your hands at your sides. Hold the pose for 5-8 breaths. Mountain pose helps improve posture and stability. Practice the tree pose to develop a sense of balance. Balance your weight on one of your feet and lift the opposite leg in front of you. Grab onto your knee and pull it to the side of your body. Set your raised foot against the leg you’re balancing on above or below your knee. Put your hands in front of your chest in a prayer position so your elbows point out and your shoulders are relaxed. Hold the pose for 3-5 breaths. Avoid pressing on your knee joint so you don’t cause any strain. Do warrior poses to stretch your hips and thighs. From a standing position, spread your legs 3–4 ft (91–122 cm) apart and turn your front foot 90 degrees. Lower your body so your front leg makes a 90-degree angle at the knee and your back foot is flat on the ground. Slowly raise your arms over your head so your palms are touching. Hold the pose for 5-8 breaths before switching legs. Trying Warrior Pose II\nWhile you’re in your warrior pose, instead of raising your arms over your head, extend them straight out on each side of your body. Hold the pose for 8-10 breaths before switching your front foot. Try the child’s pose to relieve stress. Kneel on your yoga mat so your knees are as wide as your mat and your big toes are touching. Lean forward so your belly is on your thighs and your arms are fully extended in front of you. Rest your head on the mat and hold the pose for 5-8 breaths. You may also keep your arms on your sides pointing behind you if you don’t want to stretch your back. Use the downward dog pose to stretch the entire body. From your child’s pose position, walk your feet underneath your legs and press on the ground with your hands. Keep your feet hip-width apart and your legs straight so your body forms a 90-degree angle to the ground. Hold the child’s pose for 4-8 breaths. Don’t do the downward dog pose if you have chronic pain in your back, hips, arms, or shoulders. Stretch your back using the bridge pose. Lie on your back so your knees are up and your feet are flat on the ground near your buttocks. Lift your tailbone up so your knees make a 90-degree angle, putting pressure on your heels. Lace your fingers on the floor underneath you for extra support. Hold the pose for 4-5 breaths. Do not do the bridge pose if you have chronic back pain. Following a Routine Try to do yoga at least 3 times per week. Make a regular routine out of doing yoga at a set time for 3 days out of the week. Make sure you have enough time to practice a few poses with each session so you can destress and stretch. Let other people in your household know when you plan on doing yoga so they know to stay quiet so you can relax. If you feel comfortable doing it, you may also practice yoga every day. Try doing different poses each session. Start your yoga routine with 2-3 poses that you’re familiar with and comfortable doing. Then, try new poses that you haven’t done before so you can keep learning and progressing. After you try a pose for the first time, include it in your routine more often so you have a chance to practice and perfect it. Once can do a certain pose with ease, cycle it out of your routine for a few sessions so you have time to practice new poses. Look for yoga videos online to follow along with. Many yoga instructors offer free videos online that you can follow along with if you don’t have a set routine. Look for sessions that are in your skill level so you don’t put extra strain on your body. Practice your poses through the entire video, including the warm up and cool down. Many yoga videos can be found on YouTube, and they are great ways to learn new poses to practice. Consider signing up for virtual yoga classes online. If you want to stay home rather than going to a studio, you can find various classes online. Some of the classes are free while others may require a subscription fee. Look for classes at your skill level so you don’t get overwhelmed or have poses that you can’t perform. Some popular online classes can be found on DoYogaWithMe or Yoga International. Many online yoga classes will have set goals so you can track your progress.Tip: Some phone apps, such as Yoga Studio, Down Dog, or Pocket Yoga, are great sources for yoga routines as well.",
    "sentences": [
        " Creating a Relaxing Space Use a quiet room free of distractions.",
        "Choose a room in your home where you can do yoga sessions for 20-30 minutes at a time.",
        "Try to find a place where other members of your household won’t distract you.",
        "Keep your room at a consistent and comfortable temperature.",
        "Pick a room that has hardwood or tile flooring if you can.",
        "That way, you can feel more balanced than if you were practicing on carpet.",
        "If you don’t have a room you can dedicate to yoga, use a quiet corner in a bedroom where you have space to stretch out.",
        "Turn on soft lights to set a relaxing mood throughout your space.",
        "Lights that are too harsh can affect your mood and make it more difficult to focus.",
        "Pick soft lighting options, like candles or incandescent bulbs, to keep around the room where you plan on practicing yoga.",
        "Try to find a space with large windows so you get natural lighting while you do yoga.",
        "If the sun gets too bright, use a sheer curtain to filter the light.",
        "Choose nature sounds or calming music to play while you do yoga.",
        "Find music or sounds that have an atmospheric quality so you can feel relaxed.",
        "Consider listening to nature sounds, relaxing hand drums, or Eastern-influenced music.",
        "Keep your speakers in a part of your room where the sound distributes evenly..",
        "Turn off any phones or alarms that may cause distracting sounds while you’re doing yoga.",
        "Avoid using pop or rock music since it may be too energetic while trying to do yoga.",
        "Put a focal point in your room for a place to focus on.",
        "If your room is empty, you may get restless while you’re practicing yoga.",
        "Choose a point in your room, such as a calming painting or figure, so you have an area to focus on when you’re holding poses.",
        "Stick to using blues and earth tones so you don’t get distracted by bright colors.",
        "Avoid putting too many things in your room since it will seem cluttered and less calming.Tip: If you have a room dedicated to practicing yoga, put focal points in the north, south, east, and west directions so you have a focal point to look at no matter the pose you’re holding.",
        "Lay a yoga mat on the floor where you have room to stretch out.",
        "Pick out a thick yoga mat that has grips on the bottom so it doesn’t move around while you’re holding poses.",
        "Lay the mat out in a place where you’re able to fully extend your arms around you.",
        "Yoga mats can be purchased from any fitness store or online.",
        "If you don’t have a room that’s dedicated to practicing yoga, roll up your mat after each session so it doesn’t take up the space.",
        "If you don’t have a yoga mat, you can still practice yoga if you lay another non-slip material on your floor.",
        "Practicing Basic Yoga Poses Try the mountain pose to feel more grounded.",
        "Stand with your feet close together or spread out to hip width.",
        "Lift up your toes and spread them out as far as you can.",
        "Keep your weight balanced so you aren’t leaning to one side.",
        "Relax your shoulders and keep your hands at your sides.",
        "Hold the pose for 5-8 breaths.",
        "Mountain pose helps improve posture and stability.",
        "Practice the tree pose to develop a sense of balance.",
        "Balance your weight on one of your feet and lift the opposite leg in front of you.",
        "Grab onto your knee and pull it to the side of your body.",
        "Set your raised foot against the leg you’re balancing on above or below your knee.",
        "Put your hands in front of your chest in a prayer position so your elbows point out and your shoulders are relaxed.",
        "Hold the pose for 3-5 breaths.",
        "Avoid pressing on your knee joint so you don’t cause any strain.",
        "Do warrior poses to stretch your hips and thighs.",
        "From a standing position, spread your legs 3–4 ft (91–122 cm) apart and turn your front foot 90 degrees.",
        "Lower your body so your front leg makes a 90-degree angle at the knee and your back foot is flat on the ground.",
        "Slowly raise your arms over your head so your palms are touching.",
        "Hold the pose for 5-8 breaths before switching legs.",
        "Trying Warrior Pose II\nWhile you’re in your warrior pose, instead of raising your arms over your head, extend them straight out on each side of your body.",
        "Hold the pose for 8-10 breaths before switching your front foot.",
        "Try the child’s pose to relieve stress.",
        "Kneel on your yoga mat so your knees are as wide as your mat and your big toes are touching.",
        "Lean forward so your belly is on your thighs and your arms are fully extended in front of you.",
        "Rest your head on the mat and hold the pose for 5-8 breaths.",
        "You may also keep your arms on your sides pointing behind you if you don’t want to stretch your back.",
        "Use the downward dog pose to stretch the entire body.",
        "From your child’s pose position, walk your feet underneath your legs and press on the ground with your hands.",
        "Keep your feet hip-width apart and your legs straight so your body forms a 90-degree angle to the ground.",
        "Hold the child’s pose for 4-8 breaths.",
        "Don’t do the downward dog pose if you have chronic pain in your back, hips, arms, or shoulders.",
        "Stretch your back using the bridge pose.",
        "Lie on your back so your knees are up and your feet are flat on the ground near your buttocks.",
        "Lift your tailbone up so your knees make a 90-degree angle, putting pressure on your heels.",
        "Lace your fingers on the floor underneath you for extra support.",
        "Hold the pose for 4-5 breaths.",
        "Do not do the bridge pose if you have chronic back pain.",
        "Following a Routine Try to do yoga at least 3 times per week.",
        "Make a regular routine out of doing yoga at a set time for 3 days out of the week.",
        "Make sure you have enough time to practice a few poses with each session so you can destress and stretch.",
        "Let other people in your household know when you plan on doing yoga so they know to stay quiet so you can relax.",
        "If you feel comfortable doing it, you may also practice yoga every day.",
        "Try doing different poses each session.",
        "Start your yoga routine with 2-3 poses that you’re familiar with and comfortable doing.",
        "Then, try new poses that you haven’t done before so you can keep learning and progressing.",
        "After you try a pose for the first time, include it in your routine more often so you have a chance to practice and perfect it.",
        "Once can do a certain pose with ease, cycle it out of your routine for a few sessions so you have time to practice new poses.",
        "Look for yoga videos online to follow along with.",
        "Many yoga instructors offer free videos online that you can follow along with if you don’t have a set routine.",
        "Look for sessions that are in your skill level so you don’t put extra strain on your body.",
        "Practice your poses through the entire video, including the warm up and cool down.",
        "Many yoga videos can be found on YouTube, and they are great ways to learn new poses to practice.",
        "Consider signing up for virtual yoga classes online.",
        "If you want to stay home rather than going to a studio, you can find various classes online.",
        "Some of the classes are free while others may require a subscription fee.",
        "Look for classes at your skill level so you don’t get overwhelmed or have poses that you can’t perform.",
        "Some popular online classes can be found on DoYogaWithMe or Yoga International.",
        "Many online yoga classes will have set goals so you can track your progress.Tip: Some phone apps, such as Yoga Studio, Down Dog, or Pocket Yoga, are great sources for yoga routines as well."
    ]
}