{
    "title": "How to File for Unemployment in Oklahoma",
    "url": "https://www.wikihow.com/File-for-Unemployment-in-Oklahoma",
    "category_hierarchy": [
        "Finance and Business",
        "Government",
        "Government Assistance"
    ],
    "parts": [
        {
            "name": "Checking Your Eligibility",
            "steps": [
                {
                    "headline": "Distinguish your reason for being unemployed.",
                    "description": "You will only be eligible to claim unemployment if your termination was not your fault. This means that you have to have been let go by your supervisor due to business closure, or you experienced other similar circumstances. If you quit your job instead of being let go, you must prove that you quit for a justifiable reason, such as being mistreated, not paid for work, or put in a dangerous work environment. If you were terminated for any type of misconduct, it may affect your claim. However, you may still be eligible for unemployment benefits pending an investigation to determine the reason for your termination."
                },
                {
                    "headline": "Determine if you have made at least $1,500 during your base period.",
                    "description": "The base period spans over 1 year and uses the last 4 out of 5 worked calendar quarters before your filing date. You will need to have met Oklahoma’s state income and time requirements to receive unemployment insurance. To see if you qualify, add together all of your pay stubs for the last 4 or 5 months. The base period may not always represent your most recent income. In certain situations, you will be allowed to file your claim using an alternative base period."
                },
                {
                    "headline": "Be able, willing, and available to seek new employment.",
                    "description": "To claim benefits, you must be physically able to look for new employment opportunities and have full-time availability. You are required to take suitable work offers while claiming unemployment benefits. If you receive a job offer and choose not to accept it, you need to provide information proving the offer was not suitable work. For a job to be considered suitable work, it must be something you have experience or training in, and must provide wages similar to what others are being paid in that area. If at any time you are unable to seek employment during the workweek, you should contact Oklahoma’s Unemployment Insurance Service Center. If you decide to enroll in school, you have to be willing to change your class schedule or withdraw if it conflicts with hours you would normally work, or if a job becomes available during those hours."
                },
                {
                    "headline": "Make sure you are actively seeking new employment.",
                    "description": "In the state of Oklahoma, you are required to search for employment for each workweek that you remain unemployed. You will need to keep a detailed record of your work searches and must complete at least 2 employment search efforts a week. The Commissioner will conduct random audits to verify your work search efforts. You want to be as thorough as possible because any misrepresentation of these efforts will be considered fraud and can result in your denial of benefits or incarceration. A weekly work search is considered complete once you apply for 2 jobs and complete your work search log. Keep detailed records for all of your work searches for at least 2 years."
                },
                {
                    "headline": "Register on OK Job-Match before submitting your claim to receive benefits.",
                    "description": "During the duration of your time receiving unemployment benefits, you must register through Oklahoma’s state work search website. This site is very useful because it is designed to help anyone connect with employers and match you with relevant job openings. You can register at https://okjobmatch.com/ada/r/. For help with registration, visit https://www.ok.gov/oesc/documents/How%20to%20Register.pdf. If you are not a resident of Oklahoma, you are required to register for work in your home state. You must provide documentation stating you have registered for work with your state."
                }
            ]
        },
        {
            "name": "Obtaining the Necessary Documents",
            "steps": [
                {
                    "headline": "Have your Social Security Number and Driver’s License on hand.",
                    "description": "When you go to file for unemployment benefits online or via telephone, you will need to provide your Social Security Number and your Oklahoma Driver’s License, or state ID card. These will be used to confirm your identity and ensure that you have not filed for unemployment in any other state. If you are not a citizen of the United States, you must have your registration number and the expiration date. You should always bring hard copies of your documents. You may be required to present them during the filing process."
                },
                {
                    "headline": "Provide all of your current contact information.",
                    "description": "To be considered for unemployment benefits, you must provide your full name, current address, phone number, and email address. Make sure that you provide any prior names, such as married or maiden names. If you do not have a mailing address, phone number, or email, contact your Unemployment Service Center at 405-525-1500, or 800-555-1554 if you are outside of the Oklahoma City area. If your address changes while receiving benefits, you should notify the Unemployment Insurance Service Center right away."
                },
                {
                    "headline": "Obtain any military or Federal government forms, if applicable.",
                    "description": "If you have served in the military or worked for the Federal government within 18 months of applying for unemployment, you need to have certain forms on hand. For those who served in the military, you need the DD Form 214 Member 4 form. If you were employed by the federal government, you must provide Form SF 8 and SF 50. To obtain these forms, visit https://ok.gov/oesc/."
                },
                {
                    "headline": "Provide your most recent employer’s contact information.",
                    "description": "If an employer employed you for at least 15 days during the last 18 months, then you will need to provide a complete list of their contact information. You will also need to provide a statement of why your hours were reduced or why you are no longer employed with that company. Provide the name of the company exactly as it appears on your pay stub or W-2 form. Provide the company’s complete mailing address including the zip code for the location you worked at. Provide the company’s phone number. Provide your supervisor’s name. There is not a minimum amount of hours you need to have worked during your employment."
                },
                {
                    "headline": "Write down all of the employers you’ve had in the last 18 months.",
                    "description": "This information will be used to verify your employment history and wages over the last 18 months. You will need to include all employers including your most recent. Provide the name of all employers exactly as it appears on your pay stub or W-2 form. Provide your start and end dates for each employer. Provide all of your earned wages and if you were paid hourly, weekly, or monthly."
                },
                {
                    "headline": "Gather your bank account information.",
                    "description": "There are two options to receive your payments from unemployment insurance: direct deposit or a debit card. Payments will automatically be issued to a debit card. If you want to use direct deposit, you will need to wait one business day after submitting your claim to set it up. You should make sure you have access to your bank account number and routing number. You can download the direct deposit request form from the Oklahoma Employment Security Commission website at https://www.ok.gov/oesc/Claimants/. You can also set up direct deposit by phone by calling 866-320-8699."
                }
            ]
        },
        {
            "name": "Applying for Unemployment Benefits",
            "steps": [
                {
                    "headline": "File for unemployment online.",
                    "description": "Whether you are filing a claim for the first time or making a change to an existing claim, you can easily apply by visiting the Oklahoma Network Initial Claims website at https://unemployment.state.ok.us. The online system will allow you to file a claim, update contact information, and retrieve information for payment options."
                },
                {
                    "headline": "Use the Oklahoma IVR to file claims by phone.",
                    "description": "This interactive voice response (IVR) system will help you perform many of the same functions as you can online. If you call during regular business hours, you will also have the option to speak to a customer service representative. If you are calling from inside the Oklahoma City area, use 405-525-1500 to call the Oklahoma IVR. For those outside of the Oklahoma City area, the IVR can be reached at 800-555-1554."
                },
                {
                    "headline": "Provide honest answers to all questions.",
                    "description": "During your application process and while receiving benefits, you must provide only honest answers to any questions asked that directly relate to your unemployment case. Any information intentionally withheld, such as income, can result in denial or discontinuation of benefits. You will be required to certify that any information given is true or correct to the best of your knowledge."
                },
                {
                    "headline": "Apply for an appeal if you’re denied.",
                    "description": "If you feel that you have been wrongly denied for unemployment benefits, you have the right to appeal the decision. Make sure to submit your appeal within 10 calendar days from the mailing date of the decision. If your appeal is accepted, you will be paid for the benefits you claimed during the weeks waiting for the appeal decision, so log any benefits you receive. Appeals can be filed by mail, phone, email, or fax. Once your appeal is filed, you will receive a packet with detailed information about your claim and your hearing date. During the hearing, you have the right to testify on your own behalf, ask questions, present documents, and explain any evidence presented against you. You can choose to appear with or without representation. If your appeal is denied, you can appeal the Appeal Tribunal’s decision through the Board of Review. For questions relating to appeals, contact the local Unemployment Services Center at 405-525-1500, and 800-555-1554 for those outside the Oklahoma City area."
                },
                {
                    "headline": "File all weekly claims while receiving unemployment benefits.",
                    "description": "You will need to file a claim for the benefits you are receiving through unemployment every week if you wish to continue to receive unemployment assistance. All claims must be filed no later than 14 days after the end of the week. Failure to do so may result in the denial of future benefits. You can file weekly claims by phone or online. Resources on how to make claims will be provided to you when your unemployment benefits are approved."
                },
                {
                    "headline": "Report any earnings during your time collecting unemployment.",
                    "description": "Any money you make has to be reported the week you earn it. Do not wait until the week you are paid to report it, as the total amount needs to be reported before any deductions are made. You will also need to report any earnings you get from retirement pay. Retirement payments may be eligible to be considered as a deductible. For proper procedures regarding retirement pay, contact the Unemployment Insurance Service Center."
                },
                {
                    "headline": "Understand the amount and duration of your benefits upon approval.",
                    "description": "While collecting benefits, you will receive a weekly amount that is 1/23rd of your highest quarter of taxable wages during your base period. Another option the state of Oklahoma gives is to provide you with the maximum amount permitted by Oklahoma law. You can receive benefits for a maximum of 26 weeks. Per Oklahoma’s regulations, the minimum amount you can receive each week is $16. During times of high unemployment rates, you may be eligible to collect benefits for longer than 26 weeks. You may be able to apply for assistance with your medical insurance while receiving benefits. Contact Oklahoma’s Unemployment Services at 405-525-1500 for more information."
                }
            ]
        }
    ],
    "tyn": [
        "Your Social Security Number",
        "Your valid Diver’s License",
        "Current contact information including your mailing address, phone number, and email address",
        "Most recent employment information",
        "List of your employers for the last 18 months",
        "Current bank account information",
        "Any military of Federal government forms, if applicable"
    ],
    "text": " Checking Your Eligibility Distinguish your reason for being unemployed. You will only be eligible to claim unemployment if your termination was not your fault. This means that you have to have been let go by your supervisor due to business closure, or you experienced other similar circumstances. If you quit your job instead of being let go, you must prove that you quit for a justifiable reason, such as being mistreated, not paid for work, or put in a dangerous work environment. If you were terminated for any type of misconduct, it may affect your claim. However, you may still be eligible for unemployment benefits pending an investigation to determine the reason for your termination. Determine if you have made at least $1,500 during your base period. The base period spans over 1 year and uses the last 4 out of 5 worked calendar quarters before your filing date. You will need to have met Oklahoma’s state income and time requirements to receive unemployment insurance. To see if you qualify, add together all of your pay stubs for the last 4 or 5 months. The base period may not always represent your most recent income. In certain situations, you will be allowed to file your claim using an alternative base period. Be able, willing, and available to seek new employment. To claim benefits, you must be physically able to look for new employment opportunities and have full-time availability. You are required to take suitable work offers while claiming unemployment benefits. If you receive a job offer and choose not to accept it, you need to provide information proving the offer was not suitable work. For a job to be considered suitable work, it must be something you have experience or training in, and must provide wages similar to what others are being paid in that area. If at any time you are unable to seek employment during the workweek, you should contact Oklahoma’s Unemployment Insurance Service Center. If you decide to enroll in school, you have to be willing to change your class schedule or withdraw if it conflicts with hours you would normally work, or if a job becomes available during those hours. Make sure you are actively seeking new employment. In the state of Oklahoma, you are required to search for employment for each workweek that you remain unemployed. You will need to keep a detailed record of your work searches and must complete at least 2 employment search efforts a week. The Commissioner will conduct random audits to verify your work search efforts. You want to be as thorough as possible because any misrepresentation of these efforts will be considered fraud and can result in your denial of benefits or incarceration. A weekly work search is considered complete once you apply for 2 jobs and complete your work search log. Keep detailed records for all of your work searches for at least 2 years. Register on OK Job-Match before submitting your claim to receive benefits. During the duration of your time receiving unemployment benefits, you must register through Oklahoma’s state work search website. This site is very useful because it is designed to help anyone connect with employers and match you with relevant job openings. You can register at https://okjobmatch.com/ada/r/. For help with registration, visit https://www.ok.gov/oesc/documents/How%20to%20Register.pdf. If you are not a resident of Oklahoma, you are required to register for work in your home state. You must provide documentation stating you have registered for work with your state. Obtaining the Necessary Documents Have your Social Security Number and Driver’s License on hand. When you go to file for unemployment benefits online or via telephone, you will need to provide your Social Security Number and your Oklahoma Driver’s License, or state ID card. These will be used to confirm your identity and ensure that you have not filed for unemployment in any other state. If you are not a citizen of the United States, you must have your registration number and the expiration date. You should always bring hard copies of your documents. You may be required to present them during the filing process. Provide all of your current contact information. To be considered for unemployment benefits, you must provide your full name, current address, phone number, and email address. Make sure that you provide any prior names, such as married or maiden names. If you do not have a mailing address, phone number, or email, contact your Unemployment Service Center at 405-525-1500, or 800-555-1554 if you are outside of the Oklahoma City area. If your address changes while receiving benefits, you should notify the Unemployment Insurance Service Center right away. Obtain any military or Federal government forms, if applicable. If you have served in the military or worked for the Federal government within 18 months of applying for unemployment, you need to have certain forms on hand. For those who served in the military, you need the DD Form 214 Member 4 form. If you were employed by the federal government, you must provide Form SF 8 and SF 50. To obtain these forms, visit https://ok.gov/oesc/. Provide your most recent employer’s contact information. If an employer employed you for at least 15 days during the last 18 months, then you will need to provide a complete list of their contact information. You will also need to provide a statement of why your hours were reduced or why you are no longer employed with that company. Provide the name of the company exactly as it appears on your pay stub or W-2 form. Provide the company’s complete mailing address including the zip code for the location you worked at. Provide the company’s phone number. Provide your supervisor’s name. There is not a minimum amount of hours you need to have worked during your employment. Write down all of the employers you’ve had in the last 18 months. This information will be used to verify your employment history and wages over the last 18 months. You will need to include all employers including your most recent. Provide the name of all employers exactly as it appears on your pay stub or W-2 form. Provide your start and end dates for each employer. Provide all of your earned wages and if you were paid hourly, weekly, or monthly. Gather your bank account information. There are two options to receive your payments from unemployment insurance: direct deposit or a debit card. Payments will automatically be issued to a debit card. If you want to use direct deposit, you will need to wait one business day after submitting your claim to set it up. You should make sure you have access to your bank account number and routing number. You can download the direct deposit request form from the Oklahoma Employment Security Commission website at https://www.ok.gov/oesc/Claimants/. You can also set up direct deposit by phone by calling 866-320-8699. Applying for Unemployment Benefits File for unemployment online. Whether you are filing a claim for the first time or making a change to an existing claim, you can easily apply by visiting the Oklahoma Network Initial Claims website at https://unemployment.state.ok.us. The online system will allow you to file a claim, update contact information, and retrieve information for payment options. Use the Oklahoma IVR to file claims by phone. This interactive voice response (IVR) system will help you perform many of the same functions as you can online. If you call during regular business hours, you will also have the option to speak to a customer service representative. If you are calling from inside the Oklahoma City area, use 405-525-1500 to call the Oklahoma IVR. For those outside of the Oklahoma City area, the IVR can be reached at 800-555-1554. Provide honest answers to all questions. During your application process and while receiving benefits, you must provide only honest answers to any questions asked that directly relate to your unemployment case. Any information intentionally withheld, such as income, can result in denial or discontinuation of benefits. You will be required to certify that any information given is true or correct to the best of your knowledge. Apply for an appeal if you’re denied. If you feel that you have been wrongly denied for unemployment benefits, you have the right to appeal the decision. Make sure to submit your appeal within 10 calendar days from the mailing date of the decision. If your appeal is accepted, you will be paid for the benefits you claimed during the weeks waiting for the appeal decision, so log any benefits you receive. Appeals can be filed by mail, phone, email, or fax. Once your appeal is filed, you will receive a packet with detailed information about your claim and your hearing date. During the hearing, you have the right to testify on your own behalf, ask questions, present documents, and explain any evidence presented against you. You can choose to appear with or without representation. If your appeal is denied, you can appeal the Appeal Tribunal’s decision through the Board of Review. For questions relating to appeals, contact the local Unemployment Services Center at 405-525-1500, and 800-555-1554 for those outside the Oklahoma City area. File all weekly claims while receiving unemployment benefits. You will need to file a claim for the benefits you are receiving through unemployment every week if you wish to continue to receive unemployment assistance. All claims must be filed no later than 14 days after the end of the week. Failure to do so may result in the denial of future benefits. You can file weekly claims by phone or online. Resources on how to make claims will be provided to you when your unemployment benefits are approved. Report any earnings during your time collecting unemployment. Any money you make has to be reported the week you earn it. Do not wait until the week you are paid to report it, as the total amount needs to be reported before any deductions are made. You will also need to report any earnings you get from retirement pay. Retirement payments may be eligible to be considered as a deductible. For proper procedures regarding retirement pay, contact the Unemployment Insurance Service Center. Understand the amount and duration of your benefits upon approval. While collecting benefits, you will receive a weekly amount that is 1/23rd of your highest quarter of taxable wages during your base period. Another option the state of Oklahoma gives is to provide you with the maximum amount permitted by Oklahoma law. You can receive benefits for a maximum of 26 weeks. Per Oklahoma’s regulations, the minimum amount you can receive each week is $16. During times of high unemployment rates, you may be eligible to collect benefits for longer than 26 weeks. You may be able to apply for assistance with your medical insurance while receiving benefits. Contact Oklahoma’s Unemployment Services at 405-525-1500 for more information.",
    "sentences": [
        " Checking Your Eligibility Distinguish your reason for being unemployed.",
        "You will only be eligible to claim unemployment if your termination was not your fault.",
        "This means that you have to have been let go by your supervisor due to business closure, or you experienced other similar circumstances.",
        "If you quit your job instead of being let go, you must prove that you quit for a justifiable reason, such as being mistreated, not paid for work, or put in a dangerous work environment.",
        "If you were terminated for any type of misconduct, it may affect your claim.",
        "However, you may still be eligible for unemployment benefits pending an investigation to determine the reason for your termination.",
        "Determine if you have made at least $1,500 during your base period.",
        "The base period spans over 1 year and uses the last 4 out of 5 worked calendar quarters before your filing date.",
        "You will need to have met Oklahoma’s state income and time requirements to receive unemployment insurance.",
        "To see if you qualify, add together all of your pay stubs for the last 4 or 5 months.",
        "The base period may not always represent your most recent income.",
        "In certain situations, you will be allowed to file your claim using an alternative base period.",
        "Be able, willing, and available to seek new employment.",
        "To claim benefits, you must be physically able to look for new employment opportunities and have full-time availability.",
        "You are required to take suitable work offers while claiming unemployment benefits.",
        "If you receive a job offer and choose not to accept it, you need to provide information proving the offer was not suitable work.",
        "For a job to be considered suitable work, it must be something you have experience or training in, and must provide wages similar to what others are being paid in that area.",
        "If at any time you are unable to seek employment during the workweek, you should contact Oklahoma’s Unemployment Insurance Service Center.",
        "If you decide to enroll in school, you have to be willing to change your class schedule or withdraw if it conflicts with hours you would normally work, or if a job becomes available during those hours.",
        "Make sure you are actively seeking new employment.",
        "In the state of Oklahoma, you are required to search for employment for each workweek that you remain unemployed.",
        "You will need to keep a detailed record of your work searches and must complete at least 2 employment search efforts a week.",
        "The Commissioner will conduct random audits to verify your work search efforts.",
        "You want to be as thorough as possible because any misrepresentation of these efforts will be considered fraud and can result in your denial of benefits or incarceration.",
        "A weekly work search is considered complete once you apply for 2 jobs and complete your work search log.",
        "Keep detailed records for all of your work searches for at least 2 years.",
        "Register on OK Job-Match before submitting your claim to receive benefits.",
        "During the duration of your time receiving unemployment benefits, you must register through Oklahoma’s state work search website.",
        "This site is very useful because it is designed to help anyone connect with employers and match you with relevant job openings.",
        "You can register at https://okjobmatch.com/ada/r/.",
        "For help with registration, visit https://www.ok.gov/oesc/documents/How%20to%20Register.pdf.",
        "If you are not a resident of Oklahoma, you are required to register for work in your home state.",
        "You must provide documentation stating you have registered for work with your state.",
        "Obtaining the Necessary Documents Have your Social Security Number and Driver’s License on hand.",
        "When you go to file for unemployment benefits online or via telephone, you will need to provide your Social Security Number and your Oklahoma Driver’s License, or state ID card.",
        "These will be used to confirm your identity and ensure that you have not filed for unemployment in any other state.",
        "If you are not a citizen of the United States, you must have your registration number and the expiration date.",
        "You should always bring hard copies of your documents.",
        "You may be required to present them during the filing process.",
        "Provide all of your current contact information.",
        "To be considered for unemployment benefits, you must provide your full name, current address, phone number, and email address.",
        "Make sure that you provide any prior names, such as married or maiden names.",
        "If you do not have a mailing address, phone number, or email, contact your Unemployment Service Center at 405-525-1500, or 800-555-1554 if you are outside of the Oklahoma City area.",
        "If your address changes while receiving benefits, you should notify the Unemployment Insurance Service Center right away.",
        "Obtain any military or Federal government forms, if applicable.",
        "If you have served in the military or worked for the Federal government within 18 months of applying for unemployment, you need to have certain forms on hand.",
        "For those who served in the military, you need the DD Form 214 Member 4 form.",
        "If you were employed by the federal government, you must provide Form SF 8 and SF 50.",
        "To obtain these forms, visit https://ok.gov/oesc/.",
        "Provide your most recent employer’s contact information.",
        "If an employer employed you for at least 15 days during the last 18 months, then you will need to provide a complete list of their contact information.",
        "You will also need to provide a statement of why your hours were reduced or why you are no longer employed with that company.",
        "Provide the name of the company exactly as it appears on your pay stub or W-2 form.",
        "Provide the company’s complete mailing address including the zip code for the location you worked at.",
        "Provide the company’s phone number.",
        "Provide your supervisor’s name.",
        "There is not a minimum amount of hours you need to have worked during your employment.",
        "Write down all of the employers you’ve had in the last 18 months.",
        "This information will be used to verify your employment history and wages over the last 18 months.",
        "You will need to include all employers including your most recent.",
        "Provide the name of all employers exactly as it appears on your pay stub or W-2 form.",
        "Provide your start and end dates for each employer.",
        "Provide all of your earned wages and if you were paid hourly, weekly, or monthly.",
        "Gather your bank account information.",
        "There are two options to receive your payments from unemployment insurance: direct deposit or a debit card.",
        "Payments will automatically be issued to a debit card.",
        "If you want to use direct deposit, you will need to wait one business day after submitting your claim to set it up.",
        "You should make sure you have access to your bank account number and routing number.",
        "You can download the direct deposit request form from the Oklahoma Employment Security Commission website at https://www.ok.gov/oesc/Claimants/.",
        "You can also set up direct deposit by phone by calling 866-320-8699.",
        "Applying for Unemployment Benefits File for unemployment online.",
        "Whether you are filing a claim for the first time or making a change to an existing claim, you can easily apply by visiting the Oklahoma Network Initial Claims website at https://unemployment.state.ok.us.",
        "The online system will allow you to file a claim, update contact information, and retrieve information for payment options.",
        "Use the Oklahoma IVR to file claims by phone.",
        "This interactive voice response (IVR) system will help you perform many of the same functions as you can online.",
        "If you call during regular business hours, you will also have the option to speak to a customer service representative.",
        "If you are calling from inside the Oklahoma City area, use 405-525-1500 to call the Oklahoma IVR.",
        "For those outside of the Oklahoma City area, the IVR can be reached at 800-555-1554.",
        "Provide honest answers to all questions.",
        "During your application process and while receiving benefits, you must provide only honest answers to any questions asked that directly relate to your unemployment case.",
        "Any information intentionally withheld, such as income, can result in denial or discontinuation of benefits.",
        "You will be required to certify that any information given is true or correct to the best of your knowledge.",
        "Apply for an appeal if you’re denied.",
        "If you feel that you have been wrongly denied for unemployment benefits, you have the right to appeal the decision.",
        "Make sure to submit your appeal within 10 calendar days from the mailing date of the decision.",
        "If your appeal is accepted, you will be paid for the benefits you claimed during the weeks waiting for the appeal decision, so log any benefits you receive.",
        "Appeals can be filed by mail, phone, email, or fax.",
        "Once your appeal is filed, you will receive a packet with detailed information about your claim and your hearing date.",
        "During the hearing, you have the right to testify on your own behalf, ask questions, present documents, and explain any evidence presented against you.",
        "You can choose to appear with or without representation.",
        "If your appeal is denied, you can appeal the Appeal Tribunal’s decision through the Board of Review.",
        "For questions relating to appeals, contact the local Unemployment Services Center at 405-525-1500, and 800-555-1554 for those outside the Oklahoma City area.",
        "File all weekly claims while receiving unemployment benefits.",
        "You will need to file a claim for the benefits you are receiving through unemployment every week if you wish to continue to receive unemployment assistance.",
        "All claims must be filed no later than 14 days after the end of the week.",
        "Failure to do so may result in the denial of future benefits.",
        "You can file weekly claims by phone or online.",
        "Resources on how to make claims will be provided to you when your unemployment benefits are approved.",
        "Report any earnings during your time collecting unemployment.",
        "Any money you make has to be reported the week you earn it.",
        "Do not wait until the week you are paid to report it, as the total amount needs to be reported before any deductions are made.",
        "You will also need to report any earnings you get from retirement pay.",
        "Retirement payments may be eligible to be considered as a deductible.",
        "For proper procedures regarding retirement pay, contact the Unemployment Insurance Service Center.",
        "Understand the amount and duration of your benefits upon approval.",
        "While collecting benefits, you will receive a weekly amount that is 1/23rd of your highest quarter of taxable wages during your base period.",
        "Another option the state of Oklahoma gives is to provide you with the maximum amount permitted by Oklahoma law.",
        "You can receive benefits for a maximum of 26 weeks.",
        "Per Oklahoma’s regulations, the minimum amount you can receive each week is $16.",
        "During times of high unemployment rates, you may be eligible to collect benefits for longer than 26 weeks.",
        "You may be able to apply for assistance with your medical insurance while receiving benefits.",
        "Contact Oklahoma’s Unemployment Services at 405-525-1500 for more information."
    ]
}