{
    "title": "How to Make Okro Soup",
    "url": "https://www.wikihow.com/Make-Okro-Soup",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Soups"
    ],
    "methods": [
        {
            "name": "Okro Soup with Beef and Shrimp",
            "steps": [
                {
                    "headline": "Put the oxtail, stock cube, paprika, onions, and pepper flakes into a pot.",
                    "description": "Set a pot on the stove and put ⁄2 pound (230 g) of oxtail into it. Add 1 maggi stock cube, 1/2 cup (75 g) of chopped onions, 1 tablespoon (5 g) of smoked paprika, and 1 tablespoon (5 g) of red pepper flakes. If you don't have a maggi stock cube, add salt according to your taste."
                },
                {
                    "headline": "Add water and bring the mixture to a boil.",
                    "description": "Pour 4 cups (950 ml) of water into the pot and turn the burner to high. Keep the lid off of the pot and let the water begin to boil. If you'd rather cook the okro soup faster, make it in a pressure cooker. Reduce the cooking time by half. To reduce some of the fat in the dish, scoop off and discard any beef fat that floats to the surface of the pot."
                },
                {
                    "headline": "Boil the mixture for 30 to 40 minutes over medium-high heat.",
                    "description": "Leave the lid off of the pot so the water evaporates a little as it boils. The oxtail should become tender and the onions will become clear. Stir the mixture occasionally to prevent it from sticking. You may need to adjust the temperature to prevent the water from completely evaporating. If it looks looks like it's going to boil dry, add 1 cup (240 ml) of water at a time."
                },
                {
                    "headline": "Stir in the ground crayfish and egusi.",
                    "description": "Add ½ cup (64 g) of ground crayfish and stir it until it's combined. If you'd like the okro soup to have a thicker consistency, stir in ½ cup (70 g) of ground egusi as well."
                },
                {
                    "headline": "Cook the soup for 5 minutes over medium-high heat.",
                    "description": "Keep the lid off of the pot and stir the soup frequently so the soup thickens a little and the crayfish flavors the mixture."
                },
                {
                    "headline": "Trim and slice 1 pound (450 g) of okra.",
                    "description": "If you're using fresh okra, rinse them and use a sharp knife to trim off the ends. Discard the ends and cut the okra into thin slices that are about 1/4 in (6 mm) wide. If you prefer, pound or blend the okra in a food processor until it's as smooth as you like."
                },
                {
                    "headline": "Add the okra and shrimp and cook the soup for 5 minutes.",
                    "description": "Scoop the chopped or blended okra into the pot on the stove. Add ⁄2 pound (230 g) of shrimp and stir the soup until it begins to bubble a little. Simmer the soup for 5 minutes so the shrimp cooks."
                },
                {
                    "headline": "Stir in the spinach and cook the soup for 1 to 2 minutes.",
                    "description": "Add 3 cups (470 g) of chopped spinach and stir it into the soup. Cook the soup over medium-high heat until the spinach begins to wilt."
                },
                {
                    "headline": "Serve the okro soup immediately.",
                    "description": "Turn off the burner and scoop the soup into bowls. Consider serving the okro soup with ugali or fufu on the side. Refrigerate the leftover okro soup in an airtight container for up to 3 to 4 days. Keep in mind that the soup will thicken as it's stored."
                }
            ]
        },
        {
            "name": "Okro Soup with Vegetables",
            "steps": [
                {
                    "headline": "Dice 1 onion, 1 bell pepper, and 2 hot peppers.",
                    "description": "Peel the onion and trim the ends from the onion, bell pepper, and hot peppers. Then use a sharp knife to dice the onion and peppers.You can use a red, green, yellow, or orange bell pepper. If you have a blender or food processor, blitz the onion and peppers until they're minced."
                },
                {
                    "headline": "Pour the palm oil into a pot and turn the burner to medium.",
                    "description": "Set a large pot on the stove and add 1 cup (240 ml) of palm oil. Heat the oil over medium heat so it begins to shimmer."
                },
                {
                    "headline": "Stir in the crayfish, onion, and peppers.",
                    "description": "Add ½ cup (64 g) of crayfish powder and the diced onion, bell pepper, and hot peppers. Stir until the ingredients are combined with the oil."
                },
                {
                    "headline": "Add the cooked meat, fish, and stock.",
                    "description": "Pour 6 cups (1,400 ml) of beef stock into the pot and stir in 1 pound (0.45 kg) of cooked meat and fish. Stir so the chopped vegetables are combined with the stock.If you don't have beef stock, you can substitute water but the soup won't be as flavorful."
                },
                {
                    "headline": "Cover and simmer the soup over medium heat for 10 minutes.",
                    "description": "Once the stock begins to bubble gently, cover the pot and let the soup cook for 10 minutes. The meat will soften and the flavors will develop as the soup simmers.If the soup begins to boil, reduce the heat to medium-low."
                },
                {
                    "headline": "Stir in the chopped okro and cook the soup for 2 minutes.",
                    "description": "Remove the lid from the pot and stir 6 cups (600 g) of chopped okro into the soup. Keep the lid off of the pot and cook the soup for 2 minutes over medium heat.Stir the soup occasionally to prevent it from sticking. The okro should soften slightly as it cooks."
                },
                {
                    "headline": "Mix in chopped greens and cook the soup for 3 minutes.",
                    "description": "Add 4 cups (900 g) of chopped greens and stir it into the okro soup. Let the soup simmer for 3 minutes so the greens soften and wilt.Keep in mind that the greens will shrink down as they cook."
                },
                {
                    "headline": "Taste and serve the okro soup.",
                    "description": "Turn off the burner and taste the soup. Add salt and maggi seasoning according to your taste. Then scoop the soup into bowls and serve it along with fufu or steamed rice.Store the leftover soup in an airtight container in the refrigerator for up to 3 to 4 days."
                }
            ]
        }
    ],
    "tyn": [
        "Okro Soup with Beef and Shrimp",
        "Measuring cups and spoons",
        "Knife and cutting board",
        "Pot",
        "Spoon",
        "Food processor (optional)",
        "Okro Soup with Vegetables",
        "Large pot"
    ],
    "text": " Okro Soup with Beef and Shrimp Put the oxtail, stock cube, paprika, onions, and pepper flakes into a pot. Set a pot on the stove and put ⁄2 pound (230 g) of oxtail into it. Add 1 maggi stock cube, 1/2 cup (75 g) of chopped onions, 1 tablespoon (5 g) of smoked paprika, and 1 tablespoon (5 g) of red pepper flakes. If you don't have a maggi stock cube, add salt according to your taste. Add water and bring the mixture to a boil. Pour 4 cups (950 ml) of water into the pot and turn the burner to high. Keep the lid off of the pot and let the water begin to boil. If you'd rather cook the okro soup faster, make it in a pressure cooker. Reduce the cooking time by half. To reduce some of the fat in the dish, scoop off and discard any beef fat that floats to the surface of the pot. Boil the mixture for 30 to 40 minutes over medium-high heat. Leave the lid off of the pot so the water evaporates a little as it boils. The oxtail should become tender and the onions will become clear. Stir the mixture occasionally to prevent it from sticking. You may need to adjust the temperature to prevent the water from completely evaporating. If it looks looks like it's going to boil dry, add 1 cup (240 ml) of water at a time. Stir in the ground crayfish and egusi. Add ½ cup (64 g) of ground crayfish and stir it until it's combined. If you'd like the okro soup to have a thicker consistency, stir in ½ cup (70 g) of ground egusi as well. Cook the soup for 5 minutes over medium-high heat. Keep the lid off of the pot and stir the soup frequently so the soup thickens a little and the crayfish flavors the mixture. Trim and slice 1 pound (450 g) of okra. If you're using fresh okra, rinse them and use a sharp knife to trim off the ends. Discard the ends and cut the okra into thin slices that are about 1/4 in (6 mm) wide. If you prefer, pound or blend the okra in a food processor until it's as smooth as you like. Add the okra and shrimp and cook the soup for 5 minutes. Scoop the chopped or blended okra into the pot on the stove. Add ⁄2 pound (230 g) of shrimp and stir the soup until it begins to bubble a little. Simmer the soup for 5 minutes so the shrimp cooks. Stir in the spinach and cook the soup for 1 to 2 minutes. Add 3 cups (470 g) of chopped spinach and stir it into the soup. Cook the soup over medium-high heat until the spinach begins to wilt. Serve the okro soup immediately. Turn off the burner and scoop the soup into bowls. Consider serving the okro soup with ugali or fufu on the side. Refrigerate the leftover okro soup in an airtight container for up to 3 to 4 days. Keep in mind that the soup will thicken as it's stored. Okro Soup with Vegetables Dice 1 onion, 1 bell pepper, and 2 hot peppers. Peel the onion and trim the ends from the onion, bell pepper, and hot peppers. Then use a sharp knife to dice the onion and peppers.You can use a red, green, yellow, or orange bell pepper. If you have a blender or food processor, blitz the onion and peppers until they're minced. Pour the palm oil into a pot and turn the burner to medium. Set a large pot on the stove and add 1 cup (240 ml) of palm oil. Heat the oil over medium heat so it begins to shimmer. Stir in the crayfish, onion, and peppers. Add ½ cup (64 g) of crayfish powder and the diced onion, bell pepper, and hot peppers. Stir until the ingredients are combined with the oil. Add the cooked meat, fish, and stock. Pour 6 cups (1,400 ml) of beef stock into the pot and stir in 1 pound (0.45 kg) of cooked meat and fish. Stir so the chopped vegetables are combined with the stock.If you don't have beef stock, you can substitute water but the soup won't be as flavorful. Cover and simmer the soup over medium heat for 10 minutes. Once the stock begins to bubble gently, cover the pot and let the soup cook for 10 minutes. The meat will soften and the flavors will develop as the soup simmers.If the soup begins to boil, reduce the heat to medium-low. Stir in the chopped okro and cook the soup for 2 minutes. Remove the lid from the pot and stir 6 cups (600 g) of chopped okro into the soup. Keep the lid off of the pot and cook the soup for 2 minutes over medium heat.Stir the soup occasionally to prevent it from sticking. The okro should soften slightly as it cooks. Mix in chopped greens and cook the soup for 3 minutes. Add 4 cups (900 g) of chopped greens and stir it into the okro soup. Let the soup simmer for 3 minutes so the greens soften and wilt.Keep in mind that the greens will shrink down as they cook. Taste and serve the okro soup. Turn off the burner and taste the soup. Add salt and maggi seasoning according to your taste. Then scoop the soup into bowls and serve it along with fufu or steamed rice.Store the leftover soup in an airtight container in the refrigerator for up to 3 to 4 days.",
    "sentences": [
        " Okro Soup with Beef and Shrimp Put the oxtail, stock cube, paprika, onions, and pepper flakes into a pot.",
        "Set a pot on the stove and put ⁄2 pound (230 g) of oxtail into it.",
        "Add 1 maggi stock cube, 1/2 cup (75 g) of chopped onions, 1 tablespoon (5 g) of smoked paprika, and 1 tablespoon (5 g) of red pepper flakes.",
        "If you don't have a maggi stock cube, add salt according to your taste.",
        "Add water and bring the mixture to a boil.",
        "Pour 4 cups (950 ml) of water into the pot and turn the burner to high.",
        "Keep the lid off of the pot and let the water begin to boil.",
        "If you'd rather cook the okro soup faster, make it in a pressure cooker.",
        "Reduce the cooking time by half.",
        "To reduce some of the fat in the dish, scoop off and discard any beef fat that floats to the surface of the pot.",
        "Boil the mixture for 30 to 40 minutes over medium-high heat.",
        "Leave the lid off of the pot so the water evaporates a little as it boils.",
        "The oxtail should become tender and the onions will become clear.",
        "Stir the mixture occasionally to prevent it from sticking.",
        "You may need to adjust the temperature to prevent the water from completely evaporating.",
        "If it looks looks like it's going to boil dry, add 1 cup (240 ml) of water at a time.",
        "Stir in the ground crayfish and egusi.",
        "Add ½ cup (64 g) of ground crayfish and stir it until it's combined.",
        "If you'd like the okro soup to have a thicker consistency, stir in ½ cup (70 g) of ground egusi as well.",
        "Cook the soup for 5 minutes over medium-high heat.",
        "Keep the lid off of the pot and stir the soup frequently so the soup thickens a little and the crayfish flavors the mixture.",
        "Trim and slice 1 pound (450 g) of okra.",
        "If you're using fresh okra, rinse them and use a sharp knife to trim off the ends.",
        "Discard the ends and cut the okra into thin slices that are about 1/4 in (6 mm) wide.",
        "If you prefer, pound or blend the okra in a food processor until it's as smooth as you like.",
        "Add the okra and shrimp and cook the soup for 5 minutes.",
        "Scoop the chopped or blended okra into the pot on the stove.",
        "Add ⁄2 pound (230 g) of shrimp and stir the soup until it begins to bubble a little.",
        "Simmer the soup for 5 minutes so the shrimp cooks.",
        "Stir in the spinach and cook the soup for 1 to 2 minutes.",
        "Add 3 cups (470 g) of chopped spinach and stir it into the soup.",
        "Cook the soup over medium-high heat until the spinach begins to wilt.",
        "Serve the okro soup immediately.",
        "Turn off the burner and scoop the soup into bowls.",
        "Consider serving the okro soup with ugali or fufu on the side.",
        "Refrigerate the leftover okro soup in an airtight container for up to 3 to 4 days.",
        "Keep in mind that the soup will thicken as it's stored.",
        "Okro Soup with Vegetables Dice 1 onion, 1 bell pepper, and 2 hot peppers.",
        "Peel the onion and trim the ends from the onion, bell pepper, and hot peppers.",
        "Then use a sharp knife to dice the onion and peppers.You can use a red, green, yellow, or orange bell pepper.",
        "If you have a blender or food processor, blitz the onion and peppers until they're minced.",
        "Pour the palm oil into a pot and turn the burner to medium.",
        "Set a large pot on the stove and add 1 cup (240 ml) of palm oil.",
        "Heat the oil over medium heat so it begins to shimmer.",
        "Stir in the crayfish, onion, and peppers.",
        "Add ½ cup (64 g) of crayfish powder and the diced onion, bell pepper, and hot peppers.",
        "Stir until the ingredients are combined with the oil.",
        "Add the cooked meat, fish, and stock.",
        "Pour 6 cups (1,400 ml) of beef stock into the pot and stir in 1 pound (0.45 kg) of cooked meat and fish.",
        "Stir so the chopped vegetables are combined with the stock.If you don't have beef stock, you can substitute water but the soup won't be as flavorful.",
        "Cover and simmer the soup over medium heat for 10 minutes.",
        "Once the stock begins to bubble gently, cover the pot and let the soup cook for 10 minutes.",
        "The meat will soften and the flavors will develop as the soup simmers.If the soup begins to boil, reduce the heat to medium-low.",
        "Stir in the chopped okro and cook the soup for 2 minutes.",
        "Remove the lid from the pot and stir 6 cups (600 g) of chopped okro into the soup.",
        "Keep the lid off of the pot and cook the soup for 2 minutes over medium heat.Stir the soup occasionally to prevent it from sticking.",
        "The okro should soften slightly as it cooks.",
        "Mix in chopped greens and cook the soup for 3 minutes.",
        "Add 4 cups (900 g) of chopped greens and stir it into the okro soup.",
        "Let the soup simmer for 3 minutes so the greens soften and wilt.Keep in mind that the greens will shrink down as they cook.",
        "Taste and serve the okro soup.",
        "Turn off the burner and taste the soup.",
        "Add salt and maggi seasoning according to your taste.",
        "Then scoop the soup into bowls and serve it along with fufu or steamed rice.Store the leftover soup in an airtight container in the refrigerator for up to 3 to 4 days."
    ]
}