{
    "title": "How to Clean Perch",
    "url": "https://www.wikihow.com/Clean-Perch",
    "category_hierarchy": [
        "Sports and Fitness",
        "Outdoor Recreation",
        "Fishing"
    ],
    "methods": [
        {
            "name": "Filleting Perch",
            "steps": [
                {
                    "headline": "Lay the perch on a steady and clean work surface.",
                    "description": "Get rid of dust and debris from your work surface by wiping it with a damp cloth before you place the perch on it. You can also spray disinfectant on it but make sure you wipe the spray off well with a damp cloth before using the work surface."
                },
                {
                    "headline": "Use your knife to slice 1 in (2.5 cm) under 1 of the perch's gills.",
                    "description": "Make sure you have a sharp knife when you're filleting perch. With the perch flat on your work surface, identify the gills. You can find the gills right next to the head on the perch. Start above and slightly behind 1 of the gills. Slice down and through it. You don't need to slice the gill off. Bring your knife down under the skin below 1 of the gills. When you have the knife on the other side of the gill, take it out of the skin. There's no need to stick the knife in at a steep angle. A shallow angle will do as you slice the perch."
                },
                {
                    "headline": "Cut along the backbone from the head to just before the tail.",
                    "description": "After you take your knife away from the gill, place it right above the perch's head. Stick it in until you feel the backbone. Slice the fish along the backbone, using the perch's backbone as a guide for the knife. Once you reach the tail fin, stop cutting and take the knife out again. You might find this part easier if you use the spine of your knife to slice along the fish's backbone. The teeth on the knife's blade can cause friction with the fish's bones."
                },
                {
                    "headline": "Make an incision around 0.5 in (1.3 cm) deep along the fish's belly.",
                    "description": "You can start this incision by the perch's head or by the fin. Run the knife along the belly. Don't cut too deep into the perch's body."
                },
                {
                    "headline": "Turn the fish over and make the same cuts to the gill on the other side.",
                    "description": "Once you've cut the gills on 1 side of the perch, you'll have to flip it over and repeat the cuts. This will make it much easier to remove the perch's skin."
                },
                {
                    "headline": "Peel the skin off from where you starting slicing below the gill.",
                    "description": "Find some of the perch's skin hanging loose by the gill. Place your knife under the skin and your thumb on top of the skin and the knife. Pull the knife and skin toward the perch's tail to remove the skin. Turn the fish over and peel the skin on the other side."
                },
                {
                    "headline": "Remove the fillet by running the knife along the fish from the backbone.",
                    "description": "Stick the knife into the backbone near the gills and through the perch to the belly. Then slice back towards the tail to remove the fillet from the perch's rib cage. Turn the fish over and repeat this step to remove the fillet on the other side."
                }
            ]
        },
        {
            "name": "Butterflying Perch",
            "steps": [
                {
                    "headline": "Remove the scales by scraping the fish with the spine of your knife.",
                    "description": "Place your perch flat on a steady and clean work surface. Put the spine of your knife across the perch's side and scrape it from side to side to remove the scales. Scrape against the grain of the scales to properly remove them. Be aware that this is quite messy and will send scales flying everywhere. Remove the scales on both sides of the fish and the belly. You can buy a specialized scaling tool at your local fishing store. This will make it easier to remove the scales."
                },
                {
                    "headline": "Cut 1 in (2.5 cm) below the perch's gill with your knife.",
                    "description": "Stick your knife in at a shallow angle, around 20 degrees, slightly behind and above the perch's gill. Slice down and under the gill until you reach the bottom side of the gill. Take the knife out of the fish when you pass the gill on the other side. Don't slice the gill off the fish. Just slice the skin under the gill."
                },
                {
                    "headline": "Slice along the backbone until you reach the back part of the perch.",
                    "description": "Stick your knife in just above the perch's head and cut the skin all along the backbone. When you feel the backbone with the knife, stop pushing the knife in. Use the backbone as a guide for your knife. When you get close to the tail fin of the fish, stop cutting. You might find it easier to cut along the backbone using the tip and spine of the knife."
                },
                {
                    "headline": "Stick the knife through the backbone to the belly and cut back to the tail.",
                    "description": "After you reach the back portion of the fish when you're slicing the backbone, push the knife through the body of the perch until it comes out at the belly. Then slice back and remove the knife when you reach the tail."
                },
                {
                    "headline": "Cut the fillet along the ribcage, stopping at the belly.",
                    "description": "At this point, cut the fillet near the back part of the fish. Stick your knife in and slice it along the rib cage gently to detach the fillet from the perch. Don't cut the belly with the knife. Leave the fillet at the belly intact and attached."
                },
                {
                    "headline": "Peel the fillet back without tearing it off the fish.",
                    "description": "Grab the fillet and gently pull on it down towards the belly of the fish, taking special care to not damage the belly. When you're finished, the fillet should look similar to a butterfly's wing hanging off the fish."
                },
                {
                    "headline": "Turn the fish over and make the same cuts to the gills.",
                    "description": "Slice the perch below the gill. There's no need to make the same cuts to the belly and backbone as you've already made those cuts once on the fish. Use the knife to separate the fillet from the rib cage, leaving the belly untouched."
                },
                {
                    "headline": "Peel the fillet back once more, cutting the belly as you go.",
                    "description": "This time, grab the fillet again and pull it down towards the belly. Keep pulling it down and away from the perch's body. Lay your other fillet flat on the work surface just below the belly. Use your knife to separate the fillet from the rib cage and the belly as you go, slicing through and removing both fillets when you reach the end. When you're finished, both of your fillets will be disconnected from the fish. They will look like the wings of a butterfly."
                }
            ]
        }
    ],
    "tyn": [
        "Sharp knife",
        "Perch",
        "Steady work surface"
    ],
    "text": " Filleting Perch Lay the perch on a steady and clean work surface. Get rid of dust and debris from your work surface by wiping it with a damp cloth before you place the perch on it. You can also spray disinfectant on it but make sure you wipe the spray off well with a damp cloth before using the work surface. Use your knife to slice 1 in (2.5 cm) under 1 of the perch's gills. Make sure you have a sharp knife when you're filleting perch. With the perch flat on your work surface, identify the gills. You can find the gills right next to the head on the perch. Start above and slightly behind 1 of the gills. Slice down and through it. You don't need to slice the gill off. Bring your knife down under the skin below 1 of the gills. When you have the knife on the other side of the gill, take it out of the skin. There's no need to stick the knife in at a steep angle. A shallow angle will do as you slice the perch. Cut along the backbone from the head to just before the tail. After you take your knife away from the gill, place it right above the perch's head. Stick it in until you feel the backbone. Slice the fish along the backbone, using the perch's backbone as a guide for the knife. Once you reach the tail fin, stop cutting and take the knife out again. You might find this part easier if you use the spine of your knife to slice along the fish's backbone. The teeth on the knife's blade can cause friction with the fish's bones. Make an incision around 0.5 in (1.3 cm) deep along the fish's belly. You can start this incision by the perch's head or by the fin. Run the knife along the belly. Don't cut too deep into the perch's body. Turn the fish over and make the same cuts to the gill on the other side. Once you've cut the gills on 1 side of the perch, you'll have to flip it over and repeat the cuts. This will make it much easier to remove the perch's skin. Peel the skin off from where you starting slicing below the gill. Find some of the perch's skin hanging loose by the gill. Place your knife under the skin and your thumb on top of the skin and the knife. Pull the knife and skin toward the perch's tail to remove the skin. Turn the fish over and peel the skin on the other side. Remove the fillet by running the knife along the fish from the backbone. Stick the knife into the backbone near the gills and through the perch to the belly. Then slice back towards the tail to remove the fillet from the perch's rib cage. Turn the fish over and repeat this step to remove the fillet on the other side. Butterflying Perch Remove the scales by scraping the fish with the spine of your knife. Place your perch flat on a steady and clean work surface. Put the spine of your knife across the perch's side and scrape it from side to side to remove the scales. Scrape against the grain of the scales to properly remove them. Be aware that this is quite messy and will send scales flying everywhere. Remove the scales on both sides of the fish and the belly. You can buy a specialized scaling tool at your local fishing store. This will make it easier to remove the scales. Cut 1 in (2.5 cm) below the perch's gill with your knife. Stick your knife in at a shallow angle, around 20 degrees, slightly behind and above the perch's gill. Slice down and under the gill until you reach the bottom side of the gill. Take the knife out of the fish when you pass the gill on the other side. Don't slice the gill off the fish. Just slice the skin under the gill. Slice along the backbone until you reach the back part of the perch. Stick your knife in just above the perch's head and cut the skin all along the backbone. When you feel the backbone with the knife, stop pushing the knife in. Use the backbone as a guide for your knife. When you get close to the tail fin of the fish, stop cutting. You might find it easier to cut along the backbone using the tip and spine of the knife. Stick the knife through the backbone to the belly and cut back to the tail. After you reach the back portion of the fish when you're slicing the backbone, push the knife through the body of the perch until it comes out at the belly. Then slice back and remove the knife when you reach the tail. Cut the fillet along the ribcage, stopping at the belly. At this point, cut the fillet near the back part of the fish. Stick your knife in and slice it along the rib cage gently to detach the fillet from the perch. Don't cut the belly with the knife. Leave the fillet at the belly intact and attached. Peel the fillet back without tearing it off the fish. Grab the fillet and gently pull on it down towards the belly of the fish, taking special care to not damage the belly. When you're finished, the fillet should look similar to a butterfly's wing hanging off the fish. Turn the fish over and make the same cuts to the gills. Slice the perch below the gill. There's no need to make the same cuts to the belly and backbone as you've already made those cuts once on the fish. Use the knife to separate the fillet from the rib cage, leaving the belly untouched. Peel the fillet back once more, cutting the belly as you go. This time, grab the fillet again and pull it down towards the belly. Keep pulling it down and away from the perch's body. Lay your other fillet flat on the work surface just below the belly. Use your knife to separate the fillet from the rib cage and the belly as you go, slicing through and removing both fillets when you reach the end. When you're finished, both of your fillets will be disconnected from the fish. They will look like the wings of a butterfly.",
    "sentences": [
        " Filleting Perch Lay the perch on a steady and clean work surface.",
        "Get rid of dust and debris from your work surface by wiping it with a damp cloth before you place the perch on it.",
        "You can also spray disinfectant on it but make sure you wipe the spray off well with a damp cloth before using the work surface.",
        "Use your knife to slice 1 in (2.5 cm) under 1 of the perch's gills.",
        "Make sure you have a sharp knife when you're filleting perch.",
        "With the perch flat on your work surface, identify the gills.",
        "You can find the gills right next to the head on the perch.",
        "Start above and slightly behind 1 of the gills.",
        "Slice down and through it.",
        "You don't need to slice the gill off.",
        "Bring your knife down under the skin below 1 of the gills.",
        "When you have the knife on the other side of the gill, take it out of the skin.",
        "There's no need to stick the knife in at a steep angle.",
        "A shallow angle will do as you slice the perch.",
        "Cut along the backbone from the head to just before the tail.",
        "After you take your knife away from the gill, place it right above the perch's head.",
        "Stick it in until you feel the backbone.",
        "Slice the fish along the backbone, using the perch's backbone as a guide for the knife.",
        "Once you reach the tail fin, stop cutting and take the knife out again.",
        "You might find this part easier if you use the spine of your knife to slice along the fish's backbone.",
        "The teeth on the knife's blade can cause friction with the fish's bones.",
        "Make an incision around 0.5 in (1.3 cm) deep along the fish's belly.",
        "You can start this incision by the perch's head or by the fin.",
        "Run the knife along the belly.",
        "Don't cut too deep into the perch's body.",
        "Turn the fish over and make the same cuts to the gill on the other side.",
        "Once you've cut the gills on 1 side of the perch, you'll have to flip it over and repeat the cuts.",
        "This will make it much easier to remove the perch's skin.",
        "Peel the skin off from where you starting slicing below the gill.",
        "Find some of the perch's skin hanging loose by the gill.",
        "Place your knife under the skin and your thumb on top of the skin and the knife.",
        "Pull the knife and skin toward the perch's tail to remove the skin.",
        "Turn the fish over and peel the skin on the other side.",
        "Remove the fillet by running the knife along the fish from the backbone.",
        "Stick the knife into the backbone near the gills and through the perch to the belly.",
        "Then slice back towards the tail to remove the fillet from the perch's rib cage.",
        "Turn the fish over and repeat this step to remove the fillet on the other side.",
        "Butterflying Perch Remove the scales by scraping the fish with the spine of your knife.",
        "Place your perch flat on a steady and clean work surface.",
        "Put the spine of your knife across the perch's side and scrape it from side to side to remove the scales.",
        "Scrape against the grain of the scales to properly remove them.",
        "Be aware that this is quite messy and will send scales flying everywhere.",
        "Remove the scales on both sides of the fish and the belly.",
        "You can buy a specialized scaling tool at your local fishing store.",
        "This will make it easier to remove the scales.",
        "Cut 1 in (2.5 cm) below the perch's gill with your knife.",
        "Stick your knife in at a shallow angle, around 20 degrees, slightly behind and above the perch's gill.",
        "Slice down and under the gill until you reach the bottom side of the gill.",
        "Take the knife out of the fish when you pass the gill on the other side.",
        "Don't slice the gill off the fish.",
        "Just slice the skin under the gill.",
        "Slice along the backbone until you reach the back part of the perch.",
        "Stick your knife in just above the perch's head and cut the skin all along the backbone.",
        "When you feel the backbone with the knife, stop pushing the knife in.",
        "Use the backbone as a guide for your knife.",
        "When you get close to the tail fin of the fish, stop cutting.",
        "You might find it easier to cut along the backbone using the tip and spine of the knife.",
        "Stick the knife through the backbone to the belly and cut back to the tail.",
        "After you reach the back portion of the fish when you're slicing the backbone, push the knife through the body of the perch until it comes out at the belly.",
        "Then slice back and remove the knife when you reach the tail.",
        "Cut the fillet along the ribcage, stopping at the belly.",
        "At this point, cut the fillet near the back part of the fish.",
        "Stick your knife in and slice it along the rib cage gently to detach the fillet from the perch.",
        "Don't cut the belly with the knife.",
        "Leave the fillet at the belly intact and attached.",
        "Peel the fillet back without tearing it off the fish.",
        "Grab the fillet and gently pull on it down towards the belly of the fish, taking special care to not damage the belly.",
        "When you're finished, the fillet should look similar to a butterfly's wing hanging off the fish.",
        "Turn the fish over and make the same cuts to the gills.",
        "Slice the perch below the gill.",
        "There's no need to make the same cuts to the belly and backbone as you've already made those cuts once on the fish.",
        "Use the knife to separate the fillet from the rib cage, leaving the belly untouched.",
        "Peel the fillet back once more, cutting the belly as you go.",
        "This time, grab the fillet again and pull it down towards the belly.",
        "Keep pulling it down and away from the perch's body.",
        "Lay your other fillet flat on the work surface just below the belly.",
        "Use your knife to separate the fillet from the rib cage and the belly as you go, slicing through and removing both fillets when you reach the end.",
        "When you're finished, both of your fillets will be disconnected from the fish.",
        "They will look like the wings of a butterfly."
    ]
}