{
    "title": "How to Cut a Mirror Without a Glass Cutter",
    "url": "https://www.wikihow.com/Cut-a-Mirror-Without-a-Glass-Cutter",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "parts": [
        {
            "name": "Selecting a Tool",
            "steps": [
                {
                    "headline": "Pick a carbide scribe for a sharp, precise cut.",
                    "description": "Carbide scribes are tipped with tungsten carbide, a high-quality cutting material that's used in some of the best glass cutters. For cutting glass without a glass cutter, a scribe will be your best option. These tools don't have a cutting wheel, but the tip of the scribe is extremely fine and can easily score glass. You should be able to purchase a carbide scribe at most large hardware stores or home-improvement stores. It costs less than $10 USD."
                },
                {
                    "headline": "Select a diamond-tipped scribe for a longer-lasting tool.",
                    "description": "Diamond scribes are used to score sheets of metal for cutting in industrial settings. As such, they're more than sharp enough to score a sheet of mirror glass. They'll also last longer than most carbide scribes. You can purchase a diamond scribe through large online retailers or at some craft-supply stores. Diamond tipped scribes are about twice as expensive as the carbide tipped option. They'll cost about $20 USD."
                },
                {
                    "headline": "Use an ordinary steel file for a cheap option.",
                    "description": "Inexpensive glass cutters have steel blades, so a steel file works as an approximate replacement. If you don't have a steel file, you can purchase one at a hardware store for under $10 USD. The file doesn't need to be large, but should have relatively sharp, angled edges to cut the glass. To cut glass with steel, you'll position the sharp edge (or pointed tip) of the file against the mirror, then scrape it back and forth until you've lightly scored the glass. Be aware that using a rough steel edge (like a file) to cut glass may result in an imprecise cut and a sloppy break. A carbide scribe will produce a sharper, more clean and accurate cut."
                }
            ]
        },
        {
            "name": "Cleaning and Scoring the Mirror",
            "steps": [
                {
                    "headline": "Lay 4-5 sheets of newspaper on a large, flat surface.",
                    "description": "You could use a tabletop or work on the floor. The sheets of newspaper will smooth out any rough spots or grit on the flat surface and give you a slightly padded workspace. The flat surface needs to support the entirety of the mirror. Do not place the mirror over 2 sawhorses, for example, or you'll risk breaking it in half."
                },
                {
                    "headline": "Spray the mirror with glass cleaner and wipe it with a microfiber cloth.",
                    "description": "The surface of the mirror will have dust and grit on it. If you cut the mirror without first removing the dirt, you'll risk dulling your cutting tool. Worse, you'll also risk a rough and imprecise cut. You can buy both glass cleaner and microfiber cloths at a large supermarket or hardware store."
                },
                {
                    "headline": "Measure where you want to cut the mirror.",
                    "description": "Use a metal ruler to measure the mirror and find where you want to cut. For example, if you would like a 2 ft (0.61 m) wide mirror, measure 24 inches (61 cm) from one side of the mirror. Measure in 3-4 different places and mark each spot with a small dot with your permanent marker. If you're cutting the mirror to fit in a frame, measure so that the cut mirror will be 2–4 millimetres (0.079–0.157 in) smaller than the interior of the frame. This will give it a nice secure fit."
                },
                {
                    "headline": "Mark the line you'll cut with a permanent marker.",
                    "description": "Hold the side of the metal ruler along the 3–4 dots you've marked in marker. Draw a straight line with a permanent marker. Use one hand to apply pressure to the ruler so that you'll draw a straight line exactly where you want to cut the glass."
                },
                {
                    "headline": "Put on a pair of work gloves and protective eyewear.",
                    "description": "Since you'll be working with a cutting tool and with the sharp edges of the mirror, put on a pair of thick leather work gloves to protect your hands from cuts. Also wear protective glasses to keep glass dust from getting into your eyes. If you don't already own work gloves and protective eyewear, you can purchase both at any hardware store or home-improvement store."
                },
                {
                    "headline": "Squirt 4-5 drops of glass cutting oil along the line you marked.",
                    "description": "Use your finger to rub the beads of glass cutting oil evenly across the area you'll cut. Glass cutting oil will lubricate the patch of glass you'll cut through. If you don't apply oil to the glass before cutting, you may end up with an uneven, rough cut. You can purchase glass cutting oil at a hardware store or home-improvement store. You could also use an all-purpose oil."
                },
                {
                    "headline": "Score the mirror by tracing a line across it with your cutting tool.",
                    "description": "Take your cutting tool and set its tip at one end of the line you drew in permanent marker. Press down hard on the tool and slowly draw the tip along the line you've marked. Continue to apply pressure so that the tool will uniformly score the glass. Do not stop scoring the mirror once you've begun. If you stop scoring partway through the cut, it'll be very hard to re-begin scoring at the same place. If you're scoring the glass with a steel file, you may need to make 2-3 passes before the glass is adequately scored."
                }
            ]
        },
        {
            "name": "Snapping and Smoothing the Mirror",
            "steps": [
                {
                    "headline": "Slide a dowel beneath the mirror along the length of the score.",
                    "description": "You'll be using the dowel to snap the mirror along the line you cut. Make sure that the dowel is perfectly centered beneath the scored line. If it's not centered, you'll risk shattering the mirror when you press down. If you don't already have a dowel handy, you can buy one at a hardware store."
                },
                {
                    "headline": "Press down on the sides of the glass to snap the mirror along the cut line.",
                    "description": "Once the dowel is centered beneath the line you've scored, set one hand on either side of the mirror on top of the dowels. Gently press downward until you feel the mirror snap in 2 along the scored line. If the mirror doesn't break at first, try pressing down in different spots. For example, press once at the top, middle, and bottom of the mirror. Always keep your hands opposite one another when you're pressing down."
                },
                {
                    "headline": "Sand the sharp edges of the mirror with 200 grit sandpaper.",
                    "description": "Once you've broken the mirror, you'll be left with 2 rough edges. Wrap a piece of 200 grit sandpaper around each edge and sand back and forth until the glass edge is smooth and dull. Avoid touching the edges of the mirror until they've been sanded. The raw edges will be sharp and possibly jagged."
                }
            ]
        }
    ],
    "tyn": [
        "Newspaper",
        "Glass cleaner",
        "Microfiber cloth",
        "Metal ruler",
        "Work gloves",
        "Protective eyewear",
        "Glass mirror",
        "Permanent marker",
        "Ruler",
        "Glass-cutting fluid",
        "Diamond scribe (optional)",
        "Carbide scribe (optional)",
        "Steel file (optional)",
        "Dowel",
        "200 grit sandpaper"
    ],
    "text": " Selecting a Tool Pick a carbide scribe for a sharp, precise cut. Carbide scribes are tipped with tungsten carbide, a high-quality cutting material that's used in some of the best glass cutters. For cutting glass without a glass cutter, a scribe will be your best option. These tools don't have a cutting wheel, but the tip of the scribe is extremely fine and can easily score glass. You should be able to purchase a carbide scribe at most large hardware stores or home-improvement stores. It costs less than $10 USD. Select a diamond-tipped scribe for a longer-lasting tool. Diamond scribes are used to score sheets of metal for cutting in industrial settings. As such, they're more than sharp enough to score a sheet of mirror glass. They'll also last longer than most carbide scribes. You can purchase a diamond scribe through large online retailers or at some craft-supply stores. Diamond tipped scribes are about twice as expensive as the carbide tipped option. They'll cost about $20 USD. Use an ordinary steel file for a cheap option. Inexpensive glass cutters have steel blades, so a steel file works as an approximate replacement. If you don't have a steel file, you can purchase one at a hardware store for under $10 USD. The file doesn't need to be large, but should have relatively sharp, angled edges to cut the glass. To cut glass with steel, you'll position the sharp edge (or pointed tip) of the file against the mirror, then scrape it back and forth until you've lightly scored the glass. Be aware that using a rough steel edge (like a file) to cut glass may result in an imprecise cut and a sloppy break. A carbide scribe will produce a sharper, more clean and accurate cut. Cleaning and Scoring the Mirror Lay 4-5 sheets of newspaper on a large, flat surface. You could use a tabletop or work on the floor. The sheets of newspaper will smooth out any rough spots or grit on the flat surface and give you a slightly padded workspace. The flat surface needs to support the entirety of the mirror. Do not place the mirror over 2 sawhorses, for example, or you'll risk breaking it in half. Spray the mirror with glass cleaner and wipe it with a microfiber cloth. The surface of the mirror will have dust and grit on it. If you cut the mirror without first removing the dirt, you'll risk dulling your cutting tool. Worse, you'll also risk a rough and imprecise cut. You can buy both glass cleaner and microfiber cloths at a large supermarket or hardware store. Measure where you want to cut the mirror. Use a metal ruler to measure the mirror and find where you want to cut. For example, if you would like a 2 ft (0.61 m) wide mirror, measure 24 inches (61 cm) from one side of the mirror. Measure in 3-4 different places and mark each spot with a small dot with your permanent marker. If you're cutting the mirror to fit in a frame, measure so that the cut mirror will be 2–4 millimetres (0.079–0.157 in) smaller than the interior of the frame. This will give it a nice secure fit. Mark the line you'll cut with a permanent marker. Hold the side of the metal ruler along the 3–4 dots you've marked in marker. Draw a straight line with a permanent marker. Use one hand to apply pressure to the ruler so that you'll draw a straight line exactly where you want to cut the glass. Put on a pair of work gloves and protective eyewear. Since you'll be working with a cutting tool and with the sharp edges of the mirror, put on a pair of thick leather work gloves to protect your hands from cuts. Also wear protective glasses to keep glass dust from getting into your eyes. If you don't already own work gloves and protective eyewear, you can purchase both at any hardware store or home-improvement store. Squirt 4-5 drops of glass cutting oil along the line you marked. Use your finger to rub the beads of glass cutting oil evenly across the area you'll cut. Glass cutting oil will lubricate the patch of glass you'll cut through. If you don't apply oil to the glass before cutting, you may end up with an uneven, rough cut. You can purchase glass cutting oil at a hardware store or home-improvement store. You could also use an all-purpose oil. Score the mirror by tracing a line across it with your cutting tool. Take your cutting tool and set its tip at one end of the line you drew in permanent marker. Press down hard on the tool and slowly draw the tip along the line you've marked. Continue to apply pressure so that the tool will uniformly score the glass. Do not stop scoring the mirror once you've begun. If you stop scoring partway through the cut, it'll be very hard to re-begin scoring at the same place. If you're scoring the glass with a steel file, you may need to make 2-3 passes before the glass is adequately scored. Snapping and Smoothing the Mirror Slide a dowel beneath the mirror along the length of the score. You'll be using the dowel to snap the mirror along the line you cut. Make sure that the dowel is perfectly centered beneath the scored line. If it's not centered, you'll risk shattering the mirror when you press down. If you don't already have a dowel handy, you can buy one at a hardware store. Press down on the sides of the glass to snap the mirror along the cut line. Once the dowel is centered beneath the line you've scored, set one hand on either side of the mirror on top of the dowels. Gently press downward until you feel the mirror snap in 2 along the scored line. If the mirror doesn't break at first, try pressing down in different spots. For example, press once at the top, middle, and bottom of the mirror. Always keep your hands opposite one another when you're pressing down. Sand the sharp edges of the mirror with 200 grit sandpaper. Once you've broken the mirror, you'll be left with 2 rough edges. Wrap a piece of 200 grit sandpaper around each edge and sand back and forth until the glass edge is smooth and dull. Avoid touching the edges of the mirror until they've been sanded. The raw edges will be sharp and possibly jagged.",
    "sentences": [
        " Selecting a Tool Pick a carbide scribe for a sharp, precise cut.",
        "Carbide scribes are tipped with tungsten carbide, a high-quality cutting material that's used in some of the best glass cutters.",
        "For cutting glass without a glass cutter, a scribe will be your best option.",
        "These tools don't have a cutting wheel, but the tip of the scribe is extremely fine and can easily score glass.",
        "You should be able to purchase a carbide scribe at most large hardware stores or home-improvement stores.",
        "It costs less than $10 USD.",
        "Select a diamond-tipped scribe for a longer-lasting tool.",
        "Diamond scribes are used to score sheets of metal for cutting in industrial settings.",
        "As such, they're more than sharp enough to score a sheet of mirror glass.",
        "They'll also last longer than most carbide scribes.",
        "You can purchase a diamond scribe through large online retailers or at some craft-supply stores.",
        "Diamond tipped scribes are about twice as expensive as the carbide tipped option.",
        "They'll cost about $20 USD.",
        "Use an ordinary steel file for a cheap option.",
        "Inexpensive glass cutters have steel blades, so a steel file works as an approximate replacement.",
        "If you don't have a steel file, you can purchase one at a hardware store for under $10 USD.",
        "The file doesn't need to be large, but should have relatively sharp, angled edges to cut the glass.",
        "To cut glass with steel, you'll position the sharp edge (or pointed tip) of the file against the mirror, then scrape it back and forth until you've lightly scored the glass.",
        "Be aware that using a rough steel edge (like a file) to cut glass may result in an imprecise cut and a sloppy break.",
        "A carbide scribe will produce a sharper, more clean and accurate cut.",
        "Cleaning and Scoring the Mirror Lay 4-5 sheets of newspaper on a large, flat surface.",
        "You could use a tabletop or work on the floor.",
        "The sheets of newspaper will smooth out any rough spots or grit on the flat surface and give you a slightly padded workspace.",
        "The flat surface needs to support the entirety of the mirror.",
        "Do not place the mirror over 2 sawhorses, for example, or you'll risk breaking it in half.",
        "Spray the mirror with glass cleaner and wipe it with a microfiber cloth.",
        "The surface of the mirror will have dust and grit on it.",
        "If you cut the mirror without first removing the dirt, you'll risk dulling your cutting tool.",
        "Worse, you'll also risk a rough and imprecise cut.",
        "You can buy both glass cleaner and microfiber cloths at a large supermarket or hardware store.",
        "Measure where you want to cut the mirror.",
        "Use a metal ruler to measure the mirror and find where you want to cut.",
        "For example, if you would like a 2 ft (0.61 m) wide mirror, measure 24 inches (61 cm) from one side of the mirror.",
        "Measure in 3-4 different places and mark each spot with a small dot with your permanent marker.",
        "If you're cutting the mirror to fit in a frame, measure so that the cut mirror will be 2–4 millimetres (0.079–0.157 in) smaller than the interior of the frame.",
        "This will give it a nice secure fit.",
        "Mark the line you'll cut with a permanent marker.",
        "Hold the side of the metal ruler along the 3–4 dots you've marked in marker.",
        "Draw a straight line with a permanent marker.",
        "Use one hand to apply pressure to the ruler so that you'll draw a straight line exactly where you want to cut the glass.",
        "Put on a pair of work gloves and protective eyewear.",
        "Since you'll be working with a cutting tool and with the sharp edges of the mirror, put on a pair of thick leather work gloves to protect your hands from cuts.",
        "Also wear protective glasses to keep glass dust from getting into your eyes.",
        "If you don't already own work gloves and protective eyewear, you can purchase both at any hardware store or home-improvement store.",
        "Squirt 4-5 drops of glass cutting oil along the line you marked.",
        "Use your finger to rub the beads of glass cutting oil evenly across the area you'll cut.",
        "Glass cutting oil will lubricate the patch of glass you'll cut through.",
        "If you don't apply oil to the glass before cutting, you may end up with an uneven, rough cut.",
        "You can purchase glass cutting oil at a hardware store or home-improvement store.",
        "You could also use an all-purpose oil.",
        "Score the mirror by tracing a line across it with your cutting tool.",
        "Take your cutting tool and set its tip at one end of the line you drew in permanent marker.",
        "Press down hard on the tool and slowly draw the tip along the line you've marked.",
        "Continue to apply pressure so that the tool will uniformly score the glass.",
        "Do not stop scoring the mirror once you've begun.",
        "If you stop scoring partway through the cut, it'll be very hard to re-begin scoring at the same place.",
        "If you're scoring the glass with a steel file, you may need to make 2-3 passes before the glass is adequately scored.",
        "Snapping and Smoothing the Mirror Slide a dowel beneath the mirror along the length of the score.",
        "You'll be using the dowel to snap the mirror along the line you cut.",
        "Make sure that the dowel is perfectly centered beneath the scored line.",
        "If it's not centered, you'll risk shattering the mirror when you press down.",
        "If you don't already have a dowel handy, you can buy one at a hardware store.",
        "Press down on the sides of the glass to snap the mirror along the cut line.",
        "Once the dowel is centered beneath the line you've scored, set one hand on either side of the mirror on top of the dowels.",
        "Gently press downward until you feel the mirror snap in 2 along the scored line.",
        "If the mirror doesn't break at first, try pressing down in different spots.",
        "For example, press once at the top, middle, and bottom of the mirror.",
        "Always keep your hands opposite one another when you're pressing down.",
        "Sand the sharp edges of the mirror with 200 grit sandpaper.",
        "Once you've broken the mirror, you'll be left with 2 rough edges.",
        "Wrap a piece of 200 grit sandpaper around each edge and sand back and forth until the glass edge is smooth and dull.",
        "Avoid touching the edges of the mirror until they've been sanded.",
        "The raw edges will be sharp and possibly jagged."
    ]
}