{
    "title": "How to Tease Your Hair",
    "url": "https://www.wikihow.com/Tease-Your-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Hairstyles",
        "Teasing Hair"
    ],
    "parts": [
        {
            "name": "Prepping Your Hair",
            "steps": [
                {
                    "headline": "Shampoo your hair as you normally would.",
                    "description": "Before you start teasing your hair, wet your hair in the shower or underneath a bath or sink faucet until it’s completely saturated. Then, massage a shampoo of your choice into your scalp to create a lather. Rinse the shampoo out completely. Wash your hair with a volumizing shampoo to give your hair a little more lift."
                },
                {
                    "headline": "Skip the conditioner after you shampoo.",
                    "description": "Because conditioner softens hair and  makes it smooth, it may keep your teased hair from holding its texture. Wash your hair with shampoo and don’t follow up with a conditioner. If you have especially dry hair, apply some conditioner to only the ends of your hair. This should help to keep it from looking dry while also not interfering with the teased areas."
                },
                {
                    "headline": "Dry your hair to avoid damage.",
                    "description": "Teasing your hair when it’s wet will likely damage it. You can let your hair air dry completely before you tease it, but you may get more volume by blowing it dry. Flip your head over and focus on drying the root area. Apply a volumizing product, such as mousse, after you wash your hair and before you dry it to create some more lift."
                },
                {
                    "headline": "Use dry shampoo as an alternative.",
                    "description": "If you don’t have time to wash your hair and blow it dry, apply dry shampoo to your roots. This should add the appearance of volume and freshness you need in order to create a solid teased hairstyle."
                },
                {
                    "headline": "Brush out your tangles.",
                    "description": "Depending on the thickness and texture of your hair, you can use a paddle brush or a wide-tooth comb to detangle your hair. Start at the ends of your hair and work your way up towards the roots to avoid pulling your hair out. By brushing out your hair, you’ll prevent tangles from getting caught when you tease your hair."
                }
            ]
        },
        {
            "name": "Teasing Your Hair",
            "steps": [
                {
                    "headline": "Hold up a ⁄2 inch (1.3 cm) section of hair at your crown.",
                    "description": "Create the section at your crown with the tail end of a rat tail comb. Pull the section straight up away from your head and hold it taut to get the best results. While teasing the crown is the most common method, you may want a bolder look for a Halloween costume or to get an 80’s hairstyle. If you’re going for a more extreme look, section all of your hair, not just the hair at your crown."
                },
                {
                    "headline": "Comb the hair down towards your scalp 3 times.",
                    "description": "Use a rat tail comb or a small boar-bristle brush to comb the back of your section from about mid-shaft down to your root area. Be gentle to avoid damaging your hair."
                },
                {
                    "headline": "Clip each section towards the front of your head.",
                    "description": "After you’ve finished teasing the first section, pull it forward and clip it to your roots near the front of your head with a long hair clip. This should keep the already-teased hair out of the way while you tease other sections."
                },
                {
                    "headline": "Create new sections underneath the first section and tease them.",
                    "description": "Use the tail end of your rat tail comb to create another ⁄2 inch (1.3 cm) section just underneath the original section of hair. Tease the back of the new section and then clip it to the front of your head on top of the first section. Do this for all of your sections. If you want more volume and you’ve already teased a few sections this way, add a couple of sections at your crown that are just to the left and right. Clip these forward as you did with other sections."
                },
                {
                    "headline": "Smooth the surface of your hair with the comb.",
                    "description": "Once you’ve finished teasing your sections, unclip them and lay them all back down naturally against your head. Gently comb over the surface of the sections to smooth them out without removing volume."
                },
                {
                    "headline": "Spray the teased hair with a flexible hold water-free hairspray.",
                    "description": "After you’ve gotten your hair the way you want it to be, spray some hairspray over the area to keep it intact for as long as possible. Flexible hold water-free hairspray should keep your hair in place effectively without making it look stiff. If you’re leaving your hair down, then your look is complete at this point."
                }
            ]
        },
        {
            "name": "Styling Your Teased Hair",
            "steps": [
                {
                    "headline": "Lift your hair with a hair pick to enhance volume.",
                    "description": "To get a little more height, slide a hair pick into your teased hair. Then, gently lift the pick up while it’s in your hair. Repeat this in different areas where your hair is teased until it looks uniformly taller."
                },
                {
                    "headline": "Wear your hair in a fancy fluffed-up ponytail.",
                    "description": "Tease a couple of sections of hair at the front center of your head, starting just behind your hairline. Smooth the surface back with a comb, spray it with hairspray, and put your hair in a ponytail. Wrap a piece of hair around the hair tie to hide it and secure the piece with a bobby pin. Then, hold your ponytail up and comb down from mid-shaft towards your hair tie."
                },
                {
                    "headline": "Try a voluminous half-up, half-down look.",
                    "description": "After teasing your crown, make a part that goes horizontally across your head and passes just in front of your ears. Use a few bobby pins to secure the teased hair at the back center of your head. Finally, gather all of the hair that’s on the side of the part closest to your face. Comb it back gently over your teased hair and secure it at the back center of your head with a clip."
                },
                {
                    "headline": "Brush your hair from tips to roots to get it back to normal.",
                    "description": "After you’ve rocked a teased hairstyle, its important to carefully and patiently brush through your hair. The teasing will likely have made your hair feel knotted and matted, but you can detangle it with a soft bristle brush. Slowly and gently brush small sections of your hair from tips to roots until it’s completely detangled. If you struggle to brush the tangles out of your hair, try applying more conditioner than you normally would. Apply it before shampooing, then rinse it out and wash your hair as you normally would."
                }
            ]
        }
    ],
    "tyn": [
        "Shampoo",
        "Hair dryer (optional)",
        "Mousse (optional)",
        "Dry shampoo (optional)",
        "Paddle brush",
        "Wide-tooth comb",
        "Rat tail comb",
        "Hair pick",
        "Long hair clips",
        "Flexible hold water-free hairspray",
        "Hair tie",
        "Bobby pins",
        "Soft-bristled brush",
        "Conditioner (optional)"
    ],
    "text": " Prepping Your Hair Shampoo your hair as you normally would. Before you start teasing your hair, wet your hair in the shower or underneath a bath or sink faucet until it’s completely saturated. Then, massage a shampoo of your choice into your scalp to create a lather. Rinse the shampoo out completely. Wash your hair with a volumizing shampoo to give your hair a little more lift. Skip the conditioner after you shampoo. Because conditioner softens hair and  makes it smooth, it may keep your teased hair from holding its texture. Wash your hair with shampoo and don’t follow up with a conditioner. If you have especially dry hair, apply some conditioner to only the ends of your hair. This should help to keep it from looking dry while also not interfering with the teased areas. Dry your hair to avoid damage. Teasing your hair when it’s wet will likely damage it. You can let your hair air dry completely before you tease it, but you may get more volume by blowing it dry. Flip your head over and focus on drying the root area. Apply a volumizing product, such as mousse, after you wash your hair and before you dry it to create some more lift. Use dry shampoo as an alternative. If you don’t have time to wash your hair and blow it dry, apply dry shampoo to your roots. This should add the appearance of volume and freshness you need in order to create a solid teased hairstyle. Brush out your tangles. Depending on the thickness and texture of your hair, you can use a paddle brush or a wide-tooth comb to detangle your hair. Start at the ends of your hair and work your way up towards the roots to avoid pulling your hair out. By brushing out your hair, you’ll prevent tangles from getting caught when you tease your hair. Teasing Your Hair Hold up a ⁄2 inch (1.3 cm) section of hair at your crown. Create the section at your crown with the tail end of a rat tail comb. Pull the section straight up away from your head and hold it taut to get the best results. While teasing the crown is the most common method, you may want a bolder look for a Halloween costume or to get an 80’s hairstyle. If you’re going for a more extreme look, section all of your hair, not just the hair at your crown. Comb the hair down towards your scalp 3 times. Use a rat tail comb or a small boar-bristle brush to comb the back of your section from about mid-shaft down to your root area. Be gentle to avoid damaging your hair. Clip each section towards the front of your head. After you’ve finished teasing the first section, pull it forward and clip it to your roots near the front of your head with a long hair clip. This should keep the already-teased hair out of the way while you tease other sections. Create new sections underneath the first section and tease them. Use the tail end of your rat tail comb to create another ⁄2 inch (1.3 cm) section just underneath the original section of hair. Tease the back of the new section and then clip it to the front of your head on top of the first section. Do this for all of your sections. If you want more volume and you’ve already teased a few sections this way, add a couple of sections at your crown that are just to the left and right. Clip these forward as you did with other sections. Smooth the surface of your hair with the comb. Once you’ve finished teasing your sections, unclip them and lay them all back down naturally against your head. Gently comb over the surface of the sections to smooth them out without removing volume. Spray the teased hair with a flexible hold water-free hairspray. After you’ve gotten your hair the way you want it to be, spray some hairspray over the area to keep it intact for as long as possible. Flexible hold water-free hairspray should keep your hair in place effectively without making it look stiff. If you’re leaving your hair down, then your look is complete at this point. Styling Your Teased Hair Lift your hair with a hair pick to enhance volume. To get a little more height, slide a hair pick into your teased hair. Then, gently lift the pick up while it’s in your hair. Repeat this in different areas where your hair is teased until it looks uniformly taller. Wear your hair in a fancy fluffed-up ponytail. Tease a couple of sections of hair at the front center of your head, starting just behind your hairline. Smooth the surface back with a comb, spray it with hairspray, and put your hair in a ponytail. Wrap a piece of hair around the hair tie to hide it and secure the piece with a bobby pin. Then, hold your ponytail up and comb down from mid-shaft towards your hair tie. Try a voluminous half-up, half-down look. After teasing your crown, make a part that goes horizontally across your head and passes just in front of your ears. Use a few bobby pins to secure the teased hair at the back center of your head. Finally, gather all of the hair that’s on the side of the part closest to your face. Comb it back gently over your teased hair and secure it at the back center of your head with a clip. Brush your hair from tips to roots to get it back to normal. After you’ve rocked a teased hairstyle, its important to carefully and patiently brush through your hair. The teasing will likely have made your hair feel knotted and matted, but you can detangle it with a soft bristle brush. Slowly and gently brush small sections of your hair from tips to roots until it’s completely detangled. If you struggle to brush the tangles out of your hair, try applying more conditioner than you normally would. Apply it before shampooing, then rinse it out and wash your hair as you normally would.",
    "sentences": [
        " Prepping Your Hair Shampoo your hair as you normally would.",
        "Before you start teasing your hair, wet your hair in the shower or underneath a bath or sink faucet until it’s completely saturated.",
        "Then, massage a shampoo of your choice into your scalp to create a lather.",
        "Rinse the shampoo out completely.",
        "Wash your hair with a volumizing shampoo to give your hair a little more lift.",
        "Skip the conditioner after you shampoo.",
        "Because conditioner softens hair and  makes it smooth, it may keep your teased hair from holding its texture.",
        "Wash your hair with shampoo and don’t follow up with a conditioner.",
        "If you have especially dry hair, apply some conditioner to only the ends of your hair.",
        "This should help to keep it from looking dry while also not interfering with the teased areas.",
        "Dry your hair to avoid damage.",
        "Teasing your hair when it’s wet will likely damage it.",
        "You can let your hair air dry completely before you tease it, but you may get more volume by blowing it dry.",
        "Flip your head over and focus on drying the root area.",
        "Apply a volumizing product, such as mousse, after you wash your hair and before you dry it to create some more lift.",
        "Use dry shampoo as an alternative.",
        "If you don’t have time to wash your hair and blow it dry, apply dry shampoo to your roots.",
        "This should add the appearance of volume and freshness you need in order to create a solid teased hairstyle.",
        "Brush out your tangles.",
        "Depending on the thickness and texture of your hair, you can use a paddle brush or a wide-tooth comb to detangle your hair.",
        "Start at the ends of your hair and work your way up towards the roots to avoid pulling your hair out.",
        "By brushing out your hair, you’ll prevent tangles from getting caught when you tease your hair.",
        "Teasing Your Hair Hold up a ⁄2 inch (1.3 cm) section of hair at your crown.",
        "Create the section at your crown with the tail end of a rat tail comb.",
        "Pull the section straight up away from your head and hold it taut to get the best results.",
        "While teasing the crown is the most common method, you may want a bolder look for a Halloween costume or to get an 80’s hairstyle.",
        "If you’re going for a more extreme look, section all of your hair, not just the hair at your crown.",
        "Comb the hair down towards your scalp 3 times.",
        "Use a rat tail comb or a small boar-bristle brush to comb the back of your section from about mid-shaft down to your root area.",
        "Be gentle to avoid damaging your hair.",
        "Clip each section towards the front of your head.",
        "After you’ve finished teasing the first section, pull it forward and clip it to your roots near the front of your head with a long hair clip.",
        "This should keep the already-teased hair out of the way while you tease other sections.",
        "Create new sections underneath the first section and tease them.",
        "Use the tail end of your rat tail comb to create another ⁄2 inch (1.3 cm) section just underneath the original section of hair.",
        "Tease the back of the new section and then clip it to the front of your head on top of the first section.",
        "Do this for all of your sections.",
        "If you want more volume and you’ve already teased a few sections this way, add a couple of sections at your crown that are just to the left and right.",
        "Clip these forward as you did with other sections.",
        "Smooth the surface of your hair with the comb.",
        "Once you’ve finished teasing your sections, unclip them and lay them all back down naturally against your head.",
        "Gently comb over the surface of the sections to smooth them out without removing volume.",
        "Spray the teased hair with a flexible hold water-free hairspray.",
        "After you’ve gotten your hair the way you want it to be, spray some hairspray over the area to keep it intact for as long as possible.",
        "Flexible hold water-free hairspray should keep your hair in place effectively without making it look stiff.",
        "If you’re leaving your hair down, then your look is complete at this point.",
        "Styling Your Teased Hair Lift your hair with a hair pick to enhance volume.",
        "To get a little more height, slide a hair pick into your teased hair.",
        "Then, gently lift the pick up while it’s in your hair.",
        "Repeat this in different areas where your hair is teased until it looks uniformly taller.",
        "Wear your hair in a fancy fluffed-up ponytail.",
        "Tease a couple of sections of hair at the front center of your head, starting just behind your hairline.",
        "Smooth the surface back with a comb, spray it with hairspray, and put your hair in a ponytail.",
        "Wrap a piece of hair around the hair tie to hide it and secure the piece with a bobby pin.",
        "Then, hold your ponytail up and comb down from mid-shaft towards your hair tie.",
        "Try a voluminous half-up, half-down look.",
        "After teasing your crown, make a part that goes horizontally across your head and passes just in front of your ears.",
        "Use a few bobby pins to secure the teased hair at the back center of your head.",
        "Finally, gather all of the hair that’s on the side of the part closest to your face.",
        "Comb it back gently over your teased hair and secure it at the back center of your head with a clip.",
        "Brush your hair from tips to roots to get it back to normal.",
        "After you’ve rocked a teased hairstyle, its important to carefully and patiently brush through your hair.",
        "The teasing will likely have made your hair feel knotted and matted, but you can detangle it with a soft bristle brush.",
        "Slowly and gently brush small sections of your hair from tips to roots until it’s completely detangled.",
        "If you struggle to brush the tangles out of your hair, try applying more conditioner than you normally would.",
        "Apply it before shampooing, then rinse it out and wash your hair as you normally would."
    ]
}