{
    "title": "How to Shrink Jumpers",
    "url": "https://www.wikihow.com/Shrink-Jumpers",
    "category_hierarchy": [
        "Personal Care and Style",
        "Clothing",
        "Clothes by Type",
        "Shirts and Tops",
        "Sweaters and Jumpers"
    ],
    "methods": [
        {
            "name": "Using a Washer and Dryer",
            "steps": [
                {
                    "headline": "Set your washing machine to its highest temperature setting.",
                    "description": "Hot water causes the fibers in fabric to contract, which is what makes your jumper shrink. Check the manual that came with your washing machine if you aren’t sure what the different temperature options are. You want water that’s between 130 and 178 °F (54 and 81 °C). This method works for any fabric except wool. Washing wool in a machine can felt the wool, which essentially locks the fibers into place, making the jumper super stiff. A temperature higher than 178 °F (81 °C) could alter the shape of your jumper."
                },
                {
                    "headline": "Wash the jumper on a short cycle, between 15 to 30 minutes.",
                    "description": "This prevents prevents damage to the fabric, since the hot water alone puts a lot of pressure on your jumper. Protect it from additional stress by running it through a quick cycle in the washing machine instead of a longer one. If your jumper is dirty, use detergent as you normally would. However, if you’re just shrinking a clean jumper, you only need water."
                },
                {
                    "headline": "Tumble dry the jumper on low heat.",
                    "description": "Place the jumper in the dryer and set it to one of the lower heat settings, like delicates or permanent press. A high heat setting may be too harsh on the fabric after the high water temperature of the wash cycle. You may have to repeat the entire wash and dry cycle multiple times to get the right amount of shrinkage. How Different Fabrics Shrink\nNatural fabrics shrink very easily. These include wool, cotton, cashmere, and linen. Synthetic fabrics, like polyester or nylon, are much more difficult to shrink. Some fabrics may be “pre-shrunk,” meaning they were already shrunk during manufacturing. It’s unlikely they’ll shrink much more, if at all."
                }
            ]
        },
        {
            "name": "Shrinking a Jumper by Hand",
            "steps": [
                {
                    "headline": "Place your jumper in a plastic tub filled with warm water.",
                    "description": "You only need enough water to cover the jumper. Swish the material around in the tub to ensure it’s completely saturated. Don’t make the water too hot. It could damage delicate fabric like wool or silk. If you don’t have a plastic tub, use a bucket or the basin of a laundry sink. Controlling How Much Your Jumper Shrinks\nHow wet your jumper is before you dry it determines how much it will shrink. While putting it in the washing machine works for some people, if you don’t need to shrink your fabric very much, try spritzing it with water instead. The wetter your jumper is, the smaller it will be when it dries."
                },
                {
                    "headline": "Let the jumper soak in the water for at least 6 hours.",
                    "description": "This relaxes the fibers in the fabric so they can be more easily shaped. You can leave the jumper in the water for longer if you’d like, even overnight. Don’t let the fabric soak for more than 24 hours or it could start to mildew. Stir the jumper around occasionally to make sure all of the fabric is getting wet."
                },
                {
                    "headline": "Remove the jumper from the tub and gently press the water out of it.",
                    "description": "Do not wring or twist the fabric. This could could ruin the material or stretch it out even further. Place it in the sink and use your palms to squeeze out any excess water. You can also press a clean towel onto the jumper to soak up some of the moisture. You want the sweater to be damp, but not soaking wet."
                },
                {
                    "headline": "Lay the jumper on a drying rack and shape the areas you want to shrink.",
                    "description": "Use your hands to arrange the jumper into its proper shape. For example, if the sleeves are stretched out, push the fabric up to the right length, making sure it lies flat on the rack. Never hang a wet jumper on a clothesline or hanger. The weight of the material will pull it down and cause it to lose its shape. If you don’t have a drying rack, lay your jumper on a towel on a flat surface, like the top of your washing machine."
                },
                {
                    "headline": "Allow the jumper to dry completely before wearing it.",
                    "description": "How long it takes for your jumper to dry depends on the fabric, weight, size, and even the temperature of your home. Thicker materials or cool, damp conditions will increase the drying time. Place the drying rack somewhere where it won’t be touched. If your jumper gets moved while it’s still wet, it won’t dry properly. To speed up the drying process, use a hair dryer. Move it back and forth over the sweater so you don’t burn any areas, and be careful to never touch the wet fabric with the hair dryer itself."
                }
            ]
        }
    ],
    "tyn": [
        "Using a Washer and Dryer",
        "Washing machine",
        "Dryer",
        "Detergent (optional)",
        "Shrinking a Jumper by Hand",
        "Plastic tub",
        "Sink",
        "Water",
        "Drying rack"
    ],
    "text": " Using a Washer and Dryer Set your washing machine to its highest temperature setting. Hot water causes the fibers in fabric to contract, which is what makes your jumper shrink. Check the manual that came with your washing machine if you aren’t sure what the different temperature options are. You want water that’s between 130 and 178 °F (54 and 81 °C). This method works for any fabric except wool. Washing wool in a machine can felt the wool, which essentially locks the fibers into place, making the jumper super stiff. A temperature higher than 178 °F (81 °C) could alter the shape of your jumper. Wash the jumper on a short cycle, between 15 to 30 minutes. This prevents prevents damage to the fabric, since the hot water alone puts a lot of pressure on your jumper. Protect it from additional stress by running it through a quick cycle in the washing machine instead of a longer one. If your jumper is dirty, use detergent as you normally would. However, if you’re just shrinking a clean jumper, you only need water. Tumble dry the jumper on low heat. Place the jumper in the dryer and set it to one of the lower heat settings, like delicates or permanent press. A high heat setting may be too harsh on the fabric after the high water temperature of the wash cycle. You may have to repeat the entire wash and dry cycle multiple times to get the right amount of shrinkage. How Different Fabrics Shrink\nNatural fabrics shrink very easily. These include wool, cotton, cashmere, and linen. Synthetic fabrics, like polyester or nylon, are much more difficult to shrink. Some fabrics may be “pre-shrunk,” meaning they were already shrunk during manufacturing. It’s unlikely they’ll shrink much more, if at all. Shrinking a Jumper by Hand Place your jumper in a plastic tub filled with warm water. You only need enough water to cover the jumper. Swish the material around in the tub to ensure it’s completely saturated. Don’t make the water too hot. It could damage delicate fabric like wool or silk. If you don’t have a plastic tub, use a bucket or the basin of a laundry sink. Controlling How Much Your Jumper Shrinks\nHow wet your jumper is before you dry it determines how much it will shrink. While putting it in the washing machine works for some people, if you don’t need to shrink your fabric very much, try spritzing it with water instead. The wetter your jumper is, the smaller it will be when it dries. Let the jumper soak in the water for at least 6 hours. This relaxes the fibers in the fabric so they can be more easily shaped. You can leave the jumper in the water for longer if you’d like, even overnight. Don’t let the fabric soak for more than 24 hours or it could start to mildew. Stir the jumper around occasionally to make sure all of the fabric is getting wet. Remove the jumper from the tub and gently press the water out of it. Do not wring or twist the fabric. This could could ruin the material or stretch it out even further. Place it in the sink and use your palms to squeeze out any excess water. You can also press a clean towel onto the jumper to soak up some of the moisture. You want the sweater to be damp, but not soaking wet. Lay the jumper on a drying rack and shape the areas you want to shrink. Use your hands to arrange the jumper into its proper shape. For example, if the sleeves are stretched out, push the fabric up to the right length, making sure it lies flat on the rack. Never hang a wet jumper on a clothesline or hanger. The weight of the material will pull it down and cause it to lose its shape. If you don’t have a drying rack, lay your jumper on a towel on a flat surface, like the top of your washing machine. Allow the jumper to dry completely before wearing it. How long it takes for your jumper to dry depends on the fabric, weight, size, and even the temperature of your home. Thicker materials or cool, damp conditions will increase the drying time. Place the drying rack somewhere where it won’t be touched. If your jumper gets moved while it’s still wet, it won’t dry properly. To speed up the drying process, use a hair dryer. Move it back and forth over the sweater so you don’t burn any areas, and be careful to never touch the wet fabric with the hair dryer itself.",
    "sentences": [
        " Using a Washer and Dryer Set your washing machine to its highest temperature setting.",
        "Hot water causes the fibers in fabric to contract, which is what makes your jumper shrink.",
        "Check the manual that came with your washing machine if you aren’t sure what the different temperature options are.",
        "You want water that’s between 130 and 178 °F (54 and 81 °C).",
        "This method works for any fabric except wool.",
        "Washing wool in a machine can felt the wool, which essentially locks the fibers into place, making the jumper super stiff.",
        "A temperature higher than 178 °F (81 °C) could alter the shape of your jumper.",
        "Wash the jumper on a short cycle, between 15 to 30 minutes.",
        "This prevents prevents damage to the fabric, since the hot water alone puts a lot of pressure on your jumper.",
        "Protect it from additional stress by running it through a quick cycle in the washing machine instead of a longer one.",
        "If your jumper is dirty, use detergent as you normally would.",
        "However, if you’re just shrinking a clean jumper, you only need water.",
        "Tumble dry the jumper on low heat.",
        "Place the jumper in the dryer and set it to one of the lower heat settings, like delicates or permanent press.",
        "A high heat setting may be too harsh on the fabric after the high water temperature of the wash cycle.",
        "You may have to repeat the entire wash and dry cycle multiple times to get the right amount of shrinkage.",
        "How Different Fabrics Shrink\nNatural fabrics shrink very easily.",
        "These include wool, cotton, cashmere, and linen.",
        "Synthetic fabrics, like polyester or nylon, are much more difficult to shrink.",
        "Some fabrics may be “pre-shrunk,” meaning they were already shrunk during manufacturing.",
        "It’s unlikely they’ll shrink much more, if at all.",
        "Shrinking a Jumper by Hand Place your jumper in a plastic tub filled with warm water.",
        "You only need enough water to cover the jumper.",
        "Swish the material around in the tub to ensure it’s completely saturated.",
        "Don’t make the water too hot.",
        "It could damage delicate fabric like wool or silk.",
        "If you don’t have a plastic tub, use a bucket or the basin of a laundry sink.",
        "Controlling How Much Your Jumper Shrinks\nHow wet your jumper is before you dry it determines how much it will shrink.",
        "While putting it in the washing machine works for some people, if you don’t need to shrink your fabric very much, try spritzing it with water instead.",
        "The wetter your jumper is, the smaller it will be when it dries.",
        "Let the jumper soak in the water for at least 6 hours.",
        "This relaxes the fibers in the fabric so they can be more easily shaped.",
        "You can leave the jumper in the water for longer if you’d like, even overnight.",
        "Don’t let the fabric soak for more than 24 hours or it could start to mildew.",
        "Stir the jumper around occasionally to make sure all of the fabric is getting wet.",
        "Remove the jumper from the tub and gently press the water out of it.",
        "Do not wring or twist the fabric.",
        "This could could ruin the material or stretch it out even further.",
        "Place it in the sink and use your palms to squeeze out any excess water.",
        "You can also press a clean towel onto the jumper to soak up some of the moisture.",
        "You want the sweater to be damp, but not soaking wet.",
        "Lay the jumper on a drying rack and shape the areas you want to shrink.",
        "Use your hands to arrange the jumper into its proper shape.",
        "For example, if the sleeves are stretched out, push the fabric up to the right length, making sure it lies flat on the rack.",
        "Never hang a wet jumper on a clothesline or hanger.",
        "The weight of the material will pull it down and cause it to lose its shape.",
        "If you don’t have a drying rack, lay your jumper on a towel on a flat surface, like the top of your washing machine.",
        "Allow the jumper to dry completely before wearing it.",
        "How long it takes for your jumper to dry depends on the fabric, weight, size, and even the temperature of your home.",
        "Thicker materials or cool, damp conditions will increase the drying time.",
        "Place the drying rack somewhere where it won’t be touched.",
        "If your jumper gets moved while it’s still wet, it won’t dry properly.",
        "To speed up the drying process, use a hair dryer.",
        "Move it back and forth over the sweater so you don’t burn any areas, and be careful to never touch the wet fabric with the hair dryer itself."
    ]
}