{
    "title": "How to Thicken a Cream Sauce",
    "url": "https://www.wikihow.com/Thicken-a-Cream-Sauce",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments",
        "Sauces"
    ],
    "methods": [
        {
            "name": "Reducing the Sauce",
            "steps": [
                {
                    "headline": "Bring the cream sauce to a simmer.",
                    "description": "The easiest way to thicken a cream sauce is by reducing it on the stovetop. This method will allow some of the sauce to evaporate, thickening it in the process. Adjust the heat on your stovetop to bring the sauce to a simmer. The sauce should stay just below the boiling point as it simmers."
                },
                {
                    "headline": "Avoid letting the sauce boil.",
                    "description": "It’s important that you do not allow cream sauce to boil. High heat can cause dairy to separate, ruining the texture of your cream sauce. Keep the sauce simmering, and make sure it doesn’t begin boiling. If the sauce begins to boil, reduce the heat immediately or remove it from the stove completely. Allowing the dairy to separate can also affect the flavor of your sauce, so watch the sauce vigilantly."
                },
                {
                    "headline": "Stir the sauce frequently.",
                    "description": "You will need to be attentive while reducing the sauce. Cream sauces can burn easily, and you will need to stir the sauce regularly while reducing it. Try using a wooden spoon to stir the sauce as it reduces."
                },
                {
                    "headline": "Simmer the sauce until it is reduced to the desired thickness.",
                    "description": "The amount of time you will need to reduce the sauce depends on your preference and the sauce itself. Cream sauces can take anywhere from 10 to 30 minutes to reduce to the consistency desired by the chef. Make sure you test the thickness of your sauce by tasting it every 10 minutes. This can help you prevent overcooking it."
                },
                {
                    "headline": "Add a thickener if reducing the sauce doesn’t work.",
                    "description": "Sometimes reducing a cream sauce isn’t enough to bring it to a chef’s desired thickness. If you’ve reduced the cream sauce for 30 minutes and you still don’t have a thick enough sauce, consider using a thickener."
                }
            ]
        },
        {
            "name": "Using a Thickener",
            "steps": [
                {
                    "headline": "Thicken the sauce with a flour slurry.",
                    "description": "Whisk together equal parts flour and cold water in a cup or small bowl. Once you’ve whisked the flour and water into a smooth slurry, stir the slurry into the cream sauce 1 teaspoon at a time. Once you’ve whisked in the slurry, simmer the sauce for about 5 minutes to get rid of any raw flour taste. In general, you will want to use about 4 teaspoons or 20 mL of slurry for every liter or quart of cream sauce."
                },
                {
                    "headline": "Use a roux to thicken the sauce.",
                    "description": "Measure out equal parts butter and flour. Melt the butter over medium heat, and stir in the flour until it is completely incorporated into the butter. Whisk the roux into the cream sauce a little bit at a time until you reach the desired consistency. If you want to further develop the flavor of the roux, you can cook it for a couple of minutes before adding it to the cream sauce. You will need anywhere from 2-4 tablespoons or 30-60 mL of roux to thicken each cup or 250 mL of cream sauce."
                },
                {
                    "headline": "Try adding a cornstarch slurry.",
                    "description": "Mix together equal parts cold water and cornstarch, whisking the mixture to create a slurry. Make sure the slurry is completely combined to prevent lumps in your cream sauce. Once you’ve thoroughly combined the cornstarch and water, whisk the slurry into the sauce 1 tablespoon or 15 mL at a time. Continue stirring the sauce over medium heat for about two minutes to thicken the sauce. You will need about 2 tablespoons or 30 mL of slurry for each cup of sauce. Keep in mind you may want to use more or less slurry, depending on how thick you want the cream sauce to be."
                },
                {
                    "headline": "Use egg yolk to thicken cream sauces containing egg.",
                    "description": "If you’re making a cream sauce that contains egg, like hollandaise, egg yolks are a great thickener. Crack an egg in a bowl and transfer the yolk to a separate bowl. Whisk the egg yolk and slowly add your cream sauce to the bowl, whisking it in one spoonful at a time until you have about 1 cup or 240 mL of liquid. Gently whisk the egg yolk liquid into your cream sauce until you reach the desired consistency. You may not need to use all of the egg yolk liquid to thicken the cream sauce. Whisk in as little or as much of the egg yolk liquid as is necessary to reach your desired thickness."
                },
                {
                    "headline": "Stir kneaded butter into the sauce.",
                    "description": "Use a fork to mash equal parts softened butter and flour together in a small bowl. Keep mashing the butter and flour until it becomes a thick paste. Measure a small spoonful of the paste and use your hands to roll it into a small ball. Drop the ball into the sauce while rapidly stirring the sauce. Continue stirring until you reach the desired consistency. You can add multiple balls of kneaded butter to reach the consistency you desire. Make sure you only add one ball of kneaded butter at a time."
                }
            ]
        }
    ],
    "tyn": [
        "An electric or gas range with a stovetop",
        "Saucepan",
        "Wooden spoon",
        "Whisk",
        "Measuring cups",
        "Measuring spoons",
        "Small bowl for mixing thickeners"
    ],
    "text": " Reducing the Sauce Bring the cream sauce to a simmer. The easiest way to thicken a cream sauce is by reducing it on the stovetop. This method will allow some of the sauce to evaporate, thickening it in the process. Adjust the heat on your stovetop to bring the sauce to a simmer. The sauce should stay just below the boiling point as it simmers. Avoid letting the sauce boil. It’s important that you do not allow cream sauce to boil. High heat can cause dairy to separate, ruining the texture of your cream sauce. Keep the sauce simmering, and make sure it doesn’t begin boiling. If the sauce begins to boil, reduce the heat immediately or remove it from the stove completely. Allowing the dairy to separate can also affect the flavor of your sauce, so watch the sauce vigilantly. Stir the sauce frequently. You will need to be attentive while reducing the sauce. Cream sauces can burn easily, and you will need to stir the sauce regularly while reducing it. Try using a wooden spoon to stir the sauce as it reduces. Simmer the sauce until it is reduced to the desired thickness. The amount of time you will need to reduce the sauce depends on your preference and the sauce itself. Cream sauces can take anywhere from 10 to 30 minutes to reduce to the consistency desired by the chef. Make sure you test the thickness of your sauce by tasting it every 10 minutes. This can help you prevent overcooking it. Add a thickener if reducing the sauce doesn’t work. Sometimes reducing a cream sauce isn’t enough to bring it to a chef’s desired thickness. If you’ve reduced the cream sauce for 30 minutes and you still don’t have a thick enough sauce, consider using a thickener. Using a Thickener Thicken the sauce with a flour slurry. Whisk together equal parts flour and cold water in a cup or small bowl. Once you’ve whisked the flour and water into a smooth slurry, stir the slurry into the cream sauce 1 teaspoon at a time. Once you’ve whisked in the slurry, simmer the sauce for about 5 minutes to get rid of any raw flour taste. In general, you will want to use about 4 teaspoons or 20 mL of slurry for every liter or quart of cream sauce. Use a roux to thicken the sauce. Measure out equal parts butter and flour. Melt the butter over medium heat, and stir in the flour until it is completely incorporated into the butter. Whisk the roux into the cream sauce a little bit at a time until you reach the desired consistency. If you want to further develop the flavor of the roux, you can cook it for a couple of minutes before adding it to the cream sauce. You will need anywhere from 2-4 tablespoons or 30-60 mL of roux to thicken each cup or 250 mL of cream sauce. Try adding a cornstarch slurry. Mix together equal parts cold water and cornstarch, whisking the mixture to create a slurry. Make sure the slurry is completely combined to prevent lumps in your cream sauce. Once you’ve thoroughly combined the cornstarch and water, whisk the slurry into the sauce 1 tablespoon or 15 mL at a time. Continue stirring the sauce over medium heat for about two minutes to thicken the sauce. You will need about 2 tablespoons or 30 mL of slurry for each cup of sauce. Keep in mind you may want to use more or less slurry, depending on how thick you want the cream sauce to be. Use egg yolk to thicken cream sauces containing egg. If you’re making a cream sauce that contains egg, like hollandaise, egg yolks are a great thickener. Crack an egg in a bowl and transfer the yolk to a separate bowl. Whisk the egg yolk and slowly add your cream sauce to the bowl, whisking it in one spoonful at a time until you have about 1 cup or 240 mL of liquid. Gently whisk the egg yolk liquid into your cream sauce until you reach the desired consistency. You may not need to use all of the egg yolk liquid to thicken the cream sauce. Whisk in as little or as much of the egg yolk liquid as is necessary to reach your desired thickness. Stir kneaded butter into the sauce. Use a fork to mash equal parts softened butter and flour together in a small bowl. Keep mashing the butter and flour until it becomes a thick paste. Measure a small spoonful of the paste and use your hands to roll it into a small ball. Drop the ball into the sauce while rapidly stirring the sauce. Continue stirring until you reach the desired consistency. You can add multiple balls of kneaded butter to reach the consistency you desire. Make sure you only add one ball of kneaded butter at a time.",
    "sentences": [
        " Reducing the Sauce Bring the cream sauce to a simmer.",
        "The easiest way to thicken a cream sauce is by reducing it on the stovetop.",
        "This method will allow some of the sauce to evaporate, thickening it in the process.",
        "Adjust the heat on your stovetop to bring the sauce to a simmer.",
        "The sauce should stay just below the boiling point as it simmers.",
        "Avoid letting the sauce boil.",
        "It’s important that you do not allow cream sauce to boil.",
        "High heat can cause dairy to separate, ruining the texture of your cream sauce.",
        "Keep the sauce simmering, and make sure it doesn’t begin boiling.",
        "If the sauce begins to boil, reduce the heat immediately or remove it from the stove completely.",
        "Allowing the dairy to separate can also affect the flavor of your sauce, so watch the sauce vigilantly.",
        "Stir the sauce frequently.",
        "You will need to be attentive while reducing the sauce.",
        "Cream sauces can burn easily, and you will need to stir the sauce regularly while reducing it.",
        "Try using a wooden spoon to stir the sauce as it reduces.",
        "Simmer the sauce until it is reduced to the desired thickness.",
        "The amount of time you will need to reduce the sauce depends on your preference and the sauce itself.",
        "Cream sauces can take anywhere from 10 to 30 minutes to reduce to the consistency desired by the chef.",
        "Make sure you test the thickness of your sauce by tasting it every 10 minutes.",
        "This can help you prevent overcooking it.",
        "Add a thickener if reducing the sauce doesn’t work.",
        "Sometimes reducing a cream sauce isn’t enough to bring it to a chef’s desired thickness.",
        "If you’ve reduced the cream sauce for 30 minutes and you still don’t have a thick enough sauce, consider using a thickener.",
        "Using a Thickener Thicken the sauce with a flour slurry.",
        "Whisk together equal parts flour and cold water in a cup or small bowl.",
        "Once you’ve whisked the flour and water into a smooth slurry, stir the slurry into the cream sauce 1 teaspoon at a time.",
        "Once you’ve whisked in the slurry, simmer the sauce for about 5 minutes to get rid of any raw flour taste.",
        "In general, you will want to use about 4 teaspoons or 20 mL of slurry for every liter or quart of cream sauce.",
        "Use a roux to thicken the sauce.",
        "Measure out equal parts butter and flour.",
        "Melt the butter over medium heat, and stir in the flour until it is completely incorporated into the butter.",
        "Whisk the roux into the cream sauce a little bit at a time until you reach the desired consistency.",
        "If you want to further develop the flavor of the roux, you can cook it for a couple of minutes before adding it to the cream sauce.",
        "You will need anywhere from 2-4 tablespoons or 30-60 mL of roux to thicken each cup or 250 mL of cream sauce.",
        "Try adding a cornstarch slurry.",
        "Mix together equal parts cold water and cornstarch, whisking the mixture to create a slurry.",
        "Make sure the slurry is completely combined to prevent lumps in your cream sauce.",
        "Once you’ve thoroughly combined the cornstarch and water, whisk the slurry into the sauce 1 tablespoon or 15 mL at a time.",
        "Continue stirring the sauce over medium heat for about two minutes to thicken the sauce.",
        "You will need about 2 tablespoons or 30 mL of slurry for each cup of sauce.",
        "Keep in mind you may want to use more or less slurry, depending on how thick you want the cream sauce to be.",
        "Use egg yolk to thicken cream sauces containing egg.",
        "If you’re making a cream sauce that contains egg, like hollandaise, egg yolks are a great thickener.",
        "Crack an egg in a bowl and transfer the yolk to a separate bowl.",
        "Whisk the egg yolk and slowly add your cream sauce to the bowl, whisking it in one spoonful at a time until you have about 1 cup or 240 mL of liquid.",
        "Gently whisk the egg yolk liquid into your cream sauce until you reach the desired consistency.",
        "You may not need to use all of the egg yolk liquid to thicken the cream sauce.",
        "Whisk in as little or as much of the egg yolk liquid as is necessary to reach your desired thickness.",
        "Stir kneaded butter into the sauce.",
        "Use a fork to mash equal parts softened butter and flour together in a small bowl.",
        "Keep mashing the butter and flour until it becomes a thick paste.",
        "Measure a small spoonful of the paste and use your hands to roll it into a small ball.",
        "Drop the ball into the sauce while rapidly stirring the sauce.",
        "Continue stirring until you reach the desired consistency.",
        "You can add multiple balls of kneaded butter to reach the consistency you desire.",
        "Make sure you only add one ball of kneaded butter at a time."
    ]
}