{
    "title": "How to Add Massage Services to a Beauty Salon",
    "url": "https://www.wikihow.com/Add-Massage-Services-to-a-Beauty-Salon",
    "category_hierarchy": [
        "Personal Care and Style",
        "Massage"
    ],
    "parts": [
        {
            "name": "Setting a Workspace",
            "steps": [
                {
                    "headline": "Make a private space for massage clients.",
                    "description": "Setting a room aside for your massage therapist and their clients allows for maximum comfort and privacy. Make sure the room is large enough to house the necessary products, lay out a massage table, and allow your therapist to work comfortably. The minimum size of the room should be 9 feet (2.7 m) by 12 feet (3.7 m). Sometimes, a massage therapist will provide their own lotions and massage oils, so talk with potential therapists to determine whether or not you need to purchase the supplies."
                },
                {
                    "headline": "Purchase a massage table.",
                    "description": "Massage tables can run anywhere $300 to a high-end $2000 model. Many tables are offered through various professional websites. Find a massage table that offers comfort and relaxation for your customers. Sanitize the tables using disinfectant spray or wipes in between customers to stay hygienic."
                },
                {
                    "headline": "Provide robes and towels.",
                    "description": "Let your customers in robes and soft towels as they get ready for their massage. Adding these personal touches will show that you care about your customers' comfort levels. Decent robes run around $17 each, but discounts are offered in ordered in bulk through specific sites. Have enough robes and towels in stock to cover one day of business so each customer has a fresh robe. Wash all the robes and towels used at the end of the day so they are clean for the next day."
                },
                {
                    "headline": "Add calming ambient music.",
                    "description": "In addition to helping block out noises from the rest of the salon, providing ambient music during a massage will help the customer relax and actually ease pain. Keep the music at a lower volume for maximum relaxation. Always have a backup method of providing music. If the internet goes out, have CDs and a stereo to quickly replace the music."
                },
                {
                    "headline": "Light candles for a relaxing environment.",
                    "description": "Candlelight has a calming effect on many individuals. Place a few around the room, at least 12 inches (30 cm) from flammable substances and on sturdy surfaces. Some customers may have sensitivity to scented candles, so it may be in your best interest to use unscented candles. For a safe alternative, use flameless electric candles in place of standard candles."
                },
                {
                    "headline": "Use essential oils to eliminate odor.",
                    "description": "Essential oils come in a variety of scents and provide aromatherapy to customers. The use of essential oils will also help mask any body odors that may be present in the room. Provide a variety of scents, including but not limited to, eucalyptus, lavender, and tea tree."
                }
            ]
        },
        {
            "name": "Finding a Massage Therapist",
            "steps": [
                {
                    "headline": "Find a versatile massage therapist.",
                    "description": "Your clients will differ in the style of massage they receive. Many therapists will train in a variety of massage techniques. Find a therapist that can cater to your clients' various needs. You can use the American Massage Therapy Association's search engine to find trusted and professional therapists."
                },
                {
                    "headline": "Offer Swedish massage to reduce stress.",
                    "description": "When you think of massage, this is probably what you're picturing. Swedish massage is one of the most common and is used to help relax the body and relieve stress. Using circular hand motions, a therapist will apply even pressure to the body."
                },
                {
                    "headline": "Provide deep tissue massage to relieve muscle tension.",
                    "description": "Consider this style similar to Swedish massage with more pressure applied. Deep tissue massage will help work out troubled and strained areas on the body."
                },
                {
                    "headline": "Choose between a contractor or full-time staff.",
                    "description": "The average salary for a massage therapist as of 2014 is around $35,000. Many massage therapists are already independent contractors and will bring in an additional client base. Having a contractor helps you not worry about providing benefits or deducting taxes, and you'll be able to take portions of what you charge for the massage and profit it to the salon. Contractors will be able to work anywhere unless a non-competition agreement is signed."
                },
                {
                    "headline": "Ensure the therapist has the proper licensing for your location.",
                    "description": "Many states will require a massage therapist to meet proper regulations and licensing. This usually requires around 500 of schooling or curriculum. This ensures the safety and well-being of your customers. Check with your local regulations to determine what is necessary of your massage therapist."
                },
                {
                    "headline": "Have liability and commercial property insurance.",
                    "description": "Accidents happen. Be sure that your salon has liability insurance to cover injuries that any of your clients may have. Commercial property insurance will help cover any damage done to the property and the necessary materials your massage therapist will use."
                }
            ]
        },
        {
            "name": "Marketing Your New Services",
            "steps": [
                {
                    "headline": "Create handouts and takeaways for customers.",
                    "description": "Flyers and business cards will help spread the addition of your new service. Place them at the front counter in an easy to reach place so customers have easy access to them on their way in and out of the salon. Find local businesses with public bulletin boards to hang announcements across your location."
                },
                {
                    "headline": "Talk up new services to current customers.",
                    "description": "Even when your customers are taking advantage of your other services, mention your new offering. Planting the seed in their minds may help sway them into purchasing a massage service in the future. Listen to your clients as they converse with the stylists. If they mention being stressed, say “You know, we've just added a massage service that could help you.”"
                },
                {
                    "headline": "Set a price for your massage services.",
                    "description": "A good baseline price is set at $1/minute, but to make more profits, it's okay to upcharge. Many 60-minute massages start around $80 while 90-minute services cast around $100."
                },
                {
                    "headline": "Combine services to make a package deal.",
                    "description": "Selling massages for full price and combining it with cheaper hair or nail service is a great way to ease your customers into a purchase. Include these deals on your takeaways so customers can show prospective clients as well. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Morales, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Massage Therapist\t\t\t\t\t\t\t\tMarty Morales is a Professional Massage Therapist and the Founder and Owner of the Morales Method, a manual therapy and body conditioning business based in the San Francisco Bay Area and in Los Angeles, California. Marty has over 16 years of massage therapist experience and over 13 years of experience educating others on the best practices for massage therapy. Marty has over 10,000 hours of private practice logged and is a Certified Advanced Rolfer and Rolf Movement Practitioner, CMT. He has an MBA in Finance from Loyola Marymount University, Los Angeles. Marty Morales, MBA\t\t\tProfessional Massage Therapist\t\t\t\tWhat types of massages should I offer if I'm starting as a massage therapist? You should at least have the basics: Swedish, deep tissue, and sports. Once you start working, your current clients are your best teachers. They'll bring up their issues, and you'll learn what you do and don't like to work on. That guides you to any additional training you want to take like Thai and Shiatsu."
                },
                {
                    "headline": "Have a survey or questionnaire for clients to fill out after the massage.",
                    "description": "Ask questions like 'Did you enjoy your massage?' or 'Would you recommend our massage service to others?' This will help you gauge how your clients enjoy the new service that you provide."
                }
            ]
        }
    ],
    "tyn": [
        "Massage table",
        "Sheets and blankets",
        "Oils, lotions and creams",
        "Calming music",
        "Cotton robes"
    ],
    "text": " Setting a Workspace Make a private space for massage clients. Setting a room aside for your massage therapist and their clients allows for maximum comfort and privacy. Make sure the room is large enough to house the necessary products, lay out a massage table, and allow your therapist to work comfortably. The minimum size of the room should be 9 feet (2.7 m) by 12 feet (3.7 m). Sometimes, a massage therapist will provide their own lotions and massage oils, so talk with potential therapists to determine whether or not you need to purchase the supplies. Purchase a massage table. Massage tables can run anywhere $300 to a high-end $2000 model. Many tables are offered through various professional websites. Find a massage table that offers comfort and relaxation for your customers. Sanitize the tables using disinfectant spray or wipes in between customers to stay hygienic. Provide robes and towels. Let your customers in robes and soft towels as they get ready for their massage. Adding these personal touches will show that you care about your customers' comfort levels. Decent robes run around $17 each, but discounts are offered in ordered in bulk through specific sites. Have enough robes and towels in stock to cover one day of business so each customer has a fresh robe. Wash all the robes and towels used at the end of the day so they are clean for the next day. Add calming ambient music. In addition to helping block out noises from the rest of the salon, providing ambient music during a massage will help the customer relax and actually ease pain. Keep the music at a lower volume for maximum relaxation. Always have a backup method of providing music. If the internet goes out, have CDs and a stereo to quickly replace the music. Light candles for a relaxing environment. Candlelight has a calming effect on many individuals. Place a few around the room, at least 12 inches (30 cm) from flammable substances and on sturdy surfaces. Some customers may have sensitivity to scented candles, so it may be in your best interest to use unscented candles. For a safe alternative, use flameless electric candles in place of standard candles. Use essential oils to eliminate odor. Essential oils come in a variety of scents and provide aromatherapy to customers. The use of essential oils will also help mask any body odors that may be present in the room. Provide a variety of scents, including but not limited to, eucalyptus, lavender, and tea tree. Finding a Massage Therapist Find a versatile massage therapist. Your clients will differ in the style of massage they receive. Many therapists will train in a variety of massage techniques. Find a therapist that can cater to your clients' various needs. You can use the American Massage Therapy Association's search engine to find trusted and professional therapists. Offer Swedish massage to reduce stress. When you think of massage, this is probably what you're picturing. Swedish massage is one of the most common and is used to help relax the body and relieve stress. Using circular hand motions, a therapist will apply even pressure to the body. Provide deep tissue massage to relieve muscle tension. Consider this style similar to Swedish massage with more pressure applied. Deep tissue massage will help work out troubled and strained areas on the body. Choose between a contractor or full-time staff. The average salary for a massage therapist as of 2014 is around $35,000. Many massage therapists are already independent contractors and will bring in an additional client base. Having a contractor helps you not worry about providing benefits or deducting taxes, and you'll be able to take portions of what you charge for the massage and profit it to the salon. Contractors will be able to work anywhere unless a non-competition agreement is signed. Ensure the therapist has the proper licensing for your location. Many states will require a massage therapist to meet proper regulations and licensing. This usually requires around 500 of schooling or curriculum. This ensures the safety and well-being of your customers. Check with your local regulations to determine what is necessary of your massage therapist. Have liability and commercial property insurance. Accidents happen. Be sure that your salon has liability insurance to cover injuries that any of your clients may have. Commercial property insurance will help cover any damage done to the property and the necessary materials your massage therapist will use. Marketing Your New Services Create handouts and takeaways for customers. Flyers and business cards will help spread the addition of your new service. Place them at the front counter in an easy to reach place so customers have easy access to them on their way in and out of the salon. Find local businesses with public bulletin boards to hang announcements across your location. Talk up new services to current customers. Even when your customers are taking advantage of your other services, mention your new offering. Planting the seed in their minds may help sway them into purchasing a massage service in the future. Listen to your clients as they converse with the stylists. If they mention being stressed, say “You know, we've just added a massage service that could help you.” Set a price for your massage services. A good baseline price is set at $1/minute, but to make more profits, it's okay to upcharge. Many 60-minute massages start around $80 while 90-minute services cast around $100. Combine services to make a package deal. Selling massages for full price and combining it with cheaper hair or nail service is a great way to ease your customers into a purchase. Include these deals on your takeaways so customers can show prospective clients as well. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Morales, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Massage Therapist\t\t\t\t\t\t\t\tMarty Morales is a Professional Massage Therapist and the Founder and Owner of the Morales Method, a manual therapy and body conditioning business based in the San Francisco Bay Area and in Los Angeles, California. Marty has over 16 years of massage therapist experience and over 13 years of experience educating others on the best practices for massage therapy. Marty has over 10,000 hours of private practice logged and is a Certified Advanced Rolfer and Rolf Movement Practitioner, CMT. He has an MBA in Finance from Loyola Marymount University, Los Angeles. Marty Morales, MBA\t\t\tProfessional Massage Therapist\t\t\t\tWhat types of massages should I offer if I'm starting as a massage therapist? You should at least have the basics: Swedish, deep tissue, and sports. Once you start working, your current clients are your best teachers. They'll bring up their issues, and you'll learn what you do and don't like to work on. That guides you to any additional training you want to take like Thai and Shiatsu. Have a survey or questionnaire for clients to fill out after the massage. Ask questions like 'Did you enjoy your massage?' or 'Would you recommend our massage service to others?' This will help you gauge how your clients enjoy the new service that you provide.",
    "sentences": [
        " Setting a Workspace Make a private space for massage clients.",
        "Setting a room aside for your massage therapist and their clients allows for maximum comfort and privacy.",
        "Make sure the room is large enough to house the necessary products, lay out a massage table, and allow your therapist to work comfortably.",
        "The minimum size of the room should be 9 feet (2.7 m) by 12 feet (3.7 m).",
        "Sometimes, a massage therapist will provide their own lotions and massage oils, so talk with potential therapists to determine whether or not you need to purchase the supplies.",
        "Purchase a massage table.",
        "Massage tables can run anywhere $300 to a high-end $2000 model.",
        "Many tables are offered through various professional websites.",
        "Find a massage table that offers comfort and relaxation for your customers.",
        "Sanitize the tables using disinfectant spray or wipes in between customers to stay hygienic.",
        "Provide robes and towels.",
        "Let your customers in robes and soft towels as they get ready for their massage.",
        "Adding these personal touches will show that you care about your customers' comfort levels.",
        "Decent robes run around $17 each, but discounts are offered in ordered in bulk through specific sites.",
        "Have enough robes and towels in stock to cover one day of business so each customer has a fresh robe.",
        "Wash all the robes and towels used at the end of the day so they are clean for the next day.",
        "Add calming ambient music.",
        "In addition to helping block out noises from the rest of the salon, providing ambient music during a massage will help the customer relax and actually ease pain.",
        "Keep the music at a lower volume for maximum relaxation.",
        "Always have a backup method of providing music.",
        "If the internet goes out, have CDs and a stereo to quickly replace the music.",
        "Light candles for a relaxing environment.",
        "Candlelight has a calming effect on many individuals.",
        "Place a few around the room, at least 12 inches (30 cm) from flammable substances and on sturdy surfaces.",
        "Some customers may have sensitivity to scented candles, so it may be in your best interest to use unscented candles.",
        "For a safe alternative, use flameless electric candles in place of standard candles.",
        "Use essential oils to eliminate odor.",
        "Essential oils come in a variety of scents and provide aromatherapy to customers.",
        "The use of essential oils will also help mask any body odors that may be present in the room.",
        "Provide a variety of scents, including but not limited to, eucalyptus, lavender, and tea tree.",
        "Finding a Massage Therapist Find a versatile massage therapist.",
        "Your clients will differ in the style of massage they receive.",
        "Many therapists will train in a variety of massage techniques.",
        "Find a therapist that can cater to your clients' various needs.",
        "You can use the American Massage Therapy Association's search engine to find trusted and professional therapists.",
        "Offer Swedish massage to reduce stress.",
        "When you think of massage, this is probably what you're picturing.",
        "Swedish massage is one of the most common and is used to help relax the body and relieve stress.",
        "Using circular hand motions, a therapist will apply even pressure to the body.",
        "Provide deep tissue massage to relieve muscle tension.",
        "Consider this style similar to Swedish massage with more pressure applied.",
        "Deep tissue massage will help work out troubled and strained areas on the body.",
        "Choose between a contractor or full-time staff.",
        "The average salary for a massage therapist as of 2014 is around $35,000.",
        "Many massage therapists are already independent contractors and will bring in an additional client base.",
        "Having a contractor helps you not worry about providing benefits or deducting taxes, and you'll be able to take portions of what you charge for the massage and profit it to the salon.",
        "Contractors will be able to work anywhere unless a non-competition agreement is signed.",
        "Ensure the therapist has the proper licensing for your location.",
        "Many states will require a massage therapist to meet proper regulations and licensing.",
        "This usually requires around 500 of schooling or curriculum.",
        "This ensures the safety and well-being of your customers.",
        "Check with your local regulations to determine what is necessary of your massage therapist.",
        "Have liability and commercial property insurance.",
        "Accidents happen.",
        "Be sure that your salon has liability insurance to cover injuries that any of your clients may have.",
        "Commercial property insurance will help cover any damage done to the property and the necessary materials your massage therapist will use.",
        "Marketing Your New Services Create handouts and takeaways for customers.",
        "Flyers and business cards will help spread the addition of your new service.",
        "Place them at the front counter in an easy to reach place so customers have easy access to them on their way in and out of the salon.",
        "Find local businesses with public bulletin boards to hang announcements across your location.",
        "Talk up new services to current customers.",
        "Even when your customers are taking advantage of your other services, mention your new offering.",
        "Planting the seed in their minds may help sway them into purchasing a massage service in the future.",
        "Listen to your clients as they converse with the stylists.",
        "If they mention being stressed, say “You know, we've just added a massage service that could help you.” Set a price for your massage services.",
        "A good baseline price is set at $1/minute, but to make more profits, it's okay to upcharge.",
        "Many 60-minute massages start around $80 while 90-minute services cast around $100.",
        "Combine services to make a package deal.",
        "Selling massages for full price and combining it with cheaper hair or nail service is a great way to ease your customers into a purchase.",
        "Include these deals on your takeaways so customers can show prospective clients as well.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Morales, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Massage Therapist\t\t\t\t\t\t\t\tMarty Morales is a Professional Massage Therapist and the Founder and Owner of the Morales Method, a manual therapy and body conditioning business based in the San Francisco Bay Area and in Los Angeles, California.",
        "Marty has over 16 years of massage therapist experience and over 13 years of experience educating others on the best practices for massage therapy.",
        "Marty has over 10,000 hours of private practice logged and is a Certified Advanced Rolfer and Rolf Movement Practitioner, CMT.",
        "He has an MBA in Finance from Loyola Marymount University, Los Angeles.",
        "Marty Morales, MBA\t\t\tProfessional Massage Therapist\t\t\t\tWhat types of massages should I offer if I'm starting as a massage therapist?",
        "You should at least have the basics: Swedish, deep tissue, and sports.",
        "Once you start working, your current clients are your best teachers.",
        "They'll bring up their issues, and you'll learn what you do and don't like to work on.",
        "That guides you to any additional training you want to take like Thai and Shiatsu.",
        "Have a survey or questionnaire for clients to fill out after the massage.",
        "Ask questions like 'Did you enjoy your massage?'",
        "or 'Would you recommend our massage service to others?'",
        "This will help you gauge how your clients enjoy the new service that you provide."
    ]
}