{
    "title": "How to Make South Asian Paan",
    "url": "https://www.wikihow.com/Make-South-Asian-Paan",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "Indian Cuisine",
        "Indian Desserts"
    ],
    "parts": [
        {
            "name": "Preparing the Betel Leaves",
            "steps": [
                {
                    "headline": "Wash the betel leaves.",
                    "description": "Hold your betel leaves under running water and dab them dry with a paper towel, making sure not to tear them."
                },
                {
                    "headline": "Cut the betel leaves' stems off.",
                    "description": "Fold your betel leaves in half and use clean scissors to cut off the stem at the bottom of the leaves. Similarly, you can just tear this stem off with your hands."
                },
                {
                    "headline": "Cut the betel leaves.",
                    "description": "Lay down your leaves separately on your work surface with the pointy side facing up. Use clean scissors to cut a slit that goes ⅓-½ up the leaf from the bottom rounded side."
                },
                {
                    "headline": "Add the chuna.",
                    "description": "Chuna is calcium hydroxide made into a paste. It is very common for chuna to dry out. If this is the case, take some of the chuna powder out into a separate bowl and hydrate it with some water. Then, use your finger or a small spoon and rub a small amount of chuna on one side of your leaves."
                },
                {
                    "headline": "Add the katha powder.",
                    "description": "Katha is a powder extract derived from the catechu plant. Sprinkle some katha powder on top of your leaves."
                }
            ]
        },
        {
            "name": "Filling Your Paan",
            "steps": [
                {
                    "headline": "Prepare your leaves.",
                    "description": "Turn your leaves 180 degrees so the pointy side is facing down. Find the slit you made earlier."
                },
                {
                    "headline": "Form a leaf cup.",
                    "description": "Grab one side formed by the slit and slowly start pulling it towards the opposite side. Do the same procedure with the other side at the same time to form a cup."
                },
                {
                    "headline": "Put your leaf into the correct orientation.",
                    "description": "Turn your cup around so the pointy side is facing up. You are now ready to start filling your cup."
                },
                {
                    "headline": "Add paan chatni.",
                    "description": "Paan chatni is a paste that is flavored with saffron with the addition of silver or gold leaf. Add a small amount into your newly made betel leaf cup."
                },
                {
                    "headline": "Add gulkand.",
                    "description": "Gulkand is a rose-flavored jam. Add a spoonful of gulkand inside your cup. Add more if you would like your paan to be sweeter."
                },
                {
                    "headline": "Add fennel seeds.",
                    "description": "Sugar coated colorful and plain fennel seeds are available for purchase in most Indian grocery markets. Feel free to add either or both of them. This is one of the mouth-freshening portions of our paan."
                },
                {
                    "headline": "Add cardamom.",
                    "description": "Some individuals enjoy whole cardamom inside their paan while others prefer it crushed. If you would like to crush your cardamom, use a spatula or your hand and apply some pressure to crack the shell slightly. Add as many as you like to your paan."
                },
                {
                    "headline": "Add coconut.",
                    "description": "Coconut comes in many forms such as sweetened or desiccated. For this paan, desiccated coconut was used but feel free to use your desired form of coconut."
                },
                {
                    "headline": "Add menthol crystals.",
                    "description": "Menthol crystals are extracted from peppermint oil. They give a very refreshing minty taste. Add 1-2 small pieces inside."
                },
                {
                    "headline": "Add Tutti Frutti.",
                    "description": "Tutti Frutti is candied fruit. This is an optional ingredient that many children enjoy adding."
                },
                {
                    "headline": "Add betel nuts.",
                    "description": "This step is completely optional considering betel nuts eaten in large amounts can be detrimental to health. If you plan to add them, only add a few pieces and avoid eating them excessively."
                }
            ]
        },
        {
            "name": "Folding Your Paan",
            "steps": [
                {
                    "headline": "Fold your paan.",
                    "description": "Recall that your paan is in a pocket shape. Flatten this pocket by pushing down with your thumb."
                },
                {
                    "headline": "Get the right triangle shape.",
                    "description": "There will be a triangle sticking out at the top. Fold that triangle down."
                },
                {
                    "headline": "Seal your paan.",
                    "description": "Seal your paan close with a toothpick, clove piece or wrap it in foil. In this demonstration a clove piece was used to seal the paan closed. None of these are required and the paan can be eaten directly at this point as well."
                },
                {
                    "headline": "Enjoy your paan.",
                    "description": "Traditionally, South Asians eat paan in one bite. Enjoy your paan how you like."
                }
            ]
        }
    ],
    "tyn": [
        "Scissors",
        "Toothpick or aluminum foil or cloves (optional)"
    ],
    "text": " Preparing the Betel Leaves Wash the betel leaves. Hold your betel leaves under running water and dab them dry with a paper towel, making sure not to tear them. Cut the betel leaves' stems off. Fold your betel leaves in half and use clean scissors to cut off the stem at the bottom of the leaves. Similarly, you can just tear this stem off with your hands. Cut the betel leaves. Lay down your leaves separately on your work surface with the pointy side facing up. Use clean scissors to cut a slit that goes ⅓-½ up the leaf from the bottom rounded side. Add the chuna. Chuna is calcium hydroxide made into a paste. It is very common for chuna to dry out. If this is the case, take some of the chuna powder out into a separate bowl and hydrate it with some water. Then, use your finger or a small spoon and rub a small amount of chuna on one side of your leaves. Add the katha powder. Katha is a powder extract derived from the catechu plant. Sprinkle some katha powder on top of your leaves. Filling Your Paan Prepare your leaves. Turn your leaves 180 degrees so the pointy side is facing down. Find the slit you made earlier. Form a leaf cup. Grab one side formed by the slit and slowly start pulling it towards the opposite side. Do the same procedure with the other side at the same time to form a cup. Put your leaf into the correct orientation. Turn your cup around so the pointy side is facing up. You are now ready to start filling your cup. Add paan chatni. Paan chatni is a paste that is flavored with saffron with the addition of silver or gold leaf. Add a small amount into your newly made betel leaf cup. Add gulkand. Gulkand is a rose-flavored jam. Add a spoonful of gulkand inside your cup. Add more if you would like your paan to be sweeter. Add fennel seeds. Sugar coated colorful and plain fennel seeds are available for purchase in most Indian grocery markets. Feel free to add either or both of them. This is one of the mouth-freshening portions of our paan. Add cardamom. Some individuals enjoy whole cardamom inside their paan while others prefer it crushed. If you would like to crush your cardamom, use a spatula or your hand and apply some pressure to crack the shell slightly. Add as many as you like to your paan. Add coconut. Coconut comes in many forms such as sweetened or desiccated. For this paan, desiccated coconut was used but feel free to use your desired form of coconut. Add menthol crystals. Menthol crystals are extracted from peppermint oil. They give a very refreshing minty taste. Add 1-2 small pieces inside. Add Tutti Frutti. Tutti Frutti is candied fruit. This is an optional ingredient that many children enjoy adding. Add betel nuts. This step is completely optional considering betel nuts eaten in large amounts can be detrimental to health. If you plan to add them, only add a few pieces and avoid eating them excessively. Folding Your Paan Fold your paan. Recall that your paan is in a pocket shape. Flatten this pocket by pushing down with your thumb. Get the right triangle shape. There will be a triangle sticking out at the top. Fold that triangle down. Seal your paan. Seal your paan close with a toothpick, clove piece or wrap it in foil. In this demonstration a clove piece was used to seal the paan closed. None of these are required and the paan can be eaten directly at this point as well. Enjoy your paan. Traditionally, South Asians eat paan in one bite. Enjoy your paan how you like.",
    "sentences": [
        " Preparing the Betel Leaves Wash the betel leaves.",
        "Hold your betel leaves under running water and dab them dry with a paper towel, making sure not to tear them.",
        "Cut the betel leaves' stems off.",
        "Fold your betel leaves in half and use clean scissors to cut off the stem at the bottom of the leaves.",
        "Similarly, you can just tear this stem off with your hands.",
        "Cut the betel leaves.",
        "Lay down your leaves separately on your work surface with the pointy side facing up.",
        "Use clean scissors to cut a slit that goes ⅓-½ up the leaf from the bottom rounded side.",
        "Add the chuna.",
        "Chuna is calcium hydroxide made into a paste.",
        "It is very common for chuna to dry out.",
        "If this is the case, take some of the chuna powder out into a separate bowl and hydrate it with some water.",
        "Then, use your finger or a small spoon and rub a small amount of chuna on one side of your leaves.",
        "Add the katha powder.",
        "Katha is a powder extract derived from the catechu plant.",
        "Sprinkle some katha powder on top of your leaves.",
        "Filling Your Paan Prepare your leaves.",
        "Turn your leaves 180 degrees so the pointy side is facing down.",
        "Find the slit you made earlier.",
        "Form a leaf cup.",
        "Grab one side formed by the slit and slowly start pulling it towards the opposite side.",
        "Do the same procedure with the other side at the same time to form a cup.",
        "Put your leaf into the correct orientation.",
        "Turn your cup around so the pointy side is facing up.",
        "You are now ready to start filling your cup.",
        "Add paan chatni.",
        "Paan chatni is a paste that is flavored with saffron with the addition of silver or gold leaf.",
        "Add a small amount into your newly made betel leaf cup.",
        "Add gulkand.",
        "Gulkand is a rose-flavored jam.",
        "Add a spoonful of gulkand inside your cup.",
        "Add more if you would like your paan to be sweeter.",
        "Add fennel seeds.",
        "Sugar coated colorful and plain fennel seeds are available for purchase in most Indian grocery markets.",
        "Feel free to add either or both of them.",
        "This is one of the mouth-freshening portions of our paan.",
        "Add cardamom.",
        "Some individuals enjoy whole cardamom inside their paan while others prefer it crushed.",
        "If you would like to crush your cardamom, use a spatula or your hand and apply some pressure to crack the shell slightly.",
        "Add as many as you like to your paan.",
        "Add coconut.",
        "Coconut comes in many forms such as sweetened or desiccated.",
        "For this paan, desiccated coconut was used but feel free to use your desired form of coconut.",
        "Add menthol crystals.",
        "Menthol crystals are extracted from peppermint oil.",
        "They give a very refreshing minty taste.",
        "Add 1-2 small pieces inside.",
        "Add Tutti Frutti.",
        "Tutti Frutti is candied fruit.",
        "This is an optional ingredient that many children enjoy adding.",
        "Add betel nuts.",
        "This step is completely optional considering betel nuts eaten in large amounts can be detrimental to health.",
        "If you plan to add them, only add a few pieces and avoid eating them excessively.",
        "Folding Your Paan Fold your paan.",
        "Recall that your paan is in a pocket shape.",
        "Flatten this pocket by pushing down with your thumb.",
        "Get the right triangle shape.",
        "There will be a triangle sticking out at the top.",
        "Fold that triangle down.",
        "Seal your paan.",
        "Seal your paan close with a toothpick, clove piece or wrap it in foil.",
        "In this demonstration a clove piece was used to seal the paan closed.",
        "None of these are required and the paan can be eaten directly at this point as well.",
        "Enjoy your paan.",
        "Traditionally, South Asians eat paan in one bite.",
        "Enjoy your paan how you like."
    ]
}