{
    "title": "How to Work in Japan",
    "url": "https://www.wikihow.com/Work-in-Japan",
    "category_hierarchy": [
        "Work World"
    ],
    "parts": [
        {
            "name": "Searching for a Job",
            "steps": [
                {
                    "headline": "Look for jobs online before relocating to Japan if you live outside of the country.",
                    "description": "Moving to Japan before you have a job can be expensive and stressful. If you want to take your time searching for a job, visit online job boards to look for open positions that fit your skill set. Most jobs require beginner to intermediate Japanese language skills. Take Japanese courses or use a free app to learn the language. Online Job Boards to Check\nGaijinPot: https://gaijinpot.com/\nJobsinJapan: https://jobsinjapan.com/\nDaiJob: https://www.daijob.com/"
                },
                {
                    "headline": "Search for careers in automobile manufacturing or electronics if you’re qualified.",
                    "description": "Manufacturing of vehicles and electronic goods are two of the largest industries in Japan. Many of these jobs can be found listed through online job boards. If you have experience in these fields and have creative, innovative ideas, think about applying for a position in these companies."
                },
                {
                    "headline": "Consider becoming an English teacher if you aren’t fluent in Japanese.",
                    "description": "There are many openings for tutoring young children English that you can find online. In order to teach English in Japan, you need to be a fluent English speaker as well as have a bachelor’s degree, a teaching certificate, and experience tutoring or teaching children. Look for English tutoring jobs here: https://www.japanenglishteacher.com/. EXPERT TIP\t\"There aren't many people in Japan who speak English, so people who are planning to work there should learn to read and speak Japanese.\" Lorenzo Garriga\t\t\t\t\tWorld Traveler & Backpacker\t\t\t\t\t\t\t\tLorenzo is a time-tested globe-trotter, who has been traveling the world on a shoestring for almost 30 years with a backpack. Hailing from France, he has been all over the world, working in hostels, washing dishes, and hitchhiking his way across countries and continents. Lorenzo GarrigaWorld Traveler & Backpacker"
                },
                {
                    "headline": "Fill out the application online.",
                    "description": "Apply to any job that you’re interested in. Make sure you fill out the forms completely and follow the instructions they provide. Some of the applications will allow you to submit it directly on the website while others may have you send an email. Once you submit your applications, wait for the company’s response."
                },
                {
                    "headline": "Write a cover letter explaining what skills you would bring to the job.",
                    "description": "Avoid writing why you’re excited to move to Japan in your cover letters. Instead, introduce yourself in a short paragraph and describe what skills and qualifications you have for the job. Keep the cover letter about 2 paragraphs long. Tailor your cover letter towards each specific company you apply for, or else it won’t seem genuine. Have another person review your cover letter before you submit it to check for any errors."
                },
                {
                    "headline": "Make a resume listing your past employment, education, and skills.",
                    "description": "Start your resume with a summary of your qualifications and a personal objective for what you want to complete with your career. List your most recent job titles with your responsibilities and how long you worked there. Then put down where you went to school and what degrees you have. Finally, write down any software knowledge or relevant skills you have. Try to keep your resume between 1-2 pages. Use a chronological resume to showcase your career progression. Make a functional resume to highlight your skills and abilities first."
                },
                {
                    "headline": "Interview over video chat or in person.",
                    "description": "Depending on the job level, you may be asked to do a video interview or interview in Japan. Before the interview, research the company to familiarize yourself with what they do. Start by introducing yourself and answering any preliminary questions they have. Smile and stay energetic throughout the interview even if the interviewer stays straight-faced. Be confident and professional throughout the interview and thank them for their time and consideration. Even if you’re doing a video interview, dress business professional since Japanese companies take their work seriously. Wear a dress shirt and a tie if you’re a man, or a blouse with a knee-length skirt or dress pants if you’re a woman. If you want to wear a suit, make sure it is a solid dark color so it looks the most professional. Interview Etiquette in Japan\nBow to the interviewer before you sit down to show respect. Do not shake hands since this is considered rude in Japanese business culture. Keep your hands on top of your legs rather than in your pockets. Ask the interviewer to repeat themselves if you aren't sure what they said."
                }
            ]
        },
        {
            "name": "Applying for a Visa",
            "steps": [
                {
                    "headline": "Make sure you have a valid passport.",
                    "description": "If you already have a passport, check to make sure that it isn’t expired. If you don’t have a passport, search for your country’s passport application form online, print it, and fill it out. Make sure you have a proof of citizenship and identification, such as a birth certificate and a driver’s license. Provide a recent picture of yourself to include on your passport. Apply for your passport in person at the nearest location where they accept applications. Apply for your passport at least 10 weeks before you intend to fill out visa paperwork or travel. You can find locations that accept passport applications here: https://iafdb.travel.state.gov/."
                },
                {
                    "headline": "Get your Certificate of Eligibility from your employer.",
                    "description": "In order to get a working visa in Japan, you either need to be sponsored by either your employer or university to ensure you meet the requirements to work. In order for the company to submit your Certification of Eligibility (COE), you need to send them your passport photo, a signed work contract, your university degree or an official copy of it, the address of your nearest Japanese Embassy, and any previous dates you traveled to Japan. COEs can take 2-3 months to receive once they are submitted."
                },
                {
                    "headline": "Fill out the visa application form.",
                    "description": "Print out and complete the application form entirely. Provide your personal information and the name of the company you’ll be working for. Once you’ve filled out the application, sign it on the bottom in ink. Fill out the application form here: https://www.us.emb-japan.go.jp/j/download/VISA_APPLI.pdf. If you have a previous criminal record, you need to provide proof that you are allowed to leave the country. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLorenzo Garriga\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWorld Traveler & Backpacker\t\t\t\t\t\t\t\tLorenzo is a time-tested globe-trotter, who has been traveling the world on a shoestring for almost 30 years with a backpack. Hailing from France, he has been all over the world, working in hostels, washing dishes, and hitchhiking his way across countries and continents. Lorenzo Garriga\t\t\tWorld Traveler & Backpacker\t\t\t\tEven if you're only approved for a year, you may able to have it extended once you're in Japan. Experienced traveler Lorenzo Garriga says: \"Depending on where you live, you can usually get a work visa in Japan for up to a year. Once you're there and working, it's possible to stay longer, especially if your employer wants you to continue working for them. You'll just have to fill out the appropriate paperwork.\""
                },
                {
                    "headline": "Take your documents to the closest Japanese Embassy to get the visa.",
                    "description": "Bring your passport, visa application, and COE to the Japanese Embassy or Consulate-General. Once you turn in all of your documents, you’ll receive your visa within 2-3 days. You can find your nearest Japanese Embassy or Consulate-General here: https://www.us.emb-japan.go.jp/jicc/consulate-guide.html."
                }
            ]
        },
        {
            "name": "Relocating and Living in Japan",
            "steps": [
                {
                    "headline": "Stay in a share house near your office for cheaper accommodations.",
                    "description": "Share houses are properties where each person has their own room, but share public spaces like the kitchen and bathroom. Many share houses offer month-to-month contracts so you don’t have to be committed to living there. Look for housing near your office so you don’t have to travel far. You can also look for apartments, but they can cost up to 120,000 JPY ($1,067 USD) per month in rent and often require yearly contracts. Some employers will provide you with living accommodations before you move into the country."
                },
                {
                    "headline": "Get a shipping container to move your belongings overseas.",
                    "description": "If you want to bring a lot of your belongings with you, the easiest method to ship them is renting a container on a cargo ship and having them sent overseas. Some international shipping companies will only charge for how much space your items take up in a container. Contact an international shipping service to determine their rates. Shipping usually takes around 2 months and prices depend on how many items you’re shipping. If you only have a few small things to bring along, you can pay for extra bags to bring with you on the plane."
                },
                {
                    "headline": "Visit a money exchange to convert your currency to yen.",
                    "description": "There are many shops around Japan that will exchange your country’s currency for yen, the national Japanese currency. Locate the nearest shop to you and see if they take any commission when they convert your money. Give your money to the currency exchange and they will give you the amount of yen equal to it. As of October 2018, $1 USD equals about 112 JPY."
                },
                {
                    "headline": "Get your national insurance card.",
                    "description": "Japan has national health care and you are required to apply for insurance once you move into the country. If you’re working for a large corporation, many times they will take your health care premiums directly from your salary. If your employer does not offer insurance, go to your local city hall with your visa and passport to get your health card.Tip: Carry your insurance card with you wherever you go. If you get into an accident and don't have the card on you, you'll be charged full price at the hospital and have to apply for a refund later on."
                },
                {
                    "headline": "Take passenger trains or buses to get around with the most efficiency.",
                    "description": "Driving in Japan can be expensive, time-consuming, and confusing if you aren’t fluent in Japanese. Look for train and bus schedules online to follow what time they pick up and drop off in specific locations. Arrive early to the stations so you can catch your ride. Train passes can be purchased at the train station so you don’t have to pay each time you need to travel."
                },
                {
                    "headline": "Continue learning Japanese through courses or language-learning apps.",
                    "description": "Even if you have a basic understanding of the Japanese language, keep learning more so you can talk and interact with more people. Find a Japanese language course or download free apps on your phone to learn and practice each day. Some free apps you can use to learn Japanese are DuoLingo, Memrise, and Mindsnacks."
                },
                {
                    "headline": "Plan on working long hours each day.",
                    "description": "Many businesses in Japan have 60-hour work weeks. Arrive to work at least 15-30 minutes prior to when you’re scheduled to start. At the end of the day, staying late shows that you’re dedicated to your work and enjoy your job. While you’re working, make sure to smile and stay energetic to show that you’re always doing your best."
                },
                {
                    "headline": "Socialize with your coworkers outside of your job.",
                    "description": "Go out with your coworkers when you’re invited for after-hours meetings or celebrations. Many times, you will go out to bars or restaurants so you can get to know the people you work with more and make friends. This also shows that you enjoy spending time with and respect your coworkers."
                }
            ]
        }
    ],
    "tyn": [
        "Resume",
        "Cover letter",
        "Passport",
        "University degree",
        "Certification of Eligibility",
        "Working visa"
    ],
    "text": " Searching for a Job Look for jobs online before relocating to Japan if you live outside of the country. Moving to Japan before you have a job can be expensive and stressful. If you want to take your time searching for a job, visit online job boards to look for open positions that fit your skill set. Most jobs require beginner to intermediate Japanese language skills. Take Japanese courses or use a free app to learn the language. Online Job Boards to Check\nGaijinPot: https://gaijinpot.com/\nJobsinJapan: https://jobsinjapan.com/\nDaiJob: https://www.daijob.com/ Search for careers in automobile manufacturing or electronics if you’re qualified. Manufacturing of vehicles and electronic goods are two of the largest industries in Japan. Many of these jobs can be found listed through online job boards. If you have experience in these fields and have creative, innovative ideas, think about applying for a position in these companies. Consider becoming an English teacher if you aren’t fluent in Japanese. There are many openings for tutoring young children English that you can find online. In order to teach English in Japan, you need to be a fluent English speaker as well as have a bachelor’s degree, a teaching certificate, and experience tutoring or teaching children. Look for English tutoring jobs here: https://www.japanenglishteacher.com/. EXPERT TIP\t\"There aren't many people in Japan who speak English, so people who are planning to work there should learn to read and speak Japanese.\" Lorenzo Garriga\t\t\t\t\tWorld Traveler & Backpacker\t\t\t\t\t\t\t\tLorenzo is a time-tested globe-trotter, who has been traveling the world on a shoestring for almost 30 years with a backpack. Hailing from France, he has been all over the world, working in hostels, washing dishes, and hitchhiking his way across countries and continents. Lorenzo GarrigaWorld Traveler & Backpacker Fill out the application online. Apply to any job that you’re interested in. Make sure you fill out the forms completely and follow the instructions they provide. Some of the applications will allow you to submit it directly on the website while others may have you send an email. Once you submit your applications, wait for the company’s response. Write a cover letter explaining what skills you would bring to the job. Avoid writing why you’re excited to move to Japan in your cover letters. Instead, introduce yourself in a short paragraph and describe what skills and qualifications you have for the job. Keep the cover letter about 2 paragraphs long. Tailor your cover letter towards each specific company you apply for, or else it won’t seem genuine. Have another person review your cover letter before you submit it to check for any errors. Make a resume listing your past employment, education, and skills. Start your resume with a summary of your qualifications and a personal objective for what you want to complete with your career. List your most recent job titles with your responsibilities and how long you worked there. Then put down where you went to school and what degrees you have. Finally, write down any software knowledge or relevant skills you have. Try to keep your resume between 1-2 pages. Use a chronological resume to showcase your career progression. Make a functional resume to highlight your skills and abilities first. Interview over video chat or in person. Depending on the job level, you may be asked to do a video interview or interview in Japan. Before the interview, research the company to familiarize yourself with what they do. Start by introducing yourself and answering any preliminary questions they have. Smile and stay energetic throughout the interview even if the interviewer stays straight-faced. Be confident and professional throughout the interview and thank them for their time and consideration. Even if you’re doing a video interview, dress business professional since Japanese companies take their work seriously. Wear a dress shirt and a tie if you’re a man, or a blouse with a knee-length skirt or dress pants if you’re a woman. If you want to wear a suit, make sure it is a solid dark color so it looks the most professional. Interview Etiquette in Japan\nBow to the interviewer before you sit down to show respect. Do not shake hands since this is considered rude in Japanese business culture. Keep your hands on top of your legs rather than in your pockets. Ask the interviewer to repeat themselves if you aren't sure what they said. Applying for a Visa Make sure you have a valid passport. If you already have a passport, check to make sure that it isn’t expired. If you don’t have a passport, search for your country’s passport application form online, print it, and fill it out. Make sure you have a proof of citizenship and identification, such as a birth certificate and a driver’s license. Provide a recent picture of yourself to include on your passport. Apply for your passport in person at the nearest location where they accept applications. Apply for your passport at least 10 weeks before you intend to fill out visa paperwork or travel. You can find locations that accept passport applications here: https://iafdb.travel.state.gov/. Get your Certificate of Eligibility from your employer. In order to get a working visa in Japan, you either need to be sponsored by either your employer or university to ensure you meet the requirements to work. In order for the company to submit your Certification of Eligibility (COE), you need to send them your passport photo, a signed work contract, your university degree or an official copy of it, the address of your nearest Japanese Embassy, and any previous dates you traveled to Japan. COEs can take 2-3 months to receive once they are submitted. Fill out the visa application form. Print out and complete the application form entirely. Provide your personal information and the name of the company you’ll be working for. Once you’ve filled out the application, sign it on the bottom in ink. Fill out the application form here: https://www.us.emb-japan.go.jp/j/download/VISA_APPLI.pdf. If you have a previous criminal record, you need to provide proof that you are allowed to leave the country. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLorenzo Garriga\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWorld Traveler & Backpacker\t\t\t\t\t\t\t\tLorenzo is a time-tested globe-trotter, who has been traveling the world on a shoestring for almost 30 years with a backpack. Hailing from France, he has been all over the world, working in hostels, washing dishes, and hitchhiking his way across countries and continents. Lorenzo Garriga\t\t\tWorld Traveler & Backpacker\t\t\t\tEven if you're only approved for a year, you may able to have it extended once you're in Japan. Experienced traveler Lorenzo Garriga says: \"Depending on where you live, you can usually get a work visa in Japan for up to a year. Once you're there and working, it's possible to stay longer, especially if your employer wants you to continue working for them. You'll just have to fill out the appropriate paperwork.\" Take your documents to the closest Japanese Embassy to get the visa. Bring your passport, visa application, and COE to the Japanese Embassy or Consulate-General. Once you turn in all of your documents, you’ll receive your visa within 2-3 days. You can find your nearest Japanese Embassy or Consulate-General here: https://www.us.emb-japan.go.jp/jicc/consulate-guide.html. Relocating and Living in Japan Stay in a share house near your office for cheaper accommodations. Share houses are properties where each person has their own room, but share public spaces like the kitchen and bathroom. Many share houses offer month-to-month contracts so you don’t have to be committed to living there. Look for housing near your office so you don’t have to travel far. You can also look for apartments, but they can cost up to 120,000 JPY ($1,067 USD) per month in rent and often require yearly contracts. Some employers will provide you with living accommodations before you move into the country. Get a shipping container to move your belongings overseas. If you want to bring a lot of your belongings with you, the easiest method to ship them is renting a container on a cargo ship and having them sent overseas. Some international shipping companies will only charge for how much space your items take up in a container. Contact an international shipping service to determine their rates. Shipping usually takes around 2 months and prices depend on how many items you’re shipping. If you only have a few small things to bring along, you can pay for extra bags to bring with you on the plane. Visit a money exchange to convert your currency to yen. There are many shops around Japan that will exchange your country’s currency for yen, the national Japanese currency. Locate the nearest shop to you and see if they take any commission when they convert your money. Give your money to the currency exchange and they will give you the amount of yen equal to it. As of October 2018, $1 USD equals about 112 JPY. Get your national insurance card. Japan has national health care and you are required to apply for insurance once you move into the country. If you’re working for a large corporation, many times they will take your health care premiums directly from your salary. If your employer does not offer insurance, go to your local city hall with your visa and passport to get your health card.Tip: Carry your insurance card with you wherever you go. If you get into an accident and don't have the card on you, you'll be charged full price at the hospital and have to apply for a refund later on. Take passenger trains or buses to get around with the most efficiency. Driving in Japan can be expensive, time-consuming, and confusing if you aren’t fluent in Japanese. Look for train and bus schedules online to follow what time they pick up and drop off in specific locations. Arrive early to the stations so you can catch your ride. Train passes can be purchased at the train station so you don’t have to pay each time you need to travel. Continue learning Japanese through courses or language-learning apps. Even if you have a basic understanding of the Japanese language, keep learning more so you can talk and interact with more people. Find a Japanese language course or download free apps on your phone to learn and practice each day. Some free apps you can use to learn Japanese are DuoLingo, Memrise, and Mindsnacks. Plan on working long hours each day. Many businesses in Japan have 60-hour work weeks. Arrive to work at least 15-30 minutes prior to when you’re scheduled to start. At the end of the day, staying late shows that you’re dedicated to your work and enjoy your job. While you’re working, make sure to smile and stay energetic to show that you’re always doing your best. Socialize with your coworkers outside of your job. Go out with your coworkers when you’re invited for after-hours meetings or celebrations. Many times, you will go out to bars or restaurants so you can get to know the people you work with more and make friends. This also shows that you enjoy spending time with and respect your coworkers.",
    "sentences": [
        " Searching for a Job Look for jobs online before relocating to Japan if you live outside of the country.",
        "Moving to Japan before you have a job can be expensive and stressful.",
        "If you want to take your time searching for a job, visit online job boards to look for open positions that fit your skill set.",
        "Most jobs require beginner to intermediate Japanese language skills.",
        "Take Japanese courses or use a free app to learn the language.",
        "Online Job Boards to Check\nGaijinPot: https://gaijinpot.com/\nJobsinJapan: https://jobsinjapan.com/\nDaiJob: https://www.daijob.com/ Search for careers in automobile manufacturing or electronics if you’re qualified.",
        "Manufacturing of vehicles and electronic goods are two of the largest industries in Japan.",
        "Many of these jobs can be found listed through online job boards.",
        "If you have experience in these fields and have creative, innovative ideas, think about applying for a position in these companies.",
        "Consider becoming an English teacher if you aren’t fluent in Japanese.",
        "There are many openings for tutoring young children English that you can find online.",
        "In order to teach English in Japan, you need to be a fluent English speaker as well as have a bachelor’s degree, a teaching certificate, and experience tutoring or teaching children.",
        "Look for English tutoring jobs here: https://www.japanenglishteacher.com/.",
        "EXPERT TIP\t\"There aren't many people in Japan who speak English, so people who are planning to work there should learn to read and speak Japanese.\"",
        "Lorenzo Garriga\t\t\t\t\tWorld Traveler & Backpacker\t\t\t\t\t\t\t\tLorenzo is a time-tested globe-trotter, who has been traveling the world on a shoestring for almost 30 years with a backpack.",
        "Hailing from France, he has been all over the world, working in hostels, washing dishes, and hitchhiking his way across countries and continents.",
        "Lorenzo GarrigaWorld Traveler & Backpacker Fill out the application online.",
        "Apply to any job that you’re interested in.",
        "Make sure you fill out the forms completely and follow the instructions they provide.",
        "Some of the applications will allow you to submit it directly on the website while others may have you send an email.",
        "Once you submit your applications, wait for the company’s response.",
        "Write a cover letter explaining what skills you would bring to the job.",
        "Avoid writing why you’re excited to move to Japan in your cover letters.",
        "Instead, introduce yourself in a short paragraph and describe what skills and qualifications you have for the job.",
        "Keep the cover letter about 2 paragraphs long.",
        "Tailor your cover letter towards each specific company you apply for, or else it won’t seem genuine.",
        "Have another person review your cover letter before you submit it to check for any errors.",
        "Make a resume listing your past employment, education, and skills.",
        "Start your resume with a summary of your qualifications and a personal objective for what you want to complete with your career.",
        "List your most recent job titles with your responsibilities and how long you worked there.",
        "Then put down where you went to school and what degrees you have.",
        "Finally, write down any software knowledge or relevant skills you have.",
        "Try to keep your resume between 1-2 pages.",
        "Use a chronological resume to showcase your career progression.",
        "Make a functional resume to highlight your skills and abilities first.",
        "Interview over video chat or in person.",
        "Depending on the job level, you may be asked to do a video interview or interview in Japan.",
        "Before the interview, research the company to familiarize yourself with what they do.",
        "Start by introducing yourself and answering any preliminary questions they have.",
        "Smile and stay energetic throughout the interview even if the interviewer stays straight-faced.",
        "Be confident and professional throughout the interview and thank them for their time and consideration.",
        "Even if you’re doing a video interview, dress business professional since Japanese companies take their work seriously.",
        "Wear a dress shirt and a tie if you’re a man, or a blouse with a knee-length skirt or dress pants if you’re a woman.",
        "If you want to wear a suit, make sure it is a solid dark color so it looks the most professional.",
        "Interview Etiquette in Japan\nBow to the interviewer before you sit down to show respect.",
        "Do not shake hands since this is considered rude in Japanese business culture.",
        "Keep your hands on top of your legs rather than in your pockets.",
        "Ask the interviewer to repeat themselves if you aren't sure what they said.",
        "Applying for a Visa Make sure you have a valid passport.",
        "If you already have a passport, check to make sure that it isn’t expired.",
        "If you don’t have a passport, search for your country’s passport application form online, print it, and fill it out.",
        "Make sure you have a proof of citizenship and identification, such as a birth certificate and a driver’s license.",
        "Provide a recent picture of yourself to include on your passport.",
        "Apply for your passport in person at the nearest location where they accept applications.",
        "Apply for your passport at least 10 weeks before you intend to fill out visa paperwork or travel.",
        "You can find locations that accept passport applications here: https://iafdb.travel.state.gov/.",
        "Get your Certificate of Eligibility from your employer.",
        "In order to get a working visa in Japan, you either need to be sponsored by either your employer or university to ensure you meet the requirements to work.",
        "In order for the company to submit your Certification of Eligibility (COE), you need to send them your passport photo, a signed work contract, your university degree or an official copy of it, the address of your nearest Japanese Embassy, and any previous dates you traveled to Japan.",
        "COEs can take 2-3 months to receive once they are submitted.",
        "Fill out the visa application form.",
        "Print out and complete the application form entirely.",
        "Provide your personal information and the name of the company you’ll be working for.",
        "Once you’ve filled out the application, sign it on the bottom in ink.",
        "Fill out the application form here: https://www.us.emb-japan.go.jp/j/download/VISA_APPLI.pdf.",
        "If you have a previous criminal record, you need to provide proof that you are allowed to leave the country.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLorenzo Garriga\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWorld Traveler & Backpacker\t\t\t\t\t\t\t\tLorenzo is a time-tested globe-trotter, who has been traveling the world on a shoestring for almost 30 years with a backpack.",
        "Hailing from France, he has been all over the world, working in hostels, washing dishes, and hitchhiking his way across countries and continents.",
        "Lorenzo Garriga\t\t\tWorld Traveler & Backpacker\t\t\t\tEven if you're only approved for a year, you may able to have it extended once you're in Japan.",
        "Experienced traveler Lorenzo Garriga says: \"Depending on where you live, you can usually get a work visa in Japan for up to a year.",
        "Once you're there and working, it's possible to stay longer, especially if your employer wants you to continue working for them.",
        "You'll just have to fill out the appropriate paperwork.\"",
        "Take your documents to the closest Japanese Embassy to get the visa.",
        "Bring your passport, visa application, and COE to the Japanese Embassy or Consulate-General.",
        "Once you turn in all of your documents, you’ll receive your visa within 2-3 days.",
        "You can find your nearest Japanese Embassy or Consulate-General here: https://www.us.emb-japan.go.jp/jicc/consulate-guide.html.",
        "Relocating and Living in Japan Stay in a share house near your office for cheaper accommodations.",
        "Share houses are properties where each person has their own room, but share public spaces like the kitchen and bathroom.",
        "Many share houses offer month-to-month contracts so you don’t have to be committed to living there.",
        "Look for housing near your office so you don’t have to travel far.",
        "You can also look for apartments, but they can cost up to 120,000 JPY ($1,067 USD) per month in rent and often require yearly contracts.",
        "Some employers will provide you with living accommodations before you move into the country.",
        "Get a shipping container to move your belongings overseas.",
        "If you want to bring a lot of your belongings with you, the easiest method to ship them is renting a container on a cargo ship and having them sent overseas.",
        "Some international shipping companies will only charge for how much space your items take up in a container.",
        "Contact an international shipping service to determine their rates.",
        "Shipping usually takes around 2 months and prices depend on how many items you’re shipping.",
        "If you only have a few small things to bring along, you can pay for extra bags to bring with you on the plane.",
        "Visit a money exchange to convert your currency to yen.",
        "There are many shops around Japan that will exchange your country’s currency for yen, the national Japanese currency.",
        "Locate the nearest shop to you and see if they take any commission when they convert your money.",
        "Give your money to the currency exchange and they will give you the amount of yen equal to it.",
        "As of October 2018, $1 USD equals about 112 JPY.",
        "Get your national insurance card.",
        "Japan has national health care and you are required to apply for insurance once you move into the country.",
        "If you’re working for a large corporation, many times they will take your health care premiums directly from your salary.",
        "If your employer does not offer insurance, go to your local city hall with your visa and passport to get your health card.Tip: Carry your insurance card with you wherever you go.",
        "If you get into an accident and don't have the card on you, you'll be charged full price at the hospital and have to apply for a refund later on.",
        "Take passenger trains or buses to get around with the most efficiency.",
        "Driving in Japan can be expensive, time-consuming, and confusing if you aren’t fluent in Japanese.",
        "Look for train and bus schedules online to follow what time they pick up and drop off in specific locations.",
        "Arrive early to the stations so you can catch your ride.",
        "Train passes can be purchased at the train station so you don’t have to pay each time you need to travel.",
        "Continue learning Japanese through courses or language-learning apps.",
        "Even if you have a basic understanding of the Japanese language, keep learning more so you can talk and interact with more people.",
        "Find a Japanese language course or download free apps on your phone to learn and practice each day.",
        "Some free apps you can use to learn Japanese are DuoLingo, Memrise, and Mindsnacks.",
        "Plan on working long hours each day.",
        "Many businesses in Japan have 60-hour work weeks.",
        "Arrive to work at least 15-30 minutes prior to when you’re scheduled to start.",
        "At the end of the day, staying late shows that you’re dedicated to your work and enjoy your job.",
        "While you’re working, make sure to smile and stay energetic to show that you’re always doing your best.",
        "Socialize with your coworkers outside of your job.",
        "Go out with your coworkers when you’re invited for after-hours meetings or celebrations.",
        "Many times, you will go out to bars or restaurants so you can get to know the people you work with more and make friends.",
        "This also shows that you enjoy spending time with and respect your coworkers."
    ]
}