{
    "title": "How to Cook Jalapenos",
    "url": "https://www.wikihow.com/Cook-Jalapenos",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables"
    ],
    "methods": [
        {
            "name": "Roasting Jalapenos in an Oven",
            "steps": [
                {
                    "headline": "Preheat your oven broiler.",
                    "description": "Most ovens have a broil setting on the knobs that typically control the main oven temperature. Allow the broiler to preheat for at least 10 minutes. In most ovens, the broiler's heat source is located at the top of the oven. Adjust the racks inside your oven so that the jalapeno peppers will be close to the broiler."
                },
                {
                    "headline": "Remove the jalapenos’ stems.",
                    "description": "Use a knife to cut off the stems on the jalapeno peppers. You can also pull the stems off using your fingers. Alternatively, you can keep the stems on if you want your jalapeno peppers to be an easy finger food."
                },
                {
                    "headline": "Slice the jalapeno peppers in half.",
                    "description": "Cut from the tip of the pepper to where the stem was before you removed it. If you want to peppers to be a bit less spicy, remove the jalapenos seeds. If you left the stems on to make the pepper's easier to eat with your hands, slice them in half along with the rest of the jalapeno."
                },
                {
                    "headline": "Place the jalapenos on a pan.",
                    "description": "Place the cut side of the pepper face down on the pan. The jalapeno peppers can be close together, but they should not touch each other. You can coat the pan in cooking spray or butter, but this isn’t necessary. You can put down a layer of aluminum foil to line the baking sheet. This can make the baking sheet easier to clean."
                },
                {
                    "headline": "Place the jalapenos in the oven for 7-10 minutes.",
                    "description": "The skin on the jalapeno peppers should be wrinkled and slightly charred. You only want the skin of the jalapeno to char because if its interior gets blackened it can create an odd flavor."
                },
                {
                    "headline": "Remove the jalapenos from the oven when the skin looks slightly charred.",
                    "description": "When the jalapenos look done, pull them out of the oven and let them cool. If you want them to cook a bit more, you can put them into a sealed container while they are still hot and let them self-steam. If you want to add your roasted jalapenos to a dish, you might want to remove the charred skin first. The wrinkled skin of the jalapeno will easily peel off if you let the jalapenos steam for a bit after taking them out of the oven. You can put them in a sealed container or simply put a bowl over the top of the peppers in the pan."
                }
            ]
        },
        {
            "name": "Grilling Jalapenos",
            "steps": [
                {
                    "headline": "Preheat your grill.",
                    "description": "Set to a high heat if you are using a gas grill. If you are using a charcoal grill, keep the lid shut after the coals are lit to generate a lot of heat quickly."
                },
                {
                    "headline": "Cut the jalapeno peppers.",
                    "description": "There are different ways to cut the peppers depending on what you plan on doing with them. In practically every recipe, however, you will want to cut off the stems. If you want to reduce their spiciness, remove the seeds and membrane from the inside of the pepper. If you aren’t stuffing the peppers, you should slice them in half, from the tip to where the stem was, to get the most even cook. If you plan on stuffing the peppers there are several approaches you can take to slicing your jalapenos depending on the recipe you want to follow. If you want to make stuffed jalapeno peppers, you need to make the stuffing before you cook the peppers."
                },
                {
                    "headline": "Put the jalapeno peppers on the grill.",
                    "description": "You can put the jalapenos directly on the grill if they are not stuffed and you pay close attention to them. Otherwise, put the jalapenos on aluminum foil before placing them on the grill. Typically, the jalapenos should be cooked at a medium heat. If you are grilling jalapenos without any stuffing inside, you can grill them on a higher heat if you flip them regularly."
                },
                {
                    "headline": "Cook the jalapenos for about 8 to 10 minutes.",
                    "description": "The peppers should be tender when they are done. If you are grilling them without using aluminum foil, remove the peppers if they start to blacken. If you want your jalapenos to have stuffing in them while they grill, make sure that it will be fully cooked in 8 to 10 minutes. Otherwise, cook the stuffing some before placing it in the jalapeno."
                }
            ]
        },
        {
            "name": "Deep Frying Jalapenos",
            "steps": [
                {
                    "headline": "Heat up your cooking oil to 365 °F (185 °C) degrees.",
                    "description": "Use a deep fryer or cast iron Dutch oven. Any kind of shortening or cooking oil will work great for deep frying jalapenos."
                },
                {
                    "headline": "Make your batter and breading.",
                    "description": "To make your batter, mix 0.5 cups (120 mL) of flour, 0.5 cups (120 mL) of milk, and one egg in a bowl. In a separate shallow bowl or plate, put 3 tablespoons (44 mL), 1.5 cups (350 mL) of breadcrumbs, and 1.5 teaspoons (7.4 mL) of salt and mix them thoroughly. This is your breading. If you want to add other spices to your batter put them in the dry mixture on the plate. Some great spices to use would be garlic, paprika, or chili powder. If you want to add a liquid ingredient like beer or lime juice, add it the mixture in the bowl with the raw egg."
                },
                {
                    "headline": "Slice your jalapeno peppers to fit your recipe.",
                    "description": "If you are frying jalapenos without any filling, cut them into small rings by slicing across the width of the jalapeno pepper. If you plan on adding in a stuffing to the pepper, make an incision on one side of the pepper where so you can remove the seeds and inject the filling. If you plan on putting some kind of filling in the jalapeno pepper, like for stuffed jalapeno poppers, you should put in your stuffing mixture before you begin battering the peppers. Don’t use more than a tablespoon or your pepper might explode while it is being fried."
                },
                {
                    "headline": "Dip the jalapeno peppers in the batter mixture.",
                    "description": "You can batter each jalapenos pepper individually, or you can put several in the batter at once. Make sure that the entire pepper is coated in the batter."
                },
                {
                    "headline": "Coat the battered jalapeno peppers in the breading.",
                    "description": "Roll the peppers on the plate until they are fully coated the breading. To avoid a mess, you might want to bread the jalapeno peppers one at a time. If your breading is getting clumpy or too moist from the batter, add a few pinches of flour and mix until the clumps break down. You can also add a bit of salt to soak up some moisture."
                },
                {
                    "headline": "Place the jalapenos in the hot oil.",
                    "description": "Be careful and gentle placing the jalapenos into the hot oil to avoid splash-back. You should use tongs or forks to drop the peppers in to decrease the chance of being burnt by the hot oil. Avoid letting the jalapeno peppers touch each other while they fry. If their breading touches while it is cooking, the peppers can get stuck together."
                },
                {
                    "headline": "Fry the peppers for 2 to 4 minutes.",
                    "description": "The outside coating of the jalapenos should be golden brown and crispy when the popper is done. Remove the peppers carefully using a frying basket or long tongs to avoid getting burned. If your jalapenos peppers are not floating on top of the oil, they are either not done cooking or stuck to the pan or basket."
                },
                {
                    "headline": "Remove the fried jalapenos from the oil and let them cool.",
                    "description": "Putting the peppers on a plate with paper towels on it will soak up excess oil. If you stuffed the peppers, you will probably let them need to cool for a few minutes because the insides might still be very hot."
                }
            ]
        }
    ],
    "tyn": [
        "Roasting Jalapenos",
        "Cutting board",
        "A sharp kitchen knife",
        "Baking pan or sheet",
        "Oven with a broiler",
        "Aluminum foil (optional)",
        "Cooking spray or butter (optional)",
        "Grilling Jalapenos",
        "Aluminum foil (recommended)",
        "A grill",
        "Grill fuel (charcoal or propane)",
        "Stuffing ingredients (optional)",
        "Deep Frying Jalapenos",
        "Tongs (recommended)",
        "A deep fryer or Dutch oven",
        "Mixing bowl",
        "Shallow bowl or plate",
        "Paper towels",
        "Cooking oil or shortening",
        "Flour",
        "Breadcrumbs",
        "Eggs",
        "Salt",
        "Spices",
        "Stuffing mixture (optional)"
    ],
    "text": " Roasting Jalapenos in an Oven Preheat your oven broiler. Most ovens have a broil setting on the knobs that typically control the main oven temperature. Allow the broiler to preheat for at least 10 minutes. In most ovens, the broiler's heat source is located at the top of the oven. Adjust the racks inside your oven so that the jalapeno peppers will be close to the broiler. Remove the jalapenos’ stems. Use a knife to cut off the stems on the jalapeno peppers. You can also pull the stems off using your fingers. Alternatively, you can keep the stems on if you want your jalapeno peppers to be an easy finger food. Slice the jalapeno peppers in half. Cut from the tip of the pepper to where the stem was before you removed it. If you want to peppers to be a bit less spicy, remove the jalapenos seeds. If you left the stems on to make the pepper's easier to eat with your hands, slice them in half along with the rest of the jalapeno. Place the jalapenos on a pan. Place the cut side of the pepper face down on the pan. The jalapeno peppers can be close together, but they should not touch each other. You can coat the pan in cooking spray or butter, but this isn’t necessary. You can put down a layer of aluminum foil to line the baking sheet. This can make the baking sheet easier to clean. Place the jalapenos in the oven for 7-10 minutes. The skin on the jalapeno peppers should be wrinkled and slightly charred. You only want the skin of the jalapeno to char because if its interior gets blackened it can create an odd flavor. Remove the jalapenos from the oven when the skin looks slightly charred. When the jalapenos look done, pull them out of the oven and let them cool. If you want them to cook a bit more, you can put them into a sealed container while they are still hot and let them self-steam. If you want to add your roasted jalapenos to a dish, you might want to remove the charred skin first. The wrinkled skin of the jalapeno will easily peel off if you let the jalapenos steam for a bit after taking them out of the oven. You can put them in a sealed container or simply put a bowl over the top of the peppers in the pan. Grilling Jalapenos Preheat your grill. Set to a high heat if you are using a gas grill. If you are using a charcoal grill, keep the lid shut after the coals are lit to generate a lot of heat quickly. Cut the jalapeno peppers. There are different ways to cut the peppers depending on what you plan on doing with them. In practically every recipe, however, you will want to cut off the stems. If you want to reduce their spiciness, remove the seeds and membrane from the inside of the pepper. If you aren’t stuffing the peppers, you should slice them in half, from the tip to where the stem was, to get the most even cook. If you plan on stuffing the peppers there are several approaches you can take to slicing your jalapenos depending on the recipe you want to follow. If you want to make stuffed jalapeno peppers, you need to make the stuffing before you cook the peppers. Put the jalapeno peppers on the grill. You can put the jalapenos directly on the grill if they are not stuffed and you pay close attention to them. Otherwise, put the jalapenos on aluminum foil before placing them on the grill. Typically, the jalapenos should be cooked at a medium heat. If you are grilling jalapenos without any stuffing inside, you can grill them on a higher heat if you flip them regularly. Cook the jalapenos for about 8 to 10 minutes. The peppers should be tender when they are done. If you are grilling them without using aluminum foil, remove the peppers if they start to blacken. If you want your jalapenos to have stuffing in them while they grill, make sure that it will be fully cooked in 8 to 10 minutes. Otherwise, cook the stuffing some before placing it in the jalapeno. Deep Frying Jalapenos Heat up your cooking oil to 365 °F (185 °C) degrees. Use a deep fryer or cast iron Dutch oven. Any kind of shortening or cooking oil will work great for deep frying jalapenos. Make your batter and breading. To make your batter, mix 0.5 cups (120 mL) of flour, 0.5 cups (120 mL) of milk, and one egg in a bowl. In a separate shallow bowl or plate, put 3 tablespoons (44 mL), 1.5 cups (350 mL) of breadcrumbs, and 1.5 teaspoons (7.4 mL) of salt and mix them thoroughly. This is your breading. If you want to add other spices to your batter put them in the dry mixture on the plate. Some great spices to use would be garlic, paprika, or chili powder. If you want to add a liquid ingredient like beer or lime juice, add it the mixture in the bowl with the raw egg. Slice your jalapeno peppers to fit your recipe. If you are frying jalapenos without any filling, cut them into small rings by slicing across the width of the jalapeno pepper. If you plan on adding in a stuffing to the pepper, make an incision on one side of the pepper where so you can remove the seeds and inject the filling. If you plan on putting some kind of filling in the jalapeno pepper, like for stuffed jalapeno poppers, you should put in your stuffing mixture before you begin battering the peppers. Don’t use more than a tablespoon or your pepper might explode while it is being fried. Dip the jalapeno peppers in the batter mixture. You can batter each jalapenos pepper individually, or you can put several in the batter at once. Make sure that the entire pepper is coated in the batter. Coat the battered jalapeno peppers in the breading. Roll the peppers on the plate until they are fully coated the breading. To avoid a mess, you might want to bread the jalapeno peppers one at a time. If your breading is getting clumpy or too moist from the batter, add a few pinches of flour and mix until the clumps break down. You can also add a bit of salt to soak up some moisture. Place the jalapenos in the hot oil. Be careful and gentle placing the jalapenos into the hot oil to avoid splash-back. You should use tongs or forks to drop the peppers in to decrease the chance of being burnt by the hot oil. Avoid letting the jalapeno peppers touch each other while they fry. If their breading touches while it is cooking, the peppers can get stuck together. Fry the peppers for 2 to 4 minutes. The outside coating of the jalapenos should be golden brown and crispy when the popper is done. Remove the peppers carefully using a frying basket or long tongs to avoid getting burned. If your jalapenos peppers are not floating on top of the oil, they are either not done cooking or stuck to the pan or basket. Remove the fried jalapenos from the oil and let them cool. Putting the peppers on a plate with paper towels on it will soak up excess oil. If you stuffed the peppers, you will probably let them need to cool for a few minutes because the insides might still be very hot.",
    "sentences": [
        " Roasting Jalapenos in an Oven Preheat your oven broiler.",
        "Most ovens have a broil setting on the knobs that typically control the main oven temperature.",
        "Allow the broiler to preheat for at least 10 minutes.",
        "In most ovens, the broiler's heat source is located at the top of the oven.",
        "Adjust the racks inside your oven so that the jalapeno peppers will be close to the broiler.",
        "Remove the jalapenos’ stems.",
        "Use a knife to cut off the stems on the jalapeno peppers.",
        "You can also pull the stems off using your fingers.",
        "Alternatively, you can keep the stems on if you want your jalapeno peppers to be an easy finger food.",
        "Slice the jalapeno peppers in half.",
        "Cut from the tip of the pepper to where the stem was before you removed it.",
        "If you want to peppers to be a bit less spicy, remove the jalapenos seeds.",
        "If you left the stems on to make the pepper's easier to eat with your hands, slice them in half along with the rest of the jalapeno.",
        "Place the jalapenos on a pan.",
        "Place the cut side of the pepper face down on the pan.",
        "The jalapeno peppers can be close together, but they should not touch each other.",
        "You can coat the pan in cooking spray or butter, but this isn’t necessary.",
        "You can put down a layer of aluminum foil to line the baking sheet.",
        "This can make the baking sheet easier to clean.",
        "Place the jalapenos in the oven for 7-10 minutes.",
        "The skin on the jalapeno peppers should be wrinkled and slightly charred.",
        "You only want the skin of the jalapeno to char because if its interior gets blackened it can create an odd flavor.",
        "Remove the jalapenos from the oven when the skin looks slightly charred.",
        "When the jalapenos look done, pull them out of the oven and let them cool.",
        "If you want them to cook a bit more, you can put them into a sealed container while they are still hot and let them self-steam.",
        "If you want to add your roasted jalapenos to a dish, you might want to remove the charred skin first.",
        "The wrinkled skin of the jalapeno will easily peel off if you let the jalapenos steam for a bit after taking them out of the oven.",
        "You can put them in a sealed container or simply put a bowl over the top of the peppers in the pan.",
        "Grilling Jalapenos Preheat your grill.",
        "Set to a high heat if you are using a gas grill.",
        "If you are using a charcoal grill, keep the lid shut after the coals are lit to generate a lot of heat quickly.",
        "Cut the jalapeno peppers.",
        "There are different ways to cut the peppers depending on what you plan on doing with them.",
        "In practically every recipe, however, you will want to cut off the stems.",
        "If you want to reduce their spiciness, remove the seeds and membrane from the inside of the pepper.",
        "If you aren’t stuffing the peppers, you should slice them in half, from the tip to where the stem was, to get the most even cook.",
        "If you plan on stuffing the peppers there are several approaches you can take to slicing your jalapenos depending on the recipe you want to follow.",
        "If you want to make stuffed jalapeno peppers, you need to make the stuffing before you cook the peppers.",
        "Put the jalapeno peppers on the grill.",
        "You can put the jalapenos directly on the grill if they are not stuffed and you pay close attention to them.",
        "Otherwise, put the jalapenos on aluminum foil before placing them on the grill.",
        "Typically, the jalapenos should be cooked at a medium heat.",
        "If you are grilling jalapenos without any stuffing inside, you can grill them on a higher heat if you flip them regularly.",
        "Cook the jalapenos for about 8 to 10 minutes.",
        "The peppers should be tender when they are done.",
        "If you are grilling them without using aluminum foil, remove the peppers if they start to blacken.",
        "If you want your jalapenos to have stuffing in them while they grill, make sure that it will be fully cooked in 8 to 10 minutes.",
        "Otherwise, cook the stuffing some before placing it in the jalapeno.",
        "Deep Frying Jalapenos Heat up your cooking oil to 365 °F (185 °C) degrees.",
        "Use a deep fryer or cast iron Dutch oven.",
        "Any kind of shortening or cooking oil will work great for deep frying jalapenos.",
        "Make your batter and breading.",
        "To make your batter, mix 0.5 cups (120 mL) of flour, 0.5 cups (120 mL) of milk, and one egg in a bowl.",
        "In a separate shallow bowl or plate, put 3 tablespoons (44 mL), 1.5 cups (350 mL) of breadcrumbs, and 1.5 teaspoons (7.4 mL) of salt and mix them thoroughly.",
        "This is your breading.",
        "If you want to add other spices to your batter put them in the dry mixture on the plate.",
        "Some great spices to use would be garlic, paprika, or chili powder.",
        "If you want to add a liquid ingredient like beer or lime juice, add it the mixture in the bowl with the raw egg.",
        "Slice your jalapeno peppers to fit your recipe.",
        "If you are frying jalapenos without any filling, cut them into small rings by slicing across the width of the jalapeno pepper.",
        "If you plan on adding in a stuffing to the pepper, make an incision on one side of the pepper where so you can remove the seeds and inject the filling.",
        "If you plan on putting some kind of filling in the jalapeno pepper, like for stuffed jalapeno poppers, you should put in your stuffing mixture before you begin battering the peppers.",
        "Don’t use more than a tablespoon or your pepper might explode while it is being fried.",
        "Dip the jalapeno peppers in the batter mixture.",
        "You can batter each jalapenos pepper individually, or you can put several in the batter at once.",
        "Make sure that the entire pepper is coated in the batter.",
        "Coat the battered jalapeno peppers in the breading.",
        "Roll the peppers on the plate until they are fully coated the breading.",
        "To avoid a mess, you might want to bread the jalapeno peppers one at a time.",
        "If your breading is getting clumpy or too moist from the batter, add a few pinches of flour and mix until the clumps break down.",
        "You can also add a bit of salt to soak up some moisture.",
        "Place the jalapenos in the hot oil.",
        "Be careful and gentle placing the jalapenos into the hot oil to avoid splash-back.",
        "You should use tongs or forks to drop the peppers in to decrease the chance of being burnt by the hot oil.",
        "Avoid letting the jalapeno peppers touch each other while they fry.",
        "If their breading touches while it is cooking, the peppers can get stuck together.",
        "Fry the peppers for 2 to 4 minutes.",
        "The outside coating of the jalapenos should be golden brown and crispy when the popper is done.",
        "Remove the peppers carefully using a frying basket or long tongs to avoid getting burned.",
        "If your jalapenos peppers are not floating on top of the oil, they are either not done cooking or stuck to the pan or basket.",
        "Remove the fried jalapenos from the oil and let them cool.",
        "Putting the peppers on a plate with paper towels on it will soak up excess oil.",
        "If you stuffed the peppers, you will probably let them need to cool for a few minutes because the insides might still be very hot."
    ]
}