{
    "title": "How to Make Ugadi Pachadi",
    "url": "https://www.wikihow.com/Make-Ugadi-Pachadi",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "Indian Cuisine",
        "Indian Style Condiments"
    ],
    "methods": [
        {
            "name": "Mixing Ugadi Pachadi",
            "steps": [
                {
                    "headline": "Peel and chop the green mango.",
                    "description": "Use a vegetable peeler or small knife to remove the peel from a small mango. Then use a knife to remove the large seed and dice the mango into ⁄4 to ⁄2 inch (0.64 to 1.27 cm) pieces. Set the diced mango aside. The raw mango represents surprise. For an even bigger surprise, leave the peel on the mango when you dice it."
                },
                {
                    "headline": "Dissolve the tamarind in ⁄2 cup (120 ml) of water.",
                    "description": "Put 1/4 cup (60 g) of tamarind paste into a bowl and pour in ⁄2 cup (120 ml) of water. Use your fingers or a spoon to mix the tamarind until it dissolves and makes a cloudy liquid. The sweet-sour flavor of tamarind represents disgust."
                },
                {
                    "headline": "Strain the tamarind juice into a bowl and add ⁄2 cup (120 ml) of water.",
                    "description": "Set a small fine-mesh strainer over your serving bowl and pour the tamarind juice into it. Discard the solids from the pulp that are left in the strainer. Then stir the remaining water into the serving bowl to dilute the tamarind juice a little. For a stronger tamarind flavor, dilute it with less water."
                },
                {
                    "headline": "Stir in the jaggery until it dissolves.",
                    "description": "Add 1 tablespoon (8 g) of grated jaggery to the tamarind juice in the bowl and stir gently until it's completely dissolved. The sweetness of jaggery represents happiness."
                },
                {
                    "headline": "Mix in the mango, neem flowers, salt, and pepper.",
                    "description": "Stir in about 1 tablespoon (10 g) of the diced mango (or more according to your preference), 1 tablespoon (14 g) of neem flower buds, 1/4 teaspoon (0.5 g) of ground pepper, and 1/2 teaspoon (2.5 g) of salt. Serve the ugadi pachadi as part of your ugadi celebrations.Did You Know? Neem flowers represent sadness, pepper signifies anger, and salt represents fear. Use the ugadi pachadi soon after mixing it since it doesn't store well."
                }
            ]
        },
        {
            "name": "Trying Variations",
            "steps": [
                {
                    "headline": "Toast coconut and nuts for a crunchy texture.",
                    "description": "If you'd like to give the ugadi pachadi a crispy and tropical flavor, toast 1 teaspoon (2 g) of grated coconut and 1 tablespoon (7 g) of chopped pistachios in a skillet over medium heat. Heat the coconut and pistachios until they're fragrant. Sprinkle the toasted mixture over the prepared ugadi pachadi. If you prefer, use chopped almonds instead of pistachios."
                },
                {
                    "headline": "Mix banana pieces into ugadi pachadi for creamy sweetness.",
                    "description": "Slice a ripe banana into ⁄2 inch (1.3 cm) pieces. Stir the banana into the ugadi pachadi when you mix in the green mango pieces.Tip: If you'd rather thicken and sweeten the ugadi pachadi, blend the ripe banana until it's smooth. Then stir the banana puree into the tamarind juice."
                },
                {
                    "headline": "Stir raisins into ugadi pachadi for chewy sweetness.",
                    "description": "Scatter 1 tablespoon (9 g) of raisins over the prepared ugadi pachadi and stir. If you don't want the chewy texture, blend the raisins with the tamarind juice before you stir the remaining ingredients into the ugadi pachadi. Try any of your favorite dried fruits such as dried apricots or currants."
                },
                {
                    "headline": "Include fried gram (putnalu) for a little crunch.",
                    "description": "Start by stirring 1 tablespoon (12 g) of fried gram into the prepared ugadi pachadi. Add a little more if you prefer a more filling ugadi pachadi. Wait until just before serving to stir the fried gram in since it will soften the longer it sits."
                }
            ]
        }
    ],
    "tyn": [
        "Bowls",
        "Spoons",
        "Knife and cutting board",
        "Fine mesh strainer",
        "Vegetable peeler"
    ],
    "text": " Mixing Ugadi Pachadi Peel and chop the green mango. Use a vegetable peeler or small knife to remove the peel from a small mango. Then use a knife to remove the large seed and dice the mango into ⁄4 to ⁄2 inch (0.64 to 1.27 cm) pieces. Set the diced mango aside. The raw mango represents surprise. For an even bigger surprise, leave the peel on the mango when you dice it. Dissolve the tamarind in ⁄2 cup (120 ml) of water. Put 1/4 cup (60 g) of tamarind paste into a bowl and pour in ⁄2 cup (120 ml) of water. Use your fingers or a spoon to mix the tamarind until it dissolves and makes a cloudy liquid. The sweet-sour flavor of tamarind represents disgust. Strain the tamarind juice into a bowl and add ⁄2 cup (120 ml) of water. Set a small fine-mesh strainer over your serving bowl and pour the tamarind juice into it. Discard the solids from the pulp that are left in the strainer. Then stir the remaining water into the serving bowl to dilute the tamarind juice a little. For a stronger tamarind flavor, dilute it with less water. Stir in the jaggery until it dissolves. Add 1 tablespoon (8 g) of grated jaggery to the tamarind juice in the bowl and stir gently until it's completely dissolved. The sweetness of jaggery represents happiness. Mix in the mango, neem flowers, salt, and pepper. Stir in about 1 tablespoon (10 g) of the diced mango (or more according to your preference), 1 tablespoon (14 g) of neem flower buds, 1/4 teaspoon (0.5 g) of ground pepper, and 1/2 teaspoon (2.5 g) of salt. Serve the ugadi pachadi as part of your ugadi celebrations.Did You Know? Neem flowers represent sadness, pepper signifies anger, and salt represents fear. Use the ugadi pachadi soon after mixing it since it doesn't store well. Trying Variations Toast coconut and nuts for a crunchy texture. If you'd like to give the ugadi pachadi a crispy and tropical flavor, toast 1 teaspoon (2 g) of grated coconut and 1 tablespoon (7 g) of chopped pistachios in a skillet over medium heat. Heat the coconut and pistachios until they're fragrant. Sprinkle the toasted mixture over the prepared ugadi pachadi. If you prefer, use chopped almonds instead of pistachios. Mix banana pieces into ugadi pachadi for creamy sweetness. Slice a ripe banana into ⁄2 inch (1.3 cm) pieces. Stir the banana into the ugadi pachadi when you mix in the green mango pieces.Tip: If you'd rather thicken and sweeten the ugadi pachadi, blend the ripe banana until it's smooth. Then stir the banana puree into the tamarind juice. Stir raisins into ugadi pachadi for chewy sweetness. Scatter 1 tablespoon (9 g) of raisins over the prepared ugadi pachadi and stir. If you don't want the chewy texture, blend the raisins with the tamarind juice before you stir the remaining ingredients into the ugadi pachadi. Try any of your favorite dried fruits such as dried apricots or currants. Include fried gram (putnalu) for a little crunch. Start by stirring 1 tablespoon (12 g) of fried gram into the prepared ugadi pachadi. Add a little more if you prefer a more filling ugadi pachadi. Wait until just before serving to stir the fried gram in since it will soften the longer it sits.",
    "sentences": [
        " Mixing Ugadi Pachadi Peel and chop the green mango.",
        "Use a vegetable peeler or small knife to remove the peel from a small mango.",
        "Then use a knife to remove the large seed and dice the mango into ⁄4 to ⁄2 inch (0.64 to 1.27 cm) pieces.",
        "Set the diced mango aside.",
        "The raw mango represents surprise.",
        "For an even bigger surprise, leave the peel on the mango when you dice it.",
        "Dissolve the tamarind in ⁄2 cup (120 ml) of water.",
        "Put 1/4 cup (60 g) of tamarind paste into a bowl and pour in ⁄2 cup (120 ml) of water.",
        "Use your fingers or a spoon to mix the tamarind until it dissolves and makes a cloudy liquid.",
        "The sweet-sour flavor of tamarind represents disgust.",
        "Strain the tamarind juice into a bowl and add ⁄2 cup (120 ml) of water.",
        "Set a small fine-mesh strainer over your serving bowl and pour the tamarind juice into it.",
        "Discard the solids from the pulp that are left in the strainer.",
        "Then stir the remaining water into the serving bowl to dilute the tamarind juice a little.",
        "For a stronger tamarind flavor, dilute it with less water.",
        "Stir in the jaggery until it dissolves.",
        "Add 1 tablespoon (8 g) of grated jaggery to the tamarind juice in the bowl and stir gently until it's completely dissolved.",
        "The sweetness of jaggery represents happiness.",
        "Mix in the mango, neem flowers, salt, and pepper.",
        "Stir in about 1 tablespoon (10 g) of the diced mango (or more according to your preference), 1 tablespoon (14 g) of neem flower buds, 1/4 teaspoon (0.5 g) of ground pepper, and 1/2 teaspoon (2.5 g) of salt.",
        "Serve the ugadi pachadi as part of your ugadi celebrations.Did You Know?",
        "Neem flowers represent sadness, pepper signifies anger, and salt represents fear.",
        "Use the ugadi pachadi soon after mixing it since it doesn't store well.",
        "Trying Variations Toast coconut and nuts for a crunchy texture.",
        "If you'd like to give the ugadi pachadi a crispy and tropical flavor, toast 1 teaspoon (2 g) of grated coconut and 1 tablespoon (7 g) of chopped pistachios in a skillet over medium heat.",
        "Heat the coconut and pistachios until they're fragrant.",
        "Sprinkle the toasted mixture over the prepared ugadi pachadi.",
        "If you prefer, use chopped almonds instead of pistachios.",
        "Mix banana pieces into ugadi pachadi for creamy sweetness.",
        "Slice a ripe banana into ⁄2 inch (1.3 cm) pieces.",
        "Stir the banana into the ugadi pachadi when you mix in the green mango pieces.Tip: If you'd rather thicken and sweeten the ugadi pachadi, blend the ripe banana until it's smooth.",
        "Then stir the banana puree into the tamarind juice.",
        "Stir raisins into ugadi pachadi for chewy sweetness.",
        "Scatter 1 tablespoon (9 g) of raisins over the prepared ugadi pachadi and stir.",
        "If you don't want the chewy texture, blend the raisins with the tamarind juice before you stir the remaining ingredients into the ugadi pachadi.",
        "Try any of your favorite dried fruits such as dried apricots or currants.",
        "Include fried gram (putnalu) for a little crunch.",
        "Start by stirring 1 tablespoon (12 g) of fried gram into the prepared ugadi pachadi.",
        "Add a little more if you prefer a more filling ugadi pachadi.",
        "Wait until just before serving to stir the fried gram in since it will soften the longer it sits."
    ]
}