{
    "title": "How to Freeze Tomatoes",
    "url": "https://www.wikihow.com/Freeze-Tomatoes",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Food Preservation Techniques",
        "Freezing Food"
    ],
    "methods": [
        {
            "name": "Preparing the Tomatoes for Freezing",
            "steps": [
                {
                    "headline": "Select your tomatoes.",
                    "description": "Pick tomatoes that are firm, yet not hard. Avoid tomatoes with bug spots, bruises and other damage. You can use them, but you're going to have to do a lot more trimming. While you can use any breed of tomatoes, Roma tomatoes are the best for freezing purposes. They are meatier and contain less water. That means you get more thicker tomato sauce from them with less cooking time."
                },
                {
                    "headline": "Wash the tomatoes to remove dirt from the garden.",
                    "description": "Be sure to rub the tomatoes to remove any excess dirt. Pat the tomatoes dry with a clean cloth or paper towel."
                },
                {
                    "headline": "Remove the stem from the tomatoes.",
                    "description": "The area around the stem is usually tough, so remove it too. Cut off any damaged portion of the tomatoes."
                }
            ]
        },
        {
            "name": "Freezing Peeled Tomatoes",
            "steps": [
                {
                    "headline": "Boil a large pot of water.",
                    "description": "Put the tomatoes into the boiling water for one minute. The boiling water will loosen the tomatoes skins, thus making them easier to peel."
                },
                {
                    "headline": "Remove the skins.",
                    "description": "Use the tip of a paring knife or tomato knife to pierce the skin on each tomato. Once there's a hole in the skin, it should slide right off. Discard the skin."
                },
                {
                    "headline": "Set a colander inside another large container.",
                    "description": "Hold the tomatoes over the colander as you remove the seeds. It's not necessary to remove all of the seeds, but your tomato sauces are going to be more appealing without them. Squeeze the tomatoes slightly to remove the juice. Set the meaty portion of the tomatoes aside for now."
                },
                {
                    "headline": "Squeeze as much moisture as you can from the seeds in the colander.",
                    "description": "Put the juice in a container. You can drink it, or you can use it for cooking. You may also freeze it."
                },
                {
                    "headline": "Cut the remaining tomato pieces into the desired size chunks.",
                    "description": "Smaller pieces thaw quickly and cook into sauce in less time."
                },
                {
                    "headline": "Fill zippered plastic freezer bags with the tomato pieces.",
                    "description": "Remove as much air as possible by sucking air out with a straw as you close the zipper. If you prefer, you may seal the tomatoes with a vacuum sealer. These can be purchased at kitchen supply stores."
                },
                {
                    "headline": "Flatten the bags as much as possible to maximize storage space.",
                    "description": "Place the bags in the freezer."
                }
            ]
        },
        {
            "name": "Freezing Whole Tomatoes with Peels",
            "steps": [
                {
                    "headline": "Place the whole tomatoes on a cookie sheet.",
                    "description": "Place the cookie sheet in the freezer. Placing the tomatoes on cookie sheets will preserve their shapes. Whole tomatoes don't need to be blanched before cooking."
                },
                {
                    "headline": "Remove the tomatoes from the freezer once they are frozen.",
                    "description": "Place them into plastic bags with seals. Make sure that all of the air is squeezed out of the bags."
                },
                {
                    "headline": "Run the frozen whole tomatoes under warm water to thaw them.",
                    "description": "When they have been run under warm water for a minute or so, their skins should loosen and slip off easily."
                }
            ]
        },
        {
            "name": "Cooking with Frozen Tomatoes",
            "steps": [
                {
                    "headline": "Make pureed tomatoes.",
                    "description": "Tomato puree can be used as a base for other sauces. It can also be used as a stand-alone tomato sauce if herbs and spices are added to it."
                },
                {
                    "headline": "Branch out from a traditional feast with tomato gravy.",
                    "description": "Tomato gravy is a delicious vegetarian option, especially around the holidays."
                },
                {
                    "headline": "Make classic tomato sauce.",
                    "description": "Tomato sauce is a known crowd pleaser—it's great on spaghetti, in lasagna, or served with mozzarella sticks."
                },
                {
                    "headline": "Nothing warms up the heart quite like tomato soup.",
                    "description": "Make a batch of tomato soup on a cold winter day for some genuine comfort food."
                },
                {
                    "headline": "Make tomato ketchup.",
                    "description": "While the store-bought variety might be a classic, homemade tomato ketchup is guaranteed to be a hit."
                }
            ]
        }
    ],
    "tyn": [
        "Tomatoes",
        "Large pot",
        "2 large containers",
        "Paring knife, tomato knife or regular knife",
        "Colander",
        "Zippered freezer bags",
        "Straw",
        "Vacuum bag sealer and bags (optional)"
    ],
    "text": " Preparing the Tomatoes for Freezing Select your tomatoes. Pick tomatoes that are firm, yet not hard. Avoid tomatoes with bug spots, bruises and other damage. You can use them, but you're going to have to do a lot more trimming. While you can use any breed of tomatoes, Roma tomatoes are the best for freezing purposes. They are meatier and contain less water. That means you get more thicker tomato sauce from them with less cooking time. Wash the tomatoes to remove dirt from the garden. Be sure to rub the tomatoes to remove any excess dirt. Pat the tomatoes dry with a clean cloth or paper towel. Remove the stem from the tomatoes. The area around the stem is usually tough, so remove it too. Cut off any damaged portion of the tomatoes. Freezing Peeled Tomatoes Boil a large pot of water. Put the tomatoes into the boiling water for one minute. The boiling water will loosen the tomatoes skins, thus making them easier to peel. Remove the skins. Use the tip of a paring knife or tomato knife to pierce the skin on each tomato. Once there's a hole in the skin, it should slide right off. Discard the skin. Set a colander inside another large container. Hold the tomatoes over the colander as you remove the seeds. It's not necessary to remove all of the seeds, but your tomato sauces are going to be more appealing without them. Squeeze the tomatoes slightly to remove the juice. Set the meaty portion of the tomatoes aside for now. Squeeze as much moisture as you can from the seeds in the colander. Put the juice in a container. You can drink it, or you can use it for cooking. You may also freeze it. Cut the remaining tomato pieces into the desired size chunks. Smaller pieces thaw quickly and cook into sauce in less time. Fill zippered plastic freezer bags with the tomato pieces. Remove as much air as possible by sucking air out with a straw as you close the zipper. If you prefer, you may seal the tomatoes with a vacuum sealer. These can be purchased at kitchen supply stores. Flatten the bags as much as possible to maximize storage space. Place the bags in the freezer. Freezing Whole Tomatoes with Peels Place the whole tomatoes on a cookie sheet. Place the cookie sheet in the freezer. Placing the tomatoes on cookie sheets will preserve their shapes. Whole tomatoes don't need to be blanched before cooking. Remove the tomatoes from the freezer once they are frozen. Place them into plastic bags with seals. Make sure that all of the air is squeezed out of the bags. Run the frozen whole tomatoes under warm water to thaw them. When they have been run under warm water for a minute or so, their skins should loosen and slip off easily. Cooking with Frozen Tomatoes Make pureed tomatoes. Tomato puree can be used as a base for other sauces. It can also be used as a stand-alone tomato sauce if herbs and spices are added to it. Branch out from a traditional feast with tomato gravy. Tomato gravy is a delicious vegetarian option, especially around the holidays. Make classic tomato sauce. Tomato sauce is a known crowd pleaser—it's great on spaghetti, in lasagna, or served with mozzarella sticks. Nothing warms up the heart quite like tomato soup. Make a batch of tomato soup on a cold winter day for some genuine comfort food. Make tomato ketchup. While the store-bought variety might be a classic, homemade tomato ketchup is guaranteed to be a hit.",
    "sentences": [
        " Preparing the Tomatoes for Freezing Select your tomatoes.",
        "Pick tomatoes that are firm, yet not hard.",
        "Avoid tomatoes with bug spots, bruises and other damage.",
        "You can use them, but you're going to have to do a lot more trimming.",
        "While you can use any breed of tomatoes, Roma tomatoes are the best for freezing purposes.",
        "They are meatier and contain less water.",
        "That means you get more thicker tomato sauce from them with less cooking time.",
        "Wash the tomatoes to remove dirt from the garden.",
        "Be sure to rub the tomatoes to remove any excess dirt.",
        "Pat the tomatoes dry with a clean cloth or paper towel.",
        "Remove the stem from the tomatoes.",
        "The area around the stem is usually tough, so remove it too.",
        "Cut off any damaged portion of the tomatoes.",
        "Freezing Peeled Tomatoes Boil a large pot of water.",
        "Put the tomatoes into the boiling water for one minute.",
        "The boiling water will loosen the tomatoes skins, thus making them easier to peel.",
        "Remove the skins.",
        "Use the tip of a paring knife or tomato knife to pierce the skin on each tomato.",
        "Once there's a hole in the skin, it should slide right off.",
        "Discard the skin.",
        "Set a colander inside another large container.",
        "Hold the tomatoes over the colander as you remove the seeds.",
        "It's not necessary to remove all of the seeds, but your tomato sauces are going to be more appealing without them.",
        "Squeeze the tomatoes slightly to remove the juice.",
        "Set the meaty portion of the tomatoes aside for now.",
        "Squeeze as much moisture as you can from the seeds in the colander.",
        "Put the juice in a container.",
        "You can drink it, or you can use it for cooking.",
        "You may also freeze it.",
        "Cut the remaining tomato pieces into the desired size chunks.",
        "Smaller pieces thaw quickly and cook into sauce in less time.",
        "Fill zippered plastic freezer bags with the tomato pieces.",
        "Remove as much air as possible by sucking air out with a straw as you close the zipper.",
        "If you prefer, you may seal the tomatoes with a vacuum sealer.",
        "These can be purchased at kitchen supply stores.",
        "Flatten the bags as much as possible to maximize storage space.",
        "Place the bags in the freezer.",
        "Freezing Whole Tomatoes with Peels Place the whole tomatoes on a cookie sheet.",
        "Place the cookie sheet in the freezer.",
        "Placing the tomatoes on cookie sheets will preserve their shapes.",
        "Whole tomatoes don't need to be blanched before cooking.",
        "Remove the tomatoes from the freezer once they are frozen.",
        "Place them into plastic bags with seals.",
        "Make sure that all of the air is squeezed out of the bags.",
        "Run the frozen whole tomatoes under warm water to thaw them.",
        "When they have been run under warm water for a minute or so, their skins should loosen and slip off easily.",
        "Cooking with Frozen Tomatoes Make pureed tomatoes.",
        "Tomato puree can be used as a base for other sauces.",
        "It can also be used as a stand-alone tomato sauce if herbs and spices are added to it.",
        "Branch out from a traditional feast with tomato gravy.",
        "Tomato gravy is a delicious vegetarian option, especially around the holidays.",
        "Make classic tomato sauce.",
        "Tomato sauce is a known crowd pleaser—it's great on spaghetti, in lasagna, or served with mozzarella sticks.",
        "Nothing warms up the heart quite like tomato soup.",
        "Make a batch of tomato soup on a cold winter day for some genuine comfort food.",
        "Make tomato ketchup.",
        "While the store-bought variety might be a classic, homemade tomato ketchup is guaranteed to be a hit."
    ]
}