{
    "title": "How to Wire Wrap a Pendant",
    "url": "https://www.wikihow.com/Wire-Wrap-a-Pendant",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "parts": [
        {
            "name": "Forming the Base of the Pendant",
            "steps": [
                {
                    "headline": "Get a roll of non-tarnishing 20 gauge silver wire.",
                    "description": "This type of wire is available in the jewelry making section of a craft supply store. Purchase enough wire to cover the diameter of your item times 12. For example, if the stone you want to wire wrap is 2 in (5.1 cm) wide, then you will need at least 24 in (61 cm) of wire. You may also use 20 or 21 gauge copper or colored wire if you prefer. 20 or 21 gauge is ideal for wrapping a pendant since it is easy to work with, but strong enough to secure the stone. Tip\nChoose wire that complements the color of your stone, such as copper wire for an amber stone, silver wire for a black stone, or gold wire for a green stone."
                },
                {
                    "headline": "Cut 2 pieces of wire that are each 6 times the diameter of your stone.",
                    "description": "Put on a pair of goggles or safety glasses before you cut the wire. Measure out a length of wire that is 6 times the diameter of your item. Then, use a pair of wire cutters to sever the wire at this point. File the ends of the wire with a metal file to remove any sharp or jagged points. For example, if the stone is 2 in (5.1 cm) wide, then you will need 2 pieces of wire that are each 12 in (30 cm) long. Repeat to make a second piece of wire of the same exact length."
                },
                {
                    "headline": "Straighten the wire with your hands.",
                    "description": "Grasp 1 of the wires at the ends and pull them apart to straighten the length of wire as much as possible. Uncurl any spots in the wire that have gotten twisted. Then, repeat for the second piece of wire. The wires do not need to be perfectly straight. Make them as straight as you can, but don’t worry if they are slightly wavy in some spots."
                },
                {
                    "headline": "Fold the lengths of wire in half around your index finger.",
                    "description": "Line up the 2 pieces of wire so that their ends are even. Then, locate the center of the wires and use your hands to bend them at this point to fold them in half. Use your index finger to maintain some space at the center point of the wires. This will be the opening for the chain or cord that you string your finished pendant onto. The wire will bend in half easily, so there is no need to use pliers to do this."
                },
                {
                    "headline": "Grasp the bent portion of the 2 lengths of wire and twist.",
                    "description": "Place your index finger into the center point of the wires. Then, use your fingers or a pair of pliers to grasp the wires about 0.5 to 1 in (1.3 to 2.5 cm) from the fold and twist to create a loop at the center of the wire. Twist 2 times to ensure that the loop is secure. Remove your index finger from the fold after you have created the loop. You can do this part with your hands or with a pair of pliers."
                }
            ]
        },
        {
            "name": "Securing the Stone with the Wires",
            "steps": [
                {
                    "headline": "Select a disc-shaped stone to wrap.",
                    "description": "You can wrap any type of stone, bead, or crystal you like, but items with a disc-like shape are easiest to wrap. Choose a flat stone as your first wire-wrapping project. Your item will also be easier to wrap if it has uneven or jagged (but not sharp) edges. This will make it easier for you to anchor the wire to the outside of the stone. Other Items to Wire Wrap\nBeach Glass. This is glass that has been worn down by sand and water until it is a smooth stone-like piece. Geode slice. This is a stone with crystals on the inside, and you can get geode slices encased in resin. You can buy a slice of a small geode to wire-wrap. Large beads. Some beads work well for wire-wrapping. Choose a large disc-shaped bead so that you will have lots of surface area to work with."
                },
                {
                    "headline": "Spread out the 4 wires extending from the loop so they are equidistant.",
                    "description": "Use your fingers to separate the wires at the base of the loop you created. Arrange the wires so that each 1 is pointed in a different direction and at an equal distance from each of its neighbors. Try to make the 4 wires look like each 1 is pointing to 1 corner of a square."
                },
                {
                    "headline": "Position the stone with the top part at the center of the 4 wires.",
                    "description": "Identify where you want the top of the pendant to be and place this end onto the center of the 4 wires. Arrange the stone or other pendant item so that the flattest edge will be facing outwards. If your stone or other pendant item has a special feature that you want to be at the front of the necklace, then make sure to arrange it so that this will be visible."
                },
                {
                    "headline": "Bring 2 of the wires together on 1 edge of the stone and twist.",
                    "description": "Grasp 2 of the wires on 1 side of the stone—1 on the front and 1 on the back. Bring the wires against the stone on the front and back of it and then twist them 2 times to secure them along the along the side of the stone. Keep holding the stone and wire together since the stone will still be able to slip out at this point."
                },
                {
                    "headline": "Wrap the same 2 wires across the top edge of the stone and twist.",
                    "description": "Take the same 2 wires and bring them to the center of the stone, which will be the bottom of the pendant when it is completed. Twist these wires 2 times against the edge of the stone to secure it. The stone will be more secure at this point, but continue to keep a firm grip on it to prevent it from slipping out."
                },
                {
                    "headline": "Repeat with the other 2 wires on the opposite side of the stone.",
                    "description": "Go through the same process to secure the other side of the stone. Twist the wires 2 times against the side of the stone across from where you secured it on the opposite side, and then bring the wires to the center of the stone (bottom of the pendant) and twist them twice against that edge as well. It is okay if the wires on 1 side of the stone are not in the exact same location as on the first side. This lack of symmetry may add interest to your pendant."
                },
                {
                    "headline": "Twist all 4 wires to secure the bottom of the pendant.",
                    "description": "After you have secured the second set of wires at the bottom of the pendant, grasp all 4 wires and twist them together 2 times. This will secure the bottom of the pendant. Do not cut the wires after you twist them. Leave the ends to create spirals and wrap the wire around the stone additional times."
                }
            ]
        },
        {
            "name": "Adding Design Elements",
            "steps": [
                {
                    "headline": "Create a jag in the wire to add a zigzag design and tighten the wire.",
                    "description": "Pinch the wire with the pliers so that they are perpendicular to the stone and then rotate the pliers 180 degrees. This will create a small Z shape in the wire and it will also tighten the wire against the stone. Repeat this as many times as you like in the wires lining the front of the stone. Make jags going all in the same direction or vary them if you prefer. To provide yourself with more wire to twist into jags, bring 1 or more of the ends extending from the bottom of the stone up and over the top of the pendant. Secure the end of the wire to the top of the pendant by twisting it around the base of the loop."
                },
                {
                    "headline": "Roll a piece of wire into a coil to form a spiral design on the pendant.",
                    "description": "Use the pliers to grasp the end of 1 of the wires extending from the bottom of the pendant. Then, rotate the pliers 180 degrees to form a loop with the end of the wire. Open the pliers to release the wire, and then grasp it again from the side to flatten out the loop. Rotate the pliers in a counterclockwise direction to coil the wire around the loop. Then, release the wire, return the pliers to the starting position, and rotate the pliers again to continue coiling the wire. Keep coiling the wire in this way until the spiral is the desired size. Then use the pliers to press the spiral of wire against the stone. Try making 4 coils with each of the ends of wire and grouping these along the bottom of the pendant."
                },
                {
                    "headline": "Wrap a piece of wire around 2 of the wires extending from the pendant.",
                    "description": "To accent the wires themselves, take 1 of the wires and use the pliers to wrap it around 2 of the other wires. Hold the 2 pieces of wire together, and start wrapping them near the base of the pendant. Wrap the wire around the other 2 pieces like a vine until you are satisfied with the look or until you run out of wire. Then, secure the 2 ends of wire to the top of the pendant. You may cut the excess from the 2 wires you wrapped, or use these ends to form spirals along the top edge of the stone. If you cut the excess, make sure to file the ends to remove any sharp or jagged points. Try a combination of wire-wrapping techniques to create a unique design! Coil the wire around a couple pieces of wire and then wrap this wire up and along the side of your pendant. Then, make 2 different sized spirals with the ends of the wire at the top of the pendant. Wrap the 4 ends of wire up and over the top of the pendant, and make 2 jags into each of the wires. Coil the ends into spirals and arrange these along the top of the pendant. Bring 2 of the wires up to the sides of the pendant and secure them with a twist. Then, make coils in each of the ends to accent the sides of the pendant."
                },
                {
                    "headline": "Attach the pendant to a chain or cord.",
                    "description": "When you are finished making your wire-wrapped stone pendant, insert the end of a chain or necklace cord (such as hemp or nylon) through the wire loop at the top of the pendant. Secure the ends of the chain around the wearer’s neck, or tie the ends of the cord in a knot and slip the necklace over the wearer’s head. Make sure that the chain or cord is the desired length for displaying your pendant. Ensure that the cord is long enough to fit over the wearer’s head before you tie it in a knot."
                }
            ]
        }
    ],
    "tyn": [
        "Stone to wire-wrap",
        "20 gauge silver, copper, or colored wire",
        "Wire cutters",
        "Needle nose pliers"
    ],
    "text": " Forming the Base of the Pendant Get a roll of non-tarnishing 20 gauge silver wire. This type of wire is available in the jewelry making section of a craft supply store. Purchase enough wire to cover the diameter of your item times 12. For example, if the stone you want to wire wrap is 2 in (5.1 cm) wide, then you will need at least 24 in (61 cm) of wire. You may also use 20 or 21 gauge copper or colored wire if you prefer. 20 or 21 gauge is ideal for wrapping a pendant since it is easy to work with, but strong enough to secure the stone. Tip\nChoose wire that complements the color of your stone, such as copper wire for an amber stone, silver wire for a black stone, or gold wire for a green stone. Cut 2 pieces of wire that are each 6 times the diameter of your stone. Put on a pair of goggles or safety glasses before you cut the wire. Measure out a length of wire that is 6 times the diameter of your item. Then, use a pair of wire cutters to sever the wire at this point. File the ends of the wire with a metal file to remove any sharp or jagged points. For example, if the stone is 2 in (5.1 cm) wide, then you will need 2 pieces of wire that are each 12 in (30 cm) long. Repeat to make a second piece of wire of the same exact length. Straighten the wire with your hands. Grasp 1 of the wires at the ends and pull them apart to straighten the length of wire as much as possible. Uncurl any spots in the wire that have gotten twisted. Then, repeat for the second piece of wire. The wires do not need to be perfectly straight. Make them as straight as you can, but don’t worry if they are slightly wavy in some spots. Fold the lengths of wire in half around your index finger. Line up the 2 pieces of wire so that their ends are even. Then, locate the center of the wires and use your hands to bend them at this point to fold them in half. Use your index finger to maintain some space at the center point of the wires. This will be the opening for the chain or cord that you string your finished pendant onto. The wire will bend in half easily, so there is no need to use pliers to do this. Grasp the bent portion of the 2 lengths of wire and twist. Place your index finger into the center point of the wires. Then, use your fingers or a pair of pliers to grasp the wires about 0.5 to 1 in (1.3 to 2.5 cm) from the fold and twist to create a loop at the center of the wire. Twist 2 times to ensure that the loop is secure. Remove your index finger from the fold after you have created the loop. You can do this part with your hands or with a pair of pliers. Securing the Stone with the Wires Select a disc-shaped stone to wrap. You can wrap any type of stone, bead, or crystal you like, but items with a disc-like shape are easiest to wrap. Choose a flat stone as your first wire-wrapping project. Your item will also be easier to wrap if it has uneven or jagged (but not sharp) edges. This will make it easier for you to anchor the wire to the outside of the stone. Other Items to Wire Wrap\nBeach Glass. This is glass that has been worn down by sand and water until it is a smooth stone-like piece. Geode slice. This is a stone with crystals on the inside, and you can get geode slices encased in resin. You can buy a slice of a small geode to wire-wrap. Large beads. Some beads work well for wire-wrapping. Choose a large disc-shaped bead so that you will have lots of surface area to work with. Spread out the 4 wires extending from the loop so they are equidistant. Use your fingers to separate the wires at the base of the loop you created. Arrange the wires so that each 1 is pointed in a different direction and at an equal distance from each of its neighbors. Try to make the 4 wires look like each 1 is pointing to 1 corner of a square. Position the stone with the top part at the center of the 4 wires. Identify where you want the top of the pendant to be and place this end onto the center of the 4 wires. Arrange the stone or other pendant item so that the flattest edge will be facing outwards. If your stone or other pendant item has a special feature that you want to be at the front of the necklace, then make sure to arrange it so that this will be visible. Bring 2 of the wires together on 1 edge of the stone and twist. Grasp 2 of the wires on 1 side of the stone—1 on the front and 1 on the back. Bring the wires against the stone on the front and back of it and then twist them 2 times to secure them along the along the side of the stone. Keep holding the stone and wire together since the stone will still be able to slip out at this point. Wrap the same 2 wires across the top edge of the stone and twist. Take the same 2 wires and bring them to the center of the stone, which will be the bottom of the pendant when it is completed. Twist these wires 2 times against the edge of the stone to secure it. The stone will be more secure at this point, but continue to keep a firm grip on it to prevent it from slipping out. Repeat with the other 2 wires on the opposite side of the stone. Go through the same process to secure the other side of the stone. Twist the wires 2 times against the side of the stone across from where you secured it on the opposite side, and then bring the wires to the center of the stone (bottom of the pendant) and twist them twice against that edge as well. It is okay if the wires on 1 side of the stone are not in the exact same location as on the first side. This lack of symmetry may add interest to your pendant. Twist all 4 wires to secure the bottom of the pendant. After you have secured the second set of wires at the bottom of the pendant, grasp all 4 wires and twist them together 2 times. This will secure the bottom of the pendant. Do not cut the wires after you twist them. Leave the ends to create spirals and wrap the wire around the stone additional times. Adding Design Elements Create a jag in the wire to add a zigzag design and tighten the wire. Pinch the wire with the pliers so that they are perpendicular to the stone and then rotate the pliers 180 degrees. This will create a small Z shape in the wire and it will also tighten the wire against the stone. Repeat this as many times as you like in the wires lining the front of the stone. Make jags going all in the same direction or vary them if you prefer. To provide yourself with more wire to twist into jags, bring 1 or more of the ends extending from the bottom of the stone up and over the top of the pendant. Secure the end of the wire to the top of the pendant by twisting it around the base of the loop. Roll a piece of wire into a coil to form a spiral design on the pendant. Use the pliers to grasp the end of 1 of the wires extending from the bottom of the pendant. Then, rotate the pliers 180 degrees to form a loop with the end of the wire. Open the pliers to release the wire, and then grasp it again from the side to flatten out the loop. Rotate the pliers in a counterclockwise direction to coil the wire around the loop. Then, release the wire, return the pliers to the starting position, and rotate the pliers again to continue coiling the wire. Keep coiling the wire in this way until the spiral is the desired size. Then use the pliers to press the spiral of wire against the stone. Try making 4 coils with each of the ends of wire and grouping these along the bottom of the pendant. Wrap a piece of wire around 2 of the wires extending from the pendant. To accent the wires themselves, take 1 of the wires and use the pliers to wrap it around 2 of the other wires. Hold the 2 pieces of wire together, and start wrapping them near the base of the pendant. Wrap the wire around the other 2 pieces like a vine until you are satisfied with the look or until you run out of wire. Then, secure the 2 ends of wire to the top of the pendant. You may cut the excess from the 2 wires you wrapped, or use these ends to form spirals along the top edge of the stone. If you cut the excess, make sure to file the ends to remove any sharp or jagged points. Try a combination of wire-wrapping techniques to create a unique design! Coil the wire around a couple pieces of wire and then wrap this wire up and along the side of your pendant. Then, make 2 different sized spirals with the ends of the wire at the top of the pendant. Wrap the 4 ends of wire up and over the top of the pendant, and make 2 jags into each of the wires. Coil the ends into spirals and arrange these along the top of the pendant. Bring 2 of the wires up to the sides of the pendant and secure them with a twist. Then, make coils in each of the ends to accent the sides of the pendant. Attach the pendant to a chain or cord. When you are finished making your wire-wrapped stone pendant, insert the end of a chain or necklace cord (such as hemp or nylon) through the wire loop at the top of the pendant. Secure the ends of the chain around the wearer’s neck, or tie the ends of the cord in a knot and slip the necklace over the wearer’s head. Make sure that the chain or cord is the desired length for displaying your pendant. Ensure that the cord is long enough to fit over the wearer’s head before you tie it in a knot.",
    "sentences": [
        " Forming the Base of the Pendant Get a roll of non-tarnishing 20 gauge silver wire.",
        "This type of wire is available in the jewelry making section of a craft supply store.",
        "Purchase enough wire to cover the diameter of your item times 12.",
        "For example, if the stone you want to wire wrap is 2 in (5.1 cm) wide, then you will need at least 24 in (61 cm) of wire.",
        "You may also use 20 or 21 gauge copper or colored wire if you prefer.",
        "20 or 21 gauge is ideal for wrapping a pendant since it is easy to work with, but strong enough to secure the stone.",
        "Tip\nChoose wire that complements the color of your stone, such as copper wire for an amber stone, silver wire for a black stone, or gold wire for a green stone.",
        "Cut 2 pieces of wire that are each 6 times the diameter of your stone.",
        "Put on a pair of goggles or safety glasses before you cut the wire.",
        "Measure out a length of wire that is 6 times the diameter of your item.",
        "Then, use a pair of wire cutters to sever the wire at this point.",
        "File the ends of the wire with a metal file to remove any sharp or jagged points.",
        "For example, if the stone is 2 in (5.1 cm) wide, then you will need 2 pieces of wire that are each 12 in (30 cm) long.",
        "Repeat to make a second piece of wire of the same exact length.",
        "Straighten the wire with your hands.",
        "Grasp 1 of the wires at the ends and pull them apart to straighten the length of wire as much as possible.",
        "Uncurl any spots in the wire that have gotten twisted.",
        "Then, repeat for the second piece of wire.",
        "The wires do not need to be perfectly straight.",
        "Make them as straight as you can, but don’t worry if they are slightly wavy in some spots.",
        "Fold the lengths of wire in half around your index finger.",
        "Line up the 2 pieces of wire so that their ends are even.",
        "Then, locate the center of the wires and use your hands to bend them at this point to fold them in half.",
        "Use your index finger to maintain some space at the center point of the wires.",
        "This will be the opening for the chain or cord that you string your finished pendant onto.",
        "The wire will bend in half easily, so there is no need to use pliers to do this.",
        "Grasp the bent portion of the 2 lengths of wire and twist.",
        "Place your index finger into the center point of the wires.",
        "Then, use your fingers or a pair of pliers to grasp the wires about 0.5 to 1 in (1.3 to 2.5 cm) from the fold and twist to create a loop at the center of the wire.",
        "Twist 2 times to ensure that the loop is secure.",
        "Remove your index finger from the fold after you have created the loop.",
        "You can do this part with your hands or with a pair of pliers.",
        "Securing the Stone with the Wires Select a disc-shaped stone to wrap.",
        "You can wrap any type of stone, bead, or crystal you like, but items with a disc-like shape are easiest to wrap.",
        "Choose a flat stone as your first wire-wrapping project.",
        "Your item will also be easier to wrap if it has uneven or jagged (but not sharp) edges.",
        "This will make it easier for you to anchor the wire to the outside of the stone.",
        "Other Items to Wire Wrap\nBeach Glass.",
        "This is glass that has been worn down by sand and water until it is a smooth stone-like piece.",
        "Geode slice.",
        "This is a stone with crystals on the inside, and you can get geode slices encased in resin.",
        "You can buy a slice of a small geode to wire-wrap.",
        "Large beads.",
        "Some beads work well for wire-wrapping.",
        "Choose a large disc-shaped bead so that you will have lots of surface area to work with.",
        "Spread out the 4 wires extending from the loop so they are equidistant.",
        "Use your fingers to separate the wires at the base of the loop you created.",
        "Arrange the wires so that each 1 is pointed in a different direction and at an equal distance from each of its neighbors.",
        "Try to make the 4 wires look like each 1 is pointing to 1 corner of a square.",
        "Position the stone with the top part at the center of the 4 wires.",
        "Identify where you want the top of the pendant to be and place this end onto the center of the 4 wires.",
        "Arrange the stone or other pendant item so that the flattest edge will be facing outwards.",
        "If your stone or other pendant item has a special feature that you want to be at the front of the necklace, then make sure to arrange it so that this will be visible.",
        "Bring 2 of the wires together on 1 edge of the stone and twist.",
        "Grasp 2 of the wires on 1 side of the stone—1 on the front and 1 on the back.",
        "Bring the wires against the stone on the front and back of it and then twist them 2 times to secure them along the along the side of the stone.",
        "Keep holding the stone and wire together since the stone will still be able to slip out at this point.",
        "Wrap the same 2 wires across the top edge of the stone and twist.",
        "Take the same 2 wires and bring them to the center of the stone, which will be the bottom of the pendant when it is completed.",
        "Twist these wires 2 times against the edge of the stone to secure it.",
        "The stone will be more secure at this point, but continue to keep a firm grip on it to prevent it from slipping out.",
        "Repeat with the other 2 wires on the opposite side of the stone.",
        "Go through the same process to secure the other side of the stone.",
        "Twist the wires 2 times against the side of the stone across from where you secured it on the opposite side, and then bring the wires to the center of the stone (bottom of the pendant) and twist them twice against that edge as well.",
        "It is okay if the wires on 1 side of the stone are not in the exact same location as on the first side.",
        "This lack of symmetry may add interest to your pendant.",
        "Twist all 4 wires to secure the bottom of the pendant.",
        "After you have secured the second set of wires at the bottom of the pendant, grasp all 4 wires and twist them together 2 times.",
        "This will secure the bottom of the pendant.",
        "Do not cut the wires after you twist them.",
        "Leave the ends to create spirals and wrap the wire around the stone additional times.",
        "Adding Design Elements Create a jag in the wire to add a zigzag design and tighten the wire.",
        "Pinch the wire with the pliers so that they are perpendicular to the stone and then rotate the pliers 180 degrees.",
        "This will create a small Z shape in the wire and it will also tighten the wire against the stone.",
        "Repeat this as many times as you like in the wires lining the front of the stone.",
        "Make jags going all in the same direction or vary them if you prefer.",
        "To provide yourself with more wire to twist into jags, bring 1 or more of the ends extending from the bottom of the stone up and over the top of the pendant.",
        "Secure the end of the wire to the top of the pendant by twisting it around the base of the loop.",
        "Roll a piece of wire into a coil to form a spiral design on the pendant.",
        "Use the pliers to grasp the end of 1 of the wires extending from the bottom of the pendant.",
        "Then, rotate the pliers 180 degrees to form a loop with the end of the wire.",
        "Open the pliers to release the wire, and then grasp it again from the side to flatten out the loop.",
        "Rotate the pliers in a counterclockwise direction to coil the wire around the loop.",
        "Then, release the wire, return the pliers to the starting position, and rotate the pliers again to continue coiling the wire.",
        "Keep coiling the wire in this way until the spiral is the desired size.",
        "Then use the pliers to press the spiral of wire against the stone.",
        "Try making 4 coils with each of the ends of wire and grouping these along the bottom of the pendant.",
        "Wrap a piece of wire around 2 of the wires extending from the pendant.",
        "To accent the wires themselves, take 1 of the wires and use the pliers to wrap it around 2 of the other wires.",
        "Hold the 2 pieces of wire together, and start wrapping them near the base of the pendant.",
        "Wrap the wire around the other 2 pieces like a vine until you are satisfied with the look or until you run out of wire.",
        "Then, secure the 2 ends of wire to the top of the pendant.",
        "You may cut the excess from the 2 wires you wrapped, or use these ends to form spirals along the top edge of the stone.",
        "If you cut the excess, make sure to file the ends to remove any sharp or jagged points.",
        "Try a combination of wire-wrapping techniques to create a unique design!",
        "Coil the wire around a couple pieces of wire and then wrap this wire up and along the side of your pendant.",
        "Then, make 2 different sized spirals with the ends of the wire at the top of the pendant.",
        "Wrap the 4 ends of wire up and over the top of the pendant, and make 2 jags into each of the wires.",
        "Coil the ends into spirals and arrange these along the top of the pendant.",
        "Bring 2 of the wires up to the sides of the pendant and secure them with a twist.",
        "Then, make coils in each of the ends to accent the sides of the pendant.",
        "Attach the pendant to a chain or cord.",
        "When you are finished making your wire-wrapped stone pendant, insert the end of a chain or necklace cord (such as hemp or nylon) through the wire loop at the top of the pendant.",
        "Secure the ends of the chain around the wearer’s neck, or tie the ends of the cord in a knot and slip the necklace over the wearer’s head.",
        "Make sure that the chain or cord is the desired length for displaying your pendant.",
        "Ensure that the cord is long enough to fit over the wearer’s head before you tie it in a knot."
    ]
}