{
    "title": "How to Clean White Flip Flops",
    "url": "https://www.wikihow.com/Clean-White-Flip-Flops",
    "category_hierarchy": [
        "Personal Care and Style",
        "Footwear",
        "Flip Flops"
    ],
    "methods": [
        {
            "name": "Scrubbing Rubber, Foam, Plastic, or Fabric Flip Flops",
            "steps": [
                {
                    "headline": "Rinse loose dirt off your shoes.",
                    "description": "You’ll want your flip flops to be free of loose dirt or mud when you start cleaning them, to avoid rubbing the dirt around and making stains. Run them under warm or cold water in your utility sink to get any remaining dirt. Get dirty water off your flip flops by wiping them quickly with paper towels. If you don’t have a utility sink, use a hose outside or your bathroom or kitchen sink. If you’re using a bathroom or kitchen sink, you’ll want to clean them after you’re finished."
                },
                {
                    "headline": "Mix 1 part baking soda with 1.5 parts detergent in a bowl.",
                    "description": "Take 1 tablespoon (14.4 g) of baking soda and mix it with 1.5 tablespoons (22 mL) laundry detergent. Use stain-removing laundry detergent for the best results. If you need more of the mixture, continue adding 1.5 tablespoons (22 mL) laundry detergent for every 1 tablespoon (14.4 g) of baking soda that you use."
                },
                {
                    "headline": "Scrub the mixture onto your shoes with a toothbrush.",
                    "description": "Dip a toothbrush into the mixture. Scrub the mixture onto the dirtiest parts of your flip flops with the toothbrush. Scrub hard enough that you can get the dirt out of little nooks and crannies in your shoes."
                },
                {
                    "headline": "Allow your shoes to sit for at least 10 minutes.",
                    "description": "Allowing the mixture to sit on your shoes will give the baking soda a chance to work its whitening magic. Choose a spot out of your way and out of the sun to let your shoes sit."
                },
                {
                    "headline": "Rinse your flip flops.",
                    "description": "Rinse the baking soda and detergent mixture off your shoes with warm running water in the utility sink. Be sure to get all the cleansing mixture off."
                },
                {
                    "headline": "Wash the flip flops again to get them extra clean.",
                    "description": "Some people stop after rinsing, but if you like you can then wash your shoes again using warm water, a few drops of either laundry or dish detergent, and a rag."
                },
                {
                    "headline": "Dry your shoes with a clean towel.",
                    "description": "Use a clean towel to dry your shoes, and they are ready to wear. Avoid leaving your flip flops out in the sun, as too much sunlight can cause white rubber to yellow over time."
                }
            ]
        },
        {
            "name": "Cleaning Leather and Suede Flip Flops",
            "steps": [
                {
                    "headline": "Use white vinegar and a leather brush to treat dried stains.",
                    "description": "Dust off caked mud or another dry stain with a leather or suede brush. Then put 2 tablespoons (30 mL) of white vinegar on a clean, dry cloth. Pat the vinegar rag on the stained part of the shoe for about 5 minutes. Dry the area with a clean dry towel after 5 minutes. Do not rinse the area with water."
                },
                {
                    "headline": "Use talcum powder or cornstarch to treat a liquid spill.",
                    "description": "If you spill some juice or coffee on your shoes, pat the area dry with a clean cloth or paper towel. Then shake a layer of powder, such as baby powder, talcum powder, or cornstarch onto the stain. Smooth the layer over the entire stain with your fingers and allow your shoe to sit overnight. Brush the dried powder off your shoe with a leather or suede brush in the morning."
                },
                {
                    "headline": "Avoid using water on your leather or suede shoes.",
                    "description": "Water can affect both the color and texture of suede and leather. Do not wash your leather or suede shoes in a machine, or hand wash them in the sink with detergent and water."
                },
                {
                    "headline": "Use white shoe polish on stubborn stains.",
                    "description": "After spot-cleaning your shoes, you may notice you still have scuff marks or stains that won’t come out. If this happens, buy some white shoe polish that is safe for leather or suede, and apply it to these stubborn marks using a clean dry cloth to rub the polish in. Read and follow the package directions on the shoe polish for best results."
                },
                {
                    "headline": "Protect your shoes with a leather or suede sealant.",
                    "description": "One of the best ways to avoid needing to clean leather or suede shoes is by protecting them in the first place. Purchase a spray sealant for leather or suede and apply it by spraying a light coating over your shoes in a ventilated area. For best results, reapply your sealant every few months. Be sure to follow the package directions."
                }
            ]
        },
        {
            "name": "Spot-Cleaning Your Flip Flops",
            "steps": [
                {
                    "headline": "Carry a magic cleaning sponge with you for quick spot treatments.",
                    "description": "Magic cleaning sponges have long been known to work magic when removing scuffs from white walls, floors, and other surfaces. Luckily, they have that same quality for shoes. Wet a small corner of the sponge and rub it over the soiled areas of your shoes, just like you would a rubber eraser, to get them bright white again. Magic cleaning sponges even work on grass stains, which can be some of the toughest stains to remove from shoes. Use caution using magic cleaning sponges on leather or suede. Try rubbing it on an inconspicuous part of your shoe to test it."
                },
                {
                    "headline": "Try a white art eraser for another convenient option.",
                    "description": "Any white eraser used for erasing pencil will work to clean scuffs on many types of white shoes. Find one at a local craft or office supply store. Rub it on the dirt marks like you would erase pencil, then blow the shavings away. Carry an art eraser with you to spot clean your shoes any time, any place. Use caution using art erasers on leather or suede. Try rubbing it on an inconspicuous part of your shoe to test it."
                },
                {
                    "headline": "Use a portable stain pen to spot-treat on-the-go.",
                    "description": "Just like you would use it for immediately removing stains from white clothes, brush the dirt or stain on your flip flop with a stain pen right when you notice it. Then when you get home, clean the whole shoe with a rag and laundry detergent by putting a few drops of detergent on a wet rag, scrubbing your shoe, and rinsing it in warm water in a sink. Read the packaging for your stain pen before trying to use it on leather or suede. It is fine to use on all other materials."
                }
            ]
        }
    ],
    "tyn": [
        "Cleaning Rubber, Foam, Plastic, or Fabric Flip Flops",
        "Baking soda",
        "Stain-removing laundry detergent",
        "Toothbrush",
        "Bowl",
        "Running water",
        "Cleaning Leather and Suede Flip Flops",
        "Leather or suede brush",
        "White vinegar",
        "White powder – talcum or cornstarch",
        "White shoe polish",
        "Leather or suede sealant",
        "Spot-Cleaning Your Flip Flops",
        "Magic Eraser",
        "White art erasers",
        "Portable stain pen"
    ],
    "text": " Scrubbing Rubber, Foam, Plastic, or Fabric Flip Flops Rinse loose dirt off your shoes. You’ll want your flip flops to be free of loose dirt or mud when you start cleaning them, to avoid rubbing the dirt around and making stains. Run them under warm or cold water in your utility sink to get any remaining dirt. Get dirty water off your flip flops by wiping them quickly with paper towels. If you don’t have a utility sink, use a hose outside or your bathroom or kitchen sink. If you’re using a bathroom or kitchen sink, you’ll want to clean them after you’re finished. Mix 1 part baking soda with 1.5 parts detergent in a bowl. Take 1 tablespoon (14.4 g) of baking soda and mix it with 1.5 tablespoons (22 mL) laundry detergent. Use stain-removing laundry detergent for the best results. If you need more of the mixture, continue adding 1.5 tablespoons (22 mL) laundry detergent for every 1 tablespoon (14.4 g) of baking soda that you use. Scrub the mixture onto your shoes with a toothbrush. Dip a toothbrush into the mixture. Scrub the mixture onto the dirtiest parts of your flip flops with the toothbrush. Scrub hard enough that you can get the dirt out of little nooks and crannies in your shoes. Allow your shoes to sit for at least 10 minutes. Allowing the mixture to sit on your shoes will give the baking soda a chance to work its whitening magic. Choose a spot out of your way and out of the sun to let your shoes sit. Rinse your flip flops. Rinse the baking soda and detergent mixture off your shoes with warm running water in the utility sink. Be sure to get all the cleansing mixture off. Wash the flip flops again to get them extra clean. Some people stop after rinsing, but if you like you can then wash your shoes again using warm water, a few drops of either laundry or dish detergent, and a rag. Dry your shoes with a clean towel. Use a clean towel to dry your shoes, and they are ready to wear. Avoid leaving your flip flops out in the sun, as too much sunlight can cause white rubber to yellow over time. Cleaning Leather and Suede Flip Flops Use white vinegar and a leather brush to treat dried stains. Dust off caked mud or another dry stain with a leather or suede brush. Then put 2 tablespoons (30 mL) of white vinegar on a clean, dry cloth. Pat the vinegar rag on the stained part of the shoe for about 5 minutes. Dry the area with a clean dry towel after 5 minutes. Do not rinse the area with water. Use talcum powder or cornstarch to treat a liquid spill. If you spill some juice or coffee on your shoes, pat the area dry with a clean cloth or paper towel. Then shake a layer of powder, such as baby powder, talcum powder, or cornstarch onto the stain. Smooth the layer over the entire stain with your fingers and allow your shoe to sit overnight. Brush the dried powder off your shoe with a leather or suede brush in the morning. Avoid using water on your leather or suede shoes. Water can affect both the color and texture of suede and leather. Do not wash your leather or suede shoes in a machine, or hand wash them in the sink with detergent and water. Use white shoe polish on stubborn stains. After spot-cleaning your shoes, you may notice you still have scuff marks or stains that won’t come out. If this happens, buy some white shoe polish that is safe for leather or suede, and apply it to these stubborn marks using a clean dry cloth to rub the polish in. Read and follow the package directions on the shoe polish for best results. Protect your shoes with a leather or suede sealant. One of the best ways to avoid needing to clean leather or suede shoes is by protecting them in the first place. Purchase a spray sealant for leather or suede and apply it by spraying a light coating over your shoes in a ventilated area. For best results, reapply your sealant every few months. Be sure to follow the package directions. Spot-Cleaning Your Flip Flops Carry a magic cleaning sponge with you for quick spot treatments. Magic cleaning sponges have long been known to work magic when removing scuffs from white walls, floors, and other surfaces. Luckily, they have that same quality for shoes. Wet a small corner of the sponge and rub it over the soiled areas of your shoes, just like you would a rubber eraser, to get them bright white again. Magic cleaning sponges even work on grass stains, which can be some of the toughest stains to remove from shoes. Use caution using magic cleaning sponges on leather or suede. Try rubbing it on an inconspicuous part of your shoe to test it. Try a white art eraser for another convenient option. Any white eraser used for erasing pencil will work to clean scuffs on many types of white shoes. Find one at a local craft or office supply store. Rub it on the dirt marks like you would erase pencil, then blow the shavings away. Carry an art eraser with you to spot clean your shoes any time, any place. Use caution using art erasers on leather or suede. Try rubbing it on an inconspicuous part of your shoe to test it. Use a portable stain pen to spot-treat on-the-go. Just like you would use it for immediately removing stains from white clothes, brush the dirt or stain on your flip flop with a stain pen right when you notice it. Then when you get home, clean the whole shoe with a rag and laundry detergent by putting a few drops of detergent on a wet rag, scrubbing your shoe, and rinsing it in warm water in a sink. Read the packaging for your stain pen before trying to use it on leather or suede. It is fine to use on all other materials.",
    "sentences": [
        " Scrubbing Rubber, Foam, Plastic, or Fabric Flip Flops Rinse loose dirt off your shoes.",
        "You’ll want your flip flops to be free of loose dirt or mud when you start cleaning them, to avoid rubbing the dirt around and making stains.",
        "Run them under warm or cold water in your utility sink to get any remaining dirt.",
        "Get dirty water off your flip flops by wiping them quickly with paper towels.",
        "If you don’t have a utility sink, use a hose outside or your bathroom or kitchen sink.",
        "If you’re using a bathroom or kitchen sink, you’ll want to clean them after you’re finished.",
        "Mix 1 part baking soda with 1.5 parts detergent in a bowl.",
        "Take 1 tablespoon (14.4 g) of baking soda and mix it with 1.5 tablespoons (22 mL) laundry detergent.",
        "Use stain-removing laundry detergent for the best results.",
        "If you need more of the mixture, continue adding 1.5 tablespoons (22 mL) laundry detergent for every 1 tablespoon (14.4 g) of baking soda that you use.",
        "Scrub the mixture onto your shoes with a toothbrush.",
        "Dip a toothbrush into the mixture.",
        "Scrub the mixture onto the dirtiest parts of your flip flops with the toothbrush.",
        "Scrub hard enough that you can get the dirt out of little nooks and crannies in your shoes.",
        "Allow your shoes to sit for at least 10 minutes.",
        "Allowing the mixture to sit on your shoes will give the baking soda a chance to work its whitening magic.",
        "Choose a spot out of your way and out of the sun to let your shoes sit.",
        "Rinse your flip flops.",
        "Rinse the baking soda and detergent mixture off your shoes with warm running water in the utility sink.",
        "Be sure to get all the cleansing mixture off.",
        "Wash the flip flops again to get them extra clean.",
        "Some people stop after rinsing, but if you like you can then wash your shoes again using warm water, a few drops of either laundry or dish detergent, and a rag.",
        "Dry your shoes with a clean towel.",
        "Use a clean towel to dry your shoes, and they are ready to wear.",
        "Avoid leaving your flip flops out in the sun, as too much sunlight can cause white rubber to yellow over time.",
        "Cleaning Leather and Suede Flip Flops Use white vinegar and a leather brush to treat dried stains.",
        "Dust off caked mud or another dry stain with a leather or suede brush.",
        "Then put 2 tablespoons (30 mL) of white vinegar on a clean, dry cloth.",
        "Pat the vinegar rag on the stained part of the shoe for about 5 minutes.",
        "Dry the area with a clean dry towel after 5 minutes.",
        "Do not rinse the area with water.",
        "Use talcum powder or cornstarch to treat a liquid spill.",
        "If you spill some juice or coffee on your shoes, pat the area dry with a clean cloth or paper towel.",
        "Then shake a layer of powder, such as baby powder, talcum powder, or cornstarch onto the stain.",
        "Smooth the layer over the entire stain with your fingers and allow your shoe to sit overnight.",
        "Brush the dried powder off your shoe with a leather or suede brush in the morning.",
        "Avoid using water on your leather or suede shoes.",
        "Water can affect both the color and texture of suede and leather.",
        "Do not wash your leather or suede shoes in a machine, or hand wash them in the sink with detergent and water.",
        "Use white shoe polish on stubborn stains.",
        "After spot-cleaning your shoes, you may notice you still have scuff marks or stains that won’t come out.",
        "If this happens, buy some white shoe polish that is safe for leather or suede, and apply it to these stubborn marks using a clean dry cloth to rub the polish in.",
        "Read and follow the package directions on the shoe polish for best results.",
        "Protect your shoes with a leather or suede sealant.",
        "One of the best ways to avoid needing to clean leather or suede shoes is by protecting them in the first place.",
        "Purchase a spray sealant for leather or suede and apply it by spraying a light coating over your shoes in a ventilated area.",
        "For best results, reapply your sealant every few months.",
        "Be sure to follow the package directions.",
        "Spot-Cleaning Your Flip Flops Carry a magic cleaning sponge with you for quick spot treatments.",
        "Magic cleaning sponges have long been known to work magic when removing scuffs from white walls, floors, and other surfaces.",
        "Luckily, they have that same quality for shoes.",
        "Wet a small corner of the sponge and rub it over the soiled areas of your shoes, just like you would a rubber eraser, to get them bright white again.",
        "Magic cleaning sponges even work on grass stains, which can be some of the toughest stains to remove from shoes.",
        "Use caution using magic cleaning sponges on leather or suede.",
        "Try rubbing it on an inconspicuous part of your shoe to test it.",
        "Try a white art eraser for another convenient option.",
        "Any white eraser used for erasing pencil will work to clean scuffs on many types of white shoes.",
        "Find one at a local craft or office supply store.",
        "Rub it on the dirt marks like you would erase pencil, then blow the shavings away.",
        "Carry an art eraser with you to spot clean your shoes any time, any place.",
        "Use caution using art erasers on leather or suede.",
        "Try rubbing it on an inconspicuous part of your shoe to test it.",
        "Use a portable stain pen to spot-treat on-the-go.",
        "Just like you would use it for immediately removing stains from white clothes, brush the dirt or stain on your flip flop with a stain pen right when you notice it.",
        "Then when you get home, clean the whole shoe with a rag and laundry detergent by putting a few drops of detergent on a wet rag, scrubbing your shoe, and rinsing it in warm water in a sink.",
        "Read the packaging for your stain pen before trying to use it on leather or suede.",
        "It is fine to use on all other materials."
    ]
}