{
    "title": "How to Train for a 5K",
    "url": "https://www.wikihow.com/Train-for-a-5K",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Running",
        "Long Distance Running"
    ],
    "methods": [
        {
            "name": "Make a Game Plan",
            "steps": [
                {
                    "headline": "Make sure you're physically able to run a 5K.",
                    "description": "You don't have to be incredibly physically fit to run a 5K, but you do have to make sure that the training won't pose a risk to your health. Though you can work yourself up to a 5K if you've never run before, you need to make sure that your heart and body are physically strong enough to handle the race training. If you have a history of heart trouble, back pain, or any issues with your feet or the rest of your body, check with a doctor to see if you can run the race. Even if you feel healthy, it's never a bad idea to check in with a doctor about the race just in case."
                },
                {
                    "headline": "Make enough time to train.",
                    "description": "This requires two things: for you to make sure you have enough weeks between your first training day and the race, and to see that you'll actually have enough time in your schedule to train for the race. If you can run at least one mile without stopping, then you can start training 8 weeks before the 5K. If you can't run to the end of your block without getting tired, it will take longer for you to train for a race. Give yourself at least 12 weeks to build up the stamina to run a 5K. Check your schedule to make sure you have time to train. While training for a 5K can require just 20-30 minutes of your time 5 days a week, it may be harder than you think to factor this time into your busy schedule. Select a time slot for your training, leaving room for two days of rest. It's ideal if you can train for the race around the same time each day so your body gets settled into a routine. It's even more ideal if you can train around the time of the actual race you choose, but that may be challenging if the race is in the morning, as most are."
                },
                {
                    "headline": "Sign up for a race.",
                    "description": "Search for races in your area and pick one that appeals to you that is far enough away for you to have enough time to train. Don't pick a race that is too far off in the future unless you want to hold off on your training for a while. Register for the race as early as you can. Once you've registered, you have made a commitment to finish the race! The longer you put off actually registering for the race you've chosen, the less real your goal will seem. Registering early will also usually save you some money."
                },
                {
                    "headline": "Get appropriate running gear.",
                    "description": "Though you don't have to spend hundreds of dollars to get the best running gear, it will be much easier to get through your training runs, as well as the actual race, if you're well equipped. Here are some things to get:\nRunning shoes. Your shoes are the most important form of running equipment. Go to a running store and get help finding the perfect shoes for your feet. If you already have running shoes, the rule of thumb is that you should get a new pair of shoes every time you've run 300–400 miles (480–640 km).Even if you're not sure if you've run that far in your old shoes, if they feel worn-down or just not right, consider getting a new pair of shoes. Running apparel. Invest in some clothes made especially for running, which are any non-cotton synthetic fabrics like DriFit or CoolMax. Cotton clothes will absorb your sweat and will wear you down. Instead, get synthetic running shorts, spandex, tank tops, or t-shirts. Running socks. Get thin, stretchy socks that are made for running. If you run in bulky cotton socks, your feet will be instantly weighed down. A digital watch. If you want to want to time yourself, a watch is your best option. You can also use the clock on your iPod or phone, if you run with those."
                },
                {
                    "headline": "Set a goal.",
                    "description": "This is easy. Do you just want to run the whole race, or do you have a goal time that you want to beat? Having a goal before you start training can help you determine how to approach your training from the very first day. If you just want to run the whole race, you don't have to worry about timing as much during your training. If you're determined to run the 5K in a certain amount of time, then you should work on trimming down your time as you train."
                }
            ]
        },
        {
            "name": "Execute Your Game Plan",
            "steps": [
                {
                    "headline": "Pick your training plan.",
                    "description": "Pick a plan that works best based on your running abilities and goals. If you've never run before, your training routine will be different from the routine of someone who is a champion sprinter and wants to run a 5K in under 25 minutes. Check out online running resources to see which training schedule works for you. Once you pick your plan, you should write it into your planner so you know what you're doing every day for the next eight weeks."
                },
                {
                    "headline": "Allow for two days of rest per week.",
                    "description": "Don't wear yourself out by running and training every day. Pick two days that are far enough apart that fit your schedule. Typical rest days are Mondays and Fridays."
                },
                {
                    "headline": "Make time for cross-training for at least one day of the week.",
                    "description": "You should ideally cross-train one or two days every week. Cross-training is anything from biking or swimming to using elliptical at the gym. Plug two days of cross training into your routine, but take one of them off to rest if you need to."
                },
                {
                    "headline": "Don't forget to stretch before or after your training runs.",
                    "description": "Stretching will maximize your performance and prevent injury."
                },
                {
                    "headline": "Gradually build toward running a 5K at the end of each week.",
                    "description": "Run the same distance for 2 days a week, such as Mondays and Thursdays, and build toward running a slightly longer distance on your long run day, which will be a Saturday or Sunday. Here is what your training should look like if you are able to run one mile before you start training:\nRun one mile on the Tuesday and Thursday of the first week, and 1.5 miles (2.4 km) on the first Saturday of that week. On the second week, run 1.5 miles (2.4 km) on Tuesday and Thursday and then 1.75 miles (2.82 km) on Saturday, and so on. By the seventh week, you should be running 2 or 3 miles (3.2 or 4.8 km) on Tuesdays and Thursdays, and 3 miles (4.8 km) by Saturday. On the last week, you can train during the week but rest on the day before the race instead of doing your long run. Go online to find a way to measure the distance of the streets in your town. You can also run these distances on a treadmill, but running outside is optimal for race training."
                },
                {
                    "headline": "Allow some room for flexibility.",
                    "description": "Though it would be amazing to be able to do what you say you're going to do for 8 or even 12 weeks in a row, it's likely that you'll have to make some adjustments, whether it's because you got a cold, have another obligation to attend to, or if your body just feels too tired to do anything that day. If you have to skip a day, keep up the rest of your schedule. If you miss a cross-training day and you have a running day the next day, just start back up on the running day. You shouldn't have to shift your entire schedule around because you missed one day. If you have to miss a week of training because of a cold or minor injury, don't worry. It's better to take time for your body to recover than to make yourself feel worse. Just try to get back on schedule as soon as you can."
                },
                {
                    "headline": "Stay healthy.",
                    "description": "It's important to maintain your health while you train for a 5K. Your training won't get you very far if you're not trying to be as healthy as you can in all aspects of your life. Though you can still have fun, you should aim to maintain a healthy diet and a regular sleeping schedule. Eat three healthy and balanced meals a day. Have a blend of carbs, proteins, fruits, and vegetables in your diet. Work on going to bed and waking up at the same time so you build up a regular sleeping schedule. Though you can still drink alcohol from time to time, try not to overindulge the nights before your training runs. Don't overdo it. If you feel physically exhausted after all of your training, take a break. You want to reach your physical peak on your race day, not several weeks before."
                }
            ]
        },
        {
            "name": "Prepare for Race Day",
            "steps": [
                {
                    "headline": "Get lots of rest.",
                    "description": "Though you may find it hard to sleep the night before your race, you should try to get to bed as early as you can and wake up with plenty of time to get ready for the race. You should also focus on getting a lot of rest not just the night before the race, but the day before that as well as earlier that week. If you haven't already, you should spend the week before the race waking up around the same time as you will for the race to get your body in gear. Part of being well-rested means having your body feel rested as well. Don't train the day before the race. Take it easy the two days before the race."
                },
                {
                    "headline": "Prepare for the weather.",
                    "description": "Check the forecast the night before so you can lay out the clothes you need right then instead of scrambling to find them in the morning. Remember not to overdress; your body will warm up once you start running. If it's a bit chilly in the morning, wear a sweatshirt to the race and leave it with a friend or at the check-in for your belongings."
                },
                {
                    "headline": "Be familiar with the course.",
                    "description": "Before you start the race, you should not only know where the course is, but you should know what the course looks like. If the course is near you, then you'll be even more confident if you've practiced running along it before race day. Here's what you should know:\nWhat does the course look like? Is it a circle, or a line from one path to another? Are there hills, or is it flat? If you know where the hills are, it'll be easier to prepare for them mentally. Where are the water stations? You should know where they are so you can use them as landmarks. Where are the bathrooms? Though the race will be short, knowing where the bathrooms are can put you at ease."
                },
                {
                    "headline": "Eat the right foods.",
                    "description": "You don't need to carbo-load the night before a 5K race or the morning of the race. Eating too much, or to soon before the race, can leave you feeling stuffed or give you some digestive trouble. Here's what you should and should not eat:\nThe night before a 5K, eat around six or seven o'clock in the evening, so you don't go to bed feeling stuffed. Eat simple carbs like whole grain pasta, bread, or rice, and some protein like chicken and fish. You can eat a little bit of vegetables, which have fiber, for balance, but remember that they will be more likely to upset your digestive system. Eat at least 1.5 to 2 hours before the race. You should be at the finish line feeling neither hungry nor full. If you're hungry, you may run out of energy, and if you're too full, you may feel too sluggish to run at your normal pace. Focus on eating carbs the morning of the race. If you normally have caffeine, have a little bit of coffee or tea, but be aware that it could hurt your digestive system."
                },
                {
                    "headline": "Get in the zone when you get to the race.",
                    "description": "Get to the race at least half an hour early so you have enough time to pick up your bib and other race materials, to use the bathroom, and to get warmed up. Once you get to the race, you should work on getting in the zone, and doing whatever you have to do to have an amazing race day. Here are a few things you can do:\nMaintain a positive attitude. You should be excited to be surrounded by other runners, not intimidated or nervous. Remember that's not really a race. You're not there to win first place, but to try your hardest and improve your fitness. Listen to your favorite \"pump up\" music. If you love running to music, pick your favorite jams and bob to them at the starting line. Jog a little bit to get yourself in the grove. Don't sprint a mile before the race. Just jog fifty feet from time to time to get your body active and get your limbs warmed up. Stretch. Don't forget to stretch before the big race. Do the stretches you've been working on throughout your training."
                },
                {
                    "headline": "Do what you've been doing — just kick it up a notch.",
                    "description": "Remember that the 5K is the last extension of your training practice. You shouldn't try to sprint your hardest at the beginning because it feels like everyone is running fast, and you shouldn't run much slower than you normally do because you're afraid of running out of energy. Check your watch from time to time to make sure you're relatively on schedule. Race day will fill you with adrenaline, so don't be surprised if you're going a bit faster than usual. That's okay as long as you don't feel exhausted after the first five minutes. Stop for water breaks. Use this time to slow down for a second and get hydrated. You don't have to stop at every station if you're really feeling pumped, but try to make a habit of it. Don't forget to have fun! Don't huff and puff through your first 5K. It's hard work, but you should have a big smile on your face when you cross that finish line!"
                }
            ]
        }
    ],
    "tyn": [
        "Running shoes",
        "Running gear",
        "Stopwatch",
        "Race registration",
        "Training schedule"
    ],
    "text": " Make a Game Plan Make sure you're physically able to run a 5K. You don't have to be incredibly physically fit to run a 5K, but you do have to make sure that the training won't pose a risk to your health. Though you can work yourself up to a 5K if you've never run before, you need to make sure that your heart and body are physically strong enough to handle the race training. If you have a history of heart trouble, back pain, or any issues with your feet or the rest of your body, check with a doctor to see if you can run the race. Even if you feel healthy, it's never a bad idea to check in with a doctor about the race just in case. Make enough time to train. This requires two things: for you to make sure you have enough weeks between your first training day and the race, and to see that you'll actually have enough time in your schedule to train for the race. If you can run at least one mile without stopping, then you can start training 8 weeks before the 5K. If you can't run to the end of your block without getting tired, it will take longer for you to train for a race. Give yourself at least 12 weeks to build up the stamina to run a 5K. Check your schedule to make sure you have time to train. While training for a 5K can require just 20-30 minutes of your time 5 days a week, it may be harder than you think to factor this time into your busy schedule. Select a time slot for your training, leaving room for two days of rest. It's ideal if you can train for the race around the same time each day so your body gets settled into a routine. It's even more ideal if you can train around the time of the actual race you choose, but that may be challenging if the race is in the morning, as most are. Sign up for a race. Search for races in your area and pick one that appeals to you that is far enough away for you to have enough time to train. Don't pick a race that is too far off in the future unless you want to hold off on your training for a while. Register for the race as early as you can. Once you've registered, you have made a commitment to finish the race! The longer you put off actually registering for the race you've chosen, the less real your goal will seem. Registering early will also usually save you some money. Get appropriate running gear. Though you don't have to spend hundreds of dollars to get the best running gear, it will be much easier to get through your training runs, as well as the actual race, if you're well equipped. Here are some things to get:\nRunning shoes. Your shoes are the most important form of running equipment. Go to a running store and get help finding the perfect shoes for your feet. If you already have running shoes, the rule of thumb is that you should get a new pair of shoes every time you've run 300–400 miles (480–640 km).Even if you're not sure if you've run that far in your old shoes, if they feel worn-down or just not right, consider getting a new pair of shoes. Running apparel. Invest in some clothes made especially for running, which are any non-cotton synthetic fabrics like DriFit or CoolMax. Cotton clothes will absorb your sweat and will wear you down. Instead, get synthetic running shorts, spandex, tank tops, or t-shirts. Running socks. Get thin, stretchy socks that are made for running. If you run in bulky cotton socks, your feet will be instantly weighed down. A digital watch. If you want to want to time yourself, a watch is your best option. You can also use the clock on your iPod or phone, if you run with those. Set a goal. This is easy. Do you just want to run the whole race, or do you have a goal time that you want to beat? Having a goal before you start training can help you determine how to approach your training from the very first day. If you just want to run the whole race, you don't have to worry about timing as much during your training. If you're determined to run the 5K in a certain amount of time, then you should work on trimming down your time as you train. Execute Your Game Plan Pick your training plan. Pick a plan that works best based on your running abilities and goals. If you've never run before, your training routine will be different from the routine of someone who is a champion sprinter and wants to run a 5K in under 25 minutes. Check out online running resources to see which training schedule works for you. Once you pick your plan, you should write it into your planner so you know what you're doing every day for the next eight weeks. Allow for two days of rest per week. Don't wear yourself out by running and training every day. Pick two days that are far enough apart that fit your schedule. Typical rest days are Mondays and Fridays. Make time for cross-training for at least one day of the week. You should ideally cross-train one or two days every week. Cross-training is anything from biking or swimming to using elliptical at the gym. Plug two days of cross training into your routine, but take one of them off to rest if you need to. Don't forget to stretch before or after your training runs. Stretching will maximize your performance and prevent injury. Gradually build toward running a 5K at the end of each week. Run the same distance for 2 days a week, such as Mondays and Thursdays, and build toward running a slightly longer distance on your long run day, which will be a Saturday or Sunday. Here is what your training should look like if you are able to run one mile before you start training:\nRun one mile on the Tuesday and Thursday of the first week, and 1.5 miles (2.4 km) on the first Saturday of that week. On the second week, run 1.5 miles (2.4 km) on Tuesday and Thursday and then 1.75 miles (2.82 km) on Saturday, and so on. By the seventh week, you should be running 2 or 3 miles (3.2 or 4.8 km) on Tuesdays and Thursdays, and 3 miles (4.8 km) by Saturday. On the last week, you can train during the week but rest on the day before the race instead of doing your long run. Go online to find a way to measure the distance of the streets in your town. You can also run these distances on a treadmill, but running outside is optimal for race training. Allow some room for flexibility. Though it would be amazing to be able to do what you say you're going to do for 8 or even 12 weeks in a row, it's likely that you'll have to make some adjustments, whether it's because you got a cold, have another obligation to attend to, or if your body just feels too tired to do anything that day. If you have to skip a day, keep up the rest of your schedule. If you miss a cross-training day and you have a running day the next day, just start back up on the running day. You shouldn't have to shift your entire schedule around because you missed one day. If you have to miss a week of training because of a cold or minor injury, don't worry. It's better to take time for your body to recover than to make yourself feel worse. Just try to get back on schedule as soon as you can. Stay healthy. It's important to maintain your health while you train for a 5K. Your training won't get you very far if you're not trying to be as healthy as you can in all aspects of your life. Though you can still have fun, you should aim to maintain a healthy diet and a regular sleeping schedule. Eat three healthy and balanced meals a day. Have a blend of carbs, proteins, fruits, and vegetables in your diet. Work on going to bed and waking up at the same time so you build up a regular sleeping schedule. Though you can still drink alcohol from time to time, try not to overindulge the nights before your training runs. Don't overdo it. If you feel physically exhausted after all of your training, take a break. You want to reach your physical peak on your race day, not several weeks before. Prepare for Race Day Get lots of rest. Though you may find it hard to sleep the night before your race, you should try to get to bed as early as you can and wake up with plenty of time to get ready for the race. You should also focus on getting a lot of rest not just the night before the race, but the day before that as well as earlier that week. If you haven't already, you should spend the week before the race waking up around the same time as you will for the race to get your body in gear. Part of being well-rested means having your body feel rested as well. Don't train the day before the race. Take it easy the two days before the race. Prepare for the weather. Check the forecast the night before so you can lay out the clothes you need right then instead of scrambling to find them in the morning. Remember not to overdress; your body will warm up once you start running. If it's a bit chilly in the morning, wear a sweatshirt to the race and leave it with a friend or at the check-in for your belongings. Be familiar with the course. Before you start the race, you should not only know where the course is, but you should know what the course looks like. If the course is near you, then you'll be even more confident if you've practiced running along it before race day. Here's what you should know:\nWhat does the course look like? Is it a circle, or a line from one path to another? Are there hills, or is it flat? If you know where the hills are, it'll be easier to prepare for them mentally. Where are the water stations? You should know where they are so you can use them as landmarks. Where are the bathrooms? Though the race will be short, knowing where the bathrooms are can put you at ease. Eat the right foods. You don't need to carbo-load the night before a 5K race or the morning of the race. Eating too much, or to soon before the race, can leave you feeling stuffed or give you some digestive trouble. Here's what you should and should not eat:\nThe night before a 5K, eat around six or seven o'clock in the evening, so you don't go to bed feeling stuffed. Eat simple carbs like whole grain pasta, bread, or rice, and some protein like chicken and fish. You can eat a little bit of vegetables, which have fiber, for balance, but remember that they will be more likely to upset your digestive system. Eat at least 1.5 to 2 hours before the race. You should be at the finish line feeling neither hungry nor full. If you're hungry, you may run out of energy, and if you're too full, you may feel too sluggish to run at your normal pace. Focus on eating carbs the morning of the race. If you normally have caffeine, have a little bit of coffee or tea, but be aware that it could hurt your digestive system. Get in the zone when you get to the race. Get to the race at least half an hour early so you have enough time to pick up your bib and other race materials, to use the bathroom, and to get warmed up. Once you get to the race, you should work on getting in the zone, and doing whatever you have to do to have an amazing race day. Here are a few things you can do:\nMaintain a positive attitude. You should be excited to be surrounded by other runners, not intimidated or nervous. Remember that's not really a race. You're not there to win first place, but to try your hardest and improve your fitness. Listen to your favorite \"pump up\" music. If you love running to music, pick your favorite jams and bob to them at the starting line. Jog a little bit to get yourself in the grove. Don't sprint a mile before the race. Just jog fifty feet from time to time to get your body active and get your limbs warmed up. Stretch. Don't forget to stretch before the big race. Do the stretches you've been working on throughout your training. Do what you've been doing — just kick it up a notch. Remember that the 5K is the last extension of your training practice. You shouldn't try to sprint your hardest at the beginning because it feels like everyone is running fast, and you shouldn't run much slower than you normally do because you're afraid of running out of energy. Check your watch from time to time to make sure you're relatively on schedule. Race day will fill you with adrenaline, so don't be surprised if you're going a bit faster than usual. That's okay as long as you don't feel exhausted after the first five minutes. Stop for water breaks. Use this time to slow down for a second and get hydrated. You don't have to stop at every station if you're really feeling pumped, but try to make a habit of it. Don't forget to have fun! Don't huff and puff through your first 5K. It's hard work, but you should have a big smile on your face when you cross that finish line!",
    "sentences": [
        " Make a Game Plan Make sure you're physically able to run a 5K.",
        "You don't have to be incredibly physically fit to run a 5K, but you do have to make sure that the training won't pose a risk to your health.",
        "Though you can work yourself up to a 5K if you've never run before, you need to make sure that your heart and body are physically strong enough to handle the race training.",
        "If you have a history of heart trouble, back pain, or any issues with your feet or the rest of your body, check with a doctor to see if you can run the race.",
        "Even if you feel healthy, it's never a bad idea to check in with a doctor about the race just in case.",
        "Make enough time to train.",
        "This requires two things: for you to make sure you have enough weeks between your first training day and the race, and to see that you'll actually have enough time in your schedule to train for the race.",
        "If you can run at least one mile without stopping, then you can start training 8 weeks before the 5K.",
        "If you can't run to the end of your block without getting tired, it will take longer for you to train for a race.",
        "Give yourself at least 12 weeks to build up the stamina to run a 5K.",
        "Check your schedule to make sure you have time to train.",
        "While training for a 5K can require just 20-30 minutes of your time 5 days a week, it may be harder than you think to factor this time into your busy schedule.",
        "Select a time slot for your training, leaving room for two days of rest.",
        "It's ideal if you can train for the race around the same time each day so your body gets settled into a routine.",
        "It's even more ideal if you can train around the time of the actual race you choose, but that may be challenging if the race is in the morning, as most are.",
        "Sign up for a race.",
        "Search for races in your area and pick one that appeals to you that is far enough away for you to have enough time to train.",
        "Don't pick a race that is too far off in the future unless you want to hold off on your training for a while.",
        "Register for the race as early as you can.",
        "Once you've registered, you have made a commitment to finish the race!",
        "The longer you put off actually registering for the race you've chosen, the less real your goal will seem.",
        "Registering early will also usually save you some money.",
        "Get appropriate running gear.",
        "Though you don't have to spend hundreds of dollars to get the best running gear, it will be much easier to get through your training runs, as well as the actual race, if you're well equipped.",
        "Here are some things to get:\nRunning shoes.",
        "Your shoes are the most important form of running equipment.",
        "Go to a running store and get help finding the perfect shoes for your feet.",
        "If you already have running shoes, the rule of thumb is that you should get a new pair of shoes every time you've run 300–400 miles (480–640 km).Even if you're not sure if you've run that far in your old shoes, if they feel worn-down or just not right, consider getting a new pair of shoes.",
        "Running apparel.",
        "Invest in some clothes made especially for running, which are any non-cotton synthetic fabrics like DriFit or CoolMax.",
        "Cotton clothes will absorb your sweat and will wear you down.",
        "Instead, get synthetic running shorts, spandex, tank tops, or t-shirts.",
        "Running socks.",
        "Get thin, stretchy socks that are made for running.",
        "If you run in bulky cotton socks, your feet will be instantly weighed down.",
        "A digital watch.",
        "If you want to want to time yourself, a watch is your best option.",
        "You can also use the clock on your iPod or phone, if you run with those.",
        "Set a goal.",
        "This is easy.",
        "Do you just want to run the whole race, or do you have a goal time that you want to beat?",
        "Having a goal before you start training can help you determine how to approach your training from the very first day.",
        "If you just want to run the whole race, you don't have to worry about timing as much during your training.",
        "If you're determined to run the 5K in a certain amount of time, then you should work on trimming down your time as you train.",
        "Execute Your Game Plan Pick your training plan.",
        "Pick a plan that works best based on your running abilities and goals.",
        "If you've never run before, your training routine will be different from the routine of someone who is a champion sprinter and wants to run a 5K in under 25 minutes.",
        "Check out online running resources to see which training schedule works for you.",
        "Once you pick your plan, you should write it into your planner so you know what you're doing every day for the next eight weeks.",
        "Allow for two days of rest per week.",
        "Don't wear yourself out by running and training every day.",
        "Pick two days that are far enough apart that fit your schedule.",
        "Typical rest days are Mondays and Fridays.",
        "Make time for cross-training for at least one day of the week.",
        "You should ideally cross-train one or two days every week.",
        "Cross-training is anything from biking or swimming to using elliptical at the gym.",
        "Plug two days of cross training into your routine, but take one of them off to rest if you need to.",
        "Don't forget to stretch before or after your training runs.",
        "Stretching will maximize your performance and prevent injury.",
        "Gradually build toward running a 5K at the end of each week.",
        "Run the same distance for 2 days a week, such as Mondays and Thursdays, and build toward running a slightly longer distance on your long run day, which will be a Saturday or Sunday.",
        "Here is what your training should look like if you are able to run one mile before you start training:\nRun one mile on the Tuesday and Thursday of the first week, and 1.5 miles (2.4 km) on the first Saturday of that week.",
        "On the second week, run 1.5 miles (2.4 km) on Tuesday and Thursday and then 1.75 miles (2.82 km) on Saturday, and so on.",
        "By the seventh week, you should be running 2 or 3 miles (3.2 or 4.8 km) on Tuesdays and Thursdays, and 3 miles (4.8 km) by Saturday.",
        "On the last week, you can train during the week but rest on the day before the race instead of doing your long run.",
        "Go online to find a way to measure the distance of the streets in your town.",
        "You can also run these distances on a treadmill, but running outside is optimal for race training.",
        "Allow some room for flexibility.",
        "Though it would be amazing to be able to do what you say you're going to do for 8 or even 12 weeks in a row, it's likely that you'll have to make some adjustments, whether it's because you got a cold, have another obligation to attend to, or if your body just feels too tired to do anything that day.",
        "If you have to skip a day, keep up the rest of your schedule.",
        "If you miss a cross-training day and you have a running day the next day, just start back up on the running day.",
        "You shouldn't have to shift your entire schedule around because you missed one day.",
        "If you have to miss a week of training because of a cold or minor injury, don't worry.",
        "It's better to take time for your body to recover than to make yourself feel worse.",
        "Just try to get back on schedule as soon as you can.",
        "Stay healthy.",
        "It's important to maintain your health while you train for a 5K.",
        "Your training won't get you very far if you're not trying to be as healthy as you can in all aspects of your life.",
        "Though you can still have fun, you should aim to maintain a healthy diet and a regular sleeping schedule.",
        "Eat three healthy and balanced meals a day.",
        "Have a blend of carbs, proteins, fruits, and vegetables in your diet.",
        "Work on going to bed and waking up at the same time so you build up a regular sleeping schedule.",
        "Though you can still drink alcohol from time to time, try not to overindulge the nights before your training runs.",
        "Don't overdo it.",
        "If you feel physically exhausted after all of your training, take a break.",
        "You want to reach your physical peak on your race day, not several weeks before.",
        "Prepare for Race Day Get lots of rest.",
        "Though you may find it hard to sleep the night before your race, you should try to get to bed as early as you can and wake up with plenty of time to get ready for the race.",
        "You should also focus on getting a lot of rest not just the night before the race, but the day before that as well as earlier that week.",
        "If you haven't already, you should spend the week before the race waking up around the same time as you will for the race to get your body in gear.",
        "Part of being well-rested means having your body feel rested as well.",
        "Don't train the day before the race.",
        "Take it easy the two days before the race.",
        "Prepare for the weather.",
        "Check the forecast the night before so you can lay out the clothes you need right then instead of scrambling to find them in the morning.",
        "Remember not to overdress; your body will warm up once you start running.",
        "If it's a bit chilly in the morning, wear a sweatshirt to the race and leave it with a friend or at the check-in for your belongings.",
        "Be familiar with the course.",
        "Before you start the race, you should not only know where the course is, but you should know what the course looks like.",
        "If the course is near you, then you'll be even more confident if you've practiced running along it before race day.",
        "Here's what you should know:\nWhat does the course look like?",
        "Is it a circle, or a line from one path to another?",
        "Are there hills, or is it flat?",
        "If you know where the hills are, it'll be easier to prepare for them mentally.",
        "Where are the water stations?",
        "You should know where they are so you can use them as landmarks.",
        "Where are the bathrooms?",
        "Though the race will be short, knowing where the bathrooms are can put you at ease.",
        "Eat the right foods.",
        "You don't need to carbo-load the night before a 5K race or the morning of the race.",
        "Eating too much, or to soon before the race, can leave you feeling stuffed or give you some digestive trouble.",
        "Here's what you should and should not eat:\nThe night before a 5K, eat around six or seven o'clock in the evening, so you don't go to bed feeling stuffed.",
        "Eat simple carbs like whole grain pasta, bread, or rice, and some protein like chicken and fish.",
        "You can eat a little bit of vegetables, which have fiber, for balance, but remember that they will be more likely to upset your digestive system.",
        "Eat at least 1.5 to 2 hours before the race.",
        "You should be at the finish line feeling neither hungry nor full.",
        "If you're hungry, you may run out of energy, and if you're too full, you may feel too sluggish to run at your normal pace.",
        "Focus on eating carbs the morning of the race.",
        "If you normally have caffeine, have a little bit of coffee or tea, but be aware that it could hurt your digestive system.",
        "Get in the zone when you get to the race.",
        "Get to the race at least half an hour early so you have enough time to pick up your bib and other race materials, to use the bathroom, and to get warmed up.",
        "Once you get to the race, you should work on getting in the zone, and doing whatever you have to do to have an amazing race day.",
        "Here are a few things you can do:\nMaintain a positive attitude.",
        "You should be excited to be surrounded by other runners, not intimidated or nervous.",
        "Remember that's not really a race.",
        "You're not there to win first place, but to try your hardest and improve your fitness.",
        "Listen to your favorite \"pump up\" music.",
        "If you love running to music, pick your favorite jams and bob to them at the starting line.",
        "Jog a little bit to get yourself in the grove.",
        "Don't sprint a mile before the race.",
        "Just jog fifty feet from time to time to get your body active and get your limbs warmed up.",
        "Stretch.",
        "Don't forget to stretch before the big race.",
        "Do the stretches you've been working on throughout your training.",
        "Do what you've been doing — just kick it up a notch.",
        "Remember that the 5K is the last extension of your training practice.",
        "You shouldn't try to sprint your hardest at the beginning because it feels like everyone is running fast, and you shouldn't run much slower than you normally do because you're afraid of running out of energy.",
        "Check your watch from time to time to make sure you're relatively on schedule.",
        "Race day will fill you with adrenaline, so don't be surprised if you're going a bit faster than usual.",
        "That's okay as long as you don't feel exhausted after the first five minutes.",
        "Stop for water breaks.",
        "Use this time to slow down for a second and get hydrated.",
        "You don't have to stop at every station if you're really feeling pumped, but try to make a habit of it.",
        "Don't forget to have fun!",
        "Don't huff and puff through your first 5K.",
        "It's hard work, but you should have a big smile on your face when you cross that finish line!"
    ]
}