{
    "title": "How to Refinish Kitchen Cabinets",
    "url": "https://www.wikihow.com/Refinish-Kitchen-Cabinets",
    "category_hierarchy": [
        "Home and Garden",
        "Furniture",
        "Cabinets and Cupboards"
    ],
    "parts": [
        {
            "name": "Prepping the Surface",
            "steps": [
                {
                    "headline": "Empty the cabinets completely.",
                    "description": "It is much easier to work inside them, prep them, remove them if necessary, and of course, paint them, without loose stuff inside getting in the way."
                },
                {
                    "headline": "Remove the cabinet doors and shelves.",
                    "description": "Most shelves simply lift off of pegs or supports; some may need to be unscrewed or pried off their supports. If the screws are caked with old paint, clean out the channel with the tip of a knife or small screwdriver. Remove the screws, being careful not to slip and damage the channel, making it impossible to unscrew. Lay out the cabinet doors in a grid on the floor so it's easy to tell their proper places. This is also a good chance to reface cabinet doors that need an update."
                },
                {
                    "headline": "Clean the cabinets thoroughly.",
                    "description": "Any grease remaining on the surfaces will interfere with refinishing. TSP is the preferred product for this job, as it will clean and remove heavy grease deposits with a strong enough concentration to etch the paint so that it is ready to be primed. If you'd prefer an environmentally friendly alternative, try Simple Green. Lightly sand any rough areas of bubbled or peeling paint or varnish, then sand entire surfaces until they are smooth and even. Take your time with this step—the results will be well worth the extra effort. When done sanding, wipe the wood with a tack cloth (to remove all dust particles) and let dry. If the finish you are working with is an oil base product, you may dampen a cloth with mineral spirits or paint thinner, rather than water, which will allow it to dry much more rapidly."
                },
                {
                    "headline": "Clean the cabinet hardware.",
                    "description": "Unless you're replacing the hardware, cleaning it will help give your cabinets a fresher look. Soak the hardware in a soapy water solution for 30 minutes, scrub lightly with a soft brush, rinse, let dry, and apply polish."
                },
                {
                    "headline": "Strip painted hardware.",
                    "description": "Sometimes, in their haste for a nifty new kitchen, people would just slop a coat of paint over everything in sight, including the hardware. You have wisely chosen to restore that hardware to it's old glory. Put the hardware in a crockpot, and cover with water. Add 2 tablespoons of liquid laundry detergent, set the heat to medium, and set the timer to 8 hours or longer. When the time's up, carefully remove the hardware, and peel off the paint. If you're in a hurry, a solution of methylene chloride will strip the paint much faster, but it may also strip other finishes. DON'T put this in a crockpot. Apply directly to the hardware in a well-ventilated area while wearing neoprene safety gloves and eye protection. Leave for 10 minutes, then scrape the gel with a plastic putty knife. Immediately clean off the hardware with a stiff toothbrush—otherwise the paint will start to harden again. Buff with a beeswax polish to protect the surface, and repeat every 6 months. Do it in spring and summer, when you change your smoke alarm batteries!"
                },
                {
                    "headline": "Strip the cabinets (optional).",
                    "description": "If you want to take the cabinets back to the original wood, apply a clear varnish or polyurethane finish or stain previously painted cabinets, you will have to strip all the paint off the cabinets using strong chemicals, followed by sanding. This is a much bigger project and will take more than a long weekend. Liquid strippers work best, but look for gel or semi-paste types because they won't drip as much when used on vertical surfaces. In order to choose the correct stripper, you also need to know what kind of finish you already have on your cabinets. Choose an obscure spot on the cabinets to put a few drops of the following substances:\nTurpentine or mineral spirits will dissolve a wax finish. Denatured alcohol dissolves a shellac finish and latex paint. Lacquer thinner dissolves a lacquer, polyurethane, or shellac finish. Xylene or 'Xylol' will dissolve a water-based finish."
                },
                {
                    "headline": "Fill dents, chips and nicks with wood putty.",
                    "description": "Sand the putty smooth after it dries. Wipe the wood with a tack cloth (to remove all dust particles) and let dry."
                }
            ]
        },
        {
            "name": "Priming and Painting",
            "steps": [
                {
                    "headline": "Prime the cabinets.",
                    "description": "If you plan to use paint to refinish your cabinets, they will need to be primed first. Primers are paint products formulated allow new paint to bond with the old paint below it. The primer seals the wood, covering any blemishes, stains, knots, or anything else whose color might leech into the final paint coat. Here is a quick primer on primer:\n\nDo you need to prime? If you are painting an unfinished surface, whether wood, drywall, concrete, or metal, needs to be primed before it is painted. Pick the right primer. Many primers today will work on anything—ask the pros at the paint store what they recommend. A good rule of thumb is to match the primer with the paint: a shellac primer over latex paint, and an oil primer over oil paint. An exception to this would be applying water-based products over oil-based. This will not work. Painting oil over latex? The question has been asked 1,000 times, whether it's ok to paint latex over oil, or oil over latex. The answer depends on who you ask, but the bottom line is this: properly prepped, you can paint anything over anything. Prepare your surface properly by cleaning and sanding and cleaning again, then apply a primer.The key is making sure that the surface that is being primed doesn't have a gloss, as paint—especially latex, will not stick to a glossy base, and  you'll have a much harder job to do in fairly short order. Read the label of the bonding primer carefully. Check to see if it will bond latex to oil."
                },
                {
                    "headline": "Paint your cabinets.",
                    "description": "This is the big moment, when you transform your kitchen from dull and dingy to hip and modern. For the best finish, use a sprayer. It will give you a smooth, glossy, even appearance. The biggest drawback is that you have to mask everything in sight that is not going to be painted, as aerosol paint spray will get everywhere. Use a brush. Using a high-quality brush, apply new paint (or varnish) within the time limit specified in the directions. Always brush in one direction, and don't lay it on too thick. 2 light coats is much better than one heavy layer. Oil based paints tend to yellow over the years. Paint additives like Floetrol can create better flow and reduce brush strokes in oil paints. If you are re-varnishing kitchen or bathroom cabinets, consider a marine varnish which is more water repellent."
                }
            ]
        }
    ],
    "tyn": [
        "Degreaser & rags for cleaning",
        "Paint brushes or spray equipment",
        "Paint or varnish/polyurethane",
        "Bonding agent",
        "Cup hooks",
        "New hardware or old hardware cleaned for make-over",
        "Newspaper or drop cloths",
        "Painter's tape",
        "Wood putty",
        "Sandpaper in various grits",
        "Rags",
        "Paint thinner/solvents described in the article",
        "Tack cloth",
        "Old clothing",
        "Painter's plastic",
        "Masks"
    ],
    "text": " Prepping the Surface Empty the cabinets completely. It is much easier to work inside them, prep them, remove them if necessary, and of course, paint them, without loose stuff inside getting in the way. Remove the cabinet doors and shelves. Most shelves simply lift off of pegs or supports; some may need to be unscrewed or pried off their supports. If the screws are caked with old paint, clean out the channel with the tip of a knife or small screwdriver. Remove the screws, being careful not to slip and damage the channel, making it impossible to unscrew. Lay out the cabinet doors in a grid on the floor so it's easy to tell their proper places. This is also a good chance to reface cabinet doors that need an update. Clean the cabinets thoroughly. Any grease remaining on the surfaces will interfere with refinishing. TSP is the preferred product for this job, as it will clean and remove heavy grease deposits with a strong enough concentration to etch the paint so that it is ready to be primed. If you'd prefer an environmentally friendly alternative, try Simple Green. Lightly sand any rough areas of bubbled or peeling paint or varnish, then sand entire surfaces until they are smooth and even. Take your time with this step—the results will be well worth the extra effort. When done sanding, wipe the wood with a tack cloth (to remove all dust particles) and let dry. If the finish you are working with is an oil base product, you may dampen a cloth with mineral spirits or paint thinner, rather than water, which will allow it to dry much more rapidly. Clean the cabinet hardware. Unless you're replacing the hardware, cleaning it will help give your cabinets a fresher look. Soak the hardware in a soapy water solution for 30 minutes, scrub lightly with a soft brush, rinse, let dry, and apply polish. Strip painted hardware. Sometimes, in their haste for a nifty new kitchen, people would just slop a coat of paint over everything in sight, including the hardware. You have wisely chosen to restore that hardware to it's old glory. Put the hardware in a crockpot, and cover with water. Add 2 tablespoons of liquid laundry detergent, set the heat to medium, and set the timer to 8 hours or longer. When the time's up, carefully remove the hardware, and peel off the paint. If you're in a hurry, a solution of methylene chloride will strip the paint much faster, but it may also strip other finishes. DON'T put this in a crockpot. Apply directly to the hardware in a well-ventilated area while wearing neoprene safety gloves and eye protection. Leave for 10 minutes, then scrape the gel with a plastic putty knife. Immediately clean off the hardware with a stiff toothbrush—otherwise the paint will start to harden again. Buff with a beeswax polish to protect the surface, and repeat every 6 months. Do it in spring and summer, when you change your smoke alarm batteries! Strip the cabinets (optional). If you want to take the cabinets back to the original wood, apply a clear varnish or polyurethane finish or stain previously painted cabinets, you will have to strip all the paint off the cabinets using strong chemicals, followed by sanding. This is a much bigger project and will take more than a long weekend. Liquid strippers work best, but look for gel or semi-paste types because they won't drip as much when used on vertical surfaces. In order to choose the correct stripper, you also need to know what kind of finish you already have on your cabinets. Choose an obscure spot on the cabinets to put a few drops of the following substances:\nTurpentine or mineral spirits will dissolve a wax finish. Denatured alcohol dissolves a shellac finish and latex paint. Lacquer thinner dissolves a lacquer, polyurethane, or shellac finish. Xylene or 'Xylol' will dissolve a water-based finish. Fill dents, chips and nicks with wood putty. Sand the putty smooth after it dries. Wipe the wood with a tack cloth (to remove all dust particles) and let dry. Priming and Painting Prime the cabinets. If you plan to use paint to refinish your cabinets, they will need to be primed first. Primers are paint products formulated allow new paint to bond with the old paint below it. The primer seals the wood, covering any blemishes, stains, knots, or anything else whose color might leech into the final paint coat. Here is a quick primer on primer:\n\nDo you need to prime? If you are painting an unfinished surface, whether wood, drywall, concrete, or metal, needs to be primed before it is painted. Pick the right primer. Many primers today will work on anything—ask the pros at the paint store what they recommend. A good rule of thumb is to match the primer with the paint: a shellac primer over latex paint, and an oil primer over oil paint. An exception to this would be applying water-based products over oil-based. This will not work. Painting oil over latex? The question has been asked 1,000 times, whether it's ok to paint latex over oil, or oil over latex. The answer depends on who you ask, but the bottom line is this: properly prepped, you can paint anything over anything. Prepare your surface properly by cleaning and sanding and cleaning again, then apply a primer.The key is making sure that the surface that is being primed doesn't have a gloss, as paint—especially latex, will not stick to a glossy base, and  you'll have a much harder job to do in fairly short order. Read the label of the bonding primer carefully. Check to see if it will bond latex to oil. Paint your cabinets. This is the big moment, when you transform your kitchen from dull and dingy to hip and modern. For the best finish, use a sprayer. It will give you a smooth, glossy, even appearance. The biggest drawback is that you have to mask everything in sight that is not going to be painted, as aerosol paint spray will get everywhere. Use a brush. Using a high-quality brush, apply new paint (or varnish) within the time limit specified in the directions. Always brush in one direction, and don't lay it on too thick. 2 light coats is much better than one heavy layer. Oil based paints tend to yellow over the years. Paint additives like Floetrol can create better flow and reduce brush strokes in oil paints. If you are re-varnishing kitchen or bathroom cabinets, consider a marine varnish which is more water repellent.",
    "sentences": [
        " Prepping the Surface Empty the cabinets completely.",
        "It is much easier to work inside them, prep them, remove them if necessary, and of course, paint them, without loose stuff inside getting in the way.",
        "Remove the cabinet doors and shelves.",
        "Most shelves simply lift off of pegs or supports; some may need to be unscrewed or pried off their supports.",
        "If the screws are caked with old paint, clean out the channel with the tip of a knife or small screwdriver.",
        "Remove the screws, being careful not to slip and damage the channel, making it impossible to unscrew.",
        "Lay out the cabinet doors in a grid on the floor so it's easy to tell their proper places.",
        "This is also a good chance to reface cabinet doors that need an update.",
        "Clean the cabinets thoroughly.",
        "Any grease remaining on the surfaces will interfere with refinishing.",
        "TSP is the preferred product for this job, as it will clean and remove heavy grease deposits with a strong enough concentration to etch the paint so that it is ready to be primed.",
        "If you'd prefer an environmentally friendly alternative, try Simple Green.",
        "Lightly sand any rough areas of bubbled or peeling paint or varnish, then sand entire surfaces until they are smooth and even.",
        "Take your time with this step—the results will be well worth the extra effort.",
        "When done sanding, wipe the wood with a tack cloth (to remove all dust particles) and let dry.",
        "If the finish you are working with is an oil base product, you may dampen a cloth with mineral spirits or paint thinner, rather than water, which will allow it to dry much more rapidly.",
        "Clean the cabinet hardware.",
        "Unless you're replacing the hardware, cleaning it will help give your cabinets a fresher look.",
        "Soak the hardware in a soapy water solution for 30 minutes, scrub lightly with a soft brush, rinse, let dry, and apply polish.",
        "Strip painted hardware.",
        "Sometimes, in their haste for a nifty new kitchen, people would just slop a coat of paint over everything in sight, including the hardware.",
        "You have wisely chosen to restore that hardware to it's old glory.",
        "Put the hardware in a crockpot, and cover with water.",
        "Add 2 tablespoons of liquid laundry detergent, set the heat to medium, and set the timer to 8 hours or longer.",
        "When the time's up, carefully remove the hardware, and peel off the paint.",
        "If you're in a hurry, a solution of methylene chloride will strip the paint much faster, but it may also strip other finishes.",
        "DON'T put this in a crockpot.",
        "Apply directly to the hardware in a well-ventilated area while wearing neoprene safety gloves and eye protection.",
        "Leave for 10 minutes, then scrape the gel with a plastic putty knife.",
        "Immediately clean off the hardware with a stiff toothbrush—otherwise the paint will start to harden again.",
        "Buff with a beeswax polish to protect the surface, and repeat every 6 months.",
        "Do it in spring and summer, when you change your smoke alarm batteries!",
        "Strip the cabinets (optional).",
        "If you want to take the cabinets back to the original wood, apply a clear varnish or polyurethane finish or stain previously painted cabinets, you will have to strip all the paint off the cabinets using strong chemicals, followed by sanding.",
        "This is a much bigger project and will take more than a long weekend.",
        "Liquid strippers work best, but look for gel or semi-paste types because they won't drip as much when used on vertical surfaces.",
        "In order to choose the correct stripper, you also need to know what kind of finish you already have on your cabinets.",
        "Choose an obscure spot on the cabinets to put a few drops of the following substances:\nTurpentine or mineral spirits will dissolve a wax finish.",
        "Denatured alcohol dissolves a shellac finish and latex paint.",
        "Lacquer thinner dissolves a lacquer, polyurethane, or shellac finish.",
        "Xylene or 'Xylol' will dissolve a water-based finish.",
        "Fill dents, chips and nicks with wood putty.",
        "Sand the putty smooth after it dries.",
        "Wipe the wood with a tack cloth (to remove all dust particles) and let dry.",
        "Priming and Painting Prime the cabinets.",
        "If you plan to use paint to refinish your cabinets, they will need to be primed first.",
        "Primers are paint products formulated allow new paint to bond with the old paint below it.",
        "The primer seals the wood, covering any blemishes, stains, knots, or anything else whose color might leech into the final paint coat.",
        "Here is a quick primer on primer:\n\nDo you need to prime?",
        "If you are painting an unfinished surface, whether wood, drywall, concrete, or metal, needs to be primed before it is painted.",
        "Pick the right primer.",
        "Many primers today will work on anything—ask the pros at the paint store what they recommend.",
        "A good rule of thumb is to match the primer with the paint: a shellac primer over latex paint, and an oil primer over oil paint.",
        "An exception to this would be applying water-based products over oil-based.",
        "This will not work.",
        "Painting oil over latex?",
        "The question has been asked 1,000 times, whether it's ok to paint latex over oil, or oil over latex.",
        "The answer depends on who you ask, but the bottom line is this: properly prepped, you can paint anything over anything.",
        "Prepare your surface properly by cleaning and sanding and cleaning again, then apply a primer.The key is making sure that the surface that is being primed doesn't have a gloss, as paint—especially latex, will not stick to a glossy base, and  you'll have a much harder job to do in fairly short order.",
        "Read the label of the bonding primer carefully.",
        "Check to see if it will bond latex to oil.",
        "Paint your cabinets.",
        "This is the big moment, when you transform your kitchen from dull and dingy to hip and modern.",
        "For the best finish, use a sprayer.",
        "It will give you a smooth, glossy, even appearance.",
        "The biggest drawback is that you have to mask everything in sight that is not going to be painted, as aerosol paint spray will get everywhere.",
        "Use a brush.",
        "Using a high-quality brush, apply new paint (or varnish) within the time limit specified in the directions.",
        "Always brush in one direction, and don't lay it on too thick.",
        "2 light coats is much better than one heavy layer.",
        "Oil based paints tend to yellow over the years.",
        "Paint additives like Floetrol can create better flow and reduce brush strokes in oil paints.",
        "If you are re-varnishing kitchen or bathroom cabinets, consider a marine varnish which is more water repellent."
    ]
}