{
    "title": "How to Hand Tie a Quilt",
    "url": "https://www.wikihow.com/Hand-Tie-a-Quilt",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Quilting"
    ],
    "steps": [
        {
            "headline": "Cut a piece of thread about 20\" (50.8cm) long.",
            "description": "Use a strong, natural thread; you can use embroidery thread but crochet thread is also fine. You can even use wool, but be careful not to use anything too thick because it may be difficult to pull through the three layers of the quilt and thicker thread can tend to pull the wadding through the fabric."
        },
        {
            "headline": "Push the needle down through all three layers of the quilt fabric and then up again about 1/4\" (6.35mm) away from the initial down stitch.",
            "description": "Leave a tail of about 2\" (5cm) of thread to tie the quilt."
        },
        {
            "headline": "Take the needle back to where it first went in and repeat the stitch.",
            "description": "This extra step is worth the effort to secure the knot."
        },
        {
            "headline": "Cut the thread about 2\" (5cm) away from the stitch.",
            "description": "You should now have two threads both 2\" (5cm) long. Tie these in a double knot. You can leave the ends that length or trim them to about an inch (2.5cm). Trimming them any shorter than that is not recommended."
        }
    ],
    "tyn": [
        "Thread",
        "Quilt layers",
        "Needle",
        "Scissors"
    ],
    "text": " Cut a piece of thread about 20\" (50.8cm) long. Use a strong, natural thread; you can use embroidery thread but crochet thread is also fine. You can even use wool, but be careful not to use anything too thick because it may be difficult to pull through the three layers of the quilt and thicker thread can tend to pull the wadding through the fabric. Push the needle down through all three layers of the quilt fabric and then up again about 1/4\" (6.35mm) away from the initial down stitch. Leave a tail of about 2\" (5cm) of thread to tie the quilt. Take the needle back to where it first went in and repeat the stitch. This extra step is worth the effort to secure the knot. Cut the thread about 2\" (5cm) away from the stitch. You should now have two threads both 2\" (5cm) long. Tie these in a double knot. You can leave the ends that length or trim them to about an inch (2.5cm). Trimming them any shorter than that is not recommended.",
    "sentences": [
        " Cut a piece of thread about 20\" (50.8cm) long.",
        "Use a strong, natural thread; you can use embroidery thread but crochet thread is also fine.",
        "You can even use wool, but be careful not to use anything too thick because it may be difficult to pull through the three layers of the quilt and thicker thread can tend to pull the wadding through the fabric.",
        "Push the needle down through all three layers of the quilt fabric and then up again about 1/4\" (6.35mm) away from the initial down stitch.",
        "Leave a tail of about 2\" (5cm) of thread to tie the quilt.",
        "Take the needle back to where it first went in and repeat the stitch.",
        "This extra step is worth the effort to secure the knot.",
        "Cut the thread about 2\" (5cm) away from the stitch.",
        "You should now have two threads both 2\" (5cm) long.",
        "Tie these in a double knot.",
        "You can leave the ends that length or trim them to about an inch (2.5cm).",
        "Trimming them any shorter than that is not recommended."
    ]
}