{
    "title": "How to Cook a Brisket",
    "url": "https://www.wikihow.com/Cook-a-Brisket",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills"
    ],
    "methods": [
        {
            "name": "Slow Cooker Brisket with Onions",
            "steps": [
                {
                    "headline": "Saute the sliced onions.",
                    "description": "Place a skillet on the stove and pour in 1 tablespoon (15 ml) of olive oil. Turn the heat to medium and thinly slice 1 1/2 pounds (680 g) of yellow or red onions (about 2 large onions). When the skillet is hot, add the onions. Stir the onions occasionally and cook them for about 20 minutes. The onions should begin to caramelize or turn golden brown once they've finished cooking."
                },
                {
                    "headline": "Season and sear the brisket.",
                    "description": "Take a 3 1/2 pound (1.6 kg) beef brisket brisket out of the package and use paper towels to pat it dry. Sprinkle several large pinches of coarse salt and ground black pepper over the brisket. Set another skillet on the stove and turn the heat to medium-high. Place the brisket in the hot skillet and cook it for several minutes. Turn it over and cook the brisket on the other side until it's golden brown. The brisket will probably smoke a lot while you're searing it. Open a window or turn on your kitchen vent."
                },
                {
                    "headline": "Place the brisket, garlic, onions, and seasonings in a slow cooker.",
                    "description": "Lay the seared brisket into a slow cooker with the fatty side facing up towards you. Mince 6 cloves of garlic and spread it over the brisket along with the cooked onions. Pour these liquid seasonings around the meat:\n2 cups (480 ml) beef broth. 2 tablespoons (30 ml) Worcestershire sauce. 1 tablespoon (15 ml) soy sauce."
                },
                {
                    "headline": "Cook the brisket on low for 6 to 8 hours.",
                    "description": "Put the lid on the slow cooker and turn it on to LOW. Cook the brisket for 6 to 8 hours so it becomes completely tender when you insert a fork."
                },
                {
                    "headline": "Rest the brisket for 20 minutes.",
                    "description": "Turn off the slow cooker and leave the brisket in it to rest. Resting the meat will help the juices redistribute within it so it's easier to slice. If you'd like to keep it warm while it rests, leave the lid on the pot or turn on a WARM setting."
                },
                {
                    "headline": "Slice and serve the brisket.",
                    "description": "Lift the brisket out of the slow cooker and use a sharp knife to slice it into long strips. Slice against the grain of the meat so the brisket is tender and easy to eat. Or you can take two forks and shred the meat into very small pieces. Serve the brisket with juices from the slow cooker and the softened onions. Store leftover brisket in the fridge. The fat in the juices will float to the top and harden so you'll need to scoop it away before you reheat the meat. Reheat the meat in a low oven for about an hour."
                }
            ]
        },
        {
            "name": "Oven-Braised Brisket with Vegetables",
            "steps": [
                {
                    "headline": "Season and sear the brisket.",
                    "description": "Place a stainless-steel roasting pan on the stove and turn the heat to medium-high. Pour in 2 tablespoons (30 ml) of vegetable oil. While the oil heats, get out 6 pounds (2.75 kg) of whole beef brisket and sprinkle both sides  with kosher salt and ground black pepper. Place the meat in the hot oil and cook it for about 6 minutes. Carefully turn the meat over and cook the other side for another 6 minutes. You'll need to lay the roasting pan across two burners and turn them both on to give even heat. The brisket should be browned on both sides once it's seared."
                },
                {
                    "headline": "Cut the vegetables.",
                    "description": "Wash 1 pound (about 6 medium or 450 g) of carrots and chop them into bite-sized pieces. Wash 1/2 pound (about 4 stalks or 225 g) of celery and chop them into bites. You'll also need to peel 2 pounds (about 5 medium or 1 kg) of yellow onions and cut them into 1/4-inch (6 mm) slices."
                },
                {
                    "headline": "Saute the vegetables.",
                    "description": "Transfer the brisket to a baking sheet and set it aside. Add the cut onions, carrots, celery, and 6 medium cloves of garlic to the roasting pan. Cook the vegetables over medium heat for about 6 minutes. You'll need to stir the vegetables to prevent them from sticking to the pan. The vegetables will soften and start to turn golden brown."
                },
                {
                    "headline": "Stir in and cook the wine, ketchup, and tomatoes.",
                    "description": "Pour in 1 cup (240 ml) of dry red wine and stir the mixture until it begins to bubble. Ensure that you're scraping around the bottom of the pan to loosen bits of vegetable or meat. Stir in 1/3 cup (80 ml) of ketchup and a 14-ounce (400 g) can of whole peeled tomatoes that you've crushed by hand. Pour in the juice from the can too."
                },
                {
                    "headline": "Add the brisket and herbs to the pan.",
                    "description": "Turn off the heat and place the seared brisket back into the roasting pan. Add 4 sprigs of fresh thyme and 2 bay leaves. Tightly cover the pan with a sheet of aluminum foil."
                },
                {
                    "headline": "Turn on the oven and cook the brisket for 3 to 4 hours.",
                    "description": "Turn the oven on to 300 degrees F (150 degrees C) and put the roasting pan in the center of the oven. Bake the brisket for 3 to 4 hours. Check the meat by inserting a fork. The meat should be tender enough to shred a little once it's finished cooking. Because the brisket has such a long baking time, there's no need to preheat your oven. Pro Tip: Executive chef and restaurant owner Alex Hong recommends: \"Cover the brisket with tin foil and let it go low and slow. If you cook it much longer than that, or at a higher temperature, it's going to dry out.\" EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlex Hong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExecutive Chef & Restaurant Owner\t\t\t\t\t\t\t\tAlex Hong is the Executive Chef and Co-Owner of Sorrel, a New American restaurant in San Francisco. He has been working in restaurants for over ten years. Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants. Alex Hong\t\t\tExecutive Chef & Restaurant Owner\t\t\t\tWhat Our Expert Does: \"I think that the best way to cook a brisket is to cover it with tin foil and let it go low and slow. Cooking it at a higher temperature will dry it out, but cooking at a lower temperature for a longer time preserves all the moisture and flavor.\""
                },
                {
                    "headline": "Rest the brisket for 30 minutes.",
                    "description": "Remove the brisket from the oven and let it sit for 30 minutes. This will redistribute the juices within the meat. You can use a ladle or large spoon to scoop away any fat that's floated to the top of the pan. You should also throw away the sprigs of thyme and the bay leaves."
                },
                {
                    "headline": "Slice and serve the brisket.",
                    "description": "Lift the brisket out of the pan and put it on a cutting board. Use a sharp knife to carefully slice against the grain of the meat. Make very thin slices and put them all back into the roasting pan. The meat should be covered in the braising liquid. Let the brisket rest again for 30 minutes so it absorbs the liquid and then serve the brisket. You can make the brisket up to 4 days in advance. Store the cooked brisket in an airtight container in the refrigerator."
                }
            ]
        },
        {
            "name": "Texas-Style Barbecued Brisket",
            "steps": [
                {
                    "headline": "Combine the dry rub.",
                    "description": "Place all of the dry rub ingredients into a small bowl. Use your fingers or a whisk to mix together the seasonings until they're combined. You'll need:\n1 tablespoon (17 g) coarse salt. 1 tablespoon (8 g) chili powder. 2 teaspoons (8 g) sugar. 1 teaspoon (2 g) freshly ground black pepper. 1 teaspoon (2 g) ground cumin."
                },
                {
                    "headline": "Dry the brisket and season it with the dry rub.",
                    "description": "Get out a 5 to 6 pound (2.3 to 2.7 kg) beef brisket and pat it dry with paper towels. Spread the dry rub over the entire brisket. If you want to prepare the brisket ahead of time or give it extra flavor, wrap the seasoned brisket in plastic wrap. Refrigerate it for 4 to 8 hours."
                },
                {
                    "headline": "Prepare a charcoal grill.",
                    "description": "Heat charcoal briquettes and dump them on one half of the lower grill grate. This will make a hot side and a cooler, indirect heat side. Scatter 1 1/2 cups (135 g) of wood chips right on the coals. The chips will release a smoky flavor as they heat up. Avoid using a gas grill since you won't be able to smoke the meat properly."
                },
                {
                    "headline": "Put the brisket in a pan on the grill.",
                    "description": "Get out a disposable aluminum foil pan and put the brisket in the pan. The fatty side of the meat should be facing up. Place the pan of brisket on the center of the grill grate so it's not directly over the coals. Put the lid on the grill."
                },
                {
                    "headline": "Smoke the brisket for 6 to 8 hours.",
                    "description": "Let the brisket smoke and cook for at least 6 hours (and up to 8 hours). Check the charcoal every hour or so and add 10 to 12 new, hot coals to keep the grill hot. Spoon some of the juices from the pan over the brisket occasionally and add about 3/4 cup (67 g) of wood chips every hour for the first 3 hours. The brisket should become soft enough to pull apart easily with your fingers."
                },
                {
                    "headline": "Rest the brisket for 15 minutes and slice it.",
                    "description": "Carefully take the pan of brisket out of the grill and set it on a work surface. Let the brisket rest for 15 minutes so the juices redistribute within the meat. Slice the meat into thin strips that go against the grain. You can pour the juices from the pan over the meat and serve the brisket immediately. Store any leftovers in the refrigerator in an airtight container."
                }
            ]
        }
    ],
    "tyn": [
        "Measuring cups and spoons",
        "Digital scale",
        "Paper towels",
        "Knife and cutting board",
        "Skillet",
        "Large slow-cooker",
        "Spoon",
        "Stainless-steel roasting pan",
        "Aluminum foil",
        "Charcoal grill",
        "Charcoal briquettes",
        "Oven mitts",
        "Wood chips",
        "Disposable aluminum foil pan"
    ],
    "text": " Slow Cooker Brisket with Onions Saute the sliced onions. Place a skillet on the stove and pour in 1 tablespoon (15 ml) of olive oil. Turn the heat to medium and thinly slice 1 1/2 pounds (680 g) of yellow or red onions (about 2 large onions). When the skillet is hot, add the onions. Stir the onions occasionally and cook them for about 20 minutes. The onions should begin to caramelize or turn golden brown once they've finished cooking. Season and sear the brisket. Take a 3 1/2 pound (1.6 kg) beef brisket brisket out of the package and use paper towels to pat it dry. Sprinkle several large pinches of coarse salt and ground black pepper over the brisket. Set another skillet on the stove and turn the heat to medium-high. Place the brisket in the hot skillet and cook it for several minutes. Turn it over and cook the brisket on the other side until it's golden brown. The brisket will probably smoke a lot while you're searing it. Open a window or turn on your kitchen vent. Place the brisket, garlic, onions, and seasonings in a slow cooker. Lay the seared brisket into a slow cooker with the fatty side facing up towards you. Mince 6 cloves of garlic and spread it over the brisket along with the cooked onions. Pour these liquid seasonings around the meat:\n2 cups (480 ml) beef broth. 2 tablespoons (30 ml) Worcestershire sauce. 1 tablespoon (15 ml) soy sauce. Cook the brisket on low for 6 to 8 hours. Put the lid on the slow cooker and turn it on to LOW. Cook the brisket for 6 to 8 hours so it becomes completely tender when you insert a fork. Rest the brisket for 20 minutes. Turn off the slow cooker and leave the brisket in it to rest. Resting the meat will help the juices redistribute within it so it's easier to slice. If you'd like to keep it warm while it rests, leave the lid on the pot or turn on a WARM setting. Slice and serve the brisket. Lift the brisket out of the slow cooker and use a sharp knife to slice it into long strips. Slice against the grain of the meat so the brisket is tender and easy to eat. Or you can take two forks and shred the meat into very small pieces. Serve the brisket with juices from the slow cooker and the softened onions. Store leftover brisket in the fridge. The fat in the juices will float to the top and harden so you'll need to scoop it away before you reheat the meat. Reheat the meat in a low oven for about an hour. Oven-Braised Brisket with Vegetables Season and sear the brisket. Place a stainless-steel roasting pan on the stove and turn the heat to medium-high. Pour in 2 tablespoons (30 ml) of vegetable oil. While the oil heats, get out 6 pounds (2.75 kg) of whole beef brisket and sprinkle both sides  with kosher salt and ground black pepper. Place the meat in the hot oil and cook it for about 6 minutes. Carefully turn the meat over and cook the other side for another 6 minutes. You'll need to lay the roasting pan across two burners and turn them both on to give even heat. The brisket should be browned on both sides once it's seared. Cut the vegetables. Wash 1 pound (about 6 medium or 450 g) of carrots and chop them into bite-sized pieces. Wash 1/2 pound (about 4 stalks or 225 g) of celery and chop them into bites. You'll also need to peel 2 pounds (about 5 medium or 1 kg) of yellow onions and cut them into 1/4-inch (6 mm) slices. Saute the vegetables. Transfer the brisket to a baking sheet and set it aside. Add the cut onions, carrots, celery, and 6 medium cloves of garlic to the roasting pan. Cook the vegetables over medium heat for about 6 minutes. You'll need to stir the vegetables to prevent them from sticking to the pan. The vegetables will soften and start to turn golden brown. Stir in and cook the wine, ketchup, and tomatoes. Pour in 1 cup (240 ml) of dry red wine and stir the mixture until it begins to bubble. Ensure that you're scraping around the bottom of the pan to loosen bits of vegetable or meat. Stir in 1/3 cup (80 ml) of ketchup and a 14-ounce (400 g) can of whole peeled tomatoes that you've crushed by hand. Pour in the juice from the can too. Add the brisket and herbs to the pan. Turn off the heat and place the seared brisket back into the roasting pan. Add 4 sprigs of fresh thyme and 2 bay leaves. Tightly cover the pan with a sheet of aluminum foil. Turn on the oven and cook the brisket for 3 to 4 hours. Turn the oven on to 300 degrees F (150 degrees C) and put the roasting pan in the center of the oven. Bake the brisket for 3 to 4 hours. Check the meat by inserting a fork. The meat should be tender enough to shred a little once it's finished cooking. Because the brisket has such a long baking time, there's no need to preheat your oven. Pro Tip: Executive chef and restaurant owner Alex Hong recommends: \"Cover the brisket with tin foil and let it go low and slow. If you cook it much longer than that, or at a higher temperature, it's going to dry out.\" EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlex Hong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExecutive Chef & Restaurant Owner\t\t\t\t\t\t\t\tAlex Hong is the Executive Chef and Co-Owner of Sorrel, a New American restaurant in San Francisco. He has been working in restaurants for over ten years. Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants. Alex Hong\t\t\tExecutive Chef & Restaurant Owner\t\t\t\tWhat Our Expert Does: \"I think that the best way to cook a brisket is to cover it with tin foil and let it go low and slow. Cooking it at a higher temperature will dry it out, but cooking at a lower temperature for a longer time preserves all the moisture and flavor.\" Rest the brisket for 30 minutes. Remove the brisket from the oven and let it sit for 30 minutes. This will redistribute the juices within the meat. You can use a ladle or large spoon to scoop away any fat that's floated to the top of the pan. You should also throw away the sprigs of thyme and the bay leaves. Slice and serve the brisket. Lift the brisket out of the pan and put it on a cutting board. Use a sharp knife to carefully slice against the grain of the meat. Make very thin slices and put them all back into the roasting pan. The meat should be covered in the braising liquid. Let the brisket rest again for 30 minutes so it absorbs the liquid and then serve the brisket. You can make the brisket up to 4 days in advance. Store the cooked brisket in an airtight container in the refrigerator. Texas-Style Barbecued Brisket Combine the dry rub. Place all of the dry rub ingredients into a small bowl. Use your fingers or a whisk to mix together the seasonings until they're combined. You'll need:\n1 tablespoon (17 g) coarse salt. 1 tablespoon (8 g) chili powder. 2 teaspoons (8 g) sugar. 1 teaspoon (2 g) freshly ground black pepper. 1 teaspoon (2 g) ground cumin. Dry the brisket and season it with the dry rub. Get out a 5 to 6 pound (2.3 to 2.7 kg) beef brisket and pat it dry with paper towels. Spread the dry rub over the entire brisket. If you want to prepare the brisket ahead of time or give it extra flavor, wrap the seasoned brisket in plastic wrap. Refrigerate it for 4 to 8 hours. Prepare a charcoal grill. Heat charcoal briquettes and dump them on one half of the lower grill grate. This will make a hot side and a cooler, indirect heat side. Scatter 1 1/2 cups (135 g) of wood chips right on the coals. The chips will release a smoky flavor as they heat up. Avoid using a gas grill since you won't be able to smoke the meat properly. Put the brisket in a pan on the grill. Get out a disposable aluminum foil pan and put the brisket in the pan. The fatty side of the meat should be facing up. Place the pan of brisket on the center of the grill grate so it's not directly over the coals. Put the lid on the grill. Smoke the brisket for 6 to 8 hours. Let the brisket smoke and cook for at least 6 hours (and up to 8 hours). Check the charcoal every hour or so and add 10 to 12 new, hot coals to keep the grill hot. Spoon some of the juices from the pan over the brisket occasionally and add about 3/4 cup (67 g) of wood chips every hour for the first 3 hours. The brisket should become soft enough to pull apart easily with your fingers. Rest the brisket for 15 minutes and slice it. Carefully take the pan of brisket out of the grill and set it on a work surface. Let the brisket rest for 15 minutes so the juices redistribute within the meat. Slice the meat into thin strips that go against the grain. You can pour the juices from the pan over the meat and serve the brisket immediately. Store any leftovers in the refrigerator in an airtight container.",
    "sentences": [
        " Slow Cooker Brisket with Onions Saute the sliced onions.",
        "Place a skillet on the stove and pour in 1 tablespoon (15 ml) of olive oil.",
        "Turn the heat to medium and thinly slice 1 1/2 pounds (680 g) of yellow or red onions (about 2 large onions).",
        "When the skillet is hot, add the onions.",
        "Stir the onions occasionally and cook them for about 20 minutes.",
        "The onions should begin to caramelize or turn golden brown once they've finished cooking.",
        "Season and sear the brisket.",
        "Take a 3 1/2 pound (1.6 kg) beef brisket brisket out of the package and use paper towels to pat it dry.",
        "Sprinkle several large pinches of coarse salt and ground black pepper over the brisket.",
        "Set another skillet on the stove and turn the heat to medium-high.",
        "Place the brisket in the hot skillet and cook it for several minutes.",
        "Turn it over and cook the brisket on the other side until it's golden brown.",
        "The brisket will probably smoke a lot while you're searing it.",
        "Open a window or turn on your kitchen vent.",
        "Place the brisket, garlic, onions, and seasonings in a slow cooker.",
        "Lay the seared brisket into a slow cooker with the fatty side facing up towards you.",
        "Mince 6 cloves of garlic and spread it over the brisket along with the cooked onions.",
        "Pour these liquid seasonings around the meat:\n2 cups (480 ml) beef broth.",
        "2 tablespoons (30 ml) Worcestershire sauce.",
        "1 tablespoon (15 ml) soy sauce.",
        "Cook the brisket on low for 6 to 8 hours.",
        "Put the lid on the slow cooker and turn it on to LOW.",
        "Cook the brisket for 6 to 8 hours so it becomes completely tender when you insert a fork.",
        "Rest the brisket for 20 minutes.",
        "Turn off the slow cooker and leave the brisket in it to rest.",
        "Resting the meat will help the juices redistribute within it so it's easier to slice.",
        "If you'd like to keep it warm while it rests, leave the lid on the pot or turn on a WARM setting.",
        "Slice and serve the brisket.",
        "Lift the brisket out of the slow cooker and use a sharp knife to slice it into long strips.",
        "Slice against the grain of the meat so the brisket is tender and easy to eat.",
        "Or you can take two forks and shred the meat into very small pieces.",
        "Serve the brisket with juices from the slow cooker and the softened onions.",
        "Store leftover brisket in the fridge.",
        "The fat in the juices will float to the top and harden so you'll need to scoop it away before you reheat the meat.",
        "Reheat the meat in a low oven for about an hour.",
        "Oven-Braised Brisket with Vegetables Season and sear the brisket.",
        "Place a stainless-steel roasting pan on the stove and turn the heat to medium-high.",
        "Pour in 2 tablespoons (30 ml) of vegetable oil.",
        "While the oil heats, get out 6 pounds (2.75 kg) of whole beef brisket and sprinkle both sides  with kosher salt and ground black pepper.",
        "Place the meat in the hot oil and cook it for about 6 minutes.",
        "Carefully turn the meat over and cook the other side for another 6 minutes.",
        "You'll need to lay the roasting pan across two burners and turn them both on to give even heat.",
        "The brisket should be browned on both sides once it's seared.",
        "Cut the vegetables.",
        "Wash 1 pound (about 6 medium or 450 g) of carrots and chop them into bite-sized pieces.",
        "Wash 1/2 pound (about 4 stalks or 225 g) of celery and chop them into bites.",
        "You'll also need to peel 2 pounds (about 5 medium or 1 kg) of yellow onions and cut them into 1/4-inch (6 mm) slices.",
        "Saute the vegetables.",
        "Transfer the brisket to a baking sheet and set it aside.",
        "Add the cut onions, carrots, celery, and 6 medium cloves of garlic to the roasting pan.",
        "Cook the vegetables over medium heat for about 6 minutes.",
        "You'll need to stir the vegetables to prevent them from sticking to the pan.",
        "The vegetables will soften and start to turn golden brown.",
        "Stir in and cook the wine, ketchup, and tomatoes.",
        "Pour in 1 cup (240 ml) of dry red wine and stir the mixture until it begins to bubble.",
        "Ensure that you're scraping around the bottom of the pan to loosen bits of vegetable or meat.",
        "Stir in 1/3 cup (80 ml) of ketchup and a 14-ounce (400 g) can of whole peeled tomatoes that you've crushed by hand.",
        "Pour in the juice from the can too.",
        "Add the brisket and herbs to the pan.",
        "Turn off the heat and place the seared brisket back into the roasting pan.",
        "Add 4 sprigs of fresh thyme and 2 bay leaves.",
        "Tightly cover the pan with a sheet of aluminum foil.",
        "Turn on the oven and cook the brisket for 3 to 4 hours.",
        "Turn the oven on to 300 degrees F (150 degrees C) and put the roasting pan in the center of the oven.",
        "Bake the brisket for 3 to 4 hours.",
        "Check the meat by inserting a fork.",
        "The meat should be tender enough to shred a little once it's finished cooking.",
        "Because the brisket has such a long baking time, there's no need to preheat your oven.",
        "Pro Tip: Executive chef and restaurant owner Alex Hong recommends: \"Cover the brisket with tin foil and let it go low and slow.",
        "If you cook it much longer than that, or at a higher temperature, it's going to dry out.\"",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlex Hong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExecutive Chef & Restaurant Owner\t\t\t\t\t\t\t\tAlex Hong is the Executive Chef and Co-Owner of Sorrel, a New American restaurant in San Francisco.",
        "He has been working in restaurants for over ten years.",
        "Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants.",
        "Alex Hong\t\t\tExecutive Chef & Restaurant Owner\t\t\t\tWhat Our Expert Does: \"I think that the best way to cook a brisket is to cover it with tin foil and let it go low and slow.",
        "Cooking it at a higher temperature will dry it out, but cooking at a lower temperature for a longer time preserves all the moisture and flavor.\"",
        "Rest the brisket for 30 minutes.",
        "Remove the brisket from the oven and let it sit for 30 minutes.",
        "This will redistribute the juices within the meat.",
        "You can use a ladle or large spoon to scoop away any fat that's floated to the top of the pan.",
        "You should also throw away the sprigs of thyme and the bay leaves.",
        "Slice and serve the brisket.",
        "Lift the brisket out of the pan and put it on a cutting board.",
        "Use a sharp knife to carefully slice against the grain of the meat.",
        "Make very thin slices and put them all back into the roasting pan.",
        "The meat should be covered in the braising liquid.",
        "Let the brisket rest again for 30 minutes so it absorbs the liquid and then serve the brisket.",
        "You can make the brisket up to 4 days in advance.",
        "Store the cooked brisket in an airtight container in the refrigerator.",
        "Texas-Style Barbecued Brisket Combine the dry rub.",
        "Place all of the dry rub ingredients into a small bowl.",
        "Use your fingers or a whisk to mix together the seasonings until they're combined.",
        "You'll need:\n1 tablespoon (17 g) coarse salt.",
        "1 tablespoon (8 g) chili powder.",
        "2 teaspoons (8 g) sugar.",
        "1 teaspoon (2 g) freshly ground black pepper.",
        "1 teaspoon (2 g) ground cumin.",
        "Dry the brisket and season it with the dry rub.",
        "Get out a 5 to 6 pound (2.3 to 2.7 kg) beef brisket and pat it dry with paper towels.",
        "Spread the dry rub over the entire brisket.",
        "If you want to prepare the brisket ahead of time or give it extra flavor, wrap the seasoned brisket in plastic wrap.",
        "Refrigerate it for 4 to 8 hours.",
        "Prepare a charcoal grill.",
        "Heat charcoal briquettes and dump them on one half of the lower grill grate.",
        "This will make a hot side and a cooler, indirect heat side.",
        "Scatter 1 1/2 cups (135 g) of wood chips right on the coals.",
        "The chips will release a smoky flavor as they heat up.",
        "Avoid using a gas grill since you won't be able to smoke the meat properly.",
        "Put the brisket in a pan on the grill.",
        "Get out a disposable aluminum foil pan and put the brisket in the pan.",
        "The fatty side of the meat should be facing up.",
        "Place the pan of brisket on the center of the grill grate so it's not directly over the coals.",
        "Put the lid on the grill.",
        "Smoke the brisket for 6 to 8 hours.",
        "Let the brisket smoke and cook for at least 6 hours (and up to 8 hours).",
        "Check the charcoal every hour or so and add 10 to 12 new, hot coals to keep the grill hot.",
        "Spoon some of the juices from the pan over the brisket occasionally and add about 3/4 cup (67 g) of wood chips every hour for the first 3 hours.",
        "The brisket should become soft enough to pull apart easily with your fingers.",
        "Rest the brisket for 15 minutes and slice it.",
        "Carefully take the pan of brisket out of the grill and set it on a work surface.",
        "Let the brisket rest for 15 minutes so the juices redistribute within the meat.",
        "Slice the meat into thin strips that go against the grain.",
        "You can pour the juices from the pan over the meat and serve the brisket immediately.",
        "Store any leftovers in the refrigerator in an airtight container."
    ]
}