{
    "title": "How to Season a Grill",
    "url": "https://www.wikihow.com/Season-a-Grill",
    "category_hierarchy": [
        "Food and Entertaining"
    ],
    "parts": [
        {
            "name": "Cleaning the Grates",
            "steps": [
                {
                    "headline": "Remove the grates from the grill.",
                    "description": "They may lift right off, or you may need to unhook them from the inside of the grill. If the grates are extremely dirty, you may wish to wear rubber cleaning gloves to keep your hands clean and protect them from any rough edges."
                },
                {
                    "headline": "Brush the grates with a wire grill brush.",
                    "description": "Firmly brush both sides of the grate to remove any charred food or other debris leftover from past use. If significant build-up remains after a vigorous brushing, you can try soaking the grates in a bucket of warm, soapy water for about 15 minutes to help loosen stubborn stuck-on particles."
                },
                {
                    "headline": "Wash and dry the grates.",
                    "description": "Using a wet cloth or sponge and mild dishwashing liquid, wash the grates and rinse thoroughly. Dry the grates well with a soft cloth or allow them plenty of time to air-dry completely. If your grill is new, this step will remove any waxes or other protective coatings applied during the manufacturing process. For older grills, the sponge session will help clear away any additional remnants of charred food."
                }
            ]
        },
        {
            "name": "Coating the Grates with Oil",
            "steps": [
                {
                    "headline": "Apply an even coating of cooking oil to all sides of the grate.",
                    "description": "You can use a clean cloth, paper towel or new, soft-bristled paintbrush to apply the oil, or you can fill a clean, empty spray bottle with oil and spritz it onto the grates. Be sure to use an oil with a high smoke point, such as grapeseed, canola or peanut oil, since you’ll be heating the grill to a high temperature during the seasoning process."
                },
                {
                    "headline": "Wipe off any excess oil with a clean cloth or paper towel.",
                    "description": "If the grates are dripping with oil, it may cause a grease flare-up when you turn up the heat or light the charcoal."
                },
                {
                    "headline": "Oil the inside of the grill pit and lid if your grill is brand-new.",
                    "description": "If your grill has them, be sure to apply oil to the emitters as well. This step will seal the interior of your grill, making it easier to keep clean."
                }
            ]
        },
        {
            "name": "Baking the Coating onto the Grates",
            "steps": [
                {
                    "headline": "Preheat the grill.",
                    "description": "With the lid closed and the grates removed, heat the grill on medium heat for approximately 15 minutes. If you have a charcoal grill, add enough briquettes to last about three hours to the grill pit and light them, allowing them to burn until the centers are glowing red and the exteriors are covered in a layer of gray ash."
                },
                {
                    "headline": "Reinstall the grates and let them bake.",
                    "description": "For gas grills, reduce the heat setting to low, place the grates back inside the pit and close the lid. Find something else to occupy your time for about two hours while the grates bake."
                },
                {
                    "headline": "Allow the grates to cool.",
                    "description": "After two hours, turn off the heat, leave the lid shut and wait for the grates to cool completely. You’ll notice that your grates have changed color. After a proper seasoning, stainless steel grates will turn dark bronze, while cast-iron grates will take on a shiny black appearance."
                },
                {
                    "headline": "Fire up the grill and get cooking.",
                    "description": "Your grill is now seasoned and ready for months of neighborhood barbecues and family meals."
                }
            ]
        }
    ],
    "tyn": [
        "Cooking oil with a high smoke point (such as grapeseed, canola or peanut oil)",
        "Sponge or soft cloth",
        "Water source (bucket, hose or sink)",
        "Paper towels",
        "Mild dish soap",
        "Rubber cleaning gloves (optional)",
        "Spray bottle (optional)",
        "Wire brush"
    ],
    "text": " Cleaning the Grates Remove the grates from the grill. They may lift right off, or you may need to unhook them from the inside of the grill. If the grates are extremely dirty, you may wish to wear rubber cleaning gloves to keep your hands clean and protect them from any rough edges. Brush the grates with a wire grill brush. Firmly brush both sides of the grate to remove any charred food or other debris leftover from past use. If significant build-up remains after a vigorous brushing, you can try soaking the grates in a bucket of warm, soapy water for about 15 minutes to help loosen stubborn stuck-on particles. Wash and dry the grates. Using a wet cloth or sponge and mild dishwashing liquid, wash the grates and rinse thoroughly. Dry the grates well with a soft cloth or allow them plenty of time to air-dry completely. If your grill is new, this step will remove any waxes or other protective coatings applied during the manufacturing process. For older grills, the sponge session will help clear away any additional remnants of charred food. Coating the Grates with Oil Apply an even coating of cooking oil to all sides of the grate. You can use a clean cloth, paper towel or new, soft-bristled paintbrush to apply the oil, or you can fill a clean, empty spray bottle with oil and spritz it onto the grates. Be sure to use an oil with a high smoke point, such as grapeseed, canola or peanut oil, since you’ll be heating the grill to a high temperature during the seasoning process. Wipe off any excess oil with a clean cloth or paper towel. If the grates are dripping with oil, it may cause a grease flare-up when you turn up the heat or light the charcoal. Oil the inside of the grill pit and lid if your grill is brand-new. If your grill has them, be sure to apply oil to the emitters as well. This step will seal the interior of your grill, making it easier to keep clean. Baking the Coating onto the Grates Preheat the grill. With the lid closed and the grates removed, heat the grill on medium heat for approximately 15 minutes. If you have a charcoal grill, add enough briquettes to last about three hours to the grill pit and light them, allowing them to burn until the centers are glowing red and the exteriors are covered in a layer of gray ash. Reinstall the grates and let them bake. For gas grills, reduce the heat setting to low, place the grates back inside the pit and close the lid. Find something else to occupy your time for about two hours while the grates bake. Allow the grates to cool. After two hours, turn off the heat, leave the lid shut and wait for the grates to cool completely. You’ll notice that your grates have changed color. After a proper seasoning, stainless steel grates will turn dark bronze, while cast-iron grates will take on a shiny black appearance. Fire up the grill and get cooking. Your grill is now seasoned and ready for months of neighborhood barbecues and family meals.",
    "sentences": [
        " Cleaning the Grates Remove the grates from the grill.",
        "They may lift right off, or you may need to unhook them from the inside of the grill.",
        "If the grates are extremely dirty, you may wish to wear rubber cleaning gloves to keep your hands clean and protect them from any rough edges.",
        "Brush the grates with a wire grill brush.",
        "Firmly brush both sides of the grate to remove any charred food or other debris leftover from past use.",
        "If significant build-up remains after a vigorous brushing, you can try soaking the grates in a bucket of warm, soapy water for about 15 minutes to help loosen stubborn stuck-on particles.",
        "Wash and dry the grates.",
        "Using a wet cloth or sponge and mild dishwashing liquid, wash the grates and rinse thoroughly.",
        "Dry the grates well with a soft cloth or allow them plenty of time to air-dry completely.",
        "If your grill is new, this step will remove any waxes or other protective coatings applied during the manufacturing process.",
        "For older grills, the sponge session will help clear away any additional remnants of charred food.",
        "Coating the Grates with Oil Apply an even coating of cooking oil to all sides of the grate.",
        "You can use a clean cloth, paper towel or new, soft-bristled paintbrush to apply the oil, or you can fill a clean, empty spray bottle with oil and spritz it onto the grates.",
        "Be sure to use an oil with a high smoke point, such as grapeseed, canola or peanut oil, since you’ll be heating the grill to a high temperature during the seasoning process.",
        "Wipe off any excess oil with a clean cloth or paper towel.",
        "If the grates are dripping with oil, it may cause a grease flare-up when you turn up the heat or light the charcoal.",
        "Oil the inside of the grill pit and lid if your grill is brand-new.",
        "If your grill has them, be sure to apply oil to the emitters as well.",
        "This step will seal the interior of your grill, making it easier to keep clean.",
        "Baking the Coating onto the Grates Preheat the grill.",
        "With the lid closed and the grates removed, heat the grill on medium heat for approximately 15 minutes.",
        "If you have a charcoal grill, add enough briquettes to last about three hours to the grill pit and light them, allowing them to burn until the centers are glowing red and the exteriors are covered in a layer of gray ash.",
        "Reinstall the grates and let them bake.",
        "For gas grills, reduce the heat setting to low, place the grates back inside the pit and close the lid.",
        "Find something else to occupy your time for about two hours while the grates bake.",
        "Allow the grates to cool.",
        "After two hours, turn off the heat, leave the lid shut and wait for the grates to cool completely.",
        "You’ll notice that your grates have changed color.",
        "After a proper seasoning, stainless steel grates will turn dark bronze, while cast-iron grates will take on a shiny black appearance.",
        "Fire up the grill and get cooking.",
        "Your grill is now seasoned and ready for months of neighborhood barbecues and family meals."
    ]
}