{
    "title": "How to Cover a Smoke Detector",
    "url": "https://www.wikihow.com/Cover-a-Smoke-Detector",
    "category_hierarchy": [
        "Home and Garden",
        "Disaster Preparedness"
    ],
    "methods": [
        {
            "name": "Hiding the Sensor Chamber with Tape",
            "steps": [
                {
                    "headline": "Locate your unit's sensor chamber.",
                    "description": "All smoke detectors contain a small internal chamber that sucks in trace amounts of air to check for the presence of smoke. Most newer models feature an open casing design, with narrow “windows” encircling the bottom portion of the unit's housing. On older models, these windows may be found along the top of the unit where it attaches to the ceiling. The sensor chamber on a smoke detector is very sensitive, which is what makes it reliable. Unfortunately, this same sensitivity could cause it to accidentally be set off when it picks up traces of dust, steam, or chemical fumes."
                },
                {
                    "headline": "Place a strip of tape over the sensor chamber.",
                    "description": "Stretch out a piece of brightly-colored duct or painter's tape long enough to cover the entire opening. Press the tape into place, taking a moment to make sure it won't come undone while you're busy cooking or cleaning. It's important to choose a tape in an eye-catching color so you won't accidentally forget about it and leave it on after completing your chores. Avoid using clear or plain white tape. These are more likely to go unnoticed.Warning: Generally speaking, it's not a good idea to disable a smoke detector for any reason. If you insist on covering your unit, keep in mind that it won't be able to alert you in the event of a fire."
                },
                {
                    "headline": "Remember to remove the tape when you're done.",
                    "description": "Once the room has cleared out, simply peel off and dispose of the tape. Be sure to wait until most of the visible haze is gone. Otherwise, you might manage to set off the alarm in spite of your efforts. Consider writing yourself a note or setting an alarm on your phone to remind you to remove the tape just in case."
                }
            ]
        },
        {
            "name": "Sealing the Smoke Detector Inside a Plastic Bag",
            "steps": [
                {
                    "headline": "Find a plastic bag that's the right size to fit over your smoke detector.",
                    "description": "The bag should be big enough to easily slip over the unit, but not so large that it might have trouble staying put. A quart-sized freezer bag or something of a similar size and thickness will work well for most models. A grocery bag could also work, as long as there are no holes in the surface. If you use a bag that's too big, there's a chance that the material will bunch up around the edges, allowing dust and steam to find their way inside."
                },
                {
                    "headline": "Use a rubber band to hold the bag in place.",
                    "description": "Open the bag and guide it over the outside of the smoke detector. Then, stretch a rubber band around the upper part of the bag where the opening meets the ceiling. If you don't have a rubber band handy, wrap the top of the bag with tape to seal it off. Check to confirm that the bag is secure before you engage in any activities that might produce smoke, steam, or dust."
                },
                {
                    "headline": "Take off the bag when you're ready to reactivate your smoke detector.",
                    "description": "Pull off the rubber band or tape keeping the bag where it is and uncover the unit. Don't forget to wait until the air is clear in order to avoid a noisy surprise. Drop the bag and tape in the trash; hold onto rubber bands for future use.Tip: To speed things along a bit, fan the area around the smoke detector with a dish towel until it's clear enough not to trigger the alarm by accident."
                }
            ]
        },
        {
            "name": "Shielding the Unit with a Shower Cap",
            "steps": [
                {
                    "headline": "Grab a cheap plastic shower cap.",
                    "description": "Take a moment to inspect the cap and make sure there are no holes, slits, or tears in the material. Even the smallest opening could let in dust or steam, which could in turn lead to a false detection and a lot of blaring noise. You can buy a single disposable shower cap or a package of multiple caps at any supermarket or drugstore for just a few dollars. If you're unable to track down a shower cap at the store, one alternative is to use the kind of stretch-to-fit plastic or cotton covers that are designed to go over food dishes."
                },
                {
                    "headline": "Stretch the shower cap over the entire smoke detector.",
                    "description": "Shower caps have elastic bands around the bottom that expand and contract to fit a wide range of head sizes. This also makes them perfect for slipping on and off all sorts of other objects, including smoke detectors. To prevent the cap from slipping off, making sure the elastic band is resting over the top of the unit between the housing and the ceiling.Warning: This method may not work if your smoke detector is smaller in diameter than the band of the shower cap while fully relaxed."
                },
                {
                    "headline": "Uncover the unit as soon as the dust or steam has dissipated.",
                    "description": "Pull off the shower cap and toss it in the trash. You could also hold onto it if you think you might need it again in the near future. Keep the cap in a nearby drawer or cabinet so it will be within reach. If you reuse the same shower cap too often, it's possible for mold to set up inside. Throw away your shower cap if it begins to look dirty or dingy. Overall, a shower cap makes a safer cover than tape, since there's a slim chance that you'll fail to notice it the next time you walk by."
                }
            ]
        }
    ],
    "tyn": [
        "Hiding the Sensor Chamber with Tape",
        "Ladder or step stool",
        "Brightly-colored duct or painter's tape",
        "Sealing the Smoke Detector Inside a Plastic Bag",
        "Medium-sized plastic bag",
        "Rubber band",
        "Plastic grocery bag (optional)",
        "Shielding the Unit with a Shower Cap",
        "Disposable plastic shower cap"
    ],
    "text": " Hiding the Sensor Chamber with Tape Locate your unit's sensor chamber. All smoke detectors contain a small internal chamber that sucks in trace amounts of air to check for the presence of smoke. Most newer models feature an open casing design, with narrow “windows” encircling the bottom portion of the unit's housing. On older models, these windows may be found along the top of the unit where it attaches to the ceiling. The sensor chamber on a smoke detector is very sensitive, which is what makes it reliable. Unfortunately, this same sensitivity could cause it to accidentally be set off when it picks up traces of dust, steam, or chemical fumes. Place a strip of tape over the sensor chamber. Stretch out a piece of brightly-colored duct or painter's tape long enough to cover the entire opening. Press the tape into place, taking a moment to make sure it won't come undone while you're busy cooking or cleaning. It's important to choose a tape in an eye-catching color so you won't accidentally forget about it and leave it on after completing your chores. Avoid using clear or plain white tape. These are more likely to go unnoticed.Warning: Generally speaking, it's not a good idea to disable a smoke detector for any reason. If you insist on covering your unit, keep in mind that it won't be able to alert you in the event of a fire. Remember to remove the tape when you're done. Once the room has cleared out, simply peel off and dispose of the tape. Be sure to wait until most of the visible haze is gone. Otherwise, you might manage to set off the alarm in spite of your efforts. Consider writing yourself a note or setting an alarm on your phone to remind you to remove the tape just in case. Sealing the Smoke Detector Inside a Plastic Bag Find a plastic bag that's the right size to fit over your smoke detector. The bag should be big enough to easily slip over the unit, but not so large that it might have trouble staying put. A quart-sized freezer bag or something of a similar size and thickness will work well for most models. A grocery bag could also work, as long as there are no holes in the surface. If you use a bag that's too big, there's a chance that the material will bunch up around the edges, allowing dust and steam to find their way inside. Use a rubber band to hold the bag in place. Open the bag and guide it over the outside of the smoke detector. Then, stretch a rubber band around the upper part of the bag where the opening meets the ceiling. If you don't have a rubber band handy, wrap the top of the bag with tape to seal it off. Check to confirm that the bag is secure before you engage in any activities that might produce smoke, steam, or dust. Take off the bag when you're ready to reactivate your smoke detector. Pull off the rubber band or tape keeping the bag where it is and uncover the unit. Don't forget to wait until the air is clear in order to avoid a noisy surprise. Drop the bag and tape in the trash; hold onto rubber bands for future use.Tip: To speed things along a bit, fan the area around the smoke detector with a dish towel until it's clear enough not to trigger the alarm by accident. Shielding the Unit with a Shower Cap Grab a cheap plastic shower cap. Take a moment to inspect the cap and make sure there are no holes, slits, or tears in the material. Even the smallest opening could let in dust or steam, which could in turn lead to a false detection and a lot of blaring noise. You can buy a single disposable shower cap or a package of multiple caps at any supermarket or drugstore for just a few dollars. If you're unable to track down a shower cap at the store, one alternative is to use the kind of stretch-to-fit plastic or cotton covers that are designed to go over food dishes. Stretch the shower cap over the entire smoke detector. Shower caps have elastic bands around the bottom that expand and contract to fit a wide range of head sizes. This also makes them perfect for slipping on and off all sorts of other objects, including smoke detectors. To prevent the cap from slipping off, making sure the elastic band is resting over the top of the unit between the housing and the ceiling.Warning: This method may not work if your smoke detector is smaller in diameter than the band of the shower cap while fully relaxed. Uncover the unit as soon as the dust or steam has dissipated. Pull off the shower cap and toss it in the trash. You could also hold onto it if you think you might need it again in the near future. Keep the cap in a nearby drawer or cabinet so it will be within reach. If you reuse the same shower cap too often, it's possible for mold to set up inside. Throw away your shower cap if it begins to look dirty or dingy. Overall, a shower cap makes a safer cover than tape, since there's a slim chance that you'll fail to notice it the next time you walk by.",
    "sentences": [
        " Hiding the Sensor Chamber with Tape Locate your unit's sensor chamber.",
        "All smoke detectors contain a small internal chamber that sucks in trace amounts of air to check for the presence of smoke.",
        "Most newer models feature an open casing design, with narrow “windows” encircling the bottom portion of the unit's housing.",
        "On older models, these windows may be found along the top of the unit where it attaches to the ceiling.",
        "The sensor chamber on a smoke detector is very sensitive, which is what makes it reliable.",
        "Unfortunately, this same sensitivity could cause it to accidentally be set off when it picks up traces of dust, steam, or chemical fumes.",
        "Place a strip of tape over the sensor chamber.",
        "Stretch out a piece of brightly-colored duct or painter's tape long enough to cover the entire opening.",
        "Press the tape into place, taking a moment to make sure it won't come undone while you're busy cooking or cleaning.",
        "It's important to choose a tape in an eye-catching color so you won't accidentally forget about it and leave it on after completing your chores.",
        "Avoid using clear or plain white tape.",
        "These are more likely to go unnoticed.Warning: Generally speaking, it's not a good idea to disable a smoke detector for any reason.",
        "If you insist on covering your unit, keep in mind that it won't be able to alert you in the event of a fire.",
        "Remember to remove the tape when you're done.",
        "Once the room has cleared out, simply peel off and dispose of the tape.",
        "Be sure to wait until most of the visible haze is gone.",
        "Otherwise, you might manage to set off the alarm in spite of your efforts.",
        "Consider writing yourself a note or setting an alarm on your phone to remind you to remove the tape just in case.",
        "Sealing the Smoke Detector Inside a Plastic Bag Find a plastic bag that's the right size to fit over your smoke detector.",
        "The bag should be big enough to easily slip over the unit, but not so large that it might have trouble staying put.",
        "A quart-sized freezer bag or something of a similar size and thickness will work well for most models.",
        "A grocery bag could also work, as long as there are no holes in the surface.",
        "If you use a bag that's too big, there's a chance that the material will bunch up around the edges, allowing dust and steam to find their way inside.",
        "Use a rubber band to hold the bag in place.",
        "Open the bag and guide it over the outside of the smoke detector.",
        "Then, stretch a rubber band around the upper part of the bag where the opening meets the ceiling.",
        "If you don't have a rubber band handy, wrap the top of the bag with tape to seal it off.",
        "Check to confirm that the bag is secure before you engage in any activities that might produce smoke, steam, or dust.",
        "Take off the bag when you're ready to reactivate your smoke detector.",
        "Pull off the rubber band or tape keeping the bag where it is and uncover the unit.",
        "Don't forget to wait until the air is clear in order to avoid a noisy surprise.",
        "Drop the bag and tape in the trash; hold onto rubber bands for future use.Tip: To speed things along a bit, fan the area around the smoke detector with a dish towel until it's clear enough not to trigger the alarm by accident.",
        "Shielding the Unit with a Shower Cap Grab a cheap plastic shower cap.",
        "Take a moment to inspect the cap and make sure there are no holes, slits, or tears in the material.",
        "Even the smallest opening could let in dust or steam, which could in turn lead to a false detection and a lot of blaring noise.",
        "You can buy a single disposable shower cap or a package of multiple caps at any supermarket or drugstore for just a few dollars.",
        "If you're unable to track down a shower cap at the store, one alternative is to use the kind of stretch-to-fit plastic or cotton covers that are designed to go over food dishes.",
        "Stretch the shower cap over the entire smoke detector.",
        "Shower caps have elastic bands around the bottom that expand and contract to fit a wide range of head sizes.",
        "This also makes them perfect for slipping on and off all sorts of other objects, including smoke detectors.",
        "To prevent the cap from slipping off, making sure the elastic band is resting over the top of the unit between the housing and the ceiling.Warning: This method may not work if your smoke detector is smaller in diameter than the band of the shower cap while fully relaxed.",
        "Uncover the unit as soon as the dust or steam has dissipated.",
        "Pull off the shower cap and toss it in the trash.",
        "You could also hold onto it if you think you might need it again in the near future.",
        "Keep the cap in a nearby drawer or cabinet so it will be within reach.",
        "If you reuse the same shower cap too often, it's possible for mold to set up inside.",
        "Throw away your shower cap if it begins to look dirty or dingy.",
        "Overall, a shower cap makes a safer cover than tape, since there's a slim chance that you'll fail to notice it the next time you walk by."
    ]
}