{
    "title": "How to Steam Hair",
    "url": "https://www.wikihow.com/Steam-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care"
    ],
    "methods": [
        {
            "name": "Using a Hot Towel",
            "steps": [
                {
                    "headline": "Smooth 2 tablespoons (30 mL) of conditioner over your hair.",
                    "description": "Squeeze the conditioner into your hands and rub them together. Then, use your fingers to smooth the conditioner down the shafts of your hair, starting at the roots. Make sure that you apply an even coating. If you run out of conditioner by the time you get to your ends, simply use a little more. If you prefer, you can use your favourite hair oil instead of conditioner. Coconut oil and olive oil are popular moisturising options."
                },
                {
                    "headline": "Place a shower cap on your head.",
                    "description": "If you have long hair, tie it up in a low bun first. Then, place the shower cap over your head and tuck any stray hairs underneath. Purchase a shower cap from a pharmacy or the hair care aisle of a supermarket."
                },
                {
                    "headline": "Wet a face cloth and wring it out.",
                    "description": "Continue to squeeze the face cloth until there are no drips coming off it. This is important, as hot drips of water have the potential to burn your neck. Shake the face cloth to ensure that there are no drips of water left in it. If you have a hair turban, you can use this instead of a face cloth. Face cloths work well because of their small size. If you don’t have one, use a similar sized cloth instead."
                },
                {
                    "headline": "Put the face cloth into the microwave for 2 minutes.",
                    "description": "Set the microwave to the highest setting and press start. This heats up the water in the cloth which will help to steam your hair. Don’t worry if you see steam coming off the cloth while it is in the microwave – this is normal. If your microwave plate is dirty, place the face cloth into a microwave-safe bowl to keep it clean."
                },
                {
                    "headline": "Place the face cloth on top of the shower cap.",
                    "description": "Position the face cloth on the middle of your head over the shower cap. If you feel the face cloth slipping down your head, simply adjust it back onto the middle of your head in a more balanced position. Wear gloves when transferring the face cloth to your head to avoid getting burnt. Alternatively, use a potholder to remove the face cloth."
                },
                {
                    "headline": "Put another shower cap over the face cloth.",
                    "description": "This helps to stop the heat from escaping and encourages steam to form. Don’t worry if the shower cap doesn’t fit over your whole head, simply stretch it over the face cloth. If you don’t have another shower cap, place a plastic rubbish or garbage bag over the face cloth instead."
                },
                {
                    "headline": "Leave your hair to steam for 30 minutes.",
                    "description": "This gives time for the steam to soak into the strands of your hair. Try to sit relatively still so that the face cloth doesn’t slip off your head. Read a book, watch TV, or simply relax! If you want really moisturised hair, leave it to steam for up to 2 hours. However, be sure to reheat your face cloth 2-3 times during your steam. If the face cloth falls off, simply put it back into its original position and place the shower cap back over it. You might want to reheat it before you replace it if it's cooled off."
                },
                {
                    "headline": "Rinse your hair with cold water.",
                    "description": "Take the shower caps and face cloth off your head and untie your hair, if necessary. Then, adjust the shower to the highest pressure and allow the water to push the conditioner out of your hair. The cold water helps to seal the hair cuticles and locks in moisture. The beautiful moisturised feeling will last about 1 week. Avoid steaming your hair more often than this, as steaming too often weakens your hair. Leave your hair to air-dry. This maximises the moisture in your hair and minimises heat damage."
                }
            ]
        },
        {
            "name": "Steaming Your Hair with a Hooded Dryer",
            "steps": [
                {
                    "headline": "Saturate your hair with a deep conditioner.",
                    "description": "Smooth a small handful of conditioner over your hair. Start at your roots and then work your way down to the ends of your hair. Use your regular conditioner or opt for a deep conditioning product. Where possible, use products with natural ingredients, as these will protect the natural oils in your hair."
                },
                {
                    "headline": "Sit under a hooded dryer for 1 hour.",
                    "description": "Position your head inside the hood of the drying machine and set it to the steam setting. This will create steam inside the dryer, which will cause the conditioner to sink deep into your strands of hair. If the hooded dryer you're using doesn't have a steam setting, you can try putting it on a low setting. However, it's best to get a steamer instead. If you don’t have a hooded dryer, contact your local hair salon and request to use theirs. There is normally a small cost for this. Alternatively, consider purchasing your own from a hair supplies store or online. This is a great option if you want to steam your hair regularly. If your hair hangs below the hooded dryer, tie it up."
                },
                {
                    "headline": "Rinse your hair with cold water in the shower.",
                    "description": "The cold water seals the hair cuticle and locks in moisture, which helps to make your hair look shiny. Stand under the stream of water in the shower and allow the pressure of the water to push the conditioning product out of your hair. If necessary, use your hands to help push the conditioner down your strands of hair."
                },
                {
                    "headline": "Allow your hair to dry naturally.",
                    "description": "This prevents heat damage and helps to keep your hair in pristine condition. The drying time will depend on how long and thick your hair. On average, it will take about 3 - 6 hours for your hair to completely dry. Steam your hair up to once a week, as steaming too often weakens the strands of hair."
                }
            ]
        }
    ],
    "tyn": [
        "Using a Hot Towel",
        "Conditioner",
        "2 shower caps",
        "Face cloth",
        "Gloves",
        "Cold water",
        "Steaming Your Hair with a Hooded Dryer",
        "Hooded dryer"
    ],
    "text": " Using a Hot Towel Smooth 2 tablespoons (30 mL) of conditioner over your hair. Squeeze the conditioner into your hands and rub them together. Then, use your fingers to smooth the conditioner down the shafts of your hair, starting at the roots. Make sure that you apply an even coating. If you run out of conditioner by the time you get to your ends, simply use a little more. If you prefer, you can use your favourite hair oil instead of conditioner. Coconut oil and olive oil are popular moisturising options. Place a shower cap on your head. If you have long hair, tie it up in a low bun first. Then, place the shower cap over your head and tuck any stray hairs underneath. Purchase a shower cap from a pharmacy or the hair care aisle of a supermarket. Wet a face cloth and wring it out. Continue to squeeze the face cloth until there are no drips coming off it. This is important, as hot drips of water have the potential to burn your neck. Shake the face cloth to ensure that there are no drips of water left in it. If you have a hair turban, you can use this instead of a face cloth. Face cloths work well because of their small size. If you don’t have one, use a similar sized cloth instead. Put the face cloth into the microwave for 2 minutes. Set the microwave to the highest setting and press start. This heats up the water in the cloth which will help to steam your hair. Don’t worry if you see steam coming off the cloth while it is in the microwave – this is normal. If your microwave plate is dirty, place the face cloth into a microwave-safe bowl to keep it clean. Place the face cloth on top of the shower cap. Position the face cloth on the middle of your head over the shower cap. If you feel the face cloth slipping down your head, simply adjust it back onto the middle of your head in a more balanced position. Wear gloves when transferring the face cloth to your head to avoid getting burnt. Alternatively, use a potholder to remove the face cloth. Put another shower cap over the face cloth. This helps to stop the heat from escaping and encourages steam to form. Don’t worry if the shower cap doesn’t fit over your whole head, simply stretch it over the face cloth. If you don’t have another shower cap, place a plastic rubbish or garbage bag over the face cloth instead. Leave your hair to steam for 30 minutes. This gives time for the steam to soak into the strands of your hair. Try to sit relatively still so that the face cloth doesn’t slip off your head. Read a book, watch TV, or simply relax! If you want really moisturised hair, leave it to steam for up to 2 hours. However, be sure to reheat your face cloth 2-3 times during your steam. If the face cloth falls off, simply put it back into its original position and place the shower cap back over it. You might want to reheat it before you replace it if it's cooled off. Rinse your hair with cold water. Take the shower caps and face cloth off your head and untie your hair, if necessary. Then, adjust the shower to the highest pressure and allow the water to push the conditioner out of your hair. The cold water helps to seal the hair cuticles and locks in moisture. The beautiful moisturised feeling will last about 1 week. Avoid steaming your hair more often than this, as steaming too often weakens your hair. Leave your hair to air-dry. This maximises the moisture in your hair and minimises heat damage. Steaming Your Hair with a Hooded Dryer Saturate your hair with a deep conditioner. Smooth a small handful of conditioner over your hair. Start at your roots and then work your way down to the ends of your hair. Use your regular conditioner or opt for a deep conditioning product. Where possible, use products with natural ingredients, as these will protect the natural oils in your hair. Sit under a hooded dryer for 1 hour. Position your head inside the hood of the drying machine and set it to the steam setting. This will create steam inside the dryer, which will cause the conditioner to sink deep into your strands of hair. If the hooded dryer you're using doesn't have a steam setting, you can try putting it on a low setting. However, it's best to get a steamer instead. If you don’t have a hooded dryer, contact your local hair salon and request to use theirs. There is normally a small cost for this. Alternatively, consider purchasing your own from a hair supplies store or online. This is a great option if you want to steam your hair regularly. If your hair hangs below the hooded dryer, tie it up. Rinse your hair with cold water in the shower. The cold water seals the hair cuticle and locks in moisture, which helps to make your hair look shiny. Stand under the stream of water in the shower and allow the pressure of the water to push the conditioning product out of your hair. If necessary, use your hands to help push the conditioner down your strands of hair. Allow your hair to dry naturally. This prevents heat damage and helps to keep your hair in pristine condition. The drying time will depend on how long and thick your hair. On average, it will take about 3 - 6 hours for your hair to completely dry. Steam your hair up to once a week, as steaming too often weakens the strands of hair.",
    "sentences": [
        " Using a Hot Towel Smooth 2 tablespoons (30 mL) of conditioner over your hair.",
        "Squeeze the conditioner into your hands and rub them together.",
        "Then, use your fingers to smooth the conditioner down the shafts of your hair, starting at the roots.",
        "Make sure that you apply an even coating.",
        "If you run out of conditioner by the time you get to your ends, simply use a little more.",
        "If you prefer, you can use your favourite hair oil instead of conditioner.",
        "Coconut oil and olive oil are popular moisturising options.",
        "Place a shower cap on your head.",
        "If you have long hair, tie it up in a low bun first.",
        "Then, place the shower cap over your head and tuck any stray hairs underneath.",
        "Purchase a shower cap from a pharmacy or the hair care aisle of a supermarket.",
        "Wet a face cloth and wring it out.",
        "Continue to squeeze the face cloth until there are no drips coming off it.",
        "This is important, as hot drips of water have the potential to burn your neck.",
        "Shake the face cloth to ensure that there are no drips of water left in it.",
        "If you have a hair turban, you can use this instead of a face cloth.",
        "Face cloths work well because of their small size.",
        "If you don’t have one, use a similar sized cloth instead.",
        "Put the face cloth into the microwave for 2 minutes.",
        "Set the microwave to the highest setting and press start.",
        "This heats up the water in the cloth which will help to steam your hair.",
        "Don’t worry if you see steam coming off the cloth while it is in the microwave – this is normal.",
        "If your microwave plate is dirty, place the face cloth into a microwave-safe bowl to keep it clean.",
        "Place the face cloth on top of the shower cap.",
        "Position the face cloth on the middle of your head over the shower cap.",
        "If you feel the face cloth slipping down your head, simply adjust it back onto the middle of your head in a more balanced position.",
        "Wear gloves when transferring the face cloth to your head to avoid getting burnt.",
        "Alternatively, use a potholder to remove the face cloth.",
        "Put another shower cap over the face cloth.",
        "This helps to stop the heat from escaping and encourages steam to form.",
        "Don’t worry if the shower cap doesn’t fit over your whole head, simply stretch it over the face cloth.",
        "If you don’t have another shower cap, place a plastic rubbish or garbage bag over the face cloth instead.",
        "Leave your hair to steam for 30 minutes.",
        "This gives time for the steam to soak into the strands of your hair.",
        "Try to sit relatively still so that the face cloth doesn’t slip off your head.",
        "Read a book, watch TV, or simply relax!",
        "If you want really moisturised hair, leave it to steam for up to 2 hours.",
        "However, be sure to reheat your face cloth 2-3 times during your steam.",
        "If the face cloth falls off, simply put it back into its original position and place the shower cap back over it.",
        "You might want to reheat it before you replace it if it's cooled off.",
        "Rinse your hair with cold water.",
        "Take the shower caps and face cloth off your head and untie your hair, if necessary.",
        "Then, adjust the shower to the highest pressure and allow the water to push the conditioner out of your hair.",
        "The cold water helps to seal the hair cuticles and locks in moisture.",
        "The beautiful moisturised feeling will last about 1 week.",
        "Avoid steaming your hair more often than this, as steaming too often weakens your hair.",
        "Leave your hair to air-dry.",
        "This maximises the moisture in your hair and minimises heat damage.",
        "Steaming Your Hair with a Hooded Dryer Saturate your hair with a deep conditioner.",
        "Smooth a small handful of conditioner over your hair.",
        "Start at your roots and then work your way down to the ends of your hair.",
        "Use your regular conditioner or opt for a deep conditioning product.",
        "Where possible, use products with natural ingredients, as these will protect the natural oils in your hair.",
        "Sit under a hooded dryer for 1 hour.",
        "Position your head inside the hood of the drying machine and set it to the steam setting.",
        "This will create steam inside the dryer, which will cause the conditioner to sink deep into your strands of hair.",
        "If the hooded dryer you're using doesn't have a steam setting, you can try putting it on a low setting.",
        "However, it's best to get a steamer instead.",
        "If you don’t have a hooded dryer, contact your local hair salon and request to use theirs.",
        "There is normally a small cost for this.",
        "Alternatively, consider purchasing your own from a hair supplies store or online.",
        "This is a great option if you want to steam your hair regularly.",
        "If your hair hangs below the hooded dryer, tie it up.",
        "Rinse your hair with cold water in the shower.",
        "The cold water seals the hair cuticle and locks in moisture, which helps to make your hair look shiny.",
        "Stand under the stream of water in the shower and allow the pressure of the water to push the conditioning product out of your hair.",
        "If necessary, use your hands to help push the conditioner down your strands of hair.",
        "Allow your hair to dry naturally.",
        "This prevents heat damage and helps to keep your hair in pristine condition.",
        "The drying time will depend on how long and thick your hair.",
        "On average, it will take about 3 - 6 hours for your hair to completely dry.",
        "Steam your hair up to once a week, as steaming too often weakens the strands of hair."
    ]
}