{
    "title": "How to Clean Cuticles",
    "url": "https://www.wikihow.com/Clean-Cuticles",
    "category_hierarchy": [
        "Health",
        "Musculoskeletal System Health",
        "Arm and Hand Health",
        "Finger Health"
    ],
    "methods": [
        {
            "name": "Caring for Your Cuticles on a Regular Basis",
            "steps": [
                {
                    "headline": "Remove any nail polish from your cuticles or nails.",
                    "description": "Begin by stripping all nail polish from your nails with nail polish remover if needed. If possible, use a brand that doesn’t contain acetone—this harsh chemical can dry both your skin and nails. Non-acetone nail polish remover is also a great way to remove any errant nail polish that may have dried on top of your cuticles. It is kinder on the skin than regular nail polish remover. Rubbing pure coconut on your nail beds is another, more natural, method of removing dried polish from your cuticles. This will only remove the polish from your skin, however, not from the nail itself."
                },
                {
                    "headline": "Soak your fingertips in soapy water for several minutes.",
                    "description": "Fill a bowl with warm water, then add a few drops of hand soap and mix together. Dip the tips of your fingers into the water and let them sit for about 5 minutes. This cleans your nails and cuticles and also softens your skin, making it easier to push back your cuticles later in the process."
                },
                {
                    "headline": "Remove any excess cuticle with cuticle remover solution.",
                    "description": "Once your cuticles have softened in the water, take them out and apply cuticle remover solution to each nail bed. Use a gel that gently dissolves dead overgrowth of the cuticle, which may include some stained or dirty sections. Wait 15 seconds after applying before wiping it off with a clean cotton pad. Avoid trimming or cutting cuticles, which can cause an infection or create irritation."
                },
                {
                    "headline": "Push back your cuticles with a wooden orange stick.",
                    "description": "Using the flat end of the stick, gently push back the cuticles from your nails. You can also dip the end of the stick in cleanser and use it to loosen and remove dirt trapped in the cuticle. Try moving the orange stick around in little circles to remove any bits of dead skin that were dissolved by the gel. Once you’ve pushed back the cuticle on each finger, rinse your hands again in the warm, soapy water. You can buy wooden orange sticks at your local pharmacy or online."
                },
                {
                    "headline": "Cut off hangnails with a cuticle nipper if necessary.",
                    "description": "Using a sharp, clean cuticle nipper, clip off any hangnails that you may have developed. Hangnails are slivers of skin that have split away from the cuticle or fingernail and can be very painful if not removed."
                },
                {
                    "headline": "Apply cuticle cream to moisturize your cuticles.",
                    "description": "Cuticle cream is a waxy product that creates a barrier for moisture and protects cuticles from dry air. Scoop a thin layer of cream from the container with your pointer finger and rub it gently into each of your cuticles on the other hand. Then, switch hands to complete the job. If you don’t have specialized cuticle cream, petroleum jelly is another good option. You can also substitute cuticle oil for cuticle cream. However, the cream lasts longer and holds in more moisture than the oil. Applying the cream keeps dirt or grime from becoming deeply embedded in your cuticles, which can happen when they are cracked and dry."
                }
            ]
        },
        {
            "name": "Dealing with Stained or Dirty Cuticles",
            "steps": [
                {
                    "headline": "Scrub your nails and cuticles with soap and water.",
                    "description": "If your hands are covered with dirt, not oil or grease, all you might need is a vigorous scrubbing with soapy water. Add a several drops of hand soap to a bowl of warm water and mix together with your hands until it becomes sudsy. Soak your nails for about 5 minutes, then use a nail brush to scrub the dirt embedded in the cuticle or nail. A clean toothbrush will also do the trick if you don’t have a nail brush on hand."
                },
                {
                    "headline": "Soak your hands in water mixed with cuticle and stain remover.",
                    "description": "You can buy cuticle and stain remover solution from your local pharmacy or online. Mix several drops of the solution into a bowl filled with warm water, then soak your fingers for no more than 10 minutes. Cuticle and stain remover is a powerful product that can remove the majority of stains from the cuticles and nails, but be cautious not to overexpose your skin. Never soak more than 10 minutes, and make sure to always dilute the product with water before soaking."
                },
                {
                    "headline": "Mix lemon juice, baking soda, and water for a whitening solution.",
                    "description": "In a bowl, combine 3 tablespoons (44 mL) lemon juice, 2 tablespoons (30 mL) baking soda, and 6 fluid ounces (180 mL) warm water. Mix them together and soak your fingertips in the bowl for roughly 5 minutes. Then, scrub your nails with a nylon brush. Lemon juice and baking soda are also used to help whiten nails."
                },
                {
                    "headline": "Wash your cuticles with pumice hand cleanser to remove tough grease.",
                    "description": "Pumice is a lightweight volcanic rock that’s often ground up and used as a mild abrasive. It can help to scrub off the toughest grime and grease when you rub your hands together during the washing process. After you’ve washed your hands initially, apply a dollop of the pumice soap to a nail brush and use that to scrub your individual cuticles for a deeper clean. Pumice soap can help remove things like automotive grease, oil, paint, tar, and sap from your fingers and cuticles."
                }
            ]
        }
    ],
    "tyn": [
        "Caring for Your Cuticles on a Regular Basis",
        "Non-acetone nail polish remover",
        "Hand soap",
        "Bowl",
        "Warm water",
        "Cuticle removal solution",
        "Orange stick",
        "Cuticle nipper",
        "Cuticle cream",
        "Cotton pads",
        "Dealing with Stained or Dirty Cuticles",
        "Nail brush",
        "Cuticle and stain remover",
        "Lemon juice",
        "Baking soda",
        "Pumice hand cleaner"
    ],
    "text": " Caring for Your Cuticles on a Regular Basis Remove any nail polish from your cuticles or nails. Begin by stripping all nail polish from your nails with nail polish remover if needed. If possible, use a brand that doesn’t contain acetone—this harsh chemical can dry both your skin and nails. Non-acetone nail polish remover is also a great way to remove any errant nail polish that may have dried on top of your cuticles. It is kinder on the skin than regular nail polish remover. Rubbing pure coconut on your nail beds is another, more natural, method of removing dried polish from your cuticles. This will only remove the polish from your skin, however, not from the nail itself. Soak your fingertips in soapy water for several minutes. Fill a bowl with warm water, then add a few drops of hand soap and mix together. Dip the tips of your fingers into the water and let them sit for about 5 minutes. This cleans your nails and cuticles and also softens your skin, making it easier to push back your cuticles later in the process. Remove any excess cuticle with cuticle remover solution. Once your cuticles have softened in the water, take them out and apply cuticle remover solution to each nail bed. Use a gel that gently dissolves dead overgrowth of the cuticle, which may include some stained or dirty sections. Wait 15 seconds after applying before wiping it off with a clean cotton pad. Avoid trimming or cutting cuticles, which can cause an infection or create irritation. Push back your cuticles with a wooden orange stick. Using the flat end of the stick, gently push back the cuticles from your nails. You can also dip the end of the stick in cleanser and use it to loosen and remove dirt trapped in the cuticle. Try moving the orange stick around in little circles to remove any bits of dead skin that were dissolved by the gel. Once you’ve pushed back the cuticle on each finger, rinse your hands again in the warm, soapy water. You can buy wooden orange sticks at your local pharmacy or online. Cut off hangnails with a cuticle nipper if necessary. Using a sharp, clean cuticle nipper, clip off any hangnails that you may have developed. Hangnails are slivers of skin that have split away from the cuticle or fingernail and can be very painful if not removed. Apply cuticle cream to moisturize your cuticles. Cuticle cream is a waxy product that creates a barrier for moisture and protects cuticles from dry air. Scoop a thin layer of cream from the container with your pointer finger and rub it gently into each of your cuticles on the other hand. Then, switch hands to complete the job. If you don’t have specialized cuticle cream, petroleum jelly is another good option. You can also substitute cuticle oil for cuticle cream. However, the cream lasts longer and holds in more moisture than the oil. Applying the cream keeps dirt or grime from becoming deeply embedded in your cuticles, which can happen when they are cracked and dry. Dealing with Stained or Dirty Cuticles Scrub your nails and cuticles with soap and water. If your hands are covered with dirt, not oil or grease, all you might need is a vigorous scrubbing with soapy water. Add a several drops of hand soap to a bowl of warm water and mix together with your hands until it becomes sudsy. Soak your nails for about 5 minutes, then use a nail brush to scrub the dirt embedded in the cuticle or nail. A clean toothbrush will also do the trick if you don’t have a nail brush on hand. Soak your hands in water mixed with cuticle and stain remover. You can buy cuticle and stain remover solution from your local pharmacy or online. Mix several drops of the solution into a bowl filled with warm water, then soak your fingers for no more than 10 minutes. Cuticle and stain remover is a powerful product that can remove the majority of stains from the cuticles and nails, but be cautious not to overexpose your skin. Never soak more than 10 minutes, and make sure to always dilute the product with water before soaking. Mix lemon juice, baking soda, and water for a whitening solution. In a bowl, combine 3 tablespoons (44 mL) lemon juice, 2 tablespoons (30 mL) baking soda, and 6 fluid ounces (180 mL) warm water. Mix them together and soak your fingertips in the bowl for roughly 5 minutes. Then, scrub your nails with a nylon brush. Lemon juice and baking soda are also used to help whiten nails. Wash your cuticles with pumice hand cleanser to remove tough grease. Pumice is a lightweight volcanic rock that’s often ground up and used as a mild abrasive. It can help to scrub off the toughest grime and grease when you rub your hands together during the washing process. After you’ve washed your hands initially, apply a dollop of the pumice soap to a nail brush and use that to scrub your individual cuticles for a deeper clean. Pumice soap can help remove things like automotive grease, oil, paint, tar, and sap from your fingers and cuticles.",
    "sentences": [
        " Caring for Your Cuticles on a Regular Basis Remove any nail polish from your cuticles or nails.",
        "Begin by stripping all nail polish from your nails with nail polish remover if needed.",
        "If possible, use a brand that doesn’t contain acetone—this harsh chemical can dry both your skin and nails.",
        "Non-acetone nail polish remover is also a great way to remove any errant nail polish that may have dried on top of your cuticles.",
        "It is kinder on the skin than regular nail polish remover.",
        "Rubbing pure coconut on your nail beds is another, more natural, method of removing dried polish from your cuticles.",
        "This will only remove the polish from your skin, however, not from the nail itself.",
        "Soak your fingertips in soapy water for several minutes.",
        "Fill a bowl with warm water, then add a few drops of hand soap and mix together.",
        "Dip the tips of your fingers into the water and let them sit for about 5 minutes.",
        "This cleans your nails and cuticles and also softens your skin, making it easier to push back your cuticles later in the process.",
        "Remove any excess cuticle with cuticle remover solution.",
        "Once your cuticles have softened in the water, take them out and apply cuticle remover solution to each nail bed.",
        "Use a gel that gently dissolves dead overgrowth of the cuticle, which may include some stained or dirty sections.",
        "Wait 15 seconds after applying before wiping it off with a clean cotton pad.",
        "Avoid trimming or cutting cuticles, which can cause an infection or create irritation.",
        "Push back your cuticles with a wooden orange stick.",
        "Using the flat end of the stick, gently push back the cuticles from your nails.",
        "You can also dip the end of the stick in cleanser and use it to loosen and remove dirt trapped in the cuticle.",
        "Try moving the orange stick around in little circles to remove any bits of dead skin that were dissolved by the gel.",
        "Once you’ve pushed back the cuticle on each finger, rinse your hands again in the warm, soapy water.",
        "You can buy wooden orange sticks at your local pharmacy or online.",
        "Cut off hangnails with a cuticle nipper if necessary.",
        "Using a sharp, clean cuticle nipper, clip off any hangnails that you may have developed.",
        "Hangnails are slivers of skin that have split away from the cuticle or fingernail and can be very painful if not removed.",
        "Apply cuticle cream to moisturize your cuticles.",
        "Cuticle cream is a waxy product that creates a barrier for moisture and protects cuticles from dry air.",
        "Scoop a thin layer of cream from the container with your pointer finger and rub it gently into each of your cuticles on the other hand.",
        "Then, switch hands to complete the job.",
        "If you don’t have specialized cuticle cream, petroleum jelly is another good option.",
        "You can also substitute cuticle oil for cuticle cream.",
        "However, the cream lasts longer and holds in more moisture than the oil.",
        "Applying the cream keeps dirt or grime from becoming deeply embedded in your cuticles, which can happen when they are cracked and dry.",
        "Dealing with Stained or Dirty Cuticles Scrub your nails and cuticles with soap and water.",
        "If your hands are covered with dirt, not oil or grease, all you might need is a vigorous scrubbing with soapy water.",
        "Add a several drops of hand soap to a bowl of warm water and mix together with your hands until it becomes sudsy.",
        "Soak your nails for about 5 minutes, then use a nail brush to scrub the dirt embedded in the cuticle or nail.",
        "A clean toothbrush will also do the trick if you don’t have a nail brush on hand.",
        "Soak your hands in water mixed with cuticle and stain remover.",
        "You can buy cuticle and stain remover solution from your local pharmacy or online.",
        "Mix several drops of the solution into a bowl filled with warm water, then soak your fingers for no more than 10 minutes.",
        "Cuticle and stain remover is a powerful product that can remove the majority of stains from the cuticles and nails, but be cautious not to overexpose your skin.",
        "Never soak more than 10 minutes, and make sure to always dilute the product with water before soaking.",
        "Mix lemon juice, baking soda, and water for a whitening solution.",
        "In a bowl, combine 3 tablespoons (44 mL) lemon juice, 2 tablespoons (30 mL) baking soda, and 6 fluid ounces (180 mL) warm water.",
        "Mix them together and soak your fingertips in the bowl for roughly 5 minutes.",
        "Then, scrub your nails with a nylon brush.",
        "Lemon juice and baking soda are also used to help whiten nails.",
        "Wash your cuticles with pumice hand cleanser to remove tough grease.",
        "Pumice is a lightweight volcanic rock that’s often ground up and used as a mild abrasive.",
        "It can help to scrub off the toughest grime and grease when you rub your hands together during the washing process.",
        "After you’ve washed your hands initially, apply a dollop of the pumice soap to a nail brush and use that to scrub your individual cuticles for a deeper clean.",
        "Pumice soap can help remove things like automotive grease, oil, paint, tar, and sap from your fingers and cuticles."
    ]
}