{
    "title": "How to Change Your Mercruiser Water Separating Fuel Filter",
    "url": "https://www.wikihow.com/Change-Your-Mercruiser-Water-Separating-Fuel-Filter",
    "category_hierarchy": [
        "Cars & Other Vehicles"
    ],
    "steps": [
        {
            "headline": "Turn off your battery switches or disconnect the boat's batteries.",
            "description": ""
        },
        {
            "headline": "Turn off your fuel supply valve (if equipped).",
            "description": ""
        },
        {
            "headline": "Position a fan to ventilate the bilge and work area.",
            "description": ""
        },
        {
            "headline": "Place some absorbent towels under the filter to catch any spilt fuel.",
            "description": ""
        },
        {
            "headline": "Using a fuel filter wrench, remove the old fuel filter.",
            "description": ""
        },
        {
            "headline": "Pour the old fuel from the filter into a clean white bucket and look for evidence of debris or water in the old fuel.",
            "description": "If you noticed a large amount of dirt or water in your old fuel filter, schedule another fuel filter replacement for after your next boating trip."
        },
        {
            "headline": "Inspect the filter mount bracket to insure that the old filter O-Ring has been removed.",
            "description": ""
        },
        {
            "headline": "Wipe clean the filter bracket and inspect the surfaces where the o-ring will have to seal.",
            "description": ""
        },
        {
            "headline": "Replace any damaged filter brackets.",
            "description": ""
        },
        {
            "headline": "Open and inspect your new filter.",
            "description": ""
        },
        {
            "headline": "Pour some clean fuel into the filter for easier start-up.",
            "description": ""
        },
        {
            "headline": "Inspect the new filter o-ring and make sure it's properly positioned on the filter.",
            "description": ""
        },
        {
            "headline": "Coat the new o-ring with a little clean motor oil.",
            "description": ""
        },
        {
            "headline": "Spin the new filter onto the filter bracket until hand tight.",
            "description": ""
        },
        {
            "headline": "Use the filter wrench to snug up the filter another 1/2 turn or whatever the filters instructions suggest.",
            "description": "Never over-tighten a filter."
        },
        {
            "headline": "Clean up any split fuel and clear the area of all fumes.",
            "description": ""
        },
        {
            "headline": "Open your fuel valve.",
            "description": ""
        },
        {
            "headline": "Turn on or connect the boat's batteries.",
            "description": ""
        },
        {
            "headline": "Test run the boat and check for fuel leaks right away.",
            "description": ""
        }
    ],
    "tyn": [
        "New fuel filter.",
        "Fuel Filter Wrench.",
        "Absorbent towels/rags.",
        "Fan.",
        "New motor oil.",
        "Clean bucket."
    ],
    "text": " Turn off your battery switches or disconnect the boat's batteries.  Turn off your fuel supply valve (if equipped).  Position a fan to ventilate the bilge and work area.  Place some absorbent towels under the filter to catch any spilt fuel.  Using a fuel filter wrench, remove the old fuel filter.  Pour the old fuel from the filter into a clean white bucket and look for evidence of debris or water in the old fuel. If you noticed a large amount of dirt or water in your old fuel filter, schedule another fuel filter replacement for after your next boating trip. Inspect the filter mount bracket to insure that the old filter O-Ring has been removed.  Wipe clean the filter bracket and inspect the surfaces where the o-ring will have to seal.  Replace any damaged filter brackets.  Open and inspect your new filter.  Pour some clean fuel into the filter for easier start-up.  Inspect the new filter o-ring and make sure it's properly positioned on the filter.  Coat the new o-ring with a little clean motor oil.  Spin the new filter onto the filter bracket until hand tight.  Use the filter wrench to snug up the filter another 1/2 turn or whatever the filters instructions suggest. Never over-tighten a filter. Clean up any split fuel and clear the area of all fumes.  Open your fuel valve.  Turn on or connect the boat's batteries.  Test run the boat and check for fuel leaks right away. ",
    "sentences": [
        " Turn off your battery switches or disconnect the boat's batteries.",
        "Turn off your fuel supply valve (if equipped).",
        "Position a fan to ventilate the bilge and work area.",
        "Place some absorbent towels under the filter to catch any spilt fuel.",
        "Using a fuel filter wrench, remove the old fuel filter.",
        "Pour the old fuel from the filter into a clean white bucket and look for evidence of debris or water in the old fuel.",
        "If you noticed a large amount of dirt or water in your old fuel filter, schedule another fuel filter replacement for after your next boating trip.",
        "Inspect the filter mount bracket to insure that the old filter O-Ring has been removed.",
        "Wipe clean the filter bracket and inspect the surfaces where the o-ring will have to seal.",
        "Replace any damaged filter brackets.",
        "Open and inspect your new filter.",
        "Pour some clean fuel into the filter for easier start-up.",
        "Inspect the new filter o-ring and make sure it's properly positioned on the filter.",
        "Coat the new o-ring with a little clean motor oil.",
        "Spin the new filter onto the filter bracket until hand tight.",
        "Use the filter wrench to snug up the filter another 1/2 turn or whatever the filters instructions suggest.",
        "Never over-tighten a filter.",
        "Clean up any split fuel and clear the area of all fumes.",
        "Open your fuel valve.",
        "Turn on or connect the boat's batteries.",
        "Test run the boat and check for fuel leaks right away."
    ]
}