{
    "title": "How to Hang String Lights in a Backyard Without Trees",
    "url": "https://www.wikihow.com/Hang-String-Lights-in-a-Backyard-Without-Trees",
    "category_hierarchy": [
        "Home and Garden",
        "Lighting",
        "Rope Lights"
    ],
    "methods": [
        {
            "name": "Hanging Lights along a Fence",
            "steps": [
                {
                    "headline": "Lay your string lights out along the fence where you want to hang them.",
                    "description": "This will give you an idea of how much length you will need and how many support posts you will need to install. You can lay them on the ground along your fence line or have a friend hold up one end while you hold the other to mimic how the lights will hang. Mark on your fence with a pencil or tape where you will need support posts. You want to leave a little bit of slack so that the lights can hang and move a little bit. Check for an external outlet or decide where you will keep your extension cord as a power source for your lights."
                },
                {
                    "headline": "Select wooden posts that can support your lights.",
                    "description": "Depending on the weight of your string lights, and your desired aesthetic, choose wooden posts that will be able to hold them up and are strong enough to withstand the outside elements. Be sure you get posts that are the same size, shape, and length. You always have the option of painting your posts to your desired color as well!"
                },
                {
                    "headline": "Attach metal mounting hooks or cup hooks onto the wooden posts.",
                    "description": "These hooks will hold your string lights so you want to be sure that you secure them firmly. Screw your mounting hooks or cup hooks into the wooden posts at one end."
                },
                {
                    "headline": "Install the posts onto your fence to support your lights.",
                    "description": "Using a hammer and nails or a drill and screws, attach your wooden posts securely to your fence. Use a tape measure to measure the height of your posts so that they are mounted at the same level and your lights will hang evenly. Make sure they are spaced out far enough to support your lights."
                },
                {
                    "headline": "Hang the lights along the fence using the hooks to support them.",
                    "description": "Now that you have installed the support for your lights, it’s time to hang them! First, plug the lights into the outlet or extension cord and place the first bulb next to the mounting hardware to check the spacing. Then, unplug the lights to hang the rest of the string with no power connected. Work your way along the fence to hang the lights on the supports. If you want to hang your lights directly onto your fence, you can simply attach metal mounting hooks or cup hooks onto your fence and suspend your lights from them!"
                }
            ]
        },
        {
            "name": "Hanging String Lights above an Open Space",
            "steps": [
                {
                    "headline": "Identify any existing supports you can use to hang your string lights.",
                    "description": "If you plan to hang your lights above your deck or patio, you should first check for sturdy places that already exist that you can use to mount them. Places like a roof, a deck, a railing, a fence, pergola, or the eaves of your house make great supports for you lights! If these natural supports have different heights, make sure your lights will reach from point to point!"
                },
                {
                    "headline": "Mark with tape where you will to need create your own supports.",
                    "description": "If you have a gap where this is no support or don’t have any natural supports around at all, you will need to make your own supports for your hanging lights. You can use tape to mark where you will need to create a support."
                },
                {
                    "headline": "Get tall metal poles or wooden posts to use as supports for your lights.",
                    "description": "Because you are covering an open area, you will need to get poles or posts that are tall enough to hang your lights so people can walk or sit beneath them. Metal poles are the strongest option but wooden posts can look more visually appealing and may be strong enough to support your lights, depending on how large of an area you are covering."
                },
                {
                    "headline": "Use deep, heavy planters or buckets to support a post or pole.",
                    "description": "This is one solution to making your own support that you can suspend your lights from. You can arrange the planters around the perimeter of the space you want to hang your lights over, insert a pole or post with a hook on it into the center, and fill them with heavy materials like gravel or concrete. Be sure that the pole or post is secure and doesn’t wobble around. Place the planters or buckets where you want them before you fill them as they will be very heavy!"
                },
                {
                    "headline": "Drive stakes into the ground and slide hollow metal poles onto them.",
                    "description": "This is an easy and inexpensive way to create very strong supports that you can attach your lights to. Use 18-inch-long rebar stakes and hammer them halfway into the ground, then slide the hollow metal pole onto it. Instead of hooks, you can use cable ties or zip ties to attach your string lights."
                },
                {
                    "headline": "Hang your lights between the posts or poles using hooks or cable ties.",
                    "description": "With the planters, buckets, or poles positioned around the perimeter of the area you want to hang your lights over, it’s time to string the lights between them! Weave the lights from one pole to another. If you attached hooks to the posts or poles, you can attach the lights there. If you do not have hooks attached, you can secure the string lights to the ends of the poles using cable ties or zip ties for a strong connection. Be sure to hang the lights a little loosely to allow a little bit of give, especially if your backyard gets a fair amount of wind."
                }
            ]
        }
    ],
    "tyn": [
        "Hanging Lights along a Fence",
        "Tape measure",
        "Pencil or tape",
        "Hammer or drill",
        "Nails or screws",
        "Metal mounting hooks or cup hooks",
        "Wooden posts",
        "Outdoor extension cord, if needed",
        "Hanging String Lights above an Open Space",
        "Tall metal poles or wooden posts",
        "Heavy planters or buckets",
        "18-inch-long rebar stakes, if needed",
        "Tall, hollow metal poles, if using stakes",
        "Mounting hooks, cup hooks, zip ties, or cable ties"
    ],
    "text": " Hanging Lights along a Fence Lay your string lights out along the fence where you want to hang them. This will give you an idea of how much length you will need and how many support posts you will need to install. You can lay them on the ground along your fence line or have a friend hold up one end while you hold the other to mimic how the lights will hang. Mark on your fence with a pencil or tape where you will need support posts. You want to leave a little bit of slack so that the lights can hang and move a little bit. Check for an external outlet or decide where you will keep your extension cord as a power source for your lights. Select wooden posts that can support your lights. Depending on the weight of your string lights, and your desired aesthetic, choose wooden posts that will be able to hold them up and are strong enough to withstand the outside elements. Be sure you get posts that are the same size, shape, and length. You always have the option of painting your posts to your desired color as well! Attach metal mounting hooks or cup hooks onto the wooden posts. These hooks will hold your string lights so you want to be sure that you secure them firmly. Screw your mounting hooks or cup hooks into the wooden posts at one end. Install the posts onto your fence to support your lights. Using a hammer and nails or a drill and screws, attach your wooden posts securely to your fence. Use a tape measure to measure the height of your posts so that they are mounted at the same level and your lights will hang evenly. Make sure they are spaced out far enough to support your lights. Hang the lights along the fence using the hooks to support them. Now that you have installed the support for your lights, it’s time to hang them! First, plug the lights into the outlet or extension cord and place the first bulb next to the mounting hardware to check the spacing. Then, unplug the lights to hang the rest of the string with no power connected. Work your way along the fence to hang the lights on the supports. If you want to hang your lights directly onto your fence, you can simply attach metal mounting hooks or cup hooks onto your fence and suspend your lights from them! Hanging String Lights above an Open Space Identify any existing supports you can use to hang your string lights. If you plan to hang your lights above your deck or patio, you should first check for sturdy places that already exist that you can use to mount them. Places like a roof, a deck, a railing, a fence, pergola, or the eaves of your house make great supports for you lights! If these natural supports have different heights, make sure your lights will reach from point to point! Mark with tape where you will to need create your own supports. If you have a gap where this is no support or don’t have any natural supports around at all, you will need to make your own supports for your hanging lights. You can use tape to mark where you will need to create a support. Get tall metal poles or wooden posts to use as supports for your lights. Because you are covering an open area, you will need to get poles or posts that are tall enough to hang your lights so people can walk or sit beneath them. Metal poles are the strongest option but wooden posts can look more visually appealing and may be strong enough to support your lights, depending on how large of an area you are covering. Use deep, heavy planters or buckets to support a post or pole. This is one solution to making your own support that you can suspend your lights from. You can arrange the planters around the perimeter of the space you want to hang your lights over, insert a pole or post with a hook on it into the center, and fill them with heavy materials like gravel or concrete. Be sure that the pole or post is secure and doesn’t wobble around. Place the planters or buckets where you want them before you fill them as they will be very heavy! Drive stakes into the ground and slide hollow metal poles onto them. This is an easy and inexpensive way to create very strong supports that you can attach your lights to. Use 18-inch-long rebar stakes and hammer them halfway into the ground, then slide the hollow metal pole onto it. Instead of hooks, you can use cable ties or zip ties to attach your string lights. Hang your lights between the posts or poles using hooks or cable ties. With the planters, buckets, or poles positioned around the perimeter of the area you want to hang your lights over, it’s time to string the lights between them! Weave the lights from one pole to another. If you attached hooks to the posts or poles, you can attach the lights there. If you do not have hooks attached, you can secure the string lights to the ends of the poles using cable ties or zip ties for a strong connection. Be sure to hang the lights a little loosely to allow a little bit of give, especially if your backyard gets a fair amount of wind.",
    "sentences": [
        " Hanging Lights along a Fence Lay your string lights out along the fence where you want to hang them.",
        "This will give you an idea of how much length you will need and how many support posts you will need to install.",
        "You can lay them on the ground along your fence line or have a friend hold up one end while you hold the other to mimic how the lights will hang.",
        "Mark on your fence with a pencil or tape where you will need support posts.",
        "You want to leave a little bit of slack so that the lights can hang and move a little bit.",
        "Check for an external outlet or decide where you will keep your extension cord as a power source for your lights.",
        "Select wooden posts that can support your lights.",
        "Depending on the weight of your string lights, and your desired aesthetic, choose wooden posts that will be able to hold them up and are strong enough to withstand the outside elements.",
        "Be sure you get posts that are the same size, shape, and length.",
        "You always have the option of painting your posts to your desired color as well!",
        "Attach metal mounting hooks or cup hooks onto the wooden posts.",
        "These hooks will hold your string lights so you want to be sure that you secure them firmly.",
        "Screw your mounting hooks or cup hooks into the wooden posts at one end.",
        "Install the posts onto your fence to support your lights.",
        "Using a hammer and nails or a drill and screws, attach your wooden posts securely to your fence.",
        "Use a tape measure to measure the height of your posts so that they are mounted at the same level and your lights will hang evenly.",
        "Make sure they are spaced out far enough to support your lights.",
        "Hang the lights along the fence using the hooks to support them.",
        "Now that you have installed the support for your lights, it’s time to hang them!",
        "First, plug the lights into the outlet or extension cord and place the first bulb next to the mounting hardware to check the spacing.",
        "Then, unplug the lights to hang the rest of the string with no power connected.",
        "Work your way along the fence to hang the lights on the supports.",
        "If you want to hang your lights directly onto your fence, you can simply attach metal mounting hooks or cup hooks onto your fence and suspend your lights from them!",
        "Hanging String Lights above an Open Space Identify any existing supports you can use to hang your string lights.",
        "If you plan to hang your lights above your deck or patio, you should first check for sturdy places that already exist that you can use to mount them.",
        "Places like a roof, a deck, a railing, a fence, pergola, or the eaves of your house make great supports for you lights!",
        "If these natural supports have different heights, make sure your lights will reach from point to point!",
        "Mark with tape where you will to need create your own supports.",
        "If you have a gap where this is no support or don’t have any natural supports around at all, you will need to make your own supports for your hanging lights.",
        "You can use tape to mark where you will need to create a support.",
        "Get tall metal poles or wooden posts to use as supports for your lights.",
        "Because you are covering an open area, you will need to get poles or posts that are tall enough to hang your lights so people can walk or sit beneath them.",
        "Metal poles are the strongest option but wooden posts can look more visually appealing and may be strong enough to support your lights, depending on how large of an area you are covering.",
        "Use deep, heavy planters or buckets to support a post or pole.",
        "This is one solution to making your own support that you can suspend your lights from.",
        "You can arrange the planters around the perimeter of the space you want to hang your lights over, insert a pole or post with a hook on it into the center, and fill them with heavy materials like gravel or concrete.",
        "Be sure that the pole or post is secure and doesn’t wobble around.",
        "Place the planters or buckets where you want them before you fill them as they will be very heavy!",
        "Drive stakes into the ground and slide hollow metal poles onto them.",
        "This is an easy and inexpensive way to create very strong supports that you can attach your lights to.",
        "Use 18-inch-long rebar stakes and hammer them halfway into the ground, then slide the hollow metal pole onto it.",
        "Instead of hooks, you can use cable ties or zip ties to attach your string lights.",
        "Hang your lights between the posts or poles using hooks or cable ties.",
        "With the planters, buckets, or poles positioned around the perimeter of the area you want to hang your lights over, it’s time to string the lights between them!",
        "Weave the lights from one pole to another.",
        "If you attached hooks to the posts or poles, you can attach the lights there.",
        "If you do not have hooks attached, you can secure the string lights to the ends of the poles using cable ties or zip ties for a strong connection.",
        "Be sure to hang the lights a little loosely to allow a little bit of give, especially if your backyard gets a fair amount of wind."
    ]
}