{
    "title": "How to Paint Rims with Plasti Dip",
    "url": "https://www.wikihow.com/Paint-Rims-with-Plasti-Dip",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Cleaning and Protecting Your Work Space",
            "steps": [
                {
                    "headline": "Rinse your rims off with clean water from a hose.",
                    "description": "Over time, your vehicle’s wheels get covered in debris from the road and dust from your brakes. Point the end of your hose at your rims and rinse them off completely. Make sure to rinse all the way around the rim to remove as much of the debris as you can. You can also use a pressure washer attachment on your hose to get more cleaning power."
                },
                {
                    "headline": "Wipe your rims off with an all-purpose cleaner and dry them.",
                    "description": "Spray an all-purpose cleaner directly onto your rims to coat them. Use a clean rag to wipe the surfaces on your rims to remove any brake dust or dirt that’s still on them. Reach behind the rims with your rag and wipe the back side of your rims as well as you can. Make sure your rims are completely dry before applying any Plasti Dip or else it may form bubbles."
                },
                {
                    "headline": "Tape plastic covers over your brake pads.",
                    "description": "Feed the corner of a plastic cover through your rims so it’s over your brake cylinders. Work the cover around the brakes so they’re completely covered and Plasti Dip can’t get on them. Once you can’t see the brakes underneath the plastic, use a piece of painter’s tape to secure the plastic in place. You can buy plastic covers from an auto care or hardware store. If you don’t have plastic covers, cut a garbage bag in half instead.Tip: You can take off your vehicle’s wheels if you don’t want to cover the brake pads. Work on the rear wheels first before switching to the front wheels."
                },
                {
                    "headline": "Line the edges of your rims with painter’s tape.",
                    "description": "Rip off small pieces of tap and layer them around the outside of your rims. Overlap the tape so the Plasti Dip can’t get between the pieces. Make sure the tape extends about 1–2 in (2.5–5.1 cm) out from the rim to prevent any overspray. You can also cover the rest of your tires with plastic covers if you want, but it’s not necessary to do since Plasti Dip peels off easily from rubber."
                },
                {
                    "headline": "Put a piece of cardboard underneath the wheel you’re working on.",
                    "description": "Make sure to work outside or in a well-ventilated area to prevent any fumes from building up. Place a piece of cardboard that extends 1–2 feet (30–61 cm) from the bottom of your tires so you don’t get any Plasti Dip on the ground. If you need to, layer multiple pieces of cardboard to protect the area. You can also use old rags instead of cardboard."
                }
            ]
        },
        {
            "name": "Applying the Plasti Dip",
            "steps": [
                {
                    "headline": "Heat the Plasti Dip for 1 minute in a bucket full of warm water.",
                    "description": "Fill a bucket or container with warm water from your sink. Slowly lower the can of Plasti Dip you’re using into the water, making sure the nozzle doesn’t get submerged. After 1 minute, take the can of Plasti Dip out from the bucket and dry it off with a rag. Heating the can before you use it makes the spray more consistent so it doesn’t form bubbles or air pockets on your rims. You can buy Plasti Dip online or from auto care stores."
                },
                {
                    "headline": "Wear goggles and a respirator when you spray the Plasti Dip.",
                    "description": "Put on goggles and use a respirator that cover your mouth, nose, and eyes. Hold the can 6 in (15 cm) from your rims and press down on the nozzle. Use short bursts to apply the Plasti Dip onto your rims, working your way around them. Make sure to spray between the gaps in your rims to coat the inside of them as well. Aim to get about 50% coverage with your first coat. Plasti Dip creates fumes that could be harmful if inhaled."
                },
                {
                    "headline": "Let the first coat dry for 5-15 minutes.",
                    "description": "Plasti Dip is quick-setting, so leave the first coat to dry for about 5 minutes. Touch an inconspicuous spot on your rims to see if the coat feels tacky. If it does, allow it to dry for up to 15 minutes. If it doesn’t feel sticky, you can start your next coat. Your rims may take longer to dry if you have humid weather."
                },
                {
                    "headline": "Apply a second coat and let it dry.",
                    "description": "Start spraying the Plasti Dip onto your rims from 6 in (15 cm). Focus on areas that look spotty or weren’t covered as well by the first coat you applied. It’s okay to apply a thicker layer of Plasti Dip during your second coat, but be sure to spray it evenly so it doesn’t form bubbles. When you’re finished with the second coat, let it dry for another 5-15 minutes. If the Plasti Dip does form bubbles, you can either go over it with more coats to hide them or peel it off to start over.Tip: If the Plasti Dip has cooled down in between coats, put the can back in warm water for 1 minute before applying it."
                },
                {
                    "headline": "Move your vehicle to rotate your tires by 180 degrees.",
                    "description": "In between the second and third coat of Plasti Dip, get in your vehicle and pull it forward. Go slowly so your tires rotate 180 degrees. That way, you can see if there are any spots you missed or that need better coverage during the next coat. If you’ve taken the tires off your vehicle to apply Plasti Dip, then flip them over so you can apply it to the back as well."
                },
                {
                    "headline": "Put on a third and fourth coat of Plasti Dip.",
                    "description": "Spray at least 1 more coat of Plasti Dip onto your rims to cover any spots you may have missed or that don’t have an even finish. Let the next coat dry for another 5-15 minutes. If you still have areas that don’t have equal coverage, then put on a thin fourth coat and wait until they are dry to use. Coating all 4 tires on your vehicle usually takes about 4 cans of Plasti Dip."
                }
            ]
        },
        {
            "name": "Finishing Your Rims",
            "steps": [
                {
                    "headline": "Add a coat of spray gloss if you don’t want a matte finish.",
                    "description": "While Plasti Dip has a matte finish, adding a coat of gloss adds shine to your rims. Hold the can of gloss 6 in (15 cm) away from the rim and spray it on in short bursts. Evenly cover all areas of your rims so they have an even finish. Let the gloss dry for at least 20-30 minutes\nYou can buy gloss from any auto care store. You only need 1 coat of gloss, but you can apply additional layers if you want them to look shinier."
                },
                {
                    "headline": "Remove the tape and plastic covers from your tires.",
                    "description": "Use your fingernail to peel the edge of the tape off of your wheel after your final layer of Plasti Dip or gloss finish is dry. Slowly peel off the tape around your rims to completely remove it. Reach in between the rims to pull the plastic covers from your brakes. Be careful while peeling off the tape since pulling it off quickly could take off the Plasti Dip coating on your rims."
                },
                {
                    "headline": "Peel or wipe off any Plasti Dip that dried on the tires.",
                    "description": "If you accidentally oversprayed and there’s Plasti Dip on your tires, use your fingernail to peel the edges. If you can't get a good grip with your fingernail, use a dry cleaning cloth in circular motions to break the Plasti Dip off.Tip: For difficult dried-on Plasti Dip, spray a small amount of WD-40 onto the tire and wipe it off after 5 minutes."
                }
            ]
        }
    ],
    "tyn": [
        "Hose",
        "All-purpose cleaner",
        "Cleaning rag",
        "Plastic cover",
        "Painter’s tape",
        "Cardboard",
        "Bucket",
        "Plasti Dip",
        "Spray gloss (optional)"
    ],
    "text": " Cleaning and Protecting Your Work Space Rinse your rims off with clean water from a hose. Over time, your vehicle’s wheels get covered in debris from the road and dust from your brakes. Point the end of your hose at your rims and rinse them off completely. Make sure to rinse all the way around the rim to remove as much of the debris as you can. You can also use a pressure washer attachment on your hose to get more cleaning power. Wipe your rims off with an all-purpose cleaner and dry them. Spray an all-purpose cleaner directly onto your rims to coat them. Use a clean rag to wipe the surfaces on your rims to remove any brake dust or dirt that’s still on them. Reach behind the rims with your rag and wipe the back side of your rims as well as you can. Make sure your rims are completely dry before applying any Plasti Dip or else it may form bubbles. Tape plastic covers over your brake pads. Feed the corner of a plastic cover through your rims so it’s over your brake cylinders. Work the cover around the brakes so they’re completely covered and Plasti Dip can’t get on them. Once you can’t see the brakes underneath the plastic, use a piece of painter’s tape to secure the plastic in place. You can buy plastic covers from an auto care or hardware store. If you don’t have plastic covers, cut a garbage bag in half instead.Tip: You can take off your vehicle’s wheels if you don’t want to cover the brake pads. Work on the rear wheels first before switching to the front wheels. Line the edges of your rims with painter’s tape. Rip off small pieces of tap and layer them around the outside of your rims. Overlap the tape so the Plasti Dip can’t get between the pieces. Make sure the tape extends about 1–2 in (2.5–5.1 cm) out from the rim to prevent any overspray. You can also cover the rest of your tires with plastic covers if you want, but it’s not necessary to do since Plasti Dip peels off easily from rubber. Put a piece of cardboard underneath the wheel you’re working on. Make sure to work outside or in a well-ventilated area to prevent any fumes from building up. Place a piece of cardboard that extends 1–2 feet (30–61 cm) from the bottom of your tires so you don’t get any Plasti Dip on the ground. If you need to, layer multiple pieces of cardboard to protect the area. You can also use old rags instead of cardboard. Applying the Plasti Dip Heat the Plasti Dip for 1 minute in a bucket full of warm water. Fill a bucket or container with warm water from your sink. Slowly lower the can of Plasti Dip you’re using into the water, making sure the nozzle doesn’t get submerged. After 1 minute, take the can of Plasti Dip out from the bucket and dry it off with a rag. Heating the can before you use it makes the spray more consistent so it doesn’t form bubbles or air pockets on your rims. You can buy Plasti Dip online or from auto care stores. Wear goggles and a respirator when you spray the Plasti Dip. Put on goggles and use a respirator that cover your mouth, nose, and eyes. Hold the can 6 in (15 cm) from your rims and press down on the nozzle. Use short bursts to apply the Plasti Dip onto your rims, working your way around them. Make sure to spray between the gaps in your rims to coat the inside of them as well. Aim to get about 50% coverage with your first coat. Plasti Dip creates fumes that could be harmful if inhaled. Let the first coat dry for 5-15 minutes. Plasti Dip is quick-setting, so leave the first coat to dry for about 5 minutes. Touch an inconspicuous spot on your rims to see if the coat feels tacky. If it does, allow it to dry for up to 15 minutes. If it doesn’t feel sticky, you can start your next coat. Your rims may take longer to dry if you have humid weather. Apply a second coat and let it dry. Start spraying the Plasti Dip onto your rims from 6 in (15 cm). Focus on areas that look spotty or weren’t covered as well by the first coat you applied. It’s okay to apply a thicker layer of Plasti Dip during your second coat, but be sure to spray it evenly so it doesn’t form bubbles. When you’re finished with the second coat, let it dry for another 5-15 minutes. If the Plasti Dip does form bubbles, you can either go over it with more coats to hide them or peel it off to start over.Tip: If the Plasti Dip has cooled down in between coats, put the can back in warm water for 1 minute before applying it. Move your vehicle to rotate your tires by 180 degrees. In between the second and third coat of Plasti Dip, get in your vehicle and pull it forward. Go slowly so your tires rotate 180 degrees. That way, you can see if there are any spots you missed or that need better coverage during the next coat. If you’ve taken the tires off your vehicle to apply Plasti Dip, then flip them over so you can apply it to the back as well. Put on a third and fourth coat of Plasti Dip. Spray at least 1 more coat of Plasti Dip onto your rims to cover any spots you may have missed or that don’t have an even finish. Let the next coat dry for another 5-15 minutes. If you still have areas that don’t have equal coverage, then put on a thin fourth coat and wait until they are dry to use. Coating all 4 tires on your vehicle usually takes about 4 cans of Plasti Dip. Finishing Your Rims Add a coat of spray gloss if you don’t want a matte finish. While Plasti Dip has a matte finish, adding a coat of gloss adds shine to your rims. Hold the can of gloss 6 in (15 cm) away from the rim and spray it on in short bursts. Evenly cover all areas of your rims so they have an even finish. Let the gloss dry for at least 20-30 minutes\nYou can buy gloss from any auto care store. You only need 1 coat of gloss, but you can apply additional layers if you want them to look shinier. Remove the tape and plastic covers from your tires. Use your fingernail to peel the edge of the tape off of your wheel after your final layer of Plasti Dip or gloss finish is dry. Slowly peel off the tape around your rims to completely remove it. Reach in between the rims to pull the plastic covers from your brakes. Be careful while peeling off the tape since pulling it off quickly could take off the Plasti Dip coating on your rims. Peel or wipe off any Plasti Dip that dried on the tires. If you accidentally oversprayed and there’s Plasti Dip on your tires, use your fingernail to peel the edges. If you can't get a good grip with your fingernail, use a dry cleaning cloth in circular motions to break the Plasti Dip off.Tip: For difficult dried-on Plasti Dip, spray a small amount of WD-40 onto the tire and wipe it off after 5 minutes.",
    "sentences": [
        " Cleaning and Protecting Your Work Space Rinse your rims off with clean water from a hose.",
        "Over time, your vehicle’s wheels get covered in debris from the road and dust from your brakes.",
        "Point the end of your hose at your rims and rinse them off completely.",
        "Make sure to rinse all the way around the rim to remove as much of the debris as you can.",
        "You can also use a pressure washer attachment on your hose to get more cleaning power.",
        "Wipe your rims off with an all-purpose cleaner and dry them.",
        "Spray an all-purpose cleaner directly onto your rims to coat them.",
        "Use a clean rag to wipe the surfaces on your rims to remove any brake dust or dirt that’s still on them.",
        "Reach behind the rims with your rag and wipe the back side of your rims as well as you can.",
        "Make sure your rims are completely dry before applying any Plasti Dip or else it may form bubbles.",
        "Tape plastic covers over your brake pads.",
        "Feed the corner of a plastic cover through your rims so it’s over your brake cylinders.",
        "Work the cover around the brakes so they’re completely covered and Plasti Dip can’t get on them.",
        "Once you can’t see the brakes underneath the plastic, use a piece of painter’s tape to secure the plastic in place.",
        "You can buy plastic covers from an auto care or hardware store.",
        "If you don’t have plastic covers, cut a garbage bag in half instead.Tip: You can take off your vehicle’s wheels if you don’t want to cover the brake pads.",
        "Work on the rear wheels first before switching to the front wheels.",
        "Line the edges of your rims with painter’s tape.",
        "Rip off small pieces of tap and layer them around the outside of your rims.",
        "Overlap the tape so the Plasti Dip can’t get between the pieces.",
        "Make sure the tape extends about 1–2 in (2.5–5.1 cm) out from the rim to prevent any overspray.",
        "You can also cover the rest of your tires with plastic covers if you want, but it’s not necessary to do since Plasti Dip peels off easily from rubber.",
        "Put a piece of cardboard underneath the wheel you’re working on.",
        "Make sure to work outside or in a well-ventilated area to prevent any fumes from building up.",
        "Place a piece of cardboard that extends 1–2 feet (30–61 cm) from the bottom of your tires so you don’t get any Plasti Dip on the ground.",
        "If you need to, layer multiple pieces of cardboard to protect the area.",
        "You can also use old rags instead of cardboard.",
        "Applying the Plasti Dip Heat the Plasti Dip for 1 minute in a bucket full of warm water.",
        "Fill a bucket or container with warm water from your sink.",
        "Slowly lower the can of Plasti Dip you’re using into the water, making sure the nozzle doesn’t get submerged.",
        "After 1 minute, take the can of Plasti Dip out from the bucket and dry it off with a rag.",
        "Heating the can before you use it makes the spray more consistent so it doesn’t form bubbles or air pockets on your rims.",
        "You can buy Plasti Dip online or from auto care stores.",
        "Wear goggles and a respirator when you spray the Plasti Dip.",
        "Put on goggles and use a respirator that cover your mouth, nose, and eyes.",
        "Hold the can 6 in (15 cm) from your rims and press down on the nozzle.",
        "Use short bursts to apply the Plasti Dip onto your rims, working your way around them.",
        "Make sure to spray between the gaps in your rims to coat the inside of them as well.",
        "Aim to get about 50% coverage with your first coat.",
        "Plasti Dip creates fumes that could be harmful if inhaled.",
        "Let the first coat dry for 5-15 minutes.",
        "Plasti Dip is quick-setting, so leave the first coat to dry for about 5 minutes.",
        "Touch an inconspicuous spot on your rims to see if the coat feels tacky.",
        "If it does, allow it to dry for up to 15 minutes.",
        "If it doesn’t feel sticky, you can start your next coat.",
        "Your rims may take longer to dry if you have humid weather.",
        "Apply a second coat and let it dry.",
        "Start spraying the Plasti Dip onto your rims from 6 in (15 cm).",
        "Focus on areas that look spotty or weren’t covered as well by the first coat you applied.",
        "It’s okay to apply a thicker layer of Plasti Dip during your second coat, but be sure to spray it evenly so it doesn’t form bubbles.",
        "When you’re finished with the second coat, let it dry for another 5-15 minutes.",
        "If the Plasti Dip does form bubbles, you can either go over it with more coats to hide them or peel it off to start over.Tip: If the Plasti Dip has cooled down in between coats, put the can back in warm water for 1 minute before applying it.",
        "Move your vehicle to rotate your tires by 180 degrees.",
        "In between the second and third coat of Plasti Dip, get in your vehicle and pull it forward.",
        "Go slowly so your tires rotate 180 degrees.",
        "That way, you can see if there are any spots you missed or that need better coverage during the next coat.",
        "If you’ve taken the tires off your vehicle to apply Plasti Dip, then flip them over so you can apply it to the back as well.",
        "Put on a third and fourth coat of Plasti Dip.",
        "Spray at least 1 more coat of Plasti Dip onto your rims to cover any spots you may have missed or that don’t have an even finish.",
        "Let the next coat dry for another 5-15 minutes.",
        "If you still have areas that don’t have equal coverage, then put on a thin fourth coat and wait until they are dry to use.",
        "Coating all 4 tires on your vehicle usually takes about 4 cans of Plasti Dip.",
        "Finishing Your Rims Add a coat of spray gloss if you don’t want a matte finish.",
        "While Plasti Dip has a matte finish, adding a coat of gloss adds shine to your rims.",
        "Hold the can of gloss 6 in (15 cm) away from the rim and spray it on in short bursts.",
        "Evenly cover all areas of your rims so they have an even finish.",
        "Let the gloss dry for at least 20-30 minutes\nYou can buy gloss from any auto care store.",
        "You only need 1 coat of gloss, but you can apply additional layers if you want them to look shinier.",
        "Remove the tape and plastic covers from your tires.",
        "Use your fingernail to peel the edge of the tape off of your wheel after your final layer of Plasti Dip or gloss finish is dry.",
        "Slowly peel off the tape around your rims to completely remove it.",
        "Reach in between the rims to pull the plastic covers from your brakes.",
        "Be careful while peeling off the tape since pulling it off quickly could take off the Plasti Dip coating on your rims.",
        "Peel or wipe off any Plasti Dip that dried on the tires.",
        "If you accidentally oversprayed and there’s Plasti Dip on your tires, use your fingernail to peel the edges.",
        "If you can't get a good grip with your fingernail, use a dry cleaning cloth in circular motions to break the Plasti Dip off.Tip: For difficult dried-on Plasti Dip, spray a small amount of WD-40 onto the tire and wipe it off after 5 minutes."
    ]
}