{
    "title": "How to Dye Hair Black Naturally",
    "url": "https://www.wikihow.com/Dye-Hair-Black-Naturally",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Coloring Hair",
        "Hair Dyes and Colorants",
        "Natural Hair Colorants and Lighteners"
    ],
    "methods": [
        {
            "name": "Using Henna and Indigo",
            "steps": [
                {
                    "headline": "Pour henna powder in a bowl and mix it with brewed chamomile tea.",
                    "description": "The first thing you’ll need to do is brew 1 cup (240 mL) of chamomile tea. The tea is used to release the dye in the henna. While it is still hot, slowly pour it in a bowl of 100% pure henna powder and mix it with a fork or whisk until you get a chunky yogurt consistency. The amount of henna you use depends on your hair length and thickness. It is recommended to use 3.5 ounces (99 g) for every 6 inches (15 cm) of hair. Only use 100% pure henna and indigo powders instead of store-bought henna hair dye. These may contain harmful chemicals and are not completely natural."
                },
                {
                    "headline": "Cover the henna mixture with plastic wrap and let it sit for 8-10 hours.",
                    "description": "Your henna mixture needs to sit for a long period of time to thicken and release the dye. Once you have finished mixing the tea and henna, cover the bowl with plastic wrap and leave it in a warm spot for at least 8 hours. Leave it by a sunny window or under a lamp, as the warm temperature will allow the dye to release more quickly. You’ll know it’s ready when you see a reddish oil sitting on the surface of the mixture."
                },
                {
                    "headline": "Mix indigo powder and water in a separate bowl.",
                    "description": "Prepare your indigo powder in a separate bowl from the henna and tea mixture. Add water and mix it with a fork until the consistency is thick and creamy. The more indigo powder you use, the darker the color will turn out. When you finally mix the henna and indigo together, you’ll want the indigo to make up 75% of the mixture in order for your hair to be completely black. For example, if you used 3.5 ounces (99 g) of henna, use at least 7.5 ounces (210 g) of indigo powder. If you do any less, your hair color will turn out dark brown or red."
                },
                {
                    "headline": "Blend the indigo and henna mixtures together.",
                    "description": "Now, add the henna mixture in the bowl with your indigo. Stir it together with a fork until it’s blended completely. Keep stirring until the two colors become one. If there are remnants of the mixtures on the inner sides of the bowl, scrape them off with the fork and mix them into the bottom. This will ensure that everything is completely combined. It is very important that the two mixtures are completely blended. If not, you may end up dyeing different parts of the hair different colors."
                },
                {
                    "headline": "Dampen your hair and protect your skin from the dye.",
                    "description": "Henna works best when applied to damp hair. Make sure it is damp, not drenched, by wetting your hair and removing excess water with a towel. When you’re done, add a thin layer of petroleum jelly on your ears and around your hairline to prevent the henna mixture from staining your skin. Use a microfiber towel or T-shirt to dry your hair to prevent breakage."
                },
                {
                    "headline": "Separate your hair into sections.",
                    "description": "Start by making a vertical part down the middle of the back of your head to separate your hair into two sections. Then, divide each of those sections in half horizontally. Use hair clips to keep the hair separated."
                },
                {
                    "headline": "Put on a pair of gloves and apply the henna mixture with your fingers.",
                    "description": "Apply generous amounts of the henna mixture to each section of your hair one at a time. Start with the front sections and work your way toward the back. Make sure the henna is fully massaged into every strand of your hair as well as your scalp. Make sure you wear gloves when applying the mixture because henna will stain the skin. Cover your clothes with a towel and use plastic bags to cover your bathroom floor and sink to avoid staining your clothes and house surfaces."
                },
                {
                    "headline": "Cover your hair with plastic wrap and let the henna sit for 2 hours.",
                    "description": "Once your hair is fully saturated with the henna mixture, push it up and wrap it with plastic wrap. The plastic wrap will hold in the moisture while the color penetrates your hair follicles. Your hair should be wet and stiff enough to fold it up on top of your head. While it is in this position get enough of the plastic wrap to cover your hair. Let it sit like this for at least 2 hours while the dye penetrates your hair strands. It’s best to use plastic wrap as opposed to a shower cap because it will do a better job of keeping the moisture in and holding your hair up without letting it fall."
                },
                {
                    "headline": "Rinse out the henna mixture and wash your hair with shampoo and conditioner.",
                    "description": "After letting the henna sit on your hair, it’s time to rinse it out. You can use warm or cool water; just make sure all of the henna mixture is rinsed out. Once you have finished rinsing, wash your hair as you normally would with shampoo and conditioner. Use conditioner with a nice fragrance you enjoy. Indigo is known to have an unpleasant odor."
                },
                {
                    "headline": "Repeat the henna hair treatment every 4-6 weeks.",
                    "description": "Although henna hair dye does last for quite a long time, the color is not permanent. The henna and indigo will start to fade after just a few weeks. Repeat this process every 4-6 weeks to keep your hair color black. Make sure to wait at least 2 weeks between applications. It can be very drying to your hair and cause breakage if applied too frequently."
                }
            ]
        },
        {
            "name": "Dyeing Hair Black with Coffee",
            "steps": [
                {
                    "headline": "Wash and dry your hair.",
                    "description": "This type of dyeing should be done on clean, dry hair, so you’ll need to wash your hair before putting the coffee mixture in it. Choose a shampoo that is best for your hair type and wash thoroughly. When you’re finished, rinse the shampoo with water and dry it completely."
                },
                {
                    "headline": "Brew 2 cups (470 mL) of dark roast coffee and let it cool down.",
                    "description": "In order to get hair as dark as possible, purchase coffee that is a dark roast, such as expresso. You can brew the coffee however you like, either with a coffee maker or on the stove. Let the coffee completely cool until you no longer see any steam coming out of the cup. Always choose organic coffee. Non-organic coffee may contain some added chemicals. Make the brew as strong as possible by adding additional coffee grounds to your 2-cup (470-mL) brew. This will ensure that your hair color comes out as black as possible."
                },
                {
                    "headline": "Mix the finished coffee with conditioner and coffee grounds.",
                    "description": "Once the coffee has completely cooled, add in 2 cups (470 mL) of your preferred conditioner. It’s best if the conditioner is extra moisturizing and thick because it will make the application easier. Then, add 4 tbsp (~20 g) of coffee grounds. Mix all of the ingredients together with a spoon until the ground coffee dissolves and the mixture is smooth and black. If you have particularly thick hair, double the ingredients in case you need extra."
                },
                {
                    "headline": "Apply the coffee mixture to your hair and leave it in for 1 hour.",
                    "description": "Separate your hair into 4 even sections. Use a brush applicator to apply the coffee mixture to each section, making sure to fully saturate every strand. Use a wide tooth comb to even out the mixture throughout your hair and leave it in for no more than 1 hour. Use a bobby pin or hair band to pin your hair up and keep it out of your face. Don’t leave the mixture in your hair for more than an hour, it will start to dry and harden. This will make it more difficult to rinse out. This coffee mixture can stain clothing and furniture, so be careful not to let it drip near these materials. Wrap a black towel that you don’t mind getting stained around your shoulders so you don’t ruin your clothes. Put a plastic shower cap on after applying the mixture to your hair so it all stays put."
                },
                {
                    "headline": "Rinse out the coffee mixture with water.",
                    "description": "After 1 hour, it is time to rinse the mixture out of your hair. Stand in the shower and rinse your hair until the water runs clear. You can let your hair air dry or blow dry it. Try not to dry it with a towel, as you might rub off some of the dark color. Your hair will be darker and shiny when you’re finished. Do not add shampoo to your rinse. It will remove all of the color you just applied."
                },
                {
                    "headline": "Repeat this coffee application twice a month to keep your hair black.",
                    "description": "Unfortunately, dyeing your hair with coffee is not permanent. You’ll need to apply this coffee mixture to your hair twice a month to keep the black color. If you do not continue to apply the coffee mixture, your hair will gradually turn back to its original color between washes. If you’re covering up gray hair, apply the coffee twice in a row the first two times to ensure that the black hair lasts."
                }
            ]
        }
    ],
    "tyn": [
        "Using Henna and Indigo",
        "100% pure henna powder",
        "100% pure indigo powder",
        "Chamomile tea",
        "Cling wrap",
        "2 large bowls",
        "Fork or whisk",
        "Rubber or vinyl gloves",
        "Shampoo and conditioner",
        "Dyeing Hair Black with Coffee",
        "Dark roast coffee (organic)",
        "Coffee grounds",
        "Conditioner",
        "Shampoo",
        "Wide tooth comb",
        "Booby pin or hairband"
    ],
    "text": " Using Henna and Indigo Pour henna powder in a bowl and mix it with brewed chamomile tea. The first thing you’ll need to do is brew 1 cup (240 mL) of chamomile tea. The tea is used to release the dye in the henna. While it is still hot, slowly pour it in a bowl of 100% pure henna powder and mix it with a fork or whisk until you get a chunky yogurt consistency. The amount of henna you use depends on your hair length and thickness. It is recommended to use 3.5 ounces (99 g) for every 6 inches (15 cm) of hair. Only use 100% pure henna and indigo powders instead of store-bought henna hair dye. These may contain harmful chemicals and are not completely natural. Cover the henna mixture with plastic wrap and let it sit for 8-10 hours. Your henna mixture needs to sit for a long period of time to thicken and release the dye. Once you have finished mixing the tea and henna, cover the bowl with plastic wrap and leave it in a warm spot for at least 8 hours. Leave it by a sunny window or under a lamp, as the warm temperature will allow the dye to release more quickly. You’ll know it’s ready when you see a reddish oil sitting on the surface of the mixture. Mix indigo powder and water in a separate bowl. Prepare your indigo powder in a separate bowl from the henna and tea mixture. Add water and mix it with a fork until the consistency is thick and creamy. The more indigo powder you use, the darker the color will turn out. When you finally mix the henna and indigo together, you’ll want the indigo to make up 75% of the mixture in order for your hair to be completely black. For example, if you used 3.5 ounces (99 g) of henna, use at least 7.5 ounces (210 g) of indigo powder. If you do any less, your hair color will turn out dark brown or red. Blend the indigo and henna mixtures together. Now, add the henna mixture in the bowl with your indigo. Stir it together with a fork until it’s blended completely. Keep stirring until the two colors become one. If there are remnants of the mixtures on the inner sides of the bowl, scrape them off with the fork and mix them into the bottom. This will ensure that everything is completely combined. It is very important that the two mixtures are completely blended. If not, you may end up dyeing different parts of the hair different colors. Dampen your hair and protect your skin from the dye. Henna works best when applied to damp hair. Make sure it is damp, not drenched, by wetting your hair and removing excess water with a towel. When you’re done, add a thin layer of petroleum jelly on your ears and around your hairline to prevent the henna mixture from staining your skin. Use a microfiber towel or T-shirt to dry your hair to prevent breakage. Separate your hair into sections. Start by making a vertical part down the middle of the back of your head to separate your hair into two sections. Then, divide each of those sections in half horizontally. Use hair clips to keep the hair separated. Put on a pair of gloves and apply the henna mixture with your fingers. Apply generous amounts of the henna mixture to each section of your hair one at a time. Start with the front sections and work your way toward the back. Make sure the henna is fully massaged into every strand of your hair as well as your scalp. Make sure you wear gloves when applying the mixture because henna will stain the skin. Cover your clothes with a towel and use plastic bags to cover your bathroom floor and sink to avoid staining your clothes and house surfaces. Cover your hair with plastic wrap and let the henna sit for 2 hours. Once your hair is fully saturated with the henna mixture, push it up and wrap it with plastic wrap. The plastic wrap will hold in the moisture while the color penetrates your hair follicles. Your hair should be wet and stiff enough to fold it up on top of your head. While it is in this position get enough of the plastic wrap to cover your hair. Let it sit like this for at least 2 hours while the dye penetrates your hair strands. It’s best to use plastic wrap as opposed to a shower cap because it will do a better job of keeping the moisture in and holding your hair up without letting it fall. Rinse out the henna mixture and wash your hair with shampoo and conditioner. After letting the henna sit on your hair, it’s time to rinse it out. You can use warm or cool water; just make sure all of the henna mixture is rinsed out. Once you have finished rinsing, wash your hair as you normally would with shampoo and conditioner. Use conditioner with a nice fragrance you enjoy. Indigo is known to have an unpleasant odor. Repeat the henna hair treatment every 4-6 weeks. Although henna hair dye does last for quite a long time, the color is not permanent. The henna and indigo will start to fade after just a few weeks. Repeat this process every 4-6 weeks to keep your hair color black. Make sure to wait at least 2 weeks between applications. It can be very drying to your hair and cause breakage if applied too frequently. Dyeing Hair Black with Coffee Wash and dry your hair. This type of dyeing should be done on clean, dry hair, so you’ll need to wash your hair before putting the coffee mixture in it. Choose a shampoo that is best for your hair type and wash thoroughly. When you’re finished, rinse the shampoo with water and dry it completely. Brew 2 cups (470 mL) of dark roast coffee and let it cool down. In order to get hair as dark as possible, purchase coffee that is a dark roast, such as expresso. You can brew the coffee however you like, either with a coffee maker or on the stove. Let the coffee completely cool until you no longer see any steam coming out of the cup. Always choose organic coffee. Non-organic coffee may contain some added chemicals. Make the brew as strong as possible by adding additional coffee grounds to your 2-cup (470-mL) brew. This will ensure that your hair color comes out as black as possible. Mix the finished coffee with conditioner and coffee grounds. Once the coffee has completely cooled, add in 2 cups (470 mL) of your preferred conditioner. It’s best if the conditioner is extra moisturizing and thick because it will make the application easier. Then, add 4 tbsp (~20 g) of coffee grounds. Mix all of the ingredients together with a spoon until the ground coffee dissolves and the mixture is smooth and black. If you have particularly thick hair, double the ingredients in case you need extra. Apply the coffee mixture to your hair and leave it in for 1 hour. Separate your hair into 4 even sections. Use a brush applicator to apply the coffee mixture to each section, making sure to fully saturate every strand. Use a wide tooth comb to even out the mixture throughout your hair and leave it in for no more than 1 hour. Use a bobby pin or hair band to pin your hair up and keep it out of your face. Don’t leave the mixture in your hair for more than an hour, it will start to dry and harden. This will make it more difficult to rinse out. This coffee mixture can stain clothing and furniture, so be careful not to let it drip near these materials. Wrap a black towel that you don’t mind getting stained around your shoulders so you don’t ruin your clothes. Put a plastic shower cap on after applying the mixture to your hair so it all stays put. Rinse out the coffee mixture with water. After 1 hour, it is time to rinse the mixture out of your hair. Stand in the shower and rinse your hair until the water runs clear. You can let your hair air dry or blow dry it. Try not to dry it with a towel, as you might rub off some of the dark color. Your hair will be darker and shiny when you’re finished. Do not add shampoo to your rinse. It will remove all of the color you just applied. Repeat this coffee application twice a month to keep your hair black. Unfortunately, dyeing your hair with coffee is not permanent. You’ll need to apply this coffee mixture to your hair twice a month to keep the black color. If you do not continue to apply the coffee mixture, your hair will gradually turn back to its original color between washes. If you’re covering up gray hair, apply the coffee twice in a row the first two times to ensure that the black hair lasts.",
    "sentences": [
        " Using Henna and Indigo Pour henna powder in a bowl and mix it with brewed chamomile tea.",
        "The first thing you’ll need to do is brew 1 cup (240 mL) of chamomile tea.",
        "The tea is used to release the dye in the henna.",
        "While it is still hot, slowly pour it in a bowl of 100% pure henna powder and mix it with a fork or whisk until you get a chunky yogurt consistency.",
        "The amount of henna you use depends on your hair length and thickness.",
        "It is recommended to use 3.5 ounces (99 g) for every 6 inches (15 cm) of hair.",
        "Only use 100% pure henna and indigo powders instead of store-bought henna hair dye.",
        "These may contain harmful chemicals and are not completely natural.",
        "Cover the henna mixture with plastic wrap and let it sit for 8-10 hours.",
        "Your henna mixture needs to sit for a long period of time to thicken and release the dye.",
        "Once you have finished mixing the tea and henna, cover the bowl with plastic wrap and leave it in a warm spot for at least 8 hours.",
        "Leave it by a sunny window or under a lamp, as the warm temperature will allow the dye to release more quickly.",
        "You’ll know it’s ready when you see a reddish oil sitting on the surface of the mixture.",
        "Mix indigo powder and water in a separate bowl.",
        "Prepare your indigo powder in a separate bowl from the henna and tea mixture.",
        "Add water and mix it with a fork until the consistency is thick and creamy.",
        "The more indigo powder you use, the darker the color will turn out.",
        "When you finally mix the henna and indigo together, you’ll want the indigo to make up 75% of the mixture in order for your hair to be completely black.",
        "For example, if you used 3.5 ounces (99 g) of henna, use at least 7.5 ounces (210 g) of indigo powder.",
        "If you do any less, your hair color will turn out dark brown or red.",
        "Blend the indigo and henna mixtures together.",
        "Now, add the henna mixture in the bowl with your indigo.",
        "Stir it together with a fork until it’s blended completely.",
        "Keep stirring until the two colors become one.",
        "If there are remnants of the mixtures on the inner sides of the bowl, scrape them off with the fork and mix them into the bottom.",
        "This will ensure that everything is completely combined.",
        "It is very important that the two mixtures are completely blended.",
        "If not, you may end up dyeing different parts of the hair different colors.",
        "Dampen your hair and protect your skin from the dye.",
        "Henna works best when applied to damp hair.",
        "Make sure it is damp, not drenched, by wetting your hair and removing excess water with a towel.",
        "When you’re done, add a thin layer of petroleum jelly on your ears and around your hairline to prevent the henna mixture from staining your skin.",
        "Use a microfiber towel or T-shirt to dry your hair to prevent breakage.",
        "Separate your hair into sections.",
        "Start by making a vertical part down the middle of the back of your head to separate your hair into two sections.",
        "Then, divide each of those sections in half horizontally.",
        "Use hair clips to keep the hair separated.",
        "Put on a pair of gloves and apply the henna mixture with your fingers.",
        "Apply generous amounts of the henna mixture to each section of your hair one at a time.",
        "Start with the front sections and work your way toward the back.",
        "Make sure the henna is fully massaged into every strand of your hair as well as your scalp.",
        "Make sure you wear gloves when applying the mixture because henna will stain the skin.",
        "Cover your clothes with a towel and use plastic bags to cover your bathroom floor and sink to avoid staining your clothes and house surfaces.",
        "Cover your hair with plastic wrap and let the henna sit for 2 hours.",
        "Once your hair is fully saturated with the henna mixture, push it up and wrap it with plastic wrap.",
        "The plastic wrap will hold in the moisture while the color penetrates your hair follicles.",
        "Your hair should be wet and stiff enough to fold it up on top of your head.",
        "While it is in this position get enough of the plastic wrap to cover your hair.",
        "Let it sit like this for at least 2 hours while the dye penetrates your hair strands.",
        "It’s best to use plastic wrap as opposed to a shower cap because it will do a better job of keeping the moisture in and holding your hair up without letting it fall.",
        "Rinse out the henna mixture and wash your hair with shampoo and conditioner.",
        "After letting the henna sit on your hair, it’s time to rinse it out.",
        "You can use warm or cool water; just make sure all of the henna mixture is rinsed out.",
        "Once you have finished rinsing, wash your hair as you normally would with shampoo and conditioner.",
        "Use conditioner with a nice fragrance you enjoy.",
        "Indigo is known to have an unpleasant odor.",
        "Repeat the henna hair treatment every 4-6 weeks.",
        "Although henna hair dye does last for quite a long time, the color is not permanent.",
        "The henna and indigo will start to fade after just a few weeks.",
        "Repeat this process every 4-6 weeks to keep your hair color black.",
        "Make sure to wait at least 2 weeks between applications.",
        "It can be very drying to your hair and cause breakage if applied too frequently.",
        "Dyeing Hair Black with Coffee Wash and dry your hair.",
        "This type of dyeing should be done on clean, dry hair, so you’ll need to wash your hair before putting the coffee mixture in it.",
        "Choose a shampoo that is best for your hair type and wash thoroughly.",
        "When you’re finished, rinse the shampoo with water and dry it completely.",
        "Brew 2 cups (470 mL) of dark roast coffee and let it cool down.",
        "In order to get hair as dark as possible, purchase coffee that is a dark roast, such as expresso.",
        "You can brew the coffee however you like, either with a coffee maker or on the stove.",
        "Let the coffee completely cool until you no longer see any steam coming out of the cup.",
        "Always choose organic coffee.",
        "Non-organic coffee may contain some added chemicals.",
        "Make the brew as strong as possible by adding additional coffee grounds to your 2-cup (470-mL) brew.",
        "This will ensure that your hair color comes out as black as possible.",
        "Mix the finished coffee with conditioner and coffee grounds.",
        "Once the coffee has completely cooled, add in 2 cups (470 mL) of your preferred conditioner.",
        "It’s best if the conditioner is extra moisturizing and thick because it will make the application easier.",
        "Then, add 4 tbsp (~20 g) of coffee grounds.",
        "Mix all of the ingredients together with a spoon until the ground coffee dissolves and the mixture is smooth and black.",
        "If you have particularly thick hair, double the ingredients in case you need extra.",
        "Apply the coffee mixture to your hair and leave it in for 1 hour.",
        "Separate your hair into 4 even sections.",
        "Use a brush applicator to apply the coffee mixture to each section, making sure to fully saturate every strand.",
        "Use a wide tooth comb to even out the mixture throughout your hair and leave it in for no more than 1 hour.",
        "Use a bobby pin or hair band to pin your hair up and keep it out of your face.",
        "Don’t leave the mixture in your hair for more than an hour, it will start to dry and harden.",
        "This will make it more difficult to rinse out.",
        "This coffee mixture can stain clothing and furniture, so be careful not to let it drip near these materials.",
        "Wrap a black towel that you don’t mind getting stained around your shoulders so you don’t ruin your clothes.",
        "Put a plastic shower cap on after applying the mixture to your hair so it all stays put.",
        "Rinse out the coffee mixture with water.",
        "After 1 hour, it is time to rinse the mixture out of your hair.",
        "Stand in the shower and rinse your hair until the water runs clear.",
        "You can let your hair air dry or blow dry it.",
        "Try not to dry it with a towel, as you might rub off some of the dark color.",
        "Your hair will be darker and shiny when you’re finished.",
        "Do not add shampoo to your rinse.",
        "It will remove all of the color you just applied.",
        "Repeat this coffee application twice a month to keep your hair black.",
        "Unfortunately, dyeing your hair with coffee is not permanent.",
        "You’ll need to apply this coffee mixture to your hair twice a month to keep the black color.",
        "If you do not continue to apply the coffee mixture, your hair will gradually turn back to its original color between washes.",
        "If you’re covering up gray hair, apply the coffee twice in a row the first two times to ensure that the black hair lasts."
    ]
}