{
    "title": "How to Make a Wedding Program",
    "url": "https://www.wikihow.com/Make-a-Wedding-Program",
    "category_hierarchy": [
        "Family Life",
        "Weddings",
        "Wedding Planning"
    ],
    "methods": [
        {
            "name": "Deciding What to Include in the Wedding Program",
            "steps": [
                {
                    "headline": "Outline your ceremony.",
                    "description": "A wedding program is basically a list of the events at your wedding ceremony. You will want to ensure that the events are listed in sequential order on the program. Here is a list of items to consider for your wedding program:\nName of bride and groom. Date and location of the ceremony. Processional and recessional music selections. Greetings from the officiant. Special readings (cite the readings and also include the name of the reader). Prayers or religious customs. Exchanging of vows and rings (some people like to print their vows in the program. This will take up extra space and may cause the program to be too long.) Lighting of unity candle or special song. Pronouncement of marriage."
                },
                {
                    "headline": "Speak with your officiant to help determine the order of events.",
                    "description": "Typically, the person officiating your wedding will have a general outline for how they perform a wedding ceremony. Make sure that you talk about any additional readings or songs you would like to include and arrange where they should be placed in the ceremony."
                },
                {
                    "headline": "Consider a section to introduce parents and the bridal party.",
                    "description": "A wedding program is a great place to provide the names of the bride's and groom’s parents along with the wedding party. Remember that many people attending your wedding will not know each other. A list of names can allow you to introduce your parents and bridal party to your guests. For example, list the parents of the bride, parents of the groom, maid of honor, best man, bridesmaids, and groomsmen. You may also want to include the names of grandparents."
                },
                {
                    "headline": "Add the address of the reception.",
                    "description": "If your wedding reception is in a different location from your wedding ceremony, it is a good idea to include the address for the reception on the back of the program. This will help your guests with traveling from the ceremony to the reception. You may also want to include a map and directions to help your guests as they travel."
                }
            ]
        },
        {
            "name": "Making the Wedding Program",
            "steps": [
                {
                    "headline": "Choose a computer software program.",
                    "description": "There are a variety of different computer software programs that can be used for making a wedding program. Familiarize yourself with a few programs and decide on the one that you like the best. Some common programs include:\nAdobe Photoshop\nAdobe Illustrator\nAdobe InDesign\nMS Publisher\nPages (for Mac users)"
                },
                {
                    "headline": "Decide on a wedding program template or design you like.",
                    "description": "Many websites have free downloadable templates that you can use to make your wedding program. You can then add some custom finishes to give the program your own personal touch. Search online for a free wedding program template. If you decide not to use a template, organize the program in chronological order. Begin by introducing the bride a groom, followed by the order of the ceremony, and end with a quick thank you note to all your guests."
                },
                {
                    "headline": "Edit and proofread the program before printing.",
                    "description": "Make sure that you thoroughly edit your program before printing. You don’t want to print 200 copies only to find that you have misspelled the name of your husband-to-be!"
                },
                {
                    "headline": "Print the program on cardstock.",
                    "description": "It is a good idea to print your program on a thick paper. A variety of colors and thicknesses are available at your local office supply store. In order to ensure that the formatting and colors are correct, you should print one program first and then make adjustments as needed. Have your programs printed at a local print shop, if you don't have the supplies to print all of the programs from home."
                },
                {
                    "headline": "Fold the paper as needed.",
                    "description": "Depending on the style of program you have selected, you may need to fold the programs once the ink has had a few seconds to dry. Take your time to carefully line up the two sides before making a crisp and straight crease. Some styles to consider include:\nTraditional card centre fold (vertical or horizontal). Brochure style (three folds). Single sheet printed on front and back (no fold)."
                }
            ]
        },
        {
            "name": "Adding a Touch of Creativity",
            "steps": [
                {
                    "headline": "Choose a font and colour that matches your wedding.",
                    "description": "Typically, a wedding will have a particular colour scheme, for example, blush and gold. You may want to match your wedding program to the overall style and colour scheme of your wedding."
                },
                {
                    "headline": "Include a photo or special design.",
                    "description": "If you find the program is slightly dull with just words, you could add a photo of the bride and groom on the front cover or some sort of special design that matches the theme of your wedding. For example, you may have a country/western themed wedding and a pair of cowboy boots would be a cute addition to the program."
                },
                {
                    "headline": "Search for more creative ideas to match your theme.",
                    "description": "There are a lot of amazing and creative ideas that can help you come up with a unique wedding program design that matches the theme of your wedding. If you are having a modern formal wedding, try a Google image search for \"formal modern wedding programs.\" You can also look on Pinterest for creative ideas. For example, make your program into a fan. If you are having an outdoor wedding during the summer, it is likely going to be fairly warm. One creative way to help your guests beat the heat is by placing your wedding program on a wooden stick so that it can be used as a fan."
                },
                {
                    "headline": "Add a touch of elegance to your wedding program by tying a ribbon to the top.",
                    "description": "Punch two holes in the top left corner. The holes should be about 1 ⁄2 inches (3.8 cm) from the edge of the paper. You can place the holes either beside or on top of one another. Run a thin piece of ribbon up through each hole and tie a small bow on the front."
                },
                {
                    "headline": "Place the programs in a lined basket.",
                    "description": "Use the same shade of ribbon that was used on the programs to tie a bow onto the basket. Place the basket on the guest registry table. Alternatively, you could have the groomsmen hand out the programs as guests enter the wedding ceremony venue."
                }
            ]
        }
    ],
    "tyn": [
        "Computer with printer",
        "cardstock",
        "Single-hole punch",
        "Additional craft supplies as you desire"
    ],
    "text": " Deciding What to Include in the Wedding Program Outline your ceremony. A wedding program is basically a list of the events at your wedding ceremony. You will want to ensure that the events are listed in sequential order on the program. Here is a list of items to consider for your wedding program:\nName of bride and groom. Date and location of the ceremony. Processional and recessional music selections. Greetings from the officiant. Special readings (cite the readings and also include the name of the reader). Prayers or religious customs. Exchanging of vows and rings (some people like to print their vows in the program. This will take up extra space and may cause the program to be too long.) Lighting of unity candle or special song. Pronouncement of marriage. Speak with your officiant to help determine the order of events. Typically, the person officiating your wedding will have a general outline for how they perform a wedding ceremony. Make sure that you talk about any additional readings or songs you would like to include and arrange where they should be placed in the ceremony. Consider a section to introduce parents and the bridal party. A wedding program is a great place to provide the names of the bride's and groom’s parents along with the wedding party. Remember that many people attending your wedding will not know each other. A list of names can allow you to introduce your parents and bridal party to your guests. For example, list the parents of the bride, parents of the groom, maid of honor, best man, bridesmaids, and groomsmen. You may also want to include the names of grandparents. Add the address of the reception. If your wedding reception is in a different location from your wedding ceremony, it is a good idea to include the address for the reception on the back of the program. This will help your guests with traveling from the ceremony to the reception. You may also want to include a map and directions to help your guests as they travel. Making the Wedding Program Choose a computer software program. There are a variety of different computer software programs that can be used for making a wedding program. Familiarize yourself with a few programs and decide on the one that you like the best. Some common programs include:\nAdobe Photoshop\nAdobe Illustrator\nAdobe InDesign\nMS Publisher\nPages (for Mac users) Decide on a wedding program template or design you like. Many websites have free downloadable templates that you can use to make your wedding program. You can then add some custom finishes to give the program your own personal touch. Search online for a free wedding program template. If you decide not to use a template, organize the program in chronological order. Begin by introducing the bride a groom, followed by the order of the ceremony, and end with a quick thank you note to all your guests. Edit and proofread the program before printing. Make sure that you thoroughly edit your program before printing. You don’t want to print 200 copies only to find that you have misspelled the name of your husband-to-be! Print the program on cardstock. It is a good idea to print your program on a thick paper. A variety of colors and thicknesses are available at your local office supply store. In order to ensure that the formatting and colors are correct, you should print one program first and then make adjustments as needed. Have your programs printed at a local print shop, if you don't have the supplies to print all of the programs from home. Fold the paper as needed. Depending on the style of program you have selected, you may need to fold the programs once the ink has had a few seconds to dry. Take your time to carefully line up the two sides before making a crisp and straight crease. Some styles to consider include:\nTraditional card centre fold (vertical or horizontal). Brochure style (three folds). Single sheet printed on front and back (no fold). Adding a Touch of Creativity Choose a font and colour that matches your wedding. Typically, a wedding will have a particular colour scheme, for example, blush and gold. You may want to match your wedding program to the overall style and colour scheme of your wedding. Include a photo or special design. If you find the program is slightly dull with just words, you could add a photo of the bride and groom on the front cover or some sort of special design that matches the theme of your wedding. For example, you may have a country/western themed wedding and a pair of cowboy boots would be a cute addition to the program. Search for more creative ideas to match your theme. There are a lot of amazing and creative ideas that can help you come up with a unique wedding program design that matches the theme of your wedding. If you are having a modern formal wedding, try a Google image search for \"formal modern wedding programs.\" You can also look on Pinterest for creative ideas. For example, make your program into a fan. If you are having an outdoor wedding during the summer, it is likely going to be fairly warm. One creative way to help your guests beat the heat is by placing your wedding program on a wooden stick so that it can be used as a fan. Add a touch of elegance to your wedding program by tying a ribbon to the top. Punch two holes in the top left corner. The holes should be about 1 ⁄2 inches (3.8 cm) from the edge of the paper. You can place the holes either beside or on top of one another. Run a thin piece of ribbon up through each hole and tie a small bow on the front. Place the programs in a lined basket. Use the same shade of ribbon that was used on the programs to tie a bow onto the basket. Place the basket on the guest registry table. Alternatively, you could have the groomsmen hand out the programs as guests enter the wedding ceremony venue.",
    "sentences": [
        " Deciding What to Include in the Wedding Program Outline your ceremony.",
        "A wedding program is basically a list of the events at your wedding ceremony.",
        "You will want to ensure that the events are listed in sequential order on the program.",
        "Here is a list of items to consider for your wedding program:\nName of bride and groom.",
        "Date and location of the ceremony.",
        "Processional and recessional music selections.",
        "Greetings from the officiant.",
        "Special readings (cite the readings and also include the name of the reader).",
        "Prayers or religious customs.",
        "Exchanging of vows and rings (some people like to print their vows in the program.",
        "This will take up extra space and may cause the program to be too long.)",
        "Lighting of unity candle or special song.",
        "Pronouncement of marriage.",
        "Speak with your officiant to help determine the order of events.",
        "Typically, the person officiating your wedding will have a general outline for how they perform a wedding ceremony.",
        "Make sure that you talk about any additional readings or songs you would like to include and arrange where they should be placed in the ceremony.",
        "Consider a section to introduce parents and the bridal party.",
        "A wedding program is a great place to provide the names of the bride's and groom’s parents along with the wedding party.",
        "Remember that many people attending your wedding will not know each other.",
        "A list of names can allow you to introduce your parents and bridal party to your guests.",
        "For example, list the parents of the bride, parents of the groom, maid of honor, best man, bridesmaids, and groomsmen.",
        "You may also want to include the names of grandparents.",
        "Add the address of the reception.",
        "If your wedding reception is in a different location from your wedding ceremony, it is a good idea to include the address for the reception on the back of the program.",
        "This will help your guests with traveling from the ceremony to the reception.",
        "You may also want to include a map and directions to help your guests as they travel.",
        "Making the Wedding Program Choose a computer software program.",
        "There are a variety of different computer software programs that can be used for making a wedding program.",
        "Familiarize yourself with a few programs and decide on the one that you like the best.",
        "Some common programs include:\nAdobe Photoshop\nAdobe Illustrator\nAdobe InDesign\nMS Publisher\nPages (for Mac users) Decide on a wedding program template or design you like.",
        "Many websites have free downloadable templates that you can use to make your wedding program.",
        "You can then add some custom finishes to give the program your own personal touch.",
        "Search online for a free wedding program template.",
        "If you decide not to use a template, organize the program in chronological order.",
        "Begin by introducing the bride a groom, followed by the order of the ceremony, and end with a quick thank you note to all your guests.",
        "Edit and proofread the program before printing.",
        "Make sure that you thoroughly edit your program before printing.",
        "You don’t want to print 200 copies only to find that you have misspelled the name of your husband-to-be!",
        "Print the program on cardstock.",
        "It is a good idea to print your program on a thick paper.",
        "A variety of colors and thicknesses are available at your local office supply store.",
        "In order to ensure that the formatting and colors are correct, you should print one program first and then make adjustments as needed.",
        "Have your programs printed at a local print shop, if you don't have the supplies to print all of the programs from home.",
        "Fold the paper as needed.",
        "Depending on the style of program you have selected, you may need to fold the programs once the ink has had a few seconds to dry.",
        "Take your time to carefully line up the two sides before making a crisp and straight crease.",
        "Some styles to consider include:\nTraditional card centre fold (vertical or horizontal).",
        "Brochure style (three folds).",
        "Single sheet printed on front and back (no fold).",
        "Adding a Touch of Creativity Choose a font and colour that matches your wedding.",
        "Typically, a wedding will have a particular colour scheme, for example, blush and gold.",
        "You may want to match your wedding program to the overall style and colour scheme of your wedding.",
        "Include a photo or special design.",
        "If you find the program is slightly dull with just words, you could add a photo of the bride and groom on the front cover or some sort of special design that matches the theme of your wedding.",
        "For example, you may have a country/western themed wedding and a pair of cowboy boots would be a cute addition to the program.",
        "Search for more creative ideas to match your theme.",
        "There are a lot of amazing and creative ideas that can help you come up with a unique wedding program design that matches the theme of your wedding.",
        "If you are having a modern formal wedding, try a Google image search for \"formal modern wedding programs.\"",
        "You can also look on Pinterest for creative ideas.",
        "For example, make your program into a fan.",
        "If you are having an outdoor wedding during the summer, it is likely going to be fairly warm.",
        "One creative way to help your guests beat the heat is by placing your wedding program on a wooden stick so that it can be used as a fan.",
        "Add a touch of elegance to your wedding program by tying a ribbon to the top.",
        "Punch two holes in the top left corner.",
        "The holes should be about 1 ⁄2 inches (3.8 cm) from the edge of the paper.",
        "You can place the holes either beside or on top of one another.",
        "Run a thin piece of ribbon up through each hole and tie a small bow on the front.",
        "Place the programs in a lined basket.",
        "Use the same shade of ribbon that was used on the programs to tie a bow onto the basket.",
        "Place the basket on the guest registry table.",
        "Alternatively, you could have the groomsmen hand out the programs as guests enter the wedding ceremony venue."
    ]
}