{
    "title": "How to Wash Decorative Pillows",
    "url": "https://www.wikihow.com/Wash-Decorative-Pillows",
    "category_hierarchy": [
        "Home and Garden",
        "Home Improvements",
        "Renovation Advice and Tips"
    ],
    "parts": [
        {
            "name": "Washing the Cover and the Interior Pillow",
            "steps": [
                {
                    "headline": "Look at the care label on your pillow to determine how to clean it.",
                    "description": "If your pillow has a care label, read it carefully, as it will have important cleaning instructions. This tag will typically tell you how to wash both the pillow and the cover, although if the cover is removable, it may have a separate tag. If your pillow doesn’t have a care tag, look at the materials to determine how to clean the separate parts. Try looking online if you're not sure how to clean a specific fabric. For instance, if your cover is made from denim, you'd probably be fine putting in the washing machine, but if it's delicate silk, you'd need to dry clean it."
                },
                {
                    "headline": "Take off any removable covers and wash them separately.",
                    "description": "Often, decorative pillows will consist of an inner pillow and a removable cover. The cover may overlap in the back, similar to a pillow sham, or it may have a hidden zipper. If you can, remove this cover and wash it separately according to the care tag’s instructions. If it's safe to machine or hand-wash, use mild laundry detergent. If you can’t remove the cover, you'll probably need to wash the whole thing. Take the cover material and the fill into consideration when you're deciding which cleaning method to use. For example, even if you have a machine-washable cover made from a material like cotton, denim, or polyester, but the fill is memory foam, you'd need to spot-clean it because of the fill material. If the cover is made from a delicate material like silk, wool, or velvet, or if it has a lot of decorative trim, it probably needs to be dry cleaned, or you can spot clean it if you just need to clean a small stain."
                },
                {
                    "headline": "Do a spot test if you’re not sure how to clean the cover.",
                    "description": "If you’re not sure which approach is best, or if you just want the extra peace of mind, you can spot test an area before you wash the pillow cover. To do that, rub a clean, damp sponge over an inconspicuous spot on the pillow. Then, press a white towel to the spot. If the color transfers, the cover needs to be dry-cleaned. If it doesn’t, you can hand-wash or machine-wash it, instead. If the color doesn’t transfer but the cover isn’t removable, choose your cleaning method based on the fill of the pillow."
                },
                {
                    "headline": "Machine-wash the pillow if the care tag says it’s okay.",
                    "description": "Many pillows can be placed into the washing machine for an easy clean. If the pillow is machine-washable, run it through a hot wash with mild detergent on the longest cycle possible. If you can, set your machine to 2 rinse cycles to ensure all the detergent and grime get washed away. If the fill material is down, feathers, or fiber, the pillow is probably okay to machine wash. Tip: If you have a top-loading washing machine, try soaking the pillows before you wash them. Fill your machine with hot water and add detergent, then push the pillows down in the water. After about 10 minutes, flip the pillows over, then let them soak for about an hour. Afterward, run the machine as normal."
                },
                {
                    "headline": "Sponge-clean the pillows if you can’t wash them in the machine.",
                    "description": "Spray the pillow with upholstery shampoo, then use a clean, firm sponge to work the foam into the surface of the pillow. When you’re finished, blot away the shampoo and grime with a clean, white towel. Read the manufacturer’s label on your shampoo, as some brands will direct you to dampen the pillow with cool water before applying the product. It’s best to use a white towel to blot away the shampoo because the dye could transfer if you use a different-colored towel. Foam pillows or pillows made of other synthetic fillers should be sponge-cleaned."
                },
                {
                    "headline": "Spot-clean your pillow if it has a non-washable, non-removable cover.",
                    "description": "If your pillow is covered with a delicate material like silk or velvet, or if it contains a non-washable fill material like microbeads or memory foam, try spot-cleaning it with dry cleaning fluid. Apply a little of the cleaning product to a clean, white cloth, then dab at any spots or stains. When you’re finished, blot the area dry with a separate white cloth. You can find dry-cleaning fluid at most big box supermarkets or where cleaning supplies are sold. You can also take the pillow to the dry cleaners, if you prefer. Tip: You may also want to spot-clean a washable pillow if there's only a small stain. In that case, the approach you take to spot-cleaning will depend on what caused the stain. If it's an oil-based stain, like butter or lipstick, try a pre-wash stain remover. To clean brownish stains on the pillow caused by age, you might have better luck using a rust remover."
                },
                {
                    "headline": "Wash removable covers every few weeks to keep them clean.",
                    "description": "To keep the inside of your pillows cleaner, get in the habit of washing the covers frequently, if you can remove them. Follow any care tag instructions, either hand-washing, machine-washing, or spot-cleaning as necessary. You only need to wash your pillows every 6-12 months."
                }
            ]
        },
        {
            "name": "Drying Your Decorative Pillows",
            "steps": [
                {
                    "headline": "Dry the covers according to the care label.",
                    "description": "The care label should have instructions on how to dry your removable cover, if you washed it separately from the pillow. For instance, if the pillow cover is made from a machine-washable fabric like cotton or denim, it may be okay to put in the dryer. However, high heat might shrink some fabrics, like silk or wool. If you’re not sure, it’s best to hang it up to dry or tumble-dry it with no heat."
                },
                {
                    "headline": "Hang the pillows somewhere to air dry most of the way.",
                    "description": "Use heavy-duty clothespins to hang the pillow on a clothesline in a ventilated area and allow it to air dry. Leave it there until the pillow is mostly dry to the touch. However, it’s important to make sure the interior of the pillow is completely dry, so it’s a good idea to finish it in the dryer.Tip: If you don’t have a well-ventilated area, turn a fan on and point it at the pillow. If the cover isn't removable, air dry the whole pillow."
                },
                {
                    "headline": "Fluff the pillow to reshape it.",
                    "description": "Once your pillow is mostly dry, take it in your hands and squish it back and forth, similar to how you'd play an accordion. Do this for both of the sides, then the top and bottom. This will help loosen the filling, returning your pillow to its original shape."
                },
                {
                    "headline": "Place the pillows in the dryer with no heat once they’re mostly dry.",
                    "description": "After you've fluffed your pillow, place it into the dryer on the longest cycle with no heat. Check that the pillow is thoroughly dry before you put it back in its original location. If there’s any moisture left in the pillow, it can develop mold or mildew, which can lead to respiratory and other health issues. If you’d like, you can place dryer balls into the dryer to help the pillow retain its shape."
                }
            ]
        },
        {
            "name": "Getting a Quick Clean",
            "steps": [
                {
                    "headline": "Fluff your pillows daily to keep them smelling fresh.",
                    "description": "Once your pillows are cleaned, you can keep them fresh longer by fluffing them every day or two. That will help remove any dust that could build up and leave your pillow smelling musty. You can also fluff your pillows in the dryer or spray them with a deodorizing spray if you think they're starting to harbor odors."
                },
                {
                    "headline": "Spritz the pillows with vodka to sanitize them quickly.",
                    "description": "Fill a spray bottle with inexpensive vodka, then lightly dampen the surface of the pillow. This will disinfect the surface, and since the vodka will evaporate quickly, you don’t have to worry about mildew or mold building up. This is a great technique for killing germs if someone in your house has recently been ill. Tip: Any type of vodka will work, so there’s no need to waste the high-end stuff for cleaning! Just pick up an inexpensive bottle from any liquor store."
                },
                {
                    "headline": "Vacuum the throw pillow if you only need to remove light dust and debris.",
                    "description": "To keep dirt and grime from working their way down into your pillow, use a brush attachment to vacuum the outside of the pillow whenever you wash the cover. That way, if any dirt, skin cells, or dust have fallen through the cover, you can remove them quickly and easily. You can also vacuum the pillow cover, if you don’t want to take it off and wash it separately or if you can't remove it.au"
                }
            ]
        }
    ],
    "tyn": [
        "Washing the Covers and Pillows",
        "Firm sponge (optional)",
        "White towels or cloths (optional)",
        "Mild detergent (optional)",
        "Upholstery shampoo (optional)",
        "Dry cleaning fluid (optional)",
        "Drying Your Decorative Pillows",
        "Heavy-duty clothespins",
        "Clothesline",
        "Dryer",
        "Getting a Quick Clean",
        "Vacuum",
        "Vodka (optional)"
    ],
    "text": " Washing the Cover and the Interior Pillow Look at the care label on your pillow to determine how to clean it. If your pillow has a care label, read it carefully, as it will have important cleaning instructions. This tag will typically tell you how to wash both the pillow and the cover, although if the cover is removable, it may have a separate tag. If your pillow doesn’t have a care tag, look at the materials to determine how to clean the separate parts. Try looking online if you're not sure how to clean a specific fabric. For instance, if your cover is made from denim, you'd probably be fine putting in the washing machine, but if it's delicate silk, you'd need to dry clean it. Take off any removable covers and wash them separately. Often, decorative pillows will consist of an inner pillow and a removable cover. The cover may overlap in the back, similar to a pillow sham, or it may have a hidden zipper. If you can, remove this cover and wash it separately according to the care tag’s instructions. If it's safe to machine or hand-wash, use mild laundry detergent. If you can’t remove the cover, you'll probably need to wash the whole thing. Take the cover material and the fill into consideration when you're deciding which cleaning method to use. For example, even if you have a machine-washable cover made from a material like cotton, denim, or polyester, but the fill is memory foam, you'd need to spot-clean it because of the fill material. If the cover is made from a delicate material like silk, wool, or velvet, or if it has a lot of decorative trim, it probably needs to be dry cleaned, or you can spot clean it if you just need to clean a small stain. Do a spot test if you’re not sure how to clean the cover. If you’re not sure which approach is best, or if you just want the extra peace of mind, you can spot test an area before you wash the pillow cover. To do that, rub a clean, damp sponge over an inconspicuous spot on the pillow. Then, press a white towel to the spot. If the color transfers, the cover needs to be dry-cleaned. If it doesn’t, you can hand-wash or machine-wash it, instead. If the color doesn’t transfer but the cover isn’t removable, choose your cleaning method based on the fill of the pillow. Machine-wash the pillow if the care tag says it’s okay. Many pillows can be placed into the washing machine for an easy clean. If the pillow is machine-washable, run it through a hot wash with mild detergent on the longest cycle possible. If you can, set your machine to 2 rinse cycles to ensure all the detergent and grime get washed away. If the fill material is down, feathers, or fiber, the pillow is probably okay to machine wash. Tip: If you have a top-loading washing machine, try soaking the pillows before you wash them. Fill your machine with hot water and add detergent, then push the pillows down in the water. After about 10 minutes, flip the pillows over, then let them soak for about an hour. Afterward, run the machine as normal. Sponge-clean the pillows if you can’t wash them in the machine. Spray the pillow with upholstery shampoo, then use a clean, firm sponge to work the foam into the surface of the pillow. When you’re finished, blot away the shampoo and grime with a clean, white towel. Read the manufacturer’s label on your shampoo, as some brands will direct you to dampen the pillow with cool water before applying the product. It’s best to use a white towel to blot away the shampoo because the dye could transfer if you use a different-colored towel. Foam pillows or pillows made of other synthetic fillers should be sponge-cleaned. Spot-clean your pillow if it has a non-washable, non-removable cover. If your pillow is covered with a delicate material like silk or velvet, or if it contains a non-washable fill material like microbeads or memory foam, try spot-cleaning it with dry cleaning fluid. Apply a little of the cleaning product to a clean, white cloth, then dab at any spots or stains. When you’re finished, blot the area dry with a separate white cloth. You can find dry-cleaning fluid at most big box supermarkets or where cleaning supplies are sold. You can also take the pillow to the dry cleaners, if you prefer. Tip: You may also want to spot-clean a washable pillow if there's only a small stain. In that case, the approach you take to spot-cleaning will depend on what caused the stain. If it's an oil-based stain, like butter or lipstick, try a pre-wash stain remover. To clean brownish stains on the pillow caused by age, you might have better luck using a rust remover. Wash removable covers every few weeks to keep them clean. To keep the inside of your pillows cleaner, get in the habit of washing the covers frequently, if you can remove them. Follow any care tag instructions, either hand-washing, machine-washing, or spot-cleaning as necessary. You only need to wash your pillows every 6-12 months. Drying Your Decorative Pillows Dry the covers according to the care label. The care label should have instructions on how to dry your removable cover, if you washed it separately from the pillow. For instance, if the pillow cover is made from a machine-washable fabric like cotton or denim, it may be okay to put in the dryer. However, high heat might shrink some fabrics, like silk or wool. If you’re not sure, it’s best to hang it up to dry or tumble-dry it with no heat. Hang the pillows somewhere to air dry most of the way. Use heavy-duty clothespins to hang the pillow on a clothesline in a ventilated area and allow it to air dry. Leave it there until the pillow is mostly dry to the touch. However, it’s important to make sure the interior of the pillow is completely dry, so it’s a good idea to finish it in the dryer.Tip: If you don’t have a well-ventilated area, turn a fan on and point it at the pillow. If the cover isn't removable, air dry the whole pillow. Fluff the pillow to reshape it. Once your pillow is mostly dry, take it in your hands and squish it back and forth, similar to how you'd play an accordion. Do this for both of the sides, then the top and bottom. This will help loosen the filling, returning your pillow to its original shape. Place the pillows in the dryer with no heat once they’re mostly dry. After you've fluffed your pillow, place it into the dryer on the longest cycle with no heat. Check that the pillow is thoroughly dry before you put it back in its original location. If there’s any moisture left in the pillow, it can develop mold or mildew, which can lead to respiratory and other health issues. If you’d like, you can place dryer balls into the dryer to help the pillow retain its shape. Getting a Quick Clean Fluff your pillows daily to keep them smelling fresh. Once your pillows are cleaned, you can keep them fresh longer by fluffing them every day or two. That will help remove any dust that could build up and leave your pillow smelling musty. You can also fluff your pillows in the dryer or spray them with a deodorizing spray if you think they're starting to harbor odors. Spritz the pillows with vodka to sanitize them quickly. Fill a spray bottle with inexpensive vodka, then lightly dampen the surface of the pillow. This will disinfect the surface, and since the vodka will evaporate quickly, you don’t have to worry about mildew or mold building up. This is a great technique for killing germs if someone in your house has recently been ill. Tip: Any type of vodka will work, so there’s no need to waste the high-end stuff for cleaning! Just pick up an inexpensive bottle from any liquor store. Vacuum the throw pillow if you only need to remove light dust and debris. To keep dirt and grime from working their way down into your pillow, use a brush attachment to vacuum the outside of the pillow whenever you wash the cover. That way, if any dirt, skin cells, or dust have fallen through the cover, you can remove them quickly and easily. You can also vacuum the pillow cover, if you don’t want to take it off and wash it separately or if you can't remove it.au",
    "sentences": [
        " Washing the Cover and the Interior Pillow Look at the care label on your pillow to determine how to clean it.",
        "If your pillow has a care label, read it carefully, as it will have important cleaning instructions.",
        "This tag will typically tell you how to wash both the pillow and the cover, although if the cover is removable, it may have a separate tag.",
        "If your pillow doesn’t have a care tag, look at the materials to determine how to clean the separate parts.",
        "Try looking online if you're not sure how to clean a specific fabric.",
        "For instance, if your cover is made from denim, you'd probably be fine putting in the washing machine, but if it's delicate silk, you'd need to dry clean it.",
        "Take off any removable covers and wash them separately.",
        "Often, decorative pillows will consist of an inner pillow and a removable cover.",
        "The cover may overlap in the back, similar to a pillow sham, or it may have a hidden zipper.",
        "If you can, remove this cover and wash it separately according to the care tag’s instructions.",
        "If it's safe to machine or hand-wash, use mild laundry detergent.",
        "If you can’t remove the cover, you'll probably need to wash the whole thing.",
        "Take the cover material and the fill into consideration when you're deciding which cleaning method to use.",
        "For example, even if you have a machine-washable cover made from a material like cotton, denim, or polyester, but the fill is memory foam, you'd need to spot-clean it because of the fill material.",
        "If the cover is made from a delicate material like silk, wool, or velvet, or if it has a lot of decorative trim, it probably needs to be dry cleaned, or you can spot clean it if you just need to clean a small stain.",
        "Do a spot test if you’re not sure how to clean the cover.",
        "If you’re not sure which approach is best, or if you just want the extra peace of mind, you can spot test an area before you wash the pillow cover.",
        "To do that, rub a clean, damp sponge over an inconspicuous spot on the pillow.",
        "Then, press a white towel to the spot.",
        "If the color transfers, the cover needs to be dry-cleaned.",
        "If it doesn’t, you can hand-wash or machine-wash it, instead.",
        "If the color doesn’t transfer but the cover isn’t removable, choose your cleaning method based on the fill of the pillow.",
        "Machine-wash the pillow if the care tag says it’s okay.",
        "Many pillows can be placed into the washing machine for an easy clean.",
        "If the pillow is machine-washable, run it through a hot wash with mild detergent on the longest cycle possible.",
        "If you can, set your machine to 2 rinse cycles to ensure all the detergent and grime get washed away.",
        "If the fill material is down, feathers, or fiber, the pillow is probably okay to machine wash.",
        "Tip: If you have a top-loading washing machine, try soaking the pillows before you wash them.",
        "Fill your machine with hot water and add detergent, then push the pillows down in the water.",
        "After about 10 minutes, flip the pillows over, then let them soak for about an hour.",
        "Afterward, run the machine as normal.",
        "Sponge-clean the pillows if you can’t wash them in the machine.",
        "Spray the pillow with upholstery shampoo, then use a clean, firm sponge to work the foam into the surface of the pillow.",
        "When you’re finished, blot away the shampoo and grime with a clean, white towel.",
        "Read the manufacturer’s label on your shampoo, as some brands will direct you to dampen the pillow with cool water before applying the product.",
        "It’s best to use a white towel to blot away the shampoo because the dye could transfer if you use a different-colored towel.",
        "Foam pillows or pillows made of other synthetic fillers should be sponge-cleaned.",
        "Spot-clean your pillow if it has a non-washable, non-removable cover.",
        "If your pillow is covered with a delicate material like silk or velvet, or if it contains a non-washable fill material like microbeads or memory foam, try spot-cleaning it with dry cleaning fluid.",
        "Apply a little of the cleaning product to a clean, white cloth, then dab at any spots or stains.",
        "When you’re finished, blot the area dry with a separate white cloth.",
        "You can find dry-cleaning fluid at most big box supermarkets or where cleaning supplies are sold.",
        "You can also take the pillow to the dry cleaners, if you prefer.",
        "Tip: You may also want to spot-clean a washable pillow if there's only a small stain.",
        "In that case, the approach you take to spot-cleaning will depend on what caused the stain.",
        "If it's an oil-based stain, like butter or lipstick, try a pre-wash stain remover.",
        "To clean brownish stains on the pillow caused by age, you might have better luck using a rust remover.",
        "Wash removable covers every few weeks to keep them clean.",
        "To keep the inside of your pillows cleaner, get in the habit of washing the covers frequently, if you can remove them.",
        "Follow any care tag instructions, either hand-washing, machine-washing, or spot-cleaning as necessary.",
        "You only need to wash your pillows every 6-12 months.",
        "Drying Your Decorative Pillows Dry the covers according to the care label.",
        "The care label should have instructions on how to dry your removable cover, if you washed it separately from the pillow.",
        "For instance, if the pillow cover is made from a machine-washable fabric like cotton or denim, it may be okay to put in the dryer.",
        "However, high heat might shrink some fabrics, like silk or wool.",
        "If you’re not sure, it’s best to hang it up to dry or tumble-dry it with no heat.",
        "Hang the pillows somewhere to air dry most of the way.",
        "Use heavy-duty clothespins to hang the pillow on a clothesline in a ventilated area and allow it to air dry.",
        "Leave it there until the pillow is mostly dry to the touch.",
        "However, it’s important to make sure the interior of the pillow is completely dry, so it’s a good idea to finish it in the dryer.Tip: If you don’t have a well-ventilated area, turn a fan on and point it at the pillow.",
        "If the cover isn't removable, air dry the whole pillow.",
        "Fluff the pillow to reshape it.",
        "Once your pillow is mostly dry, take it in your hands and squish it back and forth, similar to how you'd play an accordion.",
        "Do this for both of the sides, then the top and bottom.",
        "This will help loosen the filling, returning your pillow to its original shape.",
        "Place the pillows in the dryer with no heat once they’re mostly dry.",
        "After you've fluffed your pillow, place it into the dryer on the longest cycle with no heat.",
        "Check that the pillow is thoroughly dry before you put it back in its original location.",
        "If there’s any moisture left in the pillow, it can develop mold or mildew, which can lead to respiratory and other health issues.",
        "If you’d like, you can place dryer balls into the dryer to help the pillow retain its shape.",
        "Getting a Quick Clean Fluff your pillows daily to keep them smelling fresh.",
        "Once your pillows are cleaned, you can keep them fresh longer by fluffing them every day or two.",
        "That will help remove any dust that could build up and leave your pillow smelling musty.",
        "You can also fluff your pillows in the dryer or spray them with a deodorizing spray if you think they're starting to harbor odors.",
        "Spritz the pillows with vodka to sanitize them quickly.",
        "Fill a spray bottle with inexpensive vodka, then lightly dampen the surface of the pillow.",
        "This will disinfect the surface, and since the vodka will evaporate quickly, you don’t have to worry about mildew or mold building up.",
        "This is a great technique for killing germs if someone in your house has recently been ill.",
        "Tip: Any type of vodka will work, so there’s no need to waste the high-end stuff for cleaning!",
        "Just pick up an inexpensive bottle from any liquor store.",
        "Vacuum the throw pillow if you only need to remove light dust and debris.",
        "To keep dirt and grime from working their way down into your pillow, use a brush attachment to vacuum the outside of the pillow whenever you wash the cover.",
        "That way, if any dirt, skin cells, or dust have fallen through the cover, you can remove them quickly and easily.",
        "You can also vacuum the pillow cover, if you don’t want to take it off and wash it separately or if you can't remove it.au"
    ]
}