{
    "title": "How to Clean Microfiber Cloths",
    "url": "https://www.wikihow.com/Clean-Microfiber-Cloths",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Laundry"
    ],
    "methods": [
        {
            "name": "Rinsing Lightly-Used Microfiber Cloths by Hand",
            "steps": [
                {
                    "headline": "Put the dirty cloths in a clean bucket filled with cool or warm water.",
                    "description": "Fill a clean bucket, big enough to hold all the cloths you want to wash, with clean cool or warm water. Toss the cloths in and let them soak for a few minutes. Tip: Always wash microfiber cloths separately from other items. Microfiber cloths are designed to pick up lint and dust. If you wash them with other fabrics, like cotton, they will just accumulate more lint. Hand washing works best for cleaning microfiber cloths that have been used to clean dry messes, such as for dusting. For dirtier cloths or those used to mop up spills, you will need to machine-wash them."
                },
                {
                    "headline": "Use your hands to move the cloths around in the water to release dirt.",
                    "description": "Swirl the microfiber cloths around in the bucket of water to loosen dust and other grime they have accumulated. You only need to do this for a minute or two. Don’t use detergent or any other cleaning products for this method. To get dust and light dirt out, all you need is clean water and a little agitation."
                },
                {
                    "headline": "Rinse the cloths out under cool running water and wring out the excess water.",
                    "description": "Take each cloth out and hold it under a running tap to rinse out any remaining dust and dirt. Wring out the excess water so that the cloths are not dripping. If this doesn't work to get the dirt and dust out of the cloths, then you will need to launder them in a washing machine to clean them thoroughly."
                },
                {
                    "headline": "Hang up the cloths and let them air dry.",
                    "description": "Hang each cloth up separately from other items on clothes hangers or a clothes line. Let them air dry completely before using them to clean again. Avoid drying microfiber cloths in a drying machine. Drying machines are full of lint and dust that the cloths will just pick up. If you absolutely must dry them in a machine, then tumble dry them with no heat and apart from other items."
                }
            ]
        },
        {
            "name": "Laundering Heavily-Soiled Microfiber Cloths",
            "steps": [
                {
                    "headline": "Pretreat any stains or spots with a drop of liquid laundry detergent.",
                    "description": "Rub a drop of liquid laundry detergent into each side of the stain with the tip of a finger. Let it soak in for 5 minutes before you launder the cloth. Tip: Don’t use any cleaning products when you clean with microfiber cloths if you want to prolong their lifespan. Use them on their own, or with clean water only. Wash microfiber cloths used to clean in the kitchen, bathroom, or used to clean liquid or greasy messes after each use."
                },
                {
                    "headline": "Put the dirty cloths in the washing machine separate from other items.",
                    "description": "Always wash microfiber cloths separately from other items, especially cotton clothing. This will keep them from picking up more lint. Certain types of fabrics will rub against the cloths and break down the microfiber bristles which will decrease their effectiveness as well."
                },
                {
                    "headline": "Put 1/2 the amount of liquid detergent you would normally use in the machine.",
                    "description": "Don’t use powdered laundry detergent because it can damage the microfibers. Close the laundry machine after you put the detergent in. Don’t add fabric softeners, bleach, vinegar, or anything other than liquid laundry detergent.These will break down the microfibers and damage the cloths."
                },
                {
                    "headline": "Run the washing machine on its cold or warm water cycle.",
                    "description": "Only use cold or warm water  because hot water can damage the microfibers, especially after repeated washes. Cold or warm water with detergent is sufficient to clean and disinfect the cloths. When washed correctly, microfiber cloths will survive 100-500 wash cycles and retain their effectiveness. Replace them when they start to feel rough, like normal washcloths."
                },
                {
                    "headline": "Hang the cloths to air dry.",
                    "description": "Remove the cloths from the washing machine and hang them on a laundry line or clothes hangers. Hang them in the sun, if you can, for added disinfection. Microfiber cloths dry very quickly. They should be dry and ready to use again within an hour. If you can’t wait this long for them to dry, then only tumble dry them with no heat and separately from any other items."
                }
            ]
        }
    ],
    "tyn": [
        "Bucket",
        "Cold or warm water",
        "Washing machine",
        "Laundry detergent",
        "Clothesline or hangers"
    ],
    "text": " Rinsing Lightly-Used Microfiber Cloths by Hand Put the dirty cloths in a clean bucket filled with cool or warm water. Fill a clean bucket, big enough to hold all the cloths you want to wash, with clean cool or warm water. Toss the cloths in and let them soak for a few minutes. Tip: Always wash microfiber cloths separately from other items. Microfiber cloths are designed to pick up lint and dust. If you wash them with other fabrics, like cotton, they will just accumulate more lint. Hand washing works best for cleaning microfiber cloths that have been used to clean dry messes, such as for dusting. For dirtier cloths or those used to mop up spills, you will need to machine-wash them. Use your hands to move the cloths around in the water to release dirt. Swirl the microfiber cloths around in the bucket of water to loosen dust and other grime they have accumulated. You only need to do this for a minute or two. Don’t use detergent or any other cleaning products for this method. To get dust and light dirt out, all you need is clean water and a little agitation. Rinse the cloths out under cool running water and wring out the excess water. Take each cloth out and hold it under a running tap to rinse out any remaining dust and dirt. Wring out the excess water so that the cloths are not dripping. If this doesn't work to get the dirt and dust out of the cloths, then you will need to launder them in a washing machine to clean them thoroughly. Hang up the cloths and let them air dry. Hang each cloth up separately from other items on clothes hangers or a clothes line. Let them air dry completely before using them to clean again. Avoid drying microfiber cloths in a drying machine. Drying machines are full of lint and dust that the cloths will just pick up. If you absolutely must dry them in a machine, then tumble dry them with no heat and apart from other items. Laundering Heavily-Soiled Microfiber Cloths Pretreat any stains or spots with a drop of liquid laundry detergent. Rub a drop of liquid laundry detergent into each side of the stain with the tip of a finger. Let it soak in for 5 minutes before you launder the cloth. Tip: Don’t use any cleaning products when you clean with microfiber cloths if you want to prolong their lifespan. Use them on their own, or with clean water only. Wash microfiber cloths used to clean in the kitchen, bathroom, or used to clean liquid or greasy messes after each use. Put the dirty cloths in the washing machine separate from other items. Always wash microfiber cloths separately from other items, especially cotton clothing. This will keep them from picking up more lint. Certain types of fabrics will rub against the cloths and break down the microfiber bristles which will decrease their effectiveness as well. Put 1/2 the amount of liquid detergent you would normally use in the machine. Don’t use powdered laundry detergent because it can damage the microfibers. Close the laundry machine after you put the detergent in. Don’t add fabric softeners, bleach, vinegar, or anything other than liquid laundry detergent.These will break down the microfibers and damage the cloths. Run the washing machine on its cold or warm water cycle. Only use cold or warm water  because hot water can damage the microfibers, especially after repeated washes. Cold or warm water with detergent is sufficient to clean and disinfect the cloths. When washed correctly, microfiber cloths will survive 100-500 wash cycles and retain their effectiveness. Replace them when they start to feel rough, like normal washcloths. Hang the cloths to air dry. Remove the cloths from the washing machine and hang them on a laundry line or clothes hangers. Hang them in the sun, if you can, for added disinfection. Microfiber cloths dry very quickly. They should be dry and ready to use again within an hour. If you can’t wait this long for them to dry, then only tumble dry them with no heat and separately from any other items.",
    "sentences": [
        " Rinsing Lightly-Used Microfiber Cloths by Hand Put the dirty cloths in a clean bucket filled with cool or warm water.",
        "Fill a clean bucket, big enough to hold all the cloths you want to wash, with clean cool or warm water.",
        "Toss the cloths in and let them soak for a few minutes.",
        "Tip: Always wash microfiber cloths separately from other items.",
        "Microfiber cloths are designed to pick up lint and dust.",
        "If you wash them with other fabrics, like cotton, they will just accumulate more lint.",
        "Hand washing works best for cleaning microfiber cloths that have been used to clean dry messes, such as for dusting.",
        "For dirtier cloths or those used to mop up spills, you will need to machine-wash them.",
        "Use your hands to move the cloths around in the water to release dirt.",
        "Swirl the microfiber cloths around in the bucket of water to loosen dust and other grime they have accumulated.",
        "You only need to do this for a minute or two.",
        "Don’t use detergent or any other cleaning products for this method.",
        "To get dust and light dirt out, all you need is clean water and a little agitation.",
        "Rinse the cloths out under cool running water and wring out the excess water.",
        "Take each cloth out and hold it under a running tap to rinse out any remaining dust and dirt.",
        "Wring out the excess water so that the cloths are not dripping.",
        "If this doesn't work to get the dirt and dust out of the cloths, then you will need to launder them in a washing machine to clean them thoroughly.",
        "Hang up the cloths and let them air dry.",
        "Hang each cloth up separately from other items on clothes hangers or a clothes line.",
        "Let them air dry completely before using them to clean again.",
        "Avoid drying microfiber cloths in a drying machine.",
        "Drying machines are full of lint and dust that the cloths will just pick up.",
        "If you absolutely must dry them in a machine, then tumble dry them with no heat and apart from other items.",
        "Laundering Heavily-Soiled Microfiber Cloths Pretreat any stains or spots with a drop of liquid laundry detergent.",
        "Rub a drop of liquid laundry detergent into each side of the stain with the tip of a finger.",
        "Let it soak in for 5 minutes before you launder the cloth.",
        "Tip: Don’t use any cleaning products when you clean with microfiber cloths if you want to prolong their lifespan.",
        "Use them on their own, or with clean water only.",
        "Wash microfiber cloths used to clean in the kitchen, bathroom, or used to clean liquid or greasy messes after each use.",
        "Put the dirty cloths in the washing machine separate from other items.",
        "Always wash microfiber cloths separately from other items, especially cotton clothing.",
        "This will keep them from picking up more lint.",
        "Certain types of fabrics will rub against the cloths and break down the microfiber bristles which will decrease their effectiveness as well.",
        "Put 1/2 the amount of liquid detergent you would normally use in the machine.",
        "Don’t use powdered laundry detergent because it can damage the microfibers.",
        "Close the laundry machine after you put the detergent in.",
        "Don’t add fabric softeners, bleach, vinegar, or anything other than liquid laundry detergent.These will break down the microfibers and damage the cloths.",
        "Run the washing machine on its cold or warm water cycle.",
        "Only use cold or warm water  because hot water can damage the microfibers, especially after repeated washes.",
        "Cold or warm water with detergent is sufficient to clean and disinfect the cloths.",
        "When washed correctly, microfiber cloths will survive 100-500 wash cycles and retain their effectiveness.",
        "Replace them when they start to feel rough, like normal washcloths.",
        "Hang the cloths to air dry.",
        "Remove the cloths from the washing machine and hang them on a laundry line or clothes hangers.",
        "Hang them in the sun, if you can, for added disinfection.",
        "Microfiber cloths dry very quickly.",
        "They should be dry and ready to use again within an hour.",
        "If you can’t wait this long for them to dry, then only tumble dry them with no heat and separately from any other items."
    ]
}