{
    "title": "How to Decorate Gingerbread Cookies",
    "url": "https://www.wikihow.com/Decorate-Gingerbread-Cookies",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking"
    ],
    "methods": [
        {
            "name": "Icing the Cookies",
            "steps": [
                {
                    "headline": "Mix the squeezable icing and put it into a squeeze bottle.",
                    "description": "For a simple icing that comes together quickly, stir 2 cups (250 g) of powdered sugar with ⁄4 cup (59 ml) of milk and 1 teaspoon (4.9 ml) of vanilla extract. This will make a thin, smooth icing that's easy to squirt or drizzle.Variation: To give the icing a slight citrus flavor that pairs well with gingerbread, substitute orange juice for the milk. If you'd like to make the icing a little thicker, just stir in powdered sugar until it's the texture you want."
                },
                {
                    "headline": "Make royal icing for firm icing that holds its shape.",
                    "description": "To get a great level of detail when you decorate, beat 3 pasteurized egg whites or 6 tablespoons (89 ml) of pasteurized egg whites from a carton until they're frothy. Gradually beat in 4 cups (500 g) of powdered sugar on medium-low speed for 3 to 5 minutes so the icing becomes thick, smooth, and shiny. If you don't want to use pasteurized egg whites, try making the royal icing with 3 tablespoons (30 g) of meringue powder and ⁄2 cup (120 ml) of warm water instead."
                },
                {
                    "headline": "Dye the icing a variety of colors.",
                    "description": "Although white icing is striking against a dark gingerbread cookie, you can play around with different colors to make the cookies really stand out. Divide your icing into several small bowls and then mix food dye into each one until they're the colors you want. Add the food coloring gradually so you don't accidentally make the icing darker than you'd like. Keep in mind that it's difficult to make bright red using liquid food coloring, so consider using a gel paste or powdered food coloring to this color."
                },
                {
                    "headline": "Spread the icing or pipe it onto the cooled cookies.",
                    "description": "If you have kids helping you decorate or you don't want to mess with a piping bag, place a spoon or offset spatula into your icing. Then, spread it across the top of each cooled cookie. For more control or detail, you can fill a piping bag or squeeze bottle before piping patterns on the cookies.Did You Know? Flooding is a popular decorating technique where you pipe a line of royal icing along the edges of a cookie. Then, pipe icing across the center and use the tip of the bag to spread it around so the icing fills in all the gaps. Remember to use separate spoons or piping bags for each color of icing you're working with."
                },
                {
                    "headline": "Top the iced cookies with decorations, if desired, and dry them for 2 hours.",
                    "description": "Don't wait until your icing hardens or you won't be able to stick them onto your cookies! Once you've finished icing or decorating them, leave them to sit for 2 hours so the icing hardens completely before you serve or store them. Layer the cookies between waxed paper when you store them in an airtight container so they don't stick together. Store the cookies in an airtight container at room temperature for up to 2 to 3 weeks."
                }
            ]
        },
        {
            "name": "Adding Details and Candy",
            "steps": [
                {
                    "headline": "Cut your cookie dough into shapes before baking the gingerbread.",
                    "description": "Choose fun cookie cutters that reflect the holiday or theme you're baking the cookies for and cut the rolled dough into shapes. For example, if you're making holiday cookies, cut the gingerbread into snowflakes, trees, or snowmen.Tip: You can buy novelty cookie cutters at the grocery store, craft supply store, or online. Some libraries even rent out baking supplies, such as cookie cutters and pans, so check to see if you can borrow them. To make gingerbread cookies for a birthday, try cutting them into hearts, stars, or presents, for instance, or you could match them to the party's theme. For example, cut out gingerbread animals if the party is zoo themed."
                },
                {
                    "headline": "Press a decorative stamp into the dough before you bake the cookies.",
                    "description": "To create a subtle design on your gingerbread cookies, roll them out and cut them into your desired shape. Then, take a clean rubber or cookie stamp and press down gently to leave an imprint on the dough. The design will be visible on the cookies after you bake them. You can also roll out your batch of gingerbread dough with a standard rolling pin. Then, roll a fancy decorative pin over the dough to create a unique pattern or texture."
                },
                {
                    "headline": "Stack star-shaped cookies to create 3-dimensional trees.",
                    "description": "If you'd like to make small cookie trees that stand on their own, cut out star gingerbread cookies using at least 3 different sizes. Once you've baked and iced them, stack them so the largest star is on the bottom and the smallest is on top. Turn the points of the stars so they alternate like branches of the tree. To make your gingerbread trees look snow-covered, dust them with a little powdered sugar after you've stacked them."
                },
                {
                    "headline": "Stick a variety of colorful candies on the iced cookies.",
                    "description": "Once you've decorated the cookies with soft or royal icing, push a few pieces of bright candy onto them. As the icing hardens, it will hold the candies in place. You can arrange the candies in a pattern or use them to decorate gingerbread people. Consider decorating with:\nRed hot cinnamon candies\nGum drops\nM&Ms\nFinely crushed candy canes\nJelly beans"
                },
                {
                    "headline": "Scatter sprinkles or nonpareils over the icing.",
                    "description": "To give your cookies a sparkly or festive effect, pipe or spread the icing over them and immediately top them with colorful sprinkles or nonpareils. They'll set in place as the icing hardens. You can find sprinkles in a variety of shapes, such as snowflakes, stars, trees, or holly leaves, at the supermarket or craft supply store. For the sparkliest cookies, sprinkle edible glitter over the iced cookies."
                },
                {
                    "headline": "Heat colored candy melts and paint detail on your gingerbread cookies.",
                    "description": "If you don't want to cover the cookies with icing, but you'd still like to spread some color, melt a few different types of candy melts. Then, dip a clean brush into the candy melt and paint the gingerbread cookies. This is a great way to paint branches on trees, ruffles on hearts, or faces on gingerbread people. Try dipping the cookies into the melted mixture or flick the tip of the brush to splatter the candy melt onto your cookies for a unique effect."
                }
            ]
        }
    ],
    "tyn": [
        "Mixing bowl",
        "Measuring cups and spoons",
        "Piping bag with tips",
        "Wire rack"
    ],
    "text": " Icing the Cookies Mix the squeezable icing and put it into a squeeze bottle. For a simple icing that comes together quickly, stir 2 cups (250 g) of powdered sugar with ⁄4 cup (59 ml) of milk and 1 teaspoon (4.9 ml) of vanilla extract. This will make a thin, smooth icing that's easy to squirt or drizzle.Variation: To give the icing a slight citrus flavor that pairs well with gingerbread, substitute orange juice for the milk. If you'd like to make the icing a little thicker, just stir in powdered sugar until it's the texture you want. Make royal icing for firm icing that holds its shape. To get a great level of detail when you decorate, beat 3 pasteurized egg whites or 6 tablespoons (89 ml) of pasteurized egg whites from a carton until they're frothy. Gradually beat in 4 cups (500 g) of powdered sugar on medium-low speed for 3 to 5 minutes so the icing becomes thick, smooth, and shiny. If you don't want to use pasteurized egg whites, try making the royal icing with 3 tablespoons (30 g) of meringue powder and ⁄2 cup (120 ml) of warm water instead. Dye the icing a variety of colors. Although white icing is striking against a dark gingerbread cookie, you can play around with different colors to make the cookies really stand out. Divide your icing into several small bowls and then mix food dye into each one until they're the colors you want. Add the food coloring gradually so you don't accidentally make the icing darker than you'd like. Keep in mind that it's difficult to make bright red using liquid food coloring, so consider using a gel paste or powdered food coloring to this color. Spread the icing or pipe it onto the cooled cookies. If you have kids helping you decorate or you don't want to mess with a piping bag, place a spoon or offset spatula into your icing. Then, spread it across the top of each cooled cookie. For more control or detail, you can fill a piping bag or squeeze bottle before piping patterns on the cookies.Did You Know? Flooding is a popular decorating technique where you pipe a line of royal icing along the edges of a cookie. Then, pipe icing across the center and use the tip of the bag to spread it around so the icing fills in all the gaps. Remember to use separate spoons or piping bags for each color of icing you're working with. Top the iced cookies with decorations, if desired, and dry them for 2 hours. Don't wait until your icing hardens or you won't be able to stick them onto your cookies! Once you've finished icing or decorating them, leave them to sit for 2 hours so the icing hardens completely before you serve or store them. Layer the cookies between waxed paper when you store them in an airtight container so they don't stick together. Store the cookies in an airtight container at room temperature for up to 2 to 3 weeks. Adding Details and Candy Cut your cookie dough into shapes before baking the gingerbread. Choose fun cookie cutters that reflect the holiday or theme you're baking the cookies for and cut the rolled dough into shapes. For example, if you're making holiday cookies, cut the gingerbread into snowflakes, trees, or snowmen.Tip: You can buy novelty cookie cutters at the grocery store, craft supply store, or online. Some libraries even rent out baking supplies, such as cookie cutters and pans, so check to see if you can borrow them. To make gingerbread cookies for a birthday, try cutting them into hearts, stars, or presents, for instance, or you could match them to the party's theme. For example, cut out gingerbread animals if the party is zoo themed. Press a decorative stamp into the dough before you bake the cookies. To create a subtle design on your gingerbread cookies, roll them out and cut them into your desired shape. Then, take a clean rubber or cookie stamp and press down gently to leave an imprint on the dough. The design will be visible on the cookies after you bake them. You can also roll out your batch of gingerbread dough with a standard rolling pin. Then, roll a fancy decorative pin over the dough to create a unique pattern or texture. Stack star-shaped cookies to create 3-dimensional trees. If you'd like to make small cookie trees that stand on their own, cut out star gingerbread cookies using at least 3 different sizes. Once you've baked and iced them, stack them so the largest star is on the bottom and the smallest is on top. Turn the points of the stars so they alternate like branches of the tree. To make your gingerbread trees look snow-covered, dust them with a little powdered sugar after you've stacked them. Stick a variety of colorful candies on the iced cookies. Once you've decorated the cookies with soft or royal icing, push a few pieces of bright candy onto them. As the icing hardens, it will hold the candies in place. You can arrange the candies in a pattern or use them to decorate gingerbread people. Consider decorating with:\nRed hot cinnamon candies\nGum drops\nM&Ms\nFinely crushed candy canes\nJelly beans Scatter sprinkles or nonpareils over the icing. To give your cookies a sparkly or festive effect, pipe or spread the icing over them and immediately top them with colorful sprinkles or nonpareils. They'll set in place as the icing hardens. You can find sprinkles in a variety of shapes, such as snowflakes, stars, trees, or holly leaves, at the supermarket or craft supply store. For the sparkliest cookies, sprinkle edible glitter over the iced cookies. Heat colored candy melts and paint detail on your gingerbread cookies. If you don't want to cover the cookies with icing, but you'd still like to spread some color, melt a few different types of candy melts. Then, dip a clean brush into the candy melt and paint the gingerbread cookies. This is a great way to paint branches on trees, ruffles on hearts, or faces on gingerbread people. Try dipping the cookies into the melted mixture or flick the tip of the brush to splatter the candy melt onto your cookies for a unique effect.",
    "sentences": [
        " Icing the Cookies Mix the squeezable icing and put it into a squeeze bottle.",
        "For a simple icing that comes together quickly, stir 2 cups (250 g) of powdered sugar with ⁄4 cup (59 ml) of milk and 1 teaspoon (4.9 ml) of vanilla extract.",
        "This will make a thin, smooth icing that's easy to squirt or drizzle.Variation: To give the icing a slight citrus flavor that pairs well with gingerbread, substitute orange juice for the milk.",
        "If you'd like to make the icing a little thicker, just stir in powdered sugar until it's the texture you want.",
        "Make royal icing for firm icing that holds its shape.",
        "To get a great level of detail when you decorate, beat 3 pasteurized egg whites or 6 tablespoons (89 ml) of pasteurized egg whites from a carton until they're frothy.",
        "Gradually beat in 4 cups (500 g) of powdered sugar on medium-low speed for 3 to 5 minutes so the icing becomes thick, smooth, and shiny.",
        "If you don't want to use pasteurized egg whites, try making the royal icing with 3 tablespoons (30 g) of meringue powder and ⁄2 cup (120 ml) of warm water instead.",
        "Dye the icing a variety of colors.",
        "Although white icing is striking against a dark gingerbread cookie, you can play around with different colors to make the cookies really stand out.",
        "Divide your icing into several small bowls and then mix food dye into each one until they're the colors you want.",
        "Add the food coloring gradually so you don't accidentally make the icing darker than you'd like.",
        "Keep in mind that it's difficult to make bright red using liquid food coloring, so consider using a gel paste or powdered food coloring to this color.",
        "Spread the icing or pipe it onto the cooled cookies.",
        "If you have kids helping you decorate or you don't want to mess with a piping bag, place a spoon or offset spatula into your icing.",
        "Then, spread it across the top of each cooled cookie.",
        "For more control or detail, you can fill a piping bag or squeeze bottle before piping patterns on the cookies.Did You Know?",
        "Flooding is a popular decorating technique where you pipe a line of royal icing along the edges of a cookie.",
        "Then, pipe icing across the center and use the tip of the bag to spread it around so the icing fills in all the gaps.",
        "Remember to use separate spoons or piping bags for each color of icing you're working with.",
        "Top the iced cookies with decorations, if desired, and dry them for 2 hours.",
        "Don't wait until your icing hardens or you won't be able to stick them onto your cookies!",
        "Once you've finished icing or decorating them, leave them to sit for 2 hours so the icing hardens completely before you serve or store them.",
        "Layer the cookies between waxed paper when you store them in an airtight container so they don't stick together.",
        "Store the cookies in an airtight container at room temperature for up to 2 to 3 weeks.",
        "Adding Details and Candy Cut your cookie dough into shapes before baking the gingerbread.",
        "Choose fun cookie cutters that reflect the holiday or theme you're baking the cookies for and cut the rolled dough into shapes.",
        "For example, if you're making holiday cookies, cut the gingerbread into snowflakes, trees, or snowmen.Tip: You can buy novelty cookie cutters at the grocery store, craft supply store, or online.",
        "Some libraries even rent out baking supplies, such as cookie cutters and pans, so check to see if you can borrow them.",
        "To make gingerbread cookies for a birthday, try cutting them into hearts, stars, or presents, for instance, or you could match them to the party's theme.",
        "For example, cut out gingerbread animals if the party is zoo themed.",
        "Press a decorative stamp into the dough before you bake the cookies.",
        "To create a subtle design on your gingerbread cookies, roll them out and cut them into your desired shape.",
        "Then, take a clean rubber or cookie stamp and press down gently to leave an imprint on the dough.",
        "The design will be visible on the cookies after you bake them.",
        "You can also roll out your batch of gingerbread dough with a standard rolling pin.",
        "Then, roll a fancy decorative pin over the dough to create a unique pattern or texture.",
        "Stack star-shaped cookies to create 3-dimensional trees.",
        "If you'd like to make small cookie trees that stand on their own, cut out star gingerbread cookies using at least 3 different sizes.",
        "Once you've baked and iced them, stack them so the largest star is on the bottom and the smallest is on top.",
        "Turn the points of the stars so they alternate like branches of the tree.",
        "To make your gingerbread trees look snow-covered, dust them with a little powdered sugar after you've stacked them.",
        "Stick a variety of colorful candies on the iced cookies.",
        "Once you've decorated the cookies with soft or royal icing, push a few pieces of bright candy onto them.",
        "As the icing hardens, it will hold the candies in place.",
        "You can arrange the candies in a pattern or use them to decorate gingerbread people.",
        "Consider decorating with:\nRed hot cinnamon candies\nGum drops\nM&Ms\nFinely crushed candy canes\nJelly beans Scatter sprinkles or nonpareils over the icing.",
        "To give your cookies a sparkly or festive effect, pipe or spread the icing over them and immediately top them with colorful sprinkles or nonpareils.",
        "They'll set in place as the icing hardens.",
        "You can find sprinkles in a variety of shapes, such as snowflakes, stars, trees, or holly leaves, at the supermarket or craft supply store.",
        "For the sparkliest cookies, sprinkle edible glitter over the iced cookies.",
        "Heat colored candy melts and paint detail on your gingerbread cookies.",
        "If you don't want to cover the cookies with icing, but you'd still like to spread some color, melt a few different types of candy melts.",
        "Then, dip a clean brush into the candy melt and paint the gingerbread cookies.",
        "This is a great way to paint branches on trees, ruffles on hearts, or faces on gingerbread people.",
        "Try dipping the cookies into the melted mixture or flick the tip of the brush to splatter the candy melt onto your cookies for a unique effect."
    ]
}