{
    "title": "How to Paint a Cake",
    "url": "https://www.wikihow.com/Paint-a-Cake",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking",
        "Cakes",
        "Cake Making Tips"
    ],
    "parts": [
        {
            "name": "Choosing and Chilling the Cake",
            "steps": [
                {
                    "headline": "Make or buy a cake covered in white fondant or buttercream.",
                    "description": "Feel free to make your cake from scratch or buy it from a bakery, just make sure you go with a white surface to serve as a nice blank canvas for your painting. Fondant and buttercream provide the best surfaces to paint on, and you can select one or the other based on your personal tastes and available budget. Fondant is fairly expensive and can be hard to work with, but it offers a nice, smooth slate to paint on. You can start with a fondant-covered cake, or buy sheets of fondant and paint them before putting them on the cake. Buttercream is a bit cheaper and most people think it tastes better than fondant. It’s also softer than fondant, which makes harder to work with. This isn’t a big deal as long as you stay vigilant about keeping the cake chilled during the painting process."
                },
                {
                    "headline": "Measure the cake's surface area so you can plan your design.",
                    "description": "If you’re painting intricate details or words on your cake, it’s best to measure the surface area with a tape measure so you can be precise. If you’re freehanding a design, you can just eyeball it or hold your sketch paper up next to the cake to get an idea of how much space you have to work with."
                },
                {
                    "headline": "Chill the cake in the fridge for 30 minutes to harden the surface.",
                    "description": "The fondant or buttercream needs to be hard to the touch before you paint on it, so pop it in the fridge for half an hour or so. Be sure to set up your workspace on a flat surface in a cool area, since the cake will start to soften as soon as you take it out of the fridge. Avoid working around heat and humidity for the best results! Some people like to crank up the air conditioner while the cake chills to create a cool environment to work in. Make sure your workspace is out of direct sunlight."
                },
                {
                    "headline": "Create a rough sketch of your cake design on paper.",
                    "description": "Your sketch can be as loose or as detailed as you want it to be. If you’re planning intricate details or doing lettering, it can help to create a pretty literal sketch. Otherwise, you can just sketch out a rough idea of the main elements and their placement. Go ahead and plan what colors you want to use and where they go in your design. Make detailed notes on your sketch so that you don’t get confused later on. Finalize your sketch while the cake is chilling in the fridge so you can get right to work when you take it out. If you’re working on rolled out pieces of fondant, you can sketch directly onto the surface with a food-safe pencil."
                }
            ]
        },
        {
            "name": "Selecting and Mixing Colors",
            "steps": [
                {
                    "headline": "Use gel food coloring for the easiest option.",
                    "description": "Gel food coloring usually comes in small tubes or squirt bottles and there’s a wide range of colors on the market to choose from. You can buy a set of primary colors and create your own palette by mixing colors yourself, or you can just buy the specific colors you want to use for your design. You can buy gel food coloring online, at specialty food shops, and many grocery stores."
                },
                {
                    "headline": "Go with powdered pigment to create specialty colors and finishes.",
                    "description": "Powdered pigments are harder to work with than gel food coloring and require a little more preparation, but they also provide a wider range of artistic options. For example, you can use pearl dust to create a luminous look, which you just can’t create with gel food coloring. You can also create unique finishes and sheens, like lustrous-looking metallics. Powdered pigments are typically a bit more expensive than gel food coloring. You can buy them online or at specialty food shops. Always make sure you're using edible, non-toxic pigments and dusts."
                },
                {
                    "headline": "Choose a thinner like vodka, Everclear, water, or lemon extract.",
                    "description": "No matter what kind of color you use, you will need a thinner to dilute it. High-proof grain alcohol is easy to work with and dries quickly, so you can layer color and add details easily without messing up previous coats. Water is a common choice, but it dries slowly and may not be a great option for beginners. Lemon extract contains alcohol, so it dries pretty quickly, but it’s also expensive and harder to find. Alcohol is the best choice if you’re planning to paint intricate details, or if you want the process to go quickly. Don’t worry – the alcohol will evaporate completely and won’t leave any trace of flavor behind. Keep in mind that lemon extract can leave traces of citrus flavor behind. This could be a good or bad thing, depending on the flavor of your cake."
                },
                {
                    "headline": "Choose your colors and place them near your plastic palette.",
                    "description": "Grab all of the colors you’re using and a cheap, plastic watercolor palette and set them up in your workspace. The small wells in the plastic palette are perfect for mixing and diluting your paint, and you can buy them at any art supply store. If you don’t have a plastic palette, you can use separate jars or plastic cups for each paint color."
                },
                {
                    "headline": "Add a small amount of each color to the palette wells.",
                    "description": "Put a single color into each well, or 2 colors if you’re mixing up your own shades. The more pigment you use, the darker and more saturated the color will look on your cake, so keep that in mind if you’re aiming for pastels. If you’re creating different shades of the same color, you may want to create them in separate wells."
                },
                {
                    "headline": "Add a few drops of thinner to each well to dilute the pigment.",
                    "description": "You can do this with a dropper, spoon, paintbrush, or anything else you have on hand that allows you to easily transfer liquid in a controlled way. The more thinner you add to each color, the lighter it will be. You may need to experiment with dilution until get the exact shade you want. If you’re working with alcohol, keep in mind that it evaporates quickly and you may need to add more to your wells from time to time."
                },
                {
                    "headline": "Place a small jar of thinner near your workspace to clean your brushes.",
                    "description": "You will use this to clean your brushes in between applications so that you don't contaminate colors. Avoid drawing from this jar of thinner to dilute paint further, since it will be contaminated with other colors and create muddy colors on your palette."
                }
            ]
        },
        {
            "name": "Applying the Color",
            "steps": [
                {
                    "headline": "Use wide brushes to paint large spaces and small brushes to add details.",
                    "description": "Regular artist paint brushes work perfectly for this, and it helps to have an assortment of sizes on hand. It doesn't matter what the brushes are made out of as long as the bristles are high-quality, neat, and synthetic. Experiment with different brush sizes and shapes to create different effects. For example, you could try using a Japanese calligraphy brush to paint ultra-fine details onto your cake. Synthetic bristles are considered to be food-safe. Natural brushes are made from animal hair and aren't recommended. You can also work with sponges or foam applicators to get different looks."
                },
                {
                    "headline": "Paint the background colors in first.",
                    "description": "Dip a large, wide brush into the diluted color of your choice until the bristles are saturated. Lightly touch the brush to the cake's surface and paint on the color using even strokes. You can use any color you'd like for the background, but keep in mind that if you're painting details on top, they will need to be darker than the background to show up. Continue reloading your brush with color, as needed, to maintain consistent saturation. It can help to paint a light sketch of your design onto the cake to block out your space before adding saturated colors and details on top. Remember to touch the surface of the cake with the brush as lightly as you can. You don’t want to disturb the smoothness of the surface at all."
                },
                {
                    "headline": "Let each coat dry before adding a new one to prevent smudging.",
                    "description": "Always let the first layer dry before adding details on top, especially if you’re creating a detailed or intricate design. If you’re diluting the paint with alcohol, it will be mostly dry within a few seconds. If you’re using water or lemon extract, let coats dry for several minutes and double check before adding new colors on top. If you’re going for a stylized watercolor design, you can experiment with adding new colors without letting the first layers dry to create cool, blurry effects."
                },
                {
                    "headline": "Paint details and outlines last.",
                    "description": "Start by painting in middle-ground details and save the finest details for last for the best results. When you’re doing lettering or smaller elements, start with a tiny amount of color on the brush and work up from there. You can always reload your brush to darken a color, but once the paint is on the cake, it’s really hard to correct mistakes or tone down the color."
                },
                {
                    "headline": "Check your cake periodically and pop it back in the fridge if it softens.",
                    "description": "If the surface no longer feels hard to the touch, or if you notice the paintbrush making an impression on the surface, you need to chill the cake for a few minutes before continuing. Chill it for 15 minutes to an hour until it firms back up. This is important, especially if you’re working with buttercream, since it softens faster than fondant. If you’re waiting for a color to dry before adding a new layer, consider chilling the cake during this time."
                }
            ]
        }
    ],
    "tyn": [
        "Cake covered with white fondant or buttercream",
        "Tape measure",
        "Sketchpad and pencil",
        "Gel food coloring or powdered pigment in the colors of your choice",
        "Vodka, Everclear, water, or lemon extract to dilute paint",
        "An assortment of paintbrushes",
        "Plastic watercolor palette or small glass jars",
        "Paper towels"
    ],
    "text": " Choosing and Chilling the Cake Make or buy a cake covered in white fondant or buttercream. Feel free to make your cake from scratch or buy it from a bakery, just make sure you go with a white surface to serve as a nice blank canvas for your painting. Fondant and buttercream provide the best surfaces to paint on, and you can select one or the other based on your personal tastes and available budget. Fondant is fairly expensive and can be hard to work with, but it offers a nice, smooth slate to paint on. You can start with a fondant-covered cake, or buy sheets of fondant and paint them before putting them on the cake. Buttercream is a bit cheaper and most people think it tastes better than fondant. It’s also softer than fondant, which makes harder to work with. This isn’t a big deal as long as you stay vigilant about keeping the cake chilled during the painting process. Measure the cake's surface area so you can plan your design. If you’re painting intricate details or words on your cake, it’s best to measure the surface area with a tape measure so you can be precise. If you’re freehanding a design, you can just eyeball it or hold your sketch paper up next to the cake to get an idea of how much space you have to work with. Chill the cake in the fridge for 30 minutes to harden the surface. The fondant or buttercream needs to be hard to the touch before you paint on it, so pop it in the fridge for half an hour or so. Be sure to set up your workspace on a flat surface in a cool area, since the cake will start to soften as soon as you take it out of the fridge. Avoid working around heat and humidity for the best results! Some people like to crank up the air conditioner while the cake chills to create a cool environment to work in. Make sure your workspace is out of direct sunlight. Create a rough sketch of your cake design on paper. Your sketch can be as loose or as detailed as you want it to be. If you’re planning intricate details or doing lettering, it can help to create a pretty literal sketch. Otherwise, you can just sketch out a rough idea of the main elements and their placement. Go ahead and plan what colors you want to use and where they go in your design. Make detailed notes on your sketch so that you don’t get confused later on. Finalize your sketch while the cake is chilling in the fridge so you can get right to work when you take it out. If you’re working on rolled out pieces of fondant, you can sketch directly onto the surface with a food-safe pencil. Selecting and Mixing Colors Use gel food coloring for the easiest option. Gel food coloring usually comes in small tubes or squirt bottles and there’s a wide range of colors on the market to choose from. You can buy a set of primary colors and create your own palette by mixing colors yourself, or you can just buy the specific colors you want to use for your design. You can buy gel food coloring online, at specialty food shops, and many grocery stores. Go with powdered pigment to create specialty colors and finishes. Powdered pigments are harder to work with than gel food coloring and require a little more preparation, but they also provide a wider range of artistic options. For example, you can use pearl dust to create a luminous look, which you just can’t create with gel food coloring. You can also create unique finishes and sheens, like lustrous-looking metallics. Powdered pigments are typically a bit more expensive than gel food coloring. You can buy them online or at specialty food shops. Always make sure you're using edible, non-toxic pigments and dusts. Choose a thinner like vodka, Everclear, water, or lemon extract. No matter what kind of color you use, you will need a thinner to dilute it. High-proof grain alcohol is easy to work with and dries quickly, so you can layer color and add details easily without messing up previous coats. Water is a common choice, but it dries slowly and may not be a great option for beginners. Lemon extract contains alcohol, so it dries pretty quickly, but it’s also expensive and harder to find. Alcohol is the best choice if you’re planning to paint intricate details, or if you want the process to go quickly. Don’t worry – the alcohol will evaporate completely and won’t leave any trace of flavor behind. Keep in mind that lemon extract can leave traces of citrus flavor behind. This could be a good or bad thing, depending on the flavor of your cake. Choose your colors and place them near your plastic palette. Grab all of the colors you’re using and a cheap, plastic watercolor palette and set them up in your workspace. The small wells in the plastic palette are perfect for mixing and diluting your paint, and you can buy them at any art supply store. If you don’t have a plastic palette, you can use separate jars or plastic cups for each paint color. Add a small amount of each color to the palette wells. Put a single color into each well, or 2 colors if you’re mixing up your own shades. The more pigment you use, the darker and more saturated the color will look on your cake, so keep that in mind if you’re aiming for pastels. If you’re creating different shades of the same color, you may want to create them in separate wells. Add a few drops of thinner to each well to dilute the pigment. You can do this with a dropper, spoon, paintbrush, or anything else you have on hand that allows you to easily transfer liquid in a controlled way. The more thinner you add to each color, the lighter it will be. You may need to experiment with dilution until get the exact shade you want. If you’re working with alcohol, keep in mind that it evaporates quickly and you may need to add more to your wells from time to time. Place a small jar of thinner near your workspace to clean your brushes. You will use this to clean your brushes in between applications so that you don't contaminate colors. Avoid drawing from this jar of thinner to dilute paint further, since it will be contaminated with other colors and create muddy colors on your palette. Applying the Color Use wide brushes to paint large spaces and small brushes to add details. Regular artist paint brushes work perfectly for this, and it helps to have an assortment of sizes on hand. It doesn't matter what the brushes are made out of as long as the bristles are high-quality, neat, and synthetic. Experiment with different brush sizes and shapes to create different effects. For example, you could try using a Japanese calligraphy brush to paint ultra-fine details onto your cake. Synthetic bristles are considered to be food-safe. Natural brushes are made from animal hair and aren't recommended. You can also work with sponges or foam applicators to get different looks. Paint the background colors in first. Dip a large, wide brush into the diluted color of your choice until the bristles are saturated. Lightly touch the brush to the cake's surface and paint on the color using even strokes. You can use any color you'd like for the background, but keep in mind that if you're painting details on top, they will need to be darker than the background to show up. Continue reloading your brush with color, as needed, to maintain consistent saturation. It can help to paint a light sketch of your design onto the cake to block out your space before adding saturated colors and details on top. Remember to touch the surface of the cake with the brush as lightly as you can. You don’t want to disturb the smoothness of the surface at all. Let each coat dry before adding a new one to prevent smudging. Always let the first layer dry before adding details on top, especially if you’re creating a detailed or intricate design. If you’re diluting the paint with alcohol, it will be mostly dry within a few seconds. If you’re using water or lemon extract, let coats dry for several minutes and double check before adding new colors on top. If you’re going for a stylized watercolor design, you can experiment with adding new colors without letting the first layers dry to create cool, blurry effects. Paint details and outlines last. Start by painting in middle-ground details and save the finest details for last for the best results. When you’re doing lettering or smaller elements, start with a tiny amount of color on the brush and work up from there. You can always reload your brush to darken a color, but once the paint is on the cake, it’s really hard to correct mistakes or tone down the color. Check your cake periodically and pop it back in the fridge if it softens. If the surface no longer feels hard to the touch, or if you notice the paintbrush making an impression on the surface, you need to chill the cake for a few minutes before continuing. Chill it for 15 minutes to an hour until it firms back up. This is important, especially if you’re working with buttercream, since it softens faster than fondant. If you’re waiting for a color to dry before adding a new layer, consider chilling the cake during this time.",
    "sentences": [
        " Choosing and Chilling the Cake Make or buy a cake covered in white fondant or buttercream.",
        "Feel free to make your cake from scratch or buy it from a bakery, just make sure you go with a white surface to serve as a nice blank canvas for your painting.",
        "Fondant and buttercream provide the best surfaces to paint on, and you can select one or the other based on your personal tastes and available budget.",
        "Fondant is fairly expensive and can be hard to work with, but it offers a nice, smooth slate to paint on.",
        "You can start with a fondant-covered cake, or buy sheets of fondant and paint them before putting them on the cake.",
        "Buttercream is a bit cheaper and most people think it tastes better than fondant.",
        "It’s also softer than fondant, which makes harder to work with.",
        "This isn’t a big deal as long as you stay vigilant about keeping the cake chilled during the painting process.",
        "Measure the cake's surface area so you can plan your design.",
        "If you’re painting intricate details or words on your cake, it’s best to measure the surface area with a tape measure so you can be precise.",
        "If you’re freehanding a design, you can just eyeball it or hold your sketch paper up next to the cake to get an idea of how much space you have to work with.",
        "Chill the cake in the fridge for 30 minutes to harden the surface.",
        "The fondant or buttercream needs to be hard to the touch before you paint on it, so pop it in the fridge for half an hour or so.",
        "Be sure to set up your workspace on a flat surface in a cool area, since the cake will start to soften as soon as you take it out of the fridge.",
        "Avoid working around heat and humidity for the best results!",
        "Some people like to crank up the air conditioner while the cake chills to create a cool environment to work in.",
        "Make sure your workspace is out of direct sunlight.",
        "Create a rough sketch of your cake design on paper.",
        "Your sketch can be as loose or as detailed as you want it to be.",
        "If you’re planning intricate details or doing lettering, it can help to create a pretty literal sketch.",
        "Otherwise, you can just sketch out a rough idea of the main elements and their placement.",
        "Go ahead and plan what colors you want to use and where they go in your design.",
        "Make detailed notes on your sketch so that you don’t get confused later on.",
        "Finalize your sketch while the cake is chilling in the fridge so you can get right to work when you take it out.",
        "If you’re working on rolled out pieces of fondant, you can sketch directly onto the surface with a food-safe pencil.",
        "Selecting and Mixing Colors Use gel food coloring for the easiest option.",
        "Gel food coloring usually comes in small tubes or squirt bottles and there’s a wide range of colors on the market to choose from.",
        "You can buy a set of primary colors and create your own palette by mixing colors yourself, or you can just buy the specific colors you want to use for your design.",
        "You can buy gel food coloring online, at specialty food shops, and many grocery stores.",
        "Go with powdered pigment to create specialty colors and finishes.",
        "Powdered pigments are harder to work with than gel food coloring and require a little more preparation, but they also provide a wider range of artistic options.",
        "For example, you can use pearl dust to create a luminous look, which you just can’t create with gel food coloring.",
        "You can also create unique finishes and sheens, like lustrous-looking metallics.",
        "Powdered pigments are typically a bit more expensive than gel food coloring.",
        "You can buy them online or at specialty food shops.",
        "Always make sure you're using edible, non-toxic pigments and dusts.",
        "Choose a thinner like vodka, Everclear, water, or lemon extract.",
        "No matter what kind of color you use, you will need a thinner to dilute it.",
        "High-proof grain alcohol is easy to work with and dries quickly, so you can layer color and add details easily without messing up previous coats.",
        "Water is a common choice, but it dries slowly and may not be a great option for beginners.",
        "Lemon extract contains alcohol, so it dries pretty quickly, but it’s also expensive and harder to find.",
        "Alcohol is the best choice if you’re planning to paint intricate details, or if you want the process to go quickly.",
        "Don’t worry – the alcohol will evaporate completely and won’t leave any trace of flavor behind.",
        "Keep in mind that lemon extract can leave traces of citrus flavor behind.",
        "This could be a good or bad thing, depending on the flavor of your cake.",
        "Choose your colors and place them near your plastic palette.",
        "Grab all of the colors you’re using and a cheap, plastic watercolor palette and set them up in your workspace.",
        "The small wells in the plastic palette are perfect for mixing and diluting your paint, and you can buy them at any art supply store.",
        "If you don’t have a plastic palette, you can use separate jars or plastic cups for each paint color.",
        "Add a small amount of each color to the palette wells.",
        "Put a single color into each well, or 2 colors if you’re mixing up your own shades.",
        "The more pigment you use, the darker and more saturated the color will look on your cake, so keep that in mind if you’re aiming for pastels.",
        "If you’re creating different shades of the same color, you may want to create them in separate wells.",
        "Add a few drops of thinner to each well to dilute the pigment.",
        "You can do this with a dropper, spoon, paintbrush, or anything else you have on hand that allows you to easily transfer liquid in a controlled way.",
        "The more thinner you add to each color, the lighter it will be.",
        "You may need to experiment with dilution until get the exact shade you want.",
        "If you’re working with alcohol, keep in mind that it evaporates quickly and you may need to add more to your wells from time to time.",
        "Place a small jar of thinner near your workspace to clean your brushes.",
        "You will use this to clean your brushes in between applications so that you don't contaminate colors.",
        "Avoid drawing from this jar of thinner to dilute paint further, since it will be contaminated with other colors and create muddy colors on your palette.",
        "Applying the Color Use wide brushes to paint large spaces and small brushes to add details.",
        "Regular artist paint brushes work perfectly for this, and it helps to have an assortment of sizes on hand.",
        "It doesn't matter what the brushes are made out of as long as the bristles are high-quality, neat, and synthetic.",
        "Experiment with different brush sizes and shapes to create different effects.",
        "For example, you could try using a Japanese calligraphy brush to paint ultra-fine details onto your cake.",
        "Synthetic bristles are considered to be food-safe.",
        "Natural brushes are made from animal hair and aren't recommended.",
        "You can also work with sponges or foam applicators to get different looks.",
        "Paint the background colors in first.",
        "Dip a large, wide brush into the diluted color of your choice until the bristles are saturated.",
        "Lightly touch the brush to the cake's surface and paint on the color using even strokes.",
        "You can use any color you'd like for the background, but keep in mind that if you're painting details on top, they will need to be darker than the background to show up.",
        "Continue reloading your brush with color, as needed, to maintain consistent saturation.",
        "It can help to paint a light sketch of your design onto the cake to block out your space before adding saturated colors and details on top.",
        "Remember to touch the surface of the cake with the brush as lightly as you can.",
        "You don’t want to disturb the smoothness of the surface at all.",
        "Let each coat dry before adding a new one to prevent smudging.",
        "Always let the first layer dry before adding details on top, especially if you’re creating a detailed or intricate design.",
        "If you’re diluting the paint with alcohol, it will be mostly dry within a few seconds.",
        "If you’re using water or lemon extract, let coats dry for several minutes and double check before adding new colors on top.",
        "If you’re going for a stylized watercolor design, you can experiment with adding new colors without letting the first layers dry to create cool, blurry effects.",
        "Paint details and outlines last.",
        "Start by painting in middle-ground details and save the finest details for last for the best results.",
        "When you’re doing lettering or smaller elements, start with a tiny amount of color on the brush and work up from there.",
        "You can always reload your brush to darken a color, but once the paint is on the cake, it’s really hard to correct mistakes or tone down the color.",
        "Check your cake periodically and pop it back in the fridge if it softens.",
        "If the surface no longer feels hard to the touch, or if you notice the paintbrush making an impression on the surface, you need to chill the cake for a few minutes before continuing.",
        "Chill it for 15 minutes to an hour until it firms back up.",
        "This is important, especially if you’re working with buttercream, since it softens faster than fondant.",
        "If you’re waiting for a color to dry before adding a new layer, consider chilling the cake during this time."
    ]
}