{
    "title": "How to Clean a Cuisinart Coffee Maker",
    "url": "https://www.wikihow.com/Clean-a-Cuisinart-Coffee-Maker",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Coffee",
        "Coffee Accessories"
    ],
    "methods": [
        {
            "name": "Cleaning the Water Reservoir",
            "steps": [
                {
                    "headline": "Decalcify your coffee maker every 1-6 months.",
                    "description": "If you use your coffee maker more than once a day, you may need to clean your  water reservoir once a month to decalcify (remove hard water and mineral build ups from) the machine. If you use it less frequently, however, you can wait up to 6 months between cleanings. Either way, the hardness of your tap water will influence how often you need to clean your machine. If your coffee begins to taste bitter or otherwise off, it may be time to decalcify the reservoir. If you have a Clean button on your Cuisinart, it will begin flashing when the machine needs to be decalcified."
                },
                {
                    "headline": "Empty the carafe and grounds.",
                    "description": "If you have any coffee remaining in the carafe, discard it and rinse the carafe with water. Remove the basket from the machine and dump out any coffee grounds or paper filters."
                },
                {
                    "headline": "Fill the water reservoir with 1 part white vinegar and 2 parts water.",
                    "description": "Mix enough white vinegar and regular tap water to fill the reservoir to its full capacity. You can use the carafe to measure and pour the solution. The exact amount of vinegar and water you use will depend on the size of your coffee maker. For a standard 12-cup coffee maker, you will need 4 cups of vinegar and 8 cups of water to fully fill the reservoir."
                },
                {
                    "headline": "Press the Clean button if your coffeemaker has one.",
                    "description": "Once the Clean light glows, press the On/Off button to begin the cycle. The Clean light should shine steadily to indicate that the machine is in CLEAN mode. Once the cycle is finished, the machine should beep 5 times and turn off. The CLEAN cycle will take 2-3 times longer than your normal brew, as the machine will pause between every few cups it makes."
                },
                {
                    "headline": "Run a brew cycle manually if your coffeemaker doesn't have a self-clean function.",
                    "description": "Once you've filled the reservoir, simply turn the machine on to run a cycle, just as if you were making a regular pot of coffee. For a deeper clean, turn off the coffee maker off mid-way through the brew cycle and let it sit for an hour. Then turn the coffee maker on again and let the brew cycle finish."
                },
                {
                    "headline": "Repeat the cycle if you can still see build-up inside the reservoir.",
                    "description": "One cycle of the vinegar-water mixture should be sufficient to clean the machine. However, if you have a particularly dirty coffee maker, you may need to run it again. Once the vinegar-water mixture has finished running and the machine has cooled, inspect the inside of the tank. If any build up remains, let the machine cool fully and then run another cycle with a fresh solution of vinegar and water. If your machine has a self-cleaning feature, turn the machine on again after the first cycle of vinegar and water. If the Clean light continues to flash, you should repeat the cycle with a fresh mixture of vinegar and water."
                },
                {
                    "headline": "Run a cycle of fresh cold water to rinse.",
                    "description": "After the brew cycle has completed, discard the vinegar-water solution from the pot. Then allow the coffee maker and the carafe to cool slightly, especially if you have a glass pot. Then fill the water tank with plain fresh water (without vinegar). Run another brew cycle with just the water. To ensure all the vinegar has rinsed out, you may want to repeat the water-only cycle two or three times."
                }
            ]
        },
        {
            "name": "Washing the Rest of the Machine",
            "steps": [
                {
                    "headline": "Turn the coffee maker off and unplug it from the wall.",
                    "description": "If you used the machine recently, allow it to cool fully before removing pieces or beginning to wash it. Most machines will take at least 30 minutes to completely cool once they are turned off and unplugged, but some can take longer. Test yours by lightly touching the back of your hand to the body of the water reservoir after 30 minutes. Since the base of the coffee maker includes electrical heating equipment, it can be dangerous to get the machine wet while it's plugged in. If you try to clean the machine while it's plugged in, you could damage your coffee maker or receive a nasty shock."
                },
                {
                    "headline": "Remove the filter basket and carafe.",
                    "description": "On most Cuisinart models, the filter basket will either lift or slide out from the machine. Discard any remaining coffee from the carafe and dump out any grounds or filters from the basket. If you have a model with a built-in coffee grinder, take that basket out as well. Some models may also have a removable reservoir lid that you can take off."
                },
                {
                    "headline": "Wash the removable items in warm, soapy water and let them dry fully.",
                    "description": "Use a sponge, soap, and warm water to wash the filter basket, carafe, and other items in your sink, just as you would wash regular dishes. Avoid using any harsh cleansers or scouring agents, such as steel wool. Rinse the pieces thoroughly and dry them before placing them back into the machine. If you have serious build-up on any of the removable pieces, fill your sink with warm, soapy dishwater and soak the items for a few minutes before washing. Alternatively, you can wash these items in the top rack of the dishwasher.”\nOnce they're clean, it's best to allow the removable pieces to air-dry, since the unusual shapes can make them difficult to fully dry with a towel."
                },
                {
                    "headline": "Wipe down the body of the coffeemaker.",
                    "description": "While the removable pieces dry, use a damp dishcloth to clean the rest of the coffee maker, including the area under where the filter basket sits. If you have a Cuisinart with a built-in grinder, be careful to avoid splashing water onto the grinder motor as you clean it. Use only a damp dishcloth. Never immerse the base unit (which contains electrical equipment) in water or any other liquid."
                },
                {
                    "headline": "Remove stains from the heating plate using soap and a damp cloth.",
                    "description": "Wipe the area where the carafe sits using a damp cloth and a small amount of dishwashing soap. Once you've removed any stubborn coffee stains, rinse the dishcloth and wipe the plate again with plain water to rinse off the soap. Again, ensure the coffee maker is fully unplugged and cooled before touching the heating plate."
                },
                {
                    "headline": "Reassemble the coffee maker.",
                    "description": "Once all the elements of the machine have been cleaned and allowed time to fully dry, you can put the pieces back together. Replace the filter basket by reinserting or sliding it back in and place the carafe back onto the heating plate. If you have a model with a built-in grinder, replace the cleaned basket into the machine. If you removed the reservoir or carafe lids, don't forget to put those back as well."
                }
            ]
        }
    ],
    "tyn": [
        "Cleaning the Water Reservoir",
        "White vinegar",
        "Water",
        "Washing the Rest of the Machine",
        "Sponge and/or dishcloth",
        "Dish soap"
    ],
    "text": " Cleaning the Water Reservoir Decalcify your coffee maker every 1-6 months. If you use your coffee maker more than once a day, you may need to clean your  water reservoir once a month to decalcify (remove hard water and mineral build ups from) the machine. If you use it less frequently, however, you can wait up to 6 months between cleanings. Either way, the hardness of your tap water will influence how often you need to clean your machine. If your coffee begins to taste bitter or otherwise off, it may be time to decalcify the reservoir. If you have a Clean button on your Cuisinart, it will begin flashing when the machine needs to be decalcified. Empty the carafe and grounds. If you have any coffee remaining in the carafe, discard it and rinse the carafe with water. Remove the basket from the machine and dump out any coffee grounds or paper filters. Fill the water reservoir with 1 part white vinegar and 2 parts water. Mix enough white vinegar and regular tap water to fill the reservoir to its full capacity. You can use the carafe to measure and pour the solution. The exact amount of vinegar and water you use will depend on the size of your coffee maker. For a standard 12-cup coffee maker, you will need 4 cups of vinegar and 8 cups of water to fully fill the reservoir. Press the Clean button if your coffeemaker has one. Once the Clean light glows, press the On/Off button to begin the cycle. The Clean light should shine steadily to indicate that the machine is in CLEAN mode. Once the cycle is finished, the machine should beep 5 times and turn off. The CLEAN cycle will take 2-3 times longer than your normal brew, as the machine will pause between every few cups it makes. Run a brew cycle manually if your coffeemaker doesn't have a self-clean function. Once you've filled the reservoir, simply turn the machine on to run a cycle, just as if you were making a regular pot of coffee. For a deeper clean, turn off the coffee maker off mid-way through the brew cycle and let it sit for an hour. Then turn the coffee maker on again and let the brew cycle finish. Repeat the cycle if you can still see build-up inside the reservoir. One cycle of the vinegar-water mixture should be sufficient to clean the machine. However, if you have a particularly dirty coffee maker, you may need to run it again. Once the vinegar-water mixture has finished running and the machine has cooled, inspect the inside of the tank. If any build up remains, let the machine cool fully and then run another cycle with a fresh solution of vinegar and water. If your machine has a self-cleaning feature, turn the machine on again after the first cycle of vinegar and water. If the Clean light continues to flash, you should repeat the cycle with a fresh mixture of vinegar and water. Run a cycle of fresh cold water to rinse. After the brew cycle has completed, discard the vinegar-water solution from the pot. Then allow the coffee maker and the carafe to cool slightly, especially if you have a glass pot. Then fill the water tank with plain fresh water (without vinegar). Run another brew cycle with just the water. To ensure all the vinegar has rinsed out, you may want to repeat the water-only cycle two or three times. Washing the Rest of the Machine Turn the coffee maker off and unplug it from the wall. If you used the machine recently, allow it to cool fully before removing pieces or beginning to wash it. Most machines will take at least 30 minutes to completely cool once they are turned off and unplugged, but some can take longer. Test yours by lightly touching the back of your hand to the body of the water reservoir after 30 minutes. Since the base of the coffee maker includes electrical heating equipment, it can be dangerous to get the machine wet while it's plugged in. If you try to clean the machine while it's plugged in, you could damage your coffee maker or receive a nasty shock. Remove the filter basket and carafe. On most Cuisinart models, the filter basket will either lift or slide out from the machine. Discard any remaining coffee from the carafe and dump out any grounds or filters from the basket. If you have a model with a built-in coffee grinder, take that basket out as well. Some models may also have a removable reservoir lid that you can take off. Wash the removable items in warm, soapy water and let them dry fully. Use a sponge, soap, and warm water to wash the filter basket, carafe, and other items in your sink, just as you would wash regular dishes. Avoid using any harsh cleansers or scouring agents, such as steel wool. Rinse the pieces thoroughly and dry them before placing them back into the machine. If you have serious build-up on any of the removable pieces, fill your sink with warm, soapy dishwater and soak the items for a few minutes before washing. Alternatively, you can wash these items in the top rack of the dishwasher.”\nOnce they're clean, it's best to allow the removable pieces to air-dry, since the unusual shapes can make them difficult to fully dry with a towel. Wipe down the body of the coffeemaker. While the removable pieces dry, use a damp dishcloth to clean the rest of the coffee maker, including the area under where the filter basket sits. If you have a Cuisinart with a built-in grinder, be careful to avoid splashing water onto the grinder motor as you clean it. Use only a damp dishcloth. Never immerse the base unit (which contains electrical equipment) in water or any other liquid. Remove stains from the heating plate using soap and a damp cloth. Wipe the area where the carafe sits using a damp cloth and a small amount of dishwashing soap. Once you've removed any stubborn coffee stains, rinse the dishcloth and wipe the plate again with plain water to rinse off the soap. Again, ensure the coffee maker is fully unplugged and cooled before touching the heating plate. Reassemble the coffee maker. Once all the elements of the machine have been cleaned and allowed time to fully dry, you can put the pieces back together. Replace the filter basket by reinserting or sliding it back in and place the carafe back onto the heating plate. If you have a model with a built-in grinder, replace the cleaned basket into the machine. If you removed the reservoir or carafe lids, don't forget to put those back as well.",
    "sentences": [
        " Cleaning the Water Reservoir Decalcify your coffee maker every 1-6 months.",
        "If you use your coffee maker more than once a day, you may need to clean your  water reservoir once a month to decalcify (remove hard water and mineral build ups from) the machine.",
        "If you use it less frequently, however, you can wait up to 6 months between cleanings.",
        "Either way, the hardness of your tap water will influence how often you need to clean your machine.",
        "If your coffee begins to taste bitter or otherwise off, it may be time to decalcify the reservoir.",
        "If you have a Clean button on your Cuisinart, it will begin flashing when the machine needs to be decalcified.",
        "Empty the carafe and grounds.",
        "If you have any coffee remaining in the carafe, discard it and rinse the carafe with water.",
        "Remove the basket from the machine and dump out any coffee grounds or paper filters.",
        "Fill the water reservoir with 1 part white vinegar and 2 parts water.",
        "Mix enough white vinegar and regular tap water to fill the reservoir to its full capacity.",
        "You can use the carafe to measure and pour the solution.",
        "The exact amount of vinegar and water you use will depend on the size of your coffee maker.",
        "For a standard 12-cup coffee maker, you will need 4 cups of vinegar and 8 cups of water to fully fill the reservoir.",
        "Press the Clean button if your coffeemaker has one.",
        "Once the Clean light glows, press the On/Off button to begin the cycle.",
        "The Clean light should shine steadily to indicate that the machine is in CLEAN mode.",
        "Once the cycle is finished, the machine should beep 5 times and turn off.",
        "The CLEAN cycle will take 2-3 times longer than your normal brew, as the machine will pause between every few cups it makes.",
        "Run a brew cycle manually if your coffeemaker doesn't have a self-clean function.",
        "Once you've filled the reservoir, simply turn the machine on to run a cycle, just as if you were making a regular pot of coffee.",
        "For a deeper clean, turn off the coffee maker off mid-way through the brew cycle and let it sit for an hour.",
        "Then turn the coffee maker on again and let the brew cycle finish.",
        "Repeat the cycle if you can still see build-up inside the reservoir.",
        "One cycle of the vinegar-water mixture should be sufficient to clean the machine.",
        "However, if you have a particularly dirty coffee maker, you may need to run it again.",
        "Once the vinegar-water mixture has finished running and the machine has cooled, inspect the inside of the tank.",
        "If any build up remains, let the machine cool fully and then run another cycle with a fresh solution of vinegar and water.",
        "If your machine has a self-cleaning feature, turn the machine on again after the first cycle of vinegar and water.",
        "If the Clean light continues to flash, you should repeat the cycle with a fresh mixture of vinegar and water.",
        "Run a cycle of fresh cold water to rinse.",
        "After the brew cycle has completed, discard the vinegar-water solution from the pot.",
        "Then allow the coffee maker and the carafe to cool slightly, especially if you have a glass pot.",
        "Then fill the water tank with plain fresh water (without vinegar).",
        "Run another brew cycle with just the water.",
        "To ensure all the vinegar has rinsed out, you may want to repeat the water-only cycle two or three times.",
        "Washing the Rest of the Machine Turn the coffee maker off and unplug it from the wall.",
        "If you used the machine recently, allow it to cool fully before removing pieces or beginning to wash it.",
        "Most machines will take at least 30 minutes to completely cool once they are turned off and unplugged, but some can take longer.",
        "Test yours by lightly touching the back of your hand to the body of the water reservoir after 30 minutes.",
        "Since the base of the coffee maker includes electrical heating equipment, it can be dangerous to get the machine wet while it's plugged in.",
        "If you try to clean the machine while it's plugged in, you could damage your coffee maker or receive a nasty shock.",
        "Remove the filter basket and carafe.",
        "On most Cuisinart models, the filter basket will either lift or slide out from the machine.",
        "Discard any remaining coffee from the carafe and dump out any grounds or filters from the basket.",
        "If you have a model with a built-in coffee grinder, take that basket out as well.",
        "Some models may also have a removable reservoir lid that you can take off.",
        "Wash the removable items in warm, soapy water and let them dry fully.",
        "Use a sponge, soap, and warm water to wash the filter basket, carafe, and other items in your sink, just as you would wash regular dishes.",
        "Avoid using any harsh cleansers or scouring agents, such as steel wool.",
        "Rinse the pieces thoroughly and dry them before placing them back into the machine.",
        "If you have serious build-up on any of the removable pieces, fill your sink with warm, soapy dishwater and soak the items for a few minutes before washing.",
        "Alternatively, you can wash these items in the top rack of the dishwasher.”\nOnce they're clean, it's best to allow the removable pieces to air-dry, since the unusual shapes can make them difficult to fully dry with a towel.",
        "Wipe down the body of the coffeemaker.",
        "While the removable pieces dry, use a damp dishcloth to clean the rest of the coffee maker, including the area under where the filter basket sits.",
        "If you have a Cuisinart with a built-in grinder, be careful to avoid splashing water onto the grinder motor as you clean it.",
        "Use only a damp dishcloth.",
        "Never immerse the base unit (which contains electrical equipment) in water or any other liquid.",
        "Remove stains from the heating plate using soap and a damp cloth.",
        "Wipe the area where the carafe sits using a damp cloth and a small amount of dishwashing soap.",
        "Once you've removed any stubborn coffee stains, rinse the dishcloth and wipe the plate again with plain water to rinse off the soap.",
        "Again, ensure the coffee maker is fully unplugged and cooled before touching the heating plate.",
        "Reassemble the coffee maker.",
        "Once all the elements of the machine have been cleaned and allowed time to fully dry, you can put the pieces back together.",
        "Replace the filter basket by reinserting or sliding it back in and place the carafe back onto the heating plate.",
        "If you have a model with a built-in grinder, replace the cleaned basket into the machine.",
        "If you removed the reservoir or carafe lids, don't forget to put those back as well."
    ]
}