{
    "title": "How to Paint Baseboards with Carpet",
    "url": "https://www.wikihow.com/Paint-Baseboards-with-Carpet",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "methods": [
        {
            "name": "Setting up Your Room",
            "steps": [
                {
                    "headline": "Set a drop cloth down along the wall where you’re painting.",
                    "description": "Before you clean, tape, or paint, lay down a drop cloth along the section of your wall that you’re going to paint. This will prevent any paint or wood dust from ruining your carpet. Spread your drop cloth out and pull on the edges until it is smoothly resting over a section of your room. You can use a plastic sheet instead of a drop cloth if you don’t have one. If you’re working in a larger room, move your drop cloth around the room as you work."
                },
                {
                    "headline": "Mask off the bottom of your wall with painter’s tape.",
                    "description": "Use painter’s tape to protect the bottom section of your wall near the top of your baseboard. Line the end of your tape up with the corner of your room where the baseboard starts. Press 2–3 inches (5.1–7.6 cm) of tape against the end of the wall so that it’s flush with your baseboard. Pull your tape out 2–3 feet (0.61–0.91 m) and pull it so that it sits flush along the baseboard. Press the end you pulled out into the baseboard and run your hand along the tape to flatten it to the wall.Warning: Painter’s tape isn’t always perfect and paint can bleed through it on occasion. Use it as a guide, not a perfect safety measure, and try to avoid hitting it with your brush when you paint. Repeat this process until every wall in your room is taped off."
                },
                {
                    "headline": "Clean your baseboards and sand them down if necessary.",
                    "description": "Use a damp cloth to wipe your baseboards. Scrub dirty areas until any dirt and dust is removed. Let it air dry for 1-2 hours. Then, use 100-180 grit sandpaper to sand the wood and make painting easier. Take a small sheet of sandpaper and rub it lightly along a section of baseboard by using back-and-forth strokes until you see the previous layer of paint smoothing into the wood. Wipe your boards with a dry cloth after sanding. If your baseboards are brand new or haven’t been painted multiple times in the past, you don’t need to sand them down. Be careful when sanding the upper and lower sections of your baseboard near the wall and carpet. You don’t want to scuff the walls while you work. Let your baseboards air dry for at least an hour before you paint them. You don’t want to capture any moisture in the wood. Wear a dust mask when sanding your baseboards to prevent the inhalation of wood dust."
                }
            ]
        },
        {
            "name": "Protecting Your Carpet",
            "steps": [
                {
                    "headline": "Lay down a layer of masking tape along your baseboard.",
                    "description": "Get a roll of masking tape with a width of 2–4 inches (5.1–10.2 cm). Pull out a section 2–3 feet (0.61–0.91 m) long and place it with the sticky side down on your carpet and the top ⁄2 inch (1.3 cm) hanging on the bottom of your baseboard. Repeat this process as you cover all of the carpet along your baseboard.Tip: You can use packing tape instead of masking tape if you’d like. Duct tape will rip up your carpet, so avoid it. You could use painter’s tape, but it’s more likely to get crumpled up since it won’t stick to your carpet very well. Line up each strip so that it’s running along the carpet on the same line. Don’t press the tape into the carpet as you put it down. You’re going to slide the top section of the tape under the board, and this will be hard to do if your tape is caught in the nap of your carpet."
                },
                {
                    "headline": "Tuck the tape under the baseboard or quarter-round with a putty knife.",
                    "description": "Stick your knife at a 15-degree angle to the floor and place it in between the board and the carpet. Press gently into the wall to pull the tape that was resting on the bottom of the baseboard underneath it. Run your putty knife in between the carpet and the wall for every section of the room. Press your tape down lightly when you’re done. Quarter-round refers to the optional round portion that gets added to the bottom of some baseboards. It is literally a quarter section of a round piece of wood. The ⁄2 inch (1.3 cm) of tape that was sitting on the bottom of your baseboard should now be tucked under the board. This will prevent drips from sneaking under the tape and damaging your carpet."
                },
                {
                    "headline": "Use a paint guard if you want extra protection.",
                    "description": "You can use a paint guard or metal sheet to provide additional protection if you’d like. A paint guard or metal sheet will keep any dripping paint from falling on to your carpet by catching it before it falls from the baseboard. To use a paint guard, put the long edge on top of the packing tape. Press it down into your carpet and slide it under your baseboard to set it under the wood. You can use a metal sheet or any firm straight edge instead of a paint guard if you’d like. One alternative is to use a slat from a window blind with the round side facing up. Some painters prefer to not use a paint guard since it can cause the paint at the bottom of the baseboard to dry awkwardly. Other painters prefer paint guards since they provide extra protection. If you use a paint guard, you have to clean it with a rag after painting each section."
                }
            ]
        },
        {
            "name": "Painting the Baseboards",
            "steps": [
                {
                    "headline": "Mix your paint with a mixing stick and pour it into your paint tray.",
                    "description": "While standing on your drop cloth, use a flathead screwdriver to carefully pry your can open. Use a mixing stick to mix your paint until the color is even. Pour ⁄4–⁄2 gallon (0.95–1.89 L) into your paint tray and use your brush to wipe away any drips running along the side of your can.Tip: Most people use semi-gloss paint to paint their baseboards. You can use oil-based or latex paint depending on the sheen that want. Oil-based paint will last for a longer period of time, but it will reflect light more brightly. If you use oil-based paint, you have to wear a dust mask while you paint. Open the windows in the room that you’re painting to prevent the paint fumes from overwhelming you."
                },
                {
                    "headline": "Dip an angle brush in the paint and tap it in the tray.",
                    "description": "A 2–3 in (5.1–7.6 cm) angle brush will make it easier to paint your baseboards. You can use a natural or nylon brush. Dip the tip of your brush into the paint so that the tip of your brush is covered in paint. Tap the brush into the dry section of your paint tray to remove excess paint. You can use a flat brush if you prefer, but an angle brush will make it easier to reach the very bottom of your baseboard, since you can get a flat cut by holding it at 45 degrees."
                },
                {
                    "headline": "Start with the middle of the baseboard before painting the top.",
                    "description": "Start painting the middle portion of your baseboards first, using back-and-forth strokes to cover each section of baseboard 2-3 times. Once the majority of the paint on your brush has been applied, paint the portion directly above it near the tape. Hold your brush at a 45-degree angle and only brush the top in the direction of the brush’s angle to monitor the accuracy of your cut. Work slowly when painting along the edge, and work in 1 foot (30 cm) increments."
                },
                {
                    "headline": "Paint the bottom of your baseboard carefully.",
                    "description": "Once you’ve painted the top and middle of your board, dip your brush into the paint tray and tap it repeatedly to remove most of the paint. Then, tilt your brush so that it’s at a 45-degree angle with the long end facing the carpet. Press your brush into the board and move very slowly and carefully along the bottom of the baseboard. If you’re using a paint guard, hold it in place with your nondominant hand. Only brush along the section where you’re holding the paint guard. To remove and replace a paint guard, press it down into the carpet and slowly slide it out. Move it to a different section of your baseboard and press it down again before sliding it between the baseboard and carpet. Wipe your paint guard with a clean rag after painting each section."
                },
                {
                    "headline": "Work your way around the room in 1 foot (30 cm) increments.",
                    "description": "If you’re using a paint guard, bring it with you as you paint around the room. Move your drop cloth with you as you work so that it’s always underneath the section that you’re painting. Always work from the middle to the top before painting the bottom. Avoid drips by covering each section in the middle 2-3 times before moving on."
                },
                {
                    "headline": "Remove the tape carefully after your paint has dried.",
                    "description": "Once you’ve let your baseboards dry for 2-3 hours, remove the drop cloth and other painting materials. Pull the long side of the masking tape up a little and slide it out from under your baseboard. Slowly pull it out in sections to avoid rubbing any dry paint on your carpet."
                }
            ]
        }
    ],
    "tyn": [
        "Drop cloth",
        "Dust mask",
        "Painter’s tape",
        "Putty knife",
        "Sandpaper (optional)",
        "Masking tape or packing tape",
        "Natural or nylon angled brush",
        "Paint guard (optional)",
        "Paint",
        "Mixing stick",
        "Rag"
    ],
    "text": " Setting up Your Room Set a drop cloth down along the wall where you’re painting. Before you clean, tape, or paint, lay down a drop cloth along the section of your wall that you’re going to paint. This will prevent any paint or wood dust from ruining your carpet. Spread your drop cloth out and pull on the edges until it is smoothly resting over a section of your room. You can use a plastic sheet instead of a drop cloth if you don’t have one. If you’re working in a larger room, move your drop cloth around the room as you work. Mask off the bottom of your wall with painter’s tape. Use painter’s tape to protect the bottom section of your wall near the top of your baseboard. Line the end of your tape up with the corner of your room where the baseboard starts. Press 2–3 inches (5.1–7.6 cm) of tape against the end of the wall so that it’s flush with your baseboard. Pull your tape out 2–3 feet (0.61–0.91 m) and pull it so that it sits flush along the baseboard. Press the end you pulled out into the baseboard and run your hand along the tape to flatten it to the wall.Warning: Painter’s tape isn’t always perfect and paint can bleed through it on occasion. Use it as a guide, not a perfect safety measure, and try to avoid hitting it with your brush when you paint. Repeat this process until every wall in your room is taped off. Clean your baseboards and sand them down if necessary. Use a damp cloth to wipe your baseboards. Scrub dirty areas until any dirt and dust is removed. Let it air dry for 1-2 hours. Then, use 100-180 grit sandpaper to sand the wood and make painting easier. Take a small sheet of sandpaper and rub it lightly along a section of baseboard by using back-and-forth strokes until you see the previous layer of paint smoothing into the wood. Wipe your boards with a dry cloth after sanding. If your baseboards are brand new or haven’t been painted multiple times in the past, you don’t need to sand them down. Be careful when sanding the upper and lower sections of your baseboard near the wall and carpet. You don’t want to scuff the walls while you work. Let your baseboards air dry for at least an hour before you paint them. You don’t want to capture any moisture in the wood. Wear a dust mask when sanding your baseboards to prevent the inhalation of wood dust. Protecting Your Carpet Lay down a layer of masking tape along your baseboard. Get a roll of masking tape with a width of 2–4 inches (5.1–10.2 cm). Pull out a section 2–3 feet (0.61–0.91 m) long and place it with the sticky side down on your carpet and the top ⁄2 inch (1.3 cm) hanging on the bottom of your baseboard. Repeat this process as you cover all of the carpet along your baseboard.Tip: You can use packing tape instead of masking tape if you’d like. Duct tape will rip up your carpet, so avoid it. You could use painter’s tape, but it’s more likely to get crumpled up since it won’t stick to your carpet very well. Line up each strip so that it’s running along the carpet on the same line. Don’t press the tape into the carpet as you put it down. You’re going to slide the top section of the tape under the board, and this will be hard to do if your tape is caught in the nap of your carpet. Tuck the tape under the baseboard or quarter-round with a putty knife. Stick your knife at a 15-degree angle to the floor and place it in between the board and the carpet. Press gently into the wall to pull the tape that was resting on the bottom of the baseboard underneath it. Run your putty knife in between the carpet and the wall for every section of the room. Press your tape down lightly when you’re done. Quarter-round refers to the optional round portion that gets added to the bottom of some baseboards. It is literally a quarter section of a round piece of wood. The ⁄2 inch (1.3 cm) of tape that was sitting on the bottom of your baseboard should now be tucked under the board. This will prevent drips from sneaking under the tape and damaging your carpet. Use a paint guard if you want extra protection. You can use a paint guard or metal sheet to provide additional protection if you’d like. A paint guard or metal sheet will keep any dripping paint from falling on to your carpet by catching it before it falls from the baseboard. To use a paint guard, put the long edge on top of the packing tape. Press it down into your carpet and slide it under your baseboard to set it under the wood. You can use a metal sheet or any firm straight edge instead of a paint guard if you’d like. One alternative is to use a slat from a window blind with the round side facing up. Some painters prefer to not use a paint guard since it can cause the paint at the bottom of the baseboard to dry awkwardly. Other painters prefer paint guards since they provide extra protection. If you use a paint guard, you have to clean it with a rag after painting each section. Painting the Baseboards Mix your paint with a mixing stick and pour it into your paint tray. While standing on your drop cloth, use a flathead screwdriver to carefully pry your can open. Use a mixing stick to mix your paint until the color is even. Pour ⁄4–⁄2 gallon (0.95–1.89 L) into your paint tray and use your brush to wipe away any drips running along the side of your can.Tip: Most people use semi-gloss paint to paint their baseboards. You can use oil-based or latex paint depending on the sheen that want. Oil-based paint will last for a longer period of time, but it will reflect light more brightly. If you use oil-based paint, you have to wear a dust mask while you paint. Open the windows in the room that you’re painting to prevent the paint fumes from overwhelming you. Dip an angle brush in the paint and tap it in the tray. A 2–3 in (5.1–7.6 cm) angle brush will make it easier to paint your baseboards. You can use a natural or nylon brush. Dip the tip of your brush into the paint so that the tip of your brush is covered in paint. Tap the brush into the dry section of your paint tray to remove excess paint. You can use a flat brush if you prefer, but an angle brush will make it easier to reach the very bottom of your baseboard, since you can get a flat cut by holding it at 45 degrees. Start with the middle of the baseboard before painting the top. Start painting the middle portion of your baseboards first, using back-and-forth strokes to cover each section of baseboard 2-3 times. Once the majority of the paint on your brush has been applied, paint the portion directly above it near the tape. Hold your brush at a 45-degree angle and only brush the top in the direction of the brush’s angle to monitor the accuracy of your cut. Work slowly when painting along the edge, and work in 1 foot (30 cm) increments. Paint the bottom of your baseboard carefully. Once you’ve painted the top and middle of your board, dip your brush into the paint tray and tap it repeatedly to remove most of the paint. Then, tilt your brush so that it’s at a 45-degree angle with the long end facing the carpet. Press your brush into the board and move very slowly and carefully along the bottom of the baseboard. If you’re using a paint guard, hold it in place with your nondominant hand. Only brush along the section where you’re holding the paint guard. To remove and replace a paint guard, press it down into the carpet and slowly slide it out. Move it to a different section of your baseboard and press it down again before sliding it between the baseboard and carpet. Wipe your paint guard with a clean rag after painting each section. Work your way around the room in 1 foot (30 cm) increments. If you’re using a paint guard, bring it with you as you paint around the room. Move your drop cloth with you as you work so that it’s always underneath the section that you’re painting. Always work from the middle to the top before painting the bottom. Avoid drips by covering each section in the middle 2-3 times before moving on. Remove the tape carefully after your paint has dried. Once you’ve let your baseboards dry for 2-3 hours, remove the drop cloth and other painting materials. Pull the long side of the masking tape up a little and slide it out from under your baseboard. Slowly pull it out in sections to avoid rubbing any dry paint on your carpet.",
    "sentences": [
        " Setting up Your Room Set a drop cloth down along the wall where you’re painting.",
        "Before you clean, tape, or paint, lay down a drop cloth along the section of your wall that you’re going to paint.",
        "This will prevent any paint or wood dust from ruining your carpet.",
        "Spread your drop cloth out and pull on the edges until it is smoothly resting over a section of your room.",
        "You can use a plastic sheet instead of a drop cloth if you don’t have one.",
        "If you’re working in a larger room, move your drop cloth around the room as you work.",
        "Mask off the bottom of your wall with painter’s tape.",
        "Use painter’s tape to protect the bottom section of your wall near the top of your baseboard.",
        "Line the end of your tape up with the corner of your room where the baseboard starts.",
        "Press 2–3 inches (5.1–7.6 cm) of tape against the end of the wall so that it’s flush with your baseboard.",
        "Pull your tape out 2–3 feet (0.61–0.91 m) and pull it so that it sits flush along the baseboard.",
        "Press the end you pulled out into the baseboard and run your hand along the tape to flatten it to the wall.Warning: Painter’s tape isn’t always perfect and paint can bleed through it on occasion.",
        "Use it as a guide, not a perfect safety measure, and try to avoid hitting it with your brush when you paint.",
        "Repeat this process until every wall in your room is taped off.",
        "Clean your baseboards and sand them down if necessary.",
        "Use a damp cloth to wipe your baseboards.",
        "Scrub dirty areas until any dirt and dust is removed.",
        "Let it air dry for 1-2 hours.",
        "Then, use 100-180 grit sandpaper to sand the wood and make painting easier.",
        "Take a small sheet of sandpaper and rub it lightly along a section of baseboard by using back-and-forth strokes until you see the previous layer of paint smoothing into the wood.",
        "Wipe your boards with a dry cloth after sanding.",
        "If your baseboards are brand new or haven’t been painted multiple times in the past, you don’t need to sand them down.",
        "Be careful when sanding the upper and lower sections of your baseboard near the wall and carpet.",
        "You don’t want to scuff the walls while you work.",
        "Let your baseboards air dry for at least an hour before you paint them.",
        "You don’t want to capture any moisture in the wood.",
        "Wear a dust mask when sanding your baseboards to prevent the inhalation of wood dust.",
        "Protecting Your Carpet Lay down a layer of masking tape along your baseboard.",
        "Get a roll of masking tape with a width of 2–4 inches (5.1–10.2 cm).",
        "Pull out a section 2–3 feet (0.61–0.91 m) long and place it with the sticky side down on your carpet and the top ⁄2 inch (1.3 cm) hanging on the bottom of your baseboard.",
        "Repeat this process as you cover all of the carpet along your baseboard.Tip: You can use packing tape instead of masking tape if you’d like.",
        "Duct tape will rip up your carpet, so avoid it.",
        "You could use painter’s tape, but it’s more likely to get crumpled up since it won’t stick to your carpet very well.",
        "Line up each strip so that it’s running along the carpet on the same line.",
        "Don’t press the tape into the carpet as you put it down.",
        "You’re going to slide the top section of the tape under the board, and this will be hard to do if your tape is caught in the nap of your carpet.",
        "Tuck the tape under the baseboard or quarter-round with a putty knife.",
        "Stick your knife at a 15-degree angle to the floor and place it in between the board and the carpet.",
        "Press gently into the wall to pull the tape that was resting on the bottom of the baseboard underneath it.",
        "Run your putty knife in between the carpet and the wall for every section of the room.",
        "Press your tape down lightly when you’re done.",
        "Quarter-round refers to the optional round portion that gets added to the bottom of some baseboards.",
        "It is literally a quarter section of a round piece of wood.",
        "The ⁄2 inch (1.3 cm) of tape that was sitting on the bottom of your baseboard should now be tucked under the board.",
        "This will prevent drips from sneaking under the tape and damaging your carpet.",
        "Use a paint guard if you want extra protection.",
        "You can use a paint guard or metal sheet to provide additional protection if you’d like.",
        "A paint guard or metal sheet will keep any dripping paint from falling on to your carpet by catching it before it falls from the baseboard.",
        "To use a paint guard, put the long edge on top of the packing tape.",
        "Press it down into your carpet and slide it under your baseboard to set it under the wood.",
        "You can use a metal sheet or any firm straight edge instead of a paint guard if you’d like.",
        "One alternative is to use a slat from a window blind with the round side facing up.",
        "Some painters prefer to not use a paint guard since it can cause the paint at the bottom of the baseboard to dry awkwardly.",
        "Other painters prefer paint guards since they provide extra protection.",
        "If you use a paint guard, you have to clean it with a rag after painting each section.",
        "Painting the Baseboards Mix your paint with a mixing stick and pour it into your paint tray.",
        "While standing on your drop cloth, use a flathead screwdriver to carefully pry your can open.",
        "Use a mixing stick to mix your paint until the color is even.",
        "Pour ⁄4–⁄2 gallon (0.95–1.89 L) into your paint tray and use your brush to wipe away any drips running along the side of your can.Tip: Most people use semi-gloss paint to paint their baseboards.",
        "You can use oil-based or latex paint depending on the sheen that want.",
        "Oil-based paint will last for a longer period of time, but it will reflect light more brightly.",
        "If you use oil-based paint, you have to wear a dust mask while you paint.",
        "Open the windows in the room that you’re painting to prevent the paint fumes from overwhelming you.",
        "Dip an angle brush in the paint and tap it in the tray.",
        "A 2–3 in (5.1–7.6 cm) angle brush will make it easier to paint your baseboards.",
        "You can use a natural or nylon brush.",
        "Dip the tip of your brush into the paint so that the tip of your brush is covered in paint.",
        "Tap the brush into the dry section of your paint tray to remove excess paint.",
        "You can use a flat brush if you prefer, but an angle brush will make it easier to reach the very bottom of your baseboard, since you can get a flat cut by holding it at 45 degrees.",
        "Start with the middle of the baseboard before painting the top.",
        "Start painting the middle portion of your baseboards first, using back-and-forth strokes to cover each section of baseboard 2-3 times.",
        "Once the majority of the paint on your brush has been applied, paint the portion directly above it near the tape.",
        "Hold your brush at a 45-degree angle and only brush the top in the direction of the brush’s angle to monitor the accuracy of your cut.",
        "Work slowly when painting along the edge, and work in 1 foot (30 cm) increments.",
        "Paint the bottom of your baseboard carefully.",
        "Once you’ve painted the top and middle of your board, dip your brush into the paint tray and tap it repeatedly to remove most of the paint.",
        "Then, tilt your brush so that it’s at a 45-degree angle with the long end facing the carpet.",
        "Press your brush into the board and move very slowly and carefully along the bottom of the baseboard.",
        "If you’re using a paint guard, hold it in place with your nondominant hand.",
        "Only brush along the section where you’re holding the paint guard.",
        "To remove and replace a paint guard, press it down into the carpet and slowly slide it out.",
        "Move it to a different section of your baseboard and press it down again before sliding it between the baseboard and carpet.",
        "Wipe your paint guard with a clean rag after painting each section.",
        "Work your way around the room in 1 foot (30 cm) increments.",
        "If you’re using a paint guard, bring it with you as you paint around the room.",
        "Move your drop cloth with you as you work so that it’s always underneath the section that you’re painting.",
        "Always work from the middle to the top before painting the bottom.",
        "Avoid drips by covering each section in the middle 2-3 times before moving on.",
        "Remove the tape carefully after your paint has dried.",
        "Once you’ve let your baseboards dry for 2-3 hours, remove the drop cloth and other painting materials.",
        "Pull the long side of the masking tape up a little and slide it out from under your baseboard.",
        "Slowly pull it out in sections to avoid rubbing any dry paint on your carpet."
    ]
}