{
    "title": "How to Weave in Ends when Knitting",
    "url": "https://www.wikihow.com/Weave-in-Ends-when-Knitting",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Knitting and Crochet",
        "Knitting"
    ],
    "methods": [
        {
            "name": "Sewing in Ends Along an Edge",
            "steps": [
                {
                    "headline": "Leave a 5–6 in (13–15 cm) tail after you tie off the last stitch.",
                    "description": "Tie off your last stitch and cut the tail about 5–6 in (13–15 cm) from the knot using a sharp pair of scissors. This will ensure that you have enough yarn to sew the tail into the edge of your work. If the tail is too short, then you won’t be able to sew it into the edge and you’ll need to use a different option."
                },
                {
                    "headline": "Thread the end of the yarn through a tapestry needle.",
                    "description": "Insert the end of the tail into the eye of a tapestry or yarn needle. Then, pull about 2 in (5.1 cm) of the yarn through the needle and grip the needle with your thumb and index finger around the eye to keep the yarn from slipping out while you sew. Make sure to choose a needle with a big enough eye to thread your yarn through. You can purchase a yarn needle or tapestry needle in a craft supply store. Tip: Wet the end of the yarn with saliva or a few drops of water. This will help to stiffen the yarn and make it easier to thread through the eye of the needle."
                },
                {
                    "headline": "Insert the needle into the stitch next to the base of the yarn.",
                    "description": "With the right (front or outer) side of your work facing you, find the edge stitch next to the base of the yarn tail. Then, push the needle into this stitch so that it comes out on the other side of your work. Pull the needle all the way through the stitch until the yarn is through it completely. The yarn does not need to be taut. Leave a bit of slack to ensure that the edge of your work won’t look misshapen."
                },
                {
                    "headline": "Bring the needle around the edge and back down through another stitch.",
                    "description": "Instead of sewing through the wrong (back or inner) side of the work, bring the needle around the edge of your knitting project. Then, insert the needle down through the next stitch on the right side of your work. Pull the needle through until the yarn is all the way through the stitch. Make sure that you do not pull the yarn too tight."
                },
                {
                    "headline": "Repeat this until you cannot sew any more.",
                    "description": "Continue to sew through the stitches on the right side of the edge of your knitting project until you cannot go any further. Make sure to only sew through 1 side and out the other, then bring the needle back around to the right side. Do not sew back and forth through the right and wrong sides of the work or your stitches will be more visible."
                },
                {
                    "headline": "Cut the last 1–2 in (2.5–5.1 cm) of yarn.",
                    "description": "When you reach the point that you cannot sew any further, cut the yarn with a sharp pair of scissors. Cut the yarn as close to the edge of the knitting project as you can without cutting through a stitch. You don’t need to tie a knot since the woven in ends will prevent your work from unraveling, but you may tie a knot through the last stitch if desired and then cut the yarn."
                }
            ]
        },
        {
            "name": "Crocheting in Short Ends",
            "steps": [
                {
                    "headline": "Insert the crochet hook into the stitch nearest to the tail.",
                    "description": "Looking at your work from the right (front or outer) side, locate the stitch nearest to where the tail of your yarn is anchored. Then, push the tip of the crochet hook under this stitch on the right side and bring it back out on the right side as well. Make sure to go all the way under the stitch to the other side of the work, and then out the other side of the stitch so that the tip of the hook is poking through on the right side of the work. This technique works for any length of yarn tail on the edge of a knitting project. However, if you haven’t finished binding off yet, leave a 4 in (10 cm) tail after you do.Tip: You can use any size crochet hook that will fit easily through your stitches. If you’re not sure what size crochet hook to use, look at your yarn label for a recommendation."
                },
                {
                    "headline": "Catch the yarn with the crochet hook and pull it through the stitch.",
                    "description": "With the right side of your work still facing you, bring the tail of your yarn up and over the tip of the crochet hook to catch it. Then, pull the crochet hook back under the stitch to bring the tail of yarn all the way through the stitch. The tail should come back out on the right side of your knitting project."
                },
                {
                    "headline": "Repeat this until the yarn tail is hidden.",
                    "description": "Insert the crochet hook into the next stitch along the edge of the work and catch the tail of yarn again. Pull the yarn all the way through the stitch as you did before to bring it under and through the stitch. Keep doing this until you cannot pull the yarn through any more. You may be able to hide the entire tail using this technique, but if not, you can cut the tail as close to the knitting project as possible."
                }
            ]
        },
        {
            "name": "Weaving in Ends on a Garter Stitch Item",
            "steps": [
                {
                    "headline": "Leave a 5–6 in (13–15 cm) tail after you tie off the last stitch.",
                    "description": "This will provide plenty of slack to thread the yarn needle and sew through the stitches on your knitting project. Cut the yarn to this length with a sharp pair of scissors."
                },
                {
                    "headline": "Thread the end of the tail through a yarn needle.",
                    "description": "Bring the yarn through the eye of the needle until about 2 in (5.1 cm) of yarn are through it. Then, grip the eye of the needle with your thumb and forefinger to keep the yarn in place while you sew. Choose a yarn needle with a big enough eye to thread the yarn through. You can buy a special yarn or tapestry needle at a craft supply store."
                },
                {
                    "headline": "Sew through the surface of a stitch on 1 side of the work.",
                    "description": "Push the needle into a stitch on 1 side of the work, but don’t bring the needle all the way through to the other side of the knitting. Bring the needle back up and out on the same side of the work and only sew under 1 loop of the stitch on that side. This will help to make the ends less visible.Tip: Since garter stitch does not really have a right (front or outer) and wrong (back or inner) side, you can weave in the ends on any side you like. However, if you are sewing in the ends on a hat, sweater, or pair of mittens, turn the project inside out before you start weaving in the ends."
                },
                {
                    "headline": "Insert the needle through the next stitch and back up on the same side.",
                    "description": "Next, locate the stitch nearest the one you just sewed through, but in the row below it. Insert the needle into the surface of this stitch and back out on the same side without going all the way through the stitch. This will allow you to create a stitch that mimics the garter stitch and preserves the stretchiness of your knitting."
                },
                {
                    "headline": "Keep sewing on 1 side until you cannot sew any more.",
                    "description": "Repeat the same stitch going through the surface of a stitch on 1 side and coming back out on the other side of the stitch. Do not go all the way through the knitting. Only sew through the surface of your garter stitches on 1 side of your work. Try to follow the path of the stitches on 1 side of the work so that you are sewing in the same pattern as the garter stitches."
                },
                {
                    "headline": "Cut the remaining tail of yarn close to the knitting.",
                    "description": "When you cannot sew any further, let the tail of the yarn slip out of the yarn needle’s eye. Then, use a sharp pair of scissors to cut the yarn as close to the knitting project as you can without cutting through any of the stitches. Don’t worry about tying a knot. The yarn will be secure enough without one."
                }
            ]
        }
    ],
    "tyn": [
        "Sewing in Ends Along an Edge",
        "Yarn or tapestry needle",
        "Scissors",
        "Crocheting in Short Ends",
        "Crochet hook",
        "Weaving in Ends on a Garter Stitch Item"
    ],
    "text": " Sewing in Ends Along an Edge Leave a 5–6 in (13–15 cm) tail after you tie off the last stitch. Tie off your last stitch and cut the tail about 5–6 in (13–15 cm) from the knot using a sharp pair of scissors. This will ensure that you have enough yarn to sew the tail into the edge of your work. If the tail is too short, then you won’t be able to sew it into the edge and you’ll need to use a different option. Thread the end of the yarn through a tapestry needle. Insert the end of the tail into the eye of a tapestry or yarn needle. Then, pull about 2 in (5.1 cm) of the yarn through the needle and grip the needle with your thumb and index finger around the eye to keep the yarn from slipping out while you sew. Make sure to choose a needle with a big enough eye to thread your yarn through. You can purchase a yarn needle or tapestry needle in a craft supply store. Tip: Wet the end of the yarn with saliva or a few drops of water. This will help to stiffen the yarn and make it easier to thread through the eye of the needle. Insert the needle into the stitch next to the base of the yarn. With the right (front or outer) side of your work facing you, find the edge stitch next to the base of the yarn tail. Then, push the needle into this stitch so that it comes out on the other side of your work. Pull the needle all the way through the stitch until the yarn is through it completely. The yarn does not need to be taut. Leave a bit of slack to ensure that the edge of your work won’t look misshapen. Bring the needle around the edge and back down through another stitch. Instead of sewing through the wrong (back or inner) side of the work, bring the needle around the edge of your knitting project. Then, insert the needle down through the next stitch on the right side of your work. Pull the needle through until the yarn is all the way through the stitch. Make sure that you do not pull the yarn too tight. Repeat this until you cannot sew any more. Continue to sew through the stitches on the right side of the edge of your knitting project until you cannot go any further. Make sure to only sew through 1 side and out the other, then bring the needle back around to the right side. Do not sew back and forth through the right and wrong sides of the work or your stitches will be more visible. Cut the last 1–2 in (2.5–5.1 cm) of yarn. When you reach the point that you cannot sew any further, cut the yarn with a sharp pair of scissors. Cut the yarn as close to the edge of the knitting project as you can without cutting through a stitch. You don’t need to tie a knot since the woven in ends will prevent your work from unraveling, but you may tie a knot through the last stitch if desired and then cut the yarn. Crocheting in Short Ends Insert the crochet hook into the stitch nearest to the tail. Looking at your work from the right (front or outer) side, locate the stitch nearest to where the tail of your yarn is anchored. Then, push the tip of the crochet hook under this stitch on the right side and bring it back out on the right side as well. Make sure to go all the way under the stitch to the other side of the work, and then out the other side of the stitch so that the tip of the hook is poking through on the right side of the work. This technique works for any length of yarn tail on the edge of a knitting project. However, if you haven’t finished binding off yet, leave a 4 in (10 cm) tail after you do.Tip: You can use any size crochet hook that will fit easily through your stitches. If you’re not sure what size crochet hook to use, look at your yarn label for a recommendation. Catch the yarn with the crochet hook and pull it through the stitch. With the right side of your work still facing you, bring the tail of your yarn up and over the tip of the crochet hook to catch it. Then, pull the crochet hook back under the stitch to bring the tail of yarn all the way through the stitch. The tail should come back out on the right side of your knitting project. Repeat this until the yarn tail is hidden. Insert the crochet hook into the next stitch along the edge of the work and catch the tail of yarn again. Pull the yarn all the way through the stitch as you did before to bring it under and through the stitch. Keep doing this until you cannot pull the yarn through any more. You may be able to hide the entire tail using this technique, but if not, you can cut the tail as close to the knitting project as possible. Weaving in Ends on a Garter Stitch Item Leave a 5–6 in (13–15 cm) tail after you tie off the last stitch. This will provide plenty of slack to thread the yarn needle and sew through the stitches on your knitting project. Cut the yarn to this length with a sharp pair of scissors. Thread the end of the tail through a yarn needle. Bring the yarn through the eye of the needle until about 2 in (5.1 cm) of yarn are through it. Then, grip the eye of the needle with your thumb and forefinger to keep the yarn in place while you sew. Choose a yarn needle with a big enough eye to thread the yarn through. You can buy a special yarn or tapestry needle at a craft supply store. Sew through the surface of a stitch on 1 side of the work. Push the needle into a stitch on 1 side of the work, but don’t bring the needle all the way through to the other side of the knitting. Bring the needle back up and out on the same side of the work and only sew under 1 loop of the stitch on that side. This will help to make the ends less visible.Tip: Since garter stitch does not really have a right (front or outer) and wrong (back or inner) side, you can weave in the ends on any side you like. However, if you are sewing in the ends on a hat, sweater, or pair of mittens, turn the project inside out before you start weaving in the ends. Insert the needle through the next stitch and back up on the same side. Next, locate the stitch nearest the one you just sewed through, but in the row below it. Insert the needle into the surface of this stitch and back out on the same side without going all the way through the stitch. This will allow you to create a stitch that mimics the garter stitch and preserves the stretchiness of your knitting. Keep sewing on 1 side until you cannot sew any more. Repeat the same stitch going through the surface of a stitch on 1 side and coming back out on the other side of the stitch. Do not go all the way through the knitting. Only sew through the surface of your garter stitches on 1 side of your work. Try to follow the path of the stitches on 1 side of the work so that you are sewing in the same pattern as the garter stitches. Cut the remaining tail of yarn close to the knitting. When you cannot sew any further, let the tail of the yarn slip out of the yarn needle’s eye. Then, use a sharp pair of scissors to cut the yarn as close to the knitting project as you can without cutting through any of the stitches. Don’t worry about tying a knot. The yarn will be secure enough without one.",
    "sentences": [
        " Sewing in Ends Along an Edge Leave a 5–6 in (13–15 cm) tail after you tie off the last stitch.",
        "Tie off your last stitch and cut the tail about 5–6 in (13–15 cm) from the knot using a sharp pair of scissors.",
        "This will ensure that you have enough yarn to sew the tail into the edge of your work.",
        "If the tail is too short, then you won’t be able to sew it into the edge and you’ll need to use a different option.",
        "Thread the end of the yarn through a tapestry needle.",
        "Insert the end of the tail into the eye of a tapestry or yarn needle.",
        "Then, pull about 2 in (5.1 cm) of the yarn through the needle and grip the needle with your thumb and index finger around the eye to keep the yarn from slipping out while you sew.",
        "Make sure to choose a needle with a big enough eye to thread your yarn through.",
        "You can purchase a yarn needle or tapestry needle in a craft supply store.",
        "Tip: Wet the end of the yarn with saliva or a few drops of water.",
        "This will help to stiffen the yarn and make it easier to thread through the eye of the needle.",
        "Insert the needle into the stitch next to the base of the yarn.",
        "With the right (front or outer) side of your work facing you, find the edge stitch next to the base of the yarn tail.",
        "Then, push the needle into this stitch so that it comes out on the other side of your work.",
        "Pull the needle all the way through the stitch until the yarn is through it completely.",
        "The yarn does not need to be taut.",
        "Leave a bit of slack to ensure that the edge of your work won’t look misshapen.",
        "Bring the needle around the edge and back down through another stitch.",
        "Instead of sewing through the wrong (back or inner) side of the work, bring the needle around the edge of your knitting project.",
        "Then, insert the needle down through the next stitch on the right side of your work.",
        "Pull the needle through until the yarn is all the way through the stitch.",
        "Make sure that you do not pull the yarn too tight.",
        "Repeat this until you cannot sew any more.",
        "Continue to sew through the stitches on the right side of the edge of your knitting project until you cannot go any further.",
        "Make sure to only sew through 1 side and out the other, then bring the needle back around to the right side.",
        "Do not sew back and forth through the right and wrong sides of the work or your stitches will be more visible.",
        "Cut the last 1–2 in (2.5–5.1 cm) of yarn.",
        "When you reach the point that you cannot sew any further, cut the yarn with a sharp pair of scissors.",
        "Cut the yarn as close to the edge of the knitting project as you can without cutting through a stitch.",
        "You don’t need to tie a knot since the woven in ends will prevent your work from unraveling, but you may tie a knot through the last stitch if desired and then cut the yarn.",
        "Crocheting in Short Ends Insert the crochet hook into the stitch nearest to the tail.",
        "Looking at your work from the right (front or outer) side, locate the stitch nearest to where the tail of your yarn is anchored.",
        "Then, push the tip of the crochet hook under this stitch on the right side and bring it back out on the right side as well.",
        "Make sure to go all the way under the stitch to the other side of the work, and then out the other side of the stitch so that the tip of the hook is poking through on the right side of the work.",
        "This technique works for any length of yarn tail on the edge of a knitting project.",
        "However, if you haven’t finished binding off yet, leave a 4 in (10 cm) tail after you do.Tip: You can use any size crochet hook that will fit easily through your stitches.",
        "If you’re not sure what size crochet hook to use, look at your yarn label for a recommendation.",
        "Catch the yarn with the crochet hook and pull it through the stitch.",
        "With the right side of your work still facing you, bring the tail of your yarn up and over the tip of the crochet hook to catch it.",
        "Then, pull the crochet hook back under the stitch to bring the tail of yarn all the way through the stitch.",
        "The tail should come back out on the right side of your knitting project.",
        "Repeat this until the yarn tail is hidden.",
        "Insert the crochet hook into the next stitch along the edge of the work and catch the tail of yarn again.",
        "Pull the yarn all the way through the stitch as you did before to bring it under and through the stitch.",
        "Keep doing this until you cannot pull the yarn through any more.",
        "You may be able to hide the entire tail using this technique, but if not, you can cut the tail as close to the knitting project as possible.",
        "Weaving in Ends on a Garter Stitch Item Leave a 5–6 in (13–15 cm) tail after you tie off the last stitch.",
        "This will provide plenty of slack to thread the yarn needle and sew through the stitches on your knitting project.",
        "Cut the yarn to this length with a sharp pair of scissors.",
        "Thread the end of the tail through a yarn needle.",
        "Bring the yarn through the eye of the needle until about 2 in (5.1 cm) of yarn are through it.",
        "Then, grip the eye of the needle with your thumb and forefinger to keep the yarn in place while you sew.",
        "Choose a yarn needle with a big enough eye to thread the yarn through.",
        "You can buy a special yarn or tapestry needle at a craft supply store.",
        "Sew through the surface of a stitch on 1 side of the work.",
        "Push the needle into a stitch on 1 side of the work, but don’t bring the needle all the way through to the other side of the knitting.",
        "Bring the needle back up and out on the same side of the work and only sew under 1 loop of the stitch on that side.",
        "This will help to make the ends less visible.Tip: Since garter stitch does not really have a right (front or outer) and wrong (back or inner) side, you can weave in the ends on any side you like.",
        "However, if you are sewing in the ends on a hat, sweater, or pair of mittens, turn the project inside out before you start weaving in the ends.",
        "Insert the needle through the next stitch and back up on the same side.",
        "Next, locate the stitch nearest the one you just sewed through, but in the row below it.",
        "Insert the needle into the surface of this stitch and back out on the same side without going all the way through the stitch.",
        "This will allow you to create a stitch that mimics the garter stitch and preserves the stretchiness of your knitting.",
        "Keep sewing on 1 side until you cannot sew any more.",
        "Repeat the same stitch going through the surface of a stitch on 1 side and coming back out on the other side of the stitch.",
        "Do not go all the way through the knitting.",
        "Only sew through the surface of your garter stitches on 1 side of your work.",
        "Try to follow the path of the stitches on 1 side of the work so that you are sewing in the same pattern as the garter stitches.",
        "Cut the remaining tail of yarn close to the knitting.",
        "When you cannot sew any further, let the tail of the yarn slip out of the yarn needle’s eye.",
        "Then, use a sharp pair of scissors to cut the yarn as close to the knitting project as you can without cutting through any of the stitches.",
        "Don’t worry about tying a knot.",
        "The yarn will be secure enough without one."
    ]
}