{
    "title": "How to Make Felt Balls",
    "url": "https://www.wikihow.com/Make-Felt-Balls",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "parts": [
        {
            "name": "Forming the Felt Ball",
            "steps": [
                {
                    "headline": "Make a small, round wad of wool with your fingers.",
                    "description": "To start making the felt ball, pull off a small chunk of wool felt about 2–3 inches (5.1–7.6 cm) big and form it into a roundish shape. It won’t be a perfect ball, but will roughly resemble a large puffball. Stretch out the piece of felt so there aren’t any large clumps or pockets of material, then form it into a round wad of wool."
                },
                {
                    "headline": "Wrap a length of wool tightly around it.",
                    "description": "Take another strip of wool felt about 5–6 inches (13–15 cm) long and wrap the entire length of it around the small ball wad of wool. Wrap it tightly around the wad to form a solid core for your felt ball. The wool should start to adhere to itself as you wind it around the wad in the center. Don’t worry about adding different color wool at this point because you won’t be able to see it when the felt ball is finished."
                },
                {
                    "headline": "Add layers of wool until the ball is twice the size that you want it to be.",
                    "description": "The felt ball will shrink to almost half of its original size when it’s finished. Keep adding layers until your fluffy felt ball is about twice as large as you want it to be when it’s done. Try to keep the ball as round as possible while you’re adding layers of wool felt to it.Tip: Add the layers evenly so the finished ball won’t be misshapen or lumpy."
                }
            ]
        },
        {
            "name": "Wetting and Rolling the Felt",
            "steps": [
                {
                    "headline": "Mix 4 tablespoons (59 mL) of liquid dish soap and 6 cups (1.4 L) of hot water.",
                    "description": "The key to getting the wool felt to turn into a dense little ball is using hot water and soap to shrink and compact the material. Fill a bowl with hot water and mix in the dish soap. Stir the bowl to form a soapy mixture. The water doesn’t need to be so hot that it can burn you, but it does need to be very warm in order to shrink the wool."
                },
                {
                    "headline": "Submerge the ball of wool into the soap solution to fully saturate it.",
                    "description": "You don’t need to hold the ball under the water for a long time, just dip it in long enough to soak the ball completely. Hold the felt ball under the water for about 2-3 seconds. Gently shake the ball to remove the excess water from it."
                },
                {
                    "headline": "Hold the ball in between your palms and rub them in a circular motion.",
                    "description": "Gently roll the ball of wool in the palms of your hands to form it into a perfectly round sphere. Pass the ball of wool back and forth from hand to hand for 10 minutes.Tip: Do not squeeze the water out of the material or apply pressure to the felt ball. It will lose its shape and consistency."
                },
                {
                    "headline": "Dip the felt ball into the water when it cools down.",
                    "description": "As you’re rolling the ball of wool back and forth between your hands, submerge it back into the hot water whenever it cools down. Keeping the wool felt drenched in hot, soapy water is the key to forming the perfect felt ball. Submerge the felt ball in hot water every 2-3 minutes or whenever it starts to feel cold."
                }
            ]
        },
        {
            "name": "Adding Designs",
            "steps": [
                {
                    "headline": "Insert strips of colored wool into the ball the make stripes.",
                    "description": "Take a strip of differently colored wool felt and work it into the wet felt ball with your fingertips. Soak the ball in the hot, soapy water and roll it in your hands. The stripe will start to smooth out and become a part of the felt ball! Try using multiple colors of wool felt to form different stripes. Form a zigzag pattern by inserting the wool strip with your fingertips and creating a “staircase” pattern across the ball."
                },
                {
                    "headline": "Wind bits of wool into a circle to add dots to the ball.",
                    "description": "To add different colored dots to your felt ball, pull off a small piece of wool felt and roll it into a small ball. Flatten the ball with your fingertips and stick it into you felt ball. Then soak the ball in the hot water and roll it around in your hands until it’s smooth. Use multiple colors to make a wacky polka-dot felt ball!"
                },
                {
                    "headline": "Stop when the felt ball shrinks to the size that you want.",
                    "description": "Once the ball reaches the size you want it to be, immediately stop rolling it or it will continue to shrink. Do not submerge it back into the hot water or it will take longer to dry and will shrink even more.Tip: If the felt ball forms any cracks, take a heavy object like a book and lightly hit the felt ball to reshape it. Dip it back into the hot water and roll it back into a round shape."
                },
                {
                    "headline": "Rinse the ball with cool water and allow it to air dry.",
                    "description": "After you’ve stopped rolling the felt ball, rinse it under cool water in the sink to remove the hot water and soap. Then, place it on a plate and allow it to dry for about 1-2 hours, or until it’s dry to the touch. Don’t let the felt ball dry in the sunlight or near something hot or it will shrink even further as it dries."
                },
                {
                    "headline": "Add glitter to your felt ball to make it sparkle.",
                    "description": "After your felt ball is dry, add some craft glue to the ball and sprinkle on some glitter to add a little bit of sparkly flair. Use your fingertips to work the glitter into the wool felt. Some glitter may come off, but most of it will adhere to the craft glue on the wool."
                }
            ]
        }
    ],
    "tyn": [
        "Wool felt of different colors",
        "Liquid dish soap",
        "Large bowl",
        "Craft glue (optional)",
        "Glitter (optional)"
    ],
    "text": " Forming the Felt Ball Make a small, round wad of wool with your fingers. To start making the felt ball, pull off a small chunk of wool felt about 2–3 inches (5.1–7.6 cm) big and form it into a roundish shape. It won’t be a perfect ball, but will roughly resemble a large puffball. Stretch out the piece of felt so there aren’t any large clumps or pockets of material, then form it into a round wad of wool. Wrap a length of wool tightly around it. Take another strip of wool felt about 5–6 inches (13–15 cm) long and wrap the entire length of it around the small ball wad of wool. Wrap it tightly around the wad to form a solid core for your felt ball. The wool should start to adhere to itself as you wind it around the wad in the center. Don’t worry about adding different color wool at this point because you won’t be able to see it when the felt ball is finished. Add layers of wool until the ball is twice the size that you want it to be. The felt ball will shrink to almost half of its original size when it’s finished. Keep adding layers until your fluffy felt ball is about twice as large as you want it to be when it’s done. Try to keep the ball as round as possible while you’re adding layers of wool felt to it.Tip: Add the layers evenly so the finished ball won’t be misshapen or lumpy. Wetting and Rolling the Felt Mix 4 tablespoons (59 mL) of liquid dish soap and 6 cups (1.4 L) of hot water. The key to getting the wool felt to turn into a dense little ball is using hot water and soap to shrink and compact the material. Fill a bowl with hot water and mix in the dish soap. Stir the bowl to form a soapy mixture. The water doesn’t need to be so hot that it can burn you, but it does need to be very warm in order to shrink the wool. Submerge the ball of wool into the soap solution to fully saturate it. You don’t need to hold the ball under the water for a long time, just dip it in long enough to soak the ball completely. Hold the felt ball under the water for about 2-3 seconds. Gently shake the ball to remove the excess water from it. Hold the ball in between your palms and rub them in a circular motion. Gently roll the ball of wool in the palms of your hands to form it into a perfectly round sphere. Pass the ball of wool back and forth from hand to hand for 10 minutes.Tip: Do not squeeze the water out of the material or apply pressure to the felt ball. It will lose its shape and consistency. Dip the felt ball into the water when it cools down. As you’re rolling the ball of wool back and forth between your hands, submerge it back into the hot water whenever it cools down. Keeping the wool felt drenched in hot, soapy water is the key to forming the perfect felt ball. Submerge the felt ball in hot water every 2-3 minutes or whenever it starts to feel cold. Adding Designs Insert strips of colored wool into the ball the make stripes. Take a strip of differently colored wool felt and work it into the wet felt ball with your fingertips. Soak the ball in the hot, soapy water and roll it in your hands. The stripe will start to smooth out and become a part of the felt ball! Try using multiple colors of wool felt to form different stripes. Form a zigzag pattern by inserting the wool strip with your fingertips and creating a “staircase” pattern across the ball. Wind bits of wool into a circle to add dots to the ball. To add different colored dots to your felt ball, pull off a small piece of wool felt and roll it into a small ball. Flatten the ball with your fingertips and stick it into you felt ball. Then soak the ball in the hot water and roll it around in your hands until it’s smooth. Use multiple colors to make a wacky polka-dot felt ball! Stop when the felt ball shrinks to the size that you want. Once the ball reaches the size you want it to be, immediately stop rolling it or it will continue to shrink. Do not submerge it back into the hot water or it will take longer to dry and will shrink even more.Tip: If the felt ball forms any cracks, take a heavy object like a book and lightly hit the felt ball to reshape it. Dip it back into the hot water and roll it back into a round shape. Rinse the ball with cool water and allow it to air dry. After you’ve stopped rolling the felt ball, rinse it under cool water in the sink to remove the hot water and soap. Then, place it on a plate and allow it to dry for about 1-2 hours, or until it’s dry to the touch. Don’t let the felt ball dry in the sunlight or near something hot or it will shrink even further as it dries. Add glitter to your felt ball to make it sparkle. After your felt ball is dry, add some craft glue to the ball and sprinkle on some glitter to add a little bit of sparkly flair. Use your fingertips to work the glitter into the wool felt. Some glitter may come off, but most of it will adhere to the craft glue on the wool.",
    "sentences": [
        " Forming the Felt Ball Make a small, round wad of wool with your fingers.",
        "To start making the felt ball, pull off a small chunk of wool felt about 2–3 inches (5.1–7.6 cm) big and form it into a roundish shape.",
        "It won’t be a perfect ball, but will roughly resemble a large puffball.",
        "Stretch out the piece of felt so there aren’t any large clumps or pockets of material, then form it into a round wad of wool.",
        "Wrap a length of wool tightly around it.",
        "Take another strip of wool felt about 5–6 inches (13–15 cm) long and wrap the entire length of it around the small ball wad of wool.",
        "Wrap it tightly around the wad to form a solid core for your felt ball.",
        "The wool should start to adhere to itself as you wind it around the wad in the center.",
        "Don’t worry about adding different color wool at this point because you won’t be able to see it when the felt ball is finished.",
        "Add layers of wool until the ball is twice the size that you want it to be.",
        "The felt ball will shrink to almost half of its original size when it’s finished.",
        "Keep adding layers until your fluffy felt ball is about twice as large as you want it to be when it’s done.",
        "Try to keep the ball as round as possible while you’re adding layers of wool felt to it.Tip: Add the layers evenly so the finished ball won’t be misshapen or lumpy.",
        "Wetting and Rolling the Felt Mix 4 tablespoons (59 mL) of liquid dish soap and 6 cups (1.4 L) of hot water.",
        "The key to getting the wool felt to turn into a dense little ball is using hot water and soap to shrink and compact the material.",
        "Fill a bowl with hot water and mix in the dish soap.",
        "Stir the bowl to form a soapy mixture.",
        "The water doesn’t need to be so hot that it can burn you, but it does need to be very warm in order to shrink the wool.",
        "Submerge the ball of wool into the soap solution to fully saturate it.",
        "You don’t need to hold the ball under the water for a long time, just dip it in long enough to soak the ball completely.",
        "Hold the felt ball under the water for about 2-3 seconds.",
        "Gently shake the ball to remove the excess water from it.",
        "Hold the ball in between your palms and rub them in a circular motion.",
        "Gently roll the ball of wool in the palms of your hands to form it into a perfectly round sphere.",
        "Pass the ball of wool back and forth from hand to hand for 10 minutes.Tip: Do not squeeze the water out of the material or apply pressure to the felt ball.",
        "It will lose its shape and consistency.",
        "Dip the felt ball into the water when it cools down.",
        "As you’re rolling the ball of wool back and forth between your hands, submerge it back into the hot water whenever it cools down.",
        "Keeping the wool felt drenched in hot, soapy water is the key to forming the perfect felt ball.",
        "Submerge the felt ball in hot water every 2-3 minutes or whenever it starts to feel cold.",
        "Adding Designs Insert strips of colored wool into the ball the make stripes.",
        "Take a strip of differently colored wool felt and work it into the wet felt ball with your fingertips.",
        "Soak the ball in the hot, soapy water and roll it in your hands.",
        "The stripe will start to smooth out and become a part of the felt ball!",
        "Try using multiple colors of wool felt to form different stripes.",
        "Form a zigzag pattern by inserting the wool strip with your fingertips and creating a “staircase” pattern across the ball.",
        "Wind bits of wool into a circle to add dots to the ball.",
        "To add different colored dots to your felt ball, pull off a small piece of wool felt and roll it into a small ball.",
        "Flatten the ball with your fingertips and stick it into you felt ball.",
        "Then soak the ball in the hot water and roll it around in your hands until it’s smooth.",
        "Use multiple colors to make a wacky polka-dot felt ball!",
        "Stop when the felt ball shrinks to the size that you want.",
        "Once the ball reaches the size you want it to be, immediately stop rolling it or it will continue to shrink.",
        "Do not submerge it back into the hot water or it will take longer to dry and will shrink even more.Tip: If the felt ball forms any cracks, take a heavy object like a book and lightly hit the felt ball to reshape it.",
        "Dip it back into the hot water and roll it back into a round shape.",
        "Rinse the ball with cool water and allow it to air dry.",
        "After you’ve stopped rolling the felt ball, rinse it under cool water in the sink to remove the hot water and soap.",
        "Then, place it on a plate and allow it to dry for about 1-2 hours, or until it’s dry to the touch.",
        "Don’t let the felt ball dry in the sunlight or near something hot or it will shrink even further as it dries.",
        "Add glitter to your felt ball to make it sparkle.",
        "After your felt ball is dry, add some craft glue to the ball and sprinkle on some glitter to add a little bit of sparkly flair.",
        "Use your fingertips to work the glitter into the wool felt.",
        "Some glitter may come off, but most of it will adhere to the craft glue on the wool."
    ]
}