{
    "title": "How to Store Sleeping Bags",
    "url": "https://www.wikihow.com/Store-Sleeping-Bags",
    "category_hierarchy": [
        "Sports and Fitness",
        "Outdoor Recreation",
        "Camping",
        "Camping Gear",
        "Sleeping Bags"
    ],
    "methods": [
        {
            "name": "Cleaning Your Sleeping Bag for Storage",
            "steps": [
                {
                    "headline": "Spot clean your sleeping bag after every trip.",
                    "description": "Dampen any dirty spots on the bag with water and rub a bit of laundry detergent in with your fingertips. Use an old clean toothbrush to scrub any tough spots out. Rinse the soap off once the spot is clean. Do this after every trip you take your sleeping bag on to remove any dirt before you store it. If you just lightly used your sleeping bag and it is not dirty at all, then you don’t need to clean it before storage. Let your sleeping bag air dry after spot cleaning before you store it."
                },
                {
                    "headline": "Hang your bag up for 24 hours to air it out after a trip.",
                    "description": "Hang your bag in an open, dry place where it can air out. This will get rid of any odors before storing it as well as make sure that it is completely dry. If it’s dry and you have a laundry line outside your home, this is an ideal spot to hang it so it gets the most air flow. If not, you can hang it from a clothes hanger somewhere inside or drape it over a pair of chairs."
                },
                {
                    "headline": "Wash your bag in a front-loading machine if it smells bad or is super dirty.",
                    "description": "Don’t wash your sleeping bag after every trip or it will lose its loft (the fluffiness that keeps you warm) due to excessive washing. Use warm water and mild laundry detergent and wash it on the gentle cycle.Warning: Never dry clean a sleeping bag because the harsh chemicals will ruin it. It’s important to only use a front-loading washing machine because the agitators in top-loading home washing machines can twist and damage the bag. If you don’t have a front-loading washing machine at home, then take your bag to a laundromat and use one of the big ones. You can wash your bag about once a year, even if it’s not dirty, to help restore the loft if it begins to lose its fluffiness after continued use."
                },
                {
                    "headline": "Dry your bag on low-heat tumble dry if you machine-washed it.",
                    "description": "Grab the bag out of the washing machine and support its entire weight with your arms while you transfer it to the drying machine. Dry it on the lowest heat setting for 2-5 hours or until it is completely dry. Sleeping bags are easier to tear and damage when they are soggy and heavy, so this is why it’s important to support the whole weight of the bag when you transfer it to the dryer. You can throw 1-2 tennis balls in the dryer with your sleeping bag to help fluff it up again. Using a drying machine is only necessary for sleeping bags that are totally wet from a washing machine. If you spot cleaned your sleeping bag, you can just hang it to air dry."
                }
            ]
        },
        {
            "name": "Stowing Away Sleeping Bags Properly",
            "steps": [
                {
                    "headline": "Make sure your sleeping bag is completely dry before you store it.",
                    "description": "Never store a sleeping bag when it is wet or it will start to mold and can even fall apart eventually. Double-check the bag all over before your store it to make sure there are no wet spots anywhere. If there are any wet spots, then hang the bag up to dry until they are gone completely. Remember to air dry and air out your sleeping bag for 24 hours after using it on a trip."
                },
                {
                    "headline": "Shake the sleeping bag vigorously to fluff it up before storing it.",
                    "description": "Hold the sleeping bag with both hands at one end and shake it in the air like you are putting a sheet on a bed. This will help evenly distribute all the insulation and restore the loft of the bag before you put it away. This is especially important if you had your sleeping bag stored in a compression sack during a trip. If you compress a sleeping bag during storage, then it will lose its loft over time."
                },
                {
                    "headline": "Hang your sleeping bag in a dry closet or storage room if you have space.",
                    "description": "The ideal way to store a sleeping bag so that it gets lots of air flow and isn’t compressed at all is to hang it. Hang it on a clothes hanger in a closet or on a hook in a storage room if you can. Many sleeping bags have a small loop on one end to use for hanging them from a hook."
                },
                {
                    "headline": "Lay out your sleeping bag under a bed if you don’t have closet space.",
                    "description": "This is another way to store a sleeping bag without compressing it. Lay it out flat lengthwise underneath a bed with nothing on top of it. Make sure you clean underneath your bed if you are going to use this method. Otherwise, you might pull out a dusty sleeping bag next time you want to use it."
                },
                {
                    "headline": "Store the bag loosely in a breathable stuff sack if you have limited space.",
                    "description": "Sleeping bags often come with a larger cotton storage sack in addition to their compression sacks. Loosely shove the sleeping bag into this sack or into a king-sized pillowcase if you need to fit it into a smaller space.Warning: Never store a sleeping bag in a compression sack for long periods of time or it will lose its loft. The compression sacks are meant only for when you take your sleeping bag traveling with you so it takes up the least amount of space. Whatever storage sack you use should be made of cotton so that it is breathable and keeps your sleeping bag fresh. Make sure wherever you place the stuff sack with the sleeping bag in it stays cool and dry at all times."
                }
            ]
        }
    ],
    "tyn": [
        "Laundry detergent",
        "Water",
        "Toothbrush",
        "Front-loading washing machine (optional)",
        "Drying machine (optional)",
        "Coat hanger or storage hook (optional)",
        "Breathable stuff sack (optional)"
    ],
    "text": " Cleaning Your Sleeping Bag for Storage Spot clean your sleeping bag after every trip. Dampen any dirty spots on the bag with water and rub a bit of laundry detergent in with your fingertips. Use an old clean toothbrush to scrub any tough spots out. Rinse the soap off once the spot is clean. Do this after every trip you take your sleeping bag on to remove any dirt before you store it. If you just lightly used your sleeping bag and it is not dirty at all, then you don’t need to clean it before storage. Let your sleeping bag air dry after spot cleaning before you store it. Hang your bag up for 24 hours to air it out after a trip. Hang your bag in an open, dry place where it can air out. This will get rid of any odors before storing it as well as make sure that it is completely dry. If it’s dry and you have a laundry line outside your home, this is an ideal spot to hang it so it gets the most air flow. If not, you can hang it from a clothes hanger somewhere inside or drape it over a pair of chairs. Wash your bag in a front-loading machine if it smells bad or is super dirty. Don’t wash your sleeping bag after every trip or it will lose its loft (the fluffiness that keeps you warm) due to excessive washing. Use warm water and mild laundry detergent and wash it on the gentle cycle.Warning: Never dry clean a sleeping bag because the harsh chemicals will ruin it. It’s important to only use a front-loading washing machine because the agitators in top-loading home washing machines can twist and damage the bag. If you don’t have a front-loading washing machine at home, then take your bag to a laundromat and use one of the big ones. You can wash your bag about once a year, even if it’s not dirty, to help restore the loft if it begins to lose its fluffiness after continued use. Dry your bag on low-heat tumble dry if you machine-washed it. Grab the bag out of the washing machine and support its entire weight with your arms while you transfer it to the drying machine. Dry it on the lowest heat setting for 2-5 hours or until it is completely dry. Sleeping bags are easier to tear and damage when they are soggy and heavy, so this is why it’s important to support the whole weight of the bag when you transfer it to the dryer. You can throw 1-2 tennis balls in the dryer with your sleeping bag to help fluff it up again. Using a drying machine is only necessary for sleeping bags that are totally wet from a washing machine. If you spot cleaned your sleeping bag, you can just hang it to air dry. Stowing Away Sleeping Bags Properly Make sure your sleeping bag is completely dry before you store it. Never store a sleeping bag when it is wet or it will start to mold and can even fall apart eventually. Double-check the bag all over before your store it to make sure there are no wet spots anywhere. If there are any wet spots, then hang the bag up to dry until they are gone completely. Remember to air dry and air out your sleeping bag for 24 hours after using it on a trip. Shake the sleeping bag vigorously to fluff it up before storing it. Hold the sleeping bag with both hands at one end and shake it in the air like you are putting a sheet on a bed. This will help evenly distribute all the insulation and restore the loft of the bag before you put it away. This is especially important if you had your sleeping bag stored in a compression sack during a trip. If you compress a sleeping bag during storage, then it will lose its loft over time. Hang your sleeping bag in a dry closet or storage room if you have space. The ideal way to store a sleeping bag so that it gets lots of air flow and isn’t compressed at all is to hang it. Hang it on a clothes hanger in a closet or on a hook in a storage room if you can. Many sleeping bags have a small loop on one end to use for hanging them from a hook. Lay out your sleeping bag under a bed if you don’t have closet space. This is another way to store a sleeping bag without compressing it. Lay it out flat lengthwise underneath a bed with nothing on top of it. Make sure you clean underneath your bed if you are going to use this method. Otherwise, you might pull out a dusty sleeping bag next time you want to use it. Store the bag loosely in a breathable stuff sack if you have limited space. Sleeping bags often come with a larger cotton storage sack in addition to their compression sacks. Loosely shove the sleeping bag into this sack or into a king-sized pillowcase if you need to fit it into a smaller space.Warning: Never store a sleeping bag in a compression sack for long periods of time or it will lose its loft. The compression sacks are meant only for when you take your sleeping bag traveling with you so it takes up the least amount of space. Whatever storage sack you use should be made of cotton so that it is breathable and keeps your sleeping bag fresh. Make sure wherever you place the stuff sack with the sleeping bag in it stays cool and dry at all times.",
    "sentences": [
        " Cleaning Your Sleeping Bag for Storage Spot clean your sleeping bag after every trip.",
        "Dampen any dirty spots on the bag with water and rub a bit of laundry detergent in with your fingertips.",
        "Use an old clean toothbrush to scrub any tough spots out.",
        "Rinse the soap off once the spot is clean.",
        "Do this after every trip you take your sleeping bag on to remove any dirt before you store it.",
        "If you just lightly used your sleeping bag and it is not dirty at all, then you don’t need to clean it before storage.",
        "Let your sleeping bag air dry after spot cleaning before you store it.",
        "Hang your bag up for 24 hours to air it out after a trip.",
        "Hang your bag in an open, dry place where it can air out.",
        "This will get rid of any odors before storing it as well as make sure that it is completely dry.",
        "If it’s dry and you have a laundry line outside your home, this is an ideal spot to hang it so it gets the most air flow.",
        "If not, you can hang it from a clothes hanger somewhere inside or drape it over a pair of chairs.",
        "Wash your bag in a front-loading machine if it smells bad or is super dirty.",
        "Don’t wash your sleeping bag after every trip or it will lose its loft (the fluffiness that keeps you warm) due to excessive washing.",
        "Use warm water and mild laundry detergent and wash it on the gentle cycle.Warning: Never dry clean a sleeping bag because the harsh chemicals will ruin it.",
        "It’s important to only use a front-loading washing machine because the agitators in top-loading home washing machines can twist and damage the bag.",
        "If you don’t have a front-loading washing machine at home, then take your bag to a laundromat and use one of the big ones.",
        "You can wash your bag about once a year, even if it’s not dirty, to help restore the loft if it begins to lose its fluffiness after continued use.",
        "Dry your bag on low-heat tumble dry if you machine-washed it.",
        "Grab the bag out of the washing machine and support its entire weight with your arms while you transfer it to the drying machine.",
        "Dry it on the lowest heat setting for 2-5 hours or until it is completely dry.",
        "Sleeping bags are easier to tear and damage when they are soggy and heavy, so this is why it’s important to support the whole weight of the bag when you transfer it to the dryer.",
        "You can throw 1-2 tennis balls in the dryer with your sleeping bag to help fluff it up again.",
        "Using a drying machine is only necessary for sleeping bags that are totally wet from a washing machine.",
        "If you spot cleaned your sleeping bag, you can just hang it to air dry.",
        "Stowing Away Sleeping Bags Properly Make sure your sleeping bag is completely dry before you store it.",
        "Never store a sleeping bag when it is wet or it will start to mold and can even fall apart eventually.",
        "Double-check the bag all over before your store it to make sure there are no wet spots anywhere.",
        "If there are any wet spots, then hang the bag up to dry until they are gone completely.",
        "Remember to air dry and air out your sleeping bag for 24 hours after using it on a trip.",
        "Shake the sleeping bag vigorously to fluff it up before storing it.",
        "Hold the sleeping bag with both hands at one end and shake it in the air like you are putting a sheet on a bed.",
        "This will help evenly distribute all the insulation and restore the loft of the bag before you put it away.",
        "This is especially important if you had your sleeping bag stored in a compression sack during a trip.",
        "If you compress a sleeping bag during storage, then it will lose its loft over time.",
        "Hang your sleeping bag in a dry closet or storage room if you have space.",
        "The ideal way to store a sleeping bag so that it gets lots of air flow and isn’t compressed at all is to hang it.",
        "Hang it on a clothes hanger in a closet or on a hook in a storage room if you can.",
        "Many sleeping bags have a small loop on one end to use for hanging them from a hook.",
        "Lay out your sleeping bag under a bed if you don’t have closet space.",
        "This is another way to store a sleeping bag without compressing it.",
        "Lay it out flat lengthwise underneath a bed with nothing on top of it.",
        "Make sure you clean underneath your bed if you are going to use this method.",
        "Otherwise, you might pull out a dusty sleeping bag next time you want to use it.",
        "Store the bag loosely in a breathable stuff sack if you have limited space.",
        "Sleeping bags often come with a larger cotton storage sack in addition to their compression sacks.",
        "Loosely shove the sleeping bag into this sack or into a king-sized pillowcase if you need to fit it into a smaller space.Warning: Never store a sleeping bag in a compression sack for long periods of time or it will lose its loft.",
        "The compression sacks are meant only for when you take your sleeping bag traveling with you so it takes up the least amount of space.",
        "Whatever storage sack you use should be made of cotton so that it is breathable and keeps your sleeping bag fresh.",
        "Make sure wherever you place the stuff sack with the sleeping bag in it stays cool and dry at all times."
    ]
}