{
    "title": "How to Measure Stairs and a Landing for Carpet",
    "url": "https://www.wikihow.com/Measure-Stairs-and-a-Landing-for-Carpet",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Floors and Stairs",
        "Carpets and Rugs",
        "Stair Carpets"
    ],
    "methods": [
        {
            "name": "Getting the Landing Measurements",
            "steps": [
                {
                    "headline": "Measure the width of the landing with a measuring tape.",
                    "description": "Put the end of the measuring tape against the base of the stair that meets the landing and stretch it out to the baseboard on the opposite wall. Read the number where it meets the baseboard and write down the width of the landing to refer to later. It’s a good idea to measure the width in at least 2 different spots in case the landing is not completely square. Use the longest of the measurements when calculating how much carpet you need (carpet can always be trimmed down to fit)."
                },
                {
                    "headline": "Use your tape measure to find the length of the landing.",
                    "description": "Turn your tape measure 90 degrees and measure from the baseboard where the landing meets the wall to the top edge of the stairs that continue down. Write down the length of the landing.Tip: The length and the width of the landing will be the same in most cases, since they correspond to the width of the stairs, but it’s always a good idea to measure just in case there are any differences. Check the length of the landing in at least 2 places and go with the bigger number if there is any difference."
                },
                {
                    "headline": "Add 2 in (5.1 cm) to the length and width of the landing.",
                    "description": "Add 2 in (5.1 cm) to each measurement to account for folding some of the carpet under during installation. This will ensure there is enough carpet to cover the landing. The carpet will be folded under and stapled during installation to get a clean-looking finished edge. This is why you need to add 2 in (5.1 cm) to both the length and width."
                }
            ]
        },
        {
            "name": "Adding up the Stair Measurements",
            "steps": [
                {
                    "headline": "Measure the width of the stairs with a measuring tape.",
                    "description": "Stretch out the measuring tape parallel to the edge of a stair to get the width. This number tells you how wide the carpet needs to be to cover the stairs. Do this for 2-3 stairs in case there are any variations in width. Use the widest measurement as the number for your width to ensure you get carpet that is wide enough (you can trim it to fit any stairs that are narrower)."
                },
                {
                    "headline": "Turn your tape measure 90 degrees and measure the depth of the stairs.",
                    "description": "Hold the measuring tape flat against the tread of the stair, put the end of the measuring tape against the base of the next stair up, and stretch it out to the edge of the stair. Read the number at the very edge to get the depth and write it down to refer to later on. The tread of a stair is the part that you step on when walking up and down the stairs. Think of the depth as how much room for your foot there is from heel to toe on the stair. Again, do this for 2-3 stairs and use the larger number for the depth of the stairs if there are any differences."
                },
                {
                    "headline": "Hold your tape measure vertically to measure the rise of the stairs.",
                    "description": "Flip your tape measure vertically so the end is flat against the tread of a stair and you can stretch the tape measure up into the air to measure how tall the stair is. Measure from the tread of the stair to the edge of the stair above and write down this number.Tip: Some stairs have “nosing” (an edge that sticks out a bit). If this is the case, you can pinch the tape measure between your thumb and forefinger around the nosing when you are measuring the depth of a stair, then continue to extend the tape measure down to measure both the depth and the rise at the same time. Note that the rise is how tall the stair is, whereas the depth is how deep the tread is. The rise is a vertical measurement, and the depth is a horizontal measurement. Do this at least 2 times to make sure you are getting the right number for the rise. Use the bigger number if there are any variations."
                },
                {
                    "headline": "Multiply the depth and the rise of the stairs by the number of stairs.",
                    "description": "Add the depth and rise together. Count the number of stairs on the whole staircase and multiply it by the sum of the depth and rise. For example, if the depth of the stairs is 10 in (25 cm) and the rise is 7 in (18 cm) then you would multiply 17 in (43 cm) by the number of stairs. If there are 10 stairs, then the total would be 170 in (430 cm)."
                },
                {
                    "headline": "Add about 4 in (10 cm) to the length as a safety net.",
                    "description": "This will give you a little wiggle room for minute errors in your measurements or irregularities in the stairs. Add more than 4 in (10 cm) if you want to be extra-careful or know that your staircase is a bit odd (such as a staircase in a very old house that has warped with time). For instance, if you know that you need 170 in (430 cm) of carpet, then get at least 174 in (440 cm) to account for error."
                }
            ]
        }
    ],
    "tyn": [
        "Tape measure"
    ],
    "text": " Getting the Landing Measurements Measure the width of the landing with a measuring tape. Put the end of the measuring tape against the base of the stair that meets the landing and stretch it out to the baseboard on the opposite wall. Read the number where it meets the baseboard and write down the width of the landing to refer to later. It’s a good idea to measure the width in at least 2 different spots in case the landing is not completely square. Use the longest of the measurements when calculating how much carpet you need (carpet can always be trimmed down to fit). Use your tape measure to find the length of the landing. Turn your tape measure 90 degrees and measure from the baseboard where the landing meets the wall to the top edge of the stairs that continue down. Write down the length of the landing.Tip: The length and the width of the landing will be the same in most cases, since they correspond to the width of the stairs, but it’s always a good idea to measure just in case there are any differences. Check the length of the landing in at least 2 places and go with the bigger number if there is any difference. Add 2 in (5.1 cm) to the length and width of the landing. Add 2 in (5.1 cm) to each measurement to account for folding some of the carpet under during installation. This will ensure there is enough carpet to cover the landing. The carpet will be folded under and stapled during installation to get a clean-looking finished edge. This is why you need to add 2 in (5.1 cm) to both the length and width. Adding up the Stair Measurements Measure the width of the stairs with a measuring tape. Stretch out the measuring tape parallel to the edge of a stair to get the width. This number tells you how wide the carpet needs to be to cover the stairs. Do this for 2-3 stairs in case there are any variations in width. Use the widest measurement as the number for your width to ensure you get carpet that is wide enough (you can trim it to fit any stairs that are narrower). Turn your tape measure 90 degrees and measure the depth of the stairs. Hold the measuring tape flat against the tread of the stair, put the end of the measuring tape against the base of the next stair up, and stretch it out to the edge of the stair. Read the number at the very edge to get the depth and write it down to refer to later on. The tread of a stair is the part that you step on when walking up and down the stairs. Think of the depth as how much room for your foot there is from heel to toe on the stair. Again, do this for 2-3 stairs and use the larger number for the depth of the stairs if there are any differences. Hold your tape measure vertically to measure the rise of the stairs. Flip your tape measure vertically so the end is flat against the tread of a stair and you can stretch the tape measure up into the air to measure how tall the stair is. Measure from the tread of the stair to the edge of the stair above and write down this number.Tip: Some stairs have “nosing” (an edge that sticks out a bit). If this is the case, you can pinch the tape measure between your thumb and forefinger around the nosing when you are measuring the depth of a stair, then continue to extend the tape measure down to measure both the depth and the rise at the same time. Note that the rise is how tall the stair is, whereas the depth is how deep the tread is. The rise is a vertical measurement, and the depth is a horizontal measurement. Do this at least 2 times to make sure you are getting the right number for the rise. Use the bigger number if there are any variations. Multiply the depth and the rise of the stairs by the number of stairs. Add the depth and rise together. Count the number of stairs on the whole staircase and multiply it by the sum of the depth and rise. For example, if the depth of the stairs is 10 in (25 cm) and the rise is 7 in (18 cm) then you would multiply 17 in (43 cm) by the number of stairs. If there are 10 stairs, then the total would be 170 in (430 cm). Add about 4 in (10 cm) to the length as a safety net. This will give you a little wiggle room for minute errors in your measurements or irregularities in the stairs. Add more than 4 in (10 cm) if you want to be extra-careful or know that your staircase is a bit odd (such as a staircase in a very old house that has warped with time). For instance, if you know that you need 170 in (430 cm) of carpet, then get at least 174 in (440 cm) to account for error.",
    "sentences": [
        " Getting the Landing Measurements Measure the width of the landing with a measuring tape.",
        "Put the end of the measuring tape against the base of the stair that meets the landing and stretch it out to the baseboard on the opposite wall.",
        "Read the number where it meets the baseboard and write down the width of the landing to refer to later.",
        "It’s a good idea to measure the width in at least 2 different spots in case the landing is not completely square.",
        "Use the longest of the measurements when calculating how much carpet you need (carpet can always be trimmed down to fit).",
        "Use your tape measure to find the length of the landing.",
        "Turn your tape measure 90 degrees and measure from the baseboard where the landing meets the wall to the top edge of the stairs that continue down.",
        "Write down the length of the landing.Tip: The length and the width of the landing will be the same in most cases, since they correspond to the width of the stairs, but it’s always a good idea to measure just in case there are any differences.",
        "Check the length of the landing in at least 2 places and go with the bigger number if there is any difference.",
        "Add 2 in (5.1 cm) to the length and width of the landing.",
        "Add 2 in (5.1 cm) to each measurement to account for folding some of the carpet under during installation.",
        "This will ensure there is enough carpet to cover the landing.",
        "The carpet will be folded under and stapled during installation to get a clean-looking finished edge.",
        "This is why you need to add 2 in (5.1 cm) to both the length and width.",
        "Adding up the Stair Measurements Measure the width of the stairs with a measuring tape.",
        "Stretch out the measuring tape parallel to the edge of a stair to get the width.",
        "This number tells you how wide the carpet needs to be to cover the stairs.",
        "Do this for 2-3 stairs in case there are any variations in width.",
        "Use the widest measurement as the number for your width to ensure you get carpet that is wide enough (you can trim it to fit any stairs that are narrower).",
        "Turn your tape measure 90 degrees and measure the depth of the stairs.",
        "Hold the measuring tape flat against the tread of the stair, put the end of the measuring tape against the base of the next stair up, and stretch it out to the edge of the stair.",
        "Read the number at the very edge to get the depth and write it down to refer to later on.",
        "The tread of a stair is the part that you step on when walking up and down the stairs.",
        "Think of the depth as how much room for your foot there is from heel to toe on the stair.",
        "Again, do this for 2-3 stairs and use the larger number for the depth of the stairs if there are any differences.",
        "Hold your tape measure vertically to measure the rise of the stairs.",
        "Flip your tape measure vertically so the end is flat against the tread of a stair and you can stretch the tape measure up into the air to measure how tall the stair is.",
        "Measure from the tread of the stair to the edge of the stair above and write down this number.Tip: Some stairs have “nosing” (an edge that sticks out a bit).",
        "If this is the case, you can pinch the tape measure between your thumb and forefinger around the nosing when you are measuring the depth of a stair, then continue to extend the tape measure down to measure both the depth and the rise at the same time.",
        "Note that the rise is how tall the stair is, whereas the depth is how deep the tread is.",
        "The rise is a vertical measurement, and the depth is a horizontal measurement.",
        "Do this at least 2 times to make sure you are getting the right number for the rise.",
        "Use the bigger number if there are any variations.",
        "Multiply the depth and the rise of the stairs by the number of stairs.",
        "Add the depth and rise together.",
        "Count the number of stairs on the whole staircase and multiply it by the sum of the depth and rise.",
        "For example, if the depth of the stairs is 10 in (25 cm) and the rise is 7 in (18 cm) then you would multiply 17 in (43 cm) by the number of stairs.",
        "If there are 10 stairs, then the total would be 170 in (430 cm).",
        "Add about 4 in (10 cm) to the length as a safety net.",
        "This will give you a little wiggle room for minute errors in your measurements or irregularities in the stairs.",
        "Add more than 4 in (10 cm) if you want to be extra-careful or know that your staircase is a bit odd (such as a staircase in a very old house that has warped with time).",
        "For instance, if you know that you need 170 in (430 cm) of carpet, then get at least 174 in (440 cm) to account for error."
    ]
}