{
    "title": "How to Make Christmas S'mores",
    "url": "https://www.wikihow.com/Make-Christmas-S%27mores",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Chocolate and Candy",
        "Marshmallow Treats"
    ],
    "methods": [
        {
            "name": "Christmas S'mores Bars",
            "steps": [
                {
                    "headline": "Preheat the oven to 350 °F (177 °C) and grease a baking dish.",
                    "description": "Get out a 9 in × 13 in (23 cm × 33 cm) baking pan and spray the inside with nonstick spray. Then lay parchment paper in the pan so some of the paper extends over the sides. You'll lift the bars out of the pan using the parchment paper. If you don't have parchment paper, you can skip this step, but you might have a little trouble removing the bars."
                },
                {
                    "headline": "Mix the crumbs with butter and press the mixture into your pan.",
                    "description": "Put 2 cups (170 g) of graham cracker crumbs into a mixing bowl and stir in 8 tablespoons (113 g) of melted butter. Once the crumbs are moist, transfer the mixture to your prepared pan and press the mixture evenly into the bottom of the pan.Variation: For an extra-rich treat, use chocolate graham crackers instead of honey graham crackers. You can use your hands or the bottom of a measuring cup to press the crumb mixture into the pan."
                },
                {
                    "headline": "Scatter the chocolate chips and 1/2 of the mini-M&M's in the pan.",
                    "description": "Sprinkle 2 cups (350 g) of semi-sweet chocolate chips and 1/2 cup (145 g) of the Christmas mini-M&M's evenly over the graham mixture. Although you can substitute white or milk chocolate chips, these will make the bars sweeter."
                },
                {
                    "headline": "Sprinkle some marshmallows and pour the condensed milk in the pan.",
                    "description": "Scatter 1 1/2 cups (75 g) of mini-marshmallows over the chocolate chips and mini-M&Ms. Then open a 14-ounce (396 g) can of sweetened condensed milk and pour it evenly across the pan. Ensure that you're not using evaporated milk, which is much thinner and unsweetened."
                },
                {
                    "headline": "Scatter the rest of the mini-M&M's and mini-marshmallows on top.",
                    "description": "Add the remaining 1/2 cup (25 g) of mini-marshmallows and 1/2 cup (145 g) of Christmas mini-M&M's across the top of the pan. Consider using peppermint M&M's on top for a festive, minty crunch."
                },
                {
                    "headline": "Cover the pan with foil and bake the bars for 15 minutes.",
                    "description": "Tear off a sheet of aluminum foil and cover the pan with it. Place the pan in the preheated oven and cook the s'mores bars for 15 minutes. The chocolate should begin to melt."
                },
                {
                    "headline": "Remove the foil and bake the bars for 15 to 20 minutes.",
                    "description": "Carefully lift off the foil from the pan and bake the uncovered bars until the marshmallows puff up and become golden brown."
                },
                {
                    "headline": "Cool the s'mores for 2 hours before you cut them into bars.",
                    "description": "Set the pan of s'mores on a cooling rack and let them cool to room temperature. This should take about 2 hours. Then carefully use a sharp knife to cut the s'mores into 12 bars. Cover the leftover bars with aluminum foil and store them at room temperature for up to 4 or 5 days."
                }
            ]
        },
        {
            "name": "Decorating S'mores for Christmas",
            "steps": [
                {
                    "headline": "Assemble 6 s'mores.",
                    "description": "Break 6 full-size graham crackers and 3 milk chocolate bars in half. Place the chocolates on 6 of the graham cracker halves. Top them with 12 large marshmallows and heat them in the oven or microwave until the marshmallows puff up. Then push the remaining graham crackers on top to make 6 s'mores.Variation: For minty s'mores, crush a few mini-candy canes and sprinkle them over the marshmallows after you heat them. You may be able to buy marshmallows in red and green colors."
                },
                {
                    "headline": "Line a sheet with waxed paper and put the s'mores on it.",
                    "description": "Get out a baking sheet and lay a sheet of waxed paper or parchment paper on it. Then put the 6 s'mores you made on it so there's at least 1 inch (2.5 cm) of space between each of them. The waxed paper or parchment paper will prevent the chocolate-dipped s'mores from sticking to the baking sheet."
                },
                {
                    "headline": "Melt the candy melts in 3 separate bowls.",
                    "description": "Put 1/3 cup (75 g) of red candy melts candy into a bowl, 1/3 cup (75 g) of green candy melts candy into another bowl, and 1/3 cup (75 g) of white candy melts candy into a third bowl. Heat the bowls 1 at a time for 1 minute. Then stir the candy melts and microwave them at 30-second intervals until they're completely melted. Ensure that the bowls are microwave-safe and your microwave power is at 40 or 50%."
                },
                {
                    "headline": "Spoon some of the melted candy over 1/2 of each s'more.",
                    "description": "Scoop some of the red, white, or green melted candy over a s'more so 1/2 of it is covered. You can do this diagonally for a decorative effect. Repeat this for each s'more. Work quickly so the candy coating doesn't set."
                },
                {
                    "headline": "Decorate the s'mores with Christmas candy sprinkles.",
                    "description": "Quickly scatter some of the green and red sprinkles over the candy-coated s'mores. The sprinkles should stick to the melted candy. You can also try star or Christmas tree sprinkles."
                },
                {
                    "headline": "Chill the decorated s'mores for 20 minutes.",
                    "description": "Put the baking sheet of decorated s'mores into the refrigerator. Leave them until the candy coating hardens and you can easily pull the s'mores off of the waxed paper or parchment paper. If you'd like to make these in advance or store leftovers, put them into an airtight container and keep them at room temperature for up to 1 to 2 days. Avoid refrigerating because the graham crackers will become soft."
                }
            ]
        }
    ],
    "tyn": [
        "Christmas S'mores Bars",
        "Bowl",
        "9 in × 13 in (23 cm × 33 cm) baking pan",
        "Nonstick spray",
        "Parchment paper",
        "Measuring cups",
        "Spoon",
        "Wire rack",
        "Knife",
        "Decorating S'mores for Christmas",
        "Measuring cups and spoons",
        "Waxed paper or parchment paper",
        "Baking sheet",
        "Microwave-safe bowls",
        "Microwave"
    ],
    "text": " Christmas S'mores Bars Preheat the oven to 350 °F (177 °C) and grease a baking dish. Get out a 9 in × 13 in (23 cm × 33 cm) baking pan and spray the inside with nonstick spray. Then lay parchment paper in the pan so some of the paper extends over the sides. You'll lift the bars out of the pan using the parchment paper. If you don't have parchment paper, you can skip this step, but you might have a little trouble removing the bars. Mix the crumbs with butter and press the mixture into your pan. Put 2 cups (170 g) of graham cracker crumbs into a mixing bowl and stir in 8 tablespoons (113 g) of melted butter. Once the crumbs are moist, transfer the mixture to your prepared pan and press the mixture evenly into the bottom of the pan.Variation: For an extra-rich treat, use chocolate graham crackers instead of honey graham crackers. You can use your hands or the bottom of a measuring cup to press the crumb mixture into the pan. Scatter the chocolate chips and 1/2 of the mini-M&M's in the pan. Sprinkle 2 cups (350 g) of semi-sweet chocolate chips and 1/2 cup (145 g) of the Christmas mini-M&M's evenly over the graham mixture. Although you can substitute white or milk chocolate chips, these will make the bars sweeter. Sprinkle some marshmallows and pour the condensed milk in the pan. Scatter 1 1/2 cups (75 g) of mini-marshmallows over the chocolate chips and mini-M&Ms. Then open a 14-ounce (396 g) can of sweetened condensed milk and pour it evenly across the pan. Ensure that you're not using evaporated milk, which is much thinner and unsweetened. Scatter the rest of the mini-M&M's and mini-marshmallows on top. Add the remaining 1/2 cup (25 g) of mini-marshmallows and 1/2 cup (145 g) of Christmas mini-M&M's across the top of the pan. Consider using peppermint M&M's on top for a festive, minty crunch. Cover the pan with foil and bake the bars for 15 minutes. Tear off a sheet of aluminum foil and cover the pan with it. Place the pan in the preheated oven and cook the s'mores bars for 15 minutes. The chocolate should begin to melt. Remove the foil and bake the bars for 15 to 20 minutes. Carefully lift off the foil from the pan and bake the uncovered bars until the marshmallows puff up and become golden brown. Cool the s'mores for 2 hours before you cut them into bars. Set the pan of s'mores on a cooling rack and let them cool to room temperature. This should take about 2 hours. Then carefully use a sharp knife to cut the s'mores into 12 bars. Cover the leftover bars with aluminum foil and store them at room temperature for up to 4 or 5 days. Decorating S'mores for Christmas Assemble 6 s'mores. Break 6 full-size graham crackers and 3 milk chocolate bars in half. Place the chocolates on 6 of the graham cracker halves. Top them with 12 large marshmallows and heat them in the oven or microwave until the marshmallows puff up. Then push the remaining graham crackers on top to make 6 s'mores.Variation: For minty s'mores, crush a few mini-candy canes and sprinkle them over the marshmallows after you heat them. You may be able to buy marshmallows in red and green colors. Line a sheet with waxed paper and put the s'mores on it. Get out a baking sheet and lay a sheet of waxed paper or parchment paper on it. Then put the 6 s'mores you made on it so there's at least 1 inch (2.5 cm) of space between each of them. The waxed paper or parchment paper will prevent the chocolate-dipped s'mores from sticking to the baking sheet. Melt the candy melts in 3 separate bowls. Put 1/3 cup (75 g) of red candy melts candy into a bowl, 1/3 cup (75 g) of green candy melts candy into another bowl, and 1/3 cup (75 g) of white candy melts candy into a third bowl. Heat the bowls 1 at a time for 1 minute. Then stir the candy melts and microwave them at 30-second intervals until they're completely melted. Ensure that the bowls are microwave-safe and your microwave power is at 40 or 50%. Spoon some of the melted candy over 1/2 of each s'more. Scoop some of the red, white, or green melted candy over a s'more so 1/2 of it is covered. You can do this diagonally for a decorative effect. Repeat this for each s'more. Work quickly so the candy coating doesn't set. Decorate the s'mores with Christmas candy sprinkles. Quickly scatter some of the green and red sprinkles over the candy-coated s'mores. The sprinkles should stick to the melted candy. You can also try star or Christmas tree sprinkles. Chill the decorated s'mores for 20 minutes. Put the baking sheet of decorated s'mores into the refrigerator. Leave them until the candy coating hardens and you can easily pull the s'mores off of the waxed paper or parchment paper. If you'd like to make these in advance or store leftovers, put them into an airtight container and keep them at room temperature for up to 1 to 2 days. Avoid refrigerating because the graham crackers will become soft.",
    "sentences": [
        " Christmas S'mores Bars Preheat the oven to 350 °F (177 °C) and grease a baking dish.",
        "Get out a 9 in × 13 in (23 cm × 33 cm) baking pan and spray the inside with nonstick spray.",
        "Then lay parchment paper in the pan so some of the paper extends over the sides.",
        "You'll lift the bars out of the pan using the parchment paper.",
        "If you don't have parchment paper, you can skip this step, but you might have a little trouble removing the bars.",
        "Mix the crumbs with butter and press the mixture into your pan.",
        "Put 2 cups (170 g) of graham cracker crumbs into a mixing bowl and stir in 8 tablespoons (113 g) of melted butter.",
        "Once the crumbs are moist, transfer the mixture to your prepared pan and press the mixture evenly into the bottom of the pan.Variation: For an extra-rich treat, use chocolate graham crackers instead of honey graham crackers.",
        "You can use your hands or the bottom of a measuring cup to press the crumb mixture into the pan.",
        "Scatter the chocolate chips and 1/2 of the mini-M&M's in the pan.",
        "Sprinkle 2 cups (350 g) of semi-sweet chocolate chips and 1/2 cup (145 g) of the Christmas mini-M&M's evenly over the graham mixture.",
        "Although you can substitute white or milk chocolate chips, these will make the bars sweeter.",
        "Sprinkle some marshmallows and pour the condensed milk in the pan.",
        "Scatter 1 1/2 cups (75 g) of mini-marshmallows over the chocolate chips and mini-M&Ms.",
        "Then open a 14-ounce (396 g) can of sweetened condensed milk and pour it evenly across the pan.",
        "Ensure that you're not using evaporated milk, which is much thinner and unsweetened.",
        "Scatter the rest of the mini-M&M's and mini-marshmallows on top.",
        "Add the remaining 1/2 cup (25 g) of mini-marshmallows and 1/2 cup (145 g) of Christmas mini-M&M's across the top of the pan.",
        "Consider using peppermint M&M's on top for a festive, minty crunch.",
        "Cover the pan with foil and bake the bars for 15 minutes.",
        "Tear off a sheet of aluminum foil and cover the pan with it.",
        "Place the pan in the preheated oven and cook the s'mores bars for 15 minutes.",
        "The chocolate should begin to melt.",
        "Remove the foil and bake the bars for 15 to 20 minutes.",
        "Carefully lift off the foil from the pan and bake the uncovered bars until the marshmallows puff up and become golden brown.",
        "Cool the s'mores for 2 hours before you cut them into bars.",
        "Set the pan of s'mores on a cooling rack and let them cool to room temperature.",
        "This should take about 2 hours.",
        "Then carefully use a sharp knife to cut the s'mores into 12 bars.",
        "Cover the leftover bars with aluminum foil and store them at room temperature for up to 4 or 5 days.",
        "Decorating S'mores for Christmas Assemble 6 s'mores.",
        "Break 6 full-size graham crackers and 3 milk chocolate bars in half.",
        "Place the chocolates on 6 of the graham cracker halves.",
        "Top them with 12 large marshmallows and heat them in the oven or microwave until the marshmallows puff up.",
        "Then push the remaining graham crackers on top to make 6 s'mores.Variation: For minty s'mores, crush a few mini-candy canes and sprinkle them over the marshmallows after you heat them.",
        "You may be able to buy marshmallows in red and green colors.",
        "Line a sheet with waxed paper and put the s'mores on it.",
        "Get out a baking sheet and lay a sheet of waxed paper or parchment paper on it.",
        "Then put the 6 s'mores you made on it so there's at least 1 inch (2.5 cm) of space between each of them.",
        "The waxed paper or parchment paper will prevent the chocolate-dipped s'mores from sticking to the baking sheet.",
        "Melt the candy melts in 3 separate bowls.",
        "Put 1/3 cup (75 g) of red candy melts candy into a bowl, 1/3 cup (75 g) of green candy melts candy into another bowl, and 1/3 cup (75 g) of white candy melts candy into a third bowl.",
        "Heat the bowls 1 at a time for 1 minute.",
        "Then stir the candy melts and microwave them at 30-second intervals until they're completely melted.",
        "Ensure that the bowls are microwave-safe and your microwave power is at 40 or 50%.",
        "Spoon some of the melted candy over 1/2 of each s'more.",
        "Scoop some of the red, white, or green melted candy over a s'more so 1/2 of it is covered.",
        "You can do this diagonally for a decorative effect.",
        "Repeat this for each s'more.",
        "Work quickly so the candy coating doesn't set.",
        "Decorate the s'mores with Christmas candy sprinkles.",
        "Quickly scatter some of the green and red sprinkles over the candy-coated s'mores.",
        "The sprinkles should stick to the melted candy.",
        "You can also try star or Christmas tree sprinkles.",
        "Chill the decorated s'mores for 20 minutes.",
        "Put the baking sheet of decorated s'mores into the refrigerator.",
        "Leave them until the candy coating hardens and you can easily pull the s'mores off of the waxed paper or parchment paper.",
        "If you'd like to make these in advance or store leftovers, put them into an airtight container and keep them at room temperature for up to 1 to 2 days.",
        "Avoid refrigerating because the graham crackers will become soft."
    ]
}