{
    "title": "How to Use Soliqua 100 33",
    "url": "https://www.wikihow.com/Use-Soliqua-100-33",
    "category_hierarchy": [
        "Health",
        "Endocrine System Health",
        "Endocrine Disorders",
        "Diabetes Mellitus"
    ],
    "methods": [
        {
            "name": "Setting Up the Soliqua Pen",
            "steps": [
                {
                    "headline": "Talk with your doctor about your prescription.",
                    "description": "Before you use your pen for the first time, ask your doctor about your dose and how often you should take it. If you've never used an insulin pen before, the doctor should walk you through how to use it. Ask your doctor questions so you feel comfortable with the pen. You can also ask your doctor to explain why they're prescribing Soliqua for you."
                },
                {
                    "headline": "Wash your hands or use an alcohol-based hand sanitizer.",
                    "description": "Spend at least 20 seconds washing your hands with soap and water. Then, dry them on a clean cloth. If you don't have access to a sink, squirt an alcohol-based hand sanitizer in your palm and rub your hands thoroughly until they feel dry. Practice good hygiene when you inject Soliqua to prevent infection."
                },
                {
                    "headline": "Check the pen and remove the cap.",
                    "description": "Look at the pen and ensure that you have the Soliqua 100/33 pen. Read the expiration date and determine if the medication is still good. If it's the correct medication, take off the cap and look at the medication. It should look completely clear.Tip: If you're using a new pen that was stored in the refrigerator, let it sit out at room temperature for at least 1 hour before you inject the medication. Although you can inject cold medication, it will feel uncomfortable. If you see small particles in the medication, return the pen to the pharmacy for a new pen."
                },
                {
                    "headline": "Wipe the rubber seal with an alcohol swab and attach a new needle.",
                    "description": "Open a small alcohol swab and rub it over the rubber seal that's at the end of the Soliqua pen. Then, peel back the protective tab from the needle container and push the pen onto the needle. Turn it clockwise so the needle is tightly fitted onto the pen. Always use a new needle every time you use the pen."
                },
                {
                    "headline": "Check the Soliqua pen to ensure it's working correctly.",
                    "description": "Turn the dosing knob to 2 units and hold the pen so the needle points up. Push the injection button all the way. You should see a few drops or a stream of the medication come out of the needle. If you don't see any medication at the tip of the needle, check the pen again. If no medication comes out after 2 to 3 more tries, change the needle and check the pen again."
                },
                {
                    "headline": "Turn the dial at the end of the pen to select your prescribed dose.",
                    "description": "Once your needle is attached and the pen is working properly, ensure that the dial is set at \"0.\" Then, turn the dial until the dose pointer lines up with the number dose that you've been prescribed. For example, if you're prescribed 15 units, turn the dial until the pointer line points to 15."
                }
            ]
        },
        {
            "name": "Performing the Injection",
            "steps": [
                {
                    "headline": "Choose an injection site.",
                    "description": "Locate a site around your stomach or abdomen that's at least 2 inches (5.1 cm) away from your belly button. If you prefer, you could inject the medication in your thighs as long as it's away from your knees. You can also inject into the fatty tissue at the outer back area of your upper arms.Tip: Don't use the same injection site every day. It's important to rotate sites so tissue doesn't build up on the site and block the medication."
                },
                {
                    "headline": "Push the pen needle into your skin before you push the injection button.",
                    "description": "Insert the needle into the site you chose and then push the injection button so the medication is delivered under your skin. If you push on the button before the needle is inserted, you'll lose valuable medication."
                },
                {
                    "headline": "Hold the injection button down for 10 seconds once the counter reaches 0.",
                    "description": "Keep holding down the button until you see the dosing counter go down to 0. Then, continue to hold the button as you count for 10 seconds. This will ensure that the entire dose is delivered. Avoid holding the dosing button down at an angle since this can prevent the dosing counter from turning."
                },
                {
                    "headline": "Release your finger to pull the pen out and discard the needle.",
                    "description": "Once you've counted to ten, you can take your finger off of the injection button. Then, pull the needle out of your skin and put the outer needle cap on it. Push the cap on and turn the pen counterclockwise to remove the needle. Put the used needle in a sharps box or puncture-resistant container. If you don't have a sharps box, choose a container made of heavy-duty plastic that has a tight-fitting puncture-proof lid. Label your container so others know there's hazardous waste inside."
                },
                {
                    "headline": "Put the pen cap on and store it at room temperature for up to 28 days.",
                    "description": "You don't need to put the pen into the refrigerator after you've used it. Instead, put the cap on and keep it at room temperature that's below 77 °F (25 °C). You can continue to use the pen until the medication is gone, but plan on discarding the pen once it's been open for 28 days. Never share your Soliqua pen with anyone else, even if you've changed needles. Sharing insulin pens can spread serious infections."
                }
            ]
        },
        {
            "name": "Taking Soliqua 100\\/33 Safely",
            "steps": [
                {
                    "headline": "Store unused pens in the refrigerator.",
                    "description": "Keep the pens in their original packaging and refrigerate them between 36 and 46 °F (2 and 8 °C). You can keep them in the fridge until their expiration date. If the pens expire, you'll need to throw them away. Don't keep the pens in the freezer since it's too cold for the medication. If you accidentally freeze the Soliqua pen, throw it away."
                },
                {
                    "headline": "Plan to use the pen 1 hour before the first meal of the day.",
                    "description": "Since Soliqua is a once-daily medication, you won't need to take it again later in the day. It is important to inject Soliqua 1 hour before your first meal so insulin can begin to release before you eat.Did You Know? If you miss a dose, skip the missed dose and take the next dose at your usual time. You should never give yourself 2 doses at once."
                },
                {
                    "headline": "Avoid drinking alcohol.",
                    "description": "Drinking alcohol while you're using Soliqua can cause low blood sugar and complicate your diabetes treatment. If you do plan on drinking occasionally, talk with your doctor so they can adjust your Soliqua dose. If you do plan on drinking alcohol, you'll need to monitor your blood sugar more frequently."
                },
                {
                    "headline": "Watch for nausea, diarrhea, and other side effects.",
                    "description": "The lixisenatide in Soliqua can cause a few side effects when you first start using it. Mild side effects from taking Soliqua also include low blood sugar, upper respiratory infection, stuffy or runny nose, and headache. Contact your doctor if your symptoms don't improve. You're more likely to experience nausea and diarrhea when you first start taking Soliqua."
                },
                {
                    "headline": "Stop taking Soliqua if you have severe stomach pain.",
                    "description": "Inflammation of the pancreas is a severe side effect of Soliqua, which can be fatal. Stop taking Soliqua and contact your doctor immediately if you notice severe pain in your abdomen that doesn't go away. You might feel the pain in your back as well. You might also experience vomiting if your pancreas is inflamed."
                },
                {
                    "headline": "Avoid taking Soliqua if you have low blood sugar or are allergic to any ingredients in Soliqua.",
                    "description": "If you've tested your blood and see that you currently have low blood sugar, don't use your Soliqua pen. You should also avoid Soliqua if you're allergic to insulin glargine or lixisenatide.Did You Know? Signs of diabetic hypoglycemia include shakiness, dizziness, sweating, hunger. irritability, anxiety, or headache. If you're not sure if you're allergic to something in Soliqua, watch for facial swelling, dizziness, difficulty breathing or swallowing, rapid heartbeat, severe rash or itching, or a drop in blood pressure, all of which are signs of an allergy."
                }
            ]
        }
    ],
    "tyn": [
        "Soliqua 100/33 pen",
        "1 new sterile needle",
        "1 alcohol swab",
        "1 sharps container to dispose of the needle"
    ],
    "text": " Setting Up the Soliqua Pen Talk with your doctor about your prescription. Before you use your pen for the first time, ask your doctor about your dose and how often you should take it. If you've never used an insulin pen before, the doctor should walk you through how to use it. Ask your doctor questions so you feel comfortable with the pen. You can also ask your doctor to explain why they're prescribing Soliqua for you. Wash your hands or use an alcohol-based hand sanitizer. Spend at least 20 seconds washing your hands with soap and water. Then, dry them on a clean cloth. If you don't have access to a sink, squirt an alcohol-based hand sanitizer in your palm and rub your hands thoroughly until they feel dry. Practice good hygiene when you inject Soliqua to prevent infection. Check the pen and remove the cap. Look at the pen and ensure that you have the Soliqua 100/33 pen. Read the expiration date and determine if the medication is still good. If it's the correct medication, take off the cap and look at the medication. It should look completely clear.Tip: If you're using a new pen that was stored in the refrigerator, let it sit out at room temperature for at least 1 hour before you inject the medication. Although you can inject cold medication, it will feel uncomfortable. If you see small particles in the medication, return the pen to the pharmacy for a new pen. Wipe the rubber seal with an alcohol swab and attach a new needle. Open a small alcohol swab and rub it over the rubber seal that's at the end of the Soliqua pen. Then, peel back the protective tab from the needle container and push the pen onto the needle. Turn it clockwise so the needle is tightly fitted onto the pen. Always use a new needle every time you use the pen. Check the Soliqua pen to ensure it's working correctly. Turn the dosing knob to 2 units and hold the pen so the needle points up. Push the injection button all the way. You should see a few drops or a stream of the medication come out of the needle. If you don't see any medication at the tip of the needle, check the pen again. If no medication comes out after 2 to 3 more tries, change the needle and check the pen again. Turn the dial at the end of the pen to select your prescribed dose. Once your needle is attached and the pen is working properly, ensure that the dial is set at \"0.\" Then, turn the dial until the dose pointer lines up with the number dose that you've been prescribed. For example, if you're prescribed 15 units, turn the dial until the pointer line points to 15. Performing the Injection Choose an injection site. Locate a site around your stomach or abdomen that's at least 2 inches (5.1 cm) away from your belly button. If you prefer, you could inject the medication in your thighs as long as it's away from your knees. You can also inject into the fatty tissue at the outer back area of your upper arms.Tip: Don't use the same injection site every day. It's important to rotate sites so tissue doesn't build up on the site and block the medication. Push the pen needle into your skin before you push the injection button. Insert the needle into the site you chose and then push the injection button so the medication is delivered under your skin. If you push on the button before the needle is inserted, you'll lose valuable medication. Hold the injection button down for 10 seconds once the counter reaches 0. Keep holding down the button until you see the dosing counter go down to 0. Then, continue to hold the button as you count for 10 seconds. This will ensure that the entire dose is delivered. Avoid holding the dosing button down at an angle since this can prevent the dosing counter from turning. Release your finger to pull the pen out and discard the needle. Once you've counted to ten, you can take your finger off of the injection button. Then, pull the needle out of your skin and put the outer needle cap on it. Push the cap on and turn the pen counterclockwise to remove the needle. Put the used needle in a sharps box or puncture-resistant container. If you don't have a sharps box, choose a container made of heavy-duty plastic that has a tight-fitting puncture-proof lid. Label your container so others know there's hazardous waste inside. Put the pen cap on and store it at room temperature for up to 28 days. You don't need to put the pen into the refrigerator after you've used it. Instead, put the cap on and keep it at room temperature that's below 77 °F (25 °C). You can continue to use the pen until the medication is gone, but plan on discarding the pen once it's been open for 28 days. Never share your Soliqua pen with anyone else, even if you've changed needles. Sharing insulin pens can spread serious infections. Taking Soliqua 100\\/33 Safely Store unused pens in the refrigerator. Keep the pens in their original packaging and refrigerate them between 36 and 46 °F (2 and 8 °C). You can keep them in the fridge until their expiration date. If the pens expire, you'll need to throw them away. Don't keep the pens in the freezer since it's too cold for the medication. If you accidentally freeze the Soliqua pen, throw it away. Plan to use the pen 1 hour before the first meal of the day. Since Soliqua is a once-daily medication, you won't need to take it again later in the day. It is important to inject Soliqua 1 hour before your first meal so insulin can begin to release before you eat.Did You Know? If you miss a dose, skip the missed dose and take the next dose at your usual time. You should never give yourself 2 doses at once. Avoid drinking alcohol. Drinking alcohol while you're using Soliqua can cause low blood sugar and complicate your diabetes treatment. If you do plan on drinking occasionally, talk with your doctor so they can adjust your Soliqua dose. If you do plan on drinking alcohol, you'll need to monitor your blood sugar more frequently. Watch for nausea, diarrhea, and other side effects. The lixisenatide in Soliqua can cause a few side effects when you first start using it. Mild side effects from taking Soliqua also include low blood sugar, upper respiratory infection, stuffy or runny nose, and headache. Contact your doctor if your symptoms don't improve. You're more likely to experience nausea and diarrhea when you first start taking Soliqua. Stop taking Soliqua if you have severe stomach pain. Inflammation of the pancreas is a severe side effect of Soliqua, which can be fatal. Stop taking Soliqua and contact your doctor immediately if you notice severe pain in your abdomen that doesn't go away. You might feel the pain in your back as well. You might also experience vomiting if your pancreas is inflamed. Avoid taking Soliqua if you have low blood sugar or are allergic to any ingredients in Soliqua. If you've tested your blood and see that you currently have low blood sugar, don't use your Soliqua pen. You should also avoid Soliqua if you're allergic to insulin glargine or lixisenatide.Did You Know? Signs of diabetic hypoglycemia include shakiness, dizziness, sweating, hunger. irritability, anxiety, or headache. If you're not sure if you're allergic to something in Soliqua, watch for facial swelling, dizziness, difficulty breathing or swallowing, rapid heartbeat, severe rash or itching, or a drop in blood pressure, all of which are signs of an allergy.",
    "sentences": [
        " Setting Up the Soliqua Pen Talk with your doctor about your prescription.",
        "Before you use your pen for the first time, ask your doctor about your dose and how often you should take it.",
        "If you've never used an insulin pen before, the doctor should walk you through how to use it.",
        "Ask your doctor questions so you feel comfortable with the pen.",
        "You can also ask your doctor to explain why they're prescribing Soliqua for you.",
        "Wash your hands or use an alcohol-based hand sanitizer.",
        "Spend at least 20 seconds washing your hands with soap and water.",
        "Then, dry them on a clean cloth.",
        "If you don't have access to a sink, squirt an alcohol-based hand sanitizer in your palm and rub your hands thoroughly until they feel dry.",
        "Practice good hygiene when you inject Soliqua to prevent infection.",
        "Check the pen and remove the cap.",
        "Look at the pen and ensure that you have the Soliqua 100/33 pen.",
        "Read the expiration date and determine if the medication is still good.",
        "If it's the correct medication, take off the cap and look at the medication.",
        "It should look completely clear.Tip: If you're using a new pen that was stored in the refrigerator, let it sit out at room temperature for at least 1 hour before you inject the medication.",
        "Although you can inject cold medication, it will feel uncomfortable.",
        "If you see small particles in the medication, return the pen to the pharmacy for a new pen.",
        "Wipe the rubber seal with an alcohol swab and attach a new needle.",
        "Open a small alcohol swab and rub it over the rubber seal that's at the end of the Soliqua pen.",
        "Then, peel back the protective tab from the needle container and push the pen onto the needle.",
        "Turn it clockwise so the needle is tightly fitted onto the pen.",
        "Always use a new needle every time you use the pen.",
        "Check the Soliqua pen to ensure it's working correctly.",
        "Turn the dosing knob to 2 units and hold the pen so the needle points up.",
        "Push the injection button all the way.",
        "You should see a few drops or a stream of the medication come out of the needle.",
        "If you don't see any medication at the tip of the needle, check the pen again.",
        "If no medication comes out after 2 to 3 more tries, change the needle and check the pen again.",
        "Turn the dial at the end of the pen to select your prescribed dose.",
        "Once your needle is attached and the pen is working properly, ensure that the dial is set at \"0.\"",
        "Then, turn the dial until the dose pointer lines up with the number dose that you've been prescribed.",
        "For example, if you're prescribed 15 units, turn the dial until the pointer line points to 15.",
        "Performing the Injection Choose an injection site.",
        "Locate a site around your stomach or abdomen that's at least 2 inches (5.1 cm) away from your belly button.",
        "If you prefer, you could inject the medication in your thighs as long as it's away from your knees.",
        "You can also inject into the fatty tissue at the outer back area of your upper arms.Tip: Don't use the same injection site every day.",
        "It's important to rotate sites so tissue doesn't build up on the site and block the medication.",
        "Push the pen needle into your skin before you push the injection button.",
        "Insert the needle into the site you chose and then push the injection button so the medication is delivered under your skin.",
        "If you push on the button before the needle is inserted, you'll lose valuable medication.",
        "Hold the injection button down for 10 seconds once the counter reaches 0.",
        "Keep holding down the button until you see the dosing counter go down to 0.",
        "Then, continue to hold the button as you count for 10 seconds.",
        "This will ensure that the entire dose is delivered.",
        "Avoid holding the dosing button down at an angle since this can prevent the dosing counter from turning.",
        "Release your finger to pull the pen out and discard the needle.",
        "Once you've counted to ten, you can take your finger off of the injection button.",
        "Then, pull the needle out of your skin and put the outer needle cap on it.",
        "Push the cap on and turn the pen counterclockwise to remove the needle.",
        "Put the used needle in a sharps box or puncture-resistant container.",
        "If you don't have a sharps box, choose a container made of heavy-duty plastic that has a tight-fitting puncture-proof lid.",
        "Label your container so others know there's hazardous waste inside.",
        "Put the pen cap on and store it at room temperature for up to 28 days.",
        "You don't need to put the pen into the refrigerator after you've used it.",
        "Instead, put the cap on and keep it at room temperature that's below 77 °F (25 °C).",
        "You can continue to use the pen until the medication is gone, but plan on discarding the pen once it's been open for 28 days.",
        "Never share your Soliqua pen with anyone else, even if you've changed needles.",
        "Sharing insulin pens can spread serious infections.",
        "Taking Soliqua 100\\/33 Safely Store unused pens in the refrigerator.",
        "Keep the pens in their original packaging and refrigerate them between 36 and 46 °F (2 and 8 °C).",
        "You can keep them in the fridge until their expiration date.",
        "If the pens expire, you'll need to throw them away.",
        "Don't keep the pens in the freezer since it's too cold for the medication.",
        "If you accidentally freeze the Soliqua pen, throw it away.",
        "Plan to use the pen 1 hour before the first meal of the day.",
        "Since Soliqua is a once-daily medication, you won't need to take it again later in the day.",
        "It is important to inject Soliqua 1 hour before your first meal so insulin can begin to release before you eat.Did You Know?",
        "If you miss a dose, skip the missed dose and take the next dose at your usual time.",
        "You should never give yourself 2 doses at once.",
        "Avoid drinking alcohol.",
        "Drinking alcohol while you're using Soliqua can cause low blood sugar and complicate your diabetes treatment.",
        "If you do plan on drinking occasionally, talk with your doctor so they can adjust your Soliqua dose.",
        "If you do plan on drinking alcohol, you'll need to monitor your blood sugar more frequently.",
        "Watch for nausea, diarrhea, and other side effects.",
        "The lixisenatide in Soliqua can cause a few side effects when you first start using it.",
        "Mild side effects from taking Soliqua also include low blood sugar, upper respiratory infection, stuffy or runny nose, and headache.",
        "Contact your doctor if your symptoms don't improve.",
        "You're more likely to experience nausea and diarrhea when you first start taking Soliqua.",
        "Stop taking Soliqua if you have severe stomach pain.",
        "Inflammation of the pancreas is a severe side effect of Soliqua, which can be fatal.",
        "Stop taking Soliqua and contact your doctor immediately if you notice severe pain in your abdomen that doesn't go away.",
        "You might feel the pain in your back as well.",
        "You might also experience vomiting if your pancreas is inflamed.",
        "Avoid taking Soliqua if you have low blood sugar or are allergic to any ingredients in Soliqua.",
        "If you've tested your blood and see that you currently have low blood sugar, don't use your Soliqua pen.",
        "You should also avoid Soliqua if you're allergic to insulin glargine or lixisenatide.Did You Know?",
        "Signs of diabetic hypoglycemia include shakiness, dizziness, sweating, hunger.",
        "irritability, anxiety, or headache.",
        "If you're not sure if you're allergic to something in Soliqua, watch for facial swelling, dizziness, difficulty breathing or swallowing, rapid heartbeat, severe rash or itching, or a drop in blood pressure, all of which are signs of an allergy."
    ]
}