{
    "title": "How to Clean a Herschel Backpack",
    "url": "https://www.wikihow.com/Clean-a-Herschel-Backpack",
    "category_hierarchy": [
        "Personal Care and Style",
        "Bags"
    ],
    "methods": [
        {
            "name": "Treating Small Spots",
            "steps": [
                {
                    "headline": "Check that you’ve removed everything from the backpack.",
                    "description": "Take out everything from your bag, whether it’s school supplies or personal items. When you’re cleaning your bag, you don’t want any of the spot treatment to soak through the material into any of your things. Additionally, you want the freedom to flip and turn your bag around as you please during the cleaning process. For easy access later, place all of your items in a different bag. Additionally, you can just stack them in a corner until you’re done cleaning your backpack."
                },
                {
                    "headline": "Remove grimy spots by brushing over them with a makeup brush.",
                    "description": "Swipe off patches of grime and crumbs by dabbing at them with a soft makeup brush. Use gentle strokes as you’re coaxing off dirt. During this process, don’t use anything with tough bristles, as this could damage the bag’s material. If there’s a lot of dirt on your bag, try brushing it off outside or over a trash can. If you don’t have an extra makeup brush on hand, try using a paintbrush instead."
                },
                {
                    "headline": "Rub some mild soap on a stained area.",
                    "description": "Pour a pea-sized amount of delicate soap onto a light-colored sponge or cloth. Dab at the area, making sure that the stain or spot in question is saturated with cleaning product. Scrub into the backpack if the stain is especially bad. If you don’t plan on washing the bag any further, let the backpack air-dry for several hours until it’s no longer damp. Look for soaps with “gentle” or “sensitive” on the label. As a general rule of thumb, don’t use any standard or harsh laundry detergents to directly treat stains. Use a light-colored sponge or cloth to prevent any foreign dye from transferring to the bag. You can also use a soft-bristled brush for this, like a toothbrush."
                },
                {
                    "headline": "Let the soap sit for around 30 minutes if you’re planning on washing the bag.",
                    "description": "Set the backpack in a clean, well-ventilated area and let the soap soak into the material. Wait at least 30 minutes before you start hand washing the entire bag. If you don’t plan on cleaning the bag, let the backpack air-dry for several hours, or until it’s no longer damp to the touch. If you spot cleaned an area on the inside of the bag, make sure that the backpack is open while the soap is soaking in."
                }
            ]
        },
        {
            "name": "Handwashing the Bag",
            "steps": [
                {
                    "headline": "Take everything out of the bag before cleaning it.",
                    "description": "Dump out everything from the bag and set it aside for later. If your bag has pockets on the exterior or interior, be sure to check those areas for any loose items. Once you’ve removed anything loose from the bag, set all of the objects aside so you can place them back into the bag later. Since you’ll be soaking the bag, make sure that there are no electronics or other delicate items still in the backpack when you go to wash it."
                },
                {
                    "headline": "Remove any dirt and crumbs with a portable vacuum.",
                    "description": "Take a small, handheld vacuum and use it to suck out any major crumbs or specks of dust from the interior of your bag. Use the appliance on a low setting, and focus on vacuuming any dirt and debris from the bottom seams of the bag. Don’t worry if you miss a bit of dirt or dust—the vacuuming just makes the cleaning process as thorough as possible."
                },
                {
                    "headline": "Set the bag in a basin of warm water.",
                    "description": "Pour water into a bin or basin so that it’s mostly full. When choosing a basin or bin, make sure that you’re selecting something that can soak your backpack without overflowing. If you‘re using an especially large basin or tub, fill it up about 6 inches (15 cm) of the way with water. Don’t use hot or boiling water, as this can tamper with the color of your bag."
                },
                {
                    "headline": "Wash the backpack gently with mild soap.",
                    "description": "Use a rag or gentle brush to scrub a coin-sized amount of delicate soap into the exterior and interior of your bag. If the spot treatment didn’t work in removing packed on stains or messes, use a toothbrush to chip away at the affected areas. If you’re looking to wipe down your bag instead of scrubbing it, opt for a sponge instead. When cleaning the inside of the bag, it sometimes helps to turn the backpack inside out."
                },
                {
                    "headline": "Rinse the bag with cool water.",
                    "description": "Dump out any of the grimy water from the basin and refill it with clean, cool water. In lieu of holding the bag under the faucet, drench the backpack in the basin instead, soaking it completely. Make sure that the whole bag is submerged before you take it out of the water. Remove any excess dripping water by wringing the bag out over the basin. Dump out the water from the basin once you’re done rinsing the bag."
                },
                {
                    "headline": "Blot the backpack with a towel and let it air-dry.",
                    "description": "Wrap the bag in a fluffy towel to soak up any leftover water before setting it aside. If you can, set the backpack up outside or in an area with a lot of open air flow. Give it a day or 2 to dry, and check periodically to see if the material is damp or not. Make sure that all pockets and zippers are open when you’re hanging your bag up to air-dry. Try to avoid drying your bag in direct sunlight so the color doesn’t fade."
                }
            ]
        }
    ],
    "tyn": [
        "Treating Small Spots",
        "Makeup brush",
        "Mild soap",
        "Sponge",
        "Cloth (optional)",
        "Handwashing the Bag",
        "Handheld vacuum",
        "Large basin",
        "Water",
        "Rag",
        "Sponge (optional)",
        "Toothbrush (optional)",
        "Towel"
    ],
    "text": " Treating Small Spots Check that you’ve removed everything from the backpack. Take out everything from your bag, whether it’s school supplies or personal items. When you’re cleaning your bag, you don’t want any of the spot treatment to soak through the material into any of your things. Additionally, you want the freedom to flip and turn your bag around as you please during the cleaning process. For easy access later, place all of your items in a different bag. Additionally, you can just stack them in a corner until you’re done cleaning your backpack. Remove grimy spots by brushing over them with a makeup brush. Swipe off patches of grime and crumbs by dabbing at them with a soft makeup brush. Use gentle strokes as you’re coaxing off dirt. During this process, don’t use anything with tough bristles, as this could damage the bag’s material. If there’s a lot of dirt on your bag, try brushing it off outside or over a trash can. If you don’t have an extra makeup brush on hand, try using a paintbrush instead. Rub some mild soap on a stained area. Pour a pea-sized amount of delicate soap onto a light-colored sponge or cloth. Dab at the area, making sure that the stain or spot in question is saturated with cleaning product. Scrub into the backpack if the stain is especially bad. If you don’t plan on washing the bag any further, let the backpack air-dry for several hours until it’s no longer damp. Look for soaps with “gentle” or “sensitive” on the label. As a general rule of thumb, don’t use any standard or harsh laundry detergents to directly treat stains. Use a light-colored sponge or cloth to prevent any foreign dye from transferring to the bag. You can also use a soft-bristled brush for this, like a toothbrush. Let the soap sit for around 30 minutes if you’re planning on washing the bag. Set the backpack in a clean, well-ventilated area and let the soap soak into the material. Wait at least 30 minutes before you start hand washing the entire bag. If you don’t plan on cleaning the bag, let the backpack air-dry for several hours, or until it’s no longer damp to the touch. If you spot cleaned an area on the inside of the bag, make sure that the backpack is open while the soap is soaking in. Handwashing the Bag Take everything out of the bag before cleaning it. Dump out everything from the bag and set it aside for later. If your bag has pockets on the exterior or interior, be sure to check those areas for any loose items. Once you’ve removed anything loose from the bag, set all of the objects aside so you can place them back into the bag later. Since you’ll be soaking the bag, make sure that there are no electronics or other delicate items still in the backpack when you go to wash it. Remove any dirt and crumbs with a portable vacuum. Take a small, handheld vacuum and use it to suck out any major crumbs or specks of dust from the interior of your bag. Use the appliance on a low setting, and focus on vacuuming any dirt and debris from the bottom seams of the bag. Don’t worry if you miss a bit of dirt or dust—the vacuuming just makes the cleaning process as thorough as possible. Set the bag in a basin of warm water. Pour water into a bin or basin so that it’s mostly full. When choosing a basin or bin, make sure that you’re selecting something that can soak your backpack without overflowing. If you‘re using an especially large basin or tub, fill it up about 6 inches (15 cm) of the way with water. Don’t use hot or boiling water, as this can tamper with the color of your bag. Wash the backpack gently with mild soap. Use a rag or gentle brush to scrub a coin-sized amount of delicate soap into the exterior and interior of your bag. If the spot treatment didn’t work in removing packed on stains or messes, use a toothbrush to chip away at the affected areas. If you’re looking to wipe down your bag instead of scrubbing it, opt for a sponge instead. When cleaning the inside of the bag, it sometimes helps to turn the backpack inside out. Rinse the bag with cool water. Dump out any of the grimy water from the basin and refill it with clean, cool water. In lieu of holding the bag under the faucet, drench the backpack in the basin instead, soaking it completely. Make sure that the whole bag is submerged before you take it out of the water. Remove any excess dripping water by wringing the bag out over the basin. Dump out the water from the basin once you’re done rinsing the bag. Blot the backpack with a towel and let it air-dry. Wrap the bag in a fluffy towel to soak up any leftover water before setting it aside. If you can, set the backpack up outside or in an area with a lot of open air flow. Give it a day or 2 to dry, and check periodically to see if the material is damp or not. Make sure that all pockets and zippers are open when you’re hanging your bag up to air-dry. Try to avoid drying your bag in direct sunlight so the color doesn’t fade.",
    "sentences": [
        " Treating Small Spots Check that you’ve removed everything from the backpack.",
        "Take out everything from your bag, whether it’s school supplies or personal items.",
        "When you’re cleaning your bag, you don’t want any of the spot treatment to soak through the material into any of your things.",
        "Additionally, you want the freedom to flip and turn your bag around as you please during the cleaning process.",
        "For easy access later, place all of your items in a different bag.",
        "Additionally, you can just stack them in a corner until you’re done cleaning your backpack.",
        "Remove grimy spots by brushing over them with a makeup brush.",
        "Swipe off patches of grime and crumbs by dabbing at them with a soft makeup brush.",
        "Use gentle strokes as you’re coaxing off dirt.",
        "During this process, don’t use anything with tough bristles, as this could damage the bag’s material.",
        "If there’s a lot of dirt on your bag, try brushing it off outside or over a trash can.",
        "If you don’t have an extra makeup brush on hand, try using a paintbrush instead.",
        "Rub some mild soap on a stained area.",
        "Pour a pea-sized amount of delicate soap onto a light-colored sponge or cloth.",
        "Dab at the area, making sure that the stain or spot in question is saturated with cleaning product.",
        "Scrub into the backpack if the stain is especially bad.",
        "If you don’t plan on washing the bag any further, let the backpack air-dry for several hours until it’s no longer damp.",
        "Look for soaps with “gentle” or “sensitive” on the label.",
        "As a general rule of thumb, don’t use any standard or harsh laundry detergents to directly treat stains.",
        "Use a light-colored sponge or cloth to prevent any foreign dye from transferring to the bag.",
        "You can also use a soft-bristled brush for this, like a toothbrush.",
        "Let the soap sit for around 30 minutes if you’re planning on washing the bag.",
        "Set the backpack in a clean, well-ventilated area and let the soap soak into the material.",
        "Wait at least 30 minutes before you start hand washing the entire bag.",
        "If you don’t plan on cleaning the bag, let the backpack air-dry for several hours, or until it’s no longer damp to the touch.",
        "If you spot cleaned an area on the inside of the bag, make sure that the backpack is open while the soap is soaking in.",
        "Handwashing the Bag Take everything out of the bag before cleaning it.",
        "Dump out everything from the bag and set it aside for later.",
        "If your bag has pockets on the exterior or interior, be sure to check those areas for any loose items.",
        "Once you’ve removed anything loose from the bag, set all of the objects aside so you can place them back into the bag later.",
        "Since you’ll be soaking the bag, make sure that there are no electronics or other delicate items still in the backpack when you go to wash it.",
        "Remove any dirt and crumbs with a portable vacuum.",
        "Take a small, handheld vacuum and use it to suck out any major crumbs or specks of dust from the interior of your bag.",
        "Use the appliance on a low setting, and focus on vacuuming any dirt and debris from the bottom seams of the bag.",
        "Don’t worry if you miss a bit of dirt or dust—the vacuuming just makes the cleaning process as thorough as possible.",
        "Set the bag in a basin of warm water.",
        "Pour water into a bin or basin so that it’s mostly full.",
        "When choosing a basin or bin, make sure that you’re selecting something that can soak your backpack without overflowing.",
        "If you‘re using an especially large basin or tub, fill it up about 6 inches (15 cm) of the way with water.",
        "Don’t use hot or boiling water, as this can tamper with the color of your bag.",
        "Wash the backpack gently with mild soap.",
        "Use a rag or gentle brush to scrub a coin-sized amount of delicate soap into the exterior and interior of your bag.",
        "If the spot treatment didn’t work in removing packed on stains or messes, use a toothbrush to chip away at the affected areas.",
        "If you’re looking to wipe down your bag instead of scrubbing it, opt for a sponge instead.",
        "When cleaning the inside of the bag, it sometimes helps to turn the backpack inside out.",
        "Rinse the bag with cool water.",
        "Dump out any of the grimy water from the basin and refill it with clean, cool water.",
        "In lieu of holding the bag under the faucet, drench the backpack in the basin instead, soaking it completely.",
        "Make sure that the whole bag is submerged before you take it out of the water.",
        "Remove any excess dripping water by wringing the bag out over the basin.",
        "Dump out the water from the basin once you’re done rinsing the bag.",
        "Blot the backpack with a towel and let it air-dry.",
        "Wrap the bag in a fluffy towel to soak up any leftover water before setting it aside.",
        "If you can, set the backpack up outside or in an area with a lot of open air flow.",
        "Give it a day or 2 to dry, and check periodically to see if the material is damp or not.",
        "Make sure that all pockets and zippers are open when you’re hanging your bag up to air-dry.",
        "Try to avoid drying your bag in direct sunlight so the color doesn’t fade."
    ]
}