{
    "title": "How to Fix a Google Drive Server Error",
    "url": "https://www.wikihow.com/Fix-a-Google-Drive-Server-Error",
    "category_hierarchy": [
        "Computers and Electronics",
        "Internet",
        "Website Application Instructions",
        "Google Applications",
        "Google Drive"
    ],
    "methods": [
        {
            "name": "Clearing Up the Cookies and Cache Memory",
            "steps": [
                {
                    "headline": "Launch your Google Chrome browser.",
                    "description": "Find the icon on your desktop menu and double-click on it to launch it."
                },
                {
                    "headline": "Expand the Toolbar section.",
                    "description": "On the top-right of the browser home screen, click the 3-dot icon to bring up the dropdown list of options."
                },
                {
                    "headline": "Find the 'More Tools' section.",
                    "description": "On the 3-dot icon, look for the Toolbar option and hover the cursor over it. As you do that, another dropdown list will appear and look for the 'More Tools' option in it. Click on that to open that particular window."
                },
                {
                    "headline": "Select the Clear Browsing Data option.",
                    "description": "In that window, look for the 'Clear Browsing Data' option to do as the name says. As you do that, you are going to come across the different sections of memory. Look for the Cache option. This is to clear the cached images and other files. There is also a Cookies option to clear all the cookies that have been stored."
                },
                {
                    "headline": "Click on the Clear Browsing Data button.",
                    "description": "Now that you have made all the necessary selections from the list, it is time to clear all that data. To do that, click on the Clear Browsing Data button, and that will start the process of deleting. Wait as that completes, and then click off. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a7\\/Click-Clear-Browsing-Data-button.png\\/460px-Click-Clear-Browsing-Data-button.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a7\\/Click-Clear-Browsing-Data-button.png\\/760px-Click-Clear-Browsing-Data-button.png\",\"smallWidth\":460,\"smallHeight\":336,\"bigWidth\":760,\"bigHeight\":555.3846153846154,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"}"
                },
                {
                    "headline": "Check if the problem is solved.",
                    "description": "If this hasn't worked, scroll down for more ideas."
                }
            ]
        },
        {
            "name": "Using Google Drive from the Incognito Window",
            "steps": [
                {
                    "headline": "Open Google Drive from Incognito mode.",
                    "description": "If the previous steps haven't worked, using Incognito mode can help by bypassing the cookies. Open Google Chrome. Double-click on the Google Chrome icon from the desktop of your home screen."
                },
                {
                    "headline": "Click on the 3-dot icon.",
                    "description": "To the top-right corner of the browser home screen, click on the 3-dot icon. There, you'll find a dropdown list of options."
                },
                {
                    "headline": "Launch the Incognito window.",
                    "description": "Find the New Incognito window option from the dropdown menu. This will be the third one down. The Incognito window will come up with a grey backdrop and the spy logo. This will prevent the browser from storing cookies from different websites. Now you are good to go ahead and start using your Google Drive account."
                }
            ]
        },
        {
            "name": "Looking through your Firewall & Proxy Settings",
            "steps": [
                {
                    "headline": "Close all the Chrome windows.",
                    "description": "You will need to close all the windows of the browser that you have opened. Go through all of those and close each."
                },
                {
                    "headline": "Run Chrome as administrator.",
                    "description": "Click on the Start icon. On the home screen of your Windows PC, find the Start icon in the corner. Look for the All Apps option from the list of results that come up, and click on that. Find the Google Chrome option in the window that comes up. Right-click on it to open the drop-down menu. There you are going to find the Run as administrator option to click on. In some cases, you are going to find this option under the More option."
                },
                {
                    "headline": "Open the Menu option.",
                    "description": "Look for the menu option in the window that you are in and click it as you find it. Then in the following section, look for the Settings option to launch the settings section."
                },
                {
                    "headline": "Go to Proxy Settings.",
                    "description": "Go to the section for the proxy settings. This will be under the System section. When you are in that section, look for the Open proxy settings option and click on it."
                },
                {
                    "headline": "Check for issues in the settings.",
                    "description": "To start looking for any issues in the settings, click on the Automatically detect settings option. Click on all the checkboxes around before you select the option above."
                },
                {
                    "headline": "Finish by clicking OK. To complete the process, click on the 'OK' button to the bottom-right of the window.",
                    "description": "Then do the same thing in the next window as well, as you complete the process."
                }
            ]
        }
    ],
    "tyn": [
        "Google Chrome (Latest update)",
        "Google Account"
    ],
    "text": " Clearing Up the Cookies and Cache Memory Launch your Google Chrome browser. Find the icon on your desktop menu and double-click on it to launch it. Expand the Toolbar section. On the top-right of the browser home screen, click the 3-dot icon to bring up the dropdown list of options. Find the 'More Tools' section. On the 3-dot icon, look for the Toolbar option and hover the cursor over it. As you do that, another dropdown list will appear and look for the 'More Tools' option in it. Click on that to open that particular window. Select the Clear Browsing Data option. In that window, look for the 'Clear Browsing Data' option to do as the name says. As you do that, you are going to come across the different sections of memory. Look for the Cache option. This is to clear the cached images and other files. There is also a Cookies option to clear all the cookies that have been stored. Click on the Clear Browsing Data button. Now that you have made all the necessary selections from the list, it is time to clear all that data. To do that, click on the Clear Browsing Data button, and that will start the process of deleting. Wait as that completes, and then click off. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a7\\/Click-Clear-Browsing-Data-button.png\\/460px-Click-Clear-Browsing-Data-button.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a7\\/Click-Clear-Browsing-Data-button.png\\/760px-Click-Clear-Browsing-Data-button.png\",\"smallWidth\":460,\"smallHeight\":336,\"bigWidth\":760,\"bigHeight\":555.3846153846154,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"} Check if the problem is solved. If this hasn't worked, scroll down for more ideas. Using Google Drive from the Incognito Window Open Google Drive from Incognito mode. If the previous steps haven't worked, using Incognito mode can help by bypassing the cookies. Open Google Chrome. Double-click on the Google Chrome icon from the desktop of your home screen. Click on the 3-dot icon. To the top-right corner of the browser home screen, click on the 3-dot icon. There, you'll find a dropdown list of options. Launch the Incognito window. Find the New Incognito window option from the dropdown menu. This will be the third one down. The Incognito window will come up with a grey backdrop and the spy logo. This will prevent the browser from storing cookies from different websites. Now you are good to go ahead and start using your Google Drive account. Looking through your Firewall & Proxy Settings Close all the Chrome windows. You will need to close all the windows of the browser that you have opened. Go through all of those and close each. Run Chrome as administrator. Click on the Start icon. On the home screen of your Windows PC, find the Start icon in the corner. Look for the All Apps option from the list of results that come up, and click on that. Find the Google Chrome option in the window that comes up. Right-click on it to open the drop-down menu. There you are going to find the Run as administrator option to click on. In some cases, you are going to find this option under the More option. Open the Menu option. Look for the menu option in the window that you are in and click it as you find it. Then in the following section, look for the Settings option to launch the settings section. Go to Proxy Settings. Go to the section for the proxy settings. This will be under the System section. When you are in that section, look for the Open proxy settings option and click on it. Check for issues in the settings. To start looking for any issues in the settings, click on the Automatically detect settings option. Click on all the checkboxes around before you select the option above. Finish by clicking OK. To complete the process, click on the 'OK' button to the bottom-right of the window. Then do the same thing in the next window as well, as you complete the process.",
    "sentences": [
        " Clearing Up the Cookies and Cache Memory Launch your Google Chrome browser.",
        "Find the icon on your desktop menu and double-click on it to launch it.",
        "Expand the Toolbar section.",
        "On the top-right of the browser home screen, click the 3-dot icon to bring up the dropdown list of options.",
        "Find the 'More Tools' section.",
        "On the 3-dot icon, look for the Toolbar option and hover the cursor over it.",
        "As you do that, another dropdown list will appear and look for the 'More Tools' option in it.",
        "Click on that to open that particular window.",
        "Select the Clear Browsing Data option.",
        "In that window, look for the 'Clear Browsing Data' option to do as the name says.",
        "As you do that, you are going to come across the different sections of memory.",
        "Look for the Cache option.",
        "This is to clear the cached images and other files.",
        "There is also a Cookies option to clear all the cookies that have been stored.",
        "Click on the Clear Browsing Data button.",
        "Now that you have made all the necessary selections from the list, it is time to clear all that data.",
        "To do that, click on the Clear Browsing Data button, and that will start the process of deleting.",
        "Wait as that completes, and then click off.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a7\\/Click-Clear-Browsing-Data-button.png\\/460px-Click-Clear-Browsing-Data-button.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a7\\/Click-Clear-Browsing-Data-button.png\\/760px-Click-Clear-Browsing-Data-button.png\",\"smallWidth\":460,\"smallHeight\":336,\"bigWidth\":760,\"bigHeight\":555.3846153846154,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"} Check if the problem is solved.",
        "If this hasn't worked, scroll down for more ideas.",
        "Using Google Drive from the Incognito Window Open Google Drive from Incognito mode.",
        "If the previous steps haven't worked, using Incognito mode can help by bypassing the cookies.",
        "Open Google Chrome.",
        "Double-click on the Google Chrome icon from the desktop of your home screen.",
        "Click on the 3-dot icon.",
        "To the top-right corner of the browser home screen, click on the 3-dot icon.",
        "There, you'll find a dropdown list of options.",
        "Launch the Incognito window.",
        "Find the New Incognito window option from the dropdown menu.",
        "This will be the third one down.",
        "The Incognito window will come up with a grey backdrop and the spy logo.",
        "This will prevent the browser from storing cookies from different websites.",
        "Now you are good to go ahead and start using your Google Drive account.",
        "Looking through your Firewall & Proxy Settings Close all the Chrome windows.",
        "You will need to close all the windows of the browser that you have opened.",
        "Go through all of those and close each.",
        "Run Chrome as administrator.",
        "Click on the Start icon.",
        "On the home screen of your Windows PC, find the Start icon in the corner.",
        "Look for the All Apps option from the list of results that come up, and click on that.",
        "Find the Google Chrome option in the window that comes up.",
        "Right-click on it to open the drop-down menu.",
        "There you are going to find the Run as administrator option to click on.",
        "In some cases, you are going to find this option under the More option.",
        "Open the Menu option.",
        "Look for the menu option in the window that you are in and click it as you find it.",
        "Then in the following section, look for the Settings option to launch the settings section.",
        "Go to Proxy Settings.",
        "Go to the section for the proxy settings.",
        "This will be under the System section.",
        "When you are in that section, look for the Open proxy settings option and click on it.",
        "Check for issues in the settings.",
        "To start looking for any issues in the settings, click on the Automatically detect settings option.",
        "Click on all the checkboxes around before you select the option above.",
        "Finish by clicking OK. To complete the process, click on the 'OK' button to the bottom-right of the window.",
        "Then do the same thing in the next window as well, as you complete the process."
    ]
}