{
    "title": "How to Clean a Girl's Room",
    "url": "https://www.wikihow.com/Clean-a-Girl%27s-Room",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Bedrooms"
    ],
    "methods": [
        {
            "name": "The Bed",
            "steps": [
                {
                    "headline": "Remove everything off the bed.",
                    "description": "Take all pillows, cushions, stuffed animals, sheets, duvet and throws and take all the covers off of them, remove pillow cases, cushion cases, duvet sheets etc. Throw the sheets, cushion cases, etc. which you just took off from the bed into a washing basket. You can put them into a laundry bag if you prefer, throwing them into a washing basket won't make the room any cleaner. This step is really just about removing any items from your bed and stripping off all bed linen. If you have bad acne, change pillow cases every night."
                },
                {
                    "headline": "Find clean and fresh bedding.",
                    "description": "Put it on the duvet and pillows/cushions and put those aside."
                },
                {
                    "headline": "Make your bed (how you like it, but make it as neat as possible).",
                    "description": ""
                },
                {
                    "headline": "Put everything back on the bed.",
                    "description": ""
                },
                {
                    "headline": "Get a cloth and cleaning products suitable for use on your bed frame.",
                    "description": "Dust the frame and clean it thoroughly."
                }
            ]
        },
        {
            "name": "The Closet\\/Wardrobe",
            "steps": [
                {
                    "headline": "Completely empty your closet/wardrobe.",
                    "description": "Take out all clothes, underwear, feminine products etc."
                },
                {
                    "headline": "If you find any rubbish/trash, get a bin liner and throw all of it away.",
                    "description": ""
                },
                {
                    "headline": "Order and organize everything how you like it.",
                    "description": ""
                },
                {
                    "headline": "Put everything back in the closet/wardrobe.",
                    "description": ""
                }
            ]
        },
        {
            "name": "The Entertainment Center\\/Bookshelf",
            "steps": [
                {
                    "headline": "Remove and unplug everything.",
                    "description": ""
                },
                {
                    "headline": "Take all books off the bookshelf.",
                    "description": "Pile them up aside."
                },
                {
                    "headline": "Use suitable cleaning products.",
                    "description": "Clean, wipe and dust the shelves and entertainment centre."
                },
                {
                    "headline": "Organize.",
                    "description": "Organize everything how you want it. Put books in height order; smallest to tallest. Dust all books without using cleaning products, just a clean cloth (DRY)."
                },
                {
                    "headline": "Put everything back.",
                    "description": ""
                },
                {
                    "headline": "Plug everything back in.",
                    "description": "Do not get the sockets wet. Do not get water on anything electrical because it may damage the item."
                }
            ]
        },
        {
            "name": "The Walls",
            "steps": [
                {
                    "headline": "Remove everything from the walls.",
                    "description": ""
                },
                {
                    "headline": "Wipe down the walls carefully.",
                    "description": "Get rid of all cobwebs with a duster and just generally dust everything."
                },
                {
                    "headline": "Sort and organize everything you took down from the walls and throw away trash/rubbish and put back stuff you want on the wall.",
                    "description": ""
                }
            ]
        },
        {
            "name": "The Nightstand\\/Table",
            "steps": [
                {
                    "headline": "Remove everything from the nightstand/table.",
                    "description": ""
                },
                {
                    "headline": "Wipe down the nightstand/table.",
                    "description": ""
                },
                {
                    "headline": "Throw away trash/rubbish.",
                    "description": "and put the stuff you want on the nightstand/table."
                }
            ]
        },
        {
            "name": "The Floor",
            "steps": [
                {
                    "headline": "Throw out the garbage.",
                    "description": "Your poor floor has to be covered with junk by now, so get a big rubbish bag and throw all your trash/rubbish in it."
                },
                {
                    "headline": "Sort out everything into piles.",
                    "description": "One pile being named “dirty clothes” and another pile being named “scrap paper”, etc."
                },
                {
                    "headline": "Vacuum clean your floor, if you have a rug, vacuum that too.",
                    "description": ""
                },
                {
                    "headline": "Pick up stuff to go to charity or your own garage sale.",
                    "description": ""
                },
                {
                    "headline": "Put everything in the piles where they belong.",
                    "description": ""
                }
            ]
        },
        {
            "name": "The Windows",
            "steps": [
                {
                    "headline": "Remove everything from the windowsill and wipe it with suitable cleaning products.",
                    "description": ""
                },
                {
                    "headline": "Do the same to the windows and wipe away any spiders/dust/marks.",
                    "description": ""
                },
                {
                    "headline": "Put everything back on the window/sill.",
                    "description": ""
                },
                {
                    "headline": "Open the curtains/blinds.",
                    "description": "Dust those."
                }
            ]
        },
        {
            "name": "You Are Finished",
            "steps": [
                {
                    "headline": "Show it off to your family and friends.",
                    "description": ""
                },
                {
                    "headline": "Clean it once every few weeks.",
                    "description": "If it gets messy before that, just tidy it when it needs a clean."
                },
                {
                    "headline": "Do a very thorough clean up once every 2 or 3 months.",
                    "description": ""
                },
                {
                    "headline": "Relax.",
                    "description": "You worked hard."
                }
            ]
        }
    ],
    "tyn": [
        "Floor polish (only for uncarpeted floors)",
        "Freshener",
        "Sheets",
        "Warm blankets",
        "Decorative sheets",
        "Disinfectant wipes",
        "Trashcan",
        "Baskets"
    ],
    "text": " The Bed Remove everything off the bed. Take all pillows, cushions, stuffed animals, sheets, duvet and throws and take all the covers off of them, remove pillow cases, cushion cases, duvet sheets etc. Throw the sheets, cushion cases, etc. which you just took off from the bed into a washing basket. You can put them into a laundry bag if you prefer, throwing them into a washing basket won't make the room any cleaner. This step is really just about removing any items from your bed and stripping off all bed linen. If you have bad acne, change pillow cases every night. Find clean and fresh bedding. Put it on the duvet and pillows/cushions and put those aside. Make your bed (how you like it, but make it as neat as possible).  Put everything back on the bed.  Get a cloth and cleaning products suitable for use on your bed frame. Dust the frame and clean it thoroughly. The Closet\\/Wardrobe Completely empty your closet/wardrobe. Take out all clothes, underwear, feminine products etc. If you find any rubbish/trash, get a bin liner and throw all of it away.  Order and organize everything how you like it.  Put everything back in the closet/wardrobe.  The Entertainment Center\\/Bookshelf Remove and unplug everything.  Take all books off the bookshelf. Pile them up aside. Use suitable cleaning products. Clean, wipe and dust the shelves and entertainment centre. Organize. Organize everything how you want it. Put books in height order; smallest to tallest. Dust all books without using cleaning products, just a clean cloth (DRY). Put everything back.  Plug everything back in. Do not get the sockets wet. Do not get water on anything electrical because it may damage the item. The Walls Remove everything from the walls.  Wipe down the walls carefully. Get rid of all cobwebs with a duster and just generally dust everything. Sort and organize everything you took down from the walls and throw away trash/rubbish and put back stuff you want on the wall.  The Nightstand\\/Table Remove everything from the nightstand/table.  Wipe down the nightstand/table.  Throw away trash/rubbish. and put the stuff you want on the nightstand/table. The Floor Throw out the garbage. Your poor floor has to be covered with junk by now, so get a big rubbish bag and throw all your trash/rubbish in it. Sort out everything into piles. One pile being named “dirty clothes” and another pile being named “scrap paper”, etc. Vacuum clean your floor, if you have a rug, vacuum that too.  Pick up stuff to go to charity or your own garage sale.  Put everything in the piles where they belong.  The Windows Remove everything from the windowsill and wipe it with suitable cleaning products.  Do the same to the windows and wipe away any spiders/dust/marks.  Put everything back on the window/sill.  Open the curtains/blinds. Dust those. You Are Finished Show it off to your family and friends.  Clean it once every few weeks. If it gets messy before that, just tidy it when it needs a clean. Do a very thorough clean up once every 2 or 3 months.  Relax. You worked hard.",
    "sentences": [
        " The Bed Remove everything off the bed.",
        "Take all pillows, cushions, stuffed animals, sheets, duvet and throws and take all the covers off of them, remove pillow cases, cushion cases, duvet sheets etc.",
        "Throw the sheets, cushion cases, etc.",
        "which you just took off from the bed into a washing basket.",
        "You can put them into a laundry bag if you prefer, throwing them into a washing basket won't make the room any cleaner.",
        "This step is really just about removing any items from your bed and stripping off all bed linen.",
        "If you have bad acne, change pillow cases every night.",
        "Find clean and fresh bedding.",
        "Put it on the duvet and pillows/cushions and put those aside.",
        "Make your bed (how you like it, but make it as neat as possible).",
        "Put everything back on the bed.",
        "Get a cloth and cleaning products suitable for use on your bed frame.",
        "Dust the frame and clean it thoroughly.",
        "The Closet\\/Wardrobe Completely empty your closet/wardrobe.",
        "Take out all clothes, underwear, feminine products etc.",
        "If you find any rubbish/trash, get a bin liner and throw all of it away.",
        "Order and organize everything how you like it.",
        "Put everything back in the closet/wardrobe.",
        "The Entertainment Center\\/Bookshelf Remove and unplug everything.",
        "Take all books off the bookshelf.",
        "Pile them up aside.",
        "Use suitable cleaning products.",
        "Clean, wipe and dust the shelves and entertainment centre.",
        "Organize.",
        "Organize everything how you want it.",
        "Put books in height order; smallest to tallest.",
        "Dust all books without using cleaning products, just a clean cloth (DRY).",
        "Put everything back.",
        "Plug everything back in.",
        "Do not get the sockets wet.",
        "Do not get water on anything electrical because it may damage the item.",
        "The Walls Remove everything from the walls.",
        "Wipe down the walls carefully.",
        "Get rid of all cobwebs with a duster and just generally dust everything.",
        "Sort and organize everything you took down from the walls and throw away trash/rubbish and put back stuff you want on the wall.",
        "The Nightstand\\/Table Remove everything from the nightstand/table.",
        "Wipe down the nightstand/table.",
        "Throw away trash/rubbish.",
        "and put the stuff you want on the nightstand/table.",
        "The Floor Throw out the garbage.",
        "Your poor floor has to be covered with junk by now, so get a big rubbish bag and throw all your trash/rubbish in it.",
        "Sort out everything into piles.",
        "One pile being named “dirty clothes” and another pile being named “scrap paper”, etc.",
        "Vacuum clean your floor, if you have a rug, vacuum that too.",
        "Pick up stuff to go to charity or your own garage sale.",
        "Put everything in the piles where they belong.",
        "The Windows Remove everything from the windowsill and wipe it with suitable cleaning products.",
        "Do the same to the windows and wipe away any spiders/dust/marks.",
        "Put everything back on the window/sill.",
        "Open the curtains/blinds.",
        "Dust those.",
        "You Are Finished Show it off to your family and friends.",
        "Clean it once every few weeks.",
        "If it gets messy before that, just tidy it when it needs a clean.",
        "Do a very thorough clean up once every 2 or 3 months.",
        "Relax.",
        "You worked hard."
    ]
}