{
    "title": "How to Bleach a Lace Closure",
    "url": "https://www.wikihow.com/Bleach-a-Lace-Closure",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care"
    ],
    "parts": [
        {
            "name": "Setting up Your Workspace",
            "steps": [
                {
                    "headline": "Set a flattened plastic bag on a level workspace to protect the surface.",
                    "description": "Take an empty plastic bag and lay it flat on a table, or wherever you’ve decided to bleach your lace closure. Use your palms to flatten the bag out as much as possible, so it works as a backdrop for your closure during the bleaching process. Make sure that the bag is 1 to 2 feet (0.30 to 0.61 m) in length and width, or large enough to comfortably fit beneath your lace closure. This bag prevents any bleach from spilling or staining other surfaces. You can also use a light-colored towel for this."
                },
                {
                    "headline": "Lay the closure out flat on the plastic with the laces facing up.",
                    "description": "Double check that the hair is facing the bag while the lace portion is accessible and facing upwards. Try to keep the closure centered on the plastic bag as you go. You can also pin your wig to a foam mannequin head. If you do this, make sure that closure is flipped with the lace accessible."
                },
                {
                    "headline": "Wear gloves and an old T-shirt whenever you use bleach.",
                    "description": "Protect your hands and clothes by wearing gloves and old, disposable clothing as you bleach. Since bleach powder is very harsh on your skin, you don’t want to spill any on your fingers or hands as you work. Continue wearing gloves throughout the entire process to keep your skin from being irritated."
                },
                {
                    "headline": "Add 1-2 spoonfuls of bleach powder into a mixing bowl.",
                    "description": "Use a regular spoon and scoop the bleach powder into a mixing bowl. Don’t heap the powder into the spoon; instead, use 2 moderate, average-sized spoonfuls. If you’re making a large bleach mixture, feel free to use several spoonfuls of product instead. Make sure that bleach powder is labeled as a lightening powder. Bleach powder can be purchased at any beauty supply store."
                },
                {
                    "headline": "Stir in 1 capful of 20-40 volume developer into the bleach powder.",
                    "description": "Take your developer product and add a small amount into the mixing bowl. If you want the bleaching process to be quicker, opt for a developer with higher concentration, like 40 volume. Add in an extra capful or so if you’re preparing a larger bleach mixture. Aim to use equal parts developer and bleach. You can find creme developer at any beauty supply store."
                },
                {
                    "headline": "Mix the bleach and developer together until they have a thick consistency.",
                    "description": "Use a spoon or plastic application brush to mix the powder and developer together. Keep stirring until you no longer see any lumps, and the mixture is thick. If it’s too thick, add in a tiny scoop of developer until the mixture has a smooth, cake batter-like consistency. If the mixture is too runny, then it could drip through the lace closure and accidentally bleach unwanted sections of your hair piece."
                }
            ]
        },
        {
            "name": "Applying the Bleach Mixture",
            "steps": [
                {
                    "headline": "Use a plastic-bristle brush to apply the bleach in sections.",
                    "description": "Take your application brush and dip it into the bleach mixture. Dab the product onto the lace, as you only want to add the bleach in a thin layer. Apply the bleach in sections, using soft, gentle motions as you work from right to left or left to right. Only bleach the knots that you want to look lighter."
                },
                {
                    "headline": "Surround the lace in a folded sheet of aluminum foil.",
                    "description": "Take a large, rectangular piece of foil that comfortably folds over the lace portion of your closure. Set the bleached lace on the bottom half of the sheet before folding the foil in half. For extra insulation, fold in the edges at a 1 in (2.5 cm) margin."
                },
                {
                    "headline": "Wait 10-20 minutes for the bleach to soak into the closure.",
                    "description": "Set a timer and give the bleach time to set. If you used a more concentrated developer like 40 volume, you might only have to wait about 10 minutes for your closure to reach the desired color. Check under the foil every 2-5 minutes to see how much the closure knots have lightened. Aim for your knots to be a rich, honey blonde color."
                }
            ]
        },
        {
            "name": "Rinsing out the Bleach",
            "steps": [
                {
                    "headline": "Rinse the bleach off of the lace closure with cool water.",
                    "description": "Turn on your faucet and tilt your closure beneath the running water. Focus on rinsing off all the bleach mixture from the lace portion. To protect the rest of the wig, hold the closure inside out as your rinse it so the rest of the piece doesn’t get splashed with bleach. Make sure that you’re still wearing gloves during this part of the process.Tip: While you rinse, try to angle your closure instead of holding it vertically so the product doesn’t seep directly into the hair."
                },
                {
                    "headline": "Massage a neutralizing shampoo into the closure to deactivate the bleach.",
                    "description": "Pour a coin-sized amount of neutralizing shampoo into your gloved hands and rub it all over your closure. If you don’t apply this shampoo, then any remaining bleach will continue to lighten the knots. Knead the shampoo into the both the lace and hair portion, and let the shampoo product sit for 5-10 minutes. Since this is a specialized shampoo for bleached hair, you can find it at a beauty supply shop."
                },
                {
                    "headline": "Rinse out the shampoo with cool water after 5-10 minutes.",
                    "description": "Set the closure under cool running water to rinse out the shampoo. Use your fingers to knead out any excess suds caught in the hair piece. Continue rinsing until the hair and lace portion are completely clean and free of any hair product."
                },
                {
                    "headline": "Rub conditioner into the closure to keep it silky and soft.",
                    "description": "Lather any kind of moisturizing conditioner into the lace as well as the rest of the hair. Continue massaging the conditioner in until the entire piece is saturated. Wait at least 5 minutes for the product to fully moisturize the hair before rinsing the conditioner out. If you want to save time, use a neutralizing shampoo plus conditioning product."
                },
                {
                    "headline": "Pour cool water over the closure to rinse out the conditioner.",
                    "description": "Hold the hair piece under running water one last time to rinse out any conditioner. Use your fingertips to massage out any excess product. Continue doing this until there are no more suds, and the water running through your closure is clear. This conditioner doesn’t have to be specific to bleached hair—it just has to moisturize your closure."
                },
                {
                    "headline": "Let your lace closure air out until it’s completely dry.",
                    "description": "Comb out the clean closure and place it on a towel in an area with plenty of open air where it can receive plenty of open air. Check on the piece periodically, touching it every few hours to see if it’s dry. Once the closure is completely dry, you’re ready to wear it!"
                }
            ]
        }
    ],
    "tyn": [
        "Plastic bag",
        "Aluminum foil",
        "Foam head (optional)",
        "Small mixing bowl",
        "Application brush",
        "Gloves",
        "BW2 bleach powder",
        "20, 30, or 40 level creme developer",
        "Neutralizing shampoo",
        "Moisturizing conditioner"
    ],
    "text": " Setting up Your Workspace Set a flattened plastic bag on a level workspace to protect the surface. Take an empty plastic bag and lay it flat on a table, or wherever you’ve decided to bleach your lace closure. Use your palms to flatten the bag out as much as possible, so it works as a backdrop for your closure during the bleaching process. Make sure that the bag is 1 to 2 feet (0.30 to 0.61 m) in length and width, or large enough to comfortably fit beneath your lace closure. This bag prevents any bleach from spilling or staining other surfaces. You can also use a light-colored towel for this. Lay the closure out flat on the plastic with the laces facing up. Double check that the hair is facing the bag while the lace portion is accessible and facing upwards. Try to keep the closure centered on the plastic bag as you go. You can also pin your wig to a foam mannequin head. If you do this, make sure that closure is flipped with the lace accessible. Wear gloves and an old T-shirt whenever you use bleach. Protect your hands and clothes by wearing gloves and old, disposable clothing as you bleach. Since bleach powder is very harsh on your skin, you don’t want to spill any on your fingers or hands as you work. Continue wearing gloves throughout the entire process to keep your skin from being irritated. Add 1-2 spoonfuls of bleach powder into a mixing bowl. Use a regular spoon and scoop the bleach powder into a mixing bowl. Don’t heap the powder into the spoon; instead, use 2 moderate, average-sized spoonfuls. If you’re making a large bleach mixture, feel free to use several spoonfuls of product instead. Make sure that bleach powder is labeled as a lightening powder. Bleach powder can be purchased at any beauty supply store. Stir in 1 capful of 20-40 volume developer into the bleach powder. Take your developer product and add a small amount into the mixing bowl. If you want the bleaching process to be quicker, opt for a developer with higher concentration, like 40 volume. Add in an extra capful or so if you’re preparing a larger bleach mixture. Aim to use equal parts developer and bleach. You can find creme developer at any beauty supply store. Mix the bleach and developer together until they have a thick consistency. Use a spoon or plastic application brush to mix the powder and developer together. Keep stirring until you no longer see any lumps, and the mixture is thick. If it’s too thick, add in a tiny scoop of developer until the mixture has a smooth, cake batter-like consistency. If the mixture is too runny, then it could drip through the lace closure and accidentally bleach unwanted sections of your hair piece. Applying the Bleach Mixture Use a plastic-bristle brush to apply the bleach in sections. Take your application brush and dip it into the bleach mixture. Dab the product onto the lace, as you only want to add the bleach in a thin layer. Apply the bleach in sections, using soft, gentle motions as you work from right to left or left to right. Only bleach the knots that you want to look lighter. Surround the lace in a folded sheet of aluminum foil. Take a large, rectangular piece of foil that comfortably folds over the lace portion of your closure. Set the bleached lace on the bottom half of the sheet before folding the foil in half. For extra insulation, fold in the edges at a 1 in (2.5 cm) margin. Wait 10-20 minutes for the bleach to soak into the closure. Set a timer and give the bleach time to set. If you used a more concentrated developer like 40 volume, you might only have to wait about 10 minutes for your closure to reach the desired color. Check under the foil every 2-5 minutes to see how much the closure knots have lightened. Aim for your knots to be a rich, honey blonde color. Rinsing out the Bleach Rinse the bleach off of the lace closure with cool water. Turn on your faucet and tilt your closure beneath the running water. Focus on rinsing off all the bleach mixture from the lace portion. To protect the rest of the wig, hold the closure inside out as your rinse it so the rest of the piece doesn’t get splashed with bleach. Make sure that you’re still wearing gloves during this part of the process.Tip: While you rinse, try to angle your closure instead of holding it vertically so the product doesn’t seep directly into the hair. Massage a neutralizing shampoo into the closure to deactivate the bleach. Pour a coin-sized amount of neutralizing shampoo into your gloved hands and rub it all over your closure. If you don’t apply this shampoo, then any remaining bleach will continue to lighten the knots. Knead the shampoo into the both the lace and hair portion, and let the shampoo product sit for 5-10 minutes. Since this is a specialized shampoo for bleached hair, you can find it at a beauty supply shop. Rinse out the shampoo with cool water after 5-10 minutes. Set the closure under cool running water to rinse out the shampoo. Use your fingers to knead out any excess suds caught in the hair piece. Continue rinsing until the hair and lace portion are completely clean and free of any hair product. Rub conditioner into the closure to keep it silky and soft. Lather any kind of moisturizing conditioner into the lace as well as the rest of the hair. Continue massaging the conditioner in until the entire piece is saturated. Wait at least 5 minutes for the product to fully moisturize the hair before rinsing the conditioner out. If you want to save time, use a neutralizing shampoo plus conditioning product. Pour cool water over the closure to rinse out the conditioner. Hold the hair piece under running water one last time to rinse out any conditioner. Use your fingertips to massage out any excess product. Continue doing this until there are no more suds, and the water running through your closure is clear. This conditioner doesn’t have to be specific to bleached hair—it just has to moisturize your closure. Let your lace closure air out until it’s completely dry. Comb out the clean closure and place it on a towel in an area with plenty of open air where it can receive plenty of open air. Check on the piece periodically, touching it every few hours to see if it’s dry. Once the closure is completely dry, you’re ready to wear it!",
    "sentences": [
        " Setting up Your Workspace Set a flattened plastic bag on a level workspace to protect the surface.",
        "Take an empty plastic bag and lay it flat on a table, or wherever you’ve decided to bleach your lace closure.",
        "Use your palms to flatten the bag out as much as possible, so it works as a backdrop for your closure during the bleaching process.",
        "Make sure that the bag is 1 to 2 feet (0.30 to 0.61 m) in length and width, or large enough to comfortably fit beneath your lace closure.",
        "This bag prevents any bleach from spilling or staining other surfaces.",
        "You can also use a light-colored towel for this.",
        "Lay the closure out flat on the plastic with the laces facing up.",
        "Double check that the hair is facing the bag while the lace portion is accessible and facing upwards.",
        "Try to keep the closure centered on the plastic bag as you go.",
        "You can also pin your wig to a foam mannequin head.",
        "If you do this, make sure that closure is flipped with the lace accessible.",
        "Wear gloves and an old T-shirt whenever you use bleach.",
        "Protect your hands and clothes by wearing gloves and old, disposable clothing as you bleach.",
        "Since bleach powder is very harsh on your skin, you don’t want to spill any on your fingers or hands as you work.",
        "Continue wearing gloves throughout the entire process to keep your skin from being irritated.",
        "Add 1-2 spoonfuls of bleach powder into a mixing bowl.",
        "Use a regular spoon and scoop the bleach powder into a mixing bowl.",
        "Don’t heap the powder into the spoon; instead, use 2 moderate, average-sized spoonfuls.",
        "If you’re making a large bleach mixture, feel free to use several spoonfuls of product instead.",
        "Make sure that bleach powder is labeled as a lightening powder.",
        "Bleach powder can be purchased at any beauty supply store.",
        "Stir in 1 capful of 20-40 volume developer into the bleach powder.",
        "Take your developer product and add a small amount into the mixing bowl.",
        "If you want the bleaching process to be quicker, opt for a developer with higher concentration, like 40 volume.",
        "Add in an extra capful or so if you’re preparing a larger bleach mixture.",
        "Aim to use equal parts developer and bleach.",
        "You can find creme developer at any beauty supply store.",
        "Mix the bleach and developer together until they have a thick consistency.",
        "Use a spoon or plastic application brush to mix the powder and developer together.",
        "Keep stirring until you no longer see any lumps, and the mixture is thick.",
        "If it’s too thick, add in a tiny scoop of developer until the mixture has a smooth, cake batter-like consistency.",
        "If the mixture is too runny, then it could drip through the lace closure and accidentally bleach unwanted sections of your hair piece.",
        "Applying the Bleach Mixture Use a plastic-bristle brush to apply the bleach in sections.",
        "Take your application brush and dip it into the bleach mixture.",
        "Dab the product onto the lace, as you only want to add the bleach in a thin layer.",
        "Apply the bleach in sections, using soft, gentle motions as you work from right to left or left to right.",
        "Only bleach the knots that you want to look lighter.",
        "Surround the lace in a folded sheet of aluminum foil.",
        "Take a large, rectangular piece of foil that comfortably folds over the lace portion of your closure.",
        "Set the bleached lace on the bottom half of the sheet before folding the foil in half.",
        "For extra insulation, fold in the edges at a 1 in (2.5 cm) margin.",
        "Wait 10-20 minutes for the bleach to soak into the closure.",
        "Set a timer and give the bleach time to set.",
        "If you used a more concentrated developer like 40 volume, you might only have to wait about 10 minutes for your closure to reach the desired color.",
        "Check under the foil every 2-5 minutes to see how much the closure knots have lightened.",
        "Aim for your knots to be a rich, honey blonde color.",
        "Rinsing out the Bleach Rinse the bleach off of the lace closure with cool water.",
        "Turn on your faucet and tilt your closure beneath the running water.",
        "Focus on rinsing off all the bleach mixture from the lace portion.",
        "To protect the rest of the wig, hold the closure inside out as your rinse it so the rest of the piece doesn’t get splashed with bleach.",
        "Make sure that you’re still wearing gloves during this part of the process.Tip: While you rinse, try to angle your closure instead of holding it vertically so the product doesn’t seep directly into the hair.",
        "Massage a neutralizing shampoo into the closure to deactivate the bleach.",
        "Pour a coin-sized amount of neutralizing shampoo into your gloved hands and rub it all over your closure.",
        "If you don’t apply this shampoo, then any remaining bleach will continue to lighten the knots.",
        "Knead the shampoo into the both the lace and hair portion, and let the shampoo product sit for 5-10 minutes.",
        "Since this is a specialized shampoo for bleached hair, you can find it at a beauty supply shop.",
        "Rinse out the shampoo with cool water after 5-10 minutes.",
        "Set the closure under cool running water to rinse out the shampoo.",
        "Use your fingers to knead out any excess suds caught in the hair piece.",
        "Continue rinsing until the hair and lace portion are completely clean and free of any hair product.",
        "Rub conditioner into the closure to keep it silky and soft.",
        "Lather any kind of moisturizing conditioner into the lace as well as the rest of the hair.",
        "Continue massaging the conditioner in until the entire piece is saturated.",
        "Wait at least 5 minutes for the product to fully moisturize the hair before rinsing the conditioner out.",
        "If you want to save time, use a neutralizing shampoo plus conditioning product.",
        "Pour cool water over the closure to rinse out the conditioner.",
        "Hold the hair piece under running water one last time to rinse out any conditioner.",
        "Use your fingertips to massage out any excess product.",
        "Continue doing this until there are no more suds, and the water running through your closure is clear.",
        "This conditioner doesn’t have to be specific to bleached hair—it just has to moisturize your closure.",
        "Let your lace closure air out until it’s completely dry.",
        "Comb out the clean closure and place it on a towel in an area with plenty of open air where it can receive plenty of open air.",
        "Check on the piece periodically, touching it every few hours to see if it’s dry.",
        "Once the closure is completely dry, you’re ready to wear it!"
    ]
}