{
    "title": "How to Make Acrylic Paint Thicker",
    "url": "https://www.wikihow.com/Make-Acrylic-Paint-Thicker",
    "category_hierarchy": [
        "Home and Garden",
        "DIY",
        "Plastic"
    ],
    "methods": [
        {
            "name": "Using Thickening or Textured Gels",
            "steps": [
                {
                    "headline": "Buy a thickening gel designed for acrylic paint.",
                    "description": "The best way to thicken acrylics without a risk of ruining your paint is with specialized thickening gel. Gels like these are designed for use with acrylic paint and shouldn’t affect the finish or color of your paint. You can find acrylic thickening gel at a hardware or arts and crafts store. There are thickening gels designed for other types of paint, so check any gel you’re considering to make sure it’s compatible with acrylic paint. This information should be printed on the label."
                },
                {
                    "headline": "Get a textured gel to give your paint a rough, textured finish.",
                    "description": "A textured gel is a type of paste with sand, powder, or other similar ingredients mixed in to give the finished product a rough, coarse look. These gels can also make acrylic paint thicker and give it a textured finish. Use this option if you’d like this type of composition. Some examples of textured gels are stucco, modeling paste, sand gel, and resin gel. If you don’t know which type is best for your needs, try talking to an employee at the arts or hardware store."
                },
                {
                    "headline": "Spread out the paint on a palette or dish.",
                    "description": "Take the paint tube and squeeze out the amount of paint you plan on using. Then, spread it out with a palette knife so the gel mixes into it better. If you’re mixing colors, do this before adding any thickeners. You can always add more paint later if you didn’t squeeze out enough."
                },
                {
                    "headline": "Add gel to the paint in a 1:4 ratio.",
                    "description": "Use your palette knife and scoop out some thickening or textured gel. Don’t use any more gel than 1/4 the amount of paint you’re using. Any more could make the paint unstable. You could add less gel if you want thinner paint. Just don’t exceed a 1:4 ratio. If you’ve never done this before, start with a small amount. Mix it into the paint and see if you like the consistency. Add more until the paint reaches the thickness you want."
                },
                {
                    "headline": "Mix the gel into the paint until it reaches a uniform consistency.",
                    "description": "Scoop the gel into the paint and begin mixing it. Don’t leave any thickening gel leftover on the side. Stir the mixture until it reaches a uniform consistency. You’re now ready to paint! You can use your brush or a palette knife to mix water-based thickening gel in. If you’re using a textured gel, use a palette knife to mix it in. Remember that thickening gel usually makes paint dry faster, so start painting right away after adding it."
                }
            ]
        },
        {
            "name": "Making a Cornstarch Thickener",
            "steps": [
                {
                    "headline": "Mix 2 cups (470 mL) of water with 3 tbsp (14.3 g) of cornstarch.",
                    "description": "If you’re on a budget, you can make your own thickening gel at home with cornstarch and water. Start by mixing these 2 ingredients together in a bowl. Stir the ingredients so the cornstarch mixes in."
                },
                {
                    "headline": "Boil the mixture in a saucepan until it thickens.",
                    "description": "Pour the mixture into a saucepan and place it on the stove over a low heat. Stir the mixture with a spoon occasionally. As the water starts boiling, the mixture should thicken. Stir more often at this point. When the mixture becomes a thick paste, it’s finished. Give the paste enough time to cool before using it in your paint."
                },
                {
                    "headline": "Spread out the paint on a palette or dish.",
                    "description": "When the mixture has cooled down, you’re ready to mix it into your paint. Start by getting the colors you want and squeezing them out on your palette. If you’re mixing colors, do this before adding the paste."
                },
                {
                    "headline": "Add the paste until the paint reaches the consistency you want.",
                    "description": "Use just the edge of your palette knife and scoop out some thickening paste. Mix it into the paint and see how it changes the consistency. If you want the paint thicker, add more paste. Start painting when the paint reaches the consistency you want. If you’ve never done this before, consider experimenting first to find the right consistency. Use a small amount of paint and add some paste. Then spread the paint on a canvas and see how it looks when it dries. Repeat this process until you find the mixture you like best."
                }
            ]
        }
    ],
    "tyn": [
        "Using Thickening or Textured Gels",
        "Thickening or textured gel",
        "Painting palette",
        "Brush",
        "Palette knife",
        "Canvas",
        "Making a Cornstarch Thickener",
        "Cornstarch",
        "Water",
        "Measuring cup",
        "Spoon",
        "Stove",
        "Saucepan"
    ],
    "text": " Using Thickening or Textured Gels Buy a thickening gel designed for acrylic paint. The best way to thicken acrylics without a risk of ruining your paint is with specialized thickening gel. Gels like these are designed for use with acrylic paint and shouldn’t affect the finish or color of your paint. You can find acrylic thickening gel at a hardware or arts and crafts store. There are thickening gels designed for other types of paint, so check any gel you’re considering to make sure it’s compatible with acrylic paint. This information should be printed on the label. Get a textured gel to give your paint a rough, textured finish. A textured gel is a type of paste with sand, powder, or other similar ingredients mixed in to give the finished product a rough, coarse look. These gels can also make acrylic paint thicker and give it a textured finish. Use this option if you’d like this type of composition. Some examples of textured gels are stucco, modeling paste, sand gel, and resin gel. If you don’t know which type is best for your needs, try talking to an employee at the arts or hardware store. Spread out the paint on a palette or dish. Take the paint tube and squeeze out the amount of paint you plan on using. Then, spread it out with a palette knife so the gel mixes into it better. If you’re mixing colors, do this before adding any thickeners. You can always add more paint later if you didn’t squeeze out enough. Add gel to the paint in a 1:4 ratio. Use your palette knife and scoop out some thickening or textured gel. Don’t use any more gel than 1/4 the amount of paint you’re using. Any more could make the paint unstable. You could add less gel if you want thinner paint. Just don’t exceed a 1:4 ratio. If you’ve never done this before, start with a small amount. Mix it into the paint and see if you like the consistency. Add more until the paint reaches the thickness you want. Mix the gel into the paint until it reaches a uniform consistency. Scoop the gel into the paint and begin mixing it. Don’t leave any thickening gel leftover on the side. Stir the mixture until it reaches a uniform consistency. You’re now ready to paint! You can use your brush or a palette knife to mix water-based thickening gel in. If you’re using a textured gel, use a palette knife to mix it in. Remember that thickening gel usually makes paint dry faster, so start painting right away after adding it. Making a Cornstarch Thickener Mix 2 cups (470 mL) of water with 3 tbsp (14.3 g) of cornstarch. If you’re on a budget, you can make your own thickening gel at home with cornstarch and water. Start by mixing these 2 ingredients together in a bowl. Stir the ingredients so the cornstarch mixes in. Boil the mixture in a saucepan until it thickens. Pour the mixture into a saucepan and place it on the stove over a low heat. Stir the mixture with a spoon occasionally. As the water starts boiling, the mixture should thicken. Stir more often at this point. When the mixture becomes a thick paste, it’s finished. Give the paste enough time to cool before using it in your paint. Spread out the paint on a palette or dish. When the mixture has cooled down, you’re ready to mix it into your paint. Start by getting the colors you want and squeezing them out on your palette. If you’re mixing colors, do this before adding the paste. Add the paste until the paint reaches the consistency you want. Use just the edge of your palette knife and scoop out some thickening paste. Mix it into the paint and see how it changes the consistency. If you want the paint thicker, add more paste. Start painting when the paint reaches the consistency you want. If you’ve never done this before, consider experimenting first to find the right consistency. Use a small amount of paint and add some paste. Then spread the paint on a canvas and see how it looks when it dries. Repeat this process until you find the mixture you like best.",
    "sentences": [
        " Using Thickening or Textured Gels Buy a thickening gel designed for acrylic paint.",
        "The best way to thicken acrylics without a risk of ruining your paint is with specialized thickening gel.",
        "Gels like these are designed for use with acrylic paint and shouldn’t affect the finish or color of your paint.",
        "You can find acrylic thickening gel at a hardware or arts and crafts store.",
        "There are thickening gels designed for other types of paint, so check any gel you’re considering to make sure it’s compatible with acrylic paint.",
        "This information should be printed on the label.",
        "Get a textured gel to give your paint a rough, textured finish.",
        "A textured gel is a type of paste with sand, powder, or other similar ingredients mixed in to give the finished product a rough, coarse look.",
        "These gels can also make acrylic paint thicker and give it a textured finish.",
        "Use this option if you’d like this type of composition.",
        "Some examples of textured gels are stucco, modeling paste, sand gel, and resin gel.",
        "If you don’t know which type is best for your needs, try talking to an employee at the arts or hardware store.",
        "Spread out the paint on a palette or dish.",
        "Take the paint tube and squeeze out the amount of paint you plan on using.",
        "Then, spread it out with a palette knife so the gel mixes into it better.",
        "If you’re mixing colors, do this before adding any thickeners.",
        "You can always add more paint later if you didn’t squeeze out enough.",
        "Add gel to the paint in a 1:4 ratio.",
        "Use your palette knife and scoop out some thickening or textured gel.",
        "Don’t use any more gel than 1/4 the amount of paint you’re using.",
        "Any more could make the paint unstable.",
        "You could add less gel if you want thinner paint.",
        "Just don’t exceed a 1:4 ratio.",
        "If you’ve never done this before, start with a small amount.",
        "Mix it into the paint and see if you like the consistency.",
        "Add more until the paint reaches the thickness you want.",
        "Mix the gel into the paint until it reaches a uniform consistency.",
        "Scoop the gel into the paint and begin mixing it.",
        "Don’t leave any thickening gel leftover on the side.",
        "Stir the mixture until it reaches a uniform consistency.",
        "You’re now ready to paint!",
        "You can use your brush or a palette knife to mix water-based thickening gel in.",
        "If you’re using a textured gel, use a palette knife to mix it in.",
        "Remember that thickening gel usually makes paint dry faster, so start painting right away after adding it.",
        "Making a Cornstarch Thickener Mix 2 cups (470 mL) of water with 3 tbsp (14.3 g) of cornstarch.",
        "If you’re on a budget, you can make your own thickening gel at home with cornstarch and water.",
        "Start by mixing these 2 ingredients together in a bowl.",
        "Stir the ingredients so the cornstarch mixes in.",
        "Boil the mixture in a saucepan until it thickens.",
        "Pour the mixture into a saucepan and place it on the stove over a low heat.",
        "Stir the mixture with a spoon occasionally.",
        "As the water starts boiling, the mixture should thicken.",
        "Stir more often at this point.",
        "When the mixture becomes a thick paste, it’s finished.",
        "Give the paste enough time to cool before using it in your paint.",
        "Spread out the paint on a palette or dish.",
        "When the mixture has cooled down, you’re ready to mix it into your paint.",
        "Start by getting the colors you want and squeezing them out on your palette.",
        "If you’re mixing colors, do this before adding the paste.",
        "Add the paste until the paint reaches the consistency you want.",
        "Use just the edge of your palette knife and scoop out some thickening paste.",
        "Mix it into the paint and see how it changes the consistency.",
        "If you want the paint thicker, add more paste.",
        "Start painting when the paint reaches the consistency you want.",
        "If you’ve never done this before, consider experimenting first to find the right consistency.",
        "Use a small amount of paint and add some paste.",
        "Then spread the paint on a canvas and see how it looks when it dries.",
        "Repeat this process until you find the mixture you like best."
    ]
}