{
    "title": "How to Calculate Credit Card Interest",
    "url": "https://www.wikihow.com/Calculate-Credit-Card-Interest",
    "category_hierarchy": [
        "Finance and Business",
        "Banks and Financial Institutions"
    ],
    "methods": [
        {
            "name": "Calculating Interest For Fixed and Variable Rates",
            "steps": [
                {
                    "headline": "Understand how these rates are similar to and different from each other.",
                    "description": "Both rates are types of \"purchase\" APRs, meaning that they apply to normal purchases made on a credit card. You need to know your Daily Periodic Rate (DPR) to calculate how much interest you pay on your balance for the month. This is explained in the next step. The important thing to note is that if you pay off the balance before the end of your billing cycle, you do not pay interest on your purchases for either of these \"purchase\" APRs. Interest is applied only to the outstanding balance at the end of each billing cycle. A fixed APR won't change unless you continually fail to pay on time. At that point, the credit card company will send you a letter setting your new default/penalty rate. A variable rate can change depending on national rates or other economic factors. For example, it might change based on fluctuation in the federal prime rate published by the Wall Street Journal. Look at your contract or credit card statement to figure out what your fixed or variable APR is."
                },
                {
                    "headline": "Calculate Daily Periodic Rates (DPR).",
                    "description": "Credit card companies usually calculate interest charges on a monthly basis. Because months vary in length — e.g., January is 31 days and February is 28 days — most companies use DPRs to calculate interest. To calculate your DPR, divide your annual APR by 365 (the number of days in one year). Take, as an example, a fixed or variable APR of 19 percent: 19 ÷ 365 = 0.052. This is your DPR."
                },
                {
                    "headline": "Multiply that number by the number of days in the current month.",
                    "description": "In January, you would multiply your DPR by 31: 0.052 x 31 = 1.61. Your monthly interest for January would be 1.61 percent. In February, you would multiply your DPR by 28: 0.052 x 28 = 1.46. Your monthly interest for February would be 1.46 percent"
                },
                {
                    "headline": "Multiply your interest rate by your outstanding balance.",
                    "description": "Remember that if you pay off your entire balance by your billing date, you don’t pay any interest at all. But, if you make the minimum payment or anything less than the entire balance, you pay interest on the outstanding balance. Convert your interest rate to a decimal by moving the decimal point two positions to the left. So, a rate of 1.61 percent in January would be 0.0161, and a rate of 1.46 percent in February would be 0.0146. If your outstanding balance on the card at the end of January’s billing cycle is $1,000, you would pay $1,000 x 0.0161, or $16.10. If your outstanding balance at the end of February’s billing cycle is $1,000, you would pay $1,000 x 0.0146, or $14.60."
                }
            ]
        },
        {
            "name": "Calculating Interest for Default\\/Penalty APR",
            "steps": [
                {
                    "headline": "Know what a default/penalty APR is.",
                    "description": "A default/penalty rate is higher than the rate you got when you signed up for your card. It's triggered when you violate the penalty terms in your contract. Examples of violations might include exceeding your balance limit or consistently making late payments."
                },
                {
                    "headline": "Figure out what your default/penalty APR is.",
                    "description": "You may be able to find a standard default/penalty APR somewhere in your statement or contract. It's more likely, though, that the bank will send you a letter telling you that it's changing your rate. The Credit Card Accountability Responsibility and Disclosure Act of 2009, or CARD Act, requires banks to give 45 days' notice before adjusting your interest rate. Your bank will explain your new rate in the letter. For example, you may have had an original APR of 20 percent. However, you missed two straight payments — 60 days. You received a letter saying the credit card company was raising your rate to a default/penalty rate of 35 percent."
                },
                {
                    "headline": "Calculate the DPR on your new rate.",
                    "description": "Divide your new rate by the number of days in the year, 365. In our example, you would complete the following equation: 35 ÷ 365 = 0.0958. This is the interest you’re paying on a daily basis."
                },
                {
                    "headline": "Figure out your interest rate for a given month.",
                    "description": "Because the number of days in a month can vary, make sure you’re using the right number for the month in question. Since January has 31 days, you would multiply 0.0958 x 31 to get 2.97. Your interest in January would be 2.97 percent of your balance."
                },
                {
                    "headline": "Multiply that monthly rate by your outstanding balance.",
                    "description": "Remember to convert the percentage to a decimal. In our example, 2.97 percent becomes 0.0297. If you have a balance of $1,000 at the end of January, you pay $1,000 x 0.0297, or $29.70 in interest."
                }
            ]
        },
        {
            "name": "Calculating Interest for a Tiered APR",
            "steps": [
                {
                    "headline": "Understand how tiered APRs work.",
                    "description": "With a tiered APR, the credit card company applies different rates to different parts of the balance. For example, it may charge 17 percent on balances up to $1,000 and 19 percent on balances above $1,000.00. If you have an outstanding balance of $1,500, you would pay 17 percent interest on the first $1,000 and 19 percent interest on the last $500."
                },
                {
                    "headline": "Calculate the DPR for each tier.",
                    "description": "Figure out how many tiers apply to the outstanding amount at the end of your billing cycle. You need to figure out the DPR for each of those rates individually. So, for our example:\n17 ÷ 365 results in a DPR of 0.047 for the first $1,000 of your balance. 19 ÷ 365 results in a DPR of 0.052 for the last $500 of your balance."
                },
                {
                    "headline": "Multiply each DPR by the number of days in the month.",
                    "description": "The steps are essentially the same as those for fixed and variable rates, as you can see. But it's important that you remember to apply each step to the different tier rates. Assume that we’re calculating the monthly rate for January, which has 31 days. 0.047 x 31 = a monthly rate of 1.457 percent for the first $1,000\n0.052 x 31 = a monthly rate of 1.612 percent for the last $500"
                },
                {
                    "headline": "Calculate the interest paid on your outstanding balance.",
                    "description": "Again, move decimal points two places to the left to convert percentages to numbers that can be multiplied. $1,000 x 0.01457 = $14.57 of interest paid on the first $1,000\n$500 x .01612 = $8.06 of interest paid on the last $500"
                },
                {
                    "headline": "Add the amounts together to find your total.",
                    "description": "$14.57 + $8.06 = $22.63 of interest paid on your outstanding balance of $1,500."
                }
            ]
        },
        {
            "name": "Calculating Interest for a Cash Advance APR",
            "steps": [
                {
                    "headline": "Understand what a cash advance APR is.",
                    "description": "This rate can be higher than your normal APR, but has an important distinction from a purchase rate. Interest on purchase APRs is calculated only at the end of each billing cycle. However, with a cash advance, interest is charged every single day until you pay off the balance of the cash advance. The cash advance rate goes into effect the second you do one of the following:\nWithdraw cash from an ATM or bank branch using your credit card. Transfer funds from your credit card to your overdraft account. Write a check off your credit card. Use your credit card to buy foreign money."
                },
                {
                    "headline": "Inspect your statement and contract to determine your cash advance APR.",
                    "description": "You may have to squint to read the fine print, but you’ll find it in there somewhere."
                },
                {
                    "headline": "Calculate your DPR.",
                    "description": "This is the interest rate you pay per day. To find it, divide your cash advance APR by 365 days. For example, if your cash advance APR is 20 percent, complete the following equation: 20 ÷ 365 = 0.055"
                },
                {
                    "headline": "Count how many days you waited to pay off the advance.",
                    "description": "Multiply the amount from the previous step by that number of days. So, if you waited 30 days to pay off your cash advance at an APR of 20 percent, complete the following equation: 0.055 x 30 (days) = 1.65. Your interest rate on the cash advance is 1.65 percent."
                },
                {
                    "headline": "Calculate the amount of interest you paid.",
                    "description": "Multiply the interest rate from the previous step by the amount of money you withdrew. If you withdrew $1,000 in our example, you would complete the following equation: 1,000 x 0.0165 = 16.50. You will pay $16.50 in interest on your cash advance."
                }
            ]
        },
        {
            "name": "Protecting Your Finances",
            "steps": [
                {
                    "headline": "Make your payments on time.",
                    "description": "The more late payments you make, the more likely the credit card company is to increase your APR. If you miss a payment, pay it as soon as possible. The company might report you to credit reporting agencies even before 30 days pass. This damages your credit rating in a way that takes a long time to undo. Keep your FICO score up by proving yourself to be a reliable debtor."
                },
                {
                    "headline": "Pay attention to rate increases.",
                    "description": "The law requires your credit card company to give you 45 days' notice before raising your interest rate. However, the company might not give you an explanation for the rate change. If you don't get an explanation, call your credit card company to find out why your rate was changed. If the company can't give you a good answer, it might be time to transfer your balance to another credit card. Good reasons to raise your rate include consistently missed payments or a low credit score."
                },
                {
                    "headline": "Try to lower your APR.",
                    "description": "Credit card companies are in the business of making money. They won’t lower your APR just because you're a good customer. If you want to be rewarded for your years of timely payments, you need to call your credit card company and convince it to change your rate. Before calling your credit card company, research what a fair APR for your FICO score would be. Then call your credit company and try to renegotiate your APR based on your research. If the company is unwilling to do so, it may make sense to transfer your balance to another credit card."
                }
            ]
        }
    ],
    "tyn": [
        "Original credit card agreement.",
        "Calculator.",
        "Monthly statements."
    ],
    "text": " Calculating Interest For Fixed and Variable Rates Understand how these rates are similar to and different from each other. Both rates are types of \"purchase\" APRs, meaning that they apply to normal purchases made on a credit card. You need to know your Daily Periodic Rate (DPR) to calculate how much interest you pay on your balance for the month. This is explained in the next step. The important thing to note is that if you pay off the balance before the end of your billing cycle, you do not pay interest on your purchases for either of these \"purchase\" APRs. Interest is applied only to the outstanding balance at the end of each billing cycle. A fixed APR won't change unless you continually fail to pay on time. At that point, the credit card company will send you a letter setting your new default/penalty rate. A variable rate can change depending on national rates or other economic factors. For example, it might change based on fluctuation in the federal prime rate published by the Wall Street Journal. Look at your contract or credit card statement to figure out what your fixed or variable APR is. Calculate Daily Periodic Rates (DPR). Credit card companies usually calculate interest charges on a monthly basis. Because months vary in length — e.g., January is 31 days and February is 28 days — most companies use DPRs to calculate interest. To calculate your DPR, divide your annual APR by 365 (the number of days in one year). Take, as an example, a fixed or variable APR of 19 percent: 19 ÷ 365 = 0.052. This is your DPR. Multiply that number by the number of days in the current month. In January, you would multiply your DPR by 31: 0.052 x 31 = 1.61. Your monthly interest for January would be 1.61 percent. In February, you would multiply your DPR by 28: 0.052 x 28 = 1.46. Your monthly interest for February would be 1.46 percent Multiply your interest rate by your outstanding balance. Remember that if you pay off your entire balance by your billing date, you don’t pay any interest at all. But, if you make the minimum payment or anything less than the entire balance, you pay interest on the outstanding balance. Convert your interest rate to a decimal by moving the decimal point two positions to the left. So, a rate of 1.61 percent in January would be 0.0161, and a rate of 1.46 percent in February would be 0.0146. If your outstanding balance on the card at the end of January’s billing cycle is $1,000, you would pay $1,000 x 0.0161, or $16.10. If your outstanding balance at the end of February’s billing cycle is $1,000, you would pay $1,000 x 0.0146, or $14.60. Calculating Interest for Default\\/Penalty APR Know what a default/penalty APR is. A default/penalty rate is higher than the rate you got when you signed up for your card. It's triggered when you violate the penalty terms in your contract. Examples of violations might include exceeding your balance limit or consistently making late payments. Figure out what your default/penalty APR is. You may be able to find a standard default/penalty APR somewhere in your statement or contract. It's more likely, though, that the bank will send you a letter telling you that it's changing your rate. The Credit Card Accountability Responsibility and Disclosure Act of 2009, or CARD Act, requires banks to give 45 days' notice before adjusting your interest rate. Your bank will explain your new rate in the letter. For example, you may have had an original APR of 20 percent. However, you missed two straight payments — 60 days. You received a letter saying the credit card company was raising your rate to a default/penalty rate of 35 percent. Calculate the DPR on your new rate. Divide your new rate by the number of days in the year, 365. In our example, you would complete the following equation: 35 ÷ 365 = 0.0958. This is the interest you’re paying on a daily basis. Figure out your interest rate for a given month. Because the number of days in a month can vary, make sure you’re using the right number for the month in question. Since January has 31 days, you would multiply 0.0958 x 31 to get 2.97. Your interest in January would be 2.97 percent of your balance. Multiply that monthly rate by your outstanding balance. Remember to convert the percentage to a decimal. In our example, 2.97 percent becomes 0.0297. If you have a balance of $1,000 at the end of January, you pay $1,000 x 0.0297, or $29.70 in interest. Calculating Interest for a Tiered APR Understand how tiered APRs work. With a tiered APR, the credit card company applies different rates to different parts of the balance. For example, it may charge 17 percent on balances up to $1,000 and 19 percent on balances above $1,000.00. If you have an outstanding balance of $1,500, you would pay 17 percent interest on the first $1,000 and 19 percent interest on the last $500. Calculate the DPR for each tier. Figure out how many tiers apply to the outstanding amount at the end of your billing cycle. You need to figure out the DPR for each of those rates individually. So, for our example:\n17 ÷ 365 results in a DPR of 0.047 for the first $1,000 of your balance. 19 ÷ 365 results in a DPR of 0.052 for the last $500 of your balance. Multiply each DPR by the number of days in the month. The steps are essentially the same as those for fixed and variable rates, as you can see. But it's important that you remember to apply each step to the different tier rates. Assume that we’re calculating the monthly rate for January, which has 31 days. 0.047 x 31 = a monthly rate of 1.457 percent for the first $1,000\n0.052 x 31 = a monthly rate of 1.612 percent for the last $500 Calculate the interest paid on your outstanding balance. Again, move decimal points two places to the left to convert percentages to numbers that can be multiplied. $1,000 x 0.01457 = $14.57 of interest paid on the first $1,000\n$500 x .01612 = $8.06 of interest paid on the last $500 Add the amounts together to find your total. $14.57 + $8.06 = $22.63 of interest paid on your outstanding balance of $1,500. Calculating Interest for a Cash Advance APR Understand what a cash advance APR is. This rate can be higher than your normal APR, but has an important distinction from a purchase rate. Interest on purchase APRs is calculated only at the end of each billing cycle. However, with a cash advance, interest is charged every single day until you pay off the balance of the cash advance. The cash advance rate goes into effect the second you do one of the following:\nWithdraw cash from an ATM or bank branch using your credit card. Transfer funds from your credit card to your overdraft account. Write a check off your credit card. Use your credit card to buy foreign money. Inspect your statement and contract to determine your cash advance APR. You may have to squint to read the fine print, but you’ll find it in there somewhere. Calculate your DPR. This is the interest rate you pay per day. To find it, divide your cash advance APR by 365 days. For example, if your cash advance APR is 20 percent, complete the following equation: 20 ÷ 365 = 0.055 Count how many days you waited to pay off the advance. Multiply the amount from the previous step by that number of days. So, if you waited 30 days to pay off your cash advance at an APR of 20 percent, complete the following equation: 0.055 x 30 (days) = 1.65. Your interest rate on the cash advance is 1.65 percent. Calculate the amount of interest you paid. Multiply the interest rate from the previous step by the amount of money you withdrew. If you withdrew $1,000 in our example, you would complete the following equation: 1,000 x 0.0165 = 16.50. You will pay $16.50 in interest on your cash advance. Protecting Your Finances Make your payments on time. The more late payments you make, the more likely the credit card company is to increase your APR. If you miss a payment, pay it as soon as possible. The company might report you to credit reporting agencies even before 30 days pass. This damages your credit rating in a way that takes a long time to undo. Keep your FICO score up by proving yourself to be a reliable debtor. Pay attention to rate increases. The law requires your credit card company to give you 45 days' notice before raising your interest rate. However, the company might not give you an explanation for the rate change. If you don't get an explanation, call your credit card company to find out why your rate was changed. If the company can't give you a good answer, it might be time to transfer your balance to another credit card. Good reasons to raise your rate include consistently missed payments or a low credit score. Try to lower your APR. Credit card companies are in the business of making money. They won’t lower your APR just because you're a good customer. If you want to be rewarded for your years of timely payments, you need to call your credit card company and convince it to change your rate. Before calling your credit card company, research what a fair APR for your FICO score would be. Then call your credit company and try to renegotiate your APR based on your research. If the company is unwilling to do so, it may make sense to transfer your balance to another credit card.",
    "sentences": [
        " Calculating Interest For Fixed and Variable Rates Understand how these rates are similar to and different from each other.",
        "Both rates are types of \"purchase\" APRs, meaning that they apply to normal purchases made on a credit card.",
        "You need to know your Daily Periodic Rate (DPR) to calculate how much interest you pay on your balance for the month.",
        "This is explained in the next step.",
        "The important thing to note is that if you pay off the balance before the end of your billing cycle, you do not pay interest on your purchases for either of these \"purchase\" APRs.",
        "Interest is applied only to the outstanding balance at the end of each billing cycle.",
        "A fixed APR won't change unless you continually fail to pay on time.",
        "At that point, the credit card company will send you a letter setting your new default/penalty rate.",
        "A variable rate can change depending on national rates or other economic factors.",
        "For example, it might change based on fluctuation in the federal prime rate published by the Wall Street Journal.",
        "Look at your contract or credit card statement to figure out what your fixed or variable APR is.",
        "Calculate Daily Periodic Rates (DPR).",
        "Credit card companies usually calculate interest charges on a monthly basis.",
        "Because months vary in length — e.g., January is 31 days and February is 28 days — most companies use DPRs to calculate interest.",
        "To calculate your DPR, divide your annual APR by 365 (the number of days in one year).",
        "Take, as an example, a fixed or variable APR of 19 percent: 19 ÷ 365 = 0.052.",
        "This is your DPR.",
        "Multiply that number by the number of days in the current month.",
        "In January, you would multiply your DPR by 31: 0.052 x 31 = 1.61.",
        "Your monthly interest for January would be 1.61 percent.",
        "In February, you would multiply your DPR by 28: 0.052 x 28 = 1.46.",
        "Your monthly interest for February would be 1.46 percent Multiply your interest rate by your outstanding balance.",
        "Remember that if you pay off your entire balance by your billing date, you don’t pay any interest at all.",
        "But, if you make the minimum payment or anything less than the entire balance, you pay interest on the outstanding balance.",
        "Convert your interest rate to a decimal by moving the decimal point two positions to the left.",
        "So, a rate of 1.61 percent in January would be 0.0161, and a rate of 1.46 percent in February would be 0.0146.",
        "If your outstanding balance on the card at the end of January’s billing cycle is $1,000, you would pay $1,000 x 0.0161, or $16.10.",
        "If your outstanding balance at the end of February’s billing cycle is $1,000, you would pay $1,000 x 0.0146, or $14.60.",
        "Calculating Interest for Default\\/Penalty APR Know what a default/penalty APR is.",
        "A default/penalty rate is higher than the rate you got when you signed up for your card.",
        "It's triggered when you violate the penalty terms in your contract.",
        "Examples of violations might include exceeding your balance limit or consistently making late payments.",
        "Figure out what your default/penalty APR is.",
        "You may be able to find a standard default/penalty APR somewhere in your statement or contract.",
        "It's more likely, though, that the bank will send you a letter telling you that it's changing your rate.",
        "The Credit Card Accountability Responsibility and Disclosure Act of 2009, or CARD Act, requires banks to give 45 days' notice before adjusting your interest rate.",
        "Your bank will explain your new rate in the letter.",
        "For example, you may have had an original APR of 20 percent.",
        "However, you missed two straight payments — 60 days.",
        "You received a letter saying the credit card company was raising your rate to a default/penalty rate of 35 percent.",
        "Calculate the DPR on your new rate.",
        "Divide your new rate by the number of days in the year, 365.",
        "In our example, you would complete the following equation: 35 ÷ 365 = 0.0958.",
        "This is the interest you’re paying on a daily basis.",
        "Figure out your interest rate for a given month.",
        "Because the number of days in a month can vary, make sure you’re using the right number for the month in question.",
        "Since January has 31 days, you would multiply 0.0958 x 31 to get 2.97.",
        "Your interest in January would be 2.97 percent of your balance.",
        "Multiply that monthly rate by your outstanding balance.",
        "Remember to convert the percentage to a decimal.",
        "In our example, 2.97 percent becomes 0.0297.",
        "If you have a balance of $1,000 at the end of January, you pay $1,000 x 0.0297, or $29.70 in interest.",
        "Calculating Interest for a Tiered APR Understand how tiered APRs work.",
        "With a tiered APR, the credit card company applies different rates to different parts of the balance.",
        "For example, it may charge 17 percent on balances up to $1,000 and 19 percent on balances above $1,000.00.",
        "If you have an outstanding balance of $1,500, you would pay 17 percent interest on the first $1,000 and 19 percent interest on the last $500.",
        "Calculate the DPR for each tier.",
        "Figure out how many tiers apply to the outstanding amount at the end of your billing cycle.",
        "You need to figure out the DPR for each of those rates individually.",
        "So, for our example:\n17 ÷ 365 results in a DPR of 0.047 for the first $1,000 of your balance.",
        "19 ÷ 365 results in a DPR of 0.052 for the last $500 of your balance.",
        "Multiply each DPR by the number of days in the month.",
        "The steps are essentially the same as those for fixed and variable rates, as you can see.",
        "But it's important that you remember to apply each step to the different tier rates.",
        "Assume that we’re calculating the monthly rate for January, which has 31 days.",
        "0.047 x 31 = a monthly rate of 1.457 percent for the first $1,000\n0.052 x 31 = a monthly rate of 1.612 percent for the last $500 Calculate the interest paid on your outstanding balance.",
        "Again, move decimal points two places to the left to convert percentages to numbers that can be multiplied.",
        "$1,000 x 0.01457 = $14.57 of interest paid on the first $1,000\n$500 x .01612 = $8.06 of interest paid on the last $500 Add the amounts together to find your total.",
        "$14.57 + $8.06 = $22.63 of interest paid on your outstanding balance of $1,500.",
        "Calculating Interest for a Cash Advance APR Understand what a cash advance APR is.",
        "This rate can be higher than your normal APR, but has an important distinction from a purchase rate.",
        "Interest on purchase APRs is calculated only at the end of each billing cycle.",
        "However, with a cash advance, interest is charged every single day until you pay off the balance of the cash advance.",
        "The cash advance rate goes into effect the second you do one of the following:\nWithdraw cash from an ATM or bank branch using your credit card.",
        "Transfer funds from your credit card to your overdraft account.",
        "Write a check off your credit card.",
        "Use your credit card to buy foreign money.",
        "Inspect your statement and contract to determine your cash advance APR.",
        "You may have to squint to read the fine print, but you’ll find it in there somewhere.",
        "Calculate your DPR.",
        "This is the interest rate you pay per day.",
        "To find it, divide your cash advance APR by 365 days.",
        "For example, if your cash advance APR is 20 percent, complete the following equation: 20 ÷ 365 = 0.055 Count how many days you waited to pay off the advance.",
        "Multiply the amount from the previous step by that number of days.",
        "So, if you waited 30 days to pay off your cash advance at an APR of 20 percent, complete the following equation: 0.055 x 30 (days) = 1.65.",
        "Your interest rate on the cash advance is 1.65 percent.",
        "Calculate the amount of interest you paid.",
        "Multiply the interest rate from the previous step by the amount of money you withdrew.",
        "If you withdrew $1,000 in our example, you would complete the following equation: 1,000 x 0.0165 = 16.50.",
        "You will pay $16.50 in interest on your cash advance.",
        "Protecting Your Finances Make your payments on time.",
        "The more late payments you make, the more likely the credit card company is to increase your APR.",
        "If you miss a payment, pay it as soon as possible.",
        "The company might report you to credit reporting agencies even before 30 days pass.",
        "This damages your credit rating in a way that takes a long time to undo.",
        "Keep your FICO score up by proving yourself to be a reliable debtor.",
        "Pay attention to rate increases.",
        "The law requires your credit card company to give you 45 days' notice before raising your interest rate.",
        "However, the company might not give you an explanation for the rate change.",
        "If you don't get an explanation, call your credit card company to find out why your rate was changed.",
        "If the company can't give you a good answer, it might be time to transfer your balance to another credit card.",
        "Good reasons to raise your rate include consistently missed payments or a low credit score.",
        "Try to lower your APR.",
        "Credit card companies are in the business of making money.",
        "They won’t lower your APR just because you're a good customer.",
        "If you want to be rewarded for your years of timely payments, you need to call your credit card company and convince it to change your rate.",
        "Before calling your credit card company, research what a fair APR for your FICO score would be.",
        "Then call your credit company and try to renegotiate your APR based on your research.",
        "If the company is unwilling to do so, it may make sense to transfer your balance to another credit card."
    ]
}