{
    "title": "How to Freeze Brownies",
    "url": "https://www.wikihow.com/Freeze-Brownies",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Food Preservation Techniques",
        "Freezing Food"
    ],
    "methods": [
        {
            "name": "Storing Individual Brownies",
            "steps": [
                {
                    "headline": "Cut the brownies into individual portions or bite-sized pieces.",
                    "description": "Let your brownies cool completely before cutting them into individual portions or bite-sized pieces. Consider how you’re going to serve the brownies in the future (e.g., school snacks, dessert, late-night nibbles), then cut your brownies up into the appropriate-sized portions. If you don’t have time to wait for your brownies to cool, you can ‘flash freeze’ them by placing them into the freezer for up to an hour before cutting them."
                },
                {
                    "headline": "Wrap brownies in plastic wrap and foil to freeze them for up to 3 months.",
                    "description": "If you know you’re going to be storing your brownies for more than a couple of weeks, you’ll want to wrap them in plastic and foil to prevent freezer burn. First, wrap each brownie in plastic wrap. Then, wrap each plastic-wrapped brownie in aluminum foil. Make sure the plastic wrap and foil completely cover each brownie to prevent freezer burn. If you’re only going to need to store your brownies in the freezer for up to 2 weeks, you can skip this step."
                },
                {
                    "headline": "Place the sliced brownies inside a freezer-safe plastic bag or container.",
                    "description": "Once your brownies are individually wrapped in plastic wrap and foil, you can place the brownies inside a freezer-safe plastic bag or container. If you know you’ll be eating your brownies within the next 2 weeks, you can place the unwrapped brownies directly into a freezer-safe plastic bag or container. Once packed, store the bag or container in the freezer. Brownies stored for only 1 or 2 weeks won’t have enough time in the freezer to develop freezer burn, so there’s no need to add extra layers like plastic wrap or foil."
                },
                {
                    "headline": "Consume unwrapped brownies within 2 weeks.",
                    "description": "For the brownies you only needed to store for up to a couple of weeks, you can simply open the plastic bag or container, remove a brownie (or two! ), and enjoy. If the brownie is too cold for you, put it on a plate and allow it to warm up to room temperature before eating it. Storing brownies in the freezer doesn’t turn them solid (like a block of ice), instead, it makes them chewier. As such, many people like to eat brownies directly from the freezer without first thawing them."
                },
                {
                    "headline": "Bring your brownies to room temperature before serving them.",
                    "description": "If you’re serving your brownies at an event (e.g., potluck, party), completely unwrap the brownies you want to serve and put them on a serving plate. Allow them to sit until they reach room temperature, which could take up to 2 hours. If you’re packing your brownies for lunch or a picnic, simply place the wrapped brownie into your lunch bag or picnic basket and they’ll be thawed by the time you’re ready to enjoy. You can save and reuse (or recycle) the aluminum foil if you’d like."
                }
            ]
        },
        {
            "name": "Freezing Your Brownies as a Block",
            "steps": [
                {
                    "headline": "Remove your newly baked brownies from the baking pan.",
                    "description": "Once your brownies are baked, allow them to cool down inside the baking pan until the pan is cool enough to touch and handle. Remove the brownies slab from the baking pan using a spatula and place it on a cooling rack. If you need an oven mitt to handle the baking pan, it’s not cooled down enough."
                },
                {
                    "headline": "Place the brownies slab on a metal baking tray with parchment or wax paper.",
                    "description": "Cover a clean metal baking tray with a layer of either parchment or wax paper. Lift the brownies slab with a spatula and place it on the tray, on top of the paper. A different type of tray (i.e., plastic) could work just as well, as long as it’s safe to put in the freezer. If possible, do not frost your brownies before storing them in the freezer."
                },
                {
                    "headline": "Put the tray with your brownies slab into the freezer to flash freeze it.",
                    "description": "Once the brownies slab is on the metal baking tray, place the entire tray in the freezer. Do not cover the brownies slab with anything. Leave the brownies slab in the freezer for up to an hour. If you don’t have enough room in your freezer for a metal baking tray, you can cut the brownies slab into small sections and use a small tray or freezer-safe container. This step is done in order to make the brownies less fragile so the entire slab can be handled without breaking. If you have frosted your brownies, make sure the frosting is solid before taking the tray out of the freezer."
                },
                {
                    "headline": "Wrap your brownies slab in plastic wrap and aluminum foil.",
                    "description": "Take the flash-frozen slab out of the freezer and cover it with a layer of plastic wrap. Make sure the plastic wrap covers the entire slab. Use more than one piece of plastic wrap if needed. Once the plastic wrap is done, add a layer of aluminum foil around the brownies slab. The combination of the plastic wrap and foil will prevent the brownies from getting freezer burn. If you aren’t able to obtain both plastic wrap and foil, you can use one or the other. Make sure the entire brownies slab is completely covered with either the plastic wrap or foil to prevent freezer burn."
                },
                {
                    "headline": "Store the wrapped brownies slab in a large plastic freezer bag for 3 months.",
                    "description": "Place the entire slab of brownies, wrapped in plastic wrap and foil, into a large plastic freezer bag. Remove all the air from inside the plastic freezer bag and seal the bag. Place the bagged brownies slab into your freezer. You can keep your brownies slab in the freezer for up to 3 months. If you don’t have a freezer bag large enough for the entire slab, cut your slab into smaller pieces first. Write “Brownies” and the date on the outside of the freezer bag with a marker so you remember what’s inside the bag."
                },
                {
                    "headline": "Cut your frozen brownies slab into individual portions before serving them.",
                    "description": "Once you’re ready to serve and enjoy your brownies, take them out of the freezer and out of the freezer bag, then unwrap them from both the foil and plastic wrap. Place the brownies slab on a cutting board or plate and cut them into the portions you want. You’ll find it easier to cut the brownies while they’re still frozen. You may need to use a serrated knife."
                },
                {
                    "headline": "Thaw your brownies to room temperature before frosting or eating them.",
                    "description": "Place your brownies onto a serving plate or into a storage container and allow them to thaw to room temperature. If you want to frost the brownies, you can do that once they’re thawed. If you need to frost your brownies, and you’d prefer to do that before they’re cut into serving portions, thaw the entire slab, then frost, then cut them."
                }
            ]
        }
    ],
    "tyn": [
        "Storing Individual Brownies",
        "Sharp knife",
        "Freezer bag or freezer-safe container",
        "Plastic wrap",
        "Aluminum foil",
        "Serving plate",
        "Freezing Your Brownies as a Block",
        "Parchment or wax paper",
        "Spatula",
        "Metal baking tray",
        "Large plastic freezer bag",
        "Sharp serrated knife",
        "Serving plate or storage container"
    ],
    "text": " Storing Individual Brownies Cut the brownies into individual portions or bite-sized pieces. Let your brownies cool completely before cutting them into individual portions or bite-sized pieces. Consider how you’re going to serve the brownies in the future (e.g., school snacks, dessert, late-night nibbles), then cut your brownies up into the appropriate-sized portions. If you don’t have time to wait for your brownies to cool, you can ‘flash freeze’ them by placing them into the freezer for up to an hour before cutting them. Wrap brownies in plastic wrap and foil to freeze them for up to 3 months. If you know you’re going to be storing your brownies for more than a couple of weeks, you’ll want to wrap them in plastic and foil to prevent freezer burn. First, wrap each brownie in plastic wrap. Then, wrap each plastic-wrapped brownie in aluminum foil. Make sure the plastic wrap and foil completely cover each brownie to prevent freezer burn. If you’re only going to need to store your brownies in the freezer for up to 2 weeks, you can skip this step. Place the sliced brownies inside a freezer-safe plastic bag or container. Once your brownies are individually wrapped in plastic wrap and foil, you can place the brownies inside a freezer-safe plastic bag or container. If you know you’ll be eating your brownies within the next 2 weeks, you can place the unwrapped brownies directly into a freezer-safe plastic bag or container. Once packed, store the bag or container in the freezer. Brownies stored for only 1 or 2 weeks won’t have enough time in the freezer to develop freezer burn, so there’s no need to add extra layers like plastic wrap or foil. Consume unwrapped brownies within 2 weeks. For the brownies you only needed to store for up to a couple of weeks, you can simply open the plastic bag or container, remove a brownie (or two! ), and enjoy. If the brownie is too cold for you, put it on a plate and allow it to warm up to room temperature before eating it. Storing brownies in the freezer doesn’t turn them solid (like a block of ice), instead, it makes them chewier. As such, many people like to eat brownies directly from the freezer without first thawing them. Bring your brownies to room temperature before serving them. If you’re serving your brownies at an event (e.g., potluck, party), completely unwrap the brownies you want to serve and put them on a serving plate. Allow them to sit until they reach room temperature, which could take up to 2 hours. If you’re packing your brownies for lunch or a picnic, simply place the wrapped brownie into your lunch bag or picnic basket and they’ll be thawed by the time you’re ready to enjoy. You can save and reuse (or recycle) the aluminum foil if you’d like. Freezing Your Brownies as a Block Remove your newly baked brownies from the baking pan. Once your brownies are baked, allow them to cool down inside the baking pan until the pan is cool enough to touch and handle. Remove the brownies slab from the baking pan using a spatula and place it on a cooling rack. If you need an oven mitt to handle the baking pan, it’s not cooled down enough. Place the brownies slab on a metal baking tray with parchment or wax paper. Cover a clean metal baking tray with a layer of either parchment or wax paper. Lift the brownies slab with a spatula and place it on the tray, on top of the paper. A different type of tray (i.e., plastic) could work just as well, as long as it’s safe to put in the freezer. If possible, do not frost your brownies before storing them in the freezer. Put the tray with your brownies slab into the freezer to flash freeze it. Once the brownies slab is on the metal baking tray, place the entire tray in the freezer. Do not cover the brownies slab with anything. Leave the brownies slab in the freezer for up to an hour. If you don’t have enough room in your freezer for a metal baking tray, you can cut the brownies slab into small sections and use a small tray or freezer-safe container. This step is done in order to make the brownies less fragile so the entire slab can be handled without breaking. If you have frosted your brownies, make sure the frosting is solid before taking the tray out of the freezer. Wrap your brownies slab in plastic wrap and aluminum foil. Take the flash-frozen slab out of the freezer and cover it with a layer of plastic wrap. Make sure the plastic wrap covers the entire slab. Use more than one piece of plastic wrap if needed. Once the plastic wrap is done, add a layer of aluminum foil around the brownies slab. The combination of the plastic wrap and foil will prevent the brownies from getting freezer burn. If you aren’t able to obtain both plastic wrap and foil, you can use one or the other. Make sure the entire brownies slab is completely covered with either the plastic wrap or foil to prevent freezer burn. Store the wrapped brownies slab in a large plastic freezer bag for 3 months. Place the entire slab of brownies, wrapped in plastic wrap and foil, into a large plastic freezer bag. Remove all the air from inside the plastic freezer bag and seal the bag. Place the bagged brownies slab into your freezer. You can keep your brownies slab in the freezer for up to 3 months. If you don’t have a freezer bag large enough for the entire slab, cut your slab into smaller pieces first. Write “Brownies” and the date on the outside of the freezer bag with a marker so you remember what’s inside the bag. Cut your frozen brownies slab into individual portions before serving them. Once you’re ready to serve and enjoy your brownies, take them out of the freezer and out of the freezer bag, then unwrap them from both the foil and plastic wrap. Place the brownies slab on a cutting board or plate and cut them into the portions you want. You’ll find it easier to cut the brownies while they’re still frozen. You may need to use a serrated knife. Thaw your brownies to room temperature before frosting or eating them. Place your brownies onto a serving plate or into a storage container and allow them to thaw to room temperature. If you want to frost the brownies, you can do that once they’re thawed. If you need to frost your brownies, and you’d prefer to do that before they’re cut into serving portions, thaw the entire slab, then frost, then cut them.",
    "sentences": [
        " Storing Individual Brownies Cut the brownies into individual portions or bite-sized pieces.",
        "Let your brownies cool completely before cutting them into individual portions or bite-sized pieces.",
        "Consider how you’re going to serve the brownies in the future (e.g., school snacks, dessert, late-night nibbles), then cut your brownies up into the appropriate-sized portions.",
        "If you don’t have time to wait for your brownies to cool, you can ‘flash freeze’ them by placing them into the freezer for up to an hour before cutting them.",
        "Wrap brownies in plastic wrap and foil to freeze them for up to 3 months.",
        "If you know you’re going to be storing your brownies for more than a couple of weeks, you’ll want to wrap them in plastic and foil to prevent freezer burn.",
        "First, wrap each brownie in plastic wrap.",
        "Then, wrap each plastic-wrapped brownie in aluminum foil.",
        "Make sure the plastic wrap and foil completely cover each brownie to prevent freezer burn.",
        "If you’re only going to need to store your brownies in the freezer for up to 2 weeks, you can skip this step.",
        "Place the sliced brownies inside a freezer-safe plastic bag or container.",
        "Once your brownies are individually wrapped in plastic wrap and foil, you can place the brownies inside a freezer-safe plastic bag or container.",
        "If you know you’ll be eating your brownies within the next 2 weeks, you can place the unwrapped brownies directly into a freezer-safe plastic bag or container.",
        "Once packed, store the bag or container in the freezer.",
        "Brownies stored for only 1 or 2 weeks won’t have enough time in the freezer to develop freezer burn, so there’s no need to add extra layers like plastic wrap or foil.",
        "Consume unwrapped brownies within 2 weeks.",
        "For the brownies you only needed to store for up to a couple of weeks, you can simply open the plastic bag or container, remove a brownie (or two!",
        "), and enjoy.",
        "If the brownie is too cold for you, put it on a plate and allow it to warm up to room temperature before eating it.",
        "Storing brownies in the freezer doesn’t turn them solid (like a block of ice), instead, it makes them chewier.",
        "As such, many people like to eat brownies directly from the freezer without first thawing them.",
        "Bring your brownies to room temperature before serving them.",
        "If you’re serving your brownies at an event (e.g., potluck, party), completely unwrap the brownies you want to serve and put them on a serving plate.",
        "Allow them to sit until they reach room temperature, which could take up to 2 hours.",
        "If you’re packing your brownies for lunch or a picnic, simply place the wrapped brownie into your lunch bag or picnic basket and they’ll be thawed by the time you’re ready to enjoy.",
        "You can save and reuse (or recycle) the aluminum foil if you’d like.",
        "Freezing Your Brownies as a Block Remove your newly baked brownies from the baking pan.",
        "Once your brownies are baked, allow them to cool down inside the baking pan until the pan is cool enough to touch and handle.",
        "Remove the brownies slab from the baking pan using a spatula and place it on a cooling rack.",
        "If you need an oven mitt to handle the baking pan, it’s not cooled down enough.",
        "Place the brownies slab on a metal baking tray with parchment or wax paper.",
        "Cover a clean metal baking tray with a layer of either parchment or wax paper.",
        "Lift the brownies slab with a spatula and place it on the tray, on top of the paper.",
        "A different type of tray (i.e., plastic) could work just as well, as long as it’s safe to put in the freezer.",
        "If possible, do not frost your brownies before storing them in the freezer.",
        "Put the tray with your brownies slab into the freezer to flash freeze it.",
        "Once the brownies slab is on the metal baking tray, place the entire tray in the freezer.",
        "Do not cover the brownies slab with anything.",
        "Leave the brownies slab in the freezer for up to an hour.",
        "If you don’t have enough room in your freezer for a metal baking tray, you can cut the brownies slab into small sections and use a small tray or freezer-safe container.",
        "This step is done in order to make the brownies less fragile so the entire slab can be handled without breaking.",
        "If you have frosted your brownies, make sure the frosting is solid before taking the tray out of the freezer.",
        "Wrap your brownies slab in plastic wrap and aluminum foil.",
        "Take the flash-frozen slab out of the freezer and cover it with a layer of plastic wrap.",
        "Make sure the plastic wrap covers the entire slab.",
        "Use more than one piece of plastic wrap if needed.",
        "Once the plastic wrap is done, add a layer of aluminum foil around the brownies slab.",
        "The combination of the plastic wrap and foil will prevent the brownies from getting freezer burn.",
        "If you aren’t able to obtain both plastic wrap and foil, you can use one or the other.",
        "Make sure the entire brownies slab is completely covered with either the plastic wrap or foil to prevent freezer burn.",
        "Store the wrapped brownies slab in a large plastic freezer bag for 3 months.",
        "Place the entire slab of brownies, wrapped in plastic wrap and foil, into a large plastic freezer bag.",
        "Remove all the air from inside the plastic freezer bag and seal the bag.",
        "Place the bagged brownies slab into your freezer.",
        "You can keep your brownies slab in the freezer for up to 3 months.",
        "If you don’t have a freezer bag large enough for the entire slab, cut your slab into smaller pieces first.",
        "Write “Brownies” and the date on the outside of the freezer bag with a marker so you remember what’s inside the bag.",
        "Cut your frozen brownies slab into individual portions before serving them.",
        "Once you’re ready to serve and enjoy your brownies, take them out of the freezer and out of the freezer bag, then unwrap them from both the foil and plastic wrap.",
        "Place the brownies slab on a cutting board or plate and cut them into the portions you want.",
        "You’ll find it easier to cut the brownies while they’re still frozen.",
        "You may need to use a serrated knife.",
        "Thaw your brownies to room temperature before frosting or eating them.",
        "Place your brownies onto a serving plate or into a storage container and allow them to thaw to room temperature.",
        "If you want to frost the brownies, you can do that once they’re thawed.",
        "If you need to frost your brownies, and you’d prefer to do that before they’re cut into serving portions, thaw the entire slab, then frost, then cut them."
    ]
}