{
    "title": "How to Preserve Curry Leaves",
    "url": "https://www.wikihow.com/Preserve-Curry-Leaves",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Food Preservation Techniques"
    ],
    "methods": [
        {
            "name": "Drying Curry Leaves",
            "steps": [
                {
                    "headline": "Rinse the leaves in cool water.",
                    "description": "Gently wash your curry leaves to remove and dirt that might be on them. Set your leaves in a strainer or a bowl and run cool water over the leaves to wash them all. Try not to wash any down your drain or into your sink. If your curry leaves have stems on them, remove those before you wash them."
                },
                {
                    "headline": "Pat the leaves dry with a dry cloth.",
                    "description": "You can also spin your leaves in a salad spinner if you have one. Get the majority of the excess water off of your curry leaves by gently patting them dry with a cloth or paper towel. Do not rub or wipe the leaves or you could damage them. The leaves do not have to be completely dry at this point."
                },
                {
                    "headline": "Spread the leaves out on a large plate or baking sheet.",
                    "description": "Depending on how many leaves you have, choose a large plate or a large baking sheet to spread out your leaves. Make sure they are not overlapping too much so that they dry out quicker. If you have a lot of leaves, use multiple trays or plates. If you have a thali, a round metal platter used to serve food, you can use that instead of a baking tray or plate."
                },
                {
                    "headline": "Cover the leaves with a cloth towel.",
                    "description": "To avoid getting dirt on your leaves or having them blow away, place a towel over the top of your leaves. Cover all of the leaves with your towel."
                },
                {
                    "headline": "Dry the leaves in your home for 2 to 3 days.",
                    "description": "Do not put your curry leaves in a spot where they will get direct sunlight. Instead, find a spot in your home that your leaves can rest undisturbed. Leave them in this spot for 2 to 3 days until the leaves are crispy to the touch.Warning: Do not place your leaves directly in the sun. This will remove a lot of flavor from the curry leaves. If you live in a dry climate, you can set your curry leaves outside in the shade. Make sure it isn’t windy, or your leaves could blow away."
                },
                {
                    "headline": "Store your leaves in an airtight container for up to 6 months.",
                    "description": "Your dried curry leaves will stay flavorful for about 6 months. Keep them in an airtight container and get them out when you want to use them in a recipe. If your leaves crumble in the container, use the crushed up leaves in your recipe instead of whole leaves. Dry curry leaves will grind down and blend much easier than fresh curry leaves."
                }
            ]
        },
        {
            "name": "Freezing Your Curry Leaves",
            "steps": [
                {
                    "headline": "Rinse your curry leaves in cool water and dry them with a cloth.",
                    "description": "Run cool water over all of your curry leaves to remove any dirt or debris that may be on them. Hold the leaves in your hand or set them in a strainer to make sure none get washed into your sink. Pat your curry leaves dry with a clean towel or cloth. Remove as much excess water as you can so that your leaves dry faster."
                },
                {
                    "headline": "Set your leaves on a towel to dry for 1 hour.",
                    "description": "Any excess water your leaves are holding will freeze with them in the freezer, and could make them soggy when you thaw them out. Leave your curry leaves on a clean, dry towel to dry out fully. Make sure there are no leaves on top of each other to make them dry faster.Tip: If you live in a dry climate, you can set them outside to dry with a towel over them so they don’t blow away."
                },
                {
                    "headline": "Seal the leaves in an airtight container.",
                    "description": "Use a plastic container with a lid or a sealed plastic bag. Choose a container that is big enough not to squish any of your leaves. They can be sitting on top of each other if need be."
                },
                {
                    "headline": "Put them in the freezer for up to 3 months.",
                    "description": "Store your curry leaves in the freezer for up to 3 months. To use them in recipes, take them out of the freezer and put them directly into your dish. You do not need to thaw your leaves before you use them. Frozen curry leaves will have a fresher smell and taste than dried curry leaves, but they do not last as long."
                }
            ]
        }
    ],
    "tyn": [
        "Drying Curry Leaves",
        "Dry cloth",
        "Large plate or baking sheet",
        "Freezing Your Curry Leaves",
        "Airtight container"
    ],
    "text": " Drying Curry Leaves Rinse the leaves in cool water. Gently wash your curry leaves to remove and dirt that might be on them. Set your leaves in a strainer or a bowl and run cool water over the leaves to wash them all. Try not to wash any down your drain or into your sink. If your curry leaves have stems on them, remove those before you wash them. Pat the leaves dry with a dry cloth. You can also spin your leaves in a salad spinner if you have one. Get the majority of the excess water off of your curry leaves by gently patting them dry with a cloth or paper towel. Do not rub or wipe the leaves or you could damage them. The leaves do not have to be completely dry at this point. Spread the leaves out on a large plate or baking sheet. Depending on how many leaves you have, choose a large plate or a large baking sheet to spread out your leaves. Make sure they are not overlapping too much so that they dry out quicker. If you have a lot of leaves, use multiple trays or plates. If you have a thali, a round metal platter used to serve food, you can use that instead of a baking tray or plate. Cover the leaves with a cloth towel. To avoid getting dirt on your leaves or having them blow away, place a towel over the top of your leaves. Cover all of the leaves with your towel. Dry the leaves in your home for 2 to 3 days. Do not put your curry leaves in a spot where they will get direct sunlight. Instead, find a spot in your home that your leaves can rest undisturbed. Leave them in this spot for 2 to 3 days until the leaves are crispy to the touch.Warning: Do not place your leaves directly in the sun. This will remove a lot of flavor from the curry leaves. If you live in a dry climate, you can set your curry leaves outside in the shade. Make sure it isn’t windy, or your leaves could blow away. Store your leaves in an airtight container for up to 6 months. Your dried curry leaves will stay flavorful for about 6 months. Keep them in an airtight container and get them out when you want to use them in a recipe. If your leaves crumble in the container, use the crushed up leaves in your recipe instead of whole leaves. Dry curry leaves will grind down and blend much easier than fresh curry leaves. Freezing Your Curry Leaves Rinse your curry leaves in cool water and dry them with a cloth. Run cool water over all of your curry leaves to remove any dirt or debris that may be on them. Hold the leaves in your hand or set them in a strainer to make sure none get washed into your sink. Pat your curry leaves dry with a clean towel or cloth. Remove as much excess water as you can so that your leaves dry faster. Set your leaves on a towel to dry for 1 hour. Any excess water your leaves are holding will freeze with them in the freezer, and could make them soggy when you thaw them out. Leave your curry leaves on a clean, dry towel to dry out fully. Make sure there are no leaves on top of each other to make them dry faster.Tip: If you live in a dry climate, you can set them outside to dry with a towel over them so they don’t blow away. Seal the leaves in an airtight container. Use a plastic container with a lid or a sealed plastic bag. Choose a container that is big enough not to squish any of your leaves. They can be sitting on top of each other if need be. Put them in the freezer for up to 3 months. Store your curry leaves in the freezer for up to 3 months. To use them in recipes, take them out of the freezer and put them directly into your dish. You do not need to thaw your leaves before you use them. Frozen curry leaves will have a fresher smell and taste than dried curry leaves, but they do not last as long.",
    "sentences": [
        " Drying Curry Leaves Rinse the leaves in cool water.",
        "Gently wash your curry leaves to remove and dirt that might be on them.",
        "Set your leaves in a strainer or a bowl and run cool water over the leaves to wash them all.",
        "Try not to wash any down your drain or into your sink.",
        "If your curry leaves have stems on them, remove those before you wash them.",
        "Pat the leaves dry with a dry cloth.",
        "You can also spin your leaves in a salad spinner if you have one.",
        "Get the majority of the excess water off of your curry leaves by gently patting them dry with a cloth or paper towel.",
        "Do not rub or wipe the leaves or you could damage them.",
        "The leaves do not have to be completely dry at this point.",
        "Spread the leaves out on a large plate or baking sheet.",
        "Depending on how many leaves you have, choose a large plate or a large baking sheet to spread out your leaves.",
        "Make sure they are not overlapping too much so that they dry out quicker.",
        "If you have a lot of leaves, use multiple trays or plates.",
        "If you have a thali, a round metal platter used to serve food, you can use that instead of a baking tray or plate.",
        "Cover the leaves with a cloth towel.",
        "To avoid getting dirt on your leaves or having them blow away, place a towel over the top of your leaves.",
        "Cover all of the leaves with your towel.",
        "Dry the leaves in your home for 2 to 3 days.",
        "Do not put your curry leaves in a spot where they will get direct sunlight.",
        "Instead, find a spot in your home that your leaves can rest undisturbed.",
        "Leave them in this spot for 2 to 3 days until the leaves are crispy to the touch.Warning: Do not place your leaves directly in the sun.",
        "This will remove a lot of flavor from the curry leaves.",
        "If you live in a dry climate, you can set your curry leaves outside in the shade.",
        "Make sure it isn’t windy, or your leaves could blow away.",
        "Store your leaves in an airtight container for up to 6 months.",
        "Your dried curry leaves will stay flavorful for about 6 months.",
        "Keep them in an airtight container and get them out when you want to use them in a recipe.",
        "If your leaves crumble in the container, use the crushed up leaves in your recipe instead of whole leaves.",
        "Dry curry leaves will grind down and blend much easier than fresh curry leaves.",
        "Freezing Your Curry Leaves Rinse your curry leaves in cool water and dry them with a cloth.",
        "Run cool water over all of your curry leaves to remove any dirt or debris that may be on them.",
        "Hold the leaves in your hand or set them in a strainer to make sure none get washed into your sink.",
        "Pat your curry leaves dry with a clean towel or cloth.",
        "Remove as much excess water as you can so that your leaves dry faster.",
        "Set your leaves on a towel to dry for 1 hour.",
        "Any excess water your leaves are holding will freeze with them in the freezer, and could make them soggy when you thaw them out.",
        "Leave your curry leaves on a clean, dry towel to dry out fully.",
        "Make sure there are no leaves on top of each other to make them dry faster.Tip: If you live in a dry climate, you can set them outside to dry with a towel over them so they don’t blow away.",
        "Seal the leaves in an airtight container.",
        "Use a plastic container with a lid or a sealed plastic bag.",
        "Choose a container that is big enough not to squish any of your leaves.",
        "They can be sitting on top of each other if need be.",
        "Put them in the freezer for up to 3 months.",
        "Store your curry leaves in the freezer for up to 3 months.",
        "To use them in recipes, take them out of the freezer and put them directly into your dish.",
        "You do not need to thaw your leaves before you use them.",
        "Frozen curry leaves will have a fresher smell and taste than dried curry leaves, but they do not last as long."
    ]
}