{
    "title": "How to Flush a Radiator",
    "url": "https://www.wikihow.com/Flush-a-Radiator",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Maintenance and Repair",
        "Car Engines",
        "Engine Cooling Parts"
    ],
    "parts": [
        {
            "name": "Draining Old Fluids",
            "steps": [
                {
                    "headline": "Start working when your engine is cool to the touch.",
                    "description": "Wait at least 30 minutes after you’ve driven your vehicle to start flushing the radiator. Hold your hand above the engine block to determine how warm it still is. The fluids inside your vehicle will be extremely hot if you try to drain them after operating it."
                },
                {
                    "headline": "Wear rubber gloves and safety glasses.",
                    "description": "Rubber gloves will help keep your hands clean while working with dirty fluids and the inside of your vehicle. Wear safety glasses to protect you while you’re underneath your vehicle and prevent any splashing fluids to get in your eyes. Antifreeze is poisonous and could cause irritation or serious damage if it is ingested or comes into contact with your skin and eyes."
                },
                {
                    "headline": "Jack the front of your vehicle so you can fit a drainage pan underneath.",
                    "description": "Place the jack so it lifts the metal frame underneath your car. Use the lever to lift your car off the ground. Put on the parking brake so your car doesn’t move while you’re working on it. Slide a large pan or bucket that can hold at least 2 gallons (7.6 L) underneath the radiator. Use jack stands to make your vehicle more secure. Do not let old antifreeze run down a drain or into the street since it could be detrimental to the environment. Use a bucket with a built-in spout so you can easily pour old antifreeze into another container."
                },
                {
                    "headline": "Lift the hood of your vehicle and locate the radiator.",
                    "description": "The radiator is a long, narrow metal tank usually at the front of your vehicle and next to the engine. Check the tubing for any cracks or rust. If you notice problems like this, take your car to a mechanic or find replacement parts at a local car parts store. If the radiator is visibly dirty, use a nylon brush and soapy water to clean the exterior surface."
                },
                {
                    "headline": "Twist off the pressure cap on top of the radiator.",
                    "description": "The pressure cap is a large disc-shaped cover where you’ll add new antifreeze once it’s completely drained. Turn the cap slowly counter-clockwise to loosen it and remove the cap. Keep the cap in a place you can easily access so it doesn’t fall in between the components of your vehicle."
                },
                {
                    "headline": "Release the drain plug, or petcock, on the underside of the radiator.",
                    "description": "Reach underneath the bumper of the driver’s side your vehicle and check for a valve or plug in the corner of your radiator. It will be a small opening at the bottom of the metal tank. It may require a screwdriver or socket wrench to completely remove the plug. Slowly open the valve over the pan."
                },
                {
                    "headline": "Let the liquids drain completely before resealing the plug.",
                    "description": "There could be 2 gallons (7.6 L) of antifreeze draining from the radiator. Let it fill the tray you’ve placed underneath the plug. Once the liquid stops, seal the drain valve again. Pour the drained antifreeze into old plastic jugs and clearly label them. Check with your local hazardous waste control to find out how to properly dispose of your antifreeze."
                }
            ]
        },
        {
            "name": "Cleaning inside the Radiator",
            "steps": [
                {
                    "headline": "Pour radiator cleaner and distilled water into the radiator.",
                    "description": "Add the fluids into the radiator reservoir where you removed the pressure cap. Use a funnel to make sure all of the cleaner and water gets inside. Pour the full bottle of cleaner into the radiator first, followed by 1 gallon (3.8 L) of distilled water. Put the pressure cap back on once you’ve filled the radiator. Radiator cleaner can be purchased at your local automotive store. Distilled water does not contain added minerals and will add to the life of your radiator. Make sure the funnel you’re using is strictly meant for automotive work. Don’t use the same funnel you would use in the kitchen. Consult with your vehicle’s owner manual to see if they recommend a specific cleaner or amount to use."
                },
                {
                    "headline": "Turn your vehicle on with the heat on full blast for 5 minutes.",
                    "description": "Turn the key in the ignition so the engine starts. The cleaner and water will work its way through the entire cooling system of your car to remove any residue of old antifreeze. Make sure you’re working in a well ventilated area. If you’re working in a garage, make sure the door is open so the fumes can escape."
                },
                {
                    "headline": "Turn off the engine and let it cool for 15 minutes.",
                    "description": "Ensure that the engine is cool to the touch before you move on. The cleaner and water will be hot after running through your vehicle and hurt you if you touch it."
                },
                {
                    "headline": "Open the pressure cap and petcock to drain the radiator.",
                    "description": "Make sure the drainage pan is underneath the petcock to catch the cleaner and distilled water. The water may be brown or rust-colored after working through the entire cooling system."
                },
                {
                    "headline": "Flush the radiator with tap water until the drainage runs clear.",
                    "description": "Repeat filling the radiator with 1 gallon (3.8 L) of tap water, running the car with the heat on, and draining it once it’s cooled. Once the water runs clear, flush the system one last time with distilled water. Tap water has minerals that could cause the interior of your cooling system to rust earlier than it typically would."
                }
            ]
        },
        {
            "name": "Refilling the Radiator",
            "steps": [
                {
                    "headline": "Mix ⁄2 US gal (1.9 L) of antifreeze with ⁄2 US gal (1.9 L) of distilled water.",
                    "description": "Use the empty jug from the distilled water you used earlier as a mixing container. Pour the antifreeze from the side of the spout to prevent spillage until the jug is halfway full. Fill the rest of the jug with distilled water. Purchase a 50/50 antifreeze mixture from an automotive store to avoid mixing the solution yourself."
                },
                {
                    "headline": "Pour the antifreeze mixture into the radiator where you removed the pressure cap.",
                    "description": "Check your vehicle’s manual to determine how much antifreeze you should add. Use a funnel to ensure all of the solution makes it inside. Pour slowly since the liquid may back up into the funnel. Make sure to fill the radiator to the fill line."
                },
                {
                    "headline": "Start your vehicle to pull the antifreeze into your cooling system.",
                    "description": "The antifreeze won’t completely drain from the funnel, so turn on your vehicle with the heat on full blast to pull the remaining fluid in. Once the funnel is empty, remove it and replace the pressure cap. Let the car run for 15 minutes so the new antifreeze can be pulled through the entire system."
                },
                {
                    "headline": "Top off the radiator until it is full.",
                    "description": "Turn off the engine and let your car cool for 15 minute minutes before removing the pressure cap again. Check to see if the antifreeze is level with the fill line inside the radiator. If not, add more of the solution. Any other leftover solution can be poured into the overflow container or save it until the next time you need to flush your system."
                }
            ]
        }
    ],
    "tyn": [
        "Rubber gloves",
        "Safety glasses",
        "Car jack and jack stands",
        "Drainage tray or bucket",
        "Funnel",
        "Radiator cleaner",
        "Distilled water",
        "Antifreeze",
        "Empty containers"
    ],
    "text": " Draining Old Fluids Start working when your engine is cool to the touch. Wait at least 30 minutes after you’ve driven your vehicle to start flushing the radiator. Hold your hand above the engine block to determine how warm it still is. The fluids inside your vehicle will be extremely hot if you try to drain them after operating it. Wear rubber gloves and safety glasses. Rubber gloves will help keep your hands clean while working with dirty fluids and the inside of your vehicle. Wear safety glasses to protect you while you’re underneath your vehicle and prevent any splashing fluids to get in your eyes. Antifreeze is poisonous and could cause irritation or serious damage if it is ingested or comes into contact with your skin and eyes. Jack the front of your vehicle so you can fit a drainage pan underneath. Place the jack so it lifts the metal frame underneath your car. Use the lever to lift your car off the ground. Put on the parking brake so your car doesn’t move while you’re working on it. Slide a large pan or bucket that can hold at least 2 gallons (7.6 L) underneath the radiator. Use jack stands to make your vehicle more secure. Do not let old antifreeze run down a drain or into the street since it could be detrimental to the environment. Use a bucket with a built-in spout so you can easily pour old antifreeze into another container. Lift the hood of your vehicle and locate the radiator. The radiator is a long, narrow metal tank usually at the front of your vehicle and next to the engine. Check the tubing for any cracks or rust. If you notice problems like this, take your car to a mechanic or find replacement parts at a local car parts store. If the radiator is visibly dirty, use a nylon brush and soapy water to clean the exterior surface. Twist off the pressure cap on top of the radiator. The pressure cap is a large disc-shaped cover where you’ll add new antifreeze once it’s completely drained. Turn the cap slowly counter-clockwise to loosen it and remove the cap. Keep the cap in a place you can easily access so it doesn’t fall in between the components of your vehicle. Release the drain plug, or petcock, on the underside of the radiator. Reach underneath the bumper of the driver’s side your vehicle and check for a valve or plug in the corner of your radiator. It will be a small opening at the bottom of the metal tank. It may require a screwdriver or socket wrench to completely remove the plug. Slowly open the valve over the pan. Let the liquids drain completely before resealing the plug. There could be 2 gallons (7.6 L) of antifreeze draining from the radiator. Let it fill the tray you’ve placed underneath the plug. Once the liquid stops, seal the drain valve again. Pour the drained antifreeze into old plastic jugs and clearly label them. Check with your local hazardous waste control to find out how to properly dispose of your antifreeze. Cleaning inside the Radiator Pour radiator cleaner and distilled water into the radiator. Add the fluids into the radiator reservoir where you removed the pressure cap. Use a funnel to make sure all of the cleaner and water gets inside. Pour the full bottle of cleaner into the radiator first, followed by 1 gallon (3.8 L) of distilled water. Put the pressure cap back on once you’ve filled the radiator. Radiator cleaner can be purchased at your local automotive store. Distilled water does not contain added minerals and will add to the life of your radiator. Make sure the funnel you’re using is strictly meant for automotive work. Don’t use the same funnel you would use in the kitchen. Consult with your vehicle’s owner manual to see if they recommend a specific cleaner or amount to use. Turn your vehicle on with the heat on full blast for 5 minutes. Turn the key in the ignition so the engine starts. The cleaner and water will work its way through the entire cooling system of your car to remove any residue of old antifreeze. Make sure you’re working in a well ventilated area. If you’re working in a garage, make sure the door is open so the fumes can escape. Turn off the engine and let it cool for 15 minutes. Ensure that the engine is cool to the touch before you move on. The cleaner and water will be hot after running through your vehicle and hurt you if you touch it. Open the pressure cap and petcock to drain the radiator. Make sure the drainage pan is underneath the petcock to catch the cleaner and distilled water. The water may be brown or rust-colored after working through the entire cooling system. Flush the radiator with tap water until the drainage runs clear. Repeat filling the radiator with 1 gallon (3.8 L) of tap water, running the car with the heat on, and draining it once it’s cooled. Once the water runs clear, flush the system one last time with distilled water. Tap water has minerals that could cause the interior of your cooling system to rust earlier than it typically would. Refilling the Radiator Mix ⁄2 US gal (1.9 L) of antifreeze with ⁄2 US gal (1.9 L) of distilled water. Use the empty jug from the distilled water you used earlier as a mixing container. Pour the antifreeze from the side of the spout to prevent spillage until the jug is halfway full. Fill the rest of the jug with distilled water. Purchase a 50/50 antifreeze mixture from an automotive store to avoid mixing the solution yourself. Pour the antifreeze mixture into the radiator where you removed the pressure cap. Check your vehicle’s manual to determine how much antifreeze you should add. Use a funnel to ensure all of the solution makes it inside. Pour slowly since the liquid may back up into the funnel. Make sure to fill the radiator to the fill line. Start your vehicle to pull the antifreeze into your cooling system. The antifreeze won’t completely drain from the funnel, so turn on your vehicle with the heat on full blast to pull the remaining fluid in. Once the funnel is empty, remove it and replace the pressure cap. Let the car run for 15 minutes so the new antifreeze can be pulled through the entire system. Top off the radiator until it is full. Turn off the engine and let your car cool for 15 minute minutes before removing the pressure cap again. Check to see if the antifreeze is level with the fill line inside the radiator. If not, add more of the solution. Any other leftover solution can be poured into the overflow container or save it until the next time you need to flush your system.",
    "sentences": [
        " Draining Old Fluids Start working when your engine is cool to the touch.",
        "Wait at least 30 minutes after you’ve driven your vehicle to start flushing the radiator.",
        "Hold your hand above the engine block to determine how warm it still is.",
        "The fluids inside your vehicle will be extremely hot if you try to drain them after operating it.",
        "Wear rubber gloves and safety glasses.",
        "Rubber gloves will help keep your hands clean while working with dirty fluids and the inside of your vehicle.",
        "Wear safety glasses to protect you while you’re underneath your vehicle and prevent any splashing fluids to get in your eyes.",
        "Antifreeze is poisonous and could cause irritation or serious damage if it is ingested or comes into contact with your skin and eyes.",
        "Jack the front of your vehicle so you can fit a drainage pan underneath.",
        "Place the jack so it lifts the metal frame underneath your car.",
        "Use the lever to lift your car off the ground.",
        "Put on the parking brake so your car doesn’t move while you’re working on it.",
        "Slide a large pan or bucket that can hold at least 2 gallons (7.6 L) underneath the radiator.",
        "Use jack stands to make your vehicle more secure.",
        "Do not let old antifreeze run down a drain or into the street since it could be detrimental to the environment.",
        "Use a bucket with a built-in spout so you can easily pour old antifreeze into another container.",
        "Lift the hood of your vehicle and locate the radiator.",
        "The radiator is a long, narrow metal tank usually at the front of your vehicle and next to the engine.",
        "Check the tubing for any cracks or rust.",
        "If you notice problems like this, take your car to a mechanic or find replacement parts at a local car parts store.",
        "If the radiator is visibly dirty, use a nylon brush and soapy water to clean the exterior surface.",
        "Twist off the pressure cap on top of the radiator.",
        "The pressure cap is a large disc-shaped cover where you’ll add new antifreeze once it’s completely drained.",
        "Turn the cap slowly counter-clockwise to loosen it and remove the cap.",
        "Keep the cap in a place you can easily access so it doesn’t fall in between the components of your vehicle.",
        "Release the drain plug, or petcock, on the underside of the radiator.",
        "Reach underneath the bumper of the driver’s side your vehicle and check for a valve or plug in the corner of your radiator.",
        "It will be a small opening at the bottom of the metal tank.",
        "It may require a screwdriver or socket wrench to completely remove the plug.",
        "Slowly open the valve over the pan.",
        "Let the liquids drain completely before resealing the plug.",
        "There could be 2 gallons (7.6 L) of antifreeze draining from the radiator.",
        "Let it fill the tray you’ve placed underneath the plug.",
        "Once the liquid stops, seal the drain valve again.",
        "Pour the drained antifreeze into old plastic jugs and clearly label them.",
        "Check with your local hazardous waste control to find out how to properly dispose of your antifreeze.",
        "Cleaning inside the Radiator Pour radiator cleaner and distilled water into the radiator.",
        "Add the fluids into the radiator reservoir where you removed the pressure cap.",
        "Use a funnel to make sure all of the cleaner and water gets inside.",
        "Pour the full bottle of cleaner into the radiator first, followed by 1 gallon (3.8 L) of distilled water.",
        "Put the pressure cap back on once you’ve filled the radiator.",
        "Radiator cleaner can be purchased at your local automotive store.",
        "Distilled water does not contain added minerals and will add to the life of your radiator.",
        "Make sure the funnel you’re using is strictly meant for automotive work.",
        "Don’t use the same funnel you would use in the kitchen.",
        "Consult with your vehicle’s owner manual to see if they recommend a specific cleaner or amount to use.",
        "Turn your vehicle on with the heat on full blast for 5 minutes.",
        "Turn the key in the ignition so the engine starts.",
        "The cleaner and water will work its way through the entire cooling system of your car to remove any residue of old antifreeze.",
        "Make sure you’re working in a well ventilated area.",
        "If you’re working in a garage, make sure the door is open so the fumes can escape.",
        "Turn off the engine and let it cool for 15 minutes.",
        "Ensure that the engine is cool to the touch before you move on.",
        "The cleaner and water will be hot after running through your vehicle and hurt you if you touch it.",
        "Open the pressure cap and petcock to drain the radiator.",
        "Make sure the drainage pan is underneath the petcock to catch the cleaner and distilled water.",
        "The water may be brown or rust-colored after working through the entire cooling system.",
        "Flush the radiator with tap water until the drainage runs clear.",
        "Repeat filling the radiator with 1 gallon (3.8 L) of tap water, running the car with the heat on, and draining it once it’s cooled.",
        "Once the water runs clear, flush the system one last time with distilled water.",
        "Tap water has minerals that could cause the interior of your cooling system to rust earlier than it typically would.",
        "Refilling the Radiator Mix ⁄2 US gal (1.9 L) of antifreeze with ⁄2 US gal (1.9 L) of distilled water.",
        "Use the empty jug from the distilled water you used earlier as a mixing container.",
        "Pour the antifreeze from the side of the spout to prevent spillage until the jug is halfway full.",
        "Fill the rest of the jug with distilled water.",
        "Purchase a 50/50 antifreeze mixture from an automotive store to avoid mixing the solution yourself.",
        "Pour the antifreeze mixture into the radiator where you removed the pressure cap.",
        "Check your vehicle’s manual to determine how much antifreeze you should add.",
        "Use a funnel to ensure all of the solution makes it inside.",
        "Pour slowly since the liquid may back up into the funnel.",
        "Make sure to fill the radiator to the fill line.",
        "Start your vehicle to pull the antifreeze into your cooling system.",
        "The antifreeze won’t completely drain from the funnel, so turn on your vehicle with the heat on full blast to pull the remaining fluid in.",
        "Once the funnel is empty, remove it and replace the pressure cap.",
        "Let the car run for 15 minutes so the new antifreeze can be pulled through the entire system.",
        "Top off the radiator until it is full.",
        "Turn off the engine and let your car cool for 15 minute minutes before removing the pressure cap again.",
        "Check to see if the antifreeze is level with the fill line inside the radiator.",
        "If not, add more of the solution.",
        "Any other leftover solution can be poured into the overflow container or save it until the next time you need to flush your system."
    ]
}