{
    "title": "How to Hang a Kayak in Your Garage",
    "url": "https://www.wikihow.com/Hang-a-Kayak-in-Your-Garage",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Canoeing and Kayaking",
        "Kayaks"
    ],
    "methods": [
        {
            "name": "Putting up Wall Hangers",
            "steps": [
                {
                    "headline": "Find the wooden support beams in the wall with a stud finder.",
                    "description": "A stud finder is an electronic device that beeps when it is pointed at the wood beams framing the walls. These beams are spread out evenly along each wall. Go to where you plan on hanging the kayak and check for studs. Mark their locations with a pencil so you can use them later to secure the wall hanger. For stability, the wall hanger has to connect to the studs. It can’t be installed over drywall or else it will come out and leave your garage with an unsightly hole."
                },
                {
                    "headline": "Measure the length of the kayak to determine where to place the hangers.",
                    "description": "Stretch a tape measure between the kayak’s bulkheads, which are the watertight compartments before and after the seat in the center. They are about ¼ of the way from the kayak’s ends. After taking the measurement, compare it to the space you have available and the location of the studs in your garage. Make sure the kayak will fit in the area you plan on using. The center part of the kayak is heaviest, so position the hangers underneath it instead of the ends. It will help protect your kayak from damage."
                },
                {
                    "headline": "Position the hangers on the wall and mark their location.",
                    "description": "Outline the hangers in pencil if you need to. The most important part is noting where the screws will go. Look for the screw holes on the hangers, then mark these spots on the walls. Make sure they align with the studs. Double-check that the marks are in the correct spot before you start drilling. Make sure they are spaced according to the kayak’s length."
                },
                {
                    "headline": "Screw the arm hangers to the wall with steel screws.",
                    "description": "Arm hangers often come with screws you can use to connect them to the studs in your garage’s walls. If you need to buy screws, try using ones that are ⁄32 in (0.56 cm) wide and 3 in (7.6 cm) long. Hold the hangers against the wall, fit the screws into the holes, then secure them with a cordless screwdriver. Work gradually when securing the screws. Tighten them so the heads are level with the wall. Overtightening them could damage the threads or the wall. Touch the arm hangers and try to move them. If they feel loose, they may not be able to support the kayak. Tighten the screws as needed."
                },
                {
                    "headline": "Fit the kayak on top of the hanging arms.",
                    "description": "Pick up the kayak and turn it on its side. Face the kayak’s bottom edge toward the wall. Make sure the hanging arms are stable and positioned correctly. Once you’re sure everything is good, leave the kayak alone so you can install the remaining hangers. Mounting the kayak now will give you a better idea of where to position the eye hooks. You could also measure the kayak’s width and use it to position the hooks."
                },
                {
                    "headline": "Drill pilot holes 1 to 2 in (2.5 to 5.1 cm) above the kayak.",
                    "description": "Choose a drill bit that is slightly smaller than the hangers you plan on using. If you’re going to use eye screws that are ⁄8 in (0.95 cm)-wide, use a ⁄4 in (0.64 cm)-wide drill bit. Drill about 3 in (7.6 cm) into the wood. Make 1 hole on the left side and another on the right, or 2 holes total. Make the pilot holes on the studs directly above the arm hangers. If they are too distant from the hangers, they won’t be as effective at strapping the kayak in place."
                },
                {
                    "headline": "Make another pair of pilot holes about 1 in (2.5 cm) from the hanger arms.",
                    "description": "Position these holes near the bottom edge of the hanger arm and underneath the kayak. Try to keep them aligned with the upper holes as much as possible. These holes will be used to strap the kayak to the wall to reduce the chances of it falling off the mount. Keep these holes near the arm hangers so they are close to the bulkheads. This will give you plenty of opportunity to tie up the heaviest part of the kayak."
                },
                {
                    "headline": "Install eye hooks in each of the holes by turning them clockwise by hand.",
                    "description": "Eye hooks have threaded ends that fit into the pilot holes. Turn them until they are all the way into the wood and secure. The opposite ends of the hooks are rings that provide an attachment point for cords you can use to secure the kayak."
                },
                {
                    "headline": "Secure the kayak to the mount with a pair of bungee cords.",
                    "description": "Select a pair of elastic cords that have hooks on both ends. Connect the cords to the lower eye hooks, then attach them to the corresponding upper hooks. Make sure the cords are tight against the kayak so there is no way it can fall off the arm hangers if someone bumps it. If the kayak isn’t secure enough for you, use more cords. Try hooking carabiners to some rope and wrapping it around the ends of the kayak. Latch the carabiners to the eye hooks to keep the rope tight against the kayak."
                }
            ]
        },
        {
            "name": "Using a Ceiling Hanger",
            "steps": [
                {
                    "headline": "Measure the length and width of your kayak with measuring tape.",
                    "description": "Measure the distance between the kayak’s bulkheads, which are the watertight compartments right before and after the seat in the center. Then, for the width, measure the middle part of the kayak where it is widest. The widest part will be where the seat is. These measurements are necessary for spacing out the supports used to suspend the kayak. The bulkheads are about ¼ of the way from the kayak’s ends. The middle part of the kayak is the heaviest part, so it needs additional support. If you use the total length of the kayak when measuring, the suspension system will only support the nose and tail."
                },
                {
                    "headline": "Use a stud finder to locate the joists in the ceiling.",
                    "description": "The suspension system has to be bolted to these wooden support beams for stability. Using a stepping stool, climb up to where you plan on hanging the kayak and listen for the stud finder to beep. Mark the locations of the studs in pencil. The hardware used to hang the kayak should never be set over bare drywall. The kayak’s weight could tear the screws straight out of the wall. Finding the supports not only leads to a sturdier hanging system, but it protects your garage from damage! Stud finders are available online or at most hardware stores. While you’re shopping, pick up the other tools needed to hang your kayak."
                },
                {
                    "headline": "Mark installation points according to the kayak’s length and width.",
                    "description": "Climb back up on a stepping stool and use a tape measure to determine where to hang the kayak. Use the bulkhead length first. Then, measure side to side according to the width and the position of the nearest joists. The hanging system requires 4 total spots, which means 2 on the left and 2 on the right. The joists may not line up exactly with your measurements, but that is fine. Work with the nearest ones. The installation points may be spaced a little further apart compared to the kayak’s width, but it won’t affect anything. Remember to center the installation points along the joists. If you attempt to attach the screws to drywall, they won’t hold."
                },
                {
                    "headline": "Drill pilot holes through the marked spots with a power drill.",
                    "description": "The holes should always be a little smaller than the hangers you plan on installing. For a basic hanging system, try using a ⁄4 in (0.64 cm) drill bit. Drill about 1 ⁄2 in (3.8 cm) into the joists at each mark. Match the drill bit to the type of material making up your garage’s ceiling. Use a standard wood-safe drill bit for most garages. If you’re drilling through stone, choose a masonry bit instead."
                },
                {
                    "headline": "Screw eye hooks by hand into the pilot holes.",
                    "description": "An eye hook is a type of hanger that is threaded like a screw on one end and has a loop on the other. Choose eye hooks that are a size wider than the holes you made. Try using ⁄8 in (0.95 cm) screws for ⁄4 in (0.64 cm)-wide pilot holes. Then, insert the threaded end of a screw into a pilot hole and turn it clockwise until it is firmly inside the wood. Match the length of the threaded end of each screw to the depth of your pilot holes. For example, use a 1 ⁄2 in (3.8 cm)-long screw for a pilot hole with the same depth. The length of the hook end isn’t very important, so you can choose whatever size is available."
                },
                {
                    "headline": "Run tie-down straps between the left and right hooks.",
                    "description": "Tie-down straps are very easy to use since they have plastic hooks that latch onto the eye screws. Hook the end of one strap to an eye screw on the left and a corresponding one on the right. Do the same with the opposite pair of screws. This will leave you with a pair of straps hanging in a U-shape, ready to hold up the kayak. Tie-down straps are available online and at most hardware stores. If you’re looking for a hanging system that allows you to raise and lower the kayak, buy a ceiling hoist or make one yourself. One way to do this is by attaching metal pulleys to the eye hooks, then tying the kayak to hooks placed on the bottom of the pulleys."
                },
                {
                    "headline": "Lift the kayak onto the tie-down straps.",
                    "description": "Pick it up and slide it through the straps from the back. Position it so the first strap is about ⁄4 in (0.64 cm) from its nose, aligned with the first bulkhead. The rear strap will be ⁄4 in (0.64 cm) and aligned with the rear bulkhead. Make sure the kayak is well-supported and secure. When you’re ready to remove the kayak, you can slide it back out from between the straps. In the meantime, the straps allow you to easily access the underside and interior for cleaning."
                }
            ]
        },
        {
            "name": "Installing a Pre-Built Hanger",
            "steps": [
                {
                    "headline": "Purchase a hanger that fits where you plan on placing the kayak.",
                    "description": "The most common and inexpensive hangers are ones that mount on the wall. However, there are also ceiling hangers you can buy if you wish to suspend the kayak. When choosing hangers, keep in mind your storage space. Make sure you get the right type of hanger. Hanging systems are available online. Some hardware stores may have them available. Check sporting good stores as well."
                },
                {
                    "headline": "Measure the length of the kayak before installing the hangers.",
                    "description": "Kayaks come in different sizes, so figure out where the watertight bulkheads are on yours. They are about ¼ of the way from the ends and surround the central compartment. Use a tape measure to determine the distance between them. Plan on installing the mounts for the hanging system near the bulkheads. The central part of the kayak is the heaviest. By placing them near the bulkheads, the hanging system is better able to support the kayak’s weight."
                },
                {
                    "headline": "Mark the position of the hangers on the wall in pencil.",
                    "description": "Use the kayak’s length measurement to place the hangers. Start on one end and hold the hanger mount up to the wall. Outline it with a pencil, noting the location of the screw holes. Measure out and repeat this with the opposite mount. Make sure the mounting brackets are positioned correctly before attempting to install them."
                },
                {
                    "headline": "Screw the mounts to the wall with steel screws.",
                    "description": "Hold the mounts against the wall, lining them up with the outline you drew. Then, place the screws and use a cordless screwdriver to drive them into your garage. Tighten the screws so their heads are roughly level with the surrounding wall. Stop when you feel resistance and can no longer rotate them clockwise with ease. The mounting system you bought will come with screws, so you won’t need to buy any. Note that the hardware will vary depending on what mounting system you buy. If you’re unclear about how to install a part, refer to the manufacturer’s instructions."
                },
                {
                    "headline": "Fit the kayak on top of the mounts.",
                    "description": "Pick up the kayak and slide it onto the mounts. If you’re using a wall mount, rotate the kayak so its on its side with the bottom surface facing the wall. If you’re using a ceiling mount, look for straps that attach to the mounts. They have to be connected first before you can suspend the kayak. Ceiling mounts usually have straps that hang from hooks and pulleys. The straps form loops that you slide the kayak through to hang it."
                },
                {
                    "headline": "Connect the straps to the mount if the hanging system has any.",
                    "description": "Wall mounts often include a couple of straps that tie to the mounts in order to hold the kayak in place. The straps often hook onto metal rings on the ends of the mount. Make sure the straps are tight against the kayak so it can’t get knocked down while it’s in storage. For ceiling mounts, you may need to wrap the straps around pulleys used to raise and lower the kayak. The exact setup can vary a lot depending on the mounting system, so check the manufacturer’s instructions for more information."
                }
            ]
        }
    ],
    "tyn": [
        "Using a Wall Hanger",
        "Stud finder",
        "Measuring tape",
        "Pencil",
        "4 ",
        "7⁄32",
        "7",
        "⁄",
        "32",
        " in × 3 in (0.56 cm × 7.62 cm) steel screws",
        "Cordless screwdriver",
        "Drill",
        "1⁄4",
        "1",
        "4",
        " in (0.64 cm)-wide drill bit",
        "3⁄8",
        "3",
        "8",
        " in (0.95 cm)-wide eye hooks",
        "2 bungee cords",
        "Using a Ceiling Hanger",
        "Stepping stool",
        "2 tie-down straps",
        "Installing a Pre-Built Hanger",
        "Mounting system",
        "Screws",
        "Mounting brackets",
        "Tie-down straps or cords"
    ],
    "text": " Putting up Wall Hangers Find the wooden support beams in the wall with a stud finder. A stud finder is an electronic device that beeps when it is pointed at the wood beams framing the walls. These beams are spread out evenly along each wall. Go to where you plan on hanging the kayak and check for studs. Mark their locations with a pencil so you can use them later to secure the wall hanger. For stability, the wall hanger has to connect to the studs. It can’t be installed over drywall or else it will come out and leave your garage with an unsightly hole. Measure the length of the kayak to determine where to place the hangers. Stretch a tape measure between the kayak’s bulkheads, which are the watertight compartments before and after the seat in the center. They are about ¼ of the way from the kayak’s ends. After taking the measurement, compare it to the space you have available and the location of the studs in your garage. Make sure the kayak will fit in the area you plan on using. The center part of the kayak is heaviest, so position the hangers underneath it instead of the ends. It will help protect your kayak from damage. Position the hangers on the wall and mark their location. Outline the hangers in pencil if you need to. The most important part is noting where the screws will go. Look for the screw holes on the hangers, then mark these spots on the walls. Make sure they align with the studs. Double-check that the marks are in the correct spot before you start drilling. Make sure they are spaced according to the kayak’s length. Screw the arm hangers to the wall with steel screws. Arm hangers often come with screws you can use to connect them to the studs in your garage’s walls. If you need to buy screws, try using ones that are ⁄32 in (0.56 cm) wide and 3 in (7.6 cm) long. Hold the hangers against the wall, fit the screws into the holes, then secure them with a cordless screwdriver. Work gradually when securing the screws. Tighten them so the heads are level with the wall. Overtightening them could damage the threads or the wall. Touch the arm hangers and try to move them. If they feel loose, they may not be able to support the kayak. Tighten the screws as needed. Fit the kayak on top of the hanging arms. Pick up the kayak and turn it on its side. Face the kayak’s bottom edge toward the wall. Make sure the hanging arms are stable and positioned correctly. Once you’re sure everything is good, leave the kayak alone so you can install the remaining hangers. Mounting the kayak now will give you a better idea of where to position the eye hooks. You could also measure the kayak’s width and use it to position the hooks. Drill pilot holes 1 to 2 in (2.5 to 5.1 cm) above the kayak. Choose a drill bit that is slightly smaller than the hangers you plan on using. If you’re going to use eye screws that are ⁄8 in (0.95 cm)-wide, use a ⁄4 in (0.64 cm)-wide drill bit. Drill about 3 in (7.6 cm) into the wood. Make 1 hole on the left side and another on the right, or 2 holes total. Make the pilot holes on the studs directly above the arm hangers. If they are too distant from the hangers, they won’t be as effective at strapping the kayak in place. Make another pair of pilot holes about 1 in (2.5 cm) from the hanger arms. Position these holes near the bottom edge of the hanger arm and underneath the kayak. Try to keep them aligned with the upper holes as much as possible. These holes will be used to strap the kayak to the wall to reduce the chances of it falling off the mount. Keep these holes near the arm hangers so they are close to the bulkheads. This will give you plenty of opportunity to tie up the heaviest part of the kayak. Install eye hooks in each of the holes by turning them clockwise by hand. Eye hooks have threaded ends that fit into the pilot holes. Turn them until they are all the way into the wood and secure. The opposite ends of the hooks are rings that provide an attachment point for cords you can use to secure the kayak. Secure the kayak to the mount with a pair of bungee cords. Select a pair of elastic cords that have hooks on both ends. Connect the cords to the lower eye hooks, then attach them to the corresponding upper hooks. Make sure the cords are tight against the kayak so there is no way it can fall off the arm hangers if someone bumps it. If the kayak isn’t secure enough for you, use more cords. Try hooking carabiners to some rope and wrapping it around the ends of the kayak. Latch the carabiners to the eye hooks to keep the rope tight against the kayak. Using a Ceiling Hanger Measure the length and width of your kayak with measuring tape. Measure the distance between the kayak’s bulkheads, which are the watertight compartments right before and after the seat in the center. Then, for the width, measure the middle part of the kayak where it is widest. The widest part will be where the seat is. These measurements are necessary for spacing out the supports used to suspend the kayak. The bulkheads are about ¼ of the way from the kayak’s ends. The middle part of the kayak is the heaviest part, so it needs additional support. If you use the total length of the kayak when measuring, the suspension system will only support the nose and tail. Use a stud finder to locate the joists in the ceiling. The suspension system has to be bolted to these wooden support beams for stability. Using a stepping stool, climb up to where you plan on hanging the kayak and listen for the stud finder to beep. Mark the locations of the studs in pencil. The hardware used to hang the kayak should never be set over bare drywall. The kayak’s weight could tear the screws straight out of the wall. Finding the supports not only leads to a sturdier hanging system, but it protects your garage from damage! Stud finders are available online or at most hardware stores. While you’re shopping, pick up the other tools needed to hang your kayak. Mark installation points according to the kayak’s length and width. Climb back up on a stepping stool and use a tape measure to determine where to hang the kayak. Use the bulkhead length first. Then, measure side to side according to the width and the position of the nearest joists. The hanging system requires 4 total spots, which means 2 on the left and 2 on the right. The joists may not line up exactly with your measurements, but that is fine. Work with the nearest ones. The installation points may be spaced a little further apart compared to the kayak’s width, but it won’t affect anything. Remember to center the installation points along the joists. If you attempt to attach the screws to drywall, they won’t hold. Drill pilot holes through the marked spots with a power drill. The holes should always be a little smaller than the hangers you plan on installing. For a basic hanging system, try using a ⁄4 in (0.64 cm) drill bit. Drill about 1 ⁄2 in (3.8 cm) into the joists at each mark. Match the drill bit to the type of material making up your garage’s ceiling. Use a standard wood-safe drill bit for most garages. If you’re drilling through stone, choose a masonry bit instead. Screw eye hooks by hand into the pilot holes. An eye hook is a type of hanger that is threaded like a screw on one end and has a loop on the other. Choose eye hooks that are a size wider than the holes you made. Try using ⁄8 in (0.95 cm) screws for ⁄4 in (0.64 cm)-wide pilot holes. Then, insert the threaded end of a screw into a pilot hole and turn it clockwise until it is firmly inside the wood. Match the length of the threaded end of each screw to the depth of your pilot holes. For example, use a 1 ⁄2 in (3.8 cm)-long screw for a pilot hole with the same depth. The length of the hook end isn’t very important, so you can choose whatever size is available. Run tie-down straps between the left and right hooks. Tie-down straps are very easy to use since they have plastic hooks that latch onto the eye screws. Hook the end of one strap to an eye screw on the left and a corresponding one on the right. Do the same with the opposite pair of screws. This will leave you with a pair of straps hanging in a U-shape, ready to hold up the kayak. Tie-down straps are available online and at most hardware stores. If you’re looking for a hanging system that allows you to raise and lower the kayak, buy a ceiling hoist or make one yourself. One way to do this is by attaching metal pulleys to the eye hooks, then tying the kayak to hooks placed on the bottom of the pulleys. Lift the kayak onto the tie-down straps. Pick it up and slide it through the straps from the back. Position it so the first strap is about ⁄4 in (0.64 cm) from its nose, aligned with the first bulkhead. The rear strap will be ⁄4 in (0.64 cm) and aligned with the rear bulkhead. Make sure the kayak is well-supported and secure. When you’re ready to remove the kayak, you can slide it back out from between the straps. In the meantime, the straps allow you to easily access the underside and interior for cleaning. Installing a Pre-Built Hanger Purchase a hanger that fits where you plan on placing the kayak. The most common and inexpensive hangers are ones that mount on the wall. However, there are also ceiling hangers you can buy if you wish to suspend the kayak. When choosing hangers, keep in mind your storage space. Make sure you get the right type of hanger. Hanging systems are available online. Some hardware stores may have them available. Check sporting good stores as well. Measure the length of the kayak before installing the hangers. Kayaks come in different sizes, so figure out where the watertight bulkheads are on yours. They are about ¼ of the way from the ends and surround the central compartment. Use a tape measure to determine the distance between them. Plan on installing the mounts for the hanging system near the bulkheads. The central part of the kayak is the heaviest. By placing them near the bulkheads, the hanging system is better able to support the kayak’s weight. Mark the position of the hangers on the wall in pencil. Use the kayak’s length measurement to place the hangers. Start on one end and hold the hanger mount up to the wall. Outline it with a pencil, noting the location of the screw holes. Measure out and repeat this with the opposite mount. Make sure the mounting brackets are positioned correctly before attempting to install them. Screw the mounts to the wall with steel screws. Hold the mounts against the wall, lining them up with the outline you drew. Then, place the screws and use a cordless screwdriver to drive them into your garage. Tighten the screws so their heads are roughly level with the surrounding wall. Stop when you feel resistance and can no longer rotate them clockwise with ease. The mounting system you bought will come with screws, so you won’t need to buy any. Note that the hardware will vary depending on what mounting system you buy. If you’re unclear about how to install a part, refer to the manufacturer’s instructions. Fit the kayak on top of the mounts. Pick up the kayak and slide it onto the mounts. If you’re using a wall mount, rotate the kayak so its on its side with the bottom surface facing the wall. If you’re using a ceiling mount, look for straps that attach to the mounts. They have to be connected first before you can suspend the kayak. Ceiling mounts usually have straps that hang from hooks and pulleys. The straps form loops that you slide the kayak through to hang it. Connect the straps to the mount if the hanging system has any. Wall mounts often include a couple of straps that tie to the mounts in order to hold the kayak in place. The straps often hook onto metal rings on the ends of the mount. Make sure the straps are tight against the kayak so it can’t get knocked down while it’s in storage. For ceiling mounts, you may need to wrap the straps around pulleys used to raise and lower the kayak. The exact setup can vary a lot depending on the mounting system, so check the manufacturer’s instructions for more information.",
    "sentences": [
        " Putting up Wall Hangers Find the wooden support beams in the wall with a stud finder.",
        "A stud finder is an electronic device that beeps when it is pointed at the wood beams framing the walls.",
        "These beams are spread out evenly along each wall.",
        "Go to where you plan on hanging the kayak and check for studs.",
        "Mark their locations with a pencil so you can use them later to secure the wall hanger.",
        "For stability, the wall hanger has to connect to the studs.",
        "It can’t be installed over drywall or else it will come out and leave your garage with an unsightly hole.",
        "Measure the length of the kayak to determine where to place the hangers.",
        "Stretch a tape measure between the kayak’s bulkheads, which are the watertight compartments before and after the seat in the center.",
        "They are about ¼ of the way from the kayak’s ends.",
        "After taking the measurement, compare it to the space you have available and the location of the studs in your garage.",
        "Make sure the kayak will fit in the area you plan on using.",
        "The center part of the kayak is heaviest, so position the hangers underneath it instead of the ends.",
        "It will help protect your kayak from damage.",
        "Position the hangers on the wall and mark their location.",
        "Outline the hangers in pencil if you need to.",
        "The most important part is noting where the screws will go.",
        "Look for the screw holes on the hangers, then mark these spots on the walls.",
        "Make sure they align with the studs.",
        "Double-check that the marks are in the correct spot before you start drilling.",
        "Make sure they are spaced according to the kayak’s length.",
        "Screw the arm hangers to the wall with steel screws.",
        "Arm hangers often come with screws you can use to connect them to the studs in your garage’s walls.",
        "If you need to buy screws, try using ones that are ⁄32 in (0.56 cm) wide and 3 in (7.6 cm) long.",
        "Hold the hangers against the wall, fit the screws into the holes, then secure them with a cordless screwdriver.",
        "Work gradually when securing the screws.",
        "Tighten them so the heads are level with the wall.",
        "Overtightening them could damage the threads or the wall.",
        "Touch the arm hangers and try to move them.",
        "If they feel loose, they may not be able to support the kayak.",
        "Tighten the screws as needed.",
        "Fit the kayak on top of the hanging arms.",
        "Pick up the kayak and turn it on its side.",
        "Face the kayak’s bottom edge toward the wall.",
        "Make sure the hanging arms are stable and positioned correctly.",
        "Once you’re sure everything is good, leave the kayak alone so you can install the remaining hangers.",
        "Mounting the kayak now will give you a better idea of where to position the eye hooks.",
        "You could also measure the kayak’s width and use it to position the hooks.",
        "Drill pilot holes 1 to 2 in (2.5 to 5.1 cm) above the kayak.",
        "Choose a drill bit that is slightly smaller than the hangers you plan on using.",
        "If you’re going to use eye screws that are ⁄8 in (0.95 cm)-wide, use a ⁄4 in (0.64 cm)-wide drill bit.",
        "Drill about 3 in (7.6 cm) into the wood.",
        "Make 1 hole on the left side and another on the right, or 2 holes total.",
        "Make the pilot holes on the studs directly above the arm hangers.",
        "If they are too distant from the hangers, they won’t be as effective at strapping the kayak in place.",
        "Make another pair of pilot holes about 1 in (2.5 cm) from the hanger arms.",
        "Position these holes near the bottom edge of the hanger arm and underneath the kayak.",
        "Try to keep them aligned with the upper holes as much as possible.",
        "These holes will be used to strap the kayak to the wall to reduce the chances of it falling off the mount.",
        "Keep these holes near the arm hangers so they are close to the bulkheads.",
        "This will give you plenty of opportunity to tie up the heaviest part of the kayak.",
        "Install eye hooks in each of the holes by turning them clockwise by hand.",
        "Eye hooks have threaded ends that fit into the pilot holes.",
        "Turn them until they are all the way into the wood and secure.",
        "The opposite ends of the hooks are rings that provide an attachment point for cords you can use to secure the kayak.",
        "Secure the kayak to the mount with a pair of bungee cords.",
        "Select a pair of elastic cords that have hooks on both ends.",
        "Connect the cords to the lower eye hooks, then attach them to the corresponding upper hooks.",
        "Make sure the cords are tight against the kayak so there is no way it can fall off the arm hangers if someone bumps it.",
        "If the kayak isn’t secure enough for you, use more cords.",
        "Try hooking carabiners to some rope and wrapping it around the ends of the kayak.",
        "Latch the carabiners to the eye hooks to keep the rope tight against the kayak.",
        "Using a Ceiling Hanger Measure the length and width of your kayak with measuring tape.",
        "Measure the distance between the kayak’s bulkheads, which are the watertight compartments right before and after the seat in the center.",
        "Then, for the width, measure the middle part of the kayak where it is widest.",
        "The widest part will be where the seat is.",
        "These measurements are necessary for spacing out the supports used to suspend the kayak.",
        "The bulkheads are about ¼ of the way from the kayak’s ends.",
        "The middle part of the kayak is the heaviest part, so it needs additional support.",
        "If you use the total length of the kayak when measuring, the suspension system will only support the nose and tail.",
        "Use a stud finder to locate the joists in the ceiling.",
        "The suspension system has to be bolted to these wooden support beams for stability.",
        "Using a stepping stool, climb up to where you plan on hanging the kayak and listen for the stud finder to beep.",
        "Mark the locations of the studs in pencil.",
        "The hardware used to hang the kayak should never be set over bare drywall.",
        "The kayak’s weight could tear the screws straight out of the wall.",
        "Finding the supports not only leads to a sturdier hanging system, but it protects your garage from damage!",
        "Stud finders are available online or at most hardware stores.",
        "While you’re shopping, pick up the other tools needed to hang your kayak.",
        "Mark installation points according to the kayak’s length and width.",
        "Climb back up on a stepping stool and use a tape measure to determine where to hang the kayak.",
        "Use the bulkhead length first.",
        "Then, measure side to side according to the width and the position of the nearest joists.",
        "The hanging system requires 4 total spots, which means 2 on the left and 2 on the right.",
        "The joists may not line up exactly with your measurements, but that is fine.",
        "Work with the nearest ones.",
        "The installation points may be spaced a little further apart compared to the kayak’s width, but it won’t affect anything.",
        "Remember to center the installation points along the joists.",
        "If you attempt to attach the screws to drywall, they won’t hold.",
        "Drill pilot holes through the marked spots with a power drill.",
        "The holes should always be a little smaller than the hangers you plan on installing.",
        "For a basic hanging system, try using a ⁄4 in (0.64 cm) drill bit.",
        "Drill about 1 ⁄2 in (3.8 cm) into the joists at each mark.",
        "Match the drill bit to the type of material making up your garage’s ceiling.",
        "Use a standard wood-safe drill bit for most garages.",
        "If you’re drilling through stone, choose a masonry bit instead.",
        "Screw eye hooks by hand into the pilot holes.",
        "An eye hook is a type of hanger that is threaded like a screw on one end and has a loop on the other.",
        "Choose eye hooks that are a size wider than the holes you made.",
        "Try using ⁄8 in (0.95 cm) screws for ⁄4 in (0.64 cm)-wide pilot holes.",
        "Then, insert the threaded end of a screw into a pilot hole and turn it clockwise until it is firmly inside the wood.",
        "Match the length of the threaded end of each screw to the depth of your pilot holes.",
        "For example, use a 1 ⁄2 in (3.8 cm)-long screw for a pilot hole with the same depth.",
        "The length of the hook end isn’t very important, so you can choose whatever size is available.",
        "Run tie-down straps between the left and right hooks.",
        "Tie-down straps are very easy to use since they have plastic hooks that latch onto the eye screws.",
        "Hook the end of one strap to an eye screw on the left and a corresponding one on the right.",
        "Do the same with the opposite pair of screws.",
        "This will leave you with a pair of straps hanging in a U-shape, ready to hold up the kayak.",
        "Tie-down straps are available online and at most hardware stores.",
        "If you’re looking for a hanging system that allows you to raise and lower the kayak, buy a ceiling hoist or make one yourself.",
        "One way to do this is by attaching metal pulleys to the eye hooks, then tying the kayak to hooks placed on the bottom of the pulleys.",
        "Lift the kayak onto the tie-down straps.",
        "Pick it up and slide it through the straps from the back.",
        "Position it so the first strap is about ⁄4 in (0.64 cm) from its nose, aligned with the first bulkhead.",
        "The rear strap will be ⁄4 in (0.64 cm) and aligned with the rear bulkhead.",
        "Make sure the kayak is well-supported and secure.",
        "When you’re ready to remove the kayak, you can slide it back out from between the straps.",
        "In the meantime, the straps allow you to easily access the underside and interior for cleaning.",
        "Installing a Pre-Built Hanger Purchase a hanger that fits where you plan on placing the kayak.",
        "The most common and inexpensive hangers are ones that mount on the wall.",
        "However, there are also ceiling hangers you can buy if you wish to suspend the kayak.",
        "When choosing hangers, keep in mind your storage space.",
        "Make sure you get the right type of hanger.",
        "Hanging systems are available online.",
        "Some hardware stores may have them available.",
        "Check sporting good stores as well.",
        "Measure the length of the kayak before installing the hangers.",
        "Kayaks come in different sizes, so figure out where the watertight bulkheads are on yours.",
        "They are about ¼ of the way from the ends and surround the central compartment.",
        "Use a tape measure to determine the distance between them.",
        "Plan on installing the mounts for the hanging system near the bulkheads.",
        "The central part of the kayak is the heaviest.",
        "By placing them near the bulkheads, the hanging system is better able to support the kayak’s weight.",
        "Mark the position of the hangers on the wall in pencil.",
        "Use the kayak’s length measurement to place the hangers.",
        "Start on one end and hold the hanger mount up to the wall.",
        "Outline it with a pencil, noting the location of the screw holes.",
        "Measure out and repeat this with the opposite mount.",
        "Make sure the mounting brackets are positioned correctly before attempting to install them.",
        "Screw the mounts to the wall with steel screws.",
        "Hold the mounts against the wall, lining them up with the outline you drew.",
        "Then, place the screws and use a cordless screwdriver to drive them into your garage.",
        "Tighten the screws so their heads are roughly level with the surrounding wall.",
        "Stop when you feel resistance and can no longer rotate them clockwise with ease.",
        "The mounting system you bought will come with screws, so you won’t need to buy any.",
        "Note that the hardware will vary depending on what mounting system you buy.",
        "If you’re unclear about how to install a part, refer to the manufacturer’s instructions.",
        "Fit the kayak on top of the mounts.",
        "Pick up the kayak and slide it onto the mounts.",
        "If you’re using a wall mount, rotate the kayak so its on its side with the bottom surface facing the wall.",
        "If you’re using a ceiling mount, look for straps that attach to the mounts.",
        "They have to be connected first before you can suspend the kayak.",
        "Ceiling mounts usually have straps that hang from hooks and pulleys.",
        "The straps form loops that you slide the kayak through to hang it.",
        "Connect the straps to the mount if the hanging system has any.",
        "Wall mounts often include a couple of straps that tie to the mounts in order to hold the kayak in place.",
        "The straps often hook onto metal rings on the ends of the mount.",
        "Make sure the straps are tight against the kayak so it can’t get knocked down while it’s in storage.",
        "For ceiling mounts, you may need to wrap the straps around pulleys used to raise and lower the kayak.",
        "The exact setup can vary a lot depending on the mounting system, so check the manufacturer’s instructions for more information."
    ]
}