{
    "title": "How to Drink Ginger",
    "url": "https://www.wikihow.com/Drink-Ginger",
    "category_hierarchy": [
        "Food and Entertaining",
        "Herbs and Spices"
    ],
    "methods": [
        {
            "name": "Brewing Ginger Tea",
            "steps": [
                {
                    "headline": "Peel 3 1-inch (2.5-cm) pieces of ginger.",
                    "description": "Cut or break 3 approximately 1-inch (2.5-cm) pieces of ginger from a bigger piece of ginger root. Use a vegetable peeler or paring knife to slice the skin off the pieces.Tip: Ginger tea is nutritious and has immune-boosting, anti-inflammatory, and detoxifying properties It’s especially good to drink if you feel like you’re getting a cold or flu. Don’t worry if you don’t peel the pieces of ginger perfectly. It’s fine if there are some small pieces of skin left on."
                },
                {
                    "headline": "Slice the peeled ginger into thin rounds.",
                    "description": "Place the peeled pieces of ginger on a cutting board. Use a paring knife or other sharp knife to carefully cut them into thin medallions. The exact thickness of the rounds doesn’t matter. Just cut them as thin as you are comfortable with."
                },
                {
                    "headline": "Boil 4 cups (946 mL) of water in a saucepan over medium-high heat.",
                    "description": "Fill a medium-sized saucepan with 4 cups (946 mL) of water. Place it on a burner over medium-high heat and bring it to a boil. Don’t use the maximum heat because the water might boil over."
                },
                {
                    "headline": "Put the ginger slices in the water and let them boil for 15 minutes.",
                    "description": "Carefully drop the ginger rounds you cut into the boiling water. Leave them boiling for about 15 minutes to brew the ginger tea. Keep an eye on the saucepan and turn down the heat if the water looks like it is about to boil over at any point."
                },
                {
                    "headline": "Pour the tea through a strainer to remove the ginger slices.",
                    "description": "Place a strainer over another pot or large serving vessel of some kind. Carefully pour the brewed tea through the strainer to filter out the ginger. You can discard the ginger pieces at this point. The tea is ready to drink."
                },
                {
                    "headline": "Serve the tea with lemon and honey to taste if desired.",
                    "description": "Fill a mug with the brewed ginger tea. Put 1-2 lemon rounds and 1-2 tbsp (15-30 mL) of honey in the tea and stir it. Enjoy your ginger tea! You can also drink the tea plain or garnish it with anything else of your choosing. For example, you could try it with a cinnamon stick or 1/4 tsp (1 g) of powdered cinnamon. You could add 1/4 tsp (1 g) of powdered turmeric to a cup of ginger tea for an added herbal boost. Feel free to store the brewed tea in your refrigerator or serve it over ice to enjoy it cold."
                }
            ]
        },
        {
            "name": "Making Lemon-Ginger Water",
            "steps": [
                {
                    "headline": "Peel a 2-inch (5-cm) piece of ginger.",
                    "description": "Use a vegetable peeler or paring knife to peel the skin off an approximately 2-inch (5-cm) piece of ginger. It’s OK if some small pieces of skin are still on the ginger as you will be straining the lemon-ginger water before drinking it.Tip: The combination of ginger and lemon in this recipe makes for a beverage with lots of detoxification, anti-inflammatory, and immune-boosting properties. Drink a serving in the morning or sip it throughout the day as part of a healthy, balanced diet. After you have made this recipe once, you can adjust the amount of ginger to make the lemon-ginger water stronger or weaker according to your personal tastes."
                },
                {
                    "headline": "Place the ginger with lemon juice, water, and honey in a blender.",
                    "description": "Put the peeled piece of ginger in a blender with 1/2 a cup (118 mL) of lemon juice and 1/2 a cup (118 mL) of water. Add 4  tsp (20 mL) of honey. As with the ginger, you can adjust the amounts of lemon juice and honey after you’ve become familiar with this recipe to alter the taste depending on your preferences."
                },
                {
                    "headline": "Blend all the ingredients for 20-30 seconds at high speed.",
                    "description": "Put the lid on the blender and turn it on to high speed. Let the ingredients blend together for 20-30 seconds or until everything looks evenly mixed. If your blender has a pulse button, you can start by pressing it 2-3 times before turning the blender on at high speed. This can help the ingredients start mixing together more easily."
                },
                {
                    "headline": "Strain the mixture into mason jars or a pitcher.",
                    "description": "Pour the mixture out of the blender through a strainer into 4 quart-sized (946-mL) mason jars or a 1-gallon (3785-mL) pitcher. Make sure that you have lids for whichever vessels you choose to pour it into. Mason jars are a good option if you want to be able to take some lemon-ginger water with you on the go. A pitcher is fine if you just plan on drinking the lemon-ginger water at home."
                },
                {
                    "headline": "Top the mason jars or pitcher up with water and put the lids on.",
                    "description": "Fill the mason jars or pitcher close to the top with plain water. Screw the lids on the mason jars or cover the pitcher with its lid. The mixture will be very strong on its own, so topping it off with plain water dilutes it and makes it into an enjoyable beverage to drink."
                },
                {
                    "headline": "Store the lemon-ginger water in the fridge and drink it when you like.",
                    "description": "Place the mason jars or pitcher into your refrigerator. Grab a mason jar of lemon-ginger water when you want to take it out the door with you or pour some lemon-ginger water from the pitcher into a glass when you want to enjoy it at home. You can serve lemon-ginger water with a slice or two of fresh lemon for a garnish and added lemon flavor if you like. This beverage will stay good for about a week when stored in the fridge."
                }
            ]
        },
        {
            "name": "Mixing a Ginger Switchel",
            "steps": [
                {
                    "headline": "Combine apple cider vinegar, ginger, sweetener, and water in a jar or glass.",
                    "description": "Put 2 US tbsp (30 mL) of apple cider vinegar, 4  tsp (20 mL) of honey, maple syrup, or molasses, and 1/4 tsp (1 g) of ground ginger or 1 tsp (4 g) of fresh grated ginger in a jar or glass. Pour in 1 cup (236 mL) of water.Tip: A ginger switchel is an old-fashioned ginger and apple cider vinegar drink. It combines the immune-boosting and detoxifying properties of fresh or ground ginger with the health benefits of apple cider vinegar, such as its bacteria-killing and cholesterol-lowering effects. Molasses is the traditional sweetener used to make ginger snaps, but you can use what you have available or prefer. If you want to use granulated sugar instead of a liquid sweetener, use 4 tsp (16 g) of sugar."
                },
                {
                    "headline": "Cover and refrigerate the mixture for at least 2 hours and up to 1 day.",
                    "description": "Put a lid on the jar if you used a jar or cover the glass with plastic wrap if you used a glass. Stick the mixture in the refrigerator and leave it for at least 2 hours and up to 1 full day to let the flavors combine. After you’ve made this recipe once, feel free to adjust the ratios of ingredients and the amount of time you let it sit to alter the recipe to your taste."
                },
                {
                    "headline": "Shake or stir the mixture before serving it.",
                    "description": "Shake the mixture together in the jar or stir it in the glass before serving it to mix the ingredients together well. Pour it into a glass with ice or drink it on its own. If you used fresh grated ginger and you don’t want any pieces of ginger in the beverage, you can strain it through a fine-mesh strainer or cheesecloth before serving it. If you want a more mild flavor, mix the ginger switchel with soda water to taste to dilute it before drinking it."
                }
            ]
        }
    ],
    "tyn": [
        "Brewing Ginger Tea",
        "Cutting board",
        "Vegetable peeler (optional)",
        "Paring knife",
        "Saucepan",
        "Strainer",
        "Mug",
        "Making Lemon-Ginger Water",
        "Blender",
        "Vegetable peeler or paring knife",
        "4 quart-sized (946-mL) mason jars or 1-gallon (3785-mL) pitcher",
        "Mixing a Ginger Switchel",
        "Jar or glass",
        "Spoon",
        "Strainer or cheesecloth (optional)"
    ],
    "text": " Brewing Ginger Tea Peel 3 1-inch (2.5-cm) pieces of ginger. Cut or break 3 approximately 1-inch (2.5-cm) pieces of ginger from a bigger piece of ginger root. Use a vegetable peeler or paring knife to slice the skin off the pieces.Tip: Ginger tea is nutritious and has immune-boosting, anti-inflammatory, and detoxifying properties It’s especially good to drink if you feel like you’re getting a cold or flu. Don’t worry if you don’t peel the pieces of ginger perfectly. It’s fine if there are some small pieces of skin left on. Slice the peeled ginger into thin rounds. Place the peeled pieces of ginger on a cutting board. Use a paring knife or other sharp knife to carefully cut them into thin medallions. The exact thickness of the rounds doesn’t matter. Just cut them as thin as you are comfortable with. Boil 4 cups (946 mL) of water in a saucepan over medium-high heat. Fill a medium-sized saucepan with 4 cups (946 mL) of water. Place it on a burner over medium-high heat and bring it to a boil. Don’t use the maximum heat because the water might boil over. Put the ginger slices in the water and let them boil for 15 minutes. Carefully drop the ginger rounds you cut into the boiling water. Leave them boiling for about 15 minutes to brew the ginger tea. Keep an eye on the saucepan and turn down the heat if the water looks like it is about to boil over at any point. Pour the tea through a strainer to remove the ginger slices. Place a strainer over another pot or large serving vessel of some kind. Carefully pour the brewed tea through the strainer to filter out the ginger. You can discard the ginger pieces at this point. The tea is ready to drink. Serve the tea with lemon and honey to taste if desired. Fill a mug with the brewed ginger tea. Put 1-2 lemon rounds and 1-2 tbsp (15-30 mL) of honey in the tea and stir it. Enjoy your ginger tea! You can also drink the tea plain or garnish it with anything else of your choosing. For example, you could try it with a cinnamon stick or 1/4 tsp (1 g) of powdered cinnamon. You could add 1/4 tsp (1 g) of powdered turmeric to a cup of ginger tea for an added herbal boost. Feel free to store the brewed tea in your refrigerator or serve it over ice to enjoy it cold. Making Lemon-Ginger Water Peel a 2-inch (5-cm) piece of ginger. Use a vegetable peeler or paring knife to peel the skin off an approximately 2-inch (5-cm) piece of ginger. It’s OK if some small pieces of skin are still on the ginger as you will be straining the lemon-ginger water before drinking it.Tip: The combination of ginger and lemon in this recipe makes for a beverage with lots of detoxification, anti-inflammatory, and immune-boosting properties. Drink a serving in the morning or sip it throughout the day as part of a healthy, balanced diet. After you have made this recipe once, you can adjust the amount of ginger to make the lemon-ginger water stronger or weaker according to your personal tastes. Place the ginger with lemon juice, water, and honey in a blender. Put the peeled piece of ginger in a blender with 1/2 a cup (118 mL) of lemon juice and 1/2 a cup (118 mL) of water. Add 4  tsp (20 mL) of honey. As with the ginger, you can adjust the amounts of lemon juice and honey after you’ve become familiar with this recipe to alter the taste depending on your preferences. Blend all the ingredients for 20-30 seconds at high speed. Put the lid on the blender and turn it on to high speed. Let the ingredients blend together for 20-30 seconds or until everything looks evenly mixed. If your blender has a pulse button, you can start by pressing it 2-3 times before turning the blender on at high speed. This can help the ingredients start mixing together more easily. Strain the mixture into mason jars or a pitcher. Pour the mixture out of the blender through a strainer into 4 quart-sized (946-mL) mason jars or a 1-gallon (3785-mL) pitcher. Make sure that you have lids for whichever vessels you choose to pour it into. Mason jars are a good option if you want to be able to take some lemon-ginger water with you on the go. A pitcher is fine if you just plan on drinking the lemon-ginger water at home. Top the mason jars or pitcher up with water and put the lids on. Fill the mason jars or pitcher close to the top with plain water. Screw the lids on the mason jars or cover the pitcher with its lid. The mixture will be very strong on its own, so topping it off with plain water dilutes it and makes it into an enjoyable beverage to drink. Store the lemon-ginger water in the fridge and drink it when you like. Place the mason jars or pitcher into your refrigerator. Grab a mason jar of lemon-ginger water when you want to take it out the door with you or pour some lemon-ginger water from the pitcher into a glass when you want to enjoy it at home. You can serve lemon-ginger water with a slice or two of fresh lemon for a garnish and added lemon flavor if you like. This beverage will stay good for about a week when stored in the fridge. Mixing a Ginger Switchel Combine apple cider vinegar, ginger, sweetener, and water in a jar or glass. Put 2 US tbsp (30 mL) of apple cider vinegar, 4  tsp (20 mL) of honey, maple syrup, or molasses, and 1/4 tsp (1 g) of ground ginger or 1 tsp (4 g) of fresh grated ginger in a jar or glass. Pour in 1 cup (236 mL) of water.Tip: A ginger switchel is an old-fashioned ginger and apple cider vinegar drink. It combines the immune-boosting and detoxifying properties of fresh or ground ginger with the health benefits of apple cider vinegar, such as its bacteria-killing and cholesterol-lowering effects. Molasses is the traditional sweetener used to make ginger snaps, but you can use what you have available or prefer. If you want to use granulated sugar instead of a liquid sweetener, use 4 tsp (16 g) of sugar. Cover and refrigerate the mixture for at least 2 hours and up to 1 day. Put a lid on the jar if you used a jar or cover the glass with plastic wrap if you used a glass. Stick the mixture in the refrigerator and leave it for at least 2 hours and up to 1 full day to let the flavors combine. After you’ve made this recipe once, feel free to adjust the ratios of ingredients and the amount of time you let it sit to alter the recipe to your taste. Shake or stir the mixture before serving it. Shake the mixture together in the jar or stir it in the glass before serving it to mix the ingredients together well. Pour it into a glass with ice or drink it on its own. If you used fresh grated ginger and you don’t want any pieces of ginger in the beverage, you can strain it through a fine-mesh strainer or cheesecloth before serving it. If you want a more mild flavor, mix the ginger switchel with soda water to taste to dilute it before drinking it.",
    "sentences": [
        " Brewing Ginger Tea Peel 3 1-inch (2.5-cm) pieces of ginger.",
        "Cut or break 3 approximately 1-inch (2.5-cm) pieces of ginger from a bigger piece of ginger root.",
        "Use a vegetable peeler or paring knife to slice the skin off the pieces.Tip: Ginger tea is nutritious and has immune-boosting, anti-inflammatory, and detoxifying properties It’s especially good to drink if you feel like you’re getting a cold or flu.",
        "Don’t worry if you don’t peel the pieces of ginger perfectly.",
        "It’s fine if there are some small pieces of skin left on.",
        "Slice the peeled ginger into thin rounds.",
        "Place the peeled pieces of ginger on a cutting board.",
        "Use a paring knife or other sharp knife to carefully cut them into thin medallions.",
        "The exact thickness of the rounds doesn’t matter.",
        "Just cut them as thin as you are comfortable with.",
        "Boil 4 cups (946 mL) of water in a saucepan over medium-high heat.",
        "Fill a medium-sized saucepan with 4 cups (946 mL) of water.",
        "Place it on a burner over medium-high heat and bring it to a boil.",
        "Don’t use the maximum heat because the water might boil over.",
        "Put the ginger slices in the water and let them boil for 15 minutes.",
        "Carefully drop the ginger rounds you cut into the boiling water.",
        "Leave them boiling for about 15 minutes to brew the ginger tea.",
        "Keep an eye on the saucepan and turn down the heat if the water looks like it is about to boil over at any point.",
        "Pour the tea through a strainer to remove the ginger slices.",
        "Place a strainer over another pot or large serving vessel of some kind.",
        "Carefully pour the brewed tea through the strainer to filter out the ginger.",
        "You can discard the ginger pieces at this point.",
        "The tea is ready to drink.",
        "Serve the tea with lemon and honey to taste if desired.",
        "Fill a mug with the brewed ginger tea.",
        "Put 1-2 lemon rounds and 1-2 tbsp (15-30 mL) of honey in the tea and stir it.",
        "Enjoy your ginger tea!",
        "You can also drink the tea plain or garnish it with anything else of your choosing.",
        "For example, you could try it with a cinnamon stick or 1/4 tsp (1 g) of powdered cinnamon.",
        "You could add 1/4 tsp (1 g) of powdered turmeric to a cup of ginger tea for an added herbal boost.",
        "Feel free to store the brewed tea in your refrigerator or serve it over ice to enjoy it cold.",
        "Making Lemon-Ginger Water Peel a 2-inch (5-cm) piece of ginger.",
        "Use a vegetable peeler or paring knife to peel the skin off an approximately 2-inch (5-cm) piece of ginger.",
        "It’s OK if some small pieces of skin are still on the ginger as you will be straining the lemon-ginger water before drinking it.Tip: The combination of ginger and lemon in this recipe makes for a beverage with lots of detoxification, anti-inflammatory, and immune-boosting properties.",
        "Drink a serving in the morning or sip it throughout the day as part of a healthy, balanced diet.",
        "After you have made this recipe once, you can adjust the amount of ginger to make the lemon-ginger water stronger or weaker according to your personal tastes.",
        "Place the ginger with lemon juice, water, and honey in a blender.",
        "Put the peeled piece of ginger in a blender with 1/2 a cup (118 mL) of lemon juice and 1/2 a cup (118 mL) of water.",
        "Add 4  tsp (20 mL) of honey.",
        "As with the ginger, you can adjust the amounts of lemon juice and honey after you’ve become familiar with this recipe to alter the taste depending on your preferences.",
        "Blend all the ingredients for 20-30 seconds at high speed.",
        "Put the lid on the blender and turn it on to high speed.",
        "Let the ingredients blend together for 20-30 seconds or until everything looks evenly mixed.",
        "If your blender has a pulse button, you can start by pressing it 2-3 times before turning the blender on at high speed.",
        "This can help the ingredients start mixing together more easily.",
        "Strain the mixture into mason jars or a pitcher.",
        "Pour the mixture out of the blender through a strainer into 4 quart-sized (946-mL) mason jars or a 1-gallon (3785-mL) pitcher.",
        "Make sure that you have lids for whichever vessels you choose to pour it into.",
        "Mason jars are a good option if you want to be able to take some lemon-ginger water with you on the go.",
        "A pitcher is fine if you just plan on drinking the lemon-ginger water at home.",
        "Top the mason jars or pitcher up with water and put the lids on.",
        "Fill the mason jars or pitcher close to the top with plain water.",
        "Screw the lids on the mason jars or cover the pitcher with its lid.",
        "The mixture will be very strong on its own, so topping it off with plain water dilutes it and makes it into an enjoyable beverage to drink.",
        "Store the lemon-ginger water in the fridge and drink it when you like.",
        "Place the mason jars or pitcher into your refrigerator.",
        "Grab a mason jar of lemon-ginger water when you want to take it out the door with you or pour some lemon-ginger water from the pitcher into a glass when you want to enjoy it at home.",
        "You can serve lemon-ginger water with a slice or two of fresh lemon for a garnish and added lemon flavor if you like.",
        "This beverage will stay good for about a week when stored in the fridge.",
        "Mixing a Ginger Switchel Combine apple cider vinegar, ginger, sweetener, and water in a jar or glass.",
        "Put 2 US tbsp (30 mL) of apple cider vinegar, 4  tsp (20 mL) of honey, maple syrup, or molasses, and 1/4 tsp (1 g) of ground ginger or 1 tsp (4 g) of fresh grated ginger in a jar or glass.",
        "Pour in 1 cup (236 mL) of water.Tip: A ginger switchel is an old-fashioned ginger and apple cider vinegar drink.",
        "It combines the immune-boosting and detoxifying properties of fresh or ground ginger with the health benefits of apple cider vinegar, such as its bacteria-killing and cholesterol-lowering effects.",
        "Molasses is the traditional sweetener used to make ginger snaps, but you can use what you have available or prefer.",
        "If you want to use granulated sugar instead of a liquid sweetener, use 4 tsp (16 g) of sugar.",
        "Cover and refrigerate the mixture for at least 2 hours and up to 1 day.",
        "Put a lid on the jar if you used a jar or cover the glass with plastic wrap if you used a glass.",
        "Stick the mixture in the refrigerator and leave it for at least 2 hours and up to 1 full day to let the flavors combine.",
        "After you’ve made this recipe once, feel free to adjust the ratios of ingredients and the amount of time you let it sit to alter the recipe to your taste.",
        "Shake or stir the mixture before serving it.",
        "Shake the mixture together in the jar or stir it in the glass before serving it to mix the ingredients together well.",
        "Pour it into a glass with ice or drink it on its own.",
        "If you used fresh grated ginger and you don’t want any pieces of ginger in the beverage, you can strain it through a fine-mesh strainer or cheesecloth before serving it.",
        "If you want a more mild flavor, mix the ginger switchel with soda water to taste to dilute it before drinking it."
    ]
}