{
    "title": "How to Increase Your Chances of Winning a Freestyle Swimming Race",
    "url": "https://www.wikihow.com/Increase-Your-Chances-of-Winning-a-Freestyle-Swimming-Race",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Swimming",
        "Swimming Strokes",
        "Freestyle Swimming"
    ],
    "parts": [
        {
            "name": "Practicing for the Race",
            "steps": [
                {
                    "headline": "Learn the basics of the freestyle stroke.",
                    "description": "Freestyle usually means doing front crawl. In order to do front crawl, follow these steps:\nFirst, learn the flutter kick. This is how your legs will move during freestyle. Point your feet and move them up and down in a pattern just below the surface of the water. Next, learn what to do with your arms. Position one hand in front of you and one hand in back. Move both hands in a circle, front, then back again. Lastly, know how to breathe during the stroke. Generally, you breathe to the side during freestyle. When one hand is in the air during the circle, the other hand should be cupping down in the water. During this time, breathe the opposite direction to your hand. You should generally breathe every 2-3 strokes."
                },
                {
                    "headline": "Practice as often as you can.",
                    "description": "Practicing will make you ready for the race. Try to swim freestyle as often as you can while you practice. Practicing more often will help you to master the stroke. Don't practice too much in the days directly before the race or you could be tired for the race."
                },
                {
                    "headline": "Prepare for certain conditions.",
                    "description": "Race conditions are different than lap swimming. These steps will help you to prepare for the race:\n\nKnow how to dive off a starting block. This will give you the momentum to start the race. Learn to do dolphin kicks. As soon as you enter the water, you should do at least 3 dolphin kicks to propel you back up to the surface. To do dolphin kicks, bend your legs and move your body in a wave-like fashion. Learn how to do flip turns if you'll be swimming laps during the race. A quick summary of how to do a flip turn:\nOnce you reach the wall, use your hands to propel you forward. While turning, be sure to touch the wall to mark that you have completed the lap. When done turning, your head should be facing up. Kick off the wall and rotate your body so that you are on your stomach. Be sure to breathe out while doing the flip! Prepare for a fast start. Most people will start off very fast in a race. You should prepare for this. You should also practice jumping off a diving board as far as possible. At the end of the race when most people get tired, you should keep going and end it as fast as possible. In order to train for the ending, try swimming or running for a long distance. This will help your stamina. Practice touching the wall in order to mark your placing. This is very important. Touch it as soon as you reach it. It helps to keep straight arms to touch the wall, rather than taking another stroke. On your last stroke, don't breathe. Simply pull and touch the wall."
                },
                {
                    "headline": "Improve your technique.",
                    "description": "Technique is important as it will let you swim without getting too tired. The following tips will help to improve your technique:\nBreathe sideways. Don't breathe by lifting your head forward first. Always breathe to your side. Roll your body sideways a bit every arm movement you make. This will keep your hips from falling. When in the water, breathe out. That way, you won't have to breathe out when you're lifting your head out of the water! Simply, breathe in when your head is sideways out of the water, and breathe out while your head is in the water. Learn to take a breath every third stroke. Every third stroke you make with your arms, take a breath to the side. Basically, the next breath you take will always be on the opposite side than your current side. This is called bilateral breathing. Don't look at the bottom of the pool or forward either. Look at the middle of those two. Use strong kicking. A good kick will keep your hips from falling and therefore is important. Try doing leg strengthening activities. Improve your pulls (arm technique). Arm technique is one of the most important things while swimming freestyle. Practice using straight arms then curved arms. See what works for you. Make sure to spread your fingers apart a little. They shouldn't be clumped closely, but they shouldn't be too far either.Tip: You should use straight arms for shorter races and slightly curved arms for longer races. Curved arms reduce drag. You should also use curved arms if you have good swimming technique, and use straight arms if you still have to work on technique."
                },
                {
                    "headline": "Train efficiently.",
                    "description": "Stretch before and after practices. Work on your weaknesses. For example, if your technique is good but you don't have enough stamina, try swimming long distances to build stamina. Practice with a buddy if you wish. This can help motivate you. End all your practices with stretching. This will keep you flexible and reduce injuries."
                },
                {
                    "headline": "Know that it will all be worth it in the end.",
                    "description": "In the end, everything is based on how well you practice. Know that your hard work will surely pay off! Have a positive mindset while practicing. Know that you can do this! Try to enjoy all the practices."
                }
            ]
        },
        {
            "name": "Being Healthy",
            "steps": [
                {
                    "headline": "Eat nutritious foods.",
                    "description": "When you're feeling healthy, you'll be able to show your best in the race. You must get enough of every vitamin and mineral. The following foods will help you get a variety of nutrients:\nAvocadoes. This great fruit has a lot of essential minerals that will improve health. It also tastes creamy and buttery! Different kinds of fruits. Many fruits are beneficial to your health. Some examples are apples, pears, grapes, oranges, and kiwi. Vegetables. These can include broccoli, spinach, and beets. Meats and protein. Some good foods in this category are beef, salmon, and pork. You may want to limit red meat."
                },
                {
                    "headline": "Sleep well every night.",
                    "description": "Make sure to get at least 8 hours of sleep, as then you'll feel fresh to practice every morning. Go to bed and wake up at the same time each day. This will help you to get used to the schedule and can prevent sleep issues. Make your bedroom cozy to sleep in."
                },
                {
                    "headline": "Keep hydrated.",
                    "description": "Water is essential to your health. Keeping hydrated will improve your overall health, especially when training. Keep a water bottle with you at all times."
                },
                {
                    "headline": "Steer clear of sugars and energy drinks.",
                    "description": "They can cause many health problems  , and eating too much sugar can even cause diabetes. Sweet fruits are a great alternative to sugars. Drink water instead of energy drinks."
                }
            ]
        },
        {
            "name": "Swimming your Best the Day of the Race",
            "steps": [
                {
                    "headline": "Get a good sleep the night before.",
                    "description": "This is crucial, as then you'll be bright in the morning and ready to go. In the morning, try to wake up as fast as possible to get ready for the day. You don't want to be late for the race!"
                },
                {
                    "headline": "Eat a nutritious breakfast.",
                    "description": "Breakfast starts your day off right and gives you fuel for the day to come. Try having oatmeal with fruits along with some orange juice. Choose whole grains if you want to eat cereal."
                },
                {
                    "headline": "Get to the race on time.",
                    "description": "Remember to bring essentials, such as a swimsuit, swim cap, and goggles. These will help you to perform at your best. Don't rush too much, as that can affect your race."
                },
                {
                    "headline": "Start the race!",
                    "description": "Kick off the diving board/wall as fast as possible and perform your dolphin kicks which will fuel your whole race. Start to swim the stroke at the best pace to last the whole race. Refrain from swimming too fast at the beginning, as you don't want to tire out near the end. Make sure to start swimming at the right time, as you don't want to get disqualified for a false start!"
                },
                {
                    "headline": "Swim as you normally would during the race.",
                    "description": "Now that you have trained and mastered the freestyle stroke, swim naturally exactly how you have practiced it. Use the same techniques and move gracefully forward. Don't look at the other competitors and how they are doing as this will distract you from swimming. Swim as fast as you can even if you're tired. If you feel very tired and exhausted, slow down. Going too fast can cause drowning due to tiredness."
                },
                {
                    "headline": "End the race as fast as you can.",
                    "description": "Know that this is the race you spent a lot of time preparing for, and give it your best shot. Know that the end is near and finish it off gracefully. It will pay off in the end! Sprint to the finish line and hit the board to mark your time and placing. Tip: The ending of a race is one of the most common places where people slow down. If you're lagging behind, use the ending to catch up and win!"
                },
                {
                    "headline": "Have good sportsmanship!",
                    "description": "If you didn't win, congratulate the winner. If you won, avoid bragging too much and win gracefully. Know that you did your best and that there's nothing to change that."
                }
            ]
        }
    ],
    "tyn": [
        "Goggles",
        "Swimsuit",
        "Swim cap (optional)"
    ],
    "text": " Practicing for the Race Learn the basics of the freestyle stroke. Freestyle usually means doing front crawl. In order to do front crawl, follow these steps:\nFirst, learn the flutter kick. This is how your legs will move during freestyle. Point your feet and move them up and down in a pattern just below the surface of the water. Next, learn what to do with your arms. Position one hand in front of you and one hand in back. Move both hands in a circle, front, then back again. Lastly, know how to breathe during the stroke. Generally, you breathe to the side during freestyle. When one hand is in the air during the circle, the other hand should be cupping down in the water. During this time, breathe the opposite direction to your hand. You should generally breathe every 2-3 strokes. Practice as often as you can. Practicing will make you ready for the race. Try to swim freestyle as often as you can while you practice. Practicing more often will help you to master the stroke. Don't practice too much in the days directly before the race or you could be tired for the race. Prepare for certain conditions. Race conditions are different than lap swimming. These steps will help you to prepare for the race:\n\nKnow how to dive off a starting block. This will give you the momentum to start the race. Learn to do dolphin kicks. As soon as you enter the water, you should do at least 3 dolphin kicks to propel you back up to the surface. To do dolphin kicks, bend your legs and move your body in a wave-like fashion. Learn how to do flip turns if you'll be swimming laps during the race. A quick summary of how to do a flip turn:\nOnce you reach the wall, use your hands to propel you forward. While turning, be sure to touch the wall to mark that you have completed the lap. When done turning, your head should be facing up. Kick off the wall and rotate your body so that you are on your stomach. Be sure to breathe out while doing the flip! Prepare for a fast start. Most people will start off very fast in a race. You should prepare for this. You should also practice jumping off a diving board as far as possible. At the end of the race when most people get tired, you should keep going and end it as fast as possible. In order to train for the ending, try swimming or running for a long distance. This will help your stamina. Practice touching the wall in order to mark your placing. This is very important. Touch it as soon as you reach it. It helps to keep straight arms to touch the wall, rather than taking another stroke. On your last stroke, don't breathe. Simply pull and touch the wall. Improve your technique. Technique is important as it will let you swim without getting too tired. The following tips will help to improve your technique:\nBreathe sideways. Don't breathe by lifting your head forward first. Always breathe to your side. Roll your body sideways a bit every arm movement you make. This will keep your hips from falling. When in the water, breathe out. That way, you won't have to breathe out when you're lifting your head out of the water! Simply, breathe in when your head is sideways out of the water, and breathe out while your head is in the water. Learn to take a breath every third stroke. Every third stroke you make with your arms, take a breath to the side. Basically, the next breath you take will always be on the opposite side than your current side. This is called bilateral breathing. Don't look at the bottom of the pool or forward either. Look at the middle of those two. Use strong kicking. A good kick will keep your hips from falling and therefore is important. Try doing leg strengthening activities. Improve your pulls (arm technique). Arm technique is one of the most important things while swimming freestyle. Practice using straight arms then curved arms. See what works for you. Make sure to spread your fingers apart a little. They shouldn't be clumped closely, but they shouldn't be too far either.Tip: You should use straight arms for shorter races and slightly curved arms for longer races. Curved arms reduce drag. You should also use curved arms if you have good swimming technique, and use straight arms if you still have to work on technique. Train efficiently. Stretch before and after practices. Work on your weaknesses. For example, if your technique is good but you don't have enough stamina, try swimming long distances to build stamina. Practice with a buddy if you wish. This can help motivate you. End all your practices with stretching. This will keep you flexible and reduce injuries. Know that it will all be worth it in the end. In the end, everything is based on how well you practice. Know that your hard work will surely pay off! Have a positive mindset while practicing. Know that you can do this! Try to enjoy all the practices. Being Healthy Eat nutritious foods. When you're feeling healthy, you'll be able to show your best in the race. You must get enough of every vitamin and mineral. The following foods will help you get a variety of nutrients:\nAvocadoes. This great fruit has a lot of essential minerals that will improve health. It also tastes creamy and buttery! Different kinds of fruits. Many fruits are beneficial to your health. Some examples are apples, pears, grapes, oranges, and kiwi. Vegetables. These can include broccoli, spinach, and beets. Meats and protein. Some good foods in this category are beef, salmon, and pork. You may want to limit red meat. Sleep well every night. Make sure to get at least 8 hours of sleep, as then you'll feel fresh to practice every morning. Go to bed and wake up at the same time each day. This will help you to get used to the schedule and can prevent sleep issues. Make your bedroom cozy to sleep in. Keep hydrated. Water is essential to your health. Keeping hydrated will improve your overall health, especially when training. Keep a water bottle with you at all times. Steer clear of sugars and energy drinks. They can cause many health problems  , and eating too much sugar can even cause diabetes. Sweet fruits are a great alternative to sugars. Drink water instead of energy drinks. Swimming your Best the Day of the Race Get a good sleep the night before. This is crucial, as then you'll be bright in the morning and ready to go. In the morning, try to wake up as fast as possible to get ready for the day. You don't want to be late for the race! Eat a nutritious breakfast. Breakfast starts your day off right and gives you fuel for the day to come. Try having oatmeal with fruits along with some orange juice. Choose whole grains if you want to eat cereal. Get to the race on time. Remember to bring essentials, such as a swimsuit, swim cap, and goggles. These will help you to perform at your best. Don't rush too much, as that can affect your race. Start the race! Kick off the diving board/wall as fast as possible and perform your dolphin kicks which will fuel your whole race. Start to swim the stroke at the best pace to last the whole race. Refrain from swimming too fast at the beginning, as you don't want to tire out near the end. Make sure to start swimming at the right time, as you don't want to get disqualified for a false start! Swim as you normally would during the race. Now that you have trained and mastered the freestyle stroke, swim naturally exactly how you have practiced it. Use the same techniques and move gracefully forward. Don't look at the other competitors and how they are doing as this will distract you from swimming. Swim as fast as you can even if you're tired. If you feel very tired and exhausted, slow down. Going too fast can cause drowning due to tiredness. End the race as fast as you can. Know that this is the race you spent a lot of time preparing for, and give it your best shot. Know that the end is near and finish it off gracefully. It will pay off in the end! Sprint to the finish line and hit the board to mark your time and placing. Tip: The ending of a race is one of the most common places where people slow down. If you're lagging behind, use the ending to catch up and win! Have good sportsmanship! If you didn't win, congratulate the winner. If you won, avoid bragging too much and win gracefully. Know that you did your best and that there's nothing to change that.",
    "sentences": [
        " Practicing for the Race Learn the basics of the freestyle stroke.",
        "Freestyle usually means doing front crawl.",
        "In order to do front crawl, follow these steps:\nFirst, learn the flutter kick.",
        "This is how your legs will move during freestyle.",
        "Point your feet and move them up and down in a pattern just below the surface of the water.",
        "Next, learn what to do with your arms.",
        "Position one hand in front of you and one hand in back.",
        "Move both hands in a circle, front, then back again.",
        "Lastly, know how to breathe during the stroke.",
        "Generally, you breathe to the side during freestyle.",
        "When one hand is in the air during the circle, the other hand should be cupping down in the water.",
        "During this time, breathe the opposite direction to your hand.",
        "You should generally breathe every 2-3 strokes.",
        "Practice as often as you can.",
        "Practicing will make you ready for the race.",
        "Try to swim freestyle as often as you can while you practice.",
        "Practicing more often will help you to master the stroke.",
        "Don't practice too much in the days directly before the race or you could be tired for the race.",
        "Prepare for certain conditions.",
        "Race conditions are different than lap swimming.",
        "These steps will help you to prepare for the race:\n\nKnow how to dive off a starting block.",
        "This will give you the momentum to start the race.",
        "Learn to do dolphin kicks.",
        "As soon as you enter the water, you should do at least 3 dolphin kicks to propel you back up to the surface.",
        "To do dolphin kicks, bend your legs and move your body in a wave-like fashion.",
        "Learn how to do flip turns if you'll be swimming laps during the race.",
        "A quick summary of how to do a flip turn:\nOnce you reach the wall, use your hands to propel you forward.",
        "While turning, be sure to touch the wall to mark that you have completed the lap.",
        "When done turning, your head should be facing up.",
        "Kick off the wall and rotate your body so that you are on your stomach.",
        "Be sure to breathe out while doing the flip!",
        "Prepare for a fast start.",
        "Most people will start off very fast in a race.",
        "You should prepare for this.",
        "You should also practice jumping off a diving board as far as possible.",
        "At the end of the race when most people get tired, you should keep going and end it as fast as possible.",
        "In order to train for the ending, try swimming or running for a long distance.",
        "This will help your stamina.",
        "Practice touching the wall in order to mark your placing.",
        "This is very important.",
        "Touch it as soon as you reach it.",
        "It helps to keep straight arms to touch the wall, rather than taking another stroke.",
        "On your last stroke, don't breathe.",
        "Simply pull and touch the wall.",
        "Improve your technique.",
        "Technique is important as it will let you swim without getting too tired.",
        "The following tips will help to improve your technique:\nBreathe sideways.",
        "Don't breathe by lifting your head forward first.",
        "Always breathe to your side.",
        "Roll your body sideways a bit every arm movement you make.",
        "This will keep your hips from falling.",
        "When in the water, breathe out.",
        "That way, you won't have to breathe out when you're lifting your head out of the water!",
        "Simply, breathe in when your head is sideways out of the water, and breathe out while your head is in the water.",
        "Learn to take a breath every third stroke.",
        "Every third stroke you make with your arms, take a breath to the side.",
        "Basically, the next breath you take will always be on the opposite side than your current side.",
        "This is called bilateral breathing.",
        "Don't look at the bottom of the pool or forward either.",
        "Look at the middle of those two.",
        "Use strong kicking.",
        "A good kick will keep your hips from falling and therefore is important.",
        "Try doing leg strengthening activities.",
        "Improve your pulls (arm technique).",
        "Arm technique is one of the most important things while swimming freestyle.",
        "Practice using straight arms then curved arms.",
        "See what works for you.",
        "Make sure to spread your fingers apart a little.",
        "They shouldn't be clumped closely, but they shouldn't be too far either.Tip: You should use straight arms for shorter races and slightly curved arms for longer races.",
        "Curved arms reduce drag.",
        "You should also use curved arms if you have good swimming technique, and use straight arms if you still have to work on technique.",
        "Train efficiently.",
        "Stretch before and after practices.",
        "Work on your weaknesses.",
        "For example, if your technique is good but you don't have enough stamina, try swimming long distances to build stamina.",
        "Practice with a buddy if you wish.",
        "This can help motivate you.",
        "End all your practices with stretching.",
        "This will keep you flexible and reduce injuries.",
        "Know that it will all be worth it in the end.",
        "In the end, everything is based on how well you practice.",
        "Know that your hard work will surely pay off!",
        "Have a positive mindset while practicing.",
        "Know that you can do this!",
        "Try to enjoy all the practices.",
        "Being Healthy Eat nutritious foods.",
        "When you're feeling healthy, you'll be able to show your best in the race.",
        "You must get enough of every vitamin and mineral.",
        "The following foods will help you get a variety of nutrients:\nAvocadoes.",
        "This great fruit has a lot of essential minerals that will improve health.",
        "It also tastes creamy and buttery!",
        "Different kinds of fruits.",
        "Many fruits are beneficial to your health.",
        "Some examples are apples, pears, grapes, oranges, and kiwi.",
        "Vegetables.",
        "These can include broccoli, spinach, and beets.",
        "Meats and protein.",
        "Some good foods in this category are beef, salmon, and pork.",
        "You may want to limit red meat.",
        "Sleep well every night.",
        "Make sure to get at least 8 hours of sleep, as then you'll feel fresh to practice every morning.",
        "Go to bed and wake up at the same time each day.",
        "This will help you to get used to the schedule and can prevent sleep issues.",
        "Make your bedroom cozy to sleep in.",
        "Keep hydrated.",
        "Water is essential to your health.",
        "Keeping hydrated will improve your overall health, especially when training.",
        "Keep a water bottle with you at all times.",
        "Steer clear of sugars and energy drinks.",
        "They can cause many health problems  , and eating too much sugar can even cause diabetes.",
        "Sweet fruits are a great alternative to sugars.",
        "Drink water instead of energy drinks.",
        "Swimming your Best the Day of the Race Get a good sleep the night before.",
        "This is crucial, as then you'll be bright in the morning and ready to go.",
        "In the morning, try to wake up as fast as possible to get ready for the day.",
        "You don't want to be late for the race!",
        "Eat a nutritious breakfast.",
        "Breakfast starts your day off right and gives you fuel for the day to come.",
        "Try having oatmeal with fruits along with some orange juice.",
        "Choose whole grains if you want to eat cereal.",
        "Get to the race on time.",
        "Remember to bring essentials, such as a swimsuit, swim cap, and goggles.",
        "These will help you to perform at your best.",
        "Don't rush too much, as that can affect your race.",
        "Start the race!",
        "Kick off the diving board/wall as fast as possible and perform your dolphin kicks which will fuel your whole race.",
        "Start to swim the stroke at the best pace to last the whole race.",
        "Refrain from swimming too fast at the beginning, as you don't want to tire out near the end.",
        "Make sure to start swimming at the right time, as you don't want to get disqualified for a false start!",
        "Swim as you normally would during the race.",
        "Now that you have trained and mastered the freestyle stroke, swim naturally exactly how you have practiced it.",
        "Use the same techniques and move gracefully forward.",
        "Don't look at the other competitors and how they are doing as this will distract you from swimming.",
        "Swim as fast as you can even if you're tired.",
        "If you feel very tired and exhausted, slow down.",
        "Going too fast can cause drowning due to tiredness.",
        "End the race as fast as you can.",
        "Know that this is the race you spent a lot of time preparing for, and give it your best shot.",
        "Know that the end is near and finish it off gracefully.",
        "It will pay off in the end!",
        "Sprint to the finish line and hit the board to mark your time and placing.",
        "Tip: The ending of a race is one of the most common places where people slow down.",
        "If you're lagging behind, use the ending to catch up and win!",
        "Have good sportsmanship!",
        "If you didn't win, congratulate the winner.",
        "If you won, avoid bragging too much and win gracefully.",
        "Know that you did your best and that there's nothing to change that."
    ]
}