{
    "title": "How to Remove Dye from Hair",
    "url": "https://www.wikihow.com/Remove-Dye-from-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Coloring Hair",
        "Hair Dyes and Colorants",
        "Hair Dye Corrections",
        "Removing Hair Dye"
    ],
    "methods": [
        {
            "name": "Dandruff Shampoo and Baking Soda",
            "steps": [
                {
                    "headline": "Purchase dandruff shampoo.",
                    "description": "You can get this at any drug or grocery store. It will be labelled clearly as a dandruff product. Head & Shoulders and Original Formula Prell are popular options. Dandruff shampoo is a little more heavy-duty than normal shampoo; people with dandruff have excess sebum that causes the skin to flake off, necessitating a stronger formula."
                },
                {
                    "headline": "Grab some baking soda.",
                    "description": "Make sure it's baking soda and not baking powder. The packaging often looks similar, but baking powder will not work for this. Baking soda is a natural (although not strong) bleaching agent.Why Baking Soda?Baking soda is a natural cleaning agent—you may have even used it to remove stains before! It will help lighten and remove the dye without bleaching your hair. Combining this cleansing power with dandruff shampoo, which has an active ingredient that fades hair color, makes for a powerful dye-removing mixture.Tip: If you don’t have any baking soda on hand, try the dandruff shampoo alone. Just washing your hair should help remove the dye, especially if it’s semi-permanent."
                },
                {
                    "headline": "Mix the shampoo and baking soda together in equal parts.",
                    "description": "You can mix them together in a container, or just pour equal parts of each into the palm of your hand. It doesn't have to be exact!"
                },
                {
                    "headline": "Shampoo your hair with the mixture.",
                    "description": "Work up a nice lather, then let the mixture sit on your hair for a few minutes before you rinse it out.Shampooing Tips:Get your hair thoroughly wet before you shampoo. Hop in the shower or bath and run your hair under the water for a minute, just as you would before using your regular shampoo.Scrunch the shampoo through your hair evenly. Use both hands to coat the strands, working it all the way from the tips of your hair to the roots.Let the mixture soak in. The shampoo and baking soda need a bit of time to penetrate the strands and work out the dye. Let it sit for 5-7 minutes without touching it or rinsing it out."
                },
                {
                    "headline": "Rinse thoroughly.",
                    "description": "You'll see the hair color running out when you rinse. You can wash your hair with this solution several times, if necessary. This works best if you have recently dyed your hair, rather than several months later. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristine George\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster Hairstylist and Colorist\t\t\t\t\t\t\t\tChristine George is a Master Hairstylist, Colorist, and Owner of Luxe Parlour, a premier boutique salon based in the Los Angeles, California area. Christine has over 23 years of hair styling and coloring experience. She specializes in customized haircuts, premium color services, balayage expertise, classic highlights, and color correction. She received her cosmetology degree from the Newberry School of Beauty. Christine George\t\t\tMaster Hairstylist and Colorist\t\t\t\tDid You Know? Since your hair is naturally acidic, you have to apply something alkaline if you want to effectively remove the color. After you rinse some of the dye away, shampooing your hair will restore it to its natural pH level."
                }
            ]
        },
        {
            "name": "Dish Soap",
            "steps": [
                {
                    "headline": "Mix four or five drops of dish soap with regular shampoo.",
                    "description": "Palmolive and Dawn are two popular dish soaps you can try. Mix it with a quarter-sized amount of your regular shampoo."
                },
                {
                    "headline": "Wet your hair and apply the mixture.",
                    "description": "Rub up a soapy lather, allowing the dish soap to penetrate deeply into the hair. Lather your hair for at least a couple of minutes."
                },
                {
                    "headline": "Rinse your hair thoroughly.",
                    "description": "Dish soap causes hair to become very dry and strips out natural oils, so be sure to rinse it out thoroughly. You will probably have to repeat this technique more than once, but because dish soap is so harsh, don't repeat it too many times in a row."
                },
                {
                    "headline": "Check your hair after each application of dish soap.",
                    "description": "The results won't be drastic right away, but you should start to see the color fade significantly after doing this for two to three days."
                },
                {
                    "headline": "Follow up with a deep conditioner every time.",
                    "description": "Always follow the last rinse with a deep conditioning treatment such as hot oil. Dish soap is extremely drying; your strands will need a dose of hydration every time you use it. You can even sit under a heated dryer to increase the effectiveness of the conditioner."
                }
            ]
        },
        {
            "name": "Crushed Vitamin C",
            "steps": [
                {
                    "headline": "Make a paste out of Vitamin C tablets.",
                    "description": "If you dyed your hair a darker color with a semi-permanent dye (one that claims to wash out in 28 shampoos) and only a couple of days have passed, try this technique. Dump a bunch of vitamin C tablets in a bowl, add hot water, and crush with a spoon to make a thick paste.Using Vitamin C TabletsWhy vitamin C? Vitamin C is a safe, non-abrasive option if your hair is dyed a dark color. The acid in vitamin C oxidizes the dye and loosens up its hold on your hair.Buy vitamin C at a drugstore or large general store. Look in the vitamins and supplements aisle for vitamin C tablets or powder. Powder will dissolve better in the water, but either one will work fine.Vitamin C works best if your dye has been in for less than 3 days. If it’s been longer, you might still see some results, but they won’t be very drastic."
                },
                {
                    "headline": "Apply the paste to wet hair and let it sit for 1 hour.",
                    "description": "Be sure to apply the paste to wet hair, not dry hair. The vitamin C penetrates best when your hair is wet. After applying the paste, put on a shower cap or wrap up your hair in plastic. Let the paste sit for 1 hour."
                },
                {
                    "headline": "Rinse it out and wash your hair.",
                    "description": "Rinse out the paste thoroughly, then shampoo and condition your hair as you normally would. As long as you apply vitamin C within a few days of dyeing your hair, you should see significant results. You will not need to re-color your hair; the paste is non-damaging."
                }
            ]
        },
        {
            "name": "Vinegar Rinse",
            "steps": [
                {
                    "headline": "Create a mixture of equal parts vinegar and warm water.",
                    "description": "Be sure to use plain white vinegar. Apple cider vinegar is less acidic, so it won't be as effective. Most dyes are meant to handle alkaline substances, like soaps and shampoos, but not acidic substances. The acidity of white vinegar will help to remove the dye. EXPERT TIP\t\t\t\t\t\t\t\tLaura Martin\t\t\tLicensed Cosmetologist\t\t\t\tLaura Martin, a licensed cosmetologist, advises: \"Depending on the type of dye, vinegar may cause the color to fade, but it probably won't remove the dye completely. However, be sure to avoid using vinegar to remove red dye from hair.\""
                },
                {
                    "headline": "Saturate your hair with the mixture.",
                    "description": "Over a sink or tub, douse your hair with the vinegar and water solution. Get your hair good and saturated."
                },
                {
                    "headline": "Cover your hair and wait 15 to 20 minutes.",
                    "description": "Use a shower cap or plastic bag to wrap up your wet hair. Allow your hair to soak in the vinegar mixture for 15 to 20 minutes."
                },
                {
                    "headline": "Shampoo your hair and rinse it thoroughly.",
                    "description": "As you rinse, you'll see color running out with the water. Once the water runs clear, shampoo it again. You can repeat this entire process several times if you need to."
                }
            ]
        }
    ],
    "tyn": [
        "Baking soda",
        "White vinegar",
        "Dish soap",
        "Anti-dandruff shampoo",
        "Vitamin C tablets",
        "Shower cap",
        "Deep conditioner"
    ],
    "text": " Dandruff Shampoo and Baking Soda Purchase dandruff shampoo. You can get this at any drug or grocery store. It will be labelled clearly as a dandruff product. Head & Shoulders and Original Formula Prell are popular options. Dandruff shampoo is a little more heavy-duty than normal shampoo; people with dandruff have excess sebum that causes the skin to flake off, necessitating a stronger formula. Grab some baking soda. Make sure it's baking soda and not baking powder. The packaging often looks similar, but baking powder will not work for this. Baking soda is a natural (although not strong) bleaching agent.Why Baking Soda?Baking soda is a natural cleaning agent—you may have even used it to remove stains before! It will help lighten and remove the dye without bleaching your hair. Combining this cleansing power with dandruff shampoo, which has an active ingredient that fades hair color, makes for a powerful dye-removing mixture.Tip: If you don’t have any baking soda on hand, try the dandruff shampoo alone. Just washing your hair should help remove the dye, especially if it’s semi-permanent. Mix the shampoo and baking soda together in equal parts. You can mix them together in a container, or just pour equal parts of each into the palm of your hand. It doesn't have to be exact! Shampoo your hair with the mixture. Work up a nice lather, then let the mixture sit on your hair for a few minutes before you rinse it out.Shampooing Tips:Get your hair thoroughly wet before you shampoo. Hop in the shower or bath and run your hair under the water for a minute, just as you would before using your regular shampoo.Scrunch the shampoo through your hair evenly. Use both hands to coat the strands, working it all the way from the tips of your hair to the roots.Let the mixture soak in. The shampoo and baking soda need a bit of time to penetrate the strands and work out the dye. Let it sit for 5-7 minutes without touching it or rinsing it out. Rinse thoroughly. You'll see the hair color running out when you rinse. You can wash your hair with this solution several times, if necessary. This works best if you have recently dyed your hair, rather than several months later. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristine George\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster Hairstylist and Colorist\t\t\t\t\t\t\t\tChristine George is a Master Hairstylist, Colorist, and Owner of Luxe Parlour, a premier boutique salon based in the Los Angeles, California area. Christine has over 23 years of hair styling and coloring experience. She specializes in customized haircuts, premium color services, balayage expertise, classic highlights, and color correction. She received her cosmetology degree from the Newberry School of Beauty. Christine George\t\t\tMaster Hairstylist and Colorist\t\t\t\tDid You Know? Since your hair is naturally acidic, you have to apply something alkaline if you want to effectively remove the color. After you rinse some of the dye away, shampooing your hair will restore it to its natural pH level. Dish Soap Mix four or five drops of dish soap with regular shampoo. Palmolive and Dawn are two popular dish soaps you can try. Mix it with a quarter-sized amount of your regular shampoo. Wet your hair and apply the mixture. Rub up a soapy lather, allowing the dish soap to penetrate deeply into the hair. Lather your hair for at least a couple of minutes. Rinse your hair thoroughly. Dish soap causes hair to become very dry and strips out natural oils, so be sure to rinse it out thoroughly. You will probably have to repeat this technique more than once, but because dish soap is so harsh, don't repeat it too many times in a row. Check your hair after each application of dish soap. The results won't be drastic right away, but you should start to see the color fade significantly after doing this for two to three days. Follow up with a deep conditioner every time. Always follow the last rinse with a deep conditioning treatment such as hot oil. Dish soap is extremely drying; your strands will need a dose of hydration every time you use it. You can even sit under a heated dryer to increase the effectiveness of the conditioner. Crushed Vitamin C Make a paste out of Vitamin C tablets. If you dyed your hair a darker color with a semi-permanent dye (one that claims to wash out in 28 shampoos) and only a couple of days have passed, try this technique. Dump a bunch of vitamin C tablets in a bowl, add hot water, and crush with a spoon to make a thick paste.Using Vitamin C TabletsWhy vitamin C? Vitamin C is a safe, non-abrasive option if your hair is dyed a dark color. The acid in vitamin C oxidizes the dye and loosens up its hold on your hair.Buy vitamin C at a drugstore or large general store. Look in the vitamins and supplements aisle for vitamin C tablets or powder. Powder will dissolve better in the water, but either one will work fine.Vitamin C works best if your dye has been in for less than 3 days. If it’s been longer, you might still see some results, but they won’t be very drastic. Apply the paste to wet hair and let it sit for 1 hour. Be sure to apply the paste to wet hair, not dry hair. The vitamin C penetrates best when your hair is wet. After applying the paste, put on a shower cap or wrap up your hair in plastic. Let the paste sit for 1 hour. Rinse it out and wash your hair. Rinse out the paste thoroughly, then shampoo and condition your hair as you normally would. As long as you apply vitamin C within a few days of dyeing your hair, you should see significant results. You will not need to re-color your hair; the paste is non-damaging. Vinegar Rinse Create a mixture of equal parts vinegar and warm water. Be sure to use plain white vinegar. Apple cider vinegar is less acidic, so it won't be as effective. Most dyes are meant to handle alkaline substances, like soaps and shampoos, but not acidic substances. The acidity of white vinegar will help to remove the dye. EXPERT TIP\t\t\t\t\t\t\t\tLaura Martin\t\t\tLicensed Cosmetologist\t\t\t\tLaura Martin, a licensed cosmetologist, advises: \"Depending on the type of dye, vinegar may cause the color to fade, but it probably won't remove the dye completely. However, be sure to avoid using vinegar to remove red dye from hair.\" Saturate your hair with the mixture. Over a sink or tub, douse your hair with the vinegar and water solution. Get your hair good and saturated. Cover your hair and wait 15 to 20 minutes. Use a shower cap or plastic bag to wrap up your wet hair. Allow your hair to soak in the vinegar mixture for 15 to 20 minutes. Shampoo your hair and rinse it thoroughly. As you rinse, you'll see color running out with the water. Once the water runs clear, shampoo it again. You can repeat this entire process several times if you need to.",
    "sentences": [
        " Dandruff Shampoo and Baking Soda Purchase dandruff shampoo.",
        "You can get this at any drug or grocery store.",
        "It will be labelled clearly as a dandruff product.",
        "Head & Shoulders and Original Formula Prell are popular options.",
        "Dandruff shampoo is a little more heavy-duty than normal shampoo; people with dandruff have excess sebum that causes the skin to flake off, necessitating a stronger formula.",
        "Grab some baking soda.",
        "Make sure it's baking soda and not baking powder.",
        "The packaging often looks similar, but baking powder will not work for this.",
        "Baking soda is a natural (although not strong) bleaching agent.Why Baking Soda?Baking soda is a natural cleaning agent—you may have even used it to remove stains before!",
        "It will help lighten and remove the dye without bleaching your hair.",
        "Combining this cleansing power with dandruff shampoo, which has an active ingredient that fades hair color, makes for a powerful dye-removing mixture.Tip: If you don’t have any baking soda on hand, try the dandruff shampoo alone.",
        "Just washing your hair should help remove the dye, especially if it’s semi-permanent.",
        "Mix the shampoo and baking soda together in equal parts.",
        "You can mix them together in a container, or just pour equal parts of each into the palm of your hand.",
        "It doesn't have to be exact!",
        "Shampoo your hair with the mixture.",
        "Work up a nice lather, then let the mixture sit on your hair for a few minutes before you rinse it out.Shampooing Tips:Get your hair thoroughly wet before you shampoo.",
        "Hop in the shower or bath and run your hair under the water for a minute, just as you would before using your regular shampoo.Scrunch the shampoo through your hair evenly.",
        "Use both hands to coat the strands, working it all the way from the tips of your hair to the roots.Let the mixture soak in.",
        "The shampoo and baking soda need a bit of time to penetrate the strands and work out the dye.",
        "Let it sit for 5-7 minutes without touching it or rinsing it out.",
        "Rinse thoroughly.",
        "You'll see the hair color running out when you rinse.",
        "You can wash your hair with this solution several times, if necessary.",
        "This works best if you have recently dyed your hair, rather than several months later.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristine George\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster Hairstylist and Colorist\t\t\t\t\t\t\t\tChristine George is a Master Hairstylist, Colorist, and Owner of Luxe Parlour, a premier boutique salon based in the Los Angeles, California area.",
        "Christine has over 23 years of hair styling and coloring experience.",
        "She specializes in customized haircuts, premium color services, balayage expertise, classic highlights, and color correction.",
        "She received her cosmetology degree from the Newberry School of Beauty.",
        "Christine George\t\t\tMaster Hairstylist and Colorist\t\t\t\tDid You Know?",
        "Since your hair is naturally acidic, you have to apply something alkaline if you want to effectively remove the color.",
        "After you rinse some of the dye away, shampooing your hair will restore it to its natural pH level.",
        "Dish Soap Mix four or five drops of dish soap with regular shampoo.",
        "Palmolive and Dawn are two popular dish soaps you can try.",
        "Mix it with a quarter-sized amount of your regular shampoo.",
        "Wet your hair and apply the mixture.",
        "Rub up a soapy lather, allowing the dish soap to penetrate deeply into the hair.",
        "Lather your hair for at least a couple of minutes.",
        "Rinse your hair thoroughly.",
        "Dish soap causes hair to become very dry and strips out natural oils, so be sure to rinse it out thoroughly.",
        "You will probably have to repeat this technique more than once, but because dish soap is so harsh, don't repeat it too many times in a row.",
        "Check your hair after each application of dish soap.",
        "The results won't be drastic right away, but you should start to see the color fade significantly after doing this for two to three days.",
        "Follow up with a deep conditioner every time.",
        "Always follow the last rinse with a deep conditioning treatment such as hot oil.",
        "Dish soap is extremely drying; your strands will need a dose of hydration every time you use it.",
        "You can even sit under a heated dryer to increase the effectiveness of the conditioner.",
        "Crushed Vitamin C Make a paste out of Vitamin C tablets.",
        "If you dyed your hair a darker color with a semi-permanent dye (one that claims to wash out in 28 shampoos) and only a couple of days have passed, try this technique.",
        "Dump a bunch of vitamin C tablets in a bowl, add hot water, and crush with a spoon to make a thick paste.Using Vitamin C TabletsWhy vitamin C?",
        "Vitamin C is a safe, non-abrasive option if your hair is dyed a dark color.",
        "The acid in vitamin C oxidizes the dye and loosens up its hold on your hair.Buy vitamin C at a drugstore or large general store.",
        "Look in the vitamins and supplements aisle for vitamin C tablets or powder.",
        "Powder will dissolve better in the water, but either one will work fine.Vitamin C works best if your dye has been in for less than 3 days.",
        "If it’s been longer, you might still see some results, but they won’t be very drastic.",
        "Apply the paste to wet hair and let it sit for 1 hour.",
        "Be sure to apply the paste to wet hair, not dry hair.",
        "The vitamin C penetrates best when your hair is wet.",
        "After applying the paste, put on a shower cap or wrap up your hair in plastic.",
        "Let the paste sit for 1 hour.",
        "Rinse it out and wash your hair.",
        "Rinse out the paste thoroughly, then shampoo and condition your hair as you normally would.",
        "As long as you apply vitamin C within a few days of dyeing your hair, you should see significant results.",
        "You will not need to re-color your hair; the paste is non-damaging.",
        "Vinegar Rinse Create a mixture of equal parts vinegar and warm water.",
        "Be sure to use plain white vinegar.",
        "Apple cider vinegar is less acidic, so it won't be as effective.",
        "Most dyes are meant to handle alkaline substances, like soaps and shampoos, but not acidic substances.",
        "The acidity of white vinegar will help to remove the dye.",
        "EXPERT TIP\t\t\t\t\t\t\t\tLaura Martin\t\t\tLicensed Cosmetologist\t\t\t\tLaura Martin, a licensed cosmetologist, advises: \"Depending on the type of dye, vinegar may cause the color to fade, but it probably won't remove the dye completely.",
        "However, be sure to avoid using vinegar to remove red dye from hair.\"",
        "Saturate your hair with the mixture.",
        "Over a sink or tub, douse your hair with the vinegar and water solution.",
        "Get your hair good and saturated.",
        "Cover your hair and wait 15 to 20 minutes.",
        "Use a shower cap or plastic bag to wrap up your wet hair.",
        "Allow your hair to soak in the vinegar mixture for 15 to 20 minutes.",
        "Shampoo your hair and rinse it thoroughly.",
        "As you rinse, you'll see color running out with the water.",
        "Once the water runs clear, shampoo it again.",
        "You can repeat this entire process several times if you need to."
    ]
}