{
    "title": "How to Clean Hair in the Bathroom",
    "url": "https://www.wikihow.com/Clean-Hair-in-the-Bathroom",
    "category_hierarchy": [
        "Personal Care and Style",
        "Personal Hygiene"
    ],
    "methods": [
        {
            "name": "Cleaning Hair off of the Floor",
            "steps": [
                {
                    "headline": "Vacuum hardwood, vinyl, and linoleum floors on the “floor” setting.",
                    "description": "If you have a vacuum that works on both carpets and floors, switch it to the “floor” setting to turn off the spinning beater bar. Vacuum as much of the hair as you can and use any attachments to suck up hair in corners, cracks, and crevices. Avoid vacuuming stone and ceramic tiled floors because the vacuum could cause surface damage. It also won’t work as well on uneven (tiled) surfaces. Vinyl floors, in particular, can be damaged by the spinning beater bar, so be sure to turn it off. If you don’t have a large vacuum, store a small hand-held vacuum in your bathroom cabinet to make cleaning up hair more convenient."
                },
                {
                    "headline": "Use a large reusable sticky roller on any even surface.",
                    "description": "Use a large sticky roller the same way you'd use a mop or vacuum, rolling it across every area of the floor. Start towards the center of the bathroom and go towards the outer edges so hair doesn't stick to your shoes (and disperse) as you're cleaning. Clean the roller after each use with soap and water. While a sticky roller can pick up hair off of any surface, it won’t work as well on uneven surfaces like stone and tiled floors. You can purchase a large sticky roller at any hardware store or supermarket with a home cleaning section."
                },
                {
                    "headline": "Sweep hair from any type of floor with a rubber squeegee broom.",
                    "description": "Use a rubber broom just like a regular broom, pulling it toward you in short, deliberate strokes. It's best to start around the edges of the bathroom and sweep the hair towards you. Then, sweep it all into a dustpan and toss it in the trash. Rinse the head of the broom under running water to clean it after each use. Rubber brooms are more effective at picking up hair than a regular broom and can be used on vinyl, hardwood, stone, ceramic, and linoleum floors. For uneven stone floors and ceramic tiled floors with lots of grout lines, use a bristled rubber broom. You can buy a squeegee or bristled rubber broom at any home and hardware store."
                },
                {
                    "headline": "Dry-mop your bathroom floor before damp-mopping.",
                    "description": "Go over the entire surface area of the bathroom floor with any dry mop (like a Swiffer) to grab hair and debris. If you’re washing your floors, do the same thing with a regular sponge wet mop. Soak the sponge of the mop in a cleansing formula that’s safe for your floors and then wring it out (so it’s not dripping wet) before mopping. Damp-mopping a floor that hasn’t been dry-mopped will only push the hair around and make it stick to the floor. Dry-mopping can grab hair from most floor surfaces, but it may not work as well on uneven natural stone or tiled floors with lots of grout lines."
                }
            ]
        },
        {
            "name": "Removing Hair from Bathroom Countertops",
            "steps": [
                {
                    "headline": "Use a hand-held sticky roller to pick up loose strands from any surface.",
                    "description": "Peel off the outer layer of a sticky (lint) roller to reveal a fresh sticky sheet. Then, roll the roller over the entire surface of the countertop to collect hair and debris. You can also use this on the floor or bathroom rugs, but it might take a while! A small sticky roller won’t work on uneven surfaces like natural stone or ceramic tiles with a lot of grout lines."
                },
                {
                    "headline": "Wipe down the counter with a microfiber rag or dry dust wipe.",
                    "description": "Lay a microfiber hand towel or dust wipe over your palm and wipe down the entire surface of the countertop. Make sure to cover every nook and cranny where hair might be hiding! Dry dust wipes pick up more hair than a paper towel or regular towel would. Microfiber towels and dust wipes are safe to use on any type of surface."
                },
                {
                    "headline": "Clean laminate countertops with a damp microfiber rag and a mild cleanser.",
                    "description": "Dampen the microfiber towel and spritz the countertop with a layer of a mild household cleanser. Run the microfiber towel over the entire surface of the counter to pick up hair and debris. Avoid anything that’s super acidic or alkaline because these can corrode the surface of laminate countertops and cause discoloration. You may need to stop and pick off any hair from the surface of the towel while you’re cleaning. Mild cleansers are safe to use on most surfaces except wood because it’s extremely porous and any moisture can cause discoloration or weaken the wood."
                },
                {
                    "headline": "Remove hair from granite and marble countertops with dish soap and water.",
                    "description": "Pour about 1 tablespoon (15 mL) of mild dish soap into a 14  fl oz (410 mL) or 16  fl oz (470 mL) spray bottle and fill it up with warm water. Shake it and then spray the solution liberally onto the counter. Dampen a microfiber towel or soft rag and wipe away the dust and hair. Don’t use anything with lemon juice or other acids (like vinegar) on granite or marble countertops because it will eat through the sealant that protects the surface from stains and etches. Dish soap and water can be used on any other type of surface as long as you don’t use an abrasive sponge like steel wool or the backside of kitchen sponges because these can scratch the surface of granite, marble, stone, wood, porcelain, fiberglass, and ceramic countertops."
                },
                {
                    "headline": "Use a stone-specific commercial cleanser for stone countertops.",
                    "description": "Look for a formula that specifically says “for natural stone surfaces” or “pH-neutral” on the package. Spray a liberal amount of the cleanser onto the surface and wipe away hair and dust with a microfiber cloth. Avoid using cleansers containing high-acidity ingredients like vinegar, bleach, and ammonia because they can damage the stone. Stone-safe cleansers are safe to use on any other surface, even painted wood."
                }
            ]
        },
        {
            "name": "Wiping Hair from Showers, Tubs, and Sinks",
            "steps": [
                {
                    "headline": "Rub dry surfaces in a circular motion with your fingers to gather hair.",
                    "description": "If you notice dry hair on the sides of your tub, shower, or sink, use your hand to rub the surface in a circular motion to grab the hair. Then, once it’s balled up, toss it in the trash. This will only work on any surface if the hair and surface are dry. Any moisture will make the strands stick to the surface. You can also put a hairband or rubber band around your hand (so it lies across your palm) and go over the surface that way. The band acts as a lip for the hair to stick to. You can do this with ceramic, fiberglass, or porcelain tubs, showers, and sinks."
                },
                {
                    "headline": "Use a squeegee or microfiber towel to clean stone sinks and showers.",
                    "description": "Use plain water or spray the surface of the stone with a stone-safe cleaner. Wipe up the hair and other grime with a microfiber cloth or, for flat stone surfaces, a squeegee. You can also use a soft, non-scratch sponge to gather hair out of curved sinks or uneven stone surfaces."
                },
                {
                    "headline": "Clean glass surfaces with a mild cleanser and a microfiber cloth.",
                    "description": "If your sink or shower walls are glass, use a mild glass cleaner and a soft sponge or microfiber towel to remove hair. Spritz the glass cleaner onto the surface and go over the surface of the glass in circular motions to gather and remove the strands. Avoid using any cleaners containing chlorine or bleach because these could damage the surface of the glass sink or shower door."
                },
                {
                    "headline": "Run a dry sponge over porcelain or metal surfaces to catch hair.",
                    "description": "Hold a simple, dry kitchen sponge at the base of the tub or sink (near the drain) and run it out towards the sides. Then, do a final circular sweep around the sink or tub to gather the hair. Use your fingers to remove the hair from the surface once it’s balled up. If the sink or tub is wet, some of the hair will stick to the sponge and some will stay on the surface. Go over it again with a dry paper towel to get any stuck-on strands."
                },
                {
                    "headline": "Soak a soft kitchen sponge in vinegar to clean fiberglass tubs and sinks.",
                    "description": "Fiberglass can stand up to the acidity of white vinegar—just be sure to use a soft sponge so you don't scratch the surface of your tub or sink. Submerge a soft kitchen sponge in undiluted white vinegar and wipe down the entire tub or sink. Rinse the sponge under cool water when it’s soiled and re-soak it to continue cleaning. For extra cleaning power, sprinkle some baking soda onto the surface before you wipe it down. The combination of baking soda and vinegar creates a fizzy paste that will loosen any stuck-on soap scum or mildew. You can use vinegar (and baking soda, if you choose) on all surfaces except granite, marble, wood, and natural stone."
                }
            ]
        }
    ],
    "tyn": [
        "Cleaning Hair off of Bathroom Floors",
        "Vacuum (with \"floor\" setting)",
        "Large reusable sticky roller",
        "Rubber broom",
        "Dry mop",
        "Wet sponge mop",
        "Commercial floor cleanser (according to the surface)",
        "Apple cider vinegar and water (for vinyl)",
        "Dish soap and warm water (for ceramic and linoleum floors, optional)",
        "Spray bottle (for a DIY solution, optional)",
        "Removing Hair from Bathroom Countertops",
        "Hand-held sticky roller",
        "Microfiber rag",
        "Dry dust wipe",
        "Mild household cleanser (for laminate)",
        "Dish soap and water (for granite and marble)",
        "Stone-safe commercial cleanser (for stone countertops)",
        "Wiping Hair from Showers, Tubs, and Sinks",
        "Mild dish soap and sponge (for porcelain)",
        "Squeegee or microfiber towel (for stone)",
        "Stone-safe commercial cleanser",
        "Mild commercial glass cleaner",
        "White vinegar",
        "Microfiber towel",
        "Soft kitchen sponge (for fiberglass and metallic surfaces)",
        "Non-scratch sponge (for stone, optional)",
        "Rubber band (or hairband, optional)"
    ],
    "text": " Cleaning Hair off of the Floor Vacuum hardwood, vinyl, and linoleum floors on the “floor” setting. If you have a vacuum that works on both carpets and floors, switch it to the “floor” setting to turn off the spinning beater bar. Vacuum as much of the hair as you can and use any attachments to suck up hair in corners, cracks, and crevices. Avoid vacuuming stone and ceramic tiled floors because the vacuum could cause surface damage. It also won’t work as well on uneven (tiled) surfaces. Vinyl floors, in particular, can be damaged by the spinning beater bar, so be sure to turn it off. If you don’t have a large vacuum, store a small hand-held vacuum in your bathroom cabinet to make cleaning up hair more convenient. Use a large reusable sticky roller on any even surface. Use a large sticky roller the same way you'd use a mop or vacuum, rolling it across every area of the floor. Start towards the center of the bathroom and go towards the outer edges so hair doesn't stick to your shoes (and disperse) as you're cleaning. Clean the roller after each use with soap and water. While a sticky roller can pick up hair off of any surface, it won’t work as well on uneven surfaces like stone and tiled floors. You can purchase a large sticky roller at any hardware store or supermarket with a home cleaning section. Sweep hair from any type of floor with a rubber squeegee broom. Use a rubber broom just like a regular broom, pulling it toward you in short, deliberate strokes. It's best to start around the edges of the bathroom and sweep the hair towards you. Then, sweep it all into a dustpan and toss it in the trash. Rinse the head of the broom under running water to clean it after each use. Rubber brooms are more effective at picking up hair than a regular broom and can be used on vinyl, hardwood, stone, ceramic, and linoleum floors. For uneven stone floors and ceramic tiled floors with lots of grout lines, use a bristled rubber broom. You can buy a squeegee or bristled rubber broom at any home and hardware store. Dry-mop your bathroom floor before damp-mopping. Go over the entire surface area of the bathroom floor with any dry mop (like a Swiffer) to grab hair and debris. If you’re washing your floors, do the same thing with a regular sponge wet mop. Soak the sponge of the mop in a cleansing formula that’s safe for your floors and then wring it out (so it’s not dripping wet) before mopping. Damp-mopping a floor that hasn’t been dry-mopped will only push the hair around and make it stick to the floor. Dry-mopping can grab hair from most floor surfaces, but it may not work as well on uneven natural stone or tiled floors with lots of grout lines. Removing Hair from Bathroom Countertops Use a hand-held sticky roller to pick up loose strands from any surface. Peel off the outer layer of a sticky (lint) roller to reveal a fresh sticky sheet. Then, roll the roller over the entire surface of the countertop to collect hair and debris. You can also use this on the floor or bathroom rugs, but it might take a while! A small sticky roller won’t work on uneven surfaces like natural stone or ceramic tiles with a lot of grout lines. Wipe down the counter with a microfiber rag or dry dust wipe. Lay a microfiber hand towel or dust wipe over your palm and wipe down the entire surface of the countertop. Make sure to cover every nook and cranny where hair might be hiding! Dry dust wipes pick up more hair than a paper towel or regular towel would. Microfiber towels and dust wipes are safe to use on any type of surface. Clean laminate countertops with a damp microfiber rag and a mild cleanser. Dampen the microfiber towel and spritz the countertop with a layer of a mild household cleanser. Run the microfiber towel over the entire surface of the counter to pick up hair and debris. Avoid anything that’s super acidic or alkaline because these can corrode the surface of laminate countertops and cause discoloration. You may need to stop and pick off any hair from the surface of the towel while you’re cleaning. Mild cleansers are safe to use on most surfaces except wood because it’s extremely porous and any moisture can cause discoloration or weaken the wood. Remove hair from granite and marble countertops with dish soap and water. Pour about 1 tablespoon (15 mL) of mild dish soap into a 14  fl oz (410 mL) or 16  fl oz (470 mL) spray bottle and fill it up with warm water. Shake it and then spray the solution liberally onto the counter. Dampen a microfiber towel or soft rag and wipe away the dust and hair. Don’t use anything with lemon juice or other acids (like vinegar) on granite or marble countertops because it will eat through the sealant that protects the surface from stains and etches. Dish soap and water can be used on any other type of surface as long as you don’t use an abrasive sponge like steel wool or the backside of kitchen sponges because these can scratch the surface of granite, marble, stone, wood, porcelain, fiberglass, and ceramic countertops. Use a stone-specific commercial cleanser for stone countertops. Look for a formula that specifically says “for natural stone surfaces” or “pH-neutral” on the package. Spray a liberal amount of the cleanser onto the surface and wipe away hair and dust with a microfiber cloth. Avoid using cleansers containing high-acidity ingredients like vinegar, bleach, and ammonia because they can damage the stone. Stone-safe cleansers are safe to use on any other surface, even painted wood. Wiping Hair from Showers, Tubs, and Sinks Rub dry surfaces in a circular motion with your fingers to gather hair. If you notice dry hair on the sides of your tub, shower, or sink, use your hand to rub the surface in a circular motion to grab the hair. Then, once it’s balled up, toss it in the trash. This will only work on any surface if the hair and surface are dry. Any moisture will make the strands stick to the surface. You can also put a hairband or rubber band around your hand (so it lies across your palm) and go over the surface that way. The band acts as a lip for the hair to stick to. You can do this with ceramic, fiberglass, or porcelain tubs, showers, and sinks. Use a squeegee or microfiber towel to clean stone sinks and showers. Use plain water or spray the surface of the stone with a stone-safe cleaner. Wipe up the hair and other grime with a microfiber cloth or, for flat stone surfaces, a squeegee. You can also use a soft, non-scratch sponge to gather hair out of curved sinks or uneven stone surfaces. Clean glass surfaces with a mild cleanser and a microfiber cloth. If your sink or shower walls are glass, use a mild glass cleaner and a soft sponge or microfiber towel to remove hair. Spritz the glass cleaner onto the surface and go over the surface of the glass in circular motions to gather and remove the strands. Avoid using any cleaners containing chlorine or bleach because these could damage the surface of the glass sink or shower door. Run a dry sponge over porcelain or metal surfaces to catch hair. Hold a simple, dry kitchen sponge at the base of the tub or sink (near the drain) and run it out towards the sides. Then, do a final circular sweep around the sink or tub to gather the hair. Use your fingers to remove the hair from the surface once it’s balled up. If the sink or tub is wet, some of the hair will stick to the sponge and some will stay on the surface. Go over it again with a dry paper towel to get any stuck-on strands. Soak a soft kitchen sponge in vinegar to clean fiberglass tubs and sinks. Fiberglass can stand up to the acidity of white vinegar—just be sure to use a soft sponge so you don't scratch the surface of your tub or sink. Submerge a soft kitchen sponge in undiluted white vinegar and wipe down the entire tub or sink. Rinse the sponge under cool water when it’s soiled and re-soak it to continue cleaning. For extra cleaning power, sprinkle some baking soda onto the surface before you wipe it down. The combination of baking soda and vinegar creates a fizzy paste that will loosen any stuck-on soap scum or mildew. You can use vinegar (and baking soda, if you choose) on all surfaces except granite, marble, wood, and natural stone.",
    "sentences": [
        " Cleaning Hair off of the Floor Vacuum hardwood, vinyl, and linoleum floors on the “floor” setting.",
        "If you have a vacuum that works on both carpets and floors, switch it to the “floor” setting to turn off the spinning beater bar.",
        "Vacuum as much of the hair as you can and use any attachments to suck up hair in corners, cracks, and crevices.",
        "Avoid vacuuming stone and ceramic tiled floors because the vacuum could cause surface damage.",
        "It also won’t work as well on uneven (tiled) surfaces.",
        "Vinyl floors, in particular, can be damaged by the spinning beater bar, so be sure to turn it off.",
        "If you don’t have a large vacuum, store a small hand-held vacuum in your bathroom cabinet to make cleaning up hair more convenient.",
        "Use a large reusable sticky roller on any even surface.",
        "Use a large sticky roller the same way you'd use a mop or vacuum, rolling it across every area of the floor.",
        "Start towards the center of the bathroom and go towards the outer edges so hair doesn't stick to your shoes (and disperse) as you're cleaning.",
        "Clean the roller after each use with soap and water.",
        "While a sticky roller can pick up hair off of any surface, it won’t work as well on uneven surfaces like stone and tiled floors.",
        "You can purchase a large sticky roller at any hardware store or supermarket with a home cleaning section.",
        "Sweep hair from any type of floor with a rubber squeegee broom.",
        "Use a rubber broom just like a regular broom, pulling it toward you in short, deliberate strokes.",
        "It's best to start around the edges of the bathroom and sweep the hair towards you.",
        "Then, sweep it all into a dustpan and toss it in the trash.",
        "Rinse the head of the broom under running water to clean it after each use.",
        "Rubber brooms are more effective at picking up hair than a regular broom and can be used on vinyl, hardwood, stone, ceramic, and linoleum floors.",
        "For uneven stone floors and ceramic tiled floors with lots of grout lines, use a bristled rubber broom.",
        "You can buy a squeegee or bristled rubber broom at any home and hardware store.",
        "Dry-mop your bathroom floor before damp-mopping.",
        "Go over the entire surface area of the bathroom floor with any dry mop (like a Swiffer) to grab hair and debris.",
        "If you’re washing your floors, do the same thing with a regular sponge wet mop.",
        "Soak the sponge of the mop in a cleansing formula that’s safe for your floors and then wring it out (so it’s not dripping wet) before mopping.",
        "Damp-mopping a floor that hasn’t been dry-mopped will only push the hair around and make it stick to the floor.",
        "Dry-mopping can grab hair from most floor surfaces, but it may not work as well on uneven natural stone or tiled floors with lots of grout lines.",
        "Removing Hair from Bathroom Countertops Use a hand-held sticky roller to pick up loose strands from any surface.",
        "Peel off the outer layer of a sticky (lint) roller to reveal a fresh sticky sheet.",
        "Then, roll the roller over the entire surface of the countertop to collect hair and debris.",
        "You can also use this on the floor or bathroom rugs, but it might take a while!",
        "A small sticky roller won’t work on uneven surfaces like natural stone or ceramic tiles with a lot of grout lines.",
        "Wipe down the counter with a microfiber rag or dry dust wipe.",
        "Lay a microfiber hand towel or dust wipe over your palm and wipe down the entire surface of the countertop.",
        "Make sure to cover every nook and cranny where hair might be hiding!",
        "Dry dust wipes pick up more hair than a paper towel or regular towel would.",
        "Microfiber towels and dust wipes are safe to use on any type of surface.",
        "Clean laminate countertops with a damp microfiber rag and a mild cleanser.",
        "Dampen the microfiber towel and spritz the countertop with a layer of a mild household cleanser.",
        "Run the microfiber towel over the entire surface of the counter to pick up hair and debris.",
        "Avoid anything that’s super acidic or alkaline because these can corrode the surface of laminate countertops and cause discoloration.",
        "You may need to stop and pick off any hair from the surface of the towel while you’re cleaning.",
        "Mild cleansers are safe to use on most surfaces except wood because it’s extremely porous and any moisture can cause discoloration or weaken the wood.",
        "Remove hair from granite and marble countertops with dish soap and water.",
        "Pour about 1 tablespoon (15 mL) of mild dish soap into a 14  fl oz (410 mL) or 16  fl oz (470 mL) spray bottle and fill it up with warm water.",
        "Shake it and then spray the solution liberally onto the counter.",
        "Dampen a microfiber towel or soft rag and wipe away the dust and hair.",
        "Don’t use anything with lemon juice or other acids (like vinegar) on granite or marble countertops because it will eat through the sealant that protects the surface from stains and etches.",
        "Dish soap and water can be used on any other type of surface as long as you don’t use an abrasive sponge like steel wool or the backside of kitchen sponges because these can scratch the surface of granite, marble, stone, wood, porcelain, fiberglass, and ceramic countertops.",
        "Use a stone-specific commercial cleanser for stone countertops.",
        "Look for a formula that specifically says “for natural stone surfaces” or “pH-neutral” on the package.",
        "Spray a liberal amount of the cleanser onto the surface and wipe away hair and dust with a microfiber cloth.",
        "Avoid using cleansers containing high-acidity ingredients like vinegar, bleach, and ammonia because they can damage the stone.",
        "Stone-safe cleansers are safe to use on any other surface, even painted wood.",
        "Wiping Hair from Showers, Tubs, and Sinks Rub dry surfaces in a circular motion with your fingers to gather hair.",
        "If you notice dry hair on the sides of your tub, shower, or sink, use your hand to rub the surface in a circular motion to grab the hair.",
        "Then, once it’s balled up, toss it in the trash.",
        "This will only work on any surface if the hair and surface are dry.",
        "Any moisture will make the strands stick to the surface.",
        "You can also put a hairband or rubber band around your hand (so it lies across your palm) and go over the surface that way.",
        "The band acts as a lip for the hair to stick to.",
        "You can do this with ceramic, fiberglass, or porcelain tubs, showers, and sinks.",
        "Use a squeegee or microfiber towel to clean stone sinks and showers.",
        "Use plain water or spray the surface of the stone with a stone-safe cleaner.",
        "Wipe up the hair and other grime with a microfiber cloth or, for flat stone surfaces, a squeegee.",
        "You can also use a soft, non-scratch sponge to gather hair out of curved sinks or uneven stone surfaces.",
        "Clean glass surfaces with a mild cleanser and a microfiber cloth.",
        "If your sink or shower walls are glass, use a mild glass cleaner and a soft sponge or microfiber towel to remove hair.",
        "Spritz the glass cleaner onto the surface and go over the surface of the glass in circular motions to gather and remove the strands.",
        "Avoid using any cleaners containing chlorine or bleach because these could damage the surface of the glass sink or shower door.",
        "Run a dry sponge over porcelain or metal surfaces to catch hair.",
        "Hold a simple, dry kitchen sponge at the base of the tub or sink (near the drain) and run it out towards the sides.",
        "Then, do a final circular sweep around the sink or tub to gather the hair.",
        "Use your fingers to remove the hair from the surface once it’s balled up.",
        "If the sink or tub is wet, some of the hair will stick to the sponge and some will stay on the surface.",
        "Go over it again with a dry paper towel to get any stuck-on strands.",
        "Soak a soft kitchen sponge in vinegar to clean fiberglass tubs and sinks.",
        "Fiberglass can stand up to the acidity of white vinegar—just be sure to use a soft sponge so you don't scratch the surface of your tub or sink.",
        "Submerge a soft kitchen sponge in undiluted white vinegar and wipe down the entire tub or sink.",
        "Rinse the sponge under cool water when it’s soiled and re-soak it to continue cleaning.",
        "For extra cleaning power, sprinkle some baking soda onto the surface before you wipe it down.",
        "The combination of baking soda and vinegar creates a fizzy paste that will loosen any stuck-on soap scum or mildew.",
        "You can use vinegar (and baking soda, if you choose) on all surfaces except granite, marble, wood, and natural stone."
    ]
}