{
    "title": "How to Make a Tree Seat",
    "url": "https://www.wikihow.com/Make-a-Tree-Seat",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "parts": [
        {
            "name": "Creating Your Template",
            "steps": [
                {
                    "headline": "Calculate your tree’s diameter and add 6 inches (15 cm).",
                    "description": "Inspect your tree carefully to find the thickest point near the bottom 1–3 ft (0.30–0.91 m) of the trunk. Take a cloth measuring tape and wrap it around your tree. Divide this number by pi (3.14) to get your diameter. Add 6 inches (15 cm) to that measurement and write it down. Round your numbers up to the nearest whole number to make things easier. For example, if the circumference of your tree is 89 inches (230 cm), divide it by 3.14 to get 29.34 inches (74.5 cm). Round this number up to 28 inches (71 cm) and write your base number down as 34 inches (86 cm). The extra space will prevent the tree from breaking your bench in the event that it grows at an odd angle. If your tree is on the younger side and you expect it to grow over the course of the next 10-20 years, add 12–18 inches (30–46 cm) to the diameter. This process will result in a 6-sided bench, which is ideal for wrapping around a tree without leaving a ton of variation in the amount of open space between your bench boards and the trunk."
                },
                {
                    "headline": "Divide the diameter by 1.75 (4.5 cm) to find the length of your interior bench boards.",
                    "description": "Your tree bench will be made out of a sequence of parallel boards that wrap around your tree in a hexagon. To calculate how big you’re going to make your interior bench boards, divide your base measurement by 1.75 (4.5 cm). Write this length down on a scrap piece of paper. Round any numbers up to the nearest whole number to make things easier. For example, if your base length is 34 inches (86 cm), divide it by 1.75 (4.5 cm) to get 19.42 inches (49.3 cm). Round this up to 20 inches (51 cm) to make things easy."
                },
                {
                    "headline": "Mark your interior board length on a ⁄4 by 6 in (3.2 by 15.2 cm) board.",
                    "description": "Set out a ⁄4 by 6 in (3.2 by 15.2 cm) length of wood on a stable work surface. Use your measuring tape to measure out the length you’ve just calculated. Use a carpentry pencil to put hash marks at the bottom of one side of the board’s length.Tip: If you want to use thicker boards, simply reduce the number of boards you use to construct the bench. This method uses 4 lengths of ⁄4 by 6 in (3.2 by 15.2 cm) lumber, but you can use 3 or 2 boards if you get thicker wood. These hash marks indicate the length of your interior board, closest to the tree. For the wood, make sure that you get hardwood, like pine or oak, that has been thermally-treated to protect it from the elements."
                },
                {
                    "headline": "Draw a line leading away from each hash mark at a 30-degree angle.",
                    "description": "Hold a speed square against the base of the board where you made your first mark. Pivot the speed square until you have a 30-degree angle pointing away from the center of the board. Draw a line through the board using the speed square as your straight edge. Repeat this process on the other side. This should look like a trapezoid with the lines leading away from you."
                },
                {
                    "headline": "Repeat this process 5 more times to finish your interior boards.",
                    "description": "Use your measuring tape, speed square, and carpentry pencil to repeat this process on 5 additional lengths of ⁄4 by 6 in (3.2 by 15.2 cm) boards. Once you’ve measured the interior boards, you won’t need to do anymore measuring for the bench."
                }
            ]
        },
        {
            "name": "Cutting Your Bench Boards",
            "steps": [
                {
                    "headline": "Cut your interior boards using a miter saw.",
                    "description": "Put on some protective eyewear and some thick gloves. Plug your miter saw in and adjust the angle of the saw by moving the guideline on the base of the saw until it reads 30-degrees. Place your first board flush against the plate of the saw. Turn the saw on and slowly lower the blade into the line that you drew to trim the board. Repeat this process on the other 11 lines that you’ve drawn.Warning: Do not adjust the angle of the saw after you’ve made each cut. Do not adjust it after you finish cutting all of the interior boards. Every cut you make will be at a 30-degree angle and messing with the angle will throw future cuts off. You have to flip the board around after every cut since the lines you’ve drawn lead away from the center."
                },
                {
                    "headline": "Lay 3 other boards above one of the interior boards.",
                    "description": "Once your interior boards are cut, put them together on the ground in the shape of a hexagon to make sure they fit. Then, set one of the boards on a stable surface with 30-degree cuts pointing away from you. Lay 3 boards lengthwise above the piece that you cut. Insert ⁄4–⁄4 in (0.64–1.91 cm) spacers in between the boards to separate them a little. Put at least 2 spacers between each board to ensure that the boards are separated evenly. The size of your spacers will determine how much space is in between each board. So long as this distance is less than 1 in (2.5 cm) but more than 0.1 in (0.25 cm), your bench will be structurally sound."
                },
                {
                    "headline": "Use a scrap piece of wood as a straight edge to mark your cuts.",
                    "description": "Lay a scrap piece of wood on top of the boards. Adjust it so that the edge of the cut interior board is flush with the edge of the scrap piece of wood. Use your carpentry pencil to extend the angle that you cut through the 3 boards above it. Repeat this process for the other 11 lines that you’ve drawn. Once you finish extending the lines of an interior board, set the pieces aside and a new set of 3 boards for each interior board. You’re essentially extending the 30-degree angle out from your interior board by tracing its path. If you don’t have a ton of space, make a note in the middle of each board to indicate whether it belongs in the first, second, third, or fourth layer of your bench. If you do have plenty of room, set the boards aside in the proper order to keep track of your layers."
                },
                {
                    "headline": "Cut all of your boards to size at a 30-degree angle.",
                    "description": "Do not adjust the angle of your miter saw. Set each piece of lumber underneath the blade and use it to make plunge cuts along each of your lines. Cut each piece to size the same way you did when you were cutting the interior boards. With all of your boards cut, set your pieces out on the ground or a large table and check to make sure that all of your boards fit together in a hexagon."
                }
            ]
        },
        {
            "name": "Making Your Legs",
            "steps": [
                {
                    "headline": "Cut 12 lengths out of a 4 by 4 in (10 by 10 cm) board.",
                    "description": "Take a 4 by 4 in (10 by 10 cm) board and set it out on a stable work surface. Use a measuring tape and speed square to mark off 12 hash marks at a 90-degree angle on the board. Put 12–18 in (30–46 cm) between them based on how tall you want the bench to be. Adjust your miter saw to cut at 90-degrees and trim the board into 12 lengths. The length of these boards will determine how high your bench is. You can make it a little taller or shorter if you’d like, but most tree benches are 12–18 inches (30–46 cm) tall. Keep in mind that the bench boards will add a little height as well. You will attach 2 legs to each corner of your hexagon-shaped bench."
                },
                {
                    "headline": "Create 12 braces out of 4 by 4 in (10 by 10 cm) boards.",
                    "description": "Create 12 braces to hold the legs in place on both sides. Grab a long 4 by 4 in (10 by 10 cm) and use a measuring tape and carpentry pencil to draw your cut lines. Place 1 cut line every 17 in (43 cm) until you’ve marked off 12 lengths. Use your miter saw to split your lumber into 12 pieces to create your braces. The 2 braces will hold the legs in place from opposite sides to keep the legs from wobbling or buckling. These braces are also known as stringers."
                },
                {
                    "headline": "Connect 2 braces to 2 legs and clamp them in place.",
                    "description": "Put 1 bracer down horizontally on a stable work surface. Then, set 1 leg on top of the brace at a 90-degree angle. Line the top left corner of the leg up with the top left corner of the brace. Repeat this process using a second leg on the right. Put a second bracer on top of the 2 legs and the first brace and hold it in place. Clamp the pieces together to hold them still. This should look like a square with 1 side missing. When you install the legs, the braces will go at the top."
                },
                {
                    "headline": "Secure the legs to the braces using 2.5 in (6.4 cm) wood screws.",
                    "description": "Drill 2 2.5 in (6.4 cm) screws through all 3 pieces of wood on the left. Drill 2 additional screws through the leg and braces on the right. Flip the legs over and add 4 more screws from the opposite side. It doesn’t matter where you place your screws so long as they’re securing the middle portion of the leg and you aren’t drilling into the exact same location on both sides."
                },
                {
                    "headline": "Repeat this process 6 times to create your leg assemblies.",
                    "description": "Make 5 more leg and brace structures to give each corner of your hexagon bench its own support. For each piece, lay a bracer down, add 2 legs, and put a bracer on top. Drill 2 screws into each side where the 3 pieces meet.Tip: For an additional layer of support, drill a ⁄8 by 4 in (0.95 by 10.16 cm) carriage bolt through the center of each leg where it meets the brace."
                }
            ]
        },
        {
            "name": "Assembling the Bench",
            "steps": [
                {
                    "headline": "Stand your legs up on a flat surface and clamp them down.",
                    "description": "Set your 6 legs up in a hexagon on a flat, stable work surface. Line each set of legs up so that they’re pointing at the center of your hexagon. Lay your bench boards on top of the legs in the same order that you’re going to install them. Put heavy objects against both sides of each leg to keep them still. Don’t worry about being super precise. You’re going to adjust the location of the legs after you lay your boards on top. You’ll probably end up making multiple adjustments until the bench boards are laying correctly."
                },
                {
                    "headline": "Lay 5 sides of the bench down on top of the legs.",
                    "description": "Take each bench board and rest it on top of the horizontal pieces connecting the legs. Move your legs accordingly until the legs are even with each angle where the hexagonal boards meet. Push the legs in a little so that there is a ⁄2 in (1.3 cm) of space between the front of the bench and the leg underneath. Put your spacers back into each of the boards to ensure that they’re evenly spaced out on every side. This is tricky since nothing is holding the boards in place. Take your time and work slowly. Enlist someone to help you carry and lower the individual boards into place. Take a good look at the structure once you’re done. Look underneath to ensure that the angle where the bench boards meet is the center of each leg and that your boards are spaced out evenly before moving on."
                },
                {
                    "headline": "Drill ⁄32 in (0.24 cm) pilot holes through the boards and legs.",
                    "description": "Put a ⁄32 in (0.24 cm) pilot bit in your drill. Bore 1 pilot hole all the way through the middle of each board where it meets the brace. Choose one side of the bench to leave open, but leave the boards in place for reference. You’ll finish the last section when the bench is around the tree. This will be a total of 40 pilot holes. A pilot hole is a small hole that you drill into a piece of wood to create threading for a screw. It also prevents the wood from splintering when you screw into it."
                },
                {
                    "headline": "Drill 2 in (5.1 cm) wood screws through the pilot holes.",
                    "description": "To secure the boards to the braces, grab some 2 in (5.1 cm) wood screws. Line each screw up with the pilot hole that you made and drill it into the wood slowly using the lowest power setting on your drill. Continue drilling until the screw is flush with the surface of the board. Screw all of your boards into place, leaving 1 side unsecured. At this point, you should have a 5-sided hexagon with 1 side missing."
                },
                {
                    "headline": "Wrap the bench around the tree using the opened side.",
                    "description": "Take the unscrewed boards off of the bench and set them aside. Enlist the help of a friend to help you carry your bench. Pick it up on opposite sides and carry it to your tree. Slide the bench around the tree using the open side of the bench. Set the bench down once the trunk is in the center of the bench. If you attempt to lift the bench on your own, it may break under the odd distribution of weight from the unsecured side. Rotate the bench to orient it until you’re happy with the way that it curves around the trunk."
                },
                {
                    "headline": "Finish the last side of your bench.",
                    "description": "With the bench sitting around your tree, finish the last set of boards. Put your boards in place and lay your spacers in between each board. Drill your pilot holes through the center of each bench board where it meets the brace and screw the boards in. Take all of your spacers out when you’re done."
                },
                {
                    "headline": "Level the bench using a spirit level and a garden spade.",
                    "description": "Take a spirit level and rest it horizontally on top of your bench. Look at the bubble in the middle of the level. If it’s floating in the middle, your bench is even. Repeat this process for each side of your bench. On uneven sides, use a garden spade to remove the dirt underneath the legs until the bench becomes level.Tip: Once you’re done, feel free to paint your bench or finish your bench if you’d like. At the bare minimum, waterproof the bench to protect it from the elements. Use a natural brush to cover the wood with an outdoor waterproofing lacquer or varnish. Skip this step if you’re installing the bench on a paved or gravel surface. The bench is going to shift and settle over time as the legs compress the soil underneath, so it’s never really going to be perfect."
                }
            ]
        }
    ],
    "tyn": [
        "Measuring tape",
        "Cloth measuring tape",
        "Carpentry pencil",
        "Scrap wood",
        "Speed square",
        "Miter saw",
        "Protective eyewear",
        "Thick gloves",
        "Dust mask (optional)",
        "5⁄4",
        "5",
        "⁄",
        "4",
        " by 6 in (3.2 by 15.2 cm) boards",
        "1⁄4",
        "1",
        "–",
        "3⁄4",
        "3",
        " in (0.64–1.91 cm) spacers",
        "4 by 4 in (10 by 10 cm) boards",
        "2.5 in (6.4 cm) screws",
        "2 in (5.1 cm) screws",
        "3⁄8",
        "8",
        " by 4 in (0.95 by 10.16 cm) carriage bolts",
        "Clamps",
        "Spirit level",
        "Garden spade",
        "Natural brush",
        "Waterproof varnish or lacquer"
    ],
    "text": " Creating Your Template Calculate your tree’s diameter and add 6 inches (15 cm). Inspect your tree carefully to find the thickest point near the bottom 1–3 ft (0.30–0.91 m) of the trunk. Take a cloth measuring tape and wrap it around your tree. Divide this number by pi (3.14) to get your diameter. Add 6 inches (15 cm) to that measurement and write it down. Round your numbers up to the nearest whole number to make things easier. For example, if the circumference of your tree is 89 inches (230 cm), divide it by 3.14 to get 29.34 inches (74.5 cm). Round this number up to 28 inches (71 cm) and write your base number down as 34 inches (86 cm). The extra space will prevent the tree from breaking your bench in the event that it grows at an odd angle. If your tree is on the younger side and you expect it to grow over the course of the next 10-20 years, add 12–18 inches (30–46 cm) to the diameter. This process will result in a 6-sided bench, which is ideal for wrapping around a tree without leaving a ton of variation in the amount of open space between your bench boards and the trunk. Divide the diameter by 1.75 (4.5 cm) to find the length of your interior bench boards. Your tree bench will be made out of a sequence of parallel boards that wrap around your tree in a hexagon. To calculate how big you’re going to make your interior bench boards, divide your base measurement by 1.75 (4.5 cm). Write this length down on a scrap piece of paper. Round any numbers up to the nearest whole number to make things easier. For example, if your base length is 34 inches (86 cm), divide it by 1.75 (4.5 cm) to get 19.42 inches (49.3 cm). Round this up to 20 inches (51 cm) to make things easy. Mark your interior board length on a ⁄4 by 6 in (3.2 by 15.2 cm) board. Set out a ⁄4 by 6 in (3.2 by 15.2 cm) length of wood on a stable work surface. Use your measuring tape to measure out the length you’ve just calculated. Use a carpentry pencil to put hash marks at the bottom of one side of the board’s length.Tip: If you want to use thicker boards, simply reduce the number of boards you use to construct the bench. This method uses 4 lengths of ⁄4 by 6 in (3.2 by 15.2 cm) lumber, but you can use 3 or 2 boards if you get thicker wood. These hash marks indicate the length of your interior board, closest to the tree. For the wood, make sure that you get hardwood, like pine or oak, that has been thermally-treated to protect it from the elements. Draw a line leading away from each hash mark at a 30-degree angle. Hold a speed square against the base of the board where you made your first mark. Pivot the speed square until you have a 30-degree angle pointing away from the center of the board. Draw a line through the board using the speed square as your straight edge. Repeat this process on the other side. This should look like a trapezoid with the lines leading away from you. Repeat this process 5 more times to finish your interior boards. Use your measuring tape, speed square, and carpentry pencil to repeat this process on 5 additional lengths of ⁄4 by 6 in (3.2 by 15.2 cm) boards. Once you’ve measured the interior boards, you won’t need to do anymore measuring for the bench. Cutting Your Bench Boards Cut your interior boards using a miter saw. Put on some protective eyewear and some thick gloves. Plug your miter saw in and adjust the angle of the saw by moving the guideline on the base of the saw until it reads 30-degrees. Place your first board flush against the plate of the saw. Turn the saw on and slowly lower the blade into the line that you drew to trim the board. Repeat this process on the other 11 lines that you’ve drawn.Warning: Do not adjust the angle of the saw after you’ve made each cut. Do not adjust it after you finish cutting all of the interior boards. Every cut you make will be at a 30-degree angle and messing with the angle will throw future cuts off. You have to flip the board around after every cut since the lines you’ve drawn lead away from the center. Lay 3 other boards above one of the interior boards. Once your interior boards are cut, put them together on the ground in the shape of a hexagon to make sure they fit. Then, set one of the boards on a stable surface with 30-degree cuts pointing away from you. Lay 3 boards lengthwise above the piece that you cut. Insert ⁄4–⁄4 in (0.64–1.91 cm) spacers in between the boards to separate them a little. Put at least 2 spacers between each board to ensure that the boards are separated evenly. The size of your spacers will determine how much space is in between each board. So long as this distance is less than 1 in (2.5 cm) but more than 0.1 in (0.25 cm), your bench will be structurally sound. Use a scrap piece of wood as a straight edge to mark your cuts. Lay a scrap piece of wood on top of the boards. Adjust it so that the edge of the cut interior board is flush with the edge of the scrap piece of wood. Use your carpentry pencil to extend the angle that you cut through the 3 boards above it. Repeat this process for the other 11 lines that you’ve drawn. Once you finish extending the lines of an interior board, set the pieces aside and a new set of 3 boards for each interior board. You’re essentially extending the 30-degree angle out from your interior board by tracing its path. If you don’t have a ton of space, make a note in the middle of each board to indicate whether it belongs in the first, second, third, or fourth layer of your bench. If you do have plenty of room, set the boards aside in the proper order to keep track of your layers. Cut all of your boards to size at a 30-degree angle. Do not adjust the angle of your miter saw. Set each piece of lumber underneath the blade and use it to make plunge cuts along each of your lines. Cut each piece to size the same way you did when you were cutting the interior boards. With all of your boards cut, set your pieces out on the ground or a large table and check to make sure that all of your boards fit together in a hexagon. Making Your Legs Cut 12 lengths out of a 4 by 4 in (10 by 10 cm) board. Take a 4 by 4 in (10 by 10 cm) board and set it out on a stable work surface. Use a measuring tape and speed square to mark off 12 hash marks at a 90-degree angle on the board. Put 12–18 in (30–46 cm) between them based on how tall you want the bench to be. Adjust your miter saw to cut at 90-degrees and trim the board into 12 lengths. The length of these boards will determine how high your bench is. You can make it a little taller or shorter if you’d like, but most tree benches are 12–18 inches (30–46 cm) tall. Keep in mind that the bench boards will add a little height as well. You will attach 2 legs to each corner of your hexagon-shaped bench. Create 12 braces out of 4 by 4 in (10 by 10 cm) boards. Create 12 braces to hold the legs in place on both sides. Grab a long 4 by 4 in (10 by 10 cm) and use a measuring tape and carpentry pencil to draw your cut lines. Place 1 cut line every 17 in (43 cm) until you’ve marked off 12 lengths. Use your miter saw to split your lumber into 12 pieces to create your braces. The 2 braces will hold the legs in place from opposite sides to keep the legs from wobbling or buckling. These braces are also known as stringers. Connect 2 braces to 2 legs and clamp them in place. Put 1 bracer down horizontally on a stable work surface. Then, set 1 leg on top of the brace at a 90-degree angle. Line the top left corner of the leg up with the top left corner of the brace. Repeat this process using a second leg on the right. Put a second bracer on top of the 2 legs and the first brace and hold it in place. Clamp the pieces together to hold them still. This should look like a square with 1 side missing. When you install the legs, the braces will go at the top. Secure the legs to the braces using 2.5 in (6.4 cm) wood screws. Drill 2 2.5 in (6.4 cm) screws through all 3 pieces of wood on the left. Drill 2 additional screws through the leg and braces on the right. Flip the legs over and add 4 more screws from the opposite side. It doesn’t matter where you place your screws so long as they’re securing the middle portion of the leg and you aren’t drilling into the exact same location on both sides. Repeat this process 6 times to create your leg assemblies. Make 5 more leg and brace structures to give each corner of your hexagon bench its own support. For each piece, lay a bracer down, add 2 legs, and put a bracer on top. Drill 2 screws into each side where the 3 pieces meet.Tip: For an additional layer of support, drill a ⁄8 by 4 in (0.95 by 10.16 cm) carriage bolt through the center of each leg where it meets the brace. Assembling the Bench Stand your legs up on a flat surface and clamp them down. Set your 6 legs up in a hexagon on a flat, stable work surface. Line each set of legs up so that they’re pointing at the center of your hexagon. Lay your bench boards on top of the legs in the same order that you’re going to install them. Put heavy objects against both sides of each leg to keep them still. Don’t worry about being super precise. You’re going to adjust the location of the legs after you lay your boards on top. You’ll probably end up making multiple adjustments until the bench boards are laying correctly. Lay 5 sides of the bench down on top of the legs. Take each bench board and rest it on top of the horizontal pieces connecting the legs. Move your legs accordingly until the legs are even with each angle where the hexagonal boards meet. Push the legs in a little so that there is a ⁄2 in (1.3 cm) of space between the front of the bench and the leg underneath. Put your spacers back into each of the boards to ensure that they’re evenly spaced out on every side. This is tricky since nothing is holding the boards in place. Take your time and work slowly. Enlist someone to help you carry and lower the individual boards into place. Take a good look at the structure once you’re done. Look underneath to ensure that the angle where the bench boards meet is the center of each leg and that your boards are spaced out evenly before moving on. Drill ⁄32 in (0.24 cm) pilot holes through the boards and legs. Put a ⁄32 in (0.24 cm) pilot bit in your drill. Bore 1 pilot hole all the way through the middle of each board where it meets the brace. Choose one side of the bench to leave open, but leave the boards in place for reference. You’ll finish the last section when the bench is around the tree. This will be a total of 40 pilot holes. A pilot hole is a small hole that you drill into a piece of wood to create threading for a screw. It also prevents the wood from splintering when you screw into it. Drill 2 in (5.1 cm) wood screws through the pilot holes. To secure the boards to the braces, grab some 2 in (5.1 cm) wood screws. Line each screw up with the pilot hole that you made and drill it into the wood slowly using the lowest power setting on your drill. Continue drilling until the screw is flush with the surface of the board. Screw all of your boards into place, leaving 1 side unsecured. At this point, you should have a 5-sided hexagon with 1 side missing. Wrap the bench around the tree using the opened side. Take the unscrewed boards off of the bench and set them aside. Enlist the help of a friend to help you carry your bench. Pick it up on opposite sides and carry it to your tree. Slide the bench around the tree using the open side of the bench. Set the bench down once the trunk is in the center of the bench. If you attempt to lift the bench on your own, it may break under the odd distribution of weight from the unsecured side. Rotate the bench to orient it until you’re happy with the way that it curves around the trunk. Finish the last side of your bench. With the bench sitting around your tree, finish the last set of boards. Put your boards in place and lay your spacers in between each board. Drill your pilot holes through the center of each bench board where it meets the brace and screw the boards in. Take all of your spacers out when you’re done. Level the bench using a spirit level and a garden spade. Take a spirit level and rest it horizontally on top of your bench. Look at the bubble in the middle of the level. If it’s floating in the middle, your bench is even. Repeat this process for each side of your bench. On uneven sides, use a garden spade to remove the dirt underneath the legs until the bench becomes level.Tip: Once you’re done, feel free to paint your bench or finish your bench if you’d like. At the bare minimum, waterproof the bench to protect it from the elements. Use a natural brush to cover the wood with an outdoor waterproofing lacquer or varnish. Skip this step if you’re installing the bench on a paved or gravel surface. The bench is going to shift and settle over time as the legs compress the soil underneath, so it’s never really going to be perfect.",
    "sentences": [
        " Creating Your Template Calculate your tree’s diameter and add 6 inches (15 cm).",
        "Inspect your tree carefully to find the thickest point near the bottom 1–3 ft (0.30–0.91 m) of the trunk.",
        "Take a cloth measuring tape and wrap it around your tree.",
        "Divide this number by pi (3.14) to get your diameter.",
        "Add 6 inches (15 cm) to that measurement and write it down.",
        "Round your numbers up to the nearest whole number to make things easier.",
        "For example, if the circumference of your tree is 89 inches (230 cm), divide it by 3.14 to get 29.34 inches (74.5 cm).",
        "Round this number up to 28 inches (71 cm) and write your base number down as 34 inches (86 cm).",
        "The extra space will prevent the tree from breaking your bench in the event that it grows at an odd angle.",
        "If your tree is on the younger side and you expect it to grow over the course of the next 10-20 years, add 12–18 inches (30–46 cm) to the diameter.",
        "This process will result in a 6-sided bench, which is ideal for wrapping around a tree without leaving a ton of variation in the amount of open space between your bench boards and the trunk.",
        "Divide the diameter by 1.75 (4.5 cm) to find the length of your interior bench boards.",
        "Your tree bench will be made out of a sequence of parallel boards that wrap around your tree in a hexagon.",
        "To calculate how big you’re going to make your interior bench boards, divide your base measurement by 1.75 (4.5 cm).",
        "Write this length down on a scrap piece of paper.",
        "Round any numbers up to the nearest whole number to make things easier.",
        "For example, if your base length is 34 inches (86 cm), divide it by 1.75 (4.5 cm) to get 19.42 inches (49.3 cm).",
        "Round this up to 20 inches (51 cm) to make things easy.",
        "Mark your interior board length on a ⁄4 by 6 in (3.2 by 15.2 cm) board.",
        "Set out a ⁄4 by 6 in (3.2 by 15.2 cm) length of wood on a stable work surface.",
        "Use your measuring tape to measure out the length you’ve just calculated.",
        "Use a carpentry pencil to put hash marks at the bottom of one side of the board’s length.Tip: If you want to use thicker boards, simply reduce the number of boards you use to construct the bench.",
        "This method uses 4 lengths of ⁄4 by 6 in (3.2 by 15.2 cm) lumber, but you can use 3 or 2 boards if you get thicker wood.",
        "These hash marks indicate the length of your interior board, closest to the tree.",
        "For the wood, make sure that you get hardwood, like pine or oak, that has been thermally-treated to protect it from the elements.",
        "Draw a line leading away from each hash mark at a 30-degree angle.",
        "Hold a speed square against the base of the board where you made your first mark.",
        "Pivot the speed square until you have a 30-degree angle pointing away from the center of the board.",
        "Draw a line through the board using the speed square as your straight edge.",
        "Repeat this process on the other side.",
        "This should look like a trapezoid with the lines leading away from you.",
        "Repeat this process 5 more times to finish your interior boards.",
        "Use your measuring tape, speed square, and carpentry pencil to repeat this process on 5 additional lengths of ⁄4 by 6 in (3.2 by 15.2 cm) boards.",
        "Once you’ve measured the interior boards, you won’t need to do anymore measuring for the bench.",
        "Cutting Your Bench Boards Cut your interior boards using a miter saw.",
        "Put on some protective eyewear and some thick gloves.",
        "Plug your miter saw in and adjust the angle of the saw by moving the guideline on the base of the saw until it reads 30-degrees.",
        "Place your first board flush against the plate of the saw.",
        "Turn the saw on and slowly lower the blade into the line that you drew to trim the board.",
        "Repeat this process on the other 11 lines that you’ve drawn.Warning: Do not adjust the angle of the saw after you’ve made each cut.",
        "Do not adjust it after you finish cutting all of the interior boards.",
        "Every cut you make will be at a 30-degree angle and messing with the angle will throw future cuts off.",
        "You have to flip the board around after every cut since the lines you’ve drawn lead away from the center.",
        "Lay 3 other boards above one of the interior boards.",
        "Once your interior boards are cut, put them together on the ground in the shape of a hexagon to make sure they fit.",
        "Then, set one of the boards on a stable surface with 30-degree cuts pointing away from you.",
        "Lay 3 boards lengthwise above the piece that you cut.",
        "Insert ⁄4–⁄4 in (0.64–1.91 cm) spacers in between the boards to separate them a little.",
        "Put at least 2 spacers between each board to ensure that the boards are separated evenly.",
        "The size of your spacers will determine how much space is in between each board.",
        "So long as this distance is less than 1 in (2.5 cm) but more than 0.1 in (0.25 cm), your bench will be structurally sound.",
        "Use a scrap piece of wood as a straight edge to mark your cuts.",
        "Lay a scrap piece of wood on top of the boards.",
        "Adjust it so that the edge of the cut interior board is flush with the edge of the scrap piece of wood.",
        "Use your carpentry pencil to extend the angle that you cut through the 3 boards above it.",
        "Repeat this process for the other 11 lines that you’ve drawn.",
        "Once you finish extending the lines of an interior board, set the pieces aside and a new set of 3 boards for each interior board.",
        "You’re essentially extending the 30-degree angle out from your interior board by tracing its path.",
        "If you don’t have a ton of space, make a note in the middle of each board to indicate whether it belongs in the first, second, third, or fourth layer of your bench.",
        "If you do have plenty of room, set the boards aside in the proper order to keep track of your layers.",
        "Cut all of your boards to size at a 30-degree angle.",
        "Do not adjust the angle of your miter saw.",
        "Set each piece of lumber underneath the blade and use it to make plunge cuts along each of your lines.",
        "Cut each piece to size the same way you did when you were cutting the interior boards.",
        "With all of your boards cut, set your pieces out on the ground or a large table and check to make sure that all of your boards fit together in a hexagon.",
        "Making Your Legs Cut 12 lengths out of a 4 by 4 in (10 by 10 cm) board.",
        "Take a 4 by 4 in (10 by 10 cm) board and set it out on a stable work surface.",
        "Use a measuring tape and speed square to mark off 12 hash marks at a 90-degree angle on the board.",
        "Put 12–18 in (30–46 cm) between them based on how tall you want the bench to be.",
        "Adjust your miter saw to cut at 90-degrees and trim the board into 12 lengths.",
        "The length of these boards will determine how high your bench is.",
        "You can make it a little taller or shorter if you’d like, but most tree benches are 12–18 inches (30–46 cm) tall.",
        "Keep in mind that the bench boards will add a little height as well.",
        "You will attach 2 legs to each corner of your hexagon-shaped bench.",
        "Create 12 braces out of 4 by 4 in (10 by 10 cm) boards.",
        "Create 12 braces to hold the legs in place on both sides.",
        "Grab a long 4 by 4 in (10 by 10 cm) and use a measuring tape and carpentry pencil to draw your cut lines.",
        "Place 1 cut line every 17 in (43 cm) until you’ve marked off 12 lengths.",
        "Use your miter saw to split your lumber into 12 pieces to create your braces.",
        "The 2 braces will hold the legs in place from opposite sides to keep the legs from wobbling or buckling.",
        "These braces are also known as stringers.",
        "Connect 2 braces to 2 legs and clamp them in place.",
        "Put 1 bracer down horizontally on a stable work surface.",
        "Then, set 1 leg on top of the brace at a 90-degree angle.",
        "Line the top left corner of the leg up with the top left corner of the brace.",
        "Repeat this process using a second leg on the right.",
        "Put a second bracer on top of the 2 legs and the first brace and hold it in place.",
        "Clamp the pieces together to hold them still.",
        "This should look like a square with 1 side missing.",
        "When you install the legs, the braces will go at the top.",
        "Secure the legs to the braces using 2.5 in (6.4 cm) wood screws.",
        "Drill 2 2.5 in (6.4 cm) screws through all 3 pieces of wood on the left.",
        "Drill 2 additional screws through the leg and braces on the right.",
        "Flip the legs over and add 4 more screws from the opposite side.",
        "It doesn’t matter where you place your screws so long as they’re securing the middle portion of the leg and you aren’t drilling into the exact same location on both sides.",
        "Repeat this process 6 times to create your leg assemblies.",
        "Make 5 more leg and brace structures to give each corner of your hexagon bench its own support.",
        "For each piece, lay a bracer down, add 2 legs, and put a bracer on top.",
        "Drill 2 screws into each side where the 3 pieces meet.Tip: For an additional layer of support, drill a ⁄8 by 4 in (0.95 by 10.16 cm) carriage bolt through the center of each leg where it meets the brace.",
        "Assembling the Bench Stand your legs up on a flat surface and clamp them down.",
        "Set your 6 legs up in a hexagon on a flat, stable work surface.",
        "Line each set of legs up so that they’re pointing at the center of your hexagon.",
        "Lay your bench boards on top of the legs in the same order that you’re going to install them.",
        "Put heavy objects against both sides of each leg to keep them still.",
        "Don’t worry about being super precise.",
        "You’re going to adjust the location of the legs after you lay your boards on top.",
        "You’ll probably end up making multiple adjustments until the bench boards are laying correctly.",
        "Lay 5 sides of the bench down on top of the legs.",
        "Take each bench board and rest it on top of the horizontal pieces connecting the legs.",
        "Move your legs accordingly until the legs are even with each angle where the hexagonal boards meet.",
        "Push the legs in a little so that there is a ⁄2 in (1.3 cm) of space between the front of the bench and the leg underneath.",
        "Put your spacers back into each of the boards to ensure that they’re evenly spaced out on every side.",
        "This is tricky since nothing is holding the boards in place.",
        "Take your time and work slowly.",
        "Enlist someone to help you carry and lower the individual boards into place.",
        "Take a good look at the structure once you’re done.",
        "Look underneath to ensure that the angle where the bench boards meet is the center of each leg and that your boards are spaced out evenly before moving on.",
        "Drill ⁄32 in (0.24 cm) pilot holes through the boards and legs.",
        "Put a ⁄32 in (0.24 cm) pilot bit in your drill.",
        "Bore 1 pilot hole all the way through the middle of each board where it meets the brace.",
        "Choose one side of the bench to leave open, but leave the boards in place for reference.",
        "You’ll finish the last section when the bench is around the tree.",
        "This will be a total of 40 pilot holes.",
        "A pilot hole is a small hole that you drill into a piece of wood to create threading for a screw.",
        "It also prevents the wood from splintering when you screw into it.",
        "Drill 2 in (5.1 cm) wood screws through the pilot holes.",
        "To secure the boards to the braces, grab some 2 in (5.1 cm) wood screws.",
        "Line each screw up with the pilot hole that you made and drill it into the wood slowly using the lowest power setting on your drill.",
        "Continue drilling until the screw is flush with the surface of the board.",
        "Screw all of your boards into place, leaving 1 side unsecured.",
        "At this point, you should have a 5-sided hexagon with 1 side missing.",
        "Wrap the bench around the tree using the opened side.",
        "Take the unscrewed boards off of the bench and set them aside.",
        "Enlist the help of a friend to help you carry your bench.",
        "Pick it up on opposite sides and carry it to your tree.",
        "Slide the bench around the tree using the open side of the bench.",
        "Set the bench down once the trunk is in the center of the bench.",
        "If you attempt to lift the bench on your own, it may break under the odd distribution of weight from the unsecured side.",
        "Rotate the bench to orient it until you’re happy with the way that it curves around the trunk.",
        "Finish the last side of your bench.",
        "With the bench sitting around your tree, finish the last set of boards.",
        "Put your boards in place and lay your spacers in between each board.",
        "Drill your pilot holes through the center of each bench board where it meets the brace and screw the boards in.",
        "Take all of your spacers out when you’re done.",
        "Level the bench using a spirit level and a garden spade.",
        "Take a spirit level and rest it horizontally on top of your bench.",
        "Look at the bubble in the middle of the level.",
        "If it’s floating in the middle, your bench is even.",
        "Repeat this process for each side of your bench.",
        "On uneven sides, use a garden spade to remove the dirt underneath the legs until the bench becomes level.Tip: Once you’re done, feel free to paint your bench or finish your bench if you’d like.",
        "At the bare minimum, waterproof the bench to protect it from the elements.",
        "Use a natural brush to cover the wood with an outdoor waterproofing lacquer or varnish.",
        "Skip this step if you’re installing the bench on a paved or gravel surface.",
        "The bench is going to shift and settle over time as the legs compress the soil underneath, so it’s never really going to be perfect."
    ]
}