{
    "title": "How to Clean a Spiralizer",
    "url": "https://www.wikihow.com/Clean-a-Spiralizer",
    "category_hierarchy": [
        "Food and Entertaining",
        "Cooking Equipment",
        "Care and Use of Cooking Equipment"
    ],
    "methods": [
        {
            "name": "Washing Spiralizer Parts",
            "steps": [
                {
                    "headline": "Switch off and unplug the spiralizer and then remove its parts.",
                    "description": "Unplugging the device first is important for safety reasons. Remove the blades and other removable parts from the spiralizer, such as the turning handle, food tray, and sliding board.Be careful not to touch the blades or you may cut yourself. Only grasp the plastic edges. Consult the manufacturer’s instructions if you’re unsure about which parts you can remove and clean."
                },
                {
                    "headline": "Rinse loose food off the parts or soak them to remove crusted on food.",
                    "description": "Hold the blades and other parts under warm, running water to rinse them right after you finish using them. If the blades and other spiralizer parts have food stuck on them, soak them in a large bowl or sink filled with hot, soapy water. Let the parts soak for 10 minutes and then rinse off the soapy water.Food will get stuck on the blades and other parts the longer you wait to clean them. To make cleanup easier, rinse the parts right after you finish using your spiralizer. Be careful when you reach into the water to grasp the parts. Make sure that you can see into it so you do not touch a sharp edge by accident.Tip: You could also pour the parts into a large colander and then hold them under warm, running water to rinse them. This will eliminate the need to reach into the bowl or sink, so you’ll be less likely to cut yourself."
                },
                {
                    "headline": "Wash the parts in your dishwasher if they’re not too dirty.",
                    "description": "Space the parts out so that they are not touching any other items. Add your normal dishwasher detergent. Then, set the dishwasher to the normal wash cycle and turn it on.Keep in mind that some spiralizers recommend against machine washing since it may wear the parts down more quickly. Refer to your spiralizer’s instructions before you place them in the dishwasher."
                },
                {
                    "headline": "Scrub the blades and other parts by hand if there’s food stuck on them.",
                    "description": "Moisten the nylon brush with warm water and add a few drops of dish soap to it. Then, scrub the blades and all surfaces of the spiralizer parts to clean them. Use small circular motions and firm pressure to remove any stuck on food.Be careful not to touch any sharp surfaces on the spiralizer blades as you are cleaning them. Hold the plastic parts or dull outer edges. Never use a sponge to clean spiralizer blades and other sharp parts. This puts your fingers at risk for cuts.Tip: You can also use a toothbrush to clean your spiralizer if you don’t have a nylon dish brush. Just make sure it’s a clean toothbrush that you don’t need."
                },
                {
                    "headline": "Rinse the spiralizer parts and set them on a towel to air dry.",
                    "description": "After you finish scrubbing the blades and other spiralizer parts, hold the parts under warm, running water to rinse off the soap. Then, place the blades and other parts on a clean, dry cloth or paper towel to air dry.Don’t try to wipe off any of the parts of the spiralizer that are sharp, such as the blades. This puts you at risk for cuts, so it’s best to let the parts air-dry. Repeat the process after each use."
                }
            ]
        },
        {
            "name": "Cleaning the Spiralizer Body",
            "steps": [
                {
                    "headline": "Switch off and unplug the spiralizer before wiping it down.",
                    "description": "Introducing water to a plugged in electrical device could lead to an electric shock. Switch the machine off and then unplug it as well to be certain it’s safe to clean it."
                },
                {
                    "headline": "Moisten a clean cloth towel and add a few drops of dish soap.",
                    "description": "Use a reusable towel or cloth and moisten it with warm water. Then place a few drops of dish soap on it and squeeze the cloth a few times to work the soap around.Never use any harsh cleansers to wipe down the body of your spiralizer. Stick to regular dish soap and water."
                },
                {
                    "headline": "Wipe down the body of the device with the cloth.",
                    "description": "Use the soapy, moist cloth to wipe all surfaces of the device. Concentrate on any areas that have stuck on food by applying more pressure with the cloth to rub these surfaces clean."
                },
                {
                    "headline": "Rinse the cloth and wipe down the body of the spiralizer again.",
                    "description": "Dip the cloth into a bowl of clean, warm water and wring it out or hold it under running water and then wring it out. Repeat this 3-4 more times to remove all of the soap from the cloth. Then, wipe down the spiralizer again to remove the soap.You may need to repeat this a few times to get all of the soap off."
                },
                {
                    "headline": "Dry off the spiralizer by wiping it with a clean, dry towel.",
                    "description": "After you finish wiping away the soap, switch to a clean, dry cloth or paper towel. Wipe all surfaces of the spiralizer’s body to dry it off.Tip: Keep in mind that you do not need to clean the body of the spiralizer after each use. Doing this after every second or third use should be plenty to keep it clean."
                }
            ]
        }
    ],
    "tyn": [
        "Washing Spiralizer Parts",
        "Nylon scrub brush or toothbrush",
        "Dish soap",
        "Large bowl or sink with stopper",
        "Dishwasher detergent",
        "Clean, dry cloth towel",
        "Cleaning the Spiralizer Body",
        "Paper towels (optional)"
    ],
    "text": " Washing Spiralizer Parts Switch off and unplug the spiralizer and then remove its parts. Unplugging the device first is important for safety reasons. Remove the blades and other removable parts from the spiralizer, such as the turning handle, food tray, and sliding board.Be careful not to touch the blades or you may cut yourself. Only grasp the plastic edges. Consult the manufacturer’s instructions if you’re unsure about which parts you can remove and clean. Rinse loose food off the parts or soak them to remove crusted on food. Hold the blades and other parts under warm, running water to rinse them right after you finish using them. If the blades and other spiralizer parts have food stuck on them, soak them in a large bowl or sink filled with hot, soapy water. Let the parts soak for 10 minutes and then rinse off the soapy water.Food will get stuck on the blades and other parts the longer you wait to clean them. To make cleanup easier, rinse the parts right after you finish using your spiralizer. Be careful when you reach into the water to grasp the parts. Make sure that you can see into it so you do not touch a sharp edge by accident.Tip: You could also pour the parts into a large colander and then hold them under warm, running water to rinse them. This will eliminate the need to reach into the bowl or sink, so you’ll be less likely to cut yourself. Wash the parts in your dishwasher if they’re not too dirty. Space the parts out so that they are not touching any other items. Add your normal dishwasher detergent. Then, set the dishwasher to the normal wash cycle and turn it on.Keep in mind that some spiralizers recommend against machine washing since it may wear the parts down more quickly. Refer to your spiralizer’s instructions before you place them in the dishwasher. Scrub the blades and other parts by hand if there’s food stuck on them. Moisten the nylon brush with warm water and add a few drops of dish soap to it. Then, scrub the blades and all surfaces of the spiralizer parts to clean them. Use small circular motions and firm pressure to remove any stuck on food.Be careful not to touch any sharp surfaces on the spiralizer blades as you are cleaning them. Hold the plastic parts or dull outer edges. Never use a sponge to clean spiralizer blades and other sharp parts. This puts your fingers at risk for cuts.Tip: You can also use a toothbrush to clean your spiralizer if you don’t have a nylon dish brush. Just make sure it’s a clean toothbrush that you don’t need. Rinse the spiralizer parts and set them on a towel to air dry. After you finish scrubbing the blades and other spiralizer parts, hold the parts under warm, running water to rinse off the soap. Then, place the blades and other parts on a clean, dry cloth or paper towel to air dry.Don’t try to wipe off any of the parts of the spiralizer that are sharp, such as the blades. This puts you at risk for cuts, so it’s best to let the parts air-dry. Repeat the process after each use. Cleaning the Spiralizer Body Switch off and unplug the spiralizer before wiping it down. Introducing water to a plugged in electrical device could lead to an electric shock. Switch the machine off and then unplug it as well to be certain it’s safe to clean it. Moisten a clean cloth towel and add a few drops of dish soap. Use a reusable towel or cloth and moisten it with warm water. Then place a few drops of dish soap on it and squeeze the cloth a few times to work the soap around.Never use any harsh cleansers to wipe down the body of your spiralizer. Stick to regular dish soap and water. Wipe down the body of the device with the cloth. Use the soapy, moist cloth to wipe all surfaces of the device. Concentrate on any areas that have stuck on food by applying more pressure with the cloth to rub these surfaces clean. Rinse the cloth and wipe down the body of the spiralizer again. Dip the cloth into a bowl of clean, warm water and wring it out or hold it under running water and then wring it out. Repeat this 3-4 more times to remove all of the soap from the cloth. Then, wipe down the spiralizer again to remove the soap.You may need to repeat this a few times to get all of the soap off. Dry off the spiralizer by wiping it with a clean, dry towel. After you finish wiping away the soap, switch to a clean, dry cloth or paper towel. Wipe all surfaces of the spiralizer’s body to dry it off.Tip: Keep in mind that you do not need to clean the body of the spiralizer after each use. Doing this after every second or third use should be plenty to keep it clean.",
    "sentences": [
        " Washing Spiralizer Parts Switch off and unplug the spiralizer and then remove its parts.",
        "Unplugging the device first is important for safety reasons.",
        "Remove the blades and other removable parts from the spiralizer, such as the turning handle, food tray, and sliding board.Be careful not to touch the blades or you may cut yourself.",
        "Only grasp the plastic edges.",
        "Consult the manufacturer’s instructions if you’re unsure about which parts you can remove and clean.",
        "Rinse loose food off the parts or soak them to remove crusted on food.",
        "Hold the blades and other parts under warm, running water to rinse them right after you finish using them.",
        "If the blades and other spiralizer parts have food stuck on them, soak them in a large bowl or sink filled with hot, soapy water.",
        "Let the parts soak for 10 minutes and then rinse off the soapy water.Food will get stuck on the blades and other parts the longer you wait to clean them.",
        "To make cleanup easier, rinse the parts right after you finish using your spiralizer.",
        "Be careful when you reach into the water to grasp the parts.",
        "Make sure that you can see into it so you do not touch a sharp edge by accident.Tip: You could also pour the parts into a large colander and then hold them under warm, running water to rinse them.",
        "This will eliminate the need to reach into the bowl or sink, so you’ll be less likely to cut yourself.",
        "Wash the parts in your dishwasher if they’re not too dirty.",
        "Space the parts out so that they are not touching any other items.",
        "Add your normal dishwasher detergent.",
        "Then, set the dishwasher to the normal wash cycle and turn it on.Keep in mind that some spiralizers recommend against machine washing since it may wear the parts down more quickly.",
        "Refer to your spiralizer’s instructions before you place them in the dishwasher.",
        "Scrub the blades and other parts by hand if there’s food stuck on them.",
        "Moisten the nylon brush with warm water and add a few drops of dish soap to it.",
        "Then, scrub the blades and all surfaces of the spiralizer parts to clean them.",
        "Use small circular motions and firm pressure to remove any stuck on food.Be careful not to touch any sharp surfaces on the spiralizer blades as you are cleaning them.",
        "Hold the plastic parts or dull outer edges.",
        "Never use a sponge to clean spiralizer blades and other sharp parts.",
        "This puts your fingers at risk for cuts.Tip: You can also use a toothbrush to clean your spiralizer if you don’t have a nylon dish brush.",
        "Just make sure it’s a clean toothbrush that you don’t need.",
        "Rinse the spiralizer parts and set them on a towel to air dry.",
        "After you finish scrubbing the blades and other spiralizer parts, hold the parts under warm, running water to rinse off the soap.",
        "Then, place the blades and other parts on a clean, dry cloth or paper towel to air dry.Don’t try to wipe off any of the parts of the spiralizer that are sharp, such as the blades.",
        "This puts you at risk for cuts, so it’s best to let the parts air-dry.",
        "Repeat the process after each use.",
        "Cleaning the Spiralizer Body Switch off and unplug the spiralizer before wiping it down.",
        "Introducing water to a plugged in electrical device could lead to an electric shock.",
        "Switch the machine off and then unplug it as well to be certain it’s safe to clean it.",
        "Moisten a clean cloth towel and add a few drops of dish soap.",
        "Use a reusable towel or cloth and moisten it with warm water.",
        "Then place a few drops of dish soap on it and squeeze the cloth a few times to work the soap around.Never use any harsh cleansers to wipe down the body of your spiralizer.",
        "Stick to regular dish soap and water.",
        "Wipe down the body of the device with the cloth.",
        "Use the soapy, moist cloth to wipe all surfaces of the device.",
        "Concentrate on any areas that have stuck on food by applying more pressure with the cloth to rub these surfaces clean.",
        "Rinse the cloth and wipe down the body of the spiralizer again.",
        "Dip the cloth into a bowl of clean, warm water and wring it out or hold it under running water and then wring it out.",
        "Repeat this 3-4 more times to remove all of the soap from the cloth.",
        "Then, wipe down the spiralizer again to remove the soap.You may need to repeat this a few times to get all of the soap off.",
        "Dry off the spiralizer by wiping it with a clean, dry towel.",
        "After you finish wiping away the soap, switch to a clean, dry cloth or paper towel.",
        "Wipe all surfaces of the spiralizer’s body to dry it off.Tip: Keep in mind that you do not need to clean the body of the spiralizer after each use.",
        "Doing this after every second or third use should be plenty to keep it clean."
    ]
}