{
    "title": "How to Make Peach Jam",
    "url": "https://www.wikihow.com/Make-Peach-Jam",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments",
        "Jams and Jellies"
    ],
    "methods": [
        {
            "name": "Traditional Peach Jam",
            "steps": [
                {
                    "headline": "Chop up 12 fresh peaches.",
                    "description": "Rinse 12 peaches under running water and chop them into eighths. Then, cut them width-wise into smaller, bite-sized pieces. Remove the pit and throw it away as you chop. Choose peaches that are firm and slightly under-ripe. They have more pectin than riper peaches, which will help your jam stay firm."
                },
                {
                    "headline": "Crush up 1 cup of peaches in a large saucepan.",
                    "description": "Measure out 1 cup (225 g) of your chopped peaches and pour them into a large saucepan. Use a fork or handheld potato masher to crush the peaches into even smaller pieces, until they're juicy and almost falling apart. Crushing in the saucepan ensures that all the juices get cooked with the peaches. Don't place the pan on the stove just yet! You won't start cooking until you add the remaining peaches."
                },
                {
                    "headline": "Add the rest of the peaches and boil them until they're liquid.",
                    "description": "Pour your remaining chopped peaches into the same saucepan. Place the pan on the stove over medium-low heat and bring it to a low boil until the peaches start to liquify, which should take about 20 minutes.How long should I boil my peaches for? It depends on your preference! If you want your jam to have a few chunks of peaches, boil it for about 20 minutes. If you like it smoother, keep boiling until it reaches your desired texture."
                },
                {
                    "headline": "Sterilize your canning jars and lids in a hot water bath.",
                    "description": "Uncap your glass canning jars and set them and the lids into a large pot of water, deep enough so that the jars are covered by 1 inch (2.5 cm) of water. Bring the water to a rolling boil for 10 minutes, then remove the jars and lids with tongs. Place them on a paper towel to dry and cool. Most people choose to store some of their peach jam, especially because most recipes make a large amount. If you plan to eat yours all at once, though, you can skip the canning steps and serve it out of a regular bowl. To save time, you can sterilize your jars and lids while your peaches are boiling."
                },
                {
                    "headline": "Remove the peaches from the heat, then transfer 6 cups back into the pan.",
                    "description": "Once the peaches have reached the right texture, move them into a bowl. Then, measure out 6 cups (1350 g) of peaches and pour them back into the pan. These 6 cups will be your first batch of jam."
                },
                {
                    "headline": "Add sugar to the mixture, then bring it to a boil.",
                    "description": "Pour in about 2 cups (400 g) of sugar, stir it well, then taste. Add more sugar in ½ cup (100 g) portions to taste, if needed. Once it reaches the right sweetness, turn the heat to medium and bring the mixture to a boil."
                },
                {
                    "headline": "Stir in your dry pectin and let it boil for 1 minute.",
                    "description": "Keeping your mixture at a boil, gradually add in your 2 oz packet pectin while whisking with a fork or whisk. Boil the mixture for 1 minute, continuing to whisk constantly, then remove the pan from heat. You can find pectin online or at most grocery stores, near the Jell-O."
                },
                {
                    "headline": "Remove the jam from the stove and pour it into your sterilized jars.",
                    "description": "Carefully remove the pan from the heat, using oven mitts to protect your hands. Spoon the jam into your jars, leaving about ⁄2 inch (1.3 cm) of space at the top of each jar, and screw on the lids. You can set a funnel in the top of each jar and ladle your jam into it to make sure you don't spill any over the sides."
                },
                {
                    "headline": "Set the jars in a boiling water bath for 10 minutes.",
                    "description": "Use tongs to place your jars into a pot of water, deep enough so each jar is covered by 2 inches (5.1 cm) of water. Bring it to a boil and let the jars sit for 10 minutes, then carefully remove them with tongs. This is called “processing” the jars, and it helps to seal the jars completely. Repeat the process of mixing and boiling the peaches, sugar, and pectin, then canning the jam, for your remaining peaches."
                },
                {
                    "headline": "Let the jars cool, then store them for up to a year.",
                    "description": "Place the jars on a few paper towels to dry. Let them cool fully, which might take a couple of hours. Then, place the jars on a shelf in a cool, dark place, like a pantry, to store. Your peach jam should stay fresh for up to a year. Pop open a jar when you're ready to eat your peach jam. You can store open jars in your refrigerator for up to a week."
                }
            ]
        },
        {
            "name": "Peach Jam Without Pectin",
            "steps": [
                {
                    "headline": "Add your chopped peaches and lemon juice into a medium saucepan.",
                    "description": "Wash 12-14 peaches under running water, then chop them into small, bite-sized pieces. Pour them into a medium saucepan, then add fresh-squeezed juice from 1 lemon.Tip: Choose peaches that are firm and slightly under-ripe. They have more pectin than riper peaches, which will help your jam stay firm. Lemon juice is naturally high in pectin as well."
                },
                {
                    "headline": "Bring the pan to a boil while crushing the peaches.",
                    "description": "Place your saucepan over medium-high heat and bring it to a boil. At the same time, use a spatula or a potato masher to crush the peaches to your desired consistency."
                },
                {
                    "headline": "Reduce the heat to medium and add your sugar.",
                    "description": "Once your peaches are at the right consistency and have reached a boil, pour in 2 ½ cups (300 g) of sugar. Stir the mixture well to combine, then taste to make sure it's sweet enough. Add more sugar if necessary. Add more sugar in ½ cup (100 g) increments, tasting after each one. It's important to add enough sugar, otherwise your jam won't turn gelly enough."
                },
                {
                    "headline": "Bring the mixture back to a boil and stir frequently for 15-25 minutes.",
                    "description": "Now it's time to let your jam cook! Get it back up to a boil and stir frequently until it gets to the consistency you want, which could be anywhere from 15-25 minutes.Tip: To tell when your jam is done, dip a spoon in and lift it, then turn it sideways. The jam should stick to the spoon when it's ready."
                },
                {
                    "headline": "Can the jam to preserve it.",
                    "description": "If you want to make your jam last, sterilize several glass jars and lids by boiling them in water for 10 minutes. Pour in your jam, screw on the lids, then boil the sealed jars for another 10 minutes to seal them securely. Once they've dried and cooled, set them in your pantry to keep for up to 1 year. Use tongs to place your jars in the water and remove them afterwards. Most jam recipes make big batches, so many people choose to preserve at least a few of their jars."
                },
                {
                    "headline": "Eat the jam fresh for the best flavor.",
                    "description": "Canning peach jam is popular, but enjoying it fresh can be even more satisfying! You'll get the best, sweetest flavor and can even have it while it's still warm from cooking. Enjoy your jam on toast or as a sweet topping on savory meat dishes. You can also store open jam containers in the refrigerator for up to a week."
                }
            ]
        }
    ],
    "tyn": [
        "Chef's knife",
        "Fork or handheld potato masher",
        "Large saucepan",
        "Wooden spoon, to stir",
        "Whisk",
        "7-10 8-oz canning jars and lids (if canning)",
        "Tongs",
        "Paper towels"
    ],
    "text": " Traditional Peach Jam Chop up 12 fresh peaches. Rinse 12 peaches under running water and chop them into eighths. Then, cut them width-wise into smaller, bite-sized pieces. Remove the pit and throw it away as you chop. Choose peaches that are firm and slightly under-ripe. They have more pectin than riper peaches, which will help your jam stay firm. Crush up 1 cup of peaches in a large saucepan. Measure out 1 cup (225 g) of your chopped peaches and pour them into a large saucepan. Use a fork or handheld potato masher to crush the peaches into even smaller pieces, until they're juicy and almost falling apart. Crushing in the saucepan ensures that all the juices get cooked with the peaches. Don't place the pan on the stove just yet! You won't start cooking until you add the remaining peaches. Add the rest of the peaches and boil them until they're liquid. Pour your remaining chopped peaches into the same saucepan. Place the pan on the stove over medium-low heat and bring it to a low boil until the peaches start to liquify, which should take about 20 minutes.How long should I boil my peaches for? It depends on your preference! If you want your jam to have a few chunks of peaches, boil it for about 20 minutes. If you like it smoother, keep boiling until it reaches your desired texture. Sterilize your canning jars and lids in a hot water bath. Uncap your glass canning jars and set them and the lids into a large pot of water, deep enough so that the jars are covered by 1 inch (2.5 cm) of water. Bring the water to a rolling boil for 10 minutes, then remove the jars and lids with tongs. Place them on a paper towel to dry and cool. Most people choose to store some of their peach jam, especially because most recipes make a large amount. If you plan to eat yours all at once, though, you can skip the canning steps and serve it out of a regular bowl. To save time, you can sterilize your jars and lids while your peaches are boiling. Remove the peaches from the heat, then transfer 6 cups back into the pan. Once the peaches have reached the right texture, move them into a bowl. Then, measure out 6 cups (1350 g) of peaches and pour them back into the pan. These 6 cups will be your first batch of jam. Add sugar to the mixture, then bring it to a boil. Pour in about 2 cups (400 g) of sugar, stir it well, then taste. Add more sugar in ½ cup (100 g) portions to taste, if needed. Once it reaches the right sweetness, turn the heat to medium and bring the mixture to a boil. Stir in your dry pectin and let it boil for 1 minute. Keeping your mixture at a boil, gradually add in your 2 oz packet pectin while whisking with a fork or whisk. Boil the mixture for 1 minute, continuing to whisk constantly, then remove the pan from heat. You can find pectin online or at most grocery stores, near the Jell-O. Remove the jam from the stove and pour it into your sterilized jars. Carefully remove the pan from the heat, using oven mitts to protect your hands. Spoon the jam into your jars, leaving about ⁄2 inch (1.3 cm) of space at the top of each jar, and screw on the lids. You can set a funnel in the top of each jar and ladle your jam into it to make sure you don't spill any over the sides. Set the jars in a boiling water bath for 10 minutes. Use tongs to place your jars into a pot of water, deep enough so each jar is covered by 2 inches (5.1 cm) of water. Bring it to a boil and let the jars sit for 10 minutes, then carefully remove them with tongs. This is called “processing” the jars, and it helps to seal the jars completely. Repeat the process of mixing and boiling the peaches, sugar, and pectin, then canning the jam, for your remaining peaches. Let the jars cool, then store them for up to a year. Place the jars on a few paper towels to dry. Let them cool fully, which might take a couple of hours. Then, place the jars on a shelf in a cool, dark place, like a pantry, to store. Your peach jam should stay fresh for up to a year. Pop open a jar when you're ready to eat your peach jam. You can store open jars in your refrigerator for up to a week. Peach Jam Without Pectin Add your chopped peaches and lemon juice into a medium saucepan. Wash 12-14 peaches under running water, then chop them into small, bite-sized pieces. Pour them into a medium saucepan, then add fresh-squeezed juice from 1 lemon.Tip: Choose peaches that are firm and slightly under-ripe. They have more pectin than riper peaches, which will help your jam stay firm. Lemon juice is naturally high in pectin as well. Bring the pan to a boil while crushing the peaches. Place your saucepan over medium-high heat and bring it to a boil. At the same time, use a spatula or a potato masher to crush the peaches to your desired consistency. Reduce the heat to medium and add your sugar. Once your peaches are at the right consistency and have reached a boil, pour in 2 ½ cups (300 g) of sugar. Stir the mixture well to combine, then taste to make sure it's sweet enough. Add more sugar if necessary. Add more sugar in ½ cup (100 g) increments, tasting after each one. It's important to add enough sugar, otherwise your jam won't turn gelly enough. Bring the mixture back to a boil and stir frequently for 15-25 minutes. Now it's time to let your jam cook! Get it back up to a boil and stir frequently until it gets to the consistency you want, which could be anywhere from 15-25 minutes.Tip: To tell when your jam is done, dip a spoon in and lift it, then turn it sideways. The jam should stick to the spoon when it's ready. Can the jam to preserve it. If you want to make your jam last, sterilize several glass jars and lids by boiling them in water for 10 minutes. Pour in your jam, screw on the lids, then boil the sealed jars for another 10 minutes to seal them securely. Once they've dried and cooled, set them in your pantry to keep for up to 1 year. Use tongs to place your jars in the water and remove them afterwards. Most jam recipes make big batches, so many people choose to preserve at least a few of their jars. Eat the jam fresh for the best flavor. Canning peach jam is popular, but enjoying it fresh can be even more satisfying! You'll get the best, sweetest flavor and can even have it while it's still warm from cooking. Enjoy your jam on toast or as a sweet topping on savory meat dishes. You can also store open jam containers in the refrigerator for up to a week.",
    "sentences": [
        " Traditional Peach Jam Chop up 12 fresh peaches.",
        "Rinse 12 peaches under running water and chop them into eighths.",
        "Then, cut them width-wise into smaller, bite-sized pieces.",
        "Remove the pit and throw it away as you chop.",
        "Choose peaches that are firm and slightly under-ripe.",
        "They have more pectin than riper peaches, which will help your jam stay firm.",
        "Crush up 1 cup of peaches in a large saucepan.",
        "Measure out 1 cup (225 g) of your chopped peaches and pour them into a large saucepan.",
        "Use a fork or handheld potato masher to crush the peaches into even smaller pieces, until they're juicy and almost falling apart.",
        "Crushing in the saucepan ensures that all the juices get cooked with the peaches.",
        "Don't place the pan on the stove just yet!",
        "You won't start cooking until you add the remaining peaches.",
        "Add the rest of the peaches and boil them until they're liquid.",
        "Pour your remaining chopped peaches into the same saucepan.",
        "Place the pan on the stove over medium-low heat and bring it to a low boil until the peaches start to liquify, which should take about 20 minutes.How long should I boil my peaches for?",
        "It depends on your preference!",
        "If you want your jam to have a few chunks of peaches, boil it for about 20 minutes.",
        "If you like it smoother, keep boiling until it reaches your desired texture.",
        "Sterilize your canning jars and lids in a hot water bath.",
        "Uncap your glass canning jars and set them and the lids into a large pot of water, deep enough so that the jars are covered by 1 inch (2.5 cm) of water.",
        "Bring the water to a rolling boil for 10 minutes, then remove the jars and lids with tongs.",
        "Place them on a paper towel to dry and cool.",
        "Most people choose to store some of their peach jam, especially because most recipes make a large amount.",
        "If you plan to eat yours all at once, though, you can skip the canning steps and serve it out of a regular bowl.",
        "To save time, you can sterilize your jars and lids while your peaches are boiling.",
        "Remove the peaches from the heat, then transfer 6 cups back into the pan.",
        "Once the peaches have reached the right texture, move them into a bowl.",
        "Then, measure out 6 cups (1350 g) of peaches and pour them back into the pan.",
        "These 6 cups will be your first batch of jam.",
        "Add sugar to the mixture, then bring it to a boil.",
        "Pour in about 2 cups (400 g) of sugar, stir it well, then taste.",
        "Add more sugar in ½ cup (100 g) portions to taste, if needed.",
        "Once it reaches the right sweetness, turn the heat to medium and bring the mixture to a boil.",
        "Stir in your dry pectin and let it boil for 1 minute.",
        "Keeping your mixture at a boil, gradually add in your 2 oz packet pectin while whisking with a fork or whisk.",
        "Boil the mixture for 1 minute, continuing to whisk constantly, then remove the pan from heat.",
        "You can find pectin online or at most grocery stores, near the Jell-O.",
        "Remove the jam from the stove and pour it into your sterilized jars.",
        "Carefully remove the pan from the heat, using oven mitts to protect your hands.",
        "Spoon the jam into your jars, leaving about ⁄2 inch (1.3 cm) of space at the top of each jar, and screw on the lids.",
        "You can set a funnel in the top of each jar and ladle your jam into it to make sure you don't spill any over the sides.",
        "Set the jars in a boiling water bath for 10 minutes.",
        "Use tongs to place your jars into a pot of water, deep enough so each jar is covered by 2 inches (5.1 cm) of water.",
        "Bring it to a boil and let the jars sit for 10 minutes, then carefully remove them with tongs.",
        "This is called “processing” the jars, and it helps to seal the jars completely.",
        "Repeat the process of mixing and boiling the peaches, sugar, and pectin, then canning the jam, for your remaining peaches.",
        "Let the jars cool, then store them for up to a year.",
        "Place the jars on a few paper towels to dry.",
        "Let them cool fully, which might take a couple of hours.",
        "Then, place the jars on a shelf in a cool, dark place, like a pantry, to store.",
        "Your peach jam should stay fresh for up to a year.",
        "Pop open a jar when you're ready to eat your peach jam.",
        "You can store open jars in your refrigerator for up to a week.",
        "Peach Jam Without Pectin Add your chopped peaches and lemon juice into a medium saucepan.",
        "Wash 12-14 peaches under running water, then chop them into small, bite-sized pieces.",
        "Pour them into a medium saucepan, then add fresh-squeezed juice from 1 lemon.Tip: Choose peaches that are firm and slightly under-ripe.",
        "They have more pectin than riper peaches, which will help your jam stay firm.",
        "Lemon juice is naturally high in pectin as well.",
        "Bring the pan to a boil while crushing the peaches.",
        "Place your saucepan over medium-high heat and bring it to a boil.",
        "At the same time, use a spatula or a potato masher to crush the peaches to your desired consistency.",
        "Reduce the heat to medium and add your sugar.",
        "Once your peaches are at the right consistency and have reached a boil, pour in 2 ½ cups (300 g) of sugar.",
        "Stir the mixture well to combine, then taste to make sure it's sweet enough.",
        "Add more sugar if necessary.",
        "Add more sugar in ½ cup (100 g) increments, tasting after each one.",
        "It's important to add enough sugar, otherwise your jam won't turn gelly enough.",
        "Bring the mixture back to a boil and stir frequently for 15-25 minutes.",
        "Now it's time to let your jam cook!",
        "Get it back up to a boil and stir frequently until it gets to the consistency you want, which could be anywhere from 15-25 minutes.Tip: To tell when your jam is done, dip a spoon in and lift it, then turn it sideways.",
        "The jam should stick to the spoon when it's ready.",
        "Can the jam to preserve it.",
        "If you want to make your jam last, sterilize several glass jars and lids by boiling them in water for 10 minutes.",
        "Pour in your jam, screw on the lids, then boil the sealed jars for another 10 minutes to seal them securely.",
        "Once they've dried and cooled, set them in your pantry to keep for up to 1 year.",
        "Use tongs to place your jars in the water and remove them afterwards.",
        "Most jam recipes make big batches, so many people choose to preserve at least a few of their jars.",
        "Eat the jam fresh for the best flavor.",
        "Canning peach jam is popular, but enjoying it fresh can be even more satisfying!",
        "You'll get the best, sweetest flavor and can even have it while it's still warm from cooking.",
        "Enjoy your jam on toast or as a sweet topping on savory meat dishes.",
        "You can also store open jam containers in the refrigerator for up to a week."
    ]
}