{
    "title": "How to Measure a Microwave",
    "url": "https://www.wikihow.com/Measure-a-Microwave",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Mathematics"
    ],
    "methods": [
        {
            "name": "Finding the Dimensions of a Standalone Microwave",
            "steps": [
                {
                    "headline": "Stretch a tape measure along one of the appliance's vertical walls to find its height.",
                    "description": "Measure straight up and down from top to bottom, including the feet or support base, if your appliance has them. The number you get will tell you how much vertical space the microwave will take up. You can also use a yard stick or meter stick or a standard ruler if you don’t have a tape measure on hand. When using a ruler, it may be necessary to mark the point where the tool ends and reset it in order to measure the appliance’s full height. Grab a scrap piece of paper and a pen or pencil to record your measurements. You'll be referencing these numbers once you begin shopping around for a new appliance.Tip: Round each of your measurements to the nearest fraction of an inch. That way, you can be sure that they reflect the appliance’s actual dimensions rather than its listed dimensions, which may not be an exact match."
                },
                {
                    "headline": "Extend your tape measure from one side to the other to determine the width.",
                    "description": "Turn your tape measure 90 degrees and measure across the face of the appliance from edge to edge. This is one of the most important measurements you’ll be taking in terms of ensuring adequate counter space. Smaller microwaves are rarely wider than about 30 inches (76 cm). Larger appliances, however, can reach sizes of up to 37 inches (94 cm) wide. Make sure your width measurement is as precise as possible. You won’t typically have as much wiggle room with the width as you will with the height."
                },
                {
                    "headline": "Measure from front to back to check the depth of the appliance.",
                    "description": "Lastly, run your tape measure from the flat part of the microwave’s face to its rear edge. Don’t include the handle, knob, or any other protruding features in your measurement, as these won't be factored into the appliance's official dimensions. The depth of your microwave will be a major determining factor for the kinds of items you can fit inside."
                },
                {
                    "headline": "Compare your measurements to your available kitchen space.",
                    "description": "Now, measure the height, width, and depth of the area where you plan on putting your new microwave. If any of the appliance’s individual dimensions exceed those of your space, you’ll have no choice but to find another place to put it. Ideally, your microwave should go somewhere that offers at least 1–2 inches (2.5–5.1 cm) of extra space on all sides. While you’re measuring your countertop, double check that there’s a power outlet nearby where you’ll be able to plug the appliance in."
                }
            ]
        },
        {
            "name": "Measuring for an Over-the-Range Microwave",
            "steps": [
                {
                    "headline": "Check the dimensions of the space where you want your microwave to go.",
                    "description": "It’s a common practice in many newer kitchens to mount the microwave over the range as a space-saving measure. If you intend to put in an over-the-range microwave, first measure the length, depth, and height of the gap between the cabinets above your cooktop. A range is a combination appliance that consists of an oven with a built-in cooktop.Tip: Over-the-range microwaves are typically sized in proportion to the dimensions of standard mounted cabinets. Even so, it’s a good idea to figure out for yourself exactly how much room you have to work with."
                },
                {
                    "headline": "Make sure there’s at least 30 in (76 cm) between your cabinets and cooktop.",
                    "description": "Hold your tape measure vertically and run it from the bottom edge of the cabinet directly above the range to the cooking surface below. You’ll need a minimum of 30 inches (76 cm) in order to guarantee adequate clearance and enable the ventilation hoods to work properly. If you get a measurement of less than 30 inches (76 cm), your only options will be to either situate the microwave on your countertop or have your cabinets modified to accommodate the appliance overhead. Fortunately, the cabinets in most newer homes come in standardized sizes that take into account the average dimensions of over-the-range microwaves and other appliances."
                },
                {
                    "headline": "Subtract the height of the microwave from your total range clearance.",
                    "description": "After making your calculations, consider whether the remaining space will be enough to allow you to use the burners on your stove comfortably. For instance, if there’s 30 inches (76 cm) between the bottom of your highest cabinet and your cooking surface and your microwave is 17 inches (43 cm) tall (average height for an above-the-range microwave), that only leaves you with 13 inches (33 cm) of usable space. A microwave that restricts the space on your cooktop not be a good choice for you if you tend to do a lot of cooking with stockpots and other large pieces of cookware. In this case, you'll want to scale down to a slightly smaller model. Many manufacturers offer compact over-the-range microwave models with heights as low as 10 inches (25 cm). These are designed specifically to suit irregular cabinet setups and other hard-to-fit places."
                },
                {
                    "headline": "Measure the microwave you're looking at to determine whether it's a good fit.",
                    "description": "After getting an accurate sense of how much room you have over your range, use your tape measure to size up the model you have your eye on. Find the unit's length, width, and height, then compare the two sets of dimensions. Doing so will help you find an appliance that's right for your space. Bring your tape measure with you when you go shopping. It's better to find out right away whether a certain model will work than to wait until after you've brought it home."
                },
                {
                    "headline": "Opt for a model with a zero-clearance door if space is tight.",
                    "description": "These types of microwaves are most often installed in the area of a kitchen where the end of a row of cabinets meets the far wall. Appliances with zero-clearance doors have special hinges that don’t stick out further than the unit’s side wall, so you won’t have to worry about the door jamming when you try to swing it open. Make sure that there’s enough room in front of the microwave to provide the full frontal door clearance listed on the product packaging, as well. Most doors need somewhere between 24 inches (61 cm) and 26 inches (66 cm) to open to 90 degrees. You might also go with a zero-clearance model if your microwave only just fits between your over-the-range cabinets and you’re worried that you might not be able to open the door."
                }
            ]
        }
    ],
    "tyn": [
        "Measuring tape",
        "Paper and pen or pencil"
    ],
    "text": " Finding the Dimensions of a Standalone Microwave Stretch a tape measure along one of the appliance's vertical walls to find its height. Measure straight up and down from top to bottom, including the feet or support base, if your appliance has them. The number you get will tell you how much vertical space the microwave will take up. You can also use a yard stick or meter stick or a standard ruler if you don’t have a tape measure on hand. When using a ruler, it may be necessary to mark the point where the tool ends and reset it in order to measure the appliance’s full height. Grab a scrap piece of paper and a pen or pencil to record your measurements. You'll be referencing these numbers once you begin shopping around for a new appliance.Tip: Round each of your measurements to the nearest fraction of an inch. That way, you can be sure that they reflect the appliance’s actual dimensions rather than its listed dimensions, which may not be an exact match. Extend your tape measure from one side to the other to determine the width. Turn your tape measure 90 degrees and measure across the face of the appliance from edge to edge. This is one of the most important measurements you’ll be taking in terms of ensuring adequate counter space. Smaller microwaves are rarely wider than about 30 inches (76 cm). Larger appliances, however, can reach sizes of up to 37 inches (94 cm) wide. Make sure your width measurement is as precise as possible. You won’t typically have as much wiggle room with the width as you will with the height. Measure from front to back to check the depth of the appliance. Lastly, run your tape measure from the flat part of the microwave’s face to its rear edge. Don’t include the handle, knob, or any other protruding features in your measurement, as these won't be factored into the appliance's official dimensions. The depth of your microwave will be a major determining factor for the kinds of items you can fit inside. Compare your measurements to your available kitchen space. Now, measure the height, width, and depth of the area where you plan on putting your new microwave. If any of the appliance’s individual dimensions exceed those of your space, you’ll have no choice but to find another place to put it. Ideally, your microwave should go somewhere that offers at least 1–2 inches (2.5–5.1 cm) of extra space on all sides. While you’re measuring your countertop, double check that there’s a power outlet nearby where you’ll be able to plug the appliance in. Measuring for an Over-the-Range Microwave Check the dimensions of the space where you want your microwave to go. It’s a common practice in many newer kitchens to mount the microwave over the range as a space-saving measure. If you intend to put in an over-the-range microwave, first measure the length, depth, and height of the gap between the cabinets above your cooktop. A range is a combination appliance that consists of an oven with a built-in cooktop.Tip: Over-the-range microwaves are typically sized in proportion to the dimensions of standard mounted cabinets. Even so, it’s a good idea to figure out for yourself exactly how much room you have to work with. Make sure there’s at least 30 in (76 cm) between your cabinets and cooktop. Hold your tape measure vertically and run it from the bottom edge of the cabinet directly above the range to the cooking surface below. You’ll need a minimum of 30 inches (76 cm) in order to guarantee adequate clearance and enable the ventilation hoods to work properly. If you get a measurement of less than 30 inches (76 cm), your only options will be to either situate the microwave on your countertop or have your cabinets modified to accommodate the appliance overhead. Fortunately, the cabinets in most newer homes come in standardized sizes that take into account the average dimensions of over-the-range microwaves and other appliances. Subtract the height of the microwave from your total range clearance. After making your calculations, consider whether the remaining space will be enough to allow you to use the burners on your stove comfortably. For instance, if there’s 30 inches (76 cm) between the bottom of your highest cabinet and your cooking surface and your microwave is 17 inches (43 cm) tall (average height for an above-the-range microwave), that only leaves you with 13 inches (33 cm) of usable space. A microwave that restricts the space on your cooktop not be a good choice for you if you tend to do a lot of cooking with stockpots and other large pieces of cookware. In this case, you'll want to scale down to a slightly smaller model. Many manufacturers offer compact over-the-range microwave models with heights as low as 10 inches (25 cm). These are designed specifically to suit irregular cabinet setups and other hard-to-fit places. Measure the microwave you're looking at to determine whether it's a good fit. After getting an accurate sense of how much room you have over your range, use your tape measure to size up the model you have your eye on. Find the unit's length, width, and height, then compare the two sets of dimensions. Doing so will help you find an appliance that's right for your space. Bring your tape measure with you when you go shopping. It's better to find out right away whether a certain model will work than to wait until after you've brought it home. Opt for a model with a zero-clearance door if space is tight. These types of microwaves are most often installed in the area of a kitchen where the end of a row of cabinets meets the far wall. Appliances with zero-clearance doors have special hinges that don’t stick out further than the unit’s side wall, so you won’t have to worry about the door jamming when you try to swing it open. Make sure that there’s enough room in front of the microwave to provide the full frontal door clearance listed on the product packaging, as well. Most doors need somewhere between 24 inches (61 cm) and 26 inches (66 cm) to open to 90 degrees. You might also go with a zero-clearance model if your microwave only just fits between your over-the-range cabinets and you’re worried that you might not be able to open the door.",
    "sentences": [
        " Finding the Dimensions of a Standalone Microwave Stretch a tape measure along one of the appliance's vertical walls to find its height.",
        "Measure straight up and down from top to bottom, including the feet or support base, if your appliance has them.",
        "The number you get will tell you how much vertical space the microwave will take up.",
        "You can also use a yard stick or meter stick or a standard ruler if you don’t have a tape measure on hand.",
        "When using a ruler, it may be necessary to mark the point where the tool ends and reset it in order to measure the appliance’s full height.",
        "Grab a scrap piece of paper and a pen or pencil to record your measurements.",
        "You'll be referencing these numbers once you begin shopping around for a new appliance.Tip: Round each of your measurements to the nearest fraction of an inch.",
        "That way, you can be sure that they reflect the appliance’s actual dimensions rather than its listed dimensions, which may not be an exact match.",
        "Extend your tape measure from one side to the other to determine the width.",
        "Turn your tape measure 90 degrees and measure across the face of the appliance from edge to edge.",
        "This is one of the most important measurements you’ll be taking in terms of ensuring adequate counter space.",
        "Smaller microwaves are rarely wider than about 30 inches (76 cm).",
        "Larger appliances, however, can reach sizes of up to 37 inches (94 cm) wide.",
        "Make sure your width measurement is as precise as possible.",
        "You won’t typically have as much wiggle room with the width as you will with the height.",
        "Measure from front to back to check the depth of the appliance.",
        "Lastly, run your tape measure from the flat part of the microwave’s face to its rear edge.",
        "Don’t include the handle, knob, or any other protruding features in your measurement, as these won't be factored into the appliance's official dimensions.",
        "The depth of your microwave will be a major determining factor for the kinds of items you can fit inside.",
        "Compare your measurements to your available kitchen space.",
        "Now, measure the height, width, and depth of the area where you plan on putting your new microwave.",
        "If any of the appliance’s individual dimensions exceed those of your space, you’ll have no choice but to find another place to put it.",
        "Ideally, your microwave should go somewhere that offers at least 1–2 inches (2.5–5.1 cm) of extra space on all sides.",
        "While you’re measuring your countertop, double check that there’s a power outlet nearby where you’ll be able to plug the appliance in.",
        "Measuring for an Over-the-Range Microwave Check the dimensions of the space where you want your microwave to go.",
        "It’s a common practice in many newer kitchens to mount the microwave over the range as a space-saving measure.",
        "If you intend to put in an over-the-range microwave, first measure the length, depth, and height of the gap between the cabinets above your cooktop.",
        "A range is a combination appliance that consists of an oven with a built-in cooktop.Tip: Over-the-range microwaves are typically sized in proportion to the dimensions of standard mounted cabinets.",
        "Even so, it’s a good idea to figure out for yourself exactly how much room you have to work with.",
        "Make sure there’s at least 30 in (76 cm) between your cabinets and cooktop.",
        "Hold your tape measure vertically and run it from the bottom edge of the cabinet directly above the range to the cooking surface below.",
        "You’ll need a minimum of 30 inches (76 cm) in order to guarantee adequate clearance and enable the ventilation hoods to work properly.",
        "If you get a measurement of less than 30 inches (76 cm), your only options will be to either situate the microwave on your countertop or have your cabinets modified to accommodate the appliance overhead.",
        "Fortunately, the cabinets in most newer homes come in standardized sizes that take into account the average dimensions of over-the-range microwaves and other appliances.",
        "Subtract the height of the microwave from your total range clearance.",
        "After making your calculations, consider whether the remaining space will be enough to allow you to use the burners on your stove comfortably.",
        "For instance, if there’s 30 inches (76 cm) between the bottom of your highest cabinet and your cooking surface and your microwave is 17 inches (43 cm) tall (average height for an above-the-range microwave), that only leaves you with 13 inches (33 cm) of usable space.",
        "A microwave that restricts the space on your cooktop not be a good choice for you if you tend to do a lot of cooking with stockpots and other large pieces of cookware.",
        "In this case, you'll want to scale down to a slightly smaller model.",
        "Many manufacturers offer compact over-the-range microwave models with heights as low as 10 inches (25 cm).",
        "These are designed specifically to suit irregular cabinet setups and other hard-to-fit places.",
        "Measure the microwave you're looking at to determine whether it's a good fit.",
        "After getting an accurate sense of how much room you have over your range, use your tape measure to size up the model you have your eye on.",
        "Find the unit's length, width, and height, then compare the two sets of dimensions.",
        "Doing so will help you find an appliance that's right for your space.",
        "Bring your tape measure with you when you go shopping.",
        "It's better to find out right away whether a certain model will work than to wait until after you've brought it home.",
        "Opt for a model with a zero-clearance door if space is tight.",
        "These types of microwaves are most often installed in the area of a kitchen where the end of a row of cabinets meets the far wall.",
        "Appliances with zero-clearance doors have special hinges that don’t stick out further than the unit’s side wall, so you won’t have to worry about the door jamming when you try to swing it open.",
        "Make sure that there’s enough room in front of the microwave to provide the full frontal door clearance listed on the product packaging, as well.",
        "Most doors need somewhere between 24 inches (61 cm) and 26 inches (66 cm) to open to 90 degrees.",
        "You might also go with a zero-clearance model if your microwave only just fits between your over-the-range cabinets and you’re worried that you might not be able to open the door."
    ]
}