{
    "title": "How to Clean Binocular Lenses",
    "url": "https://www.wikihow.com/Clean-Binocular-Lenses",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Optical Devices",
        "Binoculars"
    ],
    "methods": [
        {
            "name": "Removing Dirt and Dust from the Lenses",
            "steps": [
                {
                    "headline": "Remove the lens caps and tilt the binoculars at an angle.",
                    "description": "Pop the protective lens caps off of the ocular lenses, which are the lenses closest to your eyes. You'll also need to take the caps off of the objective lenses, which are the larger lenses. Then, pick up the binoculars and tilt the eyepiece end to a 130-degree angle. Although you might be tempted to blow on the lenses to remove dust, the moisture from your breath will actually cause the dirt particles to stick to the lenses. Tilting the binoculars as you work prevents the dust and dirt from falling back onto the lenses."
                },
                {
                    "headline": "Use an air blower pump to blow dust from the lenses.",
                    "description": "With the binoculars tilted in 1 hand, squeeze a rubber air blower pump on the larger objective lenses. Keep squeezing and blowing on both of these lenses so any dust or dirt particles fall onto your work surface. Then, turn the binoculars so the small ocular lenses are tilting down and use the pump on them. You can buy an air blower pump and other binocular cleaning supplies from photography supply stores, some outdoor supply stores, or online."
                },
                {
                    "headline": "Wipe the bristles of a lens cleaning pen over the surface of each lens.",
                    "description": "Your lenses may still have stubborn dirt or debris stuck on the surface even after you used the air blower pump. Since you need to remove this surface grime before wiping the lenses, take out a lens cleaning pen and wipe the soft bristle brush end over the entire surface of the lenses. The bristles of the lens cleaning pen are designed to be gentle on the most delicate lenses so they won't scratch your binoculars."
                },
                {
                    "headline": "Spray a microfiber cloth with lens cleaning solution.",
                    "description": "Get out a clean microfiber cloth and remove the cap from your lens cleaning solution. Spritz the middle of the microfiber cloth just once or twice so it's barely moist. It's important to use designated lens cleaning solution instead of window cleaners. Household cleaning products can strip the protective coatings from your binocular lenses."
                },
                {
                    "headline": "Wipe the cloth over the surface of each lens to remove smudges or water spots.",
                    "description": "Since there shouldn't be any dirt particles on the lenses, you won't scratch the lenses when you rub them now. Take the moistened center of your microfiber cloth and gently rub it over each lens in a circular motion. Rub just until you no longer see smudges or spots.Tip: Never wipe your binocular lenses with your shirt, tissues, or a paper towel. These are too abrasive and they might have dirt particles which will scratch the lenses. Your binocular lenses are now clean and ready to use! If you don't plan on using them right away, remember to put the protective caps back on the lenses."
                }
            ]
        },
        {
            "name": "Maintaining the Lenses",
            "steps": [
                {
                    "headline": "Clean the lenses only when you see dirt, dust, or smudges.",
                    "description": "You can clean the lenses too much which can damage their special coatings. You're also more likely to scratch the lenses the more often you clean them. Wait to clean the lenses until you see dust, pollen, smudges, or sand, for instance. Your lenses will last longer with proper cleaning especially if you're not cleaning them several times a week."
                },
                {
                    "headline": "Keep the lenses completely dry to prevent moisture buildup inside the binoculars.",
                    "description": "You might have seen people hold their lenses under running water to clean them. Unfortunately, water can become trapped inside the binoculars where it could grow mold. Always keep your binoculars dry, even if they say they're waterproof. If your binoculars do get exposed to moisture, leave the caps off of the lenses and let them dry out completely before storing them."
                },
                {
                    "headline": "Take the binoculars for professional cleaning if you see fungus growing on the lenses.",
                    "description": "If your binoculars don't have good seals, moisture can become trapped inside them and with the right conditions, mold can grow. Instead of trying to take apart your binoculars, take them to a professional that cleans binoculars.Tip: If you own expensive binoculars that you want to last for years, send them back to the manufacturer's service center once a year for maintenance and cleaning. The center can check the seals, clean the interior, and repair any damage. You could also ask photography supply stores if they clean binoculars."
                },
                {
                    "headline": "Store your binoculars in their case when you're not using them.",
                    "description": "The case is designed exactly for your binoculars and it protects the lenses from dust and dirt. If you don't have a case, place the binoculars flat on a clean surface. Don't stand them up on the larger lenses because dirt and debris will fall directly onto the small ocular lenses. For short term storage, you could lay the binoculars flat and place a clean cloth over them to protect the lenses from dust."
                }
            ]
        }
    ],
    "tyn": [
        "Removing Dirt and Dust from the Lenses",
        "Air blower pump",
        "Lens cleaning pen",
        "Microfiber lens cloth",
        "Lens cleaning solution",
        "Maintaining the Lenses",
        "Binocular case",
        "Protective lens caps"
    ],
    "text": " Removing Dirt and Dust from the Lenses Remove the lens caps and tilt the binoculars at an angle. Pop the protective lens caps off of the ocular lenses, which are the lenses closest to your eyes. You'll also need to take the caps off of the objective lenses, which are the larger lenses. Then, pick up the binoculars and tilt the eyepiece end to a 130-degree angle. Although you might be tempted to blow on the lenses to remove dust, the moisture from your breath will actually cause the dirt particles to stick to the lenses. Tilting the binoculars as you work prevents the dust and dirt from falling back onto the lenses. Use an air blower pump to blow dust from the lenses. With the binoculars tilted in 1 hand, squeeze a rubber air blower pump on the larger objective lenses. Keep squeezing and blowing on both of these lenses so any dust or dirt particles fall onto your work surface. Then, turn the binoculars so the small ocular lenses are tilting down and use the pump on them. You can buy an air blower pump and other binocular cleaning supplies from photography supply stores, some outdoor supply stores, or online. Wipe the bristles of a lens cleaning pen over the surface of each lens. Your lenses may still have stubborn dirt or debris stuck on the surface even after you used the air blower pump. Since you need to remove this surface grime before wiping the lenses, take out a lens cleaning pen and wipe the soft bristle brush end over the entire surface of the lenses. The bristles of the lens cleaning pen are designed to be gentle on the most delicate lenses so they won't scratch your binoculars. Spray a microfiber cloth with lens cleaning solution. Get out a clean microfiber cloth and remove the cap from your lens cleaning solution. Spritz the middle of the microfiber cloth just once or twice so it's barely moist. It's important to use designated lens cleaning solution instead of window cleaners. Household cleaning products can strip the protective coatings from your binocular lenses. Wipe the cloth over the surface of each lens to remove smudges or water spots. Since there shouldn't be any dirt particles on the lenses, you won't scratch the lenses when you rub them now. Take the moistened center of your microfiber cloth and gently rub it over each lens in a circular motion. Rub just until you no longer see smudges or spots.Tip: Never wipe your binocular lenses with your shirt, tissues, or a paper towel. These are too abrasive and they might have dirt particles which will scratch the lenses. Your binocular lenses are now clean and ready to use! If you don't plan on using them right away, remember to put the protective caps back on the lenses. Maintaining the Lenses Clean the lenses only when you see dirt, dust, or smudges. You can clean the lenses too much which can damage their special coatings. You're also more likely to scratch the lenses the more often you clean them. Wait to clean the lenses until you see dust, pollen, smudges, or sand, for instance. Your lenses will last longer with proper cleaning especially if you're not cleaning them several times a week. Keep the lenses completely dry to prevent moisture buildup inside the binoculars. You might have seen people hold their lenses under running water to clean them. Unfortunately, water can become trapped inside the binoculars where it could grow mold. Always keep your binoculars dry, even if they say they're waterproof. If your binoculars do get exposed to moisture, leave the caps off of the lenses and let them dry out completely before storing them. Take the binoculars for professional cleaning if you see fungus growing on the lenses. If your binoculars don't have good seals, moisture can become trapped inside them and with the right conditions, mold can grow. Instead of trying to take apart your binoculars, take them to a professional that cleans binoculars.Tip: If you own expensive binoculars that you want to last for years, send them back to the manufacturer's service center once a year for maintenance and cleaning. The center can check the seals, clean the interior, and repair any damage. You could also ask photography supply stores if they clean binoculars. Store your binoculars in their case when you're not using them. The case is designed exactly for your binoculars and it protects the lenses from dust and dirt. If you don't have a case, place the binoculars flat on a clean surface. Don't stand them up on the larger lenses because dirt and debris will fall directly onto the small ocular lenses. For short term storage, you could lay the binoculars flat and place a clean cloth over them to protect the lenses from dust.",
    "sentences": [
        " Removing Dirt and Dust from the Lenses Remove the lens caps and tilt the binoculars at an angle.",
        "Pop the protective lens caps off of the ocular lenses, which are the lenses closest to your eyes.",
        "You'll also need to take the caps off of the objective lenses, which are the larger lenses.",
        "Then, pick up the binoculars and tilt the eyepiece end to a 130-degree angle.",
        "Although you might be tempted to blow on the lenses to remove dust, the moisture from your breath will actually cause the dirt particles to stick to the lenses.",
        "Tilting the binoculars as you work prevents the dust and dirt from falling back onto the lenses.",
        "Use an air blower pump to blow dust from the lenses.",
        "With the binoculars tilted in 1 hand, squeeze a rubber air blower pump on the larger objective lenses.",
        "Keep squeezing and blowing on both of these lenses so any dust or dirt particles fall onto your work surface.",
        "Then, turn the binoculars so the small ocular lenses are tilting down and use the pump on them.",
        "You can buy an air blower pump and other binocular cleaning supplies from photography supply stores, some outdoor supply stores, or online.",
        "Wipe the bristles of a lens cleaning pen over the surface of each lens.",
        "Your lenses may still have stubborn dirt or debris stuck on the surface even after you used the air blower pump.",
        "Since you need to remove this surface grime before wiping the lenses, take out a lens cleaning pen and wipe the soft bristle brush end over the entire surface of the lenses.",
        "The bristles of the lens cleaning pen are designed to be gentle on the most delicate lenses so they won't scratch your binoculars.",
        "Spray a microfiber cloth with lens cleaning solution.",
        "Get out a clean microfiber cloth and remove the cap from your lens cleaning solution.",
        "Spritz the middle of the microfiber cloth just once or twice so it's barely moist.",
        "It's important to use designated lens cleaning solution instead of window cleaners.",
        "Household cleaning products can strip the protective coatings from your binocular lenses.",
        "Wipe the cloth over the surface of each lens to remove smudges or water spots.",
        "Since there shouldn't be any dirt particles on the lenses, you won't scratch the lenses when you rub them now.",
        "Take the moistened center of your microfiber cloth and gently rub it over each lens in a circular motion.",
        "Rub just until you no longer see smudges or spots.Tip: Never wipe your binocular lenses with your shirt, tissues, or a paper towel.",
        "These are too abrasive and they might have dirt particles which will scratch the lenses.",
        "Your binocular lenses are now clean and ready to use!",
        "If you don't plan on using them right away, remember to put the protective caps back on the lenses.",
        "Maintaining the Lenses Clean the lenses only when you see dirt, dust, or smudges.",
        "You can clean the lenses too much which can damage their special coatings.",
        "You're also more likely to scratch the lenses the more often you clean them.",
        "Wait to clean the lenses until you see dust, pollen, smudges, or sand, for instance.",
        "Your lenses will last longer with proper cleaning especially if you're not cleaning them several times a week.",
        "Keep the lenses completely dry to prevent moisture buildup inside the binoculars.",
        "You might have seen people hold their lenses under running water to clean them.",
        "Unfortunately, water can become trapped inside the binoculars where it could grow mold.",
        "Always keep your binoculars dry, even if they say they're waterproof.",
        "If your binoculars do get exposed to moisture, leave the caps off of the lenses and let them dry out completely before storing them.",
        "Take the binoculars for professional cleaning if you see fungus growing on the lenses.",
        "If your binoculars don't have good seals, moisture can become trapped inside them and with the right conditions, mold can grow.",
        "Instead of trying to take apart your binoculars, take them to a professional that cleans binoculars.Tip: If you own expensive binoculars that you want to last for years, send them back to the manufacturer's service center once a year for maintenance and cleaning.",
        "The center can check the seals, clean the interior, and repair any damage.",
        "You could also ask photography supply stores if they clean binoculars.",
        "Store your binoculars in their case when you're not using them.",
        "The case is designed exactly for your binoculars and it protects the lenses from dust and dirt.",
        "If you don't have a case, place the binoculars flat on a clean surface.",
        "Don't stand them up on the larger lenses because dirt and debris will fall directly onto the small ocular lenses.",
        "For short term storage, you could lay the binoculars flat and place a clean cloth over them to protect the lenses from dust."
    ]
}