{
    "title": "How to Crochet a Hat for Beginners",
    "url": "https://www.wikihow.com/Crochet-a-Hat-for-Beginners",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Knitting and Crochet",
        "Crochet"
    ],
    "methods": [
        {
            "name": "Designing Your Hat",
            "steps": [
                {
                    "headline": "Determine the size of your hat.",
                    "description": "Before you can begin crocheting your hat, you need to determine how large or small to make it. There are two options: you can use general guidelines to choose your size, or take a head measurement for a more specific fit. Either will work well enough, but you probably won’t be able to get an exact measurement for a hat that’s being gifted. The circumference (forehead to back of the head) and the height (ear to top of head) must be measured, but here are the average sizes:\nPreemie: circumference = 12-inches, height = 4.25-inches\nNewborn: circumference = 14-inches, height = 5-inches\nBaby (6-months +): circumference = 16-inches, height = 6-inches\nChild and youth: circumference = 20-inches, height = 7.25-inches\nAdult: circumference = 22-inches, height = 8.5-inches\nLarge adult: circumference = 24-inches, height = 9.25-inches"
                },
                {
                    "headline": "Choose your yarn.",
                    "description": "To create a basic beanie, you can use any type of yarn. However, it is generally easier for beginners to choose a style that has a good amount of elasticity, isn’t too fluffy, and isn’t too thick. Aim for a 4-ply knitting worsted yarn made out of acrylic or wool. The color doesn’t matter, but it is harder to see and count stitches with a darker color, so you may consider using a lighter hue for your first hat."
                },
                {
                    "headline": "Pick your crochet hook.",
                    "description": "The size of your crochet hook depends on the size of your yarn. For a 4-ply knitting worsted yarn (recommended), you will need to use an H/8 made of aluminum. This size hook is a good choice for beginners, because it will work with multiple sizes of yarn and is comfortable to hold. Further, make sure that you hold your hook the right way. There are two general holds:\nThe knife hold (hook held like you would hold a knife to cut something). The pencil hold (hook help like you’re going to write something with it)."
                }
            ]
        },
        {
            "name": "Making the Base Chain",
            "steps": [
                {
                    "headline": "Tie your slipknot.",
                    "description": "The slipknot is the start to your crochet pattern – the knot that holds the yarn to your needle as you work. To tie the knot:\nDrape the yarn with the tail end in the palm of your hand, wrapped around the top of your index finger and under your middle finger. Wrap the yarn back over the top of your index, behind the first loop. Pull a loop from the center of the piece of yarn, and tuck this through the center of the large loop you’ve made around your fingers. Place the new small loop on the crochet hook, and pull the tail of the yarn to tighten it."
                },
                {
                    "headline": "Create your foundation chain.",
                    "description": "The foundation chain is simply the first row of chain stitches you create. Because you’re crocheting a hat, the foundation chain will not be very long – only five stitches to start. To crochet your first stitch, hold the tail end of your slipknot and slide the hook forward, so that there is plenty of space on the end. Wrap the yarn around the end of the hook once, and then pull the hook backwards through the original slipknot. You’ve completed your first stitch! Repeat this five times to create your foundation chain."
                },
                {
                    "headline": "Make a slip stitch to join your end to the first chain you made.",
                    "description": "This will finish your foundation row, by hooking it back in a loop. Stick the end of your hook through the center of the first stitch, and do a single stitch (as per usual)."
                },
                {
                    "headline": "Mark your starting point.",
                    "description": "As you crochet, you’ll need to keep count of your stitches. To do so, you’ll need to know where your row started. There are two general methods for marking the starting point: tie a piece of string around the first stitch in the second row, or slide a bobby pin over the stitch. When you get back to this part of each row, you will know you’ve completed an entire row of stitches."
                }
            ]
        },
        {
            "name": "Building Your Base Chain Into a Hat",
            "steps": [
                {
                    "headline": "Crochet in the round.",
                    "description": "To build your base chain into a hat, you will need to crochet in the round. Crochet in the round means to crochet a small circle – the base for your hat (the part at the very top). When you pull the hook through, you’ll have started a second row that is adjacent to the first, in a spiral. As you crochet your hat, make sure that you continue to crochet in a spiral. Do not change the direction at any point."
                },
                {
                    "headline": "Crochet your second row using a double stitch.",
                    "description": "From now on, you’ll have to use a double stitch for your hat. This will attach all your new rows of stitches to the spiral in the center, so that you don’t end up with multiple loose rows. To do a double stitch, you start with your hook with a single loop on it. Slip the hook through the loop and into the chain under/next to it (attached to the spiral). You now have two loops on your crochet hook. Finish by doing a regular stitch; wrap the yarn around the hook, pull this yarn through the two loops on your hook. You’ll always end with a single loop on your hook when you complete one double stitch."
                },
                {
                    "headline": "Alter the pattern.",
                    "description": "Once you’ve made the base round, you’ll change your stitch pattern just a bit to increase the body of your hat. For every row of stitches, you’ll start with a double stitch, do a single stitch, double stitch, single stitch, et cetera until you complete the row."
                },
                {
                    "headline": "Count your stitches.",
                    "description": "The first few rows are easy, but as you move on you’ll need to begin counting your stitches. A double stitch counts for 2 stitches, and a single stitch counts for 1. For example, if you were doing a row of five, it would be 1 double stitch, 1 single stitch, one double stitch - finished. Here is how your counting should go:\nFirst row: 5 stitches\nSecond row: 10 stitches\nThird row: 30 stitches\nFourth row: 45 stitches\nFifth row: 60 stitches\nSixth row: 75 stitches\nSeventh row: 90 stitches"
                },
                {
                    "headline": "Continue with single stitches after the seventh row.",
                    "description": "To complete your hat, you’ll do additional rows of single stitches. This will add length to the hat, rather than continuing to make it wider and wider. Start your rows of single stitches when you reach the desired circumference. To finish your hat completely, you’ll need to tie a slipknot and hide the tail end of the yarn by weaving it back into the hat with your hook. To hide the end piece of your hat, you can weave it into the hat. Leave about 6” of yarn after you tie the slipknot and then use an embroidery needle to weave the end through the edge and into the inside of the hat. Then, tie off the end after you have woven it a few inches into the inside of the hat."
                }
            ]
        }
    ],
    "tyn": [
        "Crochet Hook",
        "Yarn",
        "Scissors",
        "Embroidery needle (optional)"
    ],
    "text": " Designing Your Hat Determine the size of your hat. Before you can begin crocheting your hat, you need to determine how large or small to make it. There are two options: you can use general guidelines to choose your size, or take a head measurement for a more specific fit. Either will work well enough, but you probably won’t be able to get an exact measurement for a hat that’s being gifted. The circumference (forehead to back of the head) and the height (ear to top of head) must be measured, but here are the average sizes:\nPreemie: circumference = 12-inches, height = 4.25-inches\nNewborn: circumference = 14-inches, height = 5-inches\nBaby (6-months +): circumference = 16-inches, height = 6-inches\nChild and youth: circumference = 20-inches, height = 7.25-inches\nAdult: circumference = 22-inches, height = 8.5-inches\nLarge adult: circumference = 24-inches, height = 9.25-inches Choose your yarn. To create a basic beanie, you can use any type of yarn. However, it is generally easier for beginners to choose a style that has a good amount of elasticity, isn’t too fluffy, and isn’t too thick. Aim for a 4-ply knitting worsted yarn made out of acrylic or wool. The color doesn’t matter, but it is harder to see and count stitches with a darker color, so you may consider using a lighter hue for your first hat. Pick your crochet hook. The size of your crochet hook depends on the size of your yarn. For a 4-ply knitting worsted yarn (recommended), you will need to use an H/8 made of aluminum. This size hook is a good choice for beginners, because it will work with multiple sizes of yarn and is comfortable to hold. Further, make sure that you hold your hook the right way. There are two general holds:\nThe knife hold (hook held like you would hold a knife to cut something). The pencil hold (hook help like you’re going to write something with it). Making the Base Chain Tie your slipknot. The slipknot is the start to your crochet pattern – the knot that holds the yarn to your needle as you work. To tie the knot:\nDrape the yarn with the tail end in the palm of your hand, wrapped around the top of your index finger and under your middle finger. Wrap the yarn back over the top of your index, behind the first loop. Pull a loop from the center of the piece of yarn, and tuck this through the center of the large loop you’ve made around your fingers. Place the new small loop on the crochet hook, and pull the tail of the yarn to tighten it. Create your foundation chain. The foundation chain is simply the first row of chain stitches you create. Because you’re crocheting a hat, the foundation chain will not be very long – only five stitches to start. To crochet your first stitch, hold the tail end of your slipknot and slide the hook forward, so that there is plenty of space on the end. Wrap the yarn around the end of the hook once, and then pull the hook backwards through the original slipknot. You’ve completed your first stitch! Repeat this five times to create your foundation chain. Make a slip stitch to join your end to the first chain you made. This will finish your foundation row, by hooking it back in a loop. Stick the end of your hook through the center of the first stitch, and do a single stitch (as per usual). Mark your starting point. As you crochet, you’ll need to keep count of your stitches. To do so, you’ll need to know where your row started. There are two general methods for marking the starting point: tie a piece of string around the first stitch in the second row, or slide a bobby pin over the stitch. When you get back to this part of each row, you will know you’ve completed an entire row of stitches. Building Your Base Chain Into a Hat Crochet in the round. To build your base chain into a hat, you will need to crochet in the round. Crochet in the round means to crochet a small circle – the base for your hat (the part at the very top). When you pull the hook through, you’ll have started a second row that is adjacent to the first, in a spiral. As you crochet your hat, make sure that you continue to crochet in a spiral. Do not change the direction at any point. Crochet your second row using a double stitch. From now on, you’ll have to use a double stitch for your hat. This will attach all your new rows of stitches to the spiral in the center, so that you don’t end up with multiple loose rows. To do a double stitch, you start with your hook with a single loop on it. Slip the hook through the loop and into the chain under/next to it (attached to the spiral). You now have two loops on your crochet hook. Finish by doing a regular stitch; wrap the yarn around the hook, pull this yarn through the two loops on your hook. You’ll always end with a single loop on your hook when you complete one double stitch. Alter the pattern. Once you’ve made the base round, you’ll change your stitch pattern just a bit to increase the body of your hat. For every row of stitches, you’ll start with a double stitch, do a single stitch, double stitch, single stitch, et cetera until you complete the row. Count your stitches. The first few rows are easy, but as you move on you’ll need to begin counting your stitches. A double stitch counts for 2 stitches, and a single stitch counts for 1. For example, if you were doing a row of five, it would be 1 double stitch, 1 single stitch, one double stitch - finished. Here is how your counting should go:\nFirst row: 5 stitches\nSecond row: 10 stitches\nThird row: 30 stitches\nFourth row: 45 stitches\nFifth row: 60 stitches\nSixth row: 75 stitches\nSeventh row: 90 stitches Continue with single stitches after the seventh row. To complete your hat, you’ll do additional rows of single stitches. This will add length to the hat, rather than continuing to make it wider and wider. Start your rows of single stitches when you reach the desired circumference. To finish your hat completely, you’ll need to tie a slipknot and hide the tail end of the yarn by weaving it back into the hat with your hook. To hide the end piece of your hat, you can weave it into the hat. Leave about 6” of yarn after you tie the slipknot and then use an embroidery needle to weave the end through the edge and into the inside of the hat. Then, tie off the end after you have woven it a few inches into the inside of the hat.",
    "sentences": [
        " Designing Your Hat Determine the size of your hat.",
        "Before you can begin crocheting your hat, you need to determine how large or small to make it.",
        "There are two options: you can use general guidelines to choose your size, or take a head measurement for a more specific fit.",
        "Either will work well enough, but you probably won’t be able to get an exact measurement for a hat that’s being gifted.",
        "The circumference (forehead to back of the head) and the height (ear to top of head) must be measured, but here are the average sizes:\nPreemie: circumference = 12-inches, height = 4.25-inches\nNewborn: circumference = 14-inches, height = 5-inches\nBaby (6-months +): circumference = 16-inches, height = 6-inches\nChild and youth: circumference = 20-inches, height = 7.25-inches\nAdult: circumference = 22-inches, height = 8.5-inches\nLarge adult: circumference = 24-inches, height = 9.25-inches Choose your yarn.",
        "To create a basic beanie, you can use any type of yarn.",
        "However, it is generally easier for beginners to choose a style that has a good amount of elasticity, isn’t too fluffy, and isn’t too thick.",
        "Aim for a 4-ply knitting worsted yarn made out of acrylic or wool.",
        "The color doesn’t matter, but it is harder to see and count stitches with a darker color, so you may consider using a lighter hue for your first hat.",
        "Pick your crochet hook.",
        "The size of your crochet hook depends on the size of your yarn.",
        "For a 4-ply knitting worsted yarn (recommended), you will need to use an H/8 made of aluminum.",
        "This size hook is a good choice for beginners, because it will work with multiple sizes of yarn and is comfortable to hold.",
        "Further, make sure that you hold your hook the right way.",
        "There are two general holds:\nThe knife hold (hook held like you would hold a knife to cut something).",
        "The pencil hold (hook help like you’re going to write something with it).",
        "Making the Base Chain Tie your slipknot.",
        "The slipknot is the start to your crochet pattern – the knot that holds the yarn to your needle as you work.",
        "To tie the knot:\nDrape the yarn with the tail end in the palm of your hand, wrapped around the top of your index finger and under your middle finger.",
        "Wrap the yarn back over the top of your index, behind the first loop.",
        "Pull a loop from the center of the piece of yarn, and tuck this through the center of the large loop you’ve made around your fingers.",
        "Place the new small loop on the crochet hook, and pull the tail of the yarn to tighten it.",
        "Create your foundation chain.",
        "The foundation chain is simply the first row of chain stitches you create.",
        "Because you’re crocheting a hat, the foundation chain will not be very long – only five stitches to start.",
        "To crochet your first stitch, hold the tail end of your slipknot and slide the hook forward, so that there is plenty of space on the end.",
        "Wrap the yarn around the end of the hook once, and then pull the hook backwards through the original slipknot.",
        "You’ve completed your first stitch!",
        "Repeat this five times to create your foundation chain.",
        "Make a slip stitch to join your end to the first chain you made.",
        "This will finish your foundation row, by hooking it back in a loop.",
        "Stick the end of your hook through the center of the first stitch, and do a single stitch (as per usual).",
        "Mark your starting point.",
        "As you crochet, you’ll need to keep count of your stitches.",
        "To do so, you’ll need to know where your row started.",
        "There are two general methods for marking the starting point: tie a piece of string around the first stitch in the second row, or slide a bobby pin over the stitch.",
        "When you get back to this part of each row, you will know you’ve completed an entire row of stitches.",
        "Building Your Base Chain Into a Hat Crochet in the round.",
        "To build your base chain into a hat, you will need to crochet in the round.",
        "Crochet in the round means to crochet a small circle – the base for your hat (the part at the very top).",
        "When you pull the hook through, you’ll have started a second row that is adjacent to the first, in a spiral.",
        "As you crochet your hat, make sure that you continue to crochet in a spiral.",
        "Do not change the direction at any point.",
        "Crochet your second row using a double stitch.",
        "From now on, you’ll have to use a double stitch for your hat.",
        "This will attach all your new rows of stitches to the spiral in the center, so that you don’t end up with multiple loose rows.",
        "To do a double stitch, you start with your hook with a single loop on it.",
        "Slip the hook through the loop and into the chain under/next to it (attached to the spiral).",
        "You now have two loops on your crochet hook.",
        "Finish by doing a regular stitch; wrap the yarn around the hook, pull this yarn through the two loops on your hook.",
        "You’ll always end with a single loop on your hook when you complete one double stitch.",
        "Alter the pattern.",
        "Once you’ve made the base round, you’ll change your stitch pattern just a bit to increase the body of your hat.",
        "For every row of stitches, you’ll start with a double stitch, do a single stitch, double stitch, single stitch, et cetera until you complete the row.",
        "Count your stitches.",
        "The first few rows are easy, but as you move on you’ll need to begin counting your stitches.",
        "A double stitch counts for 2 stitches, and a single stitch counts for 1.",
        "For example, if you were doing a row of five, it would be 1 double stitch, 1 single stitch, one double stitch - finished.",
        "Here is how your counting should go:\nFirst row: 5 stitches\nSecond row: 10 stitches\nThird row: 30 stitches\nFourth row: 45 stitches\nFifth row: 60 stitches\nSixth row: 75 stitches\nSeventh row: 90 stitches Continue with single stitches after the seventh row.",
        "To complete your hat, you’ll do additional rows of single stitches.",
        "This will add length to the hat, rather than continuing to make it wider and wider.",
        "Start your rows of single stitches when you reach the desired circumference.",
        "To finish your hat completely, you’ll need to tie a slipknot and hide the tail end of the yarn by weaving it back into the hat with your hook.",
        "To hide the end piece of your hat, you can weave it into the hat.",
        "Leave about 6” of yarn after you tie the slipknot and then use an embroidery needle to weave the end through the edge and into the inside of the hat.",
        "Then, tie off the end after you have woven it a few inches into the inside of the hat."
    ]
}