{
    "title": "How to Keep an Aloe Vera Plant Fresh",
    "url": "https://www.wikihow.com/Keep-an-Aloe-Vera-Plant-Fresh",
    "category_hierarchy": [
        "Health",
        "Alternative Health"
    ],
    "methods": [
        {
            "name": "Caring for Your Aloe Plant",
            "steps": [
                {
                    "headline": "Switch out your plant’s soil for a mixture of sand and dirt.",
                    "description": "Check the inside of your potted aloe plant to see if it’s rooted in soil or a combination of soil and sand. Since aloe naturally grows in hot climates, you might have more success growing a fresh, healthy-looking plant in a sandy soil base. Mix equal amounts of sand and potting soil in a clay pot, then plant or transplant your aloe into the new soil mixture.Check your local nursery or garden supply store to see if they sell a special soil mix for succulents. This could work as a base for your plant."
                },
                {
                    "headline": "Put your plant in a place where it can get at least 4 hours of direct sunlight each day.",
                    "description": "Find a windowsill or other areas in your home where your aloe plant can get a constant amount of direct sunlight. Ideally, try to place your plant near a window on the eastern side of your home, which gets the most consistent amount of light throughout the day. If your home doesn’t have this, opt for a southern- or western-facing window.The northern hemisphere receives the most sunlight from southern-facing windows; however, this amount isn’t consistent, which doesn’t always make it optimal for indoor plants like aloe. If you live in the southern hemisphere, place your indoor plants next to a north-facing window, or another window that receives a consistent amount of light. You can also keep your aloe outside if you live in a consistently warm area. While aloe is well-known for being an indoor plant, you can plant in an outdoor garden if your home is grouped under zone 10 or above on the USDA Plant Hardiness Map. You can compare your location here: https://planthardiness.ars.usda.gov/PHZMWeb/. If you live in Europe, check the plant hardiness level of your location here: https://www.gardenia.net/guide/european-hardiness-zones."
                },
                {
                    "headline": "Water your plant heavily on a biweekly basis.",
                    "description": "Don’t water your plant every day, as this could rot out the roots and keep your aloe plant looking limp. Instead, set a reminder to take care of your plant once every 2 weeks so your aloe can thrive. When you water the plant, try to thoroughly soak the surface of the soil. Then, you can let your plant absorb the water over the next 2 weeks.It’s okay if your plant’s soil becomes dry to the touch! Aloe plants are very hardy and don’t need to be taken care of constantly."
                },
                {
                    "headline": "Keep your aloe in an area with a temperature above 70 °F (21 °C).",
                    "description": "While you don’t have to set an exact temperature in your home for the sake of your plant, note that aloe tends to thrive in a stable, warmer temperature. Avoid keeping your plant in an environment that’s below 70 °F (21 °C), as this could have a negative effect on its freshness and overall growth.If you have your air conditioner on during hotter weather, consider placing your aloe plant outside. In an ideal environment, aloe plants thrive with a daytime temperature of 85 °F (29 °C) and a nighttime temperature of 70 °F (21 °C)."
                },
                {
                    "headline": "Store the aloe plant in an area with 5 to 24% humidity.",
                    "description": "Since aloe plants are native to hot, arid climates, you don’t want to keep them in overly moist areas, like a kitchen or laundry room. Instead, keep your plant in a dry, well-lit living space without any humidifiers or sources of moisture present.While your plant won’t die if you store it in a damp place, it might not look as fresh over time."
                }
            ]
        },
        {
            "name": "Harvesting and Storing Fresh Aloe Gel",
            "steps": [
                {
                    "headline": "Cut off several leaves from your plant so you can harvest the gel.",
                    "description": "Examine your plant to find thick, green leaves sticking out of the plant. While keeping these leaves in mind, take a pair of scissors and position them close to the stem of the aloe plant. Snip the scissors to slice through the plant and successfully remove the leaf from the plant. Repeat this process as many times as you’d like, or until you run out of aloe leaves.Aloe “leaves” are a nickname for the green, spiky portions of the plant. You can get more gel from each leaf if you cut closer to the stem. Only harvest leaves from plants that are least 2-3 years old and have an established central stalk. You can harvest multiple leaves from your plant, as long as the stalk and root system stay intact. If you want to use your aloe year-round, don’t remove all of the leaves at once."
                },
                {
                    "headline": "Lay your sliced leaves upside-down in a jar or glass to drain for 10-15 minutes.",
                    "description": "Collect your cut aloe leaves and arrange them in a jar, cup, or another container. Check that the pointy end of each leaf is pointed upwards, while the cut side is touching the bottom of the jar or cup. Wait about 10-15 minutes for a yellow liquid known as aloin to drip out of the leaves.Aloin can cause stomach cramping and other GI issues if you swallow it."
                },
                {
                    "headline": "Rinse and dry your aloe leaves to clean them off.",
                    "description": "Hold each leaf beneath cool running water to remove any dirt, grime, or excess aloin that’s sticking to the plant. Once your leaves look visibly clean, place them on a flat surface. Pat each leaf dry with a paper towel until they’re fully dry to the touch."
                },
                {
                    "headline": "Extract the gel from each leaf with a knife.",
                    "description": "Lay each aloe leaf on a flat surface, then use a knife to trim away the sharp rows of spikes along the edges of the leaves. Next, slice lengthwise down the center of the aloe to cut the leaf open. To get to the gel, stick your knife beneath the outer layer of the leaf, then move the knife beneath the skin to pry it away from the inner gel. Work your knife around the entire aloe plant to remove all of the skin.Be careful whenever you handful aloe gel; since it’s slippery, you don’t want your knife to slip by accident. Three or 4 aloe leaves can yield about 0.5 to 0.75 cups (120 to 180 mL) of gel."
                },
                {
                    "headline": "Combine the gel with Vitamin C powder if you’d like to have it on hand.",
                    "description": "Pour ¼ cup (60 mL) of aloe vera gel into a blender, then add in 500 mg (0.02 oz) of Vitamin C powder. Blend both ingredients together until they form a smooth, even consistency. To preserve the mixture, pour it into an airtight container and place it in the refrigerator for no more than 2 months.If you don’t add in any Vitamin C powder, then the aloe gel can only last for 1 week in the refrigerator. You can also include 400 IU of Vitamin E powder if you don’t want to use Vitamin C."
                },
                {
                    "headline": "Pour the aloe gel into an ice cube tray if you want to freeze it.",
                    "description": "If the gel is too chunky, puree it in a blender or food processor beforehand. Once your aloe gel is fully liquefied, pour it into a standard ice cube tray. Wait 1-2 days for your aloe cubes to freeze fully, then transfer them to an airtight freezer bag.Try to use your aloe cubes within 6 months."
                },
                {
                    "headline": "Mix the aloe gel with water if you want to store it in drink form.",
                    "description": "Pour 1 cup (240 mL) of water into a blender, then add in 2 tablespoons (30 mL) of aloe gel into the mix. Blend the ingredients together until they’re completely combined. You can drink this beverage immediately, or you can freeze it in an ice cube tray for long-term storage.Warning: According to some scientific studies, drinking aloe on a long-term basis could have cancerous side effects. With this in mind, talk to your doctor before adding aloe drinks to your diet on a regular basis."
                }
            ]
        }
    ],
    "tyn": [
        "Caring for Your Aloe Plant",
        "Sand",
        "Potting soil",
        "Planting pot",
        "Water",
        "Succulent soil mix (optional)",
        "Storing Fresh Aloe Gel",
        "Scissors",
        "Jar or cup",
        "Paper towel",
        "Knife",
        "Bowl",
        "Ice cube tray",
        "Freezer bag",
        "Blender",
        "Vitamin C or E powder"
    ],
    "text": " Caring for Your Aloe Plant Switch out your plant’s soil for a mixture of sand and dirt. Check the inside of your potted aloe plant to see if it’s rooted in soil or a combination of soil and sand. Since aloe naturally grows in hot climates, you might have more success growing a fresh, healthy-looking plant in a sandy soil base. Mix equal amounts of sand and potting soil in a clay pot, then plant or transplant your aloe into the new soil mixture.Check your local nursery or garden supply store to see if they sell a special soil mix for succulents. This could work as a base for your plant. Put your plant in a place where it can get at least 4 hours of direct sunlight each day. Find a windowsill or other areas in your home where your aloe plant can get a constant amount of direct sunlight. Ideally, try to place your plant near a window on the eastern side of your home, which gets the most consistent amount of light throughout the day. If your home doesn’t have this, opt for a southern- or western-facing window.The northern hemisphere receives the most sunlight from southern-facing windows; however, this amount isn’t consistent, which doesn’t always make it optimal for indoor plants like aloe. If you live in the southern hemisphere, place your indoor plants next to a north-facing window, or another window that receives a consistent amount of light. You can also keep your aloe outside if you live in a consistently warm area. While aloe is well-known for being an indoor plant, you can plant in an outdoor garden if your home is grouped under zone 10 or above on the USDA Plant Hardiness Map. You can compare your location here: https://planthardiness.ars.usda.gov/PHZMWeb/. If you live in Europe, check the plant hardiness level of your location here: https://www.gardenia.net/guide/european-hardiness-zones. Water your plant heavily on a biweekly basis. Don’t water your plant every day, as this could rot out the roots and keep your aloe plant looking limp. Instead, set a reminder to take care of your plant once every 2 weeks so your aloe can thrive. When you water the plant, try to thoroughly soak the surface of the soil. Then, you can let your plant absorb the water over the next 2 weeks.It’s okay if your plant’s soil becomes dry to the touch! Aloe plants are very hardy and don’t need to be taken care of constantly. Keep your aloe in an area with a temperature above 70 °F (21 °C). While you don’t have to set an exact temperature in your home for the sake of your plant, note that aloe tends to thrive in a stable, warmer temperature. Avoid keeping your plant in an environment that’s below 70 °F (21 °C), as this could have a negative effect on its freshness and overall growth.If you have your air conditioner on during hotter weather, consider placing your aloe plant outside. In an ideal environment, aloe plants thrive with a daytime temperature of 85 °F (29 °C) and a nighttime temperature of 70 °F (21 °C). Store the aloe plant in an area with 5 to 24% humidity. Since aloe plants are native to hot, arid climates, you don’t want to keep them in overly moist areas, like a kitchen or laundry room. Instead, keep your plant in a dry, well-lit living space without any humidifiers or sources of moisture present.While your plant won’t die if you store it in a damp place, it might not look as fresh over time. Harvesting and Storing Fresh Aloe Gel Cut off several leaves from your plant so you can harvest the gel. Examine your plant to find thick, green leaves sticking out of the plant. While keeping these leaves in mind, take a pair of scissors and position them close to the stem of the aloe plant. Snip the scissors to slice through the plant and successfully remove the leaf from the plant. Repeat this process as many times as you’d like, or until you run out of aloe leaves.Aloe “leaves” are a nickname for the green, spiky portions of the plant. You can get more gel from each leaf if you cut closer to the stem. Only harvest leaves from plants that are least 2-3 years old and have an established central stalk. You can harvest multiple leaves from your plant, as long as the stalk and root system stay intact. If you want to use your aloe year-round, don’t remove all of the leaves at once. Lay your sliced leaves upside-down in a jar or glass to drain for 10-15 minutes. Collect your cut aloe leaves and arrange them in a jar, cup, or another container. Check that the pointy end of each leaf is pointed upwards, while the cut side is touching the bottom of the jar or cup. Wait about 10-15 minutes for a yellow liquid known as aloin to drip out of the leaves.Aloin can cause stomach cramping and other GI issues if you swallow it. Rinse and dry your aloe leaves to clean them off. Hold each leaf beneath cool running water to remove any dirt, grime, or excess aloin that’s sticking to the plant. Once your leaves look visibly clean, place them on a flat surface. Pat each leaf dry with a paper towel until they’re fully dry to the touch. Extract the gel from each leaf with a knife. Lay each aloe leaf on a flat surface, then use a knife to trim away the sharp rows of spikes along the edges of the leaves. Next, slice lengthwise down the center of the aloe to cut the leaf open. To get to the gel, stick your knife beneath the outer layer of the leaf, then move the knife beneath the skin to pry it away from the inner gel. Work your knife around the entire aloe plant to remove all of the skin.Be careful whenever you handful aloe gel; since it’s slippery, you don’t want your knife to slip by accident. Three or 4 aloe leaves can yield about 0.5 to 0.75 cups (120 to 180 mL) of gel. Combine the gel with Vitamin C powder if you’d like to have it on hand. Pour ¼ cup (60 mL) of aloe vera gel into a blender, then add in 500 mg (0.02 oz) of Vitamin C powder. Blend both ingredients together until they form a smooth, even consistency. To preserve the mixture, pour it into an airtight container and place it in the refrigerator for no more than 2 months.If you don’t add in any Vitamin C powder, then the aloe gel can only last for 1 week in the refrigerator. You can also include 400 IU of Vitamin E powder if you don’t want to use Vitamin C. Pour the aloe gel into an ice cube tray if you want to freeze it. If the gel is too chunky, puree it in a blender or food processor beforehand. Once your aloe gel is fully liquefied, pour it into a standard ice cube tray. Wait 1-2 days for your aloe cubes to freeze fully, then transfer them to an airtight freezer bag.Try to use your aloe cubes within 6 months. Mix the aloe gel with water if you want to store it in drink form. Pour 1 cup (240 mL) of water into a blender, then add in 2 tablespoons (30 mL) of aloe gel into the mix. Blend the ingredients together until they’re completely combined. You can drink this beverage immediately, or you can freeze it in an ice cube tray for long-term storage.Warning: According to some scientific studies, drinking aloe on a long-term basis could have cancerous side effects. With this in mind, talk to your doctor before adding aloe drinks to your diet on a regular basis.",
    "sentences": [
        " Caring for Your Aloe Plant Switch out your plant’s soil for a mixture of sand and dirt.",
        "Check the inside of your potted aloe plant to see if it’s rooted in soil or a combination of soil and sand.",
        "Since aloe naturally grows in hot climates, you might have more success growing a fresh, healthy-looking plant in a sandy soil base.",
        "Mix equal amounts of sand and potting soil in a clay pot, then plant or transplant your aloe into the new soil mixture.Check your local nursery or garden supply store to see if they sell a special soil mix for succulents.",
        "This could work as a base for your plant.",
        "Put your plant in a place where it can get at least 4 hours of direct sunlight each day.",
        "Find a windowsill or other areas in your home where your aloe plant can get a constant amount of direct sunlight.",
        "Ideally, try to place your plant near a window on the eastern side of your home, which gets the most consistent amount of light throughout the day.",
        "If your home doesn’t have this, opt for a southern- or western-facing window.The northern hemisphere receives the most sunlight from southern-facing windows; however, this amount isn’t consistent, which doesn’t always make it optimal for indoor plants like aloe.",
        "If you live in the southern hemisphere, place your indoor plants next to a north-facing window, or another window that receives a consistent amount of light.",
        "You can also keep your aloe outside if you live in a consistently warm area.",
        "While aloe is well-known for being an indoor plant, you can plant in an outdoor garden if your home is grouped under zone 10 or above on the USDA Plant Hardiness Map.",
        "You can compare your location here: https://planthardiness.ars.usda.gov/PHZMWeb/.",
        "If you live in Europe, check the plant hardiness level of your location here: https://www.gardenia.net/guide/european-hardiness-zones.",
        "Water your plant heavily on a biweekly basis.",
        "Don’t water your plant every day, as this could rot out the roots and keep your aloe plant looking limp.",
        "Instead, set a reminder to take care of your plant once every 2 weeks so your aloe can thrive.",
        "When you water the plant, try to thoroughly soak the surface of the soil.",
        "Then, you can let your plant absorb the water over the next 2 weeks.It’s okay if your plant’s soil becomes dry to the touch!",
        "Aloe plants are very hardy and don’t need to be taken care of constantly.",
        "Keep your aloe in an area with a temperature above 70 °F (21 °C).",
        "While you don’t have to set an exact temperature in your home for the sake of your plant, note that aloe tends to thrive in a stable, warmer temperature.",
        "Avoid keeping your plant in an environment that’s below 70 °F (21 °C), as this could have a negative effect on its freshness and overall growth.If you have your air conditioner on during hotter weather, consider placing your aloe plant outside.",
        "In an ideal environment, aloe plants thrive with a daytime temperature of 85 °F (29 °C) and a nighttime temperature of 70 °F (21 °C).",
        "Store the aloe plant in an area with 5 to 24% humidity.",
        "Since aloe plants are native to hot, arid climates, you don’t want to keep them in overly moist areas, like a kitchen or laundry room.",
        "Instead, keep your plant in a dry, well-lit living space without any humidifiers or sources of moisture present.While your plant won’t die if you store it in a damp place, it might not look as fresh over time.",
        "Harvesting and Storing Fresh Aloe Gel Cut off several leaves from your plant so you can harvest the gel.",
        "Examine your plant to find thick, green leaves sticking out of the plant.",
        "While keeping these leaves in mind, take a pair of scissors and position them close to the stem of the aloe plant.",
        "Snip the scissors to slice through the plant and successfully remove the leaf from the plant.",
        "Repeat this process as many times as you’d like, or until you run out of aloe leaves.Aloe “leaves” are a nickname for the green, spiky portions of the plant.",
        "You can get more gel from each leaf if you cut closer to the stem.",
        "Only harvest leaves from plants that are least 2-3 years old and have an established central stalk.",
        "You can harvest multiple leaves from your plant, as long as the stalk and root system stay intact.",
        "If you want to use your aloe year-round, don’t remove all of the leaves at once.",
        "Lay your sliced leaves upside-down in a jar or glass to drain for 10-15 minutes.",
        "Collect your cut aloe leaves and arrange them in a jar, cup, or another container.",
        "Check that the pointy end of each leaf is pointed upwards, while the cut side is touching the bottom of the jar or cup.",
        "Wait about 10-15 minutes for a yellow liquid known as aloin to drip out of the leaves.Aloin can cause stomach cramping and other GI issues if you swallow it.",
        "Rinse and dry your aloe leaves to clean them off.",
        "Hold each leaf beneath cool running water to remove any dirt, grime, or excess aloin that’s sticking to the plant.",
        "Once your leaves look visibly clean, place them on a flat surface.",
        "Pat each leaf dry with a paper towel until they’re fully dry to the touch.",
        "Extract the gel from each leaf with a knife.",
        "Lay each aloe leaf on a flat surface, then use a knife to trim away the sharp rows of spikes along the edges of the leaves.",
        "Next, slice lengthwise down the center of the aloe to cut the leaf open.",
        "To get to the gel, stick your knife beneath the outer layer of the leaf, then move the knife beneath the skin to pry it away from the inner gel.",
        "Work your knife around the entire aloe plant to remove all of the skin.Be careful whenever you handful aloe gel; since it’s slippery, you don’t want your knife to slip by accident.",
        "Three or 4 aloe leaves can yield about 0.5 to 0.75 cups (120 to 180 mL) of gel.",
        "Combine the gel with Vitamin C powder if you’d like to have it on hand.",
        "Pour ¼ cup (60 mL) of aloe vera gel into a blender, then add in 500 mg (0.02 oz) of Vitamin C powder.",
        "Blend both ingredients together until they form a smooth, even consistency.",
        "To preserve the mixture, pour it into an airtight container and place it in the refrigerator for no more than 2 months.If you don’t add in any Vitamin C powder, then the aloe gel can only last for 1 week in the refrigerator.",
        "You can also include 400 IU of Vitamin E powder if you don’t want to use Vitamin C. Pour the aloe gel into an ice cube tray if you want to freeze it.",
        "If the gel is too chunky, puree it in a blender or food processor beforehand.",
        "Once your aloe gel is fully liquefied, pour it into a standard ice cube tray.",
        "Wait 1-2 days for your aloe cubes to freeze fully, then transfer them to an airtight freezer bag.Try to use your aloe cubes within 6 months.",
        "Mix the aloe gel with water if you want to store it in drink form.",
        "Pour 1 cup (240 mL) of water into a blender, then add in 2 tablespoons (30 mL) of aloe gel into the mix.",
        "Blend the ingredients together until they’re completely combined.",
        "You can drink this beverage immediately, or you can freeze it in an ice cube tray for long-term storage.Warning: According to some scientific studies, drinking aloe on a long-term basis could have cancerous side effects.",
        "With this in mind, talk to your doctor before adding aloe drinks to your diet on a regular basis."
    ]
}