{
    "title": "How to Measure Wheel Trim Rings",
    "url": "https://www.wikihow.com/Measure-Wheel-Trim-Rings",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Maintenance and Repair",
        "Tires and Suspension"
    ],
    "methods": [
        {
            "name": "Checking the Size of Your Trim Rings",
            "steps": [
                {
                    "headline": "Lay one of your rings face-down on a flat surface.",
                    "description": "Take the ring and set it on a table, desk, workbench, or a covered section of your garage floor where it won’t get dirty or scuffed. Position it so that the flared lip is on the bottom—this the part that will face outward once you install it. All of your rings will be the same size, so you only need to measure one of them."
                },
                {
                    "headline": "Stretch your tape measure across the ring’s inner wall to find its diameter.",
                    "description": "Be sure to place the upper edge of the tape at the center of the ring. Note the number you see on the far end in inches and write it down if you think you might have trouble remembering it. Make sure your measurement matches the last 2 digits of the sizing code printed on your tires’ sidewalls. Even though trim rings come in standardized sizes, it’s a good idea to double-check their dimensions yourself to be certain that they’ll fit your vehicle.Warning: Don’t include the lip of the ring in your measurement. If you do, it may be off by 1 in (2.5 cm) or more."
                },
                {
                    "headline": "Hold the tape measure vertically to measure the depth of the ring.",
                    "description": "Now, turn your tape measure so that it’s running straight up and down. The number that you read beside the upper edge of the ring is its depth, or how far back into the rim it will seat. The majority of trim rings have a standard depth of 1.5 inches (3.8 cm). However, there are also rings with 2 in (5.1 cm), 2.5 in (6.4 cm), 2.75 in (7.0 cm), and 3 in (7.6 cm) depths. These are designed to fit the wheels of various popular vehicle models. Check to make sure that the slotted cutout on the inside wall of the ring is the right distance to line up with your tire's valve stem once the ring is in place. The depth isn’t always included in a ring’s official measurements, but it’s still helpful to know, as it can prevent you from dropping money on a set that doesn’t fit correctly."
                }
            ]
        },
        {
            "name": "Measuring Your Wheels",
            "steps": [
                {
                    "headline": "Scan your tires’ sizing code to figure out the diameter of your wheels quickly.",
                    "description": "Most automobile tires have unique size specifications etched into the sidewall in the form of a multi-part serial code. In this case, you’re only looking for the final 2 digits of the section that comes just after the slash. These numbers correspond to the diameter of the wheel on which the tire is mounted. If your vehicle’s tires read “P225 / 70 R 16,” it means that your wheels have a diameter of 16 inches (41 cm). The format for this sizing code is universal, which means that it will be the same on all brand-name tires, even in countries that use the metric system.Tip: Make a mental note of your tires’ diameter, or jot it down on a scrap sheet of paper. This number will be important when you start shopping for a new set of trim rings."
                },
                {
                    "headline": "Check the sizing info on the driver’s side door if you don’t see it on the tires.",
                    "description": "You may not be able to locate or read the sizing code on the tires themselves if they’re especially old or worn. If this is the case, look for the same string of characters at the top of the sticker on the inside panel of the driver’s side door. The last 2 numbers in the first part of the code are the diameter of your tires in inches. Some vehicles also have a second sticker inside the glove compartment. You can confirm these dimensions by flipping through your vehicle’s owner’s manual, as well."
                },
                {
                    "headline": "Measure the inner barrel of one of your wheels to size them up yourself.",
                    "description": "Remove a tire from your vehicle, then grab a tape measure and extend it from one bead seat to the other. This will give you the wheel’s actual diameter, which should be a whole number, such as 14 in (36 cm), 16 in (41 cm), 18 in (46 cm), etc. It doesn’t matter which tire you take off, since all of your vehicle’s wheels are the same size. The bead seat is the grooved surface of the wheel that lies just inside the outer lip. It's where the edge of the tire sits once installed. Make sure you don’t measure the wheel’s outer lip by mistake. This will only tell you its overall diameter, which won’t match any of the standardized measurements used to manufacture trim rings."
                }
            ]
        }
    ],
    "tyn": [
        "Checking the Size of Your Trim Rings",
        "Tape measure",
        "Pen and paper (optional)",
        "Measuring Your Wheels",
        "Vehicle tire",
        "Tire info sticker (optional)",
        "Jack and lug wrench (optional)",
        "Tape measure (optional)"
    ],
    "text": " Checking the Size of Your Trim Rings Lay one of your rings face-down on a flat surface. Take the ring and set it on a table, desk, workbench, or a covered section of your garage floor where it won’t get dirty or scuffed. Position it so that the flared lip is on the bottom—this the part that will face outward once you install it. All of your rings will be the same size, so you only need to measure one of them. Stretch your tape measure across the ring’s inner wall to find its diameter. Be sure to place the upper edge of the tape at the center of the ring. Note the number you see on the far end in inches and write it down if you think you might have trouble remembering it. Make sure your measurement matches the last 2 digits of the sizing code printed on your tires’ sidewalls. Even though trim rings come in standardized sizes, it’s a good idea to double-check their dimensions yourself to be certain that they’ll fit your vehicle.Warning: Don’t include the lip of the ring in your measurement. If you do, it may be off by 1 in (2.5 cm) or more. Hold the tape measure vertically to measure the depth of the ring. Now, turn your tape measure so that it’s running straight up and down. The number that you read beside the upper edge of the ring is its depth, or how far back into the rim it will seat. The majority of trim rings have a standard depth of 1.5 inches (3.8 cm). However, there are also rings with 2 in (5.1 cm), 2.5 in (6.4 cm), 2.75 in (7.0 cm), and 3 in (7.6 cm) depths. These are designed to fit the wheels of various popular vehicle models. Check to make sure that the slotted cutout on the inside wall of the ring is the right distance to line up with your tire's valve stem once the ring is in place. The depth isn’t always included in a ring’s official measurements, but it’s still helpful to know, as it can prevent you from dropping money on a set that doesn’t fit correctly. Measuring Your Wheels Scan your tires’ sizing code to figure out the diameter of your wheels quickly. Most automobile tires have unique size specifications etched into the sidewall in the form of a multi-part serial code. In this case, you’re only looking for the final 2 digits of the section that comes just after the slash. These numbers correspond to the diameter of the wheel on which the tire is mounted. If your vehicle’s tires read “P225 / 70 R 16,” it means that your wheels have a diameter of 16 inches (41 cm). The format for this sizing code is universal, which means that it will be the same on all brand-name tires, even in countries that use the metric system.Tip: Make a mental note of your tires’ diameter, or jot it down on a scrap sheet of paper. This number will be important when you start shopping for a new set of trim rings. Check the sizing info on the driver’s side door if you don’t see it on the tires. You may not be able to locate or read the sizing code on the tires themselves if they’re especially old or worn. If this is the case, look for the same string of characters at the top of the sticker on the inside panel of the driver’s side door. The last 2 numbers in the first part of the code are the diameter of your tires in inches. Some vehicles also have a second sticker inside the glove compartment. You can confirm these dimensions by flipping through your vehicle’s owner’s manual, as well. Measure the inner barrel of one of your wheels to size them up yourself. Remove a tire from your vehicle, then grab a tape measure and extend it from one bead seat to the other. This will give you the wheel’s actual diameter, which should be a whole number, such as 14 in (36 cm), 16 in (41 cm), 18 in (46 cm), etc. It doesn’t matter which tire you take off, since all of your vehicle’s wheels are the same size. The bead seat is the grooved surface of the wheel that lies just inside the outer lip. It's where the edge of the tire sits once installed. Make sure you don’t measure the wheel’s outer lip by mistake. This will only tell you its overall diameter, which won’t match any of the standardized measurements used to manufacture trim rings.",
    "sentences": [
        " Checking the Size of Your Trim Rings Lay one of your rings face-down on a flat surface.",
        "Take the ring and set it on a table, desk, workbench, or a covered section of your garage floor where it won’t get dirty or scuffed.",
        "Position it so that the flared lip is on the bottom—this the part that will face outward once you install it.",
        "All of your rings will be the same size, so you only need to measure one of them.",
        "Stretch your tape measure across the ring’s inner wall to find its diameter.",
        "Be sure to place the upper edge of the tape at the center of the ring.",
        "Note the number you see on the far end in inches and write it down if you think you might have trouble remembering it.",
        "Make sure your measurement matches the last 2 digits of the sizing code printed on your tires’ sidewalls.",
        "Even though trim rings come in standardized sizes, it’s a good idea to double-check their dimensions yourself to be certain that they’ll fit your vehicle.Warning: Don’t include the lip of the ring in your measurement.",
        "If you do, it may be off by 1 in (2.5 cm) or more.",
        "Hold the tape measure vertically to measure the depth of the ring.",
        "Now, turn your tape measure so that it’s running straight up and down.",
        "The number that you read beside the upper edge of the ring is its depth, or how far back into the rim it will seat.",
        "The majority of trim rings have a standard depth of 1.5 inches (3.8 cm).",
        "However, there are also rings with 2 in (5.1 cm), 2.5 in (6.4 cm), 2.75 in (7.0 cm), and 3 in (7.6 cm) depths.",
        "These are designed to fit the wheels of various popular vehicle models.",
        "Check to make sure that the slotted cutout on the inside wall of the ring is the right distance to line up with your tire's valve stem once the ring is in place.",
        "The depth isn’t always included in a ring’s official measurements, but it’s still helpful to know, as it can prevent you from dropping money on a set that doesn’t fit correctly.",
        "Measuring Your Wheels Scan your tires’ sizing code to figure out the diameter of your wheels quickly.",
        "Most automobile tires have unique size specifications etched into the sidewall in the form of a multi-part serial code.",
        "In this case, you’re only looking for the final 2 digits of the section that comes just after the slash.",
        "These numbers correspond to the diameter of the wheel on which the tire is mounted.",
        "If your vehicle’s tires read “P225 / 70 R 16,” it means that your wheels have a diameter of 16 inches (41 cm).",
        "The format for this sizing code is universal, which means that it will be the same on all brand-name tires, even in countries that use the metric system.Tip: Make a mental note of your tires’ diameter, or jot it down on a scrap sheet of paper.",
        "This number will be important when you start shopping for a new set of trim rings.",
        "Check the sizing info on the driver’s side door if you don’t see it on the tires.",
        "You may not be able to locate or read the sizing code on the tires themselves if they’re especially old or worn.",
        "If this is the case, look for the same string of characters at the top of the sticker on the inside panel of the driver’s side door.",
        "The last 2 numbers in the first part of the code are the diameter of your tires in inches.",
        "Some vehicles also have a second sticker inside the glove compartment.",
        "You can confirm these dimensions by flipping through your vehicle’s owner’s manual, as well.",
        "Measure the inner barrel of one of your wheels to size them up yourself.",
        "Remove a tire from your vehicle, then grab a tape measure and extend it from one bead seat to the other.",
        "This will give you the wheel’s actual diameter, which should be a whole number, such as 14 in (36 cm), 16 in (41 cm), 18 in (46 cm), etc.",
        "It doesn’t matter which tire you take off, since all of your vehicle’s wheels are the same size.",
        "The bead seat is the grooved surface of the wheel that lies just inside the outer lip.",
        "It's where the edge of the tire sits once installed.",
        "Make sure you don’t measure the wheel’s outer lip by mistake.",
        "This will only tell you its overall diameter, which won’t match any of the standardized measurements used to manufacture trim rings."
    ]
}