{
    "title": "How to Operate a Nespresso Magimix",
    "url": "https://www.wikihow.com/Operate-a-Nespresso-Magimix",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Coffee",
        "Coffee Accessories"
    ],
    "methods": [
        {
            "name": "Making Coffee or Espresso",
            "steps": [
                {
                    "headline": "Fill the clear tank on the side of the machine halfway with water.",
                    "description": "The water tank is the clear cylinder on the side of the Magimix Nespresso machine. On some models, this water tank will be on the back of the machine. Open the lid on the top of this tank and fill it at least halfway with water.Tip: If there’s already water in the tank, you don’t need to fill it. However, you should replace the water if it has been sitting for more than 1-2 days. To do this, simply twist and lift the water tank out of the slot and pour the water out before refilling it. Then, slide the tank in and twist it until you hear a click. You can use standard tap water, bottled water, or purified water. While there’s nothing wrong with tap water, bottled or purified water will make better-tasting coffee!"
                },
                {
                    "headline": "Empty the pod receptacle by pulling the front of the machine out.",
                    "description": "The pod receptacle is located on the front of your machine, just under the spout where the coffee comes out. Grab this panel by its side and gently slide it out to access the pod receptacle. If it’s full of used pods, dump them in the trash or set them aside for recycling. If it isn’t full, you don’t need to empty it. Slide the panel back into the machine. The size of the receptacle is different depending on the model. The Nespresso pods are pretty small, so most machines can hold at least 10-15 pods. Empty the machine out every week to ensure that the receptacle doesn’t fill up and jam. When your machine is done brewing a cup of coffee or espresso, the pod automatically drops into the receptacle the next time you open the machine. If you can’t open the machine to put a pod in, it’s probably because the receptacle is full. If it’s jammed, you may need to use a bit of force to pull the receptacle out. This happens when the used pods overflow and block the front panel from opening."
                },
                {
                    "headline": "Turn the handle on the front of the machine up to open the machine.",
                    "description": "Grab the round metallic handle that loops around the front of the Magimix. Gently pull this handle up above the machine to access the slot where you put the pod in. When you pull this handle up, the front of the machine will extend out automatically."
                },
                {
                    "headline": "Drop a Nespresso pod sideways into the opening at the top.",
                    "description": "Grab the pod that you’re going to brew and hold it sideways so that the plastic top is facing the front of the machine. Drop it sideways into the pod-shaped opening at the top of the machine. This pod can get stuck if it doesn’t fall evenly, so check to make sure the pod is laying flat on its side before closing the machine. You can adjust the pod with your finger or a kitchen utensil if it isn’t laying perfectly in the slot. You can only put Nespresso pods in your Magimix. If you use some other kind of pod, it can jam inside the slot and damage your machine."
                },
                {
                    "headline": "Place your cup on the support platform under the metal spout.",
                    "description": "The support platform is the round piece sticking out at the bottom of the machine in the front. Your coffee will pour directly down from the spout to this platform. Set a regular coffee or espresso cup underneath the spout on this platform.Variation: If you’re using a small espresso cup, you can remove the support platform by sliding it out of the machine and reinserting it into the notches above it. This will reduce the amount of space between your cup and the spout of the machine, which will prevent splashing as your espresso pours."
                },
                {
                    "headline": "Close the front of the machine by pulling the handle back down.",
                    "description": "Grab the same handle that you used to open the slot for your pod. Pull this handle down until it snaps back into its original position to close the front of the machine. Don’t push directly on the compartment where the pod rests. If you do, you may damage the mechanism connecting the handle to the compartment."
                },
                {
                    "headline": "Press either of the 2 cup buttons on the top off the machine to turn it on.",
                    "description": "There is no power button on the Nespresso Magimix. To turn it on, press either of the buttons with cups on them. These buttons are located on top of the machine towards the back. They’re the only buttons on the machine, so they shouldn’t be too hard to find. When you press either button, they should both light up and begin blinking green. On some Magimix models, these buttons are on the side of the machine near the handle towards the front. If the buttons don’t light up, check to make sure that the machine is plugged in. If the buttons blink red, you need to reset the machine."
                },
                {
                    "headline": "Select the size of the cup you want to make by pressing the button.",
                    "description": "If you’re making an espresso or want a smaller, stronger cup of coffee, press the lungo button with the small cup on it. If you want a standard cup of coffee, press the button with the larger cup on it. The button with the large cup on it will produce roughly 3.75 fluid ounces (111 mL) of coffee. The lungo button will pour about 1.35 fluid ounces (40 mL) of coffee or espresso. The button with the smaller cup on it is called the lungo button. Lungo is the Italian word for long, and it refers to a small cup of espresso that uses twice as much water than a standard espresso."
                },
                {
                    "headline": "Wait 30-60 seconds for the water to heat up and brew your coffee.",
                    "description": "It takes a little while for the water to draw into the machine from the tank and heat up. Wait 30-60 seconds for the water to warm up fully. The coffee will automatically come out of the spout and fill your cup up.Warning: Avoid touching the body of the machine while It’s filling your cup. The machine may get quite hot."
                },
                {
                    "headline": "Leave the cup on the platform for 5-10 seconds to catch drips.",
                    "description": "Once the coffee or espresso is done pouring, leave the cup on the platform for a few seconds. Coffee machines tend to drip a little bit when they’re done brewing. You may end up with a few drops on your support platform if you remove the cup immediately. When picking your cup up, always grip it by the handle. The coffee in your cup is extremely hot and you may burn your hand. Reopen the cup slot when you’re done if you want to empty the pod and air the inside out. This isn’t mandatory, though."
                }
            ]
        },
        {
            "name": "Maintaining Your Machine",
            "steps": [
                {
                    "headline": "Rinse your water tank out every 1-2 weeks to remove mineral deposits.",
                    "description": "Every week or so, remove your water tank to rinse it out. Twist and lift it out of the machine and open the lid. Pour any water inside down the drain and give it a quick rinse to remove any residue inside. If the water tank is especially funky, you can fill it with white vinegar and let it soak for 5-10 minutes before pouring it out and rinsing it thoroughly. Unpurified water has minerals in it that can cling to the sides of the tank. Cleaning your water tank regularly will ensure that your coffee remains tasty and undiluted."
                },
                {
                    "headline": "Clean your machine every 3 months by descaling it with a cleaning solution.",
                    "description": "Fill your water tank up 2/3 of the way with water. Then, fill the remainder of the tank with a Nespresso descaling solution. You can use a white vinegar if you prefer. Hold down the 2 buttons on the top of the machine for 3 seconds to set it to descaling mode. Put a large cup under the spout and press the lungo button to run the cleaning solution through the machine. Do this 2-3 times to completely descale your Nespresso machine. Run a brewing cycle with clean water 2-3 times after descaling it to remove any cleaning solution stuck in your water lines."
                },
                {
                    "headline": "Reset the machine if it ever acts up by holding the lungo button down.",
                    "description": "If your machine isn’t working properly or you ever see the cup buttons light up red instead of green, reset the coffee maker. To do this, keep the handle in the down position. Press and hold the lungo button down for 5 seconds. The buttons will blink green 3 times to confirm that you’ve reset the machine.Tip: If the machine is still not brewing properly, try descaling using the process outlined above and reset it again. If it continues to act up, the machine may be permanently damaged."
                }
            ]
        }
    ],
    "tyn": [
        "Maintaining Your Machine",
        "Water",
        "Nespresso descaling solution",
        "White vinegar (optional)"
    ],
    "text": " Making Coffee or Espresso Fill the clear tank on the side of the machine halfway with water. The water tank is the clear cylinder on the side of the Magimix Nespresso machine. On some models, this water tank will be on the back of the machine. Open the lid on the top of this tank and fill it at least halfway with water.Tip: If there’s already water in the tank, you don’t need to fill it. However, you should replace the water if it has been sitting for more than 1-2 days. To do this, simply twist and lift the water tank out of the slot and pour the water out before refilling it. Then, slide the tank in and twist it until you hear a click. You can use standard tap water, bottled water, or purified water. While there’s nothing wrong with tap water, bottled or purified water will make better-tasting coffee! Empty the pod receptacle by pulling the front of the machine out. The pod receptacle is located on the front of your machine, just under the spout where the coffee comes out. Grab this panel by its side and gently slide it out to access the pod receptacle. If it’s full of used pods, dump them in the trash or set them aside for recycling. If it isn’t full, you don’t need to empty it. Slide the panel back into the machine. The size of the receptacle is different depending on the model. The Nespresso pods are pretty small, so most machines can hold at least 10-15 pods. Empty the machine out every week to ensure that the receptacle doesn’t fill up and jam. When your machine is done brewing a cup of coffee or espresso, the pod automatically drops into the receptacle the next time you open the machine. If you can’t open the machine to put a pod in, it’s probably because the receptacle is full. If it’s jammed, you may need to use a bit of force to pull the receptacle out. This happens when the used pods overflow and block the front panel from opening. Turn the handle on the front of the machine up to open the machine. Grab the round metallic handle that loops around the front of the Magimix. Gently pull this handle up above the machine to access the slot where you put the pod in. When you pull this handle up, the front of the machine will extend out automatically. Drop a Nespresso pod sideways into the opening at the top. Grab the pod that you’re going to brew and hold it sideways so that the plastic top is facing the front of the machine. Drop it sideways into the pod-shaped opening at the top of the machine. This pod can get stuck if it doesn’t fall evenly, so check to make sure the pod is laying flat on its side before closing the machine. You can adjust the pod with your finger or a kitchen utensil if it isn’t laying perfectly in the slot. You can only put Nespresso pods in your Magimix. If you use some other kind of pod, it can jam inside the slot and damage your machine. Place your cup on the support platform under the metal spout. The support platform is the round piece sticking out at the bottom of the machine in the front. Your coffee will pour directly down from the spout to this platform. Set a regular coffee or espresso cup underneath the spout on this platform.Variation: If you’re using a small espresso cup, you can remove the support platform by sliding it out of the machine and reinserting it into the notches above it. This will reduce the amount of space between your cup and the spout of the machine, which will prevent splashing as your espresso pours. Close the front of the machine by pulling the handle back down. Grab the same handle that you used to open the slot for your pod. Pull this handle down until it snaps back into its original position to close the front of the machine. Don’t push directly on the compartment where the pod rests. If you do, you may damage the mechanism connecting the handle to the compartment. Press either of the 2 cup buttons on the top off the machine to turn it on. There is no power button on the Nespresso Magimix. To turn it on, press either of the buttons with cups on them. These buttons are located on top of the machine towards the back. They’re the only buttons on the machine, so they shouldn’t be too hard to find. When you press either button, they should both light up and begin blinking green. On some Magimix models, these buttons are on the side of the machine near the handle towards the front. If the buttons don’t light up, check to make sure that the machine is plugged in. If the buttons blink red, you need to reset the machine. Select the size of the cup you want to make by pressing the button. If you’re making an espresso or want a smaller, stronger cup of coffee, press the lungo button with the small cup on it. If you want a standard cup of coffee, press the button with the larger cup on it. The button with the large cup on it will produce roughly 3.75 fluid ounces (111 mL) of coffee. The lungo button will pour about 1.35 fluid ounces (40 mL) of coffee or espresso. The button with the smaller cup on it is called the lungo button. Lungo is the Italian word for long, and it refers to a small cup of espresso that uses twice as much water than a standard espresso. Wait 30-60 seconds for the water to heat up and brew your coffee. It takes a little while for the water to draw into the machine from the tank and heat up. Wait 30-60 seconds for the water to warm up fully. The coffee will automatically come out of the spout and fill your cup up.Warning: Avoid touching the body of the machine while It’s filling your cup. The machine may get quite hot. Leave the cup on the platform for 5-10 seconds to catch drips. Once the coffee or espresso is done pouring, leave the cup on the platform for a few seconds. Coffee machines tend to drip a little bit when they’re done brewing. You may end up with a few drops on your support platform if you remove the cup immediately. When picking your cup up, always grip it by the handle. The coffee in your cup is extremely hot and you may burn your hand. Reopen the cup slot when you’re done if you want to empty the pod and air the inside out. This isn’t mandatory, though. Maintaining Your Machine Rinse your water tank out every 1-2 weeks to remove mineral deposits. Every week or so, remove your water tank to rinse it out. Twist and lift it out of the machine and open the lid. Pour any water inside down the drain and give it a quick rinse to remove any residue inside. If the water tank is especially funky, you can fill it with white vinegar and let it soak for 5-10 minutes before pouring it out and rinsing it thoroughly. Unpurified water has minerals in it that can cling to the sides of the tank. Cleaning your water tank regularly will ensure that your coffee remains tasty and undiluted. Clean your machine every 3 months by descaling it with a cleaning solution. Fill your water tank up 2/3 of the way with water. Then, fill the remainder of the tank with a Nespresso descaling solution. You can use a white vinegar if you prefer. Hold down the 2 buttons on the top of the machine for 3 seconds to set it to descaling mode. Put a large cup under the spout and press the lungo button to run the cleaning solution through the machine. Do this 2-3 times to completely descale your Nespresso machine. Run a brewing cycle with clean water 2-3 times after descaling it to remove any cleaning solution stuck in your water lines. Reset the machine if it ever acts up by holding the lungo button down. If your machine isn’t working properly or you ever see the cup buttons light up red instead of green, reset the coffee maker. To do this, keep the handle in the down position. Press and hold the lungo button down for 5 seconds. The buttons will blink green 3 times to confirm that you’ve reset the machine.Tip: If the machine is still not brewing properly, try descaling using the process outlined above and reset it again. If it continues to act up, the machine may be permanently damaged.",
    "sentences": [
        " Making Coffee or Espresso Fill the clear tank on the side of the machine halfway with water.",
        "The water tank is the clear cylinder on the side of the Magimix Nespresso machine.",
        "On some models, this water tank will be on the back of the machine.",
        "Open the lid on the top of this tank and fill it at least halfway with water.Tip: If there’s already water in the tank, you don’t need to fill it.",
        "However, you should replace the water if it has been sitting for more than 1-2 days.",
        "To do this, simply twist and lift the water tank out of the slot and pour the water out before refilling it.",
        "Then, slide the tank in and twist it until you hear a click.",
        "You can use standard tap water, bottled water, or purified water.",
        "While there’s nothing wrong with tap water, bottled or purified water will make better-tasting coffee!",
        "Empty the pod receptacle by pulling the front of the machine out.",
        "The pod receptacle is located on the front of your machine, just under the spout where the coffee comes out.",
        "Grab this panel by its side and gently slide it out to access the pod receptacle.",
        "If it’s full of used pods, dump them in the trash or set them aside for recycling.",
        "If it isn’t full, you don’t need to empty it.",
        "Slide the panel back into the machine.",
        "The size of the receptacle is different depending on the model.",
        "The Nespresso pods are pretty small, so most machines can hold at least 10-15 pods.",
        "Empty the machine out every week to ensure that the receptacle doesn’t fill up and jam.",
        "When your machine is done brewing a cup of coffee or espresso, the pod automatically drops into the receptacle the next time you open the machine.",
        "If you can’t open the machine to put a pod in, it’s probably because the receptacle is full.",
        "If it’s jammed, you may need to use a bit of force to pull the receptacle out.",
        "This happens when the used pods overflow and block the front panel from opening.",
        "Turn the handle on the front of the machine up to open the machine.",
        "Grab the round metallic handle that loops around the front of the Magimix.",
        "Gently pull this handle up above the machine to access the slot where you put the pod in.",
        "When you pull this handle up, the front of the machine will extend out automatically.",
        "Drop a Nespresso pod sideways into the opening at the top.",
        "Grab the pod that you’re going to brew and hold it sideways so that the plastic top is facing the front of the machine.",
        "Drop it sideways into the pod-shaped opening at the top of the machine.",
        "This pod can get stuck if it doesn’t fall evenly, so check to make sure the pod is laying flat on its side before closing the machine.",
        "You can adjust the pod with your finger or a kitchen utensil if it isn’t laying perfectly in the slot.",
        "You can only put Nespresso pods in your Magimix.",
        "If you use some other kind of pod, it can jam inside the slot and damage your machine.",
        "Place your cup on the support platform under the metal spout.",
        "The support platform is the round piece sticking out at the bottom of the machine in the front.",
        "Your coffee will pour directly down from the spout to this platform.",
        "Set a regular coffee or espresso cup underneath the spout on this platform.Variation: If you’re using a small espresso cup, you can remove the support platform by sliding it out of the machine and reinserting it into the notches above it.",
        "This will reduce the amount of space between your cup and the spout of the machine, which will prevent splashing as your espresso pours.",
        "Close the front of the machine by pulling the handle back down.",
        "Grab the same handle that you used to open the slot for your pod.",
        "Pull this handle down until it snaps back into its original position to close the front of the machine.",
        "Don’t push directly on the compartment where the pod rests.",
        "If you do, you may damage the mechanism connecting the handle to the compartment.",
        "Press either of the 2 cup buttons on the top off the machine to turn it on.",
        "There is no power button on the Nespresso Magimix.",
        "To turn it on, press either of the buttons with cups on them.",
        "These buttons are located on top of the machine towards the back.",
        "They’re the only buttons on the machine, so they shouldn’t be too hard to find.",
        "When you press either button, they should both light up and begin blinking green.",
        "On some Magimix models, these buttons are on the side of the machine near the handle towards the front.",
        "If the buttons don’t light up, check to make sure that the machine is plugged in.",
        "If the buttons blink red, you need to reset the machine.",
        "Select the size of the cup you want to make by pressing the button.",
        "If you’re making an espresso or want a smaller, stronger cup of coffee, press the lungo button with the small cup on it.",
        "If you want a standard cup of coffee, press the button with the larger cup on it.",
        "The button with the large cup on it will produce roughly 3.75 fluid ounces (111 mL) of coffee.",
        "The lungo button will pour about 1.35 fluid ounces (40 mL) of coffee or espresso.",
        "The button with the smaller cup on it is called the lungo button.",
        "Lungo is the Italian word for long, and it refers to a small cup of espresso that uses twice as much water than a standard espresso.",
        "Wait 30-60 seconds for the water to heat up and brew your coffee.",
        "It takes a little while for the water to draw into the machine from the tank and heat up.",
        "Wait 30-60 seconds for the water to warm up fully.",
        "The coffee will automatically come out of the spout and fill your cup up.Warning: Avoid touching the body of the machine while It’s filling your cup.",
        "The machine may get quite hot.",
        "Leave the cup on the platform for 5-10 seconds to catch drips.",
        "Once the coffee or espresso is done pouring, leave the cup on the platform for a few seconds.",
        "Coffee machines tend to drip a little bit when they’re done brewing.",
        "You may end up with a few drops on your support platform if you remove the cup immediately.",
        "When picking your cup up, always grip it by the handle.",
        "The coffee in your cup is extremely hot and you may burn your hand.",
        "Reopen the cup slot when you’re done if you want to empty the pod and air the inside out.",
        "This isn’t mandatory, though.",
        "Maintaining Your Machine Rinse your water tank out every 1-2 weeks to remove mineral deposits.",
        "Every week or so, remove your water tank to rinse it out.",
        "Twist and lift it out of the machine and open the lid.",
        "Pour any water inside down the drain and give it a quick rinse to remove any residue inside.",
        "If the water tank is especially funky, you can fill it with white vinegar and let it soak for 5-10 minutes before pouring it out and rinsing it thoroughly.",
        "Unpurified water has minerals in it that can cling to the sides of the tank.",
        "Cleaning your water tank regularly will ensure that your coffee remains tasty and undiluted.",
        "Clean your machine every 3 months by descaling it with a cleaning solution.",
        "Fill your water tank up 2/3 of the way with water.",
        "Then, fill the remainder of the tank with a Nespresso descaling solution.",
        "You can use a white vinegar if you prefer.",
        "Hold down the 2 buttons on the top of the machine for 3 seconds to set it to descaling mode.",
        "Put a large cup under the spout and press the lungo button to run the cleaning solution through the machine.",
        "Do this 2-3 times to completely descale your Nespresso machine.",
        "Run a brewing cycle with clean water 2-3 times after descaling it to remove any cleaning solution stuck in your water lines.",
        "Reset the machine if it ever acts up by holding the lungo button down.",
        "If your machine isn’t working properly or you ever see the cup buttons light up red instead of green, reset the coffee maker.",
        "To do this, keep the handle in the down position.",
        "Press and hold the lungo button down for 5 seconds.",
        "The buttons will blink green 3 times to confirm that you’ve reset the machine.Tip: If the machine is still not brewing properly, try descaling using the process outlined above and reset it again.",
        "If it continues to act up, the machine may be permanently damaged."
    ]
}