{
    "title": "How to Remove Pilling from Wool",
    "url": "https://www.wikihow.com/Remove-Pilling-from-Wool",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Decoration Projects"
    ],
    "methods": [
        {
            "name": "Cutting off Minor Pilling",
            "steps": [
                {
                    "headline": "Snip off pilling just after drying to prevent more buildup.",
                    "description": "This method is time-consuming if there is a lot of pilling, so prevent further pilling from forming. Pilling usually builds up in the dryer, so check the clothes each time you dry them. If you see any pilled spots, snip them off before they get worse."
                },
                {
                    "headline": "Lay the garment flat and pull it taut.",
                    "description": "Take your wool item and place it down on a flat surface. Spread it out and pull the sides so the garment is taut. Don’t pull the garment so tight that it stretches out. Just make sure the surface is flat and free of wrinkling. If you have a big item like a blanket, the entire piece doesn’t have to be tight at the same time. Work in smaller sections that fit on the surface you're using."
                },
                {
                    "headline": "Pull the pilling up away from the fabric.",
                    "description": "Take the pilling between your fingers and pull it up. Stop pulling when the fabric starts lifting up. Don’t pull so hard that you start stretching the fabric. Just pull the pills up as far as you can without the fabric stretching. This method works best if there aren’t many pills on the wool. For items with a lot of pilling, this will be time-consuming."
                },
                {
                    "headline": "Cut the pilling as close to the garment as you can.",
                    "description": "Take a sharp pair of scissors and bring them as close to the garment as possible without touching it. Then snip the pilling off at that level. Be very careful when cutting. If you’re too close to the garment, you could cut it as well. If the pilling won’t cut, try using a sharper scissor or sharpening the one you’re using."
                },
                {
                    "headline": "Continue cutting until all the pilling is removed.",
                    "description": "Work around the sweater using the same procedure. Pinch the pilling and pull it up, then snip it off close to the fabric surface. Continue until you’ve removed all the pilling. If you start using this method and feel like it’s taking too long, you can always switch to another one."
                }
            ]
        },
        {
            "name": "Combing the Pills Out",
            "steps": [
                {
                    "headline": "Get a small comb designed for de-pilling.",
                    "description": "These combs have small teeth designed to work out pilling. If your garment has a lot of pilling on it, then using a comb is much faster than cutting the pills off individually. You can find these combs at fabric stores or online. Any small comb, like a flea or lice comb, will also work. Make sure anything you use has small teeth that are close together so they work out the pilling."
                },
                {
                    "headline": "Lay the garment on a flat surface.",
                    "description": "Take the garment to a flat, firm surface like a table. Spread it out and pull the sides gently so it’s taut. Remember to avoid stretching the garment out when you pull it taut. Pull it lightly just so the surface is flat and wrinkle-free. Make sure any surface you work on is dry and clean before placing the wool down."
                },
                {
                    "headline": "Run the brush across the pills until they’re gone.",
                    "description": "Press down on the fabric with your free hand so it doesn’t move. Then scrape across the pilled areas with a smooth, gentle motion. You may have to work some spots multiple times until the pilling works out. If the comb gets stuck, don’t yank it. This could stretch out the fabric. Pull the pills out of its teeth and work at it against from a different angle."
                },
                {
                    "headline": "Work across the entire garment to remove all the pilling.",
                    "description": "Continue the process to get rid of all the pilling on your piece of wool. Remember to use a smooth motion and avoid yanking the comb hard. Comb with light, even strokes."
                }
            ]
        },
        {
            "name": "Shaving the Pills Off",
            "steps": [
                {
                    "headline": "Pull the piece taut on a flat surface.",
                    "description": "Bring the garment to a table or similar flat surface. Press it down flat, and then pull it so the piece is taut. Make sure the table is firm and not wobbly. If it moves while you're working, you could cut the garment. Remember not to pull too hard or you might stretch the fabric out."
                },
                {
                    "headline": "Scrape a disposable razor across all the pilled sections.",
                    "description": "Press the razor down lightly on the pilled sections. Scrape in one direction across the spot until the pilling comes off. Work around the entire piece until all the pilling is gone. Don't press down too hard. If you apply too much pressure, you could cut the fabric along with the pilling. If you have an electric beard trimmer, this will work as well."
                },
                {
                    "headline": "Remove any leftover fuzz with a lint brush.",
                    "description": "Follow-up the razor treatment with a lint brush. This removes any excess pilling that's left behind. Run the brush around the fabric until all the excess fuzz is gone."
                }
            ]
        },
        {
            "name": "Using a De-Piller",
            "steps": [
                {
                    "headline": "Get a de-piller from a home goods store or online.",
                    "description": "De-pillers are battery-powered devices designed for getting pills off of fabric. You can find them in department or home goods stores, or order one online. While de-pillers are more expensive than combs, you can still find them online for less than $10. If you have a lot of wool items, this would be a good investment. Some de-pillers come with different attachments for different fabrics. If yours comes with these attachments, use the one designed for wool."
                },
                {
                    "headline": "Place the garment down flat and pull it taut.",
                    "description": "Take the garment to a flat, firm surface like a table. Spread it out and pull the sides gently so it’s taut. Remember to avoid stretching the garment out when you pull it taut. Pull it lightly just so the surface is flat and wrinkle-free."
                },
                {
                    "headline": "Turn the de-piller on.",
                    "description": "Look for a switch or a button on the device. Switch it on before rubbing it against the wool. If the device won’t turn on, replace the batteries. They usually take AA or AAA batteries. Make sure you put the batteries in the right way. Different devices might have different directions. Check the instructions on any product you use for the correct procedure."
                },
                {
                    "headline": "Work over pilling in a circular motion.",
                    "description": "Press the device down against a pilled area and rub in a circular motion. Continue until the pilling disappears. Continue doing this across the whole piece to remove all the pilling. The lint compartment might fill up while you’re working. If it does, open it up and empty it into the garbage can. Clip it back on and continue working. De-pillers usually work on other fabrics, as well as furniture. Try removing pilling from your whole wardrobe if you get one."
                }
            ]
        }
    ],
    "tyn": [
        "Scissors",
        "Disposable razor",
        "Lint brush",
        "Small comb",
        "De-piller"
    ],
    "text": " Cutting off Minor Pilling Snip off pilling just after drying to prevent more buildup. This method is time-consuming if there is a lot of pilling, so prevent further pilling from forming. Pilling usually builds up in the dryer, so check the clothes each time you dry them. If you see any pilled spots, snip them off before they get worse. Lay the garment flat and pull it taut. Take your wool item and place it down on a flat surface. Spread it out and pull the sides so the garment is taut. Don’t pull the garment so tight that it stretches out. Just make sure the surface is flat and free of wrinkling. If you have a big item like a blanket, the entire piece doesn’t have to be tight at the same time. Work in smaller sections that fit on the surface you're using. Pull the pilling up away from the fabric. Take the pilling between your fingers and pull it up. Stop pulling when the fabric starts lifting up. Don’t pull so hard that you start stretching the fabric. Just pull the pills up as far as you can without the fabric stretching. This method works best if there aren’t many pills on the wool. For items with a lot of pilling, this will be time-consuming. Cut the pilling as close to the garment as you can. Take a sharp pair of scissors and bring them as close to the garment as possible without touching it. Then snip the pilling off at that level. Be very careful when cutting. If you’re too close to the garment, you could cut it as well. If the pilling won’t cut, try using a sharper scissor or sharpening the one you’re using. Continue cutting until all the pilling is removed. Work around the sweater using the same procedure. Pinch the pilling and pull it up, then snip it off close to the fabric surface. Continue until you’ve removed all the pilling. If you start using this method and feel like it’s taking too long, you can always switch to another one. Combing the Pills Out Get a small comb designed for de-pilling. These combs have small teeth designed to work out pilling. If your garment has a lot of pilling on it, then using a comb is much faster than cutting the pills off individually. You can find these combs at fabric stores or online. Any small comb, like a flea or lice comb, will also work. Make sure anything you use has small teeth that are close together so they work out the pilling. Lay the garment on a flat surface. Take the garment to a flat, firm surface like a table. Spread it out and pull the sides gently so it’s taut. Remember to avoid stretching the garment out when you pull it taut. Pull it lightly just so the surface is flat and wrinkle-free. Make sure any surface you work on is dry and clean before placing the wool down. Run the brush across the pills until they’re gone. Press down on the fabric with your free hand so it doesn’t move. Then scrape across the pilled areas with a smooth, gentle motion. You may have to work some spots multiple times until the pilling works out. If the comb gets stuck, don’t yank it. This could stretch out the fabric. Pull the pills out of its teeth and work at it against from a different angle. Work across the entire garment to remove all the pilling. Continue the process to get rid of all the pilling on your piece of wool. Remember to use a smooth motion and avoid yanking the comb hard. Comb with light, even strokes. Shaving the Pills Off Pull the piece taut on a flat surface. Bring the garment to a table or similar flat surface. Press it down flat, and then pull it so the piece is taut. Make sure the table is firm and not wobbly. If it moves while you're working, you could cut the garment. Remember not to pull too hard or you might stretch the fabric out. Scrape a disposable razor across all the pilled sections. Press the razor down lightly on the pilled sections. Scrape in one direction across the spot until the pilling comes off. Work around the entire piece until all the pilling is gone. Don't press down too hard. If you apply too much pressure, you could cut the fabric along with the pilling. If you have an electric beard trimmer, this will work as well. Remove any leftover fuzz with a lint brush. Follow-up the razor treatment with a lint brush. This removes any excess pilling that's left behind. Run the brush around the fabric until all the excess fuzz is gone. Using a De-Piller Get a de-piller from a home goods store or online. De-pillers are battery-powered devices designed for getting pills off of fabric. You can find them in department or home goods stores, or order one online. While de-pillers are more expensive than combs, you can still find them online for less than $10. If you have a lot of wool items, this would be a good investment. Some de-pillers come with different attachments for different fabrics. If yours comes with these attachments, use the one designed for wool. Place the garment down flat and pull it taut. Take the garment to a flat, firm surface like a table. Spread it out and pull the sides gently so it’s taut. Remember to avoid stretching the garment out when you pull it taut. Pull it lightly just so the surface is flat and wrinkle-free. Turn the de-piller on. Look for a switch or a button on the device. Switch it on before rubbing it against the wool. If the device won’t turn on, replace the batteries. They usually take AA or AAA batteries. Make sure you put the batteries in the right way. Different devices might have different directions. Check the instructions on any product you use for the correct procedure. Work over pilling in a circular motion. Press the device down against a pilled area and rub in a circular motion. Continue until the pilling disappears. Continue doing this across the whole piece to remove all the pilling. The lint compartment might fill up while you’re working. If it does, open it up and empty it into the garbage can. Clip it back on and continue working. De-pillers usually work on other fabrics, as well as furniture. Try removing pilling from your whole wardrobe if you get one.",
    "sentences": [
        " Cutting off Minor Pilling Snip off pilling just after drying to prevent more buildup.",
        "This method is time-consuming if there is a lot of pilling, so prevent further pilling from forming.",
        "Pilling usually builds up in the dryer, so check the clothes each time you dry them.",
        "If you see any pilled spots, snip them off before they get worse.",
        "Lay the garment flat and pull it taut.",
        "Take your wool item and place it down on a flat surface.",
        "Spread it out and pull the sides so the garment is taut.",
        "Don’t pull the garment so tight that it stretches out.",
        "Just make sure the surface is flat and free of wrinkling.",
        "If you have a big item like a blanket, the entire piece doesn’t have to be tight at the same time.",
        "Work in smaller sections that fit on the surface you're using.",
        "Pull the pilling up away from the fabric.",
        "Take the pilling between your fingers and pull it up.",
        "Stop pulling when the fabric starts lifting up.",
        "Don’t pull so hard that you start stretching the fabric.",
        "Just pull the pills up as far as you can without the fabric stretching.",
        "This method works best if there aren’t many pills on the wool.",
        "For items with a lot of pilling, this will be time-consuming.",
        "Cut the pilling as close to the garment as you can.",
        "Take a sharp pair of scissors and bring them as close to the garment as possible without touching it.",
        "Then snip the pilling off at that level.",
        "Be very careful when cutting.",
        "If you’re too close to the garment, you could cut it as well.",
        "If the pilling won’t cut, try using a sharper scissor or sharpening the one you’re using.",
        "Continue cutting until all the pilling is removed.",
        "Work around the sweater using the same procedure.",
        "Pinch the pilling and pull it up, then snip it off close to the fabric surface.",
        "Continue until you’ve removed all the pilling.",
        "If you start using this method and feel like it’s taking too long, you can always switch to another one.",
        "Combing the Pills Out Get a small comb designed for de-pilling.",
        "These combs have small teeth designed to work out pilling.",
        "If your garment has a lot of pilling on it, then using a comb is much faster than cutting the pills off individually.",
        "You can find these combs at fabric stores or online.",
        "Any small comb, like a flea or lice comb, will also work.",
        "Make sure anything you use has small teeth that are close together so they work out the pilling.",
        "Lay the garment on a flat surface.",
        "Take the garment to a flat, firm surface like a table.",
        "Spread it out and pull the sides gently so it’s taut.",
        "Remember to avoid stretching the garment out when you pull it taut.",
        "Pull it lightly just so the surface is flat and wrinkle-free.",
        "Make sure any surface you work on is dry and clean before placing the wool down.",
        "Run the brush across the pills until they’re gone.",
        "Press down on the fabric with your free hand so it doesn’t move.",
        "Then scrape across the pilled areas with a smooth, gentle motion.",
        "You may have to work some spots multiple times until the pilling works out.",
        "If the comb gets stuck, don’t yank it.",
        "This could stretch out the fabric.",
        "Pull the pills out of its teeth and work at it against from a different angle.",
        "Work across the entire garment to remove all the pilling.",
        "Continue the process to get rid of all the pilling on your piece of wool.",
        "Remember to use a smooth motion and avoid yanking the comb hard.",
        "Comb with light, even strokes.",
        "Shaving the Pills Off Pull the piece taut on a flat surface.",
        "Bring the garment to a table or similar flat surface.",
        "Press it down flat, and then pull it so the piece is taut.",
        "Make sure the table is firm and not wobbly.",
        "If it moves while you're working, you could cut the garment.",
        "Remember not to pull too hard or you might stretch the fabric out.",
        "Scrape a disposable razor across all the pilled sections.",
        "Press the razor down lightly on the pilled sections.",
        "Scrape in one direction across the spot until the pilling comes off.",
        "Work around the entire piece until all the pilling is gone.",
        "Don't press down too hard.",
        "If you apply too much pressure, you could cut the fabric along with the pilling.",
        "If you have an electric beard trimmer, this will work as well.",
        "Remove any leftover fuzz with a lint brush.",
        "Follow-up the razor treatment with a lint brush.",
        "This removes any excess pilling that's left behind.",
        "Run the brush around the fabric until all the excess fuzz is gone.",
        "Using a De-Piller Get a de-piller from a home goods store or online.",
        "De-pillers are battery-powered devices designed for getting pills off of fabric.",
        "You can find them in department or home goods stores, or order one online.",
        "While de-pillers are more expensive than combs, you can still find them online for less than $10.",
        "If you have a lot of wool items, this would be a good investment.",
        "Some de-pillers come with different attachments for different fabrics.",
        "If yours comes with these attachments, use the one designed for wool.",
        "Place the garment down flat and pull it taut.",
        "Take the garment to a flat, firm surface like a table.",
        "Spread it out and pull the sides gently so it’s taut.",
        "Remember to avoid stretching the garment out when you pull it taut.",
        "Pull it lightly just so the surface is flat and wrinkle-free.",
        "Turn the de-piller on.",
        "Look for a switch or a button on the device.",
        "Switch it on before rubbing it against the wool.",
        "If the device won’t turn on, replace the batteries.",
        "They usually take AA or AAA batteries.",
        "Make sure you put the batteries in the right way.",
        "Different devices might have different directions.",
        "Check the instructions on any product you use for the correct procedure.",
        "Work over pilling in a circular motion.",
        "Press the device down against a pilled area and rub in a circular motion.",
        "Continue until the pilling disappears.",
        "Continue doing this across the whole piece to remove all the pilling.",
        "The lint compartment might fill up while you’re working.",
        "If it does, open it up and empty it into the garbage can.",
        "Clip it back on and continue working.",
        "De-pillers usually work on other fabrics, as well as furniture.",
        "Try removing pilling from your whole wardrobe if you get one."
    ]
}