{
    "title": "How to Use a Bamboo Steamer Basket",
    "url": "https://www.wikihow.com/Use-a-Bamboo-Steamer-Basket",
    "category_hierarchy": [
        "Health",
        "Nutrition and Food Health",
        "Health Food Trends"
    ],
    "parts": [
        {
            "name": "Filling and Stacking the Basket Tiers",
            "steps": [
                {
                    "headline": "Soak the steamer in cool water for 5 minutes before using it if it's new.",
                    "description": "Place the bamboo steamer in cool water, then rinse it quickly before using it for the first time. This removes any oils or odors leftover from the manufacturing process. You can do this quick soak before every use if you wish, but it's not absolutely necessary. Some bamboo steamer basket aficionados believe in giving it a pre-soak each time before cooking, while others think it’s unnecessary. Pre-soak supporters believe it helps the basket steam better and last longer. Check the product guide to see if the manufacturer recommends pre-soaking. Never soak the basket for more than 5 minutes. Bamboo is very porous and is prone to cracking if it soaks up too much water and then dries out."
                },
                {
                    "headline": "Line each basket tier you’re using with leafy greens or parchment.",
                    "description": "Bamboo steamer baskets utilize multiple stackable tiers that allow steam to travel up through each layer of food. Depending on your recipe, you may only need to use 1 tier, or perhaps 3 or 4. In any case, line the bottom of each basket tier with a layer of large lettuce leaves or cabbage leaves, or cut sheets of parchment paper to fit. You can also use pre-cut parchment paper rounds that are made to fit common steamer basket sizes. Using a liner makes cleanup much easier!"
                },
                {
                    "headline": "Chop food into uniform pieces and space them evenly in a single layer.",
                    "description": "Your food won’t cook properly if you crowd the basket tiers so much that steam can’t rise up through them. Prepare only as much food as you can fit in single layers while maintaining proper spacing. Foods that expand (like dumplings) need at least 2.5 cm (0.98 in) spacing, while other foods need at least 1 cm (0.39 in) spacing. Additionally, cut dense foods (like root vegetables) and foods that require longer cooking times (like cuts of pork, beef, or chicken) into equal-sized pieces no more than 2.5 cm (0.98 in) thick."
                },
                {
                    "headline": "Separate meat and seafood from veggies and use the bottom tier.",
                    "description": "Always place meats like beef, pork, and poultry in a meat-only tier, and put this tier at the bottom of the stack (closest to the steam source). Similarly, put fish and other seafood in its own tier and place it at or near the bottom of the stack, unless your recipe directs otherwise. Putting meats at the bottom helps ensure that they achieve a safe internal temperature. Chicken, for example, should reach 74 °C (165 °F)."
                },
                {
                    "headline": "Distribute veggies and tofu in the mid-to-top tiers based on size.",
                    "description": "Separate vegetables into tiers based on thickness and density—carrots and potatoes have similar “steaming profiles” and can be put in one tier near the middle of the stack. Meanwhile, green beans and bell pepper strips should be put in a different tier closer to the top of the stack. Tofu can be added to the same tier as thicker vegetables."
                },
                {
                    "headline": "Put dumplings or pre-soaked rice in a middle tier by itself.",
                    "description": "The ideal tier placement and cooking time for dumplings varies based on the filling, so follow your recipe's guidance. Dumplings with raw meat fillings, for instance, will likely need to be placed in a lower position in the tier stack. Pre-soaked but uncooked rice is typically placed near the middle of the stack of basket tiers, while cooked rice that only needs to be reheated should be placed in the top tier. Your complete stack of tiers, for example, might resemble the following:\nA tier of cubed pork at the bottom. A tier of dumplings stacked above that. A tier of broccoli florets placed above that. A tier of cooked rice that just needs re-heated at the top."
                }
            ]
        },
        {
            "name": "Steaming Your Food",
            "steps": [
                {
                    "headline": "Add about 5 cm (2.0 in) of water to a shallow pan.",
                    "description": "Choose a pan that’s around 7–10 cm (2.8–3.9 in) deep and holds the steamer basket snugly in place. Pour at least 3 cm (1.2 in) but not more than 6 cm (2.4 in) of water into the pan—you need enough water so that it doesn’t all evaporate, but not so much that it submerges the food in the bottom basket tier. A wok is a traditional and ideal option here, but any shallow pan with sloped sides is a great choice. Sloped sides keep the bamboo basket slightly raised above both the water in the pan and the surface of the pan itself. This improves steaming performance and prevents your basket from scorching on the bottom."
                },
                {
                    "headline": "Place the pan over medium heat until the water comes to a simmer.",
                    "description": "You’re not aiming for a full boil here, which happens when bubbles are rapidly forming and bursting at the surface. Instead, watch for the water to start gently bubbling, with frequent but individual bubbles popping at the water’s surface without agitating it much if at all. Back the heat down to medium-low once you reach a good simmer. Every stove is different, so it may take some trial-and-error to figure out the best heat settings in your case."
                },
                {
                    "headline": "Put the steamer in the pan and add either its own cover or the pan’s lid.",
                    "description": "Bamboo steamers come with a woven lid that fits snugly on whichever tier you have on top, so use it in most cases. If you’re only steaming a single basket tier, it may be possible—if you wish—to just use the pan’s lid to cover the basket. Using the pan’s lid may slow the evaporation of the water slightly, but the difference is usually negligible."
                },
                {
                    "headline": "Allow the food to steam until it’s done to your liking.",
                    "description": "In general, meats take around 20-30 minutes to cook through, seafood and dumplings (a bamboo steamer specialty!) take around 10-15 minutes, and veggies take about 5-10 minutes. Keep the lid on until you approach the expected cooking time, and put it back on right away if the food isn’t ready yet. Cook veggies until they are heated and tender to your liking. Use a kitchen thermometer to make sure meats are cooked to a safe temperature—for example, cook pork to 63 °C (145 °F)."
                },
                {
                    "headline": "Check the water level under the basket if you’re cooking for 10+ minutes.",
                    "description": "If you’re cooking some veggies quickly, don’t worry about the water evaporating. After about 10 minutes of cooking, though, carefully lift the entire basket out of the pan and make sure there is at least 2.5 cm (0.98 in) of water in the bottom. If there is, put the basket back in place and check again every 5 minutes. If the pan is low on water, add more until it’s back to its starting depth. Turn the heat on the stove up slightly—for instance, halfway between medium-low and medium—for 2-4 minutes to bring the water back up to a simmer. Use heat-resistant gloves to lift the steamer out of the pan."
                },
                {
                    "headline": "Remove the steamer from the heat and the food from the steamer.",
                    "description": "When the food is cooked through, turn off the stove and use your heat-resistant gloves to lift the entire steamer out of the pan. Separate the different tiers and use tongs or chopsticks to transfer the food to a serving dish. Alternatively, you can serve the food straight from the steamer basket tiers."
                }
            ]
        },
        {
            "name": "Cleaning Your Bamboo Steamer",
            "steps": [
                {
                    "headline": "Rinse the steamer under warm water for a quick cleaning.",
                    "description": "Especially if you used leaves or parchment paper as a liner, a quick rinse is often all that’s needed to clean your bamboo steamer. If there are some stuck-on bits of food, soak the basket in hot water for up to 5 minutes, then rinse it clean. Resist the urge to pop the steamer basket into the dishwasher for hands-off cleaning. While some bamboo steamer baskets are marketed as dishwasher-safe, the high heat and detergent used in a dishwasher may reduce the performance and lifespan of your steamer."
                },
                {
                    "headline": "Wipe away stuck food bits with a nylon scrubber if necessary.",
                    "description": "If rinsing alone, or soaking and then rinsing, don’t remove all the food bits from the steamer, it’s time to use some elbow grease! Never use steel wool or a bristled scrub brush, though—instead, use a scrubber made of nylon. That way, you won’t damage the bamboo while removing the food residue. Use only warm water while scrubbing—skip the dish soap. Bamboo is very porous and will soak up the scent (and possibly the chemicals) in the soap, meaning your next batch of dumplings may taste a bit soapy!"
                },
                {
                    "headline": "Turn to a tea bag or a lemon to get rid of odors in the basket.",
                    "description": "If you steamed seafood and your basket still has a fishy scent after you clean it, cut a lemon in half and rub the cut side all over the steamer. Or, soak a black tea bag in warm water for 1-2 minutes, then gently rub it over the steamer."
                },
                {
                    "headline": "Wipe cooking oil on the steamer basket after it air dries.",
                    "description": "Once you’re finished cleaning and (if needed) deodorizing the steamer, leave it on a drying rack until all surface moisture is gone. Then, dip a clean cloth or folded-up paper towel into a dish of cooking oil and wipe a thin layer over all surfaces of the bamboo steamer. Return the basket to the drying rack and allow it to dry completely before putting it away. Oiling the bamboo may help keep it from drying out and cracking. Not all bamboo steamer lovers think oiling is necessary, though, so this is an optional step. Any cooking oil will work, but an oil with a mild flavor—such as canola oil—is less likely to impart any unwanted flavors on your next dish."
                }
            ]
        }
    ],
    "tyn": [
        "Bamboo steamer basket with included lid",
        "Wok or shallow pan with sloped sides",
        "Heat-resistant kitchen gloves",
        "Nylon scrubber"
    ],
    "text": " Filling and Stacking the Basket Tiers Soak the steamer in cool water for 5 minutes before using it if it's new. Place the bamboo steamer in cool water, then rinse it quickly before using it for the first time. This removes any oils or odors leftover from the manufacturing process. You can do this quick soak before every use if you wish, but it's not absolutely necessary. Some bamboo steamer basket aficionados believe in giving it a pre-soak each time before cooking, while others think it’s unnecessary. Pre-soak supporters believe it helps the basket steam better and last longer. Check the product guide to see if the manufacturer recommends pre-soaking. Never soak the basket for more than 5 minutes. Bamboo is very porous and is prone to cracking if it soaks up too much water and then dries out. Line each basket tier you’re using with leafy greens or parchment. Bamboo steamer baskets utilize multiple stackable tiers that allow steam to travel up through each layer of food. Depending on your recipe, you may only need to use 1 tier, or perhaps 3 or 4. In any case, line the bottom of each basket tier with a layer of large lettuce leaves or cabbage leaves, or cut sheets of parchment paper to fit. You can also use pre-cut parchment paper rounds that are made to fit common steamer basket sizes. Using a liner makes cleanup much easier! Chop food into uniform pieces and space them evenly in a single layer. Your food won’t cook properly if you crowd the basket tiers so much that steam can’t rise up through them. Prepare only as much food as you can fit in single layers while maintaining proper spacing. Foods that expand (like dumplings) need at least 2.5 cm (0.98 in) spacing, while other foods need at least 1 cm (0.39 in) spacing. Additionally, cut dense foods (like root vegetables) and foods that require longer cooking times (like cuts of pork, beef, or chicken) into equal-sized pieces no more than 2.5 cm (0.98 in) thick. Separate meat and seafood from veggies and use the bottom tier. Always place meats like beef, pork, and poultry in a meat-only tier, and put this tier at the bottom of the stack (closest to the steam source). Similarly, put fish and other seafood in its own tier and place it at or near the bottom of the stack, unless your recipe directs otherwise. Putting meats at the bottom helps ensure that they achieve a safe internal temperature. Chicken, for example, should reach 74 °C (165 °F). Distribute veggies and tofu in the mid-to-top tiers based on size. Separate vegetables into tiers based on thickness and density—carrots and potatoes have similar “steaming profiles” and can be put in one tier near the middle of the stack. Meanwhile, green beans and bell pepper strips should be put in a different tier closer to the top of the stack. Tofu can be added to the same tier as thicker vegetables. Put dumplings or pre-soaked rice in a middle tier by itself. The ideal tier placement and cooking time for dumplings varies based on the filling, so follow your recipe's guidance. Dumplings with raw meat fillings, for instance, will likely need to be placed in a lower position in the tier stack. Pre-soaked but uncooked rice is typically placed near the middle of the stack of basket tiers, while cooked rice that only needs to be reheated should be placed in the top tier. Your complete stack of tiers, for example, might resemble the following:\nA tier of cubed pork at the bottom. A tier of dumplings stacked above that. A tier of broccoli florets placed above that. A tier of cooked rice that just needs re-heated at the top. Steaming Your Food Add about 5 cm (2.0 in) of water to a shallow pan. Choose a pan that’s around 7–10 cm (2.8–3.9 in) deep and holds the steamer basket snugly in place. Pour at least 3 cm (1.2 in) but not more than 6 cm (2.4 in) of water into the pan—you need enough water so that it doesn’t all evaporate, but not so much that it submerges the food in the bottom basket tier. A wok is a traditional and ideal option here, but any shallow pan with sloped sides is a great choice. Sloped sides keep the bamboo basket slightly raised above both the water in the pan and the surface of the pan itself. This improves steaming performance and prevents your basket from scorching on the bottom. Place the pan over medium heat until the water comes to a simmer. You’re not aiming for a full boil here, which happens when bubbles are rapidly forming and bursting at the surface. Instead, watch for the water to start gently bubbling, with frequent but individual bubbles popping at the water’s surface without agitating it much if at all. Back the heat down to medium-low once you reach a good simmer. Every stove is different, so it may take some trial-and-error to figure out the best heat settings in your case. Put the steamer in the pan and add either its own cover or the pan’s lid. Bamboo steamers come with a woven lid that fits snugly on whichever tier you have on top, so use it in most cases. If you’re only steaming a single basket tier, it may be possible—if you wish—to just use the pan’s lid to cover the basket. Using the pan’s lid may slow the evaporation of the water slightly, but the difference is usually negligible. Allow the food to steam until it’s done to your liking. In general, meats take around 20-30 minutes to cook through, seafood and dumplings (a bamboo steamer specialty!) take around 10-15 minutes, and veggies take about 5-10 minutes. Keep the lid on until you approach the expected cooking time, and put it back on right away if the food isn’t ready yet. Cook veggies until they are heated and tender to your liking. Use a kitchen thermometer to make sure meats are cooked to a safe temperature—for example, cook pork to 63 °C (145 °F). Check the water level under the basket if you’re cooking for 10+ minutes. If you’re cooking some veggies quickly, don’t worry about the water evaporating. After about 10 minutes of cooking, though, carefully lift the entire basket out of the pan and make sure there is at least 2.5 cm (0.98 in) of water in the bottom. If there is, put the basket back in place and check again every 5 minutes. If the pan is low on water, add more until it’s back to its starting depth. Turn the heat on the stove up slightly—for instance, halfway between medium-low and medium—for 2-4 minutes to bring the water back up to a simmer. Use heat-resistant gloves to lift the steamer out of the pan. Remove the steamer from the heat and the food from the steamer. When the food is cooked through, turn off the stove and use your heat-resistant gloves to lift the entire steamer out of the pan. Separate the different tiers and use tongs or chopsticks to transfer the food to a serving dish. Alternatively, you can serve the food straight from the steamer basket tiers. Cleaning Your Bamboo Steamer Rinse the steamer under warm water for a quick cleaning. Especially if you used leaves or parchment paper as a liner, a quick rinse is often all that’s needed to clean your bamboo steamer. If there are some stuck-on bits of food, soak the basket in hot water for up to 5 minutes, then rinse it clean. Resist the urge to pop the steamer basket into the dishwasher for hands-off cleaning. While some bamboo steamer baskets are marketed as dishwasher-safe, the high heat and detergent used in a dishwasher may reduce the performance and lifespan of your steamer. Wipe away stuck food bits with a nylon scrubber if necessary. If rinsing alone, or soaking and then rinsing, don’t remove all the food bits from the steamer, it’s time to use some elbow grease! Never use steel wool or a bristled scrub brush, though—instead, use a scrubber made of nylon. That way, you won’t damage the bamboo while removing the food residue. Use only warm water while scrubbing—skip the dish soap. Bamboo is very porous and will soak up the scent (and possibly the chemicals) in the soap, meaning your next batch of dumplings may taste a bit soapy! Turn to a tea bag or a lemon to get rid of odors in the basket. If you steamed seafood and your basket still has a fishy scent after you clean it, cut a lemon in half and rub the cut side all over the steamer. Or, soak a black tea bag in warm water for 1-2 minutes, then gently rub it over the steamer. Wipe cooking oil on the steamer basket after it air dries. Once you’re finished cleaning and (if needed) deodorizing the steamer, leave it on a drying rack until all surface moisture is gone. Then, dip a clean cloth or folded-up paper towel into a dish of cooking oil and wipe a thin layer over all surfaces of the bamboo steamer. Return the basket to the drying rack and allow it to dry completely before putting it away. Oiling the bamboo may help keep it from drying out and cracking. Not all bamboo steamer lovers think oiling is necessary, though, so this is an optional step. Any cooking oil will work, but an oil with a mild flavor—such as canola oil—is less likely to impart any unwanted flavors on your next dish.",
    "sentences": [
        " Filling and Stacking the Basket Tiers Soak the steamer in cool water for 5 minutes before using it if it's new.",
        "Place the bamboo steamer in cool water, then rinse it quickly before using it for the first time.",
        "This removes any oils or odors leftover from the manufacturing process.",
        "You can do this quick soak before every use if you wish, but it's not absolutely necessary.",
        "Some bamboo steamer basket aficionados believe in giving it a pre-soak each time before cooking, while others think it’s unnecessary.",
        "Pre-soak supporters believe it helps the basket steam better and last longer.",
        "Check the product guide to see if the manufacturer recommends pre-soaking.",
        "Never soak the basket for more than 5 minutes.",
        "Bamboo is very porous and is prone to cracking if it soaks up too much water and then dries out.",
        "Line each basket tier you’re using with leafy greens or parchment.",
        "Bamboo steamer baskets utilize multiple stackable tiers that allow steam to travel up through each layer of food.",
        "Depending on your recipe, you may only need to use 1 tier, or perhaps 3 or 4.",
        "In any case, line the bottom of each basket tier with a layer of large lettuce leaves or cabbage leaves, or cut sheets of parchment paper to fit.",
        "You can also use pre-cut parchment paper rounds that are made to fit common steamer basket sizes.",
        "Using a liner makes cleanup much easier!",
        "Chop food into uniform pieces and space them evenly in a single layer.",
        "Your food won’t cook properly if you crowd the basket tiers so much that steam can’t rise up through them.",
        "Prepare only as much food as you can fit in single layers while maintaining proper spacing.",
        "Foods that expand (like dumplings) need at least 2.5 cm (0.98 in) spacing, while other foods need at least 1 cm (0.39 in) spacing.",
        "Additionally, cut dense foods (like root vegetables) and foods that require longer cooking times (like cuts of pork, beef, or chicken) into equal-sized pieces no more than 2.5 cm (0.98 in) thick.",
        "Separate meat and seafood from veggies and use the bottom tier.",
        "Always place meats like beef, pork, and poultry in a meat-only tier, and put this tier at the bottom of the stack (closest to the steam source).",
        "Similarly, put fish and other seafood in its own tier and place it at or near the bottom of the stack, unless your recipe directs otherwise.",
        "Putting meats at the bottom helps ensure that they achieve a safe internal temperature.",
        "Chicken, for example, should reach 74 °C (165 °F).",
        "Distribute veggies and tofu in the mid-to-top tiers based on size.",
        "Separate vegetables into tiers based on thickness and density—carrots and potatoes have similar “steaming profiles” and can be put in one tier near the middle of the stack.",
        "Meanwhile, green beans and bell pepper strips should be put in a different tier closer to the top of the stack.",
        "Tofu can be added to the same tier as thicker vegetables.",
        "Put dumplings or pre-soaked rice in a middle tier by itself.",
        "The ideal tier placement and cooking time for dumplings varies based on the filling, so follow your recipe's guidance.",
        "Dumplings with raw meat fillings, for instance, will likely need to be placed in a lower position in the tier stack.",
        "Pre-soaked but uncooked rice is typically placed near the middle of the stack of basket tiers, while cooked rice that only needs to be reheated should be placed in the top tier.",
        "Your complete stack of tiers, for example, might resemble the following:\nA tier of cubed pork at the bottom.",
        "A tier of dumplings stacked above that.",
        "A tier of broccoli florets placed above that.",
        "A tier of cooked rice that just needs re-heated at the top.",
        "Steaming Your Food Add about 5 cm (2.0 in) of water to a shallow pan.",
        "Choose a pan that’s around 7–10 cm (2.8–3.9 in) deep and holds the steamer basket snugly in place.",
        "Pour at least 3 cm (1.2 in) but not more than 6 cm (2.4 in) of water into the pan—you need enough water so that it doesn’t all evaporate, but not so much that it submerges the food in the bottom basket tier.",
        "A wok is a traditional and ideal option here, but any shallow pan with sloped sides is a great choice.",
        "Sloped sides keep the bamboo basket slightly raised above both the water in the pan and the surface of the pan itself.",
        "This improves steaming performance and prevents your basket from scorching on the bottom.",
        "Place the pan over medium heat until the water comes to a simmer.",
        "You’re not aiming for a full boil here, which happens when bubbles are rapidly forming and bursting at the surface.",
        "Instead, watch for the water to start gently bubbling, with frequent but individual bubbles popping at the water’s surface without agitating it much if at all.",
        "Back the heat down to medium-low once you reach a good simmer.",
        "Every stove is different, so it may take some trial-and-error to figure out the best heat settings in your case.",
        "Put the steamer in the pan and add either its own cover or the pan’s lid.",
        "Bamboo steamers come with a woven lid that fits snugly on whichever tier you have on top, so use it in most cases.",
        "If you’re only steaming a single basket tier, it may be possible—if you wish—to just use the pan’s lid to cover the basket.",
        "Using the pan’s lid may slow the evaporation of the water slightly, but the difference is usually negligible.",
        "Allow the food to steam until it’s done to your liking.",
        "In general, meats take around 20-30 minutes to cook through, seafood and dumplings (a bamboo steamer specialty!)",
        "take around 10-15 minutes, and veggies take about 5-10 minutes.",
        "Keep the lid on until you approach the expected cooking time, and put it back on right away if the food isn’t ready yet.",
        "Cook veggies until they are heated and tender to your liking.",
        "Use a kitchen thermometer to make sure meats are cooked to a safe temperature—for example, cook pork to 63 °C (145 °F).",
        "Check the water level under the basket if you’re cooking for 10+ minutes.",
        "If you’re cooking some veggies quickly, don’t worry about the water evaporating.",
        "After about 10 minutes of cooking, though, carefully lift the entire basket out of the pan and make sure there is at least 2.5 cm (0.98 in) of water in the bottom.",
        "If there is, put the basket back in place and check again every 5 minutes.",
        "If the pan is low on water, add more until it’s back to its starting depth.",
        "Turn the heat on the stove up slightly—for instance, halfway between medium-low and medium—for 2-4 minutes to bring the water back up to a simmer.",
        "Use heat-resistant gloves to lift the steamer out of the pan.",
        "Remove the steamer from the heat and the food from the steamer.",
        "When the food is cooked through, turn off the stove and use your heat-resistant gloves to lift the entire steamer out of the pan.",
        "Separate the different tiers and use tongs or chopsticks to transfer the food to a serving dish.",
        "Alternatively, you can serve the food straight from the steamer basket tiers.",
        "Cleaning Your Bamboo Steamer Rinse the steamer under warm water for a quick cleaning.",
        "Especially if you used leaves or parchment paper as a liner, a quick rinse is often all that’s needed to clean your bamboo steamer.",
        "If there are some stuck-on bits of food, soak the basket in hot water for up to 5 minutes, then rinse it clean.",
        "Resist the urge to pop the steamer basket into the dishwasher for hands-off cleaning.",
        "While some bamboo steamer baskets are marketed as dishwasher-safe, the high heat and detergent used in a dishwasher may reduce the performance and lifespan of your steamer.",
        "Wipe away stuck food bits with a nylon scrubber if necessary.",
        "If rinsing alone, or soaking and then rinsing, don’t remove all the food bits from the steamer, it’s time to use some elbow grease!",
        "Never use steel wool or a bristled scrub brush, though—instead, use a scrubber made of nylon.",
        "That way, you won’t damage the bamboo while removing the food residue.",
        "Use only warm water while scrubbing—skip the dish soap.",
        "Bamboo is very porous and will soak up the scent (and possibly the chemicals) in the soap, meaning your next batch of dumplings may taste a bit soapy!",
        "Turn to a tea bag or a lemon to get rid of odors in the basket.",
        "If you steamed seafood and your basket still has a fishy scent after you clean it, cut a lemon in half and rub the cut side all over the steamer.",
        "Or, soak a black tea bag in warm water for 1-2 minutes, then gently rub it over the steamer.",
        "Wipe cooking oil on the steamer basket after it air dries.",
        "Once you’re finished cleaning and (if needed) deodorizing the steamer, leave it on a drying rack until all surface moisture is gone.",
        "Then, dip a clean cloth or folded-up paper towel into a dish of cooking oil and wipe a thin layer over all surfaces of the bamboo steamer.",
        "Return the basket to the drying rack and allow it to dry completely before putting it away.",
        "Oiling the bamboo may help keep it from drying out and cracking.",
        "Not all bamboo steamer lovers think oiling is necessary, though, so this is an optional step.",
        "Any cooking oil will work, but an oil with a mild flavor—such as canola oil—is less likely to impart any unwanted flavors on your next dish."
    ]
}