{
    "title": "How to Hang an Accordion Rack",
    "url": "https://www.wikihow.com/Hang-an-Accordion-Rack",
    "category_hierarchy": [
        "Personal Care and Style",
        "Clothing"
    ],
    "parts": [
        {
            "name": "Installing Hangers on the Rack",
            "steps": [
                {
                    "headline": "Buy 2 small, sawtooth hangers.",
                    "description": "Sawtooth hangers are often used to hang picture frames, but they’ll work perfectly for this project. Visit a hardware or craft store and get 2 hangers that match the size of your rack. You’ll probably need the smallest size available, but double check to confirm. Make sure the nails with the hangers aren't long enough to poke through the rack. There may be packs that sell multiple hangers. This is useful if you might have to hang more things in your home. 2 hangers should support the weight of most accordion racks. If you plan on hanging anything heavier than bags or coats on yours, then add a third hanger in the middle of the rack for extra support."
                },
                {
                    "headline": "Place a hanger at the outer top corner on each side of the rack.",
                    "description": "Open the accordion rack horizontally and find the 2 top corners. Place a hanger in the top corner on each end with the teeth facing down. Make the hangers as level as possible, though they don’t have to be perfectly level to work properly. Make sure both hangers are facing the correct way. Don’t attach one with the teeth down and one with the teeth up. Don't worry about how wide the rack is open at this point. That's only important when you're hanging it."
                },
                {
                    "headline": "Hammer 2 nails into each hanger to attach them to the rack.",
                    "description": "Each hanger requires 2 small nails that come in the package. Hammer a nail through each hole in the hangers to attach it. Confirm that each hanger is straight before hammering the nails. Since the nails are very small, you can hold them with needle-nosed pliers to avoid hitting your fingers while you hammer."
                }
            ]
        },
        {
            "name": "Mounting the Rack",
            "steps": [
                {
                    "headline": "Open the rack and measure the space between the hangers.",
                    "description": "Set the rack to the length that you want it mounted at. Then, take a tape measure or ruler and measure the distance between the center of each hanger. Remember that measurement so your nails are mounted in the correct place. Make sure the rack is opened to the length that you want before you measure. Otherwise, your measurements will be off. If you aren’t sure what length you want the rack open to, test it first. Hold it up against your wall at different lengths and see which you like best."
                },
                {
                    "headline": "Draw a level line on the wall equal to the distance between the hangers.",
                    "description": "Go to the spot where you want to hang the rack. Hold a ruler or straight edge against the wall and lightly draw a straight line in pencil equal to the distance between the 2 hangers. Check the line with a level to make sure it’s even. The most common spot for an accordion rack is just inside the front door so you can hang your bags, keys, or light jackets. Make sure it’s far enough away so the door won’t hit the rack. Make the rack roughly shoulder-height of an average person so your guests can reach it."
                },
                {
                    "headline": "Hammer a finishing nail into each end of the line.",
                    "description": "Take a finishing nail and hold it against the end of the line on one side. Tap it into the wall with a hammer so it’s slightly angled up. Leave the end sticking out so the hanger can hook over it. Repeat that for the other nail. A finishing nail is a small, thin nail used for light jobs like hanging frames. You can get them at hardware stores. Accordion racks are light, so you don’t have to worry about finding studs to hammer into. You can erase the line after you hammer the nails down."
                },
                {
                    "headline": "Hook the rack over the nails the mount it on the wall.",
                    "description": "With the nails in place, lift the rack into position. Hook the hanger teeth onto the nails. Let go slowly so you know the rack is secure. If the nails aren’t the perfect distance apart, just open or close the rack to fit the distance."
                }
            ]
        }
    ],
    "tyn": [
        "Sawtooth hangers",
        "Hammer",
        "Tape measure",
        "Pencil",
        "Straight edge",
        "Level"
    ],
    "text": " Installing Hangers on the Rack Buy 2 small, sawtooth hangers. Sawtooth hangers are often used to hang picture frames, but they’ll work perfectly for this project. Visit a hardware or craft store and get 2 hangers that match the size of your rack. You’ll probably need the smallest size available, but double check to confirm. Make sure the nails with the hangers aren't long enough to poke through the rack. There may be packs that sell multiple hangers. This is useful if you might have to hang more things in your home. 2 hangers should support the weight of most accordion racks. If you plan on hanging anything heavier than bags or coats on yours, then add a third hanger in the middle of the rack for extra support. Place a hanger at the outer top corner on each side of the rack. Open the accordion rack horizontally and find the 2 top corners. Place a hanger in the top corner on each end with the teeth facing down. Make the hangers as level as possible, though they don’t have to be perfectly level to work properly. Make sure both hangers are facing the correct way. Don’t attach one with the teeth down and one with the teeth up. Don't worry about how wide the rack is open at this point. That's only important when you're hanging it. Hammer 2 nails into each hanger to attach them to the rack. Each hanger requires 2 small nails that come in the package. Hammer a nail through each hole in the hangers to attach it. Confirm that each hanger is straight before hammering the nails. Since the nails are very small, you can hold them with needle-nosed pliers to avoid hitting your fingers while you hammer. Mounting the Rack Open the rack and measure the space between the hangers. Set the rack to the length that you want it mounted at. Then, take a tape measure or ruler and measure the distance between the center of each hanger. Remember that measurement so your nails are mounted in the correct place. Make sure the rack is opened to the length that you want before you measure. Otherwise, your measurements will be off. If you aren’t sure what length you want the rack open to, test it first. Hold it up against your wall at different lengths and see which you like best. Draw a level line on the wall equal to the distance between the hangers. Go to the spot where you want to hang the rack. Hold a ruler or straight edge against the wall and lightly draw a straight line in pencil equal to the distance between the 2 hangers. Check the line with a level to make sure it’s even. The most common spot for an accordion rack is just inside the front door so you can hang your bags, keys, or light jackets. Make sure it’s far enough away so the door won’t hit the rack. Make the rack roughly shoulder-height of an average person so your guests can reach it. Hammer a finishing nail into each end of the line. Take a finishing nail and hold it against the end of the line on one side. Tap it into the wall with a hammer so it’s slightly angled up. Leave the end sticking out so the hanger can hook over it. Repeat that for the other nail. A finishing nail is a small, thin nail used for light jobs like hanging frames. You can get them at hardware stores. Accordion racks are light, so you don’t have to worry about finding studs to hammer into. You can erase the line after you hammer the nails down. Hook the rack over the nails the mount it on the wall. With the nails in place, lift the rack into position. Hook the hanger teeth onto the nails. Let go slowly so you know the rack is secure. If the nails aren’t the perfect distance apart, just open or close the rack to fit the distance.",
    "sentences": [
        " Installing Hangers on the Rack Buy 2 small, sawtooth hangers.",
        "Sawtooth hangers are often used to hang picture frames, but they’ll work perfectly for this project.",
        "Visit a hardware or craft store and get 2 hangers that match the size of your rack.",
        "You’ll probably need the smallest size available, but double check to confirm.",
        "Make sure the nails with the hangers aren't long enough to poke through the rack.",
        "There may be packs that sell multiple hangers.",
        "This is useful if you might have to hang more things in your home.",
        "2 hangers should support the weight of most accordion racks.",
        "If you plan on hanging anything heavier than bags or coats on yours, then add a third hanger in the middle of the rack for extra support.",
        "Place a hanger at the outer top corner on each side of the rack.",
        "Open the accordion rack horizontally and find the 2 top corners.",
        "Place a hanger in the top corner on each end with the teeth facing down.",
        "Make the hangers as level as possible, though they don’t have to be perfectly level to work properly.",
        "Make sure both hangers are facing the correct way.",
        "Don’t attach one with the teeth down and one with the teeth up.",
        "Don't worry about how wide the rack is open at this point.",
        "That's only important when you're hanging it.",
        "Hammer 2 nails into each hanger to attach them to the rack.",
        "Each hanger requires 2 small nails that come in the package.",
        "Hammer a nail through each hole in the hangers to attach it.",
        "Confirm that each hanger is straight before hammering the nails.",
        "Since the nails are very small, you can hold them with needle-nosed pliers to avoid hitting your fingers while you hammer.",
        "Mounting the Rack Open the rack and measure the space between the hangers.",
        "Set the rack to the length that you want it mounted at.",
        "Then, take a tape measure or ruler and measure the distance between the center of each hanger.",
        "Remember that measurement so your nails are mounted in the correct place.",
        "Make sure the rack is opened to the length that you want before you measure.",
        "Otherwise, your measurements will be off.",
        "If you aren’t sure what length you want the rack open to, test it first.",
        "Hold it up against your wall at different lengths and see which you like best.",
        "Draw a level line on the wall equal to the distance between the hangers.",
        "Go to the spot where you want to hang the rack.",
        "Hold a ruler or straight edge against the wall and lightly draw a straight line in pencil equal to the distance between the 2 hangers.",
        "Check the line with a level to make sure it’s even.",
        "The most common spot for an accordion rack is just inside the front door so you can hang your bags, keys, or light jackets.",
        "Make sure it’s far enough away so the door won’t hit the rack.",
        "Make the rack roughly shoulder-height of an average person so your guests can reach it.",
        "Hammer a finishing nail into each end of the line.",
        "Take a finishing nail and hold it against the end of the line on one side.",
        "Tap it into the wall with a hammer so it’s slightly angled up.",
        "Leave the end sticking out so the hanger can hook over it.",
        "Repeat that for the other nail.",
        "A finishing nail is a small, thin nail used for light jobs like hanging frames.",
        "You can get them at hardware stores.",
        "Accordion racks are light, so you don’t have to worry about finding studs to hammer into.",
        "You can erase the line after you hammer the nails down.",
        "Hook the rack over the nails the mount it on the wall.",
        "With the nails in place, lift the rack into position.",
        "Hook the hanger teeth onto the nails.",
        "Let go slowly so you know the rack is secure.",
        "If the nails aren’t the perfect distance apart, just open or close the rack to fit the distance."
    ]
}