{
    "title": "How to Prevent Hair from Getting Greasy Overnight",
    "url": "https://www.wikihow.com/Prevent-Hair-from-Getting-Greasy-Overnight",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Regular Hair Care"
    ],
    "methods": [
        {
            "name": "Changing Your Nighttime Routine",
            "steps": [
                {
                    "headline": "Spritz some dry shampoo before bed if your hair feels especially greasy.",
                    "description": "Examine your roots in the mirror to see if they look and feel especially oily. If so, spritz them with a can of dry shampoo. Avoid massaging the product into your hair—instead, go right to bed. If there’s any shampoo powder visible in the morning, knead the leftover powder into your roots. If you have straighter hair, you can use a brush to spread the leftover shampoo powder through your hair."
                },
                {
                    "headline": "Secure your hair in twists before going to bed.",
                    "description": "Separate your hair into 3 to 4 in (7.6 to 10.2 cm) sections so you can sleep comfortably. Twist each section into a loose coil before tying it in place with a hair band. Keep these twists in overnight to prevent your hair from looking greasy in the morning! This works best with shoulder-length to long hair, but anyone can try it! Depending on the length and thickness of your hair, you may want to tie your hair into at least 3 twists."
                },
                {
                    "headline": "Use a clean pillowcase when you go to bed.",
                    "description": "Choose a time each week to toss your pillowcase in the washer with a small amount of detergent. Set your washing machine to a hot setting, where the water is at least 130 °F (54 °C). If you don’t clean your pillowcase often, you could be making your hair greasier in the long run."
                },
                {
                    "headline": "Avoid touching your hair excessively before bed.",
                    "description": "Take a mental inventory of how often you touch your hair throughout the day. Try to stop yourself, or come up with something else for your hands to do that won’t transfer more grease to your hair. If you have to touch your hair, use a brush instead. Ideally, try not to touch your hair throughout the entire day."
                }
            ]
        },
        {
            "name": "Minimizing Greasiness",
            "steps": [
                {
                    "headline": "Shampoo and condition your hair once every few days.",
                    "description": "Set a regular schedule so you only shampoo your hair 2-3 times throughout the week. If shampoo on a daily or near-daily basis, you may end up washing away your scalp’s natural oils, which causes your hair to produce extra oil in the long run. Try to pick which days you play on shampooing your hair so you can develop a habit. For instance, you could choose Monday, Wednesday, and Friday as your shampoo days."
                },
                {
                    "headline": "Avoid shampoos with extra oils added into the formula.",
                    "description": "Don’t purchase products that have special “anti-frizz” or “shine-creating” claims written on the bottle, as these products tend to have extra oil. Instead, look for products that give your hair more lift and volume, which can lower your risk of super oily hair before bed.Tip: If your hair is especially oily, look for products designed for oily roots."
                },
                {
                    "headline": "Use a purifying shampoo once each week.",
                    "description": "Visit your local beauty supply store for shampoos with a “purifying” label. Massage this product into your hair to wash out any oils that have built up. You can also use your regular shampoo and conditioner after washing your hair with this special shampoo."
                },
                {
                    "headline": "Cleanse your hair with apple cider vinegar to get rid of build-up.",
                    "description": "Mix 1 cup (240 mL) of apple cider vinegar with 1 cup (240 mL) of water and pour the mixture into your hair. Let the vinegar sit in your hair for 5 minutes, then rinse the mixture out with cool water. Use this cleanser whenever your hair feels especially greasy. Use this mixture before bed if you don’t want to sleep with greasy hair."
                },
                {
                    "headline": "Limit the amount of conditioner that you use.",
                    "description": "Don’t overload your hair with conditioning products—instead, read the instructions on the bottle to see how much you should be using. Knead a small amount of conditioner through the ends of your hair so it doesn’t weigh down your roots and create extra oil and grease. Try choosing a conditioner that best fits your natural hair type."
                },
                {
                    "headline": "Don’t brush your hair too much.",
                    "description": "Devote your brush to tangles or knots within your hair. If your hair looks and feels smooth, don’t worry about brushing it! If you brush your hair a lot, you could end up creating and spreading more oil throughout your hair, which will make your locks look extra greasy. If you use your hairbrush on a regular basis, make sure that you’re cleaning it properly."
                }
            ]
        }
    ],
    "tyn": [
        "Changing Your Nighttime Routine",
        "Dry shampoo",
        "Hair bands",
        "Pillowcase",
        "Laundry detergent",
        "Minimizing Greasiness",
        "Shampoo",
        "Conditioner",
        "Purifying shampoo",
        "Apple cider vinegar",
        "Water"
    ],
    "text": " Changing Your Nighttime Routine Spritz some dry shampoo before bed if your hair feels especially greasy. Examine your roots in the mirror to see if they look and feel especially oily. If so, spritz them with a can of dry shampoo. Avoid massaging the product into your hair—instead, go right to bed. If there’s any shampoo powder visible in the morning, knead the leftover powder into your roots. If you have straighter hair, you can use a brush to spread the leftover shampoo powder through your hair. Secure your hair in twists before going to bed. Separate your hair into 3 to 4 in (7.6 to 10.2 cm) sections so you can sleep comfortably. Twist each section into a loose coil before tying it in place with a hair band. Keep these twists in overnight to prevent your hair from looking greasy in the morning! This works best with shoulder-length to long hair, but anyone can try it! Depending on the length and thickness of your hair, you may want to tie your hair into at least 3 twists. Use a clean pillowcase when you go to bed. Choose a time each week to toss your pillowcase in the washer with a small amount of detergent. Set your washing machine to a hot setting, where the water is at least 130 °F (54 °C). If you don’t clean your pillowcase often, you could be making your hair greasier in the long run. Avoid touching your hair excessively before bed. Take a mental inventory of how often you touch your hair throughout the day. Try to stop yourself, or come up with something else for your hands to do that won’t transfer more grease to your hair. If you have to touch your hair, use a brush instead. Ideally, try not to touch your hair throughout the entire day. Minimizing Greasiness Shampoo and condition your hair once every few days. Set a regular schedule so you only shampoo your hair 2-3 times throughout the week. If shampoo on a daily or near-daily basis, you may end up washing away your scalp’s natural oils, which causes your hair to produce extra oil in the long run. Try to pick which days you play on shampooing your hair so you can develop a habit. For instance, you could choose Monday, Wednesday, and Friday as your shampoo days. Avoid shampoos with extra oils added into the formula. Don’t purchase products that have special “anti-frizz” or “shine-creating” claims written on the bottle, as these products tend to have extra oil. Instead, look for products that give your hair more lift and volume, which can lower your risk of super oily hair before bed.Tip: If your hair is especially oily, look for products designed for oily roots. Use a purifying shampoo once each week. Visit your local beauty supply store for shampoos with a “purifying” label. Massage this product into your hair to wash out any oils that have built up. You can also use your regular shampoo and conditioner after washing your hair with this special shampoo. Cleanse your hair with apple cider vinegar to get rid of build-up. Mix 1 cup (240 mL) of apple cider vinegar with 1 cup (240 mL) of water and pour the mixture into your hair. Let the vinegar sit in your hair for 5 minutes, then rinse the mixture out with cool water. Use this cleanser whenever your hair feels especially greasy. Use this mixture before bed if you don’t want to sleep with greasy hair. Limit the amount of conditioner that you use. Don’t overload your hair with conditioning products—instead, read the instructions on the bottle to see how much you should be using. Knead a small amount of conditioner through the ends of your hair so it doesn’t weigh down your roots and create extra oil and grease. Try choosing a conditioner that best fits your natural hair type. Don’t brush your hair too much. Devote your brush to tangles or knots within your hair. If your hair looks and feels smooth, don’t worry about brushing it! If you brush your hair a lot, you could end up creating and spreading more oil throughout your hair, which will make your locks look extra greasy. If you use your hairbrush on a regular basis, make sure that you’re cleaning it properly.",
    "sentences": [
        " Changing Your Nighttime Routine Spritz some dry shampoo before bed if your hair feels especially greasy.",
        "Examine your roots in the mirror to see if they look and feel especially oily.",
        "If so, spritz them with a can of dry shampoo.",
        "Avoid massaging the product into your hair—instead, go right to bed.",
        "If there’s any shampoo powder visible in the morning, knead the leftover powder into your roots.",
        "If you have straighter hair, you can use a brush to spread the leftover shampoo powder through your hair.",
        "Secure your hair in twists before going to bed.",
        "Separate your hair into 3 to 4 in (7.6 to 10.2 cm) sections so you can sleep comfortably.",
        "Twist each section into a loose coil before tying it in place with a hair band.",
        "Keep these twists in overnight to prevent your hair from looking greasy in the morning!",
        "This works best with shoulder-length to long hair, but anyone can try it!",
        "Depending on the length and thickness of your hair, you may want to tie your hair into at least 3 twists.",
        "Use a clean pillowcase when you go to bed.",
        "Choose a time each week to toss your pillowcase in the washer with a small amount of detergent.",
        "Set your washing machine to a hot setting, where the water is at least 130 °F (54 °C).",
        "If you don’t clean your pillowcase often, you could be making your hair greasier in the long run.",
        "Avoid touching your hair excessively before bed.",
        "Take a mental inventory of how often you touch your hair throughout the day.",
        "Try to stop yourself, or come up with something else for your hands to do that won’t transfer more grease to your hair.",
        "If you have to touch your hair, use a brush instead.",
        "Ideally, try not to touch your hair throughout the entire day.",
        "Minimizing Greasiness Shampoo and condition your hair once every few days.",
        "Set a regular schedule so you only shampoo your hair 2-3 times throughout the week.",
        "If shampoo on a daily or near-daily basis, you may end up washing away your scalp’s natural oils, which causes your hair to produce extra oil in the long run.",
        "Try to pick which days you play on shampooing your hair so you can develop a habit.",
        "For instance, you could choose Monday, Wednesday, and Friday as your shampoo days.",
        "Avoid shampoos with extra oils added into the formula.",
        "Don’t purchase products that have special “anti-frizz” or “shine-creating” claims written on the bottle, as these products tend to have extra oil.",
        "Instead, look for products that give your hair more lift and volume, which can lower your risk of super oily hair before bed.Tip: If your hair is especially oily, look for products designed for oily roots.",
        "Use a purifying shampoo once each week.",
        "Visit your local beauty supply store for shampoos with a “purifying” label.",
        "Massage this product into your hair to wash out any oils that have built up.",
        "You can also use your regular shampoo and conditioner after washing your hair with this special shampoo.",
        "Cleanse your hair with apple cider vinegar to get rid of build-up.",
        "Mix 1 cup (240 mL) of apple cider vinegar with 1 cup (240 mL) of water and pour the mixture into your hair.",
        "Let the vinegar sit in your hair for 5 minutes, then rinse the mixture out with cool water.",
        "Use this cleanser whenever your hair feels especially greasy.",
        "Use this mixture before bed if you don’t want to sleep with greasy hair.",
        "Limit the amount of conditioner that you use.",
        "Don’t overload your hair with conditioning products—instead, read the instructions on the bottle to see how much you should be using.",
        "Knead a small amount of conditioner through the ends of your hair so it doesn’t weigh down your roots and create extra oil and grease.",
        "Try choosing a conditioner that best fits your natural hair type.",
        "Don’t brush your hair too much.",
        "Devote your brush to tangles or knots within your hair.",
        "If your hair looks and feels smooth, don’t worry about brushing it!",
        "If you brush your hair a lot, you could end up creating and spreading more oil throughout your hair, which will make your locks look extra greasy.",
        "If you use your hairbrush on a regular basis, make sure that you’re cleaning it properly."
    ]
}