{
    "title": "How to Make a Simple Pixel Art Heart",
    "url": "https://www.wikihow.com/Make-a-Simple-Pixel-Art-Heart",
    "category_hierarchy": [
        "Computers and Electronics",
        "Software",
        "Graphics"
    ],
    "steps": [
        {
            "headline": "Choose a program to create your heart on.",
            "description": "Sandbox is a great pixel art app for mobile devices. On a desktop computer, Pixlr, GIMP, Photoshop, Pixilart, and Paint.NET are good options. You can draw one on squared paper, if you wish."
        },
        {
            "headline": "Select a black colour and draw the bottom of the heart.",
            "description": "This should just be one pixel and should be on the middle-bottom of the page."
        },
        {
            "headline": "Put pixels diagonally up from the bottom point of the heart, going outwards.",
            "description": "It should go to the side and up one square each time. Both sides should be the same length. Do six up on each side, including the bottom point."
        },
        {
            "headline": "Add a pixel above the top pixels on each side.",
            "description": ""
        },
        {
            "headline": "Put two pixels diagonally up from each side, going inwards.",
            "description": ""
        },
        {
            "headline": "Put two more pixels diagonally next to the top pixel on each side.",
            "description": ""
        },
        {
            "headline": "Finish the outline of your heart.",
            "description": "Close the outline of the image by adding two pixels diagonally down from the two top pixels just added. Close the gap by adding a pixel diagonally underneath the two pixels."
        },
        {
            "headline": "Colour your heart.",
            "description": "You can colour and design your heart in anyway you desire. Traditionally hearts are coloured red, but get creative. Consider a rainbow-coloured heart, a heart with polka-dots, or a shaded heart."
        }
    ],
    "tyn": [
        "Computer",
        "Pixel art software"
    ],
    "text": " Choose a program to create your heart on. Sandbox is a great pixel art app for mobile devices. On a desktop computer, Pixlr, GIMP, Photoshop, Pixilart, and Paint.NET are good options. You can draw one on squared paper, if you wish. Select a black colour and draw the bottom of the heart. This should just be one pixel and should be on the middle-bottom of the page. Put pixels diagonally up from the bottom point of the heart, going outwards. It should go to the side and up one square each time. Both sides should be the same length. Do six up on each side, including the bottom point. Add a pixel above the top pixels on each side.  Put two pixels diagonally up from each side, going inwards.  Put two more pixels diagonally next to the top pixel on each side.  Finish the outline of your heart. Close the outline of the image by adding two pixels diagonally down from the two top pixels just added. Close the gap by adding a pixel diagonally underneath the two pixels. Colour your heart. You can colour and design your heart in anyway you desire. Traditionally hearts are coloured red, but get creative. Consider a rainbow-coloured heart, a heart with polka-dots, or a shaded heart.",
    "sentences": [
        " Choose a program to create your heart on.",
        "Sandbox is a great pixel art app for mobile devices.",
        "On a desktop computer, Pixlr, GIMP, Photoshop, Pixilart, and Paint.NET are good options.",
        "You can draw one on squared paper, if you wish.",
        "Select a black colour and draw the bottom of the heart.",
        "This should just be one pixel and should be on the middle-bottom of the page.",
        "Put pixels diagonally up from the bottom point of the heart, going outwards.",
        "It should go to the side and up one square each time.",
        "Both sides should be the same length.",
        "Do six up on each side, including the bottom point.",
        "Add a pixel above the top pixels on each side.",
        "Put two pixels diagonally up from each side, going inwards.",
        "Put two more pixels diagonally next to the top pixel on each side.",
        "Finish the outline of your heart.",
        "Close the outline of the image by adding two pixels diagonally down from the two top pixels just added.",
        "Close the gap by adding a pixel diagonally underneath the two pixels.",
        "Colour your heart.",
        "You can colour and design your heart in anyway you desire.",
        "Traditionally hearts are coloured red, but get creative.",
        "Consider a rainbow-coloured heart, a heart with polka-dots, or a shaded heart."
    ]
}