{
    "title": "How to Crossplay",
    "url": "https://www.wikihow.com/Crossplay",
    "category_hierarchy": [
        "Arts and Entertainment"
    ],
    "methods": [
        {
            "name": "Researching",
            "steps": [
                {
                    "headline": "Study your character religiously.",
                    "description": "Play all of their games, watch all of the shows they are in, or read every piece of manga they grace the pages of."
                },
                {
                    "headline": "Research on crossplay websites.",
                    "description": "See if anyone else has crossplayed this character before- find out how they did it and if you can, ask them for tips."
                },
                {
                    "headline": "Make notes and sketches on how you're going to make yourself convincing.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Male Crossplaying as Female Character",
            "steps": [
                {
                    "headline": "Buy or make a costume; make sure that it will fit you.",
                    "description": "Shoes are a must."
                },
                {
                    "headline": "Get a bargain bra and pad it out with tissue paper, rags or whatever you have in hand.",
                    "description": ""
                },
                {
                    "headline": "Grow your hair out or buy a wig if the character has long hair.",
                    "description": "Make sure your hair looks nice."
                },
                {
                    "headline": "Shave your legs, any facial hair you might have and, if they seem a bit beastly, your lower arms too.",
                    "description": ""
                },
                {
                    "headline": "Practice walking and talking like a girl.",
                    "description": "Be sure not to overdo it or you will be less convincing, but make sure you practice especially hard if you're going to have to walk in high heels."
                }
            ]
        },
        {
            "name": "Female Crossplaying as Male Character",
            "steps": [
                {
                    "headline": "Get a friend to help you bind down your chest, especially if your male character wears a figure-hugging outfit.",
                    "description": "If you're not particularly busty, this isn't quite so necessary, but it's recommended if your character wears anything like a tank top. Use either a binder or a compression shirt for this. DO NOT USE ACE BANDAGES OR TAPE, as these can cause fluid buildup in your lungs. If you use a binder, make sure you know how to prevent injuries and fluid buildup in your lungs."
                },
                {
                    "headline": "Think about hair.",
                    "description": "Luckily most men in anime have long girly locks anyway, but if the character you've chosen doesn't, are you willing to have your hair cut short just to play him? If not, consider a wig. Even if you have long hair, you CAN fit it all under a short wig! Likewise, if your character is supposed to wear a hat, you can take advantage of it by simply tucking your hair into the hat."
                },
                {
                    "headline": "Throw yourself into the role, swaggering about like you imagine he would.",
                    "description": "Take on any of his gruff mannerisms (if crossplaying a butch man, it's likely he has nicknames for girls such as \"doll\" etc.)"
                }
            ]
        }
    ],
    "tyn": [
        "Costume",
        "Wig",
        "Make-up",
        "Practice acting like your character"
    ],
    "text": " Researching Study your character religiously. Play all of their games, watch all of the shows they are in, or read every piece of manga they grace the pages of. Research on crossplay websites. See if anyone else has crossplayed this character before- find out how they did it and if you can, ask them for tips. Make notes and sketches on how you're going to make yourself convincing.  Male Crossplaying as Female Character Buy or make a costume; make sure that it will fit you. Shoes are a must. Get a bargain bra and pad it out with tissue paper, rags or whatever you have in hand.  Grow your hair out or buy a wig if the character has long hair. Make sure your hair looks nice. Shave your legs, any facial hair you might have and, if they seem a bit beastly, your lower arms too.  Practice walking and talking like a girl. Be sure not to overdo it or you will be less convincing, but make sure you practice especially hard if you're going to have to walk in high heels. Female Crossplaying as Male Character Get a friend to help you bind down your chest, especially if your male character wears a figure-hugging outfit. If you're not particularly busty, this isn't quite so necessary, but it's recommended if your character wears anything like a tank top. Use either a binder or a compression shirt for this. DO NOT USE ACE BANDAGES OR TAPE, as these can cause fluid buildup in your lungs. If you use a binder, make sure you know how to prevent injuries and fluid buildup in your lungs. Think about hair. Luckily most men in anime have long girly locks anyway, but if the character you've chosen doesn't, are you willing to have your hair cut short just to play him? If not, consider a wig. Even if you have long hair, you CAN fit it all under a short wig! Likewise, if your character is supposed to wear a hat, you can take advantage of it by simply tucking your hair into the hat. Throw yourself into the role, swaggering about like you imagine he would. Take on any of his gruff mannerisms (if crossplaying a butch man, it's likely he has nicknames for girls such as \"doll\" etc.)",
    "sentences": [
        " Researching Study your character religiously.",
        "Play all of their games, watch all of the shows they are in, or read every piece of manga they grace the pages of.",
        "Research on crossplay websites.",
        "See if anyone else has crossplayed this character before- find out how they did it and if you can, ask them for tips.",
        "Make notes and sketches on how you're going to make yourself convincing.",
        "Male Crossplaying as Female Character Buy or make a costume; make sure that it will fit you.",
        "Shoes are a must.",
        "Get a bargain bra and pad it out with tissue paper, rags or whatever you have in hand.",
        "Grow your hair out or buy a wig if the character has long hair.",
        "Make sure your hair looks nice.",
        "Shave your legs, any facial hair you might have and, if they seem a bit beastly, your lower arms too.",
        "Practice walking and talking like a girl.",
        "Be sure not to overdo it or you will be less convincing, but make sure you practice especially hard if you're going to have to walk in high heels.",
        "Female Crossplaying as Male Character Get a friend to help you bind down your chest, especially if your male character wears a figure-hugging outfit.",
        "If you're not particularly busty, this isn't quite so necessary, but it's recommended if your character wears anything like a tank top.",
        "Use either a binder or a compression shirt for this.",
        "DO NOT USE ACE BANDAGES OR TAPE, as these can cause fluid buildup in your lungs.",
        "If you use a binder, make sure you know how to prevent injuries and fluid buildup in your lungs.",
        "Think about hair.",
        "Luckily most men in anime have long girly locks anyway, but if the character you've chosen doesn't, are you willing to have your hair cut short just to play him?",
        "If not, consider a wig.",
        "Even if you have long hair, you CAN fit it all under a short wig!",
        "Likewise, if your character is supposed to wear a hat, you can take advantage of it by simply tucking your hair into the hat.",
        "Throw yourself into the role, swaggering about like you imagine he would.",
        "Take on any of his gruff mannerisms (if crossplaying a butch man, it's likely he has nicknames for girls such as \"doll\" etc.)"
    ]
}