{
    "title": "How to Protect Watch Glass from Scratches",
    "url": "https://www.wikihow.com/Protect-Watch-Glass-from-Scratches",
    "category_hierarchy": [
        "Personal Care and Style",
        "Jewelry",
        "Watches"
    ],
    "methods": [
        {
            "name": "Keeping the Crystal Safe",
            "steps": [
                {
                    "headline": "Get a plastic screen protector to keep scratches from damaging the crystal.",
                    "description": "Go online and purchase a plastic screen protector for your brand and watch model. When the protector arrives, peel off the back of the plastic and carefully apply it to the face of the screen. Use the edge of a credit card to carefully smooth out any air bubbles to the edge of the screen. The plastic protector will protect the watch crystal from basic scratches and general wear and tear.Tip: Most mid-level brands offer plastic screen protectors for their watches, but you may not find one if your watch is on the expensive side. High-end watch crystals are typically made with a resin that protect it naturally. They are not designed to have a screen protector on them. If you have an antique or vintage watch, using a screen protector will actually decrease the value of the watch."
                },
                {
                    "headline": "Opt for a tempered glass screen protector if you have a smartwatch.",
                    "description": "If you have a smartwatch with an interactive screen, purchase a glass screen protector for your smartwatch online or from an electronics store. These glass protectors will do a better job of protecting your screen than the plastic protectors and won’t interfering with your ability to use the screen. To attach it, take glass protector and hold it over the screen before pushing it into place.Make sure that you get a protector that is designed to work with your specific model. If you’re worried about damaging a smartwatch, you can purchase smartwatch insurance through your phone carrier the same way you purchase insurance for your phone."
                },
                {
                    "headline": "Cut a custom-sized protector out of a phone screen protector if necessary.",
                    "description": "If there aren’t protectors for your brand or model on the market, purchase a plastic screen protector for a phone or tablet. Measure the diameter of your watch’s crystal. Then, use a drawing compass to copy the shape of the crystal on a piece of paper. Cut the paper out and use it as a template to cut a piece of the screen protector out with scissors. Peel the adhesive back off of the screen protector and put it on your watch.Smooth the air bubbles out using the edges of a credit card. This is pretty hard to do perfectly. Don’t worry if there’s a small ridge or lip on the exterior rim of the crystal. The majority of the watch will be protected."
                },
                {
                    "headline": "Clean the watch with an ammonia-solution to remove dirt that can cause scratches.",
                    "description": "Cleaning the crystal will keep microscopic contaminants from scratching your watch over time whenever you handle it. Make a solution that is 3-parts ammonia-based window cleaner and 1-part water. Dip a microfiber cloth into the solution and gently wipe the crystal using a smooth circular motion. Wipe the excess cleaner off with a paper towel or clean cloth.You can use a solution of 4-parts rubbing alcohol and 1-part water if you prefer. Do not use soap. This may damage the crystal depending on what your watch is made out of. Clean your watch whenever it’s noticeably dirty. If you don’t wear the watch regularly, clean it once every year or so."
                },
                {
                    "headline": "Remove scratches as soon as you notice them.",
                    "description": "Look at the back of the watch or refer to your instruction manual to determine what the crystal is made out of. For acrylic crystals, use a gel toothpaste. For a mineral crystal, use a crystal polish. Pour 2-3 drops of polish or squirt a pea-sized dollop of toothpaste directly on the watch’s crystal. Then, use a microfiber cloth to buff the polish into the crystal. Repeat this process until the scratches are lifted out.Wipe the excess polish off after you’re done and let the polish air dry. Wipe the toothpaste off with a damp cloth. If the scratch won’t come out, contact a watch repair company to have the crystal replaced."
                }
            ]
        },
        {
            "name": "Handling and Storing Your Watch",
            "steps": [
                {
                    "headline": "Take the watch off if you’re engaging in moderate or highly physical activity.",
                    "description": "If you’re working out, playing a sport, or doing something that involves moving around a lot, take your watch off and set it somewhere safe. It’s easy to forget you’re wearing a watch, and if you end up brushing the crystal against something you may scuff it up.Tip: You can purchase a travel case for your watch if you engage in physical activity often. Whenever you take the watch off, put it in the case and stuff it in your pocket so that you don’t lose it."
                },
                {
                    "headline": "Place the watch face-up if you’re setting it down on a table.",
                    "description": "When you take the watch off and go to set it down, be sure to place it with the bezel facing up. Spread the band out evenly so it’s lying flat on the surface. If you set the watch down with the crystal facing the surface, you’re likely to scratch the crystal when you go to pick it up."
                },
                {
                    "headline": "Store your watch in a protective case when you aren’t wearing it.",
                    "description": "Get a velvet-lined case designed specifically for wristwatches. Whenever you aren’t wearing your watch, keep it in the protective case. If you aren’t wearing your watch for a long period of time, keep the case in a temperate, dark environment to protect it in storage.You can purchase these cases online or from a watchmaker."
                },
                {
                    "headline": "Hold the watch by the band or grip the bezel when putting it on or taking it off.",
                    "description": "When putting the watch on or taking it off, hold it by the band or grip the bezel around the exterior rim. Touching the crystal directly can transfer any residue or dirt from your hands to the face of the watch. If you don’t touch the crystal, you’ll never risk damaging the watch."
                },
                {
                    "headline": "Wear bracelets and chains on your other wrist to protect the watch.",
                    "description": "If you wear any other jewelry on your wrists, put the other chains or bracelets on the opposite wrist to keep them away from the watch. If there’s a piece of jewelry wrapped around your wrist next to the watch, it may slide up and scuff the crystal while you’re moving around. This can’t happen if the other pieces of jewelry are on your other hand, though!"
                }
            ]
        }
    ],
    "tyn": [
        "Keeping the Crystal Safe",
        "Screen protector",
        "Protective case",
        "Compass",
        "Scissors",
        "Ammonia-based window cleaner",
        "Water",
        "Microfiber cloth",
        "Credit card",
        "Rubbing alcohol (optional)",
        "Handling and Storing Your Watch",
        "Velvet-lined watch case"
    ],
    "text": " Keeping the Crystal Safe Get a plastic screen protector to keep scratches from damaging the crystal. Go online and purchase a plastic screen protector for your brand and watch model. When the protector arrives, peel off the back of the plastic and carefully apply it to the face of the screen. Use the edge of a credit card to carefully smooth out any air bubbles to the edge of the screen. The plastic protector will protect the watch crystal from basic scratches and general wear and tear.Tip: Most mid-level brands offer plastic screen protectors for their watches, but you may not find one if your watch is on the expensive side. High-end watch crystals are typically made with a resin that protect it naturally. They are not designed to have a screen protector on them. If you have an antique or vintage watch, using a screen protector will actually decrease the value of the watch. Opt for a tempered glass screen protector if you have a smartwatch. If you have a smartwatch with an interactive screen, purchase a glass screen protector for your smartwatch online or from an electronics store. These glass protectors will do a better job of protecting your screen than the plastic protectors and won’t interfering with your ability to use the screen. To attach it, take glass protector and hold it over the screen before pushing it into place.Make sure that you get a protector that is designed to work with your specific model. If you’re worried about damaging a smartwatch, you can purchase smartwatch insurance through your phone carrier the same way you purchase insurance for your phone. Cut a custom-sized protector out of a phone screen protector if necessary. If there aren’t protectors for your brand or model on the market, purchase a plastic screen protector for a phone or tablet. Measure the diameter of your watch’s crystal. Then, use a drawing compass to copy the shape of the crystal on a piece of paper. Cut the paper out and use it as a template to cut a piece of the screen protector out with scissors. Peel the adhesive back off of the screen protector and put it on your watch.Smooth the air bubbles out using the edges of a credit card. This is pretty hard to do perfectly. Don’t worry if there’s a small ridge or lip on the exterior rim of the crystal. The majority of the watch will be protected. Clean the watch with an ammonia-solution to remove dirt that can cause scratches. Cleaning the crystal will keep microscopic contaminants from scratching your watch over time whenever you handle it. Make a solution that is 3-parts ammonia-based window cleaner and 1-part water. Dip a microfiber cloth into the solution and gently wipe the crystal using a smooth circular motion. Wipe the excess cleaner off with a paper towel or clean cloth.You can use a solution of 4-parts rubbing alcohol and 1-part water if you prefer. Do not use soap. This may damage the crystal depending on what your watch is made out of. Clean your watch whenever it’s noticeably dirty. If you don’t wear the watch regularly, clean it once every year or so. Remove scratches as soon as you notice them. Look at the back of the watch or refer to your instruction manual to determine what the crystal is made out of. For acrylic crystals, use a gel toothpaste. For a mineral crystal, use a crystal polish. Pour 2-3 drops of polish or squirt a pea-sized dollop of toothpaste directly on the watch’s crystal. Then, use a microfiber cloth to buff the polish into the crystal. Repeat this process until the scratches are lifted out.Wipe the excess polish off after you’re done and let the polish air dry. Wipe the toothpaste off with a damp cloth. If the scratch won’t come out, contact a watch repair company to have the crystal replaced. Handling and Storing Your Watch Take the watch off if you’re engaging in moderate or highly physical activity. If you’re working out, playing a sport, or doing something that involves moving around a lot, take your watch off and set it somewhere safe. It’s easy to forget you’re wearing a watch, and if you end up brushing the crystal against something you may scuff it up.Tip: You can purchase a travel case for your watch if you engage in physical activity often. Whenever you take the watch off, put it in the case and stuff it in your pocket so that you don’t lose it. Place the watch face-up if you’re setting it down on a table. When you take the watch off and go to set it down, be sure to place it with the bezel facing up. Spread the band out evenly so it’s lying flat on the surface. If you set the watch down with the crystal facing the surface, you’re likely to scratch the crystal when you go to pick it up. Store your watch in a protective case when you aren’t wearing it. Get a velvet-lined case designed specifically for wristwatches. Whenever you aren’t wearing your watch, keep it in the protective case. If you aren’t wearing your watch for a long period of time, keep the case in a temperate, dark environment to protect it in storage.You can purchase these cases online or from a watchmaker. Hold the watch by the band or grip the bezel when putting it on or taking it off. When putting the watch on or taking it off, hold it by the band or grip the bezel around the exterior rim. Touching the crystal directly can transfer any residue or dirt from your hands to the face of the watch. If you don’t touch the crystal, you’ll never risk damaging the watch. Wear bracelets and chains on your other wrist to protect the watch. If you wear any other jewelry on your wrists, put the other chains or bracelets on the opposite wrist to keep them away from the watch. If there’s a piece of jewelry wrapped around your wrist next to the watch, it may slide up and scuff the crystal while you’re moving around. This can’t happen if the other pieces of jewelry are on your other hand, though!",
    "sentences": [
        " Keeping the Crystal Safe Get a plastic screen protector to keep scratches from damaging the crystal.",
        "Go online and purchase a plastic screen protector for your brand and watch model.",
        "When the protector arrives, peel off the back of the plastic and carefully apply it to the face of the screen.",
        "Use the edge of a credit card to carefully smooth out any air bubbles to the edge of the screen.",
        "The plastic protector will protect the watch crystal from basic scratches and general wear and tear.Tip: Most mid-level brands offer plastic screen protectors for their watches, but you may not find one if your watch is on the expensive side.",
        "High-end watch crystals are typically made with a resin that protect it naturally.",
        "They are not designed to have a screen protector on them.",
        "If you have an antique or vintage watch, using a screen protector will actually decrease the value of the watch.",
        "Opt for a tempered glass screen protector if you have a smartwatch.",
        "If you have a smartwatch with an interactive screen, purchase a glass screen protector for your smartwatch online or from an electronics store.",
        "These glass protectors will do a better job of protecting your screen than the plastic protectors and won’t interfering with your ability to use the screen.",
        "To attach it, take glass protector and hold it over the screen before pushing it into place.Make sure that you get a protector that is designed to work with your specific model.",
        "If you’re worried about damaging a smartwatch, you can purchase smartwatch insurance through your phone carrier the same way you purchase insurance for your phone.",
        "Cut a custom-sized protector out of a phone screen protector if necessary.",
        "If there aren’t protectors for your brand or model on the market, purchase a plastic screen protector for a phone or tablet.",
        "Measure the diameter of your watch’s crystal.",
        "Then, use a drawing compass to copy the shape of the crystal on a piece of paper.",
        "Cut the paper out and use it as a template to cut a piece of the screen protector out with scissors.",
        "Peel the adhesive back off of the screen protector and put it on your watch.Smooth the air bubbles out using the edges of a credit card.",
        "This is pretty hard to do perfectly.",
        "Don’t worry if there’s a small ridge or lip on the exterior rim of the crystal.",
        "The majority of the watch will be protected.",
        "Clean the watch with an ammonia-solution to remove dirt that can cause scratches.",
        "Cleaning the crystal will keep microscopic contaminants from scratching your watch over time whenever you handle it.",
        "Make a solution that is 3-parts ammonia-based window cleaner and 1-part water.",
        "Dip a microfiber cloth into the solution and gently wipe the crystal using a smooth circular motion.",
        "Wipe the excess cleaner off with a paper towel or clean cloth.You can use a solution of 4-parts rubbing alcohol and 1-part water if you prefer.",
        "Do not use soap.",
        "This may damage the crystal depending on what your watch is made out of.",
        "Clean your watch whenever it’s noticeably dirty.",
        "If you don’t wear the watch regularly, clean it once every year or so.",
        "Remove scratches as soon as you notice them.",
        "Look at the back of the watch or refer to your instruction manual to determine what the crystal is made out of.",
        "For acrylic crystals, use a gel toothpaste.",
        "For a mineral crystal, use a crystal polish.",
        "Pour 2-3 drops of polish or squirt a pea-sized dollop of toothpaste directly on the watch’s crystal.",
        "Then, use a microfiber cloth to buff the polish into the crystal.",
        "Repeat this process until the scratches are lifted out.Wipe the excess polish off after you’re done and let the polish air dry.",
        "Wipe the toothpaste off with a damp cloth.",
        "If the scratch won’t come out, contact a watch repair company to have the crystal replaced.",
        "Handling and Storing Your Watch Take the watch off if you’re engaging in moderate or highly physical activity.",
        "If you’re working out, playing a sport, or doing something that involves moving around a lot, take your watch off and set it somewhere safe.",
        "It’s easy to forget you’re wearing a watch, and if you end up brushing the crystal against something you may scuff it up.Tip: You can purchase a travel case for your watch if you engage in physical activity often.",
        "Whenever you take the watch off, put it in the case and stuff it in your pocket so that you don’t lose it.",
        "Place the watch face-up if you’re setting it down on a table.",
        "When you take the watch off and go to set it down, be sure to place it with the bezel facing up.",
        "Spread the band out evenly so it’s lying flat on the surface.",
        "If you set the watch down with the crystal facing the surface, you’re likely to scratch the crystal when you go to pick it up.",
        "Store your watch in a protective case when you aren’t wearing it.",
        "Get a velvet-lined case designed specifically for wristwatches.",
        "Whenever you aren’t wearing your watch, keep it in the protective case.",
        "If you aren’t wearing your watch for a long period of time, keep the case in a temperate, dark environment to protect it in storage.You can purchase these cases online or from a watchmaker.",
        "Hold the watch by the band or grip the bezel when putting it on or taking it off.",
        "When putting the watch on or taking it off, hold it by the band or grip the bezel around the exterior rim.",
        "Touching the crystal directly can transfer any residue or dirt from your hands to the face of the watch.",
        "If you don’t touch the crystal, you’ll never risk damaging the watch.",
        "Wear bracelets and chains on your other wrist to protect the watch.",
        "If you wear any other jewelry on your wrists, put the other chains or bracelets on the opposite wrist to keep them away from the watch.",
        "If there’s a piece of jewelry wrapped around your wrist next to the watch, it may slide up and scuff the crystal while you’re moving around.",
        "This can’t happen if the other pieces of jewelry are on your other hand, though!"
    ]
}