{
    "title": "How to Polish Chrome Bumpers",
    "url": "https://www.wikihow.com/Polish-Chrome-Bumpers",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Maintenance and Repair"
    ],
    "parts": [
        {
            "name": "Cleaning the Chrome Bumpers",
            "steps": [
                {
                    "headline": "Mix dish soap with water to create a chrome wash.",
                    "description": "Fill a clean bucket two-thirds of the way full with warm water. Squeeze a few squirts of dish soap into the water and mix it together using your hand or a large spoon. Keep stirring until you see suds pop up on the surface of the water. The dish soap is gentle enough on the chrome to not damage it but powerful enough to get rid of any dirt or grime."
                },
                {
                    "headline": "Dip a soft cloth into the soapy water and wipe down the chrome.",
                    "description": "Use a microfiber cloth or a nonabrasive sponge to clean your chrome bumper. Use circular movements to get rid of the dirt, using the cloth or sponge to get deep down into any crevices or grooves of the bumper for the best clean. Rinse your sponge in the soapy bucket to get rid of excess dirt regularly."
                },
                {
                    "headline": "Use white vinegar to clean tough stains or rust.",
                    "description": "Vinegar is a great mild cleaner that helps get rid of more stubborn dirt and rust than regular dish soap can. Pour white vinegar on a clean microfiber cloth or nonabrasive sponge and rub it into the chrome. Target spots that are the dirtiest so the vinegar will work the best."
                },
                {
                    "headline": "Rinse the chrome with clean water to get rid of soap and dirt.",
                    "description": "Use a garden hose to pour clean running water over the chrome bumper so the soap and last pieces of dirt disappear. Direct the hose’s stream into all the nooks and crannies of the bumper to be sure you get rid of all of the suds. If you don’t have a garden hose, fill up a cup with water and pour it over the bumper to clean it instead."
                },
                {
                    "headline": "Wipe the chrome with a microfiber cloth to dry it.",
                    "description": "Use circular motions as you dry the bumper, getting into the holes to dry those thoroughly too. Once a section of your cloth gets too damp, fold it over to a dry section and keep wiping. It’s important for your chrome bumper to be dry if you’re polishing it next."
                }
            ]
        },
        {
            "name": "Using a Chrome Polish",
            "steps": [
                {
                    "headline": "Pick out a chrome polish from your local home improvement store.",
                    "description": "Any polish labeled as working on chrome will work on your bumper. Most chrome polishes have a cleaner and sealant in them, making them great for cleaning, polishing, and sealing your chrome all at once. If you’re worried about using the wrong polish, contact your car dealership to see if they have a polish suggestion that works best on your chrome bumper. Most chrome polishes also help prevent rust."
                },
                {
                    "headline": "Apply painter’s tape to areas next to the chrome for extra protection.",
                    "description": "This isn’t required, but if you’re worried about your plastic trim getting polish on it, use painter’s tape to protect it. Line the painter’s tape up along the edge of the chrome bumper, outlining the bumper so the polish won’t touch the plastic parts of your car when you apply it. Many types of polish won't harm the plastic as long as it's wiped off right after, but some types of chrome polishes may eat away at the plastic if they're left on or rubbed in aggressively."
                },
                {
                    "headline": "Squeeze out a line of polish onto an applicator pad or microfiber cloth.",
                    "description": "Polishing your bumper doesn’t require a lot of polish, just a couple light dabs. Squirt a straight line of polish onto your cloth or pad, or add a few dots of the polish to the bumper to target specific areas. Avoid using abrasive cloths or sponges to apply the polish so you don’t accidentally scratch your bumper."
                },
                {
                    "headline": "Rub the chrome with the cloth using circular motions.",
                    "description": "Start at one end of the bumper where you applied the polish and move to the other end. Use a light pressure as you rub and small circles to be sure you cover the whole bumper evenly. If your chrome bumper is fairly dull or dirty, give it a few extra swipes so it's completely polished. Do a small test spot on your bumper using the polish to be sure it works. If you rub the polish on and the chrome is visibly shinier, it's safe to use on the rest of the bumper. If you can’t see the polish on the bumper as you’re wiping, add more to the cloth or directly to the bumper."
                },
                {
                    "headline": "Use a clean microfiber cloth to buff the surface of the chrome.",
                    "description": "Once your bumper is covered in polish, buff the surface with a soft cloth to remove the extra polish and give the bumper added shine. Start at one end of the bumper and use small circular motions to buff the chrome, creating a shiny surface. Add a slight pressure as you buff to be sure it's super clean. Apply more polish to your chrome if you buff the surface and it’s not shiny yet. Remove the painter’s tape once you’re completely done by pulling it off at a slight angle so it comes off easily."
                }
            ]
        }
    ],
    "tyn": [
        "Cleaning the Chrome Bumpers",
        "Dish soap",
        "Bucket",
        "Soft cloths",
        "White vinegar (optional)",
        "Garden hose",
        "Using a Chrome Polish",
        "Chrome polish",
        "Painter's tape",
        "Applicator pad or cloth",
        "Clean cloth"
    ],
    "text": " Cleaning the Chrome Bumpers Mix dish soap with water to create a chrome wash. Fill a clean bucket two-thirds of the way full with warm water. Squeeze a few squirts of dish soap into the water and mix it together using your hand or a large spoon. Keep stirring until you see suds pop up on the surface of the water. The dish soap is gentle enough on the chrome to not damage it but powerful enough to get rid of any dirt or grime. Dip a soft cloth into the soapy water and wipe down the chrome. Use a microfiber cloth or a nonabrasive sponge to clean your chrome bumper. Use circular movements to get rid of the dirt, using the cloth or sponge to get deep down into any crevices or grooves of the bumper for the best clean. Rinse your sponge in the soapy bucket to get rid of excess dirt regularly. Use white vinegar to clean tough stains or rust. Vinegar is a great mild cleaner that helps get rid of more stubborn dirt and rust than regular dish soap can. Pour white vinegar on a clean microfiber cloth or nonabrasive sponge and rub it into the chrome. Target spots that are the dirtiest so the vinegar will work the best. Rinse the chrome with clean water to get rid of soap and dirt. Use a garden hose to pour clean running water over the chrome bumper so the soap and last pieces of dirt disappear. Direct the hose’s stream into all the nooks and crannies of the bumper to be sure you get rid of all of the suds. If you don’t have a garden hose, fill up a cup with water and pour it over the bumper to clean it instead. Wipe the chrome with a microfiber cloth to dry it. Use circular motions as you dry the bumper, getting into the holes to dry those thoroughly too. Once a section of your cloth gets too damp, fold it over to a dry section and keep wiping. It’s important for your chrome bumper to be dry if you’re polishing it next. Using a Chrome Polish Pick out a chrome polish from your local home improvement store. Any polish labeled as working on chrome will work on your bumper. Most chrome polishes have a cleaner and sealant in them, making them great for cleaning, polishing, and sealing your chrome all at once. If you’re worried about using the wrong polish, contact your car dealership to see if they have a polish suggestion that works best on your chrome bumper. Most chrome polishes also help prevent rust. Apply painter’s tape to areas next to the chrome for extra protection. This isn’t required, but if you’re worried about your plastic trim getting polish on it, use painter’s tape to protect it. Line the painter’s tape up along the edge of the chrome bumper, outlining the bumper so the polish won’t touch the plastic parts of your car when you apply it. Many types of polish won't harm the plastic as long as it's wiped off right after, but some types of chrome polishes may eat away at the plastic if they're left on or rubbed in aggressively. Squeeze out a line of polish onto an applicator pad or microfiber cloth. Polishing your bumper doesn’t require a lot of polish, just a couple light dabs. Squirt a straight line of polish onto your cloth or pad, or add a few dots of the polish to the bumper to target specific areas. Avoid using abrasive cloths or sponges to apply the polish so you don’t accidentally scratch your bumper. Rub the chrome with the cloth using circular motions. Start at one end of the bumper where you applied the polish and move to the other end. Use a light pressure as you rub and small circles to be sure you cover the whole bumper evenly. If your chrome bumper is fairly dull or dirty, give it a few extra swipes so it's completely polished. Do a small test spot on your bumper using the polish to be sure it works. If you rub the polish on and the chrome is visibly shinier, it's safe to use on the rest of the bumper. If you can’t see the polish on the bumper as you’re wiping, add more to the cloth or directly to the bumper. Use a clean microfiber cloth to buff the surface of the chrome. Once your bumper is covered in polish, buff the surface with a soft cloth to remove the extra polish and give the bumper added shine. Start at one end of the bumper and use small circular motions to buff the chrome, creating a shiny surface. Add a slight pressure as you buff to be sure it's super clean. Apply more polish to your chrome if you buff the surface and it’s not shiny yet. Remove the painter’s tape once you’re completely done by pulling it off at a slight angle so it comes off easily.",
    "sentences": [
        " Cleaning the Chrome Bumpers Mix dish soap with water to create a chrome wash.",
        "Fill a clean bucket two-thirds of the way full with warm water.",
        "Squeeze a few squirts of dish soap into the water and mix it together using your hand or a large spoon.",
        "Keep stirring until you see suds pop up on the surface of the water.",
        "The dish soap is gentle enough on the chrome to not damage it but powerful enough to get rid of any dirt or grime.",
        "Dip a soft cloth into the soapy water and wipe down the chrome.",
        "Use a microfiber cloth or a nonabrasive sponge to clean your chrome bumper.",
        "Use circular movements to get rid of the dirt, using the cloth or sponge to get deep down into any crevices or grooves of the bumper for the best clean.",
        "Rinse your sponge in the soapy bucket to get rid of excess dirt regularly.",
        "Use white vinegar to clean tough stains or rust.",
        "Vinegar is a great mild cleaner that helps get rid of more stubborn dirt and rust than regular dish soap can.",
        "Pour white vinegar on a clean microfiber cloth or nonabrasive sponge and rub it into the chrome.",
        "Target spots that are the dirtiest so the vinegar will work the best.",
        "Rinse the chrome with clean water to get rid of soap and dirt.",
        "Use a garden hose to pour clean running water over the chrome bumper so the soap and last pieces of dirt disappear.",
        "Direct the hose’s stream into all the nooks and crannies of the bumper to be sure you get rid of all of the suds.",
        "If you don’t have a garden hose, fill up a cup with water and pour it over the bumper to clean it instead.",
        "Wipe the chrome with a microfiber cloth to dry it.",
        "Use circular motions as you dry the bumper, getting into the holes to dry those thoroughly too.",
        "Once a section of your cloth gets too damp, fold it over to a dry section and keep wiping.",
        "It’s important for your chrome bumper to be dry if you’re polishing it next.",
        "Using a Chrome Polish Pick out a chrome polish from your local home improvement store.",
        "Any polish labeled as working on chrome will work on your bumper.",
        "Most chrome polishes have a cleaner and sealant in them, making them great for cleaning, polishing, and sealing your chrome all at once.",
        "If you’re worried about using the wrong polish, contact your car dealership to see if they have a polish suggestion that works best on your chrome bumper.",
        "Most chrome polishes also help prevent rust.",
        "Apply painter’s tape to areas next to the chrome for extra protection.",
        "This isn’t required, but if you’re worried about your plastic trim getting polish on it, use painter’s tape to protect it.",
        "Line the painter’s tape up along the edge of the chrome bumper, outlining the bumper so the polish won’t touch the plastic parts of your car when you apply it.",
        "Many types of polish won't harm the plastic as long as it's wiped off right after, but some types of chrome polishes may eat away at the plastic if they're left on or rubbed in aggressively.",
        "Squeeze out a line of polish onto an applicator pad or microfiber cloth.",
        "Polishing your bumper doesn’t require a lot of polish, just a couple light dabs.",
        "Squirt a straight line of polish onto your cloth or pad, or add a few dots of the polish to the bumper to target specific areas.",
        "Avoid using abrasive cloths or sponges to apply the polish so you don’t accidentally scratch your bumper.",
        "Rub the chrome with the cloth using circular motions.",
        "Start at one end of the bumper where you applied the polish and move to the other end.",
        "Use a light pressure as you rub and small circles to be sure you cover the whole bumper evenly.",
        "If your chrome bumper is fairly dull or dirty, give it a few extra swipes so it's completely polished.",
        "Do a small test spot on your bumper using the polish to be sure it works.",
        "If you rub the polish on and the chrome is visibly shinier, it's safe to use on the rest of the bumper.",
        "If you can’t see the polish on the bumper as you’re wiping, add more to the cloth or directly to the bumper.",
        "Use a clean microfiber cloth to buff the surface of the chrome.",
        "Once your bumper is covered in polish, buff the surface with a soft cloth to remove the extra polish and give the bumper added shine.",
        "Start at one end of the bumper and use small circular motions to buff the chrome, creating a shiny surface.",
        "Add a slight pressure as you buff to be sure it's super clean.",
        "Apply more polish to your chrome if you buff the surface and it’s not shiny yet.",
        "Remove the painter’s tape once you’re completely done by pulling it off at a slight angle so it comes off easily."
    ]
}