{
    "title": "How to Protect a Glass Top Stove from Cast Iron",
    "url": "https://www.wikihow.com/Protect-a-Glass-Top-Stove-from-Cast-Iron",
    "category_hierarchy": [
        "Home and Garden",
        "Home Appliances"
    ],
    "methods": [
        {
            "name": "Taking Proper Precautions",
            "steps": [
                {
                    "headline": "Wash your cast iron cookware before using it.",
                    "description": "Use a sponge or scrubber and pea-sized amount of dish soap to get rid of any leftover food. Focus especially on the bottom of the pan, which can have built-up carbonization, or black marks, on the bottom. Let your cookware air-dry completely before using it on your top stove. If you don’t clean off the black marks, they can smear and stain your glass top stove."
                },
                {
                    "headline": "Opt for cast iron cookware with a smooth bottom.",
                    "description": "Check your cookware to ensure that there are no chips or cracks in your pot or pan that could scuff the glass surface. Additionally, feel the bottom of your cookware to see if it’s smooth. If you can detect any bumps or uneven edges, you could be setting yourself up for scratches.Look online or in a home goods store for replacement pots and pans."
                },
                {
                    "headline": "Lift cast iron carefully when cooking with a glass top stove.",
                    "description": "Try not slide or skid your cast iron cookware while making a dish. Instead, use both hands to lift the handle, which allows you to move the pot or pan safely. Be careful not to drop your cast iron! It’s very heavy, and may cause cracks if you drop it on the surface.Dragging or sliding the cast iron could lead to unwanted scratches. While you can use heavy cookware on the top stove, be sure not to drop the pot or pan onto the glass."
                },
                {
                    "headline": "Use cast iron pans that match the dimensions of your stove.",
                    "description": "With your top stove turned off, use a measuring tape to see how wide your main burner is. Check the diameter of your cast iron cookware to see if it fits snugly on the stove. As a general rule of thumb, don’t use any pots or pans that are 1 in (2.5 cm) or more larger than the width of the burner.For instance, a 12 in (30 cm) wide pan shouldn’t go on a glass top stove burner that’s only 10 in (25 cm) wide."
                }
            ]
        },
        {
            "name": "Using a Heat Diffuser",
            "steps": [
                {
                    "headline": "Choose a heat diffuser that fits on your top stove burners.",
                    "description": "Check online or visit a home goods store to find a heat diffuser, which costs as little as $10. You can choose a perforated aluminum diffuser, a flat steel item, or a diffuser made with wire coils. Select one that best fits in your budget and suits your kitchen needs. Heat diffusers help to control the amount of heat that goes from your stove top to the pot or pan."
                },
                {
                    "headline": "Set the flat side of your heat diffuser on the stovetop.",
                    "description": "Look on both sides of the diffuser for a curved and flat edge. Arrange the flatter edge on the stove so it’s less likely to shift while you’re cooking."
                },
                {
                    "headline": "Arrange your cast iron cookware on top of the diffuser.",
                    "description": "Make sure that your pot or pan is centered on the diffuser so the stove’s heat can spread evenly. Don’t put any food into your cookware until you have the pot or pan and diffuser in place.Heat diffusers help minimize any scratches or other damage from your cast iron cookware."
                },
                {
                    "headline": "Turn your glass top stove burner to a low heat.",
                    "description": "Check the temperature dial for your stovetop and make sure that it isn’t programmed to a high setting. Since cast iron doesn’t heat super evenly, maintain a balanced temperature whenever you cook over a glass top stove.Tip: Get in the habit of cooking with a diffuser whenever you use cast iron cookware! This will keep your glass top stove consistently protected."
                },
                {
                    "headline": "Hand wash your diffuser if it gets dirty.",
                    "description": "Place your diffuser in the sink and clean it out with a pea-sized amount of dish soap and some warm water. Rinse out all the suds, then set it on a rack to air-dry for a day or so. Once it’s dry, store it somewhere in your kitchen where you can grab it easily."
                }
            ]
        }
    ],
    "tyn": [
        "Taking Proper Precautions",
        "Dish soap",
        "Sponge or scrubber",
        "Water",
        "Measuring tape",
        "Using a Heat Diffuser",
        "Heat diffuser"
    ],
    "text": " Taking Proper Precautions Wash your cast iron cookware before using it. Use a sponge or scrubber and pea-sized amount of dish soap to get rid of any leftover food. Focus especially on the bottom of the pan, which can have built-up carbonization, or black marks, on the bottom. Let your cookware air-dry completely before using it on your top stove. If you don’t clean off the black marks, they can smear and stain your glass top stove. Opt for cast iron cookware with a smooth bottom. Check your cookware to ensure that there are no chips or cracks in your pot or pan that could scuff the glass surface. Additionally, feel the bottom of your cookware to see if it’s smooth. If you can detect any bumps or uneven edges, you could be setting yourself up for scratches.Look online or in a home goods store for replacement pots and pans. Lift cast iron carefully when cooking with a glass top stove. Try not slide or skid your cast iron cookware while making a dish. Instead, use both hands to lift the handle, which allows you to move the pot or pan safely. Be careful not to drop your cast iron! It’s very heavy, and may cause cracks if you drop it on the surface.Dragging or sliding the cast iron could lead to unwanted scratches. While you can use heavy cookware on the top stove, be sure not to drop the pot or pan onto the glass. Use cast iron pans that match the dimensions of your stove. With your top stove turned off, use a measuring tape to see how wide your main burner is. Check the diameter of your cast iron cookware to see if it fits snugly on the stove. As a general rule of thumb, don’t use any pots or pans that are 1 in (2.5 cm) or more larger than the width of the burner.For instance, a 12 in (30 cm) wide pan shouldn’t go on a glass top stove burner that’s only 10 in (25 cm) wide. Using a Heat Diffuser Choose a heat diffuser that fits on your top stove burners. Check online or visit a home goods store to find a heat diffuser, which costs as little as $10. You can choose a perforated aluminum diffuser, a flat steel item, or a diffuser made with wire coils. Select one that best fits in your budget and suits your kitchen needs. Heat diffusers help to control the amount of heat that goes from your stove top to the pot or pan. Set the flat side of your heat diffuser on the stovetop. Look on both sides of the diffuser for a curved and flat edge. Arrange the flatter edge on the stove so it’s less likely to shift while you’re cooking. Arrange your cast iron cookware on top of the diffuser. Make sure that your pot or pan is centered on the diffuser so the stove’s heat can spread evenly. Don’t put any food into your cookware until you have the pot or pan and diffuser in place.Heat diffusers help minimize any scratches or other damage from your cast iron cookware. Turn your glass top stove burner to a low heat. Check the temperature dial for your stovetop and make sure that it isn’t programmed to a high setting. Since cast iron doesn’t heat super evenly, maintain a balanced temperature whenever you cook over a glass top stove.Tip: Get in the habit of cooking with a diffuser whenever you use cast iron cookware! This will keep your glass top stove consistently protected. Hand wash your diffuser if it gets dirty. Place your diffuser in the sink and clean it out with a pea-sized amount of dish soap and some warm water. Rinse out all the suds, then set it on a rack to air-dry for a day or so. Once it’s dry, store it somewhere in your kitchen where you can grab it easily.",
    "sentences": [
        " Taking Proper Precautions Wash your cast iron cookware before using it.",
        "Use a sponge or scrubber and pea-sized amount of dish soap to get rid of any leftover food.",
        "Focus especially on the bottom of the pan, which can have built-up carbonization, or black marks, on the bottom.",
        "Let your cookware air-dry completely before using it on your top stove.",
        "If you don’t clean off the black marks, they can smear and stain your glass top stove.",
        "Opt for cast iron cookware with a smooth bottom.",
        "Check your cookware to ensure that there are no chips or cracks in your pot or pan that could scuff the glass surface.",
        "Additionally, feel the bottom of your cookware to see if it’s smooth.",
        "If you can detect any bumps or uneven edges, you could be setting yourself up for scratches.Look online or in a home goods store for replacement pots and pans.",
        "Lift cast iron carefully when cooking with a glass top stove.",
        "Try not slide or skid your cast iron cookware while making a dish.",
        "Instead, use both hands to lift the handle, which allows you to move the pot or pan safely.",
        "Be careful not to drop your cast iron!",
        "It’s very heavy, and may cause cracks if you drop it on the surface.Dragging or sliding the cast iron could lead to unwanted scratches.",
        "While you can use heavy cookware on the top stove, be sure not to drop the pot or pan onto the glass.",
        "Use cast iron pans that match the dimensions of your stove.",
        "With your top stove turned off, use a measuring tape to see how wide your main burner is.",
        "Check the diameter of your cast iron cookware to see if it fits snugly on the stove.",
        "As a general rule of thumb, don’t use any pots or pans that are 1 in (2.5 cm) or more larger than the width of the burner.For instance, a 12 in (30 cm) wide pan shouldn’t go on a glass top stove burner that’s only 10 in (25 cm) wide.",
        "Using a Heat Diffuser Choose a heat diffuser that fits on your top stove burners.",
        "Check online or visit a home goods store to find a heat diffuser, which costs as little as $10.",
        "You can choose a perforated aluminum diffuser, a flat steel item, or a diffuser made with wire coils.",
        "Select one that best fits in your budget and suits your kitchen needs.",
        "Heat diffusers help to control the amount of heat that goes from your stove top to the pot or pan.",
        "Set the flat side of your heat diffuser on the stovetop.",
        "Look on both sides of the diffuser for a curved and flat edge.",
        "Arrange the flatter edge on the stove so it’s less likely to shift while you’re cooking.",
        "Arrange your cast iron cookware on top of the diffuser.",
        "Make sure that your pot or pan is centered on the diffuser so the stove’s heat can spread evenly.",
        "Don’t put any food into your cookware until you have the pot or pan and diffuser in place.Heat diffusers help minimize any scratches or other damage from your cast iron cookware.",
        "Turn your glass top stove burner to a low heat.",
        "Check the temperature dial for your stovetop and make sure that it isn’t programmed to a high setting.",
        "Since cast iron doesn’t heat super evenly, maintain a balanced temperature whenever you cook over a glass top stove.Tip: Get in the habit of cooking with a diffuser whenever you use cast iron cookware!",
        "This will keep your glass top stove consistently protected.",
        "Hand wash your diffuser if it gets dirty.",
        "Place your diffuser in the sink and clean it out with a pea-sized amount of dish soap and some warm water.",
        "Rinse out all the suds, then set it on a rack to air-dry for a day or so.",
        "Once it’s dry, store it somewhere in your kitchen where you can grab it easily."
    ]
}