{
    "title": "How to Fill Nail Holes in Drywall Without Painting",
    "url": "https://www.wikihow.com/Fill-Nail-Holes-in-Drywall-Without-Painting",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Walls and Ceilings",
        "Interior Walls"
    ],
    "parts": [
        {
            "name": "Applying Lightweight Spackle",
            "steps": [
                {
                    "headline": "Pull the nail out of your wall with the back of a hammer.",
                    "description": "Line up the back of a hammer with the nail and slide it upward until the nail fits into the hammer. Gently pull the hammer out towards yourself away from the wall until the nail pops out.Tip: Save the nail in your toolbox in case you want to use it later."
                },
                {
                    "headline": "Pick up lightweight spackling to avoid harsh edges.",
                    "description": "Lightweight spackling isn’t as thick and doesn’t weigh as much as typical putty or spackling does. Use this to ensure your wall won’t have any harsh edges left by the putty to make your job easier. You can find this type of spackling at most hardware stores. Look for “lightweight” on the package."
                },
                {
                    "headline": "Apply the lightweight spackle with a putty knife.",
                    "description": "Open up the tub of wall spackle and dip the end of your putty knife into it. Grab a small glob of spackle that is just larger than the hole you want to fill. Place the putty knife right above the hole and drag it downward to apply the spackle, focusing on the hole with about 0.25 inches (0.64 cm) of spackle around it. You can find a putty knife at most hardware stores. Putty knives are flat, skinny tools made specifically for applying putty and spackling to walls."
                },
                {
                    "headline": "Smooth out the spackle with your putty knife.",
                    "description": "Drag the edge of the putty knife down around the edges of the hole to remove any unnecessary spackle. This will take the excess off your wall and make it easier to smooth out later. Try not to push your putty knife into the hole, or you could dent the flat surface of the spackle. Instead, stick to the outside edges."
                },
                {
                    "headline": "Wait 1 to 2 hours for the spackle to dry completely.",
                    "description": "Point a fan at your wall to speed up the drying process. Try not to touch the area until a few hours have passed so that the spackle has a chance to dry. If you try to work on the spackle while it’s still wet, you could accidentally remove it from the hole in your wall."
                }
            ]
        },
        {
            "name": "Sanding the Spackle and Wiping it Off",
            "steps": [
                {
                    "headline": "Sand the spackle slightly to remove the top layer.",
                    "description": "Use a fine grade sanding sponge or paper to slightly rough up the top layer of spackle. Don’t push too hard into the spackle or try to make it flush with the wall, or you could leave a shiny spot that is hard to cover up, especially on textured walls. You can find sanding sponges or papers at most hardware stores."
                },
                {
                    "headline": "Dampen a large sponge with warm water.",
                    "description": "Pick up a large, soft sponge used for grouting or tile work. Run it under the sink using warm water until the entire thing is wet, and then wring out the excess.Tip: If your sponge is still dripping water, it's too wet. Wring it out again until it isn't dripping anymore. Look for these soft sponges at a hardware store near you."
                },
                {
                    "headline": "Rub the sponge over the spackle to take off the top layer.",
                    "description": "Swipe the sponge back and forth over the spackle on your wall until it disappears completely. Clean off the surrounding area of your wall if you notice any white dust from the sanding. Water breaks down the top layers of the spackle, but your sponge won’t be wet enough to dampen the spackle in the nail hole."
                },
                {
                    "headline": "Dry off the area with a clean cloth.",
                    "description": "Finish off your wall by making the area look clean and dry with a cloth. Make sure there isn’t any spackle left on the wall so the area looks smooth without any evidence of the previous hole."
                }
            ]
        }
    ],
    "tyn": [
        "Hammer",
        "Lightweight spackle",
        "Putty knife",
        "Soft sponge",
        "Cloth"
    ],
    "text": " Applying Lightweight Spackle Pull the nail out of your wall with the back of a hammer. Line up the back of a hammer with the nail and slide it upward until the nail fits into the hammer. Gently pull the hammer out towards yourself away from the wall until the nail pops out.Tip: Save the nail in your toolbox in case you want to use it later. Pick up lightweight spackling to avoid harsh edges. Lightweight spackling isn’t as thick and doesn’t weigh as much as typical putty or spackling does. Use this to ensure your wall won’t have any harsh edges left by the putty to make your job easier. You can find this type of spackling at most hardware stores. Look for “lightweight” on the package. Apply the lightweight spackle with a putty knife. Open up the tub of wall spackle and dip the end of your putty knife into it. Grab a small glob of spackle that is just larger than the hole you want to fill. Place the putty knife right above the hole and drag it downward to apply the spackle, focusing on the hole with about 0.25 inches (0.64 cm) of spackle around it. You can find a putty knife at most hardware stores. Putty knives are flat, skinny tools made specifically for applying putty and spackling to walls. Smooth out the spackle with your putty knife. Drag the edge of the putty knife down around the edges of the hole to remove any unnecessary spackle. This will take the excess off your wall and make it easier to smooth out later. Try not to push your putty knife into the hole, or you could dent the flat surface of the spackle. Instead, stick to the outside edges. Wait 1 to 2 hours for the spackle to dry completely. Point a fan at your wall to speed up the drying process. Try not to touch the area until a few hours have passed so that the spackle has a chance to dry. If you try to work on the spackle while it’s still wet, you could accidentally remove it from the hole in your wall. Sanding the Spackle and Wiping it Off Sand the spackle slightly to remove the top layer. Use a fine grade sanding sponge or paper to slightly rough up the top layer of spackle. Don’t push too hard into the spackle or try to make it flush with the wall, or you could leave a shiny spot that is hard to cover up, especially on textured walls. You can find sanding sponges or papers at most hardware stores. Dampen a large sponge with warm water. Pick up a large, soft sponge used for grouting or tile work. Run it under the sink using warm water until the entire thing is wet, and then wring out the excess.Tip: If your sponge is still dripping water, it's too wet. Wring it out again until it isn't dripping anymore. Look for these soft sponges at a hardware store near you. Rub the sponge over the spackle to take off the top layer. Swipe the sponge back and forth over the spackle on your wall until it disappears completely. Clean off the surrounding area of your wall if you notice any white dust from the sanding. Water breaks down the top layers of the spackle, but your sponge won’t be wet enough to dampen the spackle in the nail hole. Dry off the area with a clean cloth. Finish off your wall by making the area look clean and dry with a cloth. Make sure there isn’t any spackle left on the wall so the area looks smooth without any evidence of the previous hole.",
    "sentences": [
        " Applying Lightweight Spackle Pull the nail out of your wall with the back of a hammer.",
        "Line up the back of a hammer with the nail and slide it upward until the nail fits into the hammer.",
        "Gently pull the hammer out towards yourself away from the wall until the nail pops out.Tip: Save the nail in your toolbox in case you want to use it later.",
        "Pick up lightweight spackling to avoid harsh edges.",
        "Lightweight spackling isn’t as thick and doesn’t weigh as much as typical putty or spackling does.",
        "Use this to ensure your wall won’t have any harsh edges left by the putty to make your job easier.",
        "You can find this type of spackling at most hardware stores.",
        "Look for “lightweight” on the package.",
        "Apply the lightweight spackle with a putty knife.",
        "Open up the tub of wall spackle and dip the end of your putty knife into it.",
        "Grab a small glob of spackle that is just larger than the hole you want to fill.",
        "Place the putty knife right above the hole and drag it downward to apply the spackle, focusing on the hole with about 0.25 inches (0.64 cm) of spackle around it.",
        "You can find a putty knife at most hardware stores.",
        "Putty knives are flat, skinny tools made specifically for applying putty and spackling to walls.",
        "Smooth out the spackle with your putty knife.",
        "Drag the edge of the putty knife down around the edges of the hole to remove any unnecessary spackle.",
        "This will take the excess off your wall and make it easier to smooth out later.",
        "Try not to push your putty knife into the hole, or you could dent the flat surface of the spackle.",
        "Instead, stick to the outside edges.",
        "Wait 1 to 2 hours for the spackle to dry completely.",
        "Point a fan at your wall to speed up the drying process.",
        "Try not to touch the area until a few hours have passed so that the spackle has a chance to dry.",
        "If you try to work on the spackle while it’s still wet, you could accidentally remove it from the hole in your wall.",
        "Sanding the Spackle and Wiping it Off Sand the spackle slightly to remove the top layer.",
        "Use a fine grade sanding sponge or paper to slightly rough up the top layer of spackle.",
        "Don’t push too hard into the spackle or try to make it flush with the wall, or you could leave a shiny spot that is hard to cover up, especially on textured walls.",
        "You can find sanding sponges or papers at most hardware stores.",
        "Dampen a large sponge with warm water.",
        "Pick up a large, soft sponge used for grouting or tile work.",
        "Run it under the sink using warm water until the entire thing is wet, and then wring out the excess.Tip: If your sponge is still dripping water, it's too wet.",
        "Wring it out again until it isn't dripping anymore.",
        "Look for these soft sponges at a hardware store near you.",
        "Rub the sponge over the spackle to take off the top layer.",
        "Swipe the sponge back and forth over the spackle on your wall until it disappears completely.",
        "Clean off the surrounding area of your wall if you notice any white dust from the sanding.",
        "Water breaks down the top layers of the spackle, but your sponge won’t be wet enough to dampen the spackle in the nail hole.",
        "Dry off the area with a clean cloth.",
        "Finish off your wall by making the area look clean and dry with a cloth.",
        "Make sure there isn’t any spackle left on the wall so the area looks smooth without any evidence of the previous hole."
    ]
}