{
    "title": "How to Straighten Fence Posts",
    "url": "https://www.wikihow.com/Straighten-Fence-Posts",
    "category_hierarchy": [
        "Home and Garden",
        "Yard and Outdoors",
        "Fences and Gates"
    ],
    "methods": [
        {
            "name": "Using E-Z Mender Brackets for Posts in Dirt",
            "steps": [
                {
                    "headline": "Buy 1-2 E-Z Mender brackets, depending on how crooked your post is.",
                    "description": "An E-Z Mender bracket is a metal bracket specifically designed for fixing leaning fence posts. Purchase 1 bracket per post if the post just has a minor lean and 2 if it is leaning drastically or has a crack or other structural damage. These brackets are available at a home improvement center, garden center, hardware store, or online. Note that this method will only work for 4 in (10 cm) by 4 in (10 cm) wooden fence posts that are driven directly into the soil. It won’t work for fence posts encased in concrete or posts that are bigger, since the brackets are designed to fit around the wood. An alternative to the E-Z Mender bracket is a Post Buddy stake, which works best if the post is rotted and broken at ground level because the tip is designed to sink into the wood itself. The steps for installation are essentially the same, though a Post Buddy can also work on rotten fence posts that are set in concrete."
                },
                {
                    "headline": "Push the tip of an E-Z Mender bracket into the ground at the base of the post.",
                    "description": "Place the pointy end of the bracket right up against the base of the leaning post. Ensure that the bracket is straight.Tip: If you have 3 or more leaning fence posts and whole sections of fence that are crooked, it’s better to replace the posts or perhaps rebuild the whole fence or section of fence. Straightening the posts might only be a temporary fix if your fence is old and worn out. It’s very important to get the tip as close as possible to the base of the post in order to stabilize and support it below ground as well as above ground."
                },
                {
                    "headline": "Hit the bump on the side of the bracket with a mallet to drive it into the ground.",
                    "description": "E-Z Mender brackets have a bump called a nailing lug jutting out from the side, which has a flat surface approximately the size of a mallet. Use a mallet to hit this nailing lug, driving it into the earth, until it is even with the ground or won’t go any deeper.You could use a mini sledgehammer to drive the bracket into the ground if you don’t have a mallet."
                },
                {
                    "headline": "Screw the bracket to the post using 1 in (2.5 cm) coated structural screws.",
                    "description": "Have someone push the leaning post up straight and support it so it sits flush in the bracket while you secure it in place. Use a power drill to drive 1 in (2.5 cm) coated structural screws through the screw holes in the sides of the bracket.If you don’t have structural screws, you could use hot-dipped galvanized nails instead."
                },
                {
                    "headline": "Install another bracket on the other side of the post if you want more stability.",
                    "description": "Drive an additional E-Z Mender bracket into the ground on the other side of the post and screw it to the post if your post was leaning drastically or damaged. Skip this if the post is straight and stable after installing just 1 bracket.If you used a Post Buddy stake as an alternative, you must install a second stake opposite the first one for optimal stability. They come in sets of 2 for this reason."
                }
            ]
        },
        {
            "name": "Installing Fix-a-Fence Braces for Posts in Concrete",
            "steps": [
                {
                    "headline": "Purchase 1 Fix-a-Fence post brace per leaning post.",
                    "description": "A Fix-a-Fence brace is a metal brace that is meant to be set in concrete and then screwed to a leaning fence post to straighten and stabilize it. Buy 1 per post you want to fix at a home improvement center, garden center, hardware store, or online. This method works for wooden fence posts of any size that are set into concrete footings. You could also use it to straighten wooden posts set directly into the ground if you want the added stability of a brace set into concrete."
                },
                {
                    "headline": "Dig a hole 8 in (20 cm) away from the post with a clam-shell post digger.",
                    "description": "Center the hole behind the post in the opposite direction from that which it is leaning in. Dig it 8 in (20 cm) away from the post and 18 in (46 cm) deep.The part of the Fix-a-Fence brace that goes in the ground is 18 in (46 cm) long, so that’s why you have to dig the hole 18 in (46 cm) deep. If you don’t have a clam-shell post digger, you can use a regular spade. Try to make the sides of the hole as vertical as possible and make the hole at least 3 times wider than the pole part of the Fix-a-Fence brace."
                },
                {
                    "headline": "Assemble the Fix-a-Fence brace by screwing the pole into the brace.",
                    "description": "Fix-a-Fence braces come in 2 pieces. Screw the pole-shaped section into the hole underneath the short arm of  the rectangular brace section.The round pole section is what goes in the ground and the rectangular brace section is what supports the fence post."
                },
                {
                    "headline": "Mix a 60 lb (27 kg) bag of fast-setting concrete in a wheelbarrow.",
                    "description": "Pour the powdered concrete into a wheelbarrow. Mix it with water according to the manufacturer’s instructions, using a shovel to stir it together thoroughly.Warning: Wear a dust mask and protective eyewear when you mix concrete to avoid inhaling concrete dust. Some fast-setting concrete allows you to pour the powder into the hole first, then pour water on top. Always defer to the manufacturer’s instructions for specific mixing directions."
                },
                {
                    "headline": "Set the pipe straight in the hole and position the brace against the post.",
                    "description": "Have someone hold the fence post straight while you position the pole section of the brace in the hole and the rectangular part flush against the post. Keep holding the brace in place or have someone else hold it there once you find the correct position needed to straighten the fence post."
                },
                {
                    "headline": "Fill the hole around the brace with the mixed concrete.",
                    "description": "Carefully shovel or pour concrete from the wheelbarrow into the hole around the brace, being sure to fill it in evenly on all sides. Stop when it is even with the level of the surrounding ground.Check the position of the brace against the post again and make any minor adjustments before the concrete starts to set. You can use a pole or stick to press the concrete around the base of the brace if there are any air pockets or uneven spots."
                },
                {
                    "headline": "Wait 1 full day for the concrete to cure.",
                    "description": "Fast-setting concrete will set in about 4 hours, but takes a full 24 hours to cure completely. Leave the brace alone for the full duration of time to allow it to cure solidly in place before attaching it to the fence post.After the concrete is cured, you can cover it up with top soil to give it a more natural, landscaped look if you want."
                },
                {
                    "headline": "Attach the brace to the post using the provided screws.",
                    "description": "Have someone hold the leaning post up flush against the brace. Place the 3 provided screws through the 3 screw holes in the brace and screw them into the wood post using a wrench. The provided screws have a bolt head, rather than a standard screw head, which is why you need a wrench to screw them into the post."
                }
            ]
        }
    ],
    "tyn": [
        "Using E-Z Mender Brackets for Posts in Dirt",
        "1-2  E-Z Mender fence repair brackets",
        "Mallet",
        "1 in (2.5 cm) coated structural screws",
        "Power drill",
        "Installing Fix-a-Fence Braces for Posts in Concrete",
        "Fix-a-Fence brace",
        "Clam-shell post digger",
        "Wheelbarrow",
        "Shovel",
        "60 lb (27 kg) bag of concrete",
        "Wrench",
        "Protective eyewear",
        "Dust mask"
    ],
    "text": " Using E-Z Mender Brackets for Posts in Dirt Buy 1-2 E-Z Mender brackets, depending on how crooked your post is. An E-Z Mender bracket is a metal bracket specifically designed for fixing leaning fence posts. Purchase 1 bracket per post if the post just has a minor lean and 2 if it is leaning drastically or has a crack or other structural damage. These brackets are available at a home improvement center, garden center, hardware store, or online. Note that this method will only work for 4 in (10 cm) by 4 in (10 cm) wooden fence posts that are driven directly into the soil. It won’t work for fence posts encased in concrete or posts that are bigger, since the brackets are designed to fit around the wood. An alternative to the E-Z Mender bracket is a Post Buddy stake, which works best if the post is rotted and broken at ground level because the tip is designed to sink into the wood itself. The steps for installation are essentially the same, though a Post Buddy can also work on rotten fence posts that are set in concrete. Push the tip of an E-Z Mender bracket into the ground at the base of the post. Place the pointy end of the bracket right up against the base of the leaning post. Ensure that the bracket is straight.Tip: If you have 3 or more leaning fence posts and whole sections of fence that are crooked, it’s better to replace the posts or perhaps rebuild the whole fence or section of fence. Straightening the posts might only be a temporary fix if your fence is old and worn out. It’s very important to get the tip as close as possible to the base of the post in order to stabilize and support it below ground as well as above ground. Hit the bump on the side of the bracket with a mallet to drive it into the ground. E-Z Mender brackets have a bump called a nailing lug jutting out from the side, which has a flat surface approximately the size of a mallet. Use a mallet to hit this nailing lug, driving it into the earth, until it is even with the ground or won’t go any deeper.You could use a mini sledgehammer to drive the bracket into the ground if you don’t have a mallet. Screw the bracket to the post using 1 in (2.5 cm) coated structural screws. Have someone push the leaning post up straight and support it so it sits flush in the bracket while you secure it in place. Use a power drill to drive 1 in (2.5 cm) coated structural screws through the screw holes in the sides of the bracket.If you don’t have structural screws, you could use hot-dipped galvanized nails instead. Install another bracket on the other side of the post if you want more stability. Drive an additional E-Z Mender bracket into the ground on the other side of the post and screw it to the post if your post was leaning drastically or damaged. Skip this if the post is straight and stable after installing just 1 bracket.If you used a Post Buddy stake as an alternative, you must install a second stake opposite the first one for optimal stability. They come in sets of 2 for this reason. Installing Fix-a-Fence Braces for Posts in Concrete Purchase 1 Fix-a-Fence post brace per leaning post. A Fix-a-Fence brace is a metal brace that is meant to be set in concrete and then screwed to a leaning fence post to straighten and stabilize it. Buy 1 per post you want to fix at a home improvement center, garden center, hardware store, or online. This method works for wooden fence posts of any size that are set into concrete footings. You could also use it to straighten wooden posts set directly into the ground if you want the added stability of a brace set into concrete. Dig a hole 8 in (20 cm) away from the post with a clam-shell post digger. Center the hole behind the post in the opposite direction from that which it is leaning in. Dig it 8 in (20 cm) away from the post and 18 in (46 cm) deep.The part of the Fix-a-Fence brace that goes in the ground is 18 in (46 cm) long, so that’s why you have to dig the hole 18 in (46 cm) deep. If you don’t have a clam-shell post digger, you can use a regular spade. Try to make the sides of the hole as vertical as possible and make the hole at least 3 times wider than the pole part of the Fix-a-Fence brace. Assemble the Fix-a-Fence brace by screwing the pole into the brace. Fix-a-Fence braces come in 2 pieces. Screw the pole-shaped section into the hole underneath the short arm of  the rectangular brace section.The round pole section is what goes in the ground and the rectangular brace section is what supports the fence post. Mix a 60 lb (27 kg) bag of fast-setting concrete in a wheelbarrow. Pour the powdered concrete into a wheelbarrow. Mix it with water according to the manufacturer’s instructions, using a shovel to stir it together thoroughly.Warning: Wear a dust mask and protective eyewear when you mix concrete to avoid inhaling concrete dust. Some fast-setting concrete allows you to pour the powder into the hole first, then pour water on top. Always defer to the manufacturer’s instructions for specific mixing directions. Set the pipe straight in the hole and position the brace against the post. Have someone hold the fence post straight while you position the pole section of the brace in the hole and the rectangular part flush against the post. Keep holding the brace in place or have someone else hold it there once you find the correct position needed to straighten the fence post. Fill the hole around the brace with the mixed concrete. Carefully shovel or pour concrete from the wheelbarrow into the hole around the brace, being sure to fill it in evenly on all sides. Stop when it is even with the level of the surrounding ground.Check the position of the brace against the post again and make any minor adjustments before the concrete starts to set. You can use a pole or stick to press the concrete around the base of the brace if there are any air pockets or uneven spots. Wait 1 full day for the concrete to cure. Fast-setting concrete will set in about 4 hours, but takes a full 24 hours to cure completely. Leave the brace alone for the full duration of time to allow it to cure solidly in place before attaching it to the fence post.After the concrete is cured, you can cover it up with top soil to give it a more natural, landscaped look if you want. Attach the brace to the post using the provided screws. Have someone hold the leaning post up flush against the brace. Place the 3 provided screws through the 3 screw holes in the brace and screw them into the wood post using a wrench. The provided screws have a bolt head, rather than a standard screw head, which is why you need a wrench to screw them into the post.",
    "sentences": [
        " Using E-Z Mender Brackets for Posts in Dirt Buy 1-2 E-Z Mender brackets, depending on how crooked your post is.",
        "An E-Z Mender bracket is a metal bracket specifically designed for fixing leaning fence posts.",
        "Purchase 1 bracket per post if the post just has a minor lean and 2 if it is leaning drastically or has a crack or other structural damage.",
        "These brackets are available at a home improvement center, garden center, hardware store, or online.",
        "Note that this method will only work for 4 in (10 cm) by 4 in (10 cm) wooden fence posts that are driven directly into the soil.",
        "It won’t work for fence posts encased in concrete or posts that are bigger, since the brackets are designed to fit around the wood.",
        "An alternative to the E-Z Mender bracket is a Post Buddy stake, which works best if the post is rotted and broken at ground level because the tip is designed to sink into the wood itself.",
        "The steps for installation are essentially the same, though a Post Buddy can also work on rotten fence posts that are set in concrete.",
        "Push the tip of an E-Z Mender bracket into the ground at the base of the post.",
        "Place the pointy end of the bracket right up against the base of the leaning post.",
        "Ensure that the bracket is straight.Tip: If you have 3 or more leaning fence posts and whole sections of fence that are crooked, it’s better to replace the posts or perhaps rebuild the whole fence or section of fence.",
        "Straightening the posts might only be a temporary fix if your fence is old and worn out.",
        "It’s very important to get the tip as close as possible to the base of the post in order to stabilize and support it below ground as well as above ground.",
        "Hit the bump on the side of the bracket with a mallet to drive it into the ground.",
        "E-Z Mender brackets have a bump called a nailing lug jutting out from the side, which has a flat surface approximately the size of a mallet.",
        "Use a mallet to hit this nailing lug, driving it into the earth, until it is even with the ground or won’t go any deeper.You could use a mini sledgehammer to drive the bracket into the ground if you don’t have a mallet.",
        "Screw the bracket to the post using 1 in (2.5 cm) coated structural screws.",
        "Have someone push the leaning post up straight and support it so it sits flush in the bracket while you secure it in place.",
        "Use a power drill to drive 1 in (2.5 cm) coated structural screws through the screw holes in the sides of the bracket.If you don’t have structural screws, you could use hot-dipped galvanized nails instead.",
        "Install another bracket on the other side of the post if you want more stability.",
        "Drive an additional E-Z Mender bracket into the ground on the other side of the post and screw it to the post if your post was leaning drastically or damaged.",
        "Skip this if the post is straight and stable after installing just 1 bracket.If you used a Post Buddy stake as an alternative, you must install a second stake opposite the first one for optimal stability.",
        "They come in sets of 2 for this reason.",
        "Installing Fix-a-Fence Braces for Posts in Concrete Purchase 1 Fix-a-Fence post brace per leaning post.",
        "A Fix-a-Fence brace is a metal brace that is meant to be set in concrete and then screwed to a leaning fence post to straighten and stabilize it.",
        "Buy 1 per post you want to fix at a home improvement center, garden center, hardware store, or online.",
        "This method works for wooden fence posts of any size that are set into concrete footings.",
        "You could also use it to straighten wooden posts set directly into the ground if you want the added stability of a brace set into concrete.",
        "Dig a hole 8 in (20 cm) away from the post with a clam-shell post digger.",
        "Center the hole behind the post in the opposite direction from that which it is leaning in.",
        "Dig it 8 in (20 cm) away from the post and 18 in (46 cm) deep.The part of the Fix-a-Fence brace that goes in the ground is 18 in (46 cm) long, so that’s why you have to dig the hole 18 in (46 cm) deep.",
        "If you don’t have a clam-shell post digger, you can use a regular spade.",
        "Try to make the sides of the hole as vertical as possible and make the hole at least 3 times wider than the pole part of the Fix-a-Fence brace.",
        "Assemble the Fix-a-Fence brace by screwing the pole into the brace.",
        "Fix-a-Fence braces come in 2 pieces.",
        "Screw the pole-shaped section into the hole underneath the short arm of  the rectangular brace section.The round pole section is what goes in the ground and the rectangular brace section is what supports the fence post.",
        "Mix a 60 lb (27 kg) bag of fast-setting concrete in a wheelbarrow.",
        "Pour the powdered concrete into a wheelbarrow.",
        "Mix it with water according to the manufacturer’s instructions, using a shovel to stir it together thoroughly.Warning: Wear a dust mask and protective eyewear when you mix concrete to avoid inhaling concrete dust.",
        "Some fast-setting concrete allows you to pour the powder into the hole first, then pour water on top.",
        "Always defer to the manufacturer’s instructions for specific mixing directions.",
        "Set the pipe straight in the hole and position the brace against the post.",
        "Have someone hold the fence post straight while you position the pole section of the brace in the hole and the rectangular part flush against the post.",
        "Keep holding the brace in place or have someone else hold it there once you find the correct position needed to straighten the fence post.",
        "Fill the hole around the brace with the mixed concrete.",
        "Carefully shovel or pour concrete from the wheelbarrow into the hole around the brace, being sure to fill it in evenly on all sides.",
        "Stop when it is even with the level of the surrounding ground.Check the position of the brace against the post again and make any minor adjustments before the concrete starts to set.",
        "You can use a pole or stick to press the concrete around the base of the brace if there are any air pockets or uneven spots.",
        "Wait 1 full day for the concrete to cure.",
        "Fast-setting concrete will set in about 4 hours, but takes a full 24 hours to cure completely.",
        "Leave the brace alone for the full duration of time to allow it to cure solidly in place before attaching it to the fence post.After the concrete is cured, you can cover it up with top soil to give it a more natural, landscaped look if you want.",
        "Attach the brace to the post using the provided screws.",
        "Have someone hold the leaning post up flush against the brace.",
        "Place the 3 provided screws through the 3 screw holes in the brace and screw them into the wood post using a wrench.",
        "The provided screws have a bolt head, rather than a standard screw head, which is why you need a wrench to screw them into the post."
    ]
}