{
    "title": "How to Crochet a Headband Ear Warmer",
    "url": "https://www.wikihow.com/Crochet-a-Headband-Ear-Warmer",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Knitting and Crochet"
    ],
    "methods": [
        {
            "name": "Starting a Chain",
            "steps": [
                {
                    "headline": "Measure your head and subtract ⁄2 in (1.3 cm) to determine the ear warmer size.",
                    "description": "Wrap a measuring tape around your head where you'd like the headband ear warmer to be. Read the measurement and subtract ⁄2 inch (1.3 cm). This is the length that you'll need to crochet in order to make the warmer. If you have trouble measuring your head, ask a friend to take the measurement for you. It's important to wrap the tape near the front of your head so it crosses over your ears and down toward the nape of your neck."
                },
                {
                    "headline": "Choose a bulky yarn in any color and get out a size K (6.5 mm) crochet hook.",
                    "description": "Pick a soft yarn in a bulky weight made of any material you like. Keep in mind that if you want to wash the head warmer easily, you should choose an acrylic or cotton yarn blend. You'll also need a size K (6.5 mm) crochet hook.Tip: Purchase a 3.5-ounce (100 g) skein that's 127 yards (116 m). You'll only need half of this amount or you can make 2 headband ear warmers from the skein. Bulky yarn is also called chunky or labeled #5."
                },
                {
                    "headline": "Make a slipknot and slide it onto your hook.",
                    "description": "Pull some of the yarn from the skein and twist the yarn so it crosses over itself and forms a loop with the tail end of the yarn on top. Hold the yarn tail in place and slide the thumb and index fingers of your other hand through the loop. Then, pinch the working yarn with these fingers and pull it back through the loop. A slip knot gets its name from the fact that if you keep pulling, the knot unravels and slips off."
                },
                {
                    "headline": "Chain stitches until the piece is as long as your adjusted measurement.",
                    "description": "Wrap the working yarn around your hook so it catches. Pull the yarn through the slip knot that's on your hook. Then, wrap the yarn around the hook again and pull it through the closest stitch. Keep doing this until the chain is as long as your adjusted head measurement. It's a good idea to keep your measuring tape handy, so you can frequently measure how wide your piece is. For example, if your measurement should be 20 ⁄2 inches (52 cm), make the foundation chain this long too."
                }
            ]
        },
        {
            "name": "Working the Ear Warmer Body",
            "steps": [
                {
                    "headline": "Join the ends and chain 1.",
                    "description": "Locate the first chain you made and insert your hook through the center of it. Wrap the yarn around your hook and pull the hook through the loop. Then, wrap the yarn around the hook again and pull it through to chain 1. Ensure that the chain isn't twisted before you join the ends or your headband won't lay flat."
                },
                {
                    "headline": "Double crochet (DC) into every chain stitch across the round.",
                    "description": "Wrap the yarn around the hook and insert it into the next chain on the round. Pull the yarn through to make a loop. Once you have 3 loops on your hook, wrap the yarn around the end and pull through all three loops. This makes a DC stitch. Repeat this for each of the chain stitches of your round."
                },
                {
                    "headline": "Join the round when you reach the end of the round.",
                    "description": "When you reach the first DC stitch that you made, insert the hook into it and wrap your yarn around the hook. Pull it through the first loop. Then, grab the loop and pull it through the remaining loop on your hook. You're making a slip stitch to join the rounds."
                },
                {
                    "headline": "Chain 1 and DC into every stitch of the second round.",
                    "description": "Wrap the yarn around your hook and pull it through to create 1 chain stitch. Then, work the double crochet stitch into each chain along the round. At this point, the headband is about 1 inch (2.5 cm) wide."
                },
                {
                    "headline": "Repeat the pattern until the headband ear warmer is as wide as you like.",
                    "description": "When you reach the end of the round, slip stitch to join it. Then, chain 1 and DC across the row. Keep working this pattern as long as you like. For a headband ear warmer that's 4 to 5 inches (10 to 13 cm) wide, make about 6 or 7 rounds."
                },
                {
                    "headline": "Chain 1 and tie it off to finish the headband ear warmer.",
                    "description": "Join your last round and make 1 chain. Then, cut the yarn and leave a 6 inches (15 cm) tail.Thread the tail through the chain and pull to make a knot. Remember to weave in both of your yarn tails before you wear the headband ear warmer.Tip: To weave the ends in, thread a yarn tail onto a tapestry needle and sew the yarn through the stitches of the closest row."
                }
            ]
        },
        {
            "name": "Trying Variations",
            "steps": [
                {
                    "headline": "Gather the center of the warmer to give it a twisted look.",
                    "description": "Instead of twisting the ends of the fabric, crochet your simple headband ear warmer and leave a long yarn tail when you reach the end. Cut the thread and slide it through a tapestry needle. Sew down through the warmer and pull the thread so the warmer bunches together. Then, remove the needle and wrap the yarn around the gathered center. Re-thread the needle once you've finished wrapping. Stitch through the back of the gathered portion, so the yarn doesn't unravel. To make the wrapped center stand out more, use a different yarn color. For example, make a black wrapped center to stand out against a bright pink ear warmer."
                },
                {
                    "headline": "Alternate colors to make a striped headband ear warmer.",
                    "description": "Once you've made a round, loosen the last loop that's on your hook and pull the tail of a new color through the loop. Cut the working yarn from the original color and tie the new color into a simple knot on the loop. Slide the knot down to the round and insert the hook through the original color loop. Pull that yarn tail and resume crocheting, but use the new color. You could switch colors every round to make thin stripes or every 2 rounds for wider stripes."
                },
                {
                    "headline": "Sew a button onto the headband for a cute accessory.",
                    "description": "Choose 1 or 2 unique buttons that match the style of your headband ear warmer and decide if you'd like buttons on the front or sides. Then, thread a tapestry needle with yarn and sew a button through its center holes so it attaches to the crochet fabric.Tip: For example, you might choose a large wooden button to stitch to the center of a rustic ear warmer or you could sew two small brass buttons onto a bright, colorful ear warmer. There's no need to make buttonholes since you're not actually buttoning the headband ear warmer."
                },
                {
                    "headline": "Use different crochet stitches to make a unique texture.",
                    "description": "If you're comfortable making other crochet stitches, such as single crochet and half-double crochet, alternate these stitches to make a different texture for your ear warmer. For example, use a combination of half-double crochet stitches to make a simple ribbed ear warmer. To make a bouncy waffle texture, try the bead stitch along with single crochet stitches."
                }
            ]
        }
    ],
    "tyn": [
        "Measuring tape",
        "Yarn",
        "Crochet hooks",
        "Scissors",
        "Tapestry needle"
    ],
    "text": " Starting a Chain Measure your head and subtract ⁄2 in (1.3 cm) to determine the ear warmer size. Wrap a measuring tape around your head where you'd like the headband ear warmer to be. Read the measurement and subtract ⁄2 inch (1.3 cm). This is the length that you'll need to crochet in order to make the warmer. If you have trouble measuring your head, ask a friend to take the measurement for you. It's important to wrap the tape near the front of your head so it crosses over your ears and down toward the nape of your neck. Choose a bulky yarn in any color and get out a size K (6.5 mm) crochet hook. Pick a soft yarn in a bulky weight made of any material you like. Keep in mind that if you want to wash the head warmer easily, you should choose an acrylic or cotton yarn blend. You'll also need a size K (6.5 mm) crochet hook.Tip: Purchase a 3.5-ounce (100 g) skein that's 127 yards (116 m). You'll only need half of this amount or you can make 2 headband ear warmers from the skein. Bulky yarn is also called chunky or labeled #5. Make a slipknot and slide it onto your hook. Pull some of the yarn from the skein and twist the yarn so it crosses over itself and forms a loop with the tail end of the yarn on top. Hold the yarn tail in place and slide the thumb and index fingers of your other hand through the loop. Then, pinch the working yarn with these fingers and pull it back through the loop. A slip knot gets its name from the fact that if you keep pulling, the knot unravels and slips off. Chain stitches until the piece is as long as your adjusted measurement. Wrap the working yarn around your hook so it catches. Pull the yarn through the slip knot that's on your hook. Then, wrap the yarn around the hook again and pull it through the closest stitch. Keep doing this until the chain is as long as your adjusted head measurement. It's a good idea to keep your measuring tape handy, so you can frequently measure how wide your piece is. For example, if your measurement should be 20 ⁄2 inches (52 cm), make the foundation chain this long too. Working the Ear Warmer Body Join the ends and chain 1. Locate the first chain you made and insert your hook through the center of it. Wrap the yarn around your hook and pull the hook through the loop. Then, wrap the yarn around the hook again and pull it through to chain 1. Ensure that the chain isn't twisted before you join the ends or your headband won't lay flat. Double crochet (DC) into every chain stitch across the round. Wrap the yarn around the hook and insert it into the next chain on the round. Pull the yarn through to make a loop. Once you have 3 loops on your hook, wrap the yarn around the end and pull through all three loops. This makes a DC stitch. Repeat this for each of the chain stitches of your round. Join the round when you reach the end of the round. When you reach the first DC stitch that you made, insert the hook into it and wrap your yarn around the hook. Pull it through the first loop. Then, grab the loop and pull it through the remaining loop on your hook. You're making a slip stitch to join the rounds. Chain 1 and DC into every stitch of the second round. Wrap the yarn around your hook and pull it through to create 1 chain stitch. Then, work the double crochet stitch into each chain along the round. At this point, the headband is about 1 inch (2.5 cm) wide. Repeat the pattern until the headband ear warmer is as wide as you like. When you reach the end of the round, slip stitch to join it. Then, chain 1 and DC across the row. Keep working this pattern as long as you like. For a headband ear warmer that's 4 to 5 inches (10 to 13 cm) wide, make about 6 or 7 rounds. Chain 1 and tie it off to finish the headband ear warmer. Join your last round and make 1 chain. Then, cut the yarn and leave a 6 inches (15 cm) tail.Thread the tail through the chain and pull to make a knot. Remember to weave in both of your yarn tails before you wear the headband ear warmer.Tip: To weave the ends in, thread a yarn tail onto a tapestry needle and sew the yarn through the stitches of the closest row. Trying Variations Gather the center of the warmer to give it a twisted look. Instead of twisting the ends of the fabric, crochet your simple headband ear warmer and leave a long yarn tail when you reach the end. Cut the thread and slide it through a tapestry needle. Sew down through the warmer and pull the thread so the warmer bunches together. Then, remove the needle and wrap the yarn around the gathered center. Re-thread the needle once you've finished wrapping. Stitch through the back of the gathered portion, so the yarn doesn't unravel. To make the wrapped center stand out more, use a different yarn color. For example, make a black wrapped center to stand out against a bright pink ear warmer. Alternate colors to make a striped headband ear warmer. Once you've made a round, loosen the last loop that's on your hook and pull the tail of a new color through the loop. Cut the working yarn from the original color and tie the new color into a simple knot on the loop. Slide the knot down to the round and insert the hook through the original color loop. Pull that yarn tail and resume crocheting, but use the new color. You could switch colors every round to make thin stripes or every 2 rounds for wider stripes. Sew a button onto the headband for a cute accessory. Choose 1 or 2 unique buttons that match the style of your headband ear warmer and decide if you'd like buttons on the front or sides. Then, thread a tapestry needle with yarn and sew a button through its center holes so it attaches to the crochet fabric.Tip: For example, you might choose a large wooden button to stitch to the center of a rustic ear warmer or you could sew two small brass buttons onto a bright, colorful ear warmer. There's no need to make buttonholes since you're not actually buttoning the headband ear warmer. Use different crochet stitches to make a unique texture. If you're comfortable making other crochet stitches, such as single crochet and half-double crochet, alternate these stitches to make a different texture for your ear warmer. For example, use a combination of half-double crochet stitches to make a simple ribbed ear warmer. To make a bouncy waffle texture, try the bead stitch along with single crochet stitches.",
    "sentences": [
        " Starting a Chain Measure your head and subtract ⁄2 in (1.3 cm) to determine the ear warmer size.",
        "Wrap a measuring tape around your head where you'd like the headband ear warmer to be.",
        "Read the measurement and subtract ⁄2 inch (1.3 cm).",
        "This is the length that you'll need to crochet in order to make the warmer.",
        "If you have trouble measuring your head, ask a friend to take the measurement for you.",
        "It's important to wrap the tape near the front of your head so it crosses over your ears and down toward the nape of your neck.",
        "Choose a bulky yarn in any color and get out a size K (6.5 mm) crochet hook.",
        "Pick a soft yarn in a bulky weight made of any material you like.",
        "Keep in mind that if you want to wash the head warmer easily, you should choose an acrylic or cotton yarn blend.",
        "You'll also need a size K (6.5 mm) crochet hook.Tip: Purchase a 3.5-ounce (100 g) skein that's 127 yards (116 m).",
        "You'll only need half of this amount or you can make 2 headband ear warmers from the skein.",
        "Bulky yarn is also called chunky or labeled #5.",
        "Make a slipknot and slide it onto your hook.",
        "Pull some of the yarn from the skein and twist the yarn so it crosses over itself and forms a loop with the tail end of the yarn on top.",
        "Hold the yarn tail in place and slide the thumb and index fingers of your other hand through the loop.",
        "Then, pinch the working yarn with these fingers and pull it back through the loop.",
        "A slip knot gets its name from the fact that if you keep pulling, the knot unravels and slips off.",
        "Chain stitches until the piece is as long as your adjusted measurement.",
        "Wrap the working yarn around your hook so it catches.",
        "Pull the yarn through the slip knot that's on your hook.",
        "Then, wrap the yarn around the hook again and pull it through the closest stitch.",
        "Keep doing this until the chain is as long as your adjusted head measurement.",
        "It's a good idea to keep your measuring tape handy, so you can frequently measure how wide your piece is.",
        "For example, if your measurement should be 20 ⁄2 inches (52 cm), make the foundation chain this long too.",
        "Working the Ear Warmer Body Join the ends and chain 1.",
        "Locate the first chain you made and insert your hook through the center of it.",
        "Wrap the yarn around your hook and pull the hook through the loop.",
        "Then, wrap the yarn around the hook again and pull it through to chain 1.",
        "Ensure that the chain isn't twisted before you join the ends or your headband won't lay flat.",
        "Double crochet (DC) into every chain stitch across the round.",
        "Wrap the yarn around the hook and insert it into the next chain on the round.",
        "Pull the yarn through to make a loop.",
        "Once you have 3 loops on your hook, wrap the yarn around the end and pull through all three loops.",
        "This makes a DC stitch.",
        "Repeat this for each of the chain stitches of your round.",
        "Join the round when you reach the end of the round.",
        "When you reach the first DC stitch that you made, insert the hook into it and wrap your yarn around the hook.",
        "Pull it through the first loop.",
        "Then, grab the loop and pull it through the remaining loop on your hook.",
        "You're making a slip stitch to join the rounds.",
        "Chain 1 and DC into every stitch of the second round.",
        "Wrap the yarn around your hook and pull it through to create 1 chain stitch.",
        "Then, work the double crochet stitch into each chain along the round.",
        "At this point, the headband is about 1 inch (2.5 cm) wide.",
        "Repeat the pattern until the headband ear warmer is as wide as you like.",
        "When you reach the end of the round, slip stitch to join it.",
        "Then, chain 1 and DC across the row.",
        "Keep working this pattern as long as you like.",
        "For a headband ear warmer that's 4 to 5 inches (10 to 13 cm) wide, make about 6 or 7 rounds.",
        "Chain 1 and tie it off to finish the headband ear warmer.",
        "Join your last round and make 1 chain.",
        "Then, cut the yarn and leave a 6 inches (15 cm) tail.Thread the tail through the chain and pull to make a knot.",
        "Remember to weave in both of your yarn tails before you wear the headband ear warmer.Tip: To weave the ends in, thread a yarn tail onto a tapestry needle and sew the yarn through the stitches of the closest row.",
        "Trying Variations Gather the center of the warmer to give it a twisted look.",
        "Instead of twisting the ends of the fabric, crochet your simple headband ear warmer and leave a long yarn tail when you reach the end.",
        "Cut the thread and slide it through a tapestry needle.",
        "Sew down through the warmer and pull the thread so the warmer bunches together.",
        "Then, remove the needle and wrap the yarn around the gathered center.",
        "Re-thread the needle once you've finished wrapping.",
        "Stitch through the back of the gathered portion, so the yarn doesn't unravel.",
        "To make the wrapped center stand out more, use a different yarn color.",
        "For example, make a black wrapped center to stand out against a bright pink ear warmer.",
        "Alternate colors to make a striped headband ear warmer.",
        "Once you've made a round, loosen the last loop that's on your hook and pull the tail of a new color through the loop.",
        "Cut the working yarn from the original color and tie the new color into a simple knot on the loop.",
        "Slide the knot down to the round and insert the hook through the original color loop.",
        "Pull that yarn tail and resume crocheting, but use the new color.",
        "You could switch colors every round to make thin stripes or every 2 rounds for wider stripes.",
        "Sew a button onto the headband for a cute accessory.",
        "Choose 1 or 2 unique buttons that match the style of your headband ear warmer and decide if you'd like buttons on the front or sides.",
        "Then, thread a tapestry needle with yarn and sew a button through its center holes so it attaches to the crochet fabric.Tip: For example, you might choose a large wooden button to stitch to the center of a rustic ear warmer or you could sew two small brass buttons onto a bright, colorful ear warmer.",
        "There's no need to make buttonholes since you're not actually buttoning the headband ear warmer.",
        "Use different crochet stitches to make a unique texture.",
        "If you're comfortable making other crochet stitches, such as single crochet and half-double crochet, alternate these stitches to make a different texture for your ear warmer.",
        "For example, use a combination of half-double crochet stitches to make a simple ribbed ear warmer.",
        "To make a bouncy waffle texture, try the bead stitch along with single crochet stitches."
    ]
}