{
    "title": "How to Freeze Raspberries",
    "url": "https://www.wikihow.com/Freeze-Raspberries",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Food Preservation Techniques",
        "Freezing Food"
    ],
    "parts": [
        {
            "name": "Choosing Raspberries",
            "steps": [
                {
                    "headline": "Know the peak season.",
                    "description": "During peak season, foods are usually the freshest, taste the best, and are least expensive. Peak season for raspberries is usually May through September."
                },
                {
                    "headline": "Look at the berries' color.",
                    "description": "Ripe raspberries should be bright red and evenly colored. Dark colored berries may be overripe and won't taste the best. Dark sections on the berries are probably just bruises, which are harmless."
                },
                {
                    "headline": "Feel the fruit.",
                    "description": "Although raspberries are very fragile, they should still be firm to the touch. Gently press on the berries. If they give very easily or are too mushy, they're probably overripe."
                },
                {
                    "headline": "Avoid overly damp or moist containers.",
                    "description": "This can be a sign of overly ripe fruit and is a good environment for mold to grow in."
                },
                {
                    "headline": "Check the container for mold.",
                    "description": "If you see any white or green fuzz on the berries, avoid buying the container. If you've already taken a container home and find mold, be sure to get rid of any berries with mold on them to stop it from spreading. Also get rid of any overly mushy berries, as these are a breeding ground for mold."
                }
            ]
        },
        {
            "name": "Freezing the Raspberries",
            "steps": [
                {
                    "headline": "Rinse the raspberries in cold water.",
                    "description": "Don't rinse the berries directly under running water- they are fragile and can break apart. Instead, place them in a colander. Then dip the colander in a bowl filled with cold water and swish the berries around."
                },
                {
                    "headline": "Allow the berries to dry.",
                    "description": "The fastest way to do this is by spreading them out on a paper towel."
                },
                {
                    "headline": "Place a sheet of wax paper across a baking tray.",
                    "description": ""
                },
                {
                    "headline": "Place the raspberries across the baking tray in a single layer.",
                    "description": "Don't allow the berries to touch. They will freeze together and you'll destroy them trying to get them apart."
                },
                {
                    "headline": "Place the tray in the freezer.",
                    "description": ""
                },
                {
                    "headline": "Leave the berries in the freezer for one day.",
                    "description": "You want to make sure the berries are frozen solid before removing them from the freezer. But leaving them in uncovered for more than a few days will lead to freezer burn, so make sure you don't leave them in much more than a day."
                },
                {
                    "headline": "Remove the frozen raspberries from the freezer the next day.",
                    "description": "Take them off the sheet and place them in either a freezer bag or a freezer container. Then place them back in the freezer."
                },
                {
                    "headline": "Add sugar if you want.",
                    "description": "As a tasty alternative, you can sweeten the raspberries by adding sugar when you freeze them. Place a small amount of frozen raspberries in the bag. Then sprinkle sugar on top of the berries. Repeat this layering process until the bag is full. Let the fruit defrost for about 15 minutes. This will allow the berries to absorb the sugar. Then seal the container and place it in the freezer."
                },
                {
                    "headline": "Remove the raspberries as needed.",
                    "description": "They can stay for up to a year in the freezer. The berries can be eaten while still frozen, or allowed to defrost."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Raspberries",
        "Baking tray (baking sheet)",
        "Baking paper (parchment paper)",
        "Colander",
        "Sugar (if wanted)"
    ],
    "text": " Choosing Raspberries Know the peak season. During peak season, foods are usually the freshest, taste the best, and are least expensive. Peak season for raspberries is usually May through September. Look at the berries' color. Ripe raspberries should be bright red and evenly colored. Dark colored berries may be overripe and won't taste the best. Dark sections on the berries are probably just bruises, which are harmless. Feel the fruit. Although raspberries are very fragile, they should still be firm to the touch. Gently press on the berries. If they give very easily or are too mushy, they're probably overripe. Avoid overly damp or moist containers. This can be a sign of overly ripe fruit and is a good environment for mold to grow in. Check the container for mold. If you see any white or green fuzz on the berries, avoid buying the container. If you've already taken a container home and find mold, be sure to get rid of any berries with mold on them to stop it from spreading. Also get rid of any overly mushy berries, as these are a breeding ground for mold. Freezing the Raspberries Rinse the raspberries in cold water. Don't rinse the berries directly under running water- they are fragile and can break apart. Instead, place them in a colander. Then dip the colander in a bowl filled with cold water and swish the berries around. Allow the berries to dry. The fastest way to do this is by spreading them out on a paper towel. Place a sheet of wax paper across a baking tray.  Place the raspberries across the baking tray in a single layer. Don't allow the berries to touch. They will freeze together and you'll destroy them trying to get them apart. Place the tray in the freezer.  Leave the berries in the freezer for one day. You want to make sure the berries are frozen solid before removing them from the freezer. But leaving them in uncovered for more than a few days will lead to freezer burn, so make sure you don't leave them in much more than a day. Remove the frozen raspberries from the freezer the next day. Take them off the sheet and place them in either a freezer bag or a freezer container. Then place them back in the freezer. Add sugar if you want. As a tasty alternative, you can sweeten the raspberries by adding sugar when you freeze them. Place a small amount of frozen raspberries in the bag. Then sprinkle sugar on top of the berries. Repeat this layering process until the bag is full. Let the fruit defrost for about 15 minutes. This will allow the berries to absorb the sugar. Then seal the container and place it in the freezer. Remove the raspberries as needed. They can stay for up to a year in the freezer. The berries can be eaten while still frozen, or allowed to defrost. Finished. ",
    "sentences": [
        " Choosing Raspberries Know the peak season.",
        "During peak season, foods are usually the freshest, taste the best, and are least expensive.",
        "Peak season for raspberries is usually May through September.",
        "Look at the berries' color.",
        "Ripe raspberries should be bright red and evenly colored.",
        "Dark colored berries may be overripe and won't taste the best.",
        "Dark sections on the berries are probably just bruises, which are harmless.",
        "Feel the fruit.",
        "Although raspberries are very fragile, they should still be firm to the touch.",
        "Gently press on the berries.",
        "If they give very easily or are too mushy, they're probably overripe.",
        "Avoid overly damp or moist containers.",
        "This can be a sign of overly ripe fruit and is a good environment for mold to grow in.",
        "Check the container for mold.",
        "If you see any white or green fuzz on the berries, avoid buying the container.",
        "If you've already taken a container home and find mold, be sure to get rid of any berries with mold on them to stop it from spreading.",
        "Also get rid of any overly mushy berries, as these are a breeding ground for mold.",
        "Freezing the Raspberries Rinse the raspberries in cold water.",
        "Don't rinse the berries directly under running water- they are fragile and can break apart.",
        "Instead, place them in a colander.",
        "Then dip the colander in a bowl filled with cold water and swish the berries around.",
        "Allow the berries to dry.",
        "The fastest way to do this is by spreading them out on a paper towel.",
        "Place a sheet of wax paper across a baking tray.",
        "Place the raspberries across the baking tray in a single layer.",
        "Don't allow the berries to touch.",
        "They will freeze together and you'll destroy them trying to get them apart.",
        "Place the tray in the freezer.",
        "Leave the berries in the freezer for one day.",
        "You want to make sure the berries are frozen solid before removing them from the freezer.",
        "But leaving them in uncovered for more than a few days will lead to freezer burn, so make sure you don't leave them in much more than a day.",
        "Remove the frozen raspberries from the freezer the next day.",
        "Take them off the sheet and place them in either a freezer bag or a freezer container.",
        "Then place them back in the freezer.",
        "Add sugar if you want.",
        "As a tasty alternative, you can sweeten the raspberries by adding sugar when you freeze them.",
        "Place a small amount of frozen raspberries in the bag.",
        "Then sprinkle sugar on top of the berries.",
        "Repeat this layering process until the bag is full.",
        "Let the fruit defrost for about 15 minutes.",
        "This will allow the berries to absorb the sugar.",
        "Then seal the container and place it in the freezer.",
        "Remove the raspberries as needed.",
        "They can stay for up to a year in the freezer.",
        "The berries can be eaten while still frozen, or allowed to defrost.",
        "Finished."
    ]
}