{
    "title": "How to Prepare Soil for the Application of Fertiliser",
    "url": "https://www.wikihow.com/Prepare-Soil-for-the-Application-of-Fertiliser",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Compost Mulch and Soil Preparation",
        "Fertilizers"
    ],
    "methods": [
        {
            "name": "Improving the Quality of Your Soil",
            "steps": [
                {
                    "headline": "Send a sample of soil to a local cooperative extension.",
                    "description": "Collect a sample of your soil by digging a couple of holes that are 5–6 inches (13–15 cm) deep. Then, store the soil in an airtight plastic container or sealable bag and send it to the cooperative extension for tests. They will evaluate the soil and give you recommendations for amendments and fertilizers. Cooperative extension offices test and study agriculture and the environment and can be found at certain universities. Contact your local cooperative extension to see if they have kits that you can use to collect the sample. Soil tests will determine the soil’s level of nitrogen, phosphorus, and potassium, as well as the soil’s pH level."
                },
                {
                    "headline": "Use a home test instead of sending your soil for analysis.",
                    "description": "If you don’t want to send your soil for analysis, you can buy a test strip soil test or pH meter to test your soil instead. Test strip take-home kits will tell you the level of certain nutrients in your soil, while the pH meter will only be able to read the soil's pH level. You can purchase either of these tests online or at a hardware store. Read the instructions on the test before using it. Home tests won’t be as accurate as a lab testing your soil."
                },
                {
                    "headline": "Purchase amendments that regulate your soil’s pH.",
                    "description": "A pH level of 6.5-6.8 is healthy for most plants. Organic amendments include things like wood chips and compost while inorganic amendments include things like perlite and vermiculite. Follow the recommendations on the soil test, or find amendments that will regulate your soil’s pH level. Lime will increase the soil’s pH level. Ammonium sulfate is high in nitrogen and will reduce a soil’s pH level."
                }
            ]
        },
        {
            "name": "Adding Organic Material to the Soil",
            "steps": [
                {
                    "headline": "Remove large stones and sticks from the soil.",
                    "description": "Before you add fertilizer to the soil, you’ll want to remove large stones to make it easier to till. You can leave smaller sticks to decay and become organic material later. Wear gloves while gardening."
                },
                {
                    "headline": "Loosen up the soil with a pitchfork or shovel.",
                    "description": "Dig about 12–14 inches (30–36 cm) into the ground and turn the soil over to loosen it. Continue to move over the lawn in sections until you loosen all of the soil that you want to add fertilizer to."
                },
                {
                    "headline": "Add 2 inches (5.1 cm) of organic material over the surface of the soil.",
                    "description": "Use the organic material that was recommended by your soil test. Spread the compost or other organic material over the surface of the soil and use a tiller or pitchfork to evenly distribute it. If you are fertilizing a large piece of land, you can use a push or hand spreader to apply the organic material."
                },
                {
                    "headline": "Use a tiller or pitchfork to mix the compost in.",
                    "description": "The compost must be thoroughly mixed in with the soil so that the soil can benefit from the added nutrients in the compost. Use a tiller or pitchfork to aerate the soil again, except this time you’ll be incorporating the organic material with the existing soil."
                },
                {
                    "headline": "Level out the top surface of the soil.",
                    "description": "Run the tiller lightly across the surface of the soil and organic material. This will level out the soil and make it easier to plant things later. If you’ve done everything correctly, your soil should be ready for fertilizer."
                }
            ]
        }
    ],
    "tyn": [
        "Improving the Quality of your Soil",
        "Garden spade",
        "Sealable bag or plastic container",
        "Take home soil test (optional)",
        "Preparing the Soil",
        "Till or pitchfork",
        "Soil amendments",
        "Gardening gloves"
    ],
    "text": " Improving the Quality of Your Soil Send a sample of soil to a local cooperative extension. Collect a sample of your soil by digging a couple of holes that are 5–6 inches (13–15 cm) deep. Then, store the soil in an airtight plastic container or sealable bag and send it to the cooperative extension for tests. They will evaluate the soil and give you recommendations for amendments and fertilizers. Cooperative extension offices test and study agriculture and the environment and can be found at certain universities. Contact your local cooperative extension to see if they have kits that you can use to collect the sample. Soil tests will determine the soil’s level of nitrogen, phosphorus, and potassium, as well as the soil’s pH level. Use a home test instead of sending your soil for analysis. If you don’t want to send your soil for analysis, you can buy a test strip soil test or pH meter to test your soil instead. Test strip take-home kits will tell you the level of certain nutrients in your soil, while the pH meter will only be able to read the soil's pH level. You can purchase either of these tests online or at a hardware store. Read the instructions on the test before using it. Home tests won’t be as accurate as a lab testing your soil. Purchase amendments that regulate your soil’s pH. A pH level of 6.5-6.8 is healthy for most plants. Organic amendments include things like wood chips and compost while inorganic amendments include things like perlite and vermiculite. Follow the recommendations on the soil test, or find amendments that will regulate your soil’s pH level. Lime will increase the soil’s pH level. Ammonium sulfate is high in nitrogen and will reduce a soil’s pH level. Adding Organic Material to the Soil Remove large stones and sticks from the soil. Before you add fertilizer to the soil, you’ll want to remove large stones to make it easier to till. You can leave smaller sticks to decay and become organic material later. Wear gloves while gardening. Loosen up the soil with a pitchfork or shovel. Dig about 12–14 inches (30–36 cm) into the ground and turn the soil over to loosen it. Continue to move over the lawn in sections until you loosen all of the soil that you want to add fertilizer to. Add 2 inches (5.1 cm) of organic material over the surface of the soil. Use the organic material that was recommended by your soil test. Spread the compost or other organic material over the surface of the soil and use a tiller or pitchfork to evenly distribute it. If you are fertilizing a large piece of land, you can use a push or hand spreader to apply the organic material. Use a tiller or pitchfork to mix the compost in. The compost must be thoroughly mixed in with the soil so that the soil can benefit from the added nutrients in the compost. Use a tiller or pitchfork to aerate the soil again, except this time you’ll be incorporating the organic material with the existing soil. Level out the top surface of the soil. Run the tiller lightly across the surface of the soil and organic material. This will level out the soil and make it easier to plant things later. If you’ve done everything correctly, your soil should be ready for fertilizer.",
    "sentences": [
        " Improving the Quality of Your Soil Send a sample of soil to a local cooperative extension.",
        "Collect a sample of your soil by digging a couple of holes that are 5–6 inches (13–15 cm) deep.",
        "Then, store the soil in an airtight plastic container or sealable bag and send it to the cooperative extension for tests.",
        "They will evaluate the soil and give you recommendations for amendments and fertilizers.",
        "Cooperative extension offices test and study agriculture and the environment and can be found at certain universities.",
        "Contact your local cooperative extension to see if they have kits that you can use to collect the sample.",
        "Soil tests will determine the soil’s level of nitrogen, phosphorus, and potassium, as well as the soil’s pH level.",
        "Use a home test instead of sending your soil for analysis.",
        "If you don’t want to send your soil for analysis, you can buy a test strip soil test or pH meter to test your soil instead.",
        "Test strip take-home kits will tell you the level of certain nutrients in your soil, while the pH meter will only be able to read the soil's pH level.",
        "You can purchase either of these tests online or at a hardware store.",
        "Read the instructions on the test before using it.",
        "Home tests won’t be as accurate as a lab testing your soil.",
        "Purchase amendments that regulate your soil’s pH.",
        "A pH level of 6.5-6.8 is healthy for most plants.",
        "Organic amendments include things like wood chips and compost while inorganic amendments include things like perlite and vermiculite.",
        "Follow the recommendations on the soil test, or find amendments that will regulate your soil’s pH level.",
        "Lime will increase the soil’s pH level.",
        "Ammonium sulfate is high in nitrogen and will reduce a soil’s pH level.",
        "Adding Organic Material to the Soil Remove large stones and sticks from the soil.",
        "Before you add fertilizer to the soil, you’ll want to remove large stones to make it easier to till.",
        "You can leave smaller sticks to decay and become organic material later.",
        "Wear gloves while gardening.",
        "Loosen up the soil with a pitchfork or shovel.",
        "Dig about 12–14 inches (30–36 cm) into the ground and turn the soil over to loosen it.",
        "Continue to move over the lawn in sections until you loosen all of the soil that you want to add fertilizer to.",
        "Add 2 inches (5.1 cm) of organic material over the surface of the soil.",
        "Use the organic material that was recommended by your soil test.",
        "Spread the compost or other organic material over the surface of the soil and use a tiller or pitchfork to evenly distribute it.",
        "If you are fertilizing a large piece of land, you can use a push or hand spreader to apply the organic material.",
        "Use a tiller or pitchfork to mix the compost in.",
        "The compost must be thoroughly mixed in with the soil so that the soil can benefit from the added nutrients in the compost.",
        "Use a tiller or pitchfork to aerate the soil again, except this time you’ll be incorporating the organic material with the existing soil.",
        "Level out the top surface of the soil.",
        "Run the tiller lightly across the surface of the soil and organic material.",
        "This will level out the soil and make it easier to plant things later.",
        "If you’ve done everything correctly, your soil should be ready for fertilizer."
    ]
}