{
    "title": "How to Play Ninja",
    "url": "https://www.wikihow.com/Play-Ninja",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Backyard Games",
        "Hiding Games"
    ],
    "methods": [
        {
            "name": "Ninja with a Torch (Flashlight)",
            "steps": [
                {
                    "headline": "Name one person the guard.",
                    "description": "They will carry a torch."
                },
                {
                    "headline": "Wait until nighttime.",
                    "description": "Find an area or object the guard has to protect. The darker, the better."
                },
                {
                    "headline": "Have the guard walk around the area or object.",
                    "description": "This should be done slowly, while carrying the torch (off)."
                },
                {
                    "headline": "Everybody else is called a Ninja, and must go to or touch the area/thing.",
                    "description": ""
                },
                {
                    "headline": "If you are the Guard, shine the flashlight when you think you hear/see someone.",
                    "description": "It may only be turned on for 3 seconds at a time. Say the name of the person you've caught—if you're right the person is out (or must return to the beginning, your choice), if you're wrong they can keep playing."
                },
                {
                    "headline": "The game is over when a ninja touches the area or object being guarded.",
                    "description": "If there are no ninjas left in the game, then the guard wins."
                },
                {
                    "headline": "Whoever wins has to be the guard, or if the guard wins, they may choose the next guard.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Ninja Hand Game",
            "steps": [
                {
                    "headline": "Get participants into a circle all with hands together",
                    "description": ""
                },
                {
                    "headline": "Have someone count \"3,2,1, NINJA!\"",
                    "description": ""
                },
                {
                    "headline": "Once Ninja is said, participants must jump moving their hands and feet into best position to attack and defend.",
                    "description": ""
                },
                {
                    "headline": "Turns go counter-clockwise around the circle.",
                    "description": "To attack, quickly try to make contact with any other participants hands. To defend, you have to try to dodge the attack by moving your hands away from your attacker. Once you finish moving, both the attacker and defender must maintain their position until the next turn."
                },
                {
                    "headline": "Sit out if your hand gets touched by an attacker.",
                    "description": "You're also out if you break your final position before it's your turn."
                },
                {
                    "headline": "The game is over when only one person remains.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Flash Light",
        "Dark clothes",
        "Object of guarding",
        "At least 3 people"
    ],
    "text": " Ninja with a Torch (Flashlight) Name one person the guard. They will carry a torch. Wait until nighttime. Find an area or object the guard has to protect. The darker, the better. Have the guard walk around the area or object. This should be done slowly, while carrying the torch (off). Everybody else is called a Ninja, and must go to or touch the area/thing.  If you are the Guard, shine the flashlight when you think you hear/see someone. It may only be turned on for 3 seconds at a time. Say the name of the person you've caught—if you're right the person is out (or must return to the beginning, your choice), if you're wrong they can keep playing. The game is over when a ninja touches the area or object being guarded. If there are no ninjas left in the game, then the guard wins. Whoever wins has to be the guard, or if the guard wins, they may choose the next guard.  Ninja Hand Game Get participants into a circle all with hands together  Have someone count \"3,2,1, NINJA!\"  Once Ninja is said, participants must jump moving their hands and feet into best position to attack and defend.  Turns go counter-clockwise around the circle. To attack, quickly try to make contact with any other participants hands. To defend, you have to try to dodge the attack by moving your hands away from your attacker. Once you finish moving, both the attacker and defender must maintain their position until the next turn. Sit out if your hand gets touched by an attacker. You're also out if you break your final position before it's your turn. The game is over when only one person remains. ",
    "sentences": [
        " Ninja with a Torch (Flashlight) Name one person the guard.",
        "They will carry a torch.",
        "Wait until nighttime.",
        "Find an area or object the guard has to protect.",
        "The darker, the better.",
        "Have the guard walk around the area or object.",
        "This should be done slowly, while carrying the torch (off).",
        "Everybody else is called a Ninja, and must go to or touch the area/thing.",
        "If you are the Guard, shine the flashlight when you think you hear/see someone.",
        "It may only be turned on for 3 seconds at a time.",
        "Say the name of the person you've caught—if you're right the person is out (or must return to the beginning, your choice), if you're wrong they can keep playing.",
        "The game is over when a ninja touches the area or object being guarded.",
        "If there are no ninjas left in the game, then the guard wins.",
        "Whoever wins has to be the guard, or if the guard wins, they may choose the next guard.",
        "Ninja Hand Game Get participants into a circle all with hands together  Have someone count \"3,2,1, NINJA!\"",
        "Once Ninja is said, participants must jump moving their hands and feet into best position to attack and defend.",
        "Turns go counter-clockwise around the circle.",
        "To attack, quickly try to make contact with any other participants hands.",
        "To defend, you have to try to dodge the attack by moving your hands away from your attacker.",
        "Once you finish moving, both the attacker and defender must maintain their position until the next turn.",
        "Sit out if your hand gets touched by an attacker.",
        "You're also out if you break your final position before it's your turn.",
        "The game is over when only one person remains."
    ]
}