{
    "title": "How to Sew a Cutlery Pouch for a Lunchbox",
    "url": "https://www.wikihow.com/Sew-a-Cutlery-Pouch-for-a-Lunchbox",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Sewing",
        "Sewing Crafts",
        "Sewing Kitchen Accessories"
    ],
    "steps": [
        {
            "headline": "Start with any appropriate scrap of sturdy material.",
            "description": "This material is cut from the leg of an old pair of jeans that has already been used for various other projects. You could also use part of an old dishtowel, fabric napkin, or other leftover fabric. Make sure the fabric is sturdy, washable, and clean."
        },
        {
            "headline": "Make a simple, rectangular pattern.",
            "description": "The pattern used here is a business sized mailing envelope 4 1/4 x 9 1/2 inches long (10.5 x 24cm). You can adjust the size for your cutlery, but remember to leave a seam allowance. Make the smaller rectangle at least an inch (2.5cm) longer than the longest item you wish to carry."
        },
        {
            "headline": "Cut two pieces of the fabric.",
            "description": "Place the long direction of the pattern with the grain of the fabric. Make one piece the size of the pattern and the other a bit longer. If the fabric already had a hem on one end, allow an extra inch (2.5cm) on the hemmed piece. If the fabric does not have an existing hem, allow an extra two inches (5cm)."
        },
        {
            "headline": "Hem one end of each rectangle of fabric.",
            "description": "Fold the fabric over and sew a straight hem. If the fabric already has a hem, skip this step."
        },
        {
            "headline": "Place the fabric right sides together and align the ends without the hems.",
            "description": "One hem should extend an inch (2.5cm) or more past the other hem."
        },
        {
            "headline": "Lift the shorter piece and fold the longer piece over as shown.",
            "description": ""
        },
        {
            "headline": "Set the shorter piece back down on top.",
            "description": "The hem of the longer piece should extend down past the hem of the shorter piece, and the folds should lie as shown. For ease of sewing, the hems should not be right on top of each other. You can trim the opposite ends (the ends without the hem) at this point if you need to adjust a bit."
        },
        {
            "headline": "Stitch around the three sides that are not folded.",
            "description": "This is a seam allowance of about 1/2 inch (12mm). (The dark pen line is to show the location of the stitching in the photo. It is not necessary to draw the line.)"
        },
        {
            "headline": "Cut corner reliefs so that the fabric will not bunch up when you turn it right side out.",
            "description": ""
        },
        {
            "headline": "Turn the large end right side out.",
            "description": "You can use the closed tip of a pair of scissors or the eraser end of a pencil to push the corners all the way out."
        },
        {
            "headline": "Turn the small end right side out.",
            "description": ""
        },
        {
            "headline": "Try out your pouch with the items you'd like to carry.",
            "description": ""
        }
    ],
    "tyn": [
        "Scrap denim or fabric",
        "Pattern paper and markers",
        "Scissors",
        "Sewing pins",
        "Sewing machine",
        "Thread"
    ],
    "text": " Start with any appropriate scrap of sturdy material. This material is cut from the leg of an old pair of jeans that has already been used for various other projects. You could also use part of an old dishtowel, fabric napkin, or other leftover fabric. Make sure the fabric is sturdy, washable, and clean. Make a simple, rectangular pattern. The pattern used here is a business sized mailing envelope 4 1/4 x 9 1/2 inches long (10.5 x 24cm). You can adjust the size for your cutlery, but remember to leave a seam allowance. Make the smaller rectangle at least an inch (2.5cm) longer than the longest item you wish to carry. Cut two pieces of the fabric. Place the long direction of the pattern with the grain of the fabric. Make one piece the size of the pattern and the other a bit longer. If the fabric already had a hem on one end, allow an extra inch (2.5cm) on the hemmed piece. If the fabric does not have an existing hem, allow an extra two inches (5cm). Hem one end of each rectangle of fabric. Fold the fabric over and sew a straight hem. If the fabric already has a hem, skip this step. Place the fabric right sides together and align the ends without the hems. One hem should extend an inch (2.5cm) or more past the other hem. Lift the shorter piece and fold the longer piece over as shown.  Set the shorter piece back down on top. The hem of the longer piece should extend down past the hem of the shorter piece, and the folds should lie as shown. For ease of sewing, the hems should not be right on top of each other. You can trim the opposite ends (the ends without the hem) at this point if you need to adjust a bit. Stitch around the three sides that are not folded. This is a seam allowance of about 1/2 inch (12mm). (The dark pen line is to show the location of the stitching in the photo. It is not necessary to draw the line.) Cut corner reliefs so that the fabric will not bunch up when you turn it right side out.  Turn the large end right side out. You can use the closed tip of a pair of scissors or the eraser end of a pencil to push the corners all the way out. Turn the small end right side out.  Try out your pouch with the items you'd like to carry. ",
    "sentences": [
        " Start with any appropriate scrap of sturdy material.",
        "This material is cut from the leg of an old pair of jeans that has already been used for various other projects.",
        "You could also use part of an old dishtowel, fabric napkin, or other leftover fabric.",
        "Make sure the fabric is sturdy, washable, and clean.",
        "Make a simple, rectangular pattern.",
        "The pattern used here is a business sized mailing envelope 4 1/4 x 9 1/2 inches long (10.5 x 24cm).",
        "You can adjust the size for your cutlery, but remember to leave a seam allowance.",
        "Make the smaller rectangle at least an inch (2.5cm) longer than the longest item you wish to carry.",
        "Cut two pieces of the fabric.",
        "Place the long direction of the pattern with the grain of the fabric.",
        "Make one piece the size of the pattern and the other a bit longer.",
        "If the fabric already had a hem on one end, allow an extra inch (2.5cm) on the hemmed piece.",
        "If the fabric does not have an existing hem, allow an extra two inches (5cm).",
        "Hem one end of each rectangle of fabric.",
        "Fold the fabric over and sew a straight hem.",
        "If the fabric already has a hem, skip this step.",
        "Place the fabric right sides together and align the ends without the hems.",
        "One hem should extend an inch (2.5cm) or more past the other hem.",
        "Lift the shorter piece and fold the longer piece over as shown.",
        "Set the shorter piece back down on top.",
        "The hem of the longer piece should extend down past the hem of the shorter piece, and the folds should lie as shown.",
        "For ease of sewing, the hems should not be right on top of each other.",
        "You can trim the opposite ends (the ends without the hem) at this point if you need to adjust a bit.",
        "Stitch around the three sides that are not folded.",
        "This is a seam allowance of about 1/2 inch (12mm).",
        "(The dark pen line is to show the location of the stitching in the photo.",
        "It is not necessary to draw the line.)",
        "Cut corner reliefs so that the fabric will not bunch up when you turn it right side out.",
        "Turn the large end right side out.",
        "You can use the closed tip of a pair of scissors or the eraser end of a pencil to push the corners all the way out.",
        "Turn the small end right side out.",
        "Try out your pouch with the items you'd like to carry."
    ]
}