{
    "title": "How to Write a Sweet Note",
    "url": "https://www.wikihow.com/Write-a-Sweet-Note",
    "category_hierarchy": [
        "Education and Communications"
    ],
    "steps": [
        {
            "headline": "Know who you're writing to.",
            "description": "In order to be sweet you have to be real, so it helps if you really enjoy the person. Such as your parents, your best friend, your girlfriend/boyfriend ex."
        },
        {
            "headline": "It helps to start with 'Dear ____' and then the holiday or reason you're writing the card.",
            "description": "Even if it's just for no special occasion, it's better to specify as opposed to getting an anonymous card!"
        },
        {
            "headline": "Always pinpoint the unique good qualities of the receiver.",
            "description": "Instead of something such as \"You're so nice! \", be genuine. Say things like \"You are always fun to hang around with and you make me feel like I'm...\""
        },
        {
            "headline": "Be honest.",
            "description": "They can see right through you if you lie, and what's the point of getting a nasty card. Only write this if it's from your heart."
        },
        {
            "headline": "Correct your spelling.",
            "description": "Even if you have to write this on the computer, make such your grammar, punctuation, and spelling is 100% perfect."
        },
        {
            "headline": "Use inside jokes, self experiences, etc.",
            "description": "Make it personal and only for them."
        },
        {
            "headline": "Be sure to have it handwritten, and don't go buy a card.",
            "description": "Use a normal piece of paper folded in half. No one cares if the card is sparkly and store-bought, it's what you write. So be sure to have lots of room."
        },
        {
            "headline": "Give them the card.",
            "description": "When you do, smile. Or leave it in a sweet place, like on their bed or their desk. If it's your crush or boyfriend/girlfriend slide the card through the vents in their locker, or wait for a good time to give it to them. when you both are alone."
        },
        {
            "headline": "Look in your heart and listen, the words come from there, write down the first things that come to your mind.",
            "description": "They are usually the right things to say. Just write it as you think it, that goes a long way. Don't doubt your heart."
        }
    ],
    "tyn": [
        "A piece of paper",
        "A pen"
    ],
    "text": " Know who you're writing to. In order to be sweet you have to be real, so it helps if you really enjoy the person. Such as your parents, your best friend, your girlfriend/boyfriend ex. It helps to start with 'Dear ____' and then the holiday or reason you're writing the card. Even if it's just for no special occasion, it's better to specify as opposed to getting an anonymous card! Always pinpoint the unique good qualities of the receiver. Instead of something such as \"You're so nice! \", be genuine. Say things like \"You are always fun to hang around with and you make me feel like I'm...\" Be honest. They can see right through you if you lie, and what's the point of getting a nasty card. Only write this if it's from your heart. Correct your spelling. Even if you have to write this on the computer, make such your grammar, punctuation, and spelling is 100% perfect. Use inside jokes, self experiences, etc. Make it personal and only for them. Be sure to have it handwritten, and don't go buy a card. Use a normal piece of paper folded in half. No one cares if the card is sparkly and store-bought, it's what you write. So be sure to have lots of room. Give them the card. When you do, smile. Or leave it in a sweet place, like on their bed or their desk. If it's your crush or boyfriend/girlfriend slide the card through the vents in their locker, or wait for a good time to give it to them. when you both are alone. Look in your heart and listen, the words come from there, write down the first things that come to your mind. They are usually the right things to say. Just write it as you think it, that goes a long way. Don't doubt your heart.",
    "sentences": [
        " Know who you're writing to.",
        "In order to be sweet you have to be real, so it helps if you really enjoy the person.",
        "Such as your parents, your best friend, your girlfriend/boyfriend ex.",
        "It helps to start with 'Dear ____' and then the holiday or reason you're writing the card.",
        "Even if it's just for no special occasion, it's better to specify as opposed to getting an anonymous card!",
        "Always pinpoint the unique good qualities of the receiver.",
        "Instead of something such as \"You're so nice!",
        "\", be genuine.",
        "Say things like \"You are always fun to hang around with and you make me feel like I'm...\" Be honest.",
        "They can see right through you if you lie, and what's the point of getting a nasty card.",
        "Only write this if it's from your heart.",
        "Correct your spelling.",
        "Even if you have to write this on the computer, make such your grammar, punctuation, and spelling is 100% perfect.",
        "Use inside jokes, self experiences, etc.",
        "Make it personal and only for them.",
        "Be sure to have it handwritten, and don't go buy a card.",
        "Use a normal piece of paper folded in half.",
        "No one cares if the card is sparkly and store-bought, it's what you write.",
        "So be sure to have lots of room.",
        "Give them the card.",
        "When you do, smile.",
        "Or leave it in a sweet place, like on their bed or their desk.",
        "If it's your crush or boyfriend/girlfriend slide the card through the vents in their locker, or wait for a good time to give it to them.",
        "when you both are alone.",
        "Look in your heart and listen, the words come from there, write down the first things that come to your mind.",
        "They are usually the right things to say.",
        "Just write it as you think it, that goes a long way.",
        "Don't doubt your heart."
    ]
}