{
    "title": "How to Make Ramen Noodles Using a Coffee Maker",
    "url": "https://www.wikihow.com/Make-Ramen-Noodles-Using-a-Coffee-Maker",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Pasta and Noodles",
        "Ramen Dishes"
    ],
    "steps": [
        {
            "headline": "Crumble the ramen noodles in the package.",
            "description": "Smaller pieces are easier to heat up rather than an entire block."
        },
        {
            "headline": "Add the pieces to the carafe.",
            "description": "Make sure that any block pieces are evenly placed so that they're not stacking on top of each other."
        },
        {
            "headline": "Add the seasoning.",
            "description": "Put the seasoning into the coffee filter. Add about 2 cups (475 ml) of water into the reservoir of the coffee maker."
        },
        {
            "headline": "Turn the coffee maker on and wait for your ramen to be done.",
            "description": "Remove and throw away the used coffee filter."
        },
        {
            "headline": "Carefully pour the noodles and water into your bowl.",
            "description": "The coffee pot will be hot, so do this with care."
        },
        {
            "headline": "Add any desired toppings to your ramen noodles.",
            "description": "Serve and enjoy!"
        }
    ],
    "tyn": [
        "Coffee maker",
        "Coffee filter",
        "Ramen noodles",
        "Serving bowl"
    ],
    "text": " Crumble the ramen noodles in the package. Smaller pieces are easier to heat up rather than an entire block. Add the pieces to the carafe. Make sure that any block pieces are evenly placed so that they're not stacking on top of each other. Add the seasoning. Put the seasoning into the coffee filter. Add about 2 cups (475 ml) of water into the reservoir of the coffee maker. Turn the coffee maker on and wait for your ramen to be done. Remove and throw away the used coffee filter. Carefully pour the noodles and water into your bowl. The coffee pot will be hot, so do this with care. Add any desired toppings to your ramen noodles. Serve and enjoy!",
    "sentences": [
        " Crumble the ramen noodles in the package.",
        "Smaller pieces are easier to heat up rather than an entire block.",
        "Add the pieces to the carafe.",
        "Make sure that any block pieces are evenly placed so that they're not stacking on top of each other.",
        "Add the seasoning.",
        "Put the seasoning into the coffee filter.",
        "Add about 2 cups (475 ml) of water into the reservoir of the coffee maker.",
        "Turn the coffee maker on and wait for your ramen to be done.",
        "Remove and throw away the used coffee filter.",
        "Carefully pour the noodles and water into your bowl.",
        "The coffee pot will be hot, so do this with care.",
        "Add any desired toppings to your ramen noodles.",
        "Serve and enjoy!"
    ]
}