{
    "title": "How to Make an Insulated Cat House",
    "url": "https://www.wikihow.com/Make-an-Insulated-Cat-House",
    "category_hierarchy": [
        "Pets and Animals",
        "Cats",
        "Cat Accessories"
    ],
    "parts": [
        {
            "name": "Fashioning the Box",
            "steps": [
                {
                    "headline": "Purchase a large plastic storage container and a slightly smaller one.",
                    "description": "The simplest way to put together a DIY insulated cat house is to use two plastic storage containers of mismatched sizes. In a nutshell, you'll insert the smaller container into the larger one, then install insulation material in the intervening space between the walls of both containers. Your storage containers don't have to be any specific size. A good standard pairing is around 30 gallons (110 L) for the larger container and about 18 gallons (68 L) for the smaller one. It may seem counterintuitive, but smaller shelters are actually preferable to large ones because it’s easier for a cat to warm a tight space with its body heat."
                },
                {
                    "headline": "Cut a 6 in (15 cm) square in the side of the large storage container.",
                    "description": "Trace the dimensions onto the outside of the container with the aid of a ruler and pencil. Then, slice through the material using a utility knife. This opening will serve as the door to the cat house. Avoid making your door any bigger than it needs to be. Most cats can squeeze into openings as small as 5.5–7.5 inches (14–19 cm) in diameter.Tip: Small doors do a better job keeping out cold air, as well as larger animals such as raccoons and coyotes."
                },
                {
                    "headline": "Trim a sheet of styrofoam to fit the container floor.",
                    "description": "Take a rough measurement of the bottom of the container and use these numbers to cut your insulating material. It doesn’t have to be an exact fit—just make sure it covers as much of the floor as possible. After cutting your insulating material, set it on the bottom of the storage container. Styrofoam is one of the best insulators there is. Not only is it extremely cheap, it also maintains temperatures better than other more expensive materials. If you prefer, you can also cut a sheet of fiberglass board. Fiberglass board is readily available at any hardware store or home improvement center."
                },
                {
                    "headline": "Use additional styrofoam to line the walls of the container.",
                    "description": "Measure, mark, and cut the same way you did with the previous pieces. Leave a 2–3 in (5.1–7.6 cm) gap just beneath the lip of the container to allow the lid to fit into place properly. The insulation you cut for the walls may not be perfectly square, depending on the type of container you’re using. There’s no need to secure the insulation to the walls of the container, as you’ll be installing a second, smaller container later, which will hold the pieces in place."
                },
                {
                    "headline": "Cut through the interior insulation where the door will go.",
                    "description": "Simply run your utility knife along all four edges of the opening in the storage container and lift out the cut insulation. Be sure to sweep away any dust or debris that happens to collect near the door before proceeding. Don’t forget this step. If you do, curious felines won’t be able to get into your cat house!"
                },
                {
                    "headline": "Place a second smaller storage container inside the first.",
                    "description": "Keep in mind that the second container needs to be 2–3 inches (5.1–7.6 cm) smaller on all sides in order to fit into the first with the surrounding insulation. After inserting the interior container, cut out a hole for the door using the first opening you made. If possible, purchase two containers with the same basic style and shape in different sizes to ensure that they’ll fit together properly. The double-container setup is far more durable and harder for frigid winds, moisture, and would-be predators to penetrate than a single layer."
                },
                {
                    "headline": "Cover the bottom of the interior container with insulation.",
                    "description": "If you like, you can cut one more piece of styrofoam or fiberglass board to go over the bottom surface of the inner compartment. This will ensure that any kitties who curl up inside will be extra cozy. This step isn’t a necessity (your cat house will already be quite hospitable thanks to the insulated storage containers), but it can make a nice touch."
                }
            ]
        },
        {
            "name": "Setting up Your Cat House",
            "steps": [
                {
                    "headline": "Situate your cat house in a quiet, out-of-the-way area.",
                    "description": "It’s best to keep your shelter out of sight, even if you live in a place where there aren’t a lot of wild animals around. If you have dogs, locate it behind a fence or similar enclosed structure to prevent them from hanging around and harassing innocent occupants. Consider positioning your cat house with the door 5–6 inches (13–15 cm) away from a wall. Narrow confines will discourage other animals from making entry.Tip: It’s a good idea to keep your shelter away from open trash receptacles, which can attract unwanted scavengers."
                },
                {
                    "headline": "Elevate the shelter so that it’s not sitting directly on the ground.",
                    "description": "Arrange 2 in (5.1 cm) x  4 in (10 cm) boards, cinder blocks, or similar materials into a rectangular frame and prop your cat house on top. This will create some airflow underneath the shelter and keep the floor from becoming uncomfortably cold. If you don’t elevate your cat house, ground-chill can creep up and lower the temperature inside, making it harder for cats to stay warm."
                },
                {
                    "headline": "Cut a final piece of styrofoam to go on the top of the cat house.",
                    "description": "This piece should be big enough to lay over the edges of the wall pieces and close off the interior insulation. Now, all six sides of the shelter will be lined with a heat-retaining layer. Try to make sure there are no gaps or cracks in the top layer of insulation that could allow precious warmth to escape."
                },
                {
                    "headline": "Place the lid on the outer container.",
                    "description": "Now that your homemade insulated cat house is complete, all that’s left to do is cover it up. Align the larger container lid with the edges of the outer container and press down firmly. Make sure it locks in place. Once you’ve got the lid on, lay a few heavy objects, such a bricks, paver stones, or scrap lumber, on top to weigh down the shelter. It will then be safe from strong winds and inquisitive critters. For added security, use bungee cords or a few strips of duct tape to hold the lid on."
                }
            ]
        },
        {
            "name": "Adding Basic Amenities",
            "steps": [
                {
                    "headline": "Spread 2–3 inches (5.1–7.6 cm) of straw over the floor of your cat house.",
                    "description": "Pile the straw up nice and thick all the way to the corners of the interior container. It will serve as a kind of bedding that cats can burrow in for added warmth and security. It may be easiest to remove the top from your cat house in order to put your straw bedding and other amenities in place. Straw is a more effective insulator than hay, as it’s resistant to rot and mold and won’t absorb excess moisture.Warning: Don’t use blankets, towels, or newspaper to line your cat house. These may seem like good options, but they could easily get wet and make roosting cats even colder."
                },
                {
                    "headline": "Set a bowl of food in one corner.",
                    "description": "The cats who find their way into your shelter might be hungry as well as chilly. Kill two birds with one stone by pouring some well-balanced dry cat food into a dish and placing it inside the shelter, where it won’t get rained on or eaten by other animals. Dry food is the most practical feeding solution. Since it doesn’t spoil or dry out, it will stay fresh much longer than other types of food. Come back and check the amount of the food in the bowl every few days and refill it as needed."
                },
                {
                    "headline": "Leave a large container of water on the ground outside.",
                    "description": "Water containers should always be kept outside of the cat house. If they accidentally get turned over, they could soak everything inside, leaving it soggy and prone to mildew or even frost. Make sure you also select a non-breakable container to put water in, such as a small plastic tub or repurposed food container. That way, you won’t have to worry about it breaking and possibly hurting a cat or any other animals. A heated water bowl will help ensure that the water you put out never freezes. You can usually find these at pet stores for around $20-30."
                },
                {
                    "headline": "Throw in some toys to provide a little entertainment.",
                    "description": "If you have any extra cat toys lying around at home, consider adding one or two in your cat house. They’ll give visiting cats something to occupy themselves with while they wait out cold nights. Stuffed mice, hemp scratcher balls, and anything with feathers will offer hours of fun for feisty felines. Avoid toys with bells, squeakers, crunchies, or other noise-makers. These could attract the wrong type of attention from prowling predatory animals."
                },
                {
                    "headline": "Scatter some catnip around the door to lure nearby cats inside.",
                    "description": "No cat can resist the musky perfume of catnip. When they catch a whiff of the tantalizing scent, they’ll come running, and discover a safe place to stay in the process. If there’s a mouse toy in your cat house, stuff it full of catnip rather than sprinkling the herb onto the ground or bedding and making a mess. Some cats become aggressive when exposed to catnip. If you think it might cause a tussle, it may be best to leave it out."
                }
            ]
        }
    ],
    "tyn": [
        "Fashioning the Box",
        "Large plastic storage container",
        "Smaller plastic storage container",
        "4 ft (1.2 m) x 8 ft (2.4 m) styrofoam sheeting",
        "Ruler",
        "Utility knife",
        "Pencil",
        "Fiberglass insulation board (optional)",
        "Setting up Your Cat House",
        "2 in (5.1 cm) x  4 in (10 cm) boards or cinder blocks",
        "Bricks, flat paver stones, or scrap lumber",
        "Duct tape or bungee cords (optional)",
        "Adding Basic Amenities",
        "Straw",
        "Food dish",
        "Dry cat food",
        "Large plastic water container",
        "Fresh water",
        "Cat toys",
        "Catnip",
        "Heated water bowl (optional)"
    ],
    "text": " Fashioning the Box Purchase a large plastic storage container and a slightly smaller one. The simplest way to put together a DIY insulated cat house is to use two plastic storage containers of mismatched sizes. In a nutshell, you'll insert the smaller container into the larger one, then install insulation material in the intervening space between the walls of both containers. Your storage containers don't have to be any specific size. A good standard pairing is around 30 gallons (110 L) for the larger container and about 18 gallons (68 L) for the smaller one. It may seem counterintuitive, but smaller shelters are actually preferable to large ones because it’s easier for a cat to warm a tight space with its body heat. Cut a 6 in (15 cm) square in the side of the large storage container. Trace the dimensions onto the outside of the container with the aid of a ruler and pencil. Then, slice through the material using a utility knife. This opening will serve as the door to the cat house. Avoid making your door any bigger than it needs to be. Most cats can squeeze into openings as small as 5.5–7.5 inches (14–19 cm) in diameter.Tip: Small doors do a better job keeping out cold air, as well as larger animals such as raccoons and coyotes. Trim a sheet of styrofoam to fit the container floor. Take a rough measurement of the bottom of the container and use these numbers to cut your insulating material. It doesn’t have to be an exact fit—just make sure it covers as much of the floor as possible. After cutting your insulating material, set it on the bottom of the storage container. Styrofoam is one of the best insulators there is. Not only is it extremely cheap, it also maintains temperatures better than other more expensive materials. If you prefer, you can also cut a sheet of fiberglass board. Fiberglass board is readily available at any hardware store or home improvement center. Use additional styrofoam to line the walls of the container. Measure, mark, and cut the same way you did with the previous pieces. Leave a 2–3 in (5.1–7.6 cm) gap just beneath the lip of the container to allow the lid to fit into place properly. The insulation you cut for the walls may not be perfectly square, depending on the type of container you’re using. There’s no need to secure the insulation to the walls of the container, as you’ll be installing a second, smaller container later, which will hold the pieces in place. Cut through the interior insulation where the door will go. Simply run your utility knife along all four edges of the opening in the storage container and lift out the cut insulation. Be sure to sweep away any dust or debris that happens to collect near the door before proceeding. Don’t forget this step. If you do, curious felines won’t be able to get into your cat house! Place a second smaller storage container inside the first. Keep in mind that the second container needs to be 2–3 inches (5.1–7.6 cm) smaller on all sides in order to fit into the first with the surrounding insulation. After inserting the interior container, cut out a hole for the door using the first opening you made. If possible, purchase two containers with the same basic style and shape in different sizes to ensure that they’ll fit together properly. The double-container setup is far more durable and harder for frigid winds, moisture, and would-be predators to penetrate than a single layer. Cover the bottom of the interior container with insulation. If you like, you can cut one more piece of styrofoam or fiberglass board to go over the bottom surface of the inner compartment. This will ensure that any kitties who curl up inside will be extra cozy. This step isn’t a necessity (your cat house will already be quite hospitable thanks to the insulated storage containers), but it can make a nice touch. Setting up Your Cat House Situate your cat house in a quiet, out-of-the-way area. It’s best to keep your shelter out of sight, even if you live in a place where there aren’t a lot of wild animals around. If you have dogs, locate it behind a fence or similar enclosed structure to prevent them from hanging around and harassing innocent occupants. Consider positioning your cat house with the door 5–6 inches (13–15 cm) away from a wall. Narrow confines will discourage other animals from making entry.Tip: It’s a good idea to keep your shelter away from open trash receptacles, which can attract unwanted scavengers. Elevate the shelter so that it’s not sitting directly on the ground. Arrange 2 in (5.1 cm) x  4 in (10 cm) boards, cinder blocks, or similar materials into a rectangular frame and prop your cat house on top. This will create some airflow underneath the shelter and keep the floor from becoming uncomfortably cold. If you don’t elevate your cat house, ground-chill can creep up and lower the temperature inside, making it harder for cats to stay warm. Cut a final piece of styrofoam to go on the top of the cat house. This piece should be big enough to lay over the edges of the wall pieces and close off the interior insulation. Now, all six sides of the shelter will be lined with a heat-retaining layer. Try to make sure there are no gaps or cracks in the top layer of insulation that could allow precious warmth to escape. Place the lid on the outer container. Now that your homemade insulated cat house is complete, all that’s left to do is cover it up. Align the larger container lid with the edges of the outer container and press down firmly. Make sure it locks in place. Once you’ve got the lid on, lay a few heavy objects, such a bricks, paver stones, or scrap lumber, on top to weigh down the shelter. It will then be safe from strong winds and inquisitive critters. For added security, use bungee cords or a few strips of duct tape to hold the lid on. Adding Basic Amenities Spread 2–3 inches (5.1–7.6 cm) of straw over the floor of your cat house. Pile the straw up nice and thick all the way to the corners of the interior container. It will serve as a kind of bedding that cats can burrow in for added warmth and security. It may be easiest to remove the top from your cat house in order to put your straw bedding and other amenities in place. Straw is a more effective insulator than hay, as it’s resistant to rot and mold and won’t absorb excess moisture.Warning: Don’t use blankets, towels, or newspaper to line your cat house. These may seem like good options, but they could easily get wet and make roosting cats even colder. Set a bowl of food in one corner. The cats who find their way into your shelter might be hungry as well as chilly. Kill two birds with one stone by pouring some well-balanced dry cat food into a dish and placing it inside the shelter, where it won’t get rained on or eaten by other animals. Dry food is the most practical feeding solution. Since it doesn’t spoil or dry out, it will stay fresh much longer than other types of food. Come back and check the amount of the food in the bowl every few days and refill it as needed. Leave a large container of water on the ground outside. Water containers should always be kept outside of the cat house. If they accidentally get turned over, they could soak everything inside, leaving it soggy and prone to mildew or even frost. Make sure you also select a non-breakable container to put water in, such as a small plastic tub or repurposed food container. That way, you won’t have to worry about it breaking and possibly hurting a cat or any other animals. A heated water bowl will help ensure that the water you put out never freezes. You can usually find these at pet stores for around $20-30. Throw in some toys to provide a little entertainment. If you have any extra cat toys lying around at home, consider adding one or two in your cat house. They’ll give visiting cats something to occupy themselves with while they wait out cold nights. Stuffed mice, hemp scratcher balls, and anything with feathers will offer hours of fun for feisty felines. Avoid toys with bells, squeakers, crunchies, or other noise-makers. These could attract the wrong type of attention from prowling predatory animals. Scatter some catnip around the door to lure nearby cats inside. No cat can resist the musky perfume of catnip. When they catch a whiff of the tantalizing scent, they’ll come running, and discover a safe place to stay in the process. If there’s a mouse toy in your cat house, stuff it full of catnip rather than sprinkling the herb onto the ground or bedding and making a mess. Some cats become aggressive when exposed to catnip. If you think it might cause a tussle, it may be best to leave it out.",
    "sentences": [
        " Fashioning the Box Purchase a large plastic storage container and a slightly smaller one.",
        "The simplest way to put together a DIY insulated cat house is to use two plastic storage containers of mismatched sizes.",
        "In a nutshell, you'll insert the smaller container into the larger one, then install insulation material in the intervening space between the walls of both containers.",
        "Your storage containers don't have to be any specific size.",
        "A good standard pairing is around 30 gallons (110 L) for the larger container and about 18 gallons (68 L) for the smaller one.",
        "It may seem counterintuitive, but smaller shelters are actually preferable to large ones because it’s easier for a cat to warm a tight space with its body heat.",
        "Cut a 6 in (15 cm) square in the side of the large storage container.",
        "Trace the dimensions onto the outside of the container with the aid of a ruler and pencil.",
        "Then, slice through the material using a utility knife.",
        "This opening will serve as the door to the cat house.",
        "Avoid making your door any bigger than it needs to be.",
        "Most cats can squeeze into openings as small as 5.5–7.5 inches (14–19 cm) in diameter.Tip: Small doors do a better job keeping out cold air, as well as larger animals such as raccoons and coyotes.",
        "Trim a sheet of styrofoam to fit the container floor.",
        "Take a rough measurement of the bottom of the container and use these numbers to cut your insulating material.",
        "It doesn’t have to be an exact fit—just make sure it covers as much of the floor as possible.",
        "After cutting your insulating material, set it on the bottom of the storage container.",
        "Styrofoam is one of the best insulators there is.",
        "Not only is it extremely cheap, it also maintains temperatures better than other more expensive materials.",
        "If you prefer, you can also cut a sheet of fiberglass board.",
        "Fiberglass board is readily available at any hardware store or home improvement center.",
        "Use additional styrofoam to line the walls of the container.",
        "Measure, mark, and cut the same way you did with the previous pieces.",
        "Leave a 2–3 in (5.1–7.6 cm) gap just beneath the lip of the container to allow the lid to fit into place properly.",
        "The insulation you cut for the walls may not be perfectly square, depending on the type of container you’re using.",
        "There’s no need to secure the insulation to the walls of the container, as you’ll be installing a second, smaller container later, which will hold the pieces in place.",
        "Cut through the interior insulation where the door will go.",
        "Simply run your utility knife along all four edges of the opening in the storage container and lift out the cut insulation.",
        "Be sure to sweep away any dust or debris that happens to collect near the door before proceeding.",
        "Don’t forget this step.",
        "If you do, curious felines won’t be able to get into your cat house!",
        "Place a second smaller storage container inside the first.",
        "Keep in mind that the second container needs to be 2–3 inches (5.1–7.6 cm) smaller on all sides in order to fit into the first with the surrounding insulation.",
        "After inserting the interior container, cut out a hole for the door using the first opening you made.",
        "If possible, purchase two containers with the same basic style and shape in different sizes to ensure that they’ll fit together properly.",
        "The double-container setup is far more durable and harder for frigid winds, moisture, and would-be predators to penetrate than a single layer.",
        "Cover the bottom of the interior container with insulation.",
        "If you like, you can cut one more piece of styrofoam or fiberglass board to go over the bottom surface of the inner compartment.",
        "This will ensure that any kitties who curl up inside will be extra cozy.",
        "This step isn’t a necessity (your cat house will already be quite hospitable thanks to the insulated storage containers), but it can make a nice touch.",
        "Setting up Your Cat House Situate your cat house in a quiet, out-of-the-way area.",
        "It’s best to keep your shelter out of sight, even if you live in a place where there aren’t a lot of wild animals around.",
        "If you have dogs, locate it behind a fence or similar enclosed structure to prevent them from hanging around and harassing innocent occupants.",
        "Consider positioning your cat house with the door 5–6 inches (13–15 cm) away from a wall.",
        "Narrow confines will discourage other animals from making entry.Tip: It’s a good idea to keep your shelter away from open trash receptacles, which can attract unwanted scavengers.",
        "Elevate the shelter so that it’s not sitting directly on the ground.",
        "Arrange 2 in (5.1 cm) x  4 in (10 cm) boards, cinder blocks, or similar materials into a rectangular frame and prop your cat house on top.",
        "This will create some airflow underneath the shelter and keep the floor from becoming uncomfortably cold.",
        "If you don’t elevate your cat house, ground-chill can creep up and lower the temperature inside, making it harder for cats to stay warm.",
        "Cut a final piece of styrofoam to go on the top of the cat house.",
        "This piece should be big enough to lay over the edges of the wall pieces and close off the interior insulation.",
        "Now, all six sides of the shelter will be lined with a heat-retaining layer.",
        "Try to make sure there are no gaps or cracks in the top layer of insulation that could allow precious warmth to escape.",
        "Place the lid on the outer container.",
        "Now that your homemade insulated cat house is complete, all that’s left to do is cover it up.",
        "Align the larger container lid with the edges of the outer container and press down firmly.",
        "Make sure it locks in place.",
        "Once you’ve got the lid on, lay a few heavy objects, such a bricks, paver stones, or scrap lumber, on top to weigh down the shelter.",
        "It will then be safe from strong winds and inquisitive critters.",
        "For added security, use bungee cords or a few strips of duct tape to hold the lid on.",
        "Adding Basic Amenities Spread 2–3 inches (5.1–7.6 cm) of straw over the floor of your cat house.",
        "Pile the straw up nice and thick all the way to the corners of the interior container.",
        "It will serve as a kind of bedding that cats can burrow in for added warmth and security.",
        "It may be easiest to remove the top from your cat house in order to put your straw bedding and other amenities in place.",
        "Straw is a more effective insulator than hay, as it’s resistant to rot and mold and won’t absorb excess moisture.Warning: Don’t use blankets, towels, or newspaper to line your cat house.",
        "These may seem like good options, but they could easily get wet and make roosting cats even colder.",
        "Set a bowl of food in one corner.",
        "The cats who find their way into your shelter might be hungry as well as chilly.",
        "Kill two birds with one stone by pouring some well-balanced dry cat food into a dish and placing it inside the shelter, where it won’t get rained on or eaten by other animals.",
        "Dry food is the most practical feeding solution.",
        "Since it doesn’t spoil or dry out, it will stay fresh much longer than other types of food.",
        "Come back and check the amount of the food in the bowl every few days and refill it as needed.",
        "Leave a large container of water on the ground outside.",
        "Water containers should always be kept outside of the cat house.",
        "If they accidentally get turned over, they could soak everything inside, leaving it soggy and prone to mildew or even frost.",
        "Make sure you also select a non-breakable container to put water in, such as a small plastic tub or repurposed food container.",
        "That way, you won’t have to worry about it breaking and possibly hurting a cat or any other animals.",
        "A heated water bowl will help ensure that the water you put out never freezes.",
        "You can usually find these at pet stores for around $20-30.",
        "Throw in some toys to provide a little entertainment.",
        "If you have any extra cat toys lying around at home, consider adding one or two in your cat house.",
        "They’ll give visiting cats something to occupy themselves with while they wait out cold nights.",
        "Stuffed mice, hemp scratcher balls, and anything with feathers will offer hours of fun for feisty felines.",
        "Avoid toys with bells, squeakers, crunchies, or other noise-makers.",
        "These could attract the wrong type of attention from prowling predatory animals.",
        "Scatter some catnip around the door to lure nearby cats inside.",
        "No cat can resist the musky perfume of catnip.",
        "When they catch a whiff of the tantalizing scent, they’ll come running, and discover a safe place to stay in the process.",
        "If there’s a mouse toy in your cat house, stuff it full of catnip rather than sprinkling the herb onto the ground or bedding and making a mess.",
        "Some cats become aggressive when exposed to catnip.",
        "If you think it might cause a tussle, it may be best to leave it out."
    ]
}