{
    "title": "How to Pack for a Whale Watching Trip",
    "url": "https://www.wikihow.com/Pack-for-a-Whale-Watching-Trip",
    "category_hierarchy": [
        "Travel",
        "Travel Packing"
    ],
    "parts": [
        {
            "name": "Preparing for the Weather",
            "steps": [
                {
                    "headline": "Dress in layers.",
                    "description": "It is usually colder out on the water than it is inland or even on the shore. You will want to wear several layers to keep yourself warm during your trip. To be safe, expect the temperature to be 20-30°F (11-16°C) colder on the water. Some useful layering items include sweaters, sweatshirts, scarves, and flannel shirts."
                },
                {
                    "headline": "Pack a blanket.",
                    "description": "Especially in the spring and fall, whale-watchers can be surprised by just how cold it can get on the water. By bringing a blanket, you can help protect yourself on particularly cold and windy days."
                },
                {
                    "headline": "Pack gloves.",
                    "description": "Especially if you're traveling in the cooler months, it can be a good idea to bring along a pair of gloves in case your hands get cold on the water. Simple cotton or cotton-blend gloves should usually be fine if the cold is not severe. But you may want to bring wool gloves or gloves lined with insulation if you anticipate particularly cold temperatures. If you're planning on using your phone or other devices, you may want to bring gloves that you can wear while using touchscreens."
                },
                {
                    "headline": "Apply sunscreen.",
                    "description": "No matter what the season or temperature, you should always wear sunscreen while whale-watching. Even when it's cool and cloudy, you can be exposed to harmful UV rays and get sunburn. Put on sunscreen before heading out and then throughout the day as necessary. You should use sunscreen that is labelled as SPF 30 or higher to protect yourself from UV rays, which damage the skin and over time can even lead to skin cancer. No sunscreen is completely waterproof, so if you get wet while whale-watching be sure to reapply your sunscreen."
                },
                {
                    "headline": "Wear sunglasses.",
                    "description": "When the sun hits the water, it creates a powerful glare. You can protect your eyes and help yourself see better if you wear sunglasses. For the best defense against the sun, be sure to bring sunglasses that offer full protection from UV rays. This will help protect you from problems like cataracts and retinal damage."
                },
                {
                    "headline": "Wear a hat or visor.",
                    "description": "Having a hat with a wide brim can help further protect your face from the sun and your eyes from the glare. A chinstrap can keep your hat fixed to your head even when the wind picks up."
                },
                {
                    "headline": "Take along a waterproof jacket with a hood.",
                    "description": "It is easy to get wet while whale-watching, especially if you're on a boat where ocean water often sprays up onto passengers. To keep yourself warm and dry, wear a waterproof jacket with a hood. If it's going to be particularly cold, make sure it's a heavy jacket or even a winter coat. When choosing a waterproof jacket, be aware that there is a difference between jackets labelled as “water-resistant” and “waterproof.” Waterproof jackets provide more protection but also tend to be more expensive."
                }
            ]
        },
        {
            "name": "Packing for the Boat",
            "steps": [
                {
                    "headline": "Wear shoes with rubber soles.",
                    "description": "As boats travel through the water, their decks often get wet and slippery. To help keep your balance while walking around the boat, you should wear flat shoes with rubber soles, like tennis shoes or boots. By contrast, wearing high-heels or shoes with leather soles could increase your risk or falling and injuring yourself."
                },
                {
                    "headline": "Have an extra pair of socks on hand.",
                    "description": "Occasionally, water sprays up onto passengers during the trip. If this happens, it can be nice to be able to change your socks if they get wet. You can also try wearing weather-resistant socks to help keep your feet dry."
                },
                {
                    "headline": "Bring snacks with you.",
                    "description": "Whale-watching trips can take up a large part of the day, so you should bring food along to prevent yourself from getting uncomfortably hungry. Some boats sell food on board, but you should check with the company you're traveling with before starting your trip. To help you stay fuller for longer, consider bringing healthy snacks that are high in protein, fiber, or healthy fats. Examples of healthy snacks include hard-boiled eggs, unsalted almonds, fruit, chia seeds, and Greek yogurt."
                },
                {
                    "headline": "Bring bottles of water.",
                    "description": "Since you will be on the boat for several hours, you will want to make sure you don't get dehydrated. To stay hydrated, bring along at least one bottle of water for each person in your party. Make sure the bottles aren't glass, though, as some tour companies will not let you take these on board."
                },
                {
                    "headline": "Take medicine for seasickness.",
                    "description": "Some people get nauseated when travelling on boats. To prevent this, you can take various medications that fight against motion sickness. However, you often have to take the first dose well before getting on the boat, so be sure to read the label or follow your doctor's instructions."
                },
                {
                    "headline": "Pack a book or game to occupy yourself.",
                    "description": "There can be uneventful periods of whale-watching trips when you're waiting for whales to come into view. During these stretches, it can be good to have something to like a book or a game to help pass the time. You may not want to plan on using your phone for entertainment, in case you are unable to get reception out on the water."
                },
                {
                    "headline": "Pack toys to occupy young children.",
                    "description": "Young children are especially likely to get bored or frustrated during slow parts of the trip. If you're travelling with young children, you can bring along toys or games for them to play with in order to keep them happy. Crayons and coloring books can be a good option."
                },
                {
                    "headline": "Keep all of your belongings in a waterproof bag or backpack.",
                    "description": "A waterproof carrier can keep all of your possessions dry when water from the ocean sprays on board the boat. As with jackets, there is a difference between water-resistant and waterproof bags. While they are more expensive, bags labelled as “waterproof” should provide more protection from water damage."
                }
            ]
        },
        {
            "name": "Getting Ready to Take Pictures",
            "steps": [
                {
                    "headline": "Bring binoculars.",
                    "description": "Sometimes whales come close to the boat, but other times you can see them only in the distance. With a pair of binoculars, you'll be able to get a great view of the whales even if they're far away."
                },
                {
                    "headline": "Bring a camera.",
                    "description": "If your phone has a camera, you can take pictures with that. Some people, however, may prefer to capture their whale-watching experience with higher-quality pictures than they can take on their phone. In that case, they may want to bring either a separate compact camera or a  DSLR camera. For the best possible pictures, you may want to use a telephoto lens."
                },
                {
                    "headline": "Pack extra batteries.",
                    "description": "You'll be out on the water for a while, so you'll want to make sure that your camera or phone doesn't lose power in the middle of your trip. There are a variety of options for powering devices away from home, including USB battery packs and power cores. With a simple USB connector, you can use these products to charge your devices."
                },
                {
                    "headline": "Take along a second memory card.",
                    "description": "By bringing along extra storage for your camera, you'll be able to take as many pictures as you want. There are a variety of memory cards on the market that have different speeds, storage capacities, and special capabilities. After you determine your needs, you can research products to determine which card will suit you best. If you plan to take pictures with your phone, you can use external memory units to expand your storage capacity and take as many pictures as you want."
                }
            ]
        }
    ],
    "tyn": [
        "Binoculars",
        "Camera",
        "Waterproof jacket or rain poncho",
        "Gloves",
        "Sweatshirt",
        "Rubber-soled shoes",
        "Extra socks",
        "Hat with strap",
        "Bottled water",
        "Sunscreen",
        "Snacks",
        "Seasick medication or patches",
        "Waterproof bag or backpack"
    ],
    "text": " Preparing for the Weather Dress in layers. It is usually colder out on the water than it is inland or even on the shore. You will want to wear several layers to keep yourself warm during your trip. To be safe, expect the temperature to be 20-30°F (11-16°C) colder on the water. Some useful layering items include sweaters, sweatshirts, scarves, and flannel shirts. Pack a blanket. Especially in the spring and fall, whale-watchers can be surprised by just how cold it can get on the water. By bringing a blanket, you can help protect yourself on particularly cold and windy days. Pack gloves. Especially if you're traveling in the cooler months, it can be a good idea to bring along a pair of gloves in case your hands get cold on the water. Simple cotton or cotton-blend gloves should usually be fine if the cold is not severe. But you may want to bring wool gloves or gloves lined with insulation if you anticipate particularly cold temperatures. If you're planning on using your phone or other devices, you may want to bring gloves that you can wear while using touchscreens. Apply sunscreen. No matter what the season or temperature, you should always wear sunscreen while whale-watching. Even when it's cool and cloudy, you can be exposed to harmful UV rays and get sunburn. Put on sunscreen before heading out and then throughout the day as necessary. You should use sunscreen that is labelled as SPF 30 or higher to protect yourself from UV rays, which damage the skin and over time can even lead to skin cancer. No sunscreen is completely waterproof, so if you get wet while whale-watching be sure to reapply your sunscreen. Wear sunglasses. When the sun hits the water, it creates a powerful glare. You can protect your eyes and help yourself see better if you wear sunglasses. For the best defense against the sun, be sure to bring sunglasses that offer full protection from UV rays. This will help protect you from problems like cataracts and retinal damage. Wear a hat or visor. Having a hat with a wide brim can help further protect your face from the sun and your eyes from the glare. A chinstrap can keep your hat fixed to your head even when the wind picks up. Take along a waterproof jacket with a hood. It is easy to get wet while whale-watching, especially if you're on a boat where ocean water often sprays up onto passengers. To keep yourself warm and dry, wear a waterproof jacket with a hood. If it's going to be particularly cold, make sure it's a heavy jacket or even a winter coat. When choosing a waterproof jacket, be aware that there is a difference between jackets labelled as “water-resistant” and “waterproof.” Waterproof jackets provide more protection but also tend to be more expensive. Packing for the Boat Wear shoes with rubber soles. As boats travel through the water, their decks often get wet and slippery. To help keep your balance while walking around the boat, you should wear flat shoes with rubber soles, like tennis shoes or boots. By contrast, wearing high-heels or shoes with leather soles could increase your risk or falling and injuring yourself. Have an extra pair of socks on hand. Occasionally, water sprays up onto passengers during the trip. If this happens, it can be nice to be able to change your socks if they get wet. You can also try wearing weather-resistant socks to help keep your feet dry. Bring snacks with you. Whale-watching trips can take up a large part of the day, so you should bring food along to prevent yourself from getting uncomfortably hungry. Some boats sell food on board, but you should check with the company you're traveling with before starting your trip. To help you stay fuller for longer, consider bringing healthy snacks that are high in protein, fiber, or healthy fats. Examples of healthy snacks include hard-boiled eggs, unsalted almonds, fruit, chia seeds, and Greek yogurt. Bring bottles of water. Since you will be on the boat for several hours, you will want to make sure you don't get dehydrated. To stay hydrated, bring along at least one bottle of water for each person in your party. Make sure the bottles aren't glass, though, as some tour companies will not let you take these on board. Take medicine for seasickness. Some people get nauseated when travelling on boats. To prevent this, you can take various medications that fight against motion sickness. However, you often have to take the first dose well before getting on the boat, so be sure to read the label or follow your doctor's instructions. Pack a book or game to occupy yourself. There can be uneventful periods of whale-watching trips when you're waiting for whales to come into view. During these stretches, it can be good to have something to like a book or a game to help pass the time. You may not want to plan on using your phone for entertainment, in case you are unable to get reception out on the water. Pack toys to occupy young children. Young children are especially likely to get bored or frustrated during slow parts of the trip. If you're travelling with young children, you can bring along toys or games for them to play with in order to keep them happy. Crayons and coloring books can be a good option. Keep all of your belongings in a waterproof bag or backpack. A waterproof carrier can keep all of your possessions dry when water from the ocean sprays on board the boat. As with jackets, there is a difference between water-resistant and waterproof bags. While they are more expensive, bags labelled as “waterproof” should provide more protection from water damage. Getting Ready to Take Pictures Bring binoculars. Sometimes whales come close to the boat, but other times you can see them only in the distance. With a pair of binoculars, you'll be able to get a great view of the whales even if they're far away. Bring a camera. If your phone has a camera, you can take pictures with that. Some people, however, may prefer to capture their whale-watching experience with higher-quality pictures than they can take on their phone. In that case, they may want to bring either a separate compact camera or a  DSLR camera. For the best possible pictures, you may want to use a telephoto lens. Pack extra batteries. You'll be out on the water for a while, so you'll want to make sure that your camera or phone doesn't lose power in the middle of your trip. There are a variety of options for powering devices away from home, including USB battery packs and power cores. With a simple USB connector, you can use these products to charge your devices. Take along a second memory card. By bringing along extra storage for your camera, you'll be able to take as many pictures as you want. There are a variety of memory cards on the market that have different speeds, storage capacities, and special capabilities. After you determine your needs, you can research products to determine which card will suit you best. If you plan to take pictures with your phone, you can use external memory units to expand your storage capacity and take as many pictures as you want.",
    "sentences": [
        " Preparing for the Weather Dress in layers.",
        "It is usually colder out on the water than it is inland or even on the shore.",
        "You will want to wear several layers to keep yourself warm during your trip.",
        "To be safe, expect the temperature to be 20-30°F (11-16°C) colder on the water.",
        "Some useful layering items include sweaters, sweatshirts, scarves, and flannel shirts.",
        "Pack a blanket.",
        "Especially in the spring and fall, whale-watchers can be surprised by just how cold it can get on the water.",
        "By bringing a blanket, you can help protect yourself on particularly cold and windy days.",
        "Pack gloves.",
        "Especially if you're traveling in the cooler months, it can be a good idea to bring along a pair of gloves in case your hands get cold on the water.",
        "Simple cotton or cotton-blend gloves should usually be fine if the cold is not severe.",
        "But you may want to bring wool gloves or gloves lined with insulation if you anticipate particularly cold temperatures.",
        "If you're planning on using your phone or other devices, you may want to bring gloves that you can wear while using touchscreens.",
        "Apply sunscreen.",
        "No matter what the season or temperature, you should always wear sunscreen while whale-watching.",
        "Even when it's cool and cloudy, you can be exposed to harmful UV rays and get sunburn.",
        "Put on sunscreen before heading out and then throughout the day as necessary.",
        "You should use sunscreen that is labelled as SPF 30 or higher to protect yourself from UV rays, which damage the skin and over time can even lead to skin cancer.",
        "No sunscreen is completely waterproof, so if you get wet while whale-watching be sure to reapply your sunscreen.",
        "Wear sunglasses.",
        "When the sun hits the water, it creates a powerful glare.",
        "You can protect your eyes and help yourself see better if you wear sunglasses.",
        "For the best defense against the sun, be sure to bring sunglasses that offer full protection from UV rays.",
        "This will help protect you from problems like cataracts and retinal damage.",
        "Wear a hat or visor.",
        "Having a hat with a wide brim can help further protect your face from the sun and your eyes from the glare.",
        "A chinstrap can keep your hat fixed to your head even when the wind picks up.",
        "Take along a waterproof jacket with a hood.",
        "It is easy to get wet while whale-watching, especially if you're on a boat where ocean water often sprays up onto passengers.",
        "To keep yourself warm and dry, wear a waterproof jacket with a hood.",
        "If it's going to be particularly cold, make sure it's a heavy jacket or even a winter coat.",
        "When choosing a waterproof jacket, be aware that there is a difference between jackets labelled as “water-resistant” and “waterproof.” Waterproof jackets provide more protection but also tend to be more expensive.",
        "Packing for the Boat Wear shoes with rubber soles.",
        "As boats travel through the water, their decks often get wet and slippery.",
        "To help keep your balance while walking around the boat, you should wear flat shoes with rubber soles, like tennis shoes or boots.",
        "By contrast, wearing high-heels or shoes with leather soles could increase your risk or falling and injuring yourself.",
        "Have an extra pair of socks on hand.",
        "Occasionally, water sprays up onto passengers during the trip.",
        "If this happens, it can be nice to be able to change your socks if they get wet.",
        "You can also try wearing weather-resistant socks to help keep your feet dry.",
        "Bring snacks with you.",
        "Whale-watching trips can take up a large part of the day, so you should bring food along to prevent yourself from getting uncomfortably hungry.",
        "Some boats sell food on board, but you should check with the company you're traveling with before starting your trip.",
        "To help you stay fuller for longer, consider bringing healthy snacks that are high in protein, fiber, or healthy fats.",
        "Examples of healthy snacks include hard-boiled eggs, unsalted almonds, fruit, chia seeds, and Greek yogurt.",
        "Bring bottles of water.",
        "Since you will be on the boat for several hours, you will want to make sure you don't get dehydrated.",
        "To stay hydrated, bring along at least one bottle of water for each person in your party.",
        "Make sure the bottles aren't glass, though, as some tour companies will not let you take these on board.",
        "Take medicine for seasickness.",
        "Some people get nauseated when travelling on boats.",
        "To prevent this, you can take various medications that fight against motion sickness.",
        "However, you often have to take the first dose well before getting on the boat, so be sure to read the label or follow your doctor's instructions.",
        "Pack a book or game to occupy yourself.",
        "There can be uneventful periods of whale-watching trips when you're waiting for whales to come into view.",
        "During these stretches, it can be good to have something to like a book or a game to help pass the time.",
        "You may not want to plan on using your phone for entertainment, in case you are unable to get reception out on the water.",
        "Pack toys to occupy young children.",
        "Young children are especially likely to get bored or frustrated during slow parts of the trip.",
        "If you're travelling with young children, you can bring along toys or games for them to play with in order to keep them happy.",
        "Crayons and coloring books can be a good option.",
        "Keep all of your belongings in a waterproof bag or backpack.",
        "A waterproof carrier can keep all of your possessions dry when water from the ocean sprays on board the boat.",
        "As with jackets, there is a difference between water-resistant and waterproof bags.",
        "While they are more expensive, bags labelled as “waterproof” should provide more protection from water damage.",
        "Getting Ready to Take Pictures Bring binoculars.",
        "Sometimes whales come close to the boat, but other times you can see them only in the distance.",
        "With a pair of binoculars, you'll be able to get a great view of the whales even if they're far away.",
        "Bring a camera.",
        "If your phone has a camera, you can take pictures with that.",
        "Some people, however, may prefer to capture their whale-watching experience with higher-quality pictures than they can take on their phone.",
        "In that case, they may want to bring either a separate compact camera or a  DSLR camera.",
        "For the best possible pictures, you may want to use a telephoto lens.",
        "Pack extra batteries.",
        "You'll be out on the water for a while, so you'll want to make sure that your camera or phone doesn't lose power in the middle of your trip.",
        "There are a variety of options for powering devices away from home, including USB battery packs and power cores.",
        "With a simple USB connector, you can use these products to charge your devices.",
        "Take along a second memory card.",
        "By bringing along extra storage for your camera, you'll be able to take as many pictures as you want.",
        "There are a variety of memory cards on the market that have different speeds, storage capacities, and special capabilities.",
        "After you determine your needs, you can research products to determine which card will suit you best.",
        "If you plan to take pictures with your phone, you can use external memory units to expand your storage capacity and take as many pictures as you want."
    ]
}