{
    "title": "How to Copyright in Canada",
    "url": "https://www.wikihow.com/Copyright-in-Canada",
    "category_hierarchy": [
        "Finance and Business",
        "Legal Matters",
        "Intellectual Property"
    ],
    "parts": [
        {
            "name": "Submitting an Application to Register your Copyright",
            "steps": [
                {
                    "headline": "Ensure that you need a copyright.",
                    "description": "All three of these provide legal protection, but cover different forms of material. If you have created commercial branding or a new invention, rather than a creative work, you may need to apply for a trademark or a patent, rather than a copyright. Copyright covers original artistic work (musical, artistic, literary, or dramatic) and gives the work’s creator the exclusive legal right to reproduce and perform the work. Trademarks are designed to protect commercial brands; they limit use of specific words and designs which describe a specific brand. Patents protect the development of new technology, or improvements made to already existing technologies. A patent limits production and sales of an invention."
                },
                {
                    "headline": "Visit the Canadian Intellectual Property Office (CIPO) website.",
                    "description": "Nearly all of the Canadian copyright registration process is carried out online, through the CIPO website. This site contains all of the relevant information for filing a copyright in Canada."
                },
                {
                    "headline": "Click on “Copyright,” on the top of the page.",
                    "description": "The site advises visitors to read the “Guide to Copyrights” before beginning the copyright application process. Click on the “Guide to Copyrights” link and study the information on that page. This will provide information about what a copyright is, what it protects, how long a copyright lasts in Canada, and provide further detailed bullet points about how to prepare and submit your application for copyright registration."
                },
                {
                    "headline": "Return to the main “Copyright” page and click on “Register Your Copyright.”  This link will help you begin registering your intellectual property copyright.",
                    "description": ""
                },
                {
                    "headline": "Read the page and click on the “My Industry Canada Account” link.",
                    "description": "Before you click on the copyright e-filing application form link, you will need to setup an Industry Canada account. This will allow you to pay for the application fee. You need to have your username and password already created, because the form is on a secure server."
                },
                {
                    "headline": "Click on “Login to the copyright e-filing application” and fill out the application.",
                    "description": "You can both fill out and submit the entire application from this link. To register your copyright, you will need to title your work and place it within a category: photograph, music, artistic work, literary work, or dramatic work. If your work fits in multiple categories, you will still need to select one of the categories. Pick the one that best suits your work. Read through your application to ensure it is correct and complete. For your own private records, print the completed application or save it on a flash drive."
                },
                {
                    "headline": "Pay for the copyright application.",
                    "description": "CIPO accepts various forms of payment, including credit and debit cards, checks, wire transfers, and deposit accounts. From the main Copyright page, click on “View fees” on the center of your screen to see the applicable fees. Make payment online, using one of the acceptable payment methods. Payment for copyright registration costs $50. If you do not have a credit card or prefer not to use one, set up a CIPO deposit account. Email CIPO’s Finance, Integrated Planning and Administration office to set up your account. You can also open an account by mailing information to CIPO office at Place du Portage 1, 3rd Floor, Room 304 C, Gatineau, Quebec, K1A 0C9. You will have to pay $65 if you open a CIPO deposit account to pay for your copyright application."
                },
                {
                    "headline": "Receive your registration certificate.",
                    "description": "Once you have submitted the registration form, either online or by mail or fax, you will receive a registration certificate within five to seven business days. If there is a problem with your filed application, CIPO will inform you within one week from the date of filing."
                }
            ]
        },
        {
            "name": "Protecting your Copyright",
            "steps": [
                {
                    "headline": "Add a copyright notice to your work and to all authorized reproductions.",
                    "description": "Every copyrighted work should be marked with the copyright symbol—©—and the copyright owner’s name, followed by the year the work was published. This will let others know that the work is an original creative work, and that they cannot legally reproduce the work or sell a reproduction. Remember that your creative work is still copyrighted, even if it does not have the “©” symbol physically printed on it. The printed symbol serves primarily to remind others that your work has been copyright, and is not theirs to reproduce."
                },
                {
                    "headline": "Stop violations of your copyright.",
                    "description": "If you become aware that an individual or company is reproducing or selling your copyrighted work without your permission, the correct legal step is to send them a Cease and Desist “Copyright Infringement” letter. The Cease and Desist letter communicates your ownership of the copyrighted work, and asks that the violator cease using the copyrighted creative work. An attorney (or, often, the website of a legal firm) can provide you with a form letter; you’ll need to fill in specific details."
                },
                {
                    "headline": "Take the copyright violator to court.",
                    "description": "If the offender continues to violate your copyright, you can take them to court to sue for damages. The judge may also issue a Cease and Desist Order, which prohibits the violator from using your copyrighted material. Under Canadian law, copyright violation can be punished with up to a $5,000 fine for infringement claims and damages."
                }
            ]
        }
    ],
    "tyn": [
        "Computer with Internet access",
        "Printer",
        "Flash drive",
        "Credit card or CIPO deposit account"
    ],
    "text": " Submitting an Application to Register your Copyright Ensure that you need a copyright. All three of these provide legal protection, but cover different forms of material. If you have created commercial branding or a new invention, rather than a creative work, you may need to apply for a trademark or a patent, rather than a copyright. Copyright covers original artistic work (musical, artistic, literary, or dramatic) and gives the work’s creator the exclusive legal right to reproduce and perform the work. Trademarks are designed to protect commercial brands; they limit use of specific words and designs which describe a specific brand. Patents protect the development of new technology, or improvements made to already existing technologies. A patent limits production and sales of an invention. Visit the Canadian Intellectual Property Office (CIPO) website. Nearly all of the Canadian copyright registration process is carried out online, through the CIPO website. This site contains all of the relevant information for filing a copyright in Canada. Click on “Copyright,” on the top of the page. The site advises visitors to read the “Guide to Copyrights” before beginning the copyright application process. Click on the “Guide to Copyrights” link and study the information on that page. This will provide information about what a copyright is, what it protects, how long a copyright lasts in Canada, and provide further detailed bullet points about how to prepare and submit your application for copyright registration. Return to the main “Copyright” page and click on “Register Your Copyright.”  This link will help you begin registering your intellectual property copyright.  Read the page and click on the “My Industry Canada Account” link. Before you click on the copyright e-filing application form link, you will need to setup an Industry Canada account. This will allow you to pay for the application fee. You need to have your username and password already created, because the form is on a secure server. Click on “Login to the copyright e-filing application” and fill out the application. You can both fill out and submit the entire application from this link. To register your copyright, you will need to title your work and place it within a category: photograph, music, artistic work, literary work, or dramatic work. If your work fits in multiple categories, you will still need to select one of the categories. Pick the one that best suits your work. Read through your application to ensure it is correct and complete. For your own private records, print the completed application or save it on a flash drive. Pay for the copyright application. CIPO accepts various forms of payment, including credit and debit cards, checks, wire transfers, and deposit accounts. From the main Copyright page, click on “View fees” on the center of your screen to see the applicable fees. Make payment online, using one of the acceptable payment methods. Payment for copyright registration costs $50. If you do not have a credit card or prefer not to use one, set up a CIPO deposit account. Email CIPO’s Finance, Integrated Planning and Administration office to set up your account. You can also open an account by mailing information to CIPO office at Place du Portage 1, 3rd Floor, Room 304 C, Gatineau, Quebec, K1A 0C9. You will have to pay $65 if you open a CIPO deposit account to pay for your copyright application. Receive your registration certificate. Once you have submitted the registration form, either online or by mail or fax, you will receive a registration certificate within five to seven business days. If there is a problem with your filed application, CIPO will inform you within one week from the date of filing. Protecting your Copyright Add a copyright notice to your work and to all authorized reproductions. Every copyrighted work should be marked with the copyright symbol—©—and the copyright owner’s name, followed by the year the work was published. This will let others know that the work is an original creative work, and that they cannot legally reproduce the work or sell a reproduction. Remember that your creative work is still copyrighted, even if it does not have the “©” symbol physically printed on it. The printed symbol serves primarily to remind others that your work has been copyright, and is not theirs to reproduce. Stop violations of your copyright. If you become aware that an individual or company is reproducing or selling your copyrighted work without your permission, the correct legal step is to send them a Cease and Desist “Copyright Infringement” letter. The Cease and Desist letter communicates your ownership of the copyrighted work, and asks that the violator cease using the copyrighted creative work. An attorney (or, often, the website of a legal firm) can provide you with a form letter; you’ll need to fill in specific details. Take the copyright violator to court. If the offender continues to violate your copyright, you can take them to court to sue for damages. The judge may also issue a Cease and Desist Order, which prohibits the violator from using your copyrighted material. Under Canadian law, copyright violation can be punished with up to a $5,000 fine for infringement claims and damages.",
    "sentences": [
        " Submitting an Application to Register your Copyright Ensure that you need a copyright.",
        "All three of these provide legal protection, but cover different forms of material.",
        "If you have created commercial branding or a new invention, rather than a creative work, you may need to apply for a trademark or a patent, rather than a copyright.",
        "Copyright covers original artistic work (musical, artistic, literary, or dramatic) and gives the work’s creator the exclusive legal right to reproduce and perform the work.",
        "Trademarks are designed to protect commercial brands; they limit use of specific words and designs which describe a specific brand.",
        "Patents protect the development of new technology, or improvements made to already existing technologies.",
        "A patent limits production and sales of an invention.",
        "Visit the Canadian Intellectual Property Office (CIPO) website.",
        "Nearly all of the Canadian copyright registration process is carried out online, through the CIPO website.",
        "This site contains all of the relevant information for filing a copyright in Canada.",
        "Click on “Copyright,” on the top of the page.",
        "The site advises visitors to read the “Guide to Copyrights” before beginning the copyright application process.",
        "Click on the “Guide to Copyrights” link and study the information on that page.",
        "This will provide information about what a copyright is, what it protects, how long a copyright lasts in Canada, and provide further detailed bullet points about how to prepare and submit your application for copyright registration.",
        "Return to the main “Copyright” page and click on “Register Your Copyright.”  This link will help you begin registering your intellectual property copyright.",
        "Read the page and click on the “My Industry Canada Account” link.",
        "Before you click on the copyright e-filing application form link, you will need to setup an Industry Canada account.",
        "This will allow you to pay for the application fee.",
        "You need to have your username and password already created, because the form is on a secure server.",
        "Click on “Login to the copyright e-filing application” and fill out the application.",
        "You can both fill out and submit the entire application from this link.",
        "To register your copyright, you will need to title your work and place it within a category: photograph, music, artistic work, literary work, or dramatic work.",
        "If your work fits in multiple categories, you will still need to select one of the categories.",
        "Pick the one that best suits your work.",
        "Read through your application to ensure it is correct and complete.",
        "For your own private records, print the completed application or save it on a flash drive.",
        "Pay for the copyright application.",
        "CIPO accepts various forms of payment, including credit and debit cards, checks, wire transfers, and deposit accounts.",
        "From the main Copyright page, click on “View fees” on the center of your screen to see the applicable fees.",
        "Make payment online, using one of the acceptable payment methods.",
        "Payment for copyright registration costs $50.",
        "If you do not have a credit card or prefer not to use one, set up a CIPO deposit account.",
        "Email CIPO’s Finance, Integrated Planning and Administration office to set up your account.",
        "You can also open an account by mailing information to CIPO office at Place du Portage 1, 3rd Floor, Room 304 C, Gatineau, Quebec, K1A 0C9.",
        "You will have to pay $65 if you open a CIPO deposit account to pay for your copyright application.",
        "Receive your registration certificate.",
        "Once you have submitted the registration form, either online or by mail or fax, you will receive a registration certificate within five to seven business days.",
        "If there is a problem with your filed application, CIPO will inform you within one week from the date of filing.",
        "Protecting your Copyright Add a copyright notice to your work and to all authorized reproductions.",
        "Every copyrighted work should be marked with the copyright symbol—©—and the copyright owner’s name, followed by the year the work was published.",
        "This will let others know that the work is an original creative work, and that they cannot legally reproduce the work or sell a reproduction.",
        "Remember that your creative work is still copyrighted, even if it does not have the “©” symbol physically printed on it.",
        "The printed symbol serves primarily to remind others that your work has been copyright, and is not theirs to reproduce.",
        "Stop violations of your copyright.",
        "If you become aware that an individual or company is reproducing or selling your copyrighted work without your permission, the correct legal step is to send them a Cease and Desist “Copyright Infringement” letter.",
        "The Cease and Desist letter communicates your ownership of the copyrighted work, and asks that the violator cease using the copyrighted creative work.",
        "An attorney (or, often, the website of a legal firm) can provide you with a form letter; you’ll need to fill in specific details.",
        "Take the copyright violator to court.",
        "If the offender continues to violate your copyright, you can take them to court to sue for damages.",
        "The judge may also issue a Cease and Desist Order, which prohibits the violator from using your copyrighted material.",
        "Under Canadian law, copyright violation can be punished with up to a $5,000 fine for infringement claims and damages."
    ]
}