{
    "title": "How to Cook Asparagus",
    "url": "https://www.wikihow.com/Cook-Asparagus",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables"
    ],
    "methods": [
        {
            "name": "Prepping Asparagus",
            "steps": [
                {
                    "headline": "Choose thick or thin spears.",
                    "description": "Thin asparagus cook quickly and tend to have a crisp exterior and soft center, while thick asparagus take a bit longer to cook and have a bulkier texture. Either type of asparagus is excellent no matter how you cook it, with the main difference being the final texture. Just be sure to choose asparagus that's fresh, green and firm - not floppy or discolored - when you're picking it out at the market. Thick asparagus often has a slightly woodier stem, which you may want to peel before cooking. To peel an asparagus, just take a vegetable peeler and lightly stroke it from the middle of the asparagus to the base. Thin asparagus is a good choice for use in salads or stir fries."
                },
                {
                    "headline": "Wash fresh asparagus under cool running water.",
                    "description": "Asparagus is grown in sand, so it might have some sandy residue left in the cracks and crevices. Hold it under running water for a few moments. If sand is hiding in the tips, fill a large bowl with cool water, then dunk the asparagus in the water until the sand is removed."
                },
                {
                    "headline": "Break off the ends.",
                    "description": "The base of the asparagus is tough and woody, and not very tasty when it's cooked. The easiest way to figure out how much to take off is to feel it by hand. Hold each asparagus spear with two hands and gently bend it until you feel the spot where it gives, then break the spear. Discard the tough, white end. If you don't have the time to break each spear, place the bunch of asparagus on a cutting board and chop off about 2 inches (5.1 cm) from the bottom of the spears. If you choose to peel the asparagus, just chop about 1 inch (2.5 cm) off of the ends."
                }
            ]
        },
        {
            "name": "Blanching, Steaming or Boiling",
            "steps": [
                {
                    "headline": "Blanch the asparagus.",
                    "description": "This is a common way to quickly cook asparagus to perfection and serve it cold in salads or as a luncheon side dish. If you'd prefer to serve the asparagus warm, skip the ice water bath. Here's how to blanch asparagus:\nBoil a large pot of water and 2 teaspoons of salt. Place the asparagus in the water and let it cook for 2½ - 3 minutes. Test an asparagus spear for doneness - it should still be crispy, not limp. If you wish, plunge the asparagus in a bowl of ice water to cool it down."
                },
                {
                    "headline": "Steam asparagus in a vegetable steamer basket.",
                    "description": "For a quick, flavorful side dish, steaming is the way to go. it preserves the asparagus' nutrients and crisp texture. Place about 1 inch (2.5 cm) of water in a saucepan, and place a steamer basket in the pan. Heat the water to a boil. Break the asparagus into lengths that easily fit in the steamer. Place the asparagus into the basket, cover and steam for 5 to 7 minutes, until they're bright green and still crisp."
                },
                {
                    "headline": "Boil asparagus.",
                    "description": "This is an easy way to cook asparagus, but you have to be careful not to overcook the spears. They can quickly become limp and mushy if you aren't careful. Place a few inches of water and 2 teaspoons salt in a saucepan. Bring the water to a full boil. Place the asparagus spears in the boiling water. Once the water returns to a boil, cook for 5 minutes. If you wish, use a microwave-safe cooking dish to boil asparagus in the microwave. Fill the cooking dish with ¼ cup water, then add the spears and place the lid on the dish. Cook the asparagus on your microwave oven's high power setting for 3 minutes, then open the door and stir. Finish cooking until the spears are just barely tender, about 3 to 4 more minutes."
                }
            ]
        },
        {
            "name": "Sautéing",
            "steps": [
                {
                    "headline": "Cut the asparagus or leave the spears whole.",
                    "description": "If you want to make a stir fry, slice the spears into 1 to 2-inch pieces for stir-fry, making the cuts diagonally."
                },
                {
                    "headline": "Heat oil in a saucepan.",
                    "description": "Place about 1 tablespoon of oil or butter in a saucepan, and heat it over medium-high heat."
                },
                {
                    "headline": "Add the asparagus to the pan.",
                    "description": "Carefully place the asparagus in the pan. Use a wooden spoon or spatula to stir-fry it until it's tender, about 3 to 6 minutes. The asparagus is ready when it's bright green with a few charred spots. If you're making a stir fry, add other vegetables to the pan at the same time. Carrots, onions, green peppers, and mushrooms are all delicious served in a stir fry with asparagus."
                },
                {
                    "headline": "Season the asparagus.",
                    "description": "Sauteed asparagus is delectable with lemon juice and butter drizzled over the top. Season with salt and pepper to taste."
                }
            ]
        },
        {
            "name": "Roasting",
            "steps": [
                {
                    "headline": "Preheat the oven to 400℉ (205℃).",
                    "description": "Make sure the oven is completely preheated before you put the asparagus inside - otherwise they'll steam instead of roasting."
                },
                {
                    "headline": "Place the asparagus spears on a baking sheet.",
                    "description": "Arrange them in a single layer so that they'll cook evenly."
                },
                {
                    "headline": "Drizzle olive oil over the spears.",
                    "description": "The oil will help the asparagus stay crisp. Drizzle 2 tablespoons of olive oil evenly over the spears on the baking sheet. If you'd like to ensure the spears get evenly coated, you can toss them with the olive oil in a bowl, then arrange them on the baking sheet."
                },
                {
                    "headline": "Season with salt and pepper.",
                    "description": "Sprinkle salt and pepper to taste over the asparagus spears. To take the dish up a notch, grate some Parmesan cheese over the asparagus, too."
                },
                {
                    "headline": "Roast for 12 minutes.",
                    "description": "Place the asparagus in the oven and roast it for 12 minutes, until it turns bright green and appears charred in a few places. Take care not to overcook it, as it will quickly burn if left in the oven for too long."
                },
                {
                    "headline": "Enjoy!",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Large bowl",
        "Saucepan",
        "Vegetable steamer basket",
        "Microwave-safe cooking dish with lid",
        "Knife",
        "Wok or skillet",
        "Cooking oil",
        "Butter (optional)"
    ],
    "text": " Prepping Asparagus Choose thick or thin spears. Thin asparagus cook quickly and tend to have a crisp exterior and soft center, while thick asparagus take a bit longer to cook and have a bulkier texture. Either type of asparagus is excellent no matter how you cook it, with the main difference being the final texture. Just be sure to choose asparagus that's fresh, green and firm - not floppy or discolored - when you're picking it out at the market. Thick asparagus often has a slightly woodier stem, which you may want to peel before cooking. To peel an asparagus, just take a vegetable peeler and lightly stroke it from the middle of the asparagus to the base. Thin asparagus is a good choice for use in salads or stir fries. Wash fresh asparagus under cool running water. Asparagus is grown in sand, so it might have some sandy residue left in the cracks and crevices. Hold it under running water for a few moments. If sand is hiding in the tips, fill a large bowl with cool water, then dunk the asparagus in the water until the sand is removed. Break off the ends. The base of the asparagus is tough and woody, and not very tasty when it's cooked. The easiest way to figure out how much to take off is to feel it by hand. Hold each asparagus spear with two hands and gently bend it until you feel the spot where it gives, then break the spear. Discard the tough, white end. If you don't have the time to break each spear, place the bunch of asparagus on a cutting board and chop off about 2 inches (5.1 cm) from the bottom of the spears. If you choose to peel the asparagus, just chop about 1 inch (2.5 cm) off of the ends. Blanching, Steaming or Boiling Blanch the asparagus. This is a common way to quickly cook asparagus to perfection and serve it cold in salads or as a luncheon side dish. If you'd prefer to serve the asparagus warm, skip the ice water bath. Here's how to blanch asparagus:\nBoil a large pot of water and 2 teaspoons of salt. Place the asparagus in the water and let it cook for 2½ - 3 minutes. Test an asparagus spear for doneness - it should still be crispy, not limp. If you wish, plunge the asparagus in a bowl of ice water to cool it down. Steam asparagus in a vegetable steamer basket. For a quick, flavorful side dish, steaming is the way to go. it preserves the asparagus' nutrients and crisp texture. Place about 1 inch (2.5 cm) of water in a saucepan, and place a steamer basket in the pan. Heat the water to a boil. Break the asparagus into lengths that easily fit in the steamer. Place the asparagus into the basket, cover and steam for 5 to 7 minutes, until they're bright green and still crisp. Boil asparagus. This is an easy way to cook asparagus, but you have to be careful not to overcook the spears. They can quickly become limp and mushy if you aren't careful. Place a few inches of water and 2 teaspoons salt in a saucepan. Bring the water to a full boil. Place the asparagus spears in the boiling water. Once the water returns to a boil, cook for 5 minutes. If you wish, use a microwave-safe cooking dish to boil asparagus in the microwave. Fill the cooking dish with ¼ cup water, then add the spears and place the lid on the dish. Cook the asparagus on your microwave oven's high power setting for 3 minutes, then open the door and stir. Finish cooking until the spears are just barely tender, about 3 to 4 more minutes. Sautéing Cut the asparagus or leave the spears whole. If you want to make a stir fry, slice the spears into 1 to 2-inch pieces for stir-fry, making the cuts diagonally. Heat oil in a saucepan. Place about 1 tablespoon of oil or butter in a saucepan, and heat it over medium-high heat. Add the asparagus to the pan. Carefully place the asparagus in the pan. Use a wooden spoon or spatula to stir-fry it until it's tender, about 3 to 6 minutes. The asparagus is ready when it's bright green with a few charred spots. If you're making a stir fry, add other vegetables to the pan at the same time. Carrots, onions, green peppers, and mushrooms are all delicious served in a stir fry with asparagus. Season the asparagus. Sauteed asparagus is delectable with lemon juice and butter drizzled over the top. Season with salt and pepper to taste. Roasting Preheat the oven to 400℉ (205℃). Make sure the oven is completely preheated before you put the asparagus inside - otherwise they'll steam instead of roasting. Place the asparagus spears on a baking sheet. Arrange them in a single layer so that they'll cook evenly. Drizzle olive oil over the spears. The oil will help the asparagus stay crisp. Drizzle 2 tablespoons of olive oil evenly over the spears on the baking sheet. If you'd like to ensure the spears get evenly coated, you can toss them with the olive oil in a bowl, then arrange them on the baking sheet. Season with salt and pepper. Sprinkle salt and pepper to taste over the asparagus spears. To take the dish up a notch, grate some Parmesan cheese over the asparagus, too. Roast for 12 minutes. Place the asparagus in the oven and roast it for 12 minutes, until it turns bright green and appears charred in a few places. Take care not to overcook it, as it will quickly burn if left in the oven for too long. Enjoy! ",
    "sentences": [
        " Prepping Asparagus Choose thick or thin spears.",
        "Thin asparagus cook quickly and tend to have a crisp exterior and soft center, while thick asparagus take a bit longer to cook and have a bulkier texture.",
        "Either type of asparagus is excellent no matter how you cook it, with the main difference being the final texture.",
        "Just be sure to choose asparagus that's fresh, green and firm - not floppy or discolored - when you're picking it out at the market.",
        "Thick asparagus often has a slightly woodier stem, which you may want to peel before cooking.",
        "To peel an asparagus, just take a vegetable peeler and lightly stroke it from the middle of the asparagus to the base.",
        "Thin asparagus is a good choice for use in salads or stir fries.",
        "Wash fresh asparagus under cool running water.",
        "Asparagus is grown in sand, so it might have some sandy residue left in the cracks and crevices.",
        "Hold it under running water for a few moments.",
        "If sand is hiding in the tips, fill a large bowl with cool water, then dunk the asparagus in the water until the sand is removed.",
        "Break off the ends.",
        "The base of the asparagus is tough and woody, and not very tasty when it's cooked.",
        "The easiest way to figure out how much to take off is to feel it by hand.",
        "Hold each asparagus spear with two hands and gently bend it until you feel the spot where it gives, then break the spear.",
        "Discard the tough, white end.",
        "If you don't have the time to break each spear, place the bunch of asparagus on a cutting board and chop off about 2 inches (5.1 cm) from the bottom of the spears.",
        "If you choose to peel the asparagus, just chop about 1 inch (2.5 cm) off of the ends.",
        "Blanching, Steaming or Boiling Blanch the asparagus.",
        "This is a common way to quickly cook asparagus to perfection and serve it cold in salads or as a luncheon side dish.",
        "If you'd prefer to serve the asparagus warm, skip the ice water bath.",
        "Here's how to blanch asparagus:\nBoil a large pot of water and 2 teaspoons of salt.",
        "Place the asparagus in the water and let it cook for 2½ - 3 minutes.",
        "Test an asparagus spear for doneness - it should still be crispy, not limp.",
        "If you wish, plunge the asparagus in a bowl of ice water to cool it down.",
        "Steam asparagus in a vegetable steamer basket.",
        "For a quick, flavorful side dish, steaming is the way to go.",
        "it preserves the asparagus' nutrients and crisp texture.",
        "Place about 1 inch (2.5 cm) of water in a saucepan, and place a steamer basket in the pan.",
        "Heat the water to a boil.",
        "Break the asparagus into lengths that easily fit in the steamer.",
        "Place the asparagus into the basket, cover and steam for 5 to 7 minutes, until they're bright green and still crisp.",
        "Boil asparagus.",
        "This is an easy way to cook asparagus, but you have to be careful not to overcook the spears.",
        "They can quickly become limp and mushy if you aren't careful.",
        "Place a few inches of water and 2 teaspoons salt in a saucepan.",
        "Bring the water to a full boil.",
        "Place the asparagus spears in the boiling water.",
        "Once the water returns to a boil, cook for 5 minutes.",
        "If you wish, use a microwave-safe cooking dish to boil asparagus in the microwave.",
        "Fill the cooking dish with ¼ cup water, then add the spears and place the lid on the dish.",
        "Cook the asparagus on your microwave oven's high power setting for 3 minutes, then open the door and stir.",
        "Finish cooking until the spears are just barely tender, about 3 to 4 more minutes.",
        "Sautéing Cut the asparagus or leave the spears whole.",
        "If you want to make a stir fry, slice the spears into 1 to 2-inch pieces for stir-fry, making the cuts diagonally.",
        "Heat oil in a saucepan.",
        "Place about 1 tablespoon of oil or butter in a saucepan, and heat it over medium-high heat.",
        "Add the asparagus to the pan.",
        "Carefully place the asparagus in the pan.",
        "Use a wooden spoon or spatula to stir-fry it until it's tender, about 3 to 6 minutes.",
        "The asparagus is ready when it's bright green with a few charred spots.",
        "If you're making a stir fry, add other vegetables to the pan at the same time.",
        "Carrots, onions, green peppers, and mushrooms are all delicious served in a stir fry with asparagus.",
        "Season the asparagus.",
        "Sauteed asparagus is delectable with lemon juice and butter drizzled over the top.",
        "Season with salt and pepper to taste.",
        "Roasting Preheat the oven to 400℉ (205℃).",
        "Make sure the oven is completely preheated before you put the asparagus inside - otherwise they'll steam instead of roasting.",
        "Place the asparagus spears on a baking sheet.",
        "Arrange them in a single layer so that they'll cook evenly.",
        "Drizzle olive oil over the spears.",
        "The oil will help the asparagus stay crisp.",
        "Drizzle 2 tablespoons of olive oil evenly over the spears on the baking sheet.",
        "If you'd like to ensure the spears get evenly coated, you can toss them with the olive oil in a bowl, then arrange them on the baking sheet.",
        "Season with salt and pepper.",
        "Sprinkle salt and pepper to taste over the asparagus spears.",
        "To take the dish up a notch, grate some Parmesan cheese over the asparagus, too.",
        "Roast for 12 minutes.",
        "Place the asparagus in the oven and roast it for 12 minutes, until it turns bright green and appears charred in a few places.",
        "Take care not to overcook it, as it will quickly burn if left in the oven for too long.",
        "Enjoy!"
    ]
}