{
    "title": "How to Make Ube Halaya",
    "url": "https://www.wikihow.com/Make-Ube-Halaya",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "Asian Cuisine",
        "Philippine Dishes"
    ],
    "parts": [
        {
            "name": "Making Ube Halaya",
            "steps": [
                {
                    "headline": "Prepare the ube.",
                    "description": "Fresh ube has the strongest flavor, but frozen grated ube is easier to find in Asian markets outside the Philippines. Whichever you choose, get it ready for cooking:\n\nFresh ube: Simmer whole or in large chunks until soft but not mushy, about 30–45 minutes. Let cool to room temperature. Peel the ube (throwing away the peel), then grate the rest of it. Frozen grated ube: Leave it at room temperature until it thaws, then press it hard to squeeze out water. Pour out the water."
                },
                {
                    "headline": "Melt butter in large pan.",
                    "description": "Find a wide, deep pan large enough to hold all your ingredients. Heat the pan over medium-heat, then melt ½ cup (125g) butter or margarine."
                },
                {
                    "headline": "Add the milk and coconut milk.",
                    "description": "Pour in 1 can each of evaporated milk, sweetened condensed milk, and coconut milk. You can also try these variations instead:\nMake it extra sweet with a second can of condensed milk instead of the coconut milk. Try a less traditional, vegan recipe by leaving out the milk and using just one can of coconut milk. (Using less liquid isn't a problem, since the mixture is supposed to boil down anyway.) If you're not nostalgic for the taste of evaporated milk, you might prefer fresh milk instead."
                },
                {
                    "headline": "Add the other ingredients.",
                    "description": "Add all of the grated ube plus 1 tsp (5mL) vanilla extract. Most cooks also add 1 cup (200g) sugar. You can skip this if you prefer a stronger ube taste, since there's already sugar in the sweetened condensed milk. You can use white granulated sugar, brown sugar, or caster sugar."
                },
                {
                    "headline": "Stir for at least 30 minutes.",
                    "description": "Simmer the mixture over medium-low heat. Stir constantly to prevent it burning on the bottom of the pan. The ube halaya will gradually get thicker and thicker. It's ready once it's thick enough to cling to the spoon, about the consistency of thick cake batter. Prepare for an arm workout, since this usually takes 30–50 minutes. If the coconut milk starts to curdle, reduce the heat and stir more slowly."
                },
                {
                    "headline": "Add some of the extra butter.",
                    "description": "In the last five minutes of cooking, add an extra tablespoon (15mL) butter to make the ube halaya shiny. Mix it in for a couple minutes, then turn off the heat and let cool slightly. Use coconut oil instead if you've made latik, as described below."
                },
                {
                    "headline": "Grease a few containers.",
                    "description": "Brush the last bit of butter onto llanera flan molds or any other heat-safe container, to prevent sticking. If you don't plan to finish the jam within a couple days, use sterilized glass containers."
                },
                {
                    "headline": "Pour in the ube halaya and let cool.",
                    "description": "Spoon the thick purple mixture into the greased containers. Smooth out the surface with your spoon. Let them sit on the counter until the halaya is warm, but not hot."
                },
                {
                    "headline": "Serve or refrigerate.",
                    "description": "Some people prefer it at room temperature, while others like to cool it for a couple hours in the fridge. Either way, here are some serving ideas:\nSprinkled with latik (see below) or toasted coconut flakes\n\nSpread over bread\nSprinkled with cheese"
                },
                {
                    "headline": "Store leftovers in the fridge.",
                    "description": "Store the rest of the jam in a covered container in the refrigerator. In sterilized containers, it will stay good about 7–10 days."
                }
            ]
        },
        {
            "name": "Making Latik (for Topping)",
            "steps": [
                {
                    "headline": "Start with coconut cream or milk.",
                    "description": "Latik is made from coconut curds, which separate from the fat. You can use coconut milk, but the recipe is faster and makes more latik if you use the thicker, fattier coconut cream skimmed from the top of the can. You can also make coconut milk from fresh or shredded coconut. To make coconut cream, follow the same recipe, but use 4 parts coconut meat to one part water."
                },
                {
                    "headline": "Simmer the coconut cream until it thickens.",
                    "description": "Pour the coconut cream (or coconut milk) into a non-stick pan. Heat over medium heat until the mixture starts to simmer, then reduce to medium-low heat. Let it simmer, stirring occasionally, until it thickens. This takes about an hour."
                },
                {
                    "headline": "Keep heating until the curds and oil separate.",
                    "description": "Once most of the liquid has evaporated, the coconut cream will separate into two parts: oil and curds. Keep heating it as this happens, stirring frequently to prevent burning."
                },
                {
                    "headline": "Let the curds fry at low heat.",
                    "description": "Leave the curds and oil in the pan and reduce the heat to low. Stop stirring until the oil begins to fry the curds, turning them golden-brown. Once they start to change color, stir occasionally so they cook evenly."
                },
                {
                    "headline": "Turn off the heat.",
                    "description": "The latik will continue to cook for a few minutes, turning a deep brown color."
                },
                {
                    "headline": "Drain the coconut oil out.",
                    "description": "Pour the mixture through a mesh to separate the solid latik from the coconut oil."
                },
                {
                    "headline": "Serve on top of ube halaya.",
                    "description": "You can use the oil instead of butter in the ube halaya, or brush it on top once the halaya is finished. Sprinkle the latik on top of the ube halaya before serving\nStore latik in an airtight container in the refrigerator for up to one month. Store coconut oil in an airtight container away from light and heat. It should last for at least a few months either in or out of the refrigerator, but homemade coconut oil may have traces of curds that cause it to spoil faster."
                }
            ]
        }
    ],
    "tyn": [
        "Large pot or wok",
        "Stirring spoon",
        "Clean jars or containers"
    ],
    "text": " Making Ube Halaya Prepare the ube. Fresh ube has the strongest flavor, but frozen grated ube is easier to find in Asian markets outside the Philippines. Whichever you choose, get it ready for cooking:\n\nFresh ube: Simmer whole or in large chunks until soft but not mushy, about 30–45 minutes. Let cool to room temperature. Peel the ube (throwing away the peel), then grate the rest of it. Frozen grated ube: Leave it at room temperature until it thaws, then press it hard to squeeze out water. Pour out the water. Melt butter in large pan. Find a wide, deep pan large enough to hold all your ingredients. Heat the pan over medium-heat, then melt ½ cup (125g) butter or margarine. Add the milk and coconut milk. Pour in 1 can each of evaporated milk, sweetened condensed milk, and coconut milk. You can also try these variations instead:\nMake it extra sweet with a second can of condensed milk instead of the coconut milk. Try a less traditional, vegan recipe by leaving out the milk and using just one can of coconut milk. (Using less liquid isn't a problem, since the mixture is supposed to boil down anyway.) If you're not nostalgic for the taste of evaporated milk, you might prefer fresh milk instead. Add the other ingredients. Add all of the grated ube plus 1 tsp (5mL) vanilla extract. Most cooks also add 1 cup (200g) sugar. You can skip this if you prefer a stronger ube taste, since there's already sugar in the sweetened condensed milk. You can use white granulated sugar, brown sugar, or caster sugar. Stir for at least 30 minutes. Simmer the mixture over medium-low heat. Stir constantly to prevent it burning on the bottom of the pan. The ube halaya will gradually get thicker and thicker. It's ready once it's thick enough to cling to the spoon, about the consistency of thick cake batter. Prepare for an arm workout, since this usually takes 30–50 minutes. If the coconut milk starts to curdle, reduce the heat and stir more slowly. Add some of the extra butter. In the last five minutes of cooking, add an extra tablespoon (15mL) butter to make the ube halaya shiny. Mix it in for a couple minutes, then turn off the heat and let cool slightly. Use coconut oil instead if you've made latik, as described below. Grease a few containers. Brush the last bit of butter onto llanera flan molds or any other heat-safe container, to prevent sticking. If you don't plan to finish the jam within a couple days, use sterilized glass containers. Pour in the ube halaya and let cool. Spoon the thick purple mixture into the greased containers. Smooth out the surface with your spoon. Let them sit on the counter until the halaya is warm, but not hot. Serve or refrigerate. Some people prefer it at room temperature, while others like to cool it for a couple hours in the fridge. Either way, here are some serving ideas:\nSprinkled with latik (see below) or toasted coconut flakes\n\nSpread over bread\nSprinkled with cheese Store leftovers in the fridge. Store the rest of the jam in a covered container in the refrigerator. In sterilized containers, it will stay good about 7–10 days. Making Latik (for Topping) Start with coconut cream or milk. Latik is made from coconut curds, which separate from the fat. You can use coconut milk, but the recipe is faster and makes more latik if you use the thicker, fattier coconut cream skimmed from the top of the can. You can also make coconut milk from fresh or shredded coconut. To make coconut cream, follow the same recipe, but use 4 parts coconut meat to one part water. Simmer the coconut cream until it thickens. Pour the coconut cream (or coconut milk) into a non-stick pan. Heat over medium heat until the mixture starts to simmer, then reduce to medium-low heat. Let it simmer, stirring occasionally, until it thickens. This takes about an hour. Keep heating until the curds and oil separate. Once most of the liquid has evaporated, the coconut cream will separate into two parts: oil and curds. Keep heating it as this happens, stirring frequently to prevent burning. Let the curds fry at low heat. Leave the curds and oil in the pan and reduce the heat to low. Stop stirring until the oil begins to fry the curds, turning them golden-brown. Once they start to change color, stir occasionally so they cook evenly. Turn off the heat. The latik will continue to cook for a few minutes, turning a deep brown color. Drain the coconut oil out. Pour the mixture through a mesh to separate the solid latik from the coconut oil. Serve on top of ube halaya. You can use the oil instead of butter in the ube halaya, or brush it on top once the halaya is finished. Sprinkle the latik on top of the ube halaya before serving\nStore latik in an airtight container in the refrigerator for up to one month. Store coconut oil in an airtight container away from light and heat. It should last for at least a few months either in or out of the refrigerator, but homemade coconut oil may have traces of curds that cause it to spoil faster.",
    "sentences": [
        " Making Ube Halaya Prepare the ube.",
        "Fresh ube has the strongest flavor, but frozen grated ube is easier to find in Asian markets outside the Philippines.",
        "Whichever you choose, get it ready for cooking:\n\nFresh ube: Simmer whole or in large chunks until soft but not mushy, about 30–45 minutes.",
        "Let cool to room temperature.",
        "Peel the ube (throwing away the peel), then grate the rest of it.",
        "Frozen grated ube: Leave it at room temperature until it thaws, then press it hard to squeeze out water.",
        "Pour out the water.",
        "Melt butter in large pan.",
        "Find a wide, deep pan large enough to hold all your ingredients.",
        "Heat the pan over medium-heat, then melt ½ cup (125g) butter or margarine.",
        "Add the milk and coconut milk.",
        "Pour in 1 can each of evaporated milk, sweetened condensed milk, and coconut milk.",
        "You can also try these variations instead:\nMake it extra sweet with a second can of condensed milk instead of the coconut milk.",
        "Try a less traditional, vegan recipe by leaving out the milk and using just one can of coconut milk.",
        "(Using less liquid isn't a problem, since the mixture is supposed to boil down anyway.)",
        "If you're not nostalgic for the taste of evaporated milk, you might prefer fresh milk instead.",
        "Add the other ingredients.",
        "Add all of the grated ube plus 1 tsp (5mL) vanilla extract.",
        "Most cooks also add 1 cup (200g) sugar.",
        "You can skip this if you prefer a stronger ube taste, since there's already sugar in the sweetened condensed milk.",
        "You can use white granulated sugar, brown sugar, or caster sugar.",
        "Stir for at least 30 minutes.",
        "Simmer the mixture over medium-low heat.",
        "Stir constantly to prevent it burning on the bottom of the pan.",
        "The ube halaya will gradually get thicker and thicker.",
        "It's ready once it's thick enough to cling to the spoon, about the consistency of thick cake batter.",
        "Prepare for an arm workout, since this usually takes 30–50 minutes.",
        "If the coconut milk starts to curdle, reduce the heat and stir more slowly.",
        "Add some of the extra butter.",
        "In the last five minutes of cooking, add an extra tablespoon (15mL) butter to make the ube halaya shiny.",
        "Mix it in for a couple minutes, then turn off the heat and let cool slightly.",
        "Use coconut oil instead if you've made latik, as described below.",
        "Grease a few containers.",
        "Brush the last bit of butter onto llanera flan molds or any other heat-safe container, to prevent sticking.",
        "If you don't plan to finish the jam within a couple days, use sterilized glass containers.",
        "Pour in the ube halaya and let cool.",
        "Spoon the thick purple mixture into the greased containers.",
        "Smooth out the surface with your spoon.",
        "Let them sit on the counter until the halaya is warm, but not hot.",
        "Serve or refrigerate.",
        "Some people prefer it at room temperature, while others like to cool it for a couple hours in the fridge.",
        "Either way, here are some serving ideas:\nSprinkled with latik (see below) or toasted coconut flakes\n\nSpread over bread\nSprinkled with cheese Store leftovers in the fridge.",
        "Store the rest of the jam in a covered container in the refrigerator.",
        "In sterilized containers, it will stay good about 7–10 days.",
        "Making Latik (for Topping) Start with coconut cream or milk.",
        "Latik is made from coconut curds, which separate from the fat.",
        "You can use coconut milk, but the recipe is faster and makes more latik if you use the thicker, fattier coconut cream skimmed from the top of the can.",
        "You can also make coconut milk from fresh or shredded coconut.",
        "To make coconut cream, follow the same recipe, but use 4 parts coconut meat to one part water.",
        "Simmer the coconut cream until it thickens.",
        "Pour the coconut cream (or coconut milk) into a non-stick pan.",
        "Heat over medium heat until the mixture starts to simmer, then reduce to medium-low heat.",
        "Let it simmer, stirring occasionally, until it thickens.",
        "This takes about an hour.",
        "Keep heating until the curds and oil separate.",
        "Once most of the liquid has evaporated, the coconut cream will separate into two parts: oil and curds.",
        "Keep heating it as this happens, stirring frequently to prevent burning.",
        "Let the curds fry at low heat.",
        "Leave the curds and oil in the pan and reduce the heat to low.",
        "Stop stirring until the oil begins to fry the curds, turning them golden-brown.",
        "Once they start to change color, stir occasionally so they cook evenly.",
        "Turn off the heat.",
        "The latik will continue to cook for a few minutes, turning a deep brown color.",
        "Drain the coconut oil out.",
        "Pour the mixture through a mesh to separate the solid latik from the coconut oil.",
        "Serve on top of ube halaya.",
        "You can use the oil instead of butter in the ube halaya, or brush it on top once the halaya is finished.",
        "Sprinkle the latik on top of the ube halaya before serving\nStore latik in an airtight container in the refrigerator for up to one month.",
        "Store coconut oil in an airtight container away from light and heat.",
        "It should last for at least a few months either in or out of the refrigerator, but homemade coconut oil may have traces of curds that cause it to spoil faster."
    ]
}