{
    "title": "How to Make Waxed Dipped Bears",
    "url": "https://www.wikihow.com/Make-Waxed-Dipped-Bears",
    "category_hierarchy": [
        "Home and Garden",
        "Lighting",
        "Candles"
    ],
    "steps": [
        {
            "headline": "Place 1 pound of wax in a slow cooker.",
            "description": "Set the temperature of the cooker on low to medium. Use a cooking thermometer to measure the temperature until it reaches about 180 degrees Fahrenheit (82 C). One pound of wax will typically cover 2 small bears or 1 medium-sized bear. Add glitter to the wax before dipping the bear if you want it to sparkle."
        },
        {
            "headline": "Add a few drops of liquid candle scent to the melted wax.",
            "description": "Stir the wax with tongs. Add more scent if you prefer a strongly scented bear. Rather than add scent, you can also use pre-scented soy wax if you prefer."
        },
        {
            "headline": "Put on a pair of rubber gloves.",
            "description": "Handle tongs, the cooker and the bear with gloved hands."
        },
        {
            "headline": "Use tongs to dip a bear into the wax.",
            "description": "Turn the bear until it is completely covered with wax."
        },
        {
            "headline": "Lift the bear from the wax with tongs.",
            "description": "Hold it over the slow cooker to allow excess wax to drip off."
        },
        {
            "headline": "Hold the bear with the tongs until the wax is cool enough to not burn your hands through the gloves.",
            "description": "Squeeze the excess wax from the bear, letting it drip into the cooker."
        },
        {
            "headline": "Use a wire bristle comb to fluff the fur on the bear.",
            "description": "Pull the fur outward with the comb so it looks natural instead of matted down in the wax. Work quickly so the wax doesn't set before the bear is completely fluffed."
        },
        {
            "headline": "Set the bear on a cookie sheet until the wax cools and sets.",
            "description": ""
        },
        {
            "headline": "Add embellishments like a ribbon bow around the neck or ears.",
            "description": ""
        },
        {
            "headline": "Tie a printed tag to the wax-coated bear.",
            "description": "Include a greeting or tips on how to care for the wax-coated bear."
        },
        {
            "headline": "Wrap the bear in cellophane to preserve the scent if you are giving it as a gift or selling it at a craft show.",
            "description": "Store finished bears separately in plastic bags to keep them from sticking together."
        },
        {
            "headline": "Finished.",
            "description": ""
        }
    ],
    "tyn": [
        "Slow cooker",
        "Candle wax",
        "Cooking thermometer",
        "Liquid candle scent",
        "Plush stuffed teddy bear, 10 to 12 inches (25.4 to 30.5 cm) tall",
        "Tongs",
        "Rubber gloves",
        "Cookie sheet pan",
        "Wire bristle comb",
        "Ribbons",
        "Printed tag",
        "Cellophane bags"
    ],
    "text": " Place 1 pound of wax in a slow cooker. Set the temperature of the cooker on low to medium. Use a cooking thermometer to measure the temperature until it reaches about 180 degrees Fahrenheit (82 C). One pound of wax will typically cover 2 small bears or 1 medium-sized bear. Add glitter to the wax before dipping the bear if you want it to sparkle. Add a few drops of liquid candle scent to the melted wax. Stir the wax with tongs. Add more scent if you prefer a strongly scented bear. Rather than add scent, you can also use pre-scented soy wax if you prefer. Put on a pair of rubber gloves. Handle tongs, the cooker and the bear with gloved hands. Use tongs to dip a bear into the wax. Turn the bear until it is completely covered with wax. Lift the bear from the wax with tongs. Hold it over the slow cooker to allow excess wax to drip off. Hold the bear with the tongs until the wax is cool enough to not burn your hands through the gloves. Squeeze the excess wax from the bear, letting it drip into the cooker. Use a wire bristle comb to fluff the fur on the bear. Pull the fur outward with the comb so it looks natural instead of matted down in the wax. Work quickly so the wax doesn't set before the bear is completely fluffed. Set the bear on a cookie sheet until the wax cools and sets.  Add embellishments like a ribbon bow around the neck or ears.  Tie a printed tag to the wax-coated bear. Include a greeting or tips on how to care for the wax-coated bear. Wrap the bear in cellophane to preserve the scent if you are giving it as a gift or selling it at a craft show. Store finished bears separately in plastic bags to keep them from sticking together. Finished. ",
    "sentences": [
        " Place 1 pound of wax in a slow cooker.",
        "Set the temperature of the cooker on low to medium.",
        "Use a cooking thermometer to measure the temperature until it reaches about 180 degrees Fahrenheit (82 C).",
        "One pound of wax will typically cover 2 small bears or 1 medium-sized bear.",
        "Add glitter to the wax before dipping the bear if you want it to sparkle.",
        "Add a few drops of liquid candle scent to the melted wax.",
        "Stir the wax with tongs.",
        "Add more scent if you prefer a strongly scented bear.",
        "Rather than add scent, you can also use pre-scented soy wax if you prefer.",
        "Put on a pair of rubber gloves.",
        "Handle tongs, the cooker and the bear with gloved hands.",
        "Use tongs to dip a bear into the wax.",
        "Turn the bear until it is completely covered with wax.",
        "Lift the bear from the wax with tongs.",
        "Hold it over the slow cooker to allow excess wax to drip off.",
        "Hold the bear with the tongs until the wax is cool enough to not burn your hands through the gloves.",
        "Squeeze the excess wax from the bear, letting it drip into the cooker.",
        "Use a wire bristle comb to fluff the fur on the bear.",
        "Pull the fur outward with the comb so it looks natural instead of matted down in the wax.",
        "Work quickly so the wax doesn't set before the bear is completely fluffed.",
        "Set the bear on a cookie sheet until the wax cools and sets.",
        "Add embellishments like a ribbon bow around the neck or ears.",
        "Tie a printed tag to the wax-coated bear.",
        "Include a greeting or tips on how to care for the wax-coated bear.",
        "Wrap the bear in cellophane to preserve the scent if you are giving it as a gift or selling it at a craft show.",
        "Store finished bears separately in plastic bags to keep them from sticking together.",
        "Finished."
    ]
}