{
    "title": "How to Cook Pork Tenderloin",
    "url": "https://www.wikihow.com/Cook-Pork-Tenderloin",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Pork"
    ],
    "methods": [
        {
            "name": "Steps",
            "steps": [
                {
                    "headline": "Purchase a pork tenderloin at a local butcher or grocery store.",
                    "description": "Most tenderloins weigh ¾ to 1¼ pounds (12 to 20 ounces), which will serve three to four guests. Plan accordingly for the number of diners you intend to feed."
                },
                {
                    "headline": "Select a method for preparing pork tenderloin from the list below.",
                    "description": "Experiment with your favorite flavors."
                },
                {
                    "headline": "Select a method for cooking pork tenderloin from the list below.",
                    "description": "Choose to roast, grill, or pan-sear the tenderloin."
                }
            ]
        },
        {
            "name": "Methods for Preparing Pork Tenderloin",
            "steps": [
                {
                    "headline": "Create a dry rub.",
                    "description": "Using your favorite mix of herbs and spices, create a \"rub\" to spread over the uncooked tenderloin. The flavors will form a crust when the tenderloin is cooked. You'll need about ½ cup (48 g) of dry rub for every pound of pork tenderloin. Simply spoon the rub over the tenderloin and use your hands to spread it so it covers the entire cut of meat. Consider making a spicy chili rub with chili powder, garlic powder, cumin and pepper. Or do an Italian herb rub with dried oregano, parsley, thyme and coriander. Just make sure the spices add up to ½ cup (48 g), and top it off with a few pinches of salt."
                },
                {
                    "headline": "Brine the tenderloin.",
                    "description": "Brining meat tenderizes it and distributes flavors through to the middle. Make a brine using 1 quart (.9 liters) of water and ¼ cup of salt as the base. Put the brine in a pot, add the tenderloin, place in the fridge, covered, overnight. When you're ready to cook the tenderloin, remove it from the brine and pat it dry. Flavor the brine with additional spices like cumin, red pepper flakes, or even maple syrup. Add as much or as little of each flavor as you like."
                },
                {
                    "headline": "Marinate the tenderloin.",
                    "description": "A marinade is similar to a brine, but instead of water you soak the pork in a mixture of vinegar, oil and spices. Make a marinade with ½ cup olive oil (118 ml) and ½ cup (118 ml) vinegar. Mix in a teaspoon of each of your favorite spices. Place the pork loin in a sealable food storage bag. Pour in the marinade. Seal the bag and allow it to sit in the refrigerator overnight. When you're ready to cook the tenderloin, remove it from the food storage bag and pat it dry."
                },
                {
                    "headline": "Stuff pork tenderloin.",
                    "description": "Butterfly the tenderloin by cutting it in half lengthwise, stopping about an inch from the edge. Lay it open so you have one long pieces of tenderloin. Cover with a piece of plastic wrap and use a meat mallet to pound it flat. Spread on your favorite rub, seasoning, or a stuffing made from a few cups of cheese and breadcrumbs. Starting from one end, roll the tenderloin into a log. Hold the rolled tenderloin together using toothpicks. Cook the tenderloin using one of the following methods."
                }
            ]
        },
        {
            "name": "Methods for Cooking Pork Tenderloin",
            "steps": [
                {
                    "headline": "Make oven-roasted tenderloin.",
                    "description": "Dress the tenderloin according to the preparation method of  your choice. Preheat the oven to 400 degrees Fahrenheit, (204 degrees Celsius). Place pork tenderloin in roasting pan. Roast for 30 minutes. Turn the pork over and roast for another 25 minutes. The pork tenderloin is ready when the internal temperature reaches 145 degrees Fahrenheit (63 degrees Celsius). Remove the pork from the oven and allow to rest for 10 minutes before serving."
                },
                {
                    "headline": "Make grilled pork tenderloin.",
                    "description": "Dress the tenderloin according to the preparation method of  your choice. Heat a grill to medium-high heat. Place the tenderloin on the grill. Do not place it directly over coals or hot flames; use indirect heat, or it will burn. Cook the tenderloin for 30 - 40 minutes, flipping occasionally. The pork tenderloin is ready when the internal temperature reaches 145 degrees Fahrenheit (63 degrees Celsius). All the pork to rest for 10 minutes before serving."
                },
                {
                    "headline": "Make pan-seared pork tenderloin.",
                    "description": "Dress the tenderloin according to the preparation method of  your choice. Preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius)\nSet a skillet coated in cooking oil over medium heat. Sear the tenderloin in the skillet. When it has browned on one side, turn it over using a pair of tongs and brown the other side. Place the tenderloin in a roasting pan. Place the pan in the oven and roast for about 15 minutes, or until the internal temperature reaches 145 degrees Fahrenheit (63 degrees Celsius). Allow the pork to rest for 10 minutes before serving."
                }
            ]
        }
    ],
    "tyn": [
        "Pork tenderloin",
        "Seasonings",
        "Oven or grill",
        "Instant-read thermometer",
        "Knife",
        "Serving platter"
    ],
    "text": " Steps Purchase a pork tenderloin at a local butcher or grocery store. Most tenderloins weigh ¾ to 1¼ pounds (12 to 20 ounces), which will serve three to four guests. Plan accordingly for the number of diners you intend to feed. Select a method for preparing pork tenderloin from the list below. Experiment with your favorite flavors. Select a method for cooking pork tenderloin from the list below. Choose to roast, grill, or pan-sear the tenderloin. Methods for Preparing Pork Tenderloin Create a dry rub. Using your favorite mix of herbs and spices, create a \"rub\" to spread over the uncooked tenderloin. The flavors will form a crust when the tenderloin is cooked. You'll need about ½ cup (48 g) of dry rub for every pound of pork tenderloin. Simply spoon the rub over the tenderloin and use your hands to spread it so it covers the entire cut of meat. Consider making a spicy chili rub with chili powder, garlic powder, cumin and pepper. Or do an Italian herb rub with dried oregano, parsley, thyme and coriander. Just make sure the spices add up to ½ cup (48 g), and top it off with a few pinches of salt. Brine the tenderloin. Brining meat tenderizes it and distributes flavors through to the middle. Make a brine using 1 quart (.9 liters) of water and ¼ cup of salt as the base. Put the brine in a pot, add the tenderloin, place in the fridge, covered, overnight. When you're ready to cook the tenderloin, remove it from the brine and pat it dry. Flavor the brine with additional spices like cumin, red pepper flakes, or even maple syrup. Add as much or as little of each flavor as you like. Marinate the tenderloin. A marinade is similar to a brine, but instead of water you soak the pork in a mixture of vinegar, oil and spices. Make a marinade with ½ cup olive oil (118 ml) and ½ cup (118 ml) vinegar. Mix in a teaspoon of each of your favorite spices. Place the pork loin in a sealable food storage bag. Pour in the marinade. Seal the bag and allow it to sit in the refrigerator overnight. When you're ready to cook the tenderloin, remove it from the food storage bag and pat it dry. Stuff pork tenderloin. Butterfly the tenderloin by cutting it in half lengthwise, stopping about an inch from the edge. Lay it open so you have one long pieces of tenderloin. Cover with a piece of plastic wrap and use a meat mallet to pound it flat. Spread on your favorite rub, seasoning, or a stuffing made from a few cups of cheese and breadcrumbs. Starting from one end, roll the tenderloin into a log. Hold the rolled tenderloin together using toothpicks. Cook the tenderloin using one of the following methods. Methods for Cooking Pork Tenderloin Make oven-roasted tenderloin. Dress the tenderloin according to the preparation method of  your choice. Preheat the oven to 400 degrees Fahrenheit, (204 degrees Celsius). Place pork tenderloin in roasting pan. Roast for 30 minutes. Turn the pork over and roast for another 25 minutes. The pork tenderloin is ready when the internal temperature reaches 145 degrees Fahrenheit (63 degrees Celsius). Remove the pork from the oven and allow to rest for 10 minutes before serving. Make grilled pork tenderloin. Dress the tenderloin according to the preparation method of  your choice. Heat a grill to medium-high heat. Place the tenderloin on the grill. Do not place it directly over coals or hot flames; use indirect heat, or it will burn. Cook the tenderloin for 30 - 40 minutes, flipping occasionally. The pork tenderloin is ready when the internal temperature reaches 145 degrees Fahrenheit (63 degrees Celsius). All the pork to rest for 10 minutes before serving. Make pan-seared pork tenderloin. Dress the tenderloin according to the preparation method of  your choice. Preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius)\nSet a skillet coated in cooking oil over medium heat. Sear the tenderloin in the skillet. When it has browned on one side, turn it over using a pair of tongs and brown the other side. Place the tenderloin in a roasting pan. Place the pan in the oven and roast for about 15 minutes, or until the internal temperature reaches 145 degrees Fahrenheit (63 degrees Celsius). Allow the pork to rest for 10 minutes before serving.",
    "sentences": [
        " Steps Purchase a pork tenderloin at a local butcher or grocery store.",
        "Most tenderloins weigh ¾ to 1¼ pounds (12 to 20 ounces), which will serve three to four guests.",
        "Plan accordingly for the number of diners you intend to feed.",
        "Select a method for preparing pork tenderloin from the list below.",
        "Experiment with your favorite flavors.",
        "Select a method for cooking pork tenderloin from the list below.",
        "Choose to roast, grill, or pan-sear the tenderloin.",
        "Methods for Preparing Pork Tenderloin Create a dry rub.",
        "Using your favorite mix of herbs and spices, create a \"rub\" to spread over the uncooked tenderloin.",
        "The flavors will form a crust when the tenderloin is cooked.",
        "You'll need about ½ cup (48 g) of dry rub for every pound of pork tenderloin.",
        "Simply spoon the rub over the tenderloin and use your hands to spread it so it covers the entire cut of meat.",
        "Consider making a spicy chili rub with chili powder, garlic powder, cumin and pepper.",
        "Or do an Italian herb rub with dried oregano, parsley, thyme and coriander.",
        "Just make sure the spices add up to ½ cup (48 g), and top it off with a few pinches of salt.",
        "Brine the tenderloin.",
        "Brining meat tenderizes it and distributes flavors through to the middle.",
        "Make a brine using 1 quart (.9 liters) of water and ¼ cup of salt as the base.",
        "Put the brine in a pot, add the tenderloin, place in the fridge, covered, overnight.",
        "When you're ready to cook the tenderloin, remove it from the brine and pat it dry.",
        "Flavor the brine with additional spices like cumin, red pepper flakes, or even maple syrup.",
        "Add as much or as little of each flavor as you like.",
        "Marinate the tenderloin.",
        "A marinade is similar to a brine, but instead of water you soak the pork in a mixture of vinegar, oil and spices.",
        "Make a marinade with ½ cup olive oil (118 ml) and ½ cup (118 ml) vinegar.",
        "Mix in a teaspoon of each of your favorite spices.",
        "Place the pork loin in a sealable food storage bag.",
        "Pour in the marinade.",
        "Seal the bag and allow it to sit in the refrigerator overnight.",
        "When you're ready to cook the tenderloin, remove it from the food storage bag and pat it dry.",
        "Stuff pork tenderloin.",
        "Butterfly the tenderloin by cutting it in half lengthwise, stopping about an inch from the edge.",
        "Lay it open so you have one long pieces of tenderloin.",
        "Cover with a piece of plastic wrap and use a meat mallet to pound it flat.",
        "Spread on your favorite rub, seasoning, or a stuffing made from a few cups of cheese and breadcrumbs.",
        "Starting from one end, roll the tenderloin into a log.",
        "Hold the rolled tenderloin together using toothpicks.",
        "Cook the tenderloin using one of the following methods.",
        "Methods for Cooking Pork Tenderloin Make oven-roasted tenderloin.",
        "Dress the tenderloin according to the preparation method of  your choice.",
        "Preheat the oven to 400 degrees Fahrenheit, (204 degrees Celsius).",
        "Place pork tenderloin in roasting pan.",
        "Roast for 30 minutes.",
        "Turn the pork over and roast for another 25 minutes.",
        "The pork tenderloin is ready when the internal temperature reaches 145 degrees Fahrenheit (63 degrees Celsius).",
        "Remove the pork from the oven and allow to rest for 10 minutes before serving.",
        "Make grilled pork tenderloin.",
        "Dress the tenderloin according to the preparation method of  your choice.",
        "Heat a grill to medium-high heat.",
        "Place the tenderloin on the grill.",
        "Do not place it directly over coals or hot flames; use indirect heat, or it will burn.",
        "Cook the tenderloin for 30 - 40 minutes, flipping occasionally.",
        "The pork tenderloin is ready when the internal temperature reaches 145 degrees Fahrenheit (63 degrees Celsius).",
        "All the pork to rest for 10 minutes before serving.",
        "Make pan-seared pork tenderloin.",
        "Dress the tenderloin according to the preparation method of  your choice.",
        "Preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius)\nSet a skillet coated in cooking oil over medium heat.",
        "Sear the tenderloin in the skillet.",
        "When it has browned on one side, turn it over using a pair of tongs and brown the other side.",
        "Place the tenderloin in a roasting pan.",
        "Place the pan in the oven and roast for about 15 minutes, or until the internal temperature reaches 145 degrees Fahrenheit (63 degrees Celsius).",
        "Allow the pork to rest for 10 minutes before serving."
    ]
}