{
    "title": "How to Make Orange Juice",
    "url": "https://www.wikihow.com/Make-Orange-Juice",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Citrus Based Drinks"
    ],
    "methods": [
        {
            "name": "Squeezing Orange Juice by Hand",
            "steps": [
                {
                    "headline": "Soften the orange.",
                    "description": "Tightly squeeze or roll the oranges firmly with the palm of your hand across the counter or table to soften them up."
                },
                {
                    "headline": "Cut the orange.",
                    "description": "Slice the orange in half and remove the seeds. If you want to go seedless, use navel oranges."
                },
                {
                    "headline": "Juice the orange.",
                    "description": "Grip the one of the orange halves tightly and squeeze it by hand, using a plain juicer to coax all the juice out."
                },
                {
                    "headline": "Add pulp.",
                    "description": "Scrape the orange with a spoon and add the pulp directly to the juice if you use a hand juicer. If you prefer clear juice, pour the juice through a strainer before drinking.Add some pinch of black salt or sugar for more flavor. Some oranges are already sweet."
                },
                {
                    "headline": "Drink up!",
                    "description": "Enjoy a crisp, cold glass of freshly squeezed, unpasteurized orange juice, the way it was intended to be!"
                }
            ]
        },
        {
            "name": "Squeezing Orange Juice with an Electric Juicer",
            "steps": [
                {
                    "headline": "Prepare the oranges.",
                    "description": "Peel and quarter the oranges in sections. Smaller oranges such as mandarins may only need to be broken in half."
                },
                {
                    "headline": "Process the oranges through the feed tube.",
                    "description": "Make sure you have something to catch all that delicious juice coming out the other end! Note that some juicers have the ability to adjust how much pulp is extracted with the juice. Check out How to Find a Good Juicer for more information."
                }
            ]
        },
        {
            "name": "Squeezing Orange Juice with a Blender or Food Processor",
            "steps": [
                {
                    "headline": "Prepare your oranges for blending.",
                    "description": "Peel the oranges, then cut or tear them into 1-inch chunks. If the oranges are seeded, be sure to remove those as well."
                },
                {
                    "headline": "Pulse a few times to break up the oranges.",
                    "description": "Then process continuously until the oranges are pureed."
                },
                {
                    "headline": "Taste test the juice.",
                    "description": "If it is too dry, add some water. If not sweet enough, add sweetener to taste."
                },
                {
                    "headline": "Run the blender again.",
                    "description": "Run until it is liquified."
                },
                {
                    "headline": "Let sit for a few minutes to settle, then serve!",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Knife",
        "Juicer",
        "Glass(es)",
        "Spoon"
    ],
    "text": " Squeezing Orange Juice by Hand Soften the orange. Tightly squeeze or roll the oranges firmly with the palm of your hand across the counter or table to soften them up. Cut the orange. Slice the orange in half and remove the seeds. If you want to go seedless, use navel oranges. Juice the orange. Grip the one of the orange halves tightly and squeeze it by hand, using a plain juicer to coax all the juice out. Add pulp. Scrape the orange with a spoon and add the pulp directly to the juice if you use a hand juicer. If you prefer clear juice, pour the juice through a strainer before drinking.Add some pinch of black salt or sugar for more flavor. Some oranges are already sweet. Drink up! Enjoy a crisp, cold glass of freshly squeezed, unpasteurized orange juice, the way it was intended to be! Squeezing Orange Juice with an Electric Juicer Prepare the oranges. Peel and quarter the oranges in sections. Smaller oranges such as mandarins may only need to be broken in half. Process the oranges through the feed tube. Make sure you have something to catch all that delicious juice coming out the other end! Note that some juicers have the ability to adjust how much pulp is extracted with the juice. Check out How to Find a Good Juicer for more information. Squeezing Orange Juice with a Blender or Food Processor Prepare your oranges for blending. Peel the oranges, then cut or tear them into 1-inch chunks. If the oranges are seeded, be sure to remove those as well. Pulse a few times to break up the oranges. Then process continuously until the oranges are pureed. Taste test the juice. If it is too dry, add some water. If not sweet enough, add sweetener to taste. Run the blender again. Run until it is liquified. Let sit for a few minutes to settle, then serve! ",
    "sentences": [
        " Squeezing Orange Juice by Hand Soften the orange.",
        "Tightly squeeze or roll the oranges firmly with the palm of your hand across the counter or table to soften them up.",
        "Cut the orange.",
        "Slice the orange in half and remove the seeds.",
        "If you want to go seedless, use navel oranges.",
        "Juice the orange.",
        "Grip the one of the orange halves tightly and squeeze it by hand, using a plain juicer to coax all the juice out.",
        "Add pulp.",
        "Scrape the orange with a spoon and add the pulp directly to the juice if you use a hand juicer.",
        "If you prefer clear juice, pour the juice through a strainer before drinking.Add some pinch of black salt or sugar for more flavor.",
        "Some oranges are already sweet.",
        "Drink up!",
        "Enjoy a crisp, cold glass of freshly squeezed, unpasteurized orange juice, the way it was intended to be!",
        "Squeezing Orange Juice with an Electric Juicer Prepare the oranges.",
        "Peel and quarter the oranges in sections.",
        "Smaller oranges such as mandarins may only need to be broken in half.",
        "Process the oranges through the feed tube.",
        "Make sure you have something to catch all that delicious juice coming out the other end!",
        "Note that some juicers have the ability to adjust how much pulp is extracted with the juice.",
        "Check out How to Find a Good Juicer for more information.",
        "Squeezing Orange Juice with a Blender or Food Processor Prepare your oranges for blending.",
        "Peel the oranges, then cut or tear them into 1-inch chunks.",
        "If the oranges are seeded, be sure to remove those as well.",
        "Pulse a few times to break up the oranges.",
        "Then process continuously until the oranges are pureed.",
        "Taste test the juice.",
        "If it is too dry, add some water.",
        "If not sweet enough, add sweetener to taste.",
        "Run the blender again.",
        "Run until it is liquified.",
        "Let sit for a few minutes to settle, then serve!"
    ]
}