{
    "title": "How to Remove a Bathroom Mirror",
    "url": "https://www.wikihow.com/Remove-a-Bathroom-Mirror",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "steps": [
        {
            "headline": "Protect the sink area.",
            "description": "Lay down cardboard or plastic on any surface surrounding the mirror."
        },
        {
            "headline": "Cover the mirror with duct tape.",
            "description": "The duct tape will limit the amount of glass that drops if the mirror shatters during removal."
        },
        {
            "headline": "Use a blow dryer to soften the glue.",
            "description": "You can also use a small heat lamp. Blow-dry each area of the glass evenly. Focus the heat on the heavily glued areas if you know where the glue is."
        },
        {
            "headline": "Instruct a second person to act as a spotter for the mirror.",
            "description": "Because you will be working on removing the mirror from the wall, it's important to have a helper there to catch the mirror in case it slips down rapidly. This is especially important for larger mirrors."
        },
        {
            "headline": "Pry the mirror from the wall at it's edges.",
            "description": "Use a long putty knife."
        },
        {
            "headline": "Hold piano wire or guitar string with 2 hands.",
            "description": "Make a sawing motion with your hands. This separates the glue on the mirror from the wall."
        },
        {
            "headline": "Repeat the process of prying the mirror from the wall and heating the glue if necessary.",
            "description": ""
        },
        {
            "headline": "Pry the mirror from the wall.",
            "description": "Use a pry bar once most of the glue has been sawed through."
        },
        {
            "headline": "Lower the mirror from the wall.",
            "description": ""
        }
    ],
    "tyn": [
        "Duct tape",
        "Blow dryer or heat lamp",
        "Helper",
        "Long putty knife",
        "Piano wire or guitar string",
        "Pry bar",
        "Towels",
        "Protective gear",
        "Hammer (optional)"
    ],
    "text": " Protect the sink area. Lay down cardboard or plastic on any surface surrounding the mirror. Cover the mirror with duct tape. The duct tape will limit the amount of glass that drops if the mirror shatters during removal. Use a blow dryer to soften the glue. You can also use a small heat lamp. Blow-dry each area of the glass evenly. Focus the heat on the heavily glued areas if you know where the glue is. Instruct a second person to act as a spotter for the mirror. Because you will be working on removing the mirror from the wall, it's important to have a helper there to catch the mirror in case it slips down rapidly. This is especially important for larger mirrors. Pry the mirror from the wall at it's edges. Use a long putty knife. Hold piano wire or guitar string with 2 hands. Make a sawing motion with your hands. This separates the glue on the mirror from the wall. Repeat the process of prying the mirror from the wall and heating the glue if necessary.  Pry the mirror from the wall. Use a pry bar once most of the glue has been sawed through. Lower the mirror from the wall. ",
    "sentences": [
        " Protect the sink area.",
        "Lay down cardboard or plastic on any surface surrounding the mirror.",
        "Cover the mirror with duct tape.",
        "The duct tape will limit the amount of glass that drops if the mirror shatters during removal.",
        "Use a blow dryer to soften the glue.",
        "You can also use a small heat lamp.",
        "Blow-dry each area of the glass evenly.",
        "Focus the heat on the heavily glued areas if you know where the glue is.",
        "Instruct a second person to act as a spotter for the mirror.",
        "Because you will be working on removing the mirror from the wall, it's important to have a helper there to catch the mirror in case it slips down rapidly.",
        "This is especially important for larger mirrors.",
        "Pry the mirror from the wall at it's edges.",
        "Use a long putty knife.",
        "Hold piano wire or guitar string with 2 hands.",
        "Make a sawing motion with your hands.",
        "This separates the glue on the mirror from the wall.",
        "Repeat the process of prying the mirror from the wall and heating the glue if necessary.",
        "Pry the mirror from the wall.",
        "Use a pry bar once most of the glue has been sawed through.",
        "Lower the mirror from the wall."
    ]
}