{
    "title": "How to Bear Hunt",
    "url": "https://www.wikihow.com/Bear-Hunt",
    "category_hierarchy": [
        "Sports and Fitness",
        "Outdoor Recreation",
        "Hunting"
    ],
    "parts": [
        {
            "name": "Planning Your Hunt",
            "steps": [
                {
                    "headline": "Determine which species of bear you want to hunt.",
                    "description": "The easiest and most accessible bear species to hunt is the black bear, especially if you’re a beginner. Brown bears and grizzly bears tend to be larger and more dangerous than black bears, so you should only hunt these species if you’re a relatively experienced hunter. The best areas to hunt most bears are in wooded coastal areas, since this is where they tend to live. However, they usually can also be found in most large forests. The only exception is polar bears, which have to be hunted in the Arctic. If you don’t have experience distinguishing between bear species, try to go hunting with someone who does. Black bears have a flat nose, no visible shoulder hump, relatively large ears, and small claws. Grizzly bears have a pronounced shoulder hump, small ears, and much larger claws than a black bear."
                },
                {
                    "headline": "Consult with your local wildlife agency to see which areas to hunt in.",
                    "description": "Local governments that regulate hunting will outline individual hunt units on a custom map. Search this map and the public records of the wildlife agency to determine the bear populations and hunter success rates in the units that you’re interested in."
                },
                {
                    "headline": "Choose a hunting weapon with a lot of stopping power.",
                    "description": "Bears are strong, powerful predators, so use a relatively powerful weapon to ensure that the bear won’t be able to attack you after you shoot it. Common bear hunting weapons include muzzle-loaders, rifles, and bow and arrows. Rifles are the most popular weapon for hunting bears since they fire high-velocity bullets that can kill a bear faster than an arrow or black powder ball can. Go with the most powerful caliber rifle that you’re able to accurately shoot with. You’ll want to be able to put as much power as possible behind your bullets without sacrificing your ability to shoot well. For maximum safety, use a rifle that can be reloaded and fired again relatively quickly. This way, if your first shot doesn’t kill the bear, you’ll be able to fire a second shot before the bear can get to you. Be sure to practice shooting with your weapon before you go out on your hunt to make sure you’re able to use it effectively."
                },
                {
                    "headline": "Acquire a permit through the local wildlife regulating agency.",
                    "description": "Specify the chosen hunt unit and your weapon choice on the permit application. The unit and weapon determines the legal hunting dates for the bear hunt. Note that you may also be required to have a hunting license, separate from the permit for hunting bears. Check the laws in your particular locality. Be sure to mark the boundaries of your unit on a topographical map that you can bring with you on the hunt. Also mark all of the roads and trails that are potential access points within the legal boundaries"
                },
                {
                    "headline": "Opt to go on your hunt in the fall and spring months.",
                    "description": "Most bears spend the winter hibernating and emerge from their hiding spots in the spring. Some localities may offer permits for both times of year, but all the states that allow bear hunting will have spring permits available. You may only be able to hunt in certain units or with certain weapons during these times. However, it’s better to be limited in your weapons than limited in the number of bears. Note that if the area is experiencing a particularly cold spring, the bears in that area may extend their hibernation period for a bit longer. In that situation, it would be better to go on your hunt in the fall.Tip: The time of day that you go on your hunt is also important. For best results, start your hunt early in the day, both because this is when bears first become active and because this will maximize the amount of daylight you have at your disposal."
                }
            ]
        },
        {
            "name": "Tracking and Baiting Bears",
            "steps": [
                {
                    "headline": "Follow likely food sources to locate bears emerging from hibernation.",
                    "description": "Position yourself near the food sources that your targeted species of bear is likely to be at on a spring morning. Bears are capable of consuming a wide variety of foods from large calorie sources to gain summer fat, so don’t be too concerned about having to make the “right” decision. Grizzly bears occupy the high country and are found on rock faces during the summer months. The bears peel rocks away from scree slopes in search of protein rich moths and other insects. The bears also forage for plants and occupy areas close to game herds for hunting. Black bears are opportunistic and will utilize a variety of food sources. The bears hunt game, forage for plants and insects, and target trash from humans. Brown bears are often associated with salmon runs in the river valleys. They occupy low elevations and will hunt moose or forage until the salmon arrive. Polar bears are most active in winter months and can usually be found around holes in the ice covering frozen waters. They wait around these holes to catch seals that emerge for air."
                },
                {
                    "headline": "Use wounded game calls to draw bears into your area.",
                    "description": "Wounded game calls use high pitch squeals to imitate dying rabbits and other distressed animals that a bear might want to eat. Wounded game calls are widely available through outdoor stores and require blowing into a mouthpiece to create the sound."
                },
                {
                    "headline": "Set a bait trap to easily lure bears within shooting distance.",
                    "description": "Baits, like burnt sugar and lard, are simply foods that a bear would find particularly tasty. To set a bait trap, place your bait in a large barrel with a hole in the side where the bear can reach into it. Place this barrel somewhere you can see it but where a bear would feel comfortable eating (e.g., near a creek). To be doubly effective, use a bait trap along with wounded game calls to draw bears within shooting distance. Burnt sugar and lard baits are extremely effective for attracting bears, but the technique is illegal in some areas. Check the local regulations before implementing this technique."
                },
                {
                    "headline": "Wear clothes with no scent on them and stay downwind of the bear.",
                    "description": "Bears have an amazing sense of smell and will not come anywhere near you if they can smell you. For best results, use scent-free laundry detergent to wash the clothes you plan to hunt in and keep them separated from any clothes you wash with scented detergent."
                }
            ]
        },
        {
            "name": "Shooting and Collecting the Bear",
            "steps": [
                {
                    "headline": "Position yourself in a tree stand for a safe and effective hunting option.",
                    "description": "The vantage point of a tree stand allows the hunter to aim their shot without alerting the bear to their presence. Be sure to make your stand as comfortable as possible, since you may have to wait there for several hours. For example, place some boarding around the stand covered in camouflage in order to be able to move slightly in your stand and not risk being seen."
                },
                {
                    "headline": "Place your shot immediately behind the front shoulder of the bear.",
                    "description": "This location allows penetration through the skin and into the vital organs, which will quickly kill bears. However, 1 shot may not be enough to kill the bear, so be ready to fire a quick follow-up shot if need be."
                },
                {
                    "headline": "Skin the bear hide to take as a trophy, if desired.",
                    "description": "Lay the bear on its back with its arms and legs outstretched. Then, using a small knife, cut the bear from the pads of its paws to just below its neck. Continue cutting from its neck along its abdomen to its tail, then make 2 more cuts along its rear legs. Cut around its feet and continue cutting the hide on the bear’s back. For best results, use a smaller knife (around 4 inches (10 cm) long) to give yourself the most control while you’re cutting."
                },
                {
                    "headline": "Remove the features of the bear’s head and face.",
                    "description": "Cut as close to the bear’s skull as possible as you cut the bear’s hide away from the top of its body. This will ensure that the bear’s distinguishing facial features are able to be effectively preserved."
                },
                {
                    "headline": "Salt the hide in order to dehydrate and preserve it.",
                    "description": "Most bear hides will require about 20 pounds (9.1 kg) of salt in order to be sufficiently dehydrated. Apply the salt liberally to the inside of the hide, in the ears and nose, on the lips, and between the feet. The general rule of thumb is to apply 1 pound (0.45 kg) of salt per 1 pound (0.45 kg) of hide. For the purposes of preserving a hide, any type of salt will work. However, most hunters choose to use non-iodized, fine grained salt."
                },
                {
                    "headline": "Pack the hide and hang it in a cool, dry place for about 5 days.",
                    "description": "Pack the hide in a burlap or game bag in order to transport it out of the woods. Then, leave it hanging somewhere out of the sun and dry for about 5-7 days in order for it to fully dry out. After this much time, take your hide to a taxidermist in order to be preserved. Avoid packing the hide in a plastic bag; the plastic may rip the hair away from it."
                }
            ]
        }
    ],
    "tyn": [
        "Weapon",
        "Bear hunting permit",
        "Topographical map",
        "Baits",
        "Wounded animal calls",
        "Tree stand",
        "Small knife",
        "Salt",
        "Burlap or game bag"
    ],
    "text": " Planning Your Hunt Determine which species of bear you want to hunt. The easiest and most accessible bear species to hunt is the black bear, especially if you’re a beginner. Brown bears and grizzly bears tend to be larger and more dangerous than black bears, so you should only hunt these species if you’re a relatively experienced hunter. The best areas to hunt most bears are in wooded coastal areas, since this is where they tend to live. However, they usually can also be found in most large forests. The only exception is polar bears, which have to be hunted in the Arctic. If you don’t have experience distinguishing between bear species, try to go hunting with someone who does. Black bears have a flat nose, no visible shoulder hump, relatively large ears, and small claws. Grizzly bears have a pronounced shoulder hump, small ears, and much larger claws than a black bear. Consult with your local wildlife agency to see which areas to hunt in. Local governments that regulate hunting will outline individual hunt units on a custom map. Search this map and the public records of the wildlife agency to determine the bear populations and hunter success rates in the units that you’re interested in. Choose a hunting weapon with a lot of stopping power. Bears are strong, powerful predators, so use a relatively powerful weapon to ensure that the bear won’t be able to attack you after you shoot it. Common bear hunting weapons include muzzle-loaders, rifles, and bow and arrows. Rifles are the most popular weapon for hunting bears since they fire high-velocity bullets that can kill a bear faster than an arrow or black powder ball can. Go with the most powerful caliber rifle that you’re able to accurately shoot with. You’ll want to be able to put as much power as possible behind your bullets without sacrificing your ability to shoot well. For maximum safety, use a rifle that can be reloaded and fired again relatively quickly. This way, if your first shot doesn’t kill the bear, you’ll be able to fire a second shot before the bear can get to you. Be sure to practice shooting with your weapon before you go out on your hunt to make sure you’re able to use it effectively. Acquire a permit through the local wildlife regulating agency. Specify the chosen hunt unit and your weapon choice on the permit application. The unit and weapon determines the legal hunting dates for the bear hunt. Note that you may also be required to have a hunting license, separate from the permit for hunting bears. Check the laws in your particular locality. Be sure to mark the boundaries of your unit on a topographical map that you can bring with you on the hunt. Also mark all of the roads and trails that are potential access points within the legal boundaries Opt to go on your hunt in the fall and spring months. Most bears spend the winter hibernating and emerge from their hiding spots in the spring. Some localities may offer permits for both times of year, but all the states that allow bear hunting will have spring permits available. You may only be able to hunt in certain units or with certain weapons during these times. However, it’s better to be limited in your weapons than limited in the number of bears. Note that if the area is experiencing a particularly cold spring, the bears in that area may extend their hibernation period for a bit longer. In that situation, it would be better to go on your hunt in the fall.Tip: The time of day that you go on your hunt is also important. For best results, start your hunt early in the day, both because this is when bears first become active and because this will maximize the amount of daylight you have at your disposal. Tracking and Baiting Bears Follow likely food sources to locate bears emerging from hibernation. Position yourself near the food sources that your targeted species of bear is likely to be at on a spring morning. Bears are capable of consuming a wide variety of foods from large calorie sources to gain summer fat, so don’t be too concerned about having to make the “right” decision. Grizzly bears occupy the high country and are found on rock faces during the summer months. The bears peel rocks away from scree slopes in search of protein rich moths and other insects. The bears also forage for plants and occupy areas close to game herds for hunting. Black bears are opportunistic and will utilize a variety of food sources. The bears hunt game, forage for plants and insects, and target trash from humans. Brown bears are often associated with salmon runs in the river valleys. They occupy low elevations and will hunt moose or forage until the salmon arrive. Polar bears are most active in winter months and can usually be found around holes in the ice covering frozen waters. They wait around these holes to catch seals that emerge for air. Use wounded game calls to draw bears into your area. Wounded game calls use high pitch squeals to imitate dying rabbits and other distressed animals that a bear might want to eat. Wounded game calls are widely available through outdoor stores and require blowing into a mouthpiece to create the sound. Set a bait trap to easily lure bears within shooting distance. Baits, like burnt sugar and lard, are simply foods that a bear would find particularly tasty. To set a bait trap, place your bait in a large barrel with a hole in the side where the bear can reach into it. Place this barrel somewhere you can see it but where a bear would feel comfortable eating (e.g., near a creek). To be doubly effective, use a bait trap along with wounded game calls to draw bears within shooting distance. Burnt sugar and lard baits are extremely effective for attracting bears, but the technique is illegal in some areas. Check the local regulations before implementing this technique. Wear clothes with no scent on them and stay downwind of the bear. Bears have an amazing sense of smell and will not come anywhere near you if they can smell you. For best results, use scent-free laundry detergent to wash the clothes you plan to hunt in and keep them separated from any clothes you wash with scented detergent. Shooting and Collecting the Bear Position yourself in a tree stand for a safe and effective hunting option. The vantage point of a tree stand allows the hunter to aim their shot without alerting the bear to their presence. Be sure to make your stand as comfortable as possible, since you may have to wait there for several hours. For example, place some boarding around the stand covered in camouflage in order to be able to move slightly in your stand and not risk being seen. Place your shot immediately behind the front shoulder of the bear. This location allows penetration through the skin and into the vital organs, which will quickly kill bears. However, 1 shot may not be enough to kill the bear, so be ready to fire a quick follow-up shot if need be. Skin the bear hide to take as a trophy, if desired. Lay the bear on its back with its arms and legs outstretched. Then, using a small knife, cut the bear from the pads of its paws to just below its neck. Continue cutting from its neck along its abdomen to its tail, then make 2 more cuts along its rear legs. Cut around its feet and continue cutting the hide on the bear’s back. For best results, use a smaller knife (around 4 inches (10 cm) long) to give yourself the most control while you’re cutting. Remove the features of the bear’s head and face. Cut as close to the bear’s skull as possible as you cut the bear’s hide away from the top of its body. This will ensure that the bear’s distinguishing facial features are able to be effectively preserved. Salt the hide in order to dehydrate and preserve it. Most bear hides will require about 20 pounds (9.1 kg) of salt in order to be sufficiently dehydrated. Apply the salt liberally to the inside of the hide, in the ears and nose, on the lips, and between the feet. The general rule of thumb is to apply 1 pound (0.45 kg) of salt per 1 pound (0.45 kg) of hide. For the purposes of preserving a hide, any type of salt will work. However, most hunters choose to use non-iodized, fine grained salt. Pack the hide and hang it in a cool, dry place for about 5 days. Pack the hide in a burlap or game bag in order to transport it out of the woods. Then, leave it hanging somewhere out of the sun and dry for about 5-7 days in order for it to fully dry out. After this much time, take your hide to a taxidermist in order to be preserved. Avoid packing the hide in a plastic bag; the plastic may rip the hair away from it.",
    "sentences": [
        " Planning Your Hunt Determine which species of bear you want to hunt.",
        "The easiest and most accessible bear species to hunt is the black bear, especially if you’re a beginner.",
        "Brown bears and grizzly bears tend to be larger and more dangerous than black bears, so you should only hunt these species if you’re a relatively experienced hunter.",
        "The best areas to hunt most bears are in wooded coastal areas, since this is where they tend to live.",
        "However, they usually can also be found in most large forests.",
        "The only exception is polar bears, which have to be hunted in the Arctic.",
        "If you don’t have experience distinguishing between bear species, try to go hunting with someone who does.",
        "Black bears have a flat nose, no visible shoulder hump, relatively large ears, and small claws.",
        "Grizzly bears have a pronounced shoulder hump, small ears, and much larger claws than a black bear.",
        "Consult with your local wildlife agency to see which areas to hunt in.",
        "Local governments that regulate hunting will outline individual hunt units on a custom map.",
        "Search this map and the public records of the wildlife agency to determine the bear populations and hunter success rates in the units that you’re interested in.",
        "Choose a hunting weapon with a lot of stopping power.",
        "Bears are strong, powerful predators, so use a relatively powerful weapon to ensure that the bear won’t be able to attack you after you shoot it.",
        "Common bear hunting weapons include muzzle-loaders, rifles, and bow and arrows.",
        "Rifles are the most popular weapon for hunting bears since they fire high-velocity bullets that can kill a bear faster than an arrow or black powder ball can.",
        "Go with the most powerful caliber rifle that you’re able to accurately shoot with.",
        "You’ll want to be able to put as much power as possible behind your bullets without sacrificing your ability to shoot well.",
        "For maximum safety, use a rifle that can be reloaded and fired again relatively quickly.",
        "This way, if your first shot doesn’t kill the bear, you’ll be able to fire a second shot before the bear can get to you.",
        "Be sure to practice shooting with your weapon before you go out on your hunt to make sure you’re able to use it effectively.",
        "Acquire a permit through the local wildlife regulating agency.",
        "Specify the chosen hunt unit and your weapon choice on the permit application.",
        "The unit and weapon determines the legal hunting dates for the bear hunt.",
        "Note that you may also be required to have a hunting license, separate from the permit for hunting bears.",
        "Check the laws in your particular locality.",
        "Be sure to mark the boundaries of your unit on a topographical map that you can bring with you on the hunt.",
        "Also mark all of the roads and trails that are potential access points within the legal boundaries Opt to go on your hunt in the fall and spring months.",
        "Most bears spend the winter hibernating and emerge from their hiding spots in the spring.",
        "Some localities may offer permits for both times of year, but all the states that allow bear hunting will have spring permits available.",
        "You may only be able to hunt in certain units or with certain weapons during these times.",
        "However, it’s better to be limited in your weapons than limited in the number of bears.",
        "Note that if the area is experiencing a particularly cold spring, the bears in that area may extend their hibernation period for a bit longer.",
        "In that situation, it would be better to go on your hunt in the fall.Tip: The time of day that you go on your hunt is also important.",
        "For best results, start your hunt early in the day, both because this is when bears first become active and because this will maximize the amount of daylight you have at your disposal.",
        "Tracking and Baiting Bears Follow likely food sources to locate bears emerging from hibernation.",
        "Position yourself near the food sources that your targeted species of bear is likely to be at on a spring morning.",
        "Bears are capable of consuming a wide variety of foods from large calorie sources to gain summer fat, so don’t be too concerned about having to make the “right” decision.",
        "Grizzly bears occupy the high country and are found on rock faces during the summer months.",
        "The bears peel rocks away from scree slopes in search of protein rich moths and other insects.",
        "The bears also forage for plants and occupy areas close to game herds for hunting.",
        "Black bears are opportunistic and will utilize a variety of food sources.",
        "The bears hunt game, forage for plants and insects, and target trash from humans.",
        "Brown bears are often associated with salmon runs in the river valleys.",
        "They occupy low elevations and will hunt moose or forage until the salmon arrive.",
        "Polar bears are most active in winter months and can usually be found around holes in the ice covering frozen waters.",
        "They wait around these holes to catch seals that emerge for air.",
        "Use wounded game calls to draw bears into your area.",
        "Wounded game calls use high pitch squeals to imitate dying rabbits and other distressed animals that a bear might want to eat.",
        "Wounded game calls are widely available through outdoor stores and require blowing into a mouthpiece to create the sound.",
        "Set a bait trap to easily lure bears within shooting distance.",
        "Baits, like burnt sugar and lard, are simply foods that a bear would find particularly tasty.",
        "To set a bait trap, place your bait in a large barrel with a hole in the side where the bear can reach into it.",
        "Place this barrel somewhere you can see it but where a bear would feel comfortable eating (e.g., near a creek).",
        "To be doubly effective, use a bait trap along with wounded game calls to draw bears within shooting distance.",
        "Burnt sugar and lard baits are extremely effective for attracting bears, but the technique is illegal in some areas.",
        "Check the local regulations before implementing this technique.",
        "Wear clothes with no scent on them and stay downwind of the bear.",
        "Bears have an amazing sense of smell and will not come anywhere near you if they can smell you.",
        "For best results, use scent-free laundry detergent to wash the clothes you plan to hunt in and keep them separated from any clothes you wash with scented detergent.",
        "Shooting and Collecting the Bear Position yourself in a tree stand for a safe and effective hunting option.",
        "The vantage point of a tree stand allows the hunter to aim their shot without alerting the bear to their presence.",
        "Be sure to make your stand as comfortable as possible, since you may have to wait there for several hours.",
        "For example, place some boarding around the stand covered in camouflage in order to be able to move slightly in your stand and not risk being seen.",
        "Place your shot immediately behind the front shoulder of the bear.",
        "This location allows penetration through the skin and into the vital organs, which will quickly kill bears.",
        "However, 1 shot may not be enough to kill the bear, so be ready to fire a quick follow-up shot if need be.",
        "Skin the bear hide to take as a trophy, if desired.",
        "Lay the bear on its back with its arms and legs outstretched.",
        "Then, using a small knife, cut the bear from the pads of its paws to just below its neck.",
        "Continue cutting from its neck along its abdomen to its tail, then make 2 more cuts along its rear legs.",
        "Cut around its feet and continue cutting the hide on the bear’s back.",
        "For best results, use a smaller knife (around 4 inches (10 cm) long) to give yourself the most control while you’re cutting.",
        "Remove the features of the bear’s head and face.",
        "Cut as close to the bear’s skull as possible as you cut the bear’s hide away from the top of its body.",
        "This will ensure that the bear’s distinguishing facial features are able to be effectively preserved.",
        "Salt the hide in order to dehydrate and preserve it.",
        "Most bear hides will require about 20 pounds (9.1 kg) of salt in order to be sufficiently dehydrated.",
        "Apply the salt liberally to the inside of the hide, in the ears and nose, on the lips, and between the feet.",
        "The general rule of thumb is to apply 1 pound (0.45 kg) of salt per 1 pound (0.45 kg) of hide.",
        "For the purposes of preserving a hide, any type of salt will work.",
        "However, most hunters choose to use non-iodized, fine grained salt.",
        "Pack the hide and hang it in a cool, dry place for about 5 days.",
        "Pack the hide in a burlap or game bag in order to transport it out of the woods.",
        "Then, leave it hanging somewhere out of the sun and dry for about 5-7 days in order for it to fully dry out.",
        "After this much time, take your hide to a taxidermist in order to be preserved.",
        "Avoid packing the hide in a plastic bag; the plastic may rip the hair away from it."
    ]
}