{
    "title": "How to Smoke Sausage",
    "url": "https://www.wikihow.com/Smoke-Sausage",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Sausage"
    ],
    "methods": [
        {
            "name": "Using a Smoker",
            "steps": [
                {
                    "headline": "Soak wood chips in water for 30 minutes.",
                    "description": "Purchase whatever kind of wood chips you want to use for smoking your meat. Fill the chip tray in your smoker so it’s even with the top before pouring the wood chips into a container with water. Let the water absorb into the chips so they don’t burn as quickly in your smoker. Wood chips for smoking can be purchased at any store that sells barbecuing equipment. Experiment with different types of wood to try new smoked flavors on your sausage. Types of Wood to Use\n For mild-flavored sausages, try maple, apple, cherry, or oak pellets. If you want sausages with a prominent flavor,  use hickory, pecan, walnut, or mesquite chips."
                },
                {
                    "headline": "Heat your smoker to 200 °F (93 °C).",
                    "description": "If you have an electric smoker, set the temperature using the controls on the machine. For a charcoal smoker, start your coals in a chimney and let them heat for 15 minutes before you pour the charcoal into the bottom of your smoker. Use the built-in thermometer or a laser thermometer to check the temperature. Keep your smoker closed while it’s warming up so the heat doesn’t escape."
                },
                {
                    "headline": "Transfer the wood chips to the chip tray.",
                    "description": "Drain the excess water from the wood chips and pour the chips back into the chip tray. Slide the chip tray into the slot at the bottom of your smoker. If your smoker doesn’t have a chip tray, place the wood chips directly onto the hot charcoals to produce smoke. Since the wood chips are waterlogged, they won’t catch fire. Instead, they’ll char and produce more smoke as they heat up."
                },
                {
                    "headline": "Place your sausages inside your smoker.",
                    "description": "Set the sausages on a rack 1 inch (2.5 cm) apart from one another so the smoky flavor distributes evenly. Slide the rack into the smoker and quickly close the door. Don’t open the door again until the sausages are finished or else heat will escape your smoker and prolong your cook time. You can smoke store-bought or homemade sausages. Try smoking precooked sausages to add even more of a smoky flavor."
                },
                {
                    "headline": "Leave the damper vent open one-quarter of the way.",
                    "description": "Locate the small metal dial near the top of your smoker. Turn the dial to open the damper so some of the smoke and heat can escape. Don’t open it more than 25% or else you’ll lose most of your smoke. Opening the damper vents also provides fresh air to the flames inside of a charcoal smoker so they stay lit."
                },
                {
                    "headline": "Let the sausages cook in the smoker for 2 hours.",
                    "description": "After about 2 hours, check your sausages to see if they’ve changed in color. Use a meat thermometer to make sure their internal temperatures are 165 °F (74 °C). Once the sausage is finished cooking, you can either serve them hot or put them in your refrigerator for up to 4 days. Wear an oven mitt when you pull your sausages out of the smoker since they will be very hot. You may freeze cooked sausages for up to 3 months in an airtight container."
                }
            ]
        },
        {
            "name": "Smoking Sausages on a Charcoal Grill",
            "steps": [
                {
                    "headline": "Place a tray with 2  c (470 ml) of warm water on the bottom of your grill.",
                    "description": "Fill a disposable aluminum baking tray with warm water. Set it on one side on the bottom of your grill so you have enough room to add charcoal. The water helps keep your sausages moist while they’re cooking. Experiment with different liquids, such as beer, wine, or apple juice, to add different flavors to your meat. Make sure the water is at least room temperature so it doesn’t cool down your hot coals too much."
                },
                {
                    "headline": "Start burning your charcoal in a chimney.",
                    "description": "Fill the metal charcoal chimney with the unlit coals. Use a utility lighter to light the coals on the bottom of the chimney and set it onto the grill grate. Let the charcoal heat up for about 15 minutes. Charcoal chimneys can be purchased wherever you can find barbecuing supplies."
                },
                {
                    "headline": "Fill the other side of your grill with hot charcoal.",
                    "description": "Pour the charcoals on the outside of the water tray on the bottom of your grill. Let the grill heat to a temperature of around 275 °F (135 °C) before you start smoking your sausages. Keeping the charcoal on one side creates a cold area on your grill and a hot area over the coals."
                },
                {
                    "headline": "Place wet wood chips or pellets directly onto the coals.",
                    "description": "Use whatever hardwood you prefer to smoke your meats. Make sure the wood is soaked in water before adding it to the grill or else it will burn easily. Sprinkle a handful of wood chips over the charcoals and replace the grill grate. Use maple if you want to add some sweetness to your sausages. Apple and cherry wood add some subtle sweet and mild flavors. Try hickory or pecan wood for a strong, pungent flavor."
                },
                {
                    "headline": "Set the sausages over the water tray to cook them over indirect heat.",
                    "description": "Space your sausages about 1 inch (2.5 cm) apart from one another so the smokiness can coat their whole surface. Once you place your sausages on the grill, put the lid back on as fast as you can so they can start cooking. Don’t puncture your sausages before putting them on the grill. Usually, this is done so the casings don’t split, but you’ll lose all the juices inside the sausage. Make sure your grill’s damper vents are partially open to let some of the smoke out of the grill and to keep the charcoals lit."
                },
                {
                    "headline": "Let the sausage cook for 1 hour.",
                    "description": "Open the lid of your grill to see if your sausages have gotten brighter in color. Check if your sausages are at an internal temperature of 165 °F (74 °C) with a meat thermometer. If they’re ready, serve them hot or save them in the fridge for 3-4 days. If you want grill marks on both sides, flip your sausages over after 45 minutes. If you want to keep your sausages longer, put them in an airtight container in your freezer for up to 3 months."
                }
            ]
        },
        {
            "name": "Cooking on a Gas Grill",
            "steps": [
                {
                    "headline": "Light 1 burner on your grill and let it heat to 250 °F (121 °C).",
                    "description": "Turn on one of your burners on either side of your grill and close the lid. Use the built-in thermometer on the grill or use a laser thermometer to check the temperature. Leave one side of your grill off so your sausages will cook from indirect heat."
                },
                {
                    "headline": "Fill a tray or aluminum foil with wet wood chips or pellets.",
                    "description": "Wet the wood chips so they don’t catch fire when they’re in the grill. Line a cooking tray with a handful of the chips and place them in your grill over the burner. Alternatively, wrap a handful of wood chips in aluminum foil and poke 5-6 holes in the top so smoke can escape. You can also buy a smoke tube for your grill. Fill the tube with wood chips or pellets and light the end on fire so it burns through so it produces smoke."
                },
                {
                    "headline": "Place your sausages on the cold side of the grill.",
                    "description": "Keep the sausages about 1 inch (2.5 cm) apart from one another so they can cook evenly. Set them on the side opposite of the burner that’s turned on so they don’t overcook. Close the lid as quickly as you can once your sausages are on the grill. Keep the damper on top of your grill one-quarter of the way open so some of the smoke can escape."
                },
                {
                    "headline": "Cook the sausages for 45-60 minutes.",
                    "description": "Keep the lid closed on your grill until you check on your sausages. Use a meat thermometer to check if they are 165 °F (74 °C) on the inside. When your sausages are fully cooked, take them off of the grill and serve them hot. Store any leftover sausages in the fridge for 4 days or in your freezer for up to 3 months."
                }
            ]
        }
    ],
    "tyn": [
        "Using a Smoker",
        "Charcoal or electric smoker",
        "Wood chips",
        "Charcoal chimney",
        "Charcoal",
        "Oven mitt",
        "Meat thermometer",
        "Smoking Sausages on a Charcoal Grill",
        "Aluminum cooking tray",
        "Charcoal grill",
        "Wood chips or pellets",
        "Cooking on a Gas Grill",
        "Gas grill",
        "Tray or aluminum foil"
    ],
    "text": " Using a Smoker Soak wood chips in water for 30 minutes. Purchase whatever kind of wood chips you want to use for smoking your meat. Fill the chip tray in your smoker so it’s even with the top before pouring the wood chips into a container with water. Let the water absorb into the chips so they don’t burn as quickly in your smoker. Wood chips for smoking can be purchased at any store that sells barbecuing equipment. Experiment with different types of wood to try new smoked flavors on your sausage. Types of Wood to Use\n For mild-flavored sausages, try maple, apple, cherry, or oak pellets. If you want sausages with a prominent flavor,  use hickory, pecan, walnut, or mesquite chips. Heat your smoker to 200 °F (93 °C). If you have an electric smoker, set the temperature using the controls on the machine. For a charcoal smoker, start your coals in a chimney and let them heat for 15 minutes before you pour the charcoal into the bottom of your smoker. Use the built-in thermometer or a laser thermometer to check the temperature. Keep your smoker closed while it’s warming up so the heat doesn’t escape. Transfer the wood chips to the chip tray. Drain the excess water from the wood chips and pour the chips back into the chip tray. Slide the chip tray into the slot at the bottom of your smoker. If your smoker doesn’t have a chip tray, place the wood chips directly onto the hot charcoals to produce smoke. Since the wood chips are waterlogged, they won’t catch fire. Instead, they’ll char and produce more smoke as they heat up. Place your sausages inside your smoker. Set the sausages on a rack 1 inch (2.5 cm) apart from one another so the smoky flavor distributes evenly. Slide the rack into the smoker and quickly close the door. Don’t open the door again until the sausages are finished or else heat will escape your smoker and prolong your cook time. You can smoke store-bought or homemade sausages. Try smoking precooked sausages to add even more of a smoky flavor. Leave the damper vent open one-quarter of the way. Locate the small metal dial near the top of your smoker. Turn the dial to open the damper so some of the smoke and heat can escape. Don’t open it more than 25% or else you’ll lose most of your smoke. Opening the damper vents also provides fresh air to the flames inside of a charcoal smoker so they stay lit. Let the sausages cook in the smoker for 2 hours. After about 2 hours, check your sausages to see if they’ve changed in color. Use a meat thermometer to make sure their internal temperatures are 165 °F (74 °C). Once the sausage is finished cooking, you can either serve them hot or put them in your refrigerator for up to 4 days. Wear an oven mitt when you pull your sausages out of the smoker since they will be very hot. You may freeze cooked sausages for up to 3 months in an airtight container. Smoking Sausages on a Charcoal Grill Place a tray with 2  c (470 ml) of warm water on the bottom of your grill. Fill a disposable aluminum baking tray with warm water. Set it on one side on the bottom of your grill so you have enough room to add charcoal. The water helps keep your sausages moist while they’re cooking. Experiment with different liquids, such as beer, wine, or apple juice, to add different flavors to your meat. Make sure the water is at least room temperature so it doesn’t cool down your hot coals too much. Start burning your charcoal in a chimney. Fill the metal charcoal chimney with the unlit coals. Use a utility lighter to light the coals on the bottom of the chimney and set it onto the grill grate. Let the charcoal heat up for about 15 minutes. Charcoal chimneys can be purchased wherever you can find barbecuing supplies. Fill the other side of your grill with hot charcoal. Pour the charcoals on the outside of the water tray on the bottom of your grill. Let the grill heat to a temperature of around 275 °F (135 °C) before you start smoking your sausages. Keeping the charcoal on one side creates a cold area on your grill and a hot area over the coals. Place wet wood chips or pellets directly onto the coals. Use whatever hardwood you prefer to smoke your meats. Make sure the wood is soaked in water before adding it to the grill or else it will burn easily. Sprinkle a handful of wood chips over the charcoals and replace the grill grate. Use maple if you want to add some sweetness to your sausages. Apple and cherry wood add some subtle sweet and mild flavors. Try hickory or pecan wood for a strong, pungent flavor. Set the sausages over the water tray to cook them over indirect heat. Space your sausages about 1 inch (2.5 cm) apart from one another so the smokiness can coat their whole surface. Once you place your sausages on the grill, put the lid back on as fast as you can so they can start cooking. Don’t puncture your sausages before putting them on the grill. Usually, this is done so the casings don’t split, but you’ll lose all the juices inside the sausage. Make sure your grill’s damper vents are partially open to let some of the smoke out of the grill and to keep the charcoals lit. Let the sausage cook for 1 hour. Open the lid of your grill to see if your sausages have gotten brighter in color. Check if your sausages are at an internal temperature of 165 °F (74 °C) with a meat thermometer. If they’re ready, serve them hot or save them in the fridge for 3-4 days. If you want grill marks on both sides, flip your sausages over after 45 minutes. If you want to keep your sausages longer, put them in an airtight container in your freezer for up to 3 months. Cooking on a Gas Grill Light 1 burner on your grill and let it heat to 250 °F (121 °C). Turn on one of your burners on either side of your grill and close the lid. Use the built-in thermometer on the grill or use a laser thermometer to check the temperature. Leave one side of your grill off so your sausages will cook from indirect heat. Fill a tray or aluminum foil with wet wood chips or pellets. Wet the wood chips so they don’t catch fire when they’re in the grill. Line a cooking tray with a handful of the chips and place them in your grill over the burner. Alternatively, wrap a handful of wood chips in aluminum foil and poke 5-6 holes in the top so smoke can escape. You can also buy a smoke tube for your grill. Fill the tube with wood chips or pellets and light the end on fire so it burns through so it produces smoke. Place your sausages on the cold side of the grill. Keep the sausages about 1 inch (2.5 cm) apart from one another so they can cook evenly. Set them on the side opposite of the burner that’s turned on so they don’t overcook. Close the lid as quickly as you can once your sausages are on the grill. Keep the damper on top of your grill one-quarter of the way open so some of the smoke can escape. Cook the sausages for 45-60 minutes. Keep the lid closed on your grill until you check on your sausages. Use a meat thermometer to check if they are 165 °F (74 °C) on the inside. When your sausages are fully cooked, take them off of the grill and serve them hot. Store any leftover sausages in the fridge for 4 days or in your freezer for up to 3 months.",
    "sentences": [
        " Using a Smoker Soak wood chips in water for 30 minutes.",
        "Purchase whatever kind of wood chips you want to use for smoking your meat.",
        "Fill the chip tray in your smoker so it’s even with the top before pouring the wood chips into a container with water.",
        "Let the water absorb into the chips so they don’t burn as quickly in your smoker.",
        "Wood chips for smoking can be purchased at any store that sells barbecuing equipment.",
        "Experiment with different types of wood to try new smoked flavors on your sausage.",
        "Types of Wood to Use\n For mild-flavored sausages, try maple, apple, cherry, or oak pellets.",
        "If you want sausages with a prominent flavor,  use hickory, pecan, walnut, or mesquite chips.",
        "Heat your smoker to 200 °F (93 °C).",
        "If you have an electric smoker, set the temperature using the controls on the machine.",
        "For a charcoal smoker, start your coals in a chimney and let them heat for 15 minutes before you pour the charcoal into the bottom of your smoker.",
        "Use the built-in thermometer or a laser thermometer to check the temperature.",
        "Keep your smoker closed while it’s warming up so the heat doesn’t escape.",
        "Transfer the wood chips to the chip tray.",
        "Drain the excess water from the wood chips and pour the chips back into the chip tray.",
        "Slide the chip tray into the slot at the bottom of your smoker.",
        "If your smoker doesn’t have a chip tray, place the wood chips directly onto the hot charcoals to produce smoke.",
        "Since the wood chips are waterlogged, they won’t catch fire.",
        "Instead, they’ll char and produce more smoke as they heat up.",
        "Place your sausages inside your smoker.",
        "Set the sausages on a rack 1 inch (2.5 cm) apart from one another so the smoky flavor distributes evenly.",
        "Slide the rack into the smoker and quickly close the door.",
        "Don’t open the door again until the sausages are finished or else heat will escape your smoker and prolong your cook time.",
        "You can smoke store-bought or homemade sausages.",
        "Try smoking precooked sausages to add even more of a smoky flavor.",
        "Leave the damper vent open one-quarter of the way.",
        "Locate the small metal dial near the top of your smoker.",
        "Turn the dial to open the damper so some of the smoke and heat can escape.",
        "Don’t open it more than 25% or else you’ll lose most of your smoke.",
        "Opening the damper vents also provides fresh air to the flames inside of a charcoal smoker so they stay lit.",
        "Let the sausages cook in the smoker for 2 hours.",
        "After about 2 hours, check your sausages to see if they’ve changed in color.",
        "Use a meat thermometer to make sure their internal temperatures are 165 °F (74 °C).",
        "Once the sausage is finished cooking, you can either serve them hot or put them in your refrigerator for up to 4 days.",
        "Wear an oven mitt when you pull your sausages out of the smoker since they will be very hot.",
        "You may freeze cooked sausages for up to 3 months in an airtight container.",
        "Smoking Sausages on a Charcoal Grill Place a tray with 2  c (470 ml) of warm water on the bottom of your grill.",
        "Fill a disposable aluminum baking tray with warm water.",
        "Set it on one side on the bottom of your grill so you have enough room to add charcoal.",
        "The water helps keep your sausages moist while they’re cooking.",
        "Experiment with different liquids, such as beer, wine, or apple juice, to add different flavors to your meat.",
        "Make sure the water is at least room temperature so it doesn’t cool down your hot coals too much.",
        "Start burning your charcoal in a chimney.",
        "Fill the metal charcoal chimney with the unlit coals.",
        "Use a utility lighter to light the coals on the bottom of the chimney and set it onto the grill grate.",
        "Let the charcoal heat up for about 15 minutes.",
        "Charcoal chimneys can be purchased wherever you can find barbecuing supplies.",
        "Fill the other side of your grill with hot charcoal.",
        "Pour the charcoals on the outside of the water tray on the bottom of your grill.",
        "Let the grill heat to a temperature of around 275 °F (135 °C) before you start smoking your sausages.",
        "Keeping the charcoal on one side creates a cold area on your grill and a hot area over the coals.",
        "Place wet wood chips or pellets directly onto the coals.",
        "Use whatever hardwood you prefer to smoke your meats.",
        "Make sure the wood is soaked in water before adding it to the grill or else it will burn easily.",
        "Sprinkle a handful of wood chips over the charcoals and replace the grill grate.",
        "Use maple if you want to add some sweetness to your sausages.",
        "Apple and cherry wood add some subtle sweet and mild flavors.",
        "Try hickory or pecan wood for a strong, pungent flavor.",
        "Set the sausages over the water tray to cook them over indirect heat.",
        "Space your sausages about 1 inch (2.5 cm) apart from one another so the smokiness can coat their whole surface.",
        "Once you place your sausages on the grill, put the lid back on as fast as you can so they can start cooking.",
        "Don’t puncture your sausages before putting them on the grill.",
        "Usually, this is done so the casings don’t split, but you’ll lose all the juices inside the sausage.",
        "Make sure your grill’s damper vents are partially open to let some of the smoke out of the grill and to keep the charcoals lit.",
        "Let the sausage cook for 1 hour.",
        "Open the lid of your grill to see if your sausages have gotten brighter in color.",
        "Check if your sausages are at an internal temperature of 165 °F (74 °C) with a meat thermometer.",
        "If they’re ready, serve them hot or save them in the fridge for 3-4 days.",
        "If you want grill marks on both sides, flip your sausages over after 45 minutes.",
        "If you want to keep your sausages longer, put them in an airtight container in your freezer for up to 3 months.",
        "Cooking on a Gas Grill Light 1 burner on your grill and let it heat to 250 °F (121 °C).",
        "Turn on one of your burners on either side of your grill and close the lid.",
        "Use the built-in thermometer on the grill or use a laser thermometer to check the temperature.",
        "Leave one side of your grill off so your sausages will cook from indirect heat.",
        "Fill a tray or aluminum foil with wet wood chips or pellets.",
        "Wet the wood chips so they don’t catch fire when they’re in the grill.",
        "Line a cooking tray with a handful of the chips and place them in your grill over the burner.",
        "Alternatively, wrap a handful of wood chips in aluminum foil and poke 5-6 holes in the top so smoke can escape.",
        "You can also buy a smoke tube for your grill.",
        "Fill the tube with wood chips or pellets and light the end on fire so it burns through so it produces smoke.",
        "Place your sausages on the cold side of the grill.",
        "Keep the sausages about 1 inch (2.5 cm) apart from one another so they can cook evenly.",
        "Set them on the side opposite of the burner that’s turned on so they don’t overcook.",
        "Close the lid as quickly as you can once your sausages are on the grill.",
        "Keep the damper on top of your grill one-quarter of the way open so some of the smoke can escape.",
        "Cook the sausages for 45-60 minutes.",
        "Keep the lid closed on your grill until you check on your sausages.",
        "Use a meat thermometer to check if they are 165 °F (74 °C) on the inside.",
        "When your sausages are fully cooked, take them off of the grill and serve them hot.",
        "Store any leftover sausages in the fridge for 4 days or in your freezer for up to 3 months."
    ]
}