{
    "title": "How to Remove and Install a New Threshold",
    "url": "https://www.wikihow.com/Remove-and-Install-a-New-Threshold",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Doors and Windows",
        "Door Replacement"
    ],
    "steps": [
        {
            "headline": "Measure all dimensions of the old threshold, including length, width, and thickness.",
            "description": "Use these measurements to purchase material for your new threshold."
        },
        {
            "headline": "Remove the storm door.",
            "description": "Remove any weatherstripping that is attached to the threshold."
        },
        {
            "headline": "Insert a wood-cutting blade into a reciprocating saw.",
            "description": "The blade should be at least as long as the depth of the old threshold."
        },
        {
            "headline": "Cut the old threshold 10 inches (25.4 cm) from each door jamb.",
            "description": "Be careful not to cut the flooring. Stop the saw as soon as you feel the blade cut through the entire thickness of the threshold."
        },
        {
            "headline": "Place a flat bar between the threshold and the sub-sill beneath it and pry the center section of the threshold up and away from the sub-sill.",
            "description": "If you can't remove the entire threshold in one piece, use a hammer and a chisel to split the threshold and remove each piece."
        },
        {
            "headline": "Use the flat bar to pry the exterior board below the threshold, called the \"toe kick\", away from the sub-sill.",
            "description": "Examine the wood underneath for signs of decay or other damage."
        },
        {
            "headline": "Sweep the area thoroughly to remove pieces of wood, dirt, and any other debris.",
            "description": ""
        },
        {
            "headline": "Replace any damaged wood and spray the entire area with a borate solution to prevent rot and deter termites.",
            "description": "Be sure to follow the instructions on the borate packaging."
        },
        {
            "headline": "Cut a piece of self-adhering flashing to fit between the door jambs with the adhesive side facing down on the sub-sill.",
            "description": "The flashing should be a few inches wider than the sub-sill. Leave enough overhang on the front edge of the sub-sill to cover the top of the toe kick."
        },
        {
            "headline": "Measure the width of the right-hand side of the casing.",
            "description": "Mark that length on the back right-hand corner of the new threshold along the back edge of the threshold."
        },
        {
            "headline": "Measure the width of the jamb and stop.",
            "description": "Beginning at the same corner, mark the measured distance to the end of the threshold. Draw a perpendicular line from each mark using a square until both lines intersect."
        },
        {
            "headline": "Use a jigsaw or circular saw to cut along the layout lines.",
            "description": "Finish cutting with a handsaw."
        },
        {
            "headline": "Repeat the process in reverse for the other end of the threshold's back edge.",
            "description": ""
        },
        {
            "headline": "Cut the \"horns\" of the new threshold so they are flush with the casing edges.",
            "description": "Sand the threshold with 120-grit sandpaper. Spray the threshold with borate solution."
        },
        {
            "headline": "Place the notched threshold in position under the door stops.",
            "description": "Use a hammer and a wood block to tap the threshold into place."
        },
        {
            "headline": "Place shims.",
            "description": "Once the threshold is in place and lays tightly on the sub-sill, slide pairs of shims under the center and both ends of the threshold. Do not place shims under the horns. Position the pairs of shims so that the thin end of one shim rests against the fat end of the other shim so that the threshold will lift but won't tilt when you tap on the fat end of the shim."
        },
        {
            "headline": "Check to be sure that the threshold fits tightly against the door stops and casing.",
            "description": "Snap off the shim ends so they will be flush with the sub-sill."
        },
        {
            "headline": "Apply foam sealant underneath the threshold to secure it in place and seal any air gaps.",
            "description": ""
        },
        {
            "headline": "Place the toe kick tightly against the underside of the threshold under the flashing.",
            "description": "Screw the toe kick to the sub-sill."
        },
        {
            "headline": "Apply a thin line of foam sealant between the threshold and each of the door stops.",
            "description": ""
        },
        {
            "headline": "Paint the new threshold with deck paint or several coats of spar varnish.",
            "description": ""
        }
    ],
    "tyn": [
        "Tape measure",
        "Screwdriver",
        "Reciprocating saw with a wood-cutting blade",
        "Flat bar",
        "Hammer",
        "Chisel",
        "Broom and dustpan",
        "Borate solution",
        "Self-adhesive flashing",
        "Marker",
        "Square",
        "Jigsaw or circular saw",
        "Handsaw",
        "120-grit sandpaper",
        "Wood block",
        "Shims",
        "Foam sealant",
        "Screws",
        "Deck paint or spar varnish",
        "Drill with screwdriver bit"
    ],
    "text": " Measure all dimensions of the old threshold, including length, width, and thickness. Use these measurements to purchase material for your new threshold. Remove the storm door. Remove any weatherstripping that is attached to the threshold. Insert a wood-cutting blade into a reciprocating saw. The blade should be at least as long as the depth of the old threshold. Cut the old threshold 10 inches (25.4 cm) from each door jamb. Be careful not to cut the flooring. Stop the saw as soon as you feel the blade cut through the entire thickness of the threshold. Place a flat bar between the threshold and the sub-sill beneath it and pry the center section of the threshold up and away from the sub-sill. If you can't remove the entire threshold in one piece, use a hammer and a chisel to split the threshold and remove each piece. Use the flat bar to pry the exterior board below the threshold, called the \"toe kick\", away from the sub-sill. Examine the wood underneath for signs of decay or other damage. Sweep the area thoroughly to remove pieces of wood, dirt, and any other debris.  Replace any damaged wood and spray the entire area with a borate solution to prevent rot and deter termites. Be sure to follow the instructions on the borate packaging. Cut a piece of self-adhering flashing to fit between the door jambs with the adhesive side facing down on the sub-sill. The flashing should be a few inches wider than the sub-sill. Leave enough overhang on the front edge of the sub-sill to cover the top of the toe kick. Measure the width of the right-hand side of the casing. Mark that length on the back right-hand corner of the new threshold along the back edge of the threshold. Measure the width of the jamb and stop. Beginning at the same corner, mark the measured distance to the end of the threshold. Draw a perpendicular line from each mark using a square until both lines intersect. Use a jigsaw or circular saw to cut along the layout lines. Finish cutting with a handsaw. Repeat the process in reverse for the other end of the threshold's back edge.  Cut the \"horns\" of the new threshold so they are flush with the casing edges. Sand the threshold with 120-grit sandpaper. Spray the threshold with borate solution. Place the notched threshold in position under the door stops. Use a hammer and a wood block to tap the threshold into place. Place shims. Once the threshold is in place and lays tightly on the sub-sill, slide pairs of shims under the center and both ends of the threshold. Do not place shims under the horns. Position the pairs of shims so that the thin end of one shim rests against the fat end of the other shim so that the threshold will lift but won't tilt when you tap on the fat end of the shim. Check to be sure that the threshold fits tightly against the door stops and casing. Snap off the shim ends so they will be flush with the sub-sill. Apply foam sealant underneath the threshold to secure it in place and seal any air gaps.  Place the toe kick tightly against the underside of the threshold under the flashing. Screw the toe kick to the sub-sill. Apply a thin line of foam sealant between the threshold and each of the door stops.  Paint the new threshold with deck paint or several coats of spar varnish. ",
    "sentences": [
        " Measure all dimensions of the old threshold, including length, width, and thickness.",
        "Use these measurements to purchase material for your new threshold.",
        "Remove the storm door.",
        "Remove any weatherstripping that is attached to the threshold.",
        "Insert a wood-cutting blade into a reciprocating saw.",
        "The blade should be at least as long as the depth of the old threshold.",
        "Cut the old threshold 10 inches (25.4 cm) from each door jamb.",
        "Be careful not to cut the flooring.",
        "Stop the saw as soon as you feel the blade cut through the entire thickness of the threshold.",
        "Place a flat bar between the threshold and the sub-sill beneath it and pry the center section of the threshold up and away from the sub-sill.",
        "If you can't remove the entire threshold in one piece, use a hammer and a chisel to split the threshold and remove each piece.",
        "Use the flat bar to pry the exterior board below the threshold, called the \"toe kick\", away from the sub-sill.",
        "Examine the wood underneath for signs of decay or other damage.",
        "Sweep the area thoroughly to remove pieces of wood, dirt, and any other debris.",
        "Replace any damaged wood and spray the entire area with a borate solution to prevent rot and deter termites.",
        "Be sure to follow the instructions on the borate packaging.",
        "Cut a piece of self-adhering flashing to fit between the door jambs with the adhesive side facing down on the sub-sill.",
        "The flashing should be a few inches wider than the sub-sill.",
        "Leave enough overhang on the front edge of the sub-sill to cover the top of the toe kick.",
        "Measure the width of the right-hand side of the casing.",
        "Mark that length on the back right-hand corner of the new threshold along the back edge of the threshold.",
        "Measure the width of the jamb and stop.",
        "Beginning at the same corner, mark the measured distance to the end of the threshold.",
        "Draw a perpendicular line from each mark using a square until both lines intersect.",
        "Use a jigsaw or circular saw to cut along the layout lines.",
        "Finish cutting with a handsaw.",
        "Repeat the process in reverse for the other end of the threshold's back edge.",
        "Cut the \"horns\" of the new threshold so they are flush with the casing edges.",
        "Sand the threshold with 120-grit sandpaper.",
        "Spray the threshold with borate solution.",
        "Place the notched threshold in position under the door stops.",
        "Use a hammer and a wood block to tap the threshold into place.",
        "Place shims.",
        "Once the threshold is in place and lays tightly on the sub-sill, slide pairs of shims under the center and both ends of the threshold.",
        "Do not place shims under the horns.",
        "Position the pairs of shims so that the thin end of one shim rests against the fat end of the other shim so that the threshold will lift but won't tilt when you tap on the fat end of the shim.",
        "Check to be sure that the threshold fits tightly against the door stops and casing.",
        "Snap off the shim ends so they will be flush with the sub-sill.",
        "Apply foam sealant underneath the threshold to secure it in place and seal any air gaps.",
        "Place the toe kick tightly against the underside of the threshold under the flashing.",
        "Screw the toe kick to the sub-sill.",
        "Apply a thin line of foam sealant between the threshold and each of the door stops.",
        "Paint the new threshold with deck paint or several coats of spar varnish."
    ]
}