{
    "title": "How to Use a Clay Bar",
    "url": "https://www.wikihow.com/Use-a-Clay-Bar",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Auto Exterior and Interior Accessories"
    ],
    "parts": [
        {
            "name": "Prepping Your Car and the Clay",
            "steps": [
                {
                    "headline": "Wash and dry your car by hand before “claying” it.",
                    "description": "Remove as much of the dirt, grime, and other contaminants from the surface as possible. This will make “claying” go much more quickly. Don’t use an automatic car wash, because they tend to leave behind a lot of soap residue and other contaminants. In fact, most auto detailers will likely tell you to never use automatic car washes."
                },
                {
                    "headline": "Buy a fine grade clay bar with its matching lubricating spray.",
                    "description": "Clay bars come in 2 main categories—“fine” and “medium”—although some brands have additional sub-categories (e.g., “ultra fine”). Fine grade bars should remove most surface contaminants and any wax, but are less likely to mar the paint finish than medium-grade bars. In the hands of an experienced auto detailer, medium grade bars usually won’t result in any marring, and can remove a great deal of contamination from a car that’s gone years without a “claying.” However, especially if you’re a novice “clayer,” a fine grade bar is the safer bet. If the clay bar kit doesn’t come with a bottle of lubricating spray, buy a bottle that is the same brand as the bar. They’ll be in the same section of the auto supply store."
                },
                {
                    "headline": "Buy a 2 oz (57 g) bar for 1 car, or cut a larger bar.",
                    "description": "Clay bars usually come in sizes ranging from 2–8 oz (57–227 g). The 2 oz (57 g) size is more than enough for 1 car, and is a very manageable piece of clay to work with. If you buy a larger bar, you can cut it into sections with a sharp knife and seal up the pieces you don’t need for later use. For example, you can cut a 6 oz (170 g) bar into 3 pieces, use 1 now, and seal the other 2 in zip-close bags."
                },
                {
                    "headline": "Squeeze the clay in your hand until it’s a pliable disc.",
                    "description": "The warmth of your hands will soften the clay as you work it back and forth into a ball shape. Once it softens up, flatten it into a circular shape that is about 0.75 in (1.9 cm) thick. At this thickness, 2 oz (57 g) of clay will create a disc that’s roughly equal to 3-4 finger-widths—which is a perfect size for “claying.”"
                }
            ]
        },
        {
            "name": "\"Claying\" the First Car Section",
            "steps": [
                {
                    "headline": "Spray clay lubricant over a 2 ft × 2 ft (61 cm × 61 cm) section of car.",
                    "description": "Spray generously, so that the area is not just misted, but saturated. Also spray the clay disc lightly for extra lubrication. Start at a cleaner area of the car--like the roof or hood--and work your way to the dirtier areas--the front bumper, the bottoms of the door panels, etc. Your clay won't get filled with debris as quickly this way. While some “clayers” claim that water works fine as a lubricant, you’ll likely get much better results if you use the lubricating spray that either comes with or matches the brand of your chosen clay bar. Never \"clay\" a dry car. You’ll end up with bits of clay stuck all over the surface, and any contaminants will likely scratch the finish."
                },
                {
                    "headline": "Slide the clay back and forth gently over the lubricated area.",
                    "description": "Flatten your hand and pin the clay disc against the car with your fingers. Rub side-to-side or up-and-down, using just enough pressure to keep the clay from falling out of your hand. Add more lubricant if the clay sticks while you're trying to slide it. You’ll hear and feel the clay picking up contaminants as it slides over the surface. You may even notice some slight resistance at first due to the contaminants, in spite of the lubricating spray. Don’t rub in a circular motion. This is more likely to create scratches from contaminants embedded in the clay. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTom Eisenberg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOwner, West Coast Tires & Service\t\t\t\t\t\t\t\tTom Eisenberg is the Owner and General Manager of West Coast Tires & Service in Los Angeles, California, a family-owned AAA-approved and certified auto shop. Tom has over 10 years of experience in the auto industry. Modern Tire Dealer Magazine voted his shop one of the Best 10 Operations in the Country. Tom Eisenberg\t\t\tOwner, West Coast Tires & Service\t\t\t\tUse a clay bar after you wash and detail the car. When you buy a car, the paint is silky smooth but as you drive the car, the clear coat takes up a lot of oxidation and dirt, making the paint bumpy. A clay bar removes the oxidation."
                },
                {
                    "headline": "Check the clay, then keep working over the same area.",
                    "description": "After a few passes over the sprayed area, check the surface of the clay. If it’s full of contaminants, fold the clay disc over and flatten it out so you have a clean surface. Then, add a quick spray of lubricant to the clay and continue rubbing the same section of the car. Repeat this process until you don’t feel, hear, or see any contaminants being picked up."
                },
                {
                    "headline": "Wipe the lubricant off the car with a clean microfiber towel.",
                    "description": "The paint should be as smooth as a sheet of glass. Run your finger over it to confirm this. If it isn't super smooth, “clay” the area again. Wipe the area thoroughly, but not aggressively. You just need to remove the remaining lubricating spray."
                }
            ]
        },
        {
            "name": "Continuing the Job Section-by-Section",
            "steps": [
                {
                    "headline": "Fold the clay over to create a clean surface for the next section.",
                    "description": "Fold the clay in half and reshape it into a disc. Examine the clay surface to make sure there aren’t any contaminants on the surface. If there are, fold it over again. Spray it lightly with lubricant once you have a clean surface. A 2 oz (57 g) bar of clay should last for 3-4 “clayings” before it’s overloaded with contaminants. However, once you can’t find a clean surface in the clay, it’s time to discard it. If you spot a larger piece of contamination in the clay, pick it out with your fingers, then fold the clay over. Always discard the clay if you drop it on the ground. It will pick up too many large pieces of debris to be useful."
                },
                {
                    "headline": "Spray and \"clay\" an adjacent section that overlaps the first.",
                    "description": "Your second 2 ft × 2 ft (61 cm × 61 cm) section should overlap the first by several inches/centimeters. Spray it liberally with lubricant, and add a bit of lubricant to the clean section of your clay disc. Then, as before, rub the clay very gently over the new section in either an up-and-down or side-to-side motion. Check your clay disc regularly for built-up debris, and fold it over to create a clean surface as needed. When the clay stops picking up contaminants, wipe the excess lubricant off the car with a clean microfiber cloth."
                },
                {
                    "headline": "Continue \"claying\" the car section by section until the job is done.",
                    "description": "Keep overlapping each new section over the previous one by several inches/centimeters, and keep checking your clay disc regularly for excess contaminant buildup. If you can no longer create a clean clay surface, grab a new clay bar to finish the job. You can also “clay” plastic and chrome areas, as well as the windows—basically everything but the tires!"
                },
                {
                    "headline": "Apply a coat of wax or sealant after “claying” the whole car.",
                    "description": "Follow the instructions on the packaging of the clay bar and the wax or sealant. Waxing or sealing protects the paint from corrosion that can form in the tiny holes that had been previously filled with contaminants before “claying.”\nIf you also want to polish the car’s finish, do this after you “clay” and before waxing or sealing."
                },
                {
                    "headline": "\"Clay\" your car again when contaminants build up on the surface.",
                    "description": "If you're using a fine grade clay bar, you can clean your car with it as often as monthly. Limit \"claying\" with medium grade bars to 1-2 times per year, though, in order to protect the car's finish. If it's not exposed to excessive amounts of contamination, you may need to \"clay\" a car that's kept outside 4 times per year. A car that's kept in a garage most of the time may only need \"clayed\" 1-2 times per year."
                }
            ]
        }
    ],
    "tyn": [
        "Auto detergent and car washing supplies",
        "Auto detailing clay bar",
        "Clay lubricant spray",
        "Clean microfiber towels",
        "Auto wax or sealant"
    ],
    "text": " Prepping Your Car and the Clay Wash and dry your car by hand before “claying” it. Remove as much of the dirt, grime, and other contaminants from the surface as possible. This will make “claying” go much more quickly. Don’t use an automatic car wash, because they tend to leave behind a lot of soap residue and other contaminants. In fact, most auto detailers will likely tell you to never use automatic car washes. Buy a fine grade clay bar with its matching lubricating spray. Clay bars come in 2 main categories—“fine” and “medium”—although some brands have additional sub-categories (e.g., “ultra fine”). Fine grade bars should remove most surface contaminants and any wax, but are less likely to mar the paint finish than medium-grade bars. In the hands of an experienced auto detailer, medium grade bars usually won’t result in any marring, and can remove a great deal of contamination from a car that’s gone years without a “claying.” However, especially if you’re a novice “clayer,” a fine grade bar is the safer bet. If the clay bar kit doesn’t come with a bottle of lubricating spray, buy a bottle that is the same brand as the bar. They’ll be in the same section of the auto supply store. Buy a 2 oz (57 g) bar for 1 car, or cut a larger bar. Clay bars usually come in sizes ranging from 2–8 oz (57–227 g). The 2 oz (57 g) size is more than enough for 1 car, and is a very manageable piece of clay to work with. If you buy a larger bar, you can cut it into sections with a sharp knife and seal up the pieces you don’t need for later use. For example, you can cut a 6 oz (170 g) bar into 3 pieces, use 1 now, and seal the other 2 in zip-close bags. Squeeze the clay in your hand until it’s a pliable disc. The warmth of your hands will soften the clay as you work it back and forth into a ball shape. Once it softens up, flatten it into a circular shape that is about 0.75 in (1.9 cm) thick. At this thickness, 2 oz (57 g) of clay will create a disc that’s roughly equal to 3-4 finger-widths—which is a perfect size for “claying.” \"Claying\" the First Car Section Spray clay lubricant over a 2 ft × 2 ft (61 cm × 61 cm) section of car. Spray generously, so that the area is not just misted, but saturated. Also spray the clay disc lightly for extra lubrication. Start at a cleaner area of the car--like the roof or hood--and work your way to the dirtier areas--the front bumper, the bottoms of the door panels, etc. Your clay won't get filled with debris as quickly this way. While some “clayers” claim that water works fine as a lubricant, you’ll likely get much better results if you use the lubricating spray that either comes with or matches the brand of your chosen clay bar. Never \"clay\" a dry car. You’ll end up with bits of clay stuck all over the surface, and any contaminants will likely scratch the finish. Slide the clay back and forth gently over the lubricated area. Flatten your hand and pin the clay disc against the car with your fingers. Rub side-to-side or up-and-down, using just enough pressure to keep the clay from falling out of your hand. Add more lubricant if the clay sticks while you're trying to slide it. You’ll hear and feel the clay picking up contaminants as it slides over the surface. You may even notice some slight resistance at first due to the contaminants, in spite of the lubricating spray. Don’t rub in a circular motion. This is more likely to create scratches from contaminants embedded in the clay. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTom Eisenberg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOwner, West Coast Tires & Service\t\t\t\t\t\t\t\tTom Eisenberg is the Owner and General Manager of West Coast Tires & Service in Los Angeles, California, a family-owned AAA-approved and certified auto shop. Tom has over 10 years of experience in the auto industry. Modern Tire Dealer Magazine voted his shop one of the Best 10 Operations in the Country. Tom Eisenberg\t\t\tOwner, West Coast Tires & Service\t\t\t\tUse a clay bar after you wash and detail the car. When you buy a car, the paint is silky smooth but as you drive the car, the clear coat takes up a lot of oxidation and dirt, making the paint bumpy. A clay bar removes the oxidation. Check the clay, then keep working over the same area. After a few passes over the sprayed area, check the surface of the clay. If it’s full of contaminants, fold the clay disc over and flatten it out so you have a clean surface. Then, add a quick spray of lubricant to the clay and continue rubbing the same section of the car. Repeat this process until you don’t feel, hear, or see any contaminants being picked up. Wipe the lubricant off the car with a clean microfiber towel. The paint should be as smooth as a sheet of glass. Run your finger over it to confirm this. If it isn't super smooth, “clay” the area again. Wipe the area thoroughly, but not aggressively. You just need to remove the remaining lubricating spray. Continuing the Job Section-by-Section Fold the clay over to create a clean surface for the next section. Fold the clay in half and reshape it into a disc. Examine the clay surface to make sure there aren’t any contaminants on the surface. If there are, fold it over again. Spray it lightly with lubricant once you have a clean surface. A 2 oz (57 g) bar of clay should last for 3-4 “clayings” before it’s overloaded with contaminants. However, once you can’t find a clean surface in the clay, it’s time to discard it. If you spot a larger piece of contamination in the clay, pick it out with your fingers, then fold the clay over. Always discard the clay if you drop it on the ground. It will pick up too many large pieces of debris to be useful. Spray and \"clay\" an adjacent section that overlaps the first. Your second 2 ft × 2 ft (61 cm × 61 cm) section should overlap the first by several inches/centimeters. Spray it liberally with lubricant, and add a bit of lubricant to the clean section of your clay disc. Then, as before, rub the clay very gently over the new section in either an up-and-down or side-to-side motion. Check your clay disc regularly for built-up debris, and fold it over to create a clean surface as needed. When the clay stops picking up contaminants, wipe the excess lubricant off the car with a clean microfiber cloth. Continue \"claying\" the car section by section until the job is done. Keep overlapping each new section over the previous one by several inches/centimeters, and keep checking your clay disc regularly for excess contaminant buildup. If you can no longer create a clean clay surface, grab a new clay bar to finish the job. You can also “clay” plastic and chrome areas, as well as the windows—basically everything but the tires! Apply a coat of wax or sealant after “claying” the whole car. Follow the instructions on the packaging of the clay bar and the wax or sealant. Waxing or sealing protects the paint from corrosion that can form in the tiny holes that had been previously filled with contaminants before “claying.”\nIf you also want to polish the car’s finish, do this after you “clay” and before waxing or sealing. \"Clay\" your car again when contaminants build up on the surface. If you're using a fine grade clay bar, you can clean your car with it as often as monthly. Limit \"claying\" with medium grade bars to 1-2 times per year, though, in order to protect the car's finish. If it's not exposed to excessive amounts of contamination, you may need to \"clay\" a car that's kept outside 4 times per year. A car that's kept in a garage most of the time may only need \"clayed\" 1-2 times per year.",
    "sentences": [
        " Prepping Your Car and the Clay Wash and dry your car by hand before “claying” it.",
        "Remove as much of the dirt, grime, and other contaminants from the surface as possible.",
        "This will make “claying” go much more quickly.",
        "Don’t use an automatic car wash, because they tend to leave behind a lot of soap residue and other contaminants.",
        "In fact, most auto detailers will likely tell you to never use automatic car washes.",
        "Buy a fine grade clay bar with its matching lubricating spray.",
        "Clay bars come in 2 main categories—“fine” and “medium”—although some brands have additional sub-categories (e.g., “ultra fine”).",
        "Fine grade bars should remove most surface contaminants and any wax, but are less likely to mar the paint finish than medium-grade bars.",
        "In the hands of an experienced auto detailer, medium grade bars usually won’t result in any marring, and can remove a great deal of contamination from a car that’s gone years without a “claying.” However, especially if you’re a novice “clayer,” a fine grade bar is the safer bet.",
        "If the clay bar kit doesn’t come with a bottle of lubricating spray, buy a bottle that is the same brand as the bar.",
        "They’ll be in the same section of the auto supply store.",
        "Buy a 2 oz (57 g) bar for 1 car, or cut a larger bar.",
        "Clay bars usually come in sizes ranging from 2–8 oz (57–227 g).",
        "The 2 oz (57 g) size is more than enough for 1 car, and is a very manageable piece of clay to work with.",
        "If you buy a larger bar, you can cut it into sections with a sharp knife and seal up the pieces you don’t need for later use.",
        "For example, you can cut a 6 oz (170 g) bar into 3 pieces, use 1 now, and seal the other 2 in zip-close bags.",
        "Squeeze the clay in your hand until it’s a pliable disc.",
        "The warmth of your hands will soften the clay as you work it back and forth into a ball shape.",
        "Once it softens up, flatten it into a circular shape that is about 0.75 in (1.9 cm) thick.",
        "At this thickness, 2 oz (57 g) of clay will create a disc that’s roughly equal to 3-4 finger-widths—which is a perfect size for “claying.” \"Claying\" the First Car Section Spray clay lubricant over a 2 ft × 2 ft (61 cm × 61 cm) section of car.",
        "Spray generously, so that the area is not just misted, but saturated.",
        "Also spray the clay disc lightly for extra lubrication.",
        "Start at a cleaner area of the car--like the roof or hood--and work your way to the dirtier areas--the front bumper, the bottoms of the door panels, etc.",
        "Your clay won't get filled with debris as quickly this way.",
        "While some “clayers” claim that water works fine as a lubricant, you’ll likely get much better results if you use the lubricating spray that either comes with or matches the brand of your chosen clay bar.",
        "Never \"clay\" a dry car.",
        "You’ll end up with bits of clay stuck all over the surface, and any contaminants will likely scratch the finish.",
        "Slide the clay back and forth gently over the lubricated area.",
        "Flatten your hand and pin the clay disc against the car with your fingers.",
        "Rub side-to-side or up-and-down, using just enough pressure to keep the clay from falling out of your hand.",
        "Add more lubricant if the clay sticks while you're trying to slide it.",
        "You’ll hear and feel the clay picking up contaminants as it slides over the surface.",
        "You may even notice some slight resistance at first due to the contaminants, in spite of the lubricating spray.",
        "Don’t rub in a circular motion.",
        "This is more likely to create scratches from contaminants embedded in the clay.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTom Eisenberg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOwner, West Coast Tires & Service\t\t\t\t\t\t\t\tTom Eisenberg is the Owner and General Manager of West Coast Tires & Service in Los Angeles, California, a family-owned AAA-approved and certified auto shop.",
        "Tom has over 10 years of experience in the auto industry.",
        "Modern Tire Dealer Magazine voted his shop one of the Best 10 Operations in the Country.",
        "Tom Eisenberg\t\t\tOwner, West Coast Tires & Service\t\t\t\tUse a clay bar after you wash and detail the car.",
        "When you buy a car, the paint is silky smooth but as you drive the car, the clear coat takes up a lot of oxidation and dirt, making the paint bumpy.",
        "A clay bar removes the oxidation.",
        "Check the clay, then keep working over the same area.",
        "After a few passes over the sprayed area, check the surface of the clay.",
        "If it’s full of contaminants, fold the clay disc over and flatten it out so you have a clean surface.",
        "Then, add a quick spray of lubricant to the clay and continue rubbing the same section of the car.",
        "Repeat this process until you don’t feel, hear, or see any contaminants being picked up.",
        "Wipe the lubricant off the car with a clean microfiber towel.",
        "The paint should be as smooth as a sheet of glass.",
        "Run your finger over it to confirm this.",
        "If it isn't super smooth, “clay” the area again.",
        "Wipe the area thoroughly, but not aggressively.",
        "You just need to remove the remaining lubricating spray.",
        "Continuing the Job Section-by-Section Fold the clay over to create a clean surface for the next section.",
        "Fold the clay in half and reshape it into a disc.",
        "Examine the clay surface to make sure there aren’t any contaminants on the surface.",
        "If there are, fold it over again.",
        "Spray it lightly with lubricant once you have a clean surface.",
        "A 2 oz (57 g) bar of clay should last for 3-4 “clayings” before it’s overloaded with contaminants.",
        "However, once you can’t find a clean surface in the clay, it’s time to discard it.",
        "If you spot a larger piece of contamination in the clay, pick it out with your fingers, then fold the clay over.",
        "Always discard the clay if you drop it on the ground.",
        "It will pick up too many large pieces of debris to be useful.",
        "Spray and \"clay\" an adjacent section that overlaps the first.",
        "Your second 2 ft × 2 ft (61 cm × 61 cm) section should overlap the first by several inches/centimeters.",
        "Spray it liberally with lubricant, and add a bit of lubricant to the clean section of your clay disc.",
        "Then, as before, rub the clay very gently over the new section in either an up-and-down or side-to-side motion.",
        "Check your clay disc regularly for built-up debris, and fold it over to create a clean surface as needed.",
        "When the clay stops picking up contaminants, wipe the excess lubricant off the car with a clean microfiber cloth.",
        "Continue \"claying\" the car section by section until the job is done.",
        "Keep overlapping each new section over the previous one by several inches/centimeters, and keep checking your clay disc regularly for excess contaminant buildup.",
        "If you can no longer create a clean clay surface, grab a new clay bar to finish the job.",
        "You can also “clay” plastic and chrome areas, as well as the windows—basically everything but the tires!",
        "Apply a coat of wax or sealant after “claying” the whole car.",
        "Follow the instructions on the packaging of the clay bar and the wax or sealant.",
        "Waxing or sealing protects the paint from corrosion that can form in the tiny holes that had been previously filled with contaminants before “claying.”\nIf you also want to polish the car’s finish, do this after you “clay” and before waxing or sealing.",
        "\"Clay\" your car again when contaminants build up on the surface.",
        "If you're using a fine grade clay bar, you can clean your car with it as often as monthly.",
        "Limit \"claying\" with medium grade bars to 1-2 times per year, though, in order to protect the car's finish.",
        "If it's not exposed to excessive amounts of contamination, you may need to \"clay\" a car that's kept outside 4 times per year.",
        "A car that's kept in a garage most of the time may only need \"clayed\" 1-2 times per year."
    ]
}