{
    "title": "How to Be a Good Central Midfielder in Soccer",
    "url": "https://www.wikihow.com/Be-a-Good-Central-Midfielder-in-Soccer",
    "category_hierarchy": [
        "Sports and Fitness",
        "Team Sports",
        "Soccer"
    ],
    "steps": [
        {
            "headline": "Get some experience playing soccer/football.",
            "description": "Central midfield is the most challenging position to master because the game revolves around you and it takes time be a good midfielder."
        },
        {
            "headline": "Be fit.",
            "description": "Check out How to get fit. Build stamina. It's important to be a good athlete; it is crucial to be fit for this position. It is the most important position on the field. (You shouldn't be pacey; it's actually unnecessary to be fast)."
        },
        {
            "headline": "Have good technical ability.",
            "description": "Work on your skills. Ball skills should be above average or exemplary because you are the man who holds the ball for most of the time and you cannot lose the ball. You should be able to control, pass and receive the ball well. (Not only with your feet but other parts of your body like chest and thighs.) Be able to dribble very well."
        },
        {
            "headline": "Be willing and able to pass.",
            "description": "If you are not good at passing, do not bother to play in the midfield (CAM ,CM, CDM). The midfield is where the magic happens where the people with the best skill of distributing the ball play. You must to play in the air and on the ground with short passes both of which should be weighted properly. You should be the player who can read and analyse the game and spot runs your team-mates are making and execute a pass. This is crucial as central midfielders should be able to create more chances for their team to score. This is why they are called playmakers."
        },
        {
            "headline": "Work on your defensive maneuvers.",
            "description": "Central midfield is not only about attack. You are the engine that keeps the team going offensively and defensively.Don't overcommit and stab! Force the offense to make a mistake or force them to play the ball backwards! {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/33\\/Be-a-Good-Central-Midfielder-in-Soccer-Step-5.jpg\\/v4-460px-Be-a-Good-Central-Midfielder-in-Soccer-Step-5.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/33\\/Be-a-Good-Central-Midfielder-in-Soccer-Step-5.jpg\\/v4-760px-Be-a-Good-Central-Midfielder-in-Soccer-Step-5.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
            "headline": "Be aware of the ball and any shooting opportunities.",
            "description": "Always take note of who is around you and move into space when off the ball. Have good vision. This will enable you to move the ball around well and create scoring opportunities. You as a center Mid has to control the play. This means distributing the ball and checking to every ball. Shoot when you can. It is not a crucial part of midfield but given you are not usually in the box, an occasional nice shot is always a great bonus."
        }
    ],
    "tyn": [
        "A pitch/a grassy area",
        "A friend",
        "A soccer ball",
        "Good pair of cleats or turfs depending on the type of field.",
        "Shorts/sweatpants",
        "Shin guards come in handy.",
        "Mouth guard"
    ],
    "text": " Get some experience playing soccer/football. Central midfield is the most challenging position to master because the game revolves around you and it takes time be a good midfielder. Be fit. Check out How to get fit. Build stamina. It's important to be a good athlete; it is crucial to be fit for this position. It is the most important position on the field. (You shouldn't be pacey; it's actually unnecessary to be fast). Have good technical ability. Work on your skills. Ball skills should be above average or exemplary because you are the man who holds the ball for most of the time and you cannot lose the ball. You should be able to control, pass and receive the ball well. (Not only with your feet but other parts of your body like chest and thighs.) Be able to dribble very well. Be willing and able to pass. If you are not good at passing, do not bother to play in the midfield (CAM ,CM, CDM). The midfield is where the magic happens where the people with the best skill of distributing the ball play. You must to play in the air and on the ground with short passes both of which should be weighted properly. You should be the player who can read and analyse the game and spot runs your team-mates are making and execute a pass. This is crucial as central midfielders should be able to create more chances for their team to score. This is why they are called playmakers. Work on your defensive maneuvers. Central midfield is not only about attack. You are the engine that keeps the team going offensively and defensively.Don't overcommit and stab! Force the offense to make a mistake or force them to play the ball backwards! {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/33\\/Be-a-Good-Central-Midfielder-in-Soccer-Step-5.jpg\\/v4-460px-Be-a-Good-Central-Midfielder-in-Soccer-Step-5.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/33\\/Be-a-Good-Central-Midfielder-in-Soccer-Step-5.jpg\\/v4-760px-Be-a-Good-Central-Midfielder-in-Soccer-Step-5.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Be aware of the ball and any shooting opportunities. Always take note of who is around you and move into space when off the ball. Have good vision. This will enable you to move the ball around well and create scoring opportunities. You as a center Mid has to control the play. This means distributing the ball and checking to every ball. Shoot when you can. It is not a crucial part of midfield but given you are not usually in the box, an occasional nice shot is always a great bonus.",
    "sentences": [
        " Get some experience playing soccer/football.",
        "Central midfield is the most challenging position to master because the game revolves around you and it takes time be a good midfielder.",
        "Be fit.",
        "Check out How to get fit.",
        "Build stamina.",
        "It's important to be a good athlete; it is crucial to be fit for this position.",
        "It is the most important position on the field.",
        "(You shouldn't be pacey; it's actually unnecessary to be fast).",
        "Have good technical ability.",
        "Work on your skills.",
        "Ball skills should be above average or exemplary because you are the man who holds the ball for most of the time and you cannot lose the ball.",
        "You should be able to control, pass and receive the ball well.",
        "(Not only with your feet but other parts of your body like chest and thighs.)",
        "Be able to dribble very well.",
        "Be willing and able to pass.",
        "If you are not good at passing, do not bother to play in the midfield (CAM ,CM, CDM).",
        "The midfield is where the magic happens where the people with the best skill of distributing the ball play.",
        "You must to play in the air and on the ground with short passes both of which should be weighted properly.",
        "You should be the player who can read and analyse the game and spot runs your team-mates are making and execute a pass.",
        "This is crucial as central midfielders should be able to create more chances for their team to score.",
        "This is why they are called playmakers.",
        "Work on your defensive maneuvers.",
        "Central midfield is not only about attack.",
        "You are the engine that keeps the team going offensively and defensively.Don't overcommit and stab!",
        "Force the offense to make a mistake or force them to play the ball backwards!",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/33\\/Be-a-Good-Central-Midfielder-in-Soccer-Step-5.jpg\\/v4-460px-Be-a-Good-Central-Midfielder-in-Soccer-Step-5.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/33\\/Be-a-Good-Central-Midfielder-in-Soccer-Step-5.jpg\\/v4-760px-Be-a-Good-Central-Midfielder-in-Soccer-Step-5.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Be aware of the ball and any shooting opportunities.",
        "Always take note of who is around you and move into space when off the ball.",
        "Have good vision.",
        "This will enable you to move the ball around well and create scoring opportunities.",
        "You as a center Mid has to control the play.",
        "This means distributing the ball and checking to every ball.",
        "Shoot when you can.",
        "It is not a crucial part of midfield but given you are not usually in the box, an occasional nice shot is always a great bonus."
    ]
}