{
    "title": "How to Wire a Doorbell",
    "url": "https://www.wikihow.com/Wire-a-Doorbell",
    "category_hierarchy": [
        "Computers and Electronics",
        "Hardware",
        "Cabling and Wiring Connection"
    ],
    "methods": [
        {
            "name": "Wiring the Doorbell - 1 Button",
            "steps": [
                {
                    "headline": "Choose the correct position of where the doorbell button and receiver will be placed.",
                    "description": ""
                },
                {
                    "headline": "Position the button at a level where family members can reach it.",
                    "description": ""
                },
                {
                    "headline": "Position the receiver where it can be heard from anywhere in your house.",
                    "description": ""
                },
                {
                    "headline": "Follow the manufacturer's instructions for mounting the button and receiver on your type of walls.",
                    "description": ""
                },
                {
                    "headline": "Turn off the power to the transformer.",
                    "description": ""
                },
                {
                    "headline": "Connect a wire to the screw on the doorbell button.",
                    "description": ""
                },
                {
                    "headline": "Run the wire directly to the transformer.",
                    "description": ""
                },
                {
                    "headline": "Connect a second wire to the second screw on the doorbell button.",
                    "description": ""
                },
                {
                    "headline": "Connect the other end of the second wire to the screw on the receiver (bell).",
                    "description": ""
                },
                {
                    "headline": "Connect the third wire from the receiver to the second screw on the transformer.",
                    "description": ""
                },
                {
                    "headline": "Test the doorbell.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Wiring the Doorbell - 2 Buttons",
            "steps": [
                {
                    "headline": "Choose the correct positions where the doorbell buttons and receivers will be placed.",
                    "description": ""
                },
                {
                    "headline": "Position the buttons at a level where family members can reach.",
                    "description": ""
                },
                {
                    "headline": "Position the receivers where they can be heard from anywhere in your house.",
                    "description": ""
                },
                {
                    "headline": "Follow the manufacturer's instructions for mounting the buttons and receivers on your type of walls.",
                    "description": ""
                },
                {
                    "headline": "Plan your wiring before you begin because you have multiple wires for 2 doorbells.",
                    "description": ""
                },
                {
                    "headline": "Turn off the power to the transformer.",
                    "description": ""
                },
                {
                    "headline": "Connect a wire from a terminal screw on both buttons.",
                    "description": ""
                },
                {
                    "headline": "Connect the wire from the 2 buttons to a terminal screw on your transformer.",
                    "description": ""
                },
                {
                    "headline": "Connect a wire to the second terminal screw from the button for the front door.",
                    "description": ""
                },
                {
                    "headline": "Connect the other end of the wire to the terminal screw on the receiver you are using for the front door chime or buzzer.",
                    "description": ""
                },
                {
                    "headline": "Connect a wire to the second terminal screw on the button for the back door.",
                    "description": ""
                },
                {
                    "headline": "Connect the other end of the wire to the receiver you are using for the back door chime or buzzer.",
                    "description": ""
                },
                {
                    "headline": "Connect a wire from the second buzzer screw to the second doorbell screw so that the 2 units are connected to each other.",
                    "description": ""
                },
                {
                    "headline": "Connect another wire to the screw on the doorbell.",
                    "description": ""
                },
                {
                    "headline": "Connect the other end of that wire to the transformer.",
                    "description": ""
                },
                {
                    "headline": "Test both doorbells.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Replacing an Existing Doorbell",
        "Screwdriver or drill",
        "Connecting a Doorbell to the Transformer",
        "16 awg wire"
    ],
    "text": " Wiring the Doorbell - 1 Button Choose the correct position of where the doorbell button and receiver will be placed.  Position the button at a level where family members can reach it.  Position the receiver where it can be heard from anywhere in your house.  Follow the manufacturer's instructions for mounting the button and receiver on your type of walls.  Turn off the power to the transformer.  Connect a wire to the screw on the doorbell button.  Run the wire directly to the transformer.  Connect a second wire to the second screw on the doorbell button.  Connect the other end of the second wire to the screw on the receiver (bell).  Connect the third wire from the receiver to the second screw on the transformer.  Test the doorbell.  Wiring the Doorbell - 2 Buttons Choose the correct positions where the doorbell buttons and receivers will be placed.  Position the buttons at a level where family members can reach.  Position the receivers where they can be heard from anywhere in your house.  Follow the manufacturer's instructions for mounting the buttons and receivers on your type of walls.  Plan your wiring before you begin because you have multiple wires for 2 doorbells.  Turn off the power to the transformer.  Connect a wire from a terminal screw on both buttons.  Connect the wire from the 2 buttons to a terminal screw on your transformer.  Connect a wire to the second terminal screw from the button for the front door.  Connect the other end of the wire to the terminal screw on the receiver you are using for the front door chime or buzzer.  Connect a wire to the second terminal screw on the button for the back door.  Connect the other end of the wire to the receiver you are using for the back door chime or buzzer.  Connect a wire from the second buzzer screw to the second doorbell screw so that the 2 units are connected to each other.  Connect another wire to the screw on the doorbell.  Connect the other end of that wire to the transformer.  Test both doorbells. ",
    "sentences": [
        " Wiring the Doorbell - 1 Button Choose the correct position of where the doorbell button and receiver will be placed.",
        "Position the button at a level where family members can reach it.",
        "Position the receiver where it can be heard from anywhere in your house.",
        "Follow the manufacturer's instructions for mounting the button and receiver on your type of walls.",
        "Turn off the power to the transformer.",
        "Connect a wire to the screw on the doorbell button.",
        "Run the wire directly to the transformer.",
        "Connect a second wire to the second screw on the doorbell button.",
        "Connect the other end of the second wire to the screw on the receiver (bell).",
        "Connect the third wire from the receiver to the second screw on the transformer.",
        "Test the doorbell.",
        "Wiring the Doorbell - 2 Buttons Choose the correct positions where the doorbell buttons and receivers will be placed.",
        "Position the buttons at a level where family members can reach.",
        "Position the receivers where they can be heard from anywhere in your house.",
        "Follow the manufacturer's instructions for mounting the buttons and receivers on your type of walls.",
        "Plan your wiring before you begin because you have multiple wires for 2 doorbells.",
        "Turn off the power to the transformer.",
        "Connect a wire from a terminal screw on both buttons.",
        "Connect the wire from the 2 buttons to a terminal screw on your transformer.",
        "Connect a wire to the second terminal screw from the button for the front door.",
        "Connect the other end of the wire to the terminal screw on the receiver you are using for the front door chime or buzzer.",
        "Connect a wire to the second terminal screw on the button for the back door.",
        "Connect the other end of the wire to the receiver you are using for the back door chime or buzzer.",
        "Connect a wire from the second buzzer screw to the second doorbell screw so that the 2 units are connected to each other.",
        "Connect another wire to the screw on the doorbell.",
        "Connect the other end of that wire to the transformer.",
        "Test both doorbells."
    ]
}