{
    "title": "How to Use a MIG Welder",
    "url": "https://www.wikihow.com/Use-a-MIG-Welder",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "methods": [
        {
            "name": "Understanding MIG Welding",
            "steps": [
                {
                    "headline": "Learn the basics of MIG welding.",
                    "description": "The process is GMAW (Gas Metal Arc Welding), commonly known as MIG welding (Metal Inert Gas welding). MIG welding was developed during World War II as a fast, portable process to create strong, durable joints. Today it is used in many shop and factory applications as well as by home hobbyists and welding enthusiasts."
                },
                {
                    "headline": "Learn how it works.",
                    "description": "MIG welding uses a machine to feed a wire through a contact tip into a MIG gun. The electrically charged contact tip transfers the welding current to the wire. The arc is established between the wire and the base metal. Often times an inert gas is used, which flows out of the gas nozzle to shield the welding process from the atmosphere. There are several modes of metal transfer:\nShort circuit (thin metals)\nGlobular transfer (heavier metals)\nSpray transfer (hottest)"
                },
                {
                    "headline": "Understand the applications.",
                    "description": "Once you learn how to use a MIG welder, you can make repairs around the home. A MIG welder can be used on stainless steel, mild steel, and aluminium of all thicknesses. Shielding gases will vary depending on base metal and welding wire."
                }
            ]
        },
        {
            "name": "Preparing to Weld",
            "steps": [
                {
                    "headline": "Assemble your safety gear.",
                    "description": "You will need a full set of safety equipment to ensure your safety while welding. This includes gloves, masks, and protective clothing. Make sure that all of your skin is covered to prevent overexposure from UV rays. You will need a mask with at least a #10 shade or darker. This will help prevent arc eye. If you are working in a poorly ventilated area, you will need a vapor mask to minimize the amount of toxic vapors inhaled during the welding process. Wear gloves that can protect your skin from molten metal. Keep a CO2 extinguisher and a bucket of sand nearby for emergency fires."
                },
                {
                    "headline": "Select a comfortable MIG gun.",
                    "description": "Some are shaped like pistols, while others may look like acetylene torches. The size of the machine will depend on the size of the project. A MIG gun may also be water or air cooled. Air-cooled guns are used for 200 amps or less and are easier to manipulate in small areas. The air-cooled gun is the type that home MIG welders typically use."
                },
                {
                    "headline": "Prepare the area to be welded in.",
                    "description": "Remove all flammable material and find a good surface to weld on. Although you can put the ground connection right on the piece you are welding, most shops have a large metal workbench that the ground is hooked up to. If there are other people present, set up welding curtains around the work area. This will protect them from UV damage."
                }
            ]
        },
        {
            "name": "Installing the Wire",
            "steps": [
                {
                    "headline": "Obtain the proper wire.",
                    "description": "Use the same wire type as the material you are welding. For example, if you are welding stainless steel, use a stainless steel wire. For steel welding, there are two main types of wire. AWS ER70S-3 is an all-purpose steel wire. This is usually the most economical choice. AWS ER70S-6 is a high-quality steel wire, designed for welding on rusty or dirty steel\nE71TGX requires no shielding gas. It is suited for welding in high winds and for painted or rusty materials. Vary the diameter of your wire based on the thickness of the metal you are welding. Use thin wire for thin metals, and thicker wire for thicker metals. You may need a larger machine for thicker metals."
                },
                {
                    "headline": "Prepare the reel.",
                    "description": "Tighten the tension on the reel so that the wire doesn’t unravel due to its own tension. Make the first 3 inches (7.6 cm) of the wire as straight as possible to avoid tangles or damage to the line feeder. Use a wire cutter to trim the wire accordingly."
                },
                {
                    "headline": "Feed the wire to the torch.",
                    "description": "Insert the wire into the guide tube and feed it over the roller. Insert it in to the wire liner. If you have to use force, chances are that the wire is not aligned properly. Make sure the wire is free from rust or grease, this will cause bad welds. Use a dry cloth to clean any dirty wire before inserting it. Wire will become rusty if left in the welder when not in use. Once the wire is inserted into the liner, turn the welder on and use the wire feed mechanism to push the wire through the welder."
                },
                {
                    "headline": "Adjust the tension.",
                    "description": "Once your wire is fed through, you will need to adjust the tensioner. TOO much tension will cause the mountings to bend, damaging the welder. Keep the tension at the minimum amount that still allows the line to be fed through. Make sure to check the tension on the reel as well as on the line feeder. Both should be as low as possible."
                }
            ]
        },
        {
            "name": "Making the Weld",
            "steps": [
                {
                    "headline": "Set the welding machine polarity to DCEP.",
                    "description": "This is reverse polarity."
                },
                {
                    "headline": "Keep a consistent electrode length.",
                    "description": "As you are welding, keep your electrode extended between ¼” and 3/8” from the contact tube. This will help make for a clean, regular weld."
                },
                {
                    "headline": "Use the proper shielding gas.",
                    "description": "Use carbon dioxide as an economical choice to provide deeper penetration on steel. This will be too hot for thin metals though. Use argon for aluminum welding, and a mix of argon (75%) and carbon dioxide (25%) for thinner steel."
                },
                {
                    "headline": "Weld a joint using a drag or push welding technique.",
                    "description": "The angle should not exceed 10 degrees in either technique. Keep the wire at the front edge of your weld pool. This will give you greater control over your weld. Drag welding pulls the bead along with the tip. This will give you a deeper penetration and a narrower bead. Push welding pushes the bead with the tip. This will give you a wider bead."
                },
                {
                    "headline": "Make a flat weld.",
                    "description": "Use the welder to place material directly into the joint. You can use a back and forth method to fill large gaps. For flat joints, hold the gun at a 90° angle."
                },
                {
                    "headline": "Make a horizontal weld.",
                    "description": "You must lower the gun angle slightly to keep the filler from sagging. Keep the same push or pull angle as normal. Use a back-and-forth weave motion to fill large gaps. Keep the amperage the same as a flat weld. You may need to use a slightly smaller diameter wire to keep the weld pool from getting too big."
                },
                {
                    "headline": "Make a vertical weld.",
                    "description": "For thin materials, start at the top and move the pool down with gravity. This keeps the arc from penetrating the material. For thicker metals, start at the base and work up. This will help increase penetration. You may want to lower the amperage by around 10-15% to help fight gravity."
                },
                {
                    "headline": "Make an overhead weld.",
                    "description": "Use standard welding techniques, but increase your travel speed. This will help prevent filler from falling out of the joint. You may need to increase your gas flow rate. Keep your nozzle clean, as spatter will build up faster when welding overhead."
                },
                {
                    "headline": "Finish the weld.",
                    "description": "Once you are done with the weld process, grind off any excess filler. If the weld is defective, grind it down and re-weld the joint."
                }
            ]
        }
    ],
    "tyn": [
        "MIG welder",
        "Welding apparel",
        "MIG welding wire",
        "Shielding gas",
        "Metal for welding",
        "Grinder (as needed)",
        "Air extraction"
    ],
    "text": " Understanding MIG Welding Learn the basics of MIG welding. The process is GMAW (Gas Metal Arc Welding), commonly known as MIG welding (Metal Inert Gas welding). MIG welding was developed during World War II as a fast, portable process to create strong, durable joints. Today it is used in many shop and factory applications as well as by home hobbyists and welding enthusiasts. Learn how it works. MIG welding uses a machine to feed a wire through a contact tip into a MIG gun. The electrically charged contact tip transfers the welding current to the wire. The arc is established between the wire and the base metal. Often times an inert gas is used, which flows out of the gas nozzle to shield the welding process from the atmosphere. There are several modes of metal transfer:\nShort circuit (thin metals)\nGlobular transfer (heavier metals)\nSpray transfer (hottest) Understand the applications. Once you learn how to use a MIG welder, you can make repairs around the home. A MIG welder can be used on stainless steel, mild steel, and aluminium of all thicknesses. Shielding gases will vary depending on base metal and welding wire. Preparing to Weld Assemble your safety gear. You will need a full set of safety equipment to ensure your safety while welding. This includes gloves, masks, and protective clothing. Make sure that all of your skin is covered to prevent overexposure from UV rays. You will need a mask with at least a #10 shade or darker. This will help prevent arc eye. If you are working in a poorly ventilated area, you will need a vapor mask to minimize the amount of toxic vapors inhaled during the welding process. Wear gloves that can protect your skin from molten metal. Keep a CO2 extinguisher and a bucket of sand nearby for emergency fires. Select a comfortable MIG gun. Some are shaped like pistols, while others may look like acetylene torches. The size of the machine will depend on the size of the project. A MIG gun may also be water or air cooled. Air-cooled guns are used for 200 amps or less and are easier to manipulate in small areas. The air-cooled gun is the type that home MIG welders typically use. Prepare the area to be welded in. Remove all flammable material and find a good surface to weld on. Although you can put the ground connection right on the piece you are welding, most shops have a large metal workbench that the ground is hooked up to. If there are other people present, set up welding curtains around the work area. This will protect them from UV damage. Installing the Wire Obtain the proper wire. Use the same wire type as the material you are welding. For example, if you are welding stainless steel, use a stainless steel wire. For steel welding, there are two main types of wire. AWS ER70S-3 is an all-purpose steel wire. This is usually the most economical choice. AWS ER70S-6 is a high-quality steel wire, designed for welding on rusty or dirty steel\nE71TGX requires no shielding gas. It is suited for welding in high winds and for painted or rusty materials. Vary the diameter of your wire based on the thickness of the metal you are welding. Use thin wire for thin metals, and thicker wire for thicker metals. You may need a larger machine for thicker metals. Prepare the reel. Tighten the tension on the reel so that the wire doesn’t unravel due to its own tension. Make the first 3 inches (7.6 cm) of the wire as straight as possible to avoid tangles or damage to the line feeder. Use a wire cutter to trim the wire accordingly. Feed the wire to the torch. Insert the wire into the guide tube and feed it over the roller. Insert it in to the wire liner. If you have to use force, chances are that the wire is not aligned properly. Make sure the wire is free from rust or grease, this will cause bad welds. Use a dry cloth to clean any dirty wire before inserting it. Wire will become rusty if left in the welder when not in use. Once the wire is inserted into the liner, turn the welder on and use the wire feed mechanism to push the wire through the welder. Adjust the tension. Once your wire is fed through, you will need to adjust the tensioner. TOO much tension will cause the mountings to bend, damaging the welder. Keep the tension at the minimum amount that still allows the line to be fed through. Make sure to check the tension on the reel as well as on the line feeder. Both should be as low as possible. Making the Weld Set the welding machine polarity to DCEP. This is reverse polarity. Keep a consistent electrode length. As you are welding, keep your electrode extended between ¼” and 3/8” from the contact tube. This will help make for a clean, regular weld. Use the proper shielding gas. Use carbon dioxide as an economical choice to provide deeper penetration on steel. This will be too hot for thin metals though. Use argon for aluminum welding, and a mix of argon (75%) and carbon dioxide (25%) for thinner steel. Weld a joint using a drag or push welding technique. The angle should not exceed 10 degrees in either technique. Keep the wire at the front edge of your weld pool. This will give you greater control over your weld. Drag welding pulls the bead along with the tip. This will give you a deeper penetration and a narrower bead. Push welding pushes the bead with the tip. This will give you a wider bead. Make a flat weld. Use the welder to place material directly into the joint. You can use a back and forth method to fill large gaps. For flat joints, hold the gun at a 90° angle. Make a horizontal weld. You must lower the gun angle slightly to keep the filler from sagging. Keep the same push or pull angle as normal. Use a back-and-forth weave motion to fill large gaps. Keep the amperage the same as a flat weld. You may need to use a slightly smaller diameter wire to keep the weld pool from getting too big. Make a vertical weld. For thin materials, start at the top and move the pool down with gravity. This keeps the arc from penetrating the material. For thicker metals, start at the base and work up. This will help increase penetration. You may want to lower the amperage by around 10-15% to help fight gravity. Make an overhead weld. Use standard welding techniques, but increase your travel speed. This will help prevent filler from falling out of the joint. You may need to increase your gas flow rate. Keep your nozzle clean, as spatter will build up faster when welding overhead. Finish the weld. Once you are done with the weld process, grind off any excess filler. If the weld is defective, grind it down and re-weld the joint.",
    "sentences": [
        " Understanding MIG Welding Learn the basics of MIG welding.",
        "The process is GMAW (Gas Metal Arc Welding), commonly known as MIG welding (Metal Inert Gas welding).",
        "MIG welding was developed during World War II as a fast, portable process to create strong, durable joints.",
        "Today it is used in many shop and factory applications as well as by home hobbyists and welding enthusiasts.",
        "Learn how it works.",
        "MIG welding uses a machine to feed a wire through a contact tip into a MIG gun.",
        "The electrically charged contact tip transfers the welding current to the wire.",
        "The arc is established between the wire and the base metal.",
        "Often times an inert gas is used, which flows out of the gas nozzle to shield the welding process from the atmosphere.",
        "There are several modes of metal transfer:\nShort circuit (thin metals)\nGlobular transfer (heavier metals)\nSpray transfer (hottest) Understand the applications.",
        "Once you learn how to use a MIG welder, you can make repairs around the home.",
        "A MIG welder can be used on stainless steel, mild steel, and aluminium of all thicknesses.",
        "Shielding gases will vary depending on base metal and welding wire.",
        "Preparing to Weld Assemble your safety gear.",
        "You will need a full set of safety equipment to ensure your safety while welding.",
        "This includes gloves, masks, and protective clothing.",
        "Make sure that all of your skin is covered to prevent overexposure from UV rays.",
        "You will need a mask with at least a #10 shade or darker.",
        "This will help prevent arc eye.",
        "If you are working in a poorly ventilated area, you will need a vapor mask to minimize the amount of toxic vapors inhaled during the welding process.",
        "Wear gloves that can protect your skin from molten metal.",
        "Keep a CO2 extinguisher and a bucket of sand nearby for emergency fires.",
        "Select a comfortable MIG gun.",
        "Some are shaped like pistols, while others may look like acetylene torches.",
        "The size of the machine will depend on the size of the project.",
        "A MIG gun may also be water or air cooled.",
        "Air-cooled guns are used for 200 amps or less and are easier to manipulate in small areas.",
        "The air-cooled gun is the type that home MIG welders typically use.",
        "Prepare the area to be welded in.",
        "Remove all flammable material and find a good surface to weld on.",
        "Although you can put the ground connection right on the piece you are welding, most shops have a large metal workbench that the ground is hooked up to.",
        "If there are other people present, set up welding curtains around the work area.",
        "This will protect them from UV damage.",
        "Installing the Wire Obtain the proper wire.",
        "Use the same wire type as the material you are welding.",
        "For example, if you are welding stainless steel, use a stainless steel wire.",
        "For steel welding, there are two main types of wire.",
        "AWS ER70S-3 is an all-purpose steel wire.",
        "This is usually the most economical choice.",
        "AWS ER70S-6 is a high-quality steel wire, designed for welding on rusty or dirty steel\nE71TGX requires no shielding gas.",
        "It is suited for welding in high winds and for painted or rusty materials.",
        "Vary the diameter of your wire based on the thickness of the metal you are welding.",
        "Use thin wire for thin metals, and thicker wire for thicker metals.",
        "You may need a larger machine for thicker metals.",
        "Prepare the reel.",
        "Tighten the tension on the reel so that the wire doesn’t unravel due to its own tension.",
        "Make the first 3 inches (7.6 cm) of the wire as straight as possible to avoid tangles or damage to the line feeder.",
        "Use a wire cutter to trim the wire accordingly.",
        "Feed the wire to the torch.",
        "Insert the wire into the guide tube and feed it over the roller.",
        "Insert it in to the wire liner.",
        "If you have to use force, chances are that the wire is not aligned properly.",
        "Make sure the wire is free from rust or grease, this will cause bad welds.",
        "Use a dry cloth to clean any dirty wire before inserting it.",
        "Wire will become rusty if left in the welder when not in use.",
        "Once the wire is inserted into the liner, turn the welder on and use the wire feed mechanism to push the wire through the welder.",
        "Adjust the tension.",
        "Once your wire is fed through, you will need to adjust the tensioner.",
        "TOO much tension will cause the mountings to bend, damaging the welder.",
        "Keep the tension at the minimum amount that still allows the line to be fed through.",
        "Make sure to check the tension on the reel as well as on the line feeder.",
        "Both should be as low as possible.",
        "Making the Weld Set the welding machine polarity to DCEP.",
        "This is reverse polarity.",
        "Keep a consistent electrode length.",
        "As you are welding, keep your electrode extended between ¼” and 3/8” from the contact tube.",
        "This will help make for a clean, regular weld.",
        "Use the proper shielding gas.",
        "Use carbon dioxide as an economical choice to provide deeper penetration on steel.",
        "This will be too hot for thin metals though.",
        "Use argon for aluminum welding, and a mix of argon (75%) and carbon dioxide (25%) for thinner steel.",
        "Weld a joint using a drag or push welding technique.",
        "The angle should not exceed 10 degrees in either technique.",
        "Keep the wire at the front edge of your weld pool.",
        "This will give you greater control over your weld.",
        "Drag welding pulls the bead along with the tip.",
        "This will give you a deeper penetration and a narrower bead.",
        "Push welding pushes the bead with the tip.",
        "This will give you a wider bead.",
        "Make a flat weld.",
        "Use the welder to place material directly into the joint.",
        "You can use a back and forth method to fill large gaps.",
        "For flat joints, hold the gun at a 90° angle.",
        "Make a horizontal weld.",
        "You must lower the gun angle slightly to keep the filler from sagging.",
        "Keep the same push or pull angle as normal.",
        "Use a back-and-forth weave motion to fill large gaps.",
        "Keep the amperage the same as a flat weld.",
        "You may need to use a slightly smaller diameter wire to keep the weld pool from getting too big.",
        "Make a vertical weld.",
        "For thin materials, start at the top and move the pool down with gravity.",
        "This keeps the arc from penetrating the material.",
        "For thicker metals, start at the base and work up.",
        "This will help increase penetration.",
        "You may want to lower the amperage by around 10-15% to help fight gravity.",
        "Make an overhead weld.",
        "Use standard welding techniques, but increase your travel speed.",
        "This will help prevent filler from falling out of the joint.",
        "You may need to increase your gas flow rate.",
        "Keep your nozzle clean, as spatter will build up faster when welding overhead.",
        "Finish the weld.",
        "Once you are done with the weld process, grind off any excess filler.",
        "If the weld is defective, grind it down and re-weld the joint."
    ]
}