{
    "title": "How to Moisturize African Hair",
    "url": "https://www.wikihow.com/Moisturize-African-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Hair Texture",
        "Afro Textured Hair",
        "Afro Textured Hair Care"
    ],
    "methods": [
        {
            "name": "Moisturizing and Sealing",
            "steps": [
                {
                    "headline": "Choose the right shampoo.",
                    "description": "Use a deeply moisturizing shampoo made specifically for African hair. There are many brands on the market, so try out a couple of different shampoos to find which one works best for you personally. Choose a product that is sulfate-free (it will promote this on the front of the bottle, and you can confirm this by reading the ingredients and looking for a shampoo that does not have any ingredients that end or begin with the word sulfate). Sulfate can be very drying and strip hair of moisture. It is recommended that you wash your hair every 7 to 10 days for best results. You will want to follow the moisturizing and sealing steps daily, however. In addition to ensuring that the shampoo is sulfate free, check the label to make sure the shampoo you choose is alcohol-free. Alcohol can be very harsh and strip your hair of its natural oils. Choose a shampoo that has natural moisturizing oil, such as jojoba oil, olive oil, coconut oil, or emu oil. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCourtney Foster\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLicensed Cosmetologist\t\t\t\t\t\t\t\tCourtney Foster is a Licensed Cosmetologist, Certified Hair Loss Practitioner, and Cosmetology Educator based out of New York City. Courtney runs Courtney Foster Beauty, LLC and her work has been featured on The Wendy Williams Show, Good Morning America, The Today Show, The Late Show with David Letterman, and in East/West Magazine. She received her Cosmetology Lisence from the State of New York after training at the Empire Beauty School - Manhattan. Courtney Foster\t\t\tLicensed Cosmetologist\t\t\t\tOur Expert Agrees: When you're choosing a shampoo for African-American hair, look for a moisturizing product. Our hair tends to be naturally dry because the oil doesn't reach down to the bottom of the hair shaft."
                },
                {
                    "headline": "Divide your hair into 4 sections.",
                    "description": "To begin the daily moisturizing and sealing process, use hair clips to assist you. Divide your hair into 4 sections and secure with the clip. The sections don't have to be exact or perfect - doing this just makes it easier to work with your hair during the daily routine process and also ensures even product coverage."
                },
                {
                    "headline": "Apply a water-based leave-in conditioner to each section of your hair.",
                    "description": "Use a moisturizing conditioner. Take down each section, one at a time, and apply the conditioner from root to tip, concentrating on the ends. After you finish one section, clip it back up into place before moving on to the next section of your hair. While you should only wash your hair every 7 to 10 days, moisturizing and sealing (applying leave-in moisturizer and sealing with oil) should be done every day."
                },
                {
                    "headline": "Coat the sections of your hair with oil.",
                    "description": "Doing this as part of your hair care routine helps strengthen hair structure and seals in the moisture of the conditioner you just used. Some good options include jojoba oil, coconut oil, olive oil, and pomegranate seed oil, all of which are widely available at grocery and drug stores. Take down each section, one at a time, and apply a small amount of the oil (a pea-sized dollop should work) from root to tip, again concentrating on the ends. Experiment with each of the different oils listed above to see which works best for you. Don't over-do the oil. Using too much will weigh your hair down and may contribute to a greasy look. Use the minimum amount required with a special focus on the ends. When applying the oil, use a downward sweeping motion with your hair in between your palms. This will contribute to smoothness after completion. Don't mix your conditioner and oil together to save time. The process will not work properly and the moisture won't be sealed if you do that. Make sure you always moisturize with conditioner before sealing with the oil."
                },
                {
                    "headline": "Rinse your hair and style as usual.",
                    "description": "After you finish applying the oil over the leave in conditioner, rinse your hair with lukewarm or cool water to remove the excess product. Then, dry your hair either with a blow dryer or by using a towel and waiting for it to air dry. Apply any styling products you like to use as well."
                },
                {
                    "headline": "Repeat this full method every 10 days for best results.",
                    "description": "For the days in between shampoos, you'll still want apply the moisturizer to your hair and seal it daily with oil."
                }
            ]
        },
        {
            "name": "Deep Conditioning",
            "steps": [
                {
                    "headline": "Begin with clean hair.",
                    "description": "Deep condition your hair on the same day that you shampoo your hair. Rinse the product from your hair and towel dry it so that it is damp before you begin the deep conditioning."
                },
                {
                    "headline": "Apply the deep conditioner to your hair.",
                    "description": "Use a deep conditioner that contains natural oils or fats such as shea butter, argan oil, or coconut oil. Apply the deep conditioner from root to tip, concentrating on the ends. EXPERT TIP\t\t\t\t\t\t\t\tLaura Martin\t\t\tLicensed Cosmetologist\t\t\t\tFocus on the ends of your hair when you condition. Cosmetologist Laura Martin advises, “Apply your conditioner to the ends of your hair first, and reapply until the ends feel slippery. Then, wait 3-5 minutes before rinsing. Use a leave-in conditioner or detangler afterwards to make combing easier and prevent damaging the ends.”"
                },
                {
                    "headline": "Wrap your hair in a towel.",
                    "description": "After you've evenly applied the deep conditioner to all of your hair, take a soft towel and carefully wrap your hair securely in a turban-style."
                },
                {
                    "headline": "Keep your hair wrapped for 30 full minutes.",
                    "description": "This is a good time to start on your daily makeup routine to pass the time. Getting back in the bath and relaxing is always an option, of course! Just make sure you don't get hair wet and that it remains securely wrapped up in the towel for the full half hour."
                },
                {
                    "headline": "Rinse your hair with cool water.",
                    "description": "After the time is up on the deep conditioner, rinse the conditioner out of your hair using cool water."
                },
                {
                    "headline": "Style your hair as usual.",
                    "description": "Repeat this deep conditioning method twice per month for best results. Regular use of this treatment will make your hair stronger and softer."
                }
            ]
        },
        {
            "name": "Deep Conditioning With Olive Oil and Honey",
            "steps": [
                {
                    "headline": "Make your mixture.",
                    "description": "Measure out 0.25 cups (60 mL) of olive oil and put into a microwave-safe bowl. Measure out  0.25 cups (60 mL) of honey and add to the olive oil in the bowl. Stir gently. Olive oil will give your hair natural shine as the honey conditions it."
                },
                {
                    "headline": "Melt the mixture in the microwave.",
                    "description": "It needs to be heated so that when you stir the mixture, the oil and the honey mix into each other evenly rather than remain separated in the bowl. Once mixed, test the mixture with your finger to make sure it’s not too warm to use. If it is a little too warm, give it a moment to cool down before proceeding."
                },
                {
                    "headline": "Apply the mixture to your hair.",
                    "description": "Work with small sections at a time for even coverage. Take care to cover evenly from root to tip, concentrating on the ends. You want each strand coated, but not drenched in the mixture."
                },
                {
                    "headline": "Wrap your hair with a warm towel.",
                    "description": "After you've evenly applied the mixture, use a warm towel to wrap your hair. Make sure no strands are escaping the towel. If any drops of the mixture drip from beneath the towel, wipe them away avoiding the eyes and eye area. Keep your hair wrapped for 30 minutes. To warm the towel before use, try tossing it in your dryer for a few minutes. You want the towel to be warm and cozy, but not hot or uncomfortable."
                },
                {
                    "headline": "Shampoo your hair.",
                    "description": "Shower and shampoo your hair as you normally would during your hair care routine using your moisture boosting shampoo. Make sure to clean your scalp and hair well but don't over-lather, as this will strip your hair of moisture. Take care to get all of the oil and honey completely rinsed from your hair. Rinse clean and towel dry until damp, then style your hair as usual."
                },
                {
                    "headline": "Repeat this process twice per month for best results.",
                    "description": "Regular use of this treatment will make your hair stronger and softer."
                }
            ]
        }
    ],
    "tyn": [
        "Water-based moisturizer",
        "Conditioner with natural oils",
        "Hot oil treatment or deep conditioner",
        "Olive oil",
        "Honey",
        "Towel",
        "Bowls"
    ],
    "text": " Moisturizing and Sealing Choose the right shampoo. Use a deeply moisturizing shampoo made specifically for African hair. There are many brands on the market, so try out a couple of different shampoos to find which one works best for you personally. Choose a product that is sulfate-free (it will promote this on the front of the bottle, and you can confirm this by reading the ingredients and looking for a shampoo that does not have any ingredients that end or begin with the word sulfate). Sulfate can be very drying and strip hair of moisture. It is recommended that you wash your hair every 7 to 10 days for best results. You will want to follow the moisturizing and sealing steps daily, however. In addition to ensuring that the shampoo is sulfate free, check the label to make sure the shampoo you choose is alcohol-free. Alcohol can be very harsh and strip your hair of its natural oils. Choose a shampoo that has natural moisturizing oil, such as jojoba oil, olive oil, coconut oil, or emu oil. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCourtney Foster\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLicensed Cosmetologist\t\t\t\t\t\t\t\tCourtney Foster is a Licensed Cosmetologist, Certified Hair Loss Practitioner, and Cosmetology Educator based out of New York City. Courtney runs Courtney Foster Beauty, LLC and her work has been featured on The Wendy Williams Show, Good Morning America, The Today Show, The Late Show with David Letterman, and in East/West Magazine. She received her Cosmetology Lisence from the State of New York after training at the Empire Beauty School - Manhattan. Courtney Foster\t\t\tLicensed Cosmetologist\t\t\t\tOur Expert Agrees: When you're choosing a shampoo for African-American hair, look for a moisturizing product. Our hair tends to be naturally dry because the oil doesn't reach down to the bottom of the hair shaft. Divide your hair into 4 sections. To begin the daily moisturizing and sealing process, use hair clips to assist you. Divide your hair into 4 sections and secure with the clip. The sections don't have to be exact or perfect - doing this just makes it easier to work with your hair during the daily routine process and also ensures even product coverage. Apply a water-based leave-in conditioner to each section of your hair. Use a moisturizing conditioner. Take down each section, one at a time, and apply the conditioner from root to tip, concentrating on the ends. After you finish one section, clip it back up into place before moving on to the next section of your hair. While you should only wash your hair every 7 to 10 days, moisturizing and sealing (applying leave-in moisturizer and sealing with oil) should be done every day. Coat the sections of your hair with oil. Doing this as part of your hair care routine helps strengthen hair structure and seals in the moisture of the conditioner you just used. Some good options include jojoba oil, coconut oil, olive oil, and pomegranate seed oil, all of which are widely available at grocery and drug stores. Take down each section, one at a time, and apply a small amount of the oil (a pea-sized dollop should work) from root to tip, again concentrating on the ends. Experiment with each of the different oils listed above to see which works best for you. Don't over-do the oil. Using too much will weigh your hair down and may contribute to a greasy look. Use the minimum amount required with a special focus on the ends. When applying the oil, use a downward sweeping motion with your hair in between your palms. This will contribute to smoothness after completion. Don't mix your conditioner and oil together to save time. The process will not work properly and the moisture won't be sealed if you do that. Make sure you always moisturize with conditioner before sealing with the oil. Rinse your hair and style as usual. After you finish applying the oil over the leave in conditioner, rinse your hair with lukewarm or cool water to remove the excess product. Then, dry your hair either with a blow dryer or by using a towel and waiting for it to air dry. Apply any styling products you like to use as well. Repeat this full method every 10 days for best results. For the days in between shampoos, you'll still want apply the moisturizer to your hair and seal it daily with oil. Deep Conditioning Begin with clean hair. Deep condition your hair on the same day that you shampoo your hair. Rinse the product from your hair and towel dry it so that it is damp before you begin the deep conditioning. Apply the deep conditioner to your hair. Use a deep conditioner that contains natural oils or fats such as shea butter, argan oil, or coconut oil. Apply the deep conditioner from root to tip, concentrating on the ends. EXPERT TIP\t\t\t\t\t\t\t\tLaura Martin\t\t\tLicensed Cosmetologist\t\t\t\tFocus on the ends of your hair when you condition. Cosmetologist Laura Martin advises, “Apply your conditioner to the ends of your hair first, and reapply until the ends feel slippery. Then, wait 3-5 minutes before rinsing. Use a leave-in conditioner or detangler afterwards to make combing easier and prevent damaging the ends.” Wrap your hair in a towel. After you've evenly applied the deep conditioner to all of your hair, take a soft towel and carefully wrap your hair securely in a turban-style. Keep your hair wrapped for 30 full minutes. This is a good time to start on your daily makeup routine to pass the time. Getting back in the bath and relaxing is always an option, of course! Just make sure you don't get hair wet and that it remains securely wrapped up in the towel for the full half hour. Rinse your hair with cool water. After the time is up on the deep conditioner, rinse the conditioner out of your hair using cool water. Style your hair as usual. Repeat this deep conditioning method twice per month for best results. Regular use of this treatment will make your hair stronger and softer. Deep Conditioning With Olive Oil and Honey Make your mixture. Measure out 0.25 cups (60 mL) of olive oil and put into a microwave-safe bowl. Measure out  0.25 cups (60 mL) of honey and add to the olive oil in the bowl. Stir gently. Olive oil will give your hair natural shine as the honey conditions it. Melt the mixture in the microwave. It needs to be heated so that when you stir the mixture, the oil and the honey mix into each other evenly rather than remain separated in the bowl. Once mixed, test the mixture with your finger to make sure it’s not too warm to use. If it is a little too warm, give it a moment to cool down before proceeding. Apply the mixture to your hair. Work with small sections at a time for even coverage. Take care to cover evenly from root to tip, concentrating on the ends. You want each strand coated, but not drenched in the mixture. Wrap your hair with a warm towel. After you've evenly applied the mixture, use a warm towel to wrap your hair. Make sure no strands are escaping the towel. If any drops of the mixture drip from beneath the towel, wipe them away avoiding the eyes and eye area. Keep your hair wrapped for 30 minutes. To warm the towel before use, try tossing it in your dryer for a few minutes. You want the towel to be warm and cozy, but not hot or uncomfortable. Shampoo your hair. Shower and shampoo your hair as you normally would during your hair care routine using your moisture boosting shampoo. Make sure to clean your scalp and hair well but don't over-lather, as this will strip your hair of moisture. Take care to get all of the oil and honey completely rinsed from your hair. Rinse clean and towel dry until damp, then style your hair as usual. Repeat this process twice per month for best results. Regular use of this treatment will make your hair stronger and softer.",
    "sentences": [
        " Moisturizing and Sealing Choose the right shampoo.",
        "Use a deeply moisturizing shampoo made specifically for African hair.",
        "There are many brands on the market, so try out a couple of different shampoos to find which one works best for you personally.",
        "Choose a product that is sulfate-free (it will promote this on the front of the bottle, and you can confirm this by reading the ingredients and looking for a shampoo that does not have any ingredients that end or begin with the word sulfate).",
        "Sulfate can be very drying and strip hair of moisture.",
        "It is recommended that you wash your hair every 7 to 10 days for best results.",
        "You will want to follow the moisturizing and sealing steps daily, however.",
        "In addition to ensuring that the shampoo is sulfate free, check the label to make sure the shampoo you choose is alcohol-free.",
        "Alcohol can be very harsh and strip your hair of its natural oils.",
        "Choose a shampoo that has natural moisturizing oil, such as jojoba oil, olive oil, coconut oil, or emu oil.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCourtney Foster\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLicensed Cosmetologist\t\t\t\t\t\t\t\tCourtney Foster is a Licensed Cosmetologist, Certified Hair Loss Practitioner, and Cosmetology Educator based out of New York City.",
        "Courtney runs Courtney Foster Beauty, LLC and her work has been featured on The Wendy Williams Show, Good Morning America, The Today Show, The Late Show with David Letterman, and in East/West Magazine.",
        "She received her Cosmetology Lisence from the State of New York after training at the Empire Beauty School - Manhattan.",
        "Courtney Foster\t\t\tLicensed Cosmetologist\t\t\t\tOur Expert Agrees: When you're choosing a shampoo for African-American hair, look for a moisturizing product.",
        "Our hair tends to be naturally dry because the oil doesn't reach down to the bottom of the hair shaft.",
        "Divide your hair into 4 sections.",
        "To begin the daily moisturizing and sealing process, use hair clips to assist you.",
        "Divide your hair into 4 sections and secure with the clip.",
        "The sections don't have to be exact or perfect - doing this just makes it easier to work with your hair during the daily routine process and also ensures even product coverage.",
        "Apply a water-based leave-in conditioner to each section of your hair.",
        "Use a moisturizing conditioner.",
        "Take down each section, one at a time, and apply the conditioner from root to tip, concentrating on the ends.",
        "After you finish one section, clip it back up into place before moving on to the next section of your hair.",
        "While you should only wash your hair every 7 to 10 days, moisturizing and sealing (applying leave-in moisturizer and sealing with oil) should be done every day.",
        "Coat the sections of your hair with oil.",
        "Doing this as part of your hair care routine helps strengthen hair structure and seals in the moisture of the conditioner you just used.",
        "Some good options include jojoba oil, coconut oil, olive oil, and pomegranate seed oil, all of which are widely available at grocery and drug stores.",
        "Take down each section, one at a time, and apply a small amount of the oil (a pea-sized dollop should work) from root to tip, again concentrating on the ends.",
        "Experiment with each of the different oils listed above to see which works best for you.",
        "Don't over-do the oil.",
        "Using too much will weigh your hair down and may contribute to a greasy look.",
        "Use the minimum amount required with a special focus on the ends.",
        "When applying the oil, use a downward sweeping motion with your hair in between your palms.",
        "This will contribute to smoothness after completion.",
        "Don't mix your conditioner and oil together to save time.",
        "The process will not work properly and the moisture won't be sealed if you do that.",
        "Make sure you always moisturize with conditioner before sealing with the oil.",
        "Rinse your hair and style as usual.",
        "After you finish applying the oil over the leave in conditioner, rinse your hair with lukewarm or cool water to remove the excess product.",
        "Then, dry your hair either with a blow dryer or by using a towel and waiting for it to air dry.",
        "Apply any styling products you like to use as well.",
        "Repeat this full method every 10 days for best results.",
        "For the days in between shampoos, you'll still want apply the moisturizer to your hair and seal it daily with oil.",
        "Deep Conditioning Begin with clean hair.",
        "Deep condition your hair on the same day that you shampoo your hair.",
        "Rinse the product from your hair and towel dry it so that it is damp before you begin the deep conditioning.",
        "Apply the deep conditioner to your hair.",
        "Use a deep conditioner that contains natural oils or fats such as shea butter, argan oil, or coconut oil.",
        "Apply the deep conditioner from root to tip, concentrating on the ends.",
        "EXPERT TIP\t\t\t\t\t\t\t\tLaura Martin\t\t\tLicensed Cosmetologist\t\t\t\tFocus on the ends of your hair when you condition.",
        "Cosmetologist Laura Martin advises, “Apply your conditioner to the ends of your hair first, and reapply until the ends feel slippery.",
        "Then, wait 3-5 minutes before rinsing.",
        "Use a leave-in conditioner or detangler afterwards to make combing easier and prevent damaging the ends.” Wrap your hair in a towel.",
        "After you've evenly applied the deep conditioner to all of your hair, take a soft towel and carefully wrap your hair securely in a turban-style.",
        "Keep your hair wrapped for 30 full minutes.",
        "This is a good time to start on your daily makeup routine to pass the time.",
        "Getting back in the bath and relaxing is always an option, of course!",
        "Just make sure you don't get hair wet and that it remains securely wrapped up in the towel for the full half hour.",
        "Rinse your hair with cool water.",
        "After the time is up on the deep conditioner, rinse the conditioner out of your hair using cool water.",
        "Style your hair as usual.",
        "Repeat this deep conditioning method twice per month for best results.",
        "Regular use of this treatment will make your hair stronger and softer.",
        "Deep Conditioning With Olive Oil and Honey Make your mixture.",
        "Measure out 0.25 cups (60 mL) of olive oil and put into a microwave-safe bowl.",
        "Measure out  0.25 cups (60 mL) of honey and add to the olive oil in the bowl.",
        "Stir gently.",
        "Olive oil will give your hair natural shine as the honey conditions it.",
        "Melt the mixture in the microwave.",
        "It needs to be heated so that when you stir the mixture, the oil and the honey mix into each other evenly rather than remain separated in the bowl.",
        "Once mixed, test the mixture with your finger to make sure it’s not too warm to use.",
        "If it is a little too warm, give it a moment to cool down before proceeding.",
        "Apply the mixture to your hair.",
        "Work with small sections at a time for even coverage.",
        "Take care to cover evenly from root to tip, concentrating on the ends.",
        "You want each strand coated, but not drenched in the mixture.",
        "Wrap your hair with a warm towel.",
        "After you've evenly applied the mixture, use a warm towel to wrap your hair.",
        "Make sure no strands are escaping the towel.",
        "If any drops of the mixture drip from beneath the towel, wipe them away avoiding the eyes and eye area.",
        "Keep your hair wrapped for 30 minutes.",
        "To warm the towel before use, try tossing it in your dryer for a few minutes.",
        "You want the towel to be warm and cozy, but not hot or uncomfortable.",
        "Shampoo your hair.",
        "Shower and shampoo your hair as you normally would during your hair care routine using your moisture boosting shampoo.",
        "Make sure to clean your scalp and hair well but don't over-lather, as this will strip your hair of moisture.",
        "Take care to get all of the oil and honey completely rinsed from your hair.",
        "Rinse clean and towel dry until damp, then style your hair as usual.",
        "Repeat this process twice per month for best results.",
        "Regular use of this treatment will make your hair stronger and softer."
    ]
}