{
    "title": "How to Dry Oregano",
    "url": "https://www.wikihow.com/Dry-Oregano",
    "category_hierarchy": [
        "Food and Entertaining",
        "Herbs and Spices",
        "Spice Mixes"
    ],
    "methods": [
        {
            "name": "Preparing Your Oregano",
            "steps": [
                {
                    "headline": "Remove any dried or browned leaves from your stalks.",
                    "description": "Take your oregano stalks and set them out on your kitchen counter. Inspect them to look for any brown or dried-out leaves. Clip these leaves off using garden shears, scissors, or a kitchen knife. You can also simply rip them off of the plant by hand. Discard these unhealthy or flavorless leaves.Tip: Leaves that are already dry will rot by the time that you’re done drying the rest of your herbs. They also won’t taste very good, since they haven’t absorbed much moisture while the plant was growing. If any of the leaves have a color that differs from the rest of the plant, clip them off. Oregano should have a deep, green color when you dry it."
                },
                {
                    "headline": "Rinse your oregano under a stream of cool water.",
                    "description": "Set a colander in your kitchen sink to catch any leaves that fall off. Rinse your leaves under cold water for 10-15 seconds to wash them. If you already removed the leaves from the stalk, place them directly in the colander to wash them. You don’t need to remove the leaves to dry your oregano though. If your leaves are clean, or you purchased packaged, pre-washed oregano, you don’t need to rinse them. In fact, it’s better to skip washing them, since oregano retains moisture well and this will make the drying process take longer. If your stalks are dusty, have been eaten by bugs, or look kind of dirty, it’s a good idea to wash them."
                },
                {
                    "headline": "Shake your herbs dry and blot them with a paper towel.",
                    "description": "Turn the water in your sink off. Shake your oregano lightly in the sink to remove most of the water. Gently blot the oregano with dry paper towels to absorb most of the surface moisture. Hang your oregano for 6-12 hours to air dry it before using another method if you rinse it. Wrap the stalks in twine, tie it off, then attach the twine to a hook, hanger, or curtain rod."
                }
            ]
        },
        {
            "name": "Hanging Oregano to Dry It",
            "steps": [
                {
                    "headline": "Gather your oregano into groups of 2-4 stalks and put them in a paper bag.",
                    "description": "Take a paper bag that can hold all of your leaves and punch 10-15 small holes in each side of the bag with a fork, knife, or pen. Lay the bag on its side. Take your oregano stalks and bundle them together by hand so that the stalks are together. Place your leaves inside the bag with 3–4 inches (7.6–10.2 cm) of your stalks sticking out.Tip: You shouldn’t need more than 2-4 stalks of oregano unless you’re making it in large batches to use over the course of a few months. The leaves from 2-4 stalks should produce plenty of leaves for garnishing or flavoring your food. This method takes the longest, but it’s the traditional method for drying herbs out. It’s the best way to ensure that your stalks are completely dry while maintaining their flavors. The paper bag will protect your leaves from dust. You can skip this step if you’re going to store your oregano in a well-ventilated area. Some people prefer to punch a hole in the bottom of the paper bag and slide the stalks through the opening so that the leaves are hanging out the open end of the bag. You can do this if you prefer."
                },
                {
                    "headline": "Wrap twine tightly around the stalks to secure them together.",
                    "description": "Take a 6–12 in (15–30 cm) length of twine and wrap it around the stalks and the bag, directly under the first set of leaves. Wrap the stalks and the bag tightly together by looping the twine around the stalks 2-3 times and pulling it tight. Tie the twine in a knot to secure your bag and your stalks. You can use a 36–42 in (91–107 cm) length of twine and use the excess length to hang your herbs if you want to avoid using 2 separate lengths of twine. You can use jute twine, butcher’s twine, or cotton string to wrap your herbs. You can also use a rubber band if you don’t have any twine."
                },
                {
                    "headline": "Hang your stalks from a pole, hook, or clothing line with twine.",
                    "description": "The easiest way to hang your stalks is to grab a 24–36 in (61–91 cm) length of twine and attach it to the other twine that you wrapped around your stalks with a knot. You can also wrap the length around the stalks and tie it underneath the first knot you made. Tie your twine to a clothing hanger, curtain rod, or command hook in a dry, well-ventilated area of your home to hang your herbs. While it’s nice to picture your herbs hanging in your kitchen, this is actually the worst place to store your oregano. When you cook something on the stove, the food smells can get into your oregano and modify their flavors. Another way to hang your stalks is to unfold a paper clip, slide half of it between your twine, and hook the bottom half on the twine. Then, use the top hook hang the hook on a length of twine."
                },
                {
                    "headline": "Wait 2-6 weeks for your oregano to dry.",
                    "description": "Hanging your herbs to dry them can take a while. Typically, oregano will take 2-6 weeks to dry, although it may be longer or shorter depending on how wet your oregano is when you dry it, the moisture content of your room, and how much air flow there is in your home. After 1-2 weeks of drying, check your oregano every 2-3 days to see if it has fully dried out. Dried oregano will be pale green and will crumble easily in your hands. If you want to check to see if they’re dry, put a single leaf in an airtight glass jar. If no moisture condenses inside of the jar, your leaves are dry. Store your dried oregano in an airtight container."
                }
            ]
        },
        {
            "name": "Drying Your Oregano on Trays",
            "steps": [
                {
                    "headline": "Get a set of dehydrating trays with a protective screen.",
                    "description": "Dehydrating trays are 2 plastic or metal trays that stack on one another to air food out. Dehydrating trays can be purchased from a home or kitchen goods store. Get a set with a protective screen to keep bugs and dust out of your herbs. This method takes less time than hanging your herbs, but you have to trim your leaves to do this."
                },
                {
                    "headline": "Set your oregano out evenly in between the trays and stack them.",
                    "description": "Clip the leaves off of your oregano with shears or scissors. Set the leaves out evenly on top of the bottom tray. Leave 1–2 centimetres (10–20 mm) in between each leaf so that there isn’t any overlap between your leaves. Once you’ve filled one of your trays, place the other tray on top.Tip: If you have bigger trays, you can leave your leaves on the stalks. These bigger dehydrating trays tend to be quite expensive though. If your protective screen isn’t built into your trays, place one underneath the leaves on the bottom tray when you’re laying them out. Set the other protective screen on top of the second tray when you stack them."
                },
                {
                    "headline": "Leave the trays out in warm, well-ventilated area.",
                    "description": "Take your dehydrating trays to a room in your home that’s warm and well-ventilated. Turn the fan on low if the room doesn’t have a lot of air flow. Avoid placing your tray next to a window or in a well-lit room. The sun will dye your leaves and may heat some of the flavorful oils out of your oregano. Attics are perfect for drying oregano on dehydrating trays. Basements are usually a poor choice since they tend to trap moisture in the room."
                },
                {
                    "headline": "Wait at least 1 week for your oregano to dry out.",
                    "description": "Every day, check your leaves to see if they’ve dried out. This process typically takes 4-7 days, although it may take longer depending on the conditions of the room where you’re drying them out. Once your leaves are completely dry, remove them from the trays and store them in an airtight container. If you dried your leaves on the stalk, you should be able to easily pull the leaves off of the stalk. When oregano is dry, the leaves will be a little paler and crumble easily in your palm. If you aren’t sure if the oregano is dry, put one leaf in a glass jar for 15 minutes. If no moisture condenses in the jar, it’s dry."
                }
            ]
        },
        {
            "name": "Using a Food Dehydrator",
            "steps": [
                {
                    "headline": "Arrange your oregano in single layers on your dehydrator’s trays.",
                    "description": "Remove the trays from your dehydrator by pulling them out. Clip your leaves off of the stalks with shears, a knife, or by pulling them off. Layer your leaves out on the dehydrator’s trays, leaving 1–2 centimetres (10–20 mm) of space between each individual leaf. You can use every tray in your dehydrator to spread your leaves out. This method is quicker than letting your oregano air dry, but it requires the use of a food dehydrator. If you don’t already have a dehydrator, they can be kind of expensive. You can dehydrate your oregano with the leaves still on the stalk if you can fit the stalks inside of your dehydrator. Most dehydrators are too small to fit entire stalks though."
                },
                {
                    "headline": "Preheat the dehydrator to 100 °F (38 °C).",
                    "description": "Plug your dehydrator in and turn the power on. Turn the dial or press the buttons to set your dehydrator to 100 °F (38 °C). Wait 5-10 minutes for your food dehydrator to reach the necessary temperature. If you have a moisture setting, set it to the lowest setting available. If it’s really warm in your home and the humidity is high, turn your dehydrator on to 125 °F (52 °C)."
                },
                {
                    "headline": "Set the trays back inside of your dehydrator.",
                    "description": "Once your dehydrator is preheated, put on an oven mitt. Open the door for your dehydrator. Carefully reinsert each tray in the dehydrator by sliding it into the grooves where the trays sit. Close the door for your dehydrator. Try to avoid disrupting your leaves or shaking the trays while you’re putting them back into the dehydrator."
                },
                {
                    "headline": "Let your oregano dry in the dehydrator for 1-4 hours.",
                    "description": "The time it takes for your oregano to fully dry is dependent upon several factors. After your oregano has cooked for 1 hour, open the dehydrator and inspect the leaves. If they’re darker, curled up a little, and crumble when you poke them with your fork, they’re done. If they aren’t, keep the leaves in the dehydrator for another 1-3 hours, checking them periodically to make sure you don’t burn them.Warning: If you smell smoke, your oregano is probably starting to singe. Turn your dehydrator off and remove the trays with an oven mitt to let them cool. Check your oregano once every 20 minutes after 1 hour has passed. This will ensure that you don’t accidentally burn your oregano. Let your oregano cool for 20 minutes before storing them in an airtight container."
                }
            ]
        },
        {
            "name": "Heating Oregano in the Oven",
            "steps": [
                {
                    "headline": "Preheat your oven to 170 °F (77 °C).",
                    "description": "Set a wire rack in the middle of your oven. Close the oven door. Turn the dial or press the buttons on your oven to set it to 170 °F (77 °C). Wait 5-10 minutes for your oven to preheat.Tip: If you’re using this method, you don’t need to blot your oregano dry with paper towels after washing it. In fact, the moisture may keep your leaves safe while they heat. This is the fastest method, but it’s undoubtedly the riskiest. You can accidentally burn your oregano. You may also remove a lot of the flavors by overheating it. Still, if you’re in a hurry, this is the best way to dry your oregano."
                },
                {
                    "headline": "Spread your oregano out on a clean, dry sheet pan.",
                    "description": "Get a clean, dry sheet pan and set it out on your counter. Take your oregano and lay it out on the uncovered sheet pan. If you’re heating stalks, set each stalk parallel on the pan. If you’re heating individual leaves, spread them out evenly on the sheet pan with 1 in (2.5 cm) between each leaf. It doesn’t matter if you’re drying the oregano on or off of the stalks."
                },
                {
                    "headline": "Bake your oregano for 1 hour in the center rack of your oven.",
                    "description": "Once your oven has preheated, grab your sheet pan and carefully slide it into the middle of the center rack. Close the oven door to allow your oregano to start drying out. Leave the oregano in the oven for 1 hour to let it dry. It may take a little longer than 1 hour for your oregano to dry. If you’re drying leaves off of the stalk, it may take a little less time. If you leave your oregano in the oven for too long, you may heat out most of the key flavors and oils in your herb."
                },
                {
                    "headline": "Remove the tray and let your oregano cool for 10-20 minutes.",
                    "description": "Once your oregano has dried out, remove the tray from the oven. Set it on top of your oven to let it cool. Wait 10-20 minutes before transferring your oregano to an airtight container."
                }
            ]
        }
    ],
    "tyn": [
        "Preparing Your Oregano",
        "Colander",
        "Shears, scissors, or knife",
        "Water",
        "Paper towels",
        "Hanging Oregano to Dry It",
        "Twine",
        "Paper bags",
        "Knife, scissors, or shears",
        "Drying Your Oregano on Trays",
        "Dehydrator trays",
        "Using a Food Dehydrator",
        "Dehydrator",
        "Oven mitt",
        "Heating Oregano in the Oven",
        "Oven",
        "Sheet pan"
    ],
    "text": " Preparing Your Oregano Remove any dried or browned leaves from your stalks. Take your oregano stalks and set them out on your kitchen counter. Inspect them to look for any brown or dried-out leaves. Clip these leaves off using garden shears, scissors, or a kitchen knife. You can also simply rip them off of the plant by hand. Discard these unhealthy or flavorless leaves.Tip: Leaves that are already dry will rot by the time that you’re done drying the rest of your herbs. They also won’t taste very good, since they haven’t absorbed much moisture while the plant was growing. If any of the leaves have a color that differs from the rest of the plant, clip them off. Oregano should have a deep, green color when you dry it. Rinse your oregano under a stream of cool water. Set a colander in your kitchen sink to catch any leaves that fall off. Rinse your leaves under cold water for 10-15 seconds to wash them. If you already removed the leaves from the stalk, place them directly in the colander to wash them. You don’t need to remove the leaves to dry your oregano though. If your leaves are clean, or you purchased packaged, pre-washed oregano, you don’t need to rinse them. In fact, it’s better to skip washing them, since oregano retains moisture well and this will make the drying process take longer. If your stalks are dusty, have been eaten by bugs, or look kind of dirty, it’s a good idea to wash them. Shake your herbs dry and blot them with a paper towel. Turn the water in your sink off. Shake your oregano lightly in the sink to remove most of the water. Gently blot the oregano with dry paper towels to absorb most of the surface moisture. Hang your oregano for 6-12 hours to air dry it before using another method if you rinse it. Wrap the stalks in twine, tie it off, then attach the twine to a hook, hanger, or curtain rod. Hanging Oregano to Dry It Gather your oregano into groups of 2-4 stalks and put them in a paper bag. Take a paper bag that can hold all of your leaves and punch 10-15 small holes in each side of the bag with a fork, knife, or pen. Lay the bag on its side. Take your oregano stalks and bundle them together by hand so that the stalks are together. Place your leaves inside the bag with 3–4 inches (7.6–10.2 cm) of your stalks sticking out.Tip: You shouldn’t need more than 2-4 stalks of oregano unless you’re making it in large batches to use over the course of a few months. The leaves from 2-4 stalks should produce plenty of leaves for garnishing or flavoring your food. This method takes the longest, but it’s the traditional method for drying herbs out. It’s the best way to ensure that your stalks are completely dry while maintaining their flavors. The paper bag will protect your leaves from dust. You can skip this step if you’re going to store your oregano in a well-ventilated area. Some people prefer to punch a hole in the bottom of the paper bag and slide the stalks through the opening so that the leaves are hanging out the open end of the bag. You can do this if you prefer. Wrap twine tightly around the stalks to secure them together. Take a 6–12 in (15–30 cm) length of twine and wrap it around the stalks and the bag, directly under the first set of leaves. Wrap the stalks and the bag tightly together by looping the twine around the stalks 2-3 times and pulling it tight. Tie the twine in a knot to secure your bag and your stalks. You can use a 36–42 in (91–107 cm) length of twine and use the excess length to hang your herbs if you want to avoid using 2 separate lengths of twine. You can use jute twine, butcher’s twine, or cotton string to wrap your herbs. You can also use a rubber band if you don’t have any twine. Hang your stalks from a pole, hook, or clothing line with twine. The easiest way to hang your stalks is to grab a 24–36 in (61–91 cm) length of twine and attach it to the other twine that you wrapped around your stalks with a knot. You can also wrap the length around the stalks and tie it underneath the first knot you made. Tie your twine to a clothing hanger, curtain rod, or command hook in a dry, well-ventilated area of your home to hang your herbs. While it’s nice to picture your herbs hanging in your kitchen, this is actually the worst place to store your oregano. When you cook something on the stove, the food smells can get into your oregano and modify their flavors. Another way to hang your stalks is to unfold a paper clip, slide half of it between your twine, and hook the bottom half on the twine. Then, use the top hook hang the hook on a length of twine. Wait 2-6 weeks for your oregano to dry. Hanging your herbs to dry them can take a while. Typically, oregano will take 2-6 weeks to dry, although it may be longer or shorter depending on how wet your oregano is when you dry it, the moisture content of your room, and how much air flow there is in your home. After 1-2 weeks of drying, check your oregano every 2-3 days to see if it has fully dried out. Dried oregano will be pale green and will crumble easily in your hands. If you want to check to see if they’re dry, put a single leaf in an airtight glass jar. If no moisture condenses inside of the jar, your leaves are dry. Store your dried oregano in an airtight container. Drying Your Oregano on Trays Get a set of dehydrating trays with a protective screen. Dehydrating trays are 2 plastic or metal trays that stack on one another to air food out. Dehydrating trays can be purchased from a home or kitchen goods store. Get a set with a protective screen to keep bugs and dust out of your herbs. This method takes less time than hanging your herbs, but you have to trim your leaves to do this. Set your oregano out evenly in between the trays and stack them. Clip the leaves off of your oregano with shears or scissors. Set the leaves out evenly on top of the bottom tray. Leave 1–2 centimetres (10–20 mm) in between each leaf so that there isn’t any overlap between your leaves. Once you’ve filled one of your trays, place the other tray on top.Tip: If you have bigger trays, you can leave your leaves on the stalks. These bigger dehydrating trays tend to be quite expensive though. If your protective screen isn’t built into your trays, place one underneath the leaves on the bottom tray when you’re laying them out. Set the other protective screen on top of the second tray when you stack them. Leave the trays out in warm, well-ventilated area. Take your dehydrating trays to a room in your home that’s warm and well-ventilated. Turn the fan on low if the room doesn’t have a lot of air flow. Avoid placing your tray next to a window or in a well-lit room. The sun will dye your leaves and may heat some of the flavorful oils out of your oregano. Attics are perfect for drying oregano on dehydrating trays. Basements are usually a poor choice since they tend to trap moisture in the room. Wait at least 1 week for your oregano to dry out. Every day, check your leaves to see if they’ve dried out. This process typically takes 4-7 days, although it may take longer depending on the conditions of the room where you’re drying them out. Once your leaves are completely dry, remove them from the trays and store them in an airtight container. If you dried your leaves on the stalk, you should be able to easily pull the leaves off of the stalk. When oregano is dry, the leaves will be a little paler and crumble easily in your palm. If you aren’t sure if the oregano is dry, put one leaf in a glass jar for 15 minutes. If no moisture condenses in the jar, it’s dry. Using a Food Dehydrator Arrange your oregano in single layers on your dehydrator’s trays. Remove the trays from your dehydrator by pulling them out. Clip your leaves off of the stalks with shears, a knife, or by pulling them off. Layer your leaves out on the dehydrator’s trays, leaving 1–2 centimetres (10–20 mm) of space between each individual leaf. You can use every tray in your dehydrator to spread your leaves out. This method is quicker than letting your oregano air dry, but it requires the use of a food dehydrator. If you don’t already have a dehydrator, they can be kind of expensive. You can dehydrate your oregano with the leaves still on the stalk if you can fit the stalks inside of your dehydrator. Most dehydrators are too small to fit entire stalks though. Preheat the dehydrator to 100 °F (38 °C). Plug your dehydrator in and turn the power on. Turn the dial or press the buttons to set your dehydrator to 100 °F (38 °C). Wait 5-10 minutes for your food dehydrator to reach the necessary temperature. If you have a moisture setting, set it to the lowest setting available. If it’s really warm in your home and the humidity is high, turn your dehydrator on to 125 °F (52 °C). Set the trays back inside of your dehydrator. Once your dehydrator is preheated, put on an oven mitt. Open the door for your dehydrator. Carefully reinsert each tray in the dehydrator by sliding it into the grooves where the trays sit. Close the door for your dehydrator. Try to avoid disrupting your leaves or shaking the trays while you’re putting them back into the dehydrator. Let your oregano dry in the dehydrator for 1-4 hours. The time it takes for your oregano to fully dry is dependent upon several factors. After your oregano has cooked for 1 hour, open the dehydrator and inspect the leaves. If they’re darker, curled up a little, and crumble when you poke them with your fork, they’re done. If they aren’t, keep the leaves in the dehydrator for another 1-3 hours, checking them periodically to make sure you don’t burn them.Warning: If you smell smoke, your oregano is probably starting to singe. Turn your dehydrator off and remove the trays with an oven mitt to let them cool. Check your oregano once every 20 minutes after 1 hour has passed. This will ensure that you don’t accidentally burn your oregano. Let your oregano cool for 20 minutes before storing them in an airtight container. Heating Oregano in the Oven Preheat your oven to 170 °F (77 °C). Set a wire rack in the middle of your oven. Close the oven door. Turn the dial or press the buttons on your oven to set it to 170 °F (77 °C). Wait 5-10 minutes for your oven to preheat.Tip: If you’re using this method, you don’t need to blot your oregano dry with paper towels after washing it. In fact, the moisture may keep your leaves safe while they heat. This is the fastest method, but it’s undoubtedly the riskiest. You can accidentally burn your oregano. You may also remove a lot of the flavors by overheating it. Still, if you’re in a hurry, this is the best way to dry your oregano. Spread your oregano out on a clean, dry sheet pan. Get a clean, dry sheet pan and set it out on your counter. Take your oregano and lay it out on the uncovered sheet pan. If you’re heating stalks, set each stalk parallel on the pan. If you’re heating individual leaves, spread them out evenly on the sheet pan with 1 in (2.5 cm) between each leaf. It doesn’t matter if you’re drying the oregano on or off of the stalks. Bake your oregano for 1 hour in the center rack of your oven. Once your oven has preheated, grab your sheet pan and carefully slide it into the middle of the center rack. Close the oven door to allow your oregano to start drying out. Leave the oregano in the oven for 1 hour to let it dry. It may take a little longer than 1 hour for your oregano to dry. If you’re drying leaves off of the stalk, it may take a little less time. If you leave your oregano in the oven for too long, you may heat out most of the key flavors and oils in your herb. Remove the tray and let your oregano cool for 10-20 minutes. Once your oregano has dried out, remove the tray from the oven. Set it on top of your oven to let it cool. Wait 10-20 minutes before transferring your oregano to an airtight container.",
    "sentences": [
        " Preparing Your Oregano Remove any dried or browned leaves from your stalks.",
        "Take your oregano stalks and set them out on your kitchen counter.",
        "Inspect them to look for any brown or dried-out leaves.",
        "Clip these leaves off using garden shears, scissors, or a kitchen knife.",
        "You can also simply rip them off of the plant by hand.",
        "Discard these unhealthy or flavorless leaves.Tip: Leaves that are already dry will rot by the time that you’re done drying the rest of your herbs.",
        "They also won’t taste very good, since they haven’t absorbed much moisture while the plant was growing.",
        "If any of the leaves have a color that differs from the rest of the plant, clip them off.",
        "Oregano should have a deep, green color when you dry it.",
        "Rinse your oregano under a stream of cool water.",
        "Set a colander in your kitchen sink to catch any leaves that fall off.",
        "Rinse your leaves under cold water for 10-15 seconds to wash them.",
        "If you already removed the leaves from the stalk, place them directly in the colander to wash them.",
        "You don’t need to remove the leaves to dry your oregano though.",
        "If your leaves are clean, or you purchased packaged, pre-washed oregano, you don’t need to rinse them.",
        "In fact, it’s better to skip washing them, since oregano retains moisture well and this will make the drying process take longer.",
        "If your stalks are dusty, have been eaten by bugs, or look kind of dirty, it’s a good idea to wash them.",
        "Shake your herbs dry and blot them with a paper towel.",
        "Turn the water in your sink off.",
        "Shake your oregano lightly in the sink to remove most of the water.",
        "Gently blot the oregano with dry paper towels to absorb most of the surface moisture.",
        "Hang your oregano for 6-12 hours to air dry it before using another method if you rinse it.",
        "Wrap the stalks in twine, tie it off, then attach the twine to a hook, hanger, or curtain rod.",
        "Hanging Oregano to Dry It Gather your oregano into groups of 2-4 stalks and put them in a paper bag.",
        "Take a paper bag that can hold all of your leaves and punch 10-15 small holes in each side of the bag with a fork, knife, or pen.",
        "Lay the bag on its side.",
        "Take your oregano stalks and bundle them together by hand so that the stalks are together.",
        "Place your leaves inside the bag with 3–4 inches (7.6–10.2 cm) of your stalks sticking out.Tip: You shouldn’t need more than 2-4 stalks of oregano unless you’re making it in large batches to use over the course of a few months.",
        "The leaves from 2-4 stalks should produce plenty of leaves for garnishing or flavoring your food.",
        "This method takes the longest, but it’s the traditional method for drying herbs out.",
        "It’s the best way to ensure that your stalks are completely dry while maintaining their flavors.",
        "The paper bag will protect your leaves from dust.",
        "You can skip this step if you’re going to store your oregano in a well-ventilated area.",
        "Some people prefer to punch a hole in the bottom of the paper bag and slide the stalks through the opening so that the leaves are hanging out the open end of the bag.",
        "You can do this if you prefer.",
        "Wrap twine tightly around the stalks to secure them together.",
        "Take a 6–12 in (15–30 cm) length of twine and wrap it around the stalks and the bag, directly under the first set of leaves.",
        "Wrap the stalks and the bag tightly together by looping the twine around the stalks 2-3 times and pulling it tight.",
        "Tie the twine in a knot to secure your bag and your stalks.",
        "You can use a 36–42 in (91–107 cm) length of twine and use the excess length to hang your herbs if you want to avoid using 2 separate lengths of twine.",
        "You can use jute twine, butcher’s twine, or cotton string to wrap your herbs.",
        "You can also use a rubber band if you don’t have any twine.",
        "Hang your stalks from a pole, hook, or clothing line with twine.",
        "The easiest way to hang your stalks is to grab a 24–36 in (61–91 cm) length of twine and attach it to the other twine that you wrapped around your stalks with a knot.",
        "You can also wrap the length around the stalks and tie it underneath the first knot you made.",
        "Tie your twine to a clothing hanger, curtain rod, or command hook in a dry, well-ventilated area of your home to hang your herbs.",
        "While it’s nice to picture your herbs hanging in your kitchen, this is actually the worst place to store your oregano.",
        "When you cook something on the stove, the food smells can get into your oregano and modify their flavors.",
        "Another way to hang your stalks is to unfold a paper clip, slide half of it between your twine, and hook the bottom half on the twine.",
        "Then, use the top hook hang the hook on a length of twine.",
        "Wait 2-6 weeks for your oregano to dry.",
        "Hanging your herbs to dry them can take a while.",
        "Typically, oregano will take 2-6 weeks to dry, although it may be longer or shorter depending on how wet your oregano is when you dry it, the moisture content of your room, and how much air flow there is in your home.",
        "After 1-2 weeks of drying, check your oregano every 2-3 days to see if it has fully dried out.",
        "Dried oregano will be pale green and will crumble easily in your hands.",
        "If you want to check to see if they’re dry, put a single leaf in an airtight glass jar.",
        "If no moisture condenses inside of the jar, your leaves are dry.",
        "Store your dried oregano in an airtight container.",
        "Drying Your Oregano on Trays Get a set of dehydrating trays with a protective screen.",
        "Dehydrating trays are 2 plastic or metal trays that stack on one another to air food out.",
        "Dehydrating trays can be purchased from a home or kitchen goods store.",
        "Get a set with a protective screen to keep bugs and dust out of your herbs.",
        "This method takes less time than hanging your herbs, but you have to trim your leaves to do this.",
        "Set your oregano out evenly in between the trays and stack them.",
        "Clip the leaves off of your oregano with shears or scissors.",
        "Set the leaves out evenly on top of the bottom tray.",
        "Leave 1–2 centimetres (10–20 mm) in between each leaf so that there isn’t any overlap between your leaves.",
        "Once you’ve filled one of your trays, place the other tray on top.Tip: If you have bigger trays, you can leave your leaves on the stalks.",
        "These bigger dehydrating trays tend to be quite expensive though.",
        "If your protective screen isn’t built into your trays, place one underneath the leaves on the bottom tray when you’re laying them out.",
        "Set the other protective screen on top of the second tray when you stack them.",
        "Leave the trays out in warm, well-ventilated area.",
        "Take your dehydrating trays to a room in your home that’s warm and well-ventilated.",
        "Turn the fan on low if the room doesn’t have a lot of air flow.",
        "Avoid placing your tray next to a window or in a well-lit room.",
        "The sun will dye your leaves and may heat some of the flavorful oils out of your oregano.",
        "Attics are perfect for drying oregano on dehydrating trays.",
        "Basements are usually a poor choice since they tend to trap moisture in the room.",
        "Wait at least 1 week for your oregano to dry out.",
        "Every day, check your leaves to see if they’ve dried out.",
        "This process typically takes 4-7 days, although it may take longer depending on the conditions of the room where you’re drying them out.",
        "Once your leaves are completely dry, remove them from the trays and store them in an airtight container.",
        "If you dried your leaves on the stalk, you should be able to easily pull the leaves off of the stalk.",
        "When oregano is dry, the leaves will be a little paler and crumble easily in your palm.",
        "If you aren’t sure if the oregano is dry, put one leaf in a glass jar for 15 minutes.",
        "If no moisture condenses in the jar, it’s dry.",
        "Using a Food Dehydrator Arrange your oregano in single layers on your dehydrator’s trays.",
        "Remove the trays from your dehydrator by pulling them out.",
        "Clip your leaves off of the stalks with shears, a knife, or by pulling them off.",
        "Layer your leaves out on the dehydrator’s trays, leaving 1–2 centimetres (10–20 mm) of space between each individual leaf.",
        "You can use every tray in your dehydrator to spread your leaves out.",
        "This method is quicker than letting your oregano air dry, but it requires the use of a food dehydrator.",
        "If you don’t already have a dehydrator, they can be kind of expensive.",
        "You can dehydrate your oregano with the leaves still on the stalk if you can fit the stalks inside of your dehydrator.",
        "Most dehydrators are too small to fit entire stalks though.",
        "Preheat the dehydrator to 100 °F (38 °C).",
        "Plug your dehydrator in and turn the power on.",
        "Turn the dial or press the buttons to set your dehydrator to 100 °F (38 °C).",
        "Wait 5-10 minutes for your food dehydrator to reach the necessary temperature.",
        "If you have a moisture setting, set it to the lowest setting available.",
        "If it’s really warm in your home and the humidity is high, turn your dehydrator on to 125 °F (52 °C).",
        "Set the trays back inside of your dehydrator.",
        "Once your dehydrator is preheated, put on an oven mitt.",
        "Open the door for your dehydrator.",
        "Carefully reinsert each tray in the dehydrator by sliding it into the grooves where the trays sit.",
        "Close the door for your dehydrator.",
        "Try to avoid disrupting your leaves or shaking the trays while you’re putting them back into the dehydrator.",
        "Let your oregano dry in the dehydrator for 1-4 hours.",
        "The time it takes for your oregano to fully dry is dependent upon several factors.",
        "After your oregano has cooked for 1 hour, open the dehydrator and inspect the leaves.",
        "If they’re darker, curled up a little, and crumble when you poke them with your fork, they’re done.",
        "If they aren’t, keep the leaves in the dehydrator for another 1-3 hours, checking them periodically to make sure you don’t burn them.Warning: If you smell smoke, your oregano is probably starting to singe.",
        "Turn your dehydrator off and remove the trays with an oven mitt to let them cool.",
        "Check your oregano once every 20 minutes after 1 hour has passed.",
        "This will ensure that you don’t accidentally burn your oregano.",
        "Let your oregano cool for 20 minutes before storing them in an airtight container.",
        "Heating Oregano in the Oven Preheat your oven to 170 °F (77 °C).",
        "Set a wire rack in the middle of your oven.",
        "Close the oven door.",
        "Turn the dial or press the buttons on your oven to set it to 170 °F (77 °C).",
        "Wait 5-10 minutes for your oven to preheat.Tip: If you’re using this method, you don’t need to blot your oregano dry with paper towels after washing it.",
        "In fact, the moisture may keep your leaves safe while they heat.",
        "This is the fastest method, but it’s undoubtedly the riskiest.",
        "You can accidentally burn your oregano.",
        "You may also remove a lot of the flavors by overheating it.",
        "Still, if you’re in a hurry, this is the best way to dry your oregano.",
        "Spread your oregano out on a clean, dry sheet pan.",
        "Get a clean, dry sheet pan and set it out on your counter.",
        "Take your oregano and lay it out on the uncovered sheet pan.",
        "If you’re heating stalks, set each stalk parallel on the pan.",
        "If you’re heating individual leaves, spread them out evenly on the sheet pan with 1 in (2.5 cm) between each leaf.",
        "It doesn’t matter if you’re drying the oregano on or off of the stalks.",
        "Bake your oregano for 1 hour in the center rack of your oven.",
        "Once your oven has preheated, grab your sheet pan and carefully slide it into the middle of the center rack.",
        "Close the oven door to allow your oregano to start drying out.",
        "Leave the oregano in the oven for 1 hour to let it dry.",
        "It may take a little longer than 1 hour for your oregano to dry.",
        "If you’re drying leaves off of the stalk, it may take a little less time.",
        "If you leave your oregano in the oven for too long, you may heat out most of the key flavors and oils in your herb.",
        "Remove the tray and let your oregano cool for 10-20 minutes.",
        "Once your oregano has dried out, remove the tray from the oven.",
        "Set it on top of your oven to let it cool.",
        "Wait 10-20 minutes before transferring your oregano to an airtight container."
    ]
}