{
    "title": "How to Smoke Beef Ribs",
    "url": "https://www.wikihow.com/Smoke-Beef-Ribs",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Beef and Lamb"
    ],
    "methods": [
        {
            "name": "Buying Ribs",
            "steps": [
                {
                    "headline": "Shop at your local grocery store or butcher shop.",
                    "description": ""
                },
                {
                    "headline": "Look for ribs that have plenty of fat.",
                    "description": "When slow cooking beef ribs, the more fat the meat has, the better the flavor will be."
                },
                {
                    "headline": "Select ribs that have a lot of connective tissue.",
                    "description": "When smoking meat, the collagen, or connective tissue, melts and adds to the texture of the ribs."
                }
            ]
        },
        {
            "name": "Preparing Ribs",
            "steps": [
                {
                    "headline": "Remove the fell, or membrane that covers the bony side of the ribs.",
                    "description": "You want your smoked beef ribs to be tender, and the fell is tough and sinewy. Slide a knife beneath the fell so you can peel it off. Grab the loose piece of fell with a paper towel. Pull the fell off."
                },
                {
                    "headline": "Season your meat before slow cooking beef ribs.",
                    "description": "You may rub the ribs with dry seasonings or marinade them in your favorite sauce. Make a dry rub out of sugar, salt, spices and/or herbs. Soak your ribs in a marinade. When smoking meats, an acidic marinade will act as a tenderizer. Acidic sauces include citrus fruit or vinegar. Let the ribs set overnight so that they will soak up the seasoning."
                }
            ]
        },
        {
            "name": "Preparing Your Smoker",
            "steps": [
                {
                    "headline": "Start your smoker.",
                    "description": "There are wood, electric, propane and charcoal smokers. Read the manufacturer's directions before you begin."
                },
                {
                    "headline": "Add water to the water bowl, if your smoker has one.",
                    "description": ""
                },
                {
                    "headline": "Find smoking wood in your backyard, at a local store or online.",
                    "description": "When slow cooking beef ribs, you may use wood chips or wood blocks."
                },
                {
                    "headline": "Add alder, cherry, cedar, plum, maple or hickory blocks or chips to the water or put them on the charcoal.",
                    "description": "You will need at least 4 cups (946.35 ml) wood chips and 5 to 6 wood blocks when smoking beef ribs."
                },
                {
                    "headline": "Check the temperature with a thermometer.",
                    "description": "When slow cooking meat, it is imperative that you have a thermometer to monitor the temperature of the smoker. When the temperature reaches 225 degrees Fahrenheit (107.22 C), you may begin cooking your ribs."
                }
            ]
        },
        {
            "name": "Smoking the Ribs",
            "steps": [
                {
                    "headline": "Put your ribs in the smoker and secure the lid.",
                    "description": "When smoking meat, you need an airtight system so the smoke will penetrate the food."
                },
                {
                    "headline": "Check the temperature of the smoker and adjust air vents and temperature controls to maintain the smoker at 225 degrees Fahrenheit (107.22 C).",
                    "description": "If necessary, add more charcoal to the smoker."
                },
                {
                    "headline": "Shorten smoking time by covering the ribs with aluminum foil after they have cooked for 2 hours.",
                    "description": "Smoked beef ribs may take 6 to 8 hours to prepare, and if you're in a hurry, wrapping the ribs will shorten the cooking time."
                },
                {
                    "headline": "Test the ribs after smoking them for an additional 3 hours.",
                    "description": "Cut a piece of meat off with a knife, and if the smoked ribs are tender, they are done. If they are still tough, put them back in the smoker for another 30 minutes to 1 hour."
                }
            ]
        }
    ],
    "tyn": [
        "Beef ribs",
        "Paper towel",
        "Dry rub or marinade",
        "Smoker",
        "Wood, briquettes or propane",
        "Water",
        "Smoking wood",
        "Thermometer",
        "Aluminum foil",
        "knife"
    ],
    "text": " Buying Ribs Shop at your local grocery store or butcher shop.  Look for ribs that have plenty of fat. When slow cooking beef ribs, the more fat the meat has, the better the flavor will be. Select ribs that have a lot of connective tissue. When smoking meat, the collagen, or connective tissue, melts and adds to the texture of the ribs. Preparing Ribs Remove the fell, or membrane that covers the bony side of the ribs. You want your smoked beef ribs to be tender, and the fell is tough and sinewy. Slide a knife beneath the fell so you can peel it off. Grab the loose piece of fell with a paper towel. Pull the fell off. Season your meat before slow cooking beef ribs. You may rub the ribs with dry seasonings or marinade them in your favorite sauce. Make a dry rub out of sugar, salt, spices and/or herbs. Soak your ribs in a marinade. When smoking meats, an acidic marinade will act as a tenderizer. Acidic sauces include citrus fruit or vinegar. Let the ribs set overnight so that they will soak up the seasoning. Preparing Your Smoker Start your smoker. There are wood, electric, propane and charcoal smokers. Read the manufacturer's directions before you begin. Add water to the water bowl, if your smoker has one.  Find smoking wood in your backyard, at a local store or online. When slow cooking beef ribs, you may use wood chips or wood blocks. Add alder, cherry, cedar, plum, maple or hickory blocks or chips to the water or put them on the charcoal. You will need at least 4 cups (946.35 ml) wood chips and 5 to 6 wood blocks when smoking beef ribs. Check the temperature with a thermometer. When slow cooking meat, it is imperative that you have a thermometer to monitor the temperature of the smoker. When the temperature reaches 225 degrees Fahrenheit (107.22 C), you may begin cooking your ribs. Smoking the Ribs Put your ribs in the smoker and secure the lid. When smoking meat, you need an airtight system so the smoke will penetrate the food. Check the temperature of the smoker and adjust air vents and temperature controls to maintain the smoker at 225 degrees Fahrenheit (107.22 C). If necessary, add more charcoal to the smoker. Shorten smoking time by covering the ribs with aluminum foil after they have cooked for 2 hours. Smoked beef ribs may take 6 to 8 hours to prepare, and if you're in a hurry, wrapping the ribs will shorten the cooking time. Test the ribs after smoking them for an additional 3 hours. Cut a piece of meat off with a knife, and if the smoked ribs are tender, they are done. If they are still tough, put them back in the smoker for another 30 minutes to 1 hour.",
    "sentences": [
        " Buying Ribs Shop at your local grocery store or butcher shop.",
        "Look for ribs that have plenty of fat.",
        "When slow cooking beef ribs, the more fat the meat has, the better the flavor will be.",
        "Select ribs that have a lot of connective tissue.",
        "When smoking meat, the collagen, or connective tissue, melts and adds to the texture of the ribs.",
        "Preparing Ribs Remove the fell, or membrane that covers the bony side of the ribs.",
        "You want your smoked beef ribs to be tender, and the fell is tough and sinewy.",
        "Slide a knife beneath the fell so you can peel it off.",
        "Grab the loose piece of fell with a paper towel.",
        "Pull the fell off.",
        "Season your meat before slow cooking beef ribs.",
        "You may rub the ribs with dry seasonings or marinade them in your favorite sauce.",
        "Make a dry rub out of sugar, salt, spices and/or herbs.",
        "Soak your ribs in a marinade.",
        "When smoking meats, an acidic marinade will act as a tenderizer.",
        "Acidic sauces include citrus fruit or vinegar.",
        "Let the ribs set overnight so that they will soak up the seasoning.",
        "Preparing Your Smoker Start your smoker.",
        "There are wood, electric, propane and charcoal smokers.",
        "Read the manufacturer's directions before you begin.",
        "Add water to the water bowl, if your smoker has one.",
        "Find smoking wood in your backyard, at a local store or online.",
        "When slow cooking beef ribs, you may use wood chips or wood blocks.",
        "Add alder, cherry, cedar, plum, maple or hickory blocks or chips to the water or put them on the charcoal.",
        "You will need at least 4 cups (946.35 ml) wood chips and 5 to 6 wood blocks when smoking beef ribs.",
        "Check the temperature with a thermometer.",
        "When slow cooking meat, it is imperative that you have a thermometer to monitor the temperature of the smoker.",
        "When the temperature reaches 225 degrees Fahrenheit (107.22 C), you may begin cooking your ribs.",
        "Smoking the Ribs Put your ribs in the smoker and secure the lid.",
        "When smoking meat, you need an airtight system so the smoke will penetrate the food.",
        "Check the temperature of the smoker and adjust air vents and temperature controls to maintain the smoker at 225 degrees Fahrenheit (107.22 C).",
        "If necessary, add more charcoal to the smoker.",
        "Shorten smoking time by covering the ribs with aluminum foil after they have cooked for 2 hours.",
        "Smoked beef ribs may take 6 to 8 hours to prepare, and if you're in a hurry, wrapping the ribs will shorten the cooking time.",
        "Test the ribs after smoking them for an additional 3 hours.",
        "Cut a piece of meat off with a knife, and if the smoked ribs are tender, they are done.",
        "If they are still tough, put them back in the smoker for another 30 minutes to 1 hour."
    ]
}