{
    "title": "How to Measure Flour",
    "url": "https://www.wikihow.com/Measure-Flour",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills"
    ],
    "methods": [
        {
            "name": "Measuring Unsifted Flour",
            "steps": [
                {
                    "headline": "Use measuring cups of the exact right size.",
                    "description": "This is the best way to ensure accuracy when you're measuring out flour by volume. It’s more difficult to use the proper technique with an oversized measuring cup, since you can't complete the final step of leveling off the top. So, for example, if your recipe calls for 1 1/2 cups of flour, use both a one-cup dry measuring cup and a half-cup dry measuring cup. If your recipe calls for 2/3 cup of flour, measure out two 1/3 cups instead of using a larger cup."
                },
                {
                    "headline": "Fluff up the flour.",
                    "description": "Flour tends to come tightly packed in paper bags. If you don't fluff it up before measuring it, you'll end up measuring out more flour than you actually need for your recipe. Dig your spoon into the container the flour is in and fluff it up a little. You might want to consider storing your flour in a metal, plastic or glass container with a lid instead of keeping it in the bag it came in. That way your flour won't be as tightly packed, and it will be easier to reach in and fluff it up when you need to use some."
                },
                {
                    "headline": "Spoon it into your measuring cup.",
                    "description": "Use a spoon to scoop flour into the cup until the cup is slightly overfull. Do not pack the flour into the cup; just lightly scoop it in until the cup is full and a small peak has formed in the center."
                },
                {
                    "headline": "Level it off.",
                    "description": "Use a straight edge, such as the back of a knife, to level off the top by running it against the rim of the cup. Do this over the container so the excess flour drops back in. You're now ready to use the flour in your recipe. If it calls for additional cups, measure them the same way."
                }
            ]
        },
        {
            "name": "Measuring Sifted Flour",
            "steps": [
                {
                    "headline": "Sift the flour.",
                    "description": "Pour a little more flour than you need for your recipe into a flour sifter and sift it thoroughly over a bowl. Sifting flour aerates it, resulting in lighter baked goods. This might sound like a great thing to do for every recipe, but you should only sift flour if the recipe calls for doing so. For certain cakes and pastries, a denser final product is actually preferred. If you don't have a flour sifter, you can sift flour just by stirring it. Pour it into a bowl and use a whisk to briskly stir it until it's light and fluffy."
                },
                {
                    "headline": "Scoop the flour into your measuring cup.",
                    "description": "Use a spoon to measure the flour into a cup that’s the exact right size. Avoided using a larger measuring cup than you need, since it's harder to get an accurate measurement this way."
                },
                {
                    "headline": "Level it off with a straightedge.",
                    "description": "Run the back of a knife or another straightedge across the rim of the measuring cup, letting the excess flour fall back into the container. You may now  use your perfectly measured flour in your recipe."
                }
            ]
        },
        {
            "name": "Measuring Flour by Weight",
            "steps": [
                {
                    "headline": "Buy a kitchen scale.",
                    "description": "If you’re getting into bread baking or pastry making and you want to make sure you’re measuring flour accurately, it’s worth it to invest in a kitchen scale. That’s because even the scoop and level method isn’t as accurate as weighing the flour to make sure it comes out to the right weight. Since being off by even half an ounce can make a difference in the outcome of your baked goods, using a scale is the top choice for serious bakers."
                },
                {
                    "headline": "Find out the weight of the specific flour you're using.",
                    "description": "A cup of white, unbleached flour comes out to approximately four and a quarter ounces, but other flours have different weights. If you're working with whole wheat flour, self-rising flour or another type of flour, find out exactly how much a cup should weigh. Here are the weights of commonly used specialty flours:\nCake flour: 1 cup = 4 ounces\nSelf-rising flour: 1 cup = 4 ounces\nWhole wheat flour: 1 cup = 4 ounces\nWhole wheat pastry flour: 1 cup = 3 3/8 ounces"
                },
                {
                    "headline": "Do the math to find out how much total flour you need in ounces.",
                    "description": "If your recipe calls for 2 1/2 cups of white flour, for example, you'll need to figure out how many ounces that comes to. Do the math in your head or use a calculator to figure out how much you need to weigh out."
                },
                {
                    "headline": "Zero out the weight of your container.",
                    "description": "Since whatever container you’re using to hold the flour shouldn’t count toward the weight of the flour, you have to subtract its weight from the final amount. You can do this by using your scale to \"zero out\" the weight of the container. If you're using a mechanical scale, turn the knob back to the zero mark with the container on the scale. If you're using a digital scale, hit the “clear” button with the container on the scale."
                },
                {
                    "headline": "Add the flour slowly until the scale registers the correct weight.",
                    "description": "Once the container's weight has been zeroed out, you can add your flour. Scoop it into the container until the correct weight is reached. If you're using regular white flour, it should come to 4.25 ounces per cup. If you're using another flour, double check to see how much a cup should weigh."
                }
            ]
        }
    ],
    "tyn": [
        "Flour",
        "Measuring cup",
        "Sifter",
        "Mixing bowl",
        "Knife or other straight edge",
        "Kitchen scale"
    ],
    "text": " Measuring Unsifted Flour Use measuring cups of the exact right size. This is the best way to ensure accuracy when you're measuring out flour by volume. It’s more difficult to use the proper technique with an oversized measuring cup, since you can't complete the final step of leveling off the top. So, for example, if your recipe calls for 1 1/2 cups of flour, use both a one-cup dry measuring cup and a half-cup dry measuring cup. If your recipe calls for 2/3 cup of flour, measure out two 1/3 cups instead of using a larger cup. Fluff up the flour. Flour tends to come tightly packed in paper bags. If you don't fluff it up before measuring it, you'll end up measuring out more flour than you actually need for your recipe. Dig your spoon into the container the flour is in and fluff it up a little. You might want to consider storing your flour in a metal, plastic or glass container with a lid instead of keeping it in the bag it came in. That way your flour won't be as tightly packed, and it will be easier to reach in and fluff it up when you need to use some. Spoon it into your measuring cup. Use a spoon to scoop flour into the cup until the cup is slightly overfull. Do not pack the flour into the cup; just lightly scoop it in until the cup is full and a small peak has formed in the center. Level it off. Use a straight edge, such as the back of a knife, to level off the top by running it against the rim of the cup. Do this over the container so the excess flour drops back in. You're now ready to use the flour in your recipe. If it calls for additional cups, measure them the same way. Measuring Sifted Flour Sift the flour. Pour a little more flour than you need for your recipe into a flour sifter and sift it thoroughly over a bowl. Sifting flour aerates it, resulting in lighter baked goods. This might sound like a great thing to do for every recipe, but you should only sift flour if the recipe calls for doing so. For certain cakes and pastries, a denser final product is actually preferred. If you don't have a flour sifter, you can sift flour just by stirring it. Pour it into a bowl and use a whisk to briskly stir it until it's light and fluffy. Scoop the flour into your measuring cup. Use a spoon to measure the flour into a cup that’s the exact right size. Avoided using a larger measuring cup than you need, since it's harder to get an accurate measurement this way. Level it off with a straightedge. Run the back of a knife or another straightedge across the rim of the measuring cup, letting the excess flour fall back into the container. You may now  use your perfectly measured flour in your recipe. Measuring Flour by Weight Buy a kitchen scale. If you’re getting into bread baking or pastry making and you want to make sure you’re measuring flour accurately, it’s worth it to invest in a kitchen scale. That’s because even the scoop and level method isn’t as accurate as weighing the flour to make sure it comes out to the right weight. Since being off by even half an ounce can make a difference in the outcome of your baked goods, using a scale is the top choice for serious bakers. Find out the weight of the specific flour you're using. A cup of white, unbleached flour comes out to approximately four and a quarter ounces, but other flours have different weights. If you're working with whole wheat flour, self-rising flour or another type of flour, find out exactly how much a cup should weigh. Here are the weights of commonly used specialty flours:\nCake flour: 1 cup = 4 ounces\nSelf-rising flour: 1 cup = 4 ounces\nWhole wheat flour: 1 cup = 4 ounces\nWhole wheat pastry flour: 1 cup = 3 3/8 ounces Do the math to find out how much total flour you need in ounces. If your recipe calls for 2 1/2 cups of white flour, for example, you'll need to figure out how many ounces that comes to. Do the math in your head or use a calculator to figure out how much you need to weigh out. Zero out the weight of your container. Since whatever container you’re using to hold the flour shouldn’t count toward the weight of the flour, you have to subtract its weight from the final amount. You can do this by using your scale to \"zero out\" the weight of the container. If you're using a mechanical scale, turn the knob back to the zero mark with the container on the scale. If you're using a digital scale, hit the “clear” button with the container on the scale. Add the flour slowly until the scale registers the correct weight. Once the container's weight has been zeroed out, you can add your flour. Scoop it into the container until the correct weight is reached. If you're using regular white flour, it should come to 4.25 ounces per cup. If you're using another flour, double check to see how much a cup should weigh.",
    "sentences": [
        " Measuring Unsifted Flour Use measuring cups of the exact right size.",
        "This is the best way to ensure accuracy when you're measuring out flour by volume.",
        "It’s more difficult to use the proper technique with an oversized measuring cup, since you can't complete the final step of leveling off the top.",
        "So, for example, if your recipe calls for 1 1/2 cups of flour, use both a one-cup dry measuring cup and a half-cup dry measuring cup.",
        "If your recipe calls for 2/3 cup of flour, measure out two 1/3 cups instead of using a larger cup.",
        "Fluff up the flour.",
        "Flour tends to come tightly packed in paper bags.",
        "If you don't fluff it up before measuring it, you'll end up measuring out more flour than you actually need for your recipe.",
        "Dig your spoon into the container the flour is in and fluff it up a little.",
        "You might want to consider storing your flour in a metal, plastic or glass container with a lid instead of keeping it in the bag it came in.",
        "That way your flour won't be as tightly packed, and it will be easier to reach in and fluff it up when you need to use some.",
        "Spoon it into your measuring cup.",
        "Use a spoon to scoop flour into the cup until the cup is slightly overfull.",
        "Do not pack the flour into the cup; just lightly scoop it in until the cup is full and a small peak has formed in the center.",
        "Level it off.",
        "Use a straight edge, such as the back of a knife, to level off the top by running it against the rim of the cup.",
        "Do this over the container so the excess flour drops back in.",
        "You're now ready to use the flour in your recipe.",
        "If it calls for additional cups, measure them the same way.",
        "Measuring Sifted Flour Sift the flour.",
        "Pour a little more flour than you need for your recipe into a flour sifter and sift it thoroughly over a bowl.",
        "Sifting flour aerates it, resulting in lighter baked goods.",
        "This might sound like a great thing to do for every recipe, but you should only sift flour if the recipe calls for doing so.",
        "For certain cakes and pastries, a denser final product is actually preferred.",
        "If you don't have a flour sifter, you can sift flour just by stirring it.",
        "Pour it into a bowl and use a whisk to briskly stir it until it's light and fluffy.",
        "Scoop the flour into your measuring cup.",
        "Use a spoon to measure the flour into a cup that’s the exact right size.",
        "Avoided using a larger measuring cup than you need, since it's harder to get an accurate measurement this way.",
        "Level it off with a straightedge.",
        "Run the back of a knife or another straightedge across the rim of the measuring cup, letting the excess flour fall back into the container.",
        "You may now  use your perfectly measured flour in your recipe.",
        "Measuring Flour by Weight Buy a kitchen scale.",
        "If you’re getting into bread baking or pastry making and you want to make sure you’re measuring flour accurately, it’s worth it to invest in a kitchen scale.",
        "That’s because even the scoop and level method isn’t as accurate as weighing the flour to make sure it comes out to the right weight.",
        "Since being off by even half an ounce can make a difference in the outcome of your baked goods, using a scale is the top choice for serious bakers.",
        "Find out the weight of the specific flour you're using.",
        "A cup of white, unbleached flour comes out to approximately four and a quarter ounces, but other flours have different weights.",
        "If you're working with whole wheat flour, self-rising flour or another type of flour, find out exactly how much a cup should weigh.",
        "Here are the weights of commonly used specialty flours:\nCake flour: 1 cup = 4 ounces\nSelf-rising flour: 1 cup = 4 ounces\nWhole wheat flour: 1 cup = 4 ounces\nWhole wheat pastry flour: 1 cup = 3 3/8 ounces Do the math to find out how much total flour you need in ounces.",
        "If your recipe calls for 2 1/2 cups of white flour, for example, you'll need to figure out how many ounces that comes to.",
        "Do the math in your head or use a calculator to figure out how much you need to weigh out.",
        "Zero out the weight of your container.",
        "Since whatever container you’re using to hold the flour shouldn’t count toward the weight of the flour, you have to subtract its weight from the final amount.",
        "You can do this by using your scale to \"zero out\" the weight of the container.",
        "If you're using a mechanical scale, turn the knob back to the zero mark with the container on the scale.",
        "If you're using a digital scale, hit the “clear” button with the container on the scale.",
        "Add the flour slowly until the scale registers the correct weight.",
        "Once the container's weight has been zeroed out, you can add your flour.",
        "Scoop it into the container until the correct weight is reached.",
        "If you're using regular white flour, it should come to 4.25 ounces per cup.",
        "If you're using another flour, double check to see how much a cup should weigh."
    ]
}