{
    "title": "How to Make a Living Gardening",
    "url": "https://www.wikihow.com/Make-a-Living-Gardening",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Garden Projects"
    ],
    "methods": [
        {
            "name": "Learning How To Garden",
            "steps": [
                {
                    "headline": "Take courses.",
                    "description": "A great way to gain the skills and information needed to become a master gardener is to attended classes. Many such classes are available today and at varying levels of intensity. Find a course near you that you can attend and get started towards your goal of becoming a professional gardener. You can search on-line for courses at http://www.ahs.org/gardening-resources/master-gardeners\n\nCourse time will vary greatly between programs. Some are based on hourly requirements and others are based on weekly schedules. Generally you will be required to volunteer for a certain number of hours to finalize your certification as a master gardener."
                },
                {
                    "headline": "Recognize a good course.",
                    "description": "If you are taking a course or receiving any kind of training in gardening you will want to make sure it covers core concepts. Finding a course that offers these basic skills of gardening will help you to be at your best professionally. Review the following outline of what a good course should offer:\nPesticide use, safety, and alternative methods. Plant science and nutrition. How to recognize weeds and how best to control them. Disease, pest, and insect identification and management. Some form of certification."
                },
                {
                    "headline": "Volunteer to learn gardening skills.",
                    "description": "Volunteering is a great and inexpensive way to get hands-on training and experience with gardening. By volunteering you can learn some of the core skills that any gardener should possess and work towards you goal of becoming a professional."
                },
                {
                    "headline": "Consider your location.",
                    "description": "During either your training or professional life as a gardener you will want to consider you location when pursuing this career. Your location will dictate how often you practice gardening based on what climate and season that location might have. Think about how well your location fits your goal of becoming a professional gardener. Certain climates will affect which plants are able to grow. Learn more about your climate zone at http://planthardiness.ars.usda.gov/PHZMWeb/#\n\nWeather and season will affect the amount you are able to work. Even though winter may present a challenge for gardeners, there are still some services you can offer such as pruning or fencing. If your location doesn't have a long growing season you may want to consider moving."
                }
            ]
        },
        {
            "name": "Starting Your Own Gardening Business",
            "steps": [
                {
                    "headline": "Think about the basics.",
                    "description": "Before you start your own gardening business you will need to consider some of the basics. Having a clear plan and core aspects decided upon will help you to start a successful gardening business and continue running it. You will likely want to have some form of insurance and it may even be a legal requirement. Having a good logo can help spread your business. Having a simple uniform can help you look professional and increase your business. Make it easy for your clients to contact you. Have a dedicated phone number and email for your business. Make sure you are operating legally. Obtain and file necessary forms, documents, and licenses."
                },
                {
                    "headline": "Get your equipment.",
                    "description": "If you are starting out on your own as a gardener you will need to supply your own equipment. Everything you need to do your best will have to be acquired and transported to any job sites that you work at. Make sure you have some of the following things prepared before you start your business:\nTransportation to carry you and your gear to job sites. Tools to work with. These might include pesticide applicators, digging tools, and fertilizers. Safety gear such as goggles, respirators, steel-toe boots, and gloves."
                },
                {
                    "headline": "Consider your customers.",
                    "description": "Your customers will be the ones supporting your gardening business. Since your customers will be such a critical part of your business you will need to consider what you are offering to them and make these offerings clear. You will also need to think about what type of clients you want to obtain. You may opt for a few large customers. Taking many smaller clients can also be a valid direction for your gardening business. Make your service offerings clear. For example, you might charge a flat rate for mowing a lawn but charge an hourly rate for landscaping."
                }
            ]
        },
        {
            "name": "Finding Employment As A Gardener",
            "steps": [
                {
                    "headline": "Try checking with your local government.",
                    "description": "Often times your local municipal government will offer positions for those with gardening skills. There may be local parks, cemeteries, or other such public areas that have need of a professional gardener. Working with your local government can be a great way to become a professional gardener and help beautify your community."
                },
                {
                    "headline": "Check with botanical and historical gardens.",
                    "description": "Both botanical and historical gardens will house a large and varied number of plants either for research or presentation. These gardens can be an excellent place for any gardener to work, practicing their skills and doing what they love. They may also offer a professionally challenging environment and allow you to develop your knowledge and skills as a gardener."
                },
                {
                    "headline": "Apply with nurseries or greenhouses.",
                    "description": "Most areas will have some kind of plant nursery or greenhouse that sell a large variety of plants. Due to the variety of plants these greenhouses offer,  they require the skills that a professional gardener can bring. Try searching with these nurseries and greenhouses to find a rewarding career as a gardener."
                }
            ]
        }
    ],
    "tyn": [
        "Training and skills as a gardeners",
        "Gardening equipment",
        "Transport"
    ],
    "text": " Learning How To Garden Take courses. A great way to gain the skills and information needed to become a master gardener is to attended classes. Many such classes are available today and at varying levels of intensity. Find a course near you that you can attend and get started towards your goal of becoming a professional gardener. You can search on-line for courses at http://www.ahs.org/gardening-resources/master-gardeners\n\nCourse time will vary greatly between programs. Some are based on hourly requirements and others are based on weekly schedules. Generally you will be required to volunteer for a certain number of hours to finalize your certification as a master gardener. Recognize a good course. If you are taking a course or receiving any kind of training in gardening you will want to make sure it covers core concepts. Finding a course that offers these basic skills of gardening will help you to be at your best professionally. Review the following outline of what a good course should offer:\nPesticide use, safety, and alternative methods. Plant science and nutrition. How to recognize weeds and how best to control them. Disease, pest, and insect identification and management. Some form of certification. Volunteer to learn gardening skills. Volunteering is a great and inexpensive way to get hands-on training and experience with gardening. By volunteering you can learn some of the core skills that any gardener should possess and work towards you goal of becoming a professional. Consider your location. During either your training or professional life as a gardener you will want to consider you location when pursuing this career. Your location will dictate how often you practice gardening based on what climate and season that location might have. Think about how well your location fits your goal of becoming a professional gardener. Certain climates will affect which plants are able to grow. Learn more about your climate zone at http://planthardiness.ars.usda.gov/PHZMWeb/#\n\nWeather and season will affect the amount you are able to work. Even though winter may present a challenge for gardeners, there are still some services you can offer such as pruning or fencing. If your location doesn't have a long growing season you may want to consider moving. Starting Your Own Gardening Business Think about the basics. Before you start your own gardening business you will need to consider some of the basics. Having a clear plan and core aspects decided upon will help you to start a successful gardening business and continue running it. You will likely want to have some form of insurance and it may even be a legal requirement. Having a good logo can help spread your business. Having a simple uniform can help you look professional and increase your business. Make it easy for your clients to contact you. Have a dedicated phone number and email for your business. Make sure you are operating legally. Obtain and file necessary forms, documents, and licenses. Get your equipment. If you are starting out on your own as a gardener you will need to supply your own equipment. Everything you need to do your best will have to be acquired and transported to any job sites that you work at. Make sure you have some of the following things prepared before you start your business:\nTransportation to carry you and your gear to job sites. Tools to work with. These might include pesticide applicators, digging tools, and fertilizers. Safety gear such as goggles, respirators, steel-toe boots, and gloves. Consider your customers. Your customers will be the ones supporting your gardening business. Since your customers will be such a critical part of your business you will need to consider what you are offering to them and make these offerings clear. You will also need to think about what type of clients you want to obtain. You may opt for a few large customers. Taking many smaller clients can also be a valid direction for your gardening business. Make your service offerings clear. For example, you might charge a flat rate for mowing a lawn but charge an hourly rate for landscaping. Finding Employment As A Gardener Try checking with your local government. Often times your local municipal government will offer positions for those with gardening skills. There may be local parks, cemeteries, or other such public areas that have need of a professional gardener. Working with your local government can be a great way to become a professional gardener and help beautify your community. Check with botanical and historical gardens. Both botanical and historical gardens will house a large and varied number of plants either for research or presentation. These gardens can be an excellent place for any gardener to work, practicing their skills and doing what they love. They may also offer a professionally challenging environment and allow you to develop your knowledge and skills as a gardener. Apply with nurseries or greenhouses. Most areas will have some kind of plant nursery or greenhouse that sell a large variety of plants. Due to the variety of plants these greenhouses offer,  they require the skills that a professional gardener can bring. Try searching with these nurseries and greenhouses to find a rewarding career as a gardener.",
    "sentences": [
        " Learning How To Garden Take courses.",
        "A great way to gain the skills and information needed to become a master gardener is to attended classes.",
        "Many such classes are available today and at varying levels of intensity.",
        "Find a course near you that you can attend and get started towards your goal of becoming a professional gardener.",
        "You can search on-line for courses at http://www.ahs.org/gardening-resources/master-gardeners\n\nCourse time will vary greatly between programs.",
        "Some are based on hourly requirements and others are based on weekly schedules.",
        "Generally you will be required to volunteer for a certain number of hours to finalize your certification as a master gardener.",
        "Recognize a good course.",
        "If you are taking a course or receiving any kind of training in gardening you will want to make sure it covers core concepts.",
        "Finding a course that offers these basic skills of gardening will help you to be at your best professionally.",
        "Review the following outline of what a good course should offer:\nPesticide use, safety, and alternative methods.",
        "Plant science and nutrition.",
        "How to recognize weeds and how best to control them.",
        "Disease, pest, and insect identification and management.",
        "Some form of certification.",
        "Volunteer to learn gardening skills.",
        "Volunteering is a great and inexpensive way to get hands-on training and experience with gardening.",
        "By volunteering you can learn some of the core skills that any gardener should possess and work towards you goal of becoming a professional.",
        "Consider your location.",
        "During either your training or professional life as a gardener you will want to consider you location when pursuing this career.",
        "Your location will dictate how often you practice gardening based on what climate and season that location might have.",
        "Think about how well your location fits your goal of becoming a professional gardener.",
        "Certain climates will affect which plants are able to grow.",
        "Learn more about your climate zone at http://planthardiness.ars.usda.gov/PHZMWeb/#\n\nWeather and season will affect the amount you are able to work.",
        "Even though winter may present a challenge for gardeners, there are still some services you can offer such as pruning or fencing.",
        "If your location doesn't have a long growing season you may want to consider moving.",
        "Starting Your Own Gardening Business Think about the basics.",
        "Before you start your own gardening business you will need to consider some of the basics.",
        "Having a clear plan and core aspects decided upon will help you to start a successful gardening business and continue running it.",
        "You will likely want to have some form of insurance and it may even be a legal requirement.",
        "Having a good logo can help spread your business.",
        "Having a simple uniform can help you look professional and increase your business.",
        "Make it easy for your clients to contact you.",
        "Have a dedicated phone number and email for your business.",
        "Make sure you are operating legally.",
        "Obtain and file necessary forms, documents, and licenses.",
        "Get your equipment.",
        "If you are starting out on your own as a gardener you will need to supply your own equipment.",
        "Everything you need to do your best will have to be acquired and transported to any job sites that you work at.",
        "Make sure you have some of the following things prepared before you start your business:\nTransportation to carry you and your gear to job sites.",
        "Tools to work with.",
        "These might include pesticide applicators, digging tools, and fertilizers.",
        "Safety gear such as goggles, respirators, steel-toe boots, and gloves.",
        "Consider your customers.",
        "Your customers will be the ones supporting your gardening business.",
        "Since your customers will be such a critical part of your business you will need to consider what you are offering to them and make these offerings clear.",
        "You will also need to think about what type of clients you want to obtain.",
        "You may opt for a few large customers.",
        "Taking many smaller clients can also be a valid direction for your gardening business.",
        "Make your service offerings clear.",
        "For example, you might charge a flat rate for mowing a lawn but charge an hourly rate for landscaping.",
        "Finding Employment As A Gardener Try checking with your local government.",
        "Often times your local municipal government will offer positions for those with gardening skills.",
        "There may be local parks, cemeteries, or other such public areas that have need of a professional gardener.",
        "Working with your local government can be a great way to become a professional gardener and help beautify your community.",
        "Check with botanical and historical gardens.",
        "Both botanical and historical gardens will house a large and varied number of plants either for research or presentation.",
        "These gardens can be an excellent place for any gardener to work, practicing their skills and doing what they love.",
        "They may also offer a professionally challenging environment and allow you to develop your knowledge and skills as a gardener.",
        "Apply with nurseries or greenhouses.",
        "Most areas will have some kind of plant nursery or greenhouse that sell a large variety of plants.",
        "Due to the variety of plants these greenhouses offer,  they require the skills that a professional gardener can bring.",
        "Try searching with these nurseries and greenhouses to find a rewarding career as a gardener."
    ]
}