{
    "title": "How to Apply Creme Eyeshadow",
    "url": "https://www.wikihow.com/Apply-Creme-Eyeshadow",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Makeup",
        "Eye Makeup",
        "Eye Shadow"
    ],
    "steps": [
        {
            "headline": "Choose an eyeshadow.",
            "description": "Crème eyeshadow can be difficult to apply. While you're getting the hang of it, stick to neutral or nude shades, so you can easily blend in mistakes. Avoid waterproof varieties until you've had some practice."
        },
        {
            "headline": "Check the eyeshadow for freshness.",
            "description": "Look on the base of the container for the expiration date. Don't use the eyeshadow if it's dried out, or if it's separated from the sides of the container."
        },
        {
            "headline": "Apply moisturizer and foundation (optional).",
            "description": "Clean your face if necessary. If you normally apply moisturizer and/or foundation before eyeshadow, follow the same routine for Crème eyeshadow. Oil-based moisturizer sometimes interferes with the eyeshadow."
        },
        {
            "headline": "Add eyeshadow primer (optional).",
            "description": "This will greatly reduce smudging. Once you're an experienced Crème user, you can skip this step, since the Crème will stick on its own. Let dry before you continue. If you don't have eyelid primer, a layer of powdered eyeshadow will work instead. Use the same color as the Crème shadow, in an equal or lighter shade."
        },
        {
            "headline": "Choose the right tools.",
            "description": "Clean fingertips spread Crème eyeshadow better than most tools. If you use an eyeshadow brush, make sure the bristles are synthetic. Natural fiber brushes soak up the product's moisture, which can prevent a smooth application and even ruin your brushes over time. A slightly dampened makeup sponge works okay, but it will absorb some of the makeup."
        },
        {
            "headline": "Rub the Crème eyeshadow on in a thin layer.",
            "description": "Apply in a sweeping motion, as though you were spreading butter. Work quickly, or the eyeshadow will dry onto your finger or brush. Keep your eyes closed for a few seconds afterward, while the eyeshadow dries. Apply additional layers for a more noticeable color. Let each one dry before you apply the next."
        },
        {
            "headline": "Blend the edges with clean fingers.",
            "description": "This will warm up the eyeshadow and help it blend seamlessly into the rest of your skin. Blend until there are no harsh edges or jagged lines."
        },
        {
            "headline": "Set with a layer of powder eyeshadow (optional).",
            "description": "If you have oily lids or are wearing this makeup for a long time, you my want to cover the Crème with powder eyeshadow of the same shade. This will make it last much longer, but you might lose the satiny appearance and some subtleties of color."
        },
        {
            "headline": "Finished.",
            "description": ""
        }
    ],
    "tyn": [
        "Crème eyeshadow",
        "Moisturizer ",
        "(optional)",
        "Foundation ",
        "Synthetic eyeshadow brush ",
        "Eyeshadow primer ",
        "or",
        " powder eyeshadow ",
        "Cotton swabs ",
        "(to remove mistakes)"
    ],
    "text": " Choose an eyeshadow. Crème eyeshadow can be difficult to apply. While you're getting the hang of it, stick to neutral or nude shades, so you can easily blend in mistakes. Avoid waterproof varieties until you've had some practice. Check the eyeshadow for freshness. Look on the base of the container for the expiration date. Don't use the eyeshadow if it's dried out, or if it's separated from the sides of the container. Apply moisturizer and foundation (optional). Clean your face if necessary. If you normally apply moisturizer and/or foundation before eyeshadow, follow the same routine for Crème eyeshadow. Oil-based moisturizer sometimes interferes with the eyeshadow. Add eyeshadow primer (optional). This will greatly reduce smudging. Once you're an experienced Crème user, you can skip this step, since the Crème will stick on its own. Let dry before you continue. If you don't have eyelid primer, a layer of powdered eyeshadow will work instead. Use the same color as the Crème shadow, in an equal or lighter shade. Choose the right tools. Clean fingertips spread Crème eyeshadow better than most tools. If you use an eyeshadow brush, make sure the bristles are synthetic. Natural fiber brushes soak up the product's moisture, which can prevent a smooth application and even ruin your brushes over time. A slightly dampened makeup sponge works okay, but it will absorb some of the makeup. Rub the Crème eyeshadow on in a thin layer. Apply in a sweeping motion, as though you were spreading butter. Work quickly, or the eyeshadow will dry onto your finger or brush. Keep your eyes closed for a few seconds afterward, while the eyeshadow dries. Apply additional layers for a more noticeable color. Let each one dry before you apply the next. Blend the edges with clean fingers. This will warm up the eyeshadow and help it blend seamlessly into the rest of your skin. Blend until there are no harsh edges or jagged lines. Set with a layer of powder eyeshadow (optional). If you have oily lids or are wearing this makeup for a long time, you my want to cover the Crème with powder eyeshadow of the same shade. This will make it last much longer, but you might lose the satiny appearance and some subtleties of color. Finished. ",
    "sentences": [
        " Choose an eyeshadow.",
        "Crème eyeshadow can be difficult to apply.",
        "While you're getting the hang of it, stick to neutral or nude shades, so you can easily blend in mistakes.",
        "Avoid waterproof varieties until you've had some practice.",
        "Check the eyeshadow for freshness.",
        "Look on the base of the container for the expiration date.",
        "Don't use the eyeshadow if it's dried out, or if it's separated from the sides of the container.",
        "Apply moisturizer and foundation (optional).",
        "Clean your face if necessary.",
        "If you normally apply moisturizer and/or foundation before eyeshadow, follow the same routine for Crème eyeshadow.",
        "Oil-based moisturizer sometimes interferes with the eyeshadow.",
        "Add eyeshadow primer (optional).",
        "This will greatly reduce smudging.",
        "Once you're an experienced Crème user, you can skip this step, since the Crème will stick on its own.",
        "Let dry before you continue.",
        "If you don't have eyelid primer, a layer of powdered eyeshadow will work instead.",
        "Use the same color as the Crème shadow, in an equal or lighter shade.",
        "Choose the right tools.",
        "Clean fingertips spread Crème eyeshadow better than most tools.",
        "If you use an eyeshadow brush, make sure the bristles are synthetic.",
        "Natural fiber brushes soak up the product's moisture, which can prevent a smooth application and even ruin your brushes over time.",
        "A slightly dampened makeup sponge works okay, but it will absorb some of the makeup.",
        "Rub the Crème eyeshadow on in a thin layer.",
        "Apply in a sweeping motion, as though you were spreading butter.",
        "Work quickly, or the eyeshadow will dry onto your finger or brush.",
        "Keep your eyes closed for a few seconds afterward, while the eyeshadow dries.",
        "Apply additional layers for a more noticeable color.",
        "Let each one dry before you apply the next.",
        "Blend the edges with clean fingers.",
        "This will warm up the eyeshadow and help it blend seamlessly into the rest of your skin.",
        "Blend until there are no harsh edges or jagged lines.",
        "Set with a layer of powder eyeshadow (optional).",
        "If you have oily lids or are wearing this makeup for a long time, you my want to cover the Crème with powder eyeshadow of the same shade.",
        "This will make it last much longer, but you might lose the satiny appearance and some subtleties of color.",
        "Finished."
    ]
}