{
    "title": "How to Make a Motorcycle Seat Pad",
    "url": "https://www.wikihow.com/Make-a-Motorcycle-Seat-Pad",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Motorcycles",
        "Motorcycle Accessories"
    ],
    "methods": [
        {
            "name": "Removing the Seat Cover",
            "steps": [
                {
                    "headline": "Take the seat off the motorcycle.",
                    "description": ""
                },
                {
                    "headline": "Remove the seat cover from the seat.",
                    "description": "Use a screwdriver to pull out the staples. You don't have to detach the front 4 inches (10 cm) or so of the seat cover."
                }
            ]
        },
        {
            "name": "Cutting Away Part of the Seat",
            "steps": [
                {
                    "headline": "Cut a piece of memory foam measuring 6 inches by 4 inches by 1 inch (15.25 cm by 10 cm by 2.5 cm).",
                    "description": ""
                },
                {
                    "headline": "Place the memory foam in the middle of the uncovered seat.",
                    "description": "The rear edge of the memory foam should touch the front of the hump where the seat slopes upward."
                },
                {
                    "headline": "Outline the memory foam onto the seat with a marker.",
                    "description": ""
                },
                {
                    "headline": "Lengthen the outline's front and back lines across the seat on 1 side.",
                    "description": "Using the marker and a ruler to keep the lines straight, extend the lines to the edge of the seat on 1 side."
                },
                {
                    "headline": "Use an electric knife to cut into the foam.",
                    "description": "Cut just inside the 2 lines you extended to the seat edge. Cut to a depth of 1 inch."
                },
                {
                    "headline": "Cut the outline's right and left lines with the electric knife.",
                    "description": "Cut to a depth of 1 inch. Remember to cut just inside the lines."
                },
                {
                    "headline": "Use the knife to cut out 2 sections of the seat.",
                    "description": "One section will conform to the measurements of the memory foam. The other, smaller section will measure approximately 4 inches by 1 inch (10 cm by 2.5 cm). One side of the smaller section will be narrower because it conforms to the angle of the seat edge. Switch off the electric knife and plunge it into the cut you made to the back of the outline. This is the extended line that touches where the seat's hump slopes upward. Turn the knife sideways so the serrated blade is horizontal and facing forward. Power on the electric knife and cut while gliding the knife forward until you reach the front line. This will excise the 2 sections of foam out of the seat."
                }
            ]
        },
        {
            "name": "Installing the Memory Foam Pad",
            "steps": [
                {
                    "headline": "Glue the smaller section of seat foam you just excised back into place.",
                    "description": "Apply spray adhesive onto the bottom and sides of the smaller section and into the hole where it was removed. Fit the smaller section back into place. This leaves a hole corresponding to the dimensions of the memory foam."
                },
                {
                    "headline": "Glue the memory foam into place using spray adhesive.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Re-attaching the Seat Cover",
            "steps": [
                {
                    "headline": "Stretch the motorcycle seat cover back into place.",
                    "description": ""
                },
                {
                    "headline": "Reattach the seat cover using a heavy-duty staple gun.",
                    "description": "Insert just enough staples to temporarily secure the cover. Check to see that the seat cover is correctly placed. If it isn't, take out some or all of the staples and reposition it. When the seat cover is correctly placed, shoot staples every 2 inches (5 cm) around the edge of the seat cover. Check once more to see if the seat cover is straight and tight. If it is, shoot in a staple every 1/2 to 1 inch (1.25 to 2.5 cm)."
                }
            ]
        }
    ],
    "tyn": [
        "Screwdriver",
        "Memory foam",
        "Marker",
        "Ruler",
        "Electric knife",
        "Spray adhesive",
        "Heavy-duty staple gun",
        "Staples"
    ],
    "text": " Removing the Seat Cover Take the seat off the motorcycle.  Remove the seat cover from the seat. Use a screwdriver to pull out the staples. You don't have to detach the front 4 inches (10 cm) or so of the seat cover. Cutting Away Part of the Seat Cut a piece of memory foam measuring 6 inches by 4 inches by 1 inch (15.25 cm by 10 cm by 2.5 cm).  Place the memory foam in the middle of the uncovered seat. The rear edge of the memory foam should touch the front of the hump where the seat slopes upward. Outline the memory foam onto the seat with a marker.  Lengthen the outline's front and back lines across the seat on 1 side. Using the marker and a ruler to keep the lines straight, extend the lines to the edge of the seat on 1 side. Use an electric knife to cut into the foam. Cut just inside the 2 lines you extended to the seat edge. Cut to a depth of 1 inch. Cut the outline's right and left lines with the electric knife. Cut to a depth of 1 inch. Remember to cut just inside the lines. Use the knife to cut out 2 sections of the seat. One section will conform to the measurements of the memory foam. The other, smaller section will measure approximately 4 inches by 1 inch (10 cm by 2.5 cm). One side of the smaller section will be narrower because it conforms to the angle of the seat edge. Switch off the electric knife and plunge it into the cut you made to the back of the outline. This is the extended line that touches where the seat's hump slopes upward. Turn the knife sideways so the serrated blade is horizontal and facing forward. Power on the electric knife and cut while gliding the knife forward until you reach the front line. This will excise the 2 sections of foam out of the seat. Installing the Memory Foam Pad Glue the smaller section of seat foam you just excised back into place. Apply spray adhesive onto the bottom and sides of the smaller section and into the hole where it was removed. Fit the smaller section back into place. This leaves a hole corresponding to the dimensions of the memory foam. Glue the memory foam into place using spray adhesive.  Re-attaching the Seat Cover Stretch the motorcycle seat cover back into place.  Reattach the seat cover using a heavy-duty staple gun. Insert just enough staples to temporarily secure the cover. Check to see that the seat cover is correctly placed. If it isn't, take out some or all of the staples and reposition it. When the seat cover is correctly placed, shoot staples every 2 inches (5 cm) around the edge of the seat cover. Check once more to see if the seat cover is straight and tight. If it is, shoot in a staple every 1/2 to 1 inch (1.25 to 2.5 cm).",
    "sentences": [
        " Removing the Seat Cover Take the seat off the motorcycle.",
        "Remove the seat cover from the seat.",
        "Use a screwdriver to pull out the staples.",
        "You don't have to detach the front 4 inches (10 cm) or so of the seat cover.",
        "Cutting Away Part of the Seat Cut a piece of memory foam measuring 6 inches by 4 inches by 1 inch (15.25 cm by 10 cm by 2.5 cm).",
        "Place the memory foam in the middle of the uncovered seat.",
        "The rear edge of the memory foam should touch the front of the hump where the seat slopes upward.",
        "Outline the memory foam onto the seat with a marker.",
        "Lengthen the outline's front and back lines across the seat on 1 side.",
        "Using the marker and a ruler to keep the lines straight, extend the lines to the edge of the seat on 1 side.",
        "Use an electric knife to cut into the foam.",
        "Cut just inside the 2 lines you extended to the seat edge.",
        "Cut to a depth of 1 inch.",
        "Cut the outline's right and left lines with the electric knife.",
        "Cut to a depth of 1 inch.",
        "Remember to cut just inside the lines.",
        "Use the knife to cut out 2 sections of the seat.",
        "One section will conform to the measurements of the memory foam.",
        "The other, smaller section will measure approximately 4 inches by 1 inch (10 cm by 2.5 cm).",
        "One side of the smaller section will be narrower because it conforms to the angle of the seat edge.",
        "Switch off the electric knife and plunge it into the cut you made to the back of the outline.",
        "This is the extended line that touches where the seat's hump slopes upward.",
        "Turn the knife sideways so the serrated blade is horizontal and facing forward.",
        "Power on the electric knife and cut while gliding the knife forward until you reach the front line.",
        "This will excise the 2 sections of foam out of the seat.",
        "Installing the Memory Foam Pad Glue the smaller section of seat foam you just excised back into place.",
        "Apply spray adhesive onto the bottom and sides of the smaller section and into the hole where it was removed.",
        "Fit the smaller section back into place.",
        "This leaves a hole corresponding to the dimensions of the memory foam.",
        "Glue the memory foam into place using spray adhesive.",
        "Re-attaching the Seat Cover Stretch the motorcycle seat cover back into place.",
        "Reattach the seat cover using a heavy-duty staple gun.",
        "Insert just enough staples to temporarily secure the cover.",
        "Check to see that the seat cover is correctly placed.",
        "If it isn't, take out some or all of the staples and reposition it.",
        "When the seat cover is correctly placed, shoot staples every 2 inches (5 cm) around the edge of the seat cover.",
        "Check once more to see if the seat cover is straight and tight.",
        "If it is, shoot in a staple every 1/2 to 1 inch (1.25 to 2.5 cm)."
    ]
}