{
    "title": "How to Protect a Convertible",
    "url": "https://www.wikihow.com/Protect-a-Convertible",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars"
    ],
    "methods": [
        {
            "name": "Cleaning Convertible Tops",
            "steps": [
                {
                    "headline": "Wash your convertible regularly.",
                    "description": "It is recommended that you clean your convertible top at least once every 4 weeks to keep dirt from sinking into the fabric or vinyl."
                },
                {
                    "headline": "Wet the top of the convertible with a hose.",
                    "description": "Use a gentle car shampoo or one made specifically for convertible tops, which can be found in any automotive or home improvement store. Apply the cleaner with a sponge as you would to the rest of your vehicle."
                },
                {
                    "headline": "Allow the cleaner to sit for 15 minutes for stubborn dirt or stains.",
                    "description": ""
                },
                {
                    "headline": "Scrub the top gently with a bristled brush",
                    "description": ""
                },
                {
                    "headline": "Rinse thoroughly with water..",
                    "description": ""
                }
            ]
        },
        {
            "name": "Protecting Cloth Tops",
            "steps": [
                {
                    "headline": "Begin with a top that is dry and free of dirt and debris.",
                    "description": ""
                },
                {
                    "headline": "Apply a fabric convertible-top protectant.",
                    "description": "Spray the product directly onto the vehicle from a distance of approximately 16-18 inches."
                },
                {
                    "headline": "Allow the top to dry completely.",
                    "description": ""
                },
                {
                    "headline": "Dry thoroughly with a clean, microfiber towel.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Protecting Vinyl Tops",
            "steps": [
                {
                    "headline": "Ensure your vinyl top is clean and dry.",
                    "description": ""
                },
                {
                    "headline": "Using sweeping motions, spray a vinyl convertible-top protectant at a distance of 8-12 inches from the top, or spray the product onto a clean, microfiber cloth and wipe the convertible top.",
                    "description": ""
                },
                {
                    "headline": "Wipe the top thoroughly with a fresh cloth until it's completely dry.",
                    "description": ""
                },
                {
                    "headline": "Repeat this process up to three times if dirt or stains remain.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Convertible-top cleaner",
        "Vinyl convertible-top protectant",
        "Fabric convertible-top protectant",
        "Microfiber cleaning cloths"
    ],
    "text": " Cleaning Convertible Tops Wash your convertible regularly. It is recommended that you clean your convertible top at least once every 4 weeks to keep dirt from sinking into the fabric or vinyl. Wet the top of the convertible with a hose. Use a gentle car shampoo or one made specifically for convertible tops, which can be found in any automotive or home improvement store. Apply the cleaner with a sponge as you would to the rest of your vehicle. Allow the cleaner to sit for 15 minutes for stubborn dirt or stains.  Scrub the top gently with a bristled brush  Rinse thoroughly with water..  Protecting Cloth Tops Begin with a top that is dry and free of dirt and debris.  Apply a fabric convertible-top protectant. Spray the product directly onto the vehicle from a distance of approximately 16-18 inches. Allow the top to dry completely.  Dry thoroughly with a clean, microfiber towel.  Protecting Vinyl Tops Ensure your vinyl top is clean and dry.  Using sweeping motions, spray a vinyl convertible-top protectant at a distance of 8-12 inches from the top, or spray the product onto a clean, microfiber cloth and wipe the convertible top.  Wipe the top thoroughly with a fresh cloth until it's completely dry.  Repeat this process up to three times if dirt or stains remain. ",
    "sentences": [
        " Cleaning Convertible Tops Wash your convertible regularly.",
        "It is recommended that you clean your convertible top at least once every 4 weeks to keep dirt from sinking into the fabric or vinyl.",
        "Wet the top of the convertible with a hose.",
        "Use a gentle car shampoo or one made specifically for convertible tops, which can be found in any automotive or home improvement store.",
        "Apply the cleaner with a sponge as you would to the rest of your vehicle.",
        "Allow the cleaner to sit for 15 minutes for stubborn dirt or stains.",
        "Scrub the top gently with a bristled brush  Rinse thoroughly with water..",
        "Protecting Cloth Tops Begin with a top that is dry and free of dirt and debris.",
        "Apply a fabric convertible-top protectant.",
        "Spray the product directly onto the vehicle from a distance of approximately 16-18 inches.",
        "Allow the top to dry completely.",
        "Dry thoroughly with a clean, microfiber towel.",
        "Protecting Vinyl Tops Ensure your vinyl top is clean and dry.",
        "Using sweeping motions, spray a vinyl convertible-top protectant at a distance of 8-12 inches from the top, or spray the product onto a clean, microfiber cloth and wipe the convertible top.",
        "Wipe the top thoroughly with a fresh cloth until it's completely dry.",
        "Repeat this process up to three times if dirt or stains remain."
    ]
}