{
    "title": "How to Paint Circles",
    "url": "https://www.wikihow.com/Paint-Circles",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "methods": [
        {
            "name": "Drawing Pencil Guidelines",
            "steps": [
                {
                    "headline": "Choose your graphite.",
                    "description": "A very light shade of graphite is ideal to prevent the marks from showing through your paint. This is especially important if you paint with watercolours or other thin paint, which requires a 6H pencil or an even paler option. It's okay to have faint pencil lines showing through watercolour, as long as they aren't too obvious. Some artists even use this intentionally, sketching in pencil then applying a very thin wash of paint over it."
                },
                {
                    "headline": "Draw a circle with a compass.",
                    "description": "Insert the pencil into a drawing compass. Place the compass point against the paper and carefully rotate the compass to draw a precise circle. Alternatively, place a circular object flat against the canvas and trace around it."
                },
                {
                    "headline": "Paint with the pencil marks as guidelines.",
                    "description": "Paint inside the pencil marks carefully, with a thin brush. If the pencil lines are dark enough to stand out, you can instead wash over the whole sketch, letting the pencil communicate the shape."
                }
            ]
        },
        {
            "name": "Using Objects and Stencils",
            "steps": [
                {
                    "headline": "Find a circular object the right size for your project.",
                    "description": "Items such as coffee cups, cereal bowls, and lids from coffee cans or oatmeal containers work well as circle patterns. If you can't find anything the right size, cut out your own paper circles using a compass and scissors."
                },
                {
                    "headline": "Dab the paint directly with the object.",
                    "description": "If you're using thick paint and want to go for a textured effect, dip the circular object directly in the paint and place it against the canvas. Using a glass rim allows you to paint a thin circular line, instead of a solid circle."
                },
                {
                    "headline": "Create a stencil instead.",
                    "description": "Place the object on a blank sheet of heavy-duty paper and trace around it. Cut this circle out carefully with a sharp pair of scissors, and you'll be left with a stencil. Alternatively, use a drawing compass to create a circle of any size."
                },
                {
                    "headline": "Make a piece of tape less sticky.",
                    "description": "This may sound strange, but a fresh piece of tape can damage your paper or canvas. First, stick a couple pieces of tape to a pair of jeans, then peel them off. Repeat several times until the tape is only barely sticky. Other fabric works as well, but jeans are best."
                },
                {
                    "headline": "Fasten the stencil to your artwork.",
                    "description": "Place the paper stencil over your artwork, so the circular hole is exactly where you want to paint. Fasten the stencil using the special pieces of tape."
                },
                {
                    "headline": "Paint inside the circle.",
                    "description": "Apply the paint with a large brush, using thin, even strokes and avoiding drips or spills. You may want to use a thinner brush for the outer rim of the circle. Before you move on, step back a few steps to get a better view. Touch up the circle if you want more even coverage or a different brush stroke pattern."
                },
                {
                    "headline": "Carefully remove the stencil.",
                    "description": "Slowly lift the tape to reduce the chance of tearing the tape or picking up paint. You can reuse this stencil, but you may need to prepare more \"special tape.\""
                }
            ]
        }
    ],
    "tyn": [
        "Painting Over a Stencil",
        "String",
        "Tape or a pushpin",
        "Scissors",
        "Pencil",
        "Paint",
        "Paintbrush or roller",
        "Painting inside a Pencil Outline",
        "Circular stencil",
        "Painter's tape",
        "Plates or cups, optional",
        "Stencil vinyl, optional",
        "Craft knife, optional"
    ],
    "text": " Drawing Pencil Guidelines Choose your graphite. A very light shade of graphite is ideal to prevent the marks from showing through your paint. This is especially important if you paint with watercolours or other thin paint, which requires a 6H pencil or an even paler option. It's okay to have faint pencil lines showing through watercolour, as long as they aren't too obvious. Some artists even use this intentionally, sketching in pencil then applying a very thin wash of paint over it. Draw a circle with a compass. Insert the pencil into a drawing compass. Place the compass point against the paper and carefully rotate the compass to draw a precise circle. Alternatively, place a circular object flat against the canvas and trace around it. Paint with the pencil marks as guidelines. Paint inside the pencil marks carefully, with a thin brush. If the pencil lines are dark enough to stand out, you can instead wash over the whole sketch, letting the pencil communicate the shape. Using Objects and Stencils Find a circular object the right size for your project. Items such as coffee cups, cereal bowls, and lids from coffee cans or oatmeal containers work well as circle patterns. If you can't find anything the right size, cut out your own paper circles using a compass and scissors. Dab the paint directly with the object. If you're using thick paint and want to go for a textured effect, dip the circular object directly in the paint and place it against the canvas. Using a glass rim allows you to paint a thin circular line, instead of a solid circle. Create a stencil instead. Place the object on a blank sheet of heavy-duty paper and trace around it. Cut this circle out carefully with a sharp pair of scissors, and you'll be left with a stencil. Alternatively, use a drawing compass to create a circle of any size. Make a piece of tape less sticky. This may sound strange, but a fresh piece of tape can damage your paper or canvas. First, stick a couple pieces of tape to a pair of jeans, then peel them off. Repeat several times until the tape is only barely sticky. Other fabric works as well, but jeans are best. Fasten the stencil to your artwork. Place the paper stencil over your artwork, so the circular hole is exactly where you want to paint. Fasten the stencil using the special pieces of tape. Paint inside the circle. Apply the paint with a large brush, using thin, even strokes and avoiding drips or spills. You may want to use a thinner brush for the outer rim of the circle. Before you move on, step back a few steps to get a better view. Touch up the circle if you want more even coverage or a different brush stroke pattern. Carefully remove the stencil. Slowly lift the tape to reduce the chance of tearing the tape or picking up paint. You can reuse this stencil, but you may need to prepare more \"special tape.\"",
    "sentences": [
        " Drawing Pencil Guidelines Choose your graphite.",
        "A very light shade of graphite is ideal to prevent the marks from showing through your paint.",
        "This is especially important if you paint with watercolours or other thin paint, which requires a 6H pencil or an even paler option.",
        "It's okay to have faint pencil lines showing through watercolour, as long as they aren't too obvious.",
        "Some artists even use this intentionally, sketching in pencil then applying a very thin wash of paint over it.",
        "Draw a circle with a compass.",
        "Insert the pencil into a drawing compass.",
        "Place the compass point against the paper and carefully rotate the compass to draw a precise circle.",
        "Alternatively, place a circular object flat against the canvas and trace around it.",
        "Paint with the pencil marks as guidelines.",
        "Paint inside the pencil marks carefully, with a thin brush.",
        "If the pencil lines are dark enough to stand out, you can instead wash over the whole sketch, letting the pencil communicate the shape.",
        "Using Objects and Stencils Find a circular object the right size for your project.",
        "Items such as coffee cups, cereal bowls, and lids from coffee cans or oatmeal containers work well as circle patterns.",
        "If you can't find anything the right size, cut out your own paper circles using a compass and scissors.",
        "Dab the paint directly with the object.",
        "If you're using thick paint and want to go for a textured effect, dip the circular object directly in the paint and place it against the canvas.",
        "Using a glass rim allows you to paint a thin circular line, instead of a solid circle.",
        "Create a stencil instead.",
        "Place the object on a blank sheet of heavy-duty paper and trace around it.",
        "Cut this circle out carefully with a sharp pair of scissors, and you'll be left with a stencil.",
        "Alternatively, use a drawing compass to create a circle of any size.",
        "Make a piece of tape less sticky.",
        "This may sound strange, but a fresh piece of tape can damage your paper or canvas.",
        "First, stick a couple pieces of tape to a pair of jeans, then peel them off.",
        "Repeat several times until the tape is only barely sticky.",
        "Other fabric works as well, but jeans are best.",
        "Fasten the stencil to your artwork.",
        "Place the paper stencil over your artwork, so the circular hole is exactly where you want to paint.",
        "Fasten the stencil using the special pieces of tape.",
        "Paint inside the circle.",
        "Apply the paint with a large brush, using thin, even strokes and avoiding drips or spills.",
        "You may want to use a thinner brush for the outer rim of the circle.",
        "Before you move on, step back a few steps to get a better view.",
        "Touch up the circle if you want more even coverage or a different brush stroke pattern.",
        "Carefully remove the stencil.",
        "Slowly lift the tape to reduce the chance of tearing the tape or picking up paint.",
        "You can reuse this stencil, but you may need to prepare more \"special tape.\""
    ]
}