{
    "title": "How to Install Dish Network Satellite TV Indoors",
    "url": "https://www.wikihow.com/Install-Dish-Network-Satellite-TV-Indoors",
    "category_hierarchy": [
        "Computers and Electronics",
        "Consumer Electronics",
        "Television",
        "Satellite Television"
    ],
    "steps": [
        {
            "headline": "Order your package.",
            "description": "First you have to place your order online or over the phone and get your DISH package. Before you do that - learn bit more about their pricing policy, plans, packages, contracts by reading latest information about their services."
        },
        {
            "headline": "Purchase a stand to hold your satellite dish.",
            "description": "You can buy dish stands from a satellite TV retailer."
        },
        {
            "headline": "Face the dish out a window in your apartment.",
            "description": "Try to use a window that has as few trees and other obstructions in its view. A south-facing window is the most ideal direction for Dish Network dishes. Make sure the dish is within 100 feet (30.48 m) of your TV."
        },
        {
            "headline": "Run a cable from your dish to your TV receiver.",
            "description": "You may have to drill holes in your walls and caulk them accordingly. Make sure there is no important piping, wiring, or other obstructions when making holes in the wall. You should ground the dish by wrapping some satellite wire on a screw on the dish stand. The other end of the wire should be run outside the residence and wrapped around some kind of metal object on the building. This will help prevent damage in the case of lightning storms."
        },
        {
            "headline": "Connect your receiver to the nearest phone jack.",
            "description": ""
        },
        {
            "headline": "Obtain signal strength coordinates.",
            "description": "You can access the signal strength menu on your TV to see the proper coordinates, including azimuth (direction), skew (rotation) and elevation (angle), for your location."
        },
        {
            "headline": "Position your dish for best possible signal reception.",
            "description": "Since your dish is inside behind a window, you won't have as much range as a dish that was mounted outside. You will need a compass to position your dish correctly and a friend to monitor your signal strength menu to achieve the best possible position."
        }
    ],
    "tyn": [
        "Satellite dish",
        "Satellite dish stand",
        "TV cables",
        "Satellite wire"
    ],
    "text": " Order your package. First you have to place your order online or over the phone and get your DISH package. Before you do that - learn bit more about their pricing policy, plans, packages, contracts by reading latest information about their services. Purchase a stand to hold your satellite dish. You can buy dish stands from a satellite TV retailer. Face the dish out a window in your apartment. Try to use a window that has as few trees and other obstructions in its view. A south-facing window is the most ideal direction for Dish Network dishes. Make sure the dish is within 100 feet (30.48 m) of your TV. Run a cable from your dish to your TV receiver. You may have to drill holes in your walls and caulk them accordingly. Make sure there is no important piping, wiring, or other obstructions when making holes in the wall. You should ground the dish by wrapping some satellite wire on a screw on the dish stand. The other end of the wire should be run outside the residence and wrapped around some kind of metal object on the building. This will help prevent damage in the case of lightning storms. Connect your receiver to the nearest phone jack.  Obtain signal strength coordinates. You can access the signal strength menu on your TV to see the proper coordinates, including azimuth (direction), skew (rotation) and elevation (angle), for your location. Position your dish for best possible signal reception. Since your dish is inside behind a window, you won't have as much range as a dish that was mounted outside. You will need a compass to position your dish correctly and a friend to monitor your signal strength menu to achieve the best possible position.",
    "sentences": [
        " Order your package.",
        "First you have to place your order online or over the phone and get your DISH package.",
        "Before you do that - learn bit more about their pricing policy, plans, packages, contracts by reading latest information about their services.",
        "Purchase a stand to hold your satellite dish.",
        "You can buy dish stands from a satellite TV retailer.",
        "Face the dish out a window in your apartment.",
        "Try to use a window that has as few trees and other obstructions in its view.",
        "A south-facing window is the most ideal direction for Dish Network dishes.",
        "Make sure the dish is within 100 feet (30.48 m) of your TV.",
        "Run a cable from your dish to your TV receiver.",
        "You may have to drill holes in your walls and caulk them accordingly.",
        "Make sure there is no important piping, wiring, or other obstructions when making holes in the wall.",
        "You should ground the dish by wrapping some satellite wire on a screw on the dish stand.",
        "The other end of the wire should be run outside the residence and wrapped around some kind of metal object on the building.",
        "This will help prevent damage in the case of lightning storms.",
        "Connect your receiver to the nearest phone jack.",
        "Obtain signal strength coordinates.",
        "You can access the signal strength menu on your TV to see the proper coordinates, including azimuth (direction), skew (rotation) and elevation (angle), for your location.",
        "Position your dish for best possible signal reception.",
        "Since your dish is inside behind a window, you won't have as much range as a dish that was mounted outside.",
        "You will need a compass to position your dish correctly and a friend to monitor your signal strength menu to achieve the best possible position."
    ]
}