{
    "title": "How to Ferment Apple Juice",
    "url": "https://www.wikihow.com/Ferment-Apple-Juice",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables",
        "Apples"
    ],
    "steps": [
        {
            "headline": "Choose apples to use for making the fresh cider.",
            "description": "You can use any type of apple and even use a combination of different apples. If you pick the apples right off the tree, let the apples age for 1 week."
        },
        {
            "headline": "Clean the apples under cool running water, washing them thoroughly.",
            "description": ""
        },
        {
            "headline": "Core the apples and quarter them.",
            "description": "Use an apple corer to make this process quicker and easier."
        },
        {
            "headline": "Place the apple quarters into a blender, food processor or food chopper and process until smooth.",
            "description": ""
        },
        {
            "headline": "Put the apple pulp into a porous fabric bag, such as a muslin sack or jelly bag, and squeeze out the juice into a bowl.",
            "description": "Pour the liquid into glass bottles using a funnel, for ease."
        },
        {
            "headline": "Fill the bottles to just below the rim and use a cotton plug.",
            "description": "A cotton plug will pop out if too much pressure builds during the fermentation process, whereas a regular cap could make the bottle explode. Pressure builds when the bubbles from the carbon dioxide in the apple juice rise to the top of the bottle."
        },
        {
            "headline": "Store the bottled juice at 72 degrees Fahrenheit (22 degrees Celsius) for 3 to 4 days.",
            "description": "Sediment will begin to form on the bottom of the bottles as a result of the fermentation process."
        },
        {
            "headline": "Strain the cider with a plastic strainer to separate the liquid and sediment.",
            "description": "Discard the sediment, as this is not palatable."
        },
        {
            "headline": "Pasteurize the fresh cider to prevent food born illnesses by heating it to 160 to 170 degrees Fahrenheit (71 to 77 degrees Celsius) in a stainless steel pot.",
            "description": "Skim the foam that forms on top due to the heat and discard."
        },
        {
            "headline": "Fill heated glass bottles with the pasteurized cider and refrigerate.",
            "description": "Drink the fresh cider within a week. Freeze the fresh cider in glass or plastic freezer containers for up to 1 year after cooling the liquid down in the refrigerator."
        },
        {
            "headline": "Finished.",
            "description": ""
        }
    ],
    "tyn": [
        "Apples",
        "Apple Corer",
        "Blender",
        "Porous Fabric Bag",
        "Glass Bottles",
        "Cotton Stoppers",
        "Funnel",
        "Strainer",
        "Stainless Steel Pot"
    ],
    "text": " Choose apples to use for making the fresh cider. You can use any type of apple and even use a combination of different apples. If you pick the apples right off the tree, let the apples age for 1 week. Clean the apples under cool running water, washing them thoroughly.  Core the apples and quarter them. Use an apple corer to make this process quicker and easier. Place the apple quarters into a blender, food processor or food chopper and process until smooth.  Put the apple pulp into a porous fabric bag, such as a muslin sack or jelly bag, and squeeze out the juice into a bowl. Pour the liquid into glass bottles using a funnel, for ease. Fill the bottles to just below the rim and use a cotton plug. A cotton plug will pop out if too much pressure builds during the fermentation process, whereas a regular cap could make the bottle explode. Pressure builds when the bubbles from the carbon dioxide in the apple juice rise to the top of the bottle. Store the bottled juice at 72 degrees Fahrenheit (22 degrees Celsius) for 3 to 4 days. Sediment will begin to form on the bottom of the bottles as a result of the fermentation process. Strain the cider with a plastic strainer to separate the liquid and sediment. Discard the sediment, as this is not palatable. Pasteurize the fresh cider to prevent food born illnesses by heating it to 160 to 170 degrees Fahrenheit (71 to 77 degrees Celsius) in a stainless steel pot. Skim the foam that forms on top due to the heat and discard. Fill heated glass bottles with the pasteurized cider and refrigerate. Drink the fresh cider within a week. Freeze the fresh cider in glass or plastic freezer containers for up to 1 year after cooling the liquid down in the refrigerator. Finished. ",
    "sentences": [
        " Choose apples to use for making the fresh cider.",
        "You can use any type of apple and even use a combination of different apples.",
        "If you pick the apples right off the tree, let the apples age for 1 week.",
        "Clean the apples under cool running water, washing them thoroughly.",
        "Core the apples and quarter them.",
        "Use an apple corer to make this process quicker and easier.",
        "Place the apple quarters into a blender, food processor or food chopper and process until smooth.",
        "Put the apple pulp into a porous fabric bag, such as a muslin sack or jelly bag, and squeeze out the juice into a bowl.",
        "Pour the liquid into glass bottles using a funnel, for ease.",
        "Fill the bottles to just below the rim and use a cotton plug.",
        "A cotton plug will pop out if too much pressure builds during the fermentation process, whereas a regular cap could make the bottle explode.",
        "Pressure builds when the bubbles from the carbon dioxide in the apple juice rise to the top of the bottle.",
        "Store the bottled juice at 72 degrees Fahrenheit (22 degrees Celsius) for 3 to 4 days.",
        "Sediment will begin to form on the bottom of the bottles as a result of the fermentation process.",
        "Strain the cider with a plastic strainer to separate the liquid and sediment.",
        "Discard the sediment, as this is not palatable.",
        "Pasteurize the fresh cider to prevent food born illnesses by heating it to 160 to 170 degrees Fahrenheit (71 to 77 degrees Celsius) in a stainless steel pot.",
        "Skim the foam that forms on top due to the heat and discard.",
        "Fill heated glass bottles with the pasteurized cider and refrigerate.",
        "Drink the fresh cider within a week.",
        "Freeze the fresh cider in glass or plastic freezer containers for up to 1 year after cooling the liquid down in the refrigerator.",
        "Finished."
    ]
}