{
    "title": "How to Catch Bluegill",
    "url": "https://www.wikihow.com/Catch-Bluegill",
    "category_hierarchy": [
        "Sports and Fitness",
        "Outdoor Recreation",
        "Fishing",
        "Catching Different Species of Fish"
    ],
    "parts": [
        {
            "name": "Choosing Your Rod and Bait",
            "steps": [
                {
                    "headline": "Use small bait and hooks.",
                    "description": "Bluegills typically have very small mouths, so you’ll need to use smaller bait and hooks. Crickets, worms, and grasshoppers make the best bait for bluegills. If you don’t want to use live bait, you can use small artificial lures like woolly worms or woolly buggers in brown, black, and yellow. Use a number 6 or smaller hook so that the bluegill can actually bite down on it."
                },
                {
                    "headline": "Purchase a lightweight rod with a high action.",
                    "description": "Action refers to the ability for the rod to bend and is usually listed in the product details or packaging of a rod. Purchase a lightweight composite, graphite, or carbon rod that can bend. A rod that's too stiff can generate too much power and can actually pull the hook out of the fish."
                },
                {
                    "headline": "Purchase a 2–6 pounds (0.91–2.72 kg) monofilament line.",
                    "description": "Light monofilament is typically cheaper than heavier lines and is lighter and harder to see, making it an ideal choice for bluegill. Heavier braided line isn't necessary for the small fish."
                },
                {
                    "headline": "Use a small reel.",
                    "description": "An ultra-light or small spinning reel will work in conjunction with the light line and lightweight rod. Search for a reel that can accommodate at least a 6 pounds (2.7 kg) monofilament line. Ultra-light reels only weight 7–10 ounces (200–280 g). Popular reel brands ultra-light reel models include the Abu Garcia Orra SX 10, Shimano Sedona 1000FD, and Quantum Kinetic PTi."
                },
                {
                    "headline": "Get a light-weight bobber.",
                    "description": "Bluegill don’t like to chase their prey, which is why using a bobber is a great setup to attract the fish. Bluegill will also let go of bait if the resistance is too high, so purchase a lightweight bobber appropriate for 6–8 pounds (2.7–3.6 kg) fish."
                }
            ]
        },
        {
            "name": "Finding Bluegill",
            "steps": [
                {
                    "headline": "Search for bluegill in deep waters during the late winter and early spring.",
                    "description": "When the temperature is 50–60 °F (10–16 °C), bluegill will seek deeper water for warmth. During these times, you’ll most likely have to fish for bluegill in deeper waters, towards the center of a lake or reservoir. You may need to fish off of a boat or dock instead of fishing off the side of a lake or river. When fishing for bluegill during these seasons, set your bobber 5–15 feet (1.5–4.6 m), so that you can fish in deeper waters."
                },
                {
                    "headline": "Look for bluegill in shallow waters during the late spring and summer.",
                    "description": "The late spring and summer are the best time to fish for bluegill. When the temperature reaches 69 °F (21 °C), bluegill will move to the shallower water. During this time, look for bluegill in 1–2.5 feet (0.30–0.76 m) waters, as they are most likely to congregate there. This time of year is also bluegill spawning season, which means that there's likely more active bluegill than other times of the year."
                },
                {
                    "headline": "Fish for bluegill near weedy areas during the late summer and fall.",
                    "description": "As the temperature goes down, bluegill will seek the shelter of weedy areas during the summer and fall. Fish for bluegill along the edges of these weedy areas to catch them. It may also help to fish mid-day instead of in the morning or evening because the temperature will be highest during these times."
                },
                {
                    "headline": "Revisit known spawning sites.",
                    "description": "Bluegill will congregate in schools and will reuse spawning sites year after year. If you are fishing in a lake or reservoir that you’re familiar with, you should revisit sites that you’ve had success with in the past. Bluegill spawn multiple times per season, so revisiting a site every couple weeks may be useful."
                }
            ]
        },
        {
            "name": "Fishing for Bluegill",
            "steps": [
                {
                    "headline": "Set up your line and hook on your rod.",
                    "description": "Attach the reel to the rod and pull your line through the loops on the bottom of the rod. Tie the end of your line to a hook. Spin the reel to make sure everything is working properly."
                },
                {
                    "headline": "Set a lightweight bobber 1–3 feet (0.30–0.91 m) from your hook.",
                    "description": "Press down on the hook on the bottom of the bobber to push out the hook on the top of the bobber. Wrap the line around the hook on the top of the bobber 1–3 feet (0.30–0.91 m) from the end of your line. Once the top is secure, press down on the top hook and wrap the line around the bottom of the bobber 2 times. When you release the hooks on the bobber, it should stay in place."
                },
                {
                    "headline": "Cast your rod.",
                    "description": "Press the release trigger and flick your rod in an upward motion to cast it out 10–20 feet (3.0–6.1 m) from where you are. You can fish from the shore, dock, or boat. If you’re fishing mid-spring to mid-summer, make sure that you’re fishing in shallow areas. You don’t need to cast your rod far to fish for bluegill."
                },
                {
                    "headline": "Pull up on your rod when you feel a nibble.",
                    "description": "Bluegill are small, so reeling them in shouldn't require a lot of power. To set the hook, pull up on the rod when you feel a tug on your line. If you feel multiple small tugs and your bait is gone, it means that the bluegill ate the bait around the hook and you most likely need to use a smaller lure or bait."
                },
                {
                    "headline": "Reel the fish in.",
                    "description": "Once the hook is set, pull up on the rod and rotate the reel to pull the fish in closer to you. Then, grab the handle of the rod with one hand and use your other hand to lift the rod at its center. Lift the end of the rod up and pull the bluegill out of the water."
                },
                {
                    "headline": "Pull the hook out of the fish’s mouth.",
                    "description": "Grab the fish by the bottom of its body and use your other hand to carefully extract the hook from the fish’s mouth. You can also use a pair of pliers to get the hook out if you prefer. Bluegill have very small teeth and their jaws are usually not strong enough to hurt anyone."
                },
                {
                    "headline": "Throw the fish back or store it in ice for later.",
                    "description": "If you want to eat the fish, you should keep bluegill that are at least 6–10 inches (150–250 mm) long. Store them immediately in a cooler with ice or they will go bad as you continue to fish. If you don’t want to eat the fish or they are too small to eat, throw them back into the water quickly so that they don’t die. Submerge the fish belly down in ice."
                }
            ]
        }
    ],
    "tyn": [
        "Small bait",
        "Lightweight rod",
        "Reel",
        "Bobber",
        "Hook",
        "2–4 pounds (0.91–1.81 kg) monofilament line"
    ],
    "text": " Choosing Your Rod and Bait Use small bait and hooks. Bluegills typically have very small mouths, so you’ll need to use smaller bait and hooks. Crickets, worms, and grasshoppers make the best bait for bluegills. If you don’t want to use live bait, you can use small artificial lures like woolly worms or woolly buggers in brown, black, and yellow. Use a number 6 or smaller hook so that the bluegill can actually bite down on it. Purchase a lightweight rod with a high action. Action refers to the ability for the rod to bend and is usually listed in the product details or packaging of a rod. Purchase a lightweight composite, graphite, or carbon rod that can bend. A rod that's too stiff can generate too much power and can actually pull the hook out of the fish. Purchase a 2–6 pounds (0.91–2.72 kg) monofilament line. Light monofilament is typically cheaper than heavier lines and is lighter and harder to see, making it an ideal choice for bluegill. Heavier braided line isn't necessary for the small fish. Use a small reel. An ultra-light or small spinning reel will work in conjunction with the light line and lightweight rod. Search for a reel that can accommodate at least a 6 pounds (2.7 kg) monofilament line. Ultra-light reels only weight 7–10 ounces (200–280 g). Popular reel brands ultra-light reel models include the Abu Garcia Orra SX 10, Shimano Sedona 1000FD, and Quantum Kinetic PTi. Get a light-weight bobber. Bluegill don’t like to chase their prey, which is why using a bobber is a great setup to attract the fish. Bluegill will also let go of bait if the resistance is too high, so purchase a lightweight bobber appropriate for 6–8 pounds (2.7–3.6 kg) fish. Finding Bluegill Search for bluegill in deep waters during the late winter and early spring. When the temperature is 50–60 °F (10–16 °C), bluegill will seek deeper water for warmth. During these times, you’ll most likely have to fish for bluegill in deeper waters, towards the center of a lake or reservoir. You may need to fish off of a boat or dock instead of fishing off the side of a lake or river. When fishing for bluegill during these seasons, set your bobber 5–15 feet (1.5–4.6 m), so that you can fish in deeper waters. Look for bluegill in shallow waters during the late spring and summer. The late spring and summer are the best time to fish for bluegill. When the temperature reaches 69 °F (21 °C), bluegill will move to the shallower water. During this time, look for bluegill in 1–2.5 feet (0.30–0.76 m) waters, as they are most likely to congregate there. This time of year is also bluegill spawning season, which means that there's likely more active bluegill than other times of the year. Fish for bluegill near weedy areas during the late summer and fall. As the temperature goes down, bluegill will seek the shelter of weedy areas during the summer and fall. Fish for bluegill along the edges of these weedy areas to catch them. It may also help to fish mid-day instead of in the morning or evening because the temperature will be highest during these times. Revisit known spawning sites. Bluegill will congregate in schools and will reuse spawning sites year after year. If you are fishing in a lake or reservoir that you’re familiar with, you should revisit sites that you’ve had success with in the past. Bluegill spawn multiple times per season, so revisiting a site every couple weeks may be useful. Fishing for Bluegill Set up your line and hook on your rod. Attach the reel to the rod and pull your line through the loops on the bottom of the rod. Tie the end of your line to a hook. Spin the reel to make sure everything is working properly. Set a lightweight bobber 1–3 feet (0.30–0.91 m) from your hook. Press down on the hook on the bottom of the bobber to push out the hook on the top of the bobber. Wrap the line around the hook on the top of the bobber 1–3 feet (0.30–0.91 m) from the end of your line. Once the top is secure, press down on the top hook and wrap the line around the bottom of the bobber 2 times. When you release the hooks on the bobber, it should stay in place. Cast your rod. Press the release trigger and flick your rod in an upward motion to cast it out 10–20 feet (3.0–6.1 m) from where you are. You can fish from the shore, dock, or boat. If you’re fishing mid-spring to mid-summer, make sure that you’re fishing in shallow areas. You don’t need to cast your rod far to fish for bluegill. Pull up on your rod when you feel a nibble. Bluegill are small, so reeling them in shouldn't require a lot of power. To set the hook, pull up on the rod when you feel a tug on your line. If you feel multiple small tugs and your bait is gone, it means that the bluegill ate the bait around the hook and you most likely need to use a smaller lure or bait. Reel the fish in. Once the hook is set, pull up on the rod and rotate the reel to pull the fish in closer to you. Then, grab the handle of the rod with one hand and use your other hand to lift the rod at its center. Lift the end of the rod up and pull the bluegill out of the water. Pull the hook out of the fish’s mouth. Grab the fish by the bottom of its body and use your other hand to carefully extract the hook from the fish’s mouth. You can also use a pair of pliers to get the hook out if you prefer. Bluegill have very small teeth and their jaws are usually not strong enough to hurt anyone. Throw the fish back or store it in ice for later. If you want to eat the fish, you should keep bluegill that are at least 6–10 inches (150–250 mm) long. Store them immediately in a cooler with ice or they will go bad as you continue to fish. If you don’t want to eat the fish or they are too small to eat, throw them back into the water quickly so that they don’t die. Submerge the fish belly down in ice.",
    "sentences": [
        " Choosing Your Rod and Bait Use small bait and hooks.",
        "Bluegills typically have very small mouths, so you’ll need to use smaller bait and hooks.",
        "Crickets, worms, and grasshoppers make the best bait for bluegills.",
        "If you don’t want to use live bait, you can use small artificial lures like woolly worms or woolly buggers in brown, black, and yellow.",
        "Use a number 6 or smaller hook so that the bluegill can actually bite down on it.",
        "Purchase a lightweight rod with a high action.",
        "Action refers to the ability for the rod to bend and is usually listed in the product details or packaging of a rod.",
        "Purchase a lightweight composite, graphite, or carbon rod that can bend.",
        "A rod that's too stiff can generate too much power and can actually pull the hook out of the fish.",
        "Purchase a 2–6 pounds (0.91–2.72 kg) monofilament line.",
        "Light monofilament is typically cheaper than heavier lines and is lighter and harder to see, making it an ideal choice for bluegill.",
        "Heavier braided line isn't necessary for the small fish.",
        "Use a small reel.",
        "An ultra-light or small spinning reel will work in conjunction with the light line and lightweight rod.",
        "Search for a reel that can accommodate at least a 6 pounds (2.7 kg) monofilament line.",
        "Ultra-light reels only weight 7–10 ounces (200–280 g).",
        "Popular reel brands ultra-light reel models include the Abu Garcia Orra SX 10, Shimano Sedona 1000FD, and Quantum Kinetic PTi.",
        "Get a light-weight bobber.",
        "Bluegill don’t like to chase their prey, which is why using a bobber is a great setup to attract the fish.",
        "Bluegill will also let go of bait if the resistance is too high, so purchase a lightweight bobber appropriate for 6–8 pounds (2.7–3.6 kg) fish.",
        "Finding Bluegill Search for bluegill in deep waters during the late winter and early spring.",
        "When the temperature is 50–60 °F (10–16 °C), bluegill will seek deeper water for warmth.",
        "During these times, you’ll most likely have to fish for bluegill in deeper waters, towards the center of a lake or reservoir.",
        "You may need to fish off of a boat or dock instead of fishing off the side of a lake or river.",
        "When fishing for bluegill during these seasons, set your bobber 5–15 feet (1.5–4.6 m), so that you can fish in deeper waters.",
        "Look for bluegill in shallow waters during the late spring and summer.",
        "The late spring and summer are the best time to fish for bluegill.",
        "When the temperature reaches 69 °F (21 °C), bluegill will move to the shallower water.",
        "During this time, look for bluegill in 1–2.5 feet (0.30–0.76 m) waters, as they are most likely to congregate there.",
        "This time of year is also bluegill spawning season, which means that there's likely more active bluegill than other times of the year.",
        "Fish for bluegill near weedy areas during the late summer and fall.",
        "As the temperature goes down, bluegill will seek the shelter of weedy areas during the summer and fall.",
        "Fish for bluegill along the edges of these weedy areas to catch them.",
        "It may also help to fish mid-day instead of in the morning or evening because the temperature will be highest during these times.",
        "Revisit known spawning sites.",
        "Bluegill will congregate in schools and will reuse spawning sites year after year.",
        "If you are fishing in a lake or reservoir that you’re familiar with, you should revisit sites that you’ve had success with in the past.",
        "Bluegill spawn multiple times per season, so revisiting a site every couple weeks may be useful.",
        "Fishing for Bluegill Set up your line and hook on your rod.",
        "Attach the reel to the rod and pull your line through the loops on the bottom of the rod.",
        "Tie the end of your line to a hook.",
        "Spin the reel to make sure everything is working properly.",
        "Set a lightweight bobber 1–3 feet (0.30–0.91 m) from your hook.",
        "Press down on the hook on the bottom of the bobber to push out the hook on the top of the bobber.",
        "Wrap the line around the hook on the top of the bobber 1–3 feet (0.30–0.91 m) from the end of your line.",
        "Once the top is secure, press down on the top hook and wrap the line around the bottom of the bobber 2 times.",
        "When you release the hooks on the bobber, it should stay in place.",
        "Cast your rod.",
        "Press the release trigger and flick your rod in an upward motion to cast it out 10–20 feet (3.0–6.1 m) from where you are.",
        "You can fish from the shore, dock, or boat.",
        "If you’re fishing mid-spring to mid-summer, make sure that you’re fishing in shallow areas.",
        "You don’t need to cast your rod far to fish for bluegill.",
        "Pull up on your rod when you feel a nibble.",
        "Bluegill are small, so reeling them in shouldn't require a lot of power.",
        "To set the hook, pull up on the rod when you feel a tug on your line.",
        "If you feel multiple small tugs and your bait is gone, it means that the bluegill ate the bait around the hook and you most likely need to use a smaller lure or bait.",
        "Reel the fish in.",
        "Once the hook is set, pull up on the rod and rotate the reel to pull the fish in closer to you.",
        "Then, grab the handle of the rod with one hand and use your other hand to lift the rod at its center.",
        "Lift the end of the rod up and pull the bluegill out of the water.",
        "Pull the hook out of the fish’s mouth.",
        "Grab the fish by the bottom of its body and use your other hand to carefully extract the hook from the fish’s mouth.",
        "You can also use a pair of pliers to get the hook out if you prefer.",
        "Bluegill have very small teeth and their jaws are usually not strong enough to hurt anyone.",
        "Throw the fish back or store it in ice for later.",
        "If you want to eat the fish, you should keep bluegill that are at least 6–10 inches (150–250 mm) long.",
        "Store them immediately in a cooler with ice or they will go bad as you continue to fish.",
        "If you don’t want to eat the fish or they are too small to eat, throw them back into the water quickly so that they don’t die.",
        "Submerge the fish belly down in ice."
    ]
}