{
    "title": "How to Make a Suspenseful Scene",
    "url": "https://www.wikihow.com/Make-a-Suspenseful-Scene",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Movies",
        "Filmmaking",
        "Making Thriller Films"
    ],
    "methods": [
        {
            "name": "Preparing Your Scene",
            "steps": [
                {
                    "headline": "Determine the big moment the scene is building up towards.",
                    "description": "The best way to create suspense is to work backward -- you know what needs to happen, so you need to build towards that moment with suspense, patience, and tension. A basic tenet of film suspense is the idea of tension and release. The audience is convinced something bad is going to happen, even if they don't know what, and the suspense comes from wanting and waiting for that release (or hoping to avoid it). Some common moments include:\nA difficult or impossible challenge -- see Game of Thrones, especially battle episodes like \"Hearthorn\" and \"Battle of the Bastards,\" which put characters up against long odds and then watches them to near death. An approaching villain or enemy. From every slasher movie ever made to the ridiculously intense No Country for Old Men, the cat-and-mouse chase scene is a classic suspense trope. A moment the audience understands but the characters don't. Known as dramatic irony, we naturally start to squirm when we know a character is making a mistake but are powerless to stop them. The classic Romeo and Juliet, where Romeo commits suicide because he thought Juliet had died (she was only faking), is one of the best examples."
                },
                {
                    "headline": "Figure out what is going to make your scene surprising or unique.",
                    "description": "This doesn't have to be huge, but a little originality goes a long way towards making a scene suspenseful. If the audience can predict what is going to happen, or has seen it before, the suspense is immediately sucked out. Remember, however, that even little things matter:\nStanley Kubrick made history with completely silent scenes of suspense in 2001: A Space Odyssey (among other tricks). Hitchcock's Psycho changed movie history forever by killing the lead actress first -- not last. The death scene itself wasn't revolutionary, but he masterfully subverted audience expectations to create shock and suspense. The Departed created suspense simply, but effectively, by showing both sides of the story. By making you see the cop's perspective and the mafia's, you understand before anyone else in the movie that everyone is royally screwed."
                },
                {
                    "headline": "Remember that suspense, in any scene, requires audience empathy.",
                    "description": "Otherwise said, the more the viewer can place themselves in the viewers shoes, the more suspenseful the scene will be. In many ways, this is the job of the rest of the movie -- creating believable characters and scenes so that you buy into the suspense without thinking. However, there are some big tips that you must remember to prevent ripping the viewer out of the scene:\n\nCharacters must make believable decisions. Everyone's seen the horror movie where the idiot \"hero\" walks out into the dark night to confront the villain and gets promptly cut down. When characters do things no real person would ever do, audiences tend to laugh. All characters need some personality. Again, look to slashers to see what not to do. When your characters have no backstory, goals, or personality, you couldn't care less what happens to them. The easiest way to do this is to give them a dream or goal in the scene -- something they are striving to (escape, victory, food, etc. ), so they are active participants, not just your next victims. Both success and failure must be plausible: If it is obvious the character is going to die or going to win, you lose all-important the suspense of wondering what happens next."
                },
                {
                    "headline": "Storyboard out the scene with pictures, text, and dialogue.",
                    "description": "When filming a suspenseful scene, you are rarely going to be able to shoot everything at once. Even if you do, you'll need a game plan before you get started -- a comic book-like version of the movie that lets you effectively plan each shot out. This is the time to test out all of the ideas in the steps above, \"shooting\" the scene before you even turn a camera on. Some filmmakers like to write out the scene in paragraph form first, as this is a good way to \"tell\" the story and figure out the pacing. You can print out free storyboard sheets online with a simple search. The more detailed this plan is, the better you will be when it comes time to shoot."
                }
            ]
        },
        {
            "name": "Filming a Suspenseful Scene",
            "steps": [
                {
                    "headline": "Set dramatic, moody lighting, but remember it is always easier to remove light while editing then add it.",
                    "description": "This rule holds for any scene, from suspense to romance, but it is extra important here since most directors want low-lighting in order to be dramatic. While editing, you can easily darken up a scene to make it more mysterious or suspenseful, but adding light will dramatically decrease picture quality. A good rule of thumb is to work with a wide range of lighting, using big, clear bright areas offset by dramatically dark shadows. Putting your camera into black and white mode is often the best way to check for well-lit scenes."
                },
                {
                    "headline": "Make the most of both the foreground and background.",
                    "description": "A good shot is like a photograph -- you could stop the movie and still see a compelling image. As such, the shots need depth, and this is doubly true in suspense filmmaking, where you can use the background to show things to the audience that the character might not notice. A woman washing dishes, followed by a shot of someone entering her house, is creepy. But a shot over the woman's shoulder as she washes, as a shadowy frame fills the doorway, is downright terrifying. This is where storyboarding ahead of time is your best friend. How can you compose each shot to have suspense -- not just the scene as a whole."
                },
                {
                    "headline": "Experiment with odd or dramatic camera angles to unsettle the audience.",
                    "description": "The most famous example of this is in Kubrick's The Shining, where he breaks the essential \"180-rule\" that claims that cameras shouldn't be on opposite sides of the room. Without knowing this rule, viewers were completely unsettled because it was unlike anything they'd ever seen. These subtle details separate the masters from the amateurs. Other ideas include:\n\nVoyeuristic shots, where the camera acts like a predator hunting prey. As an audience member, you understand someone is watching your hero without every showing the villain. Frequently, filtering the shot through tree leaves, blinds, etc. can help. Unnaturally low or high shots,  as well as extreme close-ups, don't feel like real life. They jar the viewer and keep them on edge. Hand-held camera work with shakes and unsteadiness, give a chaotic, uncomfortable feel, especially in moments of tension."
                },
                {
                    "headline": "Keep the camera rolling, and the actors in motion, both before and after the scene.",
                    "description": "Suspense requires silence, stillness, and moments of quiet, which build feelings of dread until the big moment happens. Don't just film the \"action\" of the scene -- make sure you get plenty of slower, creepier, and more atmospheric footage as well. You editor will thank you. Long shots naturally put viewers on edge, as we're used to relatively short cuts between each shot. The longer you hold the frame, the more people feel like there is something they are missing or is about to happen, building the coveted suspense."
                },
                {
                    "headline": "Slowly tease out your major scare of tension, saving the full reveal for last.",
                    "description": "No one is suspenseful after they know what happens -- you're only feeling nervous when waiting to see what is coming. Once you show your cards, you've moved away from suspense and into action -- an essential part of the movie or scene, but not just yet. The best suspense gives you little pieces and clues, knowing that the creature in the audience's imagination is far more terrifying than any you can show on screen."
                },
                {
                    "headline": "Mess around with changing lenses and angles.",
                    "description": "Another classic Hitchcock technique, the transition between a super shallow shot to a big wide-angle lens will keep interest and force the audience to suddenly scan the screen -- why the change? Am I missing something dangerous? Is something big about to happen? These subtle technical points will make your scene not just suspenseful, but artful, as well."
                },
                {
                    "headline": "Pepper in 1-2 \"false scares\" and close calls to ratchet up the tension.",
                    "description": "Just because the biggest scare or worry has to come last doesn't mean you need to be suspense-free until the final minute. Good suspense artists know that close calls pull you further up in your seat while also giving you a bit of hope for success. Without that balance of fear and hope, you can't get suspense, so be sure to \"pay off\" the viewer to keep them engaged. Ideas include:\nThe villain just missing his/her strike. Frequently, the hero doesn't know how close they got to dying yet. But the audience does, and it is terrifying. \"False scares,\" like when the viewer expects to see the villain, but it is just a stray cat popping out. Be careful about using too many of these, however, as they can feel easy and cheap very quickly if viewers never get real suspense. Cutting before the climactic action is often a good way to hide the villain or scare for later. It also makes the next time the characters visit that spot extra terrifying."
                }
            ]
        },
        {
            "name": "Editing for Maximum Suspense",
            "steps": [
                {
                    "headline": "Watch as many suspenseful scenes as you can get your hands on.",
                    "description": "Horror movies and thrillers need to be your homework, because editing is finally the place where you get to create the real suspense. You could spend years studying editing, but a quick master-class of your favorite movies will do. For each scene, pull out a notepad and write down:\nThe length of cuts. Do they use long, slow shots, short and quick cuts, or a combination of both? When do they use each? How long is the scene, and at what point does each key event happen. You'll be surprised how similar this is in many movies. What are the music and sound cues? When do they come in, rise, and fall away? What is the lighting like? How does color, tone, and brightness affect the mood of the scene?"
                },
                {
                    "headline": "Use the length of each shot to build, and then release, tension.",
                    "description": "Pay attention to the length of the cuts, and how the juxtapose against each other. While this rule isn't hard and fast, longer cuts tend to build dread and suspense, with shorter cuts breeding action, excitement, and confusion. This is a good way to play with tension and release -- a key to good suspense. Watch how some movies \"fake\" the release, making you expect a scare, but actually providing nothing terrible (like a cat jumping out). This puts your audience on edge without blowing the big scare. Remember -- suspense comes from worrying about what is going to happen next, or seeing what is happening and being unable to stop it. Note how your favorite movies build this horror. Check the climactic basement scene near the end of The Silence of the Lambs for a master course in long takes punctuated by quick bursts of action."
                },
                {
                    "headline": "Spend as much time on sound design as visual cuts.",
                    "description": "Sound is actually one of the best, if not the best, way to create tension and suspense. Why? Because it hints at things the viewer can't see, increasing worry, confusion, and dread. From floorboard creaks to the whistling of the wind, chirping crickets to sudden, heart-stopping silence, you can mine a lot more tension out of subtle sounds than most movie viewers ever realize. You can find thousands of free sound effects online with a quick search. For serious movies, consider paying for access to a professional sound bank. Silence is key to suspense, especially when broken by a nerve-clenching noise like a sharpening blade, slowly opening door, or sudden breath or whisper."
                },
                {
                    "headline": "Cue up the suspenseful music, letting it build slowly throughout the scene.",
                    "description": "You can find hundreds of copyright-free suspense songs on the internet, generally using violins, piano, and ambient noises to build quiet dread. When using music, try to be sparing -- you want your scares to come from visual and sound design, using the music as a final touch to pull it together. Keep it in the background, barely perceptible, to subtly impact your audience without pulling their attention from the scene. No Country for Old Men famously used no music at all, which created its own unique, silent suspense."
                }
            ]
        }
    ],
    "tyn": [
        "Actors",
        "Scene location",
        "Film crew",
        "Audio/Video equipment",
        "Lighting",
        "Script, extra screenplays, and storyboard"
    ],
    "text": " Preparing Your Scene Determine the big moment the scene is building up towards. The best way to create suspense is to work backward -- you know what needs to happen, so you need to build towards that moment with suspense, patience, and tension. A basic tenet of film suspense is the idea of tension and release. The audience is convinced something bad is going to happen, even if they don't know what, and the suspense comes from wanting and waiting for that release (or hoping to avoid it). Some common moments include:\nA difficult or impossible challenge -- see Game of Thrones, especially battle episodes like \"Hearthorn\" and \"Battle of the Bastards,\" which put characters up against long odds and then watches them to near death. An approaching villain or enemy. From every slasher movie ever made to the ridiculously intense No Country for Old Men, the cat-and-mouse chase scene is a classic suspense trope. A moment the audience understands but the characters don't. Known as dramatic irony, we naturally start to squirm when we know a character is making a mistake but are powerless to stop them. The classic Romeo and Juliet, where Romeo commits suicide because he thought Juliet had died (she was only faking), is one of the best examples. Figure out what is going to make your scene surprising or unique. This doesn't have to be huge, but a little originality goes a long way towards making a scene suspenseful. If the audience can predict what is going to happen, or has seen it before, the suspense is immediately sucked out. Remember, however, that even little things matter:\nStanley Kubrick made history with completely silent scenes of suspense in 2001: A Space Odyssey (among other tricks). Hitchcock's Psycho changed movie history forever by killing the lead actress first -- not last. The death scene itself wasn't revolutionary, but he masterfully subverted audience expectations to create shock and suspense. The Departed created suspense simply, but effectively, by showing both sides of the story. By making you see the cop's perspective and the mafia's, you understand before anyone else in the movie that everyone is royally screwed. Remember that suspense, in any scene, requires audience empathy. Otherwise said, the more the viewer can place themselves in the viewers shoes, the more suspenseful the scene will be. In many ways, this is the job of the rest of the movie -- creating believable characters and scenes so that you buy into the suspense without thinking. However, there are some big tips that you must remember to prevent ripping the viewer out of the scene:\n\nCharacters must make believable decisions. Everyone's seen the horror movie where the idiot \"hero\" walks out into the dark night to confront the villain and gets promptly cut down. When characters do things no real person would ever do, audiences tend to laugh. All characters need some personality. Again, look to slashers to see what not to do. When your characters have no backstory, goals, or personality, you couldn't care less what happens to them. The easiest way to do this is to give them a dream or goal in the scene -- something they are striving to (escape, victory, food, etc. ), so they are active participants, not just your next victims. Both success and failure must be plausible: If it is obvious the character is going to die or going to win, you lose all-important the suspense of wondering what happens next. Storyboard out the scene with pictures, text, and dialogue. When filming a suspenseful scene, you are rarely going to be able to shoot everything at once. Even if you do, you'll need a game plan before you get started -- a comic book-like version of the movie that lets you effectively plan each shot out. This is the time to test out all of the ideas in the steps above, \"shooting\" the scene before you even turn a camera on. Some filmmakers like to write out the scene in paragraph form first, as this is a good way to \"tell\" the story and figure out the pacing. You can print out free storyboard sheets online with a simple search. The more detailed this plan is, the better you will be when it comes time to shoot. Filming a Suspenseful Scene Set dramatic, moody lighting, but remember it is always easier to remove light while editing then add it. This rule holds for any scene, from suspense to romance, but it is extra important here since most directors want low-lighting in order to be dramatic. While editing, you can easily darken up a scene to make it more mysterious or suspenseful, but adding light will dramatically decrease picture quality. A good rule of thumb is to work with a wide range of lighting, using big, clear bright areas offset by dramatically dark shadows. Putting your camera into black and white mode is often the best way to check for well-lit scenes. Make the most of both the foreground and background. A good shot is like a photograph -- you could stop the movie and still see a compelling image. As such, the shots need depth, and this is doubly true in suspense filmmaking, where you can use the background to show things to the audience that the character might not notice. A woman washing dishes, followed by a shot of someone entering her house, is creepy. But a shot over the woman's shoulder as she washes, as a shadowy frame fills the doorway, is downright terrifying. This is where storyboarding ahead of time is your best friend. How can you compose each shot to have suspense -- not just the scene as a whole. Experiment with odd or dramatic camera angles to unsettle the audience. The most famous example of this is in Kubrick's The Shining, where he breaks the essential \"180-rule\" that claims that cameras shouldn't be on opposite sides of the room. Without knowing this rule, viewers were completely unsettled because it was unlike anything they'd ever seen. These subtle details separate the masters from the amateurs. Other ideas include:\n\nVoyeuristic shots, where the camera acts like a predator hunting prey. As an audience member, you understand someone is watching your hero without every showing the villain. Frequently, filtering the shot through tree leaves, blinds, etc. can help. Unnaturally low or high shots,  as well as extreme close-ups, don't feel like real life. They jar the viewer and keep them on edge. Hand-held camera work with shakes and unsteadiness, give a chaotic, uncomfortable feel, especially in moments of tension. Keep the camera rolling, and the actors in motion, both before and after the scene. Suspense requires silence, stillness, and moments of quiet, which build feelings of dread until the big moment happens. Don't just film the \"action\" of the scene -- make sure you get plenty of slower, creepier, and more atmospheric footage as well. You editor will thank you. Long shots naturally put viewers on edge, as we're used to relatively short cuts between each shot. The longer you hold the frame, the more people feel like there is something they are missing or is about to happen, building the coveted suspense. Slowly tease out your major scare of tension, saving the full reveal for last. No one is suspenseful after they know what happens -- you're only feeling nervous when waiting to see what is coming. Once you show your cards, you've moved away from suspense and into action -- an essential part of the movie or scene, but not just yet. The best suspense gives you little pieces and clues, knowing that the creature in the audience's imagination is far more terrifying than any you can show on screen. Mess around with changing lenses and angles. Another classic Hitchcock technique, the transition between a super shallow shot to a big wide-angle lens will keep interest and force the audience to suddenly scan the screen -- why the change? Am I missing something dangerous? Is something big about to happen? These subtle technical points will make your scene not just suspenseful, but artful, as well. Pepper in 1-2 \"false scares\" and close calls to ratchet up the tension. Just because the biggest scare or worry has to come last doesn't mean you need to be suspense-free until the final minute. Good suspense artists know that close calls pull you further up in your seat while also giving you a bit of hope for success. Without that balance of fear and hope, you can't get suspense, so be sure to \"pay off\" the viewer to keep them engaged. Ideas include:\nThe villain just missing his/her strike. Frequently, the hero doesn't know how close they got to dying yet. But the audience does, and it is terrifying. \"False scares,\" like when the viewer expects to see the villain, but it is just a stray cat popping out. Be careful about using too many of these, however, as they can feel easy and cheap very quickly if viewers never get real suspense. Cutting before the climactic action is often a good way to hide the villain or scare for later. It also makes the next time the characters visit that spot extra terrifying. Editing for Maximum Suspense Watch as many suspenseful scenes as you can get your hands on. Horror movies and thrillers need to be your homework, because editing is finally the place where you get to create the real suspense. You could spend years studying editing, but a quick master-class of your favorite movies will do. For each scene, pull out a notepad and write down:\nThe length of cuts. Do they use long, slow shots, short and quick cuts, or a combination of both? When do they use each? How long is the scene, and at what point does each key event happen. You'll be surprised how similar this is in many movies. What are the music and sound cues? When do they come in, rise, and fall away? What is the lighting like? How does color, tone, and brightness affect the mood of the scene? Use the length of each shot to build, and then release, tension. Pay attention to the length of the cuts, and how the juxtapose against each other. While this rule isn't hard and fast, longer cuts tend to build dread and suspense, with shorter cuts breeding action, excitement, and confusion. This is a good way to play with tension and release -- a key to good suspense. Watch how some movies \"fake\" the release, making you expect a scare, but actually providing nothing terrible (like a cat jumping out). This puts your audience on edge without blowing the big scare. Remember -- suspense comes from worrying about what is going to happen next, or seeing what is happening and being unable to stop it. Note how your favorite movies build this horror. Check the climactic basement scene near the end of The Silence of the Lambs for a master course in long takes punctuated by quick bursts of action. Spend as much time on sound design as visual cuts. Sound is actually one of the best, if not the best, way to create tension and suspense. Why? Because it hints at things the viewer can't see, increasing worry, confusion, and dread. From floorboard creaks to the whistling of the wind, chirping crickets to sudden, heart-stopping silence, you can mine a lot more tension out of subtle sounds than most movie viewers ever realize. You can find thousands of free sound effects online with a quick search. For serious movies, consider paying for access to a professional sound bank. Silence is key to suspense, especially when broken by a nerve-clenching noise like a sharpening blade, slowly opening door, or sudden breath or whisper. Cue up the suspenseful music, letting it build slowly throughout the scene. You can find hundreds of copyright-free suspense songs on the internet, generally using violins, piano, and ambient noises to build quiet dread. When using music, try to be sparing -- you want your scares to come from visual and sound design, using the music as a final touch to pull it together. Keep it in the background, barely perceptible, to subtly impact your audience without pulling their attention from the scene. No Country for Old Men famously used no music at all, which created its own unique, silent suspense.",
    "sentences": [
        " Preparing Your Scene Determine the big moment the scene is building up towards.",
        "The best way to create suspense is to work backward -- you know what needs to happen, so you need to build towards that moment with suspense, patience, and tension.",
        "A basic tenet of film suspense is the idea of tension and release.",
        "The audience is convinced something bad is going to happen, even if they don't know what, and the suspense comes from wanting and waiting for that release (or hoping to avoid it).",
        "Some common moments include:\nA difficult or impossible challenge -- see Game of Thrones, especially battle episodes like \"Hearthorn\" and \"Battle of the Bastards,\" which put characters up against long odds and then watches them to near death.",
        "An approaching villain or enemy.",
        "From every slasher movie ever made to the ridiculously intense No Country for Old Men, the cat-and-mouse chase scene is a classic suspense trope.",
        "A moment the audience understands but the characters don't.",
        "Known as dramatic irony, we naturally start to squirm when we know a character is making a mistake but are powerless to stop them.",
        "The classic Romeo and Juliet, where Romeo commits suicide because he thought Juliet had died (she was only faking), is one of the best examples.",
        "Figure out what is going to make your scene surprising or unique.",
        "This doesn't have to be huge, but a little originality goes a long way towards making a scene suspenseful.",
        "If the audience can predict what is going to happen, or has seen it before, the suspense is immediately sucked out.",
        "Remember, however, that even little things matter:\nStanley Kubrick made history with completely silent scenes of suspense in 2001: A Space Odyssey (among other tricks).",
        "Hitchcock's Psycho changed movie history forever by killing the lead actress first -- not last.",
        "The death scene itself wasn't revolutionary, but he masterfully subverted audience expectations to create shock and suspense.",
        "The Departed created suspense simply, but effectively, by showing both sides of the story.",
        "By making you see the cop's perspective and the mafia's, you understand before anyone else in the movie that everyone is royally screwed.",
        "Remember that suspense, in any scene, requires audience empathy.",
        "Otherwise said, the more the viewer can place themselves in the viewers shoes, the more suspenseful the scene will be.",
        "In many ways, this is the job of the rest of the movie -- creating believable characters and scenes so that you buy into the suspense without thinking.",
        "However, there are some big tips that you must remember to prevent ripping the viewer out of the scene:\n\nCharacters must make believable decisions.",
        "Everyone's seen the horror movie where the idiot \"hero\" walks out into the dark night to confront the villain and gets promptly cut down.",
        "When characters do things no real person would ever do, audiences tend to laugh.",
        "All characters need some personality.",
        "Again, look to slashers to see what not to do.",
        "When your characters have no backstory, goals, or personality, you couldn't care less what happens to them.",
        "The easiest way to do this is to give them a dream or goal in the scene -- something they are striving to (escape, victory, food, etc.",
        "), so they are active participants, not just your next victims.",
        "Both success and failure must be plausible: If it is obvious the character is going to die or going to win, you lose all-important the suspense of wondering what happens next.",
        "Storyboard out the scene with pictures, text, and dialogue.",
        "When filming a suspenseful scene, you are rarely going to be able to shoot everything at once.",
        "Even if you do, you'll need a game plan before you get started -- a comic book-like version of the movie that lets you effectively plan each shot out.",
        "This is the time to test out all of the ideas in the steps above, \"shooting\" the scene before you even turn a camera on.",
        "Some filmmakers like to write out the scene in paragraph form first, as this is a good way to \"tell\" the story and figure out the pacing.",
        "You can print out free storyboard sheets online with a simple search.",
        "The more detailed this plan is, the better you will be when it comes time to shoot.",
        "Filming a Suspenseful Scene Set dramatic, moody lighting, but remember it is always easier to remove light while editing then add it.",
        "This rule holds for any scene, from suspense to romance, but it is extra important here since most directors want low-lighting in order to be dramatic.",
        "While editing, you can easily darken up a scene to make it more mysterious or suspenseful, but adding light will dramatically decrease picture quality.",
        "A good rule of thumb is to work with a wide range of lighting, using big, clear bright areas offset by dramatically dark shadows.",
        "Putting your camera into black and white mode is often the best way to check for well-lit scenes.",
        "Make the most of both the foreground and background.",
        "A good shot is like a photograph -- you could stop the movie and still see a compelling image.",
        "As such, the shots need depth, and this is doubly true in suspense filmmaking, where you can use the background to show things to the audience that the character might not notice.",
        "A woman washing dishes, followed by a shot of someone entering her house, is creepy.",
        "But a shot over the woman's shoulder as she washes, as a shadowy frame fills the doorway, is downright terrifying.",
        "This is where storyboarding ahead of time is your best friend.",
        "How can you compose each shot to have suspense -- not just the scene as a whole.",
        "Experiment with odd or dramatic camera angles to unsettle the audience.",
        "The most famous example of this is in Kubrick's The Shining, where he breaks the essential \"180-rule\" that claims that cameras shouldn't be on opposite sides of the room.",
        "Without knowing this rule, viewers were completely unsettled because it was unlike anything they'd ever seen.",
        "These subtle details separate the masters from the amateurs.",
        "Other ideas include:\n\nVoyeuristic shots, where the camera acts like a predator hunting prey.",
        "As an audience member, you understand someone is watching your hero without every showing the villain.",
        "Frequently, filtering the shot through tree leaves, blinds, etc.",
        "can help.",
        "Unnaturally low or high shots,  as well as extreme close-ups, don't feel like real life.",
        "They jar the viewer and keep them on edge.",
        "Hand-held camera work with shakes and unsteadiness, give a chaotic, uncomfortable feel, especially in moments of tension.",
        "Keep the camera rolling, and the actors in motion, both before and after the scene.",
        "Suspense requires silence, stillness, and moments of quiet, which build feelings of dread until the big moment happens.",
        "Don't just film the \"action\" of the scene -- make sure you get plenty of slower, creepier, and more atmospheric footage as well.",
        "You editor will thank you.",
        "Long shots naturally put viewers on edge, as we're used to relatively short cuts between each shot.",
        "The longer you hold the frame, the more people feel like there is something they are missing or is about to happen, building the coveted suspense.",
        "Slowly tease out your major scare of tension, saving the full reveal for last.",
        "No one is suspenseful after they know what happens -- you're only feeling nervous when waiting to see what is coming.",
        "Once you show your cards, you've moved away from suspense and into action -- an essential part of the movie or scene, but not just yet.",
        "The best suspense gives you little pieces and clues, knowing that the creature in the audience's imagination is far more terrifying than any you can show on screen.",
        "Mess around with changing lenses and angles.",
        "Another classic Hitchcock technique, the transition between a super shallow shot to a big wide-angle lens will keep interest and force the audience to suddenly scan the screen -- why the change?",
        "Am I missing something dangerous?",
        "Is something big about to happen?",
        "These subtle technical points will make your scene not just suspenseful, but artful, as well.",
        "Pepper in 1-2 \"false scares\" and close calls to ratchet up the tension.",
        "Just because the biggest scare or worry has to come last doesn't mean you need to be suspense-free until the final minute.",
        "Good suspense artists know that close calls pull you further up in your seat while also giving you a bit of hope for success.",
        "Without that balance of fear and hope, you can't get suspense, so be sure to \"pay off\" the viewer to keep them engaged.",
        "Ideas include:\nThe villain just missing his/her strike.",
        "Frequently, the hero doesn't know how close they got to dying yet.",
        "But the audience does, and it is terrifying.",
        "\"False scares,\" like when the viewer expects to see the villain, but it is just a stray cat popping out.",
        "Be careful about using too many of these, however, as they can feel easy and cheap very quickly if viewers never get real suspense.",
        "Cutting before the climactic action is often a good way to hide the villain or scare for later.",
        "It also makes the next time the characters visit that spot extra terrifying.",
        "Editing for Maximum Suspense Watch as many suspenseful scenes as you can get your hands on.",
        "Horror movies and thrillers need to be your homework, because editing is finally the place where you get to create the real suspense.",
        "You could spend years studying editing, but a quick master-class of your favorite movies will do.",
        "For each scene, pull out a notepad and write down:\nThe length of cuts.",
        "Do they use long, slow shots, short and quick cuts, or a combination of both?",
        "When do they use each?",
        "How long is the scene, and at what point does each key event happen.",
        "You'll be surprised how similar this is in many movies.",
        "What are the music and sound cues?",
        "When do they come in, rise, and fall away?",
        "What is the lighting like?",
        "How does color, tone, and brightness affect the mood of the scene?",
        "Use the length of each shot to build, and then release, tension.",
        "Pay attention to the length of the cuts, and how the juxtapose against each other.",
        "While this rule isn't hard and fast, longer cuts tend to build dread and suspense, with shorter cuts breeding action, excitement, and confusion.",
        "This is a good way to play with tension and release -- a key to good suspense.",
        "Watch how some movies \"fake\" the release, making you expect a scare, but actually providing nothing terrible (like a cat jumping out).",
        "This puts your audience on edge without blowing the big scare.",
        "Remember -- suspense comes from worrying about what is going to happen next, or seeing what is happening and being unable to stop it.",
        "Note how your favorite movies build this horror.",
        "Check the climactic basement scene near the end of The Silence of the Lambs for a master course in long takes punctuated by quick bursts of action.",
        "Spend as much time on sound design as visual cuts.",
        "Sound is actually one of the best, if not the best, way to create tension and suspense.",
        "Why?",
        "Because it hints at things the viewer can't see, increasing worry, confusion, and dread.",
        "From floorboard creaks to the whistling of the wind, chirping crickets to sudden, heart-stopping silence, you can mine a lot more tension out of subtle sounds than most movie viewers ever realize.",
        "You can find thousands of free sound effects online with a quick search.",
        "For serious movies, consider paying for access to a professional sound bank.",
        "Silence is key to suspense, especially when broken by a nerve-clenching noise like a sharpening blade, slowly opening door, or sudden breath or whisper.",
        "Cue up the suspenseful music, letting it build slowly throughout the scene.",
        "You can find hundreds of copyright-free suspense songs on the internet, generally using violins, piano, and ambient noises to build quiet dread.",
        "When using music, try to be sparing -- you want your scares to come from visual and sound design, using the music as a final touch to pull it together.",
        "Keep it in the background, barely perceptible, to subtly impact your audience without pulling their attention from the scene.",
        "No Country for Old Men famously used no music at all, which created its own unique, silent suspense."
    ]
}