{
    "title": "How to Create a New Prezi Presentation",
    "url": "https://www.wikihow.com/Create-a-New-Prezi-Presentation",
    "category_hierarchy": [
        "Computers and Electronics",
        "Software",
        "Office"
    ],
    "methods": [
        {
            "name": "Creating a New Presentation with a Template",
            "steps": [
                {
                    "headline": "Go to the prezi page.",
                    "description": "Once there, log in using the email and password associated with your Prezi.com account to access your account's dashboard."
                },
                {
                    "headline": "Click the Create from template button in the upper left corner of the page.",
                    "description": "This will direct you to a new page with different presentation templates."
                },
                {
                    "headline": "Select the template you want to use.",
                    "description": "Click on the template to see a preview of it."
                },
                {
                    "headline": "Click Use this template.",
                    "description": "This appears as a blue button beneath the template preview."
                },
                {
                    "headline": "Edit your presentation.",
                    "description": "Once you've selected a template, your presentation will open in a new window displaying the presentation editor."
                },
                {
                    "headline": "Enter a title and description for your new Prezi.",
                    "description": "Once you have your new presentation set up, you can title it and add a description."
                }
            ]
        },
        {
            "name": "Creating a New Presentation with Converted PowerPoint Slides",
            "steps": [
                {
                    "headline": "Go to the prezi page.",
                    "description": "Once there, log in using the email and password associated with your Prezi.com account to access your account's dashboard."
                },
                {
                    "headline": "Click the Convert PowerPoint button in the upper-left corner of the page.",
                    "description": "This will direct you to a new menu where you can select a PowerPoint file to be converted into a Prezi presentation."
                },
                {
                    "headline": "Click Upload PowerPoint.",
                    "description": "This opens a new window where you can search for any PPT or PPTX files on your computer. Click Open to upload the slide deck to Prezi."
                },
                {
                    "headline": "Edit your presentation.",
                    "description": "Once the PowerPoint file is uploaded, all of its slides will be displayed in the sidebar on the right side of the screen. Click and drag each slide onto the Prezi template to insert them as topics and sub-topics in your presentation."
                },
                {
                    "headline": "Enter a title and description for your new Prezi.",
                    "description": "Once you're done editing, you can title your presentation and add a description."
                }
            ]
        }
    ],
    "tyn": [
        "Adobe Flash Player 9 or higher installed",
        "Minimum 1GB memory",
        "A scroll mouse / touchpad",
        "Internet Explorer 7 or higher, Firefox 3.0 or higher, or Safari 3 or higher"
    ],
    "text": " Creating a New Presentation with a Template Go to the prezi page. Once there, log in using the email and password associated with your Prezi.com account to access your account's dashboard. Click the Create from template button in the upper left corner of the page. This will direct you to a new page with different presentation templates. Select the template you want to use. Click on the template to see a preview of it. Click Use this template. This appears as a blue button beneath the template preview. Edit your presentation. Once you've selected a template, your presentation will open in a new window displaying the presentation editor. Enter a title and description for your new Prezi. Once you have your new presentation set up, you can title it and add a description. Creating a New Presentation with Converted PowerPoint Slides Go to the prezi page. Once there, log in using the email and password associated with your Prezi.com account to access your account's dashboard. Click the Convert PowerPoint button in the upper-left corner of the page. This will direct you to a new menu where you can select a PowerPoint file to be converted into a Prezi presentation. Click Upload PowerPoint. This opens a new window where you can search for any PPT or PPTX files on your computer. Click Open to upload the slide deck to Prezi. Edit your presentation. Once the PowerPoint file is uploaded, all of its slides will be displayed in the sidebar on the right side of the screen. Click and drag each slide onto the Prezi template to insert them as topics and sub-topics in your presentation. Enter a title and description for your new Prezi. Once you're done editing, you can title your presentation and add a description.",
    "sentences": [
        " Creating a New Presentation with a Template Go to the prezi page.",
        "Once there, log in using the email and password associated with your Prezi.com account to access your account's dashboard.",
        "Click the Create from template button in the upper left corner of the page.",
        "This will direct you to a new page with different presentation templates.",
        "Select the template you want to use.",
        "Click on the template to see a preview of it.",
        "Click Use this template.",
        "This appears as a blue button beneath the template preview.",
        "Edit your presentation.",
        "Once you've selected a template, your presentation will open in a new window displaying the presentation editor.",
        "Enter a title and description for your new Prezi.",
        "Once you have your new presentation set up, you can title it and add a description.",
        "Creating a New Presentation with Converted PowerPoint Slides Go to the prezi page.",
        "Once there, log in using the email and password associated with your Prezi.com account to access your account's dashboard.",
        "Click the Convert PowerPoint button in the upper-left corner of the page.",
        "This will direct you to a new menu where you can select a PowerPoint file to be converted into a Prezi presentation.",
        "Click Upload PowerPoint.",
        "This opens a new window where you can search for any PPT or PPTX files on your computer.",
        "Click Open to upload the slide deck to Prezi.",
        "Edit your presentation.",
        "Once the PowerPoint file is uploaded, all of its slides will be displayed in the sidebar on the right side of the screen.",
        "Click and drag each slide onto the Prezi template to insert them as topics and sub-topics in your presentation.",
        "Enter a title and description for your new Prezi.",
        "Once you're done editing, you can title your presentation and add a description."
    ]
}