{
    "title": "How to Make a Traditional Corned Beef Pie",
    "url": "https://www.wikihow.com/Make-a-Traditional-Corned-Beef-Pie",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Beef and Lamb"
    ],
    "parts": [
        {
            "name": "Making the Pastry Dough",
            "steps": [
                {
                    "headline": "Put the flour into a bowl with butter, lard, and salt.",
                    "description": "Get out a large mixing bowl and pour 2 1/2 cups (300 g) of all-purpose flour into it. Add 1 pinch of salt along with 5 tablespoons (75 g) of chilled, unsalted butter and 5 tablespoons (75 g) of lard or vegetable shortening.Variation: If you'd like lighter pastry, you could lay thawed puff pastry sheets over the cooled filling instead of shortcrust pastry dough."
                },
                {
                    "headline": "Combine the butter and lard with the flour until the mixture is crumbly.",
                    "description": "Use your fingers to combine the butter and lard with the flour. Keep pinching and rubbing the flour with the fats until you don't see any large lumps of fat and the mixture looks like breadcrumbs. If you don't want to use your fingers, combine the flour with the fats using a pastry cutter."
                },
                {
                    "headline": "Stir in 1  tsp (4.9 ml) of vinegar and 2 US tbsp (30 ml) of the water at a time.",
                    "description": "Pour the vinegar into the bowl along with 2 tablespoons (30 ml) of ice water. Use a spoon, spatula, or fork to stir until the mixture absorbs the liquid. Then, stir in another 2 to 4 tablespoons (30 to 59 ml) of water very gradually. Stop stirring in water as soon as you see the dough come away from the sides of the bowl. Ice water will prevent the butter and lard from warming, which would make the dough tough. If you add too much water, your pastry will become gluey and difficult to handle. That's why it's important to add the water very slowly."
                },
                {
                    "headline": "Knead the dough into a ball and wrap it in plastic wrap.",
                    "description": "Use your hands to gently press the dough into a ball and place it on a sheet of plastic wrap. Completely cover the dough so air won't dry the dough out. Try not to work the dough too much or the pastry will become tough."
                },
                {
                    "headline": "Chill the dough in the fridge for at least 1 hour.",
                    "description": "Put the wrapped ball of dough in the refrigerator and let it rest while you make the filling for the corned beef pie. If you'd like to make the dough in advance, you can chill it in the fridge for up to 1 day. Chilling the dough will relax the gluten in the pastry so your crust is tender and flaky."
                }
            ]
        },
        {
            "name": "Cooking the Filling",
            "steps": [
                {
                    "headline": "Sauté the onion, carrot, celery, and garlic for 5 minutes.",
                    "description": "Melt 2 tablespoons (28 g) of salted butter in a large pot over medium-high heat. Then, stir in 2 cups (288 g) of chopped yellow onion, 1 1/2 cups (227 g) of diced carrot, 1 cup (123 g) of diced celery, and 4 teaspoons (11 g) of minced garlic. Stir the vegetables occasionally to prevent them from sticking to the pot. Cook the veggies until they soften a little and the onion becomes clear."
                },
                {
                    "headline": "Add 3 diced potatoes and cook the vegetables for 5 minutes.",
                    "description": "Stir 3 peeled and diced potatoes into the pot and cook until they soften a little. The potatoes pieces should be about ⁄2 inch (1.3 cm) in size. If you prefer, you can leave the peel on the potatoes. This will give your pie a more rustic appearance, but shouldn't affect the texture of the filling."
                },
                {
                    "headline": "Stir in the corned beef, stock, Worcestershire, mustard, and pepper.",
                    "description": "Open 2 12-ounce (340 g) cans of corned beef and add them to the pot. Stir until the corned beef is crumbled. Then, add 2 cups (470 ml) of beef stock, 2 teaspoons (9.9 ml) of Worcestershire sauce, 1 1/4 teaspoons (6 g) of English mustard, and 1 teaspoon (2 g) of freshly ground black pepper.Tip: If you can't find English mustard, use regular mustard and add a little horseradish sauce according to how spicy you want the filling to be. If you don't want to use canned corned beef, you can cook your own and shred 3 cups (680 g) of meat."
                },
                {
                    "headline": "Bring the filling to a boil and simmer it for 15 to 20 minutes.",
                    "description": "Put the lid on the pot and cook the filling until it begins to boil. Then, wear oven mitts to take the lid off. Turn the burner down to medium so the filling bubbles gently and simmer it until the vegetables are cooked throughout. Keep cooking the filling until most of the liquid evaporates. Stir the filling occasionally so it cooks evenly and doesn't stick. To test if the vegetables are soft, insert a fork into a potato or carrot. The fork should slide out easily if the vegetables are done. If not, cook them for another 2 to 3 minutes and check them again."
                },
                {
                    "headline": "Turn off the burner and stir in fresh parsley.",
                    "description": "Finely chop 3 tablespoons (11 g) of fresh parsley and stir it into the filling. If you don't like the flavor of fresh herbs in the filling, you can leave it out."
                },
                {
                    "headline": "Pour the filling into a bowl or pan and freeze it for 20 minutes.",
                    "description": "The filling needs to chill before you assemble the pie or the butter in the pastry will melt. Transfer the filling to a shallow bowl or a 9 by 13 inches (23 cm × 33 cm) cake pan. Put it in the freezer and let it chill for 20 minutes. Stir the filling halfway through the chilling time so all of the filling cools down."
                }
            ]
        },
        {
            "name": "Assembling and Baking the Pie",
            "steps": [
                {
                    "headline": "Preheat the oven to 400 °F (204 °C) and whisk the egg with 1  tsp (4.9 ml) of water.",
                    "description": "Crack 1 egg into a small bowl and pour in the water. Then, use a fork to whisk the egg until the water is incorporated. Set the egg wash aside while you assemble the pie. This will be the egg wash that you brush over the pastry. It will help your pastry become golden brown as it bakes."
                },
                {
                    "headline": "Take the dough out of the fridge and get out a pie plate.",
                    "description": "Remove the dough and unwrap it. Place the dough on a lightly floured surface and get out a 9 in (23 cm) deep-dish pie plate or 6 cups (1.4 L) baking dish."
                },
                {
                    "headline": "Divide the dough in 1/2 and roll 1 piece into an ⁄8 inch (0.32 cm) thick circle.",
                    "description": "Use a pastry cutter or knife to divide the dough into 2 evenly sized pieces. Set 1 piece aside and use a rolling pin to roll out the other piece until it's ⁄8 inch (0.32 cm) thick.Tip: If your dish is rectangular or oblong, roll the dough into a rectangle instead of a circle."
                },
                {
                    "headline": "Line the plate or dish with the dough and pour the cooled filling into it.",
                    "description": "Carefully lift the dough up and into your pie plate or baking dish. Press the dough until the bottom and sides are completely lined with pastry. Then, take the chilled filling from the freezer and spoon it into the pastry-lined plate or dish."
                },
                {
                    "headline": "Brush the edges of the pastry with egg wash and roll out the remaining dough.",
                    "description": "Dip a pastry brush into the egg wash and brush it along the edges of the dough that's lining your plate or dish. Then, roll the reserved dough until it's ⁄8 inch (0.32 cm) thick. Remember to make the top layer of dough the same size as your plate or dish."
                },
                {
                    "headline": "Lay the top pastry over the filling and pinch the edges to seal them.",
                    "description": "Carefully transfer the rolled dough onto the filling so it's totally covered. Use a sharp knife to trim the edges so there's no more than 1 inch (2.5 cm) of dough extending from the plate or dish. Then, pinch the edges together to seal both layers of dough. The egg wash that you brushed over the edges will help the top layer of dough stick to the bottom."
                },
                {
                    "headline": "Brush the top of the pie with egg wash and cut 3 to 4 slits in the top.",
                    "description": "Dip your pastry brush in the egg wash and brush it over the surface of the pie. Then, use a sharp paring knife to carefully cut 3 or 4 2 in (5.1 cm) slits on the pastry. The slits will act as vents that allow steam to escape as the pie bakes."
                },
                {
                    "headline": "Bake the pie for 45 to 55 minutes or until the top is golden brown.",
                    "description": "Put the pie into the preheated oven and let it cook until the pastry is flaky and browned. If the edges of the pastry look like they're browning too quickly, cover them loosely with aluminum foil. Since the filling of the pie is already cooked, you're really baking the pie in order to cook the pastry."
                },
                {
                    "headline": "Remove the pie and let it sit for 15 minutes before you serve it.",
                    "description": "Once your pie looks flaky, carefully take it out of the oven and set it on a rack to cool a little. This will help the filling thicken up. You can serve the corned beef pie hot, warm, or even cold. Consider serving the pie with mushy peas or green beans. Refrigerate leftover pie in an airtight container for up to 5 days."
                }
            ]
        }
    ],
    "tyn": [
        "Measuring cups and spoons",
        "Mixing bowls",
        "Plastic wrap",
        "Large pot with a lid",
        "Knife and cutting board",
        "Spoon",
        "Shallow bowl or large baking dish",
        "Rolling pin",
        "Pastry cutter, optional"
    ],
    "text": " Making the Pastry Dough Put the flour into a bowl with butter, lard, and salt. Get out a large mixing bowl and pour 2 1/2 cups (300 g) of all-purpose flour into it. Add 1 pinch of salt along with 5 tablespoons (75 g) of chilled, unsalted butter and 5 tablespoons (75 g) of lard or vegetable shortening.Variation: If you'd like lighter pastry, you could lay thawed puff pastry sheets over the cooled filling instead of shortcrust pastry dough. Combine the butter and lard with the flour until the mixture is crumbly. Use your fingers to combine the butter and lard with the flour. Keep pinching and rubbing the flour with the fats until you don't see any large lumps of fat and the mixture looks like breadcrumbs. If you don't want to use your fingers, combine the flour with the fats using a pastry cutter. Stir in 1  tsp (4.9 ml) of vinegar and 2 US tbsp (30 ml) of the water at a time. Pour the vinegar into the bowl along with 2 tablespoons (30 ml) of ice water. Use a spoon, spatula, or fork to stir until the mixture absorbs the liquid. Then, stir in another 2 to 4 tablespoons (30 to 59 ml) of water very gradually. Stop stirring in water as soon as you see the dough come away from the sides of the bowl. Ice water will prevent the butter and lard from warming, which would make the dough tough. If you add too much water, your pastry will become gluey and difficult to handle. That's why it's important to add the water very slowly. Knead the dough into a ball and wrap it in plastic wrap. Use your hands to gently press the dough into a ball and place it on a sheet of plastic wrap. Completely cover the dough so air won't dry the dough out. Try not to work the dough too much or the pastry will become tough. Chill the dough in the fridge for at least 1 hour. Put the wrapped ball of dough in the refrigerator and let it rest while you make the filling for the corned beef pie. If you'd like to make the dough in advance, you can chill it in the fridge for up to 1 day. Chilling the dough will relax the gluten in the pastry so your crust is tender and flaky. Cooking the Filling Sauté the onion, carrot, celery, and garlic for 5 minutes. Melt 2 tablespoons (28 g) of salted butter in a large pot over medium-high heat. Then, stir in 2 cups (288 g) of chopped yellow onion, 1 1/2 cups (227 g) of diced carrot, 1 cup (123 g) of diced celery, and 4 teaspoons (11 g) of minced garlic. Stir the vegetables occasionally to prevent them from sticking to the pot. Cook the veggies until they soften a little and the onion becomes clear. Add 3 diced potatoes and cook the vegetables for 5 minutes. Stir 3 peeled and diced potatoes into the pot and cook until they soften a little. The potatoes pieces should be about ⁄2 inch (1.3 cm) in size. If you prefer, you can leave the peel on the potatoes. This will give your pie a more rustic appearance, but shouldn't affect the texture of the filling. Stir in the corned beef, stock, Worcestershire, mustard, and pepper. Open 2 12-ounce (340 g) cans of corned beef and add them to the pot. Stir until the corned beef is crumbled. Then, add 2 cups (470 ml) of beef stock, 2 teaspoons (9.9 ml) of Worcestershire sauce, 1 1/4 teaspoons (6 g) of English mustard, and 1 teaspoon (2 g) of freshly ground black pepper.Tip: If you can't find English mustard, use regular mustard and add a little horseradish sauce according to how spicy you want the filling to be. If you don't want to use canned corned beef, you can cook your own and shred 3 cups (680 g) of meat. Bring the filling to a boil and simmer it for 15 to 20 minutes. Put the lid on the pot and cook the filling until it begins to boil. Then, wear oven mitts to take the lid off. Turn the burner down to medium so the filling bubbles gently and simmer it until the vegetables are cooked throughout. Keep cooking the filling until most of the liquid evaporates. Stir the filling occasionally so it cooks evenly and doesn't stick. To test if the vegetables are soft, insert a fork into a potato or carrot. The fork should slide out easily if the vegetables are done. If not, cook them for another 2 to 3 minutes and check them again. Turn off the burner and stir in fresh parsley. Finely chop 3 tablespoons (11 g) of fresh parsley and stir it into the filling. If you don't like the flavor of fresh herbs in the filling, you can leave it out. Pour the filling into a bowl or pan and freeze it for 20 minutes. The filling needs to chill before you assemble the pie or the butter in the pastry will melt. Transfer the filling to a shallow bowl or a 9 by 13 inches (23 cm × 33 cm) cake pan. Put it in the freezer and let it chill for 20 minutes. Stir the filling halfway through the chilling time so all of the filling cools down. Assembling and Baking the Pie Preheat the oven to 400 °F (204 °C) and whisk the egg with 1  tsp (4.9 ml) of water. Crack 1 egg into a small bowl and pour in the water. Then, use a fork to whisk the egg until the water is incorporated. Set the egg wash aside while you assemble the pie. This will be the egg wash that you brush over the pastry. It will help your pastry become golden brown as it bakes. Take the dough out of the fridge and get out a pie plate. Remove the dough and unwrap it. Place the dough on a lightly floured surface and get out a 9 in (23 cm) deep-dish pie plate or 6 cups (1.4 L) baking dish. Divide the dough in 1/2 and roll 1 piece into an ⁄8 inch (0.32 cm) thick circle. Use a pastry cutter or knife to divide the dough into 2 evenly sized pieces. Set 1 piece aside and use a rolling pin to roll out the other piece until it's ⁄8 inch (0.32 cm) thick.Tip: If your dish is rectangular or oblong, roll the dough into a rectangle instead of a circle. Line the plate or dish with the dough and pour the cooled filling into it. Carefully lift the dough up and into your pie plate or baking dish. Press the dough until the bottom and sides are completely lined with pastry. Then, take the chilled filling from the freezer and spoon it into the pastry-lined plate or dish. Brush the edges of the pastry with egg wash and roll out the remaining dough. Dip a pastry brush into the egg wash and brush it along the edges of the dough that's lining your plate or dish. Then, roll the reserved dough until it's ⁄8 inch (0.32 cm) thick. Remember to make the top layer of dough the same size as your plate or dish. Lay the top pastry over the filling and pinch the edges to seal them. Carefully transfer the rolled dough onto the filling so it's totally covered. Use a sharp knife to trim the edges so there's no more than 1 inch (2.5 cm) of dough extending from the plate or dish. Then, pinch the edges together to seal both layers of dough. The egg wash that you brushed over the edges will help the top layer of dough stick to the bottom. Brush the top of the pie with egg wash and cut 3 to 4 slits in the top. Dip your pastry brush in the egg wash and brush it over the surface of the pie. Then, use a sharp paring knife to carefully cut 3 or 4 2 in (5.1 cm) slits on the pastry. The slits will act as vents that allow steam to escape as the pie bakes. Bake the pie for 45 to 55 minutes or until the top is golden brown. Put the pie into the preheated oven and let it cook until the pastry is flaky and browned. If the edges of the pastry look like they're browning too quickly, cover them loosely with aluminum foil. Since the filling of the pie is already cooked, you're really baking the pie in order to cook the pastry. Remove the pie and let it sit for 15 minutes before you serve it. Once your pie looks flaky, carefully take it out of the oven and set it on a rack to cool a little. This will help the filling thicken up. You can serve the corned beef pie hot, warm, or even cold. Consider serving the pie with mushy peas or green beans. Refrigerate leftover pie in an airtight container for up to 5 days.",
    "sentences": [
        " Making the Pastry Dough Put the flour into a bowl with butter, lard, and salt.",
        "Get out a large mixing bowl and pour 2 1/2 cups (300 g) of all-purpose flour into it.",
        "Add 1 pinch of salt along with 5 tablespoons (75 g) of chilled, unsalted butter and 5 tablespoons (75 g) of lard or vegetable shortening.Variation: If you'd like lighter pastry, you could lay thawed puff pastry sheets over the cooled filling instead of shortcrust pastry dough.",
        "Combine the butter and lard with the flour until the mixture is crumbly.",
        "Use your fingers to combine the butter and lard with the flour.",
        "Keep pinching and rubbing the flour with the fats until you don't see any large lumps of fat and the mixture looks like breadcrumbs.",
        "If you don't want to use your fingers, combine the flour with the fats using a pastry cutter.",
        "Stir in 1  tsp (4.9 ml) of vinegar and 2 US tbsp (30 ml) of the water at a time.",
        "Pour the vinegar into the bowl along with 2 tablespoons (30 ml) of ice water.",
        "Use a spoon, spatula, or fork to stir until the mixture absorbs the liquid.",
        "Then, stir in another 2 to 4 tablespoons (30 to 59 ml) of water very gradually.",
        "Stop stirring in water as soon as you see the dough come away from the sides of the bowl.",
        "Ice water will prevent the butter and lard from warming, which would make the dough tough.",
        "If you add too much water, your pastry will become gluey and difficult to handle.",
        "That's why it's important to add the water very slowly.",
        "Knead the dough into a ball and wrap it in plastic wrap.",
        "Use your hands to gently press the dough into a ball and place it on a sheet of plastic wrap.",
        "Completely cover the dough so air won't dry the dough out.",
        "Try not to work the dough too much or the pastry will become tough.",
        "Chill the dough in the fridge for at least 1 hour.",
        "Put the wrapped ball of dough in the refrigerator and let it rest while you make the filling for the corned beef pie.",
        "If you'd like to make the dough in advance, you can chill it in the fridge for up to 1 day.",
        "Chilling the dough will relax the gluten in the pastry so your crust is tender and flaky.",
        "Cooking the Filling Sauté the onion, carrot, celery, and garlic for 5 minutes.",
        "Melt 2 tablespoons (28 g) of salted butter in a large pot over medium-high heat.",
        "Then, stir in 2 cups (288 g) of chopped yellow onion, 1 1/2 cups (227 g) of diced carrot, 1 cup (123 g) of diced celery, and 4 teaspoons (11 g) of minced garlic.",
        "Stir the vegetables occasionally to prevent them from sticking to the pot.",
        "Cook the veggies until they soften a little and the onion becomes clear.",
        "Add 3 diced potatoes and cook the vegetables for 5 minutes.",
        "Stir 3 peeled and diced potatoes into the pot and cook until they soften a little.",
        "The potatoes pieces should be about ⁄2 inch (1.3 cm) in size.",
        "If you prefer, you can leave the peel on the potatoes.",
        "This will give your pie a more rustic appearance, but shouldn't affect the texture of the filling.",
        "Stir in the corned beef, stock, Worcestershire, mustard, and pepper.",
        "Open 2 12-ounce (340 g) cans of corned beef and add them to the pot.",
        "Stir until the corned beef is crumbled.",
        "Then, add 2 cups (470 ml) of beef stock, 2 teaspoons (9.9 ml) of Worcestershire sauce, 1 1/4 teaspoons (6 g) of English mustard, and 1 teaspoon (2 g) of freshly ground black pepper.Tip: If you can't find English mustard, use regular mustard and add a little horseradish sauce according to how spicy you want the filling to be.",
        "If you don't want to use canned corned beef, you can cook your own and shred 3 cups (680 g) of meat.",
        "Bring the filling to a boil and simmer it for 15 to 20 minutes.",
        "Put the lid on the pot and cook the filling until it begins to boil.",
        "Then, wear oven mitts to take the lid off.",
        "Turn the burner down to medium so the filling bubbles gently and simmer it until the vegetables are cooked throughout.",
        "Keep cooking the filling until most of the liquid evaporates.",
        "Stir the filling occasionally so it cooks evenly and doesn't stick.",
        "To test if the vegetables are soft, insert a fork into a potato or carrot.",
        "The fork should slide out easily if the vegetables are done.",
        "If not, cook them for another 2 to 3 minutes and check them again.",
        "Turn off the burner and stir in fresh parsley.",
        "Finely chop 3 tablespoons (11 g) of fresh parsley and stir it into the filling.",
        "If you don't like the flavor of fresh herbs in the filling, you can leave it out.",
        "Pour the filling into a bowl or pan and freeze it for 20 minutes.",
        "The filling needs to chill before you assemble the pie or the butter in the pastry will melt.",
        "Transfer the filling to a shallow bowl or a 9 by 13 inches (23 cm × 33 cm) cake pan.",
        "Put it in the freezer and let it chill for 20 minutes.",
        "Stir the filling halfway through the chilling time so all of the filling cools down.",
        "Assembling and Baking the Pie Preheat the oven to 400 °F (204 °C) and whisk the egg with 1  tsp (4.9 ml) of water.",
        "Crack 1 egg into a small bowl and pour in the water.",
        "Then, use a fork to whisk the egg until the water is incorporated.",
        "Set the egg wash aside while you assemble the pie.",
        "This will be the egg wash that you brush over the pastry.",
        "It will help your pastry become golden brown as it bakes.",
        "Take the dough out of the fridge and get out a pie plate.",
        "Remove the dough and unwrap it.",
        "Place the dough on a lightly floured surface and get out a 9 in (23 cm) deep-dish pie plate or 6 cups (1.4 L) baking dish.",
        "Divide the dough in 1/2 and roll 1 piece into an ⁄8 inch (0.32 cm) thick circle.",
        "Use a pastry cutter or knife to divide the dough into 2 evenly sized pieces.",
        "Set 1 piece aside and use a rolling pin to roll out the other piece until it's ⁄8 inch (0.32 cm) thick.Tip: If your dish is rectangular or oblong, roll the dough into a rectangle instead of a circle.",
        "Line the plate or dish with the dough and pour the cooled filling into it.",
        "Carefully lift the dough up and into your pie plate or baking dish.",
        "Press the dough until the bottom and sides are completely lined with pastry.",
        "Then, take the chilled filling from the freezer and spoon it into the pastry-lined plate or dish.",
        "Brush the edges of the pastry with egg wash and roll out the remaining dough.",
        "Dip a pastry brush into the egg wash and brush it along the edges of the dough that's lining your plate or dish.",
        "Then, roll the reserved dough until it's ⁄8 inch (0.32 cm) thick.",
        "Remember to make the top layer of dough the same size as your plate or dish.",
        "Lay the top pastry over the filling and pinch the edges to seal them.",
        "Carefully transfer the rolled dough onto the filling so it's totally covered.",
        "Use a sharp knife to trim the edges so there's no more than 1 inch (2.5 cm) of dough extending from the plate or dish.",
        "Then, pinch the edges together to seal both layers of dough.",
        "The egg wash that you brushed over the edges will help the top layer of dough stick to the bottom.",
        "Brush the top of the pie with egg wash and cut 3 to 4 slits in the top.",
        "Dip your pastry brush in the egg wash and brush it over the surface of the pie.",
        "Then, use a sharp paring knife to carefully cut 3 or 4 2 in (5.1 cm) slits on the pastry.",
        "The slits will act as vents that allow steam to escape as the pie bakes.",
        "Bake the pie for 45 to 55 minutes or until the top is golden brown.",
        "Put the pie into the preheated oven and let it cook until the pastry is flaky and browned.",
        "If the edges of the pastry look like they're browning too quickly, cover them loosely with aluminum foil.",
        "Since the filling of the pie is already cooked, you're really baking the pie in order to cook the pastry.",
        "Remove the pie and let it sit for 15 minutes before you serve it.",
        "Once your pie looks flaky, carefully take it out of the oven and set it on a rack to cool a little.",
        "This will help the filling thicken up.",
        "You can serve the corned beef pie hot, warm, or even cold.",
        "Consider serving the pie with mushy peas or green beans.",
        "Refrigerate leftover pie in an airtight container for up to 5 days."
    ]
}