{
    "title": "How to Make Glow in the Dark Paint",
    "url": "https://www.wikihow.com/Make-Glow-in-the-Dark-Paint",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "methods": [
        {
            "name": "Using Phosphorescent Powder",
            "steps": [
                {
                    "headline": "Choose a glow in the dark powder.",
                    "description": "You can find glow in the dark, or phosphorescent, powders online or at some craft and art supply stores. The powders come in a variety of colors and particle sizes. Larger particles are brighter, but also make a rougher paint which can create a speckled look. Smaller particles create a smoother paint, but don't glow as brightly."
                },
                {
                    "headline": "Choose a paint medium.",
                    "description": "This will be the actual paint that you mix into the phosphorescent powder. If you want your paint to be invisible in light, choose a clear paint, such as an acrylic gel. If you want to see the paint in the light, choose an acrylic or tempera paint in a color you like. Make sure that your paint medium works with your phosphorescent powder. For example, if you are planning to use a water-based medium, then you will need \"coated glow powder\" also known as \"coated phosphorescent pigment\". For solvent or oil-based mediums, you can use standard or uncollated glow powder."
                },
                {
                    "headline": "Place your phosphorescent powder in a bowl.",
                    "description": "You'll want to place 1 part powder to 5 parts paint (or 20% by volume of glow powder to paint medium)."
                },
                {
                    "headline": "Pour paint into the bowl.",
                    "description": "Gradually pour your paint medium over the powder in your bowl. Carefully stir the mixture. You can add more paint to achieve a thinner consistency. The powder will not dissolve in the paint, so just stir until the mixture is combined and no lumps remain."
                },
                {
                    "headline": "Use your paint.",
                    "description": "Most glow in the dark paints should be used immediately. Depending on your powder/medium combination, your new mix may or may not have shelf life. Therefore only mix what you can use within an hour. If you do want to store your paint, pour it into a sealable container and be sure to stir it well before using it again."
                }
            ]
        },
        {
            "name": "Using a Highlighter and Water",
            "steps": [
                {
                    "headline": "Open a highlighter and remove the felt.",
                    "description": "Using a pair of pliers, break open the end of a non-toxic highlighter. Remove the felt strip from the center and discard the plastic highlighter casing. Make sure that your highlighter glows under black lights. Test this by writing something on a piece of paper using your highlighter. Then, turn off the lights and hold the black light over it. You should see your test scribbles."
                },
                {
                    "headline": "Run water through the felt.",
                    "description": "Place a cup or jar in your sink. Slowly run water through the felt strip so that the yellow highlighter liquid runs into your cup. Turn off the water and stop when the felt is white. You may need to do this for several highlighters in order to create enough highlighter water."
                },
                {
                    "headline": "Place cornstarch in a bowl.",
                    "description": "Use 1/2 cup of white cornstarch. This will be the basis for your homemade glow in the dark paint. This mixture will be pretty thin. The ratio should be equal parts cornstarch and highlighter water."
                },
                {
                    "headline": "Add highlighter water.",
                    "description": "Carefully pour in 1/2 cup of highlighter water and stir until the cornstarch completely dissolves."
                },
                {
                    "headline": "Add food coloring.",
                    "description": "If you want to change the color of your paint, add a few drops of food coloring and stir. Add more food coloring till you achieve the desired color. Consider pouring your paint into a few smaller containers. That way, you can create different colors using different food colors."
                },
                {
                    "headline": "Use your paint and let dry.",
                    "description": "This paint is pretty runny, so you may want to let it dry and paint on several layers. Extra layers will make the paint glow seem brighter and last longer."
                },
                {
                    "headline": "Watch it glow.",
                    "description": "Turn off all the lights and make sure to close any blinds or shades. Turn on your UV-A blacklight in order to see your paint glow."
                }
            ]
        }
    ],
    "tyn": [
        "Phosphorescent powder or crystals",
        "Paint medium",
        "Bowl",
        "Paint stirrer",
        "Brushes",
        "Highlighters",
        "Water",
        "Cornstarch",
        "Food coloring",
        "Blacklight"
    ],
    "text": " Using Phosphorescent Powder Choose a glow in the dark powder. You can find glow in the dark, or phosphorescent, powders online or at some craft and art supply stores. The powders come in a variety of colors and particle sizes. Larger particles are brighter, but also make a rougher paint which can create a speckled look. Smaller particles create a smoother paint, but don't glow as brightly. Choose a paint medium. This will be the actual paint that you mix into the phosphorescent powder. If you want your paint to be invisible in light, choose a clear paint, such as an acrylic gel. If you want to see the paint in the light, choose an acrylic or tempera paint in a color you like. Make sure that your paint medium works with your phosphorescent powder. For example, if you are planning to use a water-based medium, then you will need \"coated glow powder\" also known as \"coated phosphorescent pigment\". For solvent or oil-based mediums, you can use standard or uncollated glow powder. Place your phosphorescent powder in a bowl. You'll want to place 1 part powder to 5 parts paint (or 20% by volume of glow powder to paint medium). Pour paint into the bowl. Gradually pour your paint medium over the powder in your bowl. Carefully stir the mixture. You can add more paint to achieve a thinner consistency. The powder will not dissolve in the paint, so just stir until the mixture is combined and no lumps remain. Use your paint. Most glow in the dark paints should be used immediately. Depending on your powder/medium combination, your new mix may or may not have shelf life. Therefore only mix what you can use within an hour. If you do want to store your paint, pour it into a sealable container and be sure to stir it well before using it again. Using a Highlighter and Water Open a highlighter and remove the felt. Using a pair of pliers, break open the end of a non-toxic highlighter. Remove the felt strip from the center and discard the plastic highlighter casing. Make sure that your highlighter glows under black lights. Test this by writing something on a piece of paper using your highlighter. Then, turn off the lights and hold the black light over it. You should see your test scribbles. Run water through the felt. Place a cup or jar in your sink. Slowly run water through the felt strip so that the yellow highlighter liquid runs into your cup. Turn off the water and stop when the felt is white. You may need to do this for several highlighters in order to create enough highlighter water. Place cornstarch in a bowl. Use 1/2 cup of white cornstarch. This will be the basis for your homemade glow in the dark paint. This mixture will be pretty thin. The ratio should be equal parts cornstarch and highlighter water. Add highlighter water. Carefully pour in 1/2 cup of highlighter water and stir until the cornstarch completely dissolves. Add food coloring. If you want to change the color of your paint, add a few drops of food coloring and stir. Add more food coloring till you achieve the desired color. Consider pouring your paint into a few smaller containers. That way, you can create different colors using different food colors. Use your paint and let dry. This paint is pretty runny, so you may want to let it dry and paint on several layers. Extra layers will make the paint glow seem brighter and last longer. Watch it glow. Turn off all the lights and make sure to close any blinds or shades. Turn on your UV-A blacklight in order to see your paint glow.",
    "sentences": [
        " Using Phosphorescent Powder Choose a glow in the dark powder.",
        "You can find glow in the dark, or phosphorescent, powders online or at some craft and art supply stores.",
        "The powders come in a variety of colors and particle sizes.",
        "Larger particles are brighter, but also make a rougher paint which can create a speckled look.",
        "Smaller particles create a smoother paint, but don't glow as brightly.",
        "Choose a paint medium.",
        "This will be the actual paint that you mix into the phosphorescent powder.",
        "If you want your paint to be invisible in light, choose a clear paint, such as an acrylic gel.",
        "If you want to see the paint in the light, choose an acrylic or tempera paint in a color you like.",
        "Make sure that your paint medium works with your phosphorescent powder.",
        "For example, if you are planning to use a water-based medium, then you will need \"coated glow powder\" also known as \"coated phosphorescent pigment\".",
        "For solvent or oil-based mediums, you can use standard or uncollated glow powder.",
        "Place your phosphorescent powder in a bowl.",
        "You'll want to place 1 part powder to 5 parts paint (or 20% by volume of glow powder to paint medium).",
        "Pour paint into the bowl.",
        "Gradually pour your paint medium over the powder in your bowl.",
        "Carefully stir the mixture.",
        "You can add more paint to achieve a thinner consistency.",
        "The powder will not dissolve in the paint, so just stir until the mixture is combined and no lumps remain.",
        "Use your paint.",
        "Most glow in the dark paints should be used immediately.",
        "Depending on your powder/medium combination, your new mix may or may not have shelf life.",
        "Therefore only mix what you can use within an hour.",
        "If you do want to store your paint, pour it into a sealable container and be sure to stir it well before using it again.",
        "Using a Highlighter and Water Open a highlighter and remove the felt.",
        "Using a pair of pliers, break open the end of a non-toxic highlighter.",
        "Remove the felt strip from the center and discard the plastic highlighter casing.",
        "Make sure that your highlighter glows under black lights.",
        "Test this by writing something on a piece of paper using your highlighter.",
        "Then, turn off the lights and hold the black light over it.",
        "You should see your test scribbles.",
        "Run water through the felt.",
        "Place a cup or jar in your sink.",
        "Slowly run water through the felt strip so that the yellow highlighter liquid runs into your cup.",
        "Turn off the water and stop when the felt is white.",
        "You may need to do this for several highlighters in order to create enough highlighter water.",
        "Place cornstarch in a bowl.",
        "Use 1/2 cup of white cornstarch.",
        "This will be the basis for your homemade glow in the dark paint.",
        "This mixture will be pretty thin.",
        "The ratio should be equal parts cornstarch and highlighter water.",
        "Add highlighter water.",
        "Carefully pour in 1/2 cup of highlighter water and stir until the cornstarch completely dissolves.",
        "Add food coloring.",
        "If you want to change the color of your paint, add a few drops of food coloring and stir.",
        "Add more food coloring till you achieve the desired color.",
        "Consider pouring your paint into a few smaller containers.",
        "That way, you can create different colors using different food colors.",
        "Use your paint and let dry.",
        "This paint is pretty runny, so you may want to let it dry and paint on several layers.",
        "Extra layers will make the paint glow seem brighter and last longer.",
        "Watch it glow.",
        "Turn off all the lights and make sure to close any blinds or shades.",
        "Turn on your UV-A blacklight in order to see your paint glow."
    ]
}