{
    "title": "How to Adjust Action on a Bass",
    "url": "https://www.wikihow.com/Adjust-Action-on-a-Bass",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music",
        "Musical Instruments",
        "String Instruments",
        "Guitar",
        "Electric Guitar",
        "Bass Guitar"
    ],
    "parts": [
        {
            "name": "Inspect the Neck of the Bass",
            "steps": [
                {
                    "headline": "Wait at least 30 minutes after any significant change in string tension before inspecting or adjusting the neck of your bass.",
                    "description": "It takes time for the neck of a bass to settle into its final position after significant changes have been made to the forces applied to it. Waiting longer periods will increase the accuracy of your adjustments."
                },
                {
                    "headline": "Determine the relief, or bow, in the neck.",
                    "description": "The neck of your bass must have a slight bow to play properly. If the neck were straight, you would get fret buzz, especially on notes played on the first 5 frets. If you have a capo, attach it at the first fret; otherwise, hold down the E-string (or B-string on a 5-string bass) at the 1st fret with your left index finger. Hold the string down at the 12th fret with your right thumb or right elbow. Use a feeler gauge to determine the largest gap between the string and the tops of the 4th through 8th frets. If the string is touching any of these frets, the neck needs more relief. If the gap between the string and any of these frets is greater than 0.020 inch (0.5 mm), then the neck needs less relief. Alternatively, attach a capo at the first fret or hold down the G-string at the 1st fret with your left index finger. Press the G-string down at the end of the neck with your elbow. Use a feeler gauge to measure the gap between the bottom of the string and the top of the 8th fret. If the gap exceeds 0.012 inch (0.3 mm), the neck needs less relief. If there is no gap, the neck needs more relief. The truss rod needs to be adjusted if inspection of the neck indicates that it needs either more or less relief."
                }
            ]
        },
        {
            "name": "Adjust the Truss Rod",
            "steps": [
                {
                    "headline": "Remove the truss rod cover on the headstock, just beyond the nut.",
                    "description": "Depending on the model of your bass, you will need a small Phillips screwdriver to remove the screws securing the truss rod cover or a small flat-blade screwdriver to \"pop\" or pry off the truss rod cover."
                },
                {
                    "headline": "Use an appropriately sized allen wrench to adjust the truss rod.",
                    "description": "If the neck needs less relief, you will tighten the truss rod by turning the truss rod nut clockwise. If the neck needs more relief, you will turn the truss rod nut counterclockwise."
                },
                {
                    "headline": "Adjust the truss rod a 1/8-turn at a time.",
                    "description": "After a 1/8-turn, tune the strings again and remeasure the string height."
                },
                {
                    "headline": "Make additional truss rod adjustments with no more that a 1/8-turn at a time, retuning and remeasuring after each adjustment.",
                    "description": ""
                },
                {
                    "headline": "Test your truss rod adjustment by fretting each string of the bass at each fret.",
                    "description": "If there is fret buzz when playing at any of the first 5 frets, the neck is too straight and the truss rod needs to be loosened. If there is fret buzz only above the 12th fret, there is too much relief in the neck and the truss rod needs to be tightened. If there is fret buzz consistently up the neck, the truss rod is likely set properly and the bridge needs to be raised to adjust the action."
                }
            ]
        },
        {
            "name": "Adjust the Action",
            "steps": [
                {
                    "headline": "Raise or lower the bridge or the individual string saddles on the bridge.",
                    "description": "If your bass does not have individual saddle height adjusting screws, you must adjust the action by raising or lowering the entire bridge. There are many bridge designs, each with its own specific adjustment features. Select the proper tool for the adjustment hardware on your bass. Typically, tightening (turning clockwise) bridge height adjusters will raise the action and loosening (turning counterclockwise) bridge adjustment adjusters will lower the action. If your bass has individual saddle height adjusting screws, make general action adjustments by raising or lowering the entire bridge, then make your final adjustments by changing the height of the individual string saddles. Individual string saddles are generally adjusted with allen wrenches."
                },
                {
                    "headline": "Test your action adjustments by playing your bass at each fret.",
                    "description": "You have lowered the action too much if you hear fret buzz."
                }
            ]
        }
    ],
    "tyn": [
        "Electronic tuner",
        "Capo",
        "Feeler gauge",
        "Small Phillips screwdriver",
        "Small flat-blade screwdriver",
        "Allen wrenches"
    ],
    "text": " Inspect the Neck of the Bass Wait at least 30 minutes after any significant change in string tension before inspecting or adjusting the neck of your bass. It takes time for the neck of a bass to settle into its final position after significant changes have been made to the forces applied to it. Waiting longer periods will increase the accuracy of your adjustments. Determine the relief, or bow, in the neck. The neck of your bass must have a slight bow to play properly. If the neck were straight, you would get fret buzz, especially on notes played on the first 5 frets. If you have a capo, attach it at the first fret; otherwise, hold down the E-string (or B-string on a 5-string bass) at the 1st fret with your left index finger. Hold the string down at the 12th fret with your right thumb or right elbow. Use a feeler gauge to determine the largest gap between the string and the tops of the 4th through 8th frets. If the string is touching any of these frets, the neck needs more relief. If the gap between the string and any of these frets is greater than 0.020 inch (0.5 mm), then the neck needs less relief. Alternatively, attach a capo at the first fret or hold down the G-string at the 1st fret with your left index finger. Press the G-string down at the end of the neck with your elbow. Use a feeler gauge to measure the gap between the bottom of the string and the top of the 8th fret. If the gap exceeds 0.012 inch (0.3 mm), the neck needs less relief. If there is no gap, the neck needs more relief. The truss rod needs to be adjusted if inspection of the neck indicates that it needs either more or less relief. Adjust the Truss Rod Remove the truss rod cover on the headstock, just beyond the nut. Depending on the model of your bass, you will need a small Phillips screwdriver to remove the screws securing the truss rod cover or a small flat-blade screwdriver to \"pop\" or pry off the truss rod cover. Use an appropriately sized allen wrench to adjust the truss rod. If the neck needs less relief, you will tighten the truss rod by turning the truss rod nut clockwise. If the neck needs more relief, you will turn the truss rod nut counterclockwise. Adjust the truss rod a 1/8-turn at a time. After a 1/8-turn, tune the strings again and remeasure the string height. Make additional truss rod adjustments with no more that a 1/8-turn at a time, retuning and remeasuring after each adjustment.  Test your truss rod adjustment by fretting each string of the bass at each fret. If there is fret buzz when playing at any of the first 5 frets, the neck is too straight and the truss rod needs to be loosened. If there is fret buzz only above the 12th fret, there is too much relief in the neck and the truss rod needs to be tightened. If there is fret buzz consistently up the neck, the truss rod is likely set properly and the bridge needs to be raised to adjust the action. Adjust the Action Raise or lower the bridge or the individual string saddles on the bridge. If your bass does not have individual saddle height adjusting screws, you must adjust the action by raising or lowering the entire bridge. There are many bridge designs, each with its own specific adjustment features. Select the proper tool for the adjustment hardware on your bass. Typically, tightening (turning clockwise) bridge height adjusters will raise the action and loosening (turning counterclockwise) bridge adjustment adjusters will lower the action. If your bass has individual saddle height adjusting screws, make general action adjustments by raising or lowering the entire bridge, then make your final adjustments by changing the height of the individual string saddles. Individual string saddles are generally adjusted with allen wrenches. Test your action adjustments by playing your bass at each fret. You have lowered the action too much if you hear fret buzz.",
    "sentences": [
        " Inspect the Neck of the Bass Wait at least 30 minutes after any significant change in string tension before inspecting or adjusting the neck of your bass.",
        "It takes time for the neck of a bass to settle into its final position after significant changes have been made to the forces applied to it.",
        "Waiting longer periods will increase the accuracy of your adjustments.",
        "Determine the relief, or bow, in the neck.",
        "The neck of your bass must have a slight bow to play properly.",
        "If the neck were straight, you would get fret buzz, especially on notes played on the first 5 frets.",
        "If you have a capo, attach it at the first fret; otherwise, hold down the E-string (or B-string on a 5-string bass) at the 1st fret with your left index finger.",
        "Hold the string down at the 12th fret with your right thumb or right elbow.",
        "Use a feeler gauge to determine the largest gap between the string and the tops of the 4th through 8th frets.",
        "If the string is touching any of these frets, the neck needs more relief.",
        "If the gap between the string and any of these frets is greater than 0.020 inch (0.5 mm), then the neck needs less relief.",
        "Alternatively, attach a capo at the first fret or hold down the G-string at the 1st fret with your left index finger.",
        "Press the G-string down at the end of the neck with your elbow.",
        "Use a feeler gauge to measure the gap between the bottom of the string and the top of the 8th fret.",
        "If the gap exceeds 0.012 inch (0.3 mm), the neck needs less relief.",
        "If there is no gap, the neck needs more relief.",
        "The truss rod needs to be adjusted if inspection of the neck indicates that it needs either more or less relief.",
        "Adjust the Truss Rod Remove the truss rod cover on the headstock, just beyond the nut.",
        "Depending on the model of your bass, you will need a small Phillips screwdriver to remove the screws securing the truss rod cover or a small flat-blade screwdriver to \"pop\" or pry off the truss rod cover.",
        "Use an appropriately sized allen wrench to adjust the truss rod.",
        "If the neck needs less relief, you will tighten the truss rod by turning the truss rod nut clockwise.",
        "If the neck needs more relief, you will turn the truss rod nut counterclockwise.",
        "Adjust the truss rod a 1/8-turn at a time.",
        "After a 1/8-turn, tune the strings again and remeasure the string height.",
        "Make additional truss rod adjustments with no more that a 1/8-turn at a time, retuning and remeasuring after each adjustment.",
        "Test your truss rod adjustment by fretting each string of the bass at each fret.",
        "If there is fret buzz when playing at any of the first 5 frets, the neck is too straight and the truss rod needs to be loosened.",
        "If there is fret buzz only above the 12th fret, there is too much relief in the neck and the truss rod needs to be tightened.",
        "If there is fret buzz consistently up the neck, the truss rod is likely set properly and the bridge needs to be raised to adjust the action.",
        "Adjust the Action Raise or lower the bridge or the individual string saddles on the bridge.",
        "If your bass does not have individual saddle height adjusting screws, you must adjust the action by raising or lowering the entire bridge.",
        "There are many bridge designs, each with its own specific adjustment features.",
        "Select the proper tool for the adjustment hardware on your bass.",
        "Typically, tightening (turning clockwise) bridge height adjusters will raise the action and loosening (turning counterclockwise) bridge adjustment adjusters will lower the action.",
        "If your bass has individual saddle height adjusting screws, make general action adjustments by raising or lowering the entire bridge, then make your final adjustments by changing the height of the individual string saddles.",
        "Individual string saddles are generally adjusted with allen wrenches.",
        "Test your action adjustments by playing your bass at each fret.",
        "You have lowered the action too much if you hear fret buzz."
    ]
}