{
    "title": "How to Burn a CD in Ubuntu Linux",
    "url": "https://www.wikihow.com/Burn-a-CD-in-Ubuntu-Linux",
    "category_hierarchy": [
        "Computers and Electronics",
        "Operating Systems",
        "Linux",
        "Ubuntu"
    ],
    "steps": [
        {
            "headline": "Download Brasero (a free Open-source CD burning/maker utility for GNOME).",
            "description": "To do this click and open Ubuntu Software centre. It is included in recent versions of ubuntu. If not, you can download it."
        },
        {
            "headline": "Type Brasero in search.",
            "description": ""
        },
        {
            "headline": "You will find it in the list.",
            "description": "Click on it and then click on Install Button to install it."
        },
        {
            "headline": "After the program is installed, open it by going in Dashboard and typing Brasero.",
            "description": ""
        },
        {
            "headline": "When GnomeBaker opens you have a variety of options.",
            "description": "If you wish to make a Data CD, click Data CD near the bottom. Add the files and click \"Burn\"\nIf you want to make an Audio CD, click Audio CD instead of Data CD. You may need to download some extra codecs and libraries for certain audio formats. Add the music and hit \"Burn\"."
        }
    ],
    "tyn": [
        "A CD or a DVD",
        "1 or more files to burn",
        "Ubuntu Linux (or a GNOME based distro that is based on Debian)",
        "A CD and/or DVD burner"
    ],
    "text": " Download Brasero (a free Open-source CD burning/maker utility for GNOME). To do this click and open Ubuntu Software centre. It is included in recent versions of ubuntu. If not, you can download it. Type Brasero in search.  You will find it in the list. Click on it and then click on Install Button to install it. After the program is installed, open it by going in Dashboard and typing Brasero.  When GnomeBaker opens you have a variety of options. If you wish to make a Data CD, click Data CD near the bottom. Add the files and click \"Burn\"\nIf you want to make an Audio CD, click Audio CD instead of Data CD. You may need to download some extra codecs and libraries for certain audio formats. Add the music and hit \"Burn\".",
    "sentences": [
        " Download Brasero (a free Open-source CD burning/maker utility for GNOME).",
        "To do this click and open Ubuntu Software centre.",
        "It is included in recent versions of ubuntu.",
        "If not, you can download it.",
        "Type Brasero in search.",
        "You will find it in the list.",
        "Click on it and then click on Install Button to install it.",
        "After the program is installed, open it by going in Dashboard and typing Brasero.",
        "When GnomeBaker opens you have a variety of options.",
        "If you wish to make a Data CD, click Data CD near the bottom.",
        "Add the files and click \"Burn\"\nIf you want to make an Audio CD, click Audio CD instead of Data CD.",
        "You may need to download some extra codecs and libraries for certain audio formats.",
        "Add the music and hit \"Burn\"."
    ]
}