{
    "title": "How to Draw a Bow and Arrow",
    "url": "https://www.wikihow.com/Draw-a-Bow-and-Arrow",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Drawing",
        "Drawing Objects",
        "Drawing Weaponry"
    ],
    "steps": [
        {
            "headline": "Draw the body of the bow.",
            "description": "Make a curve that bends upwards on the tip; it should look something like a handle. Then add two rectangles on top of the peak of the curve. This will make the grip of the bow."
        },
        {
            "headline": "Draw a straight line from one tip of the bow to the other.",
            "description": "Add a very slim rectangle next to it--this will be the body of the arrow."
        },
        {
            "headline": "Draw six rectangle shapes for the feathers like this.",
            "description": "They should all be concentrated at one end, with three on each side."
        },
        {
            "headline": "Draw a pointy triangle for the tip of the arrow that does not have feathers.",
            "description": "Make it isosceles and relatively thin, pointing downward as seen."
        },
        {
            "headline": "Paint your image.",
            "description": "Use a color you like for the bow.You can make the grip of a different color. Remember the tip of the arrow should look like metal, so use silver or grey."
        }
    ],
    "tyn": [
        "A pencil",
        "A piece of paper",
        "Crayons",
        "Eraser",
        "Markers",
        "Colored pencils"
    ],
    "text": " Draw the body of the bow. Make a curve that bends upwards on the tip; it should look something like a handle. Then add two rectangles on top of the peak of the curve. This will make the grip of the bow. Draw a straight line from one tip of the bow to the other. Add a very slim rectangle next to it--this will be the body of the arrow. Draw six rectangle shapes for the feathers like this. They should all be concentrated at one end, with three on each side. Draw a pointy triangle for the tip of the arrow that does not have feathers. Make it isosceles and relatively thin, pointing downward as seen. Paint your image. Use a color you like for the bow.You can make the grip of a different color. Remember the tip of the arrow should look like metal, so use silver or grey.",
    "sentences": [
        " Draw the body of the bow.",
        "Make a curve that bends upwards on the tip; it should look something like a handle.",
        "Then add two rectangles on top of the peak of the curve.",
        "This will make the grip of the bow.",
        "Draw a straight line from one tip of the bow to the other.",
        "Add a very slim rectangle next to it--this will be the body of the arrow.",
        "Draw six rectangle shapes for the feathers like this.",
        "They should all be concentrated at one end, with three on each side.",
        "Draw a pointy triangle for the tip of the arrow that does not have feathers.",
        "Make it isosceles and relatively thin, pointing downward as seen.",
        "Paint your image.",
        "Use a color you like for the bow.You can make the grip of a different color.",
        "Remember the tip of the arrow should look like metal, so use silver or grey."
    ]
}