{
    "title": "How to Plan a Pool Party",
    "url": "https://www.wikihow.com/Plan-a-Pool-Party",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Swimming"
    ],
    "parts": [
        {
            "name": "Choosing the Date and Location",
            "steps": [
                {
                    "headline": "Decide on a date.",
                    "description": "Pool parties usually take place in the summer and are located outside, to enjoy the nice weather. When picking a date for your pool party you will want to consider the weather. You want a warm day, with no rain in the forecast. It is also best to host your pool party on the weekend, so more people are able to attend. In case you have to cancel due to poor weather, you may want to schedule a rain date. This is especially important if you live in a rainy area and are hosting outside. If you are planning your pool party to celebrate an event, such as a birthday, you may want to pick a date close to the event."
                },
                {
                    "headline": "Find a pool.",
                    "description": "The most important component of a pool party is having a pool for you and your guests to use. There are a variety of options for finding a pool for your party. Using your own pool or a friend or family members' pool: If you have a pool, hosting at your own house is convenient and provides a private location for your party. Many communities have pools that are open for use by the public. There is often a small fee to use community pools, but they are very reasonably priced. Some hotels with pools and swim attractions will allow you to purchase day passes to use the facilities without staying at the hotel. There are indoor and outdoor options of both hotel pools and water parks."
                },
                {
                    "headline": "Compare venues.",
                    "description": "If you don’t have your own pool to use, you will want to compare your options to find the best fit for your party. When picking your location you will want to consider a few different factors, such as, price, size of pool, location, rules and regulations, availability, and other amenities. Pick a pool that fits your budget. For example, going to a hotel or water park will be a more expensive option. Some hotels and water parks have party packages that include extra services to help cater to your party."
                }
            ]
        },
        {
            "name": "Inviting Guests",
            "steps": [
                {
                    "headline": "Set the guest list.",
                    "description": "When deciding on your guest list keep in mind the size of the party space and pool. You want to have a manageable number of guests that will fit the space. If you are planning a kids pool party, you should also take into account parents that may want to attend with their child."
                },
                {
                    "headline": "Choose a type of invitation.",
                    "description": "You should first decide on the type of invitation you want to send. There are a few options to consider: evites, mailed invites, or handout invites. You could also invite guests via social media outlets, such as a facebook event page."
                },
                {
                    "headline": "Determine what to include in your invitations.",
                    "description": "Make sure your invitations include the important party details. You want your invitations to be informative and clear. They should include:\nThe date and time of the party. The location of the party. A list of items guests should bring to the party, such as, a bathing suit, a towel, sunscreen, change of clothes, sandals/footwear, lawn-chair, and if they are required to bring any food or beverages. The theme of your party. RSVP and contact information, so your guests can confirm their attendance. A scheduled rain date and information on how party cancellation will be communicated."
                },
                {
                    "headline": "Send the invitations.",
                    "description": "Send out your invitations two to three weeks in advance of your party. This will ensure that more people will be available to attend, as it is less likely that they are already busy that date. It also gives guests more time to respond and plan to attend."
                },
                {
                    "headline": "Finalize attendance.",
                    "description": "Once you have heard back from all of your invited guests, you should tally how many people will be attending. This is important for organizing other aspects of your party, such as, food, drinks, games, seating, supervision, and safety."
                }
            ]
        },
        {
            "name": "Preparing Food and Drinks",
            "steps": [
                {
                    "headline": "Decide on snacks and drinks.",
                    "description": "It is a good idea to provide some snacks and drinks at a pool party because guest will get hungry from swimming and playing in the water. Setting out light snacks and finger foods is easy and will keep party goers happy. You could serve some of the following snacks and drinks:\nA fruit and vegetable tray. Chips and dip or corn chips and salsa. Popsicles. Crackers and cheese. Water, lemonade, iced tea, pop, juice, punch, etc. Alcoholic beverages for adults."
                },
                {
                    "headline": "Consider providing a meal.",
                    "description": "Pool parties often last close to a full day or afternoon, so it may be necessary to provide more food than just snacks. Options for meals can include:\nHaving a potluck: You can have each guest bring a dish to share with everyone at the party. Grilling or barbecuing: If you are hosting in a backyard and/or have access to a barbecue you could cook hamburgers, hotdogs, grilled veggies, etc. Ordering food: If you don’t want to cook, or you have a large number of guests, you may want to order food, such as, pizza or other takeout food."
                },
                {
                    "headline": "Organize supplies.",
                    "description": "When serving food or drinks at your party, you will need supplies such as, serving trays, bowls, cups, cutlery, plates, napkins, ice, coolers, etc. Make sure you have enough supplies for the number of guests that you are serving. Also, it is a good idea to serve food on paper or plastic plates, so you don’t have breakable dishes near the pool area."
                }
            ]
        },
        {
            "name": "Creating a Party Atmosphere",
            "steps": [
                {
                    "headline": "Consider games and activities for the party.",
                    "description": "Depending on the type of party and location, you may want to have some games, toys, or activities available to entertain your guests. Some games include: Marco polo, treasure hunt, sharks and minnows, octopus, volleyball, etc. You could also provide water toys, such as beach balls, pool noodles, floating devices, rings and retrieval objects, water balloons, squirt guns, etc."
                },
                {
                    "headline": "Prepare music to play.",
                    "description": "Music will help create a great party atmosphere. You can create your own playlist or find one on a music streaming site, such as Spotify. When preparing music also consider, a portable and waterproof speaker to play your music at the pool area. If your party has a theme, you can have your music match. For example, play Caribbean music at a tropical themed party. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNatasha Miller\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEvent Planner & CEO, Entire Productions\t\t\t\t\t\t\t\tNatasha Miller is an Event Planner, Chief Experience Designer, and President of Entire Productions, an event and entertainment production company based in San Francisco, California. Notable clients Natasha has collaborated with include Apple, Google, Gap, Louis Vuitton, Tiffany & Co., and Salesforce. Natasha and Entire Productions has been awarded Inc. 5,000's \"Fastest Growing Companies in America\", Entrepreneur Magazine's 360 List of \"Best Entrepreneurial Companies in America.\" Entire Productions is also a Certified Women Business Enterprise. Natasha is a member of Meeting Professionals International (MPI). Natasha Miller\t\t\tEvent Planner & CEO, Entire Productions\t\t\t\tWhen you're planning the music for a party, keep the demographics of the entire group in mind. For instance, if you love old country music but nobody else does, you shouldn't make the playlist all that type of music. Instead, try to feature different types of music that will appeal to everyone."
                },
                {
                    "headline": "Add decorations.",
                    "description": "Some popular pool party decorations include, tiki torches, lanterns, flowers, balloons, signs for food and drink stations, colourful tablecloths, etc. If you are throwing a birthday pool party, you might want to have birthday decorations, such as balloons, streamers, and banners. Alternatively, if your pool party has a specific theme, you will want your decorations to match the theme. If you are hosting your party at a public pool or hotel, you may have to check with them to see if you are allowed to bring decorations."
                }
            ]
        }
    ],
    "tyn": [
        "A pool",
        "Food",
        "Invitations",
        "Extra towels",
        "Extra sunscreen",
        "Music",
        "Pool toys (floats, water balls, rings, noodles etc.)",
        "Water games"
    ],
    "text": " Choosing the Date and Location Decide on a date. Pool parties usually take place in the summer and are located outside, to enjoy the nice weather. When picking a date for your pool party you will want to consider the weather. You want a warm day, with no rain in the forecast. It is also best to host your pool party on the weekend, so more people are able to attend. In case you have to cancel due to poor weather, you may want to schedule a rain date. This is especially important if you live in a rainy area and are hosting outside. If you are planning your pool party to celebrate an event, such as a birthday, you may want to pick a date close to the event. Find a pool. The most important component of a pool party is having a pool for you and your guests to use. There are a variety of options for finding a pool for your party. Using your own pool or a friend or family members' pool: If you have a pool, hosting at your own house is convenient and provides a private location for your party. Many communities have pools that are open for use by the public. There is often a small fee to use community pools, but they are very reasonably priced. Some hotels with pools and swim attractions will allow you to purchase day passes to use the facilities without staying at the hotel. There are indoor and outdoor options of both hotel pools and water parks. Compare venues. If you don’t have your own pool to use, you will want to compare your options to find the best fit for your party. When picking your location you will want to consider a few different factors, such as, price, size of pool, location, rules and regulations, availability, and other amenities. Pick a pool that fits your budget. For example, going to a hotel or water park will be a more expensive option. Some hotels and water parks have party packages that include extra services to help cater to your party. Inviting Guests Set the guest list. When deciding on your guest list keep in mind the size of the party space and pool. You want to have a manageable number of guests that will fit the space. If you are planning a kids pool party, you should also take into account parents that may want to attend with their child. Choose a type of invitation. You should first decide on the type of invitation you want to send. There are a few options to consider: evites, mailed invites, or handout invites. You could also invite guests via social media outlets, such as a facebook event page. Determine what to include in your invitations. Make sure your invitations include the important party details. You want your invitations to be informative and clear. They should include:\nThe date and time of the party. The location of the party. A list of items guests should bring to the party, such as, a bathing suit, a towel, sunscreen, change of clothes, sandals/footwear, lawn-chair, and if they are required to bring any food or beverages. The theme of your party. RSVP and contact information, so your guests can confirm their attendance. A scheduled rain date and information on how party cancellation will be communicated. Send the invitations. Send out your invitations two to three weeks in advance of your party. This will ensure that more people will be available to attend, as it is less likely that they are already busy that date. It also gives guests more time to respond and plan to attend. Finalize attendance. Once you have heard back from all of your invited guests, you should tally how many people will be attending. This is important for organizing other aspects of your party, such as, food, drinks, games, seating, supervision, and safety. Preparing Food and Drinks Decide on snacks and drinks. It is a good idea to provide some snacks and drinks at a pool party because guest will get hungry from swimming and playing in the water. Setting out light snacks and finger foods is easy and will keep party goers happy. You could serve some of the following snacks and drinks:\nA fruit and vegetable tray. Chips and dip or corn chips and salsa. Popsicles. Crackers and cheese. Water, lemonade, iced tea, pop, juice, punch, etc. Alcoholic beverages for adults. Consider providing a meal. Pool parties often last close to a full day or afternoon, so it may be necessary to provide more food than just snacks. Options for meals can include:\nHaving a potluck: You can have each guest bring a dish to share with everyone at the party. Grilling or barbecuing: If you are hosting in a backyard and/or have access to a barbecue you could cook hamburgers, hotdogs, grilled veggies, etc. Ordering food: If you don’t want to cook, or you have a large number of guests, you may want to order food, such as, pizza or other takeout food. Organize supplies. When serving food or drinks at your party, you will need supplies such as, serving trays, bowls, cups, cutlery, plates, napkins, ice, coolers, etc. Make sure you have enough supplies for the number of guests that you are serving. Also, it is a good idea to serve food on paper or plastic plates, so you don’t have breakable dishes near the pool area. Creating a Party Atmosphere Consider games and activities for the party. Depending on the type of party and location, you may want to have some games, toys, or activities available to entertain your guests. Some games include: Marco polo, treasure hunt, sharks and minnows, octopus, volleyball, etc. You could also provide water toys, such as beach balls, pool noodles, floating devices, rings and retrieval objects, water balloons, squirt guns, etc. Prepare music to play. Music will help create a great party atmosphere. You can create your own playlist or find one on a music streaming site, such as Spotify. When preparing music also consider, a portable and waterproof speaker to play your music at the pool area. If your party has a theme, you can have your music match. For example, play Caribbean music at a tropical themed party. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNatasha Miller\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEvent Planner & CEO, Entire Productions\t\t\t\t\t\t\t\tNatasha Miller is an Event Planner, Chief Experience Designer, and President of Entire Productions, an event and entertainment production company based in San Francisco, California. Notable clients Natasha has collaborated with include Apple, Google, Gap, Louis Vuitton, Tiffany & Co., and Salesforce. Natasha and Entire Productions has been awarded Inc. 5,000's \"Fastest Growing Companies in America\", Entrepreneur Magazine's 360 List of \"Best Entrepreneurial Companies in America.\" Entire Productions is also a Certified Women Business Enterprise. Natasha is a member of Meeting Professionals International (MPI). Natasha Miller\t\t\tEvent Planner & CEO, Entire Productions\t\t\t\tWhen you're planning the music for a party, keep the demographics of the entire group in mind. For instance, if you love old country music but nobody else does, you shouldn't make the playlist all that type of music. Instead, try to feature different types of music that will appeal to everyone. Add decorations. Some popular pool party decorations include, tiki torches, lanterns, flowers, balloons, signs for food and drink stations, colourful tablecloths, etc. If you are throwing a birthday pool party, you might want to have birthday decorations, such as balloons, streamers, and banners. Alternatively, if your pool party has a specific theme, you will want your decorations to match the theme. If you are hosting your party at a public pool or hotel, you may have to check with them to see if you are allowed to bring decorations.",
    "sentences": [
        " Choosing the Date and Location Decide on a date.",
        "Pool parties usually take place in the summer and are located outside, to enjoy the nice weather.",
        "When picking a date for your pool party you will want to consider the weather.",
        "You want a warm day, with no rain in the forecast.",
        "It is also best to host your pool party on the weekend, so more people are able to attend.",
        "In case you have to cancel due to poor weather, you may want to schedule a rain date.",
        "This is especially important if you live in a rainy area and are hosting outside.",
        "If you are planning your pool party to celebrate an event, such as a birthday, you may want to pick a date close to the event.",
        "Find a pool.",
        "The most important component of a pool party is having a pool for you and your guests to use.",
        "There are a variety of options for finding a pool for your party.",
        "Using your own pool or a friend or family members' pool: If you have a pool, hosting at your own house is convenient and provides a private location for your party.",
        "Many communities have pools that are open for use by the public.",
        "There is often a small fee to use community pools, but they are very reasonably priced.",
        "Some hotels with pools and swim attractions will allow you to purchase day passes to use the facilities without staying at the hotel.",
        "There are indoor and outdoor options of both hotel pools and water parks.",
        "Compare venues.",
        "If you don’t have your own pool to use, you will want to compare your options to find the best fit for your party.",
        "When picking your location you will want to consider a few different factors, such as, price, size of pool, location, rules and regulations, availability, and other amenities.",
        "Pick a pool that fits your budget.",
        "For example, going to a hotel or water park will be a more expensive option.",
        "Some hotels and water parks have party packages that include extra services to help cater to your party.",
        "Inviting Guests Set the guest list.",
        "When deciding on your guest list keep in mind the size of the party space and pool.",
        "You want to have a manageable number of guests that will fit the space.",
        "If you are planning a kids pool party, you should also take into account parents that may want to attend with their child.",
        "Choose a type of invitation.",
        "You should first decide on the type of invitation you want to send.",
        "There are a few options to consider: evites, mailed invites, or handout invites.",
        "You could also invite guests via social media outlets, such as a facebook event page.",
        "Determine what to include in your invitations.",
        "Make sure your invitations include the important party details.",
        "You want your invitations to be informative and clear.",
        "They should include:\nThe date and time of the party.",
        "The location of the party.",
        "A list of items guests should bring to the party, such as, a bathing suit, a towel, sunscreen, change of clothes, sandals/footwear, lawn-chair, and if they are required to bring any food or beverages.",
        "The theme of your party.",
        "RSVP and contact information, so your guests can confirm their attendance.",
        "A scheduled rain date and information on how party cancellation will be communicated.",
        "Send the invitations.",
        "Send out your invitations two to three weeks in advance of your party.",
        "This will ensure that more people will be available to attend, as it is less likely that they are already busy that date.",
        "It also gives guests more time to respond and plan to attend.",
        "Finalize attendance.",
        "Once you have heard back from all of your invited guests, you should tally how many people will be attending.",
        "This is important for organizing other aspects of your party, such as, food, drinks, games, seating, supervision, and safety.",
        "Preparing Food and Drinks Decide on snacks and drinks.",
        "It is a good idea to provide some snacks and drinks at a pool party because guest will get hungry from swimming and playing in the water.",
        "Setting out light snacks and finger foods is easy and will keep party goers happy.",
        "You could serve some of the following snacks and drinks:\nA fruit and vegetable tray.",
        "Chips and dip or corn chips and salsa.",
        "Popsicles.",
        "Crackers and cheese.",
        "Water, lemonade, iced tea, pop, juice, punch, etc.",
        "Alcoholic beverages for adults.",
        "Consider providing a meal.",
        "Pool parties often last close to a full day or afternoon, so it may be necessary to provide more food than just snacks.",
        "Options for meals can include:\nHaving a potluck: You can have each guest bring a dish to share with everyone at the party.",
        "Grilling or barbecuing: If you are hosting in a backyard and/or have access to a barbecue you could cook hamburgers, hotdogs, grilled veggies, etc.",
        "Ordering food: If you don’t want to cook, or you have a large number of guests, you may want to order food, such as, pizza or other takeout food.",
        "Organize supplies.",
        "When serving food or drinks at your party, you will need supplies such as, serving trays, bowls, cups, cutlery, plates, napkins, ice, coolers, etc.",
        "Make sure you have enough supplies for the number of guests that you are serving.",
        "Also, it is a good idea to serve food on paper or plastic plates, so you don’t have breakable dishes near the pool area.",
        "Creating a Party Atmosphere Consider games and activities for the party.",
        "Depending on the type of party and location, you may want to have some games, toys, or activities available to entertain your guests.",
        "Some games include: Marco polo, treasure hunt, sharks and minnows, octopus, volleyball, etc.",
        "You could also provide water toys, such as beach balls, pool noodles, floating devices, rings and retrieval objects, water balloons, squirt guns, etc.",
        "Prepare music to play.",
        "Music will help create a great party atmosphere.",
        "You can create your own playlist or find one on a music streaming site, such as Spotify.",
        "When preparing music also consider, a portable and waterproof speaker to play your music at the pool area.",
        "If your party has a theme, you can have your music match.",
        "For example, play Caribbean music at a tropical themed party.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNatasha Miller\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEvent Planner & CEO, Entire Productions\t\t\t\t\t\t\t\tNatasha Miller is an Event Planner, Chief Experience Designer, and President of Entire Productions, an event and entertainment production company based in San Francisco, California.",
        "Notable clients Natasha has collaborated with include Apple, Google, Gap, Louis Vuitton, Tiffany & Co., and Salesforce.",
        "Natasha and Entire Productions has been awarded Inc. 5,000's \"Fastest Growing Companies in America\", Entrepreneur Magazine's 360 List of \"Best Entrepreneurial Companies in America.\"",
        "Entire Productions is also a Certified Women Business Enterprise.",
        "Natasha is a member of Meeting Professionals International (MPI).",
        "Natasha Miller\t\t\tEvent Planner & CEO, Entire Productions\t\t\t\tWhen you're planning the music for a party, keep the demographics of the entire group in mind.",
        "For instance, if you love old country music but nobody else does, you shouldn't make the playlist all that type of music.",
        "Instead, try to feature different types of music that will appeal to everyone.",
        "Add decorations.",
        "Some popular pool party decorations include, tiki torches, lanterns, flowers, balloons, signs for food and drink stations, colourful tablecloths, etc.",
        "If you are throwing a birthday pool party, you might want to have birthday decorations, such as balloons, streamers, and banners.",
        "Alternatively, if your pool party has a specific theme, you will want your decorations to match the theme.",
        "If you are hosting your party at a public pool or hotel, you may have to check with them to see if you are allowed to bring decorations."
    ]
}