{
    "title": "How to Clean an Oil Painting",
    "url": "https://www.wikihow.com/Clean-an-Oil-Painting",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "methods": [
        {
            "name": "Removing Surface Dirt with a Soft Brush",
            "steps": [
                {
                    "headline": "Place the oil painting on a stable surface.",
                    "description": "If the painting is stable where it's already hanging on the wall, you can leave it in place to clean it. However, it’s usually recommended that the painting be taken down and placed on a flat, stable table or propped up against a sturdy easel for the best results. Removing the painting from the wall also allows you to look at the painting in different lighting conditions and get a better view of the dirt on the surface."
                },
                {
                    "headline": "Select a dry, soft paintbrush.",
                    "description": "The larger the painting, the larger the brush should be. Otherwise, you might be dusting a large piece with a small paintbrush for hours! No matter what size you choose, feel the bristles first to make sure they’re soft and free of moisture before you get started. Sable bristled paintbrushes are known for their softness and considered to be safe for this procedure. Feather dusters may seem soft, but they are not recommended for this task. Feathers have barbs that can scratch the surface of an oil painting."
                },
                {
                    "headline": "Dust the first section gently with the paintbrush.",
                    "description": "Starting at one of the top corners, swish the paintbrush very lightly back and forth across the surface, working on several inches at a time. Then, work your way slowly down that section of the painting until you reach the bottom. Working from the top down ensures that the dust is removed rather than just moved around."
                },
                {
                    "headline": "Continue working in small sections until the entire painting is dusted.",
                    "description": "Move to the next section and, starting at the top, lightly brush back and forth as you work your way down the painting. Continue in this way until you’ve dusted the entire piece."
                },
                {
                    "headline": "Take your time and don’t increase the pressure of your brush strokes.",
                    "description": "This technique only removes superficial dust and dirt from the surface of the painting. Ingrained grime, deep soiling, stains, and other issues can’t be cleaned this way, no matter how hard you push the brush into the surface. Work slowly, be gentle, and take your time for the best results."
                }
            ]
        },
        {
            "name": "Cleaning with Saliva",
            "steps": [
                {
                    "headline": "Dampen the end of a cotton swab with your saliva.",
                    "description": "Brush the cotton swab lightly across your tongue until the cotton feels damp but not saturated. Using your spit to clean a work of art might seem extremely odd, but museum curators and other professionals around the world have been using this method effectively and safely for centuries! Saliva has enough enzymes to break down dirt and grime, but not so much that it will damage the paint. It’s best to use high-quality cotton swabs, since those tend to have the softest tips."
                },
                {
                    "headline": "Swipe one of the corners first to gauge the painting’s reaction.",
                    "description": "Before wiping down the entire painting with a Q-tip, it’s best to do a spot test in one of the corners so you can make sure the saliva isn’t damaging the surface. Saliva is generally considered to be safe and effective, but it's best to be cautious. If any of the paint color shows up on the cotton swab, do not proceed."
                },
                {
                    "headline": "Dab the moistened cotton swab over the painting in small sections.",
                    "description": "It’s best to work on 1 square inch of the surface at a time, so this technique can be very time-consuming. Don't move the cotton swab from side to side, though—swipe it up and down in small, light, dabbing motions."
                },
                {
                    "headline": "Switch to the clean end once the cotton swab starts to look grimy.",
                    "description": "Simply moisten the other end by running it over your tongue and continue swiping. When that end gets dirty, discard the swab and grab a fresh one. Depending on the size of the painting and how dirty it is, you may go through many, many Q-tips before your task is complete! It’s important to switch to a fresh swab frequently to avoid swiping the painting's surface with a dirty tool."
                }
            ]
        },
        {
            "name": "Conserving Valuable Paintings",
            "steps": [
                {
                    "headline": "Take valuable or antique oil paintings to a professional conservator.",
                    "description": "The surface of an oil painting is fragile, and it can be permanently changed or damaged by home cleaning techniques. If your oil painting is old, worth money, or holds great sentimental value, cleaning it at home is not recommended. Take it to a professional conservator to have it cleaned. Get valuable paintings insured before allowing a professional to clean it. If you're determined to clean the painting yourself, practice on a non-valuable oil painting first to gauge the results of your techniques."
                },
                {
                    "headline": "Do not use bread or potatoes to clean your oil painting.",
                    "description": "Many amateurs will tell you that wiping the surface of an oil painting with a slice of doughy bread or a cut potato is a great way to remove dirt and grime from the surface. This is not a good idea, especially if your painting is valuable or old. Food-based cleaning techniques can leave behind crumbs and residue. If your piece is extremely dirty and you’re willing to risk the possibility of damaging it, consider trying food-based techniques."
                },
                {
                    "headline": "Avoid water, rubbing alcohol, and baby oil.",
                    "description": "Using water can change the appearance of the oil paint on the canvas, and rubbing alcohol can remove the paint completely. Some people think that baby oil can return suppleness to the surface of an oil painting and make the colors look brighter, but baby oil actually makes the surface sticky and even more susceptible to attracting dirt. Your painting can be irreversibly damaged by using any of these substances to clean it. If you’re willing to take the risk, lightly dampen a soft cloth with water and brush the surface gently with it to remove dirt and grime."
                },
                {
                    "headline": "Take oil paintings to a professional conservator to remove varnish.",
                    "description": "Varnish is a clear protective layer on the surface of an oil painting. If the varnish looks dirty but you think the painting itself is clean underneath it, you may be tempted to remove the dirty varnish yourself and apply a fresh layer. Unless you’ve been trained or have experience with this, don’t attempt it. An oil painting can be permanently damaged if this is done improperly, affecting both the aesthetic and monetary value of the painting. If you decide to attempt this yourself, use a professional cleaning kit made for removing varnish from an oil painting."
                },
                {
                    "headline": "Accept that some pieces can't be cleaned with current techniques.",
                    "description": "If your painting is valuable, even a professional conservator may decide that the best approach is to leave it the way it is for now. Cleaning techniques are still being researched and developed by art historians, so a future development may be able to safely clean your valuable piece. You can keep up with current research and developments online."
                }
            ]
        }
    ],
    "tyn": [
        "Soft, dry paintbrush",
        "Cotton swabs"
    ],
    "text": " Removing Surface Dirt with a Soft Brush Place the oil painting on a stable surface. If the painting is stable where it's already hanging on the wall, you can leave it in place to clean it. However, it’s usually recommended that the painting be taken down and placed on a flat, stable table or propped up against a sturdy easel for the best results. Removing the painting from the wall also allows you to look at the painting in different lighting conditions and get a better view of the dirt on the surface. Select a dry, soft paintbrush. The larger the painting, the larger the brush should be. Otherwise, you might be dusting a large piece with a small paintbrush for hours! No matter what size you choose, feel the bristles first to make sure they’re soft and free of moisture before you get started. Sable bristled paintbrushes are known for their softness and considered to be safe for this procedure. Feather dusters may seem soft, but they are not recommended for this task. Feathers have barbs that can scratch the surface of an oil painting. Dust the first section gently with the paintbrush. Starting at one of the top corners, swish the paintbrush very lightly back and forth across the surface, working on several inches at a time. Then, work your way slowly down that section of the painting until you reach the bottom. Working from the top down ensures that the dust is removed rather than just moved around. Continue working in small sections until the entire painting is dusted. Move to the next section and, starting at the top, lightly brush back and forth as you work your way down the painting. Continue in this way until you’ve dusted the entire piece. Take your time and don’t increase the pressure of your brush strokes. This technique only removes superficial dust and dirt from the surface of the painting. Ingrained grime, deep soiling, stains, and other issues can’t be cleaned this way, no matter how hard you push the brush into the surface. Work slowly, be gentle, and take your time for the best results. Cleaning with Saliva Dampen the end of a cotton swab with your saliva. Brush the cotton swab lightly across your tongue until the cotton feels damp but not saturated. Using your spit to clean a work of art might seem extremely odd, but museum curators and other professionals around the world have been using this method effectively and safely for centuries! Saliva has enough enzymes to break down dirt and grime, but not so much that it will damage the paint. It’s best to use high-quality cotton swabs, since those tend to have the softest tips. Swipe one of the corners first to gauge the painting’s reaction. Before wiping down the entire painting with a Q-tip, it’s best to do a spot test in one of the corners so you can make sure the saliva isn’t damaging the surface. Saliva is generally considered to be safe and effective, but it's best to be cautious. If any of the paint color shows up on the cotton swab, do not proceed. Dab the moistened cotton swab over the painting in small sections. It’s best to work on 1 square inch of the surface at a time, so this technique can be very time-consuming. Don't move the cotton swab from side to side, though—swipe it up and down in small, light, dabbing motions. Switch to the clean end once the cotton swab starts to look grimy. Simply moisten the other end by running it over your tongue and continue swiping. When that end gets dirty, discard the swab and grab a fresh one. Depending on the size of the painting and how dirty it is, you may go through many, many Q-tips before your task is complete! It’s important to switch to a fresh swab frequently to avoid swiping the painting's surface with a dirty tool. Conserving Valuable Paintings Take valuable or antique oil paintings to a professional conservator. The surface of an oil painting is fragile, and it can be permanently changed or damaged by home cleaning techniques. If your oil painting is old, worth money, or holds great sentimental value, cleaning it at home is not recommended. Take it to a professional conservator to have it cleaned. Get valuable paintings insured before allowing a professional to clean it. If you're determined to clean the painting yourself, practice on a non-valuable oil painting first to gauge the results of your techniques. Do not use bread or potatoes to clean your oil painting. Many amateurs will tell you that wiping the surface of an oil painting with a slice of doughy bread or a cut potato is a great way to remove dirt and grime from the surface. This is not a good idea, especially if your painting is valuable or old. Food-based cleaning techniques can leave behind crumbs and residue. If your piece is extremely dirty and you’re willing to risk the possibility of damaging it, consider trying food-based techniques. Avoid water, rubbing alcohol, and baby oil. Using water can change the appearance of the oil paint on the canvas, and rubbing alcohol can remove the paint completely. Some people think that baby oil can return suppleness to the surface of an oil painting and make the colors look brighter, but baby oil actually makes the surface sticky and even more susceptible to attracting dirt. Your painting can be irreversibly damaged by using any of these substances to clean it. If you’re willing to take the risk, lightly dampen a soft cloth with water and brush the surface gently with it to remove dirt and grime. Take oil paintings to a professional conservator to remove varnish. Varnish is a clear protective layer on the surface of an oil painting. If the varnish looks dirty but you think the painting itself is clean underneath it, you may be tempted to remove the dirty varnish yourself and apply a fresh layer. Unless you’ve been trained or have experience with this, don’t attempt it. An oil painting can be permanently damaged if this is done improperly, affecting both the aesthetic and monetary value of the painting. If you decide to attempt this yourself, use a professional cleaning kit made for removing varnish from an oil painting. Accept that some pieces can't be cleaned with current techniques. If your painting is valuable, even a professional conservator may decide that the best approach is to leave it the way it is for now. Cleaning techniques are still being researched and developed by art historians, so a future development may be able to safely clean your valuable piece. You can keep up with current research and developments online.",
    "sentences": [
        " Removing Surface Dirt with a Soft Brush Place the oil painting on a stable surface.",
        "If the painting is stable where it's already hanging on the wall, you can leave it in place to clean it.",
        "However, it’s usually recommended that the painting be taken down and placed on a flat, stable table or propped up against a sturdy easel for the best results.",
        "Removing the painting from the wall also allows you to look at the painting in different lighting conditions and get a better view of the dirt on the surface.",
        "Select a dry, soft paintbrush.",
        "The larger the painting, the larger the brush should be.",
        "Otherwise, you might be dusting a large piece with a small paintbrush for hours!",
        "No matter what size you choose, feel the bristles first to make sure they’re soft and free of moisture before you get started.",
        "Sable bristled paintbrushes are known for their softness and considered to be safe for this procedure.",
        "Feather dusters may seem soft, but they are not recommended for this task.",
        "Feathers have barbs that can scratch the surface of an oil painting.",
        "Dust the first section gently with the paintbrush.",
        "Starting at one of the top corners, swish the paintbrush very lightly back and forth across the surface, working on several inches at a time.",
        "Then, work your way slowly down that section of the painting until you reach the bottom.",
        "Working from the top down ensures that the dust is removed rather than just moved around.",
        "Continue working in small sections until the entire painting is dusted.",
        "Move to the next section and, starting at the top, lightly brush back and forth as you work your way down the painting.",
        "Continue in this way until you’ve dusted the entire piece.",
        "Take your time and don’t increase the pressure of your brush strokes.",
        "This technique only removes superficial dust and dirt from the surface of the painting.",
        "Ingrained grime, deep soiling, stains, and other issues can’t be cleaned this way, no matter how hard you push the brush into the surface.",
        "Work slowly, be gentle, and take your time for the best results.",
        "Cleaning with Saliva Dampen the end of a cotton swab with your saliva.",
        "Brush the cotton swab lightly across your tongue until the cotton feels damp but not saturated.",
        "Using your spit to clean a work of art might seem extremely odd, but museum curators and other professionals around the world have been using this method effectively and safely for centuries!",
        "Saliva has enough enzymes to break down dirt and grime, but not so much that it will damage the paint.",
        "It’s best to use high-quality cotton swabs, since those tend to have the softest tips.",
        "Swipe one of the corners first to gauge the painting’s reaction.",
        "Before wiping down the entire painting with a Q-tip, it’s best to do a spot test in one of the corners so you can make sure the saliva isn’t damaging the surface.",
        "Saliva is generally considered to be safe and effective, but it's best to be cautious.",
        "If any of the paint color shows up on the cotton swab, do not proceed.",
        "Dab the moistened cotton swab over the painting in small sections.",
        "It’s best to work on 1 square inch of the surface at a time, so this technique can be very time-consuming.",
        "Don't move the cotton swab from side to side, though—swipe it up and down in small, light, dabbing motions.",
        "Switch to the clean end once the cotton swab starts to look grimy.",
        "Simply moisten the other end by running it over your tongue and continue swiping.",
        "When that end gets dirty, discard the swab and grab a fresh one.",
        "Depending on the size of the painting and how dirty it is, you may go through many, many Q-tips before your task is complete!",
        "It’s important to switch to a fresh swab frequently to avoid swiping the painting's surface with a dirty tool.",
        "Conserving Valuable Paintings Take valuable or antique oil paintings to a professional conservator.",
        "The surface of an oil painting is fragile, and it can be permanently changed or damaged by home cleaning techniques.",
        "If your oil painting is old, worth money, or holds great sentimental value, cleaning it at home is not recommended.",
        "Take it to a professional conservator to have it cleaned.",
        "Get valuable paintings insured before allowing a professional to clean it.",
        "If you're determined to clean the painting yourself, practice on a non-valuable oil painting first to gauge the results of your techniques.",
        "Do not use bread or potatoes to clean your oil painting.",
        "Many amateurs will tell you that wiping the surface of an oil painting with a slice of doughy bread or a cut potato is a great way to remove dirt and grime from the surface.",
        "This is not a good idea, especially if your painting is valuable or old.",
        "Food-based cleaning techniques can leave behind crumbs and residue.",
        "If your piece is extremely dirty and you’re willing to risk the possibility of damaging it, consider trying food-based techniques.",
        "Avoid water, rubbing alcohol, and baby oil.",
        "Using water can change the appearance of the oil paint on the canvas, and rubbing alcohol can remove the paint completely.",
        "Some people think that baby oil can return suppleness to the surface of an oil painting and make the colors look brighter, but baby oil actually makes the surface sticky and even more susceptible to attracting dirt.",
        "Your painting can be irreversibly damaged by using any of these substances to clean it.",
        "If you’re willing to take the risk, lightly dampen a soft cloth with water and brush the surface gently with it to remove dirt and grime.",
        "Take oil paintings to a professional conservator to remove varnish.",
        "Varnish is a clear protective layer on the surface of an oil painting.",
        "If the varnish looks dirty but you think the painting itself is clean underneath it, you may be tempted to remove the dirty varnish yourself and apply a fresh layer.",
        "Unless you’ve been trained or have experience with this, don’t attempt it.",
        "An oil painting can be permanently damaged if this is done improperly, affecting both the aesthetic and monetary value of the painting.",
        "If you decide to attempt this yourself, use a professional cleaning kit made for removing varnish from an oil painting.",
        "Accept that some pieces can't be cleaned with current techniques.",
        "If your painting is valuable, even a professional conservator may decide that the best approach is to leave it the way it is for now.",
        "Cleaning techniques are still being researched and developed by art historians, so a future development may be able to safely clean your valuable piece.",
        "You can keep up with current research and developments online."
    ]
}