{
    "title": "How to Create a Teacher Portfolio",
    "url": "https://www.wikihow.com/Create-a-Teacher-Portfolio",
    "category_hierarchy": [
        "Education and Communications"
    ],
    "methods": [
        {
            "name": "Content",
            "steps": [
                {
                    "headline": "Make copies of your diplomas and degrees.",
                    "description": ""
                },
                {
                    "headline": "Obtain copies of your teaching licenses and certificates.",
                    "description": ""
                },
                {
                    "headline": "Include your philosophy of teaching and the ability of students to learn.",
                    "description": "Your statement should be no more than 1-to-2 pages in length. The philosophy will describe your objectives as a teacher and how you plan to reach them. It will describe your idea of effective teaching and how you feel teachers should relate to students. You will describe your belief about what and how students are capable of learning."
                },
                {
                    "headline": "Create a resume that demonstrates your ability and skills to perform in the classroom as an educator.",
                    "description": "Include any grade level teaching experience that you have. Note substitute teaching, childcare center work, Sunday school or other child-related teaching."
                },
                {
                    "headline": "Acquire copies of evaluations conducted by administrators.",
                    "description": "This can include evaluations and reports from your supervisor during student teaching if you do not have a teaching job."
                },
                {
                    "headline": "Ask colleagues and supervisors to write letters of recommendation that attest to your good faith and ability to work with students.",
                    "description": ""
                },
                {
                    "headline": "Provide samples of lessons and/or lesson plans that show creativity and use of technology in the classroom.",
                    "description": "You should choose lessons that stand out from the typical lesson format. Include pictures, teacher-created materials and descriptions of the activities."
                },
                {
                    "headline": "Include samples of assessment tools used during teaching",
                    "description": "Use samples for assessment OF, AS, and FOR learning Rubrics, checklists, exams, charts, etc can be included"
                },
                {
                    "headline": "Collect students' work resulting from effective teaching methods that you have conducted.",
                    "description": "Always remove the students' names from the work."
                },
                {
                    "headline": "Supply proof of attendance to educational workshops and training sessions.",
                    "description": "Most sessions will give you a certificate of completion. Identify any continuing education activities including any graduate coursework, professional organization memberships, educational research and professional journal subscriptions."
                },
                {
                    "headline": "Document any educational or school activities that you manage outside of the classroom.",
                    "description": "These include coaching, team leadership, school improvement committees, parent and teacher organization participation and student tutoring."
                }
            ]
        },
        {
            "name": "Organization",
            "steps": [
                {
                    "headline": "Make a hard copy of all of the gathered documents and put them into a 3-ring binder or notebook.",
                    "description": "Add a cover to your notebook stating your name. Include a table of contents at the beginning. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/77\\/Create-a-Teacher-Portfolio-Step-13Bullet2.jpg\\/v4-460px-Create-a-Teacher-Portfolio-Step-13Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/77\\/Create-a-Teacher-Portfolio-Step-13Bullet2.jpg\\/v4-760px-Create-a-Teacher-Portfolio-Step-13Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nUse page protectors for your documents rather than punching holes. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Create-a-Teacher-Portfolio-Step-13Bullet3.jpg\\/v4-460px-Create-a-Teacher-Portfolio-Step-13Bullet3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Create-a-Teacher-Portfolio-Step-13Bullet3.jpg\\/v4-760px-Create-a-Teacher-Portfolio-Step-13Bullet3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nSequence the materials so your personal information, such as degrees, teaching license and philosophy, are first."
                },
                {
                    "headline": "Use a flash drive to make an electronic copy of your portfolio.",
                    "description": "Scan documents that are not already saved on your computer. The flash drive is easier to carry to interviews and provides proof that you make use of technology."
                },
                {
                    "headline": "Search for an online site to create an e-portfolio.",
                    "description": "Upload your documents and create slide shows and even videos of your teaching. You can provide a link to your work for those that you wish to access it online."
                },
                {
                    "headline": "Update the portfolio periodically to reflect recent development and growth in your profession.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Documents related to educational experience",
        "3-ring binder",
        "Page protectors",
        "Flash drive"
    ],
    "text": " Content Make copies of your diplomas and degrees.  Obtain copies of your teaching licenses and certificates.  Include your philosophy of teaching and the ability of students to learn. Your statement should be no more than 1-to-2 pages in length. The philosophy will describe your objectives as a teacher and how you plan to reach them. It will describe your idea of effective teaching and how you feel teachers should relate to students. You will describe your belief about what and how students are capable of learning. Create a resume that demonstrates your ability and skills to perform in the classroom as an educator. Include any grade level teaching experience that you have. Note substitute teaching, childcare center work, Sunday school or other child-related teaching. Acquire copies of evaluations conducted by administrators. This can include evaluations and reports from your supervisor during student teaching if you do not have a teaching job. Ask colleagues and supervisors to write letters of recommendation that attest to your good faith and ability to work with students.  Provide samples of lessons and/or lesson plans that show creativity and use of technology in the classroom. You should choose lessons that stand out from the typical lesson format. Include pictures, teacher-created materials and descriptions of the activities. Include samples of assessment tools used during teaching Use samples for assessment OF, AS, and FOR learning Rubrics, checklists, exams, charts, etc can be included Collect students' work resulting from effective teaching methods that you have conducted. Always remove the students' names from the work. Supply proof of attendance to educational workshops and training sessions. Most sessions will give you a certificate of completion. Identify any continuing education activities including any graduate coursework, professional organization memberships, educational research and professional journal subscriptions. Document any educational or school activities that you manage outside of the classroom. These include coaching, team leadership, school improvement committees, parent and teacher organization participation and student tutoring. Organization Make a hard copy of all of the gathered documents and put them into a 3-ring binder or notebook. Add a cover to your notebook stating your name. Include a table of contents at the beginning. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/77\\/Create-a-Teacher-Portfolio-Step-13Bullet2.jpg\\/v4-460px-Create-a-Teacher-Portfolio-Step-13Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/77\\/Create-a-Teacher-Portfolio-Step-13Bullet2.jpg\\/v4-760px-Create-a-Teacher-Portfolio-Step-13Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nUse page protectors for your documents rather than punching holes. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Create-a-Teacher-Portfolio-Step-13Bullet3.jpg\\/v4-460px-Create-a-Teacher-Portfolio-Step-13Bullet3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Create-a-Teacher-Portfolio-Step-13Bullet3.jpg\\/v4-760px-Create-a-Teacher-Portfolio-Step-13Bullet3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nSequence the materials so your personal information, such as degrees, teaching license and philosophy, are first. Use a flash drive to make an electronic copy of your portfolio. Scan documents that are not already saved on your computer. The flash drive is easier to carry to interviews and provides proof that you make use of technology. Search for an online site to create an e-portfolio. Upload your documents and create slide shows and even videos of your teaching. You can provide a link to your work for those that you wish to access it online. Update the portfolio periodically to reflect recent development and growth in your profession. ",
    "sentences": [
        " Content Make copies of your diplomas and degrees.",
        "Obtain copies of your teaching licenses and certificates.",
        "Include your philosophy of teaching and the ability of students to learn.",
        "Your statement should be no more than 1-to-2 pages in length.",
        "The philosophy will describe your objectives as a teacher and how you plan to reach them.",
        "It will describe your idea of effective teaching and how you feel teachers should relate to students.",
        "You will describe your belief about what and how students are capable of learning.",
        "Create a resume that demonstrates your ability and skills to perform in the classroom as an educator.",
        "Include any grade level teaching experience that you have.",
        "Note substitute teaching, childcare center work, Sunday school or other child-related teaching.",
        "Acquire copies of evaluations conducted by administrators.",
        "This can include evaluations and reports from your supervisor during student teaching if you do not have a teaching job.",
        "Ask colleagues and supervisors to write letters of recommendation that attest to your good faith and ability to work with students.",
        "Provide samples of lessons and/or lesson plans that show creativity and use of technology in the classroom.",
        "You should choose lessons that stand out from the typical lesson format.",
        "Include pictures, teacher-created materials and descriptions of the activities.",
        "Include samples of assessment tools used during teaching Use samples for assessment OF, AS, and FOR learning Rubrics, checklists, exams, charts, etc can be included Collect students' work resulting from effective teaching methods that you have conducted.",
        "Always remove the students' names from the work.",
        "Supply proof of attendance to educational workshops and training sessions.",
        "Most sessions will give you a certificate of completion.",
        "Identify any continuing education activities including any graduate coursework, professional organization memberships, educational research and professional journal subscriptions.",
        "Document any educational or school activities that you manage outside of the classroom.",
        "These include coaching, team leadership, school improvement committees, parent and teacher organization participation and student tutoring.",
        "Organization Make a hard copy of all of the gathered documents and put them into a 3-ring binder or notebook.",
        "Add a cover to your notebook stating your name.",
        "Include a table of contents at the beginning.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/77\\/Create-a-Teacher-Portfolio-Step-13Bullet2.jpg\\/v4-460px-Create-a-Teacher-Portfolio-Step-13Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/77\\/Create-a-Teacher-Portfolio-Step-13Bullet2.jpg\\/v4-760px-Create-a-Teacher-Portfolio-Step-13Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nUse page protectors for your documents rather than punching holes.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Create-a-Teacher-Portfolio-Step-13Bullet3.jpg\\/v4-460px-Create-a-Teacher-Portfolio-Step-13Bullet3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Create-a-Teacher-Portfolio-Step-13Bullet3.jpg\\/v4-760px-Create-a-Teacher-Portfolio-Step-13Bullet3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nSequence the materials so your personal information, such as degrees, teaching license and philosophy, are first.",
        "Use a flash drive to make an electronic copy of your portfolio.",
        "Scan documents that are not already saved on your computer.",
        "The flash drive is easier to carry to interviews and provides proof that you make use of technology.",
        "Search for an online site to create an e-portfolio.",
        "Upload your documents and create slide shows and even videos of your teaching.",
        "You can provide a link to your work for those that you wish to access it online.",
        "Update the portfolio periodically to reflect recent development and growth in your profession."
    ]
}