{
    "title": "How to Perform Hip Flexor Stretches",
    "url": "https://www.wikihow.com/Perform-Hip-Flexor-Stretches",
    "category_hierarchy": [
        "Sports and Fitness",
        "Personal Fitness",
        "Warm Ups Stretching and Flexibility"
    ],
    "methods": [
        {
            "name": "Yoga Poses to Stretch Hip Flexors",
            "steps": [
                {
                    "headline": "Do a yoga camel pose.",
                    "description": "In addition to stretching the hip flexors, the camel pose will open up the chest and increase the flexibility of the spine. The exercise tightens the waist and strengthens the arms and shoulders as well. Yogis believe that this posture opens up your respiratory system so that you can take in more oxygen with each breath. They also believe that the exercise helps to open the heart chakra to allow you to feel more connected to the world and to bestow forgiveness where needed in your life."
                },
                {
                    "headline": "Do the garland pose in yoga.",
                    "description": "The garland pose opens up the hips and improves balance. This pose will also increase flexibility in your thighs and ankles while toning your core. If the squatting maneuver is too difficult, then you can sit on a chair and lean your torso forward between your thighs. Make sure that your feet are on the ground and that your thighs form a 90-degree angle with your calves if you are using the chair for support."
                },
                {
                    "headline": "Do the reclined bound angle pose in yoga.",
                    "description": "This simple pose stretches the groin and inner thighs while opening up the chest. Make sure that your spine does not arch as you perform this pose. If you need support, you can place a pillow under your ankles to ease the stretch in your lower body or a pillow under your head so that you can avoid neck compression. This pose may also bring relief from fatigue, insomnia and mild depression."
                },
                {
                    "headline": "Do the perfect pose in yoga.",
                    "description": "The perfect pose opens your hips while stretching your ankles and your back. This pose is often used for meditation, and you can hold it for as long as needed to center yourself. Yogis believe that this posture releases nervous energy and helps people who suffer from disorders like asthma. Ancient yogis believed that the pose would help people to obtain supernatural powers."
                },
                {
                    "headline": "Do a downward facing frog exercise.",
                    "description": "The downward facing frog pose will open the hips as you lower your body toward the floor. To make this pose easier, place a small pillow or towel under your knees or ankles. If you feel a strain in your ankles, then squeeze them together rather than turning your feet out to the sides."
                }
            ]
        },
        {
            "name": "Other Stretches for Hip Flexors",
            "steps": [
                {
                    "headline": "Do a standing hip hinge.",
                    "description": "This is a good starter warmup exercise for opening up the hip flexors. Use your hands to support your back as you stretch the muscles in your groin. For an added challenge, kneel on the floor and then bend your upper body back. You’ll feel the stretch not only in your hip flexors but also in your quads."
                },
                {
                    "headline": "Do a 3D hip flexor stretch.",
                    "description": "This stretch requires the aid of a chair. As you twist your body, you will stretch not only your hip flexors but also your thighs and your chest. You should keep your abdominals engaged throughout the exercise so that you don’t overextend your back. If you sit a great deal during the day, this stretch will ensure that your hip flexors don’t grow short and impeded."
                },
                {
                    "headline": "Do a hip flexor stretch on a table .",
                    "description": "If you have no table suitable for the exercise, then you can use a workout bench or simply perform this stretch while lying on the floor. If you scoot down so that your pelvis isn’t supported by the table, then you will engage your core muscles. In addition to stretching your hip flexors, this exercise will help to relax and lengthen your lower back."
                },
                {
                    "headline": "Do frog pullovers.",
                    "description": "In addition to stretching your hip flexors, this exercise will lengthen and strengthen your arm and shoulder muscles. You will also feel a nice stretch down the sides of your torso as you raise and lower your arms above your head. To increase the stretch in your hips, start in the beginning position for the frog pullover. Then, sit up and  slowly lower your chest down over your feet to stretch the groin."
                },
                {
                    "headline": "Do a hip rotator stretch.",
                    "description": "Instead of resting your feet on a wall, you can get into a 90/90 neutral back position with your legs supported by a bench. This exercise focuses on using the bent leg to push your other leg toward the wall. You can also draw your knees toward your chest to stretch the hip flexor in your bent leg."
                }
            ]
        }
    ],
    "tyn": [
        "Yoga mat",
        "Chair",
        "Table",
        "Bench (optional)"
    ],
    "text": " Yoga Poses to Stretch Hip Flexors Do a yoga camel pose. In addition to stretching the hip flexors, the camel pose will open up the chest and increase the flexibility of the spine. The exercise tightens the waist and strengthens the arms and shoulders as well. Yogis believe that this posture opens up your respiratory system so that you can take in more oxygen with each breath. They also believe that the exercise helps to open the heart chakra to allow you to feel more connected to the world and to bestow forgiveness where needed in your life. Do the garland pose in yoga. The garland pose opens up the hips and improves balance. This pose will also increase flexibility in your thighs and ankles while toning your core. If the squatting maneuver is too difficult, then you can sit on a chair and lean your torso forward between your thighs. Make sure that your feet are on the ground and that your thighs form a 90-degree angle with your calves if you are using the chair for support. Do the reclined bound angle pose in yoga. This simple pose stretches the groin and inner thighs while opening up the chest. Make sure that your spine does not arch as you perform this pose. If you need support, you can place a pillow under your ankles to ease the stretch in your lower body or a pillow under your head so that you can avoid neck compression. This pose may also bring relief from fatigue, insomnia and mild depression. Do the perfect pose in yoga. The perfect pose opens your hips while stretching your ankles and your back. This pose is often used for meditation, and you can hold it for as long as needed to center yourself. Yogis believe that this posture releases nervous energy and helps people who suffer from disorders like asthma. Ancient yogis believed that the pose would help people to obtain supernatural powers. Do a downward facing frog exercise. The downward facing frog pose will open the hips as you lower your body toward the floor. To make this pose easier, place a small pillow or towel under your knees or ankles. If you feel a strain in your ankles, then squeeze them together rather than turning your feet out to the sides. Other Stretches for Hip Flexors Do a standing hip hinge. This is a good starter warmup exercise for opening up the hip flexors. Use your hands to support your back as you stretch the muscles in your groin. For an added challenge, kneel on the floor and then bend your upper body back. You’ll feel the stretch not only in your hip flexors but also in your quads. Do a 3D hip flexor stretch. This stretch requires the aid of a chair. As you twist your body, you will stretch not only your hip flexors but also your thighs and your chest. You should keep your abdominals engaged throughout the exercise so that you don’t overextend your back. If you sit a great deal during the day, this stretch will ensure that your hip flexors don’t grow short and impeded. Do a hip flexor stretch on a table . If you have no table suitable for the exercise, then you can use a workout bench or simply perform this stretch while lying on the floor. If you scoot down so that your pelvis isn’t supported by the table, then you will engage your core muscles. In addition to stretching your hip flexors, this exercise will help to relax and lengthen your lower back. Do frog pullovers. In addition to stretching your hip flexors, this exercise will lengthen and strengthen your arm and shoulder muscles. You will also feel a nice stretch down the sides of your torso as you raise and lower your arms above your head. To increase the stretch in your hips, start in the beginning position for the frog pullover. Then, sit up and  slowly lower your chest down over your feet to stretch the groin. Do a hip rotator stretch. Instead of resting your feet on a wall, you can get into a 90/90 neutral back position with your legs supported by a bench. This exercise focuses on using the bent leg to push your other leg toward the wall. You can also draw your knees toward your chest to stretch the hip flexor in your bent leg.",
    "sentences": [
        " Yoga Poses to Stretch Hip Flexors Do a yoga camel pose.",
        "In addition to stretching the hip flexors, the camel pose will open up the chest and increase the flexibility of the spine.",
        "The exercise tightens the waist and strengthens the arms and shoulders as well.",
        "Yogis believe that this posture opens up your respiratory system so that you can take in more oxygen with each breath.",
        "They also believe that the exercise helps to open the heart chakra to allow you to feel more connected to the world and to bestow forgiveness where needed in your life.",
        "Do the garland pose in yoga.",
        "The garland pose opens up the hips and improves balance.",
        "This pose will also increase flexibility in your thighs and ankles while toning your core.",
        "If the squatting maneuver is too difficult, then you can sit on a chair and lean your torso forward between your thighs.",
        "Make sure that your feet are on the ground and that your thighs form a 90-degree angle with your calves if you are using the chair for support.",
        "Do the reclined bound angle pose in yoga.",
        "This simple pose stretches the groin and inner thighs while opening up the chest.",
        "Make sure that your spine does not arch as you perform this pose.",
        "If you need support, you can place a pillow under your ankles to ease the stretch in your lower body or a pillow under your head so that you can avoid neck compression.",
        "This pose may also bring relief from fatigue, insomnia and mild depression.",
        "Do the perfect pose in yoga.",
        "The perfect pose opens your hips while stretching your ankles and your back.",
        "This pose is often used for meditation, and you can hold it for as long as needed to center yourself.",
        "Yogis believe that this posture releases nervous energy and helps people who suffer from disorders like asthma.",
        "Ancient yogis believed that the pose would help people to obtain supernatural powers.",
        "Do a downward facing frog exercise.",
        "The downward facing frog pose will open the hips as you lower your body toward the floor.",
        "To make this pose easier, place a small pillow or towel under your knees or ankles.",
        "If you feel a strain in your ankles, then squeeze them together rather than turning your feet out to the sides.",
        "Other Stretches for Hip Flexors Do a standing hip hinge.",
        "This is a good starter warmup exercise for opening up the hip flexors.",
        "Use your hands to support your back as you stretch the muscles in your groin.",
        "For an added challenge, kneel on the floor and then bend your upper body back.",
        "You’ll feel the stretch not only in your hip flexors but also in your quads.",
        "Do a 3D hip flexor stretch.",
        "This stretch requires the aid of a chair.",
        "As you twist your body, you will stretch not only your hip flexors but also your thighs and your chest.",
        "You should keep your abdominals engaged throughout the exercise so that you don’t overextend your back.",
        "If you sit a great deal during the day, this stretch will ensure that your hip flexors don’t grow short and impeded.",
        "Do a hip flexor stretch on a table .",
        "If you have no table suitable for the exercise, then you can use a workout bench or simply perform this stretch while lying on the floor.",
        "If you scoot down so that your pelvis isn’t supported by the table, then you will engage your core muscles.",
        "In addition to stretching your hip flexors, this exercise will help to relax and lengthen your lower back.",
        "Do frog pullovers.",
        "In addition to stretching your hip flexors, this exercise will lengthen and strengthen your arm and shoulder muscles.",
        "You will also feel a nice stretch down the sides of your torso as you raise and lower your arms above your head.",
        "To increase the stretch in your hips, start in the beginning position for the frog pullover.",
        "Then, sit up and  slowly lower your chest down over your feet to stretch the groin.",
        "Do a hip rotator stretch.",
        "Instead of resting your feet on a wall, you can get into a 90/90 neutral back position with your legs supported by a bench.",
        "This exercise focuses on using the bent leg to push your other leg toward the wall.",
        "You can also draw your knees toward your chest to stretch the hip flexor in your bent leg."
    ]
}