{
    "title": "How to Make Banana Peel Tea",
    "url": "https://www.wikihow.com/Make-Banana-Peel-Tea",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Tea",
        "Fruit Tea"
    ],
    "parts": [
        {
            "name": "Preparing the Banana Peels",
            "steps": [
                {
                    "headline": "Freeze the banana peels.",
                    "description": "As you eat bananas, peel off labels. Throw peels into your freezer."
                },
                {
                    "headline": "Thaw the banana peels.",
                    "description": "Fill a pan when you have enough peels. Let them thaw in your pan for an hour or two. They should turn black."
                },
                {
                    "headline": "Pasteurize the thawed peels.",
                    "description": "Put the peels in an oven at pasteurization temperature (~65C/150ºF). Bake until dry. This should take less than one hour."
                },
                {
                    "headline": "Crack and shred your peels by hand just a bit.",
                    "description": ""
                },
                {
                    "headline": "Pulverize one peel at a time in the blender, adding up to four peels before emptying your blender.",
                    "description": ""
                },
                {
                    "headline": "Store in a closed container in a cool, dark place.",
                    "description": "Glass jars (with or without gasket seals) are an excellent choice."
                }
            ]
        },
        {
            "name": "Preparing the Tea",
            "steps": [
                {
                    "headline": "Pour hot water over one heaping teaspoon of the blended peel.",
                    "description": "That is about as strong as a black tea bag. Always adjust amounts to your taste."
                },
                {
                    "headline": "Strain through a fine-mesh coffee strainer.",
                    "description": "The strainer can be lined with a paper coffee filter as well. Alternatively, put the pulverized peels in a tea bomb, then submerge the bomb in hot water and let steep for a short while."
                },
                {
                    "headline": "Enjoy before bedtime, to help send you into a good night's sleep.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Freezer",
        "Pan - baking pan or cake pan",
        "Oven with low temperature range",
        "Blender",
        "Container with lid for storing dry tea - ice cream pail, tea tin, glass jar, or similar",
        "Stainless steel coffee strainer"
    ],
    "text": " Preparing the Banana Peels Freeze the banana peels. As you eat bananas, peel off labels. Throw peels into your freezer. Thaw the banana peels. Fill a pan when you have enough peels. Let them thaw in your pan for an hour or two. They should turn black. Pasteurize the thawed peels. Put the peels in an oven at pasteurization temperature (~65C/150ºF). Bake until dry. This should take less than one hour. Crack and shred your peels by hand just a bit.  Pulverize one peel at a time in the blender, adding up to four peels before emptying your blender.  Store in a closed container in a cool, dark place. Glass jars (with or without gasket seals) are an excellent choice. Preparing the Tea Pour hot water over one heaping teaspoon of the blended peel. That is about as strong as a black tea bag. Always adjust amounts to your taste. Strain through a fine-mesh coffee strainer. The strainer can be lined with a paper coffee filter as well. Alternatively, put the pulverized peels in a tea bomb, then submerge the bomb in hot water and let steep for a short while. Enjoy before bedtime, to help send you into a good night's sleep. ",
    "sentences": [
        " Preparing the Banana Peels Freeze the banana peels.",
        "As you eat bananas, peel off labels.",
        "Throw peels into your freezer.",
        "Thaw the banana peels.",
        "Fill a pan when you have enough peels.",
        "Let them thaw in your pan for an hour or two.",
        "They should turn black.",
        "Pasteurize the thawed peels.",
        "Put the peels in an oven at pasteurization temperature (~65C/150ºF).",
        "Bake until dry.",
        "This should take less than one hour.",
        "Crack and shred your peels by hand just a bit.",
        "Pulverize one peel at a time in the blender, adding up to four peels before emptying your blender.",
        "Store in a closed container in a cool, dark place.",
        "Glass jars (with or without gasket seals) are an excellent choice.",
        "Preparing the Tea Pour hot water over one heaping teaspoon of the blended peel.",
        "That is about as strong as a black tea bag.",
        "Always adjust amounts to your taste.",
        "Strain through a fine-mesh coffee strainer.",
        "The strainer can be lined with a paper coffee filter as well.",
        "Alternatively, put the pulverized peels in a tea bomb, then submerge the bomb in hot water and let steep for a short while.",
        "Enjoy before bedtime, to help send you into a good night's sleep."
    ]
}