{
    "title": "How to Make Pizza Bagels",
    "url": "https://www.wikihow.com/Make-Pizza-Bagels",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Sandwiches and Quick Meals",
        "Pizza"
    ],
    "methods": [
        {
            "name": "Making a Basic Pizza Bagel",
            "steps": [
                {
                    "headline": "Preheat your oven to 375 °F (191 °C).",
                    "description": "This may take a while, so prepare your pizza bagel while you wait for it to heat up. If you want to use a microwave, skip this step and move onto the next."
                },
                {
                    "headline": "Place a sliced bagel face-up on a baking sheet.",
                    "description": "A plain bagel is a great choice, but you can also use a savory bagel, such as wheat, everything, or asiago. Make sure that the cut side of each bagel half is facing up. Make clean-up easier by covering the baking sheet with aluminum foil first. If you are making this in the microwave, use a microwave-safe plate instead. Don't use a sweet bagel, like cinnamon raisin. These flavors won’t mix well with the pizza sauce and cheese."
                },
                {
                    "headline": "Spread 1 tablespoon (15 mL) of pizza sauce over each bagel half.",
                    "description": "The exact amount of sauce does not really matter; you can use more or less to your liking. Plan on using about 1 tablespoon (15 mL) per bagel half, however. If you don't have pizza sauce, try pasta sauce or herbed tomato sauce."
                },
                {
                    "headline": "Add 1 tablespoon (7.5 g) of shredded mozzarella cheese to each bagel.",
                    "description": "You can use more or less cheese if you want, but make sure that you spread it evenly across the top of each bagel half. You can use other types of cheese too, such as Cheddar, Parmesan, or a blend."
                },
                {
                    "headline": "Top the bagels off with pepperoni slices, if desired.",
                    "description": "You should be able to fit 4 mini pepperoni slices or 2 regular pepperoni slices on each bagel half. If you really want this to look like a mini pizza, then stick with the mini pepperoni slices; they should be ⁄2 to 1 inch (1.3 to 2.5 cm) in diameter. No pepperoni? Try salami instead! You don’t have to add the pepperoni or salami if you don’t want to."
                },
                {
                    "headline": "Bake the bagels until the cheese has melted and turned bubbly.",
                    "description": "This will take about 10 minutes in an oven. If you are using the microwave, then 1 minute to 1 minute and 30 seconds should be plenty. If you are making only 1 pizza bagel slice in the microwave, cut the cooking time down to 35 to 45 seconds; you don’t need to adjust the baking time for the oven, however."
                }
            ]
        },
        {
            "name": "Trying Variations",
            "steps": [
                {
                    "headline": "Make a Guido pizza with sliced onion, sausage, and bell peppers.",
                    "description": "Cut an everything bagel in half, then coat it with pizza sauce. Add some grated Parmesan cheese and shredded mozzarella cheese. Top it off with sliced red onion, Italian sausage, and sliced red bell peppers. Bake it until the cheese melts, then garnish it with fresh basil. Chop the Italian sausage into small pieces—aim for something about the size of a blueberry. Make sure that the Italian sausage is cooked or fried beforehand. Cut the basil into thin slices to distribute the flavor evenly."
                },
                {
                    "headline": "Create a Southwestern pizza with barbecue sauce, chicken, and onion.",
                    "description": "Spread some barbecue sauce over a sliced bagel, then sprinkle a 4-cheese blend over it. Chop a grilled chicken breast into cubes, then mix it with more barbeque sauce. Add this to the pizza, along with some onion slices. Bake the pizza, then garnish it with chopped parsley. You probably won't use all of the grilled chicken for the pizza, which is fine. Make the grilled chicken cubes small—about ⁄4 to ⁄2 inch (0.64 to 1.27 cm)."
                },
                {
                    "headline": "Try a Greek-style pizza with  onion, artichoke, olives, and tomato.",
                    "description": "Slice open a sesame bagel, then coat it with hummus. Add some sliced onions, marinated artichoke, kalamata olives, and roasted tomato. Add a sprinkle of feta cheese, then garnish it with oregano. Bake the pizza, then garnish it with some chopped parsley. If you don't like hummus, you can use pizza sauce instead. Cut the marinated artichoke into smaller pieces and slice the olives in half lengthwise."
                },
                {
                    "headline": "Go gourmet with olive oil, basil, caramelized onions, and mushroom.",
                    "description": "Drizzle some extra virgin olive oil over a sliced pumpernickel bagel. Add a few fresh basil leaves, then a sprinkle of shredded mozzarella. Top it off with caramelized onion and sliced mushroom. Bake the pizza, then garnish it with chopped basil. Use enough basil leaves to cover the bagel. How many you use depends on the size of the basil leaf. Expect to use 1 to 3 leaves. Slice the onion beforehand, then sauté it in a frying pan until it turns a golden brown color. Don't sauté the mushrooms; use them fresh."
                },
                {
                    "headline": "Try a supreme pizza with pepperoni, ham, bacon, and bell pepper.",
                    "description": "Spread pizza sauce over a sliced bagel. Add 5 slices of pepperoni, then top it off with diced, cooked ham, bacon bits, and chopped green bell pepper. Finish it with a sprinkle of shredded mozzarella cheese, then bake the pizza. If your bagel has a large hole in the middle, cover it up with a slice of pepperoni. You can find bacon bits in the salad garnish section of a grocery store. If you can't find bacon bits, fry a strip of bacon until it is crunchy, crumble it into bits, and use those instead."
                },
                {
                    "headline": "Use mini bagels to make mini pizza bites.",
                    "description": "Use the same process and ingredients, but with mini bagels instead. The main difference is that you’ll have to use smaller amounts and cut the ingredients into smaller pieces. For best results, bake the pizzas at 425 °F (218 °C) for about 6 minutes. Rather than slicing your toppings, chop them into tiny pieces instead. This will make them more proportionate and help distribute the flavor."
                },
                {
                    "headline": "Get inspiration from other pizza recipes for your pizza bagel.",
                    "description": "Look up a pizza recipe online or in a cook book. Top your bagel off with the recommended sauce and toppings. Don't worry about the amounts; just use whatever feels right and looks tasty. Bake the pizza at 450 °F (232 °C) for about 8 minutes, or until the cheese melts. You can make just about any type of pizza on a bagel, including Hawaiian, margarita, and vegetarian."
                }
            ]
        }
    ],
    "tyn": [
        "Oven or microwave",
        "Baking sheet or plate",
        "Spoon",
        "Knife"
    ],
    "text": " Making a Basic Pizza Bagel Preheat your oven to 375 °F (191 °C). This may take a while, so prepare your pizza bagel while you wait for it to heat up. If you want to use a microwave, skip this step and move onto the next. Place a sliced bagel face-up on a baking sheet. A plain bagel is a great choice, but you can also use a savory bagel, such as wheat, everything, or asiago. Make sure that the cut side of each bagel half is facing up. Make clean-up easier by covering the baking sheet with aluminum foil first. If you are making this in the microwave, use a microwave-safe plate instead. Don't use a sweet bagel, like cinnamon raisin. These flavors won’t mix well with the pizza sauce and cheese. Spread 1 tablespoon (15 mL) of pizza sauce over each bagel half. The exact amount of sauce does not really matter; you can use more or less to your liking. Plan on using about 1 tablespoon (15 mL) per bagel half, however. If you don't have pizza sauce, try pasta sauce or herbed tomato sauce. Add 1 tablespoon (7.5 g) of shredded mozzarella cheese to each bagel. You can use more or less cheese if you want, but make sure that you spread it evenly across the top of each bagel half. You can use other types of cheese too, such as Cheddar, Parmesan, or a blend. Top the bagels off with pepperoni slices, if desired. You should be able to fit 4 mini pepperoni slices or 2 regular pepperoni slices on each bagel half. If you really want this to look like a mini pizza, then stick with the mini pepperoni slices; they should be ⁄2 to 1 inch (1.3 to 2.5 cm) in diameter. No pepperoni? Try salami instead! You don’t have to add the pepperoni or salami if you don’t want to. Bake the bagels until the cheese has melted and turned bubbly. This will take about 10 minutes in an oven. If you are using the microwave, then 1 minute to 1 minute and 30 seconds should be plenty. If you are making only 1 pizza bagel slice in the microwave, cut the cooking time down to 35 to 45 seconds; you don’t need to adjust the baking time for the oven, however. Trying Variations Make a Guido pizza with sliced onion, sausage, and bell peppers. Cut an everything bagel in half, then coat it with pizza sauce. Add some grated Parmesan cheese and shredded mozzarella cheese. Top it off with sliced red onion, Italian sausage, and sliced red bell peppers. Bake it until the cheese melts, then garnish it with fresh basil. Chop the Italian sausage into small pieces—aim for something about the size of a blueberry. Make sure that the Italian sausage is cooked or fried beforehand. Cut the basil into thin slices to distribute the flavor evenly. Create a Southwestern pizza with barbecue sauce, chicken, and onion. Spread some barbecue sauce over a sliced bagel, then sprinkle a 4-cheese blend over it. Chop a grilled chicken breast into cubes, then mix it with more barbeque sauce. Add this to the pizza, along with some onion slices. Bake the pizza, then garnish it with chopped parsley. You probably won't use all of the grilled chicken for the pizza, which is fine. Make the grilled chicken cubes small—about ⁄4 to ⁄2 inch (0.64 to 1.27 cm). Try a Greek-style pizza with  onion, artichoke, olives, and tomato. Slice open a sesame bagel, then coat it with hummus. Add some sliced onions, marinated artichoke, kalamata olives, and roasted tomato. Add a sprinkle of feta cheese, then garnish it with oregano. Bake the pizza, then garnish it with some chopped parsley. If you don't like hummus, you can use pizza sauce instead. Cut the marinated artichoke into smaller pieces and slice the olives in half lengthwise. Go gourmet with olive oil, basil, caramelized onions, and mushroom. Drizzle some extra virgin olive oil over a sliced pumpernickel bagel. Add a few fresh basil leaves, then a sprinkle of shredded mozzarella. Top it off with caramelized onion and sliced mushroom. Bake the pizza, then garnish it with chopped basil. Use enough basil leaves to cover the bagel. How many you use depends on the size of the basil leaf. Expect to use 1 to 3 leaves. Slice the onion beforehand, then sauté it in a frying pan until it turns a golden brown color. Don't sauté the mushrooms; use them fresh. Try a supreme pizza with pepperoni, ham, bacon, and bell pepper. Spread pizza sauce over a sliced bagel. Add 5 slices of pepperoni, then top it off with diced, cooked ham, bacon bits, and chopped green bell pepper. Finish it with a sprinkle of shredded mozzarella cheese, then bake the pizza. If your bagel has a large hole in the middle, cover it up with a slice of pepperoni. You can find bacon bits in the salad garnish section of a grocery store. If you can't find bacon bits, fry a strip of bacon until it is crunchy, crumble it into bits, and use those instead. Use mini bagels to make mini pizza bites. Use the same process and ingredients, but with mini bagels instead. The main difference is that you’ll have to use smaller amounts and cut the ingredients into smaller pieces. For best results, bake the pizzas at 425 °F (218 °C) for about 6 minutes. Rather than slicing your toppings, chop them into tiny pieces instead. This will make them more proportionate and help distribute the flavor. Get inspiration from other pizza recipes for your pizza bagel. Look up a pizza recipe online or in a cook book. Top your bagel off with the recommended sauce and toppings. Don't worry about the amounts; just use whatever feels right and looks tasty. Bake the pizza at 450 °F (232 °C) for about 8 minutes, or until the cheese melts. You can make just about any type of pizza on a bagel, including Hawaiian, margarita, and vegetarian.",
    "sentences": [
        " Making a Basic Pizza Bagel Preheat your oven to 375 °F (191 °C).",
        "This may take a while, so prepare your pizza bagel while you wait for it to heat up.",
        "If you want to use a microwave, skip this step and move onto the next.",
        "Place a sliced bagel face-up on a baking sheet.",
        "A plain bagel is a great choice, but you can also use a savory bagel, such as wheat, everything, or asiago.",
        "Make sure that the cut side of each bagel half is facing up.",
        "Make clean-up easier by covering the baking sheet with aluminum foil first.",
        "If you are making this in the microwave, use a microwave-safe plate instead.",
        "Don't use a sweet bagel, like cinnamon raisin.",
        "These flavors won’t mix well with the pizza sauce and cheese.",
        "Spread 1 tablespoon (15 mL) of pizza sauce over each bagel half.",
        "The exact amount of sauce does not really matter; you can use more or less to your liking.",
        "Plan on using about 1 tablespoon (15 mL) per bagel half, however.",
        "If you don't have pizza sauce, try pasta sauce or herbed tomato sauce.",
        "Add 1 tablespoon (7.5 g) of shredded mozzarella cheese to each bagel.",
        "You can use more or less cheese if you want, but make sure that you spread it evenly across the top of each bagel half.",
        "You can use other types of cheese too, such as Cheddar, Parmesan, or a blend.",
        "Top the bagels off with pepperoni slices, if desired.",
        "You should be able to fit 4 mini pepperoni slices or 2 regular pepperoni slices on each bagel half.",
        "If you really want this to look like a mini pizza, then stick with the mini pepperoni slices; they should be ⁄2 to 1 inch (1.3 to 2.5 cm) in diameter.",
        "No pepperoni?",
        "Try salami instead!",
        "You don’t have to add the pepperoni or salami if you don’t want to.",
        "Bake the bagels until the cheese has melted and turned bubbly.",
        "This will take about 10 minutes in an oven.",
        "If you are using the microwave, then 1 minute to 1 minute and 30 seconds should be plenty.",
        "If you are making only 1 pizza bagel slice in the microwave, cut the cooking time down to 35 to 45 seconds; you don’t need to adjust the baking time for the oven, however.",
        "Trying Variations Make a Guido pizza with sliced onion, sausage, and bell peppers.",
        "Cut an everything bagel in half, then coat it with pizza sauce.",
        "Add some grated Parmesan cheese and shredded mozzarella cheese.",
        "Top it off with sliced red onion, Italian sausage, and sliced red bell peppers.",
        "Bake it until the cheese melts, then garnish it with fresh basil.",
        "Chop the Italian sausage into small pieces—aim for something about the size of a blueberry.",
        "Make sure that the Italian sausage is cooked or fried beforehand.",
        "Cut the basil into thin slices to distribute the flavor evenly.",
        "Create a Southwestern pizza with barbecue sauce, chicken, and onion.",
        "Spread some barbecue sauce over a sliced bagel, then sprinkle a 4-cheese blend over it.",
        "Chop a grilled chicken breast into cubes, then mix it with more barbeque sauce.",
        "Add this to the pizza, along with some onion slices.",
        "Bake the pizza, then garnish it with chopped parsley.",
        "You probably won't use all of the grilled chicken for the pizza, which is fine.",
        "Make the grilled chicken cubes small—about ⁄4 to ⁄2 inch (0.64 to 1.27 cm).",
        "Try a Greek-style pizza with  onion, artichoke, olives, and tomato.",
        "Slice open a sesame bagel, then coat it with hummus.",
        "Add some sliced onions, marinated artichoke, kalamata olives, and roasted tomato.",
        "Add a sprinkle of feta cheese, then garnish it with oregano.",
        "Bake the pizza, then garnish it with some chopped parsley.",
        "If you don't like hummus, you can use pizza sauce instead.",
        "Cut the marinated artichoke into smaller pieces and slice the olives in half lengthwise.",
        "Go gourmet with olive oil, basil, caramelized onions, and mushroom.",
        "Drizzle some extra virgin olive oil over a sliced pumpernickel bagel.",
        "Add a few fresh basil leaves, then a sprinkle of shredded mozzarella.",
        "Top it off with caramelized onion and sliced mushroom.",
        "Bake the pizza, then garnish it with chopped basil.",
        "Use enough basil leaves to cover the bagel.",
        "How many you use depends on the size of the basil leaf.",
        "Expect to use 1 to 3 leaves.",
        "Slice the onion beforehand, then sauté it in a frying pan until it turns a golden brown color.",
        "Don't sauté the mushrooms; use them fresh.",
        "Try a supreme pizza with pepperoni, ham, bacon, and bell pepper.",
        "Spread pizza sauce over a sliced bagel.",
        "Add 5 slices of pepperoni, then top it off with diced, cooked ham, bacon bits, and chopped green bell pepper.",
        "Finish it with a sprinkle of shredded mozzarella cheese, then bake the pizza.",
        "If your bagel has a large hole in the middle, cover it up with a slice of pepperoni.",
        "You can find bacon bits in the salad garnish section of a grocery store.",
        "If you can't find bacon bits, fry a strip of bacon until it is crunchy, crumble it into bits, and use those instead.",
        "Use mini bagels to make mini pizza bites.",
        "Use the same process and ingredients, but with mini bagels instead.",
        "The main difference is that you’ll have to use smaller amounts and cut the ingredients into smaller pieces.",
        "For best results, bake the pizzas at 425 °F (218 °C) for about 6 minutes.",
        "Rather than slicing your toppings, chop them into tiny pieces instead.",
        "This will make them more proportionate and help distribute the flavor.",
        "Get inspiration from other pizza recipes for your pizza bagel.",
        "Look up a pizza recipe online or in a cook book.",
        "Top your bagel off with the recommended sauce and toppings.",
        "Don't worry about the amounts; just use whatever feels right and looks tasty.",
        "Bake the pizza at 450 °F (232 °C) for about 8 minutes, or until the cheese melts.",
        "You can make just about any type of pizza on a bagel, including Hawaiian, margarita, and vegetarian."
    ]
}