{
    "title": "How to Get Your Eight Glasses of Water a Day",
    "url": "https://www.wikihow.com/Get-Your-Eight-Glasses-of-Water-a-Day",
    "category_hierarchy": [
        "Health",
        "Nutrition and Food Health",
        "Water Health Benefits"
    ],
    "methods": [
        {
            "name": "Making Water Consumption a Priority",
            "steps": [
                {
                    "headline": "Measure out how much water you'll need each day.",
                    "description": "2 liters (0.5 US gal) is about 8 glasses of water. Having a container that size may help you remember to drink enough water every day. If you have an empty 2-liter soda bottle, fill it with water and put it in your fridge. Drink the entire bottle of water over the course of the day. If you are not drinking the entire bottle of water each day, you may not be getting enough water. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tClaudia Carberry, RD, MS\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster's Degree, Nutrition, University of Tennessee Knoxville\t\t\t\t\t\t\t\tClaudia Carberry is a Registered Dietitian specializing in kidney transplants and counseling patients for weight loss at the University of Arkansas for Medical Sciences. She is a member of the Arkansas Academy of Nutrition and Dietetics. Claudia received her MS in Nutrition from the University of Tennessee Knoxville in 2010. Claudia Carberry, RD, MS\t\t\tMaster's Degree, Nutrition, University of Tennessee Knoxville\t\t\t\tDid You Know? The amount of water varies based on height, weight, activity levels, and other factors. To accurately know if you're getting enough water, check to see if your urine is clear or a very pale yellow. If it is, then you're hydrating properly!"
                },
                {
                    "headline": "Make it a habit.",
                    "description": "Train yourself to drink a glass of water every morning when you first wake up, a glass when you get home from work or school, and a glass every evening right before bed. That's three of your eight recommended daily glasses. You can make a daily water chart to help you get started, and after a while, the practice will feel like second nature. Drinking water in the morning also helps jump-start your metabolism, and is a refreshing way to wake up every day. There are also water bottles on the market with counting systems worked into their design. For instance, some bottles have a little dial that is turned each time 8 oz is drank. This encourages more water consumption."
                },
                {
                    "headline": "Drink water when you're distracted.",
                    "description": "Another habit to cultivate is sipping a glass of water while you're doing other work, whether on the computer or watching TV."
                },
                {
                    "headline": "Download an app.",
                    "description": "There are many apps available for your smartphone that can help you keep track of how much water you've drunk, or give you reminders to drink more. Many are free, but if you pay for one, you might be more motivated to use it on a daily basis."
                },
                {
                    "headline": "Buy a water bottle you'll love.",
                    "description": "Carry your bottle everywhere you go. Not only will it reduce the number of disposable water bottles you go through, it may also motivate you to use your new bottle. Remember to use a water bottle that not only looks nice, feels nice and keeps your water cold, but also one that is BPA free and easily washable."
                },
                {
                    "headline": "Know your environment and your activity levels.",
                    "description": "Health professionals will often advise you to drink more water than usual (which can mean more than 8 glasses a day), depending on environmental factors. If you live in a hot, dry climate, you'll probably need to drink more water than someone who lives in an arctic climate. And if you're exercising, you'll need even more water to stay hydrated. Don't wait until you're thirsty to drink water, especially if you're engaging in physical activity and/or if the weather is hot. By the time you feel thirsty, your body is already dehydrated."
                },
                {
                    "headline": "If you feel hungry, drink water first.",
                    "description": "This will make you fuller before you eat, and may even stave off cravings, as thirst is often mistaken for hunger."
                }
            ]
        },
        {
            "name": "Making Water Taste Better",
            "steps": [
                {
                    "headline": "Drink carbonated water.",
                    "description": "The bubbles give ordinary water an extra sparkle, and if you drink flavored seltzer, you may even be able to trick your brain into thinking it's soda."
                },
                {
                    "headline": "Freeze your water the night before.",
                    "description": "As the ice melts you can sip on an ice-cold bottle of water all day."
                },
                {
                    "headline": "Add fruit.",
                    "description": "Slicing up citrus, berries, or even cucumbers into your water will give it a zesty, fresh taste that will keep you coming back for more."
                },
                {
                    "headline": "Make flavored ice cubes.",
                    "description": "You can freeze just about any juice, mashed up fruit, or even coffee or flavored tea in an ice cube tray. When they're ready, pop out a few cubes and add them to your water bottle."
                }
            ]
        }
    ],
    "tyn": [
        "2 liter (0.5 US gal) water bottle",
        "Reusable water bottle"
    ],
    "text": " Making Water Consumption a Priority Measure out how much water you'll need each day. 2 liters (0.5 US gal) is about 8 glasses of water. Having a container that size may help you remember to drink enough water every day. If you have an empty 2-liter soda bottle, fill it with water and put it in your fridge. Drink the entire bottle of water over the course of the day. If you are not drinking the entire bottle of water each day, you may not be getting enough water. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tClaudia Carberry, RD, MS\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster's Degree, Nutrition, University of Tennessee Knoxville\t\t\t\t\t\t\t\tClaudia Carberry is a Registered Dietitian specializing in kidney transplants and counseling patients for weight loss at the University of Arkansas for Medical Sciences. She is a member of the Arkansas Academy of Nutrition and Dietetics. Claudia received her MS in Nutrition from the University of Tennessee Knoxville in 2010. Claudia Carberry, RD, MS\t\t\tMaster's Degree, Nutrition, University of Tennessee Knoxville\t\t\t\tDid You Know? The amount of water varies based on height, weight, activity levels, and other factors. To accurately know if you're getting enough water, check to see if your urine is clear or a very pale yellow. If it is, then you're hydrating properly! Make it a habit. Train yourself to drink a glass of water every morning when you first wake up, a glass when you get home from work or school, and a glass every evening right before bed. That's three of your eight recommended daily glasses. You can make a daily water chart to help you get started, and after a while, the practice will feel like second nature. Drinking water in the morning also helps jump-start your metabolism, and is a refreshing way to wake up every day. There are also water bottles on the market with counting systems worked into their design. For instance, some bottles have a little dial that is turned each time 8 oz is drank. This encourages more water consumption. Drink water when you're distracted. Another habit to cultivate is sipping a glass of water while you're doing other work, whether on the computer or watching TV. Download an app. There are many apps available for your smartphone that can help you keep track of how much water you've drunk, or give you reminders to drink more. Many are free, but if you pay for one, you might be more motivated to use it on a daily basis. Buy a water bottle you'll love. Carry your bottle everywhere you go. Not only will it reduce the number of disposable water bottles you go through, it may also motivate you to use your new bottle. Remember to use a water bottle that not only looks nice, feels nice and keeps your water cold, but also one that is BPA free and easily washable. Know your environment and your activity levels. Health professionals will often advise you to drink more water than usual (which can mean more than 8 glasses a day), depending on environmental factors. If you live in a hot, dry climate, you'll probably need to drink more water than someone who lives in an arctic climate. And if you're exercising, you'll need even more water to stay hydrated. Don't wait until you're thirsty to drink water, especially if you're engaging in physical activity and/or if the weather is hot. By the time you feel thirsty, your body is already dehydrated. If you feel hungry, drink water first. This will make you fuller before you eat, and may even stave off cravings, as thirst is often mistaken for hunger. Making Water Taste Better Drink carbonated water. The bubbles give ordinary water an extra sparkle, and if you drink flavored seltzer, you may even be able to trick your brain into thinking it's soda. Freeze your water the night before. As the ice melts you can sip on an ice-cold bottle of water all day. Add fruit. Slicing up citrus, berries, or even cucumbers into your water will give it a zesty, fresh taste that will keep you coming back for more. Make flavored ice cubes. You can freeze just about any juice, mashed up fruit, or even coffee or flavored tea in an ice cube tray. When they're ready, pop out a few cubes and add them to your water bottle.",
    "sentences": [
        " Making Water Consumption a Priority Measure out how much water you'll need each day.",
        "2 liters (0.5 US gal) is about 8 glasses of water.",
        "Having a container that size may help you remember to drink enough water every day.",
        "If you have an empty 2-liter soda bottle, fill it with water and put it in your fridge.",
        "Drink the entire bottle of water over the course of the day.",
        "If you are not drinking the entire bottle of water each day, you may not be getting enough water.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tClaudia Carberry, RD, MS\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaster's Degree, Nutrition, University of Tennessee Knoxville\t\t\t\t\t\t\t\tClaudia Carberry is a Registered Dietitian specializing in kidney transplants and counseling patients for weight loss at the University of Arkansas for Medical Sciences.",
        "She is a member of the Arkansas Academy of Nutrition and Dietetics.",
        "Claudia received her MS in Nutrition from the University of Tennessee Knoxville in 2010.",
        "Claudia Carberry, RD, MS\t\t\tMaster's Degree, Nutrition, University of Tennessee Knoxville\t\t\t\tDid You Know?",
        "The amount of water varies based on height, weight, activity levels, and other factors.",
        "To accurately know if you're getting enough water, check to see if your urine is clear or a very pale yellow.",
        "If it is, then you're hydrating properly!",
        "Make it a habit.",
        "Train yourself to drink a glass of water every morning when you first wake up, a glass when you get home from work or school, and a glass every evening right before bed.",
        "That's three of your eight recommended daily glasses.",
        "You can make a daily water chart to help you get started, and after a while, the practice will feel like second nature.",
        "Drinking water in the morning also helps jump-start your metabolism, and is a refreshing way to wake up every day.",
        "There are also water bottles on the market with counting systems worked into their design.",
        "For instance, some bottles have a little dial that is turned each time 8 oz is drank.",
        "This encourages more water consumption.",
        "Drink water when you're distracted.",
        "Another habit to cultivate is sipping a glass of water while you're doing other work, whether on the computer or watching TV.",
        "Download an app.",
        "There are many apps available for your smartphone that can help you keep track of how much water you've drunk, or give you reminders to drink more.",
        "Many are free, but if you pay for one, you might be more motivated to use it on a daily basis.",
        "Buy a water bottle you'll love.",
        "Carry your bottle everywhere you go.",
        "Not only will it reduce the number of disposable water bottles you go through, it may also motivate you to use your new bottle.",
        "Remember to use a water bottle that not only looks nice, feels nice and keeps your water cold, but also one that is BPA free and easily washable.",
        "Know your environment and your activity levels.",
        "Health professionals will often advise you to drink more water than usual (which can mean more than 8 glasses a day), depending on environmental factors.",
        "If you live in a hot, dry climate, you'll probably need to drink more water than someone who lives in an arctic climate.",
        "And if you're exercising, you'll need even more water to stay hydrated.",
        "Don't wait until you're thirsty to drink water, especially if you're engaging in physical activity and/or if the weather is hot.",
        "By the time you feel thirsty, your body is already dehydrated.",
        "If you feel hungry, drink water first.",
        "This will make you fuller before you eat, and may even stave off cravings, as thirst is often mistaken for hunger.",
        "Making Water Taste Better Drink carbonated water.",
        "The bubbles give ordinary water an extra sparkle, and if you drink flavored seltzer, you may even be able to trick your brain into thinking it's soda.",
        "Freeze your water the night before.",
        "As the ice melts you can sip on an ice-cold bottle of water all day.",
        "Add fruit.",
        "Slicing up citrus, berries, or even cucumbers into your water will give it a zesty, fresh taste that will keep you coming back for more.",
        "Make flavored ice cubes.",
        "You can freeze just about any juice, mashed up fruit, or even coffee or flavored tea in an ice cube tray.",
        "When they're ready, pop out a few cubes and add them to your water bottle."
    ]
}