{
    "title": "How to Set up a Nintendo Gamecube",
    "url": "https://www.wikihow.com/Set-up-a-Nintendo-Gamecube",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Video Games",
        "Nintendo Video Game Consoles",
        "Nintendo Gamecube"
    ],
    "steps": [
        {
            "headline": "Make sure you have everything you need.",
            "description": ""
        },
        {
            "headline": "Put the GameCube on a flat surface.",
            "description": "If you are using a cord controller, put it somewhere between you and the TV."
        },
        {
            "headline": "Plug the AC Adapter into the GameCube and a power outlet.",
            "description": ""
        },
        {
            "headline": "Plug the Audio/Video cable into the GameCube.",
            "description": "Then plug them into either the TV or VCR, usually in the order Yellow, White, Red - the sockets will usually be colored to match the color of the cord."
        },
        {
            "headline": "Turn on the TV, and if you hooked the GameCube up to it, the VCR.",
            "description": "You will usually have to put the TV on channel 03, and on input mode for the VCR."
        },
        {
            "headline": "Put in a Game Disc if you wish to play.",
            "description": ""
        },
        {
            "headline": "Plug in the controllers.",
            "description": "Normal cord controllers have a cord of 6 ⁄2 feet (2.0 m), while wireless controllers can reach up to 30 feet (9.1 m) from the receiver."
        },
        {
            "headline": "Plug a memory card into Slot A or B",
            "description": ""
        },
        {
            "headline": "Press the on button.",
            "description": "If your GameCube is new and this is your first time playing it, you will be asked to set the time and date and a few other things. Remember that the time is in military time. Some games, such as Animal Crossing, have the gameplay set in real-time, so it is crucial to set it to the right time."
        }
    ],
    "tyn": [
        "Gamecube",
        "Controller (s)",
        "Game",
        "Memory Card",
        "AC Adapter",
        "Input Cord",
        "TV",
        "Electricity"
    ],
    "text": " Make sure you have everything you need.  Put the GameCube on a flat surface. If you are using a cord controller, put it somewhere between you and the TV. Plug the AC Adapter into the GameCube and a power outlet.  Plug the Audio/Video cable into the GameCube. Then plug them into either the TV or VCR, usually in the order Yellow, White, Red - the sockets will usually be colored to match the color of the cord. Turn on the TV, and if you hooked the GameCube up to it, the VCR. You will usually have to put the TV on channel 03, and on input mode for the VCR. Put in a Game Disc if you wish to play.  Plug in the controllers. Normal cord controllers have a cord of 6 ⁄2 feet (2.0 m), while wireless controllers can reach up to 30 feet (9.1 m) from the receiver. Plug a memory card into Slot A or B  Press the on button. If your GameCube is new and this is your first time playing it, you will be asked to set the time and date and a few other things. Remember that the time is in military time. Some games, such as Animal Crossing, have the gameplay set in real-time, so it is crucial to set it to the right time.",
    "sentences": [
        " Make sure you have everything you need.",
        "Put the GameCube on a flat surface.",
        "If you are using a cord controller, put it somewhere between you and the TV.",
        "Plug the AC Adapter into the GameCube and a power outlet.",
        "Plug the Audio/Video cable into the GameCube.",
        "Then plug them into either the TV or VCR, usually in the order Yellow, White, Red - the sockets will usually be colored to match the color of the cord.",
        "Turn on the TV, and if you hooked the GameCube up to it, the VCR.",
        "You will usually have to put the TV on channel 03, and on input mode for the VCR.",
        "Put in a Game Disc if you wish to play.",
        "Plug in the controllers.",
        "Normal cord controllers have a cord of 6 ⁄2 feet (2.0 m), while wireless controllers can reach up to 30 feet (9.1 m) from the receiver.",
        "Plug a memory card into Slot A or B  Press the on button.",
        "If your GameCube is new and this is your first time playing it, you will be asked to set the time and date and a few other things.",
        "Remember that the time is in military time.",
        "Some games, such as Animal Crossing, have the gameplay set in real-time, so it is crucial to set it to the right time."
    ]
}