{
    "title": "How to Store Cooking Oil",
    "url": "https://www.wikihow.com/Store-Cooking-Oil",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Food Selection and Storage"
    ],
    "methods": [
        {
            "name": "Using the Right Container",
            "steps": [
                {
                    "headline": "Keep the cap or lid on the oil bottle when you are not using it.",
                    "description": "One of the main causes of oil turning rancid is exposure to too much oxygen. When you are not using the oil, keep the cap or lid on the container."
                },
                {
                    "headline": "Store the oil in a dark-colored glass bottle with a tight-fitting cap.",
                    "description": "Even if the oil comes in a clear, glass bottle, consider transferring it to a blue or green one. Sunlight degrades the quality of oil, and a dark-colored bottle will help to keep that from happening. Use a funnel to help guide the oil into the new bottle without spillage. Brown colored glass is not recommended because it lets in too much light. If you own more than one type of oil, don't forget to label the bottles. You can reuse dark-colored wine and vinegar bottles. You can buy dark-colored bottles from a cooking equipment store."
                },
                {
                    "headline": "Avoid using plastic bottles.",
                    "description": "Plastic tends to leach chemicals over time. When this happens, it will affect the overall taste of the oil. If your oil came in a plastic bottle, consider transferring it to a glass bottle or jar with a tight-fitting lid."
                },
                {
                    "headline": "Avoid keeping cooking oils in containers made from iron or copper.",
                    "description": "These metals create a chemical reaction when they come in contact with oil and make it unsafe to use."
                },
                {
                    "headline": "Consider transferring some oil into a smaller container to make it easier to pour.",
                    "description": "Some oils come in a large bottle or tin. These are often heavy and difficult to move. You can make use of this oil easier by transferring a small amount of the oil into a dark-colored glass bottle (see above for suggestions). Pour the oil out from the bottle when you are ready to use it. When the small bottle becomes empty, refill it with more oil from the larger container. The smaller bottle will be a lot easier to manage than that large, heavy tin or bottle."
                }
            ]
        },
        {
            "name": "Storing Cooking Oil Properly",
            "steps": [
                {
                    "headline": "Be familiar with which types of oils can be stored at room temperature.",
                    "description": "The following types of oils can be kept at room temperature:\nGhee oil can last for several months. Palm oil can last for several months. Peanut oil (refined) will last for two years. Vegetable oil can last for a year or longer as long as it is tightly covered. Olive oil may be kept in the cupboard (at temperatures between 57°F and 70ºF (14°C and 21ºC) for up to 15 months."
                },
                {
                    "headline": "Store the oil in a cool, dark cupboard or pantry.",
                    "description": "Do not store it near or above the stove. The frequent temperature changes will cause the oil to deteriorate."
                },
                {
                    "headline": "Know which types of oils are best stored in the refrigerator.",
                    "description": "Some oils will spoil if they are not kept in a cold place. Refrigeration will cause most oils to turn cloudy and thick. Because of this, you will need to take the oil out one to two hours before you need it, and let it sit at room temperature, allowing the oil to return to its usual consistency. The following oils should be kept in the fridge:\nAvocado oil will last for 9 to 12 months. Corn oil will last up to 6 months. Mustard oil will last 5 to 6 months. Safflower oil will last for 6 months. Sesame oil will last for 6 months. Truffle oil will last for 6 months."
                },
                {
                    "headline": "Know which oils can be stored at both room temperature or in the fridge.",
                    "description": "Some oils can be kept either in the fridge or in the cupboard. However, in most cases, refrigeration will prolong the oil's shelf life. Note that refrigeration will cause some oils to turn thick and cloudy. If this happens, take the oil out of the fridge one to two hours before you need it, allowing it to return to its usual consistency. The one exception to this is coconut oil, which is solid at room temperature. The following oils can be kept either in the fridge or in a cool, dark cupboard:\nCanola oil can be stored in the cupboard for 4 to 6 months, or in the fridge for 9 months. Chili oil can be stored in the cupboard for 6 months. It will last longer in the fridge. Coconut oil can be stored in the cupboard for months. It can last longer in the fridge but is difficult to use quickly from the refrigerator. Grapeseed oil can be stored in the cupboard for 3 months (up to 70ºF/21ºC), or in the fridge for 6 months. Hazelnut oil can be stored in the cupboard for 3 months. It will last in the fridge for up to 6 months. Depending on the type, lard can be stored either in the cupboard or in the fridge. Read the label for proper storing techniques. Macadamia nut oil can be stored in the cupboard for up to two years. It can last even longer in the fridge. Palm kernel oil can be stored in the cupboard for up to a year. It can last longer in the fridge. Walnut oil can be stored in the cupboard for 3 months. It will last in the fridge for up to 6 months."
                },
                {
                    "headline": "Avoid storing oil where it can be damaged.",
                    "description": "Sunlight and frequent temperature changes can deteriorate oil and cause it to go rancid. Unfortunately, some of the most popular places to keep oil, such as windowsills and on the counter, are often the worst because the oil is subjected to too much sunlight and changes in temperature. Avoid keeping your oil in the places listed below, even if the oil can be kept at room temperature:\nWindowsills\nThe back ledge of a stove\nIn a cabinet above the stove\nNext to the stove or oven\nOn the counter\nNext to the refrigerator (the external side of a fridge can get quite hot through a cupboard partition)\nNear cooking appliances such as kettles, waffle makers and toasters."
                }
            ]
        },
        {
            "name": "Discarding Old or Stale Oil",
            "steps": [
                {
                    "headline": "Be aware that oil stays fresh for a short duration only.",
                    "description": "When shopping for oil, you may notice two different types: refined and unrefined. Refined oils have been processed, and usually have little taste or nutritional value. Unrefined oils tend to be more pure, and are packed with nutrients. The label on the bottle or jar will tell you whether the oil is refined or unrefined. Here is how long you can expect both types of oils to last:\nRefined oils will usually last 6 to 12 months if stored in a cool, dark cupboard (or fridge, if necessary). Unrefined oils will usually for 3 to 6 months if stored in a cool, dark, cupboard. A refrigerator is the best place to keep these oils."
                },
                {
                    "headline": "Sniff the oil every few months.",
                    "description": "If it smells bad or has a slight odor of wine, the oil has gone rancid. Toss the oil out."
                },
                {
                    "headline": "Pay attention to the taste.",
                    "description": "If the oil tastes metallic, a little bit like wine, or just plain bad, it has likely gone bad, turned rancid, or oxidized."
                },
                {
                    "headline": "Take note of how the oil was stored before it went bad.",
                    "description": "This might help you to understand why it went bad. Once you've figured out the reason, avoid making the same mistake when storing the next bottle of oil. Here are some things to look for when dealing with rancid oil:\nCheck the expiration date: If the oil has gone bad because you didn't use it in time, get a smaller bottle the next time you go shopping. Was it was stored in a plastic container? : Some types of plastic leach into the oil and cause it to taste bad. Was it stored in a metal container? : Some metals, such as copper an iron, are reactive. They create a chemical reaction when they come in contact with oil and give it a metallic taste. Oils should never be stored in such containers. Consider where it was stored: Some oils need to be kept in the fridge while others need to be kept in a cool, dark cabinet. Oils should be kept out of places that receive too much sunlight or are subjected to fluctuating temperatures. How was it stored? : Was the cap on the container whenever the oil was not in use? Oil can go bad if it oxidizes."
                },
                {
                    "headline": "Do not pour oil down the drain.",
                    "description": "This is especially important if the oil is usually solid at room temperature. It may seem like a quick and convenient way to get rid of used oil, but it will only result in a clogged drain. The best way to get rid of used oil is to pour it into a leak-proof container, such as a jar or zippered plastic bag, and then to throw the container into the trashcan."
                }
            ]
        }
    ],
    "tyn": [
        "Cool, dry cupboard or fridge",
        "Dark-colored glass bottle",
        "Cooking oil"
    ],
    "text": " Using the Right Container Keep the cap or lid on the oil bottle when you are not using it. One of the main causes of oil turning rancid is exposure to too much oxygen. When you are not using the oil, keep the cap or lid on the container. Store the oil in a dark-colored glass bottle with a tight-fitting cap. Even if the oil comes in a clear, glass bottle, consider transferring it to a blue or green one. Sunlight degrades the quality of oil, and a dark-colored bottle will help to keep that from happening. Use a funnel to help guide the oil into the new bottle without spillage. Brown colored glass is not recommended because it lets in too much light. If you own more than one type of oil, don't forget to label the bottles. You can reuse dark-colored wine and vinegar bottles. You can buy dark-colored bottles from a cooking equipment store. Avoid using plastic bottles. Plastic tends to leach chemicals over time. When this happens, it will affect the overall taste of the oil. If your oil came in a plastic bottle, consider transferring it to a glass bottle or jar with a tight-fitting lid. Avoid keeping cooking oils in containers made from iron or copper. These metals create a chemical reaction when they come in contact with oil and make it unsafe to use. Consider transferring some oil into a smaller container to make it easier to pour. Some oils come in a large bottle or tin. These are often heavy and difficult to move. You can make use of this oil easier by transferring a small amount of the oil into a dark-colored glass bottle (see above for suggestions). Pour the oil out from the bottle when you are ready to use it. When the small bottle becomes empty, refill it with more oil from the larger container. The smaller bottle will be a lot easier to manage than that large, heavy tin or bottle. Storing Cooking Oil Properly Be familiar with which types of oils can be stored at room temperature. The following types of oils can be kept at room temperature:\nGhee oil can last for several months. Palm oil can last for several months. Peanut oil (refined) will last for two years. Vegetable oil can last for a year or longer as long as it is tightly covered. Olive oil may be kept in the cupboard (at temperatures between 57°F and 70ºF (14°C and 21ºC) for up to 15 months. Store the oil in a cool, dark cupboard or pantry. Do not store it near or above the stove. The frequent temperature changes will cause the oil to deteriorate. Know which types of oils are best stored in the refrigerator. Some oils will spoil if they are not kept in a cold place. Refrigeration will cause most oils to turn cloudy and thick. Because of this, you will need to take the oil out one to two hours before you need it, and let it sit at room temperature, allowing the oil to return to its usual consistency. The following oils should be kept in the fridge:\nAvocado oil will last for 9 to 12 months. Corn oil will last up to 6 months. Mustard oil will last 5 to 6 months. Safflower oil will last for 6 months. Sesame oil will last for 6 months. Truffle oil will last for 6 months. Know which oils can be stored at both room temperature or in the fridge. Some oils can be kept either in the fridge or in the cupboard. However, in most cases, refrigeration will prolong the oil's shelf life. Note that refrigeration will cause some oils to turn thick and cloudy. If this happens, take the oil out of the fridge one to two hours before you need it, allowing it to return to its usual consistency. The one exception to this is coconut oil, which is solid at room temperature. The following oils can be kept either in the fridge or in a cool, dark cupboard:\nCanola oil can be stored in the cupboard for 4 to 6 months, or in the fridge for 9 months. Chili oil can be stored in the cupboard for 6 months. It will last longer in the fridge. Coconut oil can be stored in the cupboard for months. It can last longer in the fridge but is difficult to use quickly from the refrigerator. Grapeseed oil can be stored in the cupboard for 3 months (up to 70ºF/21ºC), or in the fridge for 6 months. Hazelnut oil can be stored in the cupboard for 3 months. It will last in the fridge for up to 6 months. Depending on the type, lard can be stored either in the cupboard or in the fridge. Read the label for proper storing techniques. Macadamia nut oil can be stored in the cupboard for up to two years. It can last even longer in the fridge. Palm kernel oil can be stored in the cupboard for up to a year. It can last longer in the fridge. Walnut oil can be stored in the cupboard for 3 months. It will last in the fridge for up to 6 months. Avoid storing oil where it can be damaged. Sunlight and frequent temperature changes can deteriorate oil and cause it to go rancid. Unfortunately, some of the most popular places to keep oil, such as windowsills and on the counter, are often the worst because the oil is subjected to too much sunlight and changes in temperature. Avoid keeping your oil in the places listed below, even if the oil can be kept at room temperature:\nWindowsills\nThe back ledge of a stove\nIn a cabinet above the stove\nNext to the stove or oven\nOn the counter\nNext to the refrigerator (the external side of a fridge can get quite hot through a cupboard partition)\nNear cooking appliances such as kettles, waffle makers and toasters. Discarding Old or Stale Oil Be aware that oil stays fresh for a short duration only. When shopping for oil, you may notice two different types: refined and unrefined. Refined oils have been processed, and usually have little taste or nutritional value. Unrefined oils tend to be more pure, and are packed with nutrients. The label on the bottle or jar will tell you whether the oil is refined or unrefined. Here is how long you can expect both types of oils to last:\nRefined oils will usually last 6 to 12 months if stored in a cool, dark cupboard (or fridge, if necessary). Unrefined oils will usually for 3 to 6 months if stored in a cool, dark, cupboard. A refrigerator is the best place to keep these oils. Sniff the oil every few months. If it smells bad or has a slight odor of wine, the oil has gone rancid. Toss the oil out. Pay attention to the taste. If the oil tastes metallic, a little bit like wine, or just plain bad, it has likely gone bad, turned rancid, or oxidized. Take note of how the oil was stored before it went bad. This might help you to understand why it went bad. Once you've figured out the reason, avoid making the same mistake when storing the next bottle of oil. Here are some things to look for when dealing with rancid oil:\nCheck the expiration date: If the oil has gone bad because you didn't use it in time, get a smaller bottle the next time you go shopping. Was it was stored in a plastic container? : Some types of plastic leach into the oil and cause it to taste bad. Was it stored in a metal container? : Some metals, such as copper an iron, are reactive. They create a chemical reaction when they come in contact with oil and give it a metallic taste. Oils should never be stored in such containers. Consider where it was stored: Some oils need to be kept in the fridge while others need to be kept in a cool, dark cabinet. Oils should be kept out of places that receive too much sunlight or are subjected to fluctuating temperatures. How was it stored? : Was the cap on the container whenever the oil was not in use? Oil can go bad if it oxidizes. Do not pour oil down the drain. This is especially important if the oil is usually solid at room temperature. It may seem like a quick and convenient way to get rid of used oil, but it will only result in a clogged drain. The best way to get rid of used oil is to pour it into a leak-proof container, such as a jar or zippered plastic bag, and then to throw the container into the trashcan.",
    "sentences": [
        " Using the Right Container Keep the cap or lid on the oil bottle when you are not using it.",
        "One of the main causes of oil turning rancid is exposure to too much oxygen.",
        "When you are not using the oil, keep the cap or lid on the container.",
        "Store the oil in a dark-colored glass bottle with a tight-fitting cap.",
        "Even if the oil comes in a clear, glass bottle, consider transferring it to a blue or green one.",
        "Sunlight degrades the quality of oil, and a dark-colored bottle will help to keep that from happening.",
        "Use a funnel to help guide the oil into the new bottle without spillage.",
        "Brown colored glass is not recommended because it lets in too much light.",
        "If you own more than one type of oil, don't forget to label the bottles.",
        "You can reuse dark-colored wine and vinegar bottles.",
        "You can buy dark-colored bottles from a cooking equipment store.",
        "Avoid using plastic bottles.",
        "Plastic tends to leach chemicals over time.",
        "When this happens, it will affect the overall taste of the oil.",
        "If your oil came in a plastic bottle, consider transferring it to a glass bottle or jar with a tight-fitting lid.",
        "Avoid keeping cooking oils in containers made from iron or copper.",
        "These metals create a chemical reaction when they come in contact with oil and make it unsafe to use.",
        "Consider transferring some oil into a smaller container to make it easier to pour.",
        "Some oils come in a large bottle or tin.",
        "These are often heavy and difficult to move.",
        "You can make use of this oil easier by transferring a small amount of the oil into a dark-colored glass bottle (see above for suggestions).",
        "Pour the oil out from the bottle when you are ready to use it.",
        "When the small bottle becomes empty, refill it with more oil from the larger container.",
        "The smaller bottle will be a lot easier to manage than that large, heavy tin or bottle.",
        "Storing Cooking Oil Properly Be familiar with which types of oils can be stored at room temperature.",
        "The following types of oils can be kept at room temperature:\nGhee oil can last for several months.",
        "Palm oil can last for several months.",
        "Peanut oil (refined) will last for two years.",
        "Vegetable oil can last for a year or longer as long as it is tightly covered.",
        "Olive oil may be kept in the cupboard (at temperatures between 57°F and 70ºF (14°C and 21ºC) for up to 15 months.",
        "Store the oil in a cool, dark cupboard or pantry.",
        "Do not store it near or above the stove.",
        "The frequent temperature changes will cause the oil to deteriorate.",
        "Know which types of oils are best stored in the refrigerator.",
        "Some oils will spoil if they are not kept in a cold place.",
        "Refrigeration will cause most oils to turn cloudy and thick.",
        "Because of this, you will need to take the oil out one to two hours before you need it, and let it sit at room temperature, allowing the oil to return to its usual consistency.",
        "The following oils should be kept in the fridge:\nAvocado oil will last for 9 to 12 months.",
        "Corn oil will last up to 6 months.",
        "Mustard oil will last 5 to 6 months.",
        "Safflower oil will last for 6 months.",
        "Sesame oil will last for 6 months.",
        "Truffle oil will last for 6 months.",
        "Know which oils can be stored at both room temperature or in the fridge.",
        "Some oils can be kept either in the fridge or in the cupboard.",
        "However, in most cases, refrigeration will prolong the oil's shelf life.",
        "Note that refrigeration will cause some oils to turn thick and cloudy.",
        "If this happens, take the oil out of the fridge one to two hours before you need it, allowing it to return to its usual consistency.",
        "The one exception to this is coconut oil, which is solid at room temperature.",
        "The following oils can be kept either in the fridge or in a cool, dark cupboard:\nCanola oil can be stored in the cupboard for 4 to 6 months, or in the fridge for 9 months.",
        "Chili oil can be stored in the cupboard for 6 months.",
        "It will last longer in the fridge.",
        "Coconut oil can be stored in the cupboard for months.",
        "It can last longer in the fridge but is difficult to use quickly from the refrigerator.",
        "Grapeseed oil can be stored in the cupboard for 3 months (up to 70ºF/21ºC), or in the fridge for 6 months.",
        "Hazelnut oil can be stored in the cupboard for 3 months.",
        "It will last in the fridge for up to 6 months.",
        "Depending on the type, lard can be stored either in the cupboard or in the fridge.",
        "Read the label for proper storing techniques.",
        "Macadamia nut oil can be stored in the cupboard for up to two years.",
        "It can last even longer in the fridge.",
        "Palm kernel oil can be stored in the cupboard for up to a year.",
        "It can last longer in the fridge.",
        "Walnut oil can be stored in the cupboard for 3 months.",
        "It will last in the fridge for up to 6 months.",
        "Avoid storing oil where it can be damaged.",
        "Sunlight and frequent temperature changes can deteriorate oil and cause it to go rancid.",
        "Unfortunately, some of the most popular places to keep oil, such as windowsills and on the counter, are often the worst because the oil is subjected to too much sunlight and changes in temperature.",
        "Avoid keeping your oil in the places listed below, even if the oil can be kept at room temperature:\nWindowsills\nThe back ledge of a stove\nIn a cabinet above the stove\nNext to the stove or oven\nOn the counter\nNext to the refrigerator (the external side of a fridge can get quite hot through a cupboard partition)\nNear cooking appliances such as kettles, waffle makers and toasters.",
        "Discarding Old or Stale Oil Be aware that oil stays fresh for a short duration only.",
        "When shopping for oil, you may notice two different types: refined and unrefined.",
        "Refined oils have been processed, and usually have little taste or nutritional value.",
        "Unrefined oils tend to be more pure, and are packed with nutrients.",
        "The label on the bottle or jar will tell you whether the oil is refined or unrefined.",
        "Here is how long you can expect both types of oils to last:\nRefined oils will usually last 6 to 12 months if stored in a cool, dark cupboard (or fridge, if necessary).",
        "Unrefined oils will usually for 3 to 6 months if stored in a cool, dark, cupboard.",
        "A refrigerator is the best place to keep these oils.",
        "Sniff the oil every few months.",
        "If it smells bad or has a slight odor of wine, the oil has gone rancid.",
        "Toss the oil out.",
        "Pay attention to the taste.",
        "If the oil tastes metallic, a little bit like wine, or just plain bad, it has likely gone bad, turned rancid, or oxidized.",
        "Take note of how the oil was stored before it went bad.",
        "This might help you to understand why it went bad.",
        "Once you've figured out the reason, avoid making the same mistake when storing the next bottle of oil.",
        "Here are some things to look for when dealing with rancid oil:\nCheck the expiration date: If the oil has gone bad because you didn't use it in time, get a smaller bottle the next time you go shopping.",
        "Was it was stored in a plastic container?",
        ": Some types of plastic leach into the oil and cause it to taste bad.",
        "Was it stored in a metal container?",
        ": Some metals, such as copper an iron, are reactive.",
        "They create a chemical reaction when they come in contact with oil and give it a metallic taste.",
        "Oils should never be stored in such containers.",
        "Consider where it was stored: Some oils need to be kept in the fridge while others need to be kept in a cool, dark cabinet.",
        "Oils should be kept out of places that receive too much sunlight or are subjected to fluctuating temperatures.",
        "How was it stored?",
        ": Was the cap on the container whenever the oil was not in use?",
        "Oil can go bad if it oxidizes.",
        "Do not pour oil down the drain.",
        "This is especially important if the oil is usually solid at room temperature.",
        "It may seem like a quick and convenient way to get rid of used oil, but it will only result in a clogged drain.",
        "The best way to get rid of used oil is to pour it into a leak-proof container, such as a jar or zippered plastic bag, and then to throw the container into the trashcan."
    ]
}