{
    "title": "How to Make a Book Style eReader Cover",
    "url": "https://www.wikihow.com/Make-a-Book-Style-eReader-Cover",
    "category_hierarchy": [
        "Personal Care and Style",
        "Bags"
    ],
    "steps": [
        {
            "headline": "Find a book that is a little thicker than your eReader and about an inch (2.5cm) larger in length and height.",
            "description": "It can be large in length and height, but will need to be cut to size."
        },
        {
            "headline": "Remove the inside pages of the book, being careful to preserve the cover and spine.",
            "description": ""
        },
        {
            "headline": "Measure the cover for cutting if your cover is too large for your eReader, and cut the cover.",
            "description": "The Amazon Kindle used in this demonstration is 7.5\" x 5\" (19cm x 12.5cm), so the cover was cut so that each panel measured 8.5\" x 6\" (21.5cm x 15cm), not including the spine."
        },
        {
            "headline": "Use tape to reinforce the spine and all of the edges.",
            "description": "This will also help give the cut edges a smooth finish. If your book is already sized properly, you can still reinforce the edges using this step."
        },
        {
            "headline": "Select a fabric or contact paper that you like.",
            "description": "This is used to cover your 'book'. It doesn't need to be very neat on the inside of the cover as these edges will all be covered up. Try to refrain from leaving lumps of fabric on the inside of the cover and you'll be fine. Hot glue works well to secure the fabric."
        },
        {
            "headline": "Place a wide strip of fabric up the inside spine of the book, be sure to fold under the top and bottom of the fabric to hide the edges.",
            "description": "These will be visible."
        },
        {
            "headline": "Cut cardboard panels 1/2\" (1.27cm) larger than the length and height of your eReader.",
            "description": "(Something with a sturdiness like a cereal box or other product box will work well; standard cardboard will be too thick for this.) The Amazon Kindle used in this demonstration is 7.5\" x 5\" (19cm x 12.5cm), so the two inside panels are 8\" x 5.5\" (21.5cm x 12.5cm)."
        },
        {
            "headline": "Cut two felt, fleece or thin foam panels the same size as above and attach them to your paper board panels with craft glue.",
            "description": "These will provide your eReader with some padding and protection."
        },
        {
            "headline": "Cover the panels with the protective material of your choice.",
            "description": "No need to be too tidy with the backsides."
        },
        {
            "headline": "Add elastic to one panel.",
            "description": "You'll want to use elastic that is approximately 4 inches (10cm) or so in length to each corner of the panel that will be used for the inside of the back cover. Lay the piece of elastic across the corner approx. 1\" (2.5cm) in and wrap the excess elastic behind the panel (as seen in the step above). You can use a sewing machine to attach the elastic or hot glue. Repeat this at all four corners. (This will hold the eReader in place.) Use the elastic to add loop closure for your case. You can do that now by placing a piece of looped elastic in the middle of the right side of the inner back panel. You can also add a button or other item to loop it over to the front of your cover."
        },
        {
            "headline": "Use glue to attach each of these panels to the inside of the cover.",
            "description": "The panel with the elastic will go on the right. Allow the cover to sit overnight or up to 24 hours to be sure that all of the glue has fully dried."
        },
        {
            "headline": "Insert your eReader and flaunt your brand new cover.",
            "description": "You'll have the wonderful feeling of holding a book in your hand and even nicer, this cover can fold backwards while you're reading, should you so choose."
        }
    ],
    "tyn": [
        "Fabric",
        "Cardboard",
        "Hot glue and craft glue",
        "eReader",
        "Button (optional)",
        "Felt",
        "Packaging tape",
        "Thick elastic band",
        "Needle and thread",
        "Button"
    ],
    "text": " Find a book that is a little thicker than your eReader and about an inch (2.5cm) larger in length and height. It can be large in length and height, but will need to be cut to size. Remove the inside pages of the book, being careful to preserve the cover and spine.  Measure the cover for cutting if your cover is too large for your eReader, and cut the cover. The Amazon Kindle used in this demonstration is 7.5\" x 5\" (19cm x 12.5cm), so the cover was cut so that each panel measured 8.5\" x 6\" (21.5cm x 15cm), not including the spine. Use tape to reinforce the spine and all of the edges. This will also help give the cut edges a smooth finish. If your book is already sized properly, you can still reinforce the edges using this step. Select a fabric or contact paper that you like. This is used to cover your 'book'. It doesn't need to be very neat on the inside of the cover as these edges will all be covered up. Try to refrain from leaving lumps of fabric on the inside of the cover and you'll be fine. Hot glue works well to secure the fabric. Place a wide strip of fabric up the inside spine of the book, be sure to fold under the top and bottom of the fabric to hide the edges. These will be visible. Cut cardboard panels 1/2\" (1.27cm) larger than the length and height of your eReader. (Something with a sturdiness like a cereal box or other product box will work well; standard cardboard will be too thick for this.) The Amazon Kindle used in this demonstration is 7.5\" x 5\" (19cm x 12.5cm), so the two inside panels are 8\" x 5.5\" (21.5cm x 12.5cm). Cut two felt, fleece or thin foam panels the same size as above and attach them to your paper board panels with craft glue. These will provide your eReader with some padding and protection. Cover the panels with the protective material of your choice. No need to be too tidy with the backsides. Add elastic to one panel. You'll want to use elastic that is approximately 4 inches (10cm) or so in length to each corner of the panel that will be used for the inside of the back cover. Lay the piece of elastic across the corner approx. 1\" (2.5cm) in and wrap the excess elastic behind the panel (as seen in the step above). You can use a sewing machine to attach the elastic or hot glue. Repeat this at all four corners. (This will hold the eReader in place.) Use the elastic to add loop closure for your case. You can do that now by placing a piece of looped elastic in the middle of the right side of the inner back panel. You can also add a button or other item to loop it over to the front of your cover. Use glue to attach each of these panels to the inside of the cover. The panel with the elastic will go on the right. Allow the cover to sit overnight or up to 24 hours to be sure that all of the glue has fully dried. Insert your eReader and flaunt your brand new cover. You'll have the wonderful feeling of holding a book in your hand and even nicer, this cover can fold backwards while you're reading, should you so choose.",
    "sentences": [
        " Find a book that is a little thicker than your eReader and about an inch (2.5cm) larger in length and height.",
        "It can be large in length and height, but will need to be cut to size.",
        "Remove the inside pages of the book, being careful to preserve the cover and spine.",
        "Measure the cover for cutting if your cover is too large for your eReader, and cut the cover.",
        "The Amazon Kindle used in this demonstration is 7.5\" x 5\" (19cm x 12.5cm), so the cover was cut so that each panel measured 8.5\" x 6\" (21.5cm x 15cm), not including the spine.",
        "Use tape to reinforce the spine and all of the edges.",
        "This will also help give the cut edges a smooth finish.",
        "If your book is already sized properly, you can still reinforce the edges using this step.",
        "Select a fabric or contact paper that you like.",
        "This is used to cover your 'book'.",
        "It doesn't need to be very neat on the inside of the cover as these edges will all be covered up.",
        "Try to refrain from leaving lumps of fabric on the inside of the cover and you'll be fine.",
        "Hot glue works well to secure the fabric.",
        "Place a wide strip of fabric up the inside spine of the book, be sure to fold under the top and bottom of the fabric to hide the edges.",
        "These will be visible.",
        "Cut cardboard panels 1/2\" (1.27cm) larger than the length and height of your eReader.",
        "(Something with a sturdiness like a cereal box or other product box will work well; standard cardboard will be too thick for this.)",
        "The Amazon Kindle used in this demonstration is 7.5\" x 5\" (19cm x 12.5cm), so the two inside panels are 8\" x 5.5\" (21.5cm x 12.5cm).",
        "Cut two felt, fleece or thin foam panels the same size as above and attach them to your paper board panels with craft glue.",
        "These will provide your eReader with some padding and protection.",
        "Cover the panels with the protective material of your choice.",
        "No need to be too tidy with the backsides.",
        "Add elastic to one panel.",
        "You'll want to use elastic that is approximately 4 inches (10cm) or so in length to each corner of the panel that will be used for the inside of the back cover.",
        "Lay the piece of elastic across the corner approx.",
        "1\" (2.5cm) in and wrap the excess elastic behind the panel (as seen in the step above).",
        "You can use a sewing machine to attach the elastic or hot glue.",
        "Repeat this at all four corners.",
        "(This will hold the eReader in place.)",
        "Use the elastic to add loop closure for your case.",
        "You can do that now by placing a piece of looped elastic in the middle of the right side of the inner back panel.",
        "You can also add a button or other item to loop it over to the front of your cover.",
        "Use glue to attach each of these panels to the inside of the cover.",
        "The panel with the elastic will go on the right.",
        "Allow the cover to sit overnight or up to 24 hours to be sure that all of the glue has fully dried.",
        "Insert your eReader and flaunt your brand new cover.",
        "You'll have the wonderful feeling of holding a book in your hand and even nicer, this cover can fold backwards while you're reading, should you so choose."
    ]
}