{
    "title": "How to Get Adhesive out of Carpet",
    "url": "https://www.wikihow.com/Get-Adhesive-out-of-Carpet",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Floors and Stairs",
        "Carpets and Rugs"
    ],
    "methods": [
        {
            "name": "Removing Craft Glue",
            "steps": [
                {
                    "headline": "Remove any excess adhesive.",
                    "description": "Remove as much of the glue that you can. Even if it has dried, you should still attempt to remove residual glue. If the glue is fresh, dab at the spot with a towel. Soak up as much of the glue as you can. If the spot has dried, use a damp towel instead. Make sure the water on the towel is warm enough to cause the glue to soften."
                },
                {
                    "headline": "Use distilled white vinegar.",
                    "description": "Pour distilled white vinegar into a cloth and wipe the area for at least a minute, being sure to adequately wet the area. Leave the vinegar on the spot for at least 15 minutes. You can also use equal parts water and vinegar if you prefer. However, you may need to leave the mixture on overnight. The vinegar should cause the adhesive to start peeling off fairly quickly and easily. Use a wet cloth to remove any adhesive and let the area sit to dry. Be sure to use only distilled, white vinegar and test a small area before using the solution on larger areas."
                },
                {
                    "headline": "Apply dish soap.",
                    "description": "An alternative to white vinegar is to use dish soap, a common household product. You will want to combine approximately one tablespoon of dish soap with one cup of warm water. Using a cloth, apply the mixture directly to the residual adhesive. Gently scrub the spot, but be careful not to apply too much pressure, as you don’t want the glue to get pushed deeper into the carpet. Pat the spot dry with another cloth and let it sit."
                }
            ]
        },
        {
            "name": "Removing Adhesive Tape",
            "steps": [
                {
                    "headline": "Remove any excess tape.",
                    "description": "Try to remove as much of the tape as you can. If the tape has a strong hold, work slowly by pulling the tape with your hand. Try to get as many pieces as you can."
                },
                {
                    "headline": "Use distilled white vinegar.",
                    "description": "Distilled vinegar can also be used to remove adhesive tape. Pour distilled white vinegar into a cloth and wipe the area for at least a minute, being sure to adequately wet the area. Leave the vinegar on the spot for at least 15 minutes. You can also use equal parts water and vinegar if you prefer. However, you may need to leave the mixture on overnight. The vinegar should cause the tape to start peeling off fairly quickly and easily. Use a wet cloth to remove any adhesive and let the area sit to dry. Be sure to use only distilled, white vinegar and test a small area before using the solution on larger areas."
                },
                {
                    "headline": "Apply WD-40 to the adhesive.",
                    "description": "First, scrape the carpet with a plastic knife or paint scraper to remove as much tape as possible. Next, dab the WD-40 onto the remaining adhesive. Let it set on the carpet for 15 minutes. Then, scrape the carpet again to remove as much of the adhesive as possible. Finally, apply a carpet cleaner, such as Goo Gone to finish the clean-up.Be sure to test the WD-40 on an inconspicuous place on your carpet before you apply it to a visible area. For example, test it on a spot behind your sofa. Make sure it doesn't stain or damage your carpet. Don't leave the WD-40 on your carpet for longer than 15-30 minutes. If you do, it will weaken the glue that holds your carpet down."
                },
                {
                    "headline": "Dab the area with rubbing alcohol.",
                    "description": "Dampen a clean cloth or paper towel with rubbing alcohol. Then, press the alcohol into the carpet. Rub slightly to remove the adhesive residue. If the adhesive is stubborn, you can lay an alcohol-soaked cloth over the spot for about 10-15 minutes before rubbing.Test the rubbing alcohol in an out-of-the-way spot before using it in a visible location. You can also use vodka."
                },
                {
                    "headline": "Use an iron.",
                    "description": "Plug in the iron and set it to the highest steam setting. Place a paper towel over the spot. Then use a clean cloth to cover the paper towel. Once the iron has reached the proper temperature, simply iron over the cloth for approximately 10 seconds. Pull the paper towel and cloth back. The adhesive should have been transferred to the paper towel. Use caution when working with a hot iron. Make sure you test a small area before moving on to a larger one. The towel or cloth is important, as it helps to prevent carpet burns."
                },
                {
                    "headline": "Call professionals to steam clean.",
                    "description": "If all else fails, call the professionals. Sometimes tape is simply too difficult to tackle on your own. If you’ve exhausted your cleaning options and still haven’t had luck, it may be time to call the professionals to steam clean your carpets. Hire someone who is knowledgeable on adhesive removal and has had experience in doing so. Inquire about the type of cleaning solution they will be using. Make them aware ahead of time if you prefer to only use environmentally safe cleaning products."
                }
            ]
        },
        {
            "name": "Removing Super Glue",
            "steps": [
                {
                    "headline": "Remove as much of the glue as possible.",
                    "description": "Even if the super glue has already dried, you can still try to remove any excessive adhesive. To remove super glue that has already dried, apply acetone nail polish remover to a cotton ball and dab it on the spot. Only apply it to a small area to start. If you notice the nail polish remover is damaging your carpet, discontinue use immediately. Otherwise, you can continue applying it to the rest of the stain. Use a wet cloth to blot the area, to pull up any adhesive and to remove excess nail polish remover."
                },
                {
                    "headline": "Use a product with d-Limonene.",
                    "description": "Once most of the adhesive and nail polish has been absorbed, apply a cleaning agent that contains d-Limonene. This is a natural, environmentally friendly cleaning solution. You can either ask a salesperson for help at any major retail store or can do a quick search online. Amazon offers a multitude of products, which contain d-Limonene and can be shipped directly to your house. Apply the product to the spot with a cloth. You can wear gloves if you’d like, but d-Limonene is a natural substance. Consult the directions on the container and leave it sit on the spot as directed. Use a separate, wet cloth to wipe away any residue that is left. You will need to thoroughly scrub this area, as d-Limonene will leave a residue."
                },
                {
                    "headline": "Try a gel solvent.",
                    "description": "Goo Gone is one of the most popular gel solvents. You can use this in lieu of d-Limonene products. Apply Goo Gone directly to the spot and leave it sit for one minute. Use a wet cloth to wipe away the Goo Gone. Pat the spot dry and let it sit. You may need to reapply the Goo Gone and rinse the area again if the spot is still present. As an alternative to Goo Gone, you can try De-Solv-It."
                }
            ]
        }
    ],
    "tyn": [
        "Dish soap",
        "Water",
        "Distilled white vinegar",
        "WD-40",
        "Rubbing alcohol or vodka",
        "Iron",
        "Soft cloths",
        "Acetone nail polish remover"
    ],
    "text": " Removing Craft Glue Remove any excess adhesive. Remove as much of the glue that you can. Even if it has dried, you should still attempt to remove residual glue. If the glue is fresh, dab at the spot with a towel. Soak up as much of the glue as you can. If the spot has dried, use a damp towel instead. Make sure the water on the towel is warm enough to cause the glue to soften. Use distilled white vinegar. Pour distilled white vinegar into a cloth and wipe the area for at least a minute, being sure to adequately wet the area. Leave the vinegar on the spot for at least 15 minutes. You can also use equal parts water and vinegar if you prefer. However, you may need to leave the mixture on overnight. The vinegar should cause the adhesive to start peeling off fairly quickly and easily. Use a wet cloth to remove any adhesive and let the area sit to dry. Be sure to use only distilled, white vinegar and test a small area before using the solution on larger areas. Apply dish soap. An alternative to white vinegar is to use dish soap, a common household product. You will want to combine approximately one tablespoon of dish soap with one cup of warm water. Using a cloth, apply the mixture directly to the residual adhesive. Gently scrub the spot, but be careful not to apply too much pressure, as you don’t want the glue to get pushed deeper into the carpet. Pat the spot dry with another cloth and let it sit. Removing Adhesive Tape Remove any excess tape. Try to remove as much of the tape as you can. If the tape has a strong hold, work slowly by pulling the tape with your hand. Try to get as many pieces as you can. Use distilled white vinegar. Distilled vinegar can also be used to remove adhesive tape. Pour distilled white vinegar into a cloth and wipe the area for at least a minute, being sure to adequately wet the area. Leave the vinegar on the spot for at least 15 minutes. You can also use equal parts water and vinegar if you prefer. However, you may need to leave the mixture on overnight. The vinegar should cause the tape to start peeling off fairly quickly and easily. Use a wet cloth to remove any adhesive and let the area sit to dry. Be sure to use only distilled, white vinegar and test a small area before using the solution on larger areas. Apply WD-40 to the adhesive. First, scrape the carpet with a plastic knife or paint scraper to remove as much tape as possible. Next, dab the WD-40 onto the remaining adhesive. Let it set on the carpet for 15 minutes. Then, scrape the carpet again to remove as much of the adhesive as possible. Finally, apply a carpet cleaner, such as Goo Gone to finish the clean-up.Be sure to test the WD-40 on an inconspicuous place on your carpet before you apply it to a visible area. For example, test it on a spot behind your sofa. Make sure it doesn't stain or damage your carpet. Don't leave the WD-40 on your carpet for longer than 15-30 minutes. If you do, it will weaken the glue that holds your carpet down. Dab the area with rubbing alcohol. Dampen a clean cloth or paper towel with rubbing alcohol. Then, press the alcohol into the carpet. Rub slightly to remove the adhesive residue. If the adhesive is stubborn, you can lay an alcohol-soaked cloth over the spot for about 10-15 minutes before rubbing.Test the rubbing alcohol in an out-of-the-way spot before using it in a visible location. You can also use vodka. Use an iron. Plug in the iron and set it to the highest steam setting. Place a paper towel over the spot. Then use a clean cloth to cover the paper towel. Once the iron has reached the proper temperature, simply iron over the cloth for approximately 10 seconds. Pull the paper towel and cloth back. The adhesive should have been transferred to the paper towel. Use caution when working with a hot iron. Make sure you test a small area before moving on to a larger one. The towel or cloth is important, as it helps to prevent carpet burns. Call professionals to steam clean. If all else fails, call the professionals. Sometimes tape is simply too difficult to tackle on your own. If you’ve exhausted your cleaning options and still haven’t had luck, it may be time to call the professionals to steam clean your carpets. Hire someone who is knowledgeable on adhesive removal and has had experience in doing so. Inquire about the type of cleaning solution they will be using. Make them aware ahead of time if you prefer to only use environmentally safe cleaning products. Removing Super Glue Remove as much of the glue as possible. Even if the super glue has already dried, you can still try to remove any excessive adhesive. To remove super glue that has already dried, apply acetone nail polish remover to a cotton ball and dab it on the spot. Only apply it to a small area to start. If you notice the nail polish remover is damaging your carpet, discontinue use immediately. Otherwise, you can continue applying it to the rest of the stain. Use a wet cloth to blot the area, to pull up any adhesive and to remove excess nail polish remover. Use a product with d-Limonene. Once most of the adhesive and nail polish has been absorbed, apply a cleaning agent that contains d-Limonene. This is a natural, environmentally friendly cleaning solution. You can either ask a salesperson for help at any major retail store or can do a quick search online. Amazon offers a multitude of products, which contain d-Limonene and can be shipped directly to your house. Apply the product to the spot with a cloth. You can wear gloves if you’d like, but d-Limonene is a natural substance. Consult the directions on the container and leave it sit on the spot as directed. Use a separate, wet cloth to wipe away any residue that is left. You will need to thoroughly scrub this area, as d-Limonene will leave a residue. Try a gel solvent. Goo Gone is one of the most popular gel solvents. You can use this in lieu of d-Limonene products. Apply Goo Gone directly to the spot and leave it sit for one minute. Use a wet cloth to wipe away the Goo Gone. Pat the spot dry and let it sit. You may need to reapply the Goo Gone and rinse the area again if the spot is still present. As an alternative to Goo Gone, you can try De-Solv-It.",
    "sentences": [
        " Removing Craft Glue Remove any excess adhesive.",
        "Remove as much of the glue that you can.",
        "Even if it has dried, you should still attempt to remove residual glue.",
        "If the glue is fresh, dab at the spot with a towel.",
        "Soak up as much of the glue as you can.",
        "If the spot has dried, use a damp towel instead.",
        "Make sure the water on the towel is warm enough to cause the glue to soften.",
        "Use distilled white vinegar.",
        "Pour distilled white vinegar into a cloth and wipe the area for at least a minute, being sure to adequately wet the area.",
        "Leave the vinegar on the spot for at least 15 minutes.",
        "You can also use equal parts water and vinegar if you prefer.",
        "However, you may need to leave the mixture on overnight.",
        "The vinegar should cause the adhesive to start peeling off fairly quickly and easily.",
        "Use a wet cloth to remove any adhesive and let the area sit to dry.",
        "Be sure to use only distilled, white vinegar and test a small area before using the solution on larger areas.",
        "Apply dish soap.",
        "An alternative to white vinegar is to use dish soap, a common household product.",
        "You will want to combine approximately one tablespoon of dish soap with one cup of warm water.",
        "Using a cloth, apply the mixture directly to the residual adhesive.",
        "Gently scrub the spot, but be careful not to apply too much pressure, as you don’t want the glue to get pushed deeper into the carpet.",
        "Pat the spot dry with another cloth and let it sit.",
        "Removing Adhesive Tape Remove any excess tape.",
        "Try to remove as much of the tape as you can.",
        "If the tape has a strong hold, work slowly by pulling the tape with your hand.",
        "Try to get as many pieces as you can.",
        "Use distilled white vinegar.",
        "Distilled vinegar can also be used to remove adhesive tape.",
        "Pour distilled white vinegar into a cloth and wipe the area for at least a minute, being sure to adequately wet the area.",
        "Leave the vinegar on the spot for at least 15 minutes.",
        "You can also use equal parts water and vinegar if you prefer.",
        "However, you may need to leave the mixture on overnight.",
        "The vinegar should cause the tape to start peeling off fairly quickly and easily.",
        "Use a wet cloth to remove any adhesive and let the area sit to dry.",
        "Be sure to use only distilled, white vinegar and test a small area before using the solution on larger areas.",
        "Apply WD-40 to the adhesive.",
        "First, scrape the carpet with a plastic knife or paint scraper to remove as much tape as possible.",
        "Next, dab the WD-40 onto the remaining adhesive.",
        "Let it set on the carpet for 15 minutes.",
        "Then, scrape the carpet again to remove as much of the adhesive as possible.",
        "Finally, apply a carpet cleaner, such as Goo Gone to finish the clean-up.Be sure to test the WD-40 on an inconspicuous place on your carpet before you apply it to a visible area.",
        "For example, test it on a spot behind your sofa.",
        "Make sure it doesn't stain or damage your carpet.",
        "Don't leave the WD-40 on your carpet for longer than 15-30 minutes.",
        "If you do, it will weaken the glue that holds your carpet down.",
        "Dab the area with rubbing alcohol.",
        "Dampen a clean cloth or paper towel with rubbing alcohol.",
        "Then, press the alcohol into the carpet.",
        "Rub slightly to remove the adhesive residue.",
        "If the adhesive is stubborn, you can lay an alcohol-soaked cloth over the spot for about 10-15 minutes before rubbing.Test the rubbing alcohol in an out-of-the-way spot before using it in a visible location.",
        "You can also use vodka.",
        "Use an iron.",
        "Plug in the iron and set it to the highest steam setting.",
        "Place a paper towel over the spot.",
        "Then use a clean cloth to cover the paper towel.",
        "Once the iron has reached the proper temperature, simply iron over the cloth for approximately 10 seconds.",
        "Pull the paper towel and cloth back.",
        "The adhesive should have been transferred to the paper towel.",
        "Use caution when working with a hot iron.",
        "Make sure you test a small area before moving on to a larger one.",
        "The towel or cloth is important, as it helps to prevent carpet burns.",
        "Call professionals to steam clean.",
        "If all else fails, call the professionals.",
        "Sometimes tape is simply too difficult to tackle on your own.",
        "If you’ve exhausted your cleaning options and still haven’t had luck, it may be time to call the professionals to steam clean your carpets.",
        "Hire someone who is knowledgeable on adhesive removal and has had experience in doing so.",
        "Inquire about the type of cleaning solution they will be using.",
        "Make them aware ahead of time if you prefer to only use environmentally safe cleaning products.",
        "Removing Super Glue Remove as much of the glue as possible.",
        "Even if the super glue has already dried, you can still try to remove any excessive adhesive.",
        "To remove super glue that has already dried, apply acetone nail polish remover to a cotton ball and dab it on the spot.",
        "Only apply it to a small area to start.",
        "If you notice the nail polish remover is damaging your carpet, discontinue use immediately.",
        "Otherwise, you can continue applying it to the rest of the stain.",
        "Use a wet cloth to blot the area, to pull up any adhesive and to remove excess nail polish remover.",
        "Use a product with d-Limonene.",
        "Once most of the adhesive and nail polish has been absorbed, apply a cleaning agent that contains d-Limonene.",
        "This is a natural, environmentally friendly cleaning solution.",
        "You can either ask a salesperson for help at any major retail store or can do a quick search online.",
        "Amazon offers a multitude of products, which contain d-Limonene and can be shipped directly to your house.",
        "Apply the product to the spot with a cloth.",
        "You can wear gloves if you’d like, but d-Limonene is a natural substance.",
        "Consult the directions on the container and leave it sit on the spot as directed.",
        "Use a separate, wet cloth to wipe away any residue that is left.",
        "You will need to thoroughly scrub this area, as d-Limonene will leave a residue.",
        "Try a gel solvent.",
        "Goo Gone is one of the most popular gel solvents.",
        "You can use this in lieu of d-Limonene products.",
        "Apply Goo Gone directly to the spot and leave it sit for one minute.",
        "Use a wet cloth to wipe away the Goo Gone.",
        "Pat the spot dry and let it sit.",
        "You may need to reapply the Goo Gone and rinse the area again if the spot is still present.",
        "As an alternative to Goo Gone, you can try De-Solv-It."
    ]
}