{
    "title": "How to Dye Pubic Hair",
    "url": "https://www.wikihow.com/Dye-Pubic-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Body Hair"
    ],
    "methods": [
        {
            "name": "Using Hair Dye",
            "steps": [
                {
                    "headline": "Choose a hair dye without ammonia or parabens.",
                    "description": "Your pubic area is very sensitive and vulnerable to harsh chemicals. Read the ingredients list on the back of the box of hair dye to make sure it doesn’t contain ammonia or parabens that could irritate your skin. Look for dye that’s labeled “chemical-free,” “organic,” or “all-natural.”\nYou can use any color dye. Pick a color that matches your hair or, for a playful look, pick a bright color like pink or blue."
                },
                {
                    "headline": "Apply petroleum jelly to the most sensitive areas to protect them.",
                    "description": "Petroleum jelly acts like a barrier between your skin and the dye so it doesn’t stain or irritate certain spots. Rub a thin layer onto your labia, vulva, penis, or scrotum. Avoid getting petroleum jelly on the hair you want to dye since the jelly blocks the dye."
                },
                {
                    "headline": "Put on plastic gloves and mix the hair dye according to the directions.",
                    "description": "Your box of hair dye will contain instructions for how to prepare the dye. It should also include plastic gloves. Place them on your hands before you begin working with the dye to protect your skin. If your hair dye doesn’t come with gloves, you can buy them at any beauty store, grocery store, or online retailer. Test a small amount of dye on your skin before applying all over to make sure you don’t have an allergic reaction. How to Perform a Skin Patch Test for Hair Dye\n1. Dab a small amount of the dye on your skin with a cotton swab. Any area of skin will work, like the back of your hand or your inner thigh. 2. Let it sit for 48 hours. 3. Check the area. If it’s irritated, burning, or red, don’t use that dye."
                },
                {
                    "headline": "Stir an equal amount of moisturizing shampoo into the dye.",
                    "description": "This dilutes the dye so it isn’t as harsh on your pubic area. Pour the same amount of shampoo as there is dye into the dye itself. Mix the 2 together with a spoon until thoroughly combined. The exact amount of hair dye should be listed on the front of the box. Use that measurement for your shampoo. For example, if you have 3 ounces (85 g) of hair color, you’ll add 3 ounces (85 g) of shampoo. Choose shampoo that has hydrating ingredients, like argan oil, vitamin E, or Moroccan oil. Avoid one that has parabens, which will irritate your skin."
                },
                {
                    "headline": "Brush the dye onto your pubic hair.",
                    "description": "Use the hair dye applicator brush to gently apply the dye, making sure to completely saturate all of the hair. Avoid rubbing the dye or letting it get into any super sensitive places, like inside your vagina. Most boxed hair dye will come with an applicator brush. If yours doesn’t, buy one from a beauty store or an online retailer. You can also use a small paintbrush with bristles instead the hair dye brush."
                },
                {
                    "headline": "Let the dye sit for about 30 minutes.",
                    "description": "This allows the color to fully soak into your pubic hair. Check the directions provided with the hair dye to find the exact processing time for that specific brand and type. Some dyes may be closer to 20 minutes. Wash off the dye immediately if you experience any burning or painful tingling sensations. Set a timer or use the clock app on your phone to keep track of the time. Don’t leave the dye on for longer than the recommended time or you could damage your pubic hair and skin."
                },
                {
                    "headline": "Rinse off the dye with warm water and a washcloth.",
                    "description": "Stand under the shower so the water runs over the dye, removing it from your pubic hair. Gently rub the area with a clean washcloth to get rid of any excess dye or petroleum jelly, too. You'll know that all of the dye is gone once the water runs clear. If there’s any dye left on your skin after you dry off, dab the area with a cotton ball dipped in astringent or witch hazel to remove it. Once it dries, if you aren't satisfied with the color, you should wait 4 weeks before re-dyeing it so you don't damage your hair."
                }
            ]
        },
        {
            "name": "Dyeing with Kool-Aid",
            "steps": [
                {
                    "headline": "Mix 2 packets of Kool-Aid with 2 cups (470 ml) of water in a saucepan.",
                    "description": "Pour the water in first. Then add the contents of both Kool-Aid packets. Use a spoon to stir them together until thoroughly combined. Choose Kool-Aid that has powder the color that you want your pubic hair to be. For example, cherry Kool-Aid will result in red hair. You can also mix packets for different colors. Kool-Aid Colors for Pubic Hair\nPurple: Blue Raspberry + Cherry\nBright red: Cherry\nGreen: Lemon-Lime + Blue Raspberry\nBrown: Lemonade + Orange + Grape\nPink: Pink Lemonade"
                },
                {
                    "headline": "Boil the liquid for 1 to 2 minutes over medium-high heat.",
                    "description": "Place the saucepan on the stove and bring the water and Kool-Aid to a boil. Stir it while it boils so the powder doesn’t settle at the bottom. On a stove with 9 heat settings, medium-high heat is 6 or 7."
                },
                {
                    "headline": "Remove the pan from the heat and pour the liquid into a bowl.",
                    "description": "Don’t leave the mixture in the hot pan or it will continue to cook, which can affect the strength of the color. Transfer it to a bowl immediately. A cup or basin will work if you don’t have a bowl. If you use a plastic container, the Kool-Aid could stain it."
                },
                {
                    "headline": "Use a hair applicator brush to apply the mixture to your pubic hair.",
                    "description": "Dip the brush into the bowl to soak up the liquid. Then brush it over your hair, making sure to coat every strand with color. Avoid putting the Kool-Aid mixture on super sensitive spots of your pubic area. Do this over an old towel if you don’t want to get Kool-Aid stains on the floor. You can buy a hair color applicator brush at a beauty store or from an online retailer. You can also use a paintbrush with soft bristles instead."
                },
                {
                    "headline": "Let the Kool-Aid mixture sit on your pubic hair for 15-30 minutes.",
                    "description": "Lighter hair, like blonde or gray, will absorb the color faster. However, darker brown or black hair will take at least the full 30 minutes to change color. To keep track of the time, use your phone’s clock app or set a timer."
                },
                {
                    "headline": "Rinse the mixture off of your pubic hair with warm water and a washcloth.",
                    "description": "Run water over your pubic hair to remove the Kool-Aid. Gently scrub the area with a washcloth, too, to get rid of any extra color that may be on your skin. Once the water runs clear, all of the Kool-Aid mixture is gone. If you want a deeper color, repeat the entire process once your pubic hair dries. The color will last for 2 to 4 weeks, depending on how often you shower."
                }
            ]
        }
    ],
    "tyn": [
        "Using Hair Dye",
        "Hair dye",
        "Hair color applicator brush",
        "Plastic gloves",
        "Petroleum jelly",
        "Moisturizing shampoo",
        "Washcloth",
        "Astringent or witch hazel (optional)",
        "Cotton balls (optional)",
        "Dyeing with Kool-Aid",
        "2 packets of Kool-Aid",
        "2 cups (470 ml) of water",
        "Saucepan",
        "Bowl",
        "Spoon",
        "Hair color applicator brush or paintbrush"
    ],
    "text": " Using Hair Dye Choose a hair dye without ammonia or parabens. Your pubic area is very sensitive and vulnerable to harsh chemicals. Read the ingredients list on the back of the box of hair dye to make sure it doesn’t contain ammonia or parabens that could irritate your skin. Look for dye that’s labeled “chemical-free,” “organic,” or “all-natural.”\nYou can use any color dye. Pick a color that matches your hair or, for a playful look, pick a bright color like pink or blue. Apply petroleum jelly to the most sensitive areas to protect them. Petroleum jelly acts like a barrier between your skin and the dye so it doesn’t stain or irritate certain spots. Rub a thin layer onto your labia, vulva, penis, or scrotum. Avoid getting petroleum jelly on the hair you want to dye since the jelly blocks the dye. Put on plastic gloves and mix the hair dye according to the directions. Your box of hair dye will contain instructions for how to prepare the dye. It should also include plastic gloves. Place them on your hands before you begin working with the dye to protect your skin. If your hair dye doesn’t come with gloves, you can buy them at any beauty store, grocery store, or online retailer. Test a small amount of dye on your skin before applying all over to make sure you don’t have an allergic reaction. How to Perform a Skin Patch Test for Hair Dye\n1. Dab a small amount of the dye on your skin with a cotton swab. Any area of skin will work, like the back of your hand or your inner thigh. 2. Let it sit for 48 hours. 3. Check the area. If it’s irritated, burning, or red, don’t use that dye. Stir an equal amount of moisturizing shampoo into the dye. This dilutes the dye so it isn’t as harsh on your pubic area. Pour the same amount of shampoo as there is dye into the dye itself. Mix the 2 together with a spoon until thoroughly combined. The exact amount of hair dye should be listed on the front of the box. Use that measurement for your shampoo. For example, if you have 3 ounces (85 g) of hair color, you’ll add 3 ounces (85 g) of shampoo. Choose shampoo that has hydrating ingredients, like argan oil, vitamin E, or Moroccan oil. Avoid one that has parabens, which will irritate your skin. Brush the dye onto your pubic hair. Use the hair dye applicator brush to gently apply the dye, making sure to completely saturate all of the hair. Avoid rubbing the dye or letting it get into any super sensitive places, like inside your vagina. Most boxed hair dye will come with an applicator brush. If yours doesn’t, buy one from a beauty store or an online retailer. You can also use a small paintbrush with bristles instead the hair dye brush. Let the dye sit for about 30 minutes. This allows the color to fully soak into your pubic hair. Check the directions provided with the hair dye to find the exact processing time for that specific brand and type. Some dyes may be closer to 20 minutes. Wash off the dye immediately if you experience any burning or painful tingling sensations. Set a timer or use the clock app on your phone to keep track of the time. Don’t leave the dye on for longer than the recommended time or you could damage your pubic hair and skin. Rinse off the dye with warm water and a washcloth. Stand under the shower so the water runs over the dye, removing it from your pubic hair. Gently rub the area with a clean washcloth to get rid of any excess dye or petroleum jelly, too. You'll know that all of the dye is gone once the water runs clear. If there’s any dye left on your skin after you dry off, dab the area with a cotton ball dipped in astringent or witch hazel to remove it. Once it dries, if you aren't satisfied with the color, you should wait 4 weeks before re-dyeing it so you don't damage your hair. Dyeing with Kool-Aid Mix 2 packets of Kool-Aid with 2 cups (470 ml) of water in a saucepan. Pour the water in first. Then add the contents of both Kool-Aid packets. Use a spoon to stir them together until thoroughly combined. Choose Kool-Aid that has powder the color that you want your pubic hair to be. For example, cherry Kool-Aid will result in red hair. You can also mix packets for different colors. Kool-Aid Colors for Pubic Hair\nPurple: Blue Raspberry + Cherry\nBright red: Cherry\nGreen: Lemon-Lime + Blue Raspberry\nBrown: Lemonade + Orange + Grape\nPink: Pink Lemonade Boil the liquid for 1 to 2 minutes over medium-high heat. Place the saucepan on the stove and bring the water and Kool-Aid to a boil. Stir it while it boils so the powder doesn’t settle at the bottom. On a stove with 9 heat settings, medium-high heat is 6 or 7. Remove the pan from the heat and pour the liquid into a bowl. Don’t leave the mixture in the hot pan or it will continue to cook, which can affect the strength of the color. Transfer it to a bowl immediately. A cup or basin will work if you don’t have a bowl. If you use a plastic container, the Kool-Aid could stain it. Use a hair applicator brush to apply the mixture to your pubic hair. Dip the brush into the bowl to soak up the liquid. Then brush it over your hair, making sure to coat every strand with color. Avoid putting the Kool-Aid mixture on super sensitive spots of your pubic area. Do this over an old towel if you don’t want to get Kool-Aid stains on the floor. You can buy a hair color applicator brush at a beauty store or from an online retailer. You can also use a paintbrush with soft bristles instead. Let the Kool-Aid mixture sit on your pubic hair for 15-30 minutes. Lighter hair, like blonde or gray, will absorb the color faster. However, darker brown or black hair will take at least the full 30 minutes to change color. To keep track of the time, use your phone’s clock app or set a timer. Rinse the mixture off of your pubic hair with warm water and a washcloth. Run water over your pubic hair to remove the Kool-Aid. Gently scrub the area with a washcloth, too, to get rid of any extra color that may be on your skin. Once the water runs clear, all of the Kool-Aid mixture is gone. If you want a deeper color, repeat the entire process once your pubic hair dries. The color will last for 2 to 4 weeks, depending on how often you shower.",
    "sentences": [
        " Using Hair Dye Choose a hair dye without ammonia or parabens.",
        "Your pubic area is very sensitive and vulnerable to harsh chemicals.",
        "Read the ingredients list on the back of the box of hair dye to make sure it doesn’t contain ammonia or parabens that could irritate your skin.",
        "Look for dye that’s labeled “chemical-free,” “organic,” or “all-natural.”\nYou can use any color dye.",
        "Pick a color that matches your hair or, for a playful look, pick a bright color like pink or blue.",
        "Apply petroleum jelly to the most sensitive areas to protect them.",
        "Petroleum jelly acts like a barrier between your skin and the dye so it doesn’t stain or irritate certain spots.",
        "Rub a thin layer onto your labia, vulva, penis, or scrotum.",
        "Avoid getting petroleum jelly on the hair you want to dye since the jelly blocks the dye.",
        "Put on plastic gloves and mix the hair dye according to the directions.",
        "Your box of hair dye will contain instructions for how to prepare the dye.",
        "It should also include plastic gloves.",
        "Place them on your hands before you begin working with the dye to protect your skin.",
        "If your hair dye doesn’t come with gloves, you can buy them at any beauty store, grocery store, or online retailer.",
        "Test a small amount of dye on your skin before applying all over to make sure you don’t have an allergic reaction.",
        "How to Perform a Skin Patch Test for Hair Dye\n1.",
        "Dab a small amount of the dye on your skin with a cotton swab.",
        "Any area of skin will work, like the back of your hand or your inner thigh.",
        "2.",
        "Let it sit for 48 hours.",
        "3.",
        "Check the area.",
        "If it’s irritated, burning, or red, don’t use that dye.",
        "Stir an equal amount of moisturizing shampoo into the dye.",
        "This dilutes the dye so it isn’t as harsh on your pubic area.",
        "Pour the same amount of shampoo as there is dye into the dye itself.",
        "Mix the 2 together with a spoon until thoroughly combined.",
        "The exact amount of hair dye should be listed on the front of the box.",
        "Use that measurement for your shampoo.",
        "For example, if you have 3 ounces (85 g) of hair color, you’ll add 3 ounces (85 g) of shampoo.",
        "Choose shampoo that has hydrating ingredients, like argan oil, vitamin E, or Moroccan oil.",
        "Avoid one that has parabens, which will irritate your skin.",
        "Brush the dye onto your pubic hair.",
        "Use the hair dye applicator brush to gently apply the dye, making sure to completely saturate all of the hair.",
        "Avoid rubbing the dye or letting it get into any super sensitive places, like inside your vagina.",
        "Most boxed hair dye will come with an applicator brush.",
        "If yours doesn’t, buy one from a beauty store or an online retailer.",
        "You can also use a small paintbrush with bristles instead the hair dye brush.",
        "Let the dye sit for about 30 minutes.",
        "This allows the color to fully soak into your pubic hair.",
        "Check the directions provided with the hair dye to find the exact processing time for that specific brand and type.",
        "Some dyes may be closer to 20 minutes.",
        "Wash off the dye immediately if you experience any burning or painful tingling sensations.",
        "Set a timer or use the clock app on your phone to keep track of the time.",
        "Don’t leave the dye on for longer than the recommended time or you could damage your pubic hair and skin.",
        "Rinse off the dye with warm water and a washcloth.",
        "Stand under the shower so the water runs over the dye, removing it from your pubic hair.",
        "Gently rub the area with a clean washcloth to get rid of any excess dye or petroleum jelly, too.",
        "You'll know that all of the dye is gone once the water runs clear.",
        "If there’s any dye left on your skin after you dry off, dab the area with a cotton ball dipped in astringent or witch hazel to remove it.",
        "Once it dries, if you aren't satisfied with the color, you should wait 4 weeks before re-dyeing it so you don't damage your hair.",
        "Dyeing with Kool-Aid Mix 2 packets of Kool-Aid with 2 cups (470 ml) of water in a saucepan.",
        "Pour the water in first.",
        "Then add the contents of both Kool-Aid packets.",
        "Use a spoon to stir them together until thoroughly combined.",
        "Choose Kool-Aid that has powder the color that you want your pubic hair to be.",
        "For example, cherry Kool-Aid will result in red hair.",
        "You can also mix packets for different colors.",
        "Kool-Aid Colors for Pubic Hair\nPurple: Blue Raspberry + Cherry\nBright red: Cherry\nGreen: Lemon-Lime + Blue Raspberry\nBrown: Lemonade + Orange + Grape\nPink: Pink Lemonade Boil the liquid for 1 to 2 minutes over medium-high heat.",
        "Place the saucepan on the stove and bring the water and Kool-Aid to a boil.",
        "Stir it while it boils so the powder doesn’t settle at the bottom.",
        "On a stove with 9 heat settings, medium-high heat is 6 or 7.",
        "Remove the pan from the heat and pour the liquid into a bowl.",
        "Don’t leave the mixture in the hot pan or it will continue to cook, which can affect the strength of the color.",
        "Transfer it to a bowl immediately.",
        "A cup or basin will work if you don’t have a bowl.",
        "If you use a plastic container, the Kool-Aid could stain it.",
        "Use a hair applicator brush to apply the mixture to your pubic hair.",
        "Dip the brush into the bowl to soak up the liquid.",
        "Then brush it over your hair, making sure to coat every strand with color.",
        "Avoid putting the Kool-Aid mixture on super sensitive spots of your pubic area.",
        "Do this over an old towel if you don’t want to get Kool-Aid stains on the floor.",
        "You can buy a hair color applicator brush at a beauty store or from an online retailer.",
        "You can also use a paintbrush with soft bristles instead.",
        "Let the Kool-Aid mixture sit on your pubic hair for 15-30 minutes.",
        "Lighter hair, like blonde or gray, will absorb the color faster.",
        "However, darker brown or black hair will take at least the full 30 minutes to change color.",
        "To keep track of the time, use your phone’s clock app or set a timer.",
        "Rinse the mixture off of your pubic hair with warm water and a washcloth.",
        "Run water over your pubic hair to remove the Kool-Aid.",
        "Gently scrub the area with a washcloth, too, to get rid of any extra color that may be on your skin.",
        "Once the water runs clear, all of the Kool-Aid mixture is gone.",
        "If you want a deeper color, repeat the entire process once your pubic hair dries.",
        "The color will last for 2 to 4 weeks, depending on how often you shower."
    ]
}