{
    "title": "How to Knit the Purl Stitch",
    "url": "https://www.wikihow.com/Knit-the-Purl-Stitch",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Knitting and Crochet",
        "Knitting",
        "Knitting Techniques",
        "Knitting Stitches"
    ],
    "methods": [
        {
            "name": "Learning the Purl Stitch",
            "steps": [
                {
                    "headline": "Cast on as many stitches as you like.",
                    "description": "Since you're practicing the purl stitch, you can work with as many stitches as you want. To make it easier to see your purl stitches, you might want to knit with larger needles and bulky yarn. Once you're comfortable with making the purl stitch, you can use any size of needles and yarn."
                },
                {
                    "headline": "Bring the working yarn to front.",
                    "description": "Instead of holding the yarn behind the left needle, bring it in front so it's close to you. If you forget and put the yarn behind, the stitch on your left needle will look like 2 stitches instead of 1. Don't worry about making mistakes as you work on this practice swatch. Pay attention to the mistakes you make, so you know how to prevent them in the future."
                },
                {
                    "headline": "Insert the working needle into the front of the first stitch on the left needle.",
                    "description": "Slide the tip of the working into the front loop of the first stitch. Your needles should now look like a large X with the working needle in front.Variation: If you're left-handed, you could hold the working yarn in your left hand. This continental style of knitting is thought to be faster since it minimizes your hand movements. Keep in mind that when you're making a knit stitch, you want to insert the needle into the back of the stitch."
                },
                {
                    "headline": "Wrap the yarn counterclockwise around the needle.",
                    "description": "Use your thumb and index finger to hold the needles in place while you hold the working yarn taut with your other hand. Wrap the yarn counterclockwise around the needle that's closest to you. The yarn will still be in the front once you've wrapped it around the needle. Ensure that you're only wrapping the yarn around the working needle and not both of the needles."
                },
                {
                    "headline": "Pull the loop down and off of the needle to complete the purl stitch.",
                    "description": "Keep your left index finger on the first stitch so the yarn doesn't slide off of your needle. Then, slowly bring the working needle down so the tip is at the base of the stitch. Move the tip of the needle to the back of the stitch and keep moving up so the stitch slides onto the working needle. The working yarn should still be at the front of the needle. The purl stitch on your right needle will look like a knit stitch that has a small bump at its base."
                },
                {
                    "headline": "Tug on the yarn before starting your next purl stitch.",
                    "description": "To keep your stitches tight, pull on the working yarn so the purl stitch on your right needle is secure. Then, keep the working yarn in front and insert the right needle into the front of your next stitch on the left needle. Remember to wrap the yarn counterclockwise around the needle before pulling off the purl stitch. Follow your pattern or just practice making a few rows of purl stitches so you become comfortable."
                }
            ]
        },
        {
            "name": "Trying Basic Patterns",
            "steps": [
                {
                    "headline": "Practice alternating between knit and purl stitches.",
                    "description": "Before you start a pattern that uses both of these basic stitches, you need to know how to move the working yarn. When you're purling, the yarn is held in front. If you'd like to knit a stitch, you'll need to move the working yarn to the back before you knit. To make another purl stitch, bring the yarn in front. Remember that the working yarn is close to you for a purl stitch and away from you for a knit stitch."
                },
                {
                    "headline": "Make a simple rib stitch for scarves or blankets.",
                    "description": "To make a stretchy ribbed pattern on your fabric, cast on a multiple of 2. Then, knit 1 stitch and purl 1 stitch. Repeat this across the entire row and do it for each row. This will make a reversible pattern that has ribs on both sides of the fabric. For a double rib, knit 2 and purl 2 for every row. This will create a slightly wider rib. If you're reading a pattern for a 1x1 rib stitch, it will look like this:\nRow 1: *k1, p1* (repeat)"
                },
                {
                    "headline": "Create a stockinette stitch by alternating knit and purl rows.",
                    "description": "The stockinette stitch is one of the easiest patterns to make once you've learned the purl stitch. Cast on as many stitches as you like and knit every stitch on your first row. Turn the work and purl every stitch of the following row. Keep alternating the rows so your fabric has a bumpy side and a smooth side.Tip: Keep in mind that stockinette tends to curl along the edges, so you may want to block the fabric or add a border so your fabric lies flat. The smooth side will show the knit stitches while the bumpy side shows the purled stitches. The stockinette stitch is referred to as \"St st\" in most patterns."
                },
                {
                    "headline": "Make the seed stitch by alternating knit and purl stitches.",
                    "description": "If you'd like to try a pattern that's slightly more challenging and has great texture, work on a seed stitch. Cast on an even number of stitches. Then, knit the first stitch and purl the following stitch. Continue to knit 1 and purl 1 all across the row. Turn your work and knit 1, purl 1, across the entire row. Keep working until you've made as many rows as you like. If you're using a British knitting pattern, the seed stitch is the same as the moss stitch."
                }
            ]
        }
    ],
    "tyn": [
        "Knitting needles",
        "Yarn",
        "Scissors"
    ],
    "text": " Learning the Purl Stitch Cast on as many stitches as you like. Since you're practicing the purl stitch, you can work with as many stitches as you want. To make it easier to see your purl stitches, you might want to knit with larger needles and bulky yarn. Once you're comfortable with making the purl stitch, you can use any size of needles and yarn. Bring the working yarn to front. Instead of holding the yarn behind the left needle, bring it in front so it's close to you. If you forget and put the yarn behind, the stitch on your left needle will look like 2 stitches instead of 1. Don't worry about making mistakes as you work on this practice swatch. Pay attention to the mistakes you make, so you know how to prevent them in the future. Insert the working needle into the front of the first stitch on the left needle. Slide the tip of the working into the front loop of the first stitch. Your needles should now look like a large X with the working needle in front.Variation: If you're left-handed, you could hold the working yarn in your left hand. This continental style of knitting is thought to be faster since it minimizes your hand movements. Keep in mind that when you're making a knit stitch, you want to insert the needle into the back of the stitch. Wrap the yarn counterclockwise around the needle. Use your thumb and index finger to hold the needles in place while you hold the working yarn taut with your other hand. Wrap the yarn counterclockwise around the needle that's closest to you. The yarn will still be in the front once you've wrapped it around the needle. Ensure that you're only wrapping the yarn around the working needle and not both of the needles. Pull the loop down and off of the needle to complete the purl stitch. Keep your left index finger on the first stitch so the yarn doesn't slide off of your needle. Then, slowly bring the working needle down so the tip is at the base of the stitch. Move the tip of the needle to the back of the stitch and keep moving up so the stitch slides onto the working needle. The working yarn should still be at the front of the needle. The purl stitch on your right needle will look like a knit stitch that has a small bump at its base. Tug on the yarn before starting your next purl stitch. To keep your stitches tight, pull on the working yarn so the purl stitch on your right needle is secure. Then, keep the working yarn in front and insert the right needle into the front of your next stitch on the left needle. Remember to wrap the yarn counterclockwise around the needle before pulling off the purl stitch. Follow your pattern or just practice making a few rows of purl stitches so you become comfortable. Trying Basic Patterns Practice alternating between knit and purl stitches. Before you start a pattern that uses both of these basic stitches, you need to know how to move the working yarn. When you're purling, the yarn is held in front. If you'd like to knit a stitch, you'll need to move the working yarn to the back before you knit. To make another purl stitch, bring the yarn in front. Remember that the working yarn is close to you for a purl stitch and away from you for a knit stitch. Make a simple rib stitch for scarves or blankets. To make a stretchy ribbed pattern on your fabric, cast on a multiple of 2. Then, knit 1 stitch and purl 1 stitch. Repeat this across the entire row and do it for each row. This will make a reversible pattern that has ribs on both sides of the fabric. For a double rib, knit 2 and purl 2 for every row. This will create a slightly wider rib. If you're reading a pattern for a 1x1 rib stitch, it will look like this:\nRow 1: *k1, p1* (repeat) Create a stockinette stitch by alternating knit and purl rows. The stockinette stitch is one of the easiest patterns to make once you've learned the purl stitch. Cast on as many stitches as you like and knit every stitch on your first row. Turn the work and purl every stitch of the following row. Keep alternating the rows so your fabric has a bumpy side and a smooth side.Tip: Keep in mind that stockinette tends to curl along the edges, so you may want to block the fabric or add a border so your fabric lies flat. The smooth side will show the knit stitches while the bumpy side shows the purled stitches. The stockinette stitch is referred to as \"St st\" in most patterns. Make the seed stitch by alternating knit and purl stitches. If you'd like to try a pattern that's slightly more challenging and has great texture, work on a seed stitch. Cast on an even number of stitches. Then, knit the first stitch and purl the following stitch. Continue to knit 1 and purl 1 all across the row. Turn your work and knit 1, purl 1, across the entire row. Keep working until you've made as many rows as you like. If you're using a British knitting pattern, the seed stitch is the same as the moss stitch.",
    "sentences": [
        " Learning the Purl Stitch Cast on as many stitches as you like.",
        "Since you're practicing the purl stitch, you can work with as many stitches as you want.",
        "To make it easier to see your purl stitches, you might want to knit with larger needles and bulky yarn.",
        "Once you're comfortable with making the purl stitch, you can use any size of needles and yarn.",
        "Bring the working yarn to front.",
        "Instead of holding the yarn behind the left needle, bring it in front so it's close to you.",
        "If you forget and put the yarn behind, the stitch on your left needle will look like 2 stitches instead of 1.",
        "Don't worry about making mistakes as you work on this practice swatch.",
        "Pay attention to the mistakes you make, so you know how to prevent them in the future.",
        "Insert the working needle into the front of the first stitch on the left needle.",
        "Slide the tip of the working into the front loop of the first stitch.",
        "Your needles should now look like a large X with the working needle in front.Variation: If you're left-handed, you could hold the working yarn in your left hand.",
        "This continental style of knitting is thought to be faster since it minimizes your hand movements.",
        "Keep in mind that when you're making a knit stitch, you want to insert the needle into the back of the stitch.",
        "Wrap the yarn counterclockwise around the needle.",
        "Use your thumb and index finger to hold the needles in place while you hold the working yarn taut with your other hand.",
        "Wrap the yarn counterclockwise around the needle that's closest to you.",
        "The yarn will still be in the front once you've wrapped it around the needle.",
        "Ensure that you're only wrapping the yarn around the working needle and not both of the needles.",
        "Pull the loop down and off of the needle to complete the purl stitch.",
        "Keep your left index finger on the first stitch so the yarn doesn't slide off of your needle.",
        "Then, slowly bring the working needle down so the tip is at the base of the stitch.",
        "Move the tip of the needle to the back of the stitch and keep moving up so the stitch slides onto the working needle.",
        "The working yarn should still be at the front of the needle.",
        "The purl stitch on your right needle will look like a knit stitch that has a small bump at its base.",
        "Tug on the yarn before starting your next purl stitch.",
        "To keep your stitches tight, pull on the working yarn so the purl stitch on your right needle is secure.",
        "Then, keep the working yarn in front and insert the right needle into the front of your next stitch on the left needle.",
        "Remember to wrap the yarn counterclockwise around the needle before pulling off the purl stitch.",
        "Follow your pattern or just practice making a few rows of purl stitches so you become comfortable.",
        "Trying Basic Patterns Practice alternating between knit and purl stitches.",
        "Before you start a pattern that uses both of these basic stitches, you need to know how to move the working yarn.",
        "When you're purling, the yarn is held in front.",
        "If you'd like to knit a stitch, you'll need to move the working yarn to the back before you knit.",
        "To make another purl stitch, bring the yarn in front.",
        "Remember that the working yarn is close to you for a purl stitch and away from you for a knit stitch.",
        "Make a simple rib stitch for scarves or blankets.",
        "To make a stretchy ribbed pattern on your fabric, cast on a multiple of 2.",
        "Then, knit 1 stitch and purl 1 stitch.",
        "Repeat this across the entire row and do it for each row.",
        "This will make a reversible pattern that has ribs on both sides of the fabric.",
        "For a double rib, knit 2 and purl 2 for every row.",
        "This will create a slightly wider rib.",
        "If you're reading a pattern for a 1x1 rib stitch, it will look like this:\nRow 1: *k1, p1* (repeat) Create a stockinette stitch by alternating knit and purl rows.",
        "The stockinette stitch is one of the easiest patterns to make once you've learned the purl stitch.",
        "Cast on as many stitches as you like and knit every stitch on your first row.",
        "Turn the work and purl every stitch of the following row.",
        "Keep alternating the rows so your fabric has a bumpy side and a smooth side.Tip: Keep in mind that stockinette tends to curl along the edges, so you may want to block the fabric or add a border so your fabric lies flat.",
        "The smooth side will show the knit stitches while the bumpy side shows the purled stitches.",
        "The stockinette stitch is referred to as \"St st\" in most patterns.",
        "Make the seed stitch by alternating knit and purl stitches.",
        "If you'd like to try a pattern that's slightly more challenging and has great texture, work on a seed stitch.",
        "Cast on an even number of stitches.",
        "Then, knit the first stitch and purl the following stitch.",
        "Continue to knit 1 and purl 1 all across the row.",
        "Turn your work and knit 1, purl 1, across the entire row.",
        "Keep working until you've made as many rows as you like.",
        "If you're using a British knitting pattern, the seed stitch is the same as the moss stitch."
    ]
}