{
    "title": "How to Maintain a Hydroponic Nutrient Reservoir",
    "url": "https://www.wikihow.com/Maintain-a-Hydroponic-Nutrient-Reservoir",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Hydroponics"
    ],
    "steps": [
        {
            "headline": "These notes are for a wide range of vegetables used for human consumption.",
            "description": ""
        },
        {
            "headline": "A wide range of vegetable types need a wide range of nutrient and pH levels.",
            "description": "Guides are available from the internet and some nutrient suppliers."
        },
        {
            "headline": "Check the water quality with your TDS/PPM EC meter from a sample before putting it in your reservoir.",
            "description": "Tap water measuring 300 ppm or greater indicates that you may need to run either a reverse osmosis system or distill your water. You want to be sure of the total PPM of the water you are putting to your plants before adding nutrients, is between 0-50ppm, anything over 100 is acceptable just be wary of some of the micro nutrients that might be in your test water. See the \"Tips\" section for ideas on tap water usage."
        },
        {
            "headline": "Use a digital probe to measure the strength and pH of the nutrient solution every day and do this close to the same time every day.",
            "description": "Make notes in a diary to keep track of events and changes."
        },
        {
            "headline": "With nutrients in your reservoir, you can't get a proper reading with paper strips or test tube drop kits.",
            "description": "For more accurate readings of your test equipment, test after the nutrient has been run through your system at least once (twice is good)."
        },
        {
            "headline": "Adjust the pH of your nutrient solution using propriety solutions such as pH Up or pH Down accordingly.",
            "description": "Note: An adjustment in your solution's pH will affect its strength. The most affective is a pH of 5.5-6.2 never go higher than 6.5 or lower than 5.5 no matter what vegetables you are growing."
        },
        {
            "headline": "Use a TDS/PPM or EC meter to check the strength of your nutrient solution.",
            "description": "If it is too strong, add water. If it is too weak, add a little fertilizer. [See Warnings] Make sure you re-test the pH after making changes."
        },
        {
            "headline": "Change/top-up the solution in your reservoir when the TDS/PPM meter shows it to be at or below that which the plants require.",
            "description": ""
        },
        {
            "headline": "A proper top-up nutrient should not be used more than 3 to 4 times between full nutrient changes.",
            "description": "Do not use full nutrient for top-ups."
        },
        {
            "headline": "It is good practice to have a nutrient reservoir as large or larger than the empty volume of the tub(s)/container(s).",
            "description": "For example if a 20L tub is used then at least 20L of nutrient should be used, preferably more, twice as much is a good minimum. The volume of the growing medium not with standing in the volume calculations. The largest size nutrient reservoir (within reason) that can be implemented is better."
        },
        {
            "headline": "Know that nutrient life is dependent on is volume and the requirements of the plants as well as the plant's transpiration rate, all of which vary greatly.",
            "description": "However, ideally you should nutrient the water everyday, when you are starting out."
        },
        {
            "headline": "When the nutrient is considered past its useful life it can poured on dirt grown plants.",
            "description": ""
        },
        {
            "headline": "Hydroponic gardens grow better outside, but local weather conditions may affect it and should be taken into account.",
            "description": "When growing outside all forms of falling water should be prevented from falling on the garden and so diluting the nutrient solution."
        },
        {
            "headline": "When growing inside provision of suitable lighting may be required.",
            "description": ""
        }
    ],
    "tyn": [
        "pH testing meter",
        "PPM/TDS/EC meter",
        "Possibly an aquarium air pump and air stone to suit reservoir size",
        "Hydroponic plant nutrients",
        "Water",
        "pH Up and pH Down (Commercial products from a hydroponic supplier)"
    ],
    "text": " These notes are for a wide range of vegetables used for human consumption.  A wide range of vegetable types need a wide range of nutrient and pH levels. Guides are available from the internet and some nutrient suppliers. Check the water quality with your TDS/PPM EC meter from a sample before putting it in your reservoir. Tap water measuring 300 ppm or greater indicates that you may need to run either a reverse osmosis system or distill your water. You want to be sure of the total PPM of the water you are putting to your plants before adding nutrients, is between 0-50ppm, anything over 100 is acceptable just be wary of some of the micro nutrients that might be in your test water. See the \"Tips\" section for ideas on tap water usage. Use a digital probe to measure the strength and pH of the nutrient solution every day and do this close to the same time every day. Make notes in a diary to keep track of events and changes. With nutrients in your reservoir, you can't get a proper reading with paper strips or test tube drop kits. For more accurate readings of your test equipment, test after the nutrient has been run through your system at least once (twice is good). Adjust the pH of your nutrient solution using propriety solutions such as pH Up or pH Down accordingly. Note: An adjustment in your solution's pH will affect its strength. The most affective is a pH of 5.5-6.2 never go higher than 6.5 or lower than 5.5 no matter what vegetables you are growing. Use a TDS/PPM or EC meter to check the strength of your nutrient solution. If it is too strong, add water. If it is too weak, add a little fertilizer. [See Warnings] Make sure you re-test the pH after making changes. Change/top-up the solution in your reservoir when the TDS/PPM meter shows it to be at or below that which the plants require.  A proper top-up nutrient should not be used more than 3 to 4 times between full nutrient changes. Do not use full nutrient for top-ups. It is good practice to have a nutrient reservoir as large or larger than the empty volume of the tub(s)/container(s). For example if a 20L tub is used then at least 20L of nutrient should be used, preferably more, twice as much is a good minimum. The volume of the growing medium not with standing in the volume calculations. The largest size nutrient reservoir (within reason) that can be implemented is better. Know that nutrient life is dependent on is volume and the requirements of the plants as well as the plant's transpiration rate, all of which vary greatly. However, ideally you should nutrient the water everyday, when you are starting out. When the nutrient is considered past its useful life it can poured on dirt grown plants.  Hydroponic gardens grow better outside, but local weather conditions may affect it and should be taken into account. When growing outside all forms of falling water should be prevented from falling on the garden and so diluting the nutrient solution. When growing inside provision of suitable lighting may be required. ",
    "sentences": [
        " These notes are for a wide range of vegetables used for human consumption.",
        "A wide range of vegetable types need a wide range of nutrient and pH levels.",
        "Guides are available from the internet and some nutrient suppliers.",
        "Check the water quality with your TDS/PPM EC meter from a sample before putting it in your reservoir.",
        "Tap water measuring 300 ppm or greater indicates that you may need to run either a reverse osmosis system or distill your water.",
        "You want to be sure of the total PPM of the water you are putting to your plants before adding nutrients, is between 0-50ppm, anything over 100 is acceptable just be wary of some of the micro nutrients that might be in your test water.",
        "See the \"Tips\" section for ideas on tap water usage.",
        "Use a digital probe to measure the strength and pH of the nutrient solution every day and do this close to the same time every day.",
        "Make notes in a diary to keep track of events and changes.",
        "With nutrients in your reservoir, you can't get a proper reading with paper strips or test tube drop kits.",
        "For more accurate readings of your test equipment, test after the nutrient has been run through your system at least once (twice is good).",
        "Adjust the pH of your nutrient solution using propriety solutions such as pH Up or pH Down accordingly.",
        "Note: An adjustment in your solution's pH will affect its strength.",
        "The most affective is a pH of 5.5-6.2 never go higher than 6.5 or lower than 5.5 no matter what vegetables you are growing.",
        "Use a TDS/PPM or EC meter to check the strength of your nutrient solution.",
        "If it is too strong, add water.",
        "If it is too weak, add a little fertilizer.",
        "[See Warnings] Make sure you re-test the pH after making changes.",
        "Change/top-up the solution in your reservoir when the TDS/PPM meter shows it to be at or below that which the plants require.",
        "A proper top-up nutrient should not be used more than 3 to 4 times between full nutrient changes.",
        "Do not use full nutrient for top-ups.",
        "It is good practice to have a nutrient reservoir as large or larger than the empty volume of the tub(s)/container(s).",
        "For example if a 20L tub is used then at least 20L of nutrient should be used, preferably more, twice as much is a good minimum.",
        "The volume of the growing medium not with standing in the volume calculations.",
        "The largest size nutrient reservoir (within reason) that can be implemented is better.",
        "Know that nutrient life is dependent on is volume and the requirements of the plants as well as the plant's transpiration rate, all of which vary greatly.",
        "However, ideally you should nutrient the water everyday, when you are starting out.",
        "When the nutrient is considered past its useful life it can poured on dirt grown plants.",
        "Hydroponic gardens grow better outside, but local weather conditions may affect it and should be taken into account.",
        "When growing outside all forms of falling water should be prevented from falling on the garden and so diluting the nutrient solution.",
        "When growing inside provision of suitable lighting may be required."
    ]
}