{
    "title": "How to Make a Quick Comic Book",
    "url": "https://www.wikihow.com/Make-a-Quick-Comic-Book",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Movies",
        "Filmmaking",
        "Animation",
        "Cartoons"
    ],
    "steps": [
        {
            "headline": "Take 3 to 4 pieces of 8.5X11 sheets of paper.",
            "description": ""
        },
        {
            "headline": "Stack them up and fold them Hamburger Style.",
            "description": ""
        },
        {
            "headline": "When folded, use a stapler and make 3 staples along the edge of the closed end of the sheets of paper.",
            "description": ""
        },
        {
            "headline": "Make a cover design.",
            "description": "Use color, and make the cover your own."
        },
        {
            "headline": "Use a ruler to draw boxes for your panels.",
            "description": "You can also make a template on a computer, or find one online and print it out. It can also be interesting, however, to draw your boxes freehand. This will give you a different effect."
        },
        {
            "headline": "Have your script or story ready.",
            "description": "This will most probably be a one shot or single chapter, regarding this being a \"Quick Comic Book\" Make sure your script or story is properly edited, refined and rewritten if need be."
        },
        {
            "headline": "Draw out your story-- Without speech bubbles.",
            "description": "Your draft should be rough, and on scratch paper if possible. You won't even be drawing hands and feet. Just a framework of the character, lines and circles. Rough in the speech bubbles, but without the speech written in."
        },
        {
            "headline": "Now, start using the nice paper, with the rough poses and layout as a guide.",
            "description": "If you are keeping the whole thing traditional and on paper, draw all of it, with the speech bubbles after, still in pencil and ink all of it in with a permanent media. If you're uploading it online or scanning it, create all the art, without any inkling of speech bubbles and ink it in. Scan it and add the speech bubbles on your photo editing program like GIMP or Photoshop"
        },
        {
            "headline": "This is the time to color or shade.",
            "description": "Remember that every comic style has its own coloring style. Color according to that."
        },
        {
            "headline": "Make it public!",
            "description": "Show your family and friends, upload it on your blog or DeviantArt. It's yours, now show off your story telling and artistic abilities!"
        }
    ],
    "tyn": [
        "Pencil",
        "Paper",
        "Eraser",
        "Stapler",
        "Ruler",
        "Permanent media eg India Ink, Markers etc."
    ],
    "text": " Take 3 to 4 pieces of 8.5X11 sheets of paper.  Stack them up and fold them Hamburger Style.  When folded, use a stapler and make 3 staples along the edge of the closed end of the sheets of paper.  Make a cover design. Use color, and make the cover your own. Use a ruler to draw boxes for your panels. You can also make a template on a computer, or find one online and print it out. It can also be interesting, however, to draw your boxes freehand. This will give you a different effect. Have your script or story ready. This will most probably be a one shot or single chapter, regarding this being a \"Quick Comic Book\" Make sure your script or story is properly edited, refined and rewritten if need be. Draw out your story-- Without speech bubbles. Your draft should be rough, and on scratch paper if possible. You won't even be drawing hands and feet. Just a framework of the character, lines and circles. Rough in the speech bubbles, but without the speech written in. Now, start using the nice paper, with the rough poses and layout as a guide. If you are keeping the whole thing traditional and on paper, draw all of it, with the speech bubbles after, still in pencil and ink all of it in with a permanent media. If you're uploading it online or scanning it, create all the art, without any inkling of speech bubbles and ink it in. Scan it and add the speech bubbles on your photo editing program like GIMP or Photoshop This is the time to color or shade. Remember that every comic style has its own coloring style. Color according to that. Make it public! Show your family and friends, upload it on your blog or DeviantArt. It's yours, now show off your story telling and artistic abilities!",
    "sentences": [
        " Take 3 to 4 pieces of 8.5X11 sheets of paper.",
        "Stack them up and fold them Hamburger Style.",
        "When folded, use a stapler and make 3 staples along the edge of the closed end of the sheets of paper.",
        "Make a cover design.",
        "Use color, and make the cover your own.",
        "Use a ruler to draw boxes for your panels.",
        "You can also make a template on a computer, or find one online and print it out.",
        "It can also be interesting, however, to draw your boxes freehand.",
        "This will give you a different effect.",
        "Have your script or story ready.",
        "This will most probably be a one shot or single chapter, regarding this being a \"Quick Comic Book\" Make sure your script or story is properly edited, refined and rewritten if need be.",
        "Draw out your story-- Without speech bubbles.",
        "Your draft should be rough, and on scratch paper if possible.",
        "You won't even be drawing hands and feet.",
        "Just a framework of the character, lines and circles.",
        "Rough in the speech bubbles, but without the speech written in.",
        "Now, start using the nice paper, with the rough poses and layout as a guide.",
        "If you are keeping the whole thing traditional and on paper, draw all of it, with the speech bubbles after, still in pencil and ink all of it in with a permanent media.",
        "If you're uploading it online or scanning it, create all the art, without any inkling of speech bubbles and ink it in.",
        "Scan it and add the speech bubbles on your photo editing program like GIMP or Photoshop This is the time to color or shade.",
        "Remember that every comic style has its own coloring style.",
        "Color according to that.",
        "Make it public!",
        "Show your family and friends, upload it on your blog or DeviantArt.",
        "It's yours, now show off your story telling and artistic abilities!"
    ]
}