{
    "title": "How to Inculcate Human Values",
    "url": "https://www.wikihow.com/Inculcate-Human-Values",
    "category_hierarchy": [
        "Philosophy and Religion",
        "Philosophy"
    ],
    "steps": [
        {
            "headline": "Submit yourself to a guru:     Your guru should be a person, whom you trust completely, & in whom you can confide confidently.",
            "description": "The trust between the teacher and taught should be strictly mutual and of highest order."
        },
        {
            "headline": "Practice yoga first thing in the morning:    After completing morning chores, it is essential to start with yoga.",
            "description": "Perform some easy asana as per your endurance power and availability of time preferably in an open space (rooftop, lawns, or a large room with lot of ventilation). These help in the circulation of blood and fresh air to the various cells, tissues, organs and systems of the human body. A healthy body is a good generator of healthy thoughts and inculcation of values becomes that much easier. For more details on yoga please refer to the wikiHow article How to Benefit from Power Yoga"
        },
        {
            "headline": "Keep your life simple and honest.",
            "description": "Honesty is not a policy or business transaction. It is the most natural and profitable way of leading life. And it is not as difficult as it is made out to be. Start with an understanding that Honesty is a value and not an attribute. Each value has a denominator. Fix your denominator for this value. Start with the conviction that no one is either 100% or 0% honest. Grid yourself: somewhere in between the extremes. Start being less dishonest every day and slowly graduate to being more honest every day. If you feel that you are more honest today than you were yesterday move yourself up the grid a little. Be very conservative and mean while grading yourself. Let your physical being work hard and deliver definitive measurable results to convince your inner being. Don’t be charitable to yourself, but celebrate small success. This will encourage and motivate you to raise the bar daily and perhaps even many times in a day. Keep comparing the percentage daily/weekly growth and set new goals."
        },
        {
            "headline": "Be compassionate.",
            "description": "Not every human being is as empowered or as privileged as you may be, people with lesser attributes or lesser privileges are not lesser human beings. They may be children of lesser gods or victims of circumstances. Show compassion, treat them as your equals, and try in your own way to elevate them physically, mentally and spiritually."
        },
        {
            "headline": "Treat Integrity as the most essential part of your life:   Integrity comes out of ownership.",
            "description": "Take ownership of your responsibilities both at home and the work place. Loss of integrity means loss of character. And loss of character means loss of your life mentally and spiritually. There is no use being only physical alive."
        },
        {
            "headline": "Criticize and reprimand the act not the actor.",
            "description": "Forgiveness is not only a virtue, but also an act that creates remorse & makes a better person of the person forgiven. It also wins you a friend."
        },
        {
            "headline": "Love thy neighbor and everyone else’s too if possible:   Spread love large heartedly.",
            "description": "Spare no one human beings, animals, nature and innate things. Reciprocation will start sooner or later from all living things and ultimately you will end up winning hearts."
        },
        {
            "headline": "Upgrade your knowledge continuously.",
            "description": "The most knowledgeable also seeks knowledge to become more knowledgeable. Pursuit of knowledge should be a continuous process. Knowledge can not only be acquired from books, teacher, institutions, but also from things around us including nature."
        },
        {
            "headline": "Be disciplined in your thoughts and actions.",
            "description": "Having time sense is just one part of the discipline. Discipline encompasses every aspect of your day to day life. Your actions, your attire, your speech, you silence, your movements, your treatment of others and yourself. Don’t be undisciplined even to yourself."
        },
        {
            "headline": "Treat your parents better than you would treat yourself.",
            "description": "People think that they are treating their parents properly but in most cases this is an illusion. Please do this small exercise. Draw a table with three columns. First column write Serial no. 123… next column against each number write one thing your parents have done for you and in the next write a value for this between 1& 10. Like this right from your childhood try to  recollect and write each and everything your parents have done for you and put a value for each item. When you finish, total the values you have put."
        },
        {
            "headline": "Similarly do the same the exercise for what you have done for your parents, and total up the values.",
            "description": "Now compare the values, you will find that sum of what you have received far exceeds the sum of what you have done for them. You will find that, what you have done for them, and may possibly do for them in future, will at most account for the interest for the debt you have incurred. You can never repay the debt, at least pay the interest properly. If for some reason, you don’t have the affection for your parents, even then, you need to look after them well to at least put the math in order."
        }
    ],
    "tyn": [
        "A very strong resolve to succeed",
        "An idol or a role model as a guru",
        "An action plan",
        "Reliable metrics to monitor the progress you have achieved",
        "Support of the parents, neighbors, friends, & others"
    ],
    "text": " Submit yourself to a guru:     Your guru should be a person, whom you trust completely, & in whom you can confide confidently. The trust between the teacher and taught should be strictly mutual and of highest order. Practice yoga first thing in the morning:    After completing morning chores, it is essential to start with yoga. Perform some easy asana as per your endurance power and availability of time preferably in an open space (rooftop, lawns, or a large room with lot of ventilation). These help in the circulation of blood and fresh air to the various cells, tissues, organs and systems of the human body. A healthy body is a good generator of healthy thoughts and inculcation of values becomes that much easier. For more details on yoga please refer to the wikiHow article How to Benefit from Power Yoga Keep your life simple and honest. Honesty is not a policy or business transaction. It is the most natural and profitable way of leading life. And it is not as difficult as it is made out to be. Start with an understanding that Honesty is a value and not an attribute. Each value has a denominator. Fix your denominator for this value. Start with the conviction that no one is either 100% or 0% honest. Grid yourself: somewhere in between the extremes. Start being less dishonest every day and slowly graduate to being more honest every day. If you feel that you are more honest today than you were yesterday move yourself up the grid a little. Be very conservative and mean while grading yourself. Let your physical being work hard and deliver definitive measurable results to convince your inner being. Don’t be charitable to yourself, but celebrate small success. This will encourage and motivate you to raise the bar daily and perhaps even many times in a day. Keep comparing the percentage daily/weekly growth and set new goals. Be compassionate. Not every human being is as empowered or as privileged as you may be, people with lesser attributes or lesser privileges are not lesser human beings. They may be children of lesser gods or victims of circumstances. Show compassion, treat them as your equals, and try in your own way to elevate them physically, mentally and spiritually. Treat Integrity as the most essential part of your life:   Integrity comes out of ownership. Take ownership of your responsibilities both at home and the work place. Loss of integrity means loss of character. And loss of character means loss of your life mentally and spiritually. There is no use being only physical alive. Criticize and reprimand the act not the actor. Forgiveness is not only a virtue, but also an act that creates remorse & makes a better person of the person forgiven. It also wins you a friend. Love thy neighbor and everyone else’s too if possible:   Spread love large heartedly. Spare no one human beings, animals, nature and innate things. Reciprocation will start sooner or later from all living things and ultimately you will end up winning hearts. Upgrade your knowledge continuously. The most knowledgeable also seeks knowledge to become more knowledgeable. Pursuit of knowledge should be a continuous process. Knowledge can not only be acquired from books, teacher, institutions, but also from things around us including nature. Be disciplined in your thoughts and actions. Having time sense is just one part of the discipline. Discipline encompasses every aspect of your day to day life. Your actions, your attire, your speech, you silence, your movements, your treatment of others and yourself. Don’t be undisciplined even to yourself. Treat your parents better than you would treat yourself. People think that they are treating their parents properly but in most cases this is an illusion. Please do this small exercise. Draw a table with three columns. First column write Serial no. 123… next column against each number write one thing your parents have done for you and in the next write a value for this between 1& 10. Like this right from your childhood try to  recollect and write each and everything your parents have done for you and put a value for each item. When you finish, total the values you have put. Similarly do the same the exercise for what you have done for your parents, and total up the values. Now compare the values, you will find that sum of what you have received far exceeds the sum of what you have done for them. You will find that, what you have done for them, and may possibly do for them in future, will at most account for the interest for the debt you have incurred. You can never repay the debt, at least pay the interest properly. If for some reason, you don’t have the affection for your parents, even then, you need to look after them well to at least put the math in order.",
    "sentences": [
        " Submit yourself to a guru:     Your guru should be a person, whom you trust completely, & in whom you can confide confidently.",
        "The trust between the teacher and taught should be strictly mutual and of highest order.",
        "Practice yoga first thing in the morning:    After completing morning chores, it is essential to start with yoga.",
        "Perform some easy asana as per your endurance power and availability of time preferably in an open space (rooftop, lawns, or a large room with lot of ventilation).",
        "These help in the circulation of blood and fresh air to the various cells, tissues, organs and systems of the human body.",
        "A healthy body is a good generator of healthy thoughts and inculcation of values becomes that much easier.",
        "For more details on yoga please refer to the wikiHow article How to Benefit from Power Yoga Keep your life simple and honest.",
        "Honesty is not a policy or business transaction.",
        "It is the most natural and profitable way of leading life.",
        "And it is not as difficult as it is made out to be.",
        "Start with an understanding that Honesty is a value and not an attribute.",
        "Each value has a denominator.",
        "Fix your denominator for this value.",
        "Start with the conviction that no one is either 100% or 0% honest.",
        "Grid yourself: somewhere in between the extremes.",
        "Start being less dishonest every day and slowly graduate to being more honest every day.",
        "If you feel that you are more honest today than you were yesterday move yourself up the grid a little.",
        "Be very conservative and mean while grading yourself.",
        "Let your physical being work hard and deliver definitive measurable results to convince your inner being.",
        "Don’t be charitable to yourself, but celebrate small success.",
        "This will encourage and motivate you to raise the bar daily and perhaps even many times in a day.",
        "Keep comparing the percentage daily/weekly growth and set new goals.",
        "Be compassionate.",
        "Not every human being is as empowered or as privileged as you may be, people with lesser attributes or lesser privileges are not lesser human beings.",
        "They may be children of lesser gods or victims of circumstances.",
        "Show compassion, treat them as your equals, and try in your own way to elevate them physically, mentally and spiritually.",
        "Treat Integrity as the most essential part of your life:   Integrity comes out of ownership.",
        "Take ownership of your responsibilities both at home and the work place.",
        "Loss of integrity means loss of character.",
        "And loss of character means loss of your life mentally and spiritually.",
        "There is no use being only physical alive.",
        "Criticize and reprimand the act not the actor.",
        "Forgiveness is not only a virtue, but also an act that creates remorse & makes a better person of the person forgiven.",
        "It also wins you a friend.",
        "Love thy neighbor and everyone else’s too if possible:   Spread love large heartedly.",
        "Spare no one human beings, animals, nature and innate things.",
        "Reciprocation will start sooner or later from all living things and ultimately you will end up winning hearts.",
        "Upgrade your knowledge continuously.",
        "The most knowledgeable also seeks knowledge to become more knowledgeable.",
        "Pursuit of knowledge should be a continuous process.",
        "Knowledge can not only be acquired from books, teacher, institutions, but also from things around us including nature.",
        "Be disciplined in your thoughts and actions.",
        "Having time sense is just one part of the discipline.",
        "Discipline encompasses every aspect of your day to day life.",
        "Your actions, your attire, your speech, you silence, your movements, your treatment of others and yourself.",
        "Don’t be undisciplined even to yourself.",
        "Treat your parents better than you would treat yourself.",
        "People think that they are treating their parents properly but in most cases this is an illusion.",
        "Please do this small exercise.",
        "Draw a table with three columns.",
        "First column write Serial no.",
        "123… next column against each number write one thing your parents have done for you and in the next write a value for this between 1& 10.",
        "Like this right from your childhood try to  recollect and write each and everything your parents have done for you and put a value for each item.",
        "When you finish, total the values you have put.",
        "Similarly do the same the exercise for what you have done for your parents, and total up the values.",
        "Now compare the values, you will find that sum of what you have received far exceeds the sum of what you have done for them.",
        "You will find that, what you have done for them, and may possibly do for them in future, will at most account for the interest for the debt you have incurred.",
        "You can never repay the debt, at least pay the interest properly.",
        "If for some reason, you don’t have the affection for your parents, even then, you need to look after them well to at least put the math in order."
    ]
}