{
    "title": "How to Forward an Email to Someone in Hotmail",
    "url": "https://www.wikihow.com/Forward-an-Email-to-Someone-in-Hotmail",
    "category_hierarchy": [
        "Computers and Electronics",
        "Internet",
        "Online Communications",
        "Email",
        "Email Service Providers",
        "Hotmail"
    ],
    "steps": [
        {
            "headline": "Visit the Hotmail website in your web browser.",
            "description": ""
        },
        {
            "headline": "Sign in using your account credentials, if you aren't already signed in.",
            "description": ""
        },
        {
            "headline": "Find the email message you would like to forward to someone, and single-click it to highlight it.",
            "description": ""
        },
        {
            "headline": "Click the \"Forward\" button underneath the \"Reply\" button from slightly above this title of messages area.",
            "description": ""
        },
        {
            "headline": "Click the empty box directly to the right of the button marked \"To\".",
            "description": "Type the name of the recipient as it is written in your address book, or type the exact email as you originally input it at initial entry, or if it matches neither type, you can input the email address without typing any other text. You may click the \"To\" button and scroll to find the contact. However, with the initial setting auto-completing as you type, you'll probably find this other option much easier and much faster to find the person you're looking for."
        },
        {
            "headline": "Customize the message, if you'd like to personalize it and explain to the person why you are sending them this piece of mail.",
            "description": "Type a message into the big box below (optional). Click the \"Send\" link from above this new message."
        }
    ],
    "tyn": [
        "Windows Live Hotmail/Windows Live ID",
        "mouse and keyboard",
        "PC",
        "Internet access"
    ],
    "text": " Visit the Hotmail website in your web browser.  Sign in using your account credentials, if you aren't already signed in.  Find the email message you would like to forward to someone, and single-click it to highlight it.  Click the \"Forward\" button underneath the \"Reply\" button from slightly above this title of messages area.  Click the empty box directly to the right of the button marked \"To\". Type the name of the recipient as it is written in your address book, or type the exact email as you originally input it at initial entry, or if it matches neither type, you can input the email address without typing any other text. You may click the \"To\" button and scroll to find the contact. However, with the initial setting auto-completing as you type, you'll probably find this other option much easier and much faster to find the person you're looking for. Customize the message, if you'd like to personalize it and explain to the person why you are sending them this piece of mail. Type a message into the big box below (optional). Click the \"Send\" link from above this new message.",
    "sentences": [
        " Visit the Hotmail website in your web browser.",
        "Sign in using your account credentials, if you aren't already signed in.",
        "Find the email message you would like to forward to someone, and single-click it to highlight it.",
        "Click the \"Forward\" button underneath the \"Reply\" button from slightly above this title of messages area.",
        "Click the empty box directly to the right of the button marked \"To\".",
        "Type the name of the recipient as it is written in your address book, or type the exact email as you originally input it at initial entry, or if it matches neither type, you can input the email address without typing any other text.",
        "You may click the \"To\" button and scroll to find the contact.",
        "However, with the initial setting auto-completing as you type, you'll probably find this other option much easier and much faster to find the person you're looking for.",
        "Customize the message, if you'd like to personalize it and explain to the person why you are sending them this piece of mail.",
        "Type a message into the big box below (optional).",
        "Click the \"Send\" link from above this new message."
    ]
}