{
    "title": "How to Take a Shower With a New Tattoo",
    "url": "https://www.wikihow.com/Take-a-Shower-With-a-New-Tattoo",
    "category_hierarchy": [
        "Personal Care and Style",
        "Tattoos and Piercing",
        "Care of Tattoos",
        "Care of New Tattoos"
    ],
    "parts": [
        {
            "name": "Dealing with the Bandage",
            "steps": [
                {
                    "headline": "Listen to the tattoo artist about when to take off your bandage.",
                    "description": "Tattoos heal at different speeds, depending on things like your skin sensitivity and how big or deep the tattoo is. Your tattoo artist will tell you how long you should keep your bandage over your tattoo. If they don't tell you, ask them. When the artists finishes your tattoo, they will wash it off and treat it with an antiseptic. They will then apply a bandage to your tattoo, which will help keep bacteria away from it."
                },
                {
                    "headline": "Wait 2-3 hours to take off the bandage if you're not given a time period.",
                    "description": "If you forget to ask or can't get a hold of the tattoo artist, a good waiting period is 2-3 hours. If your tattoo is really large, you can wait up to 6 hours. That gives your tattoo time to get over the initial shock before you shower. Be sure to remove the bandage within the first day, as bacteria can breed in the moist environment underneath it."
                },
                {
                    "headline": "Remove the bandage applied by the tattoo artist before showering.",
                    "description": "Before touching the bandage, scrub your hands thoroughly. Wash them in warm water with soap for at least 20 seconds. Then, you can peel back the bandage that's covering your tattoo. Don't try to shower with the bandage in place. The water will soak into the bandage, and the bandage will hold it against your tattoo, which can introduce bacteria to it."
                },
                {
                    "headline": "Take the bandage off in the shower if it's sticking to your tattoo.",
                    "description": "Sometimes, the bandage will stick to the tattoo, which can be painful when you try to take it off. Run the bandage under indirect, warm water in the shower, which will help loosen the adhesive. Then move on to cleaning up your tattoo."
                }
            ]
        },
        {
            "name": "Washing Your Tattoo",
            "steps": [
                {
                    "headline": "Wait up to 24 hours to shower.",
                    "description": "Talk to your tattoo artist about how long it's best to wait. Generally, though, you can shower within the first 24 hours after getting your new ink. Waiting 2 days gives your skin more time to form a barrier over the tattoo."
                },
                {
                    "headline": "Use lukewarm water.",
                    "description": "Hot water can make your tattoo sting, so it's best to avoid it. Hot water too soon after getting a tattoo can also make you lose color from your tattoo, as it opens your pores, so it's best to avoid it. Try running cold water on the tattoo for 30 seconds at the end of your shower to tighten your pores."
                },
                {
                    "headline": "Turn the spray to gentle or keep your tattoo out of the spray.",
                    "description": "Don't use a hard spray on your tattoo, as it can irritate it. If you only have a shower head with a heavy spray, let the water run over the tattoo indirectly. You can also use a clean cup or your hand to pour a gentle stream of water over your tattoo. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBurak Moreno\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTattoo Artist\t\t\t\t\t\t\t\tBurak Moreno is a Professional Tattoo Artist with over 10 years of experience. Burak is based in New York City and is a tattoo artist for Fleur Noire Tattoo Parlour in Brooklyn. Born and raised in Istanbul, Turkey, he has worked as a tattoo artist throughout Europe. He works on many different styles but mostly does bold lines and strong color. You can find more of his tattoo designs on Instagram @burakmoreno. Burak Moreno\t\t\tTattoo Artist\t\t\t\tKeep your shower short, as well. When you first have a new tattoo, don't take very long or very hot showers, and don't take baths while it's healing."
                },
                {
                    "headline": "Use your hands to apply a mild, unscented soap to your tattoo.",
                    "description": "Any mild soap will do, including bar soap or liquid hand soap. You can use antibacterial soap if you prefer. Lather the soap in your hands, then apply it to the tattoo. Just rub it in gently with your fingers. Avoid using loofahs and sponges until the tattoo heals, as they can carry bacteria. Your tattoo will likely have dried blood and other debris on it, which you need to remove. However, you should not scrub it, as that can irritate it."
                },
                {
                    "headline": "Rinse the tattoo off gently with water.",
                    "description": "Once you rub the soap into your tattoo, pour water over it to rinse the soap off. If you need to, use your fingers to gently rub the soap off under the water. Hop out of the shower quickly. When in the shower, your tattoo comes in contact with steam, water, and soap. That can be painful and irritating for your tattoo, so avoid staying in the shower too long. Also, try to keep your tattoo out from under running water when washing the rest of your body for at least a week."
                },
                {
                    "headline": "Pat the tattoo dry with a clean, soft towel.",
                    "description": "Don't rub the tattoo with the towel, as that could irritate it. Simply dab at the tattoo gently, until it's dry. You may notice a little bit of blood, which is fine. You can use paper towels if you don't have a newly cleaned towel on hand or if your usual bath towel leaves fibers on your skin. Dirty towels can introduce bacteria."
                }
            ]
        },
        {
            "name": "Staying Clean",
            "steps": [
                {
                    "headline": "Wash your tattoo 3 times a day for the first week to keep it clean.",
                    "description": "While you're tattoo is healing, you need to practice good hygiene to keep it from getting infected. Wash with a mild, unscented soap, and use your fingers to rub it in. Rinse it off gently with water. Pat it dry with a clean towel."
                },
                {
                    "headline": "Use a moisturizing ointment on your tattoo once it's dry.",
                    "description": "Pick one that's scent-free and preferably hypoallergenic so it won't irritate your tattoo. Gently rub it in with clean hands. Start with an ointment. You can try a lotion after a week or so."
                },
                {
                    "headline": "Let your tattoo breathe by leaving the bandage off.",
                    "description": "Don't re-bandage your tattoo once you've applied the moisturizer. You only need to keep a bandage on for the first day. After that, it's better to let your tattoo get fresh air."
                },
                {
                    "headline": "Avoid getting in the tub while your tattoo is healing.",
                    "description": "Sitting a tub full of water can introduce bacteria to your tattoo. Stick to showers instead, which are less likely to introduce bacteria."
                },
                {
                    "headline": "Skip the swimming pool and lakes.",
                    "description": "Large bodies of water are teeming with bacteria, and you don't want those bacteria getting in your tattoo. Wait until your tattoo is completely healed before you go swimming. Healing can take 45 days to 6 months, depending on the size and depth of your tattoo. You should also avoid going to the gym so that sweat and bacteria don't build up on your skin."
                }
            ]
        }
    ],
    "tyn": [
        "Soap",
        "Water",
        "Towel",
        "Moisturizing ointment"
    ],
    "text": " Dealing with the Bandage Listen to the tattoo artist about when to take off your bandage. Tattoos heal at different speeds, depending on things like your skin sensitivity and how big or deep the tattoo is. Your tattoo artist will tell you how long you should keep your bandage over your tattoo. If they don't tell you, ask them. When the artists finishes your tattoo, they will wash it off and treat it with an antiseptic. They will then apply a bandage to your tattoo, which will help keep bacteria away from it. Wait 2-3 hours to take off the bandage if you're not given a time period. If you forget to ask or can't get a hold of the tattoo artist, a good waiting period is 2-3 hours. If your tattoo is really large, you can wait up to 6 hours. That gives your tattoo time to get over the initial shock before you shower. Be sure to remove the bandage within the first day, as bacteria can breed in the moist environment underneath it. Remove the bandage applied by the tattoo artist before showering. Before touching the bandage, scrub your hands thoroughly. Wash them in warm water with soap for at least 20 seconds. Then, you can peel back the bandage that's covering your tattoo. Don't try to shower with the bandage in place. The water will soak into the bandage, and the bandage will hold it against your tattoo, which can introduce bacteria to it. Take the bandage off in the shower if it's sticking to your tattoo. Sometimes, the bandage will stick to the tattoo, which can be painful when you try to take it off. Run the bandage under indirect, warm water in the shower, which will help loosen the adhesive. Then move on to cleaning up your tattoo. Washing Your Tattoo Wait up to 24 hours to shower. Talk to your tattoo artist about how long it's best to wait. Generally, though, you can shower within the first 24 hours after getting your new ink. Waiting 2 days gives your skin more time to form a barrier over the tattoo. Use lukewarm water. Hot water can make your tattoo sting, so it's best to avoid it. Hot water too soon after getting a tattoo can also make you lose color from your tattoo, as it opens your pores, so it's best to avoid it. Try running cold water on the tattoo for 30 seconds at the end of your shower to tighten your pores. Turn the spray to gentle or keep your tattoo out of the spray. Don't use a hard spray on your tattoo, as it can irritate it. If you only have a shower head with a heavy spray, let the water run over the tattoo indirectly. You can also use a clean cup or your hand to pour a gentle stream of water over your tattoo. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBurak Moreno\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTattoo Artist\t\t\t\t\t\t\t\tBurak Moreno is a Professional Tattoo Artist with over 10 years of experience. Burak is based in New York City and is a tattoo artist for Fleur Noire Tattoo Parlour in Brooklyn. Born and raised in Istanbul, Turkey, he has worked as a tattoo artist throughout Europe. He works on many different styles but mostly does bold lines and strong color. You can find more of his tattoo designs on Instagram @burakmoreno. Burak Moreno\t\t\tTattoo Artist\t\t\t\tKeep your shower short, as well. When you first have a new tattoo, don't take very long or very hot showers, and don't take baths while it's healing. Use your hands to apply a mild, unscented soap to your tattoo. Any mild soap will do, including bar soap or liquid hand soap. You can use antibacterial soap if you prefer. Lather the soap in your hands, then apply it to the tattoo. Just rub it in gently with your fingers. Avoid using loofahs and sponges until the tattoo heals, as they can carry bacteria. Your tattoo will likely have dried blood and other debris on it, which you need to remove. However, you should not scrub it, as that can irritate it. Rinse the tattoo off gently with water. Once you rub the soap into your tattoo, pour water over it to rinse the soap off. If you need to, use your fingers to gently rub the soap off under the water. Hop out of the shower quickly. When in the shower, your tattoo comes in contact with steam, water, and soap. That can be painful and irritating for your tattoo, so avoid staying in the shower too long. Also, try to keep your tattoo out from under running water when washing the rest of your body for at least a week. Pat the tattoo dry with a clean, soft towel. Don't rub the tattoo with the towel, as that could irritate it. Simply dab at the tattoo gently, until it's dry. You may notice a little bit of blood, which is fine. You can use paper towels if you don't have a newly cleaned towel on hand or if your usual bath towel leaves fibers on your skin. Dirty towels can introduce bacteria. Staying Clean Wash your tattoo 3 times a day for the first week to keep it clean. While you're tattoo is healing, you need to practice good hygiene to keep it from getting infected. Wash with a mild, unscented soap, and use your fingers to rub it in. Rinse it off gently with water. Pat it dry with a clean towel. Use a moisturizing ointment on your tattoo once it's dry. Pick one that's scent-free and preferably hypoallergenic so it won't irritate your tattoo. Gently rub it in with clean hands. Start with an ointment. You can try a lotion after a week or so. Let your tattoo breathe by leaving the bandage off. Don't re-bandage your tattoo once you've applied the moisturizer. You only need to keep a bandage on for the first day. After that, it's better to let your tattoo get fresh air. Avoid getting in the tub while your tattoo is healing. Sitting a tub full of water can introduce bacteria to your tattoo. Stick to showers instead, which are less likely to introduce bacteria. Skip the swimming pool and lakes. Large bodies of water are teeming with bacteria, and you don't want those bacteria getting in your tattoo. Wait until your tattoo is completely healed before you go swimming. Healing can take 45 days to 6 months, depending on the size and depth of your tattoo. You should also avoid going to the gym so that sweat and bacteria don't build up on your skin.",
    "sentences": [
        " Dealing with the Bandage Listen to the tattoo artist about when to take off your bandage.",
        "Tattoos heal at different speeds, depending on things like your skin sensitivity and how big or deep the tattoo is.",
        "Your tattoo artist will tell you how long you should keep your bandage over your tattoo.",
        "If they don't tell you, ask them.",
        "When the artists finishes your tattoo, they will wash it off and treat it with an antiseptic.",
        "They will then apply a bandage to your tattoo, which will help keep bacteria away from it.",
        "Wait 2-3 hours to take off the bandage if you're not given a time period.",
        "If you forget to ask or can't get a hold of the tattoo artist, a good waiting period is 2-3 hours.",
        "If your tattoo is really large, you can wait up to 6 hours.",
        "That gives your tattoo time to get over the initial shock before you shower.",
        "Be sure to remove the bandage within the first day, as bacteria can breed in the moist environment underneath it.",
        "Remove the bandage applied by the tattoo artist before showering.",
        "Before touching the bandage, scrub your hands thoroughly.",
        "Wash them in warm water with soap for at least 20 seconds.",
        "Then, you can peel back the bandage that's covering your tattoo.",
        "Don't try to shower with the bandage in place.",
        "The water will soak into the bandage, and the bandage will hold it against your tattoo, which can introduce bacteria to it.",
        "Take the bandage off in the shower if it's sticking to your tattoo.",
        "Sometimes, the bandage will stick to the tattoo, which can be painful when you try to take it off.",
        "Run the bandage under indirect, warm water in the shower, which will help loosen the adhesive.",
        "Then move on to cleaning up your tattoo.",
        "Washing Your Tattoo Wait up to 24 hours to shower.",
        "Talk to your tattoo artist about how long it's best to wait.",
        "Generally, though, you can shower within the first 24 hours after getting your new ink.",
        "Waiting 2 days gives your skin more time to form a barrier over the tattoo.",
        "Use lukewarm water.",
        "Hot water can make your tattoo sting, so it's best to avoid it.",
        "Hot water too soon after getting a tattoo can also make you lose color from your tattoo, as it opens your pores, so it's best to avoid it.",
        "Try running cold water on the tattoo for 30 seconds at the end of your shower to tighten your pores.",
        "Turn the spray to gentle or keep your tattoo out of the spray.",
        "Don't use a hard spray on your tattoo, as it can irritate it.",
        "If you only have a shower head with a heavy spray, let the water run over the tattoo indirectly.",
        "You can also use a clean cup or your hand to pour a gentle stream of water over your tattoo.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBurak Moreno\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTattoo Artist\t\t\t\t\t\t\t\tBurak Moreno is a Professional Tattoo Artist with over 10 years of experience.",
        "Burak is based in New York City and is a tattoo artist for Fleur Noire Tattoo Parlour in Brooklyn.",
        "Born and raised in Istanbul, Turkey, he has worked as a tattoo artist throughout Europe.",
        "He works on many different styles but mostly does bold lines and strong color.",
        "You can find more of his tattoo designs on Instagram @burakmoreno.",
        "Burak Moreno\t\t\tTattoo Artist\t\t\t\tKeep your shower short, as well.",
        "When you first have a new tattoo, don't take very long or very hot showers, and don't take baths while it's healing.",
        "Use your hands to apply a mild, unscented soap to your tattoo.",
        "Any mild soap will do, including bar soap or liquid hand soap.",
        "You can use antibacterial soap if you prefer.",
        "Lather the soap in your hands, then apply it to the tattoo.",
        "Just rub it in gently with your fingers.",
        "Avoid using loofahs and sponges until the tattoo heals, as they can carry bacteria.",
        "Your tattoo will likely have dried blood and other debris on it, which you need to remove.",
        "However, you should not scrub it, as that can irritate it.",
        "Rinse the tattoo off gently with water.",
        "Once you rub the soap into your tattoo, pour water over it to rinse the soap off.",
        "If you need to, use your fingers to gently rub the soap off under the water.",
        "Hop out of the shower quickly.",
        "When in the shower, your tattoo comes in contact with steam, water, and soap.",
        "That can be painful and irritating for your tattoo, so avoid staying in the shower too long.",
        "Also, try to keep your tattoo out from under running water when washing the rest of your body for at least a week.",
        "Pat the tattoo dry with a clean, soft towel.",
        "Don't rub the tattoo with the towel, as that could irritate it.",
        "Simply dab at the tattoo gently, until it's dry.",
        "You may notice a little bit of blood, which is fine.",
        "You can use paper towels if you don't have a newly cleaned towel on hand or if your usual bath towel leaves fibers on your skin.",
        "Dirty towels can introduce bacteria.",
        "Staying Clean Wash your tattoo 3 times a day for the first week to keep it clean.",
        "While you're tattoo is healing, you need to practice good hygiene to keep it from getting infected.",
        "Wash with a mild, unscented soap, and use your fingers to rub it in.",
        "Rinse it off gently with water.",
        "Pat it dry with a clean towel.",
        "Use a moisturizing ointment on your tattoo once it's dry.",
        "Pick one that's scent-free and preferably hypoallergenic so it won't irritate your tattoo.",
        "Gently rub it in with clean hands.",
        "Start with an ointment.",
        "You can try a lotion after a week or so.",
        "Let your tattoo breathe by leaving the bandage off.",
        "Don't re-bandage your tattoo once you've applied the moisturizer.",
        "You only need to keep a bandage on for the first day.",
        "After that, it's better to let your tattoo get fresh air.",
        "Avoid getting in the tub while your tattoo is healing.",
        "Sitting a tub full of water can introduce bacteria to your tattoo.",
        "Stick to showers instead, which are less likely to introduce bacteria.",
        "Skip the swimming pool and lakes.",
        "Large bodies of water are teeming with bacteria, and you don't want those bacteria getting in your tattoo.",
        "Wait until your tattoo is completely healed before you go swimming.",
        "Healing can take 45 days to 6 months, depending on the size and depth of your tattoo.",
        "You should also avoid going to the gym so that sweat and bacteria don't build up on your skin."
    ]
}