{
    "title": "How to Put Up a Christmas Tree",
    "url": "https://www.wikihow.com/Put-Up-a-Christmas-Tree",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Christmas",
        "Christmas Trees"
    ],
    "methods": [
        {
            "name": "Putting up a real Christmas tree",
            "steps": [
                {
                    "headline": "Choose a tree.",
                    "description": "A visit to your local Christmas tree farm is a good way to begin."
                },
                {
                    "headline": "Give your tree a shake before putting it up.",
                    "description": "Remove any dead needles by shaking it outside before putting it up."
                },
                {
                    "headline": "Decide where to put your tree.",
                    "description": "Check the ceiling height and the necessary width, and place the tree away from heat sources. Also consider how pets and children might get at it, how it might fall over (or what it might fall onto), and if it proves an obstacle. Do not put it too close to the fireplace."
                },
                {
                    "headline": "Place the tree into its stand.",
                    "description": "Tighten the screws and make sure it's sturdy. The screws don't need to screw into the tree, but they must not move."
                },
                {
                    "headline": "Add at least a gallon of water straight away.",
                    "description": "It will be a thirsty tree to begin with. Have water touching the base of the tree at all time. If there's not, a layer of sap will form. If that happens, you'll need to make another cut, as the tree can't drink through the sap layer."
                },
                {
                    "headline": "Surround the stand with a tree bag.",
                    "description": "Place a tree bag around the base of your tree. This not only catches the needles and makes for super easy clean up when you're done with it, but you can just remove all the decorations, then grab the bag, give it a tug, and the tree is bagged and ready to go."
                },
                {
                    "headline": "Keep it watered.",
                    "description": "For the first week or so, a 7-foot tree could go through about 2 quarts of water a day. Make sure it doesn't run out of water. If you take good care of this tree, it could last for over a month."
                }
            ]
        },
        {
            "name": "Putting up a living Christmas tree",
            "steps": [
                {
                    "headline": "Choose a healthy tree.",
                    "description": "If at all possible, buy a Christmas tree from a tree farm, where you can purchase your tree while it's still in the ground. A freshly cut Christmas tree will last longer than one that's been cut weeks ago and shipped to distant retail outlets."
                },
                {
                    "headline": "Choose and clear a location for the tree.",
                    "description": "It should be kept away from open flames or heat sources, which may dry it out prematurely. Trees do sometimes burn so be careful (see Warnings below). Corners are good places to put trees because this placement keeps the tree safe from knocks and bumps. If you'll be using lights to decorate your tree, place the tree close to an outlet. If this isn't possible, you'll need to use an extension cord. Be sure that if you use an extension cord, it runs along to wall and doesn't create a trip hazard."
                },
                {
                    "headline": "Cover the floor where the tree will be placed.",
                    "description": "You can use a properly sewn tree skirt or be budget savvy and use Christmas-themed paper or a piece of satin fabric as shown. This will not only serve decorative purposes, but it will also help protect the floor in case any water splashes out. If you have a skirt that goes over the cradle, you can still place a barrier underneath the cradle and apply the decorative skirt after the tree has been mounted. Not only does this make the tree more presentable but it prevents pets from attempting or wanting to drink the water in the base."
                },
                {
                    "headline": "Prepare the base of your tree.",
                    "description": "Using a small handsaw, cut about a half inch to an inch (1.3cm-2.5cm) off the bottom to aid water absorption. Note: It is recommended that you don't cut the base at an angle, in a V-shape or drill a hole in the base. None of these methods help water absorption and they may make it more difficult to hold the tree safely in the stand. Do not cut the tree with a reciprocal saw or any blade that moves so fast that it will create friction. If the cut gets hot enough, the sap in the tree will seal the end and make water absorption impossible. A chainsaw or manual saw will work."
                },
                {
                    "headline": "Mount your tree within eight hours of cutting the base.",
                    "description": "That is how long a fresh tree can go without water before absorption is jeopardized. A Christmas tree should never be mounted dry. It is much better to place it in a container of water that is replenished on a regular basis. You can buy special tree cradles or stands which screw into the base of the tree and provide watering space. Or, you can go for the rougher but tried-and-true method of using a bucket filled with small rocks (put the tree in, fill the bucket with rocks around the trunk). The tree should be provided with 1 quart (950ml) of water for every inch (2.5cm) in trunk diameter. Note: ensure that whatever you use, the tree is stable. Don't whittle down the bark of the tree just so that it can fit in the stand - that outer layer is the part that absorbs the most water."
                },
                {
                    "headline": "Make sure the tree is straight.",
                    "description": "It is a good idea for at least two people to put up the tree, one holding it stable while the other fixes the base. Always stand back to check that the tree is straight before you get busy decorating. Obviously, it is easiest to fix at this stage."
                }
            ]
        },
        {
            "name": "Putting up an artificial tree",
            "steps": [
                {
                    "headline": "Measure the height of your ceiling.",
                    "description": "If the tree is too tall, you won't be able to fit a star or an angel on it. Don't forget to account for the height of your stand and the area in which you plan to put your tree. You will want it indoors because many come with lights."
                },
                {
                    "headline": "Choose a tree with an appealing shape that fits where you need it.",
                    "description": "Some people prefer short fat trees, others long, skinny trees, still others prefer the \"perfect\" cone shaped tree. Most people prefer fat trees or \"perfectly\" shaped trees. This is not always possible. If you get a tree that is to big find a bigger space where you can still see your tree."
                },
                {
                    "headline": "Take out the tree from the box.",
                    "description": "Place it in the room where you'd like to set it up. You can use an artificial Christmas tree in almost any room except for where there could be an open fire nearby, such as a kitchen or another room where a fire could erupt at any point via a cigarette or other type of fire-creator/lighter."
                },
                {
                    "headline": "Clear the area where you are planning to place the tree.",
                    "description": "Clean away any pieces of furniture that sit in that particular area and vacuum the area to kill all the dust mites and spider webs that may have accumulated there."
                },
                {
                    "headline": "Set up the Christmas tree stand.",
                    "description": "Some stands come already in one piece, while others require a little assembly. If the Christmas tree stand comes in multiple pieces, you'll need to attach piece by piece, making sure they are all facing downward the same way in the radial direction. Typically, these pieces/legs slide onto the main base easily, as long as they're facing the right direction."
                },
                {
                    "headline": "Start assembling the tree.",
                    "description": "Most newer trees come in two or three sections, ready to be easily connected. Start with the bottom piece, slotting the bottom of the pole into the top of the base. Then tackle the second and third sections, one by one. For each level, you'll see a connection point in the interior of the tops and bottoms of each section, where two poles slot into one another. The instructions on the box for your particular tree can also offer further help. With pre-lit trees, you'll have to connect the pole and the electrical cord for each tree piece."
                },
                {
                    "headline": "Place the Christmas tree in the location you chose.",
                    "description": ""
                },
                {
                    "headline": "Orient the tree's branches.",
                    "description": "Most artificial Christmas trees are stored \"bunched up\" and can look sparse when unpacked. Push some of the branches into a more-realistic looking place instead of having them be tightly folded up. If the branches are the wire variety, bend them into the desired position, spreading out the branches and angling them slightly up, ready for decorations."
                }
            ]
        }
    ],
    "tyn": [
        "Selecting a Christmas Tree",
        "Measuring tape",
        "Displaying a Natural Christmas Tree",
        "Christmas tree",
        "Saw",
        "Tree stand",
        "Cup, bowl, or pitcher",
        "Water",
        "Assembling an Artificial Tree",
        "Artificial Christmas tree"
    ],
    "text": " Putting up a real Christmas tree Choose a tree. A visit to your local Christmas tree farm is a good way to begin. Give your tree a shake before putting it up. Remove any dead needles by shaking it outside before putting it up. Decide where to put your tree. Check the ceiling height and the necessary width, and place the tree away from heat sources. Also consider how pets and children might get at it, how it might fall over (or what it might fall onto), and if it proves an obstacle. Do not put it too close to the fireplace. Place the tree into its stand. Tighten the screws and make sure it's sturdy. The screws don't need to screw into the tree, but they must not move. Add at least a gallon of water straight away. It will be a thirsty tree to begin with. Have water touching the base of the tree at all time. If there's not, a layer of sap will form. If that happens, you'll need to make another cut, as the tree can't drink through the sap layer. Surround the stand with a tree bag. Place a tree bag around the base of your tree. This not only catches the needles and makes for super easy clean up when you're done with it, but you can just remove all the decorations, then grab the bag, give it a tug, and the tree is bagged and ready to go. Keep it watered. For the first week or so, a 7-foot tree could go through about 2 quarts of water a day. Make sure it doesn't run out of water. If you take good care of this tree, it could last for over a month. Putting up a living Christmas tree Choose a healthy tree. If at all possible, buy a Christmas tree from a tree farm, where you can purchase your tree while it's still in the ground. A freshly cut Christmas tree will last longer than one that's been cut weeks ago and shipped to distant retail outlets. Choose and clear a location for the tree. It should be kept away from open flames or heat sources, which may dry it out prematurely. Trees do sometimes burn so be careful (see Warnings below). Corners are good places to put trees because this placement keeps the tree safe from knocks and bumps. If you'll be using lights to decorate your tree, place the tree close to an outlet. If this isn't possible, you'll need to use an extension cord. Be sure that if you use an extension cord, it runs along to wall and doesn't create a trip hazard. Cover the floor where the tree will be placed. You can use a properly sewn tree skirt or be budget savvy and use Christmas-themed paper or a piece of satin fabric as shown. This will not only serve decorative purposes, but it will also help protect the floor in case any water splashes out. If you have a skirt that goes over the cradle, you can still place a barrier underneath the cradle and apply the decorative skirt after the tree has been mounted. Not only does this make the tree more presentable but it prevents pets from attempting or wanting to drink the water in the base. Prepare the base of your tree. Using a small handsaw, cut about a half inch to an inch (1.3cm-2.5cm) off the bottom to aid water absorption. Note: It is recommended that you don't cut the base at an angle, in a V-shape or drill a hole in the base. None of these methods help water absorption and they may make it more difficult to hold the tree safely in the stand. Do not cut the tree with a reciprocal saw or any blade that moves so fast that it will create friction. If the cut gets hot enough, the sap in the tree will seal the end and make water absorption impossible. A chainsaw or manual saw will work. Mount your tree within eight hours of cutting the base. That is how long a fresh tree can go without water before absorption is jeopardized. A Christmas tree should never be mounted dry. It is much better to place it in a container of water that is replenished on a regular basis. You can buy special tree cradles or stands which screw into the base of the tree and provide watering space. Or, you can go for the rougher but tried-and-true method of using a bucket filled with small rocks (put the tree in, fill the bucket with rocks around the trunk). The tree should be provided with 1 quart (950ml) of water for every inch (2.5cm) in trunk diameter. Note: ensure that whatever you use, the tree is stable. Don't whittle down the bark of the tree just so that it can fit in the stand - that outer layer is the part that absorbs the most water. Make sure the tree is straight. It is a good idea for at least two people to put up the tree, one holding it stable while the other fixes the base. Always stand back to check that the tree is straight before you get busy decorating. Obviously, it is easiest to fix at this stage. Putting up an artificial tree Measure the height of your ceiling. If the tree is too tall, you won't be able to fit a star or an angel on it. Don't forget to account for the height of your stand and the area in which you plan to put your tree. You will want it indoors because many come with lights. Choose a tree with an appealing shape that fits where you need it. Some people prefer short fat trees, others long, skinny trees, still others prefer the \"perfect\" cone shaped tree. Most people prefer fat trees or \"perfectly\" shaped trees. This is not always possible. If you get a tree that is to big find a bigger space where you can still see your tree. Take out the tree from the box. Place it in the room where you'd like to set it up. You can use an artificial Christmas tree in almost any room except for where there could be an open fire nearby, such as a kitchen or another room where a fire could erupt at any point via a cigarette or other type of fire-creator/lighter. Clear the area where you are planning to place the tree. Clean away any pieces of furniture that sit in that particular area and vacuum the area to kill all the dust mites and spider webs that may have accumulated there. Set up the Christmas tree stand. Some stands come already in one piece, while others require a little assembly. If the Christmas tree stand comes in multiple pieces, you'll need to attach piece by piece, making sure they are all facing downward the same way in the radial direction. Typically, these pieces/legs slide onto the main base easily, as long as they're facing the right direction. Start assembling the tree. Most newer trees come in two or three sections, ready to be easily connected. Start with the bottom piece, slotting the bottom of the pole into the top of the base. Then tackle the second and third sections, one by one. For each level, you'll see a connection point in the interior of the tops and bottoms of each section, where two poles slot into one another. The instructions on the box for your particular tree can also offer further help. With pre-lit trees, you'll have to connect the pole and the electrical cord for each tree piece. Place the Christmas tree in the location you chose.  Orient the tree's branches. Most artificial Christmas trees are stored \"bunched up\" and can look sparse when unpacked. Push some of the branches into a more-realistic looking place instead of having them be tightly folded up. If the branches are the wire variety, bend them into the desired position, spreading out the branches and angling them slightly up, ready for decorations.",
    "sentences": [
        " Putting up a real Christmas tree Choose a tree.",
        "A visit to your local Christmas tree farm is a good way to begin.",
        "Give your tree a shake before putting it up.",
        "Remove any dead needles by shaking it outside before putting it up.",
        "Decide where to put your tree.",
        "Check the ceiling height and the necessary width, and place the tree away from heat sources.",
        "Also consider how pets and children might get at it, how it might fall over (or what it might fall onto), and if it proves an obstacle.",
        "Do not put it too close to the fireplace.",
        "Place the tree into its stand.",
        "Tighten the screws and make sure it's sturdy.",
        "The screws don't need to screw into the tree, but they must not move.",
        "Add at least a gallon of water straight away.",
        "It will be a thirsty tree to begin with.",
        "Have water touching the base of the tree at all time.",
        "If there's not, a layer of sap will form.",
        "If that happens, you'll need to make another cut, as the tree can't drink through the sap layer.",
        "Surround the stand with a tree bag.",
        "Place a tree bag around the base of your tree.",
        "This not only catches the needles and makes for super easy clean up when you're done with it, but you can just remove all the decorations, then grab the bag, give it a tug, and the tree is bagged and ready to go.",
        "Keep it watered.",
        "For the first week or so, a 7-foot tree could go through about 2 quarts of water a day.",
        "Make sure it doesn't run out of water.",
        "If you take good care of this tree, it could last for over a month.",
        "Putting up a living Christmas tree Choose a healthy tree.",
        "If at all possible, buy a Christmas tree from a tree farm, where you can purchase your tree while it's still in the ground.",
        "A freshly cut Christmas tree will last longer than one that's been cut weeks ago and shipped to distant retail outlets.",
        "Choose and clear a location for the tree.",
        "It should be kept away from open flames or heat sources, which may dry it out prematurely.",
        "Trees do sometimes burn so be careful (see Warnings below).",
        "Corners are good places to put trees because this placement keeps the tree safe from knocks and bumps.",
        "If you'll be using lights to decorate your tree, place the tree close to an outlet.",
        "If this isn't possible, you'll need to use an extension cord.",
        "Be sure that if you use an extension cord, it runs along to wall and doesn't create a trip hazard.",
        "Cover the floor where the tree will be placed.",
        "You can use a properly sewn tree skirt or be budget savvy and use Christmas-themed paper or a piece of satin fabric as shown.",
        "This will not only serve decorative purposes, but it will also help protect the floor in case any water splashes out.",
        "If you have a skirt that goes over the cradle, you can still place a barrier underneath the cradle and apply the decorative skirt after the tree has been mounted.",
        "Not only does this make the tree more presentable but it prevents pets from attempting or wanting to drink the water in the base.",
        "Prepare the base of your tree.",
        "Using a small handsaw, cut about a half inch to an inch (1.3cm-2.5cm) off the bottom to aid water absorption.",
        "Note: It is recommended that you don't cut the base at an angle, in a V-shape or drill a hole in the base.",
        "None of these methods help water absorption and they may make it more difficult to hold the tree safely in the stand.",
        "Do not cut the tree with a reciprocal saw or any blade that moves so fast that it will create friction.",
        "If the cut gets hot enough, the sap in the tree will seal the end and make water absorption impossible.",
        "A chainsaw or manual saw will work.",
        "Mount your tree within eight hours of cutting the base.",
        "That is how long a fresh tree can go without water before absorption is jeopardized.",
        "A Christmas tree should never be mounted dry.",
        "It is much better to place it in a container of water that is replenished on a regular basis.",
        "You can buy special tree cradles or stands which screw into the base of the tree and provide watering space.",
        "Or, you can go for the rougher but tried-and-true method of using a bucket filled with small rocks (put the tree in, fill the bucket with rocks around the trunk).",
        "The tree should be provided with 1 quart (950ml) of water for every inch (2.5cm) in trunk diameter.",
        "Note: ensure that whatever you use, the tree is stable.",
        "Don't whittle down the bark of the tree just so that it can fit in the stand - that outer layer is the part that absorbs the most water.",
        "Make sure the tree is straight.",
        "It is a good idea for at least two people to put up the tree, one holding it stable while the other fixes the base.",
        "Always stand back to check that the tree is straight before you get busy decorating.",
        "Obviously, it is easiest to fix at this stage.",
        "Putting up an artificial tree Measure the height of your ceiling.",
        "If the tree is too tall, you won't be able to fit a star or an angel on it.",
        "Don't forget to account for the height of your stand and the area in which you plan to put your tree.",
        "You will want it indoors because many come with lights.",
        "Choose a tree with an appealing shape that fits where you need it.",
        "Some people prefer short fat trees, others long, skinny trees, still others prefer the \"perfect\" cone shaped tree.",
        "Most people prefer fat trees or \"perfectly\" shaped trees.",
        "This is not always possible.",
        "If you get a tree that is to big find a bigger space where you can still see your tree.",
        "Take out the tree from the box.",
        "Place it in the room where you'd like to set it up.",
        "You can use an artificial Christmas tree in almost any room except for where there could be an open fire nearby, such as a kitchen or another room where a fire could erupt at any point via a cigarette or other type of fire-creator/lighter.",
        "Clear the area where you are planning to place the tree.",
        "Clean away any pieces of furniture that sit in that particular area and vacuum the area to kill all the dust mites and spider webs that may have accumulated there.",
        "Set up the Christmas tree stand.",
        "Some stands come already in one piece, while others require a little assembly.",
        "If the Christmas tree stand comes in multiple pieces, you'll need to attach piece by piece, making sure they are all facing downward the same way in the radial direction.",
        "Typically, these pieces/legs slide onto the main base easily, as long as they're facing the right direction.",
        "Start assembling the tree.",
        "Most newer trees come in two or three sections, ready to be easily connected.",
        "Start with the bottom piece, slotting the bottom of the pole into the top of the base.",
        "Then tackle the second and third sections, one by one.",
        "For each level, you'll see a connection point in the interior of the tops and bottoms of each section, where two poles slot into one another.",
        "The instructions on the box for your particular tree can also offer further help.",
        "With pre-lit trees, you'll have to connect the pole and the electrical cord for each tree piece.",
        "Place the Christmas tree in the location you chose.",
        "Orient the tree's branches.",
        "Most artificial Christmas trees are stored \"bunched up\" and can look sparse when unpacked.",
        "Push some of the branches into a more-realistic looking place instead of having them be tightly folded up.",
        "If the branches are the wire variety, bend them into the desired position, spreading out the branches and angling them slightly up, ready for decorations."
    ]
}