{
    "title": "How to Fill a Pez Dispenser",
    "url": "https://www.wikihow.com/Fill-a-Pez-Dispenser",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Collecting"
    ],
    "steps": [
        {
            "headline": "Obtain a pack of Pez.",
            "description": "If you don't have one at your location, some more traditional and non super-stores sell refill packs for your device."
        },
        {
            "headline": "Lay the dispenser on the table, with the face pointing upward.",
            "description": ""
        },
        {
            "headline": "Grab ahold of the face's sides with your thumb and forefinger (one on each side) and pull the face directly upward.",
            "description": "This should make the dispenser tray slide out. Stop pushing when the tray stops moving and until it will click into place."
        },
        {
            "headline": "Take out a piece of Pez from the package and insert the candy down into the shaft.",
            "description": "When inserting the candy,  Always stick the candy into the dispenser vertically, never horizontally, as the candy dispenser will cause the candy to break upon significant pressure, if done horizontally."
        },
        {
            "headline": "Repeat this filling method several times until the roll has been used up in its entirety.",
            "description": "Do not allow the tray to stand up yet."
        },
        {
            "headline": "Take the head again, and push it's tray back in, grabbing with your thumb and forefinger again, as was used before.",
            "description": "Stop pushing when the device stops, otherwise you will crush any and all of the remaining candies in the device. If done hard enough, the device will break too!"
        },
        {
            "headline": "Stand the Pez machine back up, once the tray has been pushed back in.",
            "description": ""
        },
        {
            "headline": "Use the Pez dispenser.",
            "description": "Stand the dispenser up and bend the head backwards using your thumb (as if bending it's neck forcefully backwards). A tiny bracket will push one Pez candy out so you can grab the edge of the candy. Pull the candy out and let the head retract. Repeat for additional candies."
        }
    ],
    "tyn": [
        "Pez dispenser",
        "Pez candies"
    ],
    "text": " Obtain a pack of Pez. If you don't have one at your location, some more traditional and non super-stores sell refill packs for your device. Lay the dispenser on the table, with the face pointing upward.  Grab ahold of the face's sides with your thumb and forefinger (one on each side) and pull the face directly upward. This should make the dispenser tray slide out. Stop pushing when the tray stops moving and until it will click into place. Take out a piece of Pez from the package and insert the candy down into the shaft. When inserting the candy,  Always stick the candy into the dispenser vertically, never horizontally, as the candy dispenser will cause the candy to break upon significant pressure, if done horizontally. Repeat this filling method several times until the roll has been used up in its entirety. Do not allow the tray to stand up yet. Take the head again, and push it's tray back in, grabbing with your thumb and forefinger again, as was used before. Stop pushing when the device stops, otherwise you will crush any and all of the remaining candies in the device. If done hard enough, the device will break too! Stand the Pez machine back up, once the tray has been pushed back in.  Use the Pez dispenser. Stand the dispenser up and bend the head backwards using your thumb (as if bending it's neck forcefully backwards). A tiny bracket will push one Pez candy out so you can grab the edge of the candy. Pull the candy out and let the head retract. Repeat for additional candies.",
    "sentences": [
        " Obtain a pack of Pez.",
        "If you don't have one at your location, some more traditional and non super-stores sell refill packs for your device.",
        "Lay the dispenser on the table, with the face pointing upward.",
        "Grab ahold of the face's sides with your thumb and forefinger (one on each side) and pull the face directly upward.",
        "This should make the dispenser tray slide out.",
        "Stop pushing when the tray stops moving and until it will click into place.",
        "Take out a piece of Pez from the package and insert the candy down into the shaft.",
        "When inserting the candy,  Always stick the candy into the dispenser vertically, never horizontally, as the candy dispenser will cause the candy to break upon significant pressure, if done horizontally.",
        "Repeat this filling method several times until the roll has been used up in its entirety.",
        "Do not allow the tray to stand up yet.",
        "Take the head again, and push it's tray back in, grabbing with your thumb and forefinger again, as was used before.",
        "Stop pushing when the device stops, otherwise you will crush any and all of the remaining candies in the device.",
        "If done hard enough, the device will break too!",
        "Stand the Pez machine back up, once the tray has been pushed back in.",
        "Use the Pez dispenser.",
        "Stand the dispenser up and bend the head backwards using your thumb (as if bending it's neck forcefully backwards).",
        "A tiny bracket will push one Pez candy out so you can grab the edge of the candy.",
        "Pull the candy out and let the head retract.",
        "Repeat for additional candies."
    ]
}