{
    "title": "How to Make Saag Paneer",
    "url": "https://www.wikihow.com/Make-Saag-Paneer",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "Indian Cuisine",
        "Vegetarian Indian Dishes"
    ],
    "methods": [
        {
            "name": "Mastering Saag Paneer",
            "steps": [
                {
                    "headline": "Finely chop one yellow onion, 1-2 inches of fresh ginger, and 4-5 large cloves of garlic.",
                    "description": "This dish takes place in one pan, meaning you need everything ready ahead of time to prevent burning and ensure proper cooking times. Dice the onion and mince both the garlic and ginger, setting aside for now. Optional, but recommended: If you like heat, chop up and add 2-3 green chilis here as well, setting aside with the other three."
                },
                {
                    "headline": "Mix up your desired spices, using cumin, turmeric, cayenne, paprika, and chili powder.",
                    "description": "The exact ratios depend on your preferences, so mix everything together in a small bowl ahead of time and take a big whiff, adding more as needed. Start with a 1/2 teaspoon of each to start, smelling and adapting as you like:\nJust use turmeric and a bit of cumin (dried seeds are best) for a simple, classic flavor. If you aren't using fresh fenugreek, a touch of dried leaves will go nicely here. If you don't have fresh ginger, 1/2 teaspoon ground ginger can be substituted here."
                },
                {
                    "headline": "Bring a pot of salted water to a boil and drop the greens in for 10 seconds, then drain.",
                    "description": "This is the first step of \"blanching,\" which quickly cooks the spinach without losing its color or flavor. Bring the water to a rolling boil, then drop your fresh spinach in for a brief time before draining it all out. Most saags are heavy on spinach, using mustard and fenugreek to complement the main attraction. You can make an all spinach saag, though this is technically known as \"palak paneer.\""
                },
                {
                    "headline": "Immediately dump the hot spinach in an ice water bath, or rise for 30 seconds under cold water.",
                    "description": "This will halt the cooking process immediately. When done, drain any excess water and squeeze the spinach dry between some paper towels. Set aside."
                },
                {
                    "headline": "Place 2 tablespoons ghee, butter, or oil in a large saucepan over medium heat.",
                    "description": "Heat until the oil is hot. Ghee (clarified butter) is the preferred choice for Indian chefs, but regular butter or canola oil will do fine without ruing the flavor."
                },
                {
                    "headline": "Toss in your spice mixture, cooking for only 10-20 seconds, then toss in the chopped vegetables.",
                    "description": "The spices will develop best when \"toasted\" for several seconds, though you need to take care not to burn them if they start to smoke. After ten seconds, add the onion, garlic, ginger, and chili (if used) and stir well to coat. Add a dash of salt with the vegetables to help them cook. If you're worried about the spice burning, add them with 2 tablespoons of water."
                },
                {
                    "headline": "While the vegetables cook, chop your greens into your desired texture.",
                    "description": "Many Northern Indian chefs (where this dish originated) only roughly chop the greens, leaving them in big chunks to enjoy. However, some western cooks prefer a smoother curry of sorts, using a blender or food processor to grind the greens up into a thick sauce of sorts. The choice is all yours. Make sure you remember to stir the vegetables while they cook -- don't let them burn!"
                },
                {
                    "headline": "Add the greens and paneer cubes once the onions are almost translucent, or slightly see-through.",
                    "description": "The onions will start to go clear in the centers. This is your cue to add the greens, stirring well and adding another dash of salt."
                },
                {
                    "headline": "Add a half teaspoon of garam masala for a warm, spiced kicked.",
                    "description": "This famous spice blend is slightly sweet, helping it balance against the chilis and garlic for a fantastically well-rounded dish. Add it now and stir in well to mix."
                },
                {
                    "headline": "Consider adding a touch of cream or yogurt if you want a creamy saag.",
                    "description": "Again, personal preference is key here. If you want a chunky, greens-heavy dish, skip the liquid. If you want a smoother, richer dish, add 1/3 cup of heavy cream, whole milk, or plain yogurt. Sour cream, in a pinch, will work as well."
                },
                {
                    "headline": "Serve hot over rice, only cooking the greens until up to heat.",
                    "description": "The greens, already blanched, don't need to cook anymore. Once you add them with the cheese, stir everything to bring it to the same heat and then serve hot with rice."
                }
            ]
        },
        {
            "name": "Crafting Homemade Paneer Cubes",
            "steps": [
                {
                    "headline": "Simmer half a gallon of milk over medium heat.",
                    "description": "Stir regularly, making sure that the milk doesn't burn. Make sure you don't use UHT pasteurized milk, as it won't curdle well. This means it cannot be used to make paneer. A heavy-bottomed pan, which holds heat well, will always make it easier to cook than a flimsy cheap saucepan. You can also use 2% milk if needed, but do not use 1% or skim milk. The fat content is too low to curdle correctly. Don't let the milk boil. If you have a candy thermometer, aim for 190-200°F"
                },
                {
                    "headline": "Add a 1/4 cup of lemon juice once the milk is steamy and frothy.",
                    "description": "Once the milk has scalded, add in your lemon juice and mix it in well. This causes the milk to curdle, which is how cheeses are formed. You can use 1/4 cup of  vinegar in place of lemon juice. However, the paneer will have a different taste, slightly, when done."
                },
                {
                    "headline": "Remove the mixture from heat, stir, and let it all sit for 10 minutes.",
                    "description": "After ten minutes, the milk should look weird, yellow, and watery. This means that the acid in the lemon is doing its work, helping break down the milk and curdle it into a cheese. If it isn't quite curdled after 10 minutes, add another pinch of lemon juice, stir, and wait."
                },
                {
                    "headline": "Place some cheesecloth in a mesh strainer, then use it to strain the liquids out of your milk mixture.",
                    "description": "You should be left with a cheesecloth full of unformed curds, or little bits of milk solids. Wrap the remains in the cheesecloth then press firmly to squeeze any last liquids out of your curds. When done, add a 1/2 teaspoon of salt to the curds to bring out their flavor."
                },
                {
                    "headline": "Keeping the cheesecloth wrapped around the curds, press the whole bunch into a rough square.",
                    "description": "Place the cloth full of curds on a cutting board and mold it into a large cube, more or less."
                },
                {
                    "headline": "Place a flat cutting board or plate on the curds, weigh it down, and wait one hour.",
                    "description": "Use a large cookbook or two to weigh the plate down, further pressing the paneer into a cube. This will compact and press the cheese into firm, edible cubes. Skipping this step often leads to an unformed, easily crumbled mess, so be sure to press the curds for at least an hour."
                },
                {
                    "headline": "Fry the edges of the paneer in hot oil until golden brown for a richer taste.",
                    "description": "This will create a lightly crisped outer texture, giving way to the soft cheese underneath. It takes a little extra time, and leads to one more pan to clean, but is a restaurant-quality touch that you can't miss. Lightly salt the cubes as they cook to bring out a stronger flavor."
                }
            ]
        }
    ],
    "tyn": [
        "Large saucepan",
        "Blender",
        "Wooden or metal spoon for stirring"
    ],
    "text": " Mastering Saag Paneer Finely chop one yellow onion, 1-2 inches of fresh ginger, and 4-5 large cloves of garlic. This dish takes place in one pan, meaning you need everything ready ahead of time to prevent burning and ensure proper cooking times. Dice the onion and mince both the garlic and ginger, setting aside for now. Optional, but recommended: If you like heat, chop up and add 2-3 green chilis here as well, setting aside with the other three. Mix up your desired spices, using cumin, turmeric, cayenne, paprika, and chili powder. The exact ratios depend on your preferences, so mix everything together in a small bowl ahead of time and take a big whiff, adding more as needed. Start with a 1/2 teaspoon of each to start, smelling and adapting as you like:\nJust use turmeric and a bit of cumin (dried seeds are best) for a simple, classic flavor. If you aren't using fresh fenugreek, a touch of dried leaves will go nicely here. If you don't have fresh ginger, 1/2 teaspoon ground ginger can be substituted here. Bring a pot of salted water to a boil and drop the greens in for 10 seconds, then drain. This is the first step of \"blanching,\" which quickly cooks the spinach without losing its color or flavor. Bring the water to a rolling boil, then drop your fresh spinach in for a brief time before draining it all out. Most saags are heavy on spinach, using mustard and fenugreek to complement the main attraction. You can make an all spinach saag, though this is technically known as \"palak paneer.\" Immediately dump the hot spinach in an ice water bath, or rise for 30 seconds under cold water. This will halt the cooking process immediately. When done, drain any excess water and squeeze the spinach dry between some paper towels. Set aside. Place 2 tablespoons ghee, butter, or oil in a large saucepan over medium heat. Heat until the oil is hot. Ghee (clarified butter) is the preferred choice for Indian chefs, but regular butter or canola oil will do fine without ruing the flavor. Toss in your spice mixture, cooking for only 10-20 seconds, then toss in the chopped vegetables. The spices will develop best when \"toasted\" for several seconds, though you need to take care not to burn them if they start to smoke. After ten seconds, add the onion, garlic, ginger, and chili (if used) and stir well to coat. Add a dash of salt with the vegetables to help them cook. If you're worried about the spice burning, add them with 2 tablespoons of water. While the vegetables cook, chop your greens into your desired texture. Many Northern Indian chefs (where this dish originated) only roughly chop the greens, leaving them in big chunks to enjoy. However, some western cooks prefer a smoother curry of sorts, using a blender or food processor to grind the greens up into a thick sauce of sorts. The choice is all yours. Make sure you remember to stir the vegetables while they cook -- don't let them burn! Add the greens and paneer cubes once the onions are almost translucent, or slightly see-through. The onions will start to go clear in the centers. This is your cue to add the greens, stirring well and adding another dash of salt. Add a half teaspoon of garam masala for a warm, spiced kicked. This famous spice blend is slightly sweet, helping it balance against the chilis and garlic for a fantastically well-rounded dish. Add it now and stir in well to mix. Consider adding a touch of cream or yogurt if you want a creamy saag. Again, personal preference is key here. If you want a chunky, greens-heavy dish, skip the liquid. If you want a smoother, richer dish, add 1/3 cup of heavy cream, whole milk, or plain yogurt. Sour cream, in a pinch, will work as well. Serve hot over rice, only cooking the greens until up to heat. The greens, already blanched, don't need to cook anymore. Once you add them with the cheese, stir everything to bring it to the same heat and then serve hot with rice. Crafting Homemade Paneer Cubes Simmer half a gallon of milk over medium heat. Stir regularly, making sure that the milk doesn't burn. Make sure you don't use UHT pasteurized milk, as it won't curdle well. This means it cannot be used to make paneer. A heavy-bottomed pan, which holds heat well, will always make it easier to cook than a flimsy cheap saucepan. You can also use 2% milk if needed, but do not use 1% or skim milk. The fat content is too low to curdle correctly. Don't let the milk boil. If you have a candy thermometer, aim for 190-200°F Add a 1/4 cup of lemon juice once the milk is steamy and frothy. Once the milk has scalded, add in your lemon juice and mix it in well. This causes the milk to curdle, which is how cheeses are formed. You can use 1/4 cup of  vinegar in place of lemon juice. However, the paneer will have a different taste, slightly, when done. Remove the mixture from heat, stir, and let it all sit for 10 minutes. After ten minutes, the milk should look weird, yellow, and watery. This means that the acid in the lemon is doing its work, helping break down the milk and curdle it into a cheese. If it isn't quite curdled after 10 minutes, add another pinch of lemon juice, stir, and wait. Place some cheesecloth in a mesh strainer, then use it to strain the liquids out of your milk mixture. You should be left with a cheesecloth full of unformed curds, or little bits of milk solids. Wrap the remains in the cheesecloth then press firmly to squeeze any last liquids out of your curds. When done, add a 1/2 teaspoon of salt to the curds to bring out their flavor. Keeping the cheesecloth wrapped around the curds, press the whole bunch into a rough square. Place the cloth full of curds on a cutting board and mold it into a large cube, more or less. Place a flat cutting board or plate on the curds, weigh it down, and wait one hour. Use a large cookbook or two to weigh the plate down, further pressing the paneer into a cube. This will compact and press the cheese into firm, edible cubes. Skipping this step often leads to an unformed, easily crumbled mess, so be sure to press the curds for at least an hour. Fry the edges of the paneer in hot oil until golden brown for a richer taste. This will create a lightly crisped outer texture, giving way to the soft cheese underneath. It takes a little extra time, and leads to one more pan to clean, but is a restaurant-quality touch that you can't miss. Lightly salt the cubes as they cook to bring out a stronger flavor.",
    "sentences": [
        " Mastering Saag Paneer Finely chop one yellow onion, 1-2 inches of fresh ginger, and 4-5 large cloves of garlic.",
        "This dish takes place in one pan, meaning you need everything ready ahead of time to prevent burning and ensure proper cooking times.",
        "Dice the onion and mince both the garlic and ginger, setting aside for now.",
        "Optional, but recommended: If you like heat, chop up and add 2-3 green chilis here as well, setting aside with the other three.",
        "Mix up your desired spices, using cumin, turmeric, cayenne, paprika, and chili powder.",
        "The exact ratios depend on your preferences, so mix everything together in a small bowl ahead of time and take a big whiff, adding more as needed.",
        "Start with a 1/2 teaspoon of each to start, smelling and adapting as you like:\nJust use turmeric and a bit of cumin (dried seeds are best) for a simple, classic flavor.",
        "If you aren't using fresh fenugreek, a touch of dried leaves will go nicely here.",
        "If you don't have fresh ginger, 1/2 teaspoon ground ginger can be substituted here.",
        "Bring a pot of salted water to a boil and drop the greens in for 10 seconds, then drain.",
        "This is the first step of \"blanching,\" which quickly cooks the spinach without losing its color or flavor.",
        "Bring the water to a rolling boil, then drop your fresh spinach in for a brief time before draining it all out.",
        "Most saags are heavy on spinach, using mustard and fenugreek to complement the main attraction.",
        "You can make an all spinach saag, though this is technically known as \"palak paneer.\"",
        "Immediately dump the hot spinach in an ice water bath, or rise for 30 seconds under cold water.",
        "This will halt the cooking process immediately.",
        "When done, drain any excess water and squeeze the spinach dry between some paper towels.",
        "Set aside.",
        "Place 2 tablespoons ghee, butter, or oil in a large saucepan over medium heat.",
        "Heat until the oil is hot.",
        "Ghee (clarified butter) is the preferred choice for Indian chefs, but regular butter or canola oil will do fine without ruing the flavor.",
        "Toss in your spice mixture, cooking for only 10-20 seconds, then toss in the chopped vegetables.",
        "The spices will develop best when \"toasted\" for several seconds, though you need to take care not to burn them if they start to smoke.",
        "After ten seconds, add the onion, garlic, ginger, and chili (if used) and stir well to coat.",
        "Add a dash of salt with the vegetables to help them cook.",
        "If you're worried about the spice burning, add them with 2 tablespoons of water.",
        "While the vegetables cook, chop your greens into your desired texture.",
        "Many Northern Indian chefs (where this dish originated) only roughly chop the greens, leaving them in big chunks to enjoy.",
        "However, some western cooks prefer a smoother curry of sorts, using a blender or food processor to grind the greens up into a thick sauce of sorts.",
        "The choice is all yours.",
        "Make sure you remember to stir the vegetables while they cook -- don't let them burn!",
        "Add the greens and paneer cubes once the onions are almost translucent, or slightly see-through.",
        "The onions will start to go clear in the centers.",
        "This is your cue to add the greens, stirring well and adding another dash of salt.",
        "Add a half teaspoon of garam masala for a warm, spiced kicked.",
        "This famous spice blend is slightly sweet, helping it balance against the chilis and garlic for a fantastically well-rounded dish.",
        "Add it now and stir in well to mix.",
        "Consider adding a touch of cream or yogurt if you want a creamy saag.",
        "Again, personal preference is key here.",
        "If you want a chunky, greens-heavy dish, skip the liquid.",
        "If you want a smoother, richer dish, add 1/3 cup of heavy cream, whole milk, or plain yogurt.",
        "Sour cream, in a pinch, will work as well.",
        "Serve hot over rice, only cooking the greens until up to heat.",
        "The greens, already blanched, don't need to cook anymore.",
        "Once you add them with the cheese, stir everything to bring it to the same heat and then serve hot with rice.",
        "Crafting Homemade Paneer Cubes Simmer half a gallon of milk over medium heat.",
        "Stir regularly, making sure that the milk doesn't burn.",
        "Make sure you don't use UHT pasteurized milk, as it won't curdle well.",
        "This means it cannot be used to make paneer.",
        "A heavy-bottomed pan, which holds heat well, will always make it easier to cook than a flimsy cheap saucepan.",
        "You can also use 2% milk if needed, but do not use 1% or skim milk.",
        "The fat content is too low to curdle correctly.",
        "Don't let the milk boil.",
        "If you have a candy thermometer, aim for 190-200°F Add a 1/4 cup of lemon juice once the milk is steamy and frothy.",
        "Once the milk has scalded, add in your lemon juice and mix it in well.",
        "This causes the milk to curdle, which is how cheeses are formed.",
        "You can use 1/4 cup of  vinegar in place of lemon juice.",
        "However, the paneer will have a different taste, slightly, when done.",
        "Remove the mixture from heat, stir, and let it all sit for 10 minutes.",
        "After ten minutes, the milk should look weird, yellow, and watery.",
        "This means that the acid in the lemon is doing its work, helping break down the milk and curdle it into a cheese.",
        "If it isn't quite curdled after 10 minutes, add another pinch of lemon juice, stir, and wait.",
        "Place some cheesecloth in a mesh strainer, then use it to strain the liquids out of your milk mixture.",
        "You should be left with a cheesecloth full of unformed curds, or little bits of milk solids.",
        "Wrap the remains in the cheesecloth then press firmly to squeeze any last liquids out of your curds.",
        "When done, add a 1/2 teaspoon of salt to the curds to bring out their flavor.",
        "Keeping the cheesecloth wrapped around the curds, press the whole bunch into a rough square.",
        "Place the cloth full of curds on a cutting board and mold it into a large cube, more or less.",
        "Place a flat cutting board or plate on the curds, weigh it down, and wait one hour.",
        "Use a large cookbook or two to weigh the plate down, further pressing the paneer into a cube.",
        "This will compact and press the cheese into firm, edible cubes.",
        "Skipping this step often leads to an unformed, easily crumbled mess, so be sure to press the curds for at least an hour.",
        "Fry the edges of the paneer in hot oil until golden brown for a richer taste.",
        "This will create a lightly crisped outer texture, giving way to the soft cheese underneath.",
        "It takes a little extra time, and leads to one more pan to clean, but is a restaurant-quality touch that you can't miss.",
        "Lightly salt the cubes as they cook to bring out a stronger flavor."
    ]
}