{
    "title": "How to Drink a Tequila Shot",
    "url": "https://www.wikihow.com/Drink-a-Tequila-Shot",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Alcoholic Drinks",
        "Spirits and Liqueurs"
    ],
    "methods": [
        {
            "name": "American Style with Lime or Lemon",
            "steps": [
                {
                    "headline": "Lick the skin between your thumb and forefinger or the back of your hand.",
                    "description": ""
                },
                {
                    "headline": "Sprinkle a small pinch of salt onto the area.",
                    "description": "The saliva will help it stick."
                },
                {
                    "headline": "Hold one slice of lime/lemon with your thumb and index finger, using the same hand that contains the salt.",
                    "description": ""
                },
                {
                    "headline": "Breathe out, lick the salt, down your tequila shot and bite the lime.",
                    "description": "Some people prefer biting the lime before they breathe in, so they don't taste the liquor as much. When you drink the shot, throw your head back and try to swallow all of the tequila in one gulp. You are taking a shot, after all. Try using pineapple juice as a chaser to the tequila instead of a lime. Enjoy the shot of tequila but before taking a breath, drink the pineapple juice. It will cut the taste of the liquor."
                }
            ]
        },
        {
            "name": "Mexican Style with Sangrita",
            "steps": [
                {
                    "headline": "Prepare the Sangrita you'll enjoy along with your tequila.",
                    "description": "\"Sangrita\" means \"little blood\" in Spanish, called this way because of the color of the liquid. The Sangrita is non-alcoholic. In a separate cup, mix together and refrigerate:\n1 cup fresh-squeezed orange juice\n1 oz fresh-squeezed lime juice\n1 tsp grenadine\n12 dashes hot sauce (Cholula is best)"
                },
                {
                    "headline": "Portion out the sangrita so that each shot of tequila is paired with a shot of sangrita.",
                    "description": ""
                },
                {
                    "headline": "Serve sangrita with tequila blanco.",
                    "description": "Traditionally, this is what sangrita is served with, although tequila reposado can also pair with sangrita."
                },
                {
                    "headline": "Sip, don't shoot, the tequila and sangrita.",
                    "description": "Native Mexicans tend not to shoot their tequila, preferring instead to sip it."
                },
                {
                    "headline": "Pair the sangrita and tequila with a shot of lime juice for \"The Mexican Flag.\"",
                    "description": "This combination gets its name because the three shots each represent one color of the Mexican flag — red, white, and green."
                }
            ]
        }
    ],
    "tyn": [
        "One shot glass",
        "One shot of tequila",
        "Slice of lemon or lime",
        "Small quantity of sea salt",
        "Courage",
        "Sangrita",
        "1 cup fresh-squeezed orange juice",
        "1 oz fresh-squeezed lime juice",
        "1 tsp grenadine",
        "12 dashes hot sauce (Cholula is best)"
    ],
    "text": " American Style with Lime or Lemon Lick the skin between your thumb and forefinger or the back of your hand.  Sprinkle a small pinch of salt onto the area. The saliva will help it stick. Hold one slice of lime/lemon with your thumb and index finger, using the same hand that contains the salt.  Breathe out, lick the salt, down your tequila shot and bite the lime. Some people prefer biting the lime before they breathe in, so they don't taste the liquor as much. When you drink the shot, throw your head back and try to swallow all of the tequila in one gulp. You are taking a shot, after all. Try using pineapple juice as a chaser to the tequila instead of a lime. Enjoy the shot of tequila but before taking a breath, drink the pineapple juice. It will cut the taste of the liquor. Mexican Style with Sangrita Prepare the Sangrita you'll enjoy along with your tequila. \"Sangrita\" means \"little blood\" in Spanish, called this way because of the color of the liquid. The Sangrita is non-alcoholic. In a separate cup, mix together and refrigerate:\n1 cup fresh-squeezed orange juice\n1 oz fresh-squeezed lime juice\n1 tsp grenadine\n12 dashes hot sauce (Cholula is best) Portion out the sangrita so that each shot of tequila is paired with a shot of sangrita.  Serve sangrita with tequila blanco. Traditionally, this is what sangrita is served with, although tequila reposado can also pair with sangrita. Sip, don't shoot, the tequila and sangrita. Native Mexicans tend not to shoot their tequila, preferring instead to sip it. Pair the sangrita and tequila with a shot of lime juice for \"The Mexican Flag.\" This combination gets its name because the three shots each represent one color of the Mexican flag — red, white, and green.",
    "sentences": [
        " American Style with Lime or Lemon Lick the skin between your thumb and forefinger or the back of your hand.",
        "Sprinkle a small pinch of salt onto the area.",
        "The saliva will help it stick.",
        "Hold one slice of lime/lemon with your thumb and index finger, using the same hand that contains the salt.",
        "Breathe out, lick the salt, down your tequila shot and bite the lime.",
        "Some people prefer biting the lime before they breathe in, so they don't taste the liquor as much.",
        "When you drink the shot, throw your head back and try to swallow all of the tequila in one gulp.",
        "You are taking a shot, after all.",
        "Try using pineapple juice as a chaser to the tequila instead of a lime.",
        "Enjoy the shot of tequila but before taking a breath, drink the pineapple juice.",
        "It will cut the taste of the liquor.",
        "Mexican Style with Sangrita Prepare the Sangrita you'll enjoy along with your tequila.",
        "\"Sangrita\" means \"little blood\" in Spanish, called this way because of the color of the liquid.",
        "The Sangrita is non-alcoholic.",
        "In a separate cup, mix together and refrigerate:\n1 cup fresh-squeezed orange juice\n1 oz fresh-squeezed lime juice\n1 tsp grenadine\n12 dashes hot sauce (Cholula is best) Portion out the sangrita so that each shot of tequila is paired with a shot of sangrita.",
        "Serve sangrita with tequila blanco.",
        "Traditionally, this is what sangrita is served with, although tequila reposado can also pair with sangrita.",
        "Sip, don't shoot, the tequila and sangrita.",
        "Native Mexicans tend not to shoot their tequila, preferring instead to sip it.",
        "Pair the sangrita and tequila with a shot of lime juice for \"The Mexican Flag.\"",
        "This combination gets its name because the three shots each represent one color of the Mexican flag — red, white, and green."
    ]
}