{
    "title": "How to Make Solid Perfume",
    "url": "https://www.wikihow.com/Make-Solid-Perfume",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Handmade Cosmetics"
    ],
    "parts": [
        {
            "name": "Creating a Scent",
            "steps": [
                {
                    "headline": "Mix your essential oils in a small dish to try out your scent.",
                    "description": "Before you dedicate an entire dish of perfume to one smell, you might want to test it to see if you like it first. Grab a small dish and use it to test out different scent combinations until you find one that you like.Ramekins are a great size for this, but you can use any small container that you have on-hand."
                },
                {
                    "headline": "Pick 25 drops of a sharp-smelling essential oil as a base note.",
                    "description": "Base notes are slow to evaporate and will be a long-lasting scent in your perfume. You can pick cedarwood, frankincense, ginger, jasmine, or vanilla for this note. Pour in 25 drops of your choice as a base.You need the most of your base note so it sticks around on your skin the longest."
                },
                {
                    "headline": "Add 5 to 10 drops of a middle note that doesn’t last as long.",
                    "description": "Lavender, lemongrass, orange, and rosemary all make great middle notes. These scents won’t last quite as long and help to support the base note.Tip: Use more or less essential oil depending on how strong you want to make your perfume."
                },
                {
                    "headline": "Choose 3 to 5 drops of a top note that’s uplifting.",
                    "description": "Top notes are what you’ll smell first, but they’ll also go away super quickly. Choose from grapefruit, juniper, lime, pine, and tangerine as a short but sweet top note.Pick sandalwood, lavender, and rosehip for a sweet and subtle perfume. Combine frankincense, rosemary, and bergamot for a heartier scent that’s more cologne-like. Mix jasmine, rose, and cedar essential oil for a spicy perfume."
                }
            ]
        },
        {
            "name": "Combining Your Ingredients",
            "steps": [
                {
                    "headline": "Put a glass bowl in a saucepan half full of water over medium heat.",
                    "description": "Grab a large saucepan and fill it up with water from your tap so it’s about half full. Place a glass bowl in the center of the saucepan and turn the stove to medium to create a double boiler.Beeswax doesn’t melt down well in the microwave, and you probably won’t get an even, smooth mixture. The stovetop is your best bet."
                },
                {
                    "headline": "Pour your beeswax and carrier oil into the glass bowl and let it melt.",
                    "description": "Carrier oil is a fragrance-free oil that will thin out the beeswax. Add 2 tablespoons (30 mL) of beeswax and 2 tablespoons (30 mL) of your carrier oil, then let them melt down for 2 to 3 minutes. You can use almond oil, jojoba oil, grapeseed oil, or olive oil for your carrier oil."
                },
                {
                    "headline": "Grab your bowl off the heat and stir it with a wooden stirrer.",
                    "description": "Use oven mitts and carefully take your glass bowl off the sauce pan. Use a wooden stick to combine the wax and the oil together until they look smooth and shiny.Your wooden stick will get wax on it, so don’t use anything that you’d like to cook with later on."
                },
                {
                    "headline": "Add in your essential oils and stir them in.",
                    "description": "Gently pour your essential oil mixture into the wax and oil, then use your wooden stirrer to combine all of your ingredients. Try not to spend too long on this, or the wax could start to harden up.The essential oil will probably smell really intense at first, but that’s okay! It will spread out in the wax mixture."
                },
                {
                    "headline": "Pour the perfume mixture into your containers.",
                    "description": "Pick out a few small containers that can be sealed with a lid to store your perfume. Carefully pour a small amount into each container, being careful not to spill any of the wax.Warning: The wax will still be super hot. If you get any on your hands, rinse it off right away to avoid a burn. You can use empty mint tins as a cute way to store your perfume."
                },
                {
                    "headline": "Let the wax harden for 1 to 2 hours.",
                    "description": "Once your mixture hardens, you now have perfume! You can give some of the containers away as a gift or keep them all for yourself to stock up on a great scent.Don’t use your perfume until it’s fully dry, or you could burn yourself."
                }
            ]
        },
        {
            "name": "Using and Storing the Perfume",
            "steps": [
                {
                    "headline": "Rub a cotton swab or your finger over the perfume.",
                    "description": "You don’t need to press down very hard to pick up the scent of your perfume. Gently dab your finger or a cotton swab onto the waxy surface until you see a slight indent in the perfume. Tip: You may need to rub the perfume between your fingers for a few seconds to warm it up. The more perfume you pick up, the stronger the scent will be."
                },
                {
                    "headline": "Dab the perfume onto your wrists and behind your ears.",
                    "description": "Perfume smells the best and lasts the longest on your wrists, your neck, and right behind your ears. Gently rub it into your skin for a soothing, pleasant aroma.Solid perfume isn’t quite as strong as liquid perfume, so you don’t have to worry about applying too much."
                },
                {
                    "headline": "Store your perfume in a cool, dry place for 6 to 12 months.",
                    "description": "Keep a lid on your perfume container whenever you aren’t using it. If you used grapeseed as a carrier, use your perfume within 6 months. If you used olive oil, jojoba oil, or almond oil, you can keep it around for 12 months.Grapeseed oil breaks down faster than other types of oil, which is why it doesn’t stay as fresh."
                }
            ]
        }
    ],
    "tyn": [
        "Small dish",
        "Saucepan",
        "Glass bowl",
        "Wooden stirrer",
        "Small containers with lids"
    ],
    "text": " Creating a Scent Mix your essential oils in a small dish to try out your scent. Before you dedicate an entire dish of perfume to one smell, you might want to test it to see if you like it first. Grab a small dish and use it to test out different scent combinations until you find one that you like.Ramekins are a great size for this, but you can use any small container that you have on-hand. Pick 25 drops of a sharp-smelling essential oil as a base note. Base notes are slow to evaporate and will be a long-lasting scent in your perfume. You can pick cedarwood, frankincense, ginger, jasmine, or vanilla for this note. Pour in 25 drops of your choice as a base.You need the most of your base note so it sticks around on your skin the longest. Add 5 to 10 drops of a middle note that doesn’t last as long. Lavender, lemongrass, orange, and rosemary all make great middle notes. These scents won’t last quite as long and help to support the base note.Tip: Use more or less essential oil depending on how strong you want to make your perfume. Choose 3 to 5 drops of a top note that’s uplifting. Top notes are what you’ll smell first, but they’ll also go away super quickly. Choose from grapefruit, juniper, lime, pine, and tangerine as a short but sweet top note.Pick sandalwood, lavender, and rosehip for a sweet and subtle perfume. Combine frankincense, rosemary, and bergamot for a heartier scent that’s more cologne-like. Mix jasmine, rose, and cedar essential oil for a spicy perfume. Combining Your Ingredients Put a glass bowl in a saucepan half full of water over medium heat. Grab a large saucepan and fill it up with water from your tap so it’s about half full. Place a glass bowl in the center of the saucepan and turn the stove to medium to create a double boiler.Beeswax doesn’t melt down well in the microwave, and you probably won’t get an even, smooth mixture. The stovetop is your best bet. Pour your beeswax and carrier oil into the glass bowl and let it melt. Carrier oil is a fragrance-free oil that will thin out the beeswax. Add 2 tablespoons (30 mL) of beeswax and 2 tablespoons (30 mL) of your carrier oil, then let them melt down for 2 to 3 minutes. You can use almond oil, jojoba oil, grapeseed oil, or olive oil for your carrier oil. Grab your bowl off the heat and stir it with a wooden stirrer. Use oven mitts and carefully take your glass bowl off the sauce pan. Use a wooden stick to combine the wax and the oil together until they look smooth and shiny.Your wooden stick will get wax on it, so don’t use anything that you’d like to cook with later on. Add in your essential oils and stir them in. Gently pour your essential oil mixture into the wax and oil, then use your wooden stirrer to combine all of your ingredients. Try not to spend too long on this, or the wax could start to harden up.The essential oil will probably smell really intense at first, but that’s okay! It will spread out in the wax mixture. Pour the perfume mixture into your containers. Pick out a few small containers that can be sealed with a lid to store your perfume. Carefully pour a small amount into each container, being careful not to spill any of the wax.Warning: The wax will still be super hot. If you get any on your hands, rinse it off right away to avoid a burn. You can use empty mint tins as a cute way to store your perfume. Let the wax harden for 1 to 2 hours. Once your mixture hardens, you now have perfume! You can give some of the containers away as a gift or keep them all for yourself to stock up on a great scent.Don’t use your perfume until it’s fully dry, or you could burn yourself. Using and Storing the Perfume Rub a cotton swab or your finger over the perfume. You don’t need to press down very hard to pick up the scent of your perfume. Gently dab your finger or a cotton swab onto the waxy surface until you see a slight indent in the perfume. Tip: You may need to rub the perfume between your fingers for a few seconds to warm it up. The more perfume you pick up, the stronger the scent will be. Dab the perfume onto your wrists and behind your ears. Perfume smells the best and lasts the longest on your wrists, your neck, and right behind your ears. Gently rub it into your skin for a soothing, pleasant aroma.Solid perfume isn’t quite as strong as liquid perfume, so you don’t have to worry about applying too much. Store your perfume in a cool, dry place for 6 to 12 months. Keep a lid on your perfume container whenever you aren’t using it. If you used grapeseed as a carrier, use your perfume within 6 months. If you used olive oil, jojoba oil, or almond oil, you can keep it around for 12 months.Grapeseed oil breaks down faster than other types of oil, which is why it doesn’t stay as fresh.",
    "sentences": [
        " Creating a Scent Mix your essential oils in a small dish to try out your scent.",
        "Before you dedicate an entire dish of perfume to one smell, you might want to test it to see if you like it first.",
        "Grab a small dish and use it to test out different scent combinations until you find one that you like.Ramekins are a great size for this, but you can use any small container that you have on-hand.",
        "Pick 25 drops of a sharp-smelling essential oil as a base note.",
        "Base notes are slow to evaporate and will be a long-lasting scent in your perfume.",
        "You can pick cedarwood, frankincense, ginger, jasmine, or vanilla for this note.",
        "Pour in 25 drops of your choice as a base.You need the most of your base note so it sticks around on your skin the longest.",
        "Add 5 to 10 drops of a middle note that doesn’t last as long.",
        "Lavender, lemongrass, orange, and rosemary all make great middle notes.",
        "These scents won’t last quite as long and help to support the base note.Tip: Use more or less essential oil depending on how strong you want to make your perfume.",
        "Choose 3 to 5 drops of a top note that’s uplifting.",
        "Top notes are what you’ll smell first, but they’ll also go away super quickly.",
        "Choose from grapefruit, juniper, lime, pine, and tangerine as a short but sweet top note.Pick sandalwood, lavender, and rosehip for a sweet and subtle perfume.",
        "Combine frankincense, rosemary, and bergamot for a heartier scent that’s more cologne-like.",
        "Mix jasmine, rose, and cedar essential oil for a spicy perfume.",
        "Combining Your Ingredients Put a glass bowl in a saucepan half full of water over medium heat.",
        "Grab a large saucepan and fill it up with water from your tap so it’s about half full.",
        "Place a glass bowl in the center of the saucepan and turn the stove to medium to create a double boiler.Beeswax doesn’t melt down well in the microwave, and you probably won’t get an even, smooth mixture.",
        "The stovetop is your best bet.",
        "Pour your beeswax and carrier oil into the glass bowl and let it melt.",
        "Carrier oil is a fragrance-free oil that will thin out the beeswax.",
        "Add 2 tablespoons (30 mL) of beeswax and 2 tablespoons (30 mL) of your carrier oil, then let them melt down for 2 to 3 minutes.",
        "You can use almond oil, jojoba oil, grapeseed oil, or olive oil for your carrier oil.",
        "Grab your bowl off the heat and stir it with a wooden stirrer.",
        "Use oven mitts and carefully take your glass bowl off the sauce pan.",
        "Use a wooden stick to combine the wax and the oil together until they look smooth and shiny.Your wooden stick will get wax on it, so don’t use anything that you’d like to cook with later on.",
        "Add in your essential oils and stir them in.",
        "Gently pour your essential oil mixture into the wax and oil, then use your wooden stirrer to combine all of your ingredients.",
        "Try not to spend too long on this, or the wax could start to harden up.The essential oil will probably smell really intense at first, but that’s okay!",
        "It will spread out in the wax mixture.",
        "Pour the perfume mixture into your containers.",
        "Pick out a few small containers that can be sealed with a lid to store your perfume.",
        "Carefully pour a small amount into each container, being careful not to spill any of the wax.Warning: The wax will still be super hot.",
        "If you get any on your hands, rinse it off right away to avoid a burn.",
        "You can use empty mint tins as a cute way to store your perfume.",
        "Let the wax harden for 1 to 2 hours.",
        "Once your mixture hardens, you now have perfume!",
        "You can give some of the containers away as a gift or keep them all for yourself to stock up on a great scent.Don’t use your perfume until it’s fully dry, or you could burn yourself.",
        "Using and Storing the Perfume Rub a cotton swab or your finger over the perfume.",
        "You don’t need to press down very hard to pick up the scent of your perfume.",
        "Gently dab your finger or a cotton swab onto the waxy surface until you see a slight indent in the perfume.",
        "Tip: You may need to rub the perfume between your fingers for a few seconds to warm it up.",
        "The more perfume you pick up, the stronger the scent will be.",
        "Dab the perfume onto your wrists and behind your ears.",
        "Perfume smells the best and lasts the longest on your wrists, your neck, and right behind your ears.",
        "Gently rub it into your skin for a soothing, pleasant aroma.Solid perfume isn’t quite as strong as liquid perfume, so you don’t have to worry about applying too much.",
        "Store your perfume in a cool, dry place for 6 to 12 months.",
        "Keep a lid on your perfume container whenever you aren’t using it.",
        "If you used grapeseed as a carrier, use your perfume within 6 months.",
        "If you used olive oil, jojoba oil, or almond oil, you can keep it around for 12 months.Grapeseed oil breaks down faster than other types of oil, which is why it doesn’t stay as fresh."
    ]
}