{
    "title": "How to Be a Better Cheerleader",
    "url": "https://www.wikihow.com/Be-a-Better-Cheerleader",
    "category_hierarchy": [
        "Sports and Fitness",
        "Team Sports",
        "Cheerleading"
    ],
    "methods": [
        {
            "name": "Performance and Physicality",
            "steps": [
                {
                    "headline": "Stretch!",
                    "description": "Whatever stretches your coach has you do at the beginning of practice, do at home 1-2 times per day (splits, etc..) If you are a flyer, stretch your scorpion and heel stretch/bow and arrow. Over time, you will see a huge improvement!"
                },
                {
                    "headline": "Improve your basics!",
                    "description": "Handstands, bridges, back handsprings, and back bends will help you with more difficult tumbling. It's true! Learn how to fall the right way. Believe it or not, there is a right way of falling! If you're falling backwards, don't just freak out or twist; just do a safety roll, which is just almost doing a backwards roll, but not rolling and just stopping with your hands above your head. If you're falling forwards, tuck your chin in, extend your arms above your head, and roll. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f4\\/Be-a-Better-Cheerleader-Step-20.jpg\\/v4-460px-Be-a-Better-Cheerleader-Step-20.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f4\\/Be-a-Better-Cheerleader-Step-20.jpg\\/v4-760px-Be-a-Better-Cheerleader-Step-20.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
                },
                {
                    "headline": "Improve your jumps.",
                    "description": "Remember to keep tight and squeeze your body the entire time. If you're sloppy, you can get hurt. A good way to improve your jumps is to practice the position of the jump you want to become better at when you're just sitting down watching TV or on the computer. For further improvement, buy a pair of ankle weights (about 1 to 2 pounds each is good). While wearing them, do \"leg lifts\" - sit in a straddle, put your hands in front of you, and lift your right leg 10 times without letting it touch the ground in between each lift. Do the same with your left leg, and then with both legs at the same time. It's important that you keep your hands in front of you and don't let your legs touch the ground in between each lift. Do this every day and your jumps will be much better! {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/9c\\/Be-a-Better-Cheerleader-Step-13.jpg\\/v4-460px-Be-a-Better-Cheerleader-Step-13.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/9c\\/Be-a-Better-Cheerleader-Step-13.jpg\\/v4-760px-Be-a-Better-Cheerleader-Step-13.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
                },
                {
                    "headline": "Take tumbling.",
                    "description": "Tumbling is extremely beneficial to an aspiring cheerleader. A couple of benefits of tumbling are learning how to have better tumbling passes, helping with jumps, and needed exercise."
                },
                {
                    "headline": "Work on your arm motions.",
                    "description": "When cheering, your motions should be sharp, not wild and uncontrolled. Shoot your arm motions, and make sure your arms aren't sloppy. Squeeze your arms at all times."
                },
                {
                    "headline": "Work out every day!",
                    "description": "Being strong will help your tumbling, jumps, stunts, and everything else. Practice makes permanent, so even when you practice, fix every possible mistake."
                },
                {
                    "headline": "Buy equipment to practice at home (don't do anything too dangerous, though).",
                    "description": "If you're working on back handsprings, barrels will really help."
                }
            ]
        },
        {
            "name": "Attitude and Appearance",
            "steps": [
                {
                    "headline": "Pay attention to your appearance.",
                    "description": "If you don't take yourself seriously and look like a mess, why should other people take you seriously? Wear clothes that fit you, not ones that are too tight or too baggy. The best choice for cheer clothes are soft shorts and a T-shirt or tank top. Wear your hair up - ponytails are ideal. Not only does it look pretty, but it also keeps the hair out of your face while cheering. Never wear jewelry! It can get caught, snagged or ripped, and that hurts."
                },
                {
                    "headline": "Be loud!",
                    "description": "Don't be afraid to yell! However, don't start screaming. You will stand out to the coach if they can hear you over everyone else. Remember to shout loudly and say the words clearly."
                },
                {
                    "headline": "Have confidence.",
                    "description": "If you don't make it the first time, keep practicing and trying. If you do make it, then don't think, \"Gee, I'm the best.\" Obviously you have skill if you've made the team, but no one (including the coaches) will want to deal with that kind of attitude, and it can affect you next tryout season."
                },
                {
                    "headline": "Be Positive!",
                    "description": "Always have a positive attitude! Always believe in yourself. If you believe in yourself, you will succeed!"
                },
                {
                    "headline": "Don't let your personal life interfere.",
                    "description": ""
                },
                {
                    "headline": "Never, ever give up!",
                    "description": ""
                },
                {
                    "headline": "If you want to work on one specific skill, take private lessons.",
                    "description": ""
                },
                {
                    "headline": "Try your best, even at your practice.",
                    "description": "You perform what you practice, and if you practice not trying, or saying it's too hard, you won't perform as well. As as long as you can say \"I gave 100%,\" your coach will be happy."
                },
                {
                    "headline": "Be kind.",
                    "description": "This step is another important one. When you watch movies, you may see cheerleaders being stuck up and rude but in reality, that's not how a cheerleader should be. If you're an awesome cheerleader, you will have respect for yourself and others. Don't pick on the new guy or people lower than you. That`s not cool even though your friends do it. A cheerleader is nice to everyone, and being nice means being nice to your team members too.Ask questions, ask your coach for things they are looking for also ask for previous routines and tapes."
                },
                {
                    "headline": "Befriend a former cheerleader.",
                    "description": "Ask someone who's been on the team in previous years, preferably Varsity cheerleaders with more experience."
                }
            ]
        }
    ],
    "tyn": [
        "Smiles",
        "A team",
        "The basics"
    ],
    "text": " Performance and Physicality Stretch! Whatever stretches your coach has you do at the beginning of practice, do at home 1-2 times per day (splits, etc..) If you are a flyer, stretch your scorpion and heel stretch/bow and arrow. Over time, you will see a huge improvement! Improve your basics! Handstands, bridges, back handsprings, and back bends will help you with more difficult tumbling. It's true! Learn how to fall the right way. Believe it or not, there is a right way of falling! If you're falling backwards, don't just freak out or twist; just do a safety roll, which is just almost doing a backwards roll, but not rolling and just stopping with your hands above your head. If you're falling forwards, tuck your chin in, extend your arms above your head, and roll. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f4\\/Be-a-Better-Cheerleader-Step-20.jpg\\/v4-460px-Be-a-Better-Cheerleader-Step-20.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f4\\/Be-a-Better-Cheerleader-Step-20.jpg\\/v4-760px-Be-a-Better-Cheerleader-Step-20.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Improve your jumps. Remember to keep tight and squeeze your body the entire time. If you're sloppy, you can get hurt. A good way to improve your jumps is to practice the position of the jump you want to become better at when you're just sitting down watching TV or on the computer. For further improvement, buy a pair of ankle weights (about 1 to 2 pounds each is good). While wearing them, do \"leg lifts\" - sit in a straddle, put your hands in front of you, and lift your right leg 10 times without letting it touch the ground in between each lift. Do the same with your left leg, and then with both legs at the same time. It's important that you keep your hands in front of you and don't let your legs touch the ground in between each lift. Do this every day and your jumps will be much better! {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/9c\\/Be-a-Better-Cheerleader-Step-13.jpg\\/v4-460px-Be-a-Better-Cheerleader-Step-13.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/9c\\/Be-a-Better-Cheerleader-Step-13.jpg\\/v4-760px-Be-a-Better-Cheerleader-Step-13.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Take tumbling. Tumbling is extremely beneficial to an aspiring cheerleader. A couple of benefits of tumbling are learning how to have better tumbling passes, helping with jumps, and needed exercise. Work on your arm motions. When cheering, your motions should be sharp, not wild and uncontrolled. Shoot your arm motions, and make sure your arms aren't sloppy. Squeeze your arms at all times. Work out every day! Being strong will help your tumbling, jumps, stunts, and everything else. Practice makes permanent, so even when you practice, fix every possible mistake. Buy equipment to practice at home (don't do anything too dangerous, though). If you're working on back handsprings, barrels will really help. Attitude and Appearance Pay attention to your appearance. If you don't take yourself seriously and look like a mess, why should other people take you seriously? Wear clothes that fit you, not ones that are too tight or too baggy. The best choice for cheer clothes are soft shorts and a T-shirt or tank top. Wear your hair up - ponytails are ideal. Not only does it look pretty, but it also keeps the hair out of your face while cheering. Never wear jewelry! It can get caught, snagged or ripped, and that hurts. Be loud! Don't be afraid to yell! However, don't start screaming. You will stand out to the coach if they can hear you over everyone else. Remember to shout loudly and say the words clearly. Have confidence. If you don't make it the first time, keep practicing and trying. If you do make it, then don't think, \"Gee, I'm the best.\" Obviously you have skill if you've made the team, but no one (including the coaches) will want to deal with that kind of attitude, and it can affect you next tryout season. Be Positive! Always have a positive attitude! Always believe in yourself. If you believe in yourself, you will succeed! Don't let your personal life interfere.  Never, ever give up!  If you want to work on one specific skill, take private lessons.  Try your best, even at your practice. You perform what you practice, and if you practice not trying, or saying it's too hard, you won't perform as well. As as long as you can say \"I gave 100%,\" your coach will be happy. Be kind. This step is another important one. When you watch movies, you may see cheerleaders being stuck up and rude but in reality, that's not how a cheerleader should be. If you're an awesome cheerleader, you will have respect for yourself and others. Don't pick on the new guy or people lower than you. That`s not cool even though your friends do it. A cheerleader is nice to everyone, and being nice means being nice to your team members too.Ask questions, ask your coach for things they are looking for also ask for previous routines and tapes. Befriend a former cheerleader. Ask someone who's been on the team in previous years, preferably Varsity cheerleaders with more experience.",
    "sentences": [
        " Performance and Physicality Stretch!",
        "Whatever stretches your coach has you do at the beginning of practice, do at home 1-2 times per day (splits, etc..) If you are a flyer, stretch your scorpion and heel stretch/bow and arrow.",
        "Over time, you will see a huge improvement!",
        "Improve your basics!",
        "Handstands, bridges, back handsprings, and back bends will help you with more difficult tumbling.",
        "It's true!",
        "Learn how to fall the right way.",
        "Believe it or not, there is a right way of falling!",
        "If you're falling backwards, don't just freak out or twist; just do a safety roll, which is just almost doing a backwards roll, but not rolling and just stopping with your hands above your head.",
        "If you're falling forwards, tuck your chin in, extend your arms above your head, and roll.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f4\\/Be-a-Better-Cheerleader-Step-20.jpg\\/v4-460px-Be-a-Better-Cheerleader-Step-20.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f4\\/Be-a-Better-Cheerleader-Step-20.jpg\\/v4-760px-Be-a-Better-Cheerleader-Step-20.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Improve your jumps.",
        "Remember to keep tight and squeeze your body the entire time.",
        "If you're sloppy, you can get hurt.",
        "A good way to improve your jumps is to practice the position of the jump you want to become better at when you're just sitting down watching TV or on the computer.",
        "For further improvement, buy a pair of ankle weights (about 1 to 2 pounds each is good).",
        "While wearing them, do \"leg lifts\" - sit in a straddle, put your hands in front of you, and lift your right leg 10 times without letting it touch the ground in between each lift.",
        "Do the same with your left leg, and then with both legs at the same time.",
        "It's important that you keep your hands in front of you and don't let your legs touch the ground in between each lift.",
        "Do this every day and your jumps will be much better!",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/9c\\/Be-a-Better-Cheerleader-Step-13.jpg\\/v4-460px-Be-a-Better-Cheerleader-Step-13.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/9c\\/Be-a-Better-Cheerleader-Step-13.jpg\\/v4-760px-Be-a-Better-Cheerleader-Step-13.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Take tumbling.",
        "Tumbling is extremely beneficial to an aspiring cheerleader.",
        "A couple of benefits of tumbling are learning how to have better tumbling passes, helping with jumps, and needed exercise.",
        "Work on your arm motions.",
        "When cheering, your motions should be sharp, not wild and uncontrolled.",
        "Shoot your arm motions, and make sure your arms aren't sloppy.",
        "Squeeze your arms at all times.",
        "Work out every day!",
        "Being strong will help your tumbling, jumps, stunts, and everything else.",
        "Practice makes permanent, so even when you practice, fix every possible mistake.",
        "Buy equipment to practice at home (don't do anything too dangerous, though).",
        "If you're working on back handsprings, barrels will really help.",
        "Attitude and Appearance Pay attention to your appearance.",
        "If you don't take yourself seriously and look like a mess, why should other people take you seriously?",
        "Wear clothes that fit you, not ones that are too tight or too baggy.",
        "The best choice for cheer clothes are soft shorts and a T-shirt or tank top.",
        "Wear your hair up - ponytails are ideal.",
        "Not only does it look pretty, but it also keeps the hair out of your face while cheering.",
        "Never wear jewelry!",
        "It can get caught, snagged or ripped, and that hurts.",
        "Be loud!",
        "Don't be afraid to yell!",
        "However, don't start screaming.",
        "You will stand out to the coach if they can hear you over everyone else.",
        "Remember to shout loudly and say the words clearly.",
        "Have confidence.",
        "If you don't make it the first time, keep practicing and trying.",
        "If you do make it, then don't think, \"Gee, I'm the best.\"",
        "Obviously you have skill if you've made the team, but no one (including the coaches) will want to deal with that kind of attitude, and it can affect you next tryout season.",
        "Be Positive!",
        "Always have a positive attitude!",
        "Always believe in yourself.",
        "If you believe in yourself, you will succeed!",
        "Don't let your personal life interfere.",
        "Never, ever give up!",
        "If you want to work on one specific skill, take private lessons.",
        "Try your best, even at your practice.",
        "You perform what you practice, and if you practice not trying, or saying it's too hard, you won't perform as well.",
        "As as long as you can say \"I gave 100%,\" your coach will be happy.",
        "Be kind.",
        "This step is another important one.",
        "When you watch movies, you may see cheerleaders being stuck up and rude but in reality, that's not how a cheerleader should be.",
        "If you're an awesome cheerleader, you will have respect for yourself and others.",
        "Don't pick on the new guy or people lower than you.",
        "That`s not cool even though your friends do it.",
        "A cheerleader is nice to everyone, and being nice means being nice to your team members too.Ask questions, ask your coach for things they are looking for also ask for previous routines and tapes.",
        "Befriend a former cheerleader.",
        "Ask someone who's been on the team in previous years, preferably Varsity cheerleaders with more experience."
    ]
}