{
    "title": "How to Make Chocolate from the Bean On",
    "url": "https://www.wikihow.com/Make-Chocolate-from-the-Bean-On",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Chocolate and Candy",
        "Making Chocolate"
    ],
    "steps": [
        {
            "headline": "Take 100 grams of cocoa beans and spread them on your roasting pan.",
            "description": "Roast for 5 minutes at 400 °F (204 °C), and then for 5-10 minutes on 250 °F (121 °C). At first, the smell will be very acidic and vinegary, but when your kitchen smells like brownies you know the beans are done! Take the beans out and let them cool."
        },
        {
            "headline": "When the beans have cooled, put the cocoa beans in a plastic bag.",
            "description": "Seal the bag and crush the beans with a cast-iron skillet or rolling pin. Don't be gentle; the hull (outside) of the bean needs to be separated from the nib (yummy inside)."
        },
        {
            "headline": "Pour the beans into a bowl and gently direct the hairdryer over it.",
            "description": "Agitate the bowl slightly, either by stirring with your hands or shaking the bowl. IF you have to hairdryer at the right distance, the hulls will fly right out of the bowl! Check the nibs carefully to make sure the hulls are completely removed."
        },
        {
            "headline": "Figure out the amount of chocolate you would like to end up with (100 grams is a good starting point).",
            "description": "A 100 gram batch of 60% dark chocolate requires 60 grams of nibs and 40 grams of sugar."
        },
        {
            "headline": "Add the sugar to the spice grinder and grind until it is a superfine powder.",
            "description": ""
        },
        {
            "headline": "Add in the nibs and grind for about 5 minutes.",
            "description": "If your grinder cannot take 5 minute at a time, grind for about one minute and let the grinder cool down before starting it up again. At a certain point, the cocoa butter will be released, creating a thick, tar-like appearance. At this point, you need to scrape off the mass that is stuck to the side and bottom of the grinder. The grinding is done when the mass flows easily."
        },
        {
            "headline": "When the chocolate is refined as much as possible, add in spices.",
            "description": "This step is optional."
        },
        {
            "headline": "Heat up your mortar and pestle by placing it in a warm microwave for a few minutes.",
            "description": "Add in your chocolate after the mortar and pestle is heated and grind away!"
        },
        {
            "headline": "Taste the mixture every 5 minutes or so.",
            "description": "When it tastes done, you know it's done! The next step is optional but is very recommended."
        },
        {
            "headline": "Melt the chocolate to be tempered at 110 °F (43 °C).",
            "description": "Take about 2/3 of the total batch and pour it on to the marble slab. Fold and agitate the melted chocolate with the scraping tools, ensuring that no lumps are forming."
        },
        {
            "headline": "Eventually, the chocolate will take a sludgy consistency.",
            "description": "When it does, pour it back into the rest of the batch and mix. At this point, you can now pour it into molds. Enjoy!"
        }
    ],
    "tyn": [
        "Food processor or spice grinder (blade grinder, not burr grinder).",
        "Perforated baking sheet",
        "Hairdryer or heat gun",
        "Bowl",
        "A slab of marble, granite or another smooth nonporous stone surface",
        "Goggles",
        "For small batches, a mortar and pestle. For large batches, a stand mixer.",
        "A pair of multi-purpose pastry scraping tools"
    ],
    "text": " Take 100 grams of cocoa beans and spread them on your roasting pan. Roast for 5 minutes at 400 °F (204 °C), and then for 5-10 minutes on 250 °F (121 °C). At first, the smell will be very acidic and vinegary, but when your kitchen smells like brownies you know the beans are done! Take the beans out and let them cool. When the beans have cooled, put the cocoa beans in a plastic bag. Seal the bag and crush the beans with a cast-iron skillet or rolling pin. Don't be gentle; the hull (outside) of the bean needs to be separated from the nib (yummy inside). Pour the beans into a bowl and gently direct the hairdryer over it. Agitate the bowl slightly, either by stirring with your hands or shaking the bowl. IF you have to hairdryer at the right distance, the hulls will fly right out of the bowl! Check the nibs carefully to make sure the hulls are completely removed. Figure out the amount of chocolate you would like to end up with (100 grams is a good starting point). A 100 gram batch of 60% dark chocolate requires 60 grams of nibs and 40 grams of sugar. Add the sugar to the spice grinder and grind until it is a superfine powder.  Add in the nibs and grind for about 5 minutes. If your grinder cannot take 5 minute at a time, grind for about one minute and let the grinder cool down before starting it up again. At a certain point, the cocoa butter will be released, creating a thick, tar-like appearance. At this point, you need to scrape off the mass that is stuck to the side and bottom of the grinder. The grinding is done when the mass flows easily. When the chocolate is refined as much as possible, add in spices. This step is optional. Heat up your mortar and pestle by placing it in a warm microwave for a few minutes. Add in your chocolate after the mortar and pestle is heated and grind away! Taste the mixture every 5 minutes or so. When it tastes done, you know it's done! The next step is optional but is very recommended. Melt the chocolate to be tempered at 110 °F (43 °C). Take about 2/3 of the total batch and pour it on to the marble slab. Fold and agitate the melted chocolate with the scraping tools, ensuring that no lumps are forming. Eventually, the chocolate will take a sludgy consistency. When it does, pour it back into the rest of the batch and mix. At this point, you can now pour it into molds. Enjoy!",
    "sentences": [
        " Take 100 grams of cocoa beans and spread them on your roasting pan.",
        "Roast for 5 minutes at 400 °F (204 °C), and then for 5-10 minutes on 250 °F (121 °C).",
        "At first, the smell will be very acidic and vinegary, but when your kitchen smells like brownies you know the beans are done!",
        "Take the beans out and let them cool.",
        "When the beans have cooled, put the cocoa beans in a plastic bag.",
        "Seal the bag and crush the beans with a cast-iron skillet or rolling pin.",
        "Don't be gentle; the hull (outside) of the bean needs to be separated from the nib (yummy inside).",
        "Pour the beans into a bowl and gently direct the hairdryer over it.",
        "Agitate the bowl slightly, either by stirring with your hands or shaking the bowl.",
        "IF you have to hairdryer at the right distance, the hulls will fly right out of the bowl!",
        "Check the nibs carefully to make sure the hulls are completely removed.",
        "Figure out the amount of chocolate you would like to end up with (100 grams is a good starting point).",
        "A 100 gram batch of 60% dark chocolate requires 60 grams of nibs and 40 grams of sugar.",
        "Add the sugar to the spice grinder and grind until it is a superfine powder.",
        "Add in the nibs and grind for about 5 minutes.",
        "If your grinder cannot take 5 minute at a time, grind for about one minute and let the grinder cool down before starting it up again.",
        "At a certain point, the cocoa butter will be released, creating a thick, tar-like appearance.",
        "At this point, you need to scrape off the mass that is stuck to the side and bottom of the grinder.",
        "The grinding is done when the mass flows easily.",
        "When the chocolate is refined as much as possible, add in spices.",
        "This step is optional.",
        "Heat up your mortar and pestle by placing it in a warm microwave for a few minutes.",
        "Add in your chocolate after the mortar and pestle is heated and grind away!",
        "Taste the mixture every 5 minutes or so.",
        "When it tastes done, you know it's done!",
        "The next step is optional but is very recommended.",
        "Melt the chocolate to be tempered at 110 °F (43 °C).",
        "Take about 2/3 of the total batch and pour it on to the marble slab.",
        "Fold and agitate the melted chocolate with the scraping tools, ensuring that no lumps are forming.",
        "Eventually, the chocolate will take a sludgy consistency.",
        "When it does, pour it back into the rest of the batch and mix.",
        "At this point, you can now pour it into molds.",
        "Enjoy!"
    ]
}