{
    "title": "How to Pound Meat to a Desired Thickness",
    "url": "https://www.wikihow.com/Pound-Meat-to-a-Desired-Thickness",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation"
    ],
    "methods": [
        {
            "name": "Preparing the Meat",
            "steps": [
                {
                    "headline": "Refrigerate the meat for at least 30 minutes.",
                    "description": "Chilling the meat helps it to maintain its shape and firmness as it is pounded."
                },
                {
                    "headline": "Trim any excess skin, cartilage or fat off of the meat.",
                    "description": "Discard the excess pieces."
                }
            ]
        },
        {
            "name": "Slicing Large Cuts of Meat",
            "steps": [
                {
                    "headline": "Place the pork, veal or beef tenderloin horizontally across your cutting board.",
                    "description": "The length of the tenderloin should be parallel to the edge of the countertop while the shorter width of the tenderloin should be perpendicular to the edge of the countertop."
                },
                {
                    "headline": "Slice the meat into 1\" (2.5 centimeters) thicknesses.",
                    "description": "Slice across the width of the tenderloin using an up-and-down motion."
                },
                {
                    "headline": "Pile the slices onto a separate plate until you are ready to use them.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Slicing Small Cuts of Meat",
            "steps": [
                {
                    "headline": "Place your small cut of meat horizontally across your cutting board so that the length of the meat is parallel to the edge of the countertop.",
                    "description": ""
                },
                {
                    "headline": "Place your non-dominant hand on top of the meat, covering as much of its length as possible.",
                    "description": ""
                },
                {
                    "headline": "Place your knife blade against the end meat, halfway between the cutting board and the top of the meat where your hand is resting.",
                    "description": "The flat part of the knife should be parallel to the cutting board with the blade parallel to your fingertips."
                },
                {
                    "headline": "Slice the meat in half along its length by cutting between your hand and the cutting board.",
                    "description": "If you are right-handed, cut toward the left; if you are left-handed, cut toward the right. Your meat slices will look the same as the original slice, but they will be only half as thick."
                },
                {
                    "headline": "Pile the sizes on a separate plate until you are ready to use them.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Pounding the Meat",
            "steps": [
                {
                    "headline": "Place one piece of sliced meat in a 1 gallon (3.8 L) resealable freezer bag.",
                    "description": ""
                },
                {
                    "headline": "Using a meat mallet, pound the meat until it reaches the thickness called for in your recipe.",
                    "description": ""
                },
                {
                    "headline": "Remove the meat from the bag and pile it on a second separate plate.",
                    "description": ""
                },
                {
                    "headline": "Repeat the process until of the slices of meat are pounded to the appropriate thickness.",
                    "description": ""
                },
                {
                    "headline": "Cut the pounded meat to the desired length and width for your recipe.",
                    "description": "For example, a large pounded piece of veal may be cut into two or even four cutlets, depending on the requirements of your recipe."
                }
            ]
        }
    ],
    "tyn": [
        "Chef's knife",
        "Cutting board",
        "2 plates",
        "1 gallon (3.8 L) resealable plastic freezer bag",
        "Meat mallet"
    ],
    "text": " Preparing the Meat Refrigerate the meat for at least 30 minutes. Chilling the meat helps it to maintain its shape and firmness as it is pounded. Trim any excess skin, cartilage or fat off of the meat. Discard the excess pieces. Slicing Large Cuts of Meat Place the pork, veal or beef tenderloin horizontally across your cutting board. The length of the tenderloin should be parallel to the edge of the countertop while the shorter width of the tenderloin should be perpendicular to the edge of the countertop. Slice the meat into 1\" (2.5 centimeters) thicknesses. Slice across the width of the tenderloin using an up-and-down motion. Pile the slices onto a separate plate until you are ready to use them.  Slicing Small Cuts of Meat Place your small cut of meat horizontally across your cutting board so that the length of the meat is parallel to the edge of the countertop.  Place your non-dominant hand on top of the meat, covering as much of its length as possible.  Place your knife blade against the end meat, halfway between the cutting board and the top of the meat where your hand is resting. The flat part of the knife should be parallel to the cutting board with the blade parallel to your fingertips. Slice the meat in half along its length by cutting between your hand and the cutting board. If you are right-handed, cut toward the left; if you are left-handed, cut toward the right. Your meat slices will look the same as the original slice, but they will be only half as thick. Pile the sizes on a separate plate until you are ready to use them.  Pounding the Meat Place one piece of sliced meat in a 1 gallon (3.8 L) resealable freezer bag.  Using a meat mallet, pound the meat until it reaches the thickness called for in your recipe.  Remove the meat from the bag and pile it on a second separate plate.  Repeat the process until of the slices of meat are pounded to the appropriate thickness.  Cut the pounded meat to the desired length and width for your recipe. For example, a large pounded piece of veal may be cut into two or even four cutlets, depending on the requirements of your recipe.",
    "sentences": [
        " Preparing the Meat Refrigerate the meat for at least 30 minutes.",
        "Chilling the meat helps it to maintain its shape and firmness as it is pounded.",
        "Trim any excess skin, cartilage or fat off of the meat.",
        "Discard the excess pieces.",
        "Slicing Large Cuts of Meat Place the pork, veal or beef tenderloin horizontally across your cutting board.",
        "The length of the tenderloin should be parallel to the edge of the countertop while the shorter width of the tenderloin should be perpendicular to the edge of the countertop.",
        "Slice the meat into 1\" (2.5 centimeters) thicknesses.",
        "Slice across the width of the tenderloin using an up-and-down motion.",
        "Pile the slices onto a separate plate until you are ready to use them.",
        "Slicing Small Cuts of Meat Place your small cut of meat horizontally across your cutting board so that the length of the meat is parallel to the edge of the countertop.",
        "Place your non-dominant hand on top of the meat, covering as much of its length as possible.",
        "Place your knife blade against the end meat, halfway between the cutting board and the top of the meat where your hand is resting.",
        "The flat part of the knife should be parallel to the cutting board with the blade parallel to your fingertips.",
        "Slice the meat in half along its length by cutting between your hand and the cutting board.",
        "If you are right-handed, cut toward the left; if you are left-handed, cut toward the right.",
        "Your meat slices will look the same as the original slice, but they will be only half as thick.",
        "Pile the sizes on a separate plate until you are ready to use them.",
        "Pounding the Meat Place one piece of sliced meat in a 1 gallon (3.8 L) resealable freezer bag.",
        "Using a meat mallet, pound the meat until it reaches the thickness called for in your recipe.",
        "Remove the meat from the bag and pile it on a second separate plate.",
        "Repeat the process until of the slices of meat are pounded to the appropriate thickness.",
        "Cut the pounded meat to the desired length and width for your recipe.",
        "For example, a large pounded piece of veal may be cut into two or even four cutlets, depending on the requirements of your recipe."
    ]
}