{
    "title": "How to Get off a Slippery Boat Ramp",
    "url": "https://www.wikihow.com/Get-off-a-Slippery-Boat-Ramp",
    "category_hierarchy": [
        "Cars & Other Vehicles"
    ],
    "methods": [
        {
            "name": "2WD Vehicles",
            "steps": [
                {
                    "headline": "Get your boat off the trailer.",
                    "description": "(rarely do people have problems getting off the ramp once the boat is off the trailer.)"
                },
                {
                    "headline": "Check to see if everything is ready for road travel, things like making sure your boat is properly locked to the trailer so it won't fall off while being towed.",
                    "description": ""
                }
            ]
        },
        {
            "name": "For SUVs",
            "steps": [
                {
                    "headline": "Again, put things right over the rear wheels if possible.",
                    "description": "SUVs already have more weight over the rear wheels because it's not just an open bed."
                },
                {
                    "headline": "Get in your vehicle and put it in drive while holding the brake so your vehicle won't go backwards into the lake.",
                    "description": ""
                },
                {
                    "headline": "Slowly give the vehicle gas, still holding the brake just enough so you want roll backwards.",
                    "description": "If your rear wheels start spinning try to get more weight in the back if possible. If all else fails then you'll have to do a burnout to get the tires hot so they will stick to the ramp better."
                }
            ]
        },
        {
            "name": "4WD Vehicles",
            "steps": [
                {
                    "headline": "Load up your boat.",
                    "description": ""
                },
                {
                    "headline": "Make sure everything is ready for towing.",
                    "description": ""
                },
                {
                    "headline": "Put your vehicle in 4WD.",
                    "description": "4WDL will help too, it's a lower gear so it will help give you torque for climbing the ramp hill."
                },
                {
                    "headline": "Put the vehicle in drive and give it gas to get up the hill.",
                    "description": "If 4WD isn't enough, load as much as you can into the back of the vehicle for more traction and get as much weight out of the boat as you can so it will be easier to pull out."
                }
            ]
        }
    ],
    "tyn": [
        "Vehicle capable of towing.",
        "Boat/Watercraft",
        "Lake",
        "Boat Ramp"
    ],
    "text": " 2WD Vehicles Get your boat off the trailer. (rarely do people have problems getting off the ramp once the boat is off the trailer.) Check to see if everything is ready for road travel, things like making sure your boat is properly locked to the trailer so it won't fall off while being towed.  For SUVs Again, put things right over the rear wheels if possible. SUVs already have more weight over the rear wheels because it's not just an open bed. Get in your vehicle and put it in drive while holding the brake so your vehicle won't go backwards into the lake.  Slowly give the vehicle gas, still holding the brake just enough so you want roll backwards. If your rear wheels start spinning try to get more weight in the back if possible. If all else fails then you'll have to do a burnout to get the tires hot so they will stick to the ramp better. 4WD Vehicles Load up your boat.  Make sure everything is ready for towing.  Put your vehicle in 4WD. 4WDL will help too, it's a lower gear so it will help give you torque for climbing the ramp hill. Put the vehicle in drive and give it gas to get up the hill. If 4WD isn't enough, load as much as you can into the back of the vehicle for more traction and get as much weight out of the boat as you can so it will be easier to pull out.",
    "sentences": [
        " 2WD Vehicles Get your boat off the trailer.",
        "(rarely do people have problems getting off the ramp once the boat is off the trailer.)",
        "Check to see if everything is ready for road travel, things like making sure your boat is properly locked to the trailer so it won't fall off while being towed.",
        "For SUVs Again, put things right over the rear wheels if possible.",
        "SUVs already have more weight over the rear wheels because it's not just an open bed.",
        "Get in your vehicle and put it in drive while holding the brake so your vehicle won't go backwards into the lake.",
        "Slowly give the vehicle gas, still holding the brake just enough so you want roll backwards.",
        "If your rear wheels start spinning try to get more weight in the back if possible.",
        "If all else fails then you'll have to do a burnout to get the tires hot so they will stick to the ramp better.",
        "4WD Vehicles Load up your boat.",
        "Make sure everything is ready for towing.",
        "Put your vehicle in 4WD.",
        "4WDL will help too, it's a lower gear so it will help give you torque for climbing the ramp hill.",
        "Put the vehicle in drive and give it gas to get up the hill.",
        "If 4WD isn't enough, load as much as you can into the back of the vehicle for more traction and get as much weight out of the boat as you can so it will be easier to pull out."
    ]
}