{
    "title": "How to Change a Disposable Adult Diaper While Sitting",
    "url": "https://www.wikihow.com/Change-a-Disposable-Adult-Diaper-While-Sitting",
    "category_hierarchy": [
        "Health",
        "Health for Older Adults",
        "Aging Associated Health Conditions"
    ],
    "parts": [
        {
            "name": "Preparation",
            "steps": [
                {
                    "headline": "Prepare a fresh new diaper out of the package.",
                    "description": "Make the diaper ready, so it can be used afterward, Unruffle the leak guards from the static cling inside the diaper, and set the diaper to the side."
                },
                {
                    "headline": "Have the wearer sit down with your old diaper taped to them.",
                    "description": "Any size or style chair will do, as long as the wearer fits on the chair."
                }
            ]
        },
        {
            "name": "Removal of Old Diaper",
            "steps": [
                {
                    "headline": "Grab the diaper by the top of the front panel and push the diaper outwards.",
                    "description": "If you are the caretaker, pull the diaper outwards."
                },
                {
                    "headline": "Rise slightly and quickly off the seat, as you pull the diaper out from under you.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Transition",
            "steps": [
                {
                    "headline": "Set the old diaper to the side as the caretaker will need to clean up the diaper changing mess a bit later.",
                    "description": ""
                },
                {
                    "headline": "Place the new diaper onto the chair, with the back side of the prepared diaper sitting loosely against the back of the chair.",
                    "description": "Try to position the diaper so that it can later be located at or near your waist. Make sure the diaper can't slip on the wearer when their hands have been taken away from the diaper."
                },
                {
                    "headline": "Have the wearer sit back down onto the chair.",
                    "description": "The diaper should then be almost aligned equal to the location of the diaper tapes on both of the sides of the diaper."
                }
            ]
        },
        {
            "name": "Replacement with New Diaper",
            "steps": [
                {
                    "headline": "Ask yourself (if you are the caregiver): \"Do I see the diaper tapes?\".",
                    "description": "If you do, grab the tapes and open them up."
                },
                {
                    "headline": "Pull the tapes of the one side around to the front panel of the diaper and push the tapes onto the panel to secure them in place.",
                    "description": "Always push the tapes onto the diaper, so that the bottom tape hangs slightly upwards from its default position, and that the top tape hangs slightly downwards from its default position too. If the diaper has a third tape, you can let these hang at their normal default position. However, few adult disposable diapers have three diaper tapes! The general rule of thumb for assuring snugness for an adult disposable diaper is that: if you can get only one of your fingers of one of your hands in between the secured diaper and their waist fastened with the attached tapes or using the pull-up-styled band, the diaper is secure enough. If you can fit more than one, it's not snug enough or you may need a smaller size. If you can't fit any, it's too tight or you may need a bigger size. Care must be taken not to fasten the diaper too tightly around the legs."
                },
                {
                    "headline": "Repeat these steps with the wearer's other leg.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Soiled person wearing the diaper",
        "Disposable Adult Diaper",
        "Baby Wipes",
        "Diaper rash ointment/cream or a Zinc Oxide-based cream/ointment or A & D Ointment (optional, only if needed)"
    ],
    "text": " Preparation Prepare a fresh new diaper out of the package. Make the diaper ready, so it can be used afterward, Unruffle the leak guards from the static cling inside the diaper, and set the diaper to the side. Have the wearer sit down with your old diaper taped to them. Any size or style chair will do, as long as the wearer fits on the chair. Removal of Old Diaper Grab the diaper by the top of the front panel and push the diaper outwards. If you are the caretaker, pull the diaper outwards. Rise slightly and quickly off the seat, as you pull the diaper out from under you.  Transition Set the old diaper to the side as the caretaker will need to clean up the diaper changing mess a bit later.  Place the new diaper onto the chair, with the back side of the prepared diaper sitting loosely against the back of the chair. Try to position the diaper so that it can later be located at or near your waist. Make sure the diaper can't slip on the wearer when their hands have been taken away from the diaper. Have the wearer sit back down onto the chair. The diaper should then be almost aligned equal to the location of the diaper tapes on both of the sides of the diaper. Replacement with New Diaper Ask yourself (if you are the caregiver): \"Do I see the diaper tapes?\". If you do, grab the tapes and open them up. Pull the tapes of the one side around to the front panel of the diaper and push the tapes onto the panel to secure them in place. Always push the tapes onto the diaper, so that the bottom tape hangs slightly upwards from its default position, and that the top tape hangs slightly downwards from its default position too. If the diaper has a third tape, you can let these hang at their normal default position. However, few adult disposable diapers have three diaper tapes! The general rule of thumb for assuring snugness for an adult disposable diaper is that: if you can get only one of your fingers of one of your hands in between the secured diaper and their waist fastened with the attached tapes or using the pull-up-styled band, the diaper is secure enough. If you can fit more than one, it's not snug enough or you may need a smaller size. If you can't fit any, it's too tight or you may need a bigger size. Care must be taken not to fasten the diaper too tightly around the legs. Repeat these steps with the wearer's other leg. ",
    "sentences": [
        " Preparation Prepare a fresh new diaper out of the package.",
        "Make the diaper ready, so it can be used afterward, Unruffle the leak guards from the static cling inside the diaper, and set the diaper to the side.",
        "Have the wearer sit down with your old diaper taped to them.",
        "Any size or style chair will do, as long as the wearer fits on the chair.",
        "Removal of Old Diaper Grab the diaper by the top of the front panel and push the diaper outwards.",
        "If you are the caretaker, pull the diaper outwards.",
        "Rise slightly and quickly off the seat, as you pull the diaper out from under you.",
        "Transition Set the old diaper to the side as the caretaker will need to clean up the diaper changing mess a bit later.",
        "Place the new diaper onto the chair, with the back side of the prepared diaper sitting loosely against the back of the chair.",
        "Try to position the diaper so that it can later be located at or near your waist.",
        "Make sure the diaper can't slip on the wearer when their hands have been taken away from the diaper.",
        "Have the wearer sit back down onto the chair.",
        "The diaper should then be almost aligned equal to the location of the diaper tapes on both of the sides of the diaper.",
        "Replacement with New Diaper Ask yourself (if you are the caregiver): \"Do I see the diaper tapes?\".",
        "If you do, grab the tapes and open them up.",
        "Pull the tapes of the one side around to the front panel of the diaper and push the tapes onto the panel to secure them in place.",
        "Always push the tapes onto the diaper, so that the bottom tape hangs slightly upwards from its default position, and that the top tape hangs slightly downwards from its default position too.",
        "If the diaper has a third tape, you can let these hang at their normal default position.",
        "However, few adult disposable diapers have three diaper tapes!",
        "The general rule of thumb for assuring snugness for an adult disposable diaper is that: if you can get only one of your fingers of one of your hands in between the secured diaper and their waist fastened with the attached tapes or using the pull-up-styled band, the diaper is secure enough.",
        "If you can fit more than one, it's not snug enough or you may need a smaller size.",
        "If you can't fit any, it's too tight or you may need a bigger size.",
        "Care must be taken not to fasten the diaper too tightly around the legs.",
        "Repeat these steps with the wearer's other leg."
    ]
}