{
    "title": "How to Make Chiles Rellenos",
    "url": "https://www.wikihow.com/Make-Chiles-Rellenos",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "Central and South American Cuisine"
    ],
    "parts": [
        {
            "name": "Broiling and Peeling the Peppers",
            "steps": [
                {
                    "headline": "Adjust the oven racks and turn the broiler to high.",
                    "description": "Move the top oven rack so it's 4 inches (10 cm) below the broiler's heating element. Then turn the broiler to high. If your broiler doesn't have a high or low setting, just turn it on."
                },
                {
                    "headline": "Line a baking sheet with foil and put the peppers on it.",
                    "description": "Get out a rimmed baking sheet and tear off a sheet of foil to cover it. Place 6 poblano peppers on the foil-lined sheet.Tip: If you'd like to make a roasted salsa to serve with the chiles rellenos, roast onions, tomatoes, and your favorite peppers along with the poblanos. Then blend the roasted veggies to make a simple salsa. You can use any type of pepper to make chiles rellenos, but larger peppers will be easier to stuff."
                },
                {
                    "headline": "Broil the peppers for 10 to 12 minutes.",
                    "description": "Place the sheet on the top rack that's below the broiler's heating element. Broil the peppers and use tongs to turn them every few minutes so each side of the peppers broil. Flipping the peppers with the tongs will ensure that you don't burn your hands on the hot peppers. The peppers will blister and blacken in spots. This is important for creating a deep smoky flavor."
                },
                {
                    "headline": "Rinse the peppers and rub away the skins.",
                    "description": "Turn off the broiler and remove the baking sheet. Run cold water over the peppers so the skins loosen. This will also make them cool enough to handle. Rub the peppers gently to remove the skins."
                },
                {
                    "headline": "Remove the seeds and core from each pepper.",
                    "description": "Place the peeled peppers on a cutting board and use a small knife to cut a long strip lengthwise through each pepper. Ensure that you're only cutting through 1 side of the pepper instead of cutting it completely in half. Then pull out the core and rinse away the seeds from the center. Dry the peppers. Set the peppers aside while you prepare the filling."
                }
            ]
        },
        {
            "name": "Making the Filling",
            "steps": [
                {
                    "headline": "Sauté the onion for 4 minutes.",
                    "description": "Heat 1 tablespoon (15 ml) of lard or vegetable oil into a skillet and turn the burner to medium-high. Once the fat melts and shimmers, stir in 1 small finely diced onion. Cook the onion until it becomes soft and translucent. Stir the onion occasionally to prevent it from sticking to the skillet."
                },
                {
                    "headline": "Add the oregano, salt, and pepper.",
                    "description": "Stir in 1 teaspoon (2 g) of dried oregano with 1/2 teaspoon (2.5 g) salt and 1/4 tsp (1/2 g) of black pepper. Cook the filling mixture for 2 minutes. The oregano should become fragrant and the onion will continue to soften."
                },
                {
                    "headline": "Stir in the chorizo and cook it with the filling, if desired.",
                    "description": "To make the filling meaty, add 1/2 pound (225 g) of fresh Mexican chorizo or ground pork. Cook the filling mixture for 5 minutes and use a spoon to break up the meat.Tip: Don't use hard Spanish chorizo for the filling, since the meat won't crumble easily. If you prefer, use ground chicken or turkey instead."
                },
                {
                    "headline": "Toss the grated cheese into the filling mixture.",
                    "description": "Turn off the burner and spoon the filling mixture into a bowl. Add 1 pound (450 g) of grated cheese, such as jack, pepper jack, cheddar, or queso fresco. Use a spoon to toss the cheese with the filling until they're combined."
                }
            ]
        },
        {
            "name": "Stuffing and Coating the Peppers",
            "steps": [
                {
                    "headline": "Spoon the filling into each pepper.",
                    "description": "Divide the filling mixture evenly between the 6 poblano peppers. Once you've put the filling into a pepper, gently fold the pepper shut so the edges of the slits overlap. You shouldn't see filling coming out of the peppers. If you overstuff them, they'll be difficult to fry."
                },
                {
                    "headline": "Separate 4 eggs and whisk the whites to stiff peaks.",
                    "description": "Set the yolks aside and put the whites into a large bowl. Whisk the whites until they hold stiff peaks. The bowl and whisk need to be completely clean so the whites will whisk up. If there are any streaks of yolk in the whites, they won't form stiff peaks."
                },
                {
                    "headline": "Whisk in the egg yolks and flour.",
                    "description": "Whisk each yolk into the whites until they're incorporated. Once you've added all 4 egg yolks, whisk in 1/4 cup (31 g) of the flour and stop mixing as soon as the flour is combined. Set the batter aside.Variation: If you'd like an even crunchier coating, gently fold in 2 tablespoons (10 g) of cornmeal."
                },
                {
                    "headline": "Roll the peppers in flour and coat them in the batter.",
                    "description": "Put the remaining 3/4 cup (93 g) of flour into a shallow bowl. Gently roll each stuffed pepper in the flour so they're lightly coated. Then dip them in the egg batter so they're covered. If you think the pepper will split or the filling will fall out, you can spoon the batter over the pepper."
                }
            ]
        },
        {
            "name": "Frying the Chiles Rellenos",
            "steps": [
                {
                    "headline": "Heat vegetable oil over medium-high heat.",
                    "description": "Pour 2 cups (470 ml) of vegetable oil into a large skillet and turn the burner to medium-high. Insert a frying thermometer onto the side and heat the oil until it reaches 375 °F (191 °C). Adjust the burner as needed to keep the oil temperature at 375 °F (191 °C)."
                },
                {
                    "headline": "Fry 1 to 2 peppers for about 4 minutes.",
                    "description": "Carefully lower 1 or 2 stuffed peppers into the hot oil. Leave the peppers to fry until they're golden brown on both sides. Use tongs or a fish spatula to gently flip the peppers over halfway through the frying time. Flip the peppers slowly so hot oil doesn't splash out of the skillet."
                },
                {
                    "headline": "Fry the remaining peppers in batches.",
                    "description": "Transfer the fried peppers from the oil to a paper towel-lined plate and let the oil heat back up to 375 °F (191 °C). Then put 1 to 2 more peppers into the oil and fry them until they're browned.Tip: It's important to bring the oil back up to temperature before frying additional batches of peppers. If the oil isn't hot, the peppers will absorb the oil and they'll become greasy instead of crispy."
                },
                {
                    "headline": "Serve the chiles rellenos.",
                    "description": "For a traditional way of serving the peppers, spoon some of your favorite warm salsa into a casserole dish. Place the chiles rellenos on top and spread more warm salsa on top. If you like, garnish the chiles rellenos with fresh cilantro or cheese. For the best texture, eat the chiles rellenos right after they're fried. They'll become soggy if they're stored."
                }
            ]
        }
    ],
    "tyn": [
        "Rimmed baking sheet",
        "Aluminum foil",
        "Tongs",
        "Knife and cutting board",
        "Measuring cups and spoons",
        "Paper towels",
        "Skillet",
        "Spoon",
        "Bowls",
        "Whisk",
        "Shallow bowl",
        "Frying thermometer",
        "Large skillet",
        "Fish spatula"
    ],
    "text": " Broiling and Peeling the Peppers Adjust the oven racks and turn the broiler to high. Move the top oven rack so it's 4 inches (10 cm) below the broiler's heating element. Then turn the broiler to high. If your broiler doesn't have a high or low setting, just turn it on. Line a baking sheet with foil and put the peppers on it. Get out a rimmed baking sheet and tear off a sheet of foil to cover it. Place 6 poblano peppers on the foil-lined sheet.Tip: If you'd like to make a roasted salsa to serve with the chiles rellenos, roast onions, tomatoes, and your favorite peppers along with the poblanos. Then blend the roasted veggies to make a simple salsa. You can use any type of pepper to make chiles rellenos, but larger peppers will be easier to stuff. Broil the peppers for 10 to 12 minutes. Place the sheet on the top rack that's below the broiler's heating element. Broil the peppers and use tongs to turn them every few minutes so each side of the peppers broil. Flipping the peppers with the tongs will ensure that you don't burn your hands on the hot peppers. The peppers will blister and blacken in spots. This is important for creating a deep smoky flavor. Rinse the peppers and rub away the skins. Turn off the broiler and remove the baking sheet. Run cold water over the peppers so the skins loosen. This will also make them cool enough to handle. Rub the peppers gently to remove the skins. Remove the seeds and core from each pepper. Place the peeled peppers on a cutting board and use a small knife to cut a long strip lengthwise through each pepper. Ensure that you're only cutting through 1 side of the pepper instead of cutting it completely in half. Then pull out the core and rinse away the seeds from the center. Dry the peppers. Set the peppers aside while you prepare the filling. Making the Filling Sauté the onion for 4 minutes. Heat 1 tablespoon (15 ml) of lard or vegetable oil into a skillet and turn the burner to medium-high. Once the fat melts and shimmers, stir in 1 small finely diced onion. Cook the onion until it becomes soft and translucent. Stir the onion occasionally to prevent it from sticking to the skillet. Add the oregano, salt, and pepper. Stir in 1 teaspoon (2 g) of dried oregano with 1/2 teaspoon (2.5 g) salt and 1/4 tsp (1/2 g) of black pepper. Cook the filling mixture for 2 minutes. The oregano should become fragrant and the onion will continue to soften. Stir in the chorizo and cook it with the filling, if desired. To make the filling meaty, add 1/2 pound (225 g) of fresh Mexican chorizo or ground pork. Cook the filling mixture for 5 minutes and use a spoon to break up the meat.Tip: Don't use hard Spanish chorizo for the filling, since the meat won't crumble easily. If you prefer, use ground chicken or turkey instead. Toss the grated cheese into the filling mixture. Turn off the burner and spoon the filling mixture into a bowl. Add 1 pound (450 g) of grated cheese, such as jack, pepper jack, cheddar, or queso fresco. Use a spoon to toss the cheese with the filling until they're combined. Stuffing and Coating the Peppers Spoon the filling into each pepper. Divide the filling mixture evenly between the 6 poblano peppers. Once you've put the filling into a pepper, gently fold the pepper shut so the edges of the slits overlap. You shouldn't see filling coming out of the peppers. If you overstuff them, they'll be difficult to fry. Separate 4 eggs and whisk the whites to stiff peaks. Set the yolks aside and put the whites into a large bowl. Whisk the whites until they hold stiff peaks. The bowl and whisk need to be completely clean so the whites will whisk up. If there are any streaks of yolk in the whites, they won't form stiff peaks. Whisk in the egg yolks and flour. Whisk each yolk into the whites until they're incorporated. Once you've added all 4 egg yolks, whisk in 1/4 cup (31 g) of the flour and stop mixing as soon as the flour is combined. Set the batter aside.Variation: If you'd like an even crunchier coating, gently fold in 2 tablespoons (10 g) of cornmeal. Roll the peppers in flour and coat them in the batter. Put the remaining 3/4 cup (93 g) of flour into a shallow bowl. Gently roll each stuffed pepper in the flour so they're lightly coated. Then dip them in the egg batter so they're covered. If you think the pepper will split or the filling will fall out, you can spoon the batter over the pepper. Frying the Chiles Rellenos Heat vegetable oil over medium-high heat. Pour 2 cups (470 ml) of vegetable oil into a large skillet and turn the burner to medium-high. Insert a frying thermometer onto the side and heat the oil until it reaches 375 °F (191 °C). Adjust the burner as needed to keep the oil temperature at 375 °F (191 °C). Fry 1 to 2 peppers for about 4 minutes. Carefully lower 1 or 2 stuffed peppers into the hot oil. Leave the peppers to fry until they're golden brown on both sides. Use tongs or a fish spatula to gently flip the peppers over halfway through the frying time. Flip the peppers slowly so hot oil doesn't splash out of the skillet. Fry the remaining peppers in batches. Transfer the fried peppers from the oil to a paper towel-lined plate and let the oil heat back up to 375 °F (191 °C). Then put 1 to 2 more peppers into the oil and fry them until they're browned.Tip: It's important to bring the oil back up to temperature before frying additional batches of peppers. If the oil isn't hot, the peppers will absorb the oil and they'll become greasy instead of crispy. Serve the chiles rellenos. For a traditional way of serving the peppers, spoon some of your favorite warm salsa into a casserole dish. Place the chiles rellenos on top and spread more warm salsa on top. If you like, garnish the chiles rellenos with fresh cilantro or cheese. For the best texture, eat the chiles rellenos right after they're fried. They'll become soggy if they're stored.",
    "sentences": [
        " Broiling and Peeling the Peppers Adjust the oven racks and turn the broiler to high.",
        "Move the top oven rack so it's 4 inches (10 cm) below the broiler's heating element.",
        "Then turn the broiler to high.",
        "If your broiler doesn't have a high or low setting, just turn it on.",
        "Line a baking sheet with foil and put the peppers on it.",
        "Get out a rimmed baking sheet and tear off a sheet of foil to cover it.",
        "Place 6 poblano peppers on the foil-lined sheet.Tip: If you'd like to make a roasted salsa to serve with the chiles rellenos, roast onions, tomatoes, and your favorite peppers along with the poblanos.",
        "Then blend the roasted veggies to make a simple salsa.",
        "You can use any type of pepper to make chiles rellenos, but larger peppers will be easier to stuff.",
        "Broil the peppers for 10 to 12 minutes.",
        "Place the sheet on the top rack that's below the broiler's heating element.",
        "Broil the peppers and use tongs to turn them every few minutes so each side of the peppers broil.",
        "Flipping the peppers with the tongs will ensure that you don't burn your hands on the hot peppers.",
        "The peppers will blister and blacken in spots.",
        "This is important for creating a deep smoky flavor.",
        "Rinse the peppers and rub away the skins.",
        "Turn off the broiler and remove the baking sheet.",
        "Run cold water over the peppers so the skins loosen.",
        "This will also make them cool enough to handle.",
        "Rub the peppers gently to remove the skins.",
        "Remove the seeds and core from each pepper.",
        "Place the peeled peppers on a cutting board and use a small knife to cut a long strip lengthwise through each pepper.",
        "Ensure that you're only cutting through 1 side of the pepper instead of cutting it completely in half.",
        "Then pull out the core and rinse away the seeds from the center.",
        "Dry the peppers.",
        "Set the peppers aside while you prepare the filling.",
        "Making the Filling Sauté the onion for 4 minutes.",
        "Heat 1 tablespoon (15 ml) of lard or vegetable oil into a skillet and turn the burner to medium-high.",
        "Once the fat melts and shimmers, stir in 1 small finely diced onion.",
        "Cook the onion until it becomes soft and translucent.",
        "Stir the onion occasionally to prevent it from sticking to the skillet.",
        "Add the oregano, salt, and pepper.",
        "Stir in 1 teaspoon (2 g) of dried oregano with 1/2 teaspoon (2.5 g) salt and 1/4 tsp (1/2 g) of black pepper.",
        "Cook the filling mixture for 2 minutes.",
        "The oregano should become fragrant and the onion will continue to soften.",
        "Stir in the chorizo and cook it with the filling, if desired.",
        "To make the filling meaty, add 1/2 pound (225 g) of fresh Mexican chorizo or ground pork.",
        "Cook the filling mixture for 5 minutes and use a spoon to break up the meat.Tip: Don't use hard Spanish chorizo for the filling, since the meat won't crumble easily.",
        "If you prefer, use ground chicken or turkey instead.",
        "Toss the grated cheese into the filling mixture.",
        "Turn off the burner and spoon the filling mixture into a bowl.",
        "Add 1 pound (450 g) of grated cheese, such as jack, pepper jack, cheddar, or queso fresco.",
        "Use a spoon to toss the cheese with the filling until they're combined.",
        "Stuffing and Coating the Peppers Spoon the filling into each pepper.",
        "Divide the filling mixture evenly between the 6 poblano peppers.",
        "Once you've put the filling into a pepper, gently fold the pepper shut so the edges of the slits overlap.",
        "You shouldn't see filling coming out of the peppers.",
        "If you overstuff them, they'll be difficult to fry.",
        "Separate 4 eggs and whisk the whites to stiff peaks.",
        "Set the yolks aside and put the whites into a large bowl.",
        "Whisk the whites until they hold stiff peaks.",
        "The bowl and whisk need to be completely clean so the whites will whisk up.",
        "If there are any streaks of yolk in the whites, they won't form stiff peaks.",
        "Whisk in the egg yolks and flour.",
        "Whisk each yolk into the whites until they're incorporated.",
        "Once you've added all 4 egg yolks, whisk in 1/4 cup (31 g) of the flour and stop mixing as soon as the flour is combined.",
        "Set the batter aside.Variation: If you'd like an even crunchier coating, gently fold in 2 tablespoons (10 g) of cornmeal.",
        "Roll the peppers in flour and coat them in the batter.",
        "Put the remaining 3/4 cup (93 g) of flour into a shallow bowl.",
        "Gently roll each stuffed pepper in the flour so they're lightly coated.",
        "Then dip them in the egg batter so they're covered.",
        "If you think the pepper will split or the filling will fall out, you can spoon the batter over the pepper.",
        "Frying the Chiles Rellenos Heat vegetable oil over medium-high heat.",
        "Pour 2 cups (470 ml) of vegetable oil into a large skillet and turn the burner to medium-high.",
        "Insert a frying thermometer onto the side and heat the oil until it reaches 375 °F (191 °C).",
        "Adjust the burner as needed to keep the oil temperature at 375 °F (191 °C).",
        "Fry 1 to 2 peppers for about 4 minutes.",
        "Carefully lower 1 or 2 stuffed peppers into the hot oil.",
        "Leave the peppers to fry until they're golden brown on both sides.",
        "Use tongs or a fish spatula to gently flip the peppers over halfway through the frying time.",
        "Flip the peppers slowly so hot oil doesn't splash out of the skillet.",
        "Fry the remaining peppers in batches.",
        "Transfer the fried peppers from the oil to a paper towel-lined plate and let the oil heat back up to 375 °F (191 °C).",
        "Then put 1 to 2 more peppers into the oil and fry them until they're browned.Tip: It's important to bring the oil back up to temperature before frying additional batches of peppers.",
        "If the oil isn't hot, the peppers will absorb the oil and they'll become greasy instead of crispy.",
        "Serve the chiles rellenos.",
        "For a traditional way of serving the peppers, spoon some of your favorite warm salsa into a casserole dish.",
        "Place the chiles rellenos on top and spread more warm salsa on top.",
        "If you like, garnish the chiles rellenos with fresh cilantro or cheese.",
        "For the best texture, eat the chiles rellenos right after they're fried.",
        "They'll become soggy if they're stored."
    ]
}