{
    "title": "How to Get Surfer Hair (for Guys)",
    "url": "https://www.wikihow.com/Get-Surfer-Hair-(for-Guys)",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Hairstyles",
        "Hairstyles for Men"
    ],
    "methods": [
        {
            "name": "Getting Surfer Hair",
            "steps": [
                {
                    "headline": "Let it grow.",
                    "description": "The first thing you'll need to do is grow your hair out. If you already had a longer cut such as a Caesar this won't take too long, but growing out a high and tight fade will take a while. Be patient. Eating a balanced, protein and mineral rich diet will help your hair grow as fast as possible. If your ends start to split, you can trim the bottom 1/8\", just to make sure that the hair stays looking good and can keep growing. Scalp massages can reportedly stimulate accelerated hair growth as well."
                },
                {
                    "headline": "Suffer through the transition.",
                    "description": "It may be hotter than you are used to. Hair touching your neck and ears for the first time may also irritate you at first. Rest assured, this is the worst part of getting \"Surfer Hair\". Keep on going and it'll be over before you know it. Consider switching to a sateen or silk rather than cotton pillowcase. It will help you avoid your hair getting itchy or tangling. If it is getting too hot for you don't worry, the final cut will actually remove a lot of weight."
                },
                {
                    "headline": "Keep it healthy.",
                    "description": "Don't shampoo daily, but whenever you do shampoo, be sure to use conditioner. You'll want to keep your hair healthy and strong. You'll be rocking your Surfer Hair in no time, and you'll want it to look its best. Maintaining healthy hair will help it grow faster too."
                },
                {
                    "headline": "Get it over your eyes and past your ears.",
                    "description": "Once your hair is past your ears and over your eyes, you are ready for Surfer Hair. Don't short yourself or rush it, as your hair stylist will be cutting your hair and removing some length during the process. If you are going to do Surfer Hair, do it right."
                },
                {
                    "headline": "Find a stylist.",
                    "description": "If you already have a reliable stylist that you know who does surfer hair well, you are in luck. Otherwise you may have to ask friends for recommendations or look up reviews online. When in doubt, ask someone else who already has great Surfer Hair where they got their cut."
                },
                {
                    "headline": "Bring photos.",
                    "description": "Don't leave anything to doubt. Bring at least one photo of someone who has the Surfer Hair cut that you are looking for. Some people prefer slightly longer Surfer Hair, while others prefer a more de-structured and shaggy look similar to Owen Wilson's. Ideally bring several pictures so that you and the stylist can discuss the characteristics you like in each."
                },
                {
                    "headline": "Specify your preferred cut.",
                    "description": "Just in case there is any doubt from the photo, specify to your stylist that you are looking for a \"Surfer Cut\" or a \"Long Shag\". Those are the two terms that are most commonly associated with the cut you need for Surfer Hair."
                },
                {
                    "headline": "Confirm the haircut length.",
                    "description": "It can sometimes be difficult for a hair stylist to get length right. Surfer hair is a textured and de-structured look, so the cut will look slightly shorter than it actually is. This is especially true after you use products that add volume and body. Make sure they don't cut your hair too short, and hew closely to the picture you provided. You can always ask them to cut more if it is too long. You can't do the reverse."
                },
                {
                    "headline": "Explain the look that you are going for.",
                    "description": "Do you envision it being long and flowing, or a shorter, messy mop? Even though they've seen a picture, know the cut, and know your preferred length, this detail can help them. If you've already decided what hair products you will be using, you may want to bring this up with them as well. If you want a flowing look, ask them to remove weight as well. If you want extra texture and a softer edge, ask them to point cut your tips as well."
                },
                {
                    "headline": "Try to make sure they use a razor.",
                    "description": "Ideally Surfer Hair isn't done with scissors, shears, or a clipper (exceptions exist when clippers are used like a razor). Cutting with a razor gives the hair the movement and separation necessary for a properly deconstructed look. If they use scissors make sure that they soften or feather the edges."
                },
                {
                    "headline": "Add lighter colored highlights if desired.",
                    "description": "Classic natural surfer hair gets slightly sun bleached, causing natural highlights. You can imitate this look by getting highlights. Don't make the highlights too vibrant though, Ideally, your highlights should be barely noticeable. You want it to emulate natural sun bleaching."
                }
            ]
        },
        {
            "name": "Styling and Maintaining Your Hair",
            "steps": [
                {
                    "headline": "Lightly dry your hair with a towel.",
                    "description": "Now that you have your cut, you'll need to know how to prepare your hair. After showering, start to dry your hair with a towel. Don't dry it completely though. It needs to be slightly damp."
                },
                {
                    "headline": "Apply your hair product.",
                    "description": "Some people can pull of the look without the help of product or the beach, but most can't. If you are like most people, you'll want to use a salt-infused matte finish product. This will leave your hair with a windblown and sunny beach look."
                },
                {
                    "headline": "Massage the gel into your hair.",
                    "description": "Work the your product through your hair. You'll want to use a light, texturing spray or gel. It'll often be marketed as a surf-style product.You don't need a ton of it. Too much gel will make your hair sticky. Start with a little and work in more if you need to. Make sure that it is evenly distributed by thoroughly massaging it through your hair with your fingertips. Most surfer hair style products will add body without clumping or getting crunchy. They also often feature a light matte finish, emphasizing texture and sheen while eliminating frizz."
                },
                {
                    "headline": "Dry your hair.",
                    "description": "The best way is to toss your hair and let it dry naturally, though you can also use a blow dryer with a diffuser if you need to speed the process. Either natural drying or using a diffuser will give your hair that tousled, surfer look."
                }
            ]
        }
    ],
    "tyn": [
        "Shaping Gel or Hair Spray or Gel Mousse",
        "Hairbrush or Comb",
        "Blow Dryer (optional)"
    ],
    "text": " Getting Surfer Hair Let it grow. The first thing you'll need to do is grow your hair out. If you already had a longer cut such as a Caesar this won't take too long, but growing out a high and tight fade will take a while. Be patient. Eating a balanced, protein and mineral rich diet will help your hair grow as fast as possible. If your ends start to split, you can trim the bottom 1/8\", just to make sure that the hair stays looking good and can keep growing. Scalp massages can reportedly stimulate accelerated hair growth as well. Suffer through the transition. It may be hotter than you are used to. Hair touching your neck and ears for the first time may also irritate you at first. Rest assured, this is the worst part of getting \"Surfer Hair\". Keep on going and it'll be over before you know it. Consider switching to a sateen or silk rather than cotton pillowcase. It will help you avoid your hair getting itchy or tangling. If it is getting too hot for you don't worry, the final cut will actually remove a lot of weight. Keep it healthy. Don't shampoo daily, but whenever you do shampoo, be sure to use conditioner. You'll want to keep your hair healthy and strong. You'll be rocking your Surfer Hair in no time, and you'll want it to look its best. Maintaining healthy hair will help it grow faster too. Get it over your eyes and past your ears. Once your hair is past your ears and over your eyes, you are ready for Surfer Hair. Don't short yourself or rush it, as your hair stylist will be cutting your hair and removing some length during the process. If you are going to do Surfer Hair, do it right. Find a stylist. If you already have a reliable stylist that you know who does surfer hair well, you are in luck. Otherwise you may have to ask friends for recommendations or look up reviews online. When in doubt, ask someone else who already has great Surfer Hair where they got their cut. Bring photos. Don't leave anything to doubt. Bring at least one photo of someone who has the Surfer Hair cut that you are looking for. Some people prefer slightly longer Surfer Hair, while others prefer a more de-structured and shaggy look similar to Owen Wilson's. Ideally bring several pictures so that you and the stylist can discuss the characteristics you like in each. Specify your preferred cut. Just in case there is any doubt from the photo, specify to your stylist that you are looking for a \"Surfer Cut\" or a \"Long Shag\". Those are the two terms that are most commonly associated with the cut you need for Surfer Hair. Confirm the haircut length. It can sometimes be difficult for a hair stylist to get length right. Surfer hair is a textured and de-structured look, so the cut will look slightly shorter than it actually is. This is especially true after you use products that add volume and body. Make sure they don't cut your hair too short, and hew closely to the picture you provided. You can always ask them to cut more if it is too long. You can't do the reverse. Explain the look that you are going for. Do you envision it being long and flowing, or a shorter, messy mop? Even though they've seen a picture, know the cut, and know your preferred length, this detail can help them. If you've already decided what hair products you will be using, you may want to bring this up with them as well. If you want a flowing look, ask them to remove weight as well. If you want extra texture and a softer edge, ask them to point cut your tips as well. Try to make sure they use a razor. Ideally Surfer Hair isn't done with scissors, shears, or a clipper (exceptions exist when clippers are used like a razor). Cutting with a razor gives the hair the movement and separation necessary for a properly deconstructed look. If they use scissors make sure that they soften or feather the edges. Add lighter colored highlights if desired. Classic natural surfer hair gets slightly sun bleached, causing natural highlights. You can imitate this look by getting highlights. Don't make the highlights too vibrant though, Ideally, your highlights should be barely noticeable. You want it to emulate natural sun bleaching. Styling and Maintaining Your Hair Lightly dry your hair with a towel. Now that you have your cut, you'll need to know how to prepare your hair. After showering, start to dry your hair with a towel. Don't dry it completely though. It needs to be slightly damp. Apply your hair product. Some people can pull of the look without the help of product or the beach, but most can't. If you are like most people, you'll want to use a salt-infused matte finish product. This will leave your hair with a windblown and sunny beach look. Massage the gel into your hair. Work the your product through your hair. You'll want to use a light, texturing spray or gel. It'll often be marketed as a surf-style product.You don't need a ton of it. Too much gel will make your hair sticky. Start with a little and work in more if you need to. Make sure that it is evenly distributed by thoroughly massaging it through your hair with your fingertips. Most surfer hair style products will add body without clumping or getting crunchy. They also often feature a light matte finish, emphasizing texture and sheen while eliminating frizz. Dry your hair. The best way is to toss your hair and let it dry naturally, though you can also use a blow dryer with a diffuser if you need to speed the process. Either natural drying or using a diffuser will give your hair that tousled, surfer look.",
    "sentences": [
        " Getting Surfer Hair Let it grow.",
        "The first thing you'll need to do is grow your hair out.",
        "If you already had a longer cut such as a Caesar this won't take too long, but growing out a high and tight fade will take a while.",
        "Be patient.",
        "Eating a balanced, protein and mineral rich diet will help your hair grow as fast as possible.",
        "If your ends start to split, you can trim the bottom 1/8\", just to make sure that the hair stays looking good and can keep growing.",
        "Scalp massages can reportedly stimulate accelerated hair growth as well.",
        "Suffer through the transition.",
        "It may be hotter than you are used to.",
        "Hair touching your neck and ears for the first time may also irritate you at first.",
        "Rest assured, this is the worst part of getting \"Surfer Hair\".",
        "Keep on going and it'll be over before you know it.",
        "Consider switching to a sateen or silk rather than cotton pillowcase.",
        "It will help you avoid your hair getting itchy or tangling.",
        "If it is getting too hot for you don't worry, the final cut will actually remove a lot of weight.",
        "Keep it healthy.",
        "Don't shampoo daily, but whenever you do shampoo, be sure to use conditioner.",
        "You'll want to keep your hair healthy and strong.",
        "You'll be rocking your Surfer Hair in no time, and you'll want it to look its best.",
        "Maintaining healthy hair will help it grow faster too.",
        "Get it over your eyes and past your ears.",
        "Once your hair is past your ears and over your eyes, you are ready for Surfer Hair.",
        "Don't short yourself or rush it, as your hair stylist will be cutting your hair and removing some length during the process.",
        "If you are going to do Surfer Hair, do it right.",
        "Find a stylist.",
        "If you already have a reliable stylist that you know who does surfer hair well, you are in luck.",
        "Otherwise you may have to ask friends for recommendations or look up reviews online.",
        "When in doubt, ask someone else who already has great Surfer Hair where they got their cut.",
        "Bring photos.",
        "Don't leave anything to doubt.",
        "Bring at least one photo of someone who has the Surfer Hair cut that you are looking for.",
        "Some people prefer slightly longer Surfer Hair, while others prefer a more de-structured and shaggy look similar to Owen Wilson's.",
        "Ideally bring several pictures so that you and the stylist can discuss the characteristics you like in each.",
        "Specify your preferred cut.",
        "Just in case there is any doubt from the photo, specify to your stylist that you are looking for a \"Surfer Cut\" or a \"Long Shag\".",
        "Those are the two terms that are most commonly associated with the cut you need for Surfer Hair.",
        "Confirm the haircut length.",
        "It can sometimes be difficult for a hair stylist to get length right.",
        "Surfer hair is a textured and de-structured look, so the cut will look slightly shorter than it actually is.",
        "This is especially true after you use products that add volume and body.",
        "Make sure they don't cut your hair too short, and hew closely to the picture you provided.",
        "You can always ask them to cut more if it is too long.",
        "You can't do the reverse.",
        "Explain the look that you are going for.",
        "Do you envision it being long and flowing, or a shorter, messy mop?",
        "Even though they've seen a picture, know the cut, and know your preferred length, this detail can help them.",
        "If you've already decided what hair products you will be using, you may want to bring this up with them as well.",
        "If you want a flowing look, ask them to remove weight as well.",
        "If you want extra texture and a softer edge, ask them to point cut your tips as well.",
        "Try to make sure they use a razor.",
        "Ideally Surfer Hair isn't done with scissors, shears, or a clipper (exceptions exist when clippers are used like a razor).",
        "Cutting with a razor gives the hair the movement and separation necessary for a properly deconstructed look.",
        "If they use scissors make sure that they soften or feather the edges.",
        "Add lighter colored highlights if desired.",
        "Classic natural surfer hair gets slightly sun bleached, causing natural highlights.",
        "You can imitate this look by getting highlights.",
        "Don't make the highlights too vibrant though, Ideally, your highlights should be barely noticeable.",
        "You want it to emulate natural sun bleaching.",
        "Styling and Maintaining Your Hair Lightly dry your hair with a towel.",
        "Now that you have your cut, you'll need to know how to prepare your hair.",
        "After showering, start to dry your hair with a towel.",
        "Don't dry it completely though.",
        "It needs to be slightly damp.",
        "Apply your hair product.",
        "Some people can pull of the look without the help of product or the beach, but most can't.",
        "If you are like most people, you'll want to use a salt-infused matte finish product.",
        "This will leave your hair with a windblown and sunny beach look.",
        "Massage the gel into your hair.",
        "Work the your product through your hair.",
        "You'll want to use a light, texturing spray or gel.",
        "It'll often be marketed as a surf-style product.You don't need a ton of it.",
        "Too much gel will make your hair sticky.",
        "Start with a little and work in more if you need to.",
        "Make sure that it is evenly distributed by thoroughly massaging it through your hair with your fingertips.",
        "Most surfer hair style products will add body without clumping or getting crunchy.",
        "They also often feature a light matte finish, emphasizing texture and sheen while eliminating frizz.",
        "Dry your hair.",
        "The best way is to toss your hair and let it dry naturally, though you can also use a blow dryer with a diffuser if you need to speed the process.",
        "Either natural drying or using a diffuser will give your hair that tousled, surfer look."
    ]
}