{
    "title": "How to Use Herbs to Freshen the Air",
    "url": "https://www.wikihow.com/Use-Herbs-to-Freshen-the-Air",
    "category_hierarchy": [
        "Health",
        "Environmental Health",
        "Air Quality and Health"
    ],
    "methods": [
        {
            "name": "Making Potpourri",
            "steps": [
                {
                    "headline": "Mix your dried herbs together.",
                    "description": "In a bowl, fold together your chosen mix of dried herbs. Use whatever dried herbs you have on-hand from your garden. If you don’t have a garden, you could purchase some dried herbs from a grocery store. For instance, you could choose a selection of the following dried herbs and berries:\nChamomile flowers\nMyrtle leaf\nCinnamon chips\nMullein leaf\nOrris root powder\nHawthorn berries\nAllspice\nJuniper berries\nHibiscus flowers\nCedar leaf tips\nWhole cloves\nRose buds\nCardamom pods\nCinnamon chips"
                },
                {
                    "headline": "Dry herbs from your garden.",
                    "description": "Find a dry, breezy room in your house. Tie a small batch of herbs together with a piece of string. Loosely wrap the herbs in a paper bag. Hang the herbs upside down on the wall or on a clothesline. It should take about ten days for the herbs to dry. Avoid putting the herbs in a plastic bag, which will encourage mold growth."
                },
                {
                    "headline": "Find a balance of colors, textures, sizes and smells.",
                    "description": "A potpourri is an air freshener but is also used as a design element in your home, so you should attend to the visual appeal of the mixture. Try to find a balance between the different sizes, shapes, colors and smells in your potpourri. Combine fragrant herbs that mix well such as chamomile, dried peppermint leaves, lemon balm leaves, rosemary, bay leaves, cinnamon sticks and fennel seeds. If you like the smell at the spa, try mixing lemon, rosemary, cinnamon and vanilla. Try a mix of cinnamon, cloves, star anise, apples and oranges. Include flowers such as dried rose petals and visual elements such as pine cones."
                },
                {
                    "headline": "Make the fixative mixture.",
                    "description": "A fixative will help to enhance and seal the fragrance of your potpourri. You can use gum benzoin, cinnamon powder, vanilla pods, frankincense powder, myrrh gum powder, angelica root powder, benzoin gum powder or orris root powder for the main ingredient in your fixative. You can get these ingredients from a spice store. Add an essential oil and mix everything together with a whisk. Combine three tablespoons of orris root powder and some essential oils. You could try the following essential oil blend:\nTen drops of organic ginger\nTen drops of organic geranium\nTen drops of organic clove\nFour drops of organic douglas fir\nFour drops of organic lemon"
                },
                {
                    "headline": "Pour the fixative mixture over the herbs.",
                    "description": "Put on some gloves, such as kitchen or gardening gloves. Pour the fixative mixture over your chosen mix of herbs and berries. Fold the fixative mixture into the bowl of herbs until everything is thoroughly incorporated. You will need one ounce of fixative per batch of potpourri. One batch of potpourri is approximately four to six cups of dried ingredients."
                },
                {
                    "headline": "Arrange your potpourri.",
                    "description": "Put the potpourri in a nice display bowl. Move the herbs around until you are satisfied with the look of your bowl of potpourri. You could also store the extra potpourri in an airtight container. There is no guarantee it will last until you need it. However, you can always freshen it up by spraying the potpourri with some perfume. You could make little gift bags of potpourri for friends. Put some potpourri in a paper lunch bag and write your homemade recipe on the side."
                },
                {
                    "headline": "Add additional essential oils.",
                    "description": "Smell the bowl of potpourri. At this stage, you can add additional essential oils of your choice. Start by smelling your potpourri observing whether or not there is anything missing. If you feel it could use a hint of vanilla, for instance, add some vanilla essential oil."
                },
                {
                    "headline": "Display the potpourri.",
                    "description": "You could display the potpourri on a kitchen table, on a dining room table or on a side table in your bedroom. If you are using it at the office, you could place it on a coffee table or on an empty portion of your desk. Freshen your potpourri with some essential oil every few days. Sprinkle lavender oil, rosewater or verbena. You can find oils in health food stores. Add three drops of essential oil."
                }
            ]
        },
        {
            "name": "Simmering Herbs on the Stovetop",
            "steps": [
                {
                    "headline": "Fill a large cooking pot with water.",
                    "description": "Place the pot on the stove. Turn on the stove on a medium to low setting. Let the water simmer."
                },
                {
                    "headline": "Cut up some fruit.",
                    "description": "The fruit should be cut into quarter inch (6.35 millimeter) slices. You could use lemons, oranges, apples or other fruit of your choice. Use one piece of each fruit. Put the fruit into the pot. There is no specific amount of fruit to add to the mix. Add fruit until you get the smell you want to achieve."
                },
                {
                    "headline": "Add herbs to the pot.",
                    "description": "Once you have the pot simmering with a few fruit of your choice, go ahead and add some herbs. For instance, you could add some rosemary, cinnamon sticks, cardamom, basil or mint. Add a pinch or two of each of your favorite herbs. There is no specific amount of herbs to add for this recipe."
                },
                {
                    "headline": "Let the pot simmer.",
                    "description": "The house will fill up with the fragrant smells of the fruit and herbs in the pot. You can use the same pot the next day but you will need to add more water. The pot should be changed after three days. Keep an eye on the pot so you don’t burn it."
                },
                {
                    "headline": "Brew a cilantro mint mix.",
                    "description": "Put a few drops of mint extract into a pot of simmering water. Add some dried cilantro. Once you get a desired intensity of aroma, stop adding cilantro. It will add a wonderful smell to your home. There is no specific amount of cilantro or mint for this recipe. Continue adding the ingredients until you get the desired intensity of aroma."
                },
                {
                    "headline": "Make a parsley, sage, rosemary and thyme mix.",
                    "description": "Put a large pot on the stove and bring the water to a simmer. Add some parsley, sage, rosemary and thyme. Once you get the desired intensity of aroma, you can stop adding the herbs. Enjoy the fragrance. There is no specific amount of herbs to add. Keep adding herbs until you get the aroma you want."
                },
                {
                    "headline": "Make simmering cinnamon buns mix.",
                    "description": "Bring a pot of water to a simmer. Add cinnamon sticks, vanilla extract, almond extract and nutmeg. Once you get the aroma you want, stop adding the herbs. Let the mix fill your house with the smell of fall. If you like, you can also add a bit of apple cider to the simmering water."
                },
                {
                    "headline": "Boil cinnamon and cloves.",
                    "description": "Add a few sticks of cinnamon and some cloves to a simmering pot. The scent will freshen the air in your kitchen and throughout the entire house."
                }
            ]
        },
        {
            "name": "Making Herbal Sachets",
            "steps": [
                {
                    "headline": "Purchase some small bags with drawstrings.",
                    "description": "Get bags made from silk, muslin, cotton or lace. You can find them online or at craft stores. Herbal sachets cost around $3 or $4. You could also sew your own herbal sachets with burlap. Cut the burlap into small rectangular pieces. Sew three sides together. Leave an opening on one side, so that you can put the herbs inside."
                },
                {
                    "headline": "Choose your herbs.",
                    "description": "Lavender is a popular herb for sachets. You could also try peppermint, chamomile, eucalyptus or lemon balm. You might try mixing different herbs to suit your mood. Dried flower petals could also be added. If you are making herbal sachets to put in clothing drawers, you could mix lemon verbana, theme, spearmint, citrus peal, rose and lavender. Add a drop of pine essential oil. For protection, add a mix of hyssop, Saint John’s wort and sage. To encourage positivity, mix rosemary, sunflower and basil. For serenity, mix lavender, myrrh and sage. Try a blend of lavender, mint, sage, thyme, calendula, lemon verbena and any other herb that you find has a pleasing smell."
                },
                {
                    "headline": "Fill the sachets with herbs, sea salt and cinnamon.",
                    "description": "Put half a tablespoon of each herb you want to use. Then, add half a tablespoon of sea salt. Finally, a small cinnamon stick can be thrown in for purification. Pull the drawstring closed. If you like, you can also add a few drops of your favorite essential oils. Be careful not to put too many essential oils, since they could easily overpower the other herbs. If you need to suck bad odors out of something like shoes, you could also add some baking soda. There is no recommended amount but you could start with one tablespoon."
                },
                {
                    "headline": "Store the herbal sachets in a dry, warm, dark spot.",
                    "description": "To let the sachets cure, they should be stored for a few weeks in a dry place, such as underneath a bed or in a drawer. Afterwards, you can use them wherever you want to bring a fresh scent, such as a cupboard or wardrobe. You can tuck your sachet into a linen closet, underwear drawer or under your pillow."
                }
            ]
        },
        {
            "name": "Freshening Specific Rooms with Herbs",
            "steps": [
                {
                    "headline": "Put sprigs of fresh herbs in a vase.",
                    "description": "This will freshen the air in your dining room for as long as the herbs stay fresh. Try combining any of the following fresh herbs in a vase:\nSage\nRosemary\nOregano\nParsley\nBay leaves\nChives\nScented geranium\nThyme"
                },
                {
                    "headline": "Grow herbs in your kitchen.",
                    "description": "Set up a windowsill herb garden and grow basil, thyme, lavender, sage, mint and other fragrant plants. House plants are great for freshening the air and also help clean the air of formaldehyde and other volatile compounds. You will also have access to fresh herbs while you are cooking."
                },
                {
                    "headline": "Mix some sleeping dust for your bedroom.",
                    "description": "Mix half freshly ground herbs with half baking soda. After changing your sheets, sprinkle the mixture over your mattress. You could mix mint, lavender, lemon balm and rosemary in a blender"
                },
                {
                    "headline": "Put herbs in your fireplace.",
                    "description": "To give your living room a pleasant scent, put herbs in the fireplace. The best herbs to use are sage, rosemary, cinnamon and pine. Bundle your herbs into newspaper and tie the ends with twine or string. Arrange the bundle with your logs before you start your fire."
                },
                {
                    "headline": "Buy herbal products that can freshen the air naturally.",
                    "description": "Look for products that are non-toxic. You should be able to find herbal air fresheners in health food stores. Inspect the label and talk to a sales associate to be sure you are buying something natural and herbal. Try burning a soy candle that contains herbal oils. Look for herbal cleaning products such as dryer sheets and sprays."
                }
            ]
        }
    ],
    "tyn": [
        "To make potpourri, you’ll need herbs, twine and aromatherapy oils.",
        "To make herbal sachets, you’ll need herbs, herbal sachets and baking soda.",
        "To use fresh herbs, you’ll need a vase or a bowl.",
        "To put herbs in a fire, you’ll need newspaper."
    ],
    "text": " Making Potpourri Mix your dried herbs together. In a bowl, fold together your chosen mix of dried herbs. Use whatever dried herbs you have on-hand from your garden. If you don’t have a garden, you could purchase some dried herbs from a grocery store. For instance, you could choose a selection of the following dried herbs and berries:\nChamomile flowers\nMyrtle leaf\nCinnamon chips\nMullein leaf\nOrris root powder\nHawthorn berries\nAllspice\nJuniper berries\nHibiscus flowers\nCedar leaf tips\nWhole cloves\nRose buds\nCardamom pods\nCinnamon chips Dry herbs from your garden. Find a dry, breezy room in your house. Tie a small batch of herbs together with a piece of string. Loosely wrap the herbs in a paper bag. Hang the herbs upside down on the wall or on a clothesline. It should take about ten days for the herbs to dry. Avoid putting the herbs in a plastic bag, which will encourage mold growth. Find a balance of colors, textures, sizes and smells. A potpourri is an air freshener but is also used as a design element in your home, so you should attend to the visual appeal of the mixture. Try to find a balance between the different sizes, shapes, colors and smells in your potpourri. Combine fragrant herbs that mix well such as chamomile, dried peppermint leaves, lemon balm leaves, rosemary, bay leaves, cinnamon sticks and fennel seeds. If you like the smell at the spa, try mixing lemon, rosemary, cinnamon and vanilla. Try a mix of cinnamon, cloves, star anise, apples and oranges. Include flowers such as dried rose petals and visual elements such as pine cones. Make the fixative mixture. A fixative will help to enhance and seal the fragrance of your potpourri. You can use gum benzoin, cinnamon powder, vanilla pods, frankincense powder, myrrh gum powder, angelica root powder, benzoin gum powder or orris root powder for the main ingredient in your fixative. You can get these ingredients from a spice store. Add an essential oil and mix everything together with a whisk. Combine three tablespoons of orris root powder and some essential oils. You could try the following essential oil blend:\nTen drops of organic ginger\nTen drops of organic geranium\nTen drops of organic clove\nFour drops of organic douglas fir\nFour drops of organic lemon Pour the fixative mixture over the herbs. Put on some gloves, such as kitchen or gardening gloves. Pour the fixative mixture over your chosen mix of herbs and berries. Fold the fixative mixture into the bowl of herbs until everything is thoroughly incorporated. You will need one ounce of fixative per batch of potpourri. One batch of potpourri is approximately four to six cups of dried ingredients. Arrange your potpourri. Put the potpourri in a nice display bowl. Move the herbs around until you are satisfied with the look of your bowl of potpourri. You could also store the extra potpourri in an airtight container. There is no guarantee it will last until you need it. However, you can always freshen it up by spraying the potpourri with some perfume. You could make little gift bags of potpourri for friends. Put some potpourri in a paper lunch bag and write your homemade recipe on the side. Add additional essential oils. Smell the bowl of potpourri. At this stage, you can add additional essential oils of your choice. Start by smelling your potpourri observing whether or not there is anything missing. If you feel it could use a hint of vanilla, for instance, add some vanilla essential oil. Display the potpourri. You could display the potpourri on a kitchen table, on a dining room table or on a side table in your bedroom. If you are using it at the office, you could place it on a coffee table or on an empty portion of your desk. Freshen your potpourri with some essential oil every few days. Sprinkle lavender oil, rosewater or verbena. You can find oils in health food stores. Add three drops of essential oil. Simmering Herbs on the Stovetop Fill a large cooking pot with water. Place the pot on the stove. Turn on the stove on a medium to low setting. Let the water simmer. Cut up some fruit. The fruit should be cut into quarter inch (6.35 millimeter) slices. You could use lemons, oranges, apples or other fruit of your choice. Use one piece of each fruit. Put the fruit into the pot. There is no specific amount of fruit to add to the mix. Add fruit until you get the smell you want to achieve. Add herbs to the pot. Once you have the pot simmering with a few fruit of your choice, go ahead and add some herbs. For instance, you could add some rosemary, cinnamon sticks, cardamom, basil or mint. Add a pinch or two of each of your favorite herbs. There is no specific amount of herbs to add for this recipe. Let the pot simmer. The house will fill up with the fragrant smells of the fruit and herbs in the pot. You can use the same pot the next day but you will need to add more water. The pot should be changed after three days. Keep an eye on the pot so you don’t burn it. Brew a cilantro mint mix. Put a few drops of mint extract into a pot of simmering water. Add some dried cilantro. Once you get a desired intensity of aroma, stop adding cilantro. It will add a wonderful smell to your home. There is no specific amount of cilantro or mint for this recipe. Continue adding the ingredients until you get the desired intensity of aroma. Make a parsley, sage, rosemary and thyme mix. Put a large pot on the stove and bring the water to a simmer. Add some parsley, sage, rosemary and thyme. Once you get the desired intensity of aroma, you can stop adding the herbs. Enjoy the fragrance. There is no specific amount of herbs to add. Keep adding herbs until you get the aroma you want. Make simmering cinnamon buns mix. Bring a pot of water to a simmer. Add cinnamon sticks, vanilla extract, almond extract and nutmeg. Once you get the aroma you want, stop adding the herbs. Let the mix fill your house with the smell of fall. If you like, you can also add a bit of apple cider to the simmering water. Boil cinnamon and cloves. Add a few sticks of cinnamon and some cloves to a simmering pot. The scent will freshen the air in your kitchen and throughout the entire house. Making Herbal Sachets Purchase some small bags with drawstrings. Get bags made from silk, muslin, cotton or lace. You can find them online or at craft stores. Herbal sachets cost around $3 or $4. You could also sew your own herbal sachets with burlap. Cut the burlap into small rectangular pieces. Sew three sides together. Leave an opening on one side, so that you can put the herbs inside. Choose your herbs. Lavender is a popular herb for sachets. You could also try peppermint, chamomile, eucalyptus or lemon balm. You might try mixing different herbs to suit your mood. Dried flower petals could also be added. If you are making herbal sachets to put in clothing drawers, you could mix lemon verbana, theme, spearmint, citrus peal, rose and lavender. Add a drop of pine essential oil. For protection, add a mix of hyssop, Saint John’s wort and sage. To encourage positivity, mix rosemary, sunflower and basil. For serenity, mix lavender, myrrh and sage. Try a blend of lavender, mint, sage, thyme, calendula, lemon verbena and any other herb that you find has a pleasing smell. Fill the sachets with herbs, sea salt and cinnamon. Put half a tablespoon of each herb you want to use. Then, add half a tablespoon of sea salt. Finally, a small cinnamon stick can be thrown in for purification. Pull the drawstring closed. If you like, you can also add a few drops of your favorite essential oils. Be careful not to put too many essential oils, since they could easily overpower the other herbs. If you need to suck bad odors out of something like shoes, you could also add some baking soda. There is no recommended amount but you could start with one tablespoon. Store the herbal sachets in a dry, warm, dark spot. To let the sachets cure, they should be stored for a few weeks in a dry place, such as underneath a bed or in a drawer. Afterwards, you can use them wherever you want to bring a fresh scent, such as a cupboard or wardrobe. You can tuck your sachet into a linen closet, underwear drawer or under your pillow. Freshening Specific Rooms with Herbs Put sprigs of fresh herbs in a vase. This will freshen the air in your dining room for as long as the herbs stay fresh. Try combining any of the following fresh herbs in a vase:\nSage\nRosemary\nOregano\nParsley\nBay leaves\nChives\nScented geranium\nThyme Grow herbs in your kitchen. Set up a windowsill herb garden and grow basil, thyme, lavender, sage, mint and other fragrant plants. House plants are great for freshening the air and also help clean the air of formaldehyde and other volatile compounds. You will also have access to fresh herbs while you are cooking. Mix some sleeping dust for your bedroom. Mix half freshly ground herbs with half baking soda. After changing your sheets, sprinkle the mixture over your mattress. You could mix mint, lavender, lemon balm and rosemary in a blender Put herbs in your fireplace. To give your living room a pleasant scent, put herbs in the fireplace. The best herbs to use are sage, rosemary, cinnamon and pine. Bundle your herbs into newspaper and tie the ends with twine or string. Arrange the bundle with your logs before you start your fire. Buy herbal products that can freshen the air naturally. Look for products that are non-toxic. You should be able to find herbal air fresheners in health food stores. Inspect the label and talk to a sales associate to be sure you are buying something natural and herbal. Try burning a soy candle that contains herbal oils. Look for herbal cleaning products such as dryer sheets and sprays.",
    "sentences": [
        " Making Potpourri Mix your dried herbs together.",
        "In a bowl, fold together your chosen mix of dried herbs.",
        "Use whatever dried herbs you have on-hand from your garden.",
        "If you don’t have a garden, you could purchase some dried herbs from a grocery store.",
        "For instance, you could choose a selection of the following dried herbs and berries:\nChamomile flowers\nMyrtle leaf\nCinnamon chips\nMullein leaf\nOrris root powder\nHawthorn berries\nAllspice\nJuniper berries\nHibiscus flowers\nCedar leaf tips\nWhole cloves\nRose buds\nCardamom pods\nCinnamon chips Dry herbs from your garden.",
        "Find a dry, breezy room in your house.",
        "Tie a small batch of herbs together with a piece of string.",
        "Loosely wrap the herbs in a paper bag.",
        "Hang the herbs upside down on the wall or on a clothesline.",
        "It should take about ten days for the herbs to dry.",
        "Avoid putting the herbs in a plastic bag, which will encourage mold growth.",
        "Find a balance of colors, textures, sizes and smells.",
        "A potpourri is an air freshener but is also used as a design element in your home, so you should attend to the visual appeal of the mixture.",
        "Try to find a balance between the different sizes, shapes, colors and smells in your potpourri.",
        "Combine fragrant herbs that mix well such as chamomile, dried peppermint leaves, lemon balm leaves, rosemary, bay leaves, cinnamon sticks and fennel seeds.",
        "If you like the smell at the spa, try mixing lemon, rosemary, cinnamon and vanilla.",
        "Try a mix of cinnamon, cloves, star anise, apples and oranges.",
        "Include flowers such as dried rose petals and visual elements such as pine cones.",
        "Make the fixative mixture.",
        "A fixative will help to enhance and seal the fragrance of your potpourri.",
        "You can use gum benzoin, cinnamon powder, vanilla pods, frankincense powder, myrrh gum powder, angelica root powder, benzoin gum powder or orris root powder for the main ingredient in your fixative.",
        "You can get these ingredients from a spice store.",
        "Add an essential oil and mix everything together with a whisk.",
        "Combine three tablespoons of orris root powder and some essential oils.",
        "You could try the following essential oil blend:\nTen drops of organic ginger\nTen drops of organic geranium\nTen drops of organic clove\nFour drops of organic douglas fir\nFour drops of organic lemon Pour the fixative mixture over the herbs.",
        "Put on some gloves, such as kitchen or gardening gloves.",
        "Pour the fixative mixture over your chosen mix of herbs and berries.",
        "Fold the fixative mixture into the bowl of herbs until everything is thoroughly incorporated.",
        "You will need one ounce of fixative per batch of potpourri.",
        "One batch of potpourri is approximately four to six cups of dried ingredients.",
        "Arrange your potpourri.",
        "Put the potpourri in a nice display bowl.",
        "Move the herbs around until you are satisfied with the look of your bowl of potpourri.",
        "You could also store the extra potpourri in an airtight container.",
        "There is no guarantee it will last until you need it.",
        "However, you can always freshen it up by spraying the potpourri with some perfume.",
        "You could make little gift bags of potpourri for friends.",
        "Put some potpourri in a paper lunch bag and write your homemade recipe on the side.",
        "Add additional essential oils.",
        "Smell the bowl of potpourri.",
        "At this stage, you can add additional essential oils of your choice.",
        "Start by smelling your potpourri observing whether or not there is anything missing.",
        "If you feel it could use a hint of vanilla, for instance, add some vanilla essential oil.",
        "Display the potpourri.",
        "You could display the potpourri on a kitchen table, on a dining room table or on a side table in your bedroom.",
        "If you are using it at the office, you could place it on a coffee table or on an empty portion of your desk.",
        "Freshen your potpourri with some essential oil every few days.",
        "Sprinkle lavender oil, rosewater or verbena.",
        "You can find oils in health food stores.",
        "Add three drops of essential oil.",
        "Simmering Herbs on the Stovetop Fill a large cooking pot with water.",
        "Place the pot on the stove.",
        "Turn on the stove on a medium to low setting.",
        "Let the water simmer.",
        "Cut up some fruit.",
        "The fruit should be cut into quarter inch (6.35 millimeter) slices.",
        "You could use lemons, oranges, apples or other fruit of your choice.",
        "Use one piece of each fruit.",
        "Put the fruit into the pot.",
        "There is no specific amount of fruit to add to the mix.",
        "Add fruit until you get the smell you want to achieve.",
        "Add herbs to the pot.",
        "Once you have the pot simmering with a few fruit of your choice, go ahead and add some herbs.",
        "For instance, you could add some rosemary, cinnamon sticks, cardamom, basil or mint.",
        "Add a pinch or two of each of your favorite herbs.",
        "There is no specific amount of herbs to add for this recipe.",
        "Let the pot simmer.",
        "The house will fill up with the fragrant smells of the fruit and herbs in the pot.",
        "You can use the same pot the next day but you will need to add more water.",
        "The pot should be changed after three days.",
        "Keep an eye on the pot so you don’t burn it.",
        "Brew a cilantro mint mix.",
        "Put a few drops of mint extract into a pot of simmering water.",
        "Add some dried cilantro.",
        "Once you get a desired intensity of aroma, stop adding cilantro.",
        "It will add a wonderful smell to your home.",
        "There is no specific amount of cilantro or mint for this recipe.",
        "Continue adding the ingredients until you get the desired intensity of aroma.",
        "Make a parsley, sage, rosemary and thyme mix.",
        "Put a large pot on the stove and bring the water to a simmer.",
        "Add some parsley, sage, rosemary and thyme.",
        "Once you get the desired intensity of aroma, you can stop adding the herbs.",
        "Enjoy the fragrance.",
        "There is no specific amount of herbs to add.",
        "Keep adding herbs until you get the aroma you want.",
        "Make simmering cinnamon buns mix.",
        "Bring a pot of water to a simmer.",
        "Add cinnamon sticks, vanilla extract, almond extract and nutmeg.",
        "Once you get the aroma you want, stop adding the herbs.",
        "Let the mix fill your house with the smell of fall.",
        "If you like, you can also add a bit of apple cider to the simmering water.",
        "Boil cinnamon and cloves.",
        "Add a few sticks of cinnamon and some cloves to a simmering pot.",
        "The scent will freshen the air in your kitchen and throughout the entire house.",
        "Making Herbal Sachets Purchase some small bags with drawstrings.",
        "Get bags made from silk, muslin, cotton or lace.",
        "You can find them online or at craft stores.",
        "Herbal sachets cost around $3 or $4.",
        "You could also sew your own herbal sachets with burlap.",
        "Cut the burlap into small rectangular pieces.",
        "Sew three sides together.",
        "Leave an opening on one side, so that you can put the herbs inside.",
        "Choose your herbs.",
        "Lavender is a popular herb for sachets.",
        "You could also try peppermint, chamomile, eucalyptus or lemon balm.",
        "You might try mixing different herbs to suit your mood.",
        "Dried flower petals could also be added.",
        "If you are making herbal sachets to put in clothing drawers, you could mix lemon verbana, theme, spearmint, citrus peal, rose and lavender.",
        "Add a drop of pine essential oil.",
        "For protection, add a mix of hyssop, Saint John’s wort and sage.",
        "To encourage positivity, mix rosemary, sunflower and basil.",
        "For serenity, mix lavender, myrrh and sage.",
        "Try a blend of lavender, mint, sage, thyme, calendula, lemon verbena and any other herb that you find has a pleasing smell.",
        "Fill the sachets with herbs, sea salt and cinnamon.",
        "Put half a tablespoon of each herb you want to use.",
        "Then, add half a tablespoon of sea salt.",
        "Finally, a small cinnamon stick can be thrown in for purification.",
        "Pull the drawstring closed.",
        "If you like, you can also add a few drops of your favorite essential oils.",
        "Be careful not to put too many essential oils, since they could easily overpower the other herbs.",
        "If you need to suck bad odors out of something like shoes, you could also add some baking soda.",
        "There is no recommended amount but you could start with one tablespoon.",
        "Store the herbal sachets in a dry, warm, dark spot.",
        "To let the sachets cure, they should be stored for a few weeks in a dry place, such as underneath a bed or in a drawer.",
        "Afterwards, you can use them wherever you want to bring a fresh scent, such as a cupboard or wardrobe.",
        "You can tuck your sachet into a linen closet, underwear drawer or under your pillow.",
        "Freshening Specific Rooms with Herbs Put sprigs of fresh herbs in a vase.",
        "This will freshen the air in your dining room for as long as the herbs stay fresh.",
        "Try combining any of the following fresh herbs in a vase:\nSage\nRosemary\nOregano\nParsley\nBay leaves\nChives\nScented geranium\nThyme Grow herbs in your kitchen.",
        "Set up a windowsill herb garden and grow basil, thyme, lavender, sage, mint and other fragrant plants.",
        "House plants are great for freshening the air and also help clean the air of formaldehyde and other volatile compounds.",
        "You will also have access to fresh herbs while you are cooking.",
        "Mix some sleeping dust for your bedroom.",
        "Mix half freshly ground herbs with half baking soda.",
        "After changing your sheets, sprinkle the mixture over your mattress.",
        "You could mix mint, lavender, lemon balm and rosemary in a blender Put herbs in your fireplace.",
        "To give your living room a pleasant scent, put herbs in the fireplace.",
        "The best herbs to use are sage, rosemary, cinnamon and pine.",
        "Bundle your herbs into newspaper and tie the ends with twine or string.",
        "Arrange the bundle with your logs before you start your fire.",
        "Buy herbal products that can freshen the air naturally.",
        "Look for products that are non-toxic.",
        "You should be able to find herbal air fresheners in health food stores.",
        "Inspect the label and talk to a sales associate to be sure you are buying something natural and herbal.",
        "Try burning a soy candle that contains herbal oils.",
        "Look for herbal cleaning products such as dryer sheets and sprays."
    ]
}