{
    "title": "How to Install Adobe Acrobat",
    "url": "https://www.wikihow.com/Install-Adobe-Acrobat",
    "category_hierarchy": [
        "Computers and Electronics",
        "Software",
        "Adobe Software",
        "Adobe Acrobat"
    ],
    "steps": [
        {
            "headline": "Purchase the software from either your offline store, or the Adobe website.",
            "description": "They will eventually provide you with a pin. If you've bought Acrobat from an offline store, the Product ID will be on a sticker someplace inside the box."
        },
        {
            "headline": "Open the installer program via the disc or installation file the website provided.",
            "description": ""
        },
        {
            "headline": "Extract the files that were downloaded using the extractor program that Adobe provided.",
            "description": ""
        },
        {
            "headline": "Make sure the \"Launch Adobe Acrobat XI\" option is checked in the next dialog box.",
            "description": ""
        },
        {
            "headline": "Accept the User Account Control box for \"Adobe Acrobat Bootstrapper for Installer\".",
            "description": ""
        },
        {
            "headline": "Choose a language to be used for the installation program.",
            "description": "It'll default to English. Click OK when you've selected the correct language you'd like to use."
        },
        {
            "headline": "Click the \"Next\" button when  you see a page that looks a lot like a splash screen (but isn't really one).",
            "description": ""
        },
        {
            "headline": "Complete the information screen.",
            "description": "Provide the product key for your product, along with your name and organization. The key is 24 digits long and takes the form XXXX-XXXX-XXXX-XXXX-XXXX-XXXX (where X is a numerical value). Some of this information may be prefilled, depending on your operating systems setup \"behind the scenes\" information."
        },
        {
            "headline": "Read the activation page notice.",
            "description": ""
        },
        {
            "headline": "Choose the type of installation you'd like to use.",
            "description": "While most people are fine to use \"Typical\", some users might be requested to use \"Complete\" if they want to modify any of the existing settings."
        },
        {
            "headline": "Choose the destination folder where you'd like the product installed to.",
            "description": ""
        },
        {
            "headline": "Install the program.",
            "description": "Click the \"Install\" button."
        },
        {
            "headline": "Let the installer finish the installation.",
            "description": "The installation of this program and all of it's files could take a while. Don't install this program if you are in a rush. And definitely don't trust the time it takes for the installation to remain from the \"Time remaining\" informational line."
        },
        {
            "headline": "Follow the directions upon the finalizing screen.",
            "description": "Open the Adobe Acrobat program and accept the End User License Agreement (EULA), activate the program, and register the software. This step definitely isn't optional."
        }
    ],
    "tyn": [
        "Computer (PC or Mac)",
        "Adobe Acrobat software CD",
        "Computer mouse and keyboard"
    ],
    "text": " Purchase the software from either your offline store, or the Adobe website. They will eventually provide you with a pin. If you've bought Acrobat from an offline store, the Product ID will be on a sticker someplace inside the box. Open the installer program via the disc or installation file the website provided.  Extract the files that were downloaded using the extractor program that Adobe provided.  Make sure the \"Launch Adobe Acrobat XI\" option is checked in the next dialog box.  Accept the User Account Control box for \"Adobe Acrobat Bootstrapper for Installer\".  Choose a language to be used for the installation program. It'll default to English. Click OK when you've selected the correct language you'd like to use. Click the \"Next\" button when  you see a page that looks a lot like a splash screen (but isn't really one).  Complete the information screen. Provide the product key for your product, along with your name and organization. The key is 24 digits long and takes the form XXXX-XXXX-XXXX-XXXX-XXXX-XXXX (where X is a numerical value). Some of this information may be prefilled, depending on your operating systems setup \"behind the scenes\" information. Read the activation page notice.  Choose the type of installation you'd like to use. While most people are fine to use \"Typical\", some users might be requested to use \"Complete\" if they want to modify any of the existing settings. Choose the destination folder where you'd like the product installed to.  Install the program. Click the \"Install\" button. Let the installer finish the installation. The installation of this program and all of it's files could take a while. Don't install this program if you are in a rush. And definitely don't trust the time it takes for the installation to remain from the \"Time remaining\" informational line. Follow the directions upon the finalizing screen. Open the Adobe Acrobat program and accept the End User License Agreement (EULA), activate the program, and register the software. This step definitely isn't optional.",
    "sentences": [
        " Purchase the software from either your offline store, or the Adobe website.",
        "They will eventually provide you with a pin.",
        "If you've bought Acrobat from an offline store, the Product ID will be on a sticker someplace inside the box.",
        "Open the installer program via the disc or installation file the website provided.",
        "Extract the files that were downloaded using the extractor program that Adobe provided.",
        "Make sure the \"Launch Adobe Acrobat XI\" option is checked in the next dialog box.",
        "Accept the User Account Control box for \"Adobe Acrobat Bootstrapper for Installer\".",
        "Choose a language to be used for the installation program.",
        "It'll default to English.",
        "Click OK when you've selected the correct language you'd like to use.",
        "Click the \"Next\" button when  you see a page that looks a lot like a splash screen (but isn't really one).",
        "Complete the information screen.",
        "Provide the product key for your product, along with your name and organization.",
        "The key is 24 digits long and takes the form XXXX-XXXX-XXXX-XXXX-XXXX-XXXX (where X is a numerical value).",
        "Some of this information may be prefilled, depending on your operating systems setup \"behind the scenes\" information.",
        "Read the activation page notice.",
        "Choose the type of installation you'd like to use.",
        "While most people are fine to use \"Typical\", some users might be requested to use \"Complete\" if they want to modify any of the existing settings.",
        "Choose the destination folder where you'd like the product installed to.",
        "Install the program.",
        "Click the \"Install\" button.",
        "Let the installer finish the installation.",
        "The installation of this program and all of it's files could take a while.",
        "Don't install this program if you are in a rush.",
        "And definitely don't trust the time it takes for the installation to remain from the \"Time remaining\" informational line.",
        "Follow the directions upon the finalizing screen.",
        "Open the Adobe Acrobat program and accept the End User License Agreement (EULA), activate the program, and register the software.",
        "This step definitely isn't optional."
    ]
}