{
    "title": "How to Edit Text in Adobe Acrobat",
    "url": "https://www.wikihow.com/Edit-Text-in-Adobe-Acrobat",
    "category_hierarchy": [
        "Computers and Electronics",
        "Software",
        "Adobe Software",
        "Adobe Acrobat"
    ],
    "methods": [
        {
            "name": "Editing Text With Acrobat XI Pro",
            "steps": [
                {
                    "headline": "Launch Adobe Acrobat.",
                    "description": "Open the file that you would like to change/improve."
                },
                {
                    "headline": "Expand the Tools sidebar.",
                    "description": "At the top of the document, click on the Tools button. A sidebar will appear. Click on Content Editing to expand that field, then click in Edit Text & Images. The editable text blocks will be outlined."
                },
                {
                    "headline": "Edit the text.",
                    "description": "Select the text you wish to edit in the standard fashion: click to insert the cursor, click and drag to select multiple characters, double-click to select an entire word, or triple-click to select the entire text block."
                },
                {
                    "headline": "Adjust the text blocks.",
                    "description": "In Acrobat XI, the text now flows and wraps as one would expect. If you add or remove a significant amount of text, you will want to adjust the text blocks to fit the document."
                },
                {
                    "headline": "Click in a text block to select it.",
                    "description": "It will have a blue outline, with blue handles on the corners and centers. To adjust the size of a text block, click on a blue handle, and drag as necessary. To adjust the position of a text block, place your cursor over a horizontal or vertical line. The cursor will change to a cross, and you can drag the text block in any direction. Note the green guide lines—those help you keep your text aligned with other text objects on the page you're editing. Holding Shift will snap to horizontal or vertical dragging."
                },
                {
                    "headline": "Edit the font.",
                    "description": "Acrobat XI also makes it easy to edit font attributes. Select the word, phrase, or text block you want to edit, then adjust as desired from the Format panel."
                },
                {
                    "headline": "Don't forget to save your work!",
                    "description": ""
                }
            ]
        },
        {
            "name": "Earlier Versions of Acrobat Pro\\/Adobe Acrobat 8 and prior",
            "steps": [
                {
                    "headline": "Determine how much editing you'll need to do.",
                    "description": "The steps below for Basic Editing applies to those who only need to add or replace words, and don't need more advanced text editing options. The steps below for Advanced Editing apply to text edits that require additional tools such as changing the font style, color, or other options. those used solely by the Basic Editing tools."
                },
                {
                    "headline": "Realize that not all PDF documents are editable.",
                    "description": "There are some documents that can't be modified, even with Acrobat Pro."
                },
                {
                    "headline": "Launch Adobe Acrobat.",
                    "description": ""
                },
                {
                    "headline": "Open the document containing the text that needs to be edited.",
                    "description": ""
                },
                {
                    "headline": "Select the TouchUp Text Tool.",
                    "description": "Click on the Tools menu, then select Advanced Editing > TouchUp Text Tool from the pop out menu."
                },
                {
                    "headline": "Wait for the editor to initialize.",
                    "description": "This should only take a few moments to complete."
                },
                {
                    "headline": "Select the word or phrase that you need to change.",
                    "description": "Double-click the text, or click and drag the text to highlight the phrase."
                },
                {
                    "headline": "Type to replace the selected text.",
                    "description": ""
                },
                {
                    "headline": "Launch Adobe Acrobat.",
                    "description": ""
                },
                {
                    "headline": "Open the document containing the text that needs to be edited.",
                    "description": ""
                },
                {
                    "headline": "Select the TouchUp Text Tool.",
                    "description": "Click on the Tools menu, then select Advanced Editing > TouchUp Text Tool from the pop out menu."
                },
                {
                    "headline": "Wait for the editor to initialize.",
                    "description": "This should only take a few moments to complete."
                },
                {
                    "headline": "Select the word or phrase that you need to change.",
                    "description": "Double-click the text, or click and drag the text to highlight the phrase."
                },
                {
                    "headline": "Right-click the selected text.",
                    "description": ""
                },
                {
                    "headline": "Select \"Properties\" from the menu.",
                    "description": "You can change the font type by clicking the drop-down menu at the top of the dialog box and selecting your font you'd like to use. You can change the font size by clicking the \"Font Size\" box and typing your specified new value. You can change the font color by selecting the \"Fill\" box and selecting a new color. There are also other changes that you can make, such as character spacing, word spacing, horizontal scaling, stroke color (useful for bolding a phrase, since there isn't a bold or italic option available for editing), stroke width, and baseline offset size. You can also embed the font into your document, however, most documents won't need their font to be embedded to be effectively viewed and understood."
                }
            ]
        }
    ],
    "tyn": [
        "Adobe Acrobat program",
        "PDF file",
        "computer mouse and keyboard"
    ],
    "text": " Editing Text With Acrobat XI Pro Launch Adobe Acrobat. Open the file that you would like to change/improve. Expand the Tools sidebar. At the top of the document, click on the Tools button. A sidebar will appear. Click on Content Editing to expand that field, then click in Edit Text & Images. The editable text blocks will be outlined. Edit the text. Select the text you wish to edit in the standard fashion: click to insert the cursor, click and drag to select multiple characters, double-click to select an entire word, or triple-click to select the entire text block. Adjust the text blocks. In Acrobat XI, the text now flows and wraps as one would expect. If you add or remove a significant amount of text, you will want to adjust the text blocks to fit the document. Click in a text block to select it. It will have a blue outline, with blue handles on the corners and centers. To adjust the size of a text block, click on a blue handle, and drag as necessary. To adjust the position of a text block, place your cursor over a horizontal or vertical line. The cursor will change to a cross, and you can drag the text block in any direction. Note the green guide lines—those help you keep your text aligned with other text objects on the page you're editing. Holding Shift will snap to horizontal or vertical dragging. Edit the font. Acrobat XI also makes it easy to edit font attributes. Select the word, phrase, or text block you want to edit, then adjust as desired from the Format panel. Don't forget to save your work!  Earlier Versions of Acrobat Pro\\/Adobe Acrobat 8 and prior Determine how much editing you'll need to do. The steps below for Basic Editing applies to those who only need to add or replace words, and don't need more advanced text editing options. The steps below for Advanced Editing apply to text edits that require additional tools such as changing the font style, color, or other options. those used solely by the Basic Editing tools. Realize that not all PDF documents are editable. There are some documents that can't be modified, even with Acrobat Pro. Launch Adobe Acrobat.  Open the document containing the text that needs to be edited.  Select the TouchUp Text Tool. Click on the Tools menu, then select Advanced Editing > TouchUp Text Tool from the pop out menu. Wait for the editor to initialize. This should only take a few moments to complete. Select the word or phrase that you need to change. Double-click the text, or click and drag the text to highlight the phrase. Type to replace the selected text.  Launch Adobe Acrobat.  Open the document containing the text that needs to be edited.  Select the TouchUp Text Tool. Click on the Tools menu, then select Advanced Editing > TouchUp Text Tool from the pop out menu. Wait for the editor to initialize. This should only take a few moments to complete. Select the word or phrase that you need to change. Double-click the text, or click and drag the text to highlight the phrase. Right-click the selected text.  Select \"Properties\" from the menu. You can change the font type by clicking the drop-down menu at the top of the dialog box and selecting your font you'd like to use. You can change the font size by clicking the \"Font Size\" box and typing your specified new value. You can change the font color by selecting the \"Fill\" box and selecting a new color. There are also other changes that you can make, such as character spacing, word spacing, horizontal scaling, stroke color (useful for bolding a phrase, since there isn't a bold or italic option available for editing), stroke width, and baseline offset size. You can also embed the font into your document, however, most documents won't need their font to be embedded to be effectively viewed and understood.",
    "sentences": [
        " Editing Text With Acrobat XI Pro Launch Adobe Acrobat.",
        "Open the file that you would like to change/improve.",
        "Expand the Tools sidebar.",
        "At the top of the document, click on the Tools button.",
        "A sidebar will appear.",
        "Click on Content Editing to expand that field, then click in Edit Text & Images.",
        "The editable text blocks will be outlined.",
        "Edit the text.",
        "Select the text you wish to edit in the standard fashion: click to insert the cursor, click and drag to select multiple characters, double-click to select an entire word, or triple-click to select the entire text block.",
        "Adjust the text blocks.",
        "In Acrobat XI, the text now flows and wraps as one would expect.",
        "If you add or remove a significant amount of text, you will want to adjust the text blocks to fit the document.",
        "Click in a text block to select it.",
        "It will have a blue outline, with blue handles on the corners and centers.",
        "To adjust the size of a text block, click on a blue handle, and drag as necessary.",
        "To adjust the position of a text block, place your cursor over a horizontal or vertical line.",
        "The cursor will change to a cross, and you can drag the text block in any direction.",
        "Note the green guide lines—those help you keep your text aligned with other text objects on the page you're editing.",
        "Holding Shift will snap to horizontal or vertical dragging.",
        "Edit the font.",
        "Acrobat XI also makes it easy to edit font attributes.",
        "Select the word, phrase, or text block you want to edit, then adjust as desired from the Format panel.",
        "Don't forget to save your work!",
        "Earlier Versions of Acrobat Pro\\/Adobe Acrobat 8 and prior Determine how much editing you'll need to do.",
        "The steps below for Basic Editing applies to those who only need to add or replace words, and don't need more advanced text editing options.",
        "The steps below for Advanced Editing apply to text edits that require additional tools such as changing the font style, color, or other options.",
        "those used solely by the Basic Editing tools.",
        "Realize that not all PDF documents are editable.",
        "There are some documents that can't be modified, even with Acrobat Pro.",
        "Launch Adobe Acrobat.",
        "Open the document containing the text that needs to be edited.",
        "Select the TouchUp Text Tool.",
        "Click on the Tools menu, then select Advanced Editing > TouchUp Text Tool from the pop out menu.",
        "Wait for the editor to initialize.",
        "This should only take a few moments to complete.",
        "Select the word or phrase that you need to change.",
        "Double-click the text, or click and drag the text to highlight the phrase.",
        "Type to replace the selected text.",
        "Launch Adobe Acrobat.",
        "Open the document containing the text that needs to be edited.",
        "Select the TouchUp Text Tool.",
        "Click on the Tools menu, then select Advanced Editing > TouchUp Text Tool from the pop out menu.",
        "Wait for the editor to initialize.",
        "This should only take a few moments to complete.",
        "Select the word or phrase that you need to change.",
        "Double-click the text, or click and drag the text to highlight the phrase.",
        "Right-click the selected text.",
        "Select \"Properties\" from the menu.",
        "You can change the font type by clicking the drop-down menu at the top of the dialog box and selecting your font you'd like to use.",
        "You can change the font size by clicking the \"Font Size\" box and typing your specified new value.",
        "You can change the font color by selecting the \"Fill\" box and selecting a new color.",
        "There are also other changes that you can make, such as character spacing, word spacing, horizontal scaling, stroke color (useful for bolding a phrase, since there isn't a bold or italic option available for editing), stroke width, and baseline offset size.",
        "You can also embed the font into your document, however, most documents won't need their font to be embedded to be effectively viewed and understood."
    ]
}