{
    "title": "How to Make a \"Grilled\" Cheese Sandwich in a Toaster Oven",
    "url": "https://www.wikihow.com/Make-a-%22Grilled%22-Cheese-Sandwich-in-a-Toaster-Oven",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Sandwiches and Quick Meals",
        "Cheese Sandwiches"
    ],
    "methods": [
        {
            "name": "Classic Grilled Cheese",
            "steps": [
                {
                    "headline": "Preheat the oven to 450 °F (232 °C) and put the baking sheet inside.",
                    "description": "Set the toaster oven’s temperature to 450 °F (232 °C) and move the cooking rack into the lowest position. Then, put a baking sheet on the rack and let it preheat along with the oven. The lowest rack position is closest to the heating element inside the toaster oven. You may want to confirm the location of the heating element, though, since some toaster ovens may vary. Preheating the baking sheet creates a \"mini griddle\" that will result crisp, golden brown bread."
                },
                {
                    "headline": "Butter 1 side of each bread slice.",
                    "description": "Let the butter sit out at room temperature for 30 minutes so it will soften. Place your bread on a clean, flat surface, like a countertop, cutting board, or plate, and butter the top sides of the slices only. Use about 1 teaspoon of softened butter per slice. Consider using hearty multigrain bread instead of white bread, since it crisps up better and contributes more flavor. Ciabatta and brioche, while not quite as healthy as multigrain bread, are also delicious options!"
                },
                {
                    "headline": "Flip 1 piece of bread buttered-side-down and top with 2 cheese slices.",
                    "description": "Carefully place 1 of your bread slices on the flat surface so that the buttered side is facing down. Layer 2 slices of provolone (or the cheese of your choice) on top of the bread slice. A hard cheese, like cheddar or Swiss, cut into standard or semi-thick slices is ideal. Slices of cheddar or Swiss work great. You can also mix cheeses, if you like. Avoid using shredded cheese, since it will melt too quickly and create a mess."
                },
                {
                    "headline": "Top the cheese with the remaining bread slice, buttered-side-up.",
                    "description": "Line up the second slice of bread with the first one, directly on top of the cheese slices. Be sure to position the bread with the buttered side up so that your bread will toast properly."
                },
                {
                    "headline": "Put the sandwich on the preheated pan and place it in the oven.",
                    "description": "Put on oven mitts and pull the hot baking sheet out of your toaster oven. Carefully place the grilled cheese on the hot surface and return the baking sheet to lowest rack position."
                },
                {
                    "headline": "Toast the first side of the sandwich for about 4 minutes.",
                    "description": "After 4 minutes, open the oven door and lift the sandwich with a spatula so you can take a look at the bottom of the bread. It’s ready to flip once the bottom gets toasted and browned."
                },
                {
                    "headline": "Flip the grilled cheese with a spatula and toast it for 3-4 minutes.",
                    "description": "Keeping your oven mitts on, open the toaster oven and remove the baking sheet. Use a spatula to flip the sandwich over so that the other side can get crispy and browned. The cheese should be melted once both bread slices are nice and golden. The melted cheese “seals” the sandwich together. If the sandwich doesn't look quite done yet, put it back into the toaster oven in 1-minute intervals."
                },
                {
                    "headline": "Cool the sandwich for 1-2 minutes and serve it immediately.",
                    "description": "Transfer the toasted grilled cheese to a serving plate. Use a knife to cut it down the middle, then let it cool for a few minutes, since it will be very hot. Enjoy the sandwich while it’s still warm! Round out your meal with your favorite chips, chopped veggies, sliced fruit, or your favorite soup."
                }
            ]
        },
        {
            "name": "Healthy Grilled Cheese with Swiss Chard",
            "steps": [
                {
                    "headline": "Preheat the toaster oven to 450 °F (232 °C).",
                    "description": "Set the oven to the correct temperature and let it heat up while you assemble the sandwich. You’ll be putting the sandwich directly onto the hot rack inside the oven, so you don’t need to prepare a baking sheet. If you want to ensure a super crispy sandwich, preheat a baking sheet in the oven and cook the sandwich on that instead of the rack."
                },
                {
                    "headline": "Heat the olive oil over medium-low heat.",
                    "description": "Measure out 2 teaspoons of olive oil and pour it into a large skillet. Place the skillet on a burner and set the heat to medium-high. You'll know the oil is ready when it starts to shimmer. This usually takes about 3 minutes."
                },
                {
                    "headline": "Place the garlic and Swiss chard in the skillet and cook for 5 minutes.",
                    "description": "Mince the clove of garlic. Wash and slice up the Swiss chard, then place both into the skillet. Saute them until the Swiss chard wilts."
                },
                {
                    "headline": "Put 1 bread slice on the hot rack and top with cheese, chard, and tomato.",
                    "description": "Cut a tomato to get 2 thin slices. Place the bread directly on the oven rack and add the cheese, followed by the chard mixture on top.Then, place the tomato slices on top of the chard mixture. You can use any kind of bread you like, such as whole-grain or multi-grain. You can also use cheese other than Swiss, if you prefer, like white or sharp cheddar."
                },
                {
                    "headline": "Place the other slice of bread right next to the first one on the rack.",
                    "description": "You don’t need to put the top slice of bread on the sandwich yet. Instead, place it right next to the sandwich, directly on the hot rack. This gives the cheese a chance to fully melt and helps ensure a golden, toasty finish for your bread slices."
                },
                {
                    "headline": "Toast the sandwich for 4-5 minutes until the cheese melts.",
                    "description": "Keep an eye on your sandwich so that it doesn’t overcook. You’ll know it’s ready to take out once the cheese has melted and both slices of bread are golden brown. Use a spatula to lift up the bread and check how browned it is."
                },
                {
                    "headline": "Top the sandwich with the plain slice of bread and enjoy!",
                    "description": "Use a spatula to transfer the sandwich to a serving plate. Then, add the other toasted slice right on top to complete your sandwich. Use a sharp knife to cut the grilled cheese in half before serving it. Give the sandwich a few minutes to cool down before digging in! The cheese will be very hot. Serve the sandwich with healthy sides like chopped, raw veggies or a side salad with your favorite dressing."
                }
            ]
        }
    ],
    "tyn": [
        "Classic Grilled Cheese",
        "Toaster oven",
        "Knife",
        "Cutting board",
        "Baking sheet",
        "Spatula",
        "Oven mitts",
        "Healthy Grilled Cheese with Swiss Chard",
        "Large skillet"
    ],
    "text": " Classic Grilled Cheese Preheat the oven to 450 °F (232 °C) and put the baking sheet inside. Set the toaster oven’s temperature to 450 °F (232 °C) and move the cooking rack into the lowest position. Then, put a baking sheet on the rack and let it preheat along with the oven. The lowest rack position is closest to the heating element inside the toaster oven. You may want to confirm the location of the heating element, though, since some toaster ovens may vary. Preheating the baking sheet creates a \"mini griddle\" that will result crisp, golden brown bread. Butter 1 side of each bread slice. Let the butter sit out at room temperature for 30 minutes so it will soften. Place your bread on a clean, flat surface, like a countertop, cutting board, or plate, and butter the top sides of the slices only. Use about 1 teaspoon of softened butter per slice. Consider using hearty multigrain bread instead of white bread, since it crisps up better and contributes more flavor. Ciabatta and brioche, while not quite as healthy as multigrain bread, are also delicious options! Flip 1 piece of bread buttered-side-down and top with 2 cheese slices. Carefully place 1 of your bread slices on the flat surface so that the buttered side is facing down. Layer 2 slices of provolone (or the cheese of your choice) on top of the bread slice. A hard cheese, like cheddar or Swiss, cut into standard or semi-thick slices is ideal. Slices of cheddar or Swiss work great. You can also mix cheeses, if you like. Avoid using shredded cheese, since it will melt too quickly and create a mess. Top the cheese with the remaining bread slice, buttered-side-up. Line up the second slice of bread with the first one, directly on top of the cheese slices. Be sure to position the bread with the buttered side up so that your bread will toast properly. Put the sandwich on the preheated pan and place it in the oven. Put on oven mitts and pull the hot baking sheet out of your toaster oven. Carefully place the grilled cheese on the hot surface and return the baking sheet to lowest rack position. Toast the first side of the sandwich for about 4 minutes. After 4 minutes, open the oven door and lift the sandwich with a spatula so you can take a look at the bottom of the bread. It’s ready to flip once the bottom gets toasted and browned. Flip the grilled cheese with a spatula and toast it for 3-4 minutes. Keeping your oven mitts on, open the toaster oven and remove the baking sheet. Use a spatula to flip the sandwich over so that the other side can get crispy and browned. The cheese should be melted once both bread slices are nice and golden. The melted cheese “seals” the sandwich together. If the sandwich doesn't look quite done yet, put it back into the toaster oven in 1-minute intervals. Cool the sandwich for 1-2 minutes and serve it immediately. Transfer the toasted grilled cheese to a serving plate. Use a knife to cut it down the middle, then let it cool for a few minutes, since it will be very hot. Enjoy the sandwich while it’s still warm! Round out your meal with your favorite chips, chopped veggies, sliced fruit, or your favorite soup. Healthy Grilled Cheese with Swiss Chard Preheat the toaster oven to 450 °F (232 °C). Set the oven to the correct temperature and let it heat up while you assemble the sandwich. You’ll be putting the sandwich directly onto the hot rack inside the oven, so you don’t need to prepare a baking sheet. If you want to ensure a super crispy sandwich, preheat a baking sheet in the oven and cook the sandwich on that instead of the rack. Heat the olive oil over medium-low heat. Measure out 2 teaspoons of olive oil and pour it into a large skillet. Place the skillet on a burner and set the heat to medium-high. You'll know the oil is ready when it starts to shimmer. This usually takes about 3 minutes. Place the garlic and Swiss chard in the skillet and cook for 5 minutes. Mince the clove of garlic. Wash and slice up the Swiss chard, then place both into the skillet. Saute them until the Swiss chard wilts. Put 1 bread slice on the hot rack and top with cheese, chard, and tomato. Cut a tomato to get 2 thin slices. Place the bread directly on the oven rack and add the cheese, followed by the chard mixture on top.Then, place the tomato slices on top of the chard mixture. You can use any kind of bread you like, such as whole-grain or multi-grain. You can also use cheese other than Swiss, if you prefer, like white or sharp cheddar. Place the other slice of bread right next to the first one on the rack. You don’t need to put the top slice of bread on the sandwich yet. Instead, place it right next to the sandwich, directly on the hot rack. This gives the cheese a chance to fully melt and helps ensure a golden, toasty finish for your bread slices. Toast the sandwich for 4-5 minutes until the cheese melts. Keep an eye on your sandwich so that it doesn’t overcook. You’ll know it’s ready to take out once the cheese has melted and both slices of bread are golden brown. Use a spatula to lift up the bread and check how browned it is. Top the sandwich with the plain slice of bread and enjoy! Use a spatula to transfer the sandwich to a serving plate. Then, add the other toasted slice right on top to complete your sandwich. Use a sharp knife to cut the grilled cheese in half before serving it. Give the sandwich a few minutes to cool down before digging in! The cheese will be very hot. Serve the sandwich with healthy sides like chopped, raw veggies or a side salad with your favorite dressing.",
    "sentences": [
        " Classic Grilled Cheese Preheat the oven to 450 °F (232 °C) and put the baking sheet inside.",
        "Set the toaster oven’s temperature to 450 °F (232 °C) and move the cooking rack into the lowest position.",
        "Then, put a baking sheet on the rack and let it preheat along with the oven.",
        "The lowest rack position is closest to the heating element inside the toaster oven.",
        "You may want to confirm the location of the heating element, though, since some toaster ovens may vary.",
        "Preheating the baking sheet creates a \"mini griddle\" that will result crisp, golden brown bread.",
        "Butter 1 side of each bread slice.",
        "Let the butter sit out at room temperature for 30 minutes so it will soften.",
        "Place your bread on a clean, flat surface, like a countertop, cutting board, or plate, and butter the top sides of the slices only.",
        "Use about 1 teaspoon of softened butter per slice.",
        "Consider using hearty multigrain bread instead of white bread, since it crisps up better and contributes more flavor.",
        "Ciabatta and brioche, while not quite as healthy as multigrain bread, are also delicious options!",
        "Flip 1 piece of bread buttered-side-down and top with 2 cheese slices.",
        "Carefully place 1 of your bread slices on the flat surface so that the buttered side is facing down.",
        "Layer 2 slices of provolone (or the cheese of your choice) on top of the bread slice.",
        "A hard cheese, like cheddar or Swiss, cut into standard or semi-thick slices is ideal.",
        "Slices of cheddar or Swiss work great.",
        "You can also mix cheeses, if you like.",
        "Avoid using shredded cheese, since it will melt too quickly and create a mess.",
        "Top the cheese with the remaining bread slice, buttered-side-up.",
        "Line up the second slice of bread with the first one, directly on top of the cheese slices.",
        "Be sure to position the bread with the buttered side up so that your bread will toast properly.",
        "Put the sandwich on the preheated pan and place it in the oven.",
        "Put on oven mitts and pull the hot baking sheet out of your toaster oven.",
        "Carefully place the grilled cheese on the hot surface and return the baking sheet to lowest rack position.",
        "Toast the first side of the sandwich for about 4 minutes.",
        "After 4 minutes, open the oven door and lift the sandwich with a spatula so you can take a look at the bottom of the bread.",
        "It’s ready to flip once the bottom gets toasted and browned.",
        "Flip the grilled cheese with a spatula and toast it for 3-4 minutes.",
        "Keeping your oven mitts on, open the toaster oven and remove the baking sheet.",
        "Use a spatula to flip the sandwich over so that the other side can get crispy and browned.",
        "The cheese should be melted once both bread slices are nice and golden.",
        "The melted cheese “seals” the sandwich together.",
        "If the sandwich doesn't look quite done yet, put it back into the toaster oven in 1-minute intervals.",
        "Cool the sandwich for 1-2 minutes and serve it immediately.",
        "Transfer the toasted grilled cheese to a serving plate.",
        "Use a knife to cut it down the middle, then let it cool for a few minutes, since it will be very hot.",
        "Enjoy the sandwich while it’s still warm!",
        "Round out your meal with your favorite chips, chopped veggies, sliced fruit, or your favorite soup.",
        "Healthy Grilled Cheese with Swiss Chard Preheat the toaster oven to 450 °F (232 °C).",
        "Set the oven to the correct temperature and let it heat up while you assemble the sandwich.",
        "You’ll be putting the sandwich directly onto the hot rack inside the oven, so you don’t need to prepare a baking sheet.",
        "If you want to ensure a super crispy sandwich, preheat a baking sheet in the oven and cook the sandwich on that instead of the rack.",
        "Heat the olive oil over medium-low heat.",
        "Measure out 2 teaspoons of olive oil and pour it into a large skillet.",
        "Place the skillet on a burner and set the heat to medium-high.",
        "You'll know the oil is ready when it starts to shimmer.",
        "This usually takes about 3 minutes.",
        "Place the garlic and Swiss chard in the skillet and cook for 5 minutes.",
        "Mince the clove of garlic.",
        "Wash and slice up the Swiss chard, then place both into the skillet.",
        "Saute them until the Swiss chard wilts.",
        "Put 1 bread slice on the hot rack and top with cheese, chard, and tomato.",
        "Cut a tomato to get 2 thin slices.",
        "Place the bread directly on the oven rack and add the cheese, followed by the chard mixture on top.Then, place the tomato slices on top of the chard mixture.",
        "You can use any kind of bread you like, such as whole-grain or multi-grain.",
        "You can also use cheese other than Swiss, if you prefer, like white or sharp cheddar.",
        "Place the other slice of bread right next to the first one on the rack.",
        "You don’t need to put the top slice of bread on the sandwich yet.",
        "Instead, place it right next to the sandwich, directly on the hot rack.",
        "This gives the cheese a chance to fully melt and helps ensure a golden, toasty finish for your bread slices.",
        "Toast the sandwich for 4-5 minutes until the cheese melts.",
        "Keep an eye on your sandwich so that it doesn’t overcook.",
        "You’ll know it’s ready to take out once the cheese has melted and both slices of bread are golden brown.",
        "Use a spatula to lift up the bread and check how browned it is.",
        "Top the sandwich with the plain slice of bread and enjoy!",
        "Use a spatula to transfer the sandwich to a serving plate.",
        "Then, add the other toasted slice right on top to complete your sandwich.",
        "Use a sharp knife to cut the grilled cheese in half before serving it.",
        "Give the sandwich a few minutes to cool down before digging in!",
        "The cheese will be very hot.",
        "Serve the sandwich with healthy sides like chopped, raw veggies or a side salad with your favorite dressing."
    ]
}