{
    "title": "How to Design a Website Template",
    "url": "https://www.wikihow.com/Design-a-Website-Template",
    "category_hierarchy": [
        "Computers and Electronics",
        "Internet",
        "Website and Blog Creation",
        "Creating and Enhancing a Website"
    ],
    "steps": [
        {
            "headline": "Decide what your website topic is.",
            "description": "There are millions of different kinds of websites that you can choose to your liking."
        },
        {
            "headline": "Find the right color scheme.",
            "description": "Try using colors that will pop out, like blue, purple or orange. You can also adjust the color to the topic of your website."
        },
        {
            "headline": "Decide what kind of navigation bar to use.",
            "description": "Make sure it has useful resources, such as home, comments, and more."
        },
        {
            "headline": "Mock up how your website will be laid out in a graphic editing program.",
            "description": "Just like the topics, there are wide choices on how you would like the layout of each page to be."
        },
        {
            "headline": "Create the page in HTML.",
            "description": "You can also create it by going onto Google websites. Be sure to pick a creative name too!"
        },
        {
            "headline": "Create a style sheet in CSS.",
            "description": ""
        },
        {
            "headline": "Duplicate the HTML page for the other pages and add content.",
            "description": "This article is just an in-depth for layouts."
        }
    ],
    "tyn": [
        "Knowledge of HTML and CSS",
        "A good graphics program. (not MS Paint)",
        "A website host to host you"
    ],
    "text": " Decide what your website topic is. There are millions of different kinds of websites that you can choose to your liking. Find the right color scheme. Try using colors that will pop out, like blue, purple or orange. You can also adjust the color to the topic of your website. Decide what kind of navigation bar to use. Make sure it has useful resources, such as home, comments, and more. Mock up how your website will be laid out in a graphic editing program. Just like the topics, there are wide choices on how you would like the layout of each page to be. Create the page in HTML. You can also create it by going onto Google websites. Be sure to pick a creative name too! Create a style sheet in CSS.  Duplicate the HTML page for the other pages and add content. This article is just an in-depth for layouts.",
    "sentences": [
        " Decide what your website topic is.",
        "There are millions of different kinds of websites that you can choose to your liking.",
        "Find the right color scheme.",
        "Try using colors that will pop out, like blue, purple or orange.",
        "You can also adjust the color to the topic of your website.",
        "Decide what kind of navigation bar to use.",
        "Make sure it has useful resources, such as home, comments, and more.",
        "Mock up how your website will be laid out in a graphic editing program.",
        "Just like the topics, there are wide choices on how you would like the layout of each page to be.",
        "Create the page in HTML.",
        "You can also create it by going onto Google websites.",
        "Be sure to pick a creative name too!",
        "Create a style sheet in CSS.",
        "Duplicate the HTML page for the other pages and add content.",
        "This article is just an in-depth for layouts."
    ]
}