{
    "title": "How to Make Deluxe Hot Chocolate",
    "url": "https://www.wikihow.com/Make-Deluxe-Hot-Chocolate",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Chocolate and Cocoa Drinks"
    ],
    "methods": [
        {
            "name": "Deluxe Hot Chocolate",
            "steps": [
                {
                    "headline": "Fill the bottom of the mug with marshmallow fluff.",
                    "description": "You shouldn't see the bottom but you should still have plenty of space left above the fluff."
                },
                {
                    "headline": "Take some whipped cream and add about the same amount as the fluff.",
                    "description": ""
                },
                {
                    "headline": "Add some small chocolate sweets such as M&M's, Smarties or a few small blocks of chocolate.",
                    "description": "Not too much though, make sure it's flat."
                },
                {
                    "headline": "Add two tablespoons of the hot chocolate powder (Milo, Hershey's, Swiss Miss etc.)",
                    "description": ""
                },
                {
                    "headline": "Pour in a lot of hot water (but don't fill the cup yet).",
                    "description": ""
                },
                {
                    "headline": "Add in some milk, preferably full cream.",
                    "description": ""
                },
                {
                    "headline": "Add some sprinkles of your choice, like cinnamon sprinkles or chocolate vermicelli.",
                    "description": ""
                },
                {
                    "headline": "Add a few big marshmallows or lots of mini ones.",
                    "description": ""
                },
                {
                    "headline": "Enjoy!",
                    "description": ""
                }
            ]
        },
        {
            "name": "Ultra Creamy and Silky Hot Chocolate",
            "steps": [
                {
                    "headline": "Three quarter fill a mug with milk.",
                    "description": "Any kind of milk is fine."
                },
                {
                    "headline": "Put this in your microwave for 50-60 seconds.",
                    "description": "Then remove it."
                },
                {
                    "headline": "Add a level teaspoonful of cocoa powder.",
                    "description": "Again, any kind is good."
                },
                {
                    "headline": "Stir in the powder, then whisk it up to reduce lumps.",
                    "description": ""
                },
                {
                    "headline": "Put the mug back in the microwave for 50-60 seconds.",
                    "description": "Then take it out."
                },
                {
                    "headline": "Stir your hot chocolate up.",
                    "description": "Add as much sugar as you need to; taste it after each spoonful to taste it"
                },
                {
                    "headline": "Add garnish if you desire.",
                    "description": "For example, put in a square or two of solid chocolate and some marshmallows, then put it back in the microwave so the chocolate melts."
                },
                {
                    "headline": "Put your hot chocolate in the microwave for 60 seconds and then take it out.",
                    "description": ""
                },
                {
                    "headline": "Add a curl of whipped cream and a couple of grated chocolate curls.",
                    "description": ""
                },
                {
                    "headline": "Enjoy!",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Big mug",
        "Stirring spoon"
    ],
    "text": " Deluxe Hot Chocolate Fill the bottom of the mug with marshmallow fluff. You shouldn't see the bottom but you should still have plenty of space left above the fluff. Take some whipped cream and add about the same amount as the fluff.  Add some small chocolate sweets such as M&M's, Smarties or a few small blocks of chocolate. Not too much though, make sure it's flat. Add two tablespoons of the hot chocolate powder (Milo, Hershey's, Swiss Miss etc.)  Pour in a lot of hot water (but don't fill the cup yet).  Add in some milk, preferably full cream.  Add some sprinkles of your choice, like cinnamon sprinkles or chocolate vermicelli.  Add a few big marshmallows or lots of mini ones.  Enjoy!  Ultra Creamy and Silky Hot Chocolate Three quarter fill a mug with milk. Any kind of milk is fine. Put this in your microwave for 50-60 seconds. Then remove it. Add a level teaspoonful of cocoa powder. Again, any kind is good. Stir in the powder, then whisk it up to reduce lumps.  Put the mug back in the microwave for 50-60 seconds. Then take it out. Stir your hot chocolate up. Add as much sugar as you need to; taste it after each spoonful to taste it Add garnish if you desire. For example, put in a square or two of solid chocolate and some marshmallows, then put it back in the microwave so the chocolate melts. Put your hot chocolate in the microwave for 60 seconds and then take it out.  Add a curl of whipped cream and a couple of grated chocolate curls.  Enjoy! ",
    "sentences": [
        " Deluxe Hot Chocolate Fill the bottom of the mug with marshmallow fluff.",
        "You shouldn't see the bottom but you should still have plenty of space left above the fluff.",
        "Take some whipped cream and add about the same amount as the fluff.",
        "Add some small chocolate sweets such as M&M's, Smarties or a few small blocks of chocolate.",
        "Not too much though, make sure it's flat.",
        "Add two tablespoons of the hot chocolate powder (Milo, Hershey's, Swiss Miss etc.)",
        "Pour in a lot of hot water (but don't fill the cup yet).",
        "Add in some milk, preferably full cream.",
        "Add some sprinkles of your choice, like cinnamon sprinkles or chocolate vermicelli.",
        "Add a few big marshmallows or lots of mini ones.",
        "Enjoy!",
        "Ultra Creamy and Silky Hot Chocolate Three quarter fill a mug with milk.",
        "Any kind of milk is fine.",
        "Put this in your microwave for 50-60 seconds.",
        "Then remove it.",
        "Add a level teaspoonful of cocoa powder.",
        "Again, any kind is good.",
        "Stir in the powder, then whisk it up to reduce lumps.",
        "Put the mug back in the microwave for 50-60 seconds.",
        "Then take it out.",
        "Stir your hot chocolate up.",
        "Add as much sugar as you need to; taste it after each spoonful to taste it Add garnish if you desire.",
        "For example, put in a square or two of solid chocolate and some marshmallows, then put it back in the microwave so the chocolate melts.",
        "Put your hot chocolate in the microwave for 60 seconds and then take it out.",
        "Add a curl of whipped cream and a couple of grated chocolate curls.",
        "Enjoy!"
    ]
}