{
    "title": "How to Make Christmas Tree Cookies",
    "url": "https://www.wikihow.com/Make-Christmas-Tree-Cookies",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking",
        "Cookies and Biscuits"
    ],
    "methods": [
        {
            "name": "Preparing the Cookie Dough",
            "steps": [
                {
                    "headline": "Whisk the flour, salt and baking soda together in a bowl.",
                    "description": "Set the dry ingredients aside."
                },
                {
                    "headline": "Place the butter into a large mixing bowl.",
                    "description": ""
                },
                {
                    "headline": "Beat the butter using a handheld mixer or a stand mixer with a flat paddle attachment until the butter is creamy and smooth.",
                    "description": "Your mixer should be set at a medium speed."
                },
                {
                    "headline": "Add the sugar and continue beating the butter and sugar for about 2 minutes, or until the mixture is yellow and pale.",
                    "description": ""
                },
                {
                    "headline": "Beat in the egg and egg yolk.",
                    "description": ""
                },
                {
                    "headline": "Add the vanilla extract and beat the batter together for another 1 to 2 minutes.",
                    "description": ""
                },
                {
                    "headline": "Turn the mixer down to low speed and add 1/2 cup of the dry ingredients, mixing until they are just incorporated.",
                    "description": ""
                },
                {
                    "headline": "Keep adding the dry ingredients in 1/2-cup intervals until all of the dry ingredients are integrated into the dough.",
                    "description": ""
                },
                {
                    "headline": "Turn the dough out onto a clean counter or cutting board.",
                    "description": ""
                },
                {
                    "headline": "Divide the dough in half.",
                    "description": ""
                },
                {
                    "headline": "Shape each half into a disc and cover each disc in plastic wrap.",
                    "description": ""
                },
                {
                    "headline": "Refrigerate the dough for 1 hour.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Cutting Out the Christmas Tree Shapes",
            "steps": [
                {
                    "headline": "Line two baking sheets with parchment paper.",
                    "description": ""
                },
                {
                    "headline": "Cover your counter with a strip of wax paper.",
                    "description": ""
                },
                {
                    "headline": "Unwrap one disc of chilled dough and place it on the wax paper.",
                    "description": ""
                },
                {
                    "headline": "Cover the dough with an additional sheet of wax paper.",
                    "description": ""
                },
                {
                    "headline": "Roll the dough to 1/4\" thickness using a rolling pin.",
                    "description": "Lift the wax paper occasionally and turn the dough over so that it rolls out evenly. Replace the wax paper and continue to roll the dough."
                },
                {
                    "headline": "Place some flour in a shallow bowl.",
                    "description": "Dipping your Christmas tree cookie cutters in this flour will keep the dough from adhering to the cutters and tearing the shapes."
                },
                {
                    "headline": "Remove the top sheet of wax paper from the rolled-out dough.",
                    "description": ""
                },
                {
                    "headline": "Starting in the top left corner of the dough, push a floured cookie cutter into the dough to produce a Christmas tree shape.",
                    "description": ""
                },
                {
                    "headline": "Place the cut cookie onto one of the baking sheets.",
                    "description": "Make sure that the cookie is approximately 1-1/2\" from the edges of the sheet. This will give the cookie room to spread a little as it bakes."
                },
                {
                    "headline": "Dip the cookie cutter in flour and cut out another Christmas tree shape out of the dough.",
                    "description": "Cut close to the first cutout, leaving only a thin strip of dough between the first and second cutouts."
                },
                {
                    "headline": "Place the second cookie on the baking sheet, approximately 1-1/2\" from both the edge and the other cookie.",
                    "description": ""
                },
                {
                    "headline": "Continue cutting out cookies until you have filled both baking sheets with cookies.",
                    "description": "You will want about 1 dozen cookies on each sheet."
                },
                {
                    "headline": "Cover the cookie sheets in plastic wrap and put them in the refrigerator for 15 minutes.",
                    "description": "Chilling the cut cookies helps to prevent them from spreading when you bake them."
                }
            ]
        },
        {
            "name": "Baking the Cookies",
            "steps": [
                {
                    "headline": "Preheat your oven to 350°F (180°C) while your Christmas tree cookie cutouts are in the refrigerator.",
                    "description": ""
                },
                {
                    "headline": "After the cookie cutouts have chilled, remove 1 cookie sheet from the refrigerator, taking off the plastic wrap.",
                    "description": ""
                },
                {
                    "headline": "Bake the cookies for 5 minutes.",
                    "description": ""
                },
                {
                    "headline": "Rotate the cookie sheet 90 degrees.",
                    "description": "Bake the cookies for an additional 4 to 6 minutes. The cookies should be firm without turning brown."
                },
                {
                    "headline": "Remove the baking sheet from the oven and allow the cookies to rest for 2 minutes.",
                    "description": ""
                },
                {
                    "headline": "Remove the cookies from the parchment paper with a spatula and place them on wire racks to cool.",
                    "description": ""
                },
                {
                    "headline": "Repeat the steps with the second baking sheet of cookies.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Preparing the Frosting",
            "steps": [
                {
                    "headline": "Place the softened butter and 2 cups of confectioner’s sugar into a mixing bowl and beat the ingredients at medium speed using either a handheld mixer or a stand mixer with a paddle attachment.",
                    "description": ""
                },
                {
                    "headline": "Slowly add the cold sweetened condensed milk and continue beating the mixture until it becomes light and fluffy.",
                    "description": ""
                },
                {
                    "headline": "Place the egg whites in a separate mixing bowl and using a handheld mixer or a stand mixer with a whisk attachment, beat the eggs at high speed.",
                    "description": ""
                },
                {
                    "headline": "Slowly add 1/2 cup of confectioner’s sugar as the egg whites are beating.",
                    "description": "Beat the egg whites and sugar for about 5 minutes."
                },
                {
                    "headline": "Scoop the egg white mixture into the mixing bowl that contains the butter mixture, using a flat spatula.",
                    "description": ""
                },
                {
                    "headline": "With the mixer speed on low, beat in the egg whites until they are just combined.",
                    "description": ""
                },
                {
                    "headline": "Add the vanilla extract and the remaining 1/2 cup of confectioner’s sugar and beat on low speed until just combined.",
                    "description": ""
                },
                {
                    "headline": "Add a few drops of green food coloring and continue to mix the frosting on low speed.",
                    "description": "Add a few drops at a time until your frosting reaches the desired shade of green."
                },
                {
                    "headline": "Turn off your mixer and remove it from the frosting.",
                    "description": ""
                },
                {
                    "headline": "Place plastic wrap over the frosting and put the mixing bowl in the refrigerator until you are ready to frost the cookies.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Decorating the Cookies",
            "steps": [
                {
                    "headline": "Cover your countertop with a clean sheet of wax paper.",
                    "description": ""
                },
                {
                    "headline": "Place a batch of cookies on the wax paper, leaving about 1” of space between the cookies.",
                    "description": ""
                },
                {
                    "headline": "Take your frosting from the refrigerator and using a butter knife or a cheese spreader, frost each cookie with a thin layer of the green frosting.",
                    "description": ""
                },
                {
                    "headline": "Lay out the round chocolate candies in diagonally curved rows to create a \"garland.\"",
                    "description": ""
                },
                {
                    "headline": "Top the frosting with sprinkles or nonpareils.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Mixing bowl for dry ingredients",
        "Mixing bowl for wet ingredients",
        "Handheld mixer or stand mixer",
        "Paddle attachment for stand mixer, if using",
        "Plastic wrap",
        "2 baking sheets",
        "Parchment paper",
        "Wax paper",
        "Rolling pin",
        "Shallow dish for flour",
        "Christmas tree cookie cutters",
        "Spatula",
        "Wire racks for cooling cookies",
        "Butter knife or cheese spreader"
    ],
    "text": " Preparing the Cookie Dough Whisk the flour, salt and baking soda together in a bowl. Set the dry ingredients aside. Place the butter into a large mixing bowl.  Beat the butter using a handheld mixer or a stand mixer with a flat paddle attachment until the butter is creamy and smooth. Your mixer should be set at a medium speed. Add the sugar and continue beating the butter and sugar for about 2 minutes, or until the mixture is yellow and pale.  Beat in the egg and egg yolk.  Add the vanilla extract and beat the batter together for another 1 to 2 minutes.  Turn the mixer down to low speed and add 1/2 cup of the dry ingredients, mixing until they are just incorporated.  Keep adding the dry ingredients in 1/2-cup intervals until all of the dry ingredients are integrated into the dough.  Turn the dough out onto a clean counter or cutting board.  Divide the dough in half.  Shape each half into a disc and cover each disc in plastic wrap.  Refrigerate the dough for 1 hour.  Cutting Out the Christmas Tree Shapes Line two baking sheets with parchment paper.  Cover your counter with a strip of wax paper.  Unwrap one disc of chilled dough and place it on the wax paper.  Cover the dough with an additional sheet of wax paper.  Roll the dough to 1/4\" thickness using a rolling pin. Lift the wax paper occasionally and turn the dough over so that it rolls out evenly. Replace the wax paper and continue to roll the dough. Place some flour in a shallow bowl. Dipping your Christmas tree cookie cutters in this flour will keep the dough from adhering to the cutters and tearing the shapes. Remove the top sheet of wax paper from the rolled-out dough.  Starting in the top left corner of the dough, push a floured cookie cutter into the dough to produce a Christmas tree shape.  Place the cut cookie onto one of the baking sheets. Make sure that the cookie is approximately 1-1/2\" from the edges of the sheet. This will give the cookie room to spread a little as it bakes. Dip the cookie cutter in flour and cut out another Christmas tree shape out of the dough. Cut close to the first cutout, leaving only a thin strip of dough between the first and second cutouts. Place the second cookie on the baking sheet, approximately 1-1/2\" from both the edge and the other cookie.  Continue cutting out cookies until you have filled both baking sheets with cookies. You will want about 1 dozen cookies on each sheet. Cover the cookie sheets in plastic wrap and put them in the refrigerator for 15 minutes. Chilling the cut cookies helps to prevent them from spreading when you bake them. Baking the Cookies Preheat your oven to 350°F (180°C) while your Christmas tree cookie cutouts are in the refrigerator.  After the cookie cutouts have chilled, remove 1 cookie sheet from the refrigerator, taking off the plastic wrap.  Bake the cookies for 5 minutes.  Rotate the cookie sheet 90 degrees. Bake the cookies for an additional 4 to 6 minutes. The cookies should be firm without turning brown. Remove the baking sheet from the oven and allow the cookies to rest for 2 minutes.  Remove the cookies from the parchment paper with a spatula and place them on wire racks to cool.  Repeat the steps with the second baking sheet of cookies.  Preparing the Frosting Place the softened butter and 2 cups of confectioner’s sugar into a mixing bowl and beat the ingredients at medium speed using either a handheld mixer or a stand mixer with a paddle attachment.  Slowly add the cold sweetened condensed milk and continue beating the mixture until it becomes light and fluffy.  Place the egg whites in a separate mixing bowl and using a handheld mixer or a stand mixer with a whisk attachment, beat the eggs at high speed.  Slowly add 1/2 cup of confectioner’s sugar as the egg whites are beating. Beat the egg whites and sugar for about 5 minutes. Scoop the egg white mixture into the mixing bowl that contains the butter mixture, using a flat spatula.  With the mixer speed on low, beat in the egg whites until they are just combined.  Add the vanilla extract and the remaining 1/2 cup of confectioner’s sugar and beat on low speed until just combined.  Add a few drops of green food coloring and continue to mix the frosting on low speed. Add a few drops at a time until your frosting reaches the desired shade of green. Turn off your mixer and remove it from the frosting.  Place plastic wrap over the frosting and put the mixing bowl in the refrigerator until you are ready to frost the cookies.  Decorating the Cookies Cover your countertop with a clean sheet of wax paper.  Place a batch of cookies on the wax paper, leaving about 1” of space between the cookies.  Take your frosting from the refrigerator and using a butter knife or a cheese spreader, frost each cookie with a thin layer of the green frosting.  Lay out the round chocolate candies in diagonally curved rows to create a \"garland.\"  Top the frosting with sprinkles or nonpareils. ",
    "sentences": [
        " Preparing the Cookie Dough Whisk the flour, salt and baking soda together in a bowl.",
        "Set the dry ingredients aside.",
        "Place the butter into a large mixing bowl.",
        "Beat the butter using a handheld mixer or a stand mixer with a flat paddle attachment until the butter is creamy and smooth.",
        "Your mixer should be set at a medium speed.",
        "Add the sugar and continue beating the butter and sugar for about 2 minutes, or until the mixture is yellow and pale.",
        "Beat in the egg and egg yolk.",
        "Add the vanilla extract and beat the batter together for another 1 to 2 minutes.",
        "Turn the mixer down to low speed and add 1/2 cup of the dry ingredients, mixing until they are just incorporated.",
        "Keep adding the dry ingredients in 1/2-cup intervals until all of the dry ingredients are integrated into the dough.",
        "Turn the dough out onto a clean counter or cutting board.",
        "Divide the dough in half.",
        "Shape each half into a disc and cover each disc in plastic wrap.",
        "Refrigerate the dough for 1 hour.",
        "Cutting Out the Christmas Tree Shapes Line two baking sheets with parchment paper.",
        "Cover your counter with a strip of wax paper.",
        "Unwrap one disc of chilled dough and place it on the wax paper.",
        "Cover the dough with an additional sheet of wax paper.",
        "Roll the dough to 1/4\" thickness using a rolling pin.",
        "Lift the wax paper occasionally and turn the dough over so that it rolls out evenly.",
        "Replace the wax paper and continue to roll the dough.",
        "Place some flour in a shallow bowl.",
        "Dipping your Christmas tree cookie cutters in this flour will keep the dough from adhering to the cutters and tearing the shapes.",
        "Remove the top sheet of wax paper from the rolled-out dough.",
        "Starting in the top left corner of the dough, push a floured cookie cutter into the dough to produce a Christmas tree shape.",
        "Place the cut cookie onto one of the baking sheets.",
        "Make sure that the cookie is approximately 1-1/2\" from the edges of the sheet.",
        "This will give the cookie room to spread a little as it bakes.",
        "Dip the cookie cutter in flour and cut out another Christmas tree shape out of the dough.",
        "Cut close to the first cutout, leaving only a thin strip of dough between the first and second cutouts.",
        "Place the second cookie on the baking sheet, approximately 1-1/2\" from both the edge and the other cookie.",
        "Continue cutting out cookies until you have filled both baking sheets with cookies.",
        "You will want about 1 dozen cookies on each sheet.",
        "Cover the cookie sheets in plastic wrap and put them in the refrigerator for 15 minutes.",
        "Chilling the cut cookies helps to prevent them from spreading when you bake them.",
        "Baking the Cookies Preheat your oven to 350°F (180°C) while your Christmas tree cookie cutouts are in the refrigerator.",
        "After the cookie cutouts have chilled, remove 1 cookie sheet from the refrigerator, taking off the plastic wrap.",
        "Bake the cookies for 5 minutes.",
        "Rotate the cookie sheet 90 degrees.",
        "Bake the cookies for an additional 4 to 6 minutes.",
        "The cookies should be firm without turning brown.",
        "Remove the baking sheet from the oven and allow the cookies to rest for 2 minutes.",
        "Remove the cookies from the parchment paper with a spatula and place them on wire racks to cool.",
        "Repeat the steps with the second baking sheet of cookies.",
        "Preparing the Frosting Place the softened butter and 2 cups of confectioner’s sugar into a mixing bowl and beat the ingredients at medium speed using either a handheld mixer or a stand mixer with a paddle attachment.",
        "Slowly add the cold sweetened condensed milk and continue beating the mixture until it becomes light and fluffy.",
        "Place the egg whites in a separate mixing bowl and using a handheld mixer or a stand mixer with a whisk attachment, beat the eggs at high speed.",
        "Slowly add 1/2 cup of confectioner’s sugar as the egg whites are beating.",
        "Beat the egg whites and sugar for about 5 minutes.",
        "Scoop the egg white mixture into the mixing bowl that contains the butter mixture, using a flat spatula.",
        "With the mixer speed on low, beat in the egg whites until they are just combined.",
        "Add the vanilla extract and the remaining 1/2 cup of confectioner’s sugar and beat on low speed until just combined.",
        "Add a few drops of green food coloring and continue to mix the frosting on low speed.",
        "Add a few drops at a time until your frosting reaches the desired shade of green.",
        "Turn off your mixer and remove it from the frosting.",
        "Place plastic wrap over the frosting and put the mixing bowl in the refrigerator until you are ready to frost the cookies.",
        "Decorating the Cookies Cover your countertop with a clean sheet of wax paper.",
        "Place a batch of cookies on the wax paper, leaving about 1” of space between the cookies.",
        "Take your frosting from the refrigerator and using a butter knife or a cheese spreader, frost each cookie with a thin layer of the green frosting.",
        "Lay out the round chocolate candies in diagonally curved rows to create a \"garland.\"",
        "Top the frosting with sprinkles or nonpareils."
    ]
}