{
    "title": "How to Fish",
    "url": "https://www.wikihow.com/Fish",
    "category_hierarchy": [
        "Sports and Fitness",
        "Outdoor Recreation",
        "Fishing",
        "Learning to Fish"
    ],
    "parts": [
        {
            "name": "Selecting a Fishing Spot",
            "steps": [
                {
                    "headline": "Go to a well-stocked lake, river, or pond in your area.",
                    "description": "Pick a place you won’t mind staying at for several hours. All sorts of different fish live in public lakes, rivers, and ponds, so you can always find something good to catch. The fish come close to the shore in the spring and autumn as they prepare for winter. In the summer, they tend to be in deeper waters, so take a boat out from the shore.PTip: Many municipal parks stock fish in ponds that are accessible to everyone. Check with your local Fish and Wildlife Department for stocking dates. These sports are great for beginners, but many people use them. Secluded spots around ponds or levees outside of town are good bets. Make sure you’re not crossing private property or fishing in a place that doesn’t allow it. Also, be careful not to trample plants along the shore. If you live on the coast, consider ocean fishing. If you get a separate ocean fishing license and rods and bait for the specific fish you want to catch, it’s the same as freshwater fishing."
                },
                {
                    "headline": "Find out what kind of fish are common in nearby fishing spots.",
                    "description": "Many newspapers have local fishing reports that list fishing holes and what fish are biting there. You could also ask around at angling shops, marinas, and camping supply stores for tips. There are so many types of fish that getting started can feel a little overwhelming at first, so choose a type of fish to focus on. Bass, crappies, sunfish, bluegills, and catfish are a few varieties that are relatively easy for beginners to reel in. Catfish are common all over the U.S., for instance. Look for areas with deep water around large creeks and rivers. Head to them in spring and fall to get a fish that makes for a tasty meal fried and served at your table."
                },
                {
                    "headline": "Seek out a specific trophy or food fish you want to catch.",
                    "description": "If you want to catch a blue marlin, you’re going to need to head out on the ocean. Take some time to read up about the kind of fish you want to catch, where they live, and what kind of bait you need to succeed. Fish populations change from area to area and from freshwater to saltwater. Sometimes you have to plan out a trip to get what you want, but it’s a chance to see something new! Go to the Great Lakes region of the U.S. for a variety of freshwater fish, for instance. Walleyes and northern pikes are a few popular catches. Set up on the shore and cast your line. In the southern U.S., gar and bowfins live in swampy areas. Flounder and perch are a couple of common catches to aim for out there. The northwest part of the U.S. has a lot of rainbow trout for good eating or trophy photos to show your friends. Crappie, walleye, and bass are also pretty common and easy to catch there. If you’re unsure about what fish are in a body of water, throw in some food scraps and wait. See what fish come to the surface. Identifying the fish is tricky when you’re starting out since you don’t know how different fish behave, but it’s something you can learn by fishing often."
                },
                {
                    "headline": "Fish at places near deep water or moving currents.",
                    "description": "Most big fish spend the days in deeper water and come into shallow areas to feed. They don’t spend a lot of time swimming around these shallow areas. They also don’t like swimming against strong currents, so park yourself at the end of one. Keep an eye out for fish activity, such as bubbles, splashes, or even flocks of hungry birds. Fish go where the food is. Look for spots with reeds, logs, and rocks, especially near sudden drop-offs. These places also provide plenty of cover for times when the fish feel threatened. If you see currents of water, look for spots where the faster and slower-moving currents meet. The fish usually sit out under these spots to catch food drifting on the currents."
                },
                {
                    "headline": "Go out at dawn and dusk to find more fish.",
                    "description": "The fish come out to feed during these times, so that is your best bet for a big haul. Setting your alarm for 4:30 in the morning isn’t the most fun part of a trip, but it’s worth it when the fish start biting. Take advantage of the early morning hours, especially in the summer, to beat other fishers to your favorite spots. If the thought of getting up before the crack of dawn makes you groan, make evening plans. Head out to the water around dusk. You can find plenty of fish in shallow waters in spring and fall."
                },
                {
                    "headline": "Contact an environmental health department for safety warnings.",
                    "description": "Unfortunately, water pollution means fish aren’t always safe to eat. Many agencies post warnings online. Check with a state health department, natural resources department, or something similar. You could also call to talk to a park ranger if you fish at a park. If you’re not going to eat what you catch, you don’t have to worry about this as much. As a rule of thumb, bigger fish that eat other fish have more pollution. Big fish like tuna tend to have a high level of mercury than smaller fish that eat insects don’t have. It also depends on the quality of the water where you’re fishing. Remember any catch and release policies your local government may have. Some places require you to keep or put back certain fish."
                }
            ]
        },
        {
            "name": "Choosing Fishing Gear",
            "steps": [
                {
                    "headline": "Get a fishing license from a state department.",
                    "description": "Visit your government’s website to apply. In the U.S., a Department of Fish and Wildlife or a Department of Natural Resources usually covers applications. Getting a license is easy since all you need to do is type in your personal information and pay a small fee. The license is then sent to your email that day to print out and take with you on your trip. You could also call the department or visit them to pay for your license. Have them email the license to you or print it out at the office unless you don’t mind waiting 2 to 4 weeks for it to come in the mail. You need to get a license for every state or province you plan on visiting. A license from one area isn’t valid in another area. Most places offer various licenses that last from a single day up to 10 years. There are also licenses for kids, but sometimes kids under 16 don’t need a license to fish."
                },
                {
                    "headline": "Purchase a medium-strength spinning fishing rod and reel.",
                    "description": "You might be in awe the first time you check out the rod selection at a sporting goods store, but you don’t need to break the bank. For beginners, stick with a 7 ft (2.1 m), medium-strength rod for something with a good balance of range and flexibility. Select one with a spinning reel, since it is easier to set up and cast than a baitcaster reel. Tip: As a rule of thumb, pick a rod that is roughly as long as you are tall. Hold it to see if its weight feels comfortable on your casting arm. Flexible rods are weaker but less likely to snap than stiffer ones. You won’t catch big game fish with your basic rod, but it will help you land a wide variety of common fish. If you’re unsure about what to get, ask store employees for advice."
                },
                {
                    "headline": "Choose a monofilament fishing line that fits the length of your rod.",
                    "description": "Match the fishing line to the kind of pole you have. For a basic 7 ft (2.1 m) rod, go with a 6 to 12 lb (2.7 to 5.4 kg) line if you’re freshwater fishing or a 10 to 12 lb (4.5 to 5.4 kg) line if you’re saltwater fishing. The weight, called the test, tells you how strong the line is. You can only catch fish that weigh less than the line. Aim on fishing with the lightest gear possible so you don’t tire yourself out while you’re having fun. If you’re angling for a specific type of fish, research its average weight to get an idea of what line weight to bring."
                },
                {
                    "headline": "Select a small hook to lure in a wider variety of fish.",
                    "description": "Fish only chase after hooks that are about the same size as the bait they chase. A small fish isn’t going to go after a big, intimidating hook. For that reason, start with a 6 to 10 hook to catch plenty of fish. Upgrade to a hook anywhere from 2 to 3/0 to use larger bait for bigger fish. The hook numbering scale is a little weird, but it’s not too confusing. The smallest hook is a 16, and a medium-sized hook is a 1. Larger hooks rank from 1/0 to 6/0. If you’re unsure what size of hook to get, discuss the sizing system with someone at your local tackle shop. If you fish often, have a variety of hook sizes so you can adapt to all sorts of environments."
                },
                {
                    "headline": "Select a bait like minnows, worms, and crickets.",
                    "description": "If you’re not too fond wriggling creatures, stick with something synthetic. Lures resemble actual bait and will fool fish. Keep in mind that live bait has to be kept in water in an insulated cooler to stay alive. Most fish eat insects and aquatic life, so bait shops offer a wide selection to choose from if you’re looking for a more authentic fishing experience. Try getting a wide variety of baits so you can change your setup according to what fish are active in the area. If you want to catch something without using your rod, try trapping your own bait. For example, catch some minnows to lure in fish that eat smaller fish, such as pike, bass, and walleye. If you’re angling for a specific type of fish, research its favorite bait. For instance, many saltwater fish like shrimp. Other fish eat food ranging from salmon eggs to bacon and cheese."
                },
                {
                    "headline": "Choose an insulated cooler or cage to store caught fish.",
                    "description": "If you’re planning on keeping what you catch, you need lots of ice to prevent them from spoiling. The easiest way to do this is with a plastic bucket. Add some ice from the cooler along with the dead fish. Keep the fish well-chilled until you get a chance to move them into your freezer at home. A fish cage is a great choice for keeping live fish trapped in the water. Many cages also serve as traps for smaller fish, such as minnows. You don’t have to kill anything while you’re fishing. Practice catch and release fishing to return fish to the water. You won’t need an ice chest unless you’re bringing along live bait."
                }
            ]
        },
        {
            "name": "Using a Rod to Catch Fish",
            "steps": [
                {
                    "headline": "Tie your hook on your line.",
                    "description": "When you’re first starting out, stick with a simple clinch knot. Thread the line through the hook, then bring it back toward the reel, wrapping it around itself 4 to 6 times. Feed the end back through the loop and pull it tight. Now that you have a basic knot, cut any excess off the tail end of the line with scissors. In fly fishing, tying the right knot is half of the sport. The clinch knot is a good starting point, but fly fishers use many different knots."
                },
                {
                    "headline": "Tie weights and bobbers above the hook to help you spot fish.",
                    "description": "Tie these items with a clinch knot about 12 in (30 cm) above your hook. If you’re taking on swift water, like in a river or stream, use a weight called a sinker so it reaches the fish. If you’re in still waters, a bobber is a small ball that helps you see when a fish grabs onto the hook. Tip: When you’re starting out, use a larger bobber that you can easily see from shore. Watch for the bobber to jerk and disappear below the water. That means it’s time for you to reel the line in and make your big catch! Sinkers, metal weights, pull your line further into the water, down to where the fish are likely to be. Add sinkers to a larger bobber to keep the bobber in the water but still visible."
                },
                {
                    "headline": "Bait your hook by piercing bait with its tip.",
                    "description": "Hook through the bait as many times as possible to secure it. Don’t let those fish get away with your hard-earned bait! Hold the hook securely in one hand, then push it straight through the bait. Aim on piercing it 2 or 3 times. Jamming a hook through a worm is a little gross, but you can’t catch a fish if the worm falls off. For example, stick the hook through the worm’s body about ⅓ of the way from its head, then repeat this at the other end."
                },
                {
                    "headline": "Cast your line by pulling back and throwing the hook forward.",
                    "description": "Hold the rod with your dominant hand near the reel. Use the reel to adjust the line, leaving about 6 in (15 cm) of it hanging from the end of the rod. Then, pinch the line to the rod with your index finger. To cast it, draw your arm back so the rod is vertical, then snap it forward again. Releasing the line depends somewhat on the type of reel you're using, but if you've got a closed push-button spinner reel, the job is pretty straightforward. Pushing the button releases the line and letting go stops it."
                },
                {
                    "headline": "Wait patiently for a fish to bite.",
                    "description": "Fishing is a waiting game, so be prepared to wait in silence for something to go for your bait. Some fishers reel in the line slowly, jerking the rod a little to give fish the impression that the bait is alive. If you’re not having any luck sitting back and waiting, try moving the line a little bit. Fish are startled by loud noises and thrashing. While you can bring a radio and talk to anyone with you, keep the volume down, especially when other people are fishing too. Watch your line and bobber carefully. You can tell when something bites since you feel the line jerk forward. Wait to let any slack out of the line before reeling the fish in. Sometimes you may end up in spots where the fish aren’t biting. If you’re there for 15 minutes without a bite, try moving somewhere else. Finding a good spot can take a little bit of patience."
                },
                {
                    "headline": "Set the hook by raising the pole once the fish bites.",
                    "description": "When you feel that big tug on your line, “set” your hook to hook the fish. Simply jerk the rod back in the air to point it up in the air like you did when casting the line. Expect the fish to fight back once you hook it. If you no longer feel anything pulling on the line, that means the fish got off and may have swum off with the bait. Sometimes determining if you have a bite is difficult. Through practice, you can learn to distinguish between water currents and fish bumping the bait."
                },
                {
                    "headline": "Pull the fish in by pumping the rod while simultaneously reeling.",
                    "description": "Lift the rod back up in the air, at about a 45-degree angle, to pull the fish toward you. Doing this puts some tension in the line, so lower the rod again and keep spinning your reel. Reel in the line to remove any slack in it, then lift the rod up again to pull the fish a little closer. Repeat this to bring that catch back to shore. More fish are lost to loose lines than anything else. A loose line gives the fish a chance to escape the hook. To avoid this, keep the line tense with the rod’s tip above your head."
                },
                {
                    "headline": "Catch the fish in a net once you’re able to reach it.",
                    "description": "Once you bring the tired fish close to where you’re standing, swoop in with your water net and catch it. You could have a partner catch it in a fishing net. With experience, you can reach down carefully and do it yourself without losing the fish. Be wary of fish spines or the sharp tip of the hook. Grasp the fish firmly behind its head as you remove it from the net."
                }
            ]
        },
        {
            "name": "Keeping or Releasing a Fish",
            "steps": [
                {
                    "headline": "Hold the fish’s body to keep it from moving as you handle it.",
                    "description": "Fish are stronger than they look, so watch out! Keep a firm grip on the fish’s body, right behind its head. In addition to that thrashing tail, look out for the fins, since they can cut you if you’re not careful. Hold the fish horizontally, keeping it in or close to the water to avoid harming it. If you caught a big lunker, use both hands to support it. Place one hand around its body near the head, then place your other hand underneath the fish before its tail."
                },
                {
                    "headline": "Pull the hook out of the fish by using needle-nose pliers.",
                    "description": "This part may seem tricky at first, but it’s not too tough as long as you have a good hold on the fish. Latch the pliers onto the hook poking out of the fish’s mouth. Push it back toward the fish to unhook it. Then, slide it back out of the fish’s mouth, turning it as needed to avoid poking the fish. You could use the pliers to crush the hook’s barb, making it easier to remove. Some experienced fishers even do this before casting. If the hook is stuck, work very patiently. Try reaching into the fish’s mouth with your fingers or pliers. Keep the fish in the water, crush the barb if needed, and then twist and pull the hook without wiggling it out."
                },
                {
                    "headline": "Release the fish if you don’t plan on keeping it.",
                    "description": "More and more fishers put their catches back into the water to protect the ecosystem. Since fish can’t breathe when out of the water, keep your catches in the water as much as possible. If you have to take the fish out, put it back in right away. Keep the fish wet and handle it gently to avoid stressing it out. One of the problems with taking a fish out of water is the stress. The fish may already be worn out from the struggle with your hook. Taking it out of the water and handling it a lot makes it more likely to die even after you put it back."
                },
                {
                    "headline": "Measure the fish to see if you’re legally allowed to keep it.",
                    "description": "Most fishing holes have state or federal laws meant to protect the ecosystem. These rules often include limits on how many fish you are allowed to take home as well as what size they have to be. Take ahold of the fish by grasping firmly behind its head. Use your other hand to carefully stretch a tape measure across the fish from head to tail. A park warden or a police officer could stop you and search through your catches. They could also spot illegal catches in any pictures or social media posts you make and punish you. Breaking a fishing rule often comes with a steep fine and the possibility of jail time. Catching an undersized or out-of-season fish could mean a 500 USD fine and 6 months in jail, for instance. Consider bringing along an identification guide as well as a copy of the rules at your local fishing hole. These rules are often posted on park websites or on information signs around fishing spots."
                },
                {
                    "headline": "Fillet the fish with a knife if you plan on taking it with you.",
                    "description": "Unfortunately, you do have to do the dirty work of killing and cutting up your catch. If you have a sharp knife or spear, thrust it through the fish’s brain right behind its eyes. It’s an instant kill, so the fish doesn’t suffer. Then, clean it by slicing out the gills, scales, and entrails before putting the fish on ice. Tip: For the best results, kill and fillet your catches as soon as you remove them from the water. That preserves the freshness of the meat. Also, keep your fish well-chilled in a cooler as you head home. Another option is to store live fish in a mesh cage placed in the water. It keeps the fish safe but alive while you continue to fish. Then, you can fillet all the fish in one go when you’re ready to head home."
                },
                {
                    "headline": "Cut off the gills for an alternative way to kill a fish.",
                    "description": "Before cutting the fish, hit it over the head once with a club to stun it. Then, use your knife to slice off all of the gills on one side. It causes the fish to bleed out. Put the fish in water, such as in a mesh cage or a filled bucket, until it dies. Bleeding is still considered humane since it’s relatively quick and a solid whack with a club stuns the fish. It’s a great way to get rid of acids that affect the taste of the meat. Many commercial fishers do it for large catches like salmon and tuna. When you’re done, fillet and store the fish as you normally would."
                }
            ]
        }
    ],
    "tyn": [
        "Fishing license",
        "7 ft (2.1 m), medium-strength rod",
        "6 to 12 lb (2.7 to 5.4 kg) monofilament line",
        "Size 6 to 10 fishing hook",
        "Sinkers",
        "Bobber",
        "Bait such as bread, minnows, or insects",
        "Fishing net",
        "Cooler",
        "Ice",
        "Sharp knife",
        "Mesh fishing cage (optional)",
        "Life vest for deeper waters (optional)",
        "Boat for deeper waters (optional)"
    ],
    "text": " Selecting a Fishing Spot Go to a well-stocked lake, river, or pond in your area. Pick a place you won’t mind staying at for several hours. All sorts of different fish live in public lakes, rivers, and ponds, so you can always find something good to catch. The fish come close to the shore in the spring and autumn as they prepare for winter. In the summer, they tend to be in deeper waters, so take a boat out from the shore.PTip: Many municipal parks stock fish in ponds that are accessible to everyone. Check with your local Fish and Wildlife Department for stocking dates. These sports are great for beginners, but many people use them. Secluded spots around ponds or levees outside of town are good bets. Make sure you’re not crossing private property or fishing in a place that doesn’t allow it. Also, be careful not to trample plants along the shore. If you live on the coast, consider ocean fishing. If you get a separate ocean fishing license and rods and bait for the specific fish you want to catch, it’s the same as freshwater fishing. Find out what kind of fish are common in nearby fishing spots. Many newspapers have local fishing reports that list fishing holes and what fish are biting there. You could also ask around at angling shops, marinas, and camping supply stores for tips. There are so many types of fish that getting started can feel a little overwhelming at first, so choose a type of fish to focus on. Bass, crappies, sunfish, bluegills, and catfish are a few varieties that are relatively easy for beginners to reel in. Catfish are common all over the U.S., for instance. Look for areas with deep water around large creeks and rivers. Head to them in spring and fall to get a fish that makes for a tasty meal fried and served at your table. Seek out a specific trophy or food fish you want to catch. If you want to catch a blue marlin, you’re going to need to head out on the ocean. Take some time to read up about the kind of fish you want to catch, where they live, and what kind of bait you need to succeed. Fish populations change from area to area and from freshwater to saltwater. Sometimes you have to plan out a trip to get what you want, but it’s a chance to see something new! Go to the Great Lakes region of the U.S. for a variety of freshwater fish, for instance. Walleyes and northern pikes are a few popular catches. Set up on the shore and cast your line. In the southern U.S., gar and bowfins live in swampy areas. Flounder and perch are a couple of common catches to aim for out there. The northwest part of the U.S. has a lot of rainbow trout for good eating or trophy photos to show your friends. Crappie, walleye, and bass are also pretty common and easy to catch there. If you’re unsure about what fish are in a body of water, throw in some food scraps and wait. See what fish come to the surface. Identifying the fish is tricky when you’re starting out since you don’t know how different fish behave, but it’s something you can learn by fishing often. Fish at places near deep water or moving currents. Most big fish spend the days in deeper water and come into shallow areas to feed. They don’t spend a lot of time swimming around these shallow areas. They also don’t like swimming against strong currents, so park yourself at the end of one. Keep an eye out for fish activity, such as bubbles, splashes, or even flocks of hungry birds. Fish go where the food is. Look for spots with reeds, logs, and rocks, especially near sudden drop-offs. These places also provide plenty of cover for times when the fish feel threatened. If you see currents of water, look for spots where the faster and slower-moving currents meet. The fish usually sit out under these spots to catch food drifting on the currents. Go out at dawn and dusk to find more fish. The fish come out to feed during these times, so that is your best bet for a big haul. Setting your alarm for 4:30 in the morning isn’t the most fun part of a trip, but it’s worth it when the fish start biting. Take advantage of the early morning hours, especially in the summer, to beat other fishers to your favorite spots. If the thought of getting up before the crack of dawn makes you groan, make evening plans. Head out to the water around dusk. You can find plenty of fish in shallow waters in spring and fall. Contact an environmental health department for safety warnings. Unfortunately, water pollution means fish aren’t always safe to eat. Many agencies post warnings online. Check with a state health department, natural resources department, or something similar. You could also call to talk to a park ranger if you fish at a park. If you’re not going to eat what you catch, you don’t have to worry about this as much. As a rule of thumb, bigger fish that eat other fish have more pollution. Big fish like tuna tend to have a high level of mercury than smaller fish that eat insects don’t have. It also depends on the quality of the water where you’re fishing. Remember any catch and release policies your local government may have. Some places require you to keep or put back certain fish. Choosing Fishing Gear Get a fishing license from a state department. Visit your government’s website to apply. In the U.S., a Department of Fish and Wildlife or a Department of Natural Resources usually covers applications. Getting a license is easy since all you need to do is type in your personal information and pay a small fee. The license is then sent to your email that day to print out and take with you on your trip. You could also call the department or visit them to pay for your license. Have them email the license to you or print it out at the office unless you don’t mind waiting 2 to 4 weeks for it to come in the mail. You need to get a license for every state or province you plan on visiting. A license from one area isn’t valid in another area. Most places offer various licenses that last from a single day up to 10 years. There are also licenses for kids, but sometimes kids under 16 don’t need a license to fish. Purchase a medium-strength spinning fishing rod and reel. You might be in awe the first time you check out the rod selection at a sporting goods store, but you don’t need to break the bank. For beginners, stick with a 7 ft (2.1 m), medium-strength rod for something with a good balance of range and flexibility. Select one with a spinning reel, since it is easier to set up and cast than a baitcaster reel. Tip: As a rule of thumb, pick a rod that is roughly as long as you are tall. Hold it to see if its weight feels comfortable on your casting arm. Flexible rods are weaker but less likely to snap than stiffer ones. You won’t catch big game fish with your basic rod, but it will help you land a wide variety of common fish. If you’re unsure about what to get, ask store employees for advice. Choose a monofilament fishing line that fits the length of your rod. Match the fishing line to the kind of pole you have. For a basic 7 ft (2.1 m) rod, go with a 6 to 12 lb (2.7 to 5.4 kg) line if you’re freshwater fishing or a 10 to 12 lb (4.5 to 5.4 kg) line if you’re saltwater fishing. The weight, called the test, tells you how strong the line is. You can only catch fish that weigh less than the line. Aim on fishing with the lightest gear possible so you don’t tire yourself out while you’re having fun. If you’re angling for a specific type of fish, research its average weight to get an idea of what line weight to bring. Select a small hook to lure in a wider variety of fish. Fish only chase after hooks that are about the same size as the bait they chase. A small fish isn’t going to go after a big, intimidating hook. For that reason, start with a 6 to 10 hook to catch plenty of fish. Upgrade to a hook anywhere from 2 to 3/0 to use larger bait for bigger fish. The hook numbering scale is a little weird, but it’s not too confusing. The smallest hook is a 16, and a medium-sized hook is a 1. Larger hooks rank from 1/0 to 6/0. If you’re unsure what size of hook to get, discuss the sizing system with someone at your local tackle shop. If you fish often, have a variety of hook sizes so you can adapt to all sorts of environments. Select a bait like minnows, worms, and crickets. If you’re not too fond wriggling creatures, stick with something synthetic. Lures resemble actual bait and will fool fish. Keep in mind that live bait has to be kept in water in an insulated cooler to stay alive. Most fish eat insects and aquatic life, so bait shops offer a wide selection to choose from if you’re looking for a more authentic fishing experience. Try getting a wide variety of baits so you can change your setup according to what fish are active in the area. If you want to catch something without using your rod, try trapping your own bait. For example, catch some minnows to lure in fish that eat smaller fish, such as pike, bass, and walleye. If you’re angling for a specific type of fish, research its favorite bait. For instance, many saltwater fish like shrimp. Other fish eat food ranging from salmon eggs to bacon and cheese. Choose an insulated cooler or cage to store caught fish. If you’re planning on keeping what you catch, you need lots of ice to prevent them from spoiling. The easiest way to do this is with a plastic bucket. Add some ice from the cooler along with the dead fish. Keep the fish well-chilled until you get a chance to move them into your freezer at home. A fish cage is a great choice for keeping live fish trapped in the water. Many cages also serve as traps for smaller fish, such as minnows. You don’t have to kill anything while you’re fishing. Practice catch and release fishing to return fish to the water. You won’t need an ice chest unless you’re bringing along live bait. Using a Rod to Catch Fish Tie your hook on your line. When you’re first starting out, stick with a simple clinch knot. Thread the line through the hook, then bring it back toward the reel, wrapping it around itself 4 to 6 times. Feed the end back through the loop and pull it tight. Now that you have a basic knot, cut any excess off the tail end of the line with scissors. In fly fishing, tying the right knot is half of the sport. The clinch knot is a good starting point, but fly fishers use many different knots. Tie weights and bobbers above the hook to help you spot fish. Tie these items with a clinch knot about 12 in (30 cm) above your hook. If you’re taking on swift water, like in a river or stream, use a weight called a sinker so it reaches the fish. If you’re in still waters, a bobber is a small ball that helps you see when a fish grabs onto the hook. Tip: When you’re starting out, use a larger bobber that you can easily see from shore. Watch for the bobber to jerk and disappear below the water. That means it’s time for you to reel the line in and make your big catch! Sinkers, metal weights, pull your line further into the water, down to where the fish are likely to be. Add sinkers to a larger bobber to keep the bobber in the water but still visible. Bait your hook by piercing bait with its tip. Hook through the bait as many times as possible to secure it. Don’t let those fish get away with your hard-earned bait! Hold the hook securely in one hand, then push it straight through the bait. Aim on piercing it 2 or 3 times. Jamming a hook through a worm is a little gross, but you can’t catch a fish if the worm falls off. For example, stick the hook through the worm’s body about ⅓ of the way from its head, then repeat this at the other end. Cast your line by pulling back and throwing the hook forward. Hold the rod with your dominant hand near the reel. Use the reel to adjust the line, leaving about 6 in (15 cm) of it hanging from the end of the rod. Then, pinch the line to the rod with your index finger. To cast it, draw your arm back so the rod is vertical, then snap it forward again. Releasing the line depends somewhat on the type of reel you're using, but if you've got a closed push-button spinner reel, the job is pretty straightforward. Pushing the button releases the line and letting go stops it. Wait patiently for a fish to bite. Fishing is a waiting game, so be prepared to wait in silence for something to go for your bait. Some fishers reel in the line slowly, jerking the rod a little to give fish the impression that the bait is alive. If you’re not having any luck sitting back and waiting, try moving the line a little bit. Fish are startled by loud noises and thrashing. While you can bring a radio and talk to anyone with you, keep the volume down, especially when other people are fishing too. Watch your line and bobber carefully. You can tell when something bites since you feel the line jerk forward. Wait to let any slack out of the line before reeling the fish in. Sometimes you may end up in spots where the fish aren’t biting. If you’re there for 15 minutes without a bite, try moving somewhere else. Finding a good spot can take a little bit of patience. Set the hook by raising the pole once the fish bites. When you feel that big tug on your line, “set” your hook to hook the fish. Simply jerk the rod back in the air to point it up in the air like you did when casting the line. Expect the fish to fight back once you hook it. If you no longer feel anything pulling on the line, that means the fish got off and may have swum off with the bait. Sometimes determining if you have a bite is difficult. Through practice, you can learn to distinguish between water currents and fish bumping the bait. Pull the fish in by pumping the rod while simultaneously reeling. Lift the rod back up in the air, at about a 45-degree angle, to pull the fish toward you. Doing this puts some tension in the line, so lower the rod again and keep spinning your reel. Reel in the line to remove any slack in it, then lift the rod up again to pull the fish a little closer. Repeat this to bring that catch back to shore. More fish are lost to loose lines than anything else. A loose line gives the fish a chance to escape the hook. To avoid this, keep the line tense with the rod’s tip above your head. Catch the fish in a net once you’re able to reach it. Once you bring the tired fish close to where you’re standing, swoop in with your water net and catch it. You could have a partner catch it in a fishing net. With experience, you can reach down carefully and do it yourself without losing the fish. Be wary of fish spines or the sharp tip of the hook. Grasp the fish firmly behind its head as you remove it from the net. Keeping or Releasing a Fish Hold the fish’s body to keep it from moving as you handle it. Fish are stronger than they look, so watch out! Keep a firm grip on the fish’s body, right behind its head. In addition to that thrashing tail, look out for the fins, since they can cut you if you’re not careful. Hold the fish horizontally, keeping it in or close to the water to avoid harming it. If you caught a big lunker, use both hands to support it. Place one hand around its body near the head, then place your other hand underneath the fish before its tail. Pull the hook out of the fish by using needle-nose pliers. This part may seem tricky at first, but it’s not too tough as long as you have a good hold on the fish. Latch the pliers onto the hook poking out of the fish’s mouth. Push it back toward the fish to unhook it. Then, slide it back out of the fish’s mouth, turning it as needed to avoid poking the fish. You could use the pliers to crush the hook’s barb, making it easier to remove. Some experienced fishers even do this before casting. If the hook is stuck, work very patiently. Try reaching into the fish’s mouth with your fingers or pliers. Keep the fish in the water, crush the barb if needed, and then twist and pull the hook without wiggling it out. Release the fish if you don’t plan on keeping it. More and more fishers put their catches back into the water to protect the ecosystem. Since fish can’t breathe when out of the water, keep your catches in the water as much as possible. If you have to take the fish out, put it back in right away. Keep the fish wet and handle it gently to avoid stressing it out. One of the problems with taking a fish out of water is the stress. The fish may already be worn out from the struggle with your hook. Taking it out of the water and handling it a lot makes it more likely to die even after you put it back. Measure the fish to see if you’re legally allowed to keep it. Most fishing holes have state or federal laws meant to protect the ecosystem. These rules often include limits on how many fish you are allowed to take home as well as what size they have to be. Take ahold of the fish by grasping firmly behind its head. Use your other hand to carefully stretch a tape measure across the fish from head to tail. A park warden or a police officer could stop you and search through your catches. They could also spot illegal catches in any pictures or social media posts you make and punish you. Breaking a fishing rule often comes with a steep fine and the possibility of jail time. Catching an undersized or out-of-season fish could mean a 500 USD fine and 6 months in jail, for instance. Consider bringing along an identification guide as well as a copy of the rules at your local fishing hole. These rules are often posted on park websites or on information signs around fishing spots. Fillet the fish with a knife if you plan on taking it with you. Unfortunately, you do have to do the dirty work of killing and cutting up your catch. If you have a sharp knife or spear, thrust it through the fish’s brain right behind its eyes. It’s an instant kill, so the fish doesn’t suffer. Then, clean it by slicing out the gills, scales, and entrails before putting the fish on ice. Tip: For the best results, kill and fillet your catches as soon as you remove them from the water. That preserves the freshness of the meat. Also, keep your fish well-chilled in a cooler as you head home. Another option is to store live fish in a mesh cage placed in the water. It keeps the fish safe but alive while you continue to fish. Then, you can fillet all the fish in one go when you’re ready to head home. Cut off the gills for an alternative way to kill a fish. Before cutting the fish, hit it over the head once with a club to stun it. Then, use your knife to slice off all of the gills on one side. It causes the fish to bleed out. Put the fish in water, such as in a mesh cage or a filled bucket, until it dies. Bleeding is still considered humane since it’s relatively quick and a solid whack with a club stuns the fish. It’s a great way to get rid of acids that affect the taste of the meat. Many commercial fishers do it for large catches like salmon and tuna. When you’re done, fillet and store the fish as you normally would.",
    "sentences": [
        " Selecting a Fishing Spot Go to a well-stocked lake, river, or pond in your area.",
        "Pick a place you won’t mind staying at for several hours.",
        "All sorts of different fish live in public lakes, rivers, and ponds, so you can always find something good to catch.",
        "The fish come close to the shore in the spring and autumn as they prepare for winter.",
        "In the summer, they tend to be in deeper waters, so take a boat out from the shore.PTip: Many municipal parks stock fish in ponds that are accessible to everyone.",
        "Check with your local Fish and Wildlife Department for stocking dates.",
        "These sports are great for beginners, but many people use them.",
        "Secluded spots around ponds or levees outside of town are good bets.",
        "Make sure you’re not crossing private property or fishing in a place that doesn’t allow it.",
        "Also, be careful not to trample plants along the shore.",
        "If you live on the coast, consider ocean fishing.",
        "If you get a separate ocean fishing license and rods and bait for the specific fish you want to catch, it’s the same as freshwater fishing.",
        "Find out what kind of fish are common in nearby fishing spots.",
        "Many newspapers have local fishing reports that list fishing holes and what fish are biting there.",
        "You could also ask around at angling shops, marinas, and camping supply stores for tips.",
        "There are so many types of fish that getting started can feel a little overwhelming at first, so choose a type of fish to focus on.",
        "Bass, crappies, sunfish, bluegills, and catfish are a few varieties that are relatively easy for beginners to reel in.",
        "Catfish are common all over the U.S., for instance.",
        "Look for areas with deep water around large creeks and rivers.",
        "Head to them in spring and fall to get a fish that makes for a tasty meal fried and served at your table.",
        "Seek out a specific trophy or food fish you want to catch.",
        "If you want to catch a blue marlin, you’re going to need to head out on the ocean.",
        "Take some time to read up about the kind of fish you want to catch, where they live, and what kind of bait you need to succeed.",
        "Fish populations change from area to area and from freshwater to saltwater.",
        "Sometimes you have to plan out a trip to get what you want, but it’s a chance to see something new!",
        "Go to the Great Lakes region of the U.S. for a variety of freshwater fish, for instance.",
        "Walleyes and northern pikes are a few popular catches.",
        "Set up on the shore and cast your line.",
        "In the southern U.S., gar and bowfins live in swampy areas.",
        "Flounder and perch are a couple of common catches to aim for out there.",
        "The northwest part of the U.S. has a lot of rainbow trout for good eating or trophy photos to show your friends.",
        "Crappie, walleye, and bass are also pretty common and easy to catch there.",
        "If you’re unsure about what fish are in a body of water, throw in some food scraps and wait.",
        "See what fish come to the surface.",
        "Identifying the fish is tricky when you’re starting out since you don’t know how different fish behave, but it’s something you can learn by fishing often.",
        "Fish at places near deep water or moving currents.",
        "Most big fish spend the days in deeper water and come into shallow areas to feed.",
        "They don’t spend a lot of time swimming around these shallow areas.",
        "They also don’t like swimming against strong currents, so park yourself at the end of one.",
        "Keep an eye out for fish activity, such as bubbles, splashes, or even flocks of hungry birds.",
        "Fish go where the food is.",
        "Look for spots with reeds, logs, and rocks, especially near sudden drop-offs.",
        "These places also provide plenty of cover for times when the fish feel threatened.",
        "If you see currents of water, look for spots where the faster and slower-moving currents meet.",
        "The fish usually sit out under these spots to catch food drifting on the currents.",
        "Go out at dawn and dusk to find more fish.",
        "The fish come out to feed during these times, so that is your best bet for a big haul.",
        "Setting your alarm for 4:30 in the morning isn’t the most fun part of a trip, but it’s worth it when the fish start biting.",
        "Take advantage of the early morning hours, especially in the summer, to beat other fishers to your favorite spots.",
        "If the thought of getting up before the crack of dawn makes you groan, make evening plans.",
        "Head out to the water around dusk.",
        "You can find plenty of fish in shallow waters in spring and fall.",
        "Contact an environmental health department for safety warnings.",
        "Unfortunately, water pollution means fish aren’t always safe to eat.",
        "Many agencies post warnings online.",
        "Check with a state health department, natural resources department, or something similar.",
        "You could also call to talk to a park ranger if you fish at a park.",
        "If you’re not going to eat what you catch, you don’t have to worry about this as much.",
        "As a rule of thumb, bigger fish that eat other fish have more pollution.",
        "Big fish like tuna tend to have a high level of mercury than smaller fish that eat insects don’t have.",
        "It also depends on the quality of the water where you’re fishing.",
        "Remember any catch and release policies your local government may have.",
        "Some places require you to keep or put back certain fish.",
        "Choosing Fishing Gear Get a fishing license from a state department.",
        "Visit your government’s website to apply.",
        "In the U.S., a Department of Fish and Wildlife or a Department of Natural Resources usually covers applications.",
        "Getting a license is easy since all you need to do is type in your personal information and pay a small fee.",
        "The license is then sent to your email that day to print out and take with you on your trip.",
        "You could also call the department or visit them to pay for your license.",
        "Have them email the license to you or print it out at the office unless you don’t mind waiting 2 to 4 weeks for it to come in the mail.",
        "You need to get a license for every state or province you plan on visiting.",
        "A license from one area isn’t valid in another area.",
        "Most places offer various licenses that last from a single day up to 10 years.",
        "There are also licenses for kids, but sometimes kids under 16 don’t need a license to fish.",
        "Purchase a medium-strength spinning fishing rod and reel.",
        "You might be in awe the first time you check out the rod selection at a sporting goods store, but you don’t need to break the bank.",
        "For beginners, stick with a 7 ft (2.1 m), medium-strength rod for something with a good balance of range and flexibility.",
        "Select one with a spinning reel, since it is easier to set up and cast than a baitcaster reel.",
        "Tip: As a rule of thumb, pick a rod that is roughly as long as you are tall.",
        "Hold it to see if its weight feels comfortable on your casting arm.",
        "Flexible rods are weaker but less likely to snap than stiffer ones.",
        "You won’t catch big game fish with your basic rod, but it will help you land a wide variety of common fish.",
        "If you’re unsure about what to get, ask store employees for advice.",
        "Choose a monofilament fishing line that fits the length of your rod.",
        "Match the fishing line to the kind of pole you have.",
        "For a basic 7 ft (2.1 m) rod, go with a 6 to 12 lb (2.7 to 5.4 kg) line if you’re freshwater fishing or a 10 to 12 lb (4.5 to 5.4 kg) line if you’re saltwater fishing.",
        "The weight, called the test, tells you how strong the line is.",
        "You can only catch fish that weigh less than the line.",
        "Aim on fishing with the lightest gear possible so you don’t tire yourself out while you’re having fun.",
        "If you’re angling for a specific type of fish, research its average weight to get an idea of what line weight to bring.",
        "Select a small hook to lure in a wider variety of fish.",
        "Fish only chase after hooks that are about the same size as the bait they chase.",
        "A small fish isn’t going to go after a big, intimidating hook.",
        "For that reason, start with a 6 to 10 hook to catch plenty of fish.",
        "Upgrade to a hook anywhere from 2 to 3/0 to use larger bait for bigger fish.",
        "The hook numbering scale is a little weird, but it’s not too confusing.",
        "The smallest hook is a 16, and a medium-sized hook is a 1.",
        "Larger hooks rank from 1/0 to 6/0.",
        "If you’re unsure what size of hook to get, discuss the sizing system with someone at your local tackle shop.",
        "If you fish often, have a variety of hook sizes so you can adapt to all sorts of environments.",
        "Select a bait like minnows, worms, and crickets.",
        "If you’re not too fond wriggling creatures, stick with something synthetic.",
        "Lures resemble actual bait and will fool fish.",
        "Keep in mind that live bait has to be kept in water in an insulated cooler to stay alive.",
        "Most fish eat insects and aquatic life, so bait shops offer a wide selection to choose from if you’re looking for a more authentic fishing experience.",
        "Try getting a wide variety of baits so you can change your setup according to what fish are active in the area.",
        "If you want to catch something without using your rod, try trapping your own bait.",
        "For example, catch some minnows to lure in fish that eat smaller fish, such as pike, bass, and walleye.",
        "If you’re angling for a specific type of fish, research its favorite bait.",
        "For instance, many saltwater fish like shrimp.",
        "Other fish eat food ranging from salmon eggs to bacon and cheese.",
        "Choose an insulated cooler or cage to store caught fish.",
        "If you’re planning on keeping what you catch, you need lots of ice to prevent them from spoiling.",
        "The easiest way to do this is with a plastic bucket.",
        "Add some ice from the cooler along with the dead fish.",
        "Keep the fish well-chilled until you get a chance to move them into your freezer at home.",
        "A fish cage is a great choice for keeping live fish trapped in the water.",
        "Many cages also serve as traps for smaller fish, such as minnows.",
        "You don’t have to kill anything while you’re fishing.",
        "Practice catch and release fishing to return fish to the water.",
        "You won’t need an ice chest unless you’re bringing along live bait.",
        "Using a Rod to Catch Fish Tie your hook on your line.",
        "When you’re first starting out, stick with a simple clinch knot.",
        "Thread the line through the hook, then bring it back toward the reel, wrapping it around itself 4 to 6 times.",
        "Feed the end back through the loop and pull it tight.",
        "Now that you have a basic knot, cut any excess off the tail end of the line with scissors.",
        "In fly fishing, tying the right knot is half of the sport.",
        "The clinch knot is a good starting point, but fly fishers use many different knots.",
        "Tie weights and bobbers above the hook to help you spot fish.",
        "Tie these items with a clinch knot about 12 in (30 cm) above your hook.",
        "If you’re taking on swift water, like in a river or stream, use a weight called a sinker so it reaches the fish.",
        "If you’re in still waters, a bobber is a small ball that helps you see when a fish grabs onto the hook.",
        "Tip: When you’re starting out, use a larger bobber that you can easily see from shore.",
        "Watch for the bobber to jerk and disappear below the water.",
        "That means it’s time for you to reel the line in and make your big catch!",
        "Sinkers, metal weights, pull your line further into the water, down to where the fish are likely to be.",
        "Add sinkers to a larger bobber to keep the bobber in the water but still visible.",
        "Bait your hook by piercing bait with its tip.",
        "Hook through the bait as many times as possible to secure it.",
        "Don’t let those fish get away with your hard-earned bait!",
        "Hold the hook securely in one hand, then push it straight through the bait.",
        "Aim on piercing it 2 or 3 times.",
        "Jamming a hook through a worm is a little gross, but you can’t catch a fish if the worm falls off.",
        "For example, stick the hook through the worm’s body about ⅓ of the way from its head, then repeat this at the other end.",
        "Cast your line by pulling back and throwing the hook forward.",
        "Hold the rod with your dominant hand near the reel.",
        "Use the reel to adjust the line, leaving about 6 in (15 cm) of it hanging from the end of the rod.",
        "Then, pinch the line to the rod with your index finger.",
        "To cast it, draw your arm back so the rod is vertical, then snap it forward again.",
        "Releasing the line depends somewhat on the type of reel you're using, but if you've got a closed push-button spinner reel, the job is pretty straightforward.",
        "Pushing the button releases the line and letting go stops it.",
        "Wait patiently for a fish to bite.",
        "Fishing is a waiting game, so be prepared to wait in silence for something to go for your bait.",
        "Some fishers reel in the line slowly, jerking the rod a little to give fish the impression that the bait is alive.",
        "If you’re not having any luck sitting back and waiting, try moving the line a little bit.",
        "Fish are startled by loud noises and thrashing.",
        "While you can bring a radio and talk to anyone with you, keep the volume down, especially when other people are fishing too.",
        "Watch your line and bobber carefully.",
        "You can tell when something bites since you feel the line jerk forward.",
        "Wait to let any slack out of the line before reeling the fish in.",
        "Sometimes you may end up in spots where the fish aren’t biting.",
        "If you’re there for 15 minutes without a bite, try moving somewhere else.",
        "Finding a good spot can take a little bit of patience.",
        "Set the hook by raising the pole once the fish bites.",
        "When you feel that big tug on your line, “set” your hook to hook the fish.",
        "Simply jerk the rod back in the air to point it up in the air like you did when casting the line.",
        "Expect the fish to fight back once you hook it.",
        "If you no longer feel anything pulling on the line, that means the fish got off and may have swum off with the bait.",
        "Sometimes determining if you have a bite is difficult.",
        "Through practice, you can learn to distinguish between water currents and fish bumping the bait.",
        "Pull the fish in by pumping the rod while simultaneously reeling.",
        "Lift the rod back up in the air, at about a 45-degree angle, to pull the fish toward you.",
        "Doing this puts some tension in the line, so lower the rod again and keep spinning your reel.",
        "Reel in the line to remove any slack in it, then lift the rod up again to pull the fish a little closer.",
        "Repeat this to bring that catch back to shore.",
        "More fish are lost to loose lines than anything else.",
        "A loose line gives the fish a chance to escape the hook.",
        "To avoid this, keep the line tense with the rod’s tip above your head.",
        "Catch the fish in a net once you’re able to reach it.",
        "Once you bring the tired fish close to where you’re standing, swoop in with your water net and catch it.",
        "You could have a partner catch it in a fishing net.",
        "With experience, you can reach down carefully and do it yourself without losing the fish.",
        "Be wary of fish spines or the sharp tip of the hook.",
        "Grasp the fish firmly behind its head as you remove it from the net.",
        "Keeping or Releasing a Fish Hold the fish’s body to keep it from moving as you handle it.",
        "Fish are stronger than they look, so watch out!",
        "Keep a firm grip on the fish’s body, right behind its head.",
        "In addition to that thrashing tail, look out for the fins, since they can cut you if you’re not careful.",
        "Hold the fish horizontally, keeping it in or close to the water to avoid harming it.",
        "If you caught a big lunker, use both hands to support it.",
        "Place one hand around its body near the head, then place your other hand underneath the fish before its tail.",
        "Pull the hook out of the fish by using needle-nose pliers.",
        "This part may seem tricky at first, but it’s not too tough as long as you have a good hold on the fish.",
        "Latch the pliers onto the hook poking out of the fish’s mouth.",
        "Push it back toward the fish to unhook it.",
        "Then, slide it back out of the fish’s mouth, turning it as needed to avoid poking the fish.",
        "You could use the pliers to crush the hook’s barb, making it easier to remove.",
        "Some experienced fishers even do this before casting.",
        "If the hook is stuck, work very patiently.",
        "Try reaching into the fish’s mouth with your fingers or pliers.",
        "Keep the fish in the water, crush the barb if needed, and then twist and pull the hook without wiggling it out.",
        "Release the fish if you don’t plan on keeping it.",
        "More and more fishers put their catches back into the water to protect the ecosystem.",
        "Since fish can’t breathe when out of the water, keep your catches in the water as much as possible.",
        "If you have to take the fish out, put it back in right away.",
        "Keep the fish wet and handle it gently to avoid stressing it out.",
        "One of the problems with taking a fish out of water is the stress.",
        "The fish may already be worn out from the struggle with your hook.",
        "Taking it out of the water and handling it a lot makes it more likely to die even after you put it back.",
        "Measure the fish to see if you’re legally allowed to keep it.",
        "Most fishing holes have state or federal laws meant to protect the ecosystem.",
        "These rules often include limits on how many fish you are allowed to take home as well as what size they have to be.",
        "Take ahold of the fish by grasping firmly behind its head.",
        "Use your other hand to carefully stretch a tape measure across the fish from head to tail.",
        "A park warden or a police officer could stop you and search through your catches.",
        "They could also spot illegal catches in any pictures or social media posts you make and punish you.",
        "Breaking a fishing rule often comes with a steep fine and the possibility of jail time.",
        "Catching an undersized or out-of-season fish could mean a 500 USD fine and 6 months in jail, for instance.",
        "Consider bringing along an identification guide as well as a copy of the rules at your local fishing hole.",
        "These rules are often posted on park websites or on information signs around fishing spots.",
        "Fillet the fish with a knife if you plan on taking it with you.",
        "Unfortunately, you do have to do the dirty work of killing and cutting up your catch.",
        "If you have a sharp knife or spear, thrust it through the fish’s brain right behind its eyes.",
        "It’s an instant kill, so the fish doesn’t suffer.",
        "Then, clean it by slicing out the gills, scales, and entrails before putting the fish on ice.",
        "Tip: For the best results, kill and fillet your catches as soon as you remove them from the water.",
        "That preserves the freshness of the meat.",
        "Also, keep your fish well-chilled in a cooler as you head home.",
        "Another option is to store live fish in a mesh cage placed in the water.",
        "It keeps the fish safe but alive while you continue to fish.",
        "Then, you can fillet all the fish in one go when you’re ready to head home.",
        "Cut off the gills for an alternative way to kill a fish.",
        "Before cutting the fish, hit it over the head once with a club to stun it.",
        "Then, use your knife to slice off all of the gills on one side.",
        "It causes the fish to bleed out.",
        "Put the fish in water, such as in a mesh cage or a filled bucket, until it dies.",
        "Bleeding is still considered humane since it’s relatively quick and a solid whack with a club stuns the fish.",
        "It’s a great way to get rid of acids that affect the taste of the meat.",
        "Many commercial fishers do it for large catches like salmon and tuna.",
        "When you’re done, fillet and store the fish as you normally would."
    ]
}