{
    "title": "How to Make Cinnamon Roll Sticks",
    "url": "https://www.wikihow.com/Make-Cinnamon-Roll-Sticks",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking",
        "Pastries"
    ],
    "methods": [
        {
            "name": "Make the Cinnamon Roll Dough",
            "steps": [
                {
                    "headline": "Preheat your oven to 375°F (190°C) while you prepare the dough and the topping.",
                    "description": ""
                },
                {
                    "headline": "Dissolve the yeast, sugar and water in a medium bowl.",
                    "description": ""
                },
                {
                    "headline": "Allow the mixture to rest for 5 minutes until it gets bubbly.",
                    "description": ""
                },
                {
                    "headline": "Add the salt and 3 1/4 cups of the flour to the yeast mixture.",
                    "description": ""
                },
                {
                    "headline": "Stir the ingredients by hand until they’re well mixed, or use the dough hook on your mixer to blend the ingredients.",
                    "description": ""
                },
                {
                    "headline": "Add more flour, a few tablespoons at a time, if the dough is sticky.",
                    "description": "The dough is ready when it pulls away from the mixing bowl or has formed a ball around the dough hook."
                },
                {
                    "headline": "Generously flour your cutting board or counter top where you will be rolling out the dough.",
                    "description": ""
                },
                {
                    "headline": "Place the ball of dough on the floured surface and allow it to rest for 10 minutes.",
                    "description": "You can place a clean kitchen towel over the ball of dough or let it rest uncovered."
                }
            ]
        },
        {
            "name": "Prepare the Cinnamon Topping",
            "steps": [
                {
                    "headline": "Place 8 tablespoons or 1/2 cup of butter on your microwavable-safe bowl..",
                    "description": ""
                },
                {
                    "headline": "Place it in the microwave and set for 1 to 2 minutes,until the butter is melted.",
                    "description": "Time may vary."
                },
                {
                    "headline": "Mix 2 tablespoons of the melted butter from the pan with the sugars, cinnamon and salt in a small mixing bowl.Set the cinnamon mixture aside when it has reached a creamy consistency.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Form the Dough into Breadsticks",
            "steps": [
                {
                    "headline": "Lightly knead the dough for a few minutes.",
                    "description": ""
                },
                {
                    "headline": "Roll out the dough using a rolling pin until you reach your desired thickness.",
                    "description": ""
                },
                {
                    "headline": "Use a pizza cutter or a knife to cut 1 1/2\" wide strips of the dough.",
                    "description": "You should be able to make 12 breadsticks."
                },
                {
                    "headline": "Place a wax paper into the baking sheet.",
                    "description": ""
                },
                {
                    "headline": "Arrange the breadsticks into the baking sheet.",
                    "description": "If you were able to get more than 12 from your dough, you can bake them in another pan."
                },
                {
                    "headline": "Dip the brush into the butter and gently spread it in each breadsticks Coat each side.",
                    "description": ""
                },
                {
                    "headline": "Pour the cinnamon mixture over the breadsticks.",
                    "description": ""
                },
                {
                    "headline": "Allow the breadstick dough to rise for about 20 minutes at room temperature.",
                    "description": ""
                },
                {
                    "headline": "Bake the cinnamon breadsticks for 15 to 20 minutes.",
                    "description": ""
                },
                {
                    "headline": "Remove them from the oven and allow them to cool for 10 minutes.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Prepare the Glaze",
            "steps": [
                {
                    "headline": "Stir together the sugar, milk and cream cheese in a medium bowl using a spatula.",
                    "description": ""
                },
                {
                    "headline": "Add the vanilla.",
                    "description": ""
                },
                {
                    "headline": "Continue to mix the ingredients until your glaze is smooth and thin enough to drizzle.",
                    "description": "You can add small amounts of milk to thin it, if necessary."
                },
                {
                    "headline": "Drizzle the glaze over the slightly cooled cinnamon breadsticks.",
                    "description": "You can dip a wire whisk into the glaze and drizzle it all over the breadsticks, or you can create a crisscross pattern."
                },
                {
                    "headline": "Serve them warm.",
                    "description": ""
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "2 medium mixing bowls",
        "Small mixing bowl",
        "Rolling pin",
        "Dough mixer (optional)",
        "Pizza wheel or knife",
        "15” X 10” X 1” rimmed baking sheet",
        "Spatula",
        "Serving plate"
    ],
    "text": " Make the Cinnamon Roll Dough Preheat your oven to 375°F (190°C) while you prepare the dough and the topping.  Dissolve the yeast, sugar and water in a medium bowl.  Allow the mixture to rest for 5 minutes until it gets bubbly.  Add the salt and 3 1/4 cups of the flour to the yeast mixture.  Stir the ingredients by hand until they’re well mixed, or use the dough hook on your mixer to blend the ingredients.  Add more flour, a few tablespoons at a time, if the dough is sticky. The dough is ready when it pulls away from the mixing bowl or has formed a ball around the dough hook. Generously flour your cutting board or counter top where you will be rolling out the dough.  Place the ball of dough on the floured surface and allow it to rest for 10 minutes. You can place a clean kitchen towel over the ball of dough or let it rest uncovered. Prepare the Cinnamon Topping Place 8 tablespoons or 1/2 cup of butter on your microwavable-safe bowl..  Place it in the microwave and set for 1 to 2 minutes,until the butter is melted. Time may vary. Mix 2 tablespoons of the melted butter from the pan with the sugars, cinnamon and salt in a small mixing bowl.Set the cinnamon mixture aside when it has reached a creamy consistency.  Form the Dough into Breadsticks Lightly knead the dough for a few minutes.  Roll out the dough using a rolling pin until you reach your desired thickness.  Use a pizza cutter or a knife to cut 1 1/2\" wide strips of the dough. You should be able to make 12 breadsticks. Place a wax paper into the baking sheet.  Arrange the breadsticks into the baking sheet. If you were able to get more than 12 from your dough, you can bake them in another pan. Dip the brush into the butter and gently spread it in each breadsticks Coat each side.  Pour the cinnamon mixture over the breadsticks.  Allow the breadstick dough to rise for about 20 minutes at room temperature.  Bake the cinnamon breadsticks for 15 to 20 minutes.  Remove them from the oven and allow them to cool for 10 minutes.  Prepare the Glaze Stir together the sugar, milk and cream cheese in a medium bowl using a spatula.  Add the vanilla.  Continue to mix the ingredients until your glaze is smooth and thin enough to drizzle. You can add small amounts of milk to thin it, if necessary. Drizzle the glaze over the slightly cooled cinnamon breadsticks. You can dip a wire whisk into the glaze and drizzle it all over the breadsticks, or you can create a crisscross pattern. Serve them warm.  Finished. ",
    "sentences": [
        " Make the Cinnamon Roll Dough Preheat your oven to 375°F (190°C) while you prepare the dough and the topping.",
        "Dissolve the yeast, sugar and water in a medium bowl.",
        "Allow the mixture to rest for 5 minutes until it gets bubbly.",
        "Add the salt and 3 1/4 cups of the flour to the yeast mixture.",
        "Stir the ingredients by hand until they’re well mixed, or use the dough hook on your mixer to blend the ingredients.",
        "Add more flour, a few tablespoons at a time, if the dough is sticky.",
        "The dough is ready when it pulls away from the mixing bowl or has formed a ball around the dough hook.",
        "Generously flour your cutting board or counter top where you will be rolling out the dough.",
        "Place the ball of dough on the floured surface and allow it to rest for 10 minutes.",
        "You can place a clean kitchen towel over the ball of dough or let it rest uncovered.",
        "Prepare the Cinnamon Topping Place 8 tablespoons or 1/2 cup of butter on your microwavable-safe bowl..  Place it in the microwave and set for 1 to 2 minutes,until the butter is melted.",
        "Time may vary.",
        "Mix 2 tablespoons of the melted butter from the pan with the sugars, cinnamon and salt in a small mixing bowl.Set the cinnamon mixture aside when it has reached a creamy consistency.",
        "Form the Dough into Breadsticks Lightly knead the dough for a few minutes.",
        "Roll out the dough using a rolling pin until you reach your desired thickness.",
        "Use a pizza cutter or a knife to cut 1 1/2\" wide strips of the dough.",
        "You should be able to make 12 breadsticks.",
        "Place a wax paper into the baking sheet.",
        "Arrange the breadsticks into the baking sheet.",
        "If you were able to get more than 12 from your dough, you can bake them in another pan.",
        "Dip the brush into the butter and gently spread it in each breadsticks Coat each side.",
        "Pour the cinnamon mixture over the breadsticks.",
        "Allow the breadstick dough to rise for about 20 minutes at room temperature.",
        "Bake the cinnamon breadsticks for 15 to 20 minutes.",
        "Remove them from the oven and allow them to cool for 10 minutes.",
        "Prepare the Glaze Stir together the sugar, milk and cream cheese in a medium bowl using a spatula.",
        "Add the vanilla.",
        "Continue to mix the ingredients until your glaze is smooth and thin enough to drizzle.",
        "You can add small amounts of milk to thin it, if necessary.",
        "Drizzle the glaze over the slightly cooled cinnamon breadsticks.",
        "You can dip a wire whisk into the glaze and drizzle it all over the breadsticks, or you can create a crisscross pattern.",
        "Serve them warm.",
        "Finished."
    ]
}