{
    "title": "How to Make Bacon Cups",
    "url": "https://www.wikihow.com/Make-Bacon-Cups",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Pork",
        "Bacon"
    ],
    "methods": [
        {
            "name": "Bacon cups",
            "steps": [
                {
                    "headline": "Preheat the oven to 400ºF/200ºC.",
                    "description": ""
                },
                {
                    "headline": "Turn a muffin pan upside down.",
                    "description": "To create the cups, you'll need to use the convex mounds of the base for molding. You need a muffin pan for large muffins."
                },
                {
                    "headline": "Lay foil over each of the muffin mounds, as many times as you need bacon cups.",
                    "description": "Cover and crimp the foil as you're laying it, so that it molds around the mound of each muffin space."
                },
                {
                    "headline": "Make the bacon cups.",
                    "description": "The secret to making sure that this works effectively is to weave the bacon slices into place––don't simply slap the bacon slices on. To weave into place:\nMake a plus sign, \"+\", or cross over the top of the first mound. Wrap the sides once, and at the same time, weave the top portion in and out. Lay the next slice on one side of the top slice. Repeat the side weaving with another bacon slice with the new top piece. Lay another slice on the other side on the top. This will then give you a fully-covered bottom cup. Repeat the side weaving with another bacon slice, using the third top piece."
                },
                {
                    "headline": "Bake the bacon for 10-15 minutes.",
                    "description": "You will need to monitor the bacon since the timings will differ on how crispy you want the cups to be."
                },
                {
                    "headline": "Carefully remove each cup from the foil.",
                    "description": "If the bacon sticks to the foil, carefully set the bottom of the bacon pieces in a large pan and move them around so that they loosen up. Wait until they are cooled down before removing them from the foil. Using the grease from the bacon during the pan cooking process makes it easier to separate it from the foil, rather than pre-greasing the pans prior to cooking. If you spray the pans beforehand, the cups may not hold their shape during the cooking process, thus risking more of a chance of the bacon moving around and shrinking."
                },
                {
                    "headline": "Fill each bacon cup with your choice of food.",
                    "description": "One idea is to make easy BLT filling for the cups."
                }
            ]
        },
        {
            "name": "PB&J bacon cups",
            "steps": [
                {
                    "headline": "Follow the instructions to make the bacon cups as set out in the previous method.",
                    "description": ""
                },
                {
                    "headline": "Slather peanut or almond butter on the bottom of each bacon cup.",
                    "description": "Be generous!"
                },
                {
                    "headline": "Slice grapes.",
                    "description": "Make thin slices from the grapes, being careful of your fingers."
                },
                {
                    "headline": "Place the grape slices inside the bacon cups.",
                    "description": "Estimate around 4 to 5 grapes worth of slices per cup."
                },
                {
                    "headline": "Bake in the oven at 400ºF or 200ºC for 10 to 15 minutes.",
                    "description": "Follow the instructions in the previous method for baking and removal."
                },
                {
                    "headline": "Enjoy your PB&J masterpiece.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Regular muffin pan – ensure that the underside of the pan is properly cleaned before using",
        "Aluminum foil"
    ],
    "text": " Bacon cups Preheat the oven to 400ºF/200ºC.  Turn a muffin pan upside down. To create the cups, you'll need to use the convex mounds of the base for molding. You need a muffin pan for large muffins. Lay foil over each of the muffin mounds, as many times as you need bacon cups. Cover and crimp the foil as you're laying it, so that it molds around the mound of each muffin space. Make the bacon cups. The secret to making sure that this works effectively is to weave the bacon slices into place––don't simply slap the bacon slices on. To weave into place:\nMake a plus sign, \"+\", or cross over the top of the first mound. Wrap the sides once, and at the same time, weave the top portion in and out. Lay the next slice on one side of the top slice. Repeat the side weaving with another bacon slice with the new top piece. Lay another slice on the other side on the top. This will then give you a fully-covered bottom cup. Repeat the side weaving with another bacon slice, using the third top piece. Bake the bacon for 10-15 minutes. You will need to monitor the bacon since the timings will differ on how crispy you want the cups to be. Carefully remove each cup from the foil. If the bacon sticks to the foil, carefully set the bottom of the bacon pieces in a large pan and move them around so that they loosen up. Wait until they are cooled down before removing them from the foil. Using the grease from the bacon during the pan cooking process makes it easier to separate it from the foil, rather than pre-greasing the pans prior to cooking. If you spray the pans beforehand, the cups may not hold their shape during the cooking process, thus risking more of a chance of the bacon moving around and shrinking. Fill each bacon cup with your choice of food. One idea is to make easy BLT filling for the cups. PB&J bacon cups Follow the instructions to make the bacon cups as set out in the previous method.  Slather peanut or almond butter on the bottom of each bacon cup. Be generous! Slice grapes. Make thin slices from the grapes, being careful of your fingers. Place the grape slices inside the bacon cups. Estimate around 4 to 5 grapes worth of slices per cup. Bake in the oven at 400ºF or 200ºC for 10 to 15 minutes. Follow the instructions in the previous method for baking and removal. Enjoy your PB&J masterpiece. ",
    "sentences": [
        " Bacon cups Preheat the oven to 400ºF/200ºC.",
        "Turn a muffin pan upside down.",
        "To create the cups, you'll need to use the convex mounds of the base for molding.",
        "You need a muffin pan for large muffins.",
        "Lay foil over each of the muffin mounds, as many times as you need bacon cups.",
        "Cover and crimp the foil as you're laying it, so that it molds around the mound of each muffin space.",
        "Make the bacon cups.",
        "The secret to making sure that this works effectively is to weave the bacon slices into place––don't simply slap the bacon slices on.",
        "To weave into place:\nMake a plus sign, \"+\", or cross over the top of the first mound.",
        "Wrap the sides once, and at the same time, weave the top portion in and out.",
        "Lay the next slice on one side of the top slice.",
        "Repeat the side weaving with another bacon slice with the new top piece.",
        "Lay another slice on the other side on the top.",
        "This will then give you a fully-covered bottom cup.",
        "Repeat the side weaving with another bacon slice, using the third top piece.",
        "Bake the bacon for 10-15 minutes.",
        "You will need to monitor the bacon since the timings will differ on how crispy you want the cups to be.",
        "Carefully remove each cup from the foil.",
        "If the bacon sticks to the foil, carefully set the bottom of the bacon pieces in a large pan and move them around so that they loosen up.",
        "Wait until they are cooled down before removing them from the foil.",
        "Using the grease from the bacon during the pan cooking process makes it easier to separate it from the foil, rather than pre-greasing the pans prior to cooking.",
        "If you spray the pans beforehand, the cups may not hold their shape during the cooking process, thus risking more of a chance of the bacon moving around and shrinking.",
        "Fill each bacon cup with your choice of food.",
        "One idea is to make easy BLT filling for the cups.",
        "PB&J bacon cups Follow the instructions to make the bacon cups as set out in the previous method.",
        "Slather peanut or almond butter on the bottom of each bacon cup.",
        "Be generous!",
        "Slice grapes.",
        "Make thin slices from the grapes, being careful of your fingers.",
        "Place the grape slices inside the bacon cups.",
        "Estimate around 4 to 5 grapes worth of slices per cup.",
        "Bake in the oven at 400ºF or 200ºC for 10 to 15 minutes.",
        "Follow the instructions in the previous method for baking and removal.",
        "Enjoy your PB&J masterpiece."
    ]
}