{
    "title": "How to Make a Bedding Roll",
    "url": "https://www.wikihow.com/Make-a-Bedding-Roll",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Bedrooms"
    ],
    "steps": [
        {
            "headline": "Lay out a sleeping mat on the floor.",
            "description": ""
        },
        {
            "headline": "Fold a blanket in half and put it on top of the sleeping mat.",
            "description": ""
        },
        {
            "headline": "Lay your sleeping bag on top of the mat and blanket.",
            "description": ""
        },
        {
            "headline": "Put a pair of warm pyjamas, a teddy (if you need one), a small pillow and an extra pair of socks in the sleeping bag.",
            "description": ""
        },
        {
            "headline": "Put another folded blanket on top of everything.",
            "description": ""
        },
        {
            "headline": "With someone to help you, roll up your bedding as tightly as you can.",
            "description": "Roll from the foot of your sleeping bag. When you have finished rolling, tie up the roll with a length of soft rope."
        },
        {
            "headline": "Put your roll in a survival bag.",
            "description": ""
        },
        {
            "headline": "Roll up your survival bag, again, as tightly as possible.",
            "description": "Squeeze out any air. When you get near the end, fold the opening of the bag over to stop any water getting in. Tie up your bedding roll like a parcel, and add a handle if you like."
        }
    ],
    "tyn": [
        "Survival bag",
        "Karri mat or sleeping mat",
        "Two blankets",
        "Sleeping bag",
        "Extra jumper",
        "Extra pair of socks",
        "Warm pyjamas",
        "Teddy",
        "Small pillow",
        "Soft rope",
        "Rope",
        "A friend (optional)"
    ],
    "text": " Lay out a sleeping mat on the floor.  Fold a blanket in half and put it on top of the sleeping mat.  Lay your sleeping bag on top of the mat and blanket.  Put a pair of warm pyjamas, a teddy (if you need one), a small pillow and an extra pair of socks in the sleeping bag.  Put another folded blanket on top of everything.  With someone to help you, roll up your bedding as tightly as you can. Roll from the foot of your sleeping bag. When you have finished rolling, tie up the roll with a length of soft rope. Put your roll in a survival bag.  Roll up your survival bag, again, as tightly as possible. Squeeze out any air. When you get near the end, fold the opening of the bag over to stop any water getting in. Tie up your bedding roll like a parcel, and add a handle if you like.",
    "sentences": [
        " Lay out a sleeping mat on the floor.",
        "Fold a blanket in half and put it on top of the sleeping mat.",
        "Lay your sleeping bag on top of the mat and blanket.",
        "Put a pair of warm pyjamas, a teddy (if you need one), a small pillow and an extra pair of socks in the sleeping bag.",
        "Put another folded blanket on top of everything.",
        "With someone to help you, roll up your bedding as tightly as you can.",
        "Roll from the foot of your sleeping bag.",
        "When you have finished rolling, tie up the roll with a length of soft rope.",
        "Put your roll in a survival bag.",
        "Roll up your survival bag, again, as tightly as possible.",
        "Squeeze out any air.",
        "When you get near the end, fold the opening of the bag over to stop any water getting in.",
        "Tie up your bedding roll like a parcel, and add a handle if you like."
    ]
}