{
    "title": "How to Use Coffee Pods",
    "url": "https://www.wikihow.com/Use-Coffee-Pods",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Coffee",
        "Coffee Accessories"
    ],
    "methods": [
        {
            "name": "Using a Coffee Pod Machine",
            "steps": [
                {
                    "headline": "Fill the water tank/basin.",
                    "description": "Take a measuring cup and dump enough water in your machine’s water basin so it reaches the point of “max fill.” Make sure to use only cool, clean water. If you want, you can use filtered or distilled water. This will reduce buildup of minerals and make your machine work longer and better."
                },
                {
                    "headline": "Remove the pod from its packaging.",
                    "description": "To maintain freshness, coffee pods are usually wrapped individually. Make sure to remove the pod from its packaging without damaging it. To do this, rip along the perforated line of the coffee pod’s packaging to remove it without damaging the pod."
                },
                {
                    "headline": "Put the pod into your coffee machine.",
                    "description": "Pop open the pod holder part of your machine. Depending on your machine, you may need to press a button to open it. Then, gently place the pod in the machine. The pod should easily slide into the pod holder. Once it is in, close the pod holder."
                },
                {
                    "headline": "Adjust the settings of the machine.",
                    "description": "Depending on what strength you want your coffee, you’ll need to set your machine. Your machine should have a light, medium, or strong setting. If it doesn’t, it might have a setting for the amount of water you want to fill your mug with. The more water, the weaker the cup of coffee. If you don’t adjust your settings, your machine will likely brew you a medium cup of coffee."
                },
                {
                    "headline": "Brew your coffee.",
                    "description": "After adjusting your settings, hit the “Brew” or “Start” button on your pod machine. Once you start the machine, it will release hot water into the coffee pod and then the water will be released into your mug. Enjoy your cup of coffee after the stream of water has ceased."
                }
            ]
        },
        {
            "name": "Trying Coffee Pods without a Machine",
            "steps": [
                {
                    "headline": "Place a pod in your coffee mug.",
                    "description": "Depending on the type of pod you have, you may be able to just place it in a coffee mug and pour water over it. To do this, remove the pod from its packaging and drop it into your mug."
                },
                {
                    "headline": "Pour boiling water into your mug.",
                    "description": "Slowly pour boiling water into the mug. Stop pouring once you’re about half an inch from the top of the mug. Be careful not to burn yourself with the water."
                },
                {
                    "headline": "Steep the pod.",
                    "description": "Allow the pod to soak in the water. If the pod floats to the top of the mug, use a spoon to hold it under the water. Stir the water occasionally. Make sure to pay attention to this process, as your cup of coffee won’t be right if the pod doesn’t steep properly."
                },
                {
                    "headline": "Remove the pod after several minutes.",
                    "description": "The amount of time you leave the pod in the water will determine how strong the coffee is. As a result, you should consider how strong you want your coffee before removing the pod. Leaving the pod in for 2 to 3 minutes will give you a weak cup. Leaving the pod in for 4 minutes will give you a normal cup of coffee. Leaving the pod in for 5 to 6 minutes will give you a strong cup of coffee. Discard the pod when you are done with it."
                }
            ]
        },
        {
            "name": "Placing Coffee Pods in a Non-Compatible Machine",
            "steps": [
                {
                    "headline": "Purchase a coffee pod holster or similar device.",
                    "description": "Find a holster product compatible with your single-serve coffee machine. Read the product’s packaging and reviews to verify that it will work with your machine. This is important, as there are a variety of pod holsters on the market. Not all of them fit every machine. Popular holsters include:\nThe Pod Holster\nThe Solofill\nThe EZ-Cup"
                },
                {
                    "headline": "Place a coffee pod in the holster.",
                    "description": "Don’t force it in. It should easily slide into the holster. After you put the pod into the holster, close the holster. Many holsters snap shut with a little bit of force."
                },
                {
                    "headline": "Load the holster into your machine.",
                    "description": "Carefully place the holster into your machine. Slide it into where you'd load a K Cup, another sort of single-serve coffee product, or your coffee grounds. Make sure not to force it in. If the holster is compatible with your coffee machine, it should easily slide into the machine. After you’ve loaded it, you’ll need to close the coffee loader. On most machines, this requires you to gently push it down."
                },
                {
                    "headline": "Place your mug on the burner.",
                    "description": "Depending on the type of machine, you'll want to place your mug on the burner or wherever the coffee is dispensed. Take your time and place it properly so your coffee does not spill."
                },
                {
                    "headline": "Set the machine.",
                    "description": "After loading the holster, you’ll need to adjust the settings so your cup of coffee is as weak or strong as you want it. When doing this, set the machine to single serve. Depending on your machine, you may be able to choose how much water you want to fill your cup. This will help determine how strong the cup of coffee is."
                },
                {
                    "headline": "Hit start.",
                    "description": "Once you’ve hit start, the machine will flood the holster – and the pod – with water. The water (now coffee) will then be directed down into your mug. Once the stream has ended and filled your cup, feel free to enjoy your coffee."
                }
            ]
        }
    ],
    "tyn": [
        "Coffee pod brewer or similar machine",
        "Coffee pod",
        "Water",
        "Coffee cup",
        "Saucepan or tea kettle",
        "Spoon"
    ],
    "text": " Using a Coffee Pod Machine Fill the water tank/basin. Take a measuring cup and dump enough water in your machine’s water basin so it reaches the point of “max fill.” Make sure to use only cool, clean water. If you want, you can use filtered or distilled water. This will reduce buildup of minerals and make your machine work longer and better. Remove the pod from its packaging. To maintain freshness, coffee pods are usually wrapped individually. Make sure to remove the pod from its packaging without damaging it. To do this, rip along the perforated line of the coffee pod’s packaging to remove it without damaging the pod. Put the pod into your coffee machine. Pop open the pod holder part of your machine. Depending on your machine, you may need to press a button to open it. Then, gently place the pod in the machine. The pod should easily slide into the pod holder. Once it is in, close the pod holder. Adjust the settings of the machine. Depending on what strength you want your coffee, you’ll need to set your machine. Your machine should have a light, medium, or strong setting. If it doesn’t, it might have a setting for the amount of water you want to fill your mug with. The more water, the weaker the cup of coffee. If you don’t adjust your settings, your machine will likely brew you a medium cup of coffee. Brew your coffee. After adjusting your settings, hit the “Brew” or “Start” button on your pod machine. Once you start the machine, it will release hot water into the coffee pod and then the water will be released into your mug. Enjoy your cup of coffee after the stream of water has ceased. Trying Coffee Pods without a Machine Place a pod in your coffee mug. Depending on the type of pod you have, you may be able to just place it in a coffee mug and pour water over it. To do this, remove the pod from its packaging and drop it into your mug. Pour boiling water into your mug. Slowly pour boiling water into the mug. Stop pouring once you’re about half an inch from the top of the mug. Be careful not to burn yourself with the water. Steep the pod. Allow the pod to soak in the water. If the pod floats to the top of the mug, use a spoon to hold it under the water. Stir the water occasionally. Make sure to pay attention to this process, as your cup of coffee won’t be right if the pod doesn’t steep properly. Remove the pod after several minutes. The amount of time you leave the pod in the water will determine how strong the coffee is. As a result, you should consider how strong you want your coffee before removing the pod. Leaving the pod in for 2 to 3 minutes will give you a weak cup. Leaving the pod in for 4 minutes will give you a normal cup of coffee. Leaving the pod in for 5 to 6 minutes will give you a strong cup of coffee. Discard the pod when you are done with it. Placing Coffee Pods in a Non-Compatible Machine Purchase a coffee pod holster or similar device. Find a holster product compatible with your single-serve coffee machine. Read the product’s packaging and reviews to verify that it will work with your machine. This is important, as there are a variety of pod holsters on the market. Not all of them fit every machine. Popular holsters include:\nThe Pod Holster\nThe Solofill\nThe EZ-Cup Place a coffee pod in the holster. Don’t force it in. It should easily slide into the holster. After you put the pod into the holster, close the holster. Many holsters snap shut with a little bit of force. Load the holster into your machine. Carefully place the holster into your machine. Slide it into where you'd load a K Cup, another sort of single-serve coffee product, or your coffee grounds. Make sure not to force it in. If the holster is compatible with your coffee machine, it should easily slide into the machine. After you’ve loaded it, you’ll need to close the coffee loader. On most machines, this requires you to gently push it down. Place your mug on the burner. Depending on the type of machine, you'll want to place your mug on the burner or wherever the coffee is dispensed. Take your time and place it properly so your coffee does not spill. Set the machine. After loading the holster, you’ll need to adjust the settings so your cup of coffee is as weak or strong as you want it. When doing this, set the machine to single serve. Depending on your machine, you may be able to choose how much water you want to fill your cup. This will help determine how strong the cup of coffee is. Hit start. Once you’ve hit start, the machine will flood the holster – and the pod – with water. The water (now coffee) will then be directed down into your mug. Once the stream has ended and filled your cup, feel free to enjoy your coffee.",
    "sentences": [
        " Using a Coffee Pod Machine Fill the water tank/basin.",
        "Take a measuring cup and dump enough water in your machine’s water basin so it reaches the point of “max fill.” Make sure to use only cool, clean water.",
        "If you want, you can use filtered or distilled water.",
        "This will reduce buildup of minerals and make your machine work longer and better.",
        "Remove the pod from its packaging.",
        "To maintain freshness, coffee pods are usually wrapped individually.",
        "Make sure to remove the pod from its packaging without damaging it.",
        "To do this, rip along the perforated line of the coffee pod’s packaging to remove it without damaging the pod.",
        "Put the pod into your coffee machine.",
        "Pop open the pod holder part of your machine.",
        "Depending on your machine, you may need to press a button to open it.",
        "Then, gently place the pod in the machine.",
        "The pod should easily slide into the pod holder.",
        "Once it is in, close the pod holder.",
        "Adjust the settings of the machine.",
        "Depending on what strength you want your coffee, you’ll need to set your machine.",
        "Your machine should have a light, medium, or strong setting.",
        "If it doesn’t, it might have a setting for the amount of water you want to fill your mug with.",
        "The more water, the weaker the cup of coffee.",
        "If you don’t adjust your settings, your machine will likely brew you a medium cup of coffee.",
        "Brew your coffee.",
        "After adjusting your settings, hit the “Brew” or “Start” button on your pod machine.",
        "Once you start the machine, it will release hot water into the coffee pod and then the water will be released into your mug.",
        "Enjoy your cup of coffee after the stream of water has ceased.",
        "Trying Coffee Pods without a Machine Place a pod in your coffee mug.",
        "Depending on the type of pod you have, you may be able to just place it in a coffee mug and pour water over it.",
        "To do this, remove the pod from its packaging and drop it into your mug.",
        "Pour boiling water into your mug.",
        "Slowly pour boiling water into the mug.",
        "Stop pouring once you’re about half an inch from the top of the mug.",
        "Be careful not to burn yourself with the water.",
        "Steep the pod.",
        "Allow the pod to soak in the water.",
        "If the pod floats to the top of the mug, use a spoon to hold it under the water.",
        "Stir the water occasionally.",
        "Make sure to pay attention to this process, as your cup of coffee won’t be right if the pod doesn’t steep properly.",
        "Remove the pod after several minutes.",
        "The amount of time you leave the pod in the water will determine how strong the coffee is.",
        "As a result, you should consider how strong you want your coffee before removing the pod.",
        "Leaving the pod in for 2 to 3 minutes will give you a weak cup.",
        "Leaving the pod in for 4 minutes will give you a normal cup of coffee.",
        "Leaving the pod in for 5 to 6 minutes will give you a strong cup of coffee.",
        "Discard the pod when you are done with it.",
        "Placing Coffee Pods in a Non-Compatible Machine Purchase a coffee pod holster or similar device.",
        "Find a holster product compatible with your single-serve coffee machine.",
        "Read the product’s packaging and reviews to verify that it will work with your machine.",
        "This is important, as there are a variety of pod holsters on the market.",
        "Not all of them fit every machine.",
        "Popular holsters include:\nThe Pod Holster\nThe Solofill\nThe EZ-Cup Place a coffee pod in the holster.",
        "Don’t force it in.",
        "It should easily slide into the holster.",
        "After you put the pod into the holster, close the holster.",
        "Many holsters snap shut with a little bit of force.",
        "Load the holster into your machine.",
        "Carefully place the holster into your machine.",
        "Slide it into where you'd load a K Cup, another sort of single-serve coffee product, or your coffee grounds.",
        "Make sure not to force it in.",
        "If the holster is compatible with your coffee machine, it should easily slide into the machine.",
        "After you’ve loaded it, you’ll need to close the coffee loader.",
        "On most machines, this requires you to gently push it down.",
        "Place your mug on the burner.",
        "Depending on the type of machine, you'll want to place your mug on the burner or wherever the coffee is dispensed.",
        "Take your time and place it properly so your coffee does not spill.",
        "Set the machine.",
        "After loading the holster, you’ll need to adjust the settings so your cup of coffee is as weak or strong as you want it.",
        "When doing this, set the machine to single serve.",
        "Depending on your machine, you may be able to choose how much water you want to fill your cup.",
        "This will help determine how strong the cup of coffee is.",
        "Hit start.",
        "Once you’ve hit start, the machine will flood the holster – and the pod – with water.",
        "The water (now coffee) will then be directed down into your mug.",
        "Once the stream has ended and filled your cup, feel free to enjoy your coffee."
    ]
}