{
    "title": "How to Make Four Legged Pipe Cleaner Animals",
    "url": "https://www.wikihow.com/Make-Four-Legged-Pipe-Cleaner-Animals",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Craft for Kids",
        "Pipe Cleaner Crafts"
    ],
    "steps": [
        {
            "headline": "Select two pipe cleaners of the same color.",
            "description": "Bend the two pipe cleaners, one inch (2.5cm) from both sides, to make legs."
        },
        {
            "headline": "Twist the pipe cleaners together to make the body.",
            "description": "Leave the hind legs free."
        },
        {
            "headline": "Twist a pipe cleaner around the tip of your index finger two times in order to make the head.",
            "description": "Save the end of the pipe cleaner to form the neck."
        },
        {
            "headline": "Attach the neck to the body.",
            "description": "Then, cut 2 inches (5cm) off another pipe cleaner and loop that one around the top of the head to form the animal's ears. Use the remainder of the cut pipe cleaner for the tail, which is looped at the top of the hind legs."
        }
    ],
    "tyn": [
        "Four pipe cleaners (also called \"chenille stems/sticks\")",
        "Wire cutters; using scissors will destroy the blades of your scissors",
        "Needle nose pliers"
    ],
    "text": " Select two pipe cleaners of the same color. Bend the two pipe cleaners, one inch (2.5cm) from both sides, to make legs. Twist the pipe cleaners together to make the body. Leave the hind legs free. Twist a pipe cleaner around the tip of your index finger two times in order to make the head. Save the end of the pipe cleaner to form the neck. Attach the neck to the body. Then, cut 2 inches (5cm) off another pipe cleaner and loop that one around the top of the head to form the animal's ears. Use the remainder of the cut pipe cleaner for the tail, which is looped at the top of the hind legs.",
    "sentences": [
        " Select two pipe cleaners of the same color.",
        "Bend the two pipe cleaners, one inch (2.5cm) from both sides, to make legs.",
        "Twist the pipe cleaners together to make the body.",
        "Leave the hind legs free.",
        "Twist a pipe cleaner around the tip of your index finger two times in order to make the head.",
        "Save the end of the pipe cleaner to form the neck.",
        "Attach the neck to the body.",
        "Then, cut 2 inches (5cm) off another pipe cleaner and loop that one around the top of the head to form the animal's ears.",
        "Use the remainder of the cut pipe cleaner for the tail, which is looped at the top of the hind legs."
    ]
}