{
    "title": "How to Make Glitter Pumps",
    "url": "https://www.wikihow.com/Make-Glitter-Pumps",
    "category_hierarchy": [
        "Personal Care and Style",
        "Footwear",
        "Shoemaking"
    ],
    "parts": [
        {
            "name": "Prepping the Shoes",
            "steps": [
                {
                    "headline": "Choose a pair of pumps to glitter.",
                    "description": "You can apply glitter to the entire shoe, or to just one part, such as the heel or the sole. Make sure that the pumps are smooth. Any textures or embellishments, such as bows or rhinestones, will make it difficult for the glitter to stick. If the pumps come with laces, bows, or any other decorations, remove these temporarily. You will put them back on in the end."
                },
                {
                    "headline": "Clean the shoes.",
                    "description": "Wipe the shoes down to remove any surface dirt. This is very important. Any surface dirt or oils will prevent the litter from sticking. If you will be applying glitter to the underside of the sole, wipe it down with rubbing alcohol."
                },
                {
                    "headline": "Stuff the shoes with newspaper.",
                    "description": "If you don't have any newspaper, you can also use crumpled up paper, tissue paper, or even a plastic bag. This will help keep the insides of the shoes clean and glitter free."
                },
                {
                    "headline": "Mask off the areas you don't want glittered with painter's tape.",
                    "description": "For example, if you are glittering the entire shoe, cover the sole with masking tape. If you are glittering the sole, wrap tape around the bottom edge of the shoe, right where the material meets the sole. This will help keep your lines neat and crisp."
                }
            ]
        },
        {
            "name": "Glittering the Shoes",
            "steps": [
                {
                    "headline": "Cover a small portion of the shoe with a thick layer of Mod Podge.",
                    "description": "It is best to work a small area at a time. If you cover the entire shoe with Mod Podge, parts of it may dry before you add the glitter. You can apply the Mod Podge using a paintbrush or a foam brush. Be generous when applying the Mod Podge; don't skimp on it. You want it to appear white."
                },
                {
                    "headline": "Shake on some glitter.",
                    "description": "You can use chunky glitter or ultra-fine glitter. The choice is up to you. If you need to, use your fingers to gently pat the glitter into place so that it lays flat. Work over a sheet of paper. When you are done, you can fold the paper in half, and funnel the glitter back into its jar."
                },
                {
                    "headline": "Tap off the excess glitter.",
                    "description": "Chances are, the excess glitter already slid off of the shoe, but gently tap the shoe against your work surface just to be sure. This will give you a smoother finish. Don't worry if the shoe appears patchy—you can always apply more layers later on!"
                },
                {
                    "headline": "Continue painting the shoe and shaking on glitter.",
                    "description": "Once you have the entire portion covered with glitter, move onto the next patch. Apply more Mod Podge, then shake on more glitter. Keep doing this until the entire shoe is covered in glitter. When you are done, move onto the next shoe. If the shoe gets awkward to hold because of all the glitter, let the glitter dry for 1 hour, then continue working."
                },
                {
                    "headline": "Allow the glitter to dry.",
                    "description": "Set the shoes down some place where they will not be bumped or disturbed. Make sure that no dust, lint, or pet hair gets on the shoes."
                },
                {
                    "headline": "Apply a second coat of glitter, if necessary.",
                    "description": "As the Mod Podge dries, you may notice the glitter layer becoming more translucent. Part of the shoe may even show through, especially if it is a different color. If this happens, you will need to apply another layer. Simply repeat the process: apply some Mod Podge, then shake on some glitter."
                }
            ]
        },
        {
            "name": "Finishing the Shoes",
            "steps": [
                {
                    "headline": "Seal the glitter with an acrylic sealer.",
                    "description": "You can use the spray-on kind or the brush-on kind. You will need two coats. Let the first coat dry completely before applying the next one. If you can't find an acrylic sealer, you can use more Mod Podge instead. Make sure that you use a sealer with a glossy finish. A matte finish will dull the glitter and give you a sandy finish instead."
                },
                {
                    "headline": "Remove the tape and newspaper.",
                    "description": "If there is any glitter stuck where you don't want it, wipe it away with a damp sponge or towel. Use a piece of tape to pick off any stubborn bits of glitter or Mod Podge."
                },
                {
                    "headline": "Extend the sealer, if necessary.",
                    "description": "If you applied the glitter to only a small portion of your shoe, such as a heart shape, it might be a good idea to extend the sealer just a smidge beyond the glitter. Use a thin paintbrush and some more brush-on acrylic sealer (or Mod Podge), and paint just outside the design. This will help lock the design in and keep it from peeling away."
                },
                {
                    "headline": "Allow the shoes to dry completely before wearing them.",
                    "description": "In most cases, you will need to wait 24 hours. Check the label on your Mod Podge and sealer just to be sure. Just because something feels dry to the touch does not necessarily mean that it is fully dry and ready to use."
                }
            ]
        }
    ],
    "tyn": [
        "Pumps",
        "Mod Podge",
        "Glitter",
        "Painter's tape",
        "Newspaper",
        "Paintbrush or foam brush",
        "Acrylic sealer"
    ],
    "text": " Prepping the Shoes Choose a pair of pumps to glitter. You can apply glitter to the entire shoe, or to just one part, such as the heel or the sole. Make sure that the pumps are smooth. Any textures or embellishments, such as bows or rhinestones, will make it difficult for the glitter to stick. If the pumps come with laces, bows, or any other decorations, remove these temporarily. You will put them back on in the end. Clean the shoes. Wipe the shoes down to remove any surface dirt. This is very important. Any surface dirt or oils will prevent the litter from sticking. If you will be applying glitter to the underside of the sole, wipe it down with rubbing alcohol. Stuff the shoes with newspaper. If you don't have any newspaper, you can also use crumpled up paper, tissue paper, or even a plastic bag. This will help keep the insides of the shoes clean and glitter free. Mask off the areas you don't want glittered with painter's tape. For example, if you are glittering the entire shoe, cover the sole with masking tape. If you are glittering the sole, wrap tape around the bottom edge of the shoe, right where the material meets the sole. This will help keep your lines neat and crisp. Glittering the Shoes Cover a small portion of the shoe with a thick layer of Mod Podge. It is best to work a small area at a time. If you cover the entire shoe with Mod Podge, parts of it may dry before you add the glitter. You can apply the Mod Podge using a paintbrush or a foam brush. Be generous when applying the Mod Podge; don't skimp on it. You want it to appear white. Shake on some glitter. You can use chunky glitter or ultra-fine glitter. The choice is up to you. If you need to, use your fingers to gently pat the glitter into place so that it lays flat. Work over a sheet of paper. When you are done, you can fold the paper in half, and funnel the glitter back into its jar. Tap off the excess glitter. Chances are, the excess glitter already slid off of the shoe, but gently tap the shoe against your work surface just to be sure. This will give you a smoother finish. Don't worry if the shoe appears patchy—you can always apply more layers later on! Continue painting the shoe and shaking on glitter. Once you have the entire portion covered with glitter, move onto the next patch. Apply more Mod Podge, then shake on more glitter. Keep doing this until the entire shoe is covered in glitter. When you are done, move onto the next shoe. If the shoe gets awkward to hold because of all the glitter, let the glitter dry for 1 hour, then continue working. Allow the glitter to dry. Set the shoes down some place where they will not be bumped or disturbed. Make sure that no dust, lint, or pet hair gets on the shoes. Apply a second coat of glitter, if necessary. As the Mod Podge dries, you may notice the glitter layer becoming more translucent. Part of the shoe may even show through, especially if it is a different color. If this happens, you will need to apply another layer. Simply repeat the process: apply some Mod Podge, then shake on some glitter. Finishing the Shoes Seal the glitter with an acrylic sealer. You can use the spray-on kind or the brush-on kind. You will need two coats. Let the first coat dry completely before applying the next one. If you can't find an acrylic sealer, you can use more Mod Podge instead. Make sure that you use a sealer with a glossy finish. A matte finish will dull the glitter and give you a sandy finish instead. Remove the tape and newspaper. If there is any glitter stuck where you don't want it, wipe it away with a damp sponge or towel. Use a piece of tape to pick off any stubborn bits of glitter or Mod Podge. Extend the sealer, if necessary. If you applied the glitter to only a small portion of your shoe, such as a heart shape, it might be a good idea to extend the sealer just a smidge beyond the glitter. Use a thin paintbrush and some more brush-on acrylic sealer (or Mod Podge), and paint just outside the design. This will help lock the design in and keep it from peeling away. Allow the shoes to dry completely before wearing them. In most cases, you will need to wait 24 hours. Check the label on your Mod Podge and sealer just to be sure. Just because something feels dry to the touch does not necessarily mean that it is fully dry and ready to use.",
    "sentences": [
        " Prepping the Shoes Choose a pair of pumps to glitter.",
        "You can apply glitter to the entire shoe, or to just one part, such as the heel or the sole.",
        "Make sure that the pumps are smooth.",
        "Any textures or embellishments, such as bows or rhinestones, will make it difficult for the glitter to stick.",
        "If the pumps come with laces, bows, or any other decorations, remove these temporarily.",
        "You will put them back on in the end.",
        "Clean the shoes.",
        "Wipe the shoes down to remove any surface dirt.",
        "This is very important.",
        "Any surface dirt or oils will prevent the litter from sticking.",
        "If you will be applying glitter to the underside of the sole, wipe it down with rubbing alcohol.",
        "Stuff the shoes with newspaper.",
        "If you don't have any newspaper, you can also use crumpled up paper, tissue paper, or even a plastic bag.",
        "This will help keep the insides of the shoes clean and glitter free.",
        "Mask off the areas you don't want glittered with painter's tape.",
        "For example, if you are glittering the entire shoe, cover the sole with masking tape.",
        "If you are glittering the sole, wrap tape around the bottom edge of the shoe, right where the material meets the sole.",
        "This will help keep your lines neat and crisp.",
        "Glittering the Shoes Cover a small portion of the shoe with a thick layer of Mod Podge.",
        "It is best to work a small area at a time.",
        "If you cover the entire shoe with Mod Podge, parts of it may dry before you add the glitter.",
        "You can apply the Mod Podge using a paintbrush or a foam brush.",
        "Be generous when applying the Mod Podge; don't skimp on it.",
        "You want it to appear white.",
        "Shake on some glitter.",
        "You can use chunky glitter or ultra-fine glitter.",
        "The choice is up to you.",
        "If you need to, use your fingers to gently pat the glitter into place so that it lays flat.",
        "Work over a sheet of paper.",
        "When you are done, you can fold the paper in half, and funnel the glitter back into its jar.",
        "Tap off the excess glitter.",
        "Chances are, the excess glitter already slid off of the shoe, but gently tap the shoe against your work surface just to be sure.",
        "This will give you a smoother finish.",
        "Don't worry if the shoe appears patchy—you can always apply more layers later on!",
        "Continue painting the shoe and shaking on glitter.",
        "Once you have the entire portion covered with glitter, move onto the next patch.",
        "Apply more Mod Podge, then shake on more glitter.",
        "Keep doing this until the entire shoe is covered in glitter.",
        "When you are done, move onto the next shoe.",
        "If the shoe gets awkward to hold because of all the glitter, let the glitter dry for 1 hour, then continue working.",
        "Allow the glitter to dry.",
        "Set the shoes down some place where they will not be bumped or disturbed.",
        "Make sure that no dust, lint, or pet hair gets on the shoes.",
        "Apply a second coat of glitter, if necessary.",
        "As the Mod Podge dries, you may notice the glitter layer becoming more translucent.",
        "Part of the shoe may even show through, especially if it is a different color.",
        "If this happens, you will need to apply another layer.",
        "Simply repeat the process: apply some Mod Podge, then shake on some glitter.",
        "Finishing the Shoes Seal the glitter with an acrylic sealer.",
        "You can use the spray-on kind or the brush-on kind.",
        "You will need two coats.",
        "Let the first coat dry completely before applying the next one.",
        "If you can't find an acrylic sealer, you can use more Mod Podge instead.",
        "Make sure that you use a sealer with a glossy finish.",
        "A matte finish will dull the glitter and give you a sandy finish instead.",
        "Remove the tape and newspaper.",
        "If there is any glitter stuck where you don't want it, wipe it away with a damp sponge or towel.",
        "Use a piece of tape to pick off any stubborn bits of glitter or Mod Podge.",
        "Extend the sealer, if necessary.",
        "If you applied the glitter to only a small portion of your shoe, such as a heart shape, it might be a good idea to extend the sealer just a smidge beyond the glitter.",
        "Use a thin paintbrush and some more brush-on acrylic sealer (or Mod Podge), and paint just outside the design.",
        "This will help lock the design in and keep it from peeling away.",
        "Allow the shoes to dry completely before wearing them.",
        "In most cases, you will need to wait 24 hours.",
        "Check the label on your Mod Podge and sealer just to be sure.",
        "Just because something feels dry to the touch does not necessarily mean that it is fully dry and ready to use."
    ]
}