{
    "title": "How to Be Bellatrix Lestrange for Halloween",
    "url": "https://www.wikihow.com/Be-Bellatrix-Lestrange-for-Halloween",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Cosplay",
        "Book Character Cosplay"
    ],
    "parts": [
        {
            "name": "Putting Together a Bellatrix Outfit",
            "steps": [
                {
                    "headline": "Put on a long black dress.",
                    "description": "The details aren’t very important; any fitted black dress can pass for a Bellatrix Lestrange dress as long as it’s solid black and falls somewhere between knee and ankle length. You can also pair a long solid black skirt with a solid black shirt if you’d prefer."
                },
                {
                    "headline": "Wear black stockings.",
                    "description": "Put on some black stockings to complete your Bellatrix outfit. It’s ideal to go with either black fishnets or black sheer stockings."
                },
                {
                    "headline": "Wear black high-heeled boots.",
                    "description": "Bellatrix Lestrange wears knee-high black boots with a stiletto heel. Wear a pair of boots similar to these to demonstrate her sultry style. If you aren’t comfortable wearing stiletto heels, you can instead wear black ankle boots with a smaller, more supportive heel. If you aren’t interested in wearing high heels at all, wear a pair of solid black boots that have a flat heel."
                },
                {
                    "headline": "Put a black corset on over your dress.",
                    "description": "Wear a black corset to accentuate your curves like Bellatrix Lestrange does. This is essential to capturing both the sensuality and gothic darkness that she emits."
                },
                {
                    "headline": "Wear long black fingerless gloves.",
                    "description": "Bellatrix’s character has an edgy roughness about her. Get a pair of long solid black gloves and cut off the fingertips to display this roughness. Ideally, the gloves should at least reach your elbows."
                },
                {
                    "headline": "Accessorize with a green necklace.",
                    "description": "Bellatrix usually wears a necklace and is also a former student of the house of Slytherin. Because of this, you can wear any simple silver necklace with a green pendant. As an alternative, you can wear a Victorian-style necklace. Victorian jewelry can be made of silver, gold, tortoiseshell, gemstones, pearls and/or an assortment of metals. Pieces that have a “C” clasp or a claw-like setting will appear especially Victorian."
                },
                {
                    "headline": "Make or buy a magic wand.",
                    "description": "When dressing up as a character from Harry Potter, having a wand is essential. You can either buy one online or in a Halloween store. As an alternative, you can make one yourself. If you’re in a rush, head outside and find a stick to use as your wand. You can make a simple DIY wand with chopsticks, a hot glue gun, and some brown paint. Create a knobby branch-like texture with the hot glue on the first two inches (5.1 cm) of the thicker end of the chopstick. Give the glue a couple minutes to cool and dry and finally coat the whole chopstick in brown paint with a paintbrush."
                }
            ]
        },
        {
            "name": "Applying Bellatrix Makeup",
            "steps": [
                {
                    "headline": "Put on foundation and concealer.",
                    "description": "Before applying makeup specific to a Bellatrix look, use a makeup sponge or brush to apply a foundation and a concealer that match your skin tone. Apply liquid or powder foundation all over your face and neck. Then create an even canvas by using concealer to lighten your undereye area and cover up any blemishes."
                },
                {
                    "headline": "Use a brown eyeshadow to add contrast and definition to your face.",
                    "description": "First, apply brown eyeshadow to your cheeks to make them look sunken in. Then use the eyeshadow to create lines along the edges of your nose, which will make it look more pronounced. Use a makeup sponge or fluffy makeup brush to blend these areas softly into your foundation. You can also use a contouring powder to do this."
                },
                {
                    "headline": "Apply the brown eyeshadow to your eyelids.",
                    "description": "Use this same brown eyeshadow to darken your eyes. Use a small makeup brush to lightly spread the brown eyeshadow across your entire eyelid. Then apply the eyeshadow directly underneath your lower waterline as well."
                },
                {
                    "headline": "Apply a red eyeshadow to your eyelids.",
                    "description": "Also add a translucent red color to your eyes. Put red eyeshadow on your eyelids overtop of the brown eyeshadow with a small makeup brush. This will further contribute to a somber appearance. Once you’ve finished your eye makeup, practice opening your eyes wide and smiling a big, creepy smile like Bellatrix. The red and brown eyeshadow should help you look scary and insane when you make this Bellatrix face."
                },
                {
                    "headline": "Go with a reddish-brownish lip color.",
                    "description": "To look like Bellatrix, pick a lipstick, cream or gloss that is a reddish-brownish color. Carefully coat your lips and then rub them together to even out the application. If you have a cupid’s bow, connect it with lipliner in order to resemble Bellatrix more accurately."
                },
                {
                    "headline": "Draw on her tattoos with eyeliner.",
                    "description": "Bellatrix has two main tattoos, and drawing these on with some black eyeliner can really take your costume to the next level. Use your eyeliner to write Bellatrix’s prisoner number on the left side of your neck. If your gloves don’t cover your forearms, also draw on the Dark Mark. The Dark Mark is a skull with a twisted snake below it. Bellatrix’s neck tattoo has four characters. The first looks like a lowercase “t” with lines that are curved, the second looks like an upside down capital “T” with another horizontal line beneath it, and the last two characters are the numbers “9” and “3.”\nThe eyeliner may smudge, so be careful not to touch the tattoo once you’ve drawn it on."
                },
                {
                    "headline": "Put on a coat of black mascara.",
                    "description": "Finish your look with a quick coat of mascara. Use a dark black mascara to continue contributing to a darkness vibe. You can also put on some black eyeliner along your lower waterline to help with this."
                }
            ]
        },
        {
            "name": "Creating the Bellatrix Hairstyle",
            "steps": [
                {
                    "headline": "Spray heat protectant on your hair.",
                    "description": "To keep your hair from getting damaged by hair styling tools that use heat, it’s always good to put on some heat protectant ahead of time. Hold the protectant about 6-8 inches (15.2-20.3 cm) away from your head, close your eyes, and spray all of your hair."
                },
                {
                    "headline": "Curl your hair with a curling iron.",
                    "description": "Plug in and turn on a curling iron. Once it has heated up, take a small chunk of your hair and clamp the end with the iron. Rotate the iron and slowly bring it upward until most of the strand is wrapped around the iron. Hold it for several seconds and then release the hair from the clamp. Repeat this process for all of your hair."
                },
                {
                    "headline": "Secure your hair with small clips.",
                    "description": "As you curl your hair, spray, twist, and clip each curled chunk close to your head with small hair clips. This will help the curl to hold. Once you are done curling, all of your hair should be secured to your head with the clips. At this point, leave the clips in for at least two minutes and spray your hair with hairspray one more time if you wish."
                },
                {
                    "headline": "Tease your hair to achieve messiness.",
                    "description": "Unclip your hair completely and start using a comb to  tease your hair. To do this, hold a strand by the ends of your hair and comb the hair upwards from the ends to the roots. This will create a crazy, disheveled look that’s vital to portraying Bellatrix. Practice your high-pitched bone-chilling Bellatrix laugh while you toss around your messy hair. Paired together, these will help you portray Bellatrix’s dark insanity."
                },
                {
                    "headline": "Pin up your hair around the crown area.",
                    "description": "Use bobby pins to pin up hair around the crown of your head in a messy half-up half-down way. Secure the bobby pins in an “x” shape so that your hairstyle will hold."
                },
                {
                    "headline": "Cover one eye with a big chunk of hair.",
                    "description": "Instead of pinning it back, let a big chunk of hair near your face fall forward and cover one eye. This is key part of Bellatrix’s image."
                },
                {
                    "headline": "Use white eyeshadow to create a white streak.",
                    "description": "Bellatrix has a small solid chunk of white hair. Dab a big makeup brush in white eyeshadow and apply the eyeshadow to a chunk of hair that is close to your face. You can also create the illusion of white hair with dry shampoo or baby powder."
                }
            ]
        }
    ],
    "tyn": [
        "Black dress",
        "Black corset",
        "Black boots",
        "Black gloves",
        "Necklace",
        "Black Stockings",
        "Magic Wand",
        "Makeup brushes",
        "Foundation",
        "Concealer",
        "Brown eyeshadow or contouring powder",
        "Red eyeshadow",
        "Reddish brownish lip makeup",
        "Black eyeliner",
        "Black mascara",
        "Heat Protectant spray",
        "Curling iron",
        "Hairspray",
        "Hair clips",
        "Bobby pins",
        "Comb",
        "White eyeshadow, dry shampoo, or baby powder"
    ],
    "text": " Putting Together a Bellatrix Outfit Put on a long black dress. The details aren’t very important; any fitted black dress can pass for a Bellatrix Lestrange dress as long as it’s solid black and falls somewhere between knee and ankle length. You can also pair a long solid black skirt with a solid black shirt if you’d prefer. Wear black stockings. Put on some black stockings to complete your Bellatrix outfit. It’s ideal to go with either black fishnets or black sheer stockings. Wear black high-heeled boots. Bellatrix Lestrange wears knee-high black boots with a stiletto heel. Wear a pair of boots similar to these to demonstrate her sultry style. If you aren’t comfortable wearing stiletto heels, you can instead wear black ankle boots with a smaller, more supportive heel. If you aren’t interested in wearing high heels at all, wear a pair of solid black boots that have a flat heel. Put a black corset on over your dress. Wear a black corset to accentuate your curves like Bellatrix Lestrange does. This is essential to capturing both the sensuality and gothic darkness that she emits. Wear long black fingerless gloves. Bellatrix’s character has an edgy roughness about her. Get a pair of long solid black gloves and cut off the fingertips to display this roughness. Ideally, the gloves should at least reach your elbows. Accessorize with a green necklace. Bellatrix usually wears a necklace and is also a former student of the house of Slytherin. Because of this, you can wear any simple silver necklace with a green pendant. As an alternative, you can wear a Victorian-style necklace. Victorian jewelry can be made of silver, gold, tortoiseshell, gemstones, pearls and/or an assortment of metals. Pieces that have a “C” clasp or a claw-like setting will appear especially Victorian. Make or buy a magic wand. When dressing up as a character from Harry Potter, having a wand is essential. You can either buy one online or in a Halloween store. As an alternative, you can make one yourself. If you’re in a rush, head outside and find a stick to use as your wand. You can make a simple DIY wand with chopsticks, a hot glue gun, and some brown paint. Create a knobby branch-like texture with the hot glue on the first two inches (5.1 cm) of the thicker end of the chopstick. Give the glue a couple minutes to cool and dry and finally coat the whole chopstick in brown paint with a paintbrush. Applying Bellatrix Makeup Put on foundation and concealer. Before applying makeup specific to a Bellatrix look, use a makeup sponge or brush to apply a foundation and a concealer that match your skin tone. Apply liquid or powder foundation all over your face and neck. Then create an even canvas by using concealer to lighten your undereye area and cover up any blemishes. Use a brown eyeshadow to add contrast and definition to your face. First, apply brown eyeshadow to your cheeks to make them look sunken in. Then use the eyeshadow to create lines along the edges of your nose, which will make it look more pronounced. Use a makeup sponge or fluffy makeup brush to blend these areas softly into your foundation. You can also use a contouring powder to do this. Apply the brown eyeshadow to your eyelids. Use this same brown eyeshadow to darken your eyes. Use a small makeup brush to lightly spread the brown eyeshadow across your entire eyelid. Then apply the eyeshadow directly underneath your lower waterline as well. Apply a red eyeshadow to your eyelids. Also add a translucent red color to your eyes. Put red eyeshadow on your eyelids overtop of the brown eyeshadow with a small makeup brush. This will further contribute to a somber appearance. Once you’ve finished your eye makeup, practice opening your eyes wide and smiling a big, creepy smile like Bellatrix. The red and brown eyeshadow should help you look scary and insane when you make this Bellatrix face. Go with a reddish-brownish lip color. To look like Bellatrix, pick a lipstick, cream or gloss that is a reddish-brownish color. Carefully coat your lips and then rub them together to even out the application. If you have a cupid’s bow, connect it with lipliner in order to resemble Bellatrix more accurately. Draw on her tattoos with eyeliner. Bellatrix has two main tattoos, and drawing these on with some black eyeliner can really take your costume to the next level. Use your eyeliner to write Bellatrix’s prisoner number on the left side of your neck. If your gloves don’t cover your forearms, also draw on the Dark Mark. The Dark Mark is a skull with a twisted snake below it. Bellatrix’s neck tattoo has four characters. The first looks like a lowercase “t” with lines that are curved, the second looks like an upside down capital “T” with another horizontal line beneath it, and the last two characters are the numbers “9” and “3.”\nThe eyeliner may smudge, so be careful not to touch the tattoo once you’ve drawn it on. Put on a coat of black mascara. Finish your look with a quick coat of mascara. Use a dark black mascara to continue contributing to a darkness vibe. You can also put on some black eyeliner along your lower waterline to help with this. Creating the Bellatrix Hairstyle Spray heat protectant on your hair. To keep your hair from getting damaged by hair styling tools that use heat, it’s always good to put on some heat protectant ahead of time. Hold the protectant about 6-8 inches (15.2-20.3 cm) away from your head, close your eyes, and spray all of your hair. Curl your hair with a curling iron. Plug in and turn on a curling iron. Once it has heated up, take a small chunk of your hair and clamp the end with the iron. Rotate the iron and slowly bring it upward until most of the strand is wrapped around the iron. Hold it for several seconds and then release the hair from the clamp. Repeat this process for all of your hair. Secure your hair with small clips. As you curl your hair, spray, twist, and clip each curled chunk close to your head with small hair clips. This will help the curl to hold. Once you are done curling, all of your hair should be secured to your head with the clips. At this point, leave the clips in for at least two minutes and spray your hair with hairspray one more time if you wish. Tease your hair to achieve messiness. Unclip your hair completely and start using a comb to  tease your hair. To do this, hold a strand by the ends of your hair and comb the hair upwards from the ends to the roots. This will create a crazy, disheveled look that’s vital to portraying Bellatrix. Practice your high-pitched bone-chilling Bellatrix laugh while you toss around your messy hair. Paired together, these will help you portray Bellatrix’s dark insanity. Pin up your hair around the crown area. Use bobby pins to pin up hair around the crown of your head in a messy half-up half-down way. Secure the bobby pins in an “x” shape so that your hairstyle will hold. Cover one eye with a big chunk of hair. Instead of pinning it back, let a big chunk of hair near your face fall forward and cover one eye. This is key part of Bellatrix’s image. Use white eyeshadow to create a white streak. Bellatrix has a small solid chunk of white hair. Dab a big makeup brush in white eyeshadow and apply the eyeshadow to a chunk of hair that is close to your face. You can also create the illusion of white hair with dry shampoo or baby powder.",
    "sentences": [
        " Putting Together a Bellatrix Outfit Put on a long black dress.",
        "The details aren’t very important; any fitted black dress can pass for a Bellatrix Lestrange dress as long as it’s solid black and falls somewhere between knee and ankle length.",
        "You can also pair a long solid black skirt with a solid black shirt if you’d prefer.",
        "Wear black stockings.",
        "Put on some black stockings to complete your Bellatrix outfit.",
        "It’s ideal to go with either black fishnets or black sheer stockings.",
        "Wear black high-heeled boots.",
        "Bellatrix Lestrange wears knee-high black boots with a stiletto heel.",
        "Wear a pair of boots similar to these to demonstrate her sultry style.",
        "If you aren’t comfortable wearing stiletto heels, you can instead wear black ankle boots with a smaller, more supportive heel.",
        "If you aren’t interested in wearing high heels at all, wear a pair of solid black boots that have a flat heel.",
        "Put a black corset on over your dress.",
        "Wear a black corset to accentuate your curves like Bellatrix Lestrange does.",
        "This is essential to capturing both the sensuality and gothic darkness that she emits.",
        "Wear long black fingerless gloves.",
        "Bellatrix’s character has an edgy roughness about her.",
        "Get a pair of long solid black gloves and cut off the fingertips to display this roughness.",
        "Ideally, the gloves should at least reach your elbows.",
        "Accessorize with a green necklace.",
        "Bellatrix usually wears a necklace and is also a former student of the house of Slytherin.",
        "Because of this, you can wear any simple silver necklace with a green pendant.",
        "As an alternative, you can wear a Victorian-style necklace.",
        "Victorian jewelry can be made of silver, gold, tortoiseshell, gemstones, pearls and/or an assortment of metals.",
        "Pieces that have a “C” clasp or a claw-like setting will appear especially Victorian.",
        "Make or buy a magic wand.",
        "When dressing up as a character from Harry Potter, having a wand is essential.",
        "You can either buy one online or in a Halloween store.",
        "As an alternative, you can make one yourself.",
        "If you’re in a rush, head outside and find a stick to use as your wand.",
        "You can make a simple DIY wand with chopsticks, a hot glue gun, and some brown paint.",
        "Create a knobby branch-like texture with the hot glue on the first two inches (5.1 cm) of the thicker end of the chopstick.",
        "Give the glue a couple minutes to cool and dry and finally coat the whole chopstick in brown paint with a paintbrush.",
        "Applying Bellatrix Makeup Put on foundation and concealer.",
        "Before applying makeup specific to a Bellatrix look, use a makeup sponge or brush to apply a foundation and a concealer that match your skin tone.",
        "Apply liquid or powder foundation all over your face and neck.",
        "Then create an even canvas by using concealer to lighten your undereye area and cover up any blemishes.",
        "Use a brown eyeshadow to add contrast and definition to your face.",
        "First, apply brown eyeshadow to your cheeks to make them look sunken in.",
        "Then use the eyeshadow to create lines along the edges of your nose, which will make it look more pronounced.",
        "Use a makeup sponge or fluffy makeup brush to blend these areas softly into your foundation.",
        "You can also use a contouring powder to do this.",
        "Apply the brown eyeshadow to your eyelids.",
        "Use this same brown eyeshadow to darken your eyes.",
        "Use a small makeup brush to lightly spread the brown eyeshadow across your entire eyelid.",
        "Then apply the eyeshadow directly underneath your lower waterline as well.",
        "Apply a red eyeshadow to your eyelids.",
        "Also add a translucent red color to your eyes.",
        "Put red eyeshadow on your eyelids overtop of the brown eyeshadow with a small makeup brush.",
        "This will further contribute to a somber appearance.",
        "Once you’ve finished your eye makeup, practice opening your eyes wide and smiling a big, creepy smile like Bellatrix.",
        "The red and brown eyeshadow should help you look scary and insane when you make this Bellatrix face.",
        "Go with a reddish-brownish lip color.",
        "To look like Bellatrix, pick a lipstick, cream or gloss that is a reddish-brownish color.",
        "Carefully coat your lips and then rub them together to even out the application.",
        "If you have a cupid’s bow, connect it with lipliner in order to resemble Bellatrix more accurately.",
        "Draw on her tattoos with eyeliner.",
        "Bellatrix has two main tattoos, and drawing these on with some black eyeliner can really take your costume to the next level.",
        "Use your eyeliner to write Bellatrix’s prisoner number on the left side of your neck.",
        "If your gloves don’t cover your forearms, also draw on the Dark Mark.",
        "The Dark Mark is a skull with a twisted snake below it.",
        "Bellatrix’s neck tattoo has four characters.",
        "The first looks like a lowercase “t” with lines that are curved, the second looks like an upside down capital “T” with another horizontal line beneath it, and the last two characters are the numbers “9” and “3.”\nThe eyeliner may smudge, so be careful not to touch the tattoo once you’ve drawn it on.",
        "Put on a coat of black mascara.",
        "Finish your look with a quick coat of mascara.",
        "Use a dark black mascara to continue contributing to a darkness vibe.",
        "You can also put on some black eyeliner along your lower waterline to help with this.",
        "Creating the Bellatrix Hairstyle Spray heat protectant on your hair.",
        "To keep your hair from getting damaged by hair styling tools that use heat, it’s always good to put on some heat protectant ahead of time.",
        "Hold the protectant about 6-8 inches (15.2-20.3 cm) away from your head, close your eyes, and spray all of your hair.",
        "Curl your hair with a curling iron.",
        "Plug in and turn on a curling iron.",
        "Once it has heated up, take a small chunk of your hair and clamp the end with the iron.",
        "Rotate the iron and slowly bring it upward until most of the strand is wrapped around the iron.",
        "Hold it for several seconds and then release the hair from the clamp.",
        "Repeat this process for all of your hair.",
        "Secure your hair with small clips.",
        "As you curl your hair, spray, twist, and clip each curled chunk close to your head with small hair clips.",
        "This will help the curl to hold.",
        "Once you are done curling, all of your hair should be secured to your head with the clips.",
        "At this point, leave the clips in for at least two minutes and spray your hair with hairspray one more time if you wish.",
        "Tease your hair to achieve messiness.",
        "Unclip your hair completely and start using a comb to  tease your hair.",
        "To do this, hold a strand by the ends of your hair and comb the hair upwards from the ends to the roots.",
        "This will create a crazy, disheveled look that’s vital to portraying Bellatrix.",
        "Practice your high-pitched bone-chilling Bellatrix laugh while you toss around your messy hair.",
        "Paired together, these will help you portray Bellatrix’s dark insanity.",
        "Pin up your hair around the crown area.",
        "Use bobby pins to pin up hair around the crown of your head in a messy half-up half-down way.",
        "Secure the bobby pins in an “x” shape so that your hairstyle will hold.",
        "Cover one eye with a big chunk of hair.",
        "Instead of pinning it back, let a big chunk of hair near your face fall forward and cover one eye.",
        "This is key part of Bellatrix’s image.",
        "Use white eyeshadow to create a white streak.",
        "Bellatrix has a small solid chunk of white hair.",
        "Dab a big makeup brush in white eyeshadow and apply the eyeshadow to a chunk of hair that is close to your face.",
        "You can also create the illusion of white hair with dry shampoo or baby powder."
    ]
}