{
    "title": "How to Make a Well",
    "url": "https://www.wikihow.com/Make-a-Well",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Choosing an Area",
            "steps": [
                {
                    "headline": "Check your local laws.",
                    "description": "In most states, it is legal to drill your own well. However, in some states, you must have a permit to drill over 200 feet, so you may need to get the permit or have the well professionally drilled. Check your local codes by calling local officials or searching online."
                },
                {
                    "headline": "Don’t put the well near sources of contamination.",
                    "description": "Septic tanks, muddy areas, sewers or animal pens can all potentially contaminate wells. Waste matter leeches through the soil, all the way down to the water reservoir: anyone who drinks water from a well drilled near these areas could get sick. Drill at least 50 feet away from any of these areas."
                },
                {
                    "headline": "Confirm your well location with utility companies.",
                    "description": "If you live in a populated area, you will want to check with your local utility companies before you drill. Many electricity, gas and telephone companies run conduits underground, so any drilling could interfere with or strike their lines. Call your utility providers to find the location of any cabling running under your property."
                },
                {
                    "headline": "Choose a site that will yield the most water.",
                    "description": "Different factors on your property will give you information about how much water to expect to get from underwater reservoirs. Soil type, topography, information about your water table and vegetation can give clues about where to dig. Areas with heavy sand and gravel deposits often yield water. The larger the pieces of gravel or sand, the more water is most likely beneath the surface. These areas will be harder to drill, however, because of large boulders that may exist in the path of your drill. Vegetation can tell you the location of water. In arid climates, locations with greater number of plants growing indicate water below the surface. Look for groups of trees or shrubs to locate a good place to drill. Topography can help you make your choice. Areas of lower elevation, such as the bottoms of valleys or hills often yield more water. You may also have success drilling near rivers or other bodies of water like ponds or streams. It may also be helpful to call your county survey office or other planning organization and ask for groundwater maps. Many county offices can provide you with information about the location of water tables and places where others have successfully dug wells."
                }
            ]
        },
        {
            "name": "Preparing the Well Screen",
            "steps": [
                {
                    "headline": "Understand the purpose of the well screen.",
                    "description": "The well screen is the most important part of the well: it attaches to the bottom of the long PVC well pipe and lets the water in, filtering out debris and sand. The well screen has hundreds of small slits that filter out the debris, keeping your water clean."
                },
                {
                    "headline": "Mark the well screen pattern.",
                    "description": "There will be a 4 inch (10.2 cm) space between the bottom of the 8 inch (20.3 cm) PVC pipe where there are no slits. This 4 inches (10.2 cm) gap will connect to the the PVC pipe."
                },
                {
                    "headline": "Mark the first slits.",
                    "description": "Mark three slits circumferentially around the 8 inch (20.3 cm) pipe. The slits should be approximately 7 inches (17.8 cm) long and should be equally spaced apart. The gap between each slit should be approximately 1.4 inches (3.5 cm). Make sure your slit does not connect all the way around the pipe. Leave a small gap between the ends of each slit."
                },
                {
                    "headline": "Make a second set of slits.",
                    "description": "Draw three more slits two inches above the first set of slits. Again, make sure that the slits don’t wrap all the way around the screen, but instead have a gap of two inches between ends of the slits."
                },
                {
                    "headline": "Continue making slits.",
                    "description": "Keep drawing sets of three slits, all two inches apart. You can stop when the the screen reaches 6 feet (1.8 m) in length. The length of six feet will allow a great deal of water to come through the pipe and be filtered."
                },
                {
                    "headline": "Cut the slits.",
                    "description": "Using a hacksaw, cut out the slits according to the lines you drew. Carefully saw each line, making sure not to cut all the way through the pipe. Continue sawing until you have made a slit for every line."
                },
                {
                    "headline": "Find a cap for the well screen.",
                    "description": "You’ll need to find a PVC cap to the end of the well screen. Make sure that it fits the well screen snugly. Any leakage here, and your well will not filter properly."
                },
                {
                    "headline": "Apply a coat of primer to the mating portion of the end cap.",
                    "description": "The primer will help hold the end cap onto the screen and prevent any leakages. Apply the primer liberally to avoid any leaks."
                },
                {
                    "headline": "Apply a coat of primer to the well screen.",
                    "description": "Once you’ve applied the primer to the end cap, turn to the well screen. Apply the same amount of primer around the mating portion of the well screen. The double portion of primer will help both pieces to hold together."
                },
                {
                    "headline": "Apply pipe cement over the primed pieces.",
                    "description": "You’ll have to work quickly here, as the cement dries quickly. Paint over the exact area that you primed."
                },
                {
                    "headline": "Place the end cap on the screen.",
                    "description": "Again, work quickly. Hold the end cap onto the screen for fifteen seconds to allow the cement to dry. Let the pipe rest for several minutes to ensure that the glue has dried completely."
                },
                {
                    "headline": "Glue the foot valves.",
                    "description": "The foot valve is the mechanism that allows water to be drawn in but does not allow water to escape back out. There are two-foot valves used in this well. The first one is at the bottom of the six-inch PVC pipe and the second one is at the bottom of the 4 inch (10.2 cm) PVC. These mechanisms will allow the water to be drawn into the 6 inch (15.2 cm) pipe  on the upstroke of the well, and it will push water through the 4 inch (10.2 cm) pipe  on the down stroke, when water is pushed out of the well."
                }
            ]
        },
        {
            "name": "Boring the Well",
            "steps": [
                {
                    "headline": "Bore the well.",
                    "description": "There are several choices when it comes to boring your well. You can use a hand auger, a well point, or a DIY drill. Each method involves different equipment, but all will require a lot of physical labor. Note that these methods will only work well in soil, soft gravel or other softer land types. Rocky terrain or soil with a high clay content may require a professional drilling rig. Reach your required depth. Using your chosen method, work until you reach the depth you want for your well. If you want to check to see if you’ve reached water, tie a small rock to a string and feed the string down the hole. When you feel the rock reach the bottom of the pipe, pull it back up. If the string is wet, you’ve reached the water line."
                },
                {
                    "headline": "Use the hand auger to bore the well.",
                    "description": "For the hand auger method, you will need an extendable auger and a lot of patience. Depending on how deep you want your well, you may need many extendable attachments for the auger. Turn the auger in a clockwise direction into the ground. This will move the earth and create the beginning of your hole. Continue to turn the auger to displace the earth. Remove the auger when full. Once the auger is filled with dirt, you will need to empty it. Pull the auger out of the hole and dispose of the earth. Start a pile for your dirt and continue to empty the dirt into this pile for easier cleanup. Continue to bore into the ground. Continue drilling deeper, always moving clockwise. Empty the dirt into the same pile and work the auger until it you can’t reach any further. Extend the auger when it becomes too short. Add a drill rod to the auger when it can no longer reach the bottom of the bored hole. It may become difficult to detach the auger once you’ve added many extensions: to overcome this, use a spanner to catch the auger while you install or remove the auger in pieces. Drill until you reach your desired depth. Depending on how deep you want your well to be, continue to add extensions to your auger as you drill to that depth. Once you’ve reached the bottom of the well, stop drilling and remove the last bit of dirt. You’re now ready to bail the well."
                },
                {
                    "headline": "Use the well point method.",
                    "description": "This method can be easier than the auger method and requires less specialized tools. You’ll need your PVC well pipe and a sharpened “well point” attached to the end of the well screen. Start a pilot hole. Using a post hole digger or shovel, dig a hole two feet deep. This will give you a good starting point. It will also give you a good idea of the softness of the soil, and let you know how hard it will be to dig. Install your well point. Well points are generally made of steel or any other hard metal so that they can withstand being driven deep into the ground. They are available for sale in a variety of sizes that will fit onto the end of your PVC pipe. Begin driving the well point. If the soil is soft enough, you can use a rubber mallet or other heavy hammer to strike the end of the PVC pipe section, driving the pipe into the ground. If the earth is harder, you can use wrenches to turn the pipe, screwing it as you would a screw into wood. Be careful not to apply too much force to the PVC with either a hammer or wrench: it can shatter. Add each extension of pipe. The end of the pipe that you are striking or screwing into the ground will continue to get closer and closer to the ground. As it becomes level with the earth, add the next length of pipe, screwing the joints together. Then continue driving the pipe into the hole."
                },
                {
                    "headline": "Use a DIY water drill.",
                    "description": "There are ways to construct your own drill that will make digging faster and better for permeating hard soil. However, these methods take some mechanical know-how and can be dangerous. They’re also more expensive than an auger or well point. Research methods online, or ask mechanically-handy friends. Use a water drill. This type of drill works by forcing water into the ground. The high pressure of the water acts effectively as a drill bit, moving dirt out of the way. There are many resources online that can help you build a water drill, but the process is time and labor intensive. Use or modify a digging machine. If you have a tractor or other small farm machine, you can use or modify a post hole digger or mechanical auger to dig the hole. Be aware that these methods require a large financial investment if you don’t already own them. They may also only be able to dig a hole up to 10 feet deep, requiring modification that can be dangerous if you don’t know how to use the equipment."
                },
                {
                    "headline": "Bail the well.",
                    "description": "Bailing the well will remove dirty, non-potable water that has been sitting at the bottom of the well. A bailer is a thin, hollow rod on a string that you’ll lower down your PVC pipe. Once it reaches the water line, it will fill up with the dirty water. Draw it back up out of the well and dump out the water. Repeat until the water runs clean."
                }
            ]
        },
        {
            "name": "Installing Your Pump",
            "steps": [
                {
                    "headline": "Set up the tripod directly over the bore.",
                    "description": "The tripod acts as the pump for your well, so you’ll want it to sit directly over the hole in a stable position. Make sure that the feet are on even ground and that it doesn’t rock back and forth."
                },
                {
                    "headline": "Install the outer foot valve pipe if you used an auger.",
                    "description": "If you used the well point method, your PVC pipe will already be in the ground. However, if you used the auger method or another drill, you’ll need to place the well screen over the outer foot valve pipe, then lower it into the ground."
                },
                {
                    "headline": "Install the inner foot valve pipe.",
                    "description": "Again, if you used the auger method, you’ll need to lower the inner foot valve pipe into the outer foot valve pipe. It may be easiest to screw all of the pipes together before inserting them into the hole."
                },
                {
                    "headline": "Attach the pump.",
                    "description": "The hand pump will create the pressure that draws water out of the earth, so you’ll want to make sure that it’s firmly connected to the PVC pipe. Screw it in all the way and attach the handle."
                },
                {
                    "headline": "Test your water quality.",
                    "description": "Draw up some water from your new well to make sure it works. Before you drink or use any of the well water, you’ll want to have it tested to make sure there is no bacteria or other contaminants in the water. Many labs test water quality, so search in the phone book or online for a facility that can help you."
                }
            ]
        }
    ],
    "tyn": [
        "3   8ft Lengths of 8 inch (20.3 cm) PVC Pipe (Qty. may vary)",
        "3   8ft Lengths of 6 inch (15.2 cm) PVC Pipe (Qty. may vary)",
        "3   8ft Lengths of 4 inch (10.2 cm) PVC Pipe (Qty. may vary)",
        "3   8 inch (20.3 cm)  Slip-Slip PVC Coupling",
        "3   4 inch (10.2 cm) Slip-Slip PVC Coupling",
        "3   6 inch (15.2 cm) Slip-Slip PVC Coupling",
        "1   8 inch (20.3 cm) PVC End Cap",
        "1   6 inch (15.2 cm) foot valve",
        "1   4 inch (10.2 cm) foot valve",
        "1   Adjustable Post Hole Digger/Auger with 8 inch (20.3 cm) Auger head",
        "Drill rod extensions for Post Hole digger (QTY will vary on length of individual attachments)",
        "Spanner/Catcher",
        "Can of PVC Pipe Glue Primer",
        "Can of PVC Pipe Glue",
        "Hacksaw",
        "Permanent Marker",
        "8 feet (2.4 m). tripod with pulley",
        "8 inch (20.3 cm) Water Bailer"
    ],
    "text": " Choosing an Area Check your local laws. In most states, it is legal to drill your own well. However, in some states, you must have a permit to drill over 200 feet, so you may need to get the permit or have the well professionally drilled. Check your local codes by calling local officials or searching online. Don’t put the well near sources of contamination. Septic tanks, muddy areas, sewers or animal pens can all potentially contaminate wells. Waste matter leeches through the soil, all the way down to the water reservoir: anyone who drinks water from a well drilled near these areas could get sick. Drill at least 50 feet away from any of these areas. Confirm your well location with utility companies. If you live in a populated area, you will want to check with your local utility companies before you drill. Many electricity, gas and telephone companies run conduits underground, so any drilling could interfere with or strike their lines. Call your utility providers to find the location of any cabling running under your property. Choose a site that will yield the most water. Different factors on your property will give you information about how much water to expect to get from underwater reservoirs. Soil type, topography, information about your water table and vegetation can give clues about where to dig. Areas with heavy sand and gravel deposits often yield water. The larger the pieces of gravel or sand, the more water is most likely beneath the surface. These areas will be harder to drill, however, because of large boulders that may exist in the path of your drill. Vegetation can tell you the location of water. In arid climates, locations with greater number of plants growing indicate water below the surface. Look for groups of trees or shrubs to locate a good place to drill. Topography can help you make your choice. Areas of lower elevation, such as the bottoms of valleys or hills often yield more water. You may also have success drilling near rivers or other bodies of water like ponds or streams. It may also be helpful to call your county survey office or other planning organization and ask for groundwater maps. Many county offices can provide you with information about the location of water tables and places where others have successfully dug wells. Preparing the Well Screen Understand the purpose of the well screen. The well screen is the most important part of the well: it attaches to the bottom of the long PVC well pipe and lets the water in, filtering out debris and sand. The well screen has hundreds of small slits that filter out the debris, keeping your water clean. Mark the well screen pattern. There will be a 4 inch (10.2 cm) space between the bottom of the 8 inch (20.3 cm) PVC pipe where there are no slits. This 4 inches (10.2 cm) gap will connect to the the PVC pipe. Mark the first slits. Mark three slits circumferentially around the 8 inch (20.3 cm) pipe. The slits should be approximately 7 inches (17.8 cm) long and should be equally spaced apart. The gap between each slit should be approximately 1.4 inches (3.5 cm). Make sure your slit does not connect all the way around the pipe. Leave a small gap between the ends of each slit. Make a second set of slits. Draw three more slits two inches above the first set of slits. Again, make sure that the slits don’t wrap all the way around the screen, but instead have a gap of two inches between ends of the slits. Continue making slits. Keep drawing sets of three slits, all two inches apart. You can stop when the the screen reaches 6 feet (1.8 m) in length. The length of six feet will allow a great deal of water to come through the pipe and be filtered. Cut the slits. Using a hacksaw, cut out the slits according to the lines you drew. Carefully saw each line, making sure not to cut all the way through the pipe. Continue sawing until you have made a slit for every line. Find a cap for the well screen. You’ll need to find a PVC cap to the end of the well screen. Make sure that it fits the well screen snugly. Any leakage here, and your well will not filter properly. Apply a coat of primer to the mating portion of the end cap. The primer will help hold the end cap onto the screen and prevent any leakages. Apply the primer liberally to avoid any leaks. Apply a coat of primer to the well screen. Once you’ve applied the primer to the end cap, turn to the well screen. Apply the same amount of primer around the mating portion of the well screen. The double portion of primer will help both pieces to hold together. Apply pipe cement over the primed pieces. You’ll have to work quickly here, as the cement dries quickly. Paint over the exact area that you primed. Place the end cap on the screen. Again, work quickly. Hold the end cap onto the screen for fifteen seconds to allow the cement to dry. Let the pipe rest for several minutes to ensure that the glue has dried completely. Glue the foot valves. The foot valve is the mechanism that allows water to be drawn in but does not allow water to escape back out. There are two-foot valves used in this well. The first one is at the bottom of the six-inch PVC pipe and the second one is at the bottom of the 4 inch (10.2 cm) PVC. These mechanisms will allow the water to be drawn into the 6 inch (15.2 cm) pipe  on the upstroke of the well, and it will push water through the 4 inch (10.2 cm) pipe  on the down stroke, when water is pushed out of the well. Boring the Well Bore the well. There are several choices when it comes to boring your well. You can use a hand auger, a well point, or a DIY drill. Each method involves different equipment, but all will require a lot of physical labor. Note that these methods will only work well in soil, soft gravel or other softer land types. Rocky terrain or soil with a high clay content may require a professional drilling rig. Reach your required depth. Using your chosen method, work until you reach the depth you want for your well. If you want to check to see if you’ve reached water, tie a small rock to a string and feed the string down the hole. When you feel the rock reach the bottom of the pipe, pull it back up. If the string is wet, you’ve reached the water line. Use the hand auger to bore the well. For the hand auger method, you will need an extendable auger and a lot of patience. Depending on how deep you want your well, you may need many extendable attachments for the auger. Turn the auger in a clockwise direction into the ground. This will move the earth and create the beginning of your hole. Continue to turn the auger to displace the earth. Remove the auger when full. Once the auger is filled with dirt, you will need to empty it. Pull the auger out of the hole and dispose of the earth. Start a pile for your dirt and continue to empty the dirt into this pile for easier cleanup. Continue to bore into the ground. Continue drilling deeper, always moving clockwise. Empty the dirt into the same pile and work the auger until it you can’t reach any further. Extend the auger when it becomes too short. Add a drill rod to the auger when it can no longer reach the bottom of the bored hole. It may become difficult to detach the auger once you’ve added many extensions: to overcome this, use a spanner to catch the auger while you install or remove the auger in pieces. Drill until you reach your desired depth. Depending on how deep you want your well to be, continue to add extensions to your auger as you drill to that depth. Once you’ve reached the bottom of the well, stop drilling and remove the last bit of dirt. You’re now ready to bail the well. Use the well point method. This method can be easier than the auger method and requires less specialized tools. You’ll need your PVC well pipe and a sharpened “well point” attached to the end of the well screen. Start a pilot hole. Using a post hole digger or shovel, dig a hole two feet deep. This will give you a good starting point. It will also give you a good idea of the softness of the soil, and let you know how hard it will be to dig. Install your well point. Well points are generally made of steel or any other hard metal so that they can withstand being driven deep into the ground. They are available for sale in a variety of sizes that will fit onto the end of your PVC pipe. Begin driving the well point. If the soil is soft enough, you can use a rubber mallet or other heavy hammer to strike the end of the PVC pipe section, driving the pipe into the ground. If the earth is harder, you can use wrenches to turn the pipe, screwing it as you would a screw into wood. Be careful not to apply too much force to the PVC with either a hammer or wrench: it can shatter. Add each extension of pipe. The end of the pipe that you are striking or screwing into the ground will continue to get closer and closer to the ground. As it becomes level with the earth, add the next length of pipe, screwing the joints together. Then continue driving the pipe into the hole. Use a DIY water drill. There are ways to construct your own drill that will make digging faster and better for permeating hard soil. However, these methods take some mechanical know-how and can be dangerous. They’re also more expensive than an auger or well point. Research methods online, or ask mechanically-handy friends. Use a water drill. This type of drill works by forcing water into the ground. The high pressure of the water acts effectively as a drill bit, moving dirt out of the way. There are many resources online that can help you build a water drill, but the process is time and labor intensive. Use or modify a digging machine. If you have a tractor or other small farm machine, you can use or modify a post hole digger or mechanical auger to dig the hole. Be aware that these methods require a large financial investment if you don’t already own them. They may also only be able to dig a hole up to 10 feet deep, requiring modification that can be dangerous if you don’t know how to use the equipment. Bail the well. Bailing the well will remove dirty, non-potable water that has been sitting at the bottom of the well. A bailer is a thin, hollow rod on a string that you’ll lower down your PVC pipe. Once it reaches the water line, it will fill up with the dirty water. Draw it back up out of the well and dump out the water. Repeat until the water runs clean. Installing Your Pump Set up the tripod directly over the bore. The tripod acts as the pump for your well, so you’ll want it to sit directly over the hole in a stable position. Make sure that the feet are on even ground and that it doesn’t rock back and forth. Install the outer foot valve pipe if you used an auger. If you used the well point method, your PVC pipe will already be in the ground. However, if you used the auger method or another drill, you’ll need to place the well screen over the outer foot valve pipe, then lower it into the ground. Install the inner foot valve pipe. Again, if you used the auger method, you’ll need to lower the inner foot valve pipe into the outer foot valve pipe. It may be easiest to screw all of the pipes together before inserting them into the hole. Attach the pump. The hand pump will create the pressure that draws water out of the earth, so you’ll want to make sure that it’s firmly connected to the PVC pipe. Screw it in all the way and attach the handle. Test your water quality. Draw up some water from your new well to make sure it works. Before you drink or use any of the well water, you’ll want to have it tested to make sure there is no bacteria or other contaminants in the water. Many labs test water quality, so search in the phone book or online for a facility that can help you.",
    "sentences": [
        " Choosing an Area Check your local laws.",
        "In most states, it is legal to drill your own well.",
        "However, in some states, you must have a permit to drill over 200 feet, so you may need to get the permit or have the well professionally drilled.",
        "Check your local codes by calling local officials or searching online.",
        "Don’t put the well near sources of contamination.",
        "Septic tanks, muddy areas, sewers or animal pens can all potentially contaminate wells.",
        "Waste matter leeches through the soil, all the way down to the water reservoir: anyone who drinks water from a well drilled near these areas could get sick.",
        "Drill at least 50 feet away from any of these areas.",
        "Confirm your well location with utility companies.",
        "If you live in a populated area, you will want to check with your local utility companies before you drill.",
        "Many electricity, gas and telephone companies run conduits underground, so any drilling could interfere with or strike their lines.",
        "Call your utility providers to find the location of any cabling running under your property.",
        "Choose a site that will yield the most water.",
        "Different factors on your property will give you information about how much water to expect to get from underwater reservoirs.",
        "Soil type, topography, information about your water table and vegetation can give clues about where to dig.",
        "Areas with heavy sand and gravel deposits often yield water.",
        "The larger the pieces of gravel or sand, the more water is most likely beneath the surface.",
        "These areas will be harder to drill, however, because of large boulders that may exist in the path of your drill.",
        "Vegetation can tell you the location of water.",
        "In arid climates, locations with greater number of plants growing indicate water below the surface.",
        "Look for groups of trees or shrubs to locate a good place to drill.",
        "Topography can help you make your choice.",
        "Areas of lower elevation, such as the bottoms of valleys or hills often yield more water.",
        "You may also have success drilling near rivers or other bodies of water like ponds or streams.",
        "It may also be helpful to call your county survey office or other planning organization and ask for groundwater maps.",
        "Many county offices can provide you with information about the location of water tables and places where others have successfully dug wells.",
        "Preparing the Well Screen Understand the purpose of the well screen.",
        "The well screen is the most important part of the well: it attaches to the bottom of the long PVC well pipe and lets the water in, filtering out debris and sand.",
        "The well screen has hundreds of small slits that filter out the debris, keeping your water clean.",
        "Mark the well screen pattern.",
        "There will be a 4 inch (10.2 cm) space between the bottom of the 8 inch (20.3 cm) PVC pipe where there are no slits.",
        "This 4 inches (10.2 cm) gap will connect to the the PVC pipe.",
        "Mark the first slits.",
        "Mark three slits circumferentially around the 8 inch (20.3 cm) pipe.",
        "The slits should be approximately 7 inches (17.8 cm) long and should be equally spaced apart.",
        "The gap between each slit should be approximately 1.4 inches (3.5 cm).",
        "Make sure your slit does not connect all the way around the pipe.",
        "Leave a small gap between the ends of each slit.",
        "Make a second set of slits.",
        "Draw three more slits two inches above the first set of slits.",
        "Again, make sure that the slits don’t wrap all the way around the screen, but instead have a gap of two inches between ends of the slits.",
        "Continue making slits.",
        "Keep drawing sets of three slits, all two inches apart.",
        "You can stop when the the screen reaches 6 feet (1.8 m) in length.",
        "The length of six feet will allow a great deal of water to come through the pipe and be filtered.",
        "Cut the slits.",
        "Using a hacksaw, cut out the slits according to the lines you drew.",
        "Carefully saw each line, making sure not to cut all the way through the pipe.",
        "Continue sawing until you have made a slit for every line.",
        "Find a cap for the well screen.",
        "You’ll need to find a PVC cap to the end of the well screen.",
        "Make sure that it fits the well screen snugly.",
        "Any leakage here, and your well will not filter properly.",
        "Apply a coat of primer to the mating portion of the end cap.",
        "The primer will help hold the end cap onto the screen and prevent any leakages.",
        "Apply the primer liberally to avoid any leaks.",
        "Apply a coat of primer to the well screen.",
        "Once you’ve applied the primer to the end cap, turn to the well screen.",
        "Apply the same amount of primer around the mating portion of the well screen.",
        "The double portion of primer will help both pieces to hold together.",
        "Apply pipe cement over the primed pieces.",
        "You’ll have to work quickly here, as the cement dries quickly.",
        "Paint over the exact area that you primed.",
        "Place the end cap on the screen.",
        "Again, work quickly.",
        "Hold the end cap onto the screen for fifteen seconds to allow the cement to dry.",
        "Let the pipe rest for several minutes to ensure that the glue has dried completely.",
        "Glue the foot valves.",
        "The foot valve is the mechanism that allows water to be drawn in but does not allow water to escape back out.",
        "There are two-foot valves used in this well.",
        "The first one is at the bottom of the six-inch PVC pipe and the second one is at the bottom of the 4 inch (10.2 cm) PVC.",
        "These mechanisms will allow the water to be drawn into the 6 inch (15.2 cm) pipe  on the upstroke of the well, and it will push water through the 4 inch (10.2 cm) pipe  on the down stroke, when water is pushed out of the well.",
        "Boring the Well Bore the well.",
        "There are several choices when it comes to boring your well.",
        "You can use a hand auger, a well point, or a DIY drill.",
        "Each method involves different equipment, but all will require a lot of physical labor.",
        "Note that these methods will only work well in soil, soft gravel or other softer land types.",
        "Rocky terrain or soil with a high clay content may require a professional drilling rig.",
        "Reach your required depth.",
        "Using your chosen method, work until you reach the depth you want for your well.",
        "If you want to check to see if you’ve reached water, tie a small rock to a string and feed the string down the hole.",
        "When you feel the rock reach the bottom of the pipe, pull it back up.",
        "If the string is wet, you’ve reached the water line.",
        "Use the hand auger to bore the well.",
        "For the hand auger method, you will need an extendable auger and a lot of patience.",
        "Depending on how deep you want your well, you may need many extendable attachments for the auger.",
        "Turn the auger in a clockwise direction into the ground.",
        "This will move the earth and create the beginning of your hole.",
        "Continue to turn the auger to displace the earth.",
        "Remove the auger when full.",
        "Once the auger is filled with dirt, you will need to empty it.",
        "Pull the auger out of the hole and dispose of the earth.",
        "Start a pile for your dirt and continue to empty the dirt into this pile for easier cleanup.",
        "Continue to bore into the ground.",
        "Continue drilling deeper, always moving clockwise.",
        "Empty the dirt into the same pile and work the auger until it you can’t reach any further.",
        "Extend the auger when it becomes too short.",
        "Add a drill rod to the auger when it can no longer reach the bottom of the bored hole.",
        "It may become difficult to detach the auger once you’ve added many extensions: to overcome this, use a spanner to catch the auger while you install or remove the auger in pieces.",
        "Drill until you reach your desired depth.",
        "Depending on how deep you want your well to be, continue to add extensions to your auger as you drill to that depth.",
        "Once you’ve reached the bottom of the well, stop drilling and remove the last bit of dirt.",
        "You’re now ready to bail the well.",
        "Use the well point method.",
        "This method can be easier than the auger method and requires less specialized tools.",
        "You’ll need your PVC well pipe and a sharpened “well point” attached to the end of the well screen.",
        "Start a pilot hole.",
        "Using a post hole digger or shovel, dig a hole two feet deep.",
        "This will give you a good starting point.",
        "It will also give you a good idea of the softness of the soil, and let you know how hard it will be to dig.",
        "Install your well point.",
        "Well points are generally made of steel or any other hard metal so that they can withstand being driven deep into the ground.",
        "They are available for sale in a variety of sizes that will fit onto the end of your PVC pipe.",
        "Begin driving the well point.",
        "If the soil is soft enough, you can use a rubber mallet or other heavy hammer to strike the end of the PVC pipe section, driving the pipe into the ground.",
        "If the earth is harder, you can use wrenches to turn the pipe, screwing it as you would a screw into wood.",
        "Be careful not to apply too much force to the PVC with either a hammer or wrench: it can shatter.",
        "Add each extension of pipe.",
        "The end of the pipe that you are striking or screwing into the ground will continue to get closer and closer to the ground.",
        "As it becomes level with the earth, add the next length of pipe, screwing the joints together.",
        "Then continue driving the pipe into the hole.",
        "Use a DIY water drill.",
        "There are ways to construct your own drill that will make digging faster and better for permeating hard soil.",
        "However, these methods take some mechanical know-how and can be dangerous.",
        "They’re also more expensive than an auger or well point.",
        "Research methods online, or ask mechanically-handy friends.",
        "Use a water drill.",
        "This type of drill works by forcing water into the ground.",
        "The high pressure of the water acts effectively as a drill bit, moving dirt out of the way.",
        "There are many resources online that can help you build a water drill, but the process is time and labor intensive.",
        "Use or modify a digging machine.",
        "If you have a tractor or other small farm machine, you can use or modify a post hole digger or mechanical auger to dig the hole.",
        "Be aware that these methods require a large financial investment if you don’t already own them.",
        "They may also only be able to dig a hole up to 10 feet deep, requiring modification that can be dangerous if you don’t know how to use the equipment.",
        "Bail the well.",
        "Bailing the well will remove dirty, non-potable water that has been sitting at the bottom of the well.",
        "A bailer is a thin, hollow rod on a string that you’ll lower down your PVC pipe.",
        "Once it reaches the water line, it will fill up with the dirty water.",
        "Draw it back up out of the well and dump out the water.",
        "Repeat until the water runs clean.",
        "Installing Your Pump Set up the tripod directly over the bore.",
        "The tripod acts as the pump for your well, so you’ll want it to sit directly over the hole in a stable position.",
        "Make sure that the feet are on even ground and that it doesn’t rock back and forth.",
        "Install the outer foot valve pipe if you used an auger.",
        "If you used the well point method, your PVC pipe will already be in the ground.",
        "However, if you used the auger method or another drill, you’ll need to place the well screen over the outer foot valve pipe, then lower it into the ground.",
        "Install the inner foot valve pipe.",
        "Again, if you used the auger method, you’ll need to lower the inner foot valve pipe into the outer foot valve pipe.",
        "It may be easiest to screw all of the pipes together before inserting them into the hole.",
        "Attach the pump.",
        "The hand pump will create the pressure that draws water out of the earth, so you’ll want to make sure that it’s firmly connected to the PVC pipe.",
        "Screw it in all the way and attach the handle.",
        "Test your water quality.",
        "Draw up some water from your new well to make sure it works.",
        "Before you drink or use any of the well water, you’ll want to have it tested to make sure there is no bacteria or other contaminants in the water.",
        "Many labs test water quality, so search in the phone book or online for a facility that can help you."
    ]
}