{
    "title": "How to Replace a Lawn Sprinkler Timer",
    "url": "https://www.wikihow.com/Replace-a-Lawn-Sprinkler-Timer",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Removing the Old Controller",
            "steps": [
                {
                    "headline": "Turn off power to the old controller.",
                    "description": "Sprinkler timers are either plugged into an outlet or hardwired into your home’s electrical system. If the system is plugged into an outlet, unplug it from the wall. If your timer is hardwired, turn off the circuit that controls the timer. Check that the display on the timer is off before continuing. Never work on your sprinkler timer while it’s plugged in since you could get shocked.Tip: Write down your sprinkler program times before disconnecting the power so they’re easier to remember when starting the new unit."
                },
                {
                    "headline": "Remove the access panel or faceplate on your timer.",
                    "description": "The access panel can usually be found near the bottom of your existing timer. Pop off the panel cover to remove it. If the timer doesn’t have an access panel that pops right off, you may need to use a screwdriver to remove the faceplate."
                },
                {
                    "headline": "Disconnect the power wires from your timer.",
                    "description": "The power wires are usually white, black, and green. Unscrew the wire caps connecting the wires if there are any and untwist the wires. Separate the wires from one another so you can pull the timer unit out without damaging the power wires that run to your sprinklers. Some timer models may have the power wires in a different access panel along the wall."
                },
                {
                    "headline": "Label the sprinkler wires with pieces of tape.",
                    "description": "Your sprinkler wires can be found plugged into a numbered section inside your timer. Wrap a small piece of masking tape around each of the sprinkler wires and label them with the number of the port they’re plugged into. That way, you’ll know what stations to plug your wires back into when you put in your new unit. If you don’t have any tape or labels, many sprinkler wires are differently colored so you can tell which wires control an area."
                },
                {
                    "headline": "Pull the sprinkler wires out of the timer.",
                    "description": "If your unit has the wire attached with screws, use a screwdriver to loosen the connection and pull the wire out. If your timer has tabs, press down on the tab with the end of your screwdriver to make it easier to remove the wire. Once they’re disconnected, pull out the wires from the bottom of your timer."
                },
                {
                    "headline": "Unscrew the controller from the wall to remove it.",
                    "description": "Your timer should have mounting screws in the middle of the unit on the top and bottom. Use either a flathead or Philips screwdriver to loosen the top screw and to remove the bottom screw completely. Lift your unit up and off of the wall to remove it entirely. Many times, you can use the top screw again to hang your new sprinkler unit but the bottom screw may not be in the same place."
                }
            ]
        },
        {
            "name": "Installing the New Timer",
            "steps": [
                {
                    "headline": "Get a timer that has enough stations for the number of sprinklers you have.",
                    "description": "Make sure the timer unit that you purchase has the same number of stations as you need for your sprinklers. It’s okay if the unit has more stations that you need, but will not work if you have less. Most units come with 6-12 stations built into the system."
                },
                {
                    "headline": "Mount the timer to the wall with screws.",
                    "description": "Hang the top of the timer on the mounting screw already attached to your wall. Tighten the screw inside the unit with a screwdriver so the timer is held securely to the wall. Find the mounting hole near the bottom of the timer and attach another screw there so the unit is sturdy on the wall. If you’re mounting on drywall or concrete, use anchor screws to hold your timer securely. If the unit plugs directly into the wall, make sure the cord can reach the outlet.Tip: Some newer models can be programmed over a wi-fi connection. Make sure your timer is within wi-fi range if your model connects to the Internet."
                },
                {
                    "headline": "Feed the station wires into your timer and plug them into the proper zones.",
                    "description": "Push the wires through the bottom opening of the new unit so they’re in the access panel. Put the wires into the stations that match their label. If the unit has screw connections, hold the wire underneath the head of the screw, and tighten the screw with a screwdriver until it holds the wire securely. If your timer has tab connections, press the tab down with a screwdriver and feed the wire into the port. Release the tab so it has a tight grip. If you have a white wire, attach it to the port labeled “Common.”"
                },
                {
                    "headline": "Reconnect the power wires to the new timer.",
                    "description": "Locate the black, white, and green power wires in the unit and match them with the power wires that run out to your sprinklers. Twist the ends of the wires of matching colors together so the current can run between them. Cover the exposed ends of the wires by twisting wire caps on top of them. If your wires are in an outdoor timer unit, make sure to use waterproof wire caps."
                },
                {
                    "headline": "Turn on the power and test the sprinklers to see if the timer works.",
                    "description": "Reconnect your sprinkler timer to power by plugging it in or turning on the circuit it’s connected to. The display on your timer may flash for a few seconds before turning on completely. Turn your controller to the manual setting to test each sprinkler connection. Make sure the sprinklers are all operating correctly. If the sprinklers aren’t working, turn off the power again and check for loose wire connections inside the unit."
                },
                {
                    "headline": "Reprogram your sprinkler schedule on the new unit.",
                    "description": "Go into the settings of your timer and set the current time and date so your sprinklers will run at the correct times. Turn the dial to “Set Watering Start Times” or select it on your display and change the time when you want your sprinklers to turn on. Then set how long the sprinklers will run during that watering session. You can choose to let your sprinklers run every day or pick specific days of the week. Follow the manufacturer’s instructions for your model to learn specific details on how to set the schedule. If your timer uses a wi-fi connection, you can set the program from your computer or mobile device."
                }
            ]
        }
    ],
    "tyn": [
        "Screwdriver",
        "Masking tape",
        "Pen",
        "Screws",
        "Wire caps"
    ],
    "text": " Removing the Old Controller Turn off power to the old controller. Sprinkler timers are either plugged into an outlet or hardwired into your home’s electrical system. If the system is plugged into an outlet, unplug it from the wall. If your timer is hardwired, turn off the circuit that controls the timer. Check that the display on the timer is off before continuing. Never work on your sprinkler timer while it’s plugged in since you could get shocked.Tip: Write down your sprinkler program times before disconnecting the power so they’re easier to remember when starting the new unit. Remove the access panel or faceplate on your timer. The access panel can usually be found near the bottom of your existing timer. Pop off the panel cover to remove it. If the timer doesn’t have an access panel that pops right off, you may need to use a screwdriver to remove the faceplate. Disconnect the power wires from your timer. The power wires are usually white, black, and green. Unscrew the wire caps connecting the wires if there are any and untwist the wires. Separate the wires from one another so you can pull the timer unit out without damaging the power wires that run to your sprinklers. Some timer models may have the power wires in a different access panel along the wall. Label the sprinkler wires with pieces of tape. Your sprinkler wires can be found plugged into a numbered section inside your timer. Wrap a small piece of masking tape around each of the sprinkler wires and label them with the number of the port they’re plugged into. That way, you’ll know what stations to plug your wires back into when you put in your new unit. If you don’t have any tape or labels, many sprinkler wires are differently colored so you can tell which wires control an area. Pull the sprinkler wires out of the timer. If your unit has the wire attached with screws, use a screwdriver to loosen the connection and pull the wire out. If your timer has tabs, press down on the tab with the end of your screwdriver to make it easier to remove the wire. Once they’re disconnected, pull out the wires from the bottom of your timer. Unscrew the controller from the wall to remove it. Your timer should have mounting screws in the middle of the unit on the top and bottom. Use either a flathead or Philips screwdriver to loosen the top screw and to remove the bottom screw completely. Lift your unit up and off of the wall to remove it entirely. Many times, you can use the top screw again to hang your new sprinkler unit but the bottom screw may not be in the same place. Installing the New Timer Get a timer that has enough stations for the number of sprinklers you have. Make sure the timer unit that you purchase has the same number of stations as you need for your sprinklers. It’s okay if the unit has more stations that you need, but will not work if you have less. Most units come with 6-12 stations built into the system. Mount the timer to the wall with screws. Hang the top of the timer on the mounting screw already attached to your wall. Tighten the screw inside the unit with a screwdriver so the timer is held securely to the wall. Find the mounting hole near the bottom of the timer and attach another screw there so the unit is sturdy on the wall. If you’re mounting on drywall or concrete, use anchor screws to hold your timer securely. If the unit plugs directly into the wall, make sure the cord can reach the outlet.Tip: Some newer models can be programmed over a wi-fi connection. Make sure your timer is within wi-fi range if your model connects to the Internet. Feed the station wires into your timer and plug them into the proper zones. Push the wires through the bottom opening of the new unit so they’re in the access panel. Put the wires into the stations that match their label. If the unit has screw connections, hold the wire underneath the head of the screw, and tighten the screw with a screwdriver until it holds the wire securely. If your timer has tab connections, press the tab down with a screwdriver and feed the wire into the port. Release the tab so it has a tight grip. If you have a white wire, attach it to the port labeled “Common.” Reconnect the power wires to the new timer. Locate the black, white, and green power wires in the unit and match them with the power wires that run out to your sprinklers. Twist the ends of the wires of matching colors together so the current can run between them. Cover the exposed ends of the wires by twisting wire caps on top of them. If your wires are in an outdoor timer unit, make sure to use waterproof wire caps. Turn on the power and test the sprinklers to see if the timer works. Reconnect your sprinkler timer to power by plugging it in or turning on the circuit it’s connected to. The display on your timer may flash for a few seconds before turning on completely. Turn your controller to the manual setting to test each sprinkler connection. Make sure the sprinklers are all operating correctly. If the sprinklers aren’t working, turn off the power again and check for loose wire connections inside the unit. Reprogram your sprinkler schedule on the new unit. Go into the settings of your timer and set the current time and date so your sprinklers will run at the correct times. Turn the dial to “Set Watering Start Times” or select it on your display and change the time when you want your sprinklers to turn on. Then set how long the sprinklers will run during that watering session. You can choose to let your sprinklers run every day or pick specific days of the week. Follow the manufacturer’s instructions for your model to learn specific details on how to set the schedule. If your timer uses a wi-fi connection, you can set the program from your computer or mobile device.",
    "sentences": [
        " Removing the Old Controller Turn off power to the old controller.",
        "Sprinkler timers are either plugged into an outlet or hardwired into your home’s electrical system.",
        "If the system is plugged into an outlet, unplug it from the wall.",
        "If your timer is hardwired, turn off the circuit that controls the timer.",
        "Check that the display on the timer is off before continuing.",
        "Never work on your sprinkler timer while it’s plugged in since you could get shocked.Tip: Write down your sprinkler program times before disconnecting the power so they’re easier to remember when starting the new unit.",
        "Remove the access panel or faceplate on your timer.",
        "The access panel can usually be found near the bottom of your existing timer.",
        "Pop off the panel cover to remove it.",
        "If the timer doesn’t have an access panel that pops right off, you may need to use a screwdriver to remove the faceplate.",
        "Disconnect the power wires from your timer.",
        "The power wires are usually white, black, and green.",
        "Unscrew the wire caps connecting the wires if there are any and untwist the wires.",
        "Separate the wires from one another so you can pull the timer unit out without damaging the power wires that run to your sprinklers.",
        "Some timer models may have the power wires in a different access panel along the wall.",
        "Label the sprinkler wires with pieces of tape.",
        "Your sprinkler wires can be found plugged into a numbered section inside your timer.",
        "Wrap a small piece of masking tape around each of the sprinkler wires and label them with the number of the port they’re plugged into.",
        "That way, you’ll know what stations to plug your wires back into when you put in your new unit.",
        "If you don’t have any tape or labels, many sprinkler wires are differently colored so you can tell which wires control an area.",
        "Pull the sprinkler wires out of the timer.",
        "If your unit has the wire attached with screws, use a screwdriver to loosen the connection and pull the wire out.",
        "If your timer has tabs, press down on the tab with the end of your screwdriver to make it easier to remove the wire.",
        "Once they’re disconnected, pull out the wires from the bottom of your timer.",
        "Unscrew the controller from the wall to remove it.",
        "Your timer should have mounting screws in the middle of the unit on the top and bottom.",
        "Use either a flathead or Philips screwdriver to loosen the top screw and to remove the bottom screw completely.",
        "Lift your unit up and off of the wall to remove it entirely.",
        "Many times, you can use the top screw again to hang your new sprinkler unit but the bottom screw may not be in the same place.",
        "Installing the New Timer Get a timer that has enough stations for the number of sprinklers you have.",
        "Make sure the timer unit that you purchase has the same number of stations as you need for your sprinklers.",
        "It’s okay if the unit has more stations that you need, but will not work if you have less.",
        "Most units come with 6-12 stations built into the system.",
        "Mount the timer to the wall with screws.",
        "Hang the top of the timer on the mounting screw already attached to your wall.",
        "Tighten the screw inside the unit with a screwdriver so the timer is held securely to the wall.",
        "Find the mounting hole near the bottom of the timer and attach another screw there so the unit is sturdy on the wall.",
        "If you’re mounting on drywall or concrete, use anchor screws to hold your timer securely.",
        "If the unit plugs directly into the wall, make sure the cord can reach the outlet.Tip: Some newer models can be programmed over a wi-fi connection.",
        "Make sure your timer is within wi-fi range if your model connects to the Internet.",
        "Feed the station wires into your timer and plug them into the proper zones.",
        "Push the wires through the bottom opening of the new unit so they’re in the access panel.",
        "Put the wires into the stations that match their label.",
        "If the unit has screw connections, hold the wire underneath the head of the screw, and tighten the screw with a screwdriver until it holds the wire securely.",
        "If your timer has tab connections, press the tab down with a screwdriver and feed the wire into the port.",
        "Release the tab so it has a tight grip.",
        "If you have a white wire, attach it to the port labeled “Common.” Reconnect the power wires to the new timer.",
        "Locate the black, white, and green power wires in the unit and match them with the power wires that run out to your sprinklers.",
        "Twist the ends of the wires of matching colors together so the current can run between them.",
        "Cover the exposed ends of the wires by twisting wire caps on top of them.",
        "If your wires are in an outdoor timer unit, make sure to use waterproof wire caps.",
        "Turn on the power and test the sprinklers to see if the timer works.",
        "Reconnect your sprinkler timer to power by plugging it in or turning on the circuit it’s connected to.",
        "The display on your timer may flash for a few seconds before turning on completely.",
        "Turn your controller to the manual setting to test each sprinkler connection.",
        "Make sure the sprinklers are all operating correctly.",
        "If the sprinklers aren’t working, turn off the power again and check for loose wire connections inside the unit.",
        "Reprogram your sprinkler schedule on the new unit.",
        "Go into the settings of your timer and set the current time and date so your sprinklers will run at the correct times.",
        "Turn the dial to “Set Watering Start Times” or select it on your display and change the time when you want your sprinklers to turn on.",
        "Then set how long the sprinklers will run during that watering session.",
        "You can choose to let your sprinklers run every day or pick specific days of the week.",
        "Follow the manufacturer’s instructions for your model to learn specific details on how to set the schedule.",
        "If your timer uses a wi-fi connection, you can set the program from your computer or mobile device."
    ]
}