{
    "title": "How to Do 1000 Push Ups",
    "url": "https://www.wikihow.com/Do-1000-Push-Ups",
    "category_hierarchy": [
        "Sports and Fitness",
        "Personal Fitness",
        "Building Muscle & Strength",
        "Push Ups and Press Ups"
    ],
    "methods": [
        {
            "name": "Building Stamina",
            "steps": [
                {
                    "headline": "Test yourself on how many push-ups are you able to perform, with perfect technique.",
                    "description": ""
                },
                {
                    "headline": "Switch between four different kinds of push-ups to train your body more by giving it something new:",
                    "description": "Wide grip push-ups Diamond presses (triceps and front delts) Knuckle push-ups (triceps, wrists, and front delts) Regular push ups, with arms placed on the ground shoulder width apart, keeping the elbows close to the side."
                },
                {
                    "headline": "Follow the training program.",
                    "description": "In the first week, you choose only one exercise which you will perform 4-5 sets of (all to be followed with 45 seconds of rest between sets)\nIn the second week, you choose another exercise which you will perform 4-5 sets of(all  to be followed with 45 seconds of rest between sets)\nIn the third week, you choose another exercise which you will perform 4-5 sets of(all to be followed with 45 seconds of rest between sets)\nIn the fourth week, you choose another exercise which you will perform 4-5 sets of(all to be followed with 45 seconds of rest between sets)\nAfter the first 4 weeks, your program will change; now you pick three exercises, one exercise for each workout. Now you raise it to 5 sets, to failure, and 1 minute of rest in between sets. Every week you mix your program so it's never the same. After the first 8 weeks, your program will once again change; now you will do all of the four exercises in every workout, but in every workout you do the exercises in a different order to keep the diversity in the training. Take 3 days of rest and do another test, taking as many push-ups as possible' the progress you've made will be obvious. If you still haven't reached 100 push-ups (which most people won't have after the first time they finished the program), then repeat the cycle."
                }
            ]
        },
        {
            "name": "Perfecting Your Push-Up Technique",
            "steps": [
                {
                    "headline": "Remember to always warm up before any exercise.",
                    "description": "Warming up reduces the risk of injury and gets muscles ready to do a push up. You can actually lift/push/pull/etc more if you go through a proper warm up routine as compared to diving straight into the exercises. Make sure to stretch your arms and wrists - key joints in push ups."
                },
                {
                    "headline": "Assume a prone position on the floor or other rigid surface (preferably carpeted-more on that later) that's able to support your body weight.",
                    "description": "Keep your feet together!"
                },
                {
                    "headline": "Make two fists and place them under yourself on the floor, approximately shoulder width apart.",
                    "description": "If you are on a relatively cushioned surface, such as a carpeted floor, simply support yourself on your fists between the first and second knuckles. If you are on a less forgiving surface, consider investing in some pushup grips (they look like handles you put on the floor.) Curl your toes upward (towards your head) so that the balls of your feet touch the ground."
                },
                {
                    "headline": "Raise yourself using your arms.",
                    "description": "At this point, your weight should be supported by your hands and the balls of your feet. Make a straight line from your head to your heels. This position is called \"plank,\" which is used for other various exercises. This is the beginning and the end position of a single push-up."
                },
                {
                    "headline": "Lower your torso to the ground until your elbows form a 90 degree angle.",
                    "description": "Keep your elbows close to your body for more resistance. Keep your head facing forward. Try to have the tip of your nose pointed directly ahead. Draw a breath as you lower yourself."
                },
                {
                    "headline": "Raise yourself by attempting to push the ground away from you.",
                    "description": "Breathe out as you push. The power for that push will inevitably come from your shoulders and chest. The triceps (the muscle on the back side of your upper arm) are also contracted but the primary exercise for the triceps isn't the push-up. Continue the push until your arms are almost in a straight position (but not locked)."
                },
                {
                    "headline": "Repeat steps 5 and 6 for the remainder of the exercise.",
                    "description": ""
                },
                {
                    "headline": "Stretch the chest and shoulder muscles during your cool down cycle.",
                    "description": "Proper stretching and cool down routines are just as important as the warm up, but, unfortunately, are quite often overlooked."
                },
                {
                    "headline": "If you can't use your knuckles, it's fine to place your hands flat for beginners.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Increasing Push-Ups in 10 Weeks",
            "steps": [
                {
                    "headline": "Perform simple pushups for a week.",
                    "description": "This comes before the real training. Never skip a day of practice between the weeks. Remember to stop when needed and not overdo it because it'll damage your muscles and weaken you before you reach a target of 100 or more."
                },
                {
                    "headline": "On the first week, practice the correct form.",
                    "description": "Do 10 pushups a day through the week. Ten is this week's daily target."
                },
                {
                    "headline": "Proceed to week two.",
                    "description": "Increase the target to 20. Even though this is a sudden increase, it will tighten and ready your biceps."
                },
                {
                    "headline": "Repeat this increasing target weekly till you reach 50.",
                    "description": ""
                },
                {
                    "headline": "When you reach 50, take one day rest after each day of exercise in this week.",
                    "description": ""
                },
                {
                    "headline": "After you hit 70, make a dash towards 100 or at least 90.",
                    "description": ""
                },
                {
                    "headline": "If you're close but having trouble hitting 100, rest for an extra day or two and then try again when your muscles are fresh.",
                    "description": "Slowly work your way up to 100."
                },
                {
                    "headline": "Congratulations, you hit 100!",
                    "description": "Now you can either maintain your fitness, or continue working toward an even higher goal."
                }
            ]
        }
    ],
    "tyn": [
        "Pilates ball to put feet up on (optional)",
        "Chair to put feet up on (optional)",
        "Resistance, to put on your back, or some extra weight, to make the push-ups more difficult, as you progress. (optional)",
        "All sorts of stuff which can make the push up harder to do (optional)"
    ],
    "text": " Building Stamina Test yourself on how many push-ups are you able to perform, with perfect technique.  Switch between four different kinds of push-ups to train your body more by giving it something new: Wide grip push-ups Diamond presses (triceps and front delts) Knuckle push-ups (triceps, wrists, and front delts) Regular push ups, with arms placed on the ground shoulder width apart, keeping the elbows close to the side. Follow the training program. In the first week, you choose only one exercise which you will perform 4-5 sets of (all to be followed with 45 seconds of rest between sets)\nIn the second week, you choose another exercise which you will perform 4-5 sets of(all  to be followed with 45 seconds of rest between sets)\nIn the third week, you choose another exercise which you will perform 4-5 sets of(all to be followed with 45 seconds of rest between sets)\nIn the fourth week, you choose another exercise which you will perform 4-5 sets of(all to be followed with 45 seconds of rest between sets)\nAfter the first 4 weeks, your program will change; now you pick three exercises, one exercise for each workout. Now you raise it to 5 sets, to failure, and 1 minute of rest in between sets. Every week you mix your program so it's never the same. After the first 8 weeks, your program will once again change; now you will do all of the four exercises in every workout, but in every workout you do the exercises in a different order to keep the diversity in the training. Take 3 days of rest and do another test, taking as many push-ups as possible' the progress you've made will be obvious. If you still haven't reached 100 push-ups (which most people won't have after the first time they finished the program), then repeat the cycle. Perfecting Your Push-Up Technique Remember to always warm up before any exercise. Warming up reduces the risk of injury and gets muscles ready to do a push up. You can actually lift/push/pull/etc more if you go through a proper warm up routine as compared to diving straight into the exercises. Make sure to stretch your arms and wrists - key joints in push ups. Assume a prone position on the floor or other rigid surface (preferably carpeted-more on that later) that's able to support your body weight. Keep your feet together! Make two fists and place them under yourself on the floor, approximately shoulder width apart. If you are on a relatively cushioned surface, such as a carpeted floor, simply support yourself on your fists between the first and second knuckles. If you are on a less forgiving surface, consider investing in some pushup grips (they look like handles you put on the floor.) Curl your toes upward (towards your head) so that the balls of your feet touch the ground. Raise yourself using your arms. At this point, your weight should be supported by your hands and the balls of your feet. Make a straight line from your head to your heels. This position is called \"plank,\" which is used for other various exercises. This is the beginning and the end position of a single push-up. Lower your torso to the ground until your elbows form a 90 degree angle. Keep your elbows close to your body for more resistance. Keep your head facing forward. Try to have the tip of your nose pointed directly ahead. Draw a breath as you lower yourself. Raise yourself by attempting to push the ground away from you. Breathe out as you push. The power for that push will inevitably come from your shoulders and chest. The triceps (the muscle on the back side of your upper arm) are also contracted but the primary exercise for the triceps isn't the push-up. Continue the push until your arms are almost in a straight position (but not locked). Repeat steps 5 and 6 for the remainder of the exercise.  Stretch the chest and shoulder muscles during your cool down cycle. Proper stretching and cool down routines are just as important as the warm up, but, unfortunately, are quite often overlooked. If you can't use your knuckles, it's fine to place your hands flat for beginners.  Increasing Push-Ups in 10 Weeks Perform simple pushups for a week. This comes before the real training. Never skip a day of practice between the weeks. Remember to stop when needed and not overdo it because it'll damage your muscles and weaken you before you reach a target of 100 or more. On the first week, practice the correct form. Do 10 pushups a day through the week. Ten is this week's daily target. Proceed to week two. Increase the target to 20. Even though this is a sudden increase, it will tighten and ready your biceps. Repeat this increasing target weekly till you reach 50.  When you reach 50, take one day rest after each day of exercise in this week.  After you hit 70, make a dash towards 100 or at least 90.  If you're close but having trouble hitting 100, rest for an extra day or two and then try again when your muscles are fresh. Slowly work your way up to 100. Congratulations, you hit 100! Now you can either maintain your fitness, or continue working toward an even higher goal.",
    "sentences": [
        " Building Stamina Test yourself on how many push-ups are you able to perform, with perfect technique.",
        "Switch between four different kinds of push-ups to train your body more by giving it something new: Wide grip push-ups Diamond presses (triceps and front delts) Knuckle push-ups (triceps, wrists, and front delts) Regular push ups, with arms placed on the ground shoulder width apart, keeping the elbows close to the side.",
        "Follow the training program.",
        "In the first week, you choose only one exercise which you will perform 4-5 sets of (all to be followed with 45 seconds of rest between sets)\nIn the second week, you choose another exercise which you will perform 4-5 sets of(all  to be followed with 45 seconds of rest between sets)\nIn the third week, you choose another exercise which you will perform 4-5 sets of(all to be followed with 45 seconds of rest between sets)\nIn the fourth week, you choose another exercise which you will perform 4-5 sets of(all to be followed with 45 seconds of rest between sets)\nAfter the first 4 weeks, your program will change; now you pick three exercises, one exercise for each workout.",
        "Now you raise it to 5 sets, to failure, and 1 minute of rest in between sets.",
        "Every week you mix your program so it's never the same.",
        "After the first 8 weeks, your program will once again change; now you will do all of the four exercises in every workout, but in every workout you do the exercises in a different order to keep the diversity in the training.",
        "Take 3 days of rest and do another test, taking as many push-ups as possible' the progress you've made will be obvious.",
        "If you still haven't reached 100 push-ups (which most people won't have after the first time they finished the program), then repeat the cycle.",
        "Perfecting Your Push-Up Technique Remember to always warm up before any exercise.",
        "Warming up reduces the risk of injury and gets muscles ready to do a push up.",
        "You can actually lift/push/pull/etc more if you go through a proper warm up routine as compared to diving straight into the exercises.",
        "Make sure to stretch your arms and wrists - key joints in push ups.",
        "Assume a prone position on the floor or other rigid surface (preferably carpeted-more on that later) that's able to support your body weight.",
        "Keep your feet together!",
        "Make two fists and place them under yourself on the floor, approximately shoulder width apart.",
        "If you are on a relatively cushioned surface, such as a carpeted floor, simply support yourself on your fists between the first and second knuckles.",
        "If you are on a less forgiving surface, consider investing in some pushup grips (they look like handles you put on the floor.)",
        "Curl your toes upward (towards your head) so that the balls of your feet touch the ground.",
        "Raise yourself using your arms.",
        "At this point, your weight should be supported by your hands and the balls of your feet.",
        "Make a straight line from your head to your heels.",
        "This position is called \"plank,\" which is used for other various exercises.",
        "This is the beginning and the end position of a single push-up.",
        "Lower your torso to the ground until your elbows form a 90 degree angle.",
        "Keep your elbows close to your body for more resistance.",
        "Keep your head facing forward.",
        "Try to have the tip of your nose pointed directly ahead.",
        "Draw a breath as you lower yourself.",
        "Raise yourself by attempting to push the ground away from you.",
        "Breathe out as you push.",
        "The power for that push will inevitably come from your shoulders and chest.",
        "The triceps (the muscle on the back side of your upper arm) are also contracted but the primary exercise for the triceps isn't the push-up.",
        "Continue the push until your arms are almost in a straight position (but not locked).",
        "Repeat steps 5 and 6 for the remainder of the exercise.",
        "Stretch the chest and shoulder muscles during your cool down cycle.",
        "Proper stretching and cool down routines are just as important as the warm up, but, unfortunately, are quite often overlooked.",
        "If you can't use your knuckles, it's fine to place your hands flat for beginners.",
        "Increasing Push-Ups in 10 Weeks Perform simple pushups for a week.",
        "This comes before the real training.",
        "Never skip a day of practice between the weeks.",
        "Remember to stop when needed and not overdo it because it'll damage your muscles and weaken you before you reach a target of 100 or more.",
        "On the first week, practice the correct form.",
        "Do 10 pushups a day through the week.",
        "Ten is this week's daily target.",
        "Proceed to week two.",
        "Increase the target to 20.",
        "Even though this is a sudden increase, it will tighten and ready your biceps.",
        "Repeat this increasing target weekly till you reach 50.",
        "When you reach 50, take one day rest after each day of exercise in this week.",
        "After you hit 70, make a dash towards 100 or at least 90.",
        "If you're close but having trouble hitting 100, rest for an extra day or two and then try again when your muscles are fresh.",
        "Slowly work your way up to 100.",
        "Congratulations, you hit 100!",
        "Now you can either maintain your fitness, or continue working toward an even higher goal."
    ]
}