{
    "title": "How to Survive Infinity Mode in Dead Rising for Seven Days",
    "url": "https://www.wikihow.com/Survive-Infinity-Mode-in-Dead-Rising-for-Seven-Days",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Video Games",
        "Xbox",
        "Dead Rising"
    ],
    "steps": [
        {
            "headline": "Go out the security door to Entrance Plaza.",
            "description": "Go to Sinister Read and get the Health 2 book. Then find Paul and kill him, taking his food."
        },
        {
            "headline": "Travel through Al Fresca Plaza, Food Court, and stop by Sir Books-a-lot in Wonderland Plaza for the Health 1 and Criminal Biography books.",
            "description": "Then continue to North Plaza."
        },
        {
            "headline": "Travel to the empty store next to Crislips and take the Survival book.",
            "description": ""
        },
        {
            "headline": "Take a blade then head to Leisure Park and kill the three Halls for their food.",
            "description": ""
        },
        {
            "headline": "Travel to Paradise Plaza and acquire the Engineering and Entertainment books (these will help later).",
            "description": ""
        },
        {
            "headline": "Barricade yourself as much as you can in Jill's Sandwich Shop and wait out the whole virtual day.",
            "description": "(In real time, this will last approximately two hours.)"
        },
        {
            "headline": "Get the orange juice in Jill's Sandwich Shop, which will hold Frank over for seven health bars with the three health books.",
            "description": ""
        },
        {
            "headline": "Go and get the Sub-machine Gun from Paradise Plaza(above the cam shop--jump from the middle level of the stairs) at midnight of the following day.",
            "description": ""
        },
        {
            "headline": "Walk to Wonderland Plaza and kill Adam.",
            "description": "Take his chainsaws and any food he drops."
        },
        {
            "headline": "Go to the Beautification Cosmetic Store (downstairs) and jump on top of it.",
            "description": "You should find a grapefruit which you can eat later."
        },
        {
            "headline": "Walk back to Paradise Plaza and take the OJ upstairs in Colombian Roast-masters then barricade yourself in Jill's Sandwich Shop again.",
            "description": ""
        },
        {
            "headline": "Start searching the mall for food.",
            "description": "The OJ and your other food will last you about two days."
        },
        {
            "headline": "Start by going to Al Fresca Plaza where you will find 2 orange juices and 3 pies.",
            "description": "Take all of the food and place it inside of the shoe stores for an easier barricade."
        },
        {
            "headline": "Look around the benches in Leisure Park for snacks and cookies, once that food runs out.",
            "description": ""
        },
        {
            "headline": "Go to the Food Court and take all the food to the 2nd floor.",
            "description": "(Where Carlito was when you fight him the first time). You can get here by going into the area with the wooden tables and chairs and jumping onto the boxes, then jump again onto the second floor."
        },
        {
            "headline": "Stay put and only eat when you have one health bar left, once all the food is up there.",
            "description": ""
        },
        {
            "headline": "Go to Colby's Movie Land and get the food in the front behind the stands on the left, then go into each plaza and acquire all the food in each one, if your inventory gets full, make sure you just eat the weak food such as the snacks, cookies, or bread, so you can hold the better foods.",
            "description": "Just stay in one of the Theater's and eat only when you need to."
        },
        {
            "headline": "Make sure you use the mall's food only when you have one bar left and you should have survived around 5 to 7 days.",
            "description": ""
        }
    ],
    "tyn": [
        "A book or magazine",
        "A working Xbox 360",
        "Dead Rising video game",
        "Two T.V.'s so you can watch the other one while playing or if your T.V. has PIP it would be an advantage.",
        "A container to hold human wastes!!",
        "Maybe a 360 Cooling Fan, if you have one. it's a long time and might over heat (its not likely, but still.)"
    ],
    "text": " Go out the security door to Entrance Plaza. Go to Sinister Read and get the Health 2 book. Then find Paul and kill him, taking his food. Travel through Al Fresca Plaza, Food Court, and stop by Sir Books-a-lot in Wonderland Plaza for the Health 1 and Criminal Biography books. Then continue to North Plaza. Travel to the empty store next to Crislips and take the Survival book.  Take a blade then head to Leisure Park and kill the three Halls for their food.  Travel to Paradise Plaza and acquire the Engineering and Entertainment books (these will help later).  Barricade yourself as much as you can in Jill's Sandwich Shop and wait out the whole virtual day. (In real time, this will last approximately two hours.) Get the orange juice in Jill's Sandwich Shop, which will hold Frank over for seven health bars with the three health books.  Go and get the Sub-machine Gun from Paradise Plaza(above the cam shop--jump from the middle level of the stairs) at midnight of the following day.  Walk to Wonderland Plaza and kill Adam. Take his chainsaws and any food he drops. Go to the Beautification Cosmetic Store (downstairs) and jump on top of it. You should find a grapefruit which you can eat later. Walk back to Paradise Plaza and take the OJ upstairs in Colombian Roast-masters then barricade yourself in Jill's Sandwich Shop again.  Start searching the mall for food. The OJ and your other food will last you about two days. Start by going to Al Fresca Plaza where you will find 2 orange juices and 3 pies. Take all of the food and place it inside of the shoe stores for an easier barricade. Look around the benches in Leisure Park for snacks and cookies, once that food runs out.  Go to the Food Court and take all the food to the 2nd floor. (Where Carlito was when you fight him the first time). You can get here by going into the area with the wooden tables and chairs and jumping onto the boxes, then jump again onto the second floor. Stay put and only eat when you have one health bar left, once all the food is up there.  Go to Colby's Movie Land and get the food in the front behind the stands on the left, then go into each plaza and acquire all the food in each one, if your inventory gets full, make sure you just eat the weak food such as the snacks, cookies, or bread, so you can hold the better foods. Just stay in one of the Theater's and eat only when you need to. Make sure you use the mall's food only when you have one bar left and you should have survived around 5 to 7 days. ",
    "sentences": [
        " Go out the security door to Entrance Plaza.",
        "Go to Sinister Read and get the Health 2 book.",
        "Then find Paul and kill him, taking his food.",
        "Travel through Al Fresca Plaza, Food Court, and stop by Sir Books-a-lot in Wonderland Plaza for the Health 1 and Criminal Biography books.",
        "Then continue to North Plaza.",
        "Travel to the empty store next to Crislips and take the Survival book.",
        "Take a blade then head to Leisure Park and kill the three Halls for their food.",
        "Travel to Paradise Plaza and acquire the Engineering and Entertainment books (these will help later).",
        "Barricade yourself as much as you can in Jill's Sandwich Shop and wait out the whole virtual day.",
        "(In real time, this will last approximately two hours.)",
        "Get the orange juice in Jill's Sandwich Shop, which will hold Frank over for seven health bars with the three health books.",
        "Go and get the Sub-machine Gun from Paradise Plaza(above the cam shop--jump from the middle level of the stairs) at midnight of the following day.",
        "Walk to Wonderland Plaza and kill Adam.",
        "Take his chainsaws and any food he drops.",
        "Go to the Beautification Cosmetic Store (downstairs) and jump on top of it.",
        "You should find a grapefruit which you can eat later.",
        "Walk back to Paradise Plaza and take the OJ upstairs in Colombian Roast-masters then barricade yourself in Jill's Sandwich Shop again.",
        "Start searching the mall for food.",
        "The OJ and your other food will last you about two days.",
        "Start by going to Al Fresca Plaza where you will find 2 orange juices and 3 pies.",
        "Take all of the food and place it inside of the shoe stores for an easier barricade.",
        "Look around the benches in Leisure Park for snacks and cookies, once that food runs out.",
        "Go to the Food Court and take all the food to the 2nd floor.",
        "(Where Carlito was when you fight him the first time).",
        "You can get here by going into the area with the wooden tables and chairs and jumping onto the boxes, then jump again onto the second floor.",
        "Stay put and only eat when you have one health bar left, once all the food is up there.",
        "Go to Colby's Movie Land and get the food in the front behind the stands on the left, then go into each plaza and acquire all the food in each one, if your inventory gets full, make sure you just eat the weak food such as the snacks, cookies, or bread, so you can hold the better foods.",
        "Just stay in one of the Theater's and eat only when you need to.",
        "Make sure you use the mall's food only when you have one bar left and you should have survived around 5 to 7 days."
    ]
}