{
    "title": "How to Plant Desert Rose Seeds",
    "url": "https://www.wikihow.com/Plant-Desert-Rose-Seeds",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Planting and Growing"
    ],
    "methods": [
        {
            "name": "Obtaining Seeds",
            "steps": [
                {
                    "headline": "Obtain fresh seed pods from an active plant.",
                    "description": "Fresh seeds are likely to produce, but dried seeds have a low success rate. Alternatively, you can obtain fresh seeds from a garden supply store or other reputable dealers."
                },
                {
                    "headline": "When seed pods appear on an adult plant, wrap the pods with wire or twine.",
                    "description": "If the seed pods open, the seeds will disperse, and you will not be able to use them to grow a new plant."
                },
                {
                    "headline": "Remove the pods from the plant once they mature.",
                    "description": "They must be allowed to mature before removal; otherwise, the seeds may not be developed enough to grow. When the seed pods try to open, they are mature and ready for removal. Clip them off with a sharp knife or pair of scissors."
                },
                {
                    "headline": "Set the seed pods out on a flat surface.",
                    "description": "Allow them to dry."
                },
                {
                    "headline": "Remove the ties from the pod and gently crack it open with your thumbnail.",
                    "description": "Each pod should contain multiple \"feathery\" seeds."
                }
            ]
        },
        {
            "name": "Starting Seeds",
            "steps": [
                {
                    "headline": "Prepare a plastic seedling tray or small pots.",
                    "description": "If the containers you use do not have drainage holes, you should poke one hole into the bottom of the container before proceeding. In the case of plastic seedling trays, this can be done by poking the tip of a pen or large needle into the bottom of each compartment. The hole does not need to be large."
                },
                {
                    "headline": "Fill your containers with a well-draining growing medium.",
                    "description": "Vermiculite works well, as does a mix of soil and sand or soil and perlite."
                },
                {
                    "headline": "Scatter the seeds over the growing medium.",
                    "description": "If using seedling trays or containers with a diameter of four inches (ten centimeters) or less, only plant one seed per compartment. If using a larger pot, spread several seeds evenly over the soil."
                },
                {
                    "headline": "Cover the seeds with soil.",
                    "description": "Only use enough soil to just barely cover the seeds, preventing them from blowing away. The seeds should not be buried deeply."
                },
                {
                    "headline": "Fill a wide tray or bin with stones and water.",
                    "description": "The stones should completely cover the bottom of the tray, and the water should not rise above the level of the stones."
                },
                {
                    "headline": "Sit the seedling tray on top of the stones.",
                    "description": "Refresh the water daily to provide the seeds with sufficient water from below."
                },
                {
                    "headline": "Spray the soil with water from above once every three days.",
                    "description": "Use a spray bottle until the surface of the soil feels moist to the touch."
                },
                {
                    "headline": "Place the entire structure over a heating pad set to low.",
                    "description": "During germination, the soil and its seeds should be kept at a temperature between the range of 80 and 85 degrees Fahrenheit (27 to 29 degrees Celsius). Periodically test the soil with a thermometer to monitor the temperature accurately."
                },
                {
                    "headline": "Cease above-soil watering once the seeds germinate into seedlings.",
                    "description": "This should occur within the first week or two. You should still water the seedlings from below for the first month."
                },
                {
                    "headline": "Transplant the seedlings into more permanent containers.",
                    "description": "Each seedling should have about six “true leaves” at the time of transplant."
                }
            ]
        },
        {
            "name": "Transplanting",
            "steps": [
                {
                    "headline": "Select a medium-sized pot or container with one or more drainage holes.",
                    "description": "The pot should be between six and eight inches (15 to 20 centimeters) in diameter. Desert roses do not mind being somewhat root-bound; in fact, they often grow better this way. You will need to re-pot the plant as it grows bigger, however. Unglazed ceramic pots work best since the soil can dry out in between waterings. If using a clay pot, select one that is a little wider than necessary to provide the roots with extra room for expansion. Clay is more likely to crack with the pressure of expanding roots."
                },
                {
                    "headline": "Fill the pot with a well-draining potting mix.",
                    "description": "A mix made of equal parts sharp sand and cactus potting soil works notably well. Avoid heavy soils that do not drain well, since desert roses prefer somewhat dry roots and can rot quickly if kept saturated. Sharp sand, also called silica sand or builder's sand, has sharp, jagged edges and looks similar to small-grain aquarium gravel. It is often used to prepare concrete, and you can usually find it in a home improvement store."
                },
                {
                    "headline": "Mix a handful of slow-release fertilizer into the potting mix.",
                    "description": "Check the instructions provided on the label of the fertilizer for more precise measurements."
                },
                {
                    "headline": "Dig a small hole in the middle of the soil.",
                    "description": "The hole should be the same depth as the container currently holding the seedling."
                },
                {
                    "headline": "Gently remove the seedling from its present container.",
                    "description": "If being grown inside a thin plastic seedling tray, lightly squeeze the sides of the compartment until the seedling breaks free, soil and all."
                },
                {
                    "headline": "Place the seedling into the hole and pack the soil around it.",
                    "description": "The seedling should be firmly fixed in place."
                }
            ]
        },
        {
            "name": "Caring for the Plant",
            "steps": [
                {
                    "headline": "Place the pot in full sun.",
                    "description": "A south-facing window that receives plenty of direct sunlight is ideal, and your desert rose should receive at least eight hours of sun per day."
                },
                {
                    "headline": "Consider artificial lighting if you cannot provide adequate sunlight.",
                    "description": "Place your plants six inches (15 centimeters) below fluorescent grow lights, and allow them to soak in 12 hours of light per day."
                },
                {
                    "headline": "Water the desert rose regularly.",
                    "description": "Allow the soil to dry out in between waterings and only add water once the top inch or two (2.5 to 5 centimeters) of soil feels dry to the touch. Water lightly when necessary, making the soil moist without saturating it."
                },
                {
                    "headline": "Keep your plants warm.",
                    "description": "Ideal daytime temperature ranges between 75 and 85 degrees Fahrenheit (24 to 29 degrees Celsius), with night temperatures dropping by as much as 15 degrees Fahrenheit (8 degrees Celsius). Never allow the soil to drop below a temperature of 40 degrees Fahrenheit (4 degrees Celsius). At this temperature, the plant could suffer severe damage or even death."
                },
                {
                    "headline": "Feed your desert rose with frequent applications of a liquid fertilizer until it flowers.",
                    "description": "Use a 20-20-20 fertilizer, diluted to half strength. A 20-20-20 fertilizer has completely balanced levels of nitrogen, phosphorus, and potassium. Nitrogen encourages the growth of foliage, phosphorus mainly helps with root development, and potassium maintains the flowers that bud. If the fertilizer contains a higher percentage of any one element, your desert rose may develop poorly."
                },
                {
                    "headline": "Continue to feed your desert rose with ample amounts of fertilizer even after flowering.",
                    "description": "Give your desert rose a water-soluble liquid fertilizer every other week during the spring. By summer, switch to a single application of slow-release palm fertilizer. Feed your plant with another application of slow-release fertilizer during the early fall. Give the flower a few doses of liquid fertilizer during the winter, as long as you manage to keep the temperature of the soil at or above 80 degrees Fahrenheit (27 degrees Celsius). After three years, when the plant matures, stop giving the desert rose liquid fertilizer. It can still benefit from slow-release fertilizer, however."
                }
            ]
        }
    ],
    "tyn": [
        "Fresh desert rose seeds",
        "Scissors",
        "Wire ties",
        "Plastic seedling tray",
        "Spray bottle",
        "Watering can",
        "Heating pad",
        "Shallow tray",
        "Stones",
        "Fluorescent grow lights",
        "Potting mix",
        "Medium-sized pot or other container",
        "Thermometer",
        "Fertilizer"
    ],
    "text": " Obtaining Seeds Obtain fresh seed pods from an active plant. Fresh seeds are likely to produce, but dried seeds have a low success rate. Alternatively, you can obtain fresh seeds from a garden supply store or other reputable dealers. When seed pods appear on an adult plant, wrap the pods with wire or twine. If the seed pods open, the seeds will disperse, and you will not be able to use them to grow a new plant. Remove the pods from the plant once they mature. They must be allowed to mature before removal; otherwise, the seeds may not be developed enough to grow. When the seed pods try to open, they are mature and ready for removal. Clip them off with a sharp knife or pair of scissors. Set the seed pods out on a flat surface. Allow them to dry. Remove the ties from the pod and gently crack it open with your thumbnail. Each pod should contain multiple \"feathery\" seeds. Starting Seeds Prepare a plastic seedling tray or small pots. If the containers you use do not have drainage holes, you should poke one hole into the bottom of the container before proceeding. In the case of plastic seedling trays, this can be done by poking the tip of a pen or large needle into the bottom of each compartment. The hole does not need to be large. Fill your containers with a well-draining growing medium. Vermiculite works well, as does a mix of soil and sand or soil and perlite. Scatter the seeds over the growing medium. If using seedling trays or containers with a diameter of four inches (ten centimeters) or less, only plant one seed per compartment. If using a larger pot, spread several seeds evenly over the soil. Cover the seeds with soil. Only use enough soil to just barely cover the seeds, preventing them from blowing away. The seeds should not be buried deeply. Fill a wide tray or bin with stones and water. The stones should completely cover the bottom of the tray, and the water should not rise above the level of the stones. Sit the seedling tray on top of the stones. Refresh the water daily to provide the seeds with sufficient water from below. Spray the soil with water from above once every three days. Use a spray bottle until the surface of the soil feels moist to the touch. Place the entire structure over a heating pad set to low. During germination, the soil and its seeds should be kept at a temperature between the range of 80 and 85 degrees Fahrenheit (27 to 29 degrees Celsius). Periodically test the soil with a thermometer to monitor the temperature accurately. Cease above-soil watering once the seeds germinate into seedlings. This should occur within the first week or two. You should still water the seedlings from below for the first month. Transplant the seedlings into more permanent containers. Each seedling should have about six “true leaves” at the time of transplant. Transplanting Select a medium-sized pot or container with one or more drainage holes. The pot should be between six and eight inches (15 to 20 centimeters) in diameter. Desert roses do not mind being somewhat root-bound; in fact, they often grow better this way. You will need to re-pot the plant as it grows bigger, however. Unglazed ceramic pots work best since the soil can dry out in between waterings. If using a clay pot, select one that is a little wider than necessary to provide the roots with extra room for expansion. Clay is more likely to crack with the pressure of expanding roots. Fill the pot with a well-draining potting mix. A mix made of equal parts sharp sand and cactus potting soil works notably well. Avoid heavy soils that do not drain well, since desert roses prefer somewhat dry roots and can rot quickly if kept saturated. Sharp sand, also called silica sand or builder's sand, has sharp, jagged edges and looks similar to small-grain aquarium gravel. It is often used to prepare concrete, and you can usually find it in a home improvement store. Mix a handful of slow-release fertilizer into the potting mix. Check the instructions provided on the label of the fertilizer for more precise measurements. Dig a small hole in the middle of the soil. The hole should be the same depth as the container currently holding the seedling. Gently remove the seedling from its present container. If being grown inside a thin plastic seedling tray, lightly squeeze the sides of the compartment until the seedling breaks free, soil and all. Place the seedling into the hole and pack the soil around it. The seedling should be firmly fixed in place. Caring for the Plant Place the pot in full sun. A south-facing window that receives plenty of direct sunlight is ideal, and your desert rose should receive at least eight hours of sun per day. Consider artificial lighting if you cannot provide adequate sunlight. Place your plants six inches (15 centimeters) below fluorescent grow lights, and allow them to soak in 12 hours of light per day. Water the desert rose regularly. Allow the soil to dry out in between waterings and only add water once the top inch or two (2.5 to 5 centimeters) of soil feels dry to the touch. Water lightly when necessary, making the soil moist without saturating it. Keep your plants warm. Ideal daytime temperature ranges between 75 and 85 degrees Fahrenheit (24 to 29 degrees Celsius), with night temperatures dropping by as much as 15 degrees Fahrenheit (8 degrees Celsius). Never allow the soil to drop below a temperature of 40 degrees Fahrenheit (4 degrees Celsius). At this temperature, the plant could suffer severe damage or even death. Feed your desert rose with frequent applications of a liquid fertilizer until it flowers. Use a 20-20-20 fertilizer, diluted to half strength. A 20-20-20 fertilizer has completely balanced levels of nitrogen, phosphorus, and potassium. Nitrogen encourages the growth of foliage, phosphorus mainly helps with root development, and potassium maintains the flowers that bud. If the fertilizer contains a higher percentage of any one element, your desert rose may develop poorly. Continue to feed your desert rose with ample amounts of fertilizer even after flowering. Give your desert rose a water-soluble liquid fertilizer every other week during the spring. By summer, switch to a single application of slow-release palm fertilizer. Feed your plant with another application of slow-release fertilizer during the early fall. Give the flower a few doses of liquid fertilizer during the winter, as long as you manage to keep the temperature of the soil at or above 80 degrees Fahrenheit (27 degrees Celsius). After three years, when the plant matures, stop giving the desert rose liquid fertilizer. It can still benefit from slow-release fertilizer, however.",
    "sentences": [
        " Obtaining Seeds Obtain fresh seed pods from an active plant.",
        "Fresh seeds are likely to produce, but dried seeds have a low success rate.",
        "Alternatively, you can obtain fresh seeds from a garden supply store or other reputable dealers.",
        "When seed pods appear on an adult plant, wrap the pods with wire or twine.",
        "If the seed pods open, the seeds will disperse, and you will not be able to use them to grow a new plant.",
        "Remove the pods from the plant once they mature.",
        "They must be allowed to mature before removal; otherwise, the seeds may not be developed enough to grow.",
        "When the seed pods try to open, they are mature and ready for removal.",
        "Clip them off with a sharp knife or pair of scissors.",
        "Set the seed pods out on a flat surface.",
        "Allow them to dry.",
        "Remove the ties from the pod and gently crack it open with your thumbnail.",
        "Each pod should contain multiple \"feathery\" seeds.",
        "Starting Seeds Prepare a plastic seedling tray or small pots.",
        "If the containers you use do not have drainage holes, you should poke one hole into the bottom of the container before proceeding.",
        "In the case of plastic seedling trays, this can be done by poking the tip of a pen or large needle into the bottom of each compartment.",
        "The hole does not need to be large.",
        "Fill your containers with a well-draining growing medium.",
        "Vermiculite works well, as does a mix of soil and sand or soil and perlite.",
        "Scatter the seeds over the growing medium.",
        "If using seedling trays or containers with a diameter of four inches (ten centimeters) or less, only plant one seed per compartment.",
        "If using a larger pot, spread several seeds evenly over the soil.",
        "Cover the seeds with soil.",
        "Only use enough soil to just barely cover the seeds, preventing them from blowing away.",
        "The seeds should not be buried deeply.",
        "Fill a wide tray or bin with stones and water.",
        "The stones should completely cover the bottom of the tray, and the water should not rise above the level of the stones.",
        "Sit the seedling tray on top of the stones.",
        "Refresh the water daily to provide the seeds with sufficient water from below.",
        "Spray the soil with water from above once every three days.",
        "Use a spray bottle until the surface of the soil feels moist to the touch.",
        "Place the entire structure over a heating pad set to low.",
        "During germination, the soil and its seeds should be kept at a temperature between the range of 80 and 85 degrees Fahrenheit (27 to 29 degrees Celsius).",
        "Periodically test the soil with a thermometer to monitor the temperature accurately.",
        "Cease above-soil watering once the seeds germinate into seedlings.",
        "This should occur within the first week or two.",
        "You should still water the seedlings from below for the first month.",
        "Transplant the seedlings into more permanent containers.",
        "Each seedling should have about six “true leaves” at the time of transplant.",
        "Transplanting Select a medium-sized pot or container with one or more drainage holes.",
        "The pot should be between six and eight inches (15 to 20 centimeters) in diameter.",
        "Desert roses do not mind being somewhat root-bound; in fact, they often grow better this way.",
        "You will need to re-pot the plant as it grows bigger, however.",
        "Unglazed ceramic pots work best since the soil can dry out in between waterings.",
        "If using a clay pot, select one that is a little wider than necessary to provide the roots with extra room for expansion.",
        "Clay is more likely to crack with the pressure of expanding roots.",
        "Fill the pot with a well-draining potting mix.",
        "A mix made of equal parts sharp sand and cactus potting soil works notably well.",
        "Avoid heavy soils that do not drain well, since desert roses prefer somewhat dry roots and can rot quickly if kept saturated.",
        "Sharp sand, also called silica sand or builder's sand, has sharp, jagged edges and looks similar to small-grain aquarium gravel.",
        "It is often used to prepare concrete, and you can usually find it in a home improvement store.",
        "Mix a handful of slow-release fertilizer into the potting mix.",
        "Check the instructions provided on the label of the fertilizer for more precise measurements.",
        "Dig a small hole in the middle of the soil.",
        "The hole should be the same depth as the container currently holding the seedling.",
        "Gently remove the seedling from its present container.",
        "If being grown inside a thin plastic seedling tray, lightly squeeze the sides of the compartment until the seedling breaks free, soil and all.",
        "Place the seedling into the hole and pack the soil around it.",
        "The seedling should be firmly fixed in place.",
        "Caring for the Plant Place the pot in full sun.",
        "A south-facing window that receives plenty of direct sunlight is ideal, and your desert rose should receive at least eight hours of sun per day.",
        "Consider artificial lighting if you cannot provide adequate sunlight.",
        "Place your plants six inches (15 centimeters) below fluorescent grow lights, and allow them to soak in 12 hours of light per day.",
        "Water the desert rose regularly.",
        "Allow the soil to dry out in between waterings and only add water once the top inch or two (2.5 to 5 centimeters) of soil feels dry to the touch.",
        "Water lightly when necessary, making the soil moist without saturating it.",
        "Keep your plants warm.",
        "Ideal daytime temperature ranges between 75 and 85 degrees Fahrenheit (24 to 29 degrees Celsius), with night temperatures dropping by as much as 15 degrees Fahrenheit (8 degrees Celsius).",
        "Never allow the soil to drop below a temperature of 40 degrees Fahrenheit (4 degrees Celsius).",
        "At this temperature, the plant could suffer severe damage or even death.",
        "Feed your desert rose with frequent applications of a liquid fertilizer until it flowers.",
        "Use a 20-20-20 fertilizer, diluted to half strength.",
        "A 20-20-20 fertilizer has completely balanced levels of nitrogen, phosphorus, and potassium.",
        "Nitrogen encourages the growth of foliage, phosphorus mainly helps with root development, and potassium maintains the flowers that bud.",
        "If the fertilizer contains a higher percentage of any one element, your desert rose may develop poorly.",
        "Continue to feed your desert rose with ample amounts of fertilizer even after flowering.",
        "Give your desert rose a water-soluble liquid fertilizer every other week during the spring.",
        "By summer, switch to a single application of slow-release palm fertilizer.",
        "Feed your plant with another application of slow-release fertilizer during the early fall.",
        "Give the flower a few doses of liquid fertilizer during the winter, as long as you manage to keep the temperature of the soil at or above 80 degrees Fahrenheit (27 degrees Celsius).",
        "After three years, when the plant matures, stop giving the desert rose liquid fertilizer.",
        "It can still benefit from slow-release fertilizer, however."
    ]
}