{
    "title": "How to Make Lemon Beer",
    "url": "https://www.wikihow.com/Make-Lemon-Beer",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Alcoholic Drinks",
        "Beer and Cider"
    ],
    "methods": [
        {
            "name": "Choose a Base Beer Style",
            "steps": [
                {
                    "headline": "Consider brewing a lemon wheat beer.",
                    "description": "There is a reason why many styles of mild wheat beer, such as German Hefeweizens and Belgian Wits, are served with a lemon wedge in the glass. The bright, lively citrus notes pair excellently with the smooth, earthy flavor of wheat beer."
                },
                {
                    "headline": "Try creating a lemon lager.",
                    "description": "Lemon also pairs excellently with light lager-style beers like Pilsner and pale American lagers. In fact, a popular summer cocktail called a shandy takes advantage of this very pairing by combining pale lager beer and lemonade."
                },
                {
                    "headline": "Pair lemon with a darker, richer beer.",
                    "description": "While this combination is not as popular, you may also find that lemon works well with rich, flavorful beers like stout, porter, and IPA. Lemon could provide an energetic lift to the heavy chocolate notes of a stout, while lemon might also blend harmoniously with the grapefruit notes of a hoppy IPA."
                }
            ]
        },
        {
            "name": "Choose a Method for Adding Lemon",
            "steps": [
                {
                    "headline": "Pour lemon juice into the secondary fermenter.",
                    "description": "The most straightforward way to brew lemon beer is to add a small amount of lemon juice to the beer during secondary fermentation. Some of the sugars in the lemon juice will undergo fermentation, which will add complexity to the beer. However, the basic brightness of the lemon will remain present in the beer's finished flavor."
                },
                {
                    "headline": "Steep lemon peel in the secondary fermenter.",
                    "description": "An option for adding more subtle lemon flavor to your beer is to steep lemon peel in the secondary fermenter. The lemon peel contains the fruit's essential oils, which are very flavorful and will not be metabolized by the yeast. You can also steep complementary spices in the secondary fermenter, such as clove or cinnamon."
                },
                {
                    "headline": "Utilize a prepared lemon product.",
                    "description": "A third option for making lemon beer is to use a prepared product such as lemon jam. The flavor in these products is often more concentrated than in lemon juice, and it won't tend to dissipate so much between fermentation and consumption. Note that the sugar present in jams and jellies will increase the gravity of your beer."
                },
                {
                    "headline": "Add lemon just before drinking.",
                    "description": "Of course, a simple way to make sure the lemon tastes as fresh as possible in your beer is to add it to your glass just before drinking. Adding a lemon wedge to your beer glass can be an easy way to improve its presentation or even to test a beer recipe for the possible addition of lemon during fermentation."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Beer",
        "Lemon juice, peel, or jam",
        "Beer brewing equipment"
    ],
    "text": " Choose a Base Beer Style Consider brewing a lemon wheat beer. There is a reason why many styles of mild wheat beer, such as German Hefeweizens and Belgian Wits, are served with a lemon wedge in the glass. The bright, lively citrus notes pair excellently with the smooth, earthy flavor of wheat beer. Try creating a lemon lager. Lemon also pairs excellently with light lager-style beers like Pilsner and pale American lagers. In fact, a popular summer cocktail called a shandy takes advantage of this very pairing by combining pale lager beer and lemonade. Pair lemon with a darker, richer beer. While this combination is not as popular, you may also find that lemon works well with rich, flavorful beers like stout, porter, and IPA. Lemon could provide an energetic lift to the heavy chocolate notes of a stout, while lemon might also blend harmoniously with the grapefruit notes of a hoppy IPA. Choose a Method for Adding Lemon Pour lemon juice into the secondary fermenter. The most straightforward way to brew lemon beer is to add a small amount of lemon juice to the beer during secondary fermentation. Some of the sugars in the lemon juice will undergo fermentation, which will add complexity to the beer. However, the basic brightness of the lemon will remain present in the beer's finished flavor. Steep lemon peel in the secondary fermenter. An option for adding more subtle lemon flavor to your beer is to steep lemon peel in the secondary fermenter. The lemon peel contains the fruit's essential oils, which are very flavorful and will not be metabolized by the yeast. You can also steep complementary spices in the secondary fermenter, such as clove or cinnamon. Utilize a prepared lemon product. A third option for making lemon beer is to use a prepared product such as lemon jam. The flavor in these products is often more concentrated than in lemon juice, and it won't tend to dissipate so much between fermentation and consumption. Note that the sugar present in jams and jellies will increase the gravity of your beer. Add lemon just before drinking. Of course, a simple way to make sure the lemon tastes as fresh as possible in your beer is to add it to your glass just before drinking. Adding a lemon wedge to your beer glass can be an easy way to improve its presentation or even to test a beer recipe for the possible addition of lemon during fermentation. Finished. ",
    "sentences": [
        " Choose a Base Beer Style Consider brewing a lemon wheat beer.",
        "There is a reason why many styles of mild wheat beer, such as German Hefeweizens and Belgian Wits, are served with a lemon wedge in the glass.",
        "The bright, lively citrus notes pair excellently with the smooth, earthy flavor of wheat beer.",
        "Try creating a lemon lager.",
        "Lemon also pairs excellently with light lager-style beers like Pilsner and pale American lagers.",
        "In fact, a popular summer cocktail called a shandy takes advantage of this very pairing by combining pale lager beer and lemonade.",
        "Pair lemon with a darker, richer beer.",
        "While this combination is not as popular, you may also find that lemon works well with rich, flavorful beers like stout, porter, and IPA.",
        "Lemon could provide an energetic lift to the heavy chocolate notes of a stout, while lemon might also blend harmoniously with the grapefruit notes of a hoppy IPA.",
        "Choose a Method for Adding Lemon Pour lemon juice into the secondary fermenter.",
        "The most straightforward way to brew lemon beer is to add a small amount of lemon juice to the beer during secondary fermentation.",
        "Some of the sugars in the lemon juice will undergo fermentation, which will add complexity to the beer.",
        "However, the basic brightness of the lemon will remain present in the beer's finished flavor.",
        "Steep lemon peel in the secondary fermenter.",
        "An option for adding more subtle lemon flavor to your beer is to steep lemon peel in the secondary fermenter.",
        "The lemon peel contains the fruit's essential oils, which are very flavorful and will not be metabolized by the yeast.",
        "You can also steep complementary spices in the secondary fermenter, such as clove or cinnamon.",
        "Utilize a prepared lemon product.",
        "A third option for making lemon beer is to use a prepared product such as lemon jam.",
        "The flavor in these products is often more concentrated than in lemon juice, and it won't tend to dissipate so much between fermentation and consumption.",
        "Note that the sugar present in jams and jellies will increase the gravity of your beer.",
        "Add lemon just before drinking.",
        "Of course, a simple way to make sure the lemon tastes as fresh as possible in your beer is to add it to your glass just before drinking.",
        "Adding a lemon wedge to your beer glass can be an easy way to improve its presentation or even to test a beer recipe for the possible addition of lemon during fermentation.",
        "Finished."
    ]
}