{
    "title": "How to Fix a Water Heater",
    "url": "https://www.wikihow.com/Fix-a-Water-Heater",
    "category_hierarchy": [
        "Home and Garden",
        "Heating and Cooling",
        "Heating Systems"
    ],
    "methods": [
        {
            "name": "Cleaning the Heating Element on an Electric Water Heater",
            "steps": [
                {
                    "headline": "Turn the power off going to your water heater.",
                    "description": "Check the electrical breaker box in your home and find the 2 circuits that control your water heater. Flip the switches to the off position so you don't get shocked when you're working. If you're unsure which circuits control the water heater, try turning off the circuits and testing the ports on your water heater with a multimeter. The readout should be 0 V."
                },
                {
                    "headline": "Shut off the water supply on your water heater.",
                    "description": "The valve controlling the water going into your heater should be on a pipe above or next to the unit. Turn the valve so the lever is perpendicular to the pipe. This prevents any water from entering the tank while you work on it."
                },
                {
                    "headline": "Drain the water heater completely.",
                    "description": "Locate the drain valve on at the bottom of your tank and secure the end of a garden hose to it. Put the other end of the hose next to a drain, such as one in your basement floor or in a bathtub. Open the drain valve on the bottom of your water heater with a screwdriver or channel lock pliers and let the tank drain completely. Most water heaters should have a drain next to them to catch any run-off.Warning: The water coming out of the hose could be very hot. Do not touch it or else you could get scalded by it."
                },
                {
                    "headline": "Open the access panel leading to the heating element.",
                    "description": "The access panel covers the thermostat and the heating element inside your water heater, and it is usually located on the side or near the bottom of the unit. Use a screwdriver to remove the access panel and set it aside. Some electric water heaters have 2 access panels on the top and the bottom each with their own heating element."
                },
                {
                    "headline": "Disconnect and label the wires connected to the heating element.",
                    "description": "The heating element is usually on the lower part of the access panel and will have 2 screws with red and black wires connecting to it. Loosen the screws with your screwdriver and pull the wires out. As you pull the wires, label which screws they were attached to with a piece of masking tape."
                },
                {
                    "headline": "Unscrew the heating element from the water heater.",
                    "description": "Secure a pair of channel lock pliers on the hexagonal nut behind the screws. Turn the heating element counterclockwise to loosen it. Continue unscrewing the heating element by hand until you can easily pull it out from your tank. Do not remove the heating element if you haven't drained the water from your tank. Water will come out and could burn you otherwise."
                },
                {
                    "headline": "Scrub the heating element with a wire brush.",
                    "description": "Over time, your heating element may collect calcium deposits from the water and make the unit less efficient. Set the heating element on a flat surface and scrape the coil with a stiff wire brush. Try to clean as much of the residue off as can. When you have one side of the coil clean, flip it over and scrub the other side. If you cannot get the heating element clean, you can order a replacement from the water heater's manufacturer. They usually cost around $35 USD."
                },
                {
                    "headline": "Reattach the heating element to your tank.",
                    "description": "Feed the coil back into the tank and start screwing the element back on by hand. Once the heating element is hand-tight, use your channel lock pliers to tighten the unit in place. Loop the wires around their matching screws before tightening them with a screwdriver. Your heating element should already have a seal on the threading to prevent leaks. If it doesn't wrap 5-6 layers of Teflon or plumber's tape around the threading."
                },
                {
                    "headline": "Turn on the power and water supply to use your tank again.",
                    "description": "Once the heating unit is back in place, flip the breakers to the on position so the water heater has power. Then, turn the water valve on so the lever points the same direction as the pipes. Once the tank is filled again, you should have hot water. If the water still isn't hot, check the wire connections to the heating element. If they're correct, then you may have a problem with the unit's thermostat."
                }
            ]
        },
        {
            "name": "Replacing the Thermostat on an Electric Heater",
            "steps": [
                {
                    "headline": "Turn off the power running to your water heater.",
                    "description": "Go to your home's electrical box and find the 2 breakers that control your water heater. Turn them to the off position so you don't accidentally shock yourself while you're replacing the thermostat."
                },
                {
                    "headline": "Open the access panel on the tank.",
                    "description": "The access panel is usually located on the side or near the bottom of your water heater. Use a screwdriver to remove the access panel's cover and set it aside. You should see the thermostat on the top of the access panel and the heating element near the bottom. Some electric water heaters have 2 access panels. Each of the access panels will have their own thermostat."
                },
                {
                    "headline": "Remove and label the wires connected to the thermostat.",
                    "description": "The thermostat looks like a black box with 2 black wires connecting to it. Use a screwdriver to loosen the screws on the thermostat and release the wires. When you get the wires loose, wrap a piece of masking tape around each one and label which screw they were attached to. If your wires are reattached to the wrong screws on your new thermostat, then your water heater will not work."
                },
                {
                    "headline": "Pull the thermostat out of the brackets.",
                    "description": "Hold the top of the thermostat with your dominant hand. Locate the retaining bracket on the bottom of the thermostat that holds it in place. Slide the end of a screwdriver behind the tab on the side of the bracket and gently pry it up to release the thermostat. Lift the tab on the other side of the thermostat so you can pull the unit out of the access panel. Be careful not to break the bracket that holds the thermostat in place since you cannot replace that component individually."
                },
                {
                    "headline": "Place an identical thermostat in its place.",
                    "description": "Make sure the thermostat is the exact same model as your old one or else it will not be compatible. Slide the thermostat into the access panel so it's behind the retaining bracket. Push the thermostat into place until it clicks. Order an identical thermostat from the water heater's manufacturer. They usually cost around $20 USD.Tip: If your water heater has 2 thermostats, make sure you get matching replacements for each of them."
                },
                {
                    "headline": "Reattach the wires to the matching screws.",
                    "description": "Once the thermostat is securely in place, bend hook shapes into the ends of each wire. Wrap the wire hook underneath the screw head that matches the wire's label. Tighten the screws so they have a firm connection with the wires. You can leave the labels on your wires if you want or you can remove them."
                },
                {
                    "headline": "Adjust the new thermostat to 120 °F (49 °C).",
                    "description": "The temperature is usually controlled with a screw or dial on the bottom of the thermostat. If it's a screw, use your screwdriver so the slit on the screw head points to 120 °F (49 °C). If your thermostat has a dial, turn it by hand to the right temperature. When you're finished, all you need to do is turn your power back on so your water heater works again! Avoid turning the thermostat higher than 120 °F (49 °C) since it could cause scalding water temperatures from your fixtures."
                }
            ]
        },
        {
            "name": "Igniting a Pilot Light on a Gas Water Heater",
            "steps": [
                {
                    "headline": "Remove the bottom panel on your water heater.",
                    "description": "The access panel on your gas water heater is found at the bottom of the tank. Use a screwdriver to remove the panel and set it aside while you're working. If the pilot light is out and you smell natural gas around your water heater, leave and call your utility company immediately since you may have a gas leak. Do not attempt to light the pilot light if you smell gas."
                },
                {
                    "headline": "Turn the dial on top to the thermostat to the PILOT position.",
                    "description": "The topmost dial on your water heater controls the power on your unit and should have the labels ON, OFF, and PILOT. Twist the dial by hand so it's on the PILOT position so the burner inside your water heater is turned off. Don't attempt to relight the pilot light while your water heater is still on."
                },
                {
                    "headline": "Reduce the heat as low as it can go.",
                    "description": "The large dial on the front of your thermostat controls the unit's temperature. Turn the dial clockwise to reduce your heat to the lowest temperature it can go. This help ensures you stay safe while you ignite your pilot light."
                },
                {
                    "headline": "Press the dial down and light the pilot with a safety lighter.",
                    "description": "Hold a safety lighter inside the bottom access panel so it lines up with the thin tube that connects to your thermostat. With the dial in the pilot position, press down on top of the dial until you hear it click. When the dial is pressed down, ignite your lighter to start your pilot light. Keep the dial held down for 30 seconds after the pilot is lit. Some water heaters have an ignitor button next to the dial. If your water heater has a pilot light button, you do not need to use a lighter."
                },
                {
                    "headline": "Switch the dial to the ON position.",
                    "description": "Release the dial so it clicks back up into place. Once the dial pops up, turn it toward the ON position to activate the burner. This will turn your water heater on so you have hot water throughout your home.Tip: If the dial doesn't pop up when you let go of it, turn off the unit for 5 minutes and try again."
                },
                {
                    "headline": "Adjust the water heater's temperature to 120 °F (49 °C).",
                    "description": "Turn the large dial in the front of your thermostat so it points at 120 °F (49 °C). The burner will activate and heat the water inside your tank. Don't turn the thermostat higher than 120 °F (49 °C) or else the water coming out of your fixtures may scald you."
                }
            ]
        },
        {
            "name": "Changing the Thermostat on a Gas Heater",
            "steps": [
                {
                    "headline": "Turn off the gas and water running to your water heater.",
                    "description": "The gas hose connects to the left side of your thermostat and the valve to turn it off will be located along the gas line. Turn the lever so it's perpendicular to the gas line. Then, locate the water valve on the pipe above or next to the heater and turn the lever so it's also perpendicular to the pipe. You don't need to turn off any power while working on a gas water heater."
                },
                {
                    "headline": "Drain the water from your water heater.",
                    "description": "Locate the drain valve on the bottom of your water heater's tank. Screw a garden hose onto the drain valve and feed the other end into a drain in the floor or to your bathtub. Open the drain valve with a screwdriver or channel lock pliers so the water empties from your tank. The water coming out of your hose will be very hot and could cause scalding-hot burns."
                },
                {
                    "headline": "Unscrew the lines attached to your thermostat.",
                    "description": "There should be 3 or 4 pipes that connect to the bottom of your thermostat. Use a pair of channel lock pliers to loosen the lines from your thermostat. Lightly pull the pipes away from the thermostat so they don't deform. The hose on the left side of your thermostat controls the gas intake. The pipes and lines on the bottom of the thermostat lead to the pilot and burner inside the unit. You can remove the lines while your water heater is still draining."
                },
                {
                    "headline": "Use a pipe wrench to remove the old thermostat.",
                    "description": "Grip the sides of your thermostat between the jaws of a pipe wrench. Turn the wrench counterclockwise to loosen the thermostat from the tank. Keep rotating the thermostat by hand until it's free from the tank. Don't unscrew the thermostat while there's still water inside since it could spill out."
                },
                {
                    "headline": "Seal the threading on your new thermostat with Teflon tape.",
                    "description": "Locate the threading on the back side of the thermostat that attaches to your tank. Wrap 5-6 layers of Teflon tape around the threading to seal it. Make sure you wrap your tape in the same direction as the way it's screwed in. Replacement thermostats can be bought online or directly from the water heater manufacturer, and they usually cost around $85-$90 USD. Teflon tape may also be called thread-seal or plumber's tape."
                },
                {
                    "headline": "Screw the new thermostat in its place.",
                    "description": "Once the thermostat is sealed, place the threading into the hole on your tank where the old thermostat used to be. Turn the thermostat clockwise to tighten it in place. When you can't tighten it by hand anymore, use your pipe wrench to secure it in place. Make sure the thermostat is right-side up when you're finished or else the dial will be upside down."
                },
                {
                    "headline": "Reattach the lines and pipes to the new thermostat.",
                    "description": "Use your channel lock pliers to secure the gas hose back onto the side of your thermostat. Then match the pilot and burner lines to the ports on the bottom of your thermostat and tighten them with your pliers. You do not need to seal the connections from the lines to your thermostat."
                },
                {
                    "headline": "Open the valves and start your thermostat.",
                    "description": "Reopen the gas and water valves leading to your water heater so it can start filling and warming up again. Relight the pilot light and turn your thermostat to 120 °F (49 °C) so you have hot water throughout your home.Warning: Don't turn your thermostat past 120 °F (49 °C) since it will cause scalding hot water to come out of your fixtures."
                }
            ]
        },
        {
            "name": "Fixing a Leaky Pressure-Relief Valve",
            "steps": [
                {
                    "headline": "Turn off the water supply to your water heater.",
                    "description": "Locate the water supply pipe above or next to your water heater. Turn the lever on the valve so it's perpendicular to the pipes. This prevents any more water from entering the tank while you're working on it."
                },
                {
                    "headline": "Drain 10 US gal (38 L) from your water heater.",
                    "description": "Attach a garden hose the drain valve on the bottom of your water heater's tank. Place the other end of the hose next to bath or floor drain. Open the valve with a screwdriver or pair of pliers and let it drain for about 15-30 minutes. Once about 10 US gal (38 L) are drained from the tank, close the drain valve and disconnect the hose. Many water heaters have a drain in the floor next to them."
                },
                {
                    "headline": "Detach the run-off pipe from the pressure-relief valve.",
                    "description": "The pressure-relief valve is located on top of your unit in the center. The valve should be attached to a pipe that leads down the side of your tank. Use a pair of channel lock pliers where the pipe connects to the valve. Rotate it counterclockwise to loosen it from the valve and remove it. Set the run-off pipe aside since you'll need to attach it to the new valve."
                },
                {
                    "headline": "Use channel lock pliers to unscrew the pressure-relief valve.",
                    "description": "Grip the base of the pressure-relief valve between the jaws of your channel lock pliers. Rotate the valve counterclockwise to loosen it, and then spin the valve by hand. Pull the valve out from the tank to remove it. The valve may release steam as you unscrew it. Keep your head away from the valve and wear work gloves while handling it."
                },
                {
                    "headline": "Seal the threads on a new pressure-relief valve with Teflon tape.",
                    "description": "Sealing the valve helps prevent any unwanted leaks through the threading. Wrap 5-6 layers of Teflon tape around the threading on your new valve in the same direction that it screws in. When you're finished wrapping it, cut the piece of tape. Pressure-relief valves can be purchased online or directly from the water heater's manufacturer for about $20 USD. Teflon tape may be called thread-seal or plumber's tape. Any of these will work for sealing your valve."
                },
                {
                    "headline": "Screw the new valve into your water heater.",
                    "description": "Place the threading of the valve in the hole where the old one used to be. Screw the valve in by hand as far as you can. Then, use your channel lock pliers to tighten the valve until you can't rotate it anymore. Keep the lever on top of your valve is horizontal when it's installed.Tip: Make sure the valve points in a direction where you can easily attach your run-off pipe."
                },
                {
                    "headline": "Reattach the run-off pipe to the valve.",
                    "description": "Fit the threading of the run-off pipe into the side of the valve so the pipe hangs over the edge of the water heater's tank. Turn the pipe clockwise to tighten it onto your valve. Use your channel lock pliers when you can't tighten the piper by hand any further. You may need to seal the run-off pipe with Teflon tape as well if it hasn't already been sealed."
                },
                {
                    "headline": "Turn on your water heater's water supply.",
                    "description": "Turn the lever on your water supply so that it's pointing the same direction as your pipe. The water supply will start to fill your tank so you can use hot water in your home again."
                },
                {
                    "headline": "Open a hot water faucet somewhere in your home.",
                    "description": "Pick any sink or fixture in your home and set it so the hot water is running. Nothing will come out of the faucet yet, but it will relive the pressure inside your tank so the valve is installed properly."
                },
                {
                    "headline": "Pull the lever open on the valve.",
                    "description": "After a faucet's been opened, pull the lever on top of your valve up to alleviate more pressure from inside the tank. Once the lever is open, you may notice some water going down the run-off pipe."
                },
                {
                    "headline": "Close the lever once a steady stream of water flows through the run-off pipe.",
                    "description": "As your water heats up, the pressure inside the tank will increase and water will be forced out of the pressure-relief valve. When you notice the stream coming out from your run-off pipe, close the valve so the lever is horizontal again. You can also turn off your water faucet once the stream is steady."
                }
            ]
        }
    ],
    "tyn": [
        "Cleaning the Heating Element on an Electric Water Heater",
        "Screwdriver",
        "Garden hose",
        "Channel lock pliers",
        "Masking tape",
        "Wire brush",
        "Replacing the Thermostat on an Electric Heater",
        "Water heater thermostat",
        "Igniting a Pilot Light on a Gas Water Heater",
        "Safety lighter",
        "Changing the Thermostat on a Gas Heater",
        "Pipe wrench",
        "Replacement thermostat",
        "Teflon tape",
        "Fixing a Leaky Pressure-Relief Valve",
        "Work gloves"
    ],
    "text": " Cleaning the Heating Element on an Electric Water Heater Turn the power off going to your water heater. Check the electrical breaker box in your home and find the 2 circuits that control your water heater. Flip the switches to the off position so you don't get shocked when you're working. If you're unsure which circuits control the water heater, try turning off the circuits and testing the ports on your water heater with a multimeter. The readout should be 0 V. Shut off the water supply on your water heater. The valve controlling the water going into your heater should be on a pipe above or next to the unit. Turn the valve so the lever is perpendicular to the pipe. This prevents any water from entering the tank while you work on it. Drain the water heater completely. Locate the drain valve on at the bottom of your tank and secure the end of a garden hose to it. Put the other end of the hose next to a drain, such as one in your basement floor or in a bathtub. Open the drain valve on the bottom of your water heater with a screwdriver or channel lock pliers and let the tank drain completely. Most water heaters should have a drain next to them to catch any run-off.Warning: The water coming out of the hose could be very hot. Do not touch it or else you could get scalded by it. Open the access panel leading to the heating element. The access panel covers the thermostat and the heating element inside your water heater, and it is usually located on the side or near the bottom of the unit. Use a screwdriver to remove the access panel and set it aside. Some electric water heaters have 2 access panels on the top and the bottom each with their own heating element. Disconnect and label the wires connected to the heating element. The heating element is usually on the lower part of the access panel and will have 2 screws with red and black wires connecting to it. Loosen the screws with your screwdriver and pull the wires out. As you pull the wires, label which screws they were attached to with a piece of masking tape. Unscrew the heating element from the water heater. Secure a pair of channel lock pliers on the hexagonal nut behind the screws. Turn the heating element counterclockwise to loosen it. Continue unscrewing the heating element by hand until you can easily pull it out from your tank. Do not remove the heating element if you haven't drained the water from your tank. Water will come out and could burn you otherwise. Scrub the heating element with a wire brush. Over time, your heating element may collect calcium deposits from the water and make the unit less efficient. Set the heating element on a flat surface and scrape the coil with a stiff wire brush. Try to clean as much of the residue off as can. When you have one side of the coil clean, flip it over and scrub the other side. If you cannot get the heating element clean, you can order a replacement from the water heater's manufacturer. They usually cost around $35 USD. Reattach the heating element to your tank. Feed the coil back into the tank and start screwing the element back on by hand. Once the heating element is hand-tight, use your channel lock pliers to tighten the unit in place. Loop the wires around their matching screws before tightening them with a screwdriver. Your heating element should already have a seal on the threading to prevent leaks. If it doesn't wrap 5-6 layers of Teflon or plumber's tape around the threading. Turn on the power and water supply to use your tank again. Once the heating unit is back in place, flip the breakers to the on position so the water heater has power. Then, turn the water valve on so the lever points the same direction as the pipes. Once the tank is filled again, you should have hot water. If the water still isn't hot, check the wire connections to the heating element. If they're correct, then you may have a problem with the unit's thermostat. Replacing the Thermostat on an Electric Heater Turn off the power running to your water heater. Go to your home's electrical box and find the 2 breakers that control your water heater. Turn them to the off position so you don't accidentally shock yourself while you're replacing the thermostat. Open the access panel on the tank. The access panel is usually located on the side or near the bottom of your water heater. Use a screwdriver to remove the access panel's cover and set it aside. You should see the thermostat on the top of the access panel and the heating element near the bottom. Some electric water heaters have 2 access panels. Each of the access panels will have their own thermostat. Remove and label the wires connected to the thermostat. The thermostat looks like a black box with 2 black wires connecting to it. Use a screwdriver to loosen the screws on the thermostat and release the wires. When you get the wires loose, wrap a piece of masking tape around each one and label which screw they were attached to. If your wires are reattached to the wrong screws on your new thermostat, then your water heater will not work. Pull the thermostat out of the brackets. Hold the top of the thermostat with your dominant hand. Locate the retaining bracket on the bottom of the thermostat that holds it in place. Slide the end of a screwdriver behind the tab on the side of the bracket and gently pry it up to release the thermostat. Lift the tab on the other side of the thermostat so you can pull the unit out of the access panel. Be careful not to break the bracket that holds the thermostat in place since you cannot replace that component individually. Place an identical thermostat in its place. Make sure the thermostat is the exact same model as your old one or else it will not be compatible. Slide the thermostat into the access panel so it's behind the retaining bracket. Push the thermostat into place until it clicks. Order an identical thermostat from the water heater's manufacturer. They usually cost around $20 USD.Tip: If your water heater has 2 thermostats, make sure you get matching replacements for each of them. Reattach the wires to the matching screws. Once the thermostat is securely in place, bend hook shapes into the ends of each wire. Wrap the wire hook underneath the screw head that matches the wire's label. Tighten the screws so they have a firm connection with the wires. You can leave the labels on your wires if you want or you can remove them. Adjust the new thermostat to 120 °F (49 °C). The temperature is usually controlled with a screw or dial on the bottom of the thermostat. If it's a screw, use your screwdriver so the slit on the screw head points to 120 °F (49 °C). If your thermostat has a dial, turn it by hand to the right temperature. When you're finished, all you need to do is turn your power back on so your water heater works again! Avoid turning the thermostat higher than 120 °F (49 °C) since it could cause scalding water temperatures from your fixtures. Igniting a Pilot Light on a Gas Water Heater Remove the bottom panel on your water heater. The access panel on your gas water heater is found at the bottom of the tank. Use a screwdriver to remove the panel and set it aside while you're working. If the pilot light is out and you smell natural gas around your water heater, leave and call your utility company immediately since you may have a gas leak. Do not attempt to light the pilot light if you smell gas. Turn the dial on top to the thermostat to the PILOT position. The topmost dial on your water heater controls the power on your unit and should have the labels ON, OFF, and PILOT. Twist the dial by hand so it's on the PILOT position so the burner inside your water heater is turned off. Don't attempt to relight the pilot light while your water heater is still on. Reduce the heat as low as it can go. The large dial on the front of your thermostat controls the unit's temperature. Turn the dial clockwise to reduce your heat to the lowest temperature it can go. This help ensures you stay safe while you ignite your pilot light. Press the dial down and light the pilot with a safety lighter. Hold a safety lighter inside the bottom access panel so it lines up with the thin tube that connects to your thermostat. With the dial in the pilot position, press down on top of the dial until you hear it click. When the dial is pressed down, ignite your lighter to start your pilot light. Keep the dial held down for 30 seconds after the pilot is lit. Some water heaters have an ignitor button next to the dial. If your water heater has a pilot light button, you do not need to use a lighter. Switch the dial to the ON position. Release the dial so it clicks back up into place. Once the dial pops up, turn it toward the ON position to activate the burner. This will turn your water heater on so you have hot water throughout your home.Tip: If the dial doesn't pop up when you let go of it, turn off the unit for 5 minutes and try again. Adjust the water heater's temperature to 120 °F (49 °C). Turn the large dial in the front of your thermostat so it points at 120 °F (49 °C). The burner will activate and heat the water inside your tank. Don't turn the thermostat higher than 120 °F (49 °C) or else the water coming out of your fixtures may scald you. Changing the Thermostat on a Gas Heater Turn off the gas and water running to your water heater. The gas hose connects to the left side of your thermostat and the valve to turn it off will be located along the gas line. Turn the lever so it's perpendicular to the gas line. Then, locate the water valve on the pipe above or next to the heater and turn the lever so it's also perpendicular to the pipe. You don't need to turn off any power while working on a gas water heater. Drain the water from your water heater. Locate the drain valve on the bottom of your water heater's tank. Screw a garden hose onto the drain valve and feed the other end into a drain in the floor or to your bathtub. Open the drain valve with a screwdriver or channel lock pliers so the water empties from your tank. The water coming out of your hose will be very hot and could cause scalding-hot burns. Unscrew the lines attached to your thermostat. There should be 3 or 4 pipes that connect to the bottom of your thermostat. Use a pair of channel lock pliers to loosen the lines from your thermostat. Lightly pull the pipes away from the thermostat so they don't deform. The hose on the left side of your thermostat controls the gas intake. The pipes and lines on the bottom of the thermostat lead to the pilot and burner inside the unit. You can remove the lines while your water heater is still draining. Use a pipe wrench to remove the old thermostat. Grip the sides of your thermostat between the jaws of a pipe wrench. Turn the wrench counterclockwise to loosen the thermostat from the tank. Keep rotating the thermostat by hand until it's free from the tank. Don't unscrew the thermostat while there's still water inside since it could spill out. Seal the threading on your new thermostat with Teflon tape. Locate the threading on the back side of the thermostat that attaches to your tank. Wrap 5-6 layers of Teflon tape around the threading to seal it. Make sure you wrap your tape in the same direction as the way it's screwed in. Replacement thermostats can be bought online or directly from the water heater manufacturer, and they usually cost around $85-$90 USD. Teflon tape may also be called thread-seal or plumber's tape. Screw the new thermostat in its place. Once the thermostat is sealed, place the threading into the hole on your tank where the old thermostat used to be. Turn the thermostat clockwise to tighten it in place. When you can't tighten it by hand anymore, use your pipe wrench to secure it in place. Make sure the thermostat is right-side up when you're finished or else the dial will be upside down. Reattach the lines and pipes to the new thermostat. Use your channel lock pliers to secure the gas hose back onto the side of your thermostat. Then match the pilot and burner lines to the ports on the bottom of your thermostat and tighten them with your pliers. You do not need to seal the connections from the lines to your thermostat. Open the valves and start your thermostat. Reopen the gas and water valves leading to your water heater so it can start filling and warming up again. Relight the pilot light and turn your thermostat to 120 °F (49 °C) so you have hot water throughout your home.Warning: Don't turn your thermostat past 120 °F (49 °C) since it will cause scalding hot water to come out of your fixtures. Fixing a Leaky Pressure-Relief Valve Turn off the water supply to your water heater. Locate the water supply pipe above or next to your water heater. Turn the lever on the valve so it's perpendicular to the pipes. This prevents any more water from entering the tank while you're working on it. Drain 10 US gal (38 L) from your water heater. Attach a garden hose the drain valve on the bottom of your water heater's tank. Place the other end of the hose next to bath or floor drain. Open the valve with a screwdriver or pair of pliers and let it drain for about 15-30 minutes. Once about 10 US gal (38 L) are drained from the tank, close the drain valve and disconnect the hose. Many water heaters have a drain in the floor next to them. Detach the run-off pipe from the pressure-relief valve. The pressure-relief valve is located on top of your unit in the center. The valve should be attached to a pipe that leads down the side of your tank. Use a pair of channel lock pliers where the pipe connects to the valve. Rotate it counterclockwise to loosen it from the valve and remove it. Set the run-off pipe aside since you'll need to attach it to the new valve. Use channel lock pliers to unscrew the pressure-relief valve. Grip the base of the pressure-relief valve between the jaws of your channel lock pliers. Rotate the valve counterclockwise to loosen it, and then spin the valve by hand. Pull the valve out from the tank to remove it. The valve may release steam as you unscrew it. Keep your head away from the valve and wear work gloves while handling it. Seal the threads on a new pressure-relief valve with Teflon tape. Sealing the valve helps prevent any unwanted leaks through the threading. Wrap 5-6 layers of Teflon tape around the threading on your new valve in the same direction that it screws in. When you're finished wrapping it, cut the piece of tape. Pressure-relief valves can be purchased online or directly from the water heater's manufacturer for about $20 USD. Teflon tape may be called thread-seal or plumber's tape. Any of these will work for sealing your valve. Screw the new valve into your water heater. Place the threading of the valve in the hole where the old one used to be. Screw the valve in by hand as far as you can. Then, use your channel lock pliers to tighten the valve until you can't rotate it anymore. Keep the lever on top of your valve is horizontal when it's installed.Tip: Make sure the valve points in a direction where you can easily attach your run-off pipe. Reattach the run-off pipe to the valve. Fit the threading of the run-off pipe into the side of the valve so the pipe hangs over the edge of the water heater's tank. Turn the pipe clockwise to tighten it onto your valve. Use your channel lock pliers when you can't tighten the piper by hand any further. You may need to seal the run-off pipe with Teflon tape as well if it hasn't already been sealed. Turn on your water heater's water supply. Turn the lever on your water supply so that it's pointing the same direction as your pipe. The water supply will start to fill your tank so you can use hot water in your home again. Open a hot water faucet somewhere in your home. Pick any sink or fixture in your home and set it so the hot water is running. Nothing will come out of the faucet yet, but it will relive the pressure inside your tank so the valve is installed properly. Pull the lever open on the valve. After a faucet's been opened, pull the lever on top of your valve up to alleviate more pressure from inside the tank. Once the lever is open, you may notice some water going down the run-off pipe. Close the lever once a steady stream of water flows through the run-off pipe. As your water heats up, the pressure inside the tank will increase and water will be forced out of the pressure-relief valve. When you notice the stream coming out from your run-off pipe, close the valve so the lever is horizontal again. You can also turn off your water faucet once the stream is steady.",
    "sentences": [
        " Cleaning the Heating Element on an Electric Water Heater Turn the power off going to your water heater.",
        "Check the electrical breaker box in your home and find the 2 circuits that control your water heater.",
        "Flip the switches to the off position so you don't get shocked when you're working.",
        "If you're unsure which circuits control the water heater, try turning off the circuits and testing the ports on your water heater with a multimeter.",
        "The readout should be 0 V. Shut off the water supply on your water heater.",
        "The valve controlling the water going into your heater should be on a pipe above or next to the unit.",
        "Turn the valve so the lever is perpendicular to the pipe.",
        "This prevents any water from entering the tank while you work on it.",
        "Drain the water heater completely.",
        "Locate the drain valve on at the bottom of your tank and secure the end of a garden hose to it.",
        "Put the other end of the hose next to a drain, such as one in your basement floor or in a bathtub.",
        "Open the drain valve on the bottom of your water heater with a screwdriver or channel lock pliers and let the tank drain completely.",
        "Most water heaters should have a drain next to them to catch any run-off.Warning: The water coming out of the hose could be very hot.",
        "Do not touch it or else you could get scalded by it.",
        "Open the access panel leading to the heating element.",
        "The access panel covers the thermostat and the heating element inside your water heater, and it is usually located on the side or near the bottom of the unit.",
        "Use a screwdriver to remove the access panel and set it aside.",
        "Some electric water heaters have 2 access panels on the top and the bottom each with their own heating element.",
        "Disconnect and label the wires connected to the heating element.",
        "The heating element is usually on the lower part of the access panel and will have 2 screws with red and black wires connecting to it.",
        "Loosen the screws with your screwdriver and pull the wires out.",
        "As you pull the wires, label which screws they were attached to with a piece of masking tape.",
        "Unscrew the heating element from the water heater.",
        "Secure a pair of channel lock pliers on the hexagonal nut behind the screws.",
        "Turn the heating element counterclockwise to loosen it.",
        "Continue unscrewing the heating element by hand until you can easily pull it out from your tank.",
        "Do not remove the heating element if you haven't drained the water from your tank.",
        "Water will come out and could burn you otherwise.",
        "Scrub the heating element with a wire brush.",
        "Over time, your heating element may collect calcium deposits from the water and make the unit less efficient.",
        "Set the heating element on a flat surface and scrape the coil with a stiff wire brush.",
        "Try to clean as much of the residue off as can.",
        "When you have one side of the coil clean, flip it over and scrub the other side.",
        "If you cannot get the heating element clean, you can order a replacement from the water heater's manufacturer.",
        "They usually cost around $35 USD.",
        "Reattach the heating element to your tank.",
        "Feed the coil back into the tank and start screwing the element back on by hand.",
        "Once the heating element is hand-tight, use your channel lock pliers to tighten the unit in place.",
        "Loop the wires around their matching screws before tightening them with a screwdriver.",
        "Your heating element should already have a seal on the threading to prevent leaks.",
        "If it doesn't wrap 5-6 layers of Teflon or plumber's tape around the threading.",
        "Turn on the power and water supply to use your tank again.",
        "Once the heating unit is back in place, flip the breakers to the on position so the water heater has power.",
        "Then, turn the water valve on so the lever points the same direction as the pipes.",
        "Once the tank is filled again, you should have hot water.",
        "If the water still isn't hot, check the wire connections to the heating element.",
        "If they're correct, then you may have a problem with the unit's thermostat.",
        "Replacing the Thermostat on an Electric Heater Turn off the power running to your water heater.",
        "Go to your home's electrical box and find the 2 breakers that control your water heater.",
        "Turn them to the off position so you don't accidentally shock yourself while you're replacing the thermostat.",
        "Open the access panel on the tank.",
        "The access panel is usually located on the side or near the bottom of your water heater.",
        "Use a screwdriver to remove the access panel's cover and set it aside.",
        "You should see the thermostat on the top of the access panel and the heating element near the bottom.",
        "Some electric water heaters have 2 access panels.",
        "Each of the access panels will have their own thermostat.",
        "Remove and label the wires connected to the thermostat.",
        "The thermostat looks like a black box with 2 black wires connecting to it.",
        "Use a screwdriver to loosen the screws on the thermostat and release the wires.",
        "When you get the wires loose, wrap a piece of masking tape around each one and label which screw they were attached to.",
        "If your wires are reattached to the wrong screws on your new thermostat, then your water heater will not work.",
        "Pull the thermostat out of the brackets.",
        "Hold the top of the thermostat with your dominant hand.",
        "Locate the retaining bracket on the bottom of the thermostat that holds it in place.",
        "Slide the end of a screwdriver behind the tab on the side of the bracket and gently pry it up to release the thermostat.",
        "Lift the tab on the other side of the thermostat so you can pull the unit out of the access panel.",
        "Be careful not to break the bracket that holds the thermostat in place since you cannot replace that component individually.",
        "Place an identical thermostat in its place.",
        "Make sure the thermostat is the exact same model as your old one or else it will not be compatible.",
        "Slide the thermostat into the access panel so it's behind the retaining bracket.",
        "Push the thermostat into place until it clicks.",
        "Order an identical thermostat from the water heater's manufacturer.",
        "They usually cost around $20 USD.Tip: If your water heater has 2 thermostats, make sure you get matching replacements for each of them.",
        "Reattach the wires to the matching screws.",
        "Once the thermostat is securely in place, bend hook shapes into the ends of each wire.",
        "Wrap the wire hook underneath the screw head that matches the wire's label.",
        "Tighten the screws so they have a firm connection with the wires.",
        "You can leave the labels on your wires if you want or you can remove them.",
        "Adjust the new thermostat to 120 °F (49 °C).",
        "The temperature is usually controlled with a screw or dial on the bottom of the thermostat.",
        "If it's a screw, use your screwdriver so the slit on the screw head points to 120 °F (49 °C).",
        "If your thermostat has a dial, turn it by hand to the right temperature.",
        "When you're finished, all you need to do is turn your power back on so your water heater works again!",
        "Avoid turning the thermostat higher than 120 °F (49 °C) since it could cause scalding water temperatures from your fixtures.",
        "Igniting a Pilot Light on a Gas Water Heater Remove the bottom panel on your water heater.",
        "The access panel on your gas water heater is found at the bottom of the tank.",
        "Use a screwdriver to remove the panel and set it aside while you're working.",
        "If the pilot light is out and you smell natural gas around your water heater, leave and call your utility company immediately since you may have a gas leak.",
        "Do not attempt to light the pilot light if you smell gas.",
        "Turn the dial on top to the thermostat to the PILOT position.",
        "The topmost dial on your water heater controls the power on your unit and should have the labels ON, OFF, and PILOT.",
        "Twist the dial by hand so it's on the PILOT position so the burner inside your water heater is turned off.",
        "Don't attempt to relight the pilot light while your water heater is still on.",
        "Reduce the heat as low as it can go.",
        "The large dial on the front of your thermostat controls the unit's temperature.",
        "Turn the dial clockwise to reduce your heat to the lowest temperature it can go.",
        "This help ensures you stay safe while you ignite your pilot light.",
        "Press the dial down and light the pilot with a safety lighter.",
        "Hold a safety lighter inside the bottom access panel so it lines up with the thin tube that connects to your thermostat.",
        "With the dial in the pilot position, press down on top of the dial until you hear it click.",
        "When the dial is pressed down, ignite your lighter to start your pilot light.",
        "Keep the dial held down for 30 seconds after the pilot is lit.",
        "Some water heaters have an ignitor button next to the dial.",
        "If your water heater has a pilot light button, you do not need to use a lighter.",
        "Switch the dial to the ON position.",
        "Release the dial so it clicks back up into place.",
        "Once the dial pops up, turn it toward the ON position to activate the burner.",
        "This will turn your water heater on so you have hot water throughout your home.Tip: If the dial doesn't pop up when you let go of it, turn off the unit for 5 minutes and try again.",
        "Adjust the water heater's temperature to 120 °F (49 °C).",
        "Turn the large dial in the front of your thermostat so it points at 120 °F (49 °C).",
        "The burner will activate and heat the water inside your tank.",
        "Don't turn the thermostat higher than 120 °F (49 °C) or else the water coming out of your fixtures may scald you.",
        "Changing the Thermostat on a Gas Heater Turn off the gas and water running to your water heater.",
        "The gas hose connects to the left side of your thermostat and the valve to turn it off will be located along the gas line.",
        "Turn the lever so it's perpendicular to the gas line.",
        "Then, locate the water valve on the pipe above or next to the heater and turn the lever so it's also perpendicular to the pipe.",
        "You don't need to turn off any power while working on a gas water heater.",
        "Drain the water from your water heater.",
        "Locate the drain valve on the bottom of your water heater's tank.",
        "Screw a garden hose onto the drain valve and feed the other end into a drain in the floor or to your bathtub.",
        "Open the drain valve with a screwdriver or channel lock pliers so the water empties from your tank.",
        "The water coming out of your hose will be very hot and could cause scalding-hot burns.",
        "Unscrew the lines attached to your thermostat.",
        "There should be 3 or 4 pipes that connect to the bottom of your thermostat.",
        "Use a pair of channel lock pliers to loosen the lines from your thermostat.",
        "Lightly pull the pipes away from the thermostat so they don't deform.",
        "The hose on the left side of your thermostat controls the gas intake.",
        "The pipes and lines on the bottom of the thermostat lead to the pilot and burner inside the unit.",
        "You can remove the lines while your water heater is still draining.",
        "Use a pipe wrench to remove the old thermostat.",
        "Grip the sides of your thermostat between the jaws of a pipe wrench.",
        "Turn the wrench counterclockwise to loosen the thermostat from the tank.",
        "Keep rotating the thermostat by hand until it's free from the tank.",
        "Don't unscrew the thermostat while there's still water inside since it could spill out.",
        "Seal the threading on your new thermostat with Teflon tape.",
        "Locate the threading on the back side of the thermostat that attaches to your tank.",
        "Wrap 5-6 layers of Teflon tape around the threading to seal it.",
        "Make sure you wrap your tape in the same direction as the way it's screwed in.",
        "Replacement thermostats can be bought online or directly from the water heater manufacturer, and they usually cost around $85-$90 USD.",
        "Teflon tape may also be called thread-seal or plumber's tape.",
        "Screw the new thermostat in its place.",
        "Once the thermostat is sealed, place the threading into the hole on your tank where the old thermostat used to be.",
        "Turn the thermostat clockwise to tighten it in place.",
        "When you can't tighten it by hand anymore, use your pipe wrench to secure it in place.",
        "Make sure the thermostat is right-side up when you're finished or else the dial will be upside down.",
        "Reattach the lines and pipes to the new thermostat.",
        "Use your channel lock pliers to secure the gas hose back onto the side of your thermostat.",
        "Then match the pilot and burner lines to the ports on the bottom of your thermostat and tighten them with your pliers.",
        "You do not need to seal the connections from the lines to your thermostat.",
        "Open the valves and start your thermostat.",
        "Reopen the gas and water valves leading to your water heater so it can start filling and warming up again.",
        "Relight the pilot light and turn your thermostat to 120 °F (49 °C) so you have hot water throughout your home.Warning: Don't turn your thermostat past 120 °F (49 °C) since it will cause scalding hot water to come out of your fixtures.",
        "Fixing a Leaky Pressure-Relief Valve Turn off the water supply to your water heater.",
        "Locate the water supply pipe above or next to your water heater.",
        "Turn the lever on the valve so it's perpendicular to the pipes.",
        "This prevents any more water from entering the tank while you're working on it.",
        "Drain 10 US gal (38 L) from your water heater.",
        "Attach a garden hose the drain valve on the bottom of your water heater's tank.",
        "Place the other end of the hose next to bath or floor drain.",
        "Open the valve with a screwdriver or pair of pliers and let it drain for about 15-30 minutes.",
        "Once about 10 US gal (38 L) are drained from the tank, close the drain valve and disconnect the hose.",
        "Many water heaters have a drain in the floor next to them.",
        "Detach the run-off pipe from the pressure-relief valve.",
        "The pressure-relief valve is located on top of your unit in the center.",
        "The valve should be attached to a pipe that leads down the side of your tank.",
        "Use a pair of channel lock pliers where the pipe connects to the valve.",
        "Rotate it counterclockwise to loosen it from the valve and remove it.",
        "Set the run-off pipe aside since you'll need to attach it to the new valve.",
        "Use channel lock pliers to unscrew the pressure-relief valve.",
        "Grip the base of the pressure-relief valve between the jaws of your channel lock pliers.",
        "Rotate the valve counterclockwise to loosen it, and then spin the valve by hand.",
        "Pull the valve out from the tank to remove it.",
        "The valve may release steam as you unscrew it.",
        "Keep your head away from the valve and wear work gloves while handling it.",
        "Seal the threads on a new pressure-relief valve with Teflon tape.",
        "Sealing the valve helps prevent any unwanted leaks through the threading.",
        "Wrap 5-6 layers of Teflon tape around the threading on your new valve in the same direction that it screws in.",
        "When you're finished wrapping it, cut the piece of tape.",
        "Pressure-relief valves can be purchased online or directly from the water heater's manufacturer for about $20 USD.",
        "Teflon tape may be called thread-seal or plumber's tape.",
        "Any of these will work for sealing your valve.",
        "Screw the new valve into your water heater.",
        "Place the threading of the valve in the hole where the old one used to be.",
        "Screw the valve in by hand as far as you can.",
        "Then, use your channel lock pliers to tighten the valve until you can't rotate it anymore.",
        "Keep the lever on top of your valve is horizontal when it's installed.Tip: Make sure the valve points in a direction where you can easily attach your run-off pipe.",
        "Reattach the run-off pipe to the valve.",
        "Fit the threading of the run-off pipe into the side of the valve so the pipe hangs over the edge of the water heater's tank.",
        "Turn the pipe clockwise to tighten it onto your valve.",
        "Use your channel lock pliers when you can't tighten the piper by hand any further.",
        "You may need to seal the run-off pipe with Teflon tape as well if it hasn't already been sealed.",
        "Turn on your water heater's water supply.",
        "Turn the lever on your water supply so that it's pointing the same direction as your pipe.",
        "The water supply will start to fill your tank so you can use hot water in your home again.",
        "Open a hot water faucet somewhere in your home.",
        "Pick any sink or fixture in your home and set it so the hot water is running.",
        "Nothing will come out of the faucet yet, but it will relive the pressure inside your tank so the valve is installed properly.",
        "Pull the lever open on the valve.",
        "After a faucet's been opened, pull the lever on top of your valve up to alleviate more pressure from inside the tank.",
        "Once the lever is open, you may notice some water going down the run-off pipe.",
        "Close the lever once a steady stream of water flows through the run-off pipe.",
        "As your water heats up, the pressure inside the tank will increase and water will be forced out of the pressure-relief valve.",
        "When you notice the stream coming out from your run-off pipe, close the valve so the lever is horizontal again.",
        "You can also turn off your water faucet once the stream is steady."
    ]
}