{
    "title": "How to Do Glass Fusing",
    "url": "https://www.wikihow.com/Do-Glass-Fusing",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Glass and Stained Glass Projects",
        "Working with Glass"
    ],
    "parts": [
        {
            "name": "Preparing to Fuse",
            "steps": [
                {
                    "headline": "Gather the glass you want to use.",
                    "description": "If you’re using different types of glass, make sure they have the same coefficient of expansion (COE). Glasses with different COE’s will crack during the cooling process. To test the compatibility of two separate glasses, fuse two small pieces of them together and then let them cool. If you notice any cracks or evidence of stress in the glass, you know the two glasses have different COE’s."
                },
                {
                    "headline": "Clean your glass using a cleaning agent.",
                    "description": "Make sure the cleaning agent you use is designed specifically for glass. Spray your glass with the cleaner and wipe off any dirt, oil, dust, or residue on the glass with a clean towel. This will prevent your final product from looking spotted or foggy when it comes out of the kiln."
                },
                {
                    "headline": "Find a kiln to do your fusing in.",
                    "description": "Use a small kiln if you’re only planning on doing a few minor fusing projects. If you’re going to be using it a lot and you want to work on several projects at once, consider investing in a larger kiln. Whatever size you choose, make sure it has an accurate temperature monitor on the outside. Opt for a kiln that’s designed specifically for firing glass. If you can’t find a kiln designed for glass, you can use a kiln meant for ceramics, but the results might not be as good."
                },
                {
                    "headline": "Get a kiln shelf.",
                    "description": "Make sure it can withstand temperatures of up to 1700 degrees Fahrenheit (927 degrees Celsius). The kiln shelf is what you’ll set your glass on when you’re ready to fuse it in the kiln. You can find a kiln shelf online or at your local ceramics store."
                },
                {
                    "headline": "Choose a few slumping molds to shape your glass.",
                    "description": "Your molds should also be able to withstand high temperatures of up to 1700 degrees Fahrenheit (927 degrees Celsius) because you’ll be putting your glass on them and setting them in the kiln. The slumping molds you use will determine the shape of your glass after you fuse it in the kiln. Shop online or in-store to find molds that you like."
                },
                {
                    "headline": "Apply a glass separator to keep your glass from sticking when you fuse it.",
                    "description": "Use a fiber paper that can withstand high temperatures, or use a kiln primer and wash it off after it sets. Apply your glass separator of choice to your kiln shelf and any molds you plan on using so your glass comes off easily."
                },
                {
                    "headline": "Purchase the basic safety equipment.",
                    "description": "Get a pair of safety glasses and fusing gloves so you don’t injure yourself during the fusing process. Invest in some cheap dust masks to protect your lungs from dangerous dust and glass particles in the air. Shop for these items at your local hardware store or order them online."
                },
                {
                    "headline": "Get the necessary glass cutting tools.",
                    "description": "Use a quality glass cutter that has a comfortable grip. You’ll also need cutting pliers. There are three main types of cutting pliers:\nRunning pliers. Running pliers are used to apply pressure on the glass so score lines break evenly. Grozing pliers. Grozing pliers are used to chip away pieces of glass that you don’t want before you begin fusing. Breaking pliers. Breaking pliers are used to break glass apart along the lines you’ve scored."
                }
            ]
        },
        {
            "name": "Cutting Your Glass",
            "steps": [
                {
                    "headline": "Put on your safety gear.",
                    "description": "Make sure you’re wearing your gloves, goggles, and mask before you start cutting your glass. This will prevent avoidable injuries like cuts and stop pieces of glass from getting into your eyes."
                },
                {
                    "headline": "Use your glass cutter to create a score line.",
                    "description": "Once you know where you want to cut on your piece of glass, roll your glass cutter across the surface of the glass, creating a score line where you want the glass to break apart. Finding the right amount of pressure to use with your glass cutter might take a few tries. Too little pressure will cause the glass to break unevenly, while too much pressure will create chipped edges. Do a couple practice cuts on a spare piece of glass until you get a feel for the tool."
                },
                {
                    "headline": "Apply pressure to the glass to break, or “run”, the score.",
                    "description": "You can use pliers or your hands to apply the pressure to both sides of the score line. The glass should break in a clean line along the line you scored. Use the same method whether it's a curved or straight line you're running."
                },
                {
                    "headline": "Cut your glass into whatever shapes you want to fuse.",
                    "description": "Cut circles, squares, triangles, or whatever shapes you want to use in your design. Remember that you can stack your glass pieces and fuse them directly on the kiln shelf, or you can lay them over a slumping mold to create a three-dimensional piece."
                }
            ]
        },
        {
            "name": "Fusing Your Glass",
            "steps": [
                {
                    "headline": "Place the glass pieces you’ve cut on the kiln shelf.",
                    "description": "Arrange and stack them however you want them to look once they’re fused. Place the largest piece of glass on the bottom and stack the smaller pieces on top. Use a thin glue to keep your pieces in place if you’re having a hard time."
                },
                {
                    "headline": "Place the kiln shelf in the kiln.",
                    "description": "Place the shelf in one of the central slots in the kiln so it’s not too close to the top and not too close to the bottom. Try to leave a ¼ inch (6.35mm) between your glass design on the kiln shelf and the side of the kiln itself so your glass has room to expand."
                },
                {
                    "headline": "Turn on the kiln.",
                    "description": "The temperature you use to fire your glass in the kiln depends on the look you’re going for. Decide which kind of fuse -- tack or full -- you want to do. Consult your kiln manual for specific instructions on how to set a firing schedule."
                },
                {
                    "headline": "Do a tack fuse if you want the glass to retain its features.",
                    "description": "With a tack fuse, the edges of the glass will melt and round slightly, but any pieces stacked on top of one another will remain stacked. Fire your kiln to between 1350-1370 degrees Fahrenheit (around 738 degrees Celsius) for this fuse to form."
                },
                {
                    "headline": "Do a full fuse if you want the glass to melt into a single layer.",
                    "description": "Full-fused pieces have a smooth, flat surface. Program your kiln to reach around 1460-1470 degrees Fahrenheit (around 796 degrees Celsius) to achieve a full fuse."
                },
                {
                    "headline": "Wait for the kiln program to finish and let your glass cool.",
                    "description": "Don’t open the kiln until it’s cooled off below 100 degrees Fahrenheit (38 degrees Celsius). Opening the kiln prematurely can cause your glass to break, and you might burn yourself."
                },
                {
                    "headline": "Remove the kiln shelf and your glass from the kiln.",
                    "description": "Examine your piece and check for any cracks. If you find cracks, the types of glasses you fused might not have been compatible."
                },
                {
                    "headline": "Slump your fused glass over a mold to create a three-dimensional piece.",
                    "description": "If you want to fire your fused glass for a second time to make a piece with dimension, place it over one of your molds. Set your glass and the mold on the kiln shelf and place it back in the kiln. Consult your kiln manual and program the kiln to reach around 1225 degrees Fahrenheit (663 degrees Celsius). Let the kiln cool completely before you remove your glass."
                }
            ]
        }
    ],
    "tyn": [
        "Glass",
        "Glass cleaner",
        "Kiln",
        "Kiln shelf",
        "Slumping molds",
        "Glass separator",
        "Safety goggles",
        "Dust mask",
        "Safety gloves",
        "Pliers",
        "Glass cutter"
    ],
    "text": " Preparing to Fuse Gather the glass you want to use. If you’re using different types of glass, make sure they have the same coefficient of expansion (COE). Glasses with different COE’s will crack during the cooling process. To test the compatibility of two separate glasses, fuse two small pieces of them together and then let them cool. If you notice any cracks or evidence of stress in the glass, you know the two glasses have different COE’s. Clean your glass using a cleaning agent. Make sure the cleaning agent you use is designed specifically for glass. Spray your glass with the cleaner and wipe off any dirt, oil, dust, or residue on the glass with a clean towel. This will prevent your final product from looking spotted or foggy when it comes out of the kiln. Find a kiln to do your fusing in. Use a small kiln if you’re only planning on doing a few minor fusing projects. If you’re going to be using it a lot and you want to work on several projects at once, consider investing in a larger kiln. Whatever size you choose, make sure it has an accurate temperature monitor on the outside. Opt for a kiln that’s designed specifically for firing glass. If you can’t find a kiln designed for glass, you can use a kiln meant for ceramics, but the results might not be as good. Get a kiln shelf. Make sure it can withstand temperatures of up to 1700 degrees Fahrenheit (927 degrees Celsius). The kiln shelf is what you’ll set your glass on when you’re ready to fuse it in the kiln. You can find a kiln shelf online or at your local ceramics store. Choose a few slumping molds to shape your glass. Your molds should also be able to withstand high temperatures of up to 1700 degrees Fahrenheit (927 degrees Celsius) because you’ll be putting your glass on them and setting them in the kiln. The slumping molds you use will determine the shape of your glass after you fuse it in the kiln. Shop online or in-store to find molds that you like. Apply a glass separator to keep your glass from sticking when you fuse it. Use a fiber paper that can withstand high temperatures, or use a kiln primer and wash it off after it sets. Apply your glass separator of choice to your kiln shelf and any molds you plan on using so your glass comes off easily. Purchase the basic safety equipment. Get a pair of safety glasses and fusing gloves so you don’t injure yourself during the fusing process. Invest in some cheap dust masks to protect your lungs from dangerous dust and glass particles in the air. Shop for these items at your local hardware store or order them online. Get the necessary glass cutting tools. Use a quality glass cutter that has a comfortable grip. You’ll also need cutting pliers. There are three main types of cutting pliers:\nRunning pliers. Running pliers are used to apply pressure on the glass so score lines break evenly. Grozing pliers. Grozing pliers are used to chip away pieces of glass that you don’t want before you begin fusing. Breaking pliers. Breaking pliers are used to break glass apart along the lines you’ve scored. Cutting Your Glass Put on your safety gear. Make sure you’re wearing your gloves, goggles, and mask before you start cutting your glass. This will prevent avoidable injuries like cuts and stop pieces of glass from getting into your eyes. Use your glass cutter to create a score line. Once you know where you want to cut on your piece of glass, roll your glass cutter across the surface of the glass, creating a score line where you want the glass to break apart. Finding the right amount of pressure to use with your glass cutter might take a few tries. Too little pressure will cause the glass to break unevenly, while too much pressure will create chipped edges. Do a couple practice cuts on a spare piece of glass until you get a feel for the tool. Apply pressure to the glass to break, or “run”, the score. You can use pliers or your hands to apply the pressure to both sides of the score line. The glass should break in a clean line along the line you scored. Use the same method whether it's a curved or straight line you're running. Cut your glass into whatever shapes you want to fuse. Cut circles, squares, triangles, or whatever shapes you want to use in your design. Remember that you can stack your glass pieces and fuse them directly on the kiln shelf, or you can lay them over a slumping mold to create a three-dimensional piece. Fusing Your Glass Place the glass pieces you’ve cut on the kiln shelf. Arrange and stack them however you want them to look once they’re fused. Place the largest piece of glass on the bottom and stack the smaller pieces on top. Use a thin glue to keep your pieces in place if you’re having a hard time. Place the kiln shelf in the kiln. Place the shelf in one of the central slots in the kiln so it’s not too close to the top and not too close to the bottom. Try to leave a ¼ inch (6.35mm) between your glass design on the kiln shelf and the side of the kiln itself so your glass has room to expand. Turn on the kiln. The temperature you use to fire your glass in the kiln depends on the look you’re going for. Decide which kind of fuse -- tack or full -- you want to do. Consult your kiln manual for specific instructions on how to set a firing schedule. Do a tack fuse if you want the glass to retain its features. With a tack fuse, the edges of the glass will melt and round slightly, but any pieces stacked on top of one another will remain stacked. Fire your kiln to between 1350-1370 degrees Fahrenheit (around 738 degrees Celsius) for this fuse to form. Do a full fuse if you want the glass to melt into a single layer. Full-fused pieces have a smooth, flat surface. Program your kiln to reach around 1460-1470 degrees Fahrenheit (around 796 degrees Celsius) to achieve a full fuse. Wait for the kiln program to finish and let your glass cool. Don’t open the kiln until it’s cooled off below 100 degrees Fahrenheit (38 degrees Celsius). Opening the kiln prematurely can cause your glass to break, and you might burn yourself. Remove the kiln shelf and your glass from the kiln. Examine your piece and check for any cracks. If you find cracks, the types of glasses you fused might not have been compatible. Slump your fused glass over a mold to create a three-dimensional piece. If you want to fire your fused glass for a second time to make a piece with dimension, place it over one of your molds. Set your glass and the mold on the kiln shelf and place it back in the kiln. Consult your kiln manual and program the kiln to reach around 1225 degrees Fahrenheit (663 degrees Celsius). Let the kiln cool completely before you remove your glass.",
    "sentences": [
        " Preparing to Fuse Gather the glass you want to use.",
        "If you’re using different types of glass, make sure they have the same coefficient of expansion (COE).",
        "Glasses with different COE’s will crack during the cooling process.",
        "To test the compatibility of two separate glasses, fuse two small pieces of them together and then let them cool.",
        "If you notice any cracks or evidence of stress in the glass, you know the two glasses have different COE’s.",
        "Clean your glass using a cleaning agent.",
        "Make sure the cleaning agent you use is designed specifically for glass.",
        "Spray your glass with the cleaner and wipe off any dirt, oil, dust, or residue on the glass with a clean towel.",
        "This will prevent your final product from looking spotted or foggy when it comes out of the kiln.",
        "Find a kiln to do your fusing in.",
        "Use a small kiln if you’re only planning on doing a few minor fusing projects.",
        "If you’re going to be using it a lot and you want to work on several projects at once, consider investing in a larger kiln.",
        "Whatever size you choose, make sure it has an accurate temperature monitor on the outside.",
        "Opt for a kiln that’s designed specifically for firing glass.",
        "If you can’t find a kiln designed for glass, you can use a kiln meant for ceramics, but the results might not be as good.",
        "Get a kiln shelf.",
        "Make sure it can withstand temperatures of up to 1700 degrees Fahrenheit (927 degrees Celsius).",
        "The kiln shelf is what you’ll set your glass on when you’re ready to fuse it in the kiln.",
        "You can find a kiln shelf online or at your local ceramics store.",
        "Choose a few slumping molds to shape your glass.",
        "Your molds should also be able to withstand high temperatures of up to 1700 degrees Fahrenheit (927 degrees Celsius) because you’ll be putting your glass on them and setting them in the kiln.",
        "The slumping molds you use will determine the shape of your glass after you fuse it in the kiln.",
        "Shop online or in-store to find molds that you like.",
        "Apply a glass separator to keep your glass from sticking when you fuse it.",
        "Use a fiber paper that can withstand high temperatures, or use a kiln primer and wash it off after it sets.",
        "Apply your glass separator of choice to your kiln shelf and any molds you plan on using so your glass comes off easily.",
        "Purchase the basic safety equipment.",
        "Get a pair of safety glasses and fusing gloves so you don’t injure yourself during the fusing process.",
        "Invest in some cheap dust masks to protect your lungs from dangerous dust and glass particles in the air.",
        "Shop for these items at your local hardware store or order them online.",
        "Get the necessary glass cutting tools.",
        "Use a quality glass cutter that has a comfortable grip.",
        "You’ll also need cutting pliers.",
        "There are three main types of cutting pliers:\nRunning pliers.",
        "Running pliers are used to apply pressure on the glass so score lines break evenly.",
        "Grozing pliers.",
        "Grozing pliers are used to chip away pieces of glass that you don’t want before you begin fusing.",
        "Breaking pliers.",
        "Breaking pliers are used to break glass apart along the lines you’ve scored.",
        "Cutting Your Glass Put on your safety gear.",
        "Make sure you’re wearing your gloves, goggles, and mask before you start cutting your glass.",
        "This will prevent avoidable injuries like cuts and stop pieces of glass from getting into your eyes.",
        "Use your glass cutter to create a score line.",
        "Once you know where you want to cut on your piece of glass, roll your glass cutter across the surface of the glass, creating a score line where you want the glass to break apart.",
        "Finding the right amount of pressure to use with your glass cutter might take a few tries.",
        "Too little pressure will cause the glass to break unevenly, while too much pressure will create chipped edges.",
        "Do a couple practice cuts on a spare piece of glass until you get a feel for the tool.",
        "Apply pressure to the glass to break, or “run”, the score.",
        "You can use pliers or your hands to apply the pressure to both sides of the score line.",
        "The glass should break in a clean line along the line you scored.",
        "Use the same method whether it's a curved or straight line you're running.",
        "Cut your glass into whatever shapes you want to fuse.",
        "Cut circles, squares, triangles, or whatever shapes you want to use in your design.",
        "Remember that you can stack your glass pieces and fuse them directly on the kiln shelf, or you can lay them over a slumping mold to create a three-dimensional piece.",
        "Fusing Your Glass Place the glass pieces you’ve cut on the kiln shelf.",
        "Arrange and stack them however you want them to look once they’re fused.",
        "Place the largest piece of glass on the bottom and stack the smaller pieces on top.",
        "Use a thin glue to keep your pieces in place if you’re having a hard time.",
        "Place the kiln shelf in the kiln.",
        "Place the shelf in one of the central slots in the kiln so it’s not too close to the top and not too close to the bottom.",
        "Try to leave a ¼ inch (6.35mm) between your glass design on the kiln shelf and the side of the kiln itself so your glass has room to expand.",
        "Turn on the kiln.",
        "The temperature you use to fire your glass in the kiln depends on the look you’re going for.",
        "Decide which kind of fuse -- tack or full -- you want to do.",
        "Consult your kiln manual for specific instructions on how to set a firing schedule.",
        "Do a tack fuse if you want the glass to retain its features.",
        "With a tack fuse, the edges of the glass will melt and round slightly, but any pieces stacked on top of one another will remain stacked.",
        "Fire your kiln to between 1350-1370 degrees Fahrenheit (around 738 degrees Celsius) for this fuse to form.",
        "Do a full fuse if you want the glass to melt into a single layer.",
        "Full-fused pieces have a smooth, flat surface.",
        "Program your kiln to reach around 1460-1470 degrees Fahrenheit (around 796 degrees Celsius) to achieve a full fuse.",
        "Wait for the kiln program to finish and let your glass cool.",
        "Don’t open the kiln until it’s cooled off below 100 degrees Fahrenheit (38 degrees Celsius).",
        "Opening the kiln prematurely can cause your glass to break, and you might burn yourself.",
        "Remove the kiln shelf and your glass from the kiln.",
        "Examine your piece and check for any cracks.",
        "If you find cracks, the types of glasses you fused might not have been compatible.",
        "Slump your fused glass over a mold to create a three-dimensional piece.",
        "If you want to fire your fused glass for a second time to make a piece with dimension, place it over one of your molds.",
        "Set your glass and the mold on the kiln shelf and place it back in the kiln.",
        "Consult your kiln manual and program the kiln to reach around 1225 degrees Fahrenheit (663 degrees Celsius).",
        "Let the kiln cool completely before you remove your glass."
    ]
}