{
    "title": "How to Make a Bottle Watering Can",
    "url": "https://www.wikihow.com/Make-a-Bottle-Watering-Can",
    "category_hierarchy": [
        "Home and Garden",
        "DIY",
        "Plastic"
    ],
    "methods": [
        {
            "name": "Making a Basic Watering Can",
            "steps": [
                {
                    "headline": "Find a plastic bottle to use and remove the label.",
                    "description": "If the bottle is dirty on the inside, fill it with water, close the cap, and shake it, then pour the water out. Do this a few times until the bottle is clean inside. When you are done, peel off the label and remove any glue residue."
                },
                {
                    "headline": "Figure out the placement for the holes on the side of the bottle.",
                    "description": "Use a permanent marker to draw a square on the side of the bottle, just below where it starts to curve upward into a dome shape. You can also mask off the patch with masking tape. The square should be no longer than your finger."
                },
                {
                    "headline": "Use a nail or thumbtack to punch holes in the square.",
                    "description": "Space the holes as evenly as you can. You will need to make five rows of five holes each for a total of 25 holes. If the plastic is very thick, you can heat up the nail over a flame for about 10 seconds; hold the nail with a pair of pliers so that you don't burn yourself. Wiggle the nail to remove it from the bottle."
                },
                {
                    "headline": "Cut a pouring hole on the opposite side of the bottle.",
                    "description": "Rotate the bottle so that the holes are facing away from you. Draw a 1-inch (2.54-centimeter) U-shape on the side of the bottle. Have the top of the U touch the bottom of the bottle's dome. Cut the U shape out with a razor blade."
                },
                {
                    "headline": "Add designs, if desired.",
                    "description": "Your watering can is more or less finished, but you can make it look more interesting by decorating it. Draw some gardening-themed designs on it using permanent markers. You can also stick on some stickers instead, but be aware that they may fall off if they get too wet."
                },
                {
                    "headline": "Close the bottle tightly and fill it through the U-shaped hole.",
                    "description": "Fill the bottle until the water level reaches ½ to 1 inch (1.27 to 2.54 centimeters) below the bottom row of holes. If you want to, you can even add some water-soluble fertilizer to the water."
                },
                {
                    "headline": "Tilt the bottle over your plants to water them.",
                    "description": "Hold the bottle by the sides, then tilt it on its side. Keep the watering holes on the bottom and the pouring hole on the top. When you are done watering, tilt the bottle back upright. Refill the container as necessary."
                }
            ]
        },
        {
            "name": "Making a Large Watering Can",
            "steps": [
                {
                    "headline": "Choose a large bottle with a handle and a screw-on lid.",
                    "description": "Detergent jugs and milk jugs are great choices. Large water jugs and juice jugs may also work, as long as they have a handle. Most importantly, make sure that the lid screws on. A cap that you pop on and off will not work for this due to the water pressure."
                },
                {
                    "headline": "Clean out the bottle and remove any labels.",
                    "description": "This is especially important if you are recycling a detergent bottle. The easiest way to clean the bottle is to fill it partway with water, close the cap tightly, shake it, then pour the water out. When you are done, remove the label and any glue residue left behind."
                },
                {
                    "headline": "Punch holes into the cap with a nail.",
                    "description": "Keep the cap on the bottle. Use a nail to punch holes into the lid. You can also use a needle or thumbtack instead. Punch as many holes as you want. If the cap is too hard to pierce, heat the nail over a flame first. Hold the nail with a pair of pliers so that you don't scorch your fingers. If your bottle had a thick lid (ie: detergent bottle), use a drill and a ⅛-inch (0.32-centimeter) drill bit instead."
                },
                {
                    "headline": "Consider adding a hole above the handle.",
                    "description": "Do this with a drill and a ½-inch (1.27-centimeter) drill bit. This will help make the water flow smoother and help release pressure."
                },
                {
                    "headline": "Fill the bottle with water.",
                    "description": "Unscrew the cap, then fill the bottle with water from the sink or hose. Close the cap when you are done. How much you fill it depends on how much weight you are able to carry; the more you fill it, the heavier it will become. If you used a drill bit, you will need to rinse the bottle out first to get rid of any plastic dust."
                },
                {
                    "headline": "Use the watering can.",
                    "description": "Make sure that the cap is on tightly. Use the handle to carry the jug over to your plant. Use your other hand to hold the jug by the bottom and tilt the cap downward."
                }
            ]
        },
        {
            "name": "Making a Thumb-Controlled Watering Can",
            "steps": [
                {
                    "headline": "Find a large, plastic bottle or jug.",
                    "description": "You can use just about any type of bottle for this. A large jug without a handle will work just as well as a milk jug with a handle. You can even use a regular water bottle!"
                },
                {
                    "headline": "Clean out the bottle.",
                    "description": "Fill the bottle with water, then close the cap tightly. Shake the bottle, then pour the water out. Do this a few times until the water comes out clean. If there is a label, peel it away, then remove any residue."
                },
                {
                    "headline": "Drill a hole in the cap of your bottle.",
                    "description": "The size of the hole does not really matter, but it needs to be small enough so that you can cover it completely with your thumb. Something around 3/16-inch (0.48-centimeter) wide would be ideal, however. If you make the hole too big, you won't get a tight enough seal."
                },
                {
                    "headline": "Poke 6 to 15 small holes in the bottom of the bottle.",
                    "description": "If the bottle is made from soft plastic, you can do this with a nail or thumbtack. If the bottle is made from thicker plastic, you will need to use a drill and ⁄16 to ⁄8 inch (0.16 to 0.32 cm) drill bit."
                },
                {
                    "headline": "Fill the bottle in a bucket.",
                    "description": "Fill a large bucket with water. Place the cap on your bottle, then dunk the bottle into the water. Cover the cap hole tightly with your thumb then lift the bottle out. If your bucket is deeper than your bottle, dip the bottle only ¾ of the way. The bottle will only fill to the same water-level that's already in the bucket."
                },
                {
                    "headline": "Unplug the cap to water your plants.",
                    "description": "Carry the bottle to your plant, then lift your thumb away. This will release the pressure, and allow the water to flow out of the bottle. When you want to stop the water flow, simply cover the hole in the cap with your thumb."
                }
            ]
        }
    ],
    "tyn": [
        "Making a Basic Watering Can",
        "Plastic bottle",
        "Nail or thumbtack",
        "Permanent marker",
        "Sharp knife or razor blade",
        "Markers or stickers (optional)",
        "Making a Large Watering Can",
        "Empty jug with handle and screw-on lid",
        "Nail or electric drill",
        "Water",
        "Making a Thumb-Controlled Watering Can",
        "Plastic bottle with a cap",
        "Electric drill and drill bits",
        "Nail or thumbtack (optional)",
        "Bucket"
    ],
    "text": " Making a Basic Watering Can Find a plastic bottle to use and remove the label. If the bottle is dirty on the inside, fill it with water, close the cap, and shake it, then pour the water out. Do this a few times until the bottle is clean inside. When you are done, peel off the label and remove any glue residue. Figure out the placement for the holes on the side of the bottle. Use a permanent marker to draw a square on the side of the bottle, just below where it starts to curve upward into a dome shape. You can also mask off the patch with masking tape. The square should be no longer than your finger. Use a nail or thumbtack to punch holes in the square. Space the holes as evenly as you can. You will need to make five rows of five holes each for a total of 25 holes. If the plastic is very thick, you can heat up the nail over a flame for about 10 seconds; hold the nail with a pair of pliers so that you don't burn yourself. Wiggle the nail to remove it from the bottle. Cut a pouring hole on the opposite side of the bottle. Rotate the bottle so that the holes are facing away from you. Draw a 1-inch (2.54-centimeter) U-shape on the side of the bottle. Have the top of the U touch the bottom of the bottle's dome. Cut the U shape out with a razor blade. Add designs, if desired. Your watering can is more or less finished, but you can make it look more interesting by decorating it. Draw some gardening-themed designs on it using permanent markers. You can also stick on some stickers instead, but be aware that they may fall off if they get too wet. Close the bottle tightly and fill it through the U-shaped hole. Fill the bottle until the water level reaches ½ to 1 inch (1.27 to 2.54 centimeters) below the bottom row of holes. If you want to, you can even add some water-soluble fertilizer to the water. Tilt the bottle over your plants to water them. Hold the bottle by the sides, then tilt it on its side. Keep the watering holes on the bottom and the pouring hole on the top. When you are done watering, tilt the bottle back upright. Refill the container as necessary. Making a Large Watering Can Choose a large bottle with a handle and a screw-on lid. Detergent jugs and milk jugs are great choices. Large water jugs and juice jugs may also work, as long as they have a handle. Most importantly, make sure that the lid screws on. A cap that you pop on and off will not work for this due to the water pressure. Clean out the bottle and remove any labels. This is especially important if you are recycling a detergent bottle. The easiest way to clean the bottle is to fill it partway with water, close the cap tightly, shake it, then pour the water out. When you are done, remove the label and any glue residue left behind. Punch holes into the cap with a nail. Keep the cap on the bottle. Use a nail to punch holes into the lid. You can also use a needle or thumbtack instead. Punch as many holes as you want. If the cap is too hard to pierce, heat the nail over a flame first. Hold the nail with a pair of pliers so that you don't scorch your fingers. If your bottle had a thick lid (ie: detergent bottle), use a drill and a ⅛-inch (0.32-centimeter) drill bit instead. Consider adding a hole above the handle. Do this with a drill and a ½-inch (1.27-centimeter) drill bit. This will help make the water flow smoother and help release pressure. Fill the bottle with water. Unscrew the cap, then fill the bottle with water from the sink or hose. Close the cap when you are done. How much you fill it depends on how much weight you are able to carry; the more you fill it, the heavier it will become. If you used a drill bit, you will need to rinse the bottle out first to get rid of any plastic dust. Use the watering can. Make sure that the cap is on tightly. Use the handle to carry the jug over to your plant. Use your other hand to hold the jug by the bottom and tilt the cap downward. Making a Thumb-Controlled Watering Can Find a large, plastic bottle or jug. You can use just about any type of bottle for this. A large jug without a handle will work just as well as a milk jug with a handle. You can even use a regular water bottle! Clean out the bottle. Fill the bottle with water, then close the cap tightly. Shake the bottle, then pour the water out. Do this a few times until the water comes out clean. If there is a label, peel it away, then remove any residue. Drill a hole in the cap of your bottle. The size of the hole does not really matter, but it needs to be small enough so that you can cover it completely with your thumb. Something around 3/16-inch (0.48-centimeter) wide would be ideal, however. If you make the hole too big, you won't get a tight enough seal. Poke 6 to 15 small holes in the bottom of the bottle. If the bottle is made from soft plastic, you can do this with a nail or thumbtack. If the bottle is made from thicker plastic, you will need to use a drill and ⁄16 to ⁄8 inch (0.16 to 0.32 cm) drill bit. Fill the bottle in a bucket. Fill a large bucket with water. Place the cap on your bottle, then dunk the bottle into the water. Cover the cap hole tightly with your thumb then lift the bottle out. If your bucket is deeper than your bottle, dip the bottle only ¾ of the way. The bottle will only fill to the same water-level that's already in the bucket. Unplug the cap to water your plants. Carry the bottle to your plant, then lift your thumb away. This will release the pressure, and allow the water to flow out of the bottle. When you want to stop the water flow, simply cover the hole in the cap with your thumb.",
    "sentences": [
        " Making a Basic Watering Can Find a plastic bottle to use and remove the label.",
        "If the bottle is dirty on the inside, fill it with water, close the cap, and shake it, then pour the water out.",
        "Do this a few times until the bottle is clean inside.",
        "When you are done, peel off the label and remove any glue residue.",
        "Figure out the placement for the holes on the side of the bottle.",
        "Use a permanent marker to draw a square on the side of the bottle, just below where it starts to curve upward into a dome shape.",
        "You can also mask off the patch with masking tape.",
        "The square should be no longer than your finger.",
        "Use a nail or thumbtack to punch holes in the square.",
        "Space the holes as evenly as you can.",
        "You will need to make five rows of five holes each for a total of 25 holes.",
        "If the plastic is very thick, you can heat up the nail over a flame for about 10 seconds; hold the nail with a pair of pliers so that you don't burn yourself.",
        "Wiggle the nail to remove it from the bottle.",
        "Cut a pouring hole on the opposite side of the bottle.",
        "Rotate the bottle so that the holes are facing away from you.",
        "Draw a 1-inch (2.54-centimeter) U-shape on the side of the bottle.",
        "Have the top of the U touch the bottom of the bottle's dome.",
        "Cut the U shape out with a razor blade.",
        "Add designs, if desired.",
        "Your watering can is more or less finished, but you can make it look more interesting by decorating it.",
        "Draw some gardening-themed designs on it using permanent markers.",
        "You can also stick on some stickers instead, but be aware that they may fall off if they get too wet.",
        "Close the bottle tightly and fill it through the U-shaped hole.",
        "Fill the bottle until the water level reaches ½ to 1 inch (1.27 to 2.54 centimeters) below the bottom row of holes.",
        "If you want to, you can even add some water-soluble fertilizer to the water.",
        "Tilt the bottle over your plants to water them.",
        "Hold the bottle by the sides, then tilt it on its side.",
        "Keep the watering holes on the bottom and the pouring hole on the top.",
        "When you are done watering, tilt the bottle back upright.",
        "Refill the container as necessary.",
        "Making a Large Watering Can Choose a large bottle with a handle and a screw-on lid.",
        "Detergent jugs and milk jugs are great choices.",
        "Large water jugs and juice jugs may also work, as long as they have a handle.",
        "Most importantly, make sure that the lid screws on.",
        "A cap that you pop on and off will not work for this due to the water pressure.",
        "Clean out the bottle and remove any labels.",
        "This is especially important if you are recycling a detergent bottle.",
        "The easiest way to clean the bottle is to fill it partway with water, close the cap tightly, shake it, then pour the water out.",
        "When you are done, remove the label and any glue residue left behind.",
        "Punch holes into the cap with a nail.",
        "Keep the cap on the bottle.",
        "Use a nail to punch holes into the lid.",
        "You can also use a needle or thumbtack instead.",
        "Punch as many holes as you want.",
        "If the cap is too hard to pierce, heat the nail over a flame first.",
        "Hold the nail with a pair of pliers so that you don't scorch your fingers.",
        "If your bottle had a thick lid (ie: detergent bottle), use a drill and a ⅛-inch (0.32-centimeter) drill bit instead.",
        "Consider adding a hole above the handle.",
        "Do this with a drill and a ½-inch (1.27-centimeter) drill bit.",
        "This will help make the water flow smoother and help release pressure.",
        "Fill the bottle with water.",
        "Unscrew the cap, then fill the bottle with water from the sink or hose.",
        "Close the cap when you are done.",
        "How much you fill it depends on how much weight you are able to carry; the more you fill it, the heavier it will become.",
        "If you used a drill bit, you will need to rinse the bottle out first to get rid of any plastic dust.",
        "Use the watering can.",
        "Make sure that the cap is on tightly.",
        "Use the handle to carry the jug over to your plant.",
        "Use your other hand to hold the jug by the bottom and tilt the cap downward.",
        "Making a Thumb-Controlled Watering Can Find a large, plastic bottle or jug.",
        "You can use just about any type of bottle for this.",
        "A large jug without a handle will work just as well as a milk jug with a handle.",
        "You can even use a regular water bottle!",
        "Clean out the bottle.",
        "Fill the bottle with water, then close the cap tightly.",
        "Shake the bottle, then pour the water out.",
        "Do this a few times until the water comes out clean.",
        "If there is a label, peel it away, then remove any residue.",
        "Drill a hole in the cap of your bottle.",
        "The size of the hole does not really matter, but it needs to be small enough so that you can cover it completely with your thumb.",
        "Something around 3/16-inch (0.48-centimeter) wide would be ideal, however.",
        "If you make the hole too big, you won't get a tight enough seal.",
        "Poke 6 to 15 small holes in the bottom of the bottle.",
        "If the bottle is made from soft plastic, you can do this with a nail or thumbtack.",
        "If the bottle is made from thicker plastic, you will need to use a drill and ⁄16 to ⁄8 inch (0.16 to 0.32 cm) drill bit.",
        "Fill the bottle in a bucket.",
        "Fill a large bucket with water.",
        "Place the cap on your bottle, then dunk the bottle into the water.",
        "Cover the cap hole tightly with your thumb then lift the bottle out.",
        "If your bucket is deeper than your bottle, dip the bottle only ¾ of the way.",
        "The bottle will only fill to the same water-level that's already in the bucket.",
        "Unplug the cap to water your plants.",
        "Carry the bottle to your plant, then lift your thumb away.",
        "This will release the pressure, and allow the water to flow out of the bottle.",
        "When you want to stop the water flow, simply cover the hole in the cap with your thumb."
    ]
}