{
    "title": "How to Make Peppermint Toothpaste",
    "url": "https://www.wikihow.com/Make-Peppermint-Toothpaste",
    "category_hierarchy": [
        "Personal Care and Style",
        "Personal Hygiene"
    ],
    "methods": [
        {
            "name": "Making a Baking Soda-Based Toothpaste",
            "steps": [
                {
                    "headline": "Gather your ingredients.",
                    "description": "Baking soda has been a popular alternative to commercial toothpaste for its abrasiveness (which helps scrape off food and other accumulated particles in the mouth) as well as for its powerful cleansing properties. For this recipe you will need the following:\n1/4 cup baking soda\n1/4 teaspoon fine-grained sea salt\n20 drops peppermint essential oil (make sure you are using pure peppermint essential oil and not peppermint extract which is used for baking)\n20 drops of liquid stevia extract (or to taste)\n1-2 teaspoons of water (add to desired consistency)"
                },
                {
                    "headline": "Assemble your supplies.",
                    "description": "The process of making your own toothpaste is quite simple and you don’t need any special supplies to mix the ingredients together. Obtain a small bowl, fork, and a clean, dry jar with a tight-fitting lid to store the toothpaste in."
                },
                {
                    "headline": "Combine the baking soda and sea salt.",
                    "description": "Add the baking soda and sea salt into the bowl and then use the fork to mix the two ingredients together. Since they are both dry materials, don’t worry too much about the consistency, just be sure to mix the two thoroughly."
                },
                {
                    "headline": "Add in your wet ingredients.",
                    "description": "Start by adding in the peppermint essential oil, mashing it into the dry mixture with the fork. Then mix in the stevia and then finally water until you get your desired consistency. If you prefer a strong minty flavor, use all 20 drops of the peppermint oil. If you would like a more mild version, start with 10 drops and add more after tasting if desired. Add in the liquid stevia to taste as well. Mix thoroughly after adding 10 drops and if you prefer a sweeter version, add in the rest of the stevia. Finally, drizzle in the water a little at a time. Don’t expect the final product to have the exact same consistency as store bought toothpaste. Instead, aim for a damp paste that sticks together."
                },
                {
                    "headline": "Store your new toothpaste in the jar.",
                    "description": "When using your toothpaste, you can use a small spoon to scoop out a pea-sized amount onto your toothbrush or you can just directly dip your toothbrush into the jar."
                }
            ]
        },
        {
            "name": "Making a Coconut Oil-Based Toothpaste",
            "steps": [
                {
                    "headline": "Obtain your ingredients.",
                    "description": "Many people like to use coconut oil orally as it contains lauric acid which is an antimicrobial and therefore prevents tooth decay. Try out this recipe which combines the powers of both baking soda and coconut oil for maximum oral health, the natural way:\n3 tablespoons coconut oil\n3 tablespoons baking soda\n25 drops peppermint essential oil\n1 packet stevia"
                },
                {
                    "headline": "Gather your supplies.",
                    "description": "Since you are essentially just mixing all of the ingredients together, you don’t need many supplies. Get a small bowl, fork, and dry, clean jar with a tight fitting lid."
                },
                {
                    "headline": "Combine the coconut oil and baking soda in the bowl.",
                    "description": "Use the fork to mash the two together until they are well combined."
                },
                {
                    "headline": "Add the peppermint essential oil and stevia together.",
                    "description": "If you want a flavor that most emulates commercial toothpaste, add in the full amount of peppermint oil and toothpaste. However, if you want a milder flavor, you can start by putting in half the amount of what the recipe originally calls for and then add more to taste. If the mixture is lumpy or doesn’t stick together, be patient and combine all ingredients thoroughly. If you still aren’t getting a smooth consistency, add a tiny bit more coconut oil (a teaspoon or so) until you have a paste that sticks together."
                },
                {
                    "headline": "Store your new toothpaste in the jar.",
                    "description": "When using your toothpaste, you can use a small spoon to scoop out a pea-sized amount onto your toothbrush or you can just directly dip your toothbrush into the jar."
                }
            ]
        },
        {
            "name": "Making a Bentonite Clay-Based Toothpaste",
            "steps": [
                {
                    "headline": "Gather your ingredients.",
                    "description": "This recipe calls for some more unusual ingredients, but bentonite clay has many benefits, including the ability to draw toxins out of the mouth and remineralize teeth. A well-stocked health food store should have all the following ingredients for making your own bentonite clay based toothpaste:\n4 tablespoons bentonite clay\n3 teaspoons xylitol or 1 tsp stevia (or to taste)\n¼ teaspoon sea salt, finely ground\n2-3 tablespoons water (adjust to desired consistency)\n20 drops of peppermint oil"
                },
                {
                    "headline": "Gather your supplies.",
                    "description": "Bentonite clay loses its effectiveness when it comes in contact with any kind of metal so gather a metal-free bowl, fork, and jar. Plastic utensils are a fine alternative to metal forks."
                },
                {
                    "headline": "Mix all ingredients together.",
                    "description": "Use the fork to thoroughly combine all the ingredients in your bowl. It is recommended to add the dry ingredients first and then add the wet ingredients a little at a time so that you can taste it and tailor the flavorings to your preferences."
                },
                {
                    "headline": "Store your new toothpaste in a metal free jar.",
                    "description": "You can even use a small Tupperware container if desired. To use the toothpaste, you can dip toothbrush in and scrape small amount onto the bristle or you can also use a spoon to apply it onto the toothbrush."
                }
            ]
        }
    ],
    "tyn": [
        "Individual recipe ingredients",
        "Mixing bowl",
        "Spoon",
        "Storage jar (sanitized)"
    ],
    "text": " Making a Baking Soda-Based Toothpaste Gather your ingredients. Baking soda has been a popular alternative to commercial toothpaste for its abrasiveness (which helps scrape off food and other accumulated particles in the mouth) as well as for its powerful cleansing properties. For this recipe you will need the following:\n1/4 cup baking soda\n1/4 teaspoon fine-grained sea salt\n20 drops peppermint essential oil (make sure you are using pure peppermint essential oil and not peppermint extract which is used for baking)\n20 drops of liquid stevia extract (or to taste)\n1-2 teaspoons of water (add to desired consistency) Assemble your supplies. The process of making your own toothpaste is quite simple and you don’t need any special supplies to mix the ingredients together. Obtain a small bowl, fork, and a clean, dry jar with a tight-fitting lid to store the toothpaste in. Combine the baking soda and sea salt. Add the baking soda and sea salt into the bowl and then use the fork to mix the two ingredients together. Since they are both dry materials, don’t worry too much about the consistency, just be sure to mix the two thoroughly. Add in your wet ingredients. Start by adding in the peppermint essential oil, mashing it into the dry mixture with the fork. Then mix in the stevia and then finally water until you get your desired consistency. If you prefer a strong minty flavor, use all 20 drops of the peppermint oil. If you would like a more mild version, start with 10 drops and add more after tasting if desired. Add in the liquid stevia to taste as well. Mix thoroughly after adding 10 drops and if you prefer a sweeter version, add in the rest of the stevia. Finally, drizzle in the water a little at a time. Don’t expect the final product to have the exact same consistency as store bought toothpaste. Instead, aim for a damp paste that sticks together. Store your new toothpaste in the jar. When using your toothpaste, you can use a small spoon to scoop out a pea-sized amount onto your toothbrush or you can just directly dip your toothbrush into the jar. Making a Coconut Oil-Based Toothpaste Obtain your ingredients. Many people like to use coconut oil orally as it contains lauric acid which is an antimicrobial and therefore prevents tooth decay. Try out this recipe which combines the powers of both baking soda and coconut oil for maximum oral health, the natural way:\n3 tablespoons coconut oil\n3 tablespoons baking soda\n25 drops peppermint essential oil\n1 packet stevia Gather your supplies. Since you are essentially just mixing all of the ingredients together, you don’t need many supplies. Get a small bowl, fork, and dry, clean jar with a tight fitting lid. Combine the coconut oil and baking soda in the bowl. Use the fork to mash the two together until they are well combined. Add the peppermint essential oil and stevia together. If you want a flavor that most emulates commercial toothpaste, add in the full amount of peppermint oil and toothpaste. However, if you want a milder flavor, you can start by putting in half the amount of what the recipe originally calls for and then add more to taste. If the mixture is lumpy or doesn’t stick together, be patient and combine all ingredients thoroughly. If you still aren’t getting a smooth consistency, add a tiny bit more coconut oil (a teaspoon or so) until you have a paste that sticks together. Store your new toothpaste in the jar. When using your toothpaste, you can use a small spoon to scoop out a pea-sized amount onto your toothbrush or you can just directly dip your toothbrush into the jar. Making a Bentonite Clay-Based Toothpaste Gather your ingredients. This recipe calls for some more unusual ingredients, but bentonite clay has many benefits, including the ability to draw toxins out of the mouth and remineralize teeth. A well-stocked health food store should have all the following ingredients for making your own bentonite clay based toothpaste:\n4 tablespoons bentonite clay\n3 teaspoons xylitol or 1 tsp stevia (or to taste)\n¼ teaspoon sea salt, finely ground\n2-3 tablespoons water (adjust to desired consistency)\n20 drops of peppermint oil Gather your supplies. Bentonite clay loses its effectiveness when it comes in contact with any kind of metal so gather a metal-free bowl, fork, and jar. Plastic utensils are a fine alternative to metal forks. Mix all ingredients together. Use the fork to thoroughly combine all the ingredients in your bowl. It is recommended to add the dry ingredients first and then add the wet ingredients a little at a time so that you can taste it and tailor the flavorings to your preferences. Store your new toothpaste in a metal free jar. You can even use a small Tupperware container if desired. To use the toothpaste, you can dip toothbrush in and scrape small amount onto the bristle or you can also use a spoon to apply it onto the toothbrush.",
    "sentences": [
        " Making a Baking Soda-Based Toothpaste Gather your ingredients.",
        "Baking soda has been a popular alternative to commercial toothpaste for its abrasiveness (which helps scrape off food and other accumulated particles in the mouth) as well as for its powerful cleansing properties.",
        "For this recipe you will need the following:\n1/4 cup baking soda\n1/4 teaspoon fine-grained sea salt\n20 drops peppermint essential oil (make sure you are using pure peppermint essential oil and not peppermint extract which is used for baking)\n20 drops of liquid stevia extract (or to taste)\n1-2 teaspoons of water (add to desired consistency) Assemble your supplies.",
        "The process of making your own toothpaste is quite simple and you don’t need any special supplies to mix the ingredients together.",
        "Obtain a small bowl, fork, and a clean, dry jar with a tight-fitting lid to store the toothpaste in.",
        "Combine the baking soda and sea salt.",
        "Add the baking soda and sea salt into the bowl and then use the fork to mix the two ingredients together.",
        "Since they are both dry materials, don’t worry too much about the consistency, just be sure to mix the two thoroughly.",
        "Add in your wet ingredients.",
        "Start by adding in the peppermint essential oil, mashing it into the dry mixture with the fork.",
        "Then mix in the stevia and then finally water until you get your desired consistency.",
        "If you prefer a strong minty flavor, use all 20 drops of the peppermint oil.",
        "If you would like a more mild version, start with 10 drops and add more after tasting if desired.",
        "Add in the liquid stevia to taste as well.",
        "Mix thoroughly after adding 10 drops and if you prefer a sweeter version, add in the rest of the stevia.",
        "Finally, drizzle in the water a little at a time.",
        "Don’t expect the final product to have the exact same consistency as store bought toothpaste.",
        "Instead, aim for a damp paste that sticks together.",
        "Store your new toothpaste in the jar.",
        "When using your toothpaste, you can use a small spoon to scoop out a pea-sized amount onto your toothbrush or you can just directly dip your toothbrush into the jar.",
        "Making a Coconut Oil-Based Toothpaste Obtain your ingredients.",
        "Many people like to use coconut oil orally as it contains lauric acid which is an antimicrobial and therefore prevents tooth decay.",
        "Try out this recipe which combines the powers of both baking soda and coconut oil for maximum oral health, the natural way:\n3 tablespoons coconut oil\n3 tablespoons baking soda\n25 drops peppermint essential oil\n1 packet stevia Gather your supplies.",
        "Since you are essentially just mixing all of the ingredients together, you don’t need many supplies.",
        "Get a small bowl, fork, and dry, clean jar with a tight fitting lid.",
        "Combine the coconut oil and baking soda in the bowl.",
        "Use the fork to mash the two together until they are well combined.",
        "Add the peppermint essential oil and stevia together.",
        "If you want a flavor that most emulates commercial toothpaste, add in the full amount of peppermint oil and toothpaste.",
        "However, if you want a milder flavor, you can start by putting in half the amount of what the recipe originally calls for and then add more to taste.",
        "If the mixture is lumpy or doesn’t stick together, be patient and combine all ingredients thoroughly.",
        "If you still aren’t getting a smooth consistency, add a tiny bit more coconut oil (a teaspoon or so) until you have a paste that sticks together.",
        "Store your new toothpaste in the jar.",
        "When using your toothpaste, you can use a small spoon to scoop out a pea-sized amount onto your toothbrush or you can just directly dip your toothbrush into the jar.",
        "Making a Bentonite Clay-Based Toothpaste Gather your ingredients.",
        "This recipe calls for some more unusual ingredients, but bentonite clay has many benefits, including the ability to draw toxins out of the mouth and remineralize teeth.",
        "A well-stocked health food store should have all the following ingredients for making your own bentonite clay based toothpaste:\n4 tablespoons bentonite clay\n3 teaspoons xylitol or 1 tsp stevia (or to taste)\n¼ teaspoon sea salt, finely ground\n2-3 tablespoons water (adjust to desired consistency)\n20 drops of peppermint oil Gather your supplies.",
        "Bentonite clay loses its effectiveness when it comes in contact with any kind of metal so gather a metal-free bowl, fork, and jar.",
        "Plastic utensils are a fine alternative to metal forks.",
        "Mix all ingredients together.",
        "Use the fork to thoroughly combine all the ingredients in your bowl.",
        "It is recommended to add the dry ingredients first and then add the wet ingredients a little at a time so that you can taste it and tailor the flavorings to your preferences.",
        "Store your new toothpaste in a metal free jar.",
        "You can even use a small Tupperware container if desired.",
        "To use the toothpaste, you can dip toothbrush in and scrape small amount onto the bristle or you can also use a spoon to apply it onto the toothbrush."
    ]
}