{
    "title": "How to Make a Reindeer Pop up Card (Robert Sabuda Method)",
    "url": "https://www.wikihow.com/Make-a-Reindeer-Pop-up-Card-(Robert-Sabuda-Method)",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Paper Craft",
        "Homemade Cards",
        "Pop Up Cards"
    ],
    "steps": [
        {
            "headline": "Press along the dotted line on the center of the card with the rounded end of a paper clip (or a ballpoint pen that has run out of ink), using a ruler as a guide.",
            "description": ""
        },
        {
            "headline": "Use the same ruler and pen as in the previous step and press along the dotted lines of all the pop-up pieces.",
            "description": ""
        },
        {
            "headline": "Carefully cut out the card following the solid, black lines.<",
            "description": ""
        },
        {
            "headline": "Cut out the reindeer pieces just as carefully, following the solid, black lines.",
            "description": "Cut with extra care around the antlers––they're tricky."
        },
        {
            "headline": "Fold the antler piece with both sides away from you so the center dotted line comes up towards you.",
            "description": "Crease well."
        },
        {
            "headline": "Gently take hold of the small right tab at the bottom of the antler piece.",
            "description": "Fold it up, creasing well. Release the tab and put it back into its original position."
        },
        {
            "headline": "Repeat the previous two steps with the left tab.",
            "description": "Set the antlers aside."
        },
        {
            "headline": "Place the reindeer's head on a flat surface and take hold of the small tab at the top.",
            "description": "Fold it against the reindeer's head, creasing well. Release the tab and put it back into its original position."
        },
        {
            "headline": "Fold the right side of the reindeer's head over to the left, creasing it well.",
            "description": "Return the right side to its original position."
        },
        {
            "headline": "Fold the head down towards the body, creasing well.",
            "description": "Return the head to its original position"
        },
        {
            "headline": "Fold the reindeer's body so that both sides fold away from you and the center dotted line comes up towards you.",
            "description": "Crease well."
        },
        {
            "headline": "Fold up the small right tab at the bottom of the reindeer's body and crease well.",
            "description": "Return the tab to its original position. Fold up the left tab, crease and return to its original position."
        },
        {
            "headline": "Apply a small amount of glue to the tab at the top of the reindeer's head.",
            "description": ""
        },
        {
            "headline": "Fold the tab up and over to the back of the reindeer's body and press together until the glue dries.",
            "description": ""
        },
        {
            "headline": "Fold the card in half along the center dotted line, creasing well.",
            "description": ""
        },
        {
            "headline": "Turn the antlers over so no dotted lines are visible.",
            "description": "Apply a small amount of glue to each tab at the bottom."
        },
        {
            "headline": "Turn the antlers back over so the dotted lines are visible.",
            "description": "Using the guides on the card, align the antlers and press down into position allowing the glue to dry completely. The antlers should lay perfectly flat on the card."
        },
        {
            "headline": "Turn the reindeer's body over so no dotted lines are visible and apply a small amount of glue to each tab at the bottom.",
            "description": ""
        },
        {
            "headline": "Turn the reindeer's body back over so the dotted lines are visible.",
            "description": "Using the guides on the card, align the body and press down into position allowing the glue to dry (be patient)."
        },
        {
            "headline": "Wait until after the glue has dried, and carefully begin to close the card.",
            "description": "If the pieces need a little assistance folding back into the card, use your fingers to help."
        },
        {
            "headline": "Your pop-up reindeer is ready to decorate.",
            "description": "Choose colors that reflect the season. Done. The card is now ready to send."
        }
    ],
    "tyn": [
        "Construction paper or heavy or cardstock paper",
        "Ruler",
        "Glue",
        "Ballpoint pen without ink in it or stylus",
        "Scissors",
        "Art supplies of choice to decorate finished card"
    ],
    "text": " Press along the dotted line on the center of the card with the rounded end of a paper clip (or a ballpoint pen that has run out of ink), using a ruler as a guide.  Use the same ruler and pen as in the previous step and press along the dotted lines of all the pop-up pieces.  Carefully cut out the card following the solid, black lines.<  Cut out the reindeer pieces just as carefully, following the solid, black lines. Cut with extra care around the antlers––they're tricky. Fold the antler piece with both sides away from you so the center dotted line comes up towards you. Crease well. Gently take hold of the small right tab at the bottom of the antler piece. Fold it up, creasing well. Release the tab and put it back into its original position. Repeat the previous two steps with the left tab. Set the antlers aside. Place the reindeer's head on a flat surface and take hold of the small tab at the top. Fold it against the reindeer's head, creasing well. Release the tab and put it back into its original position. Fold the right side of the reindeer's head over to the left, creasing it well. Return the right side to its original position. Fold the head down towards the body, creasing well. Return the head to its original position Fold the reindeer's body so that both sides fold away from you and the center dotted line comes up towards you. Crease well. Fold up the small right tab at the bottom of the reindeer's body and crease well. Return the tab to its original position. Fold up the left tab, crease and return to its original position. Apply a small amount of glue to the tab at the top of the reindeer's head.  Fold the tab up and over to the back of the reindeer's body and press together until the glue dries.  Fold the card in half along the center dotted line, creasing well.  Turn the antlers over so no dotted lines are visible. Apply a small amount of glue to each tab at the bottom. Turn the antlers back over so the dotted lines are visible. Using the guides on the card, align the antlers and press down into position allowing the glue to dry completely. The antlers should lay perfectly flat on the card. Turn the reindeer's body over so no dotted lines are visible and apply a small amount of glue to each tab at the bottom.  Turn the reindeer's body back over so the dotted lines are visible. Using the guides on the card, align the body and press down into position allowing the glue to dry (be patient). Wait until after the glue has dried, and carefully begin to close the card. If the pieces need a little assistance folding back into the card, use your fingers to help. Your pop-up reindeer is ready to decorate. Choose colors that reflect the season. Done. The card is now ready to send.",
    "sentences": [
        " Press along the dotted line on the center of the card with the rounded end of a paper clip (or a ballpoint pen that has run out of ink), using a ruler as a guide.",
        "Use the same ruler and pen as in the previous step and press along the dotted lines of all the pop-up pieces.",
        "Carefully cut out the card following the solid, black lines.<  Cut out the reindeer pieces just as carefully, following the solid, black lines.",
        "Cut with extra care around the antlers––they're tricky.",
        "Fold the antler piece with both sides away from you so the center dotted line comes up towards you.",
        "Crease well.",
        "Gently take hold of the small right tab at the bottom of the antler piece.",
        "Fold it up, creasing well.",
        "Release the tab and put it back into its original position.",
        "Repeat the previous two steps with the left tab.",
        "Set the antlers aside.",
        "Place the reindeer's head on a flat surface and take hold of the small tab at the top.",
        "Fold it against the reindeer's head, creasing well.",
        "Release the tab and put it back into its original position.",
        "Fold the right side of the reindeer's head over to the left, creasing it well.",
        "Return the right side to its original position.",
        "Fold the head down towards the body, creasing well.",
        "Return the head to its original position Fold the reindeer's body so that both sides fold away from you and the center dotted line comes up towards you.",
        "Crease well.",
        "Fold up the small right tab at the bottom of the reindeer's body and crease well.",
        "Return the tab to its original position.",
        "Fold up the left tab, crease and return to its original position.",
        "Apply a small amount of glue to the tab at the top of the reindeer's head.",
        "Fold the tab up and over to the back of the reindeer's body and press together until the glue dries.",
        "Fold the card in half along the center dotted line, creasing well.",
        "Turn the antlers over so no dotted lines are visible.",
        "Apply a small amount of glue to each tab at the bottom.",
        "Turn the antlers back over so the dotted lines are visible.",
        "Using the guides on the card, align the antlers and press down into position allowing the glue to dry completely.",
        "The antlers should lay perfectly flat on the card.",
        "Turn the reindeer's body over so no dotted lines are visible and apply a small amount of glue to each tab at the bottom.",
        "Turn the reindeer's body back over so the dotted lines are visible.",
        "Using the guides on the card, align the body and press down into position allowing the glue to dry (be patient).",
        "Wait until after the glue has dried, and carefully begin to close the card.",
        "If the pieces need a little assistance folding back into the card, use your fingers to help.",
        "Your pop-up reindeer is ready to decorate.",
        "Choose colors that reflect the season.",
        "Done.",
        "The card is now ready to send."
    ]
}