{
    "title": "How to Cook Collard Greens",
    "url": "https://www.wikihow.com/Cook-Collard-Greens",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables"
    ],
    "methods": [
        {
            "name": "Preparing the Greens",
            "steps": [
                {
                    "headline": "Remove the stem from the bunch.",
                    "description": "Use your non-dominant hand to hold the leaves together. With your dominant hand, cut about 1 inch (2.5 cm) from the bottom of the stem, separating the leaves."
                },
                {
                    "headline": "Soak the leaves in water.",
                    "description": "Place the collard greens in a large bowl and cover them with warm water. Add a little salt to the water. Salt is abrasive and helps in the process of scrubbing away dirt and impurities. Gently scrub the leaves with your hands and rinse."
                },
                {
                    "headline": "Cut out the spine from each leaf.",
                    "description": "Lay each leaf out flat on the counter. Use a sharp knife to cut along the spine on each side, separating the leaf into two parts and completely removing the spine. Stack the leaves so the flat, cut sides all line up."
                },
                {
                    "headline": "Roll the stack of leaves lengthwise.",
                    "description": "You may need to form several stacks to get tight rolls."
                },
                {
                    "headline": "Cut the greens into ribbons.",
                    "description": "Slice each roll into 1 inch (2.5 cm) pieces. Separate the pieces with your fingers, letting them unravel into long strips."
                }
            ]
        },
        {
            "name": "Sautéed",
            "steps": [
                {
                    "headline": "Heat the oil in a large, heavy skillet.",
                    "description": "Use medium-high heat, and continue heating 1 tbsp. of olive oil until the oil easily glides over the entire bottom of the pan."
                },
                {
                    "headline": "Cook the minced garlic.",
                    "description": "Add 2 tbsp. of minced garlic to the hot oil and move it around with a spatula, keeping it moving to prevent it from burning. Continue cooking for about 20 seconds, until the garlic begins to change in color to a deeper yellow or light tan."
                },
                {
                    "headline": "Add the strips of collard greens.",
                    "description": "It is better to add all the greens at once than to do so in batches to ensure that all the greens get the same amount of heat, oil, and garlic. Add the strips and stir with your spatula, making sure that all the greens are coated in oil."
                },
                {
                    "headline": "Sprinkle the greens with spicy peppers and salt.",
                    "description": "Add 1/2 tsp. of crushed red pepper or jalapeños and 1/4 tsp. of salt to the collard greens. Wait approximately 30 seconds and toss the greens again with your spatula to mix the seasonings into the rest of the greens. Mix thoroughly, moving the top to the bottom and the greens on the bottom to the top, several times, to ensure the greens are evenly mixed."
                },
                {
                    "headline": "Continue cooking and stirring over medium-high heat.",
                    "description": "Use your spatula and continue tossing the shreds of collard greens. Do not let it sit for long without movement. Moving the greens around is the only way to ensure the greens are evenly heated and evenly cooked."
                },
                {
                    "headline": "Stop cooking once the leaves are slightly wilted.",
                    "description": "The greens should still be bright green, however. Turn off the stove and remove the pan from the heating element."
                },
                {
                    "headline": "Add one tbsp of vinegar.",
                    "description": "Red wine vinegar or cider vinegar would also work if you do not have balsamic vinegar available. Drizzle the vinegar over the greens and toss again to coat."
                },
                {
                    "headline": "Serve hot.",
                    "description": "The greens can also be enjoyed at room temperature."
                }
            ]
        },
        {
            "name": "Fried",
            "steps": [
                {
                    "headline": "Place the collard green leaves in a pot.",
                    "description": "The stems should already be removed from the bunches and the spines should be removed from the leaves."
                },
                {
                    "headline": "Cover the greens with cold water for 3-5 minutes.",
                    "description": "Allow them to soak fully."
                },
                {
                    "headline": "Dissolve 1 tbsp.",
                    "description": "of table salt in the water. Stir it in well."
                },
                {
                    "headline": "Drain the leaves and remove them from the sink.",
                    "description": ""
                },
                {
                    "headline": "Wash the collard greens at least two more times.",
                    "description": "Repeating this process twice will fully clean the collard greens."
                },
                {
                    "headline": "Fry 5 slices of bacon in a pot over medium heat.",
                    "description": "Fry the bacon until it is nice and crisp. Then, remove the cooked bacon, crumble it, and set it aside, leaving the bacon drippings in the pot."
                },
                {
                    "headline": "Add the drained collard greens to the bacon drippings and fry it.",
                    "description": "Fry the collards for several minutes, allowing them to wilt and absorb the bacon grease. Then, cover the pot with a lid."
                },
                {
                    "headline": "Add 3/4 - 1 cup of water to the pot.",
                    "description": "Stir the ingredients as you continue to steam the collard greens."
                },
                {
                    "headline": "Add the salt, sugar, and bouillon cube to the pot.",
                    "description": "Add 1 tsp. of table salt, 3 tbsp. of granulated sugar, and 1 chicken bullion cube to the pot for flavor."
                },
                {
                    "headline": "Reduce the heat and cover the pot and cook for 10-15 minutes.",
                    "description": "Cook the pot with the collard greens over low heat until the greens are tender and dark green."
                },
                {
                    "headline": "Drain the liquid.",
                    "description": ""
                },
                {
                    "headline": "Serve.",
                    "description": "When the greens are ready, chop them finely using two sharp knives, and sprinkle them with the crumbled bacon. Pour 1/4 cup of apple cider vinegar over the greens and enjoy them while they are hot."
                }
            ]
        },
        {
            "name": "Vegetarian Southern-style",
            "steps": [
                {
                    "headline": "Heat the oil and butter in a large stockpot.",
                    "description": "Place the stockpot on your stove and heat 1 tbsp. of olive oil and 1 tbsp. of butter over medium heat until the butter is melted, and the melted butter and oil glide smoothly to coat the bottom of the pot."
                },
                {
                    "headline": "Sauté the onions.",
                    "description": "Add 1/2 of a chopped large white onion to the oil and butter. Move them around rapidly with a spatula. Continue cooking over medium heat for about 2 minutes or until they feel slightly softened."
                },
                {
                    "headline": "Add the red pepper and garlic to the onions.",
                    "description": "Stir 1 tsp. of red pepper flakes and 1 minced garlic clove into the other ingredients and continue cooking over medium heat for another minute."
                },
                {
                    "headline": "Add the collard greens to the pot.",
                    "description": "Toss the greens into the seasoned oil, making sure that all the greens are thoroughly and visibly coated with the oil. Cook for at least another minute."
                },
                {
                    "headline": "Cover the greens with 3 cups of vegetable stock.",
                    "description": "Pour the stock into the pot, give the greens another quick stir, and cover the pot. Bring the stock to a simmer and reduce the heat to medium-low, making sure the stock is still simmering afterward."
                },
                {
                    "headline": "Cook the greens until they are tender.",
                    "description": "This should take about 40 minutes, but may take as quick as 20 minutes depending on how small your strips of greens are. Check frequently after 20 minutes and stop once the greens are soft and wilted."
                },
                {
                    "headline": "Add the tomatoes once the greens finish cooking.",
                    "description": "Add 2 seeded and chopped tomatoes to the greens and mix to distribute them evenly."
                },
                {
                    "headline": "Sprinkle the greens with salt and pepper to taste.",
                    "description": "Give the greens another quick toss and serve warm."
                }
            ]
        },
        {
            "name": "Blanched",
            "steps": [
                {
                    "headline": "Discard the tough stems and ribs of the collard greens.",
                    "description": ""
                },
                {
                    "headline": "Coarsely chop the leaves.",
                    "description": ""
                },
                {
                    "headline": "Cook the leaves in a large pot of boiling salted water for 8-12 minutes.",
                    "description": "Place 1 pinch of salt in the pot and boil the collard greens until they are tender and dark green."
                },
                {
                    "headline": "Drain and chill them in cold water.",
                    "description": "Then, drain the cold water again and squeeze out the remaining liquid by patting the greens down."
                },
                {
                    "headline": "Serve.",
                    "description": "Enjoy these blanched collard greens on their own or as a side to a main course."
                }
            ]
        },
        {
            "name": "Oven",
            "steps": [
                {
                    "headline": "Prepare the collard greens strips as explained under \"Preparing the Greens\".",
                    "description": ""
                },
                {
                    "headline": "Preheat the oven to 325ºF/170ºC.",
                    "description": ""
                },
                {
                    "headline": "Toss the collard greens with oil.",
                    "description": "Season with salt and pepper to taste."
                },
                {
                    "headline": "Lay flat on sprayed or parchment-covered baking sheet.",
                    "description": ""
                },
                {
                    "headline": "Cook for 20 minutes.",
                    "description": "Turn halfway through the cooking."
                },
                {
                    "headline": "Serve straight from the oven.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Smoked Turkey Wing and Collard Greens",
            "steps": [
                {
                    "headline": "Rinse a smoked turkey wing and one large ham hock.",
                    "description": "Put it in a large pot of water, enough to cover the meat."
                },
                {
                    "headline": "Boil until tender.",
                    "description": ""
                },
                {
                    "headline": "Add about 2 pounds of clean collard greens.",
                    "description": "Cook about 30 minutes or until tender."
                },
                {
                    "headline": "Taste before seasoning; you may add salt if needed.",
                    "description": "Add 2 tablespoons of sugar, 1 tablespoon of crushed pepper, and 1 tablespoon of olive oil."
                },
                {
                    "headline": "Stir and eat.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Knife",
        "Cutting board",
        "Large bowl",
        "Large skillet",
        "Stockpot"
    ],
    "text": " Preparing the Greens Remove the stem from the bunch. Use your non-dominant hand to hold the leaves together. With your dominant hand, cut about 1 inch (2.5 cm) from the bottom of the stem, separating the leaves. Soak the leaves in water. Place the collard greens in a large bowl and cover them with warm water. Add a little salt to the water. Salt is abrasive and helps in the process of scrubbing away dirt and impurities. Gently scrub the leaves with your hands and rinse. Cut out the spine from each leaf. Lay each leaf out flat on the counter. Use a sharp knife to cut along the spine on each side, separating the leaf into two parts and completely removing the spine. Stack the leaves so the flat, cut sides all line up. Roll the stack of leaves lengthwise. You may need to form several stacks to get tight rolls. Cut the greens into ribbons. Slice each roll into 1 inch (2.5 cm) pieces. Separate the pieces with your fingers, letting them unravel into long strips. Sautéed Heat the oil in a large, heavy skillet. Use medium-high heat, and continue heating 1 tbsp. of olive oil until the oil easily glides over the entire bottom of the pan. Cook the minced garlic. Add 2 tbsp. of minced garlic to the hot oil and move it around with a spatula, keeping it moving to prevent it from burning. Continue cooking for about 20 seconds, until the garlic begins to change in color to a deeper yellow or light tan. Add the strips of collard greens. It is better to add all the greens at once than to do so in batches to ensure that all the greens get the same amount of heat, oil, and garlic. Add the strips and stir with your spatula, making sure that all the greens are coated in oil. Sprinkle the greens with spicy peppers and salt. Add 1/2 tsp. of crushed red pepper or jalapeños and 1/4 tsp. of salt to the collard greens. Wait approximately 30 seconds and toss the greens again with your spatula to mix the seasonings into the rest of the greens. Mix thoroughly, moving the top to the bottom and the greens on the bottom to the top, several times, to ensure the greens are evenly mixed. Continue cooking and stirring over medium-high heat. Use your spatula and continue tossing the shreds of collard greens. Do not let it sit for long without movement. Moving the greens around is the only way to ensure the greens are evenly heated and evenly cooked. Stop cooking once the leaves are slightly wilted. The greens should still be bright green, however. Turn off the stove and remove the pan from the heating element. Add one tbsp of vinegar. Red wine vinegar or cider vinegar would also work if you do not have balsamic vinegar available. Drizzle the vinegar over the greens and toss again to coat. Serve hot. The greens can also be enjoyed at room temperature. Fried Place the collard green leaves in a pot. The stems should already be removed from the bunches and the spines should be removed from the leaves. Cover the greens with cold water for 3-5 minutes. Allow them to soak fully. Dissolve 1 tbsp. of table salt in the water. Stir it in well. Drain the leaves and remove them from the sink.  Wash the collard greens at least two more times. Repeating this process twice will fully clean the collard greens. Fry 5 slices of bacon in a pot over medium heat. Fry the bacon until it is nice and crisp. Then, remove the cooked bacon, crumble it, and set it aside, leaving the bacon drippings in the pot. Add the drained collard greens to the bacon drippings and fry it. Fry the collards for several minutes, allowing them to wilt and absorb the bacon grease. Then, cover the pot with a lid. Add 3/4 - 1 cup of water to the pot. Stir the ingredients as you continue to steam the collard greens. Add the salt, sugar, and bouillon cube to the pot. Add 1 tsp. of table salt, 3 tbsp. of granulated sugar, and 1 chicken bullion cube to the pot for flavor. Reduce the heat and cover the pot and cook for 10-15 minutes. Cook the pot with the collard greens over low heat until the greens are tender and dark green. Drain the liquid.  Serve. When the greens are ready, chop them finely using two sharp knives, and sprinkle them with the crumbled bacon. Pour 1/4 cup of apple cider vinegar over the greens and enjoy them while they are hot. Vegetarian Southern-style Heat the oil and butter in a large stockpot. Place the stockpot on your stove and heat 1 tbsp. of olive oil and 1 tbsp. of butter over medium heat until the butter is melted, and the melted butter and oil glide smoothly to coat the bottom of the pot. Sauté the onions. Add 1/2 of a chopped large white onion to the oil and butter. Move them around rapidly with a spatula. Continue cooking over medium heat for about 2 minutes or until they feel slightly softened. Add the red pepper and garlic to the onions. Stir 1 tsp. of red pepper flakes and 1 minced garlic clove into the other ingredients and continue cooking over medium heat for another minute. Add the collard greens to the pot. Toss the greens into the seasoned oil, making sure that all the greens are thoroughly and visibly coated with the oil. Cook for at least another minute. Cover the greens with 3 cups of vegetable stock. Pour the stock into the pot, give the greens another quick stir, and cover the pot. Bring the stock to a simmer and reduce the heat to medium-low, making sure the stock is still simmering afterward. Cook the greens until they are tender. This should take about 40 minutes, but may take as quick as 20 minutes depending on how small your strips of greens are. Check frequently after 20 minutes and stop once the greens are soft and wilted. Add the tomatoes once the greens finish cooking. Add 2 seeded and chopped tomatoes to the greens and mix to distribute them evenly. Sprinkle the greens with salt and pepper to taste. Give the greens another quick toss and serve warm. Blanched Discard the tough stems and ribs of the collard greens.  Coarsely chop the leaves.  Cook the leaves in a large pot of boiling salted water for 8-12 minutes. Place 1 pinch of salt in the pot and boil the collard greens until they are tender and dark green. Drain and chill them in cold water. Then, drain the cold water again and squeeze out the remaining liquid by patting the greens down. Serve. Enjoy these blanched collard greens on their own or as a side to a main course. Oven Prepare the collard greens strips as explained under \"Preparing the Greens\".  Preheat the oven to 325ºF/170ºC.  Toss the collard greens with oil. Season with salt and pepper to taste. Lay flat on sprayed or parchment-covered baking sheet.  Cook for 20 minutes. Turn halfway through the cooking. Serve straight from the oven.  Smoked Turkey Wing and Collard Greens Rinse a smoked turkey wing and one large ham hock. Put it in a large pot of water, enough to cover the meat. Boil until tender.  Add about 2 pounds of clean collard greens. Cook about 30 minutes or until tender. Taste before seasoning; you may add salt if needed. Add 2 tablespoons of sugar, 1 tablespoon of crushed pepper, and 1 tablespoon of olive oil. Stir and eat. ",
    "sentences": [
        " Preparing the Greens Remove the stem from the bunch.",
        "Use your non-dominant hand to hold the leaves together.",
        "With your dominant hand, cut about 1 inch (2.5 cm) from the bottom of the stem, separating the leaves.",
        "Soak the leaves in water.",
        "Place the collard greens in a large bowl and cover them with warm water.",
        "Add a little salt to the water.",
        "Salt is abrasive and helps in the process of scrubbing away dirt and impurities.",
        "Gently scrub the leaves with your hands and rinse.",
        "Cut out the spine from each leaf.",
        "Lay each leaf out flat on the counter.",
        "Use a sharp knife to cut along the spine on each side, separating the leaf into two parts and completely removing the spine.",
        "Stack the leaves so the flat, cut sides all line up.",
        "Roll the stack of leaves lengthwise.",
        "You may need to form several stacks to get tight rolls.",
        "Cut the greens into ribbons.",
        "Slice each roll into 1 inch (2.5 cm) pieces.",
        "Separate the pieces with your fingers, letting them unravel into long strips.",
        "Sautéed Heat the oil in a large, heavy skillet.",
        "Use medium-high heat, and continue heating 1 tbsp.",
        "of olive oil until the oil easily glides over the entire bottom of the pan.",
        "Cook the minced garlic.",
        "Add 2 tbsp.",
        "of minced garlic to the hot oil and move it around with a spatula, keeping it moving to prevent it from burning.",
        "Continue cooking for about 20 seconds, until the garlic begins to change in color to a deeper yellow or light tan.",
        "Add the strips of collard greens.",
        "It is better to add all the greens at once than to do so in batches to ensure that all the greens get the same amount of heat, oil, and garlic.",
        "Add the strips and stir with your spatula, making sure that all the greens are coated in oil.",
        "Sprinkle the greens with spicy peppers and salt.",
        "Add 1/2 tsp.",
        "of crushed red pepper or jalapeños and 1/4 tsp.",
        "of salt to the collard greens.",
        "Wait approximately 30 seconds and toss the greens again with your spatula to mix the seasonings into the rest of the greens.",
        "Mix thoroughly, moving the top to the bottom and the greens on the bottom to the top, several times, to ensure the greens are evenly mixed.",
        "Continue cooking and stirring over medium-high heat.",
        "Use your spatula and continue tossing the shreds of collard greens.",
        "Do not let it sit for long without movement.",
        "Moving the greens around is the only way to ensure the greens are evenly heated and evenly cooked.",
        "Stop cooking once the leaves are slightly wilted.",
        "The greens should still be bright green, however.",
        "Turn off the stove and remove the pan from the heating element.",
        "Add one tbsp of vinegar.",
        "Red wine vinegar or cider vinegar would also work if you do not have balsamic vinegar available.",
        "Drizzle the vinegar over the greens and toss again to coat.",
        "Serve hot.",
        "The greens can also be enjoyed at room temperature.",
        "Fried Place the collard green leaves in a pot.",
        "The stems should already be removed from the bunches and the spines should be removed from the leaves.",
        "Cover the greens with cold water for 3-5 minutes.",
        "Allow them to soak fully.",
        "Dissolve 1 tbsp.",
        "of table salt in the water.",
        "Stir it in well.",
        "Drain the leaves and remove them from the sink.",
        "Wash the collard greens at least two more times.",
        "Repeating this process twice will fully clean the collard greens.",
        "Fry 5 slices of bacon in a pot over medium heat.",
        "Fry the bacon until it is nice and crisp.",
        "Then, remove the cooked bacon, crumble it, and set it aside, leaving the bacon drippings in the pot.",
        "Add the drained collard greens to the bacon drippings and fry it.",
        "Fry the collards for several minutes, allowing them to wilt and absorb the bacon grease.",
        "Then, cover the pot with a lid.",
        "Add 3/4 - 1 cup of water to the pot.",
        "Stir the ingredients as you continue to steam the collard greens.",
        "Add the salt, sugar, and bouillon cube to the pot.",
        "Add 1 tsp.",
        "of table salt, 3 tbsp.",
        "of granulated sugar, and 1 chicken bullion cube to the pot for flavor.",
        "Reduce the heat and cover the pot and cook for 10-15 minutes.",
        "Cook the pot with the collard greens over low heat until the greens are tender and dark green.",
        "Drain the liquid.",
        "Serve.",
        "When the greens are ready, chop them finely using two sharp knives, and sprinkle them with the crumbled bacon.",
        "Pour 1/4 cup of apple cider vinegar over the greens and enjoy them while they are hot.",
        "Vegetarian Southern-style Heat the oil and butter in a large stockpot.",
        "Place the stockpot on your stove and heat 1 tbsp.",
        "of olive oil and 1 tbsp.",
        "of butter over medium heat until the butter is melted, and the melted butter and oil glide smoothly to coat the bottom of the pot.",
        "Sauté the onions.",
        "Add 1/2 of a chopped large white onion to the oil and butter.",
        "Move them around rapidly with a spatula.",
        "Continue cooking over medium heat for about 2 minutes or until they feel slightly softened.",
        "Add the red pepper and garlic to the onions.",
        "Stir 1 tsp.",
        "of red pepper flakes and 1 minced garlic clove into the other ingredients and continue cooking over medium heat for another minute.",
        "Add the collard greens to the pot.",
        "Toss the greens into the seasoned oil, making sure that all the greens are thoroughly and visibly coated with the oil.",
        "Cook for at least another minute.",
        "Cover the greens with 3 cups of vegetable stock.",
        "Pour the stock into the pot, give the greens another quick stir, and cover the pot.",
        "Bring the stock to a simmer and reduce the heat to medium-low, making sure the stock is still simmering afterward.",
        "Cook the greens until they are tender.",
        "This should take about 40 minutes, but may take as quick as 20 minutes depending on how small your strips of greens are.",
        "Check frequently after 20 minutes and stop once the greens are soft and wilted.",
        "Add the tomatoes once the greens finish cooking.",
        "Add 2 seeded and chopped tomatoes to the greens and mix to distribute them evenly.",
        "Sprinkle the greens with salt and pepper to taste.",
        "Give the greens another quick toss and serve warm.",
        "Blanched Discard the tough stems and ribs of the collard greens.",
        "Coarsely chop the leaves.",
        "Cook the leaves in a large pot of boiling salted water for 8-12 minutes.",
        "Place 1 pinch of salt in the pot and boil the collard greens until they are tender and dark green.",
        "Drain and chill them in cold water.",
        "Then, drain the cold water again and squeeze out the remaining liquid by patting the greens down.",
        "Serve.",
        "Enjoy these blanched collard greens on their own or as a side to a main course.",
        "Oven Prepare the collard greens strips as explained under \"Preparing the Greens\".",
        "Preheat the oven to 325ºF/170ºC.",
        "Toss the collard greens with oil.",
        "Season with salt and pepper to taste.",
        "Lay flat on sprayed or parchment-covered baking sheet.",
        "Cook for 20 minutes.",
        "Turn halfway through the cooking.",
        "Serve straight from the oven.",
        "Smoked Turkey Wing and Collard Greens Rinse a smoked turkey wing and one large ham hock.",
        "Put it in a large pot of water, enough to cover the meat.",
        "Boil until tender.",
        "Add about 2 pounds of clean collard greens.",
        "Cook about 30 minutes or until tender.",
        "Taste before seasoning; you may add salt if needed.",
        "Add 2 tablespoons of sugar, 1 tablespoon of crushed pepper, and 1 tablespoon of olive oil.",
        "Stir and eat."
    ]
}