{
    "title": "How to Grill Corn",
    "url": "https://www.wikihow.com/Grill-Corn",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables",
        "Maize"
    ],
    "methods": [
        {
            "name": "On the Cob",
            "steps": [
                {
                    "headline": "Peel off most of the husk, but not all of it.",
                    "description": "If the corn cobs have thick layers of husks attached, peel off the first few layers, leaving only a few left to protect the corn and prevent it from burning."
                },
                {
                    "headline": "Soak the corn.",
                    "description": "Fill a large pot with cold water and dunk the cobs of corn inside. Make sure that the corn is completely covered with water. If the cobs of corn float, turn them occasionally to make sure that all sides get exposed to water. The water provides extra moisture, which prevents the corn from drying out as it gets grilled. You should let the corn soak for a minimum of 15 minutes, but it can sit in the water up to 3 hours."
                },
                {
                    "headline": "Preheat the grill as the corn soaks.",
                    "description": "The grill should reach medium heat. If using a grill with a thermometer, allow the grill to reach roughly 350 degrees Fahrenheit (177 degrees Celsius)."
                },
                {
                    "headline": "Partially husk the corn.",
                    "description": "After it has soaked, pull the corn out of the water and shake off excess water. Pull the husks back to expose the top half of the corn, but do not remove the husks completely."
                },
                {
                    "headline": "Remove the silk.",
                    "description": "After exposing the corn, pull away the silky threads from the side by grasping them and yanking them up."
                },
                {
                    "headline": "Butter the kernels.",
                    "description": "You can use melted butter or olive oil. Roughly 1 Tbsp (15 ml) per cob should be sufficient."
                },
                {
                    "headline": "Place the corn on the preheated grill.",
                    "description": "Position it so that it sits on direct heat. Allow it to sit on the grill for 30 to 60 seconds on each side in order to brown but not burn. Rotate as necessary to prevent the corn from burning."
                },
                {
                    "headline": "Move the corn to indirect heat.",
                    "description": "This can either be the side of your grill or along a top shelf. Close the cover and allow the corn to cook for 15 minutes."
                },
                {
                    "headline": "Remove the corn when the husks get dark.",
                    "description": "The kernels will also pull away slightly from the tip of the cob. If the corn begins to bend in your hands or if the kernels feel soft and mushy, it has cooked too long. Use tongs and oven mitts to prevent yourself from getting burned."
                },
                {
                    "headline": "Clean off the cobs.",
                    "description": "Grab the uncovered portion of the corn cob with one hand, using an oven mitt or clean dish towel to prevent yourself from getting burned. Peel the remaining husks off and pick off the remaining silk threads. Rinse the corn under warm, running water to remove any ash that has fallen onto the cob."
                },
                {
                    "headline": "Serve hot.",
                    "description": "Allow the corn to cool just enough to prevent yourself from getting burned as you eat it. Season with salt, pepper, and additional butter to taste."
                }
            ]
        },
        {
            "name": "Off the Cob",
            "steps": [
                {
                    "headline": "Prepare your corn by making a marinade.",
                    "description": "Combine the olive oil, balsamic vinegar, salt, pepper, chives, and basil in a 9-inch by 13-inch (23-cm by 33-cm) baking pan. Stir with a spoon or fork to thoroughly combine. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/27\\/Grill-Corn-Step-12Bullet1.jpg\\/v4-460px-Grill-Corn-Step-12Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/27\\/Grill-Corn-Step-12Bullet1.jpg\\/v4-760px-Grill-Corn-Step-12Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nAllow the corn to marinate in the mixture. Add the corn to the baking pan and toss, using a fork or spatula, until evenly coated. Cover the pan with plastic cling wrap and keep in the refrigerator for approximately three hours. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/8a\\/Grill-Corn-Step-12Bullet2.jpg\\/v4-460px-Grill-Corn-Step-12Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/8a\\/Grill-Corn-Step-12Bullet2.jpg\\/v4-760px-Grill-Corn-Step-12Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
                },
                {
                    "headline": "Preheat the grill.",
                    "description": "You can you a gas grill or charcoal grill, but a charcoal grill generally works better for use with wood chips. Pre-soak wood chips, if desired. The right kind of wood chips can enhance the flavor of the corn as it grills. Soak the chips in clean water for one or two hours before you plan to start the grill.To add a sweet flavor to the corn, try applewood, alder wood, cherry wood, or maple wood. Maple wood has a mild sweetness, while applewood is moderately sweet and also contributes a fruity smell. For a bold, smoky flavor, try hickory wood or pecan wood. Hickory wood is considerably stronger. Drain the chips before starting the grill. You do not want them completely dry, but if they are dripping wet, they will hinder the fire. Place the chips in a colander to drain or pat off excess water with a dry dish towel. Sprinkle the still-damp wood chips over the grill. Only use a handful of chips unless you already know what sort of flavor to anticipate with that type of wood. Allow the wood chips to begin steadily smoking."
                },
                {
                    "headline": "Uncover the corn.",
                    "description": "Stir the corn to redistribute the coating."
                },
                {
                    "headline": "Transfer the corn to grill-safe cookware.",
                    "description": "You might be able to keep the corn in the baking pan you marinated it in, but more of the smoky grill flavor will be transferred to the kernels if you remove them to a fine-mesh grilling basket or grilling griddle with small perforations."
                },
                {
                    "headline": "Alternatively, you can also transfer the corn into aluminum foil packets.",
                    "description": "Distribute the kernels evenly between six sheets of aluminum foil, laying the kernels in a pile at the center of each sheet."
                },
                {
                    "headline": "Bring the sides together and fold to seal.",
                    "description": "Make sure that there are no loose or open gaps in the seal."
                },
                {
                    "headline": "Poke the foil with the tines of a fork.",
                    "description": "Doing so creates small perforations that the corn cannot escape through, but it also allows the smoky flavor to seep in."
                },
                {
                    "headline": "Place the cookware or foil packets on the grill rack.",
                    "description": "Cover the grill. Keeping the grill covered allows the corn to cook faster, but it also traps the smoke from the wood chips inside, giving the corn a stronger flavor as a result."
                },
                {
                    "headline": "Allow the corn to cook for 3 minutes.",
                    "description": "After this time has passed, open the grill and stir the corn. If the corn is wrapped in foil packets, use an oven mitt to gently grab the packet and give it a quick, light shake. Put the lid back on the grill and continue cooking."
                },
                {
                    "headline": "Cook the corn for an additional 3 minutes.",
                    "description": "At this point, the corn should begin to sizzle. Uncover the grill and remove the corn."
                },
                {
                    "headline": "Serve hot.",
                    "description": "Allow the corn to cool slightly, but for the strongest flavor, serve it while it is still fairly hot to warm."
                }
            ]
        }
    ],
    "tyn": [
        "Fork",
        "Metal baking pan",
        "Plastic cling wrap",
        "Wood chips",
        "Grill and appropriate fuel",
        "Aluminum foil",
        "Metal grilling griddle or basket"
    ],
    "text": " On the Cob Peel off most of the husk, but not all of it. If the corn cobs have thick layers of husks attached, peel off the first few layers, leaving only a few left to protect the corn and prevent it from burning. Soak the corn. Fill a large pot with cold water and dunk the cobs of corn inside. Make sure that the corn is completely covered with water. If the cobs of corn float, turn them occasionally to make sure that all sides get exposed to water. The water provides extra moisture, which prevents the corn from drying out as it gets grilled. You should let the corn soak for a minimum of 15 minutes, but it can sit in the water up to 3 hours. Preheat the grill as the corn soaks. The grill should reach medium heat. If using a grill with a thermometer, allow the grill to reach roughly 350 degrees Fahrenheit (177 degrees Celsius). Partially husk the corn. After it has soaked, pull the corn out of the water and shake off excess water. Pull the husks back to expose the top half of the corn, but do not remove the husks completely. Remove the silk. After exposing the corn, pull away the silky threads from the side by grasping them and yanking them up. Butter the kernels. You can use melted butter or olive oil. Roughly 1 Tbsp (15 ml) per cob should be sufficient. Place the corn on the preheated grill. Position it so that it sits on direct heat. Allow it to sit on the grill for 30 to 60 seconds on each side in order to brown but not burn. Rotate as necessary to prevent the corn from burning. Move the corn to indirect heat. This can either be the side of your grill or along a top shelf. Close the cover and allow the corn to cook for 15 minutes. Remove the corn when the husks get dark. The kernels will also pull away slightly from the tip of the cob. If the corn begins to bend in your hands or if the kernels feel soft and mushy, it has cooked too long. Use tongs and oven mitts to prevent yourself from getting burned. Clean off the cobs. Grab the uncovered portion of the corn cob with one hand, using an oven mitt or clean dish towel to prevent yourself from getting burned. Peel the remaining husks off and pick off the remaining silk threads. Rinse the corn under warm, running water to remove any ash that has fallen onto the cob. Serve hot. Allow the corn to cool just enough to prevent yourself from getting burned as you eat it. Season with salt, pepper, and additional butter to taste. Off the Cob Prepare your corn by making a marinade. Combine the olive oil, balsamic vinegar, salt, pepper, chives, and basil in a 9-inch by 13-inch (23-cm by 33-cm) baking pan. Stir with a spoon or fork to thoroughly combine. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/27\\/Grill-Corn-Step-12Bullet1.jpg\\/v4-460px-Grill-Corn-Step-12Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/27\\/Grill-Corn-Step-12Bullet1.jpg\\/v4-760px-Grill-Corn-Step-12Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nAllow the corn to marinate in the mixture. Add the corn to the baking pan and toss, using a fork or spatula, until evenly coated. Cover the pan with plastic cling wrap and keep in the refrigerator for approximately three hours. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/8a\\/Grill-Corn-Step-12Bullet2.jpg\\/v4-460px-Grill-Corn-Step-12Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/8a\\/Grill-Corn-Step-12Bullet2.jpg\\/v4-760px-Grill-Corn-Step-12Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Preheat the grill. You can you a gas grill or charcoal grill, but a charcoal grill generally works better for use with wood chips. Pre-soak wood chips, if desired. The right kind of wood chips can enhance the flavor of the corn as it grills. Soak the chips in clean water for one or two hours before you plan to start the grill.To add a sweet flavor to the corn, try applewood, alder wood, cherry wood, or maple wood. Maple wood has a mild sweetness, while applewood is moderately sweet and also contributes a fruity smell. For a bold, smoky flavor, try hickory wood or pecan wood. Hickory wood is considerably stronger. Drain the chips before starting the grill. You do not want them completely dry, but if they are dripping wet, they will hinder the fire. Place the chips in a colander to drain or pat off excess water with a dry dish towel. Sprinkle the still-damp wood chips over the grill. Only use a handful of chips unless you already know what sort of flavor to anticipate with that type of wood. Allow the wood chips to begin steadily smoking. Uncover the corn. Stir the corn to redistribute the coating. Transfer the corn to grill-safe cookware. You might be able to keep the corn in the baking pan you marinated it in, but more of the smoky grill flavor will be transferred to the kernels if you remove them to a fine-mesh grilling basket or grilling griddle with small perforations. Alternatively, you can also transfer the corn into aluminum foil packets. Distribute the kernels evenly between six sheets of aluminum foil, laying the kernels in a pile at the center of each sheet. Bring the sides together and fold to seal. Make sure that there are no loose or open gaps in the seal. Poke the foil with the tines of a fork. Doing so creates small perforations that the corn cannot escape through, but it also allows the smoky flavor to seep in. Place the cookware or foil packets on the grill rack. Cover the grill. Keeping the grill covered allows the corn to cook faster, but it also traps the smoke from the wood chips inside, giving the corn a stronger flavor as a result. Allow the corn to cook for 3 minutes. After this time has passed, open the grill and stir the corn. If the corn is wrapped in foil packets, use an oven mitt to gently grab the packet and give it a quick, light shake. Put the lid back on the grill and continue cooking. Cook the corn for an additional 3 minutes. At this point, the corn should begin to sizzle. Uncover the grill and remove the corn. Serve hot. Allow the corn to cool slightly, but for the strongest flavor, serve it while it is still fairly hot to warm.",
    "sentences": [
        " On the Cob Peel off most of the husk, but not all of it.",
        "If the corn cobs have thick layers of husks attached, peel off the first few layers, leaving only a few left to protect the corn and prevent it from burning.",
        "Soak the corn.",
        "Fill a large pot with cold water and dunk the cobs of corn inside.",
        "Make sure that the corn is completely covered with water.",
        "If the cobs of corn float, turn them occasionally to make sure that all sides get exposed to water.",
        "The water provides extra moisture, which prevents the corn from drying out as it gets grilled.",
        "You should let the corn soak for a minimum of 15 minutes, but it can sit in the water up to 3 hours.",
        "Preheat the grill as the corn soaks.",
        "The grill should reach medium heat.",
        "If using a grill with a thermometer, allow the grill to reach roughly 350 degrees Fahrenheit (177 degrees Celsius).",
        "Partially husk the corn.",
        "After it has soaked, pull the corn out of the water and shake off excess water.",
        "Pull the husks back to expose the top half of the corn, but do not remove the husks completely.",
        "Remove the silk.",
        "After exposing the corn, pull away the silky threads from the side by grasping them and yanking them up.",
        "Butter the kernels.",
        "You can use melted butter or olive oil.",
        "Roughly 1 Tbsp (15 ml) per cob should be sufficient.",
        "Place the corn on the preheated grill.",
        "Position it so that it sits on direct heat.",
        "Allow it to sit on the grill for 30 to 60 seconds on each side in order to brown but not burn.",
        "Rotate as necessary to prevent the corn from burning.",
        "Move the corn to indirect heat.",
        "This can either be the side of your grill or along a top shelf.",
        "Close the cover and allow the corn to cook for 15 minutes.",
        "Remove the corn when the husks get dark.",
        "The kernels will also pull away slightly from the tip of the cob.",
        "If the corn begins to bend in your hands or if the kernels feel soft and mushy, it has cooked too long.",
        "Use tongs and oven mitts to prevent yourself from getting burned.",
        "Clean off the cobs.",
        "Grab the uncovered portion of the corn cob with one hand, using an oven mitt or clean dish towel to prevent yourself from getting burned.",
        "Peel the remaining husks off and pick off the remaining silk threads.",
        "Rinse the corn under warm, running water to remove any ash that has fallen onto the cob.",
        "Serve hot.",
        "Allow the corn to cool just enough to prevent yourself from getting burned as you eat it.",
        "Season with salt, pepper, and additional butter to taste.",
        "Off the Cob Prepare your corn by making a marinade.",
        "Combine the olive oil, balsamic vinegar, salt, pepper, chives, and basil in a 9-inch by 13-inch (23-cm by 33-cm) baking pan.",
        "Stir with a spoon or fork to thoroughly combine.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/27\\/Grill-Corn-Step-12Bullet1.jpg\\/v4-460px-Grill-Corn-Step-12Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/27\\/Grill-Corn-Step-12Bullet1.jpg\\/v4-760px-Grill-Corn-Step-12Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nAllow the corn to marinate in the mixture.",
        "Add the corn to the baking pan and toss, using a fork or spatula, until evenly coated.",
        "Cover the pan with plastic cling wrap and keep in the refrigerator for approximately three hours.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/8a\\/Grill-Corn-Step-12Bullet2.jpg\\/v4-460px-Grill-Corn-Step-12Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/8a\\/Grill-Corn-Step-12Bullet2.jpg\\/v4-760px-Grill-Corn-Step-12Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Preheat the grill.",
        "You can you a gas grill or charcoal grill, but a charcoal grill generally works better for use with wood chips.",
        "Pre-soak wood chips, if desired.",
        "The right kind of wood chips can enhance the flavor of the corn as it grills.",
        "Soak the chips in clean water for one or two hours before you plan to start the grill.To add a sweet flavor to the corn, try applewood, alder wood, cherry wood, or maple wood.",
        "Maple wood has a mild sweetness, while applewood is moderately sweet and also contributes a fruity smell.",
        "For a bold, smoky flavor, try hickory wood or pecan wood.",
        "Hickory wood is considerably stronger.",
        "Drain the chips before starting the grill.",
        "You do not want them completely dry, but if they are dripping wet, they will hinder the fire.",
        "Place the chips in a colander to drain or pat off excess water with a dry dish towel.",
        "Sprinkle the still-damp wood chips over the grill.",
        "Only use a handful of chips unless you already know what sort of flavor to anticipate with that type of wood.",
        "Allow the wood chips to begin steadily smoking.",
        "Uncover the corn.",
        "Stir the corn to redistribute the coating.",
        "Transfer the corn to grill-safe cookware.",
        "You might be able to keep the corn in the baking pan you marinated it in, but more of the smoky grill flavor will be transferred to the kernels if you remove them to a fine-mesh grilling basket or grilling griddle with small perforations.",
        "Alternatively, you can also transfer the corn into aluminum foil packets.",
        "Distribute the kernels evenly between six sheets of aluminum foil, laying the kernels in a pile at the center of each sheet.",
        "Bring the sides together and fold to seal.",
        "Make sure that there are no loose or open gaps in the seal.",
        "Poke the foil with the tines of a fork.",
        "Doing so creates small perforations that the corn cannot escape through, but it also allows the smoky flavor to seep in.",
        "Place the cookware or foil packets on the grill rack.",
        "Cover the grill.",
        "Keeping the grill covered allows the corn to cook faster, but it also traps the smoke from the wood chips inside, giving the corn a stronger flavor as a result.",
        "Allow the corn to cook for 3 minutes.",
        "After this time has passed, open the grill and stir the corn.",
        "If the corn is wrapped in foil packets, use an oven mitt to gently grab the packet and give it a quick, light shake.",
        "Put the lid back on the grill and continue cooking.",
        "Cook the corn for an additional 3 minutes.",
        "At this point, the corn should begin to sizzle.",
        "Uncover the grill and remove the corn.",
        "Serve hot.",
        "Allow the corn to cool slightly, but for the strongest flavor, serve it while it is still fairly hot to warm."
    ]
}