{
    "title": "How to Combo in Mother 3",
    "url": "https://www.wikihow.com/Combo-in-Mother-3",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Video Games",
        "Nintendo Video Game Consoles",
        "Nintendo Game Boy",
        "Nintendo GBA"
    ],
    "steps": [
        {
            "headline": "Set your frame skip to 0.",
            "description": "The timing may go out of sync, and can mess up your combos. To do that, go to the \"speed\" section of your emulator and then select Frame Skip."
        },
        {
            "headline": "Listen to the music closely.",
            "description": "Each music has a unique beat, and may either speed up or slow down, throwing you off."
        },
        {
            "headline": "Use Duster's Hypno-Pendulum or Kumatora's Hypnosis.",
            "description": "This allows you to hear the enemy's \"heartbeat\", which tells you when to press the A button."
        },
        {
            "headline": "Take advantage over the Battle Memory.",
            "description": "You receive this in Chapter Two and enables you to practice combos on encountered enemies. The only difference is the enemies won't attack you, and PP will be returned once you exit the battle."
        },
        {
            "headline": "If all else fails, restart your computer.",
            "description": "Your computer may be overwhelmed from being run, and it may be a good idea to clear the temporary data."
        }
    ],
    "tyn": [
        "A legitimate copy of Mother 3, or a ROM file of Mother 3. You're on your own for that.",
        "The Mother 3 Fan Translation (optional)",
        "An emulator"
    ],
    "text": " Set your frame skip to 0. The timing may go out of sync, and can mess up your combos. To do that, go to the \"speed\" section of your emulator and then select Frame Skip. Listen to the music closely. Each music has a unique beat, and may either speed up or slow down, throwing you off. Use Duster's Hypno-Pendulum or Kumatora's Hypnosis. This allows you to hear the enemy's \"heartbeat\", which tells you when to press the A button. Take advantage over the Battle Memory. You receive this in Chapter Two and enables you to practice combos on encountered enemies. The only difference is the enemies won't attack you, and PP will be returned once you exit the battle. If all else fails, restart your computer. Your computer may be overwhelmed from being run, and it may be a good idea to clear the temporary data.",
    "sentences": [
        " Set your frame skip to 0.",
        "The timing may go out of sync, and can mess up your combos.",
        "To do that, go to the \"speed\" section of your emulator and then select Frame Skip.",
        "Listen to the music closely.",
        "Each music has a unique beat, and may either speed up or slow down, throwing you off.",
        "Use Duster's Hypno-Pendulum or Kumatora's Hypnosis.",
        "This allows you to hear the enemy's \"heartbeat\", which tells you when to press the A button.",
        "Take advantage over the Battle Memory.",
        "You receive this in Chapter Two and enables you to practice combos on encountered enemies.",
        "The only difference is the enemies won't attack you, and PP will be returned once you exit the battle.",
        "If all else fails, restart your computer.",
        "Your computer may be overwhelmed from being run, and it may be a good idea to clear the temporary data."
    ]
}