{
    "title": "How to Draw a Helicopter",
    "url": "https://www.wikihow.com/Draw-a-Helicopter",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Drawing",
        "Drawing Transport",
        "Drawing Aircraft"
    ],
    "methods": [
        {
            "name": "Standard Helicopter",
            "steps": [
                {
                    "headline": "Draw the body and the tail boom.",
                    "description": "Start by drawing a slightly skewed trapezoid. Add a long triangular shape at the base. This will be your helicopter’s tail boom. Make sure that you are using a pencil for the draft sketch so you can erase it afterwards to make it neat."
                },
                {
                    "headline": "Add the cockpit.",
                    "description": "Draw an irregular egg-shaped figure. This will be your helicopter’s cockpit. Since helicopters come in different shapes and models, you can actually make this into a slightly different shape. In this figure, I used a slightly pointed oval."
                },
                {
                    "headline": "Add skids and defines body shape.",
                    "description": "To define the copter body shape; go back to the trapezoid you made on Step 1. Add some lines to make it look like a trapezoid-cube. For the skids, add two horizontal parallel lines below the cockpit."
                },
                {
                    "headline": "Add the tail and the rotor base.",
                    "description": "For the tail, add two thin right angles at each side of the end of the tail boom. The rotor base would be added at the top of the trapezoid cube. To make things easier, just make a really thick and wide lowercase “i”."
                },
                {
                    "headline": "Add the tail rotor and the main rotor.",
                    "description": "Add three (or four) straight lines on the rotor base. It doesn’t matter if the lines are the same length. Just keep in mind the angle of the view. Unknown to most people, helicopters also have tail rotors to help make manoeuvring easier. To do this, make two thin triangles. The triangles’ apex should meet in the middle."
                },
                {
                    "headline": "Add a small wing at the tail and add some windows and headlight.",
                    "description": "To draw the wing, just add a small rectangle on the narrow part of the tail boom. You can add windows at the side and the big window for the cockpit pilots. Also, don’t forget to add the headlight in front of the cockpit."
                },
                {
                    "headline": "Using a pen, draw on top of your sketch.",
                    "description": "Put in mind the overlapping lines and parts that should be hidden. the line art might not look perfect and crisp but it should look neat when the pencil is erased."
                },
                {
                    "headline": "Erase the pencil sketch and add details.",
                    "description": "you can add details like light bulbs, small windows and doors. you can also add screws and metal sheets for added rugged effect."
                },
                {
                    "headline": "Color your helicopter.",
                    "description": "Helicopters could go from boring gray or white to camouflage or even in bright colors. You may also want to add symbols or insignia to make your helicopters look more real."
                }
            ]
        },
        {
            "name": "Transport Copter",
            "steps": [
                {
                    "headline": "Draw a long rectangle.",
                    "description": "This will be your transport copter’s main body. It has to be huge because it needs to accommodate big objects like crates and trucks."
                },
                {
                    "headline": "Add two triangles at each end.",
                    "description": "The smaller triangle at one end will be the helicopter’s nose. The bigger triangle at one end would be the compartment gate."
                },
                {
                    "headline": "Add two rotor bases.",
                    "description": "for the rotor bases, add two rectangles at the top of the rectangle on each opposite side. The rear rectangle should be bigger than the one in front."
                },
                {
                    "headline": "Add circles and curved lines on the rectangles.",
                    "description": "Add two small circles at the lower base of the rectangle. These will be your copter’s wheels. One should be at the bottom part of the compartment and the other near the middle of the copter’s body. Add two downward curves at the top of the rotor bases you made earlier."
                },
                {
                    "headline": "Add the rotors.",
                    "description": "Add straight lines on top of the rotor bases. Depending on the angle of the view, you might need to add 2-3 lines per rotor base."
                },
                {
                    "headline": "Using a pen, draw on top of your sketch.",
                    "description": "Put in mind the overlapping lines and parts that should be hidden. The line art might not look perfect and crisp but it should look neat when the pencil is erased."
                },
                {
                    "headline": "Erase the pencil sketch and add details.",
                    "description": "You can add details like light bulbs, small windows and doors. You can also add screws and metal sheets for added rugged effect."
                },
                {
                    "headline": "Color your helicopter.",
                    "description": "Helicopters could go from boring gray or white to camouflage or even in bright colors. You may also want to add symbols or insignia to make your helicopters look more real."
                }
            ]
        }
    ],
    "tyn": [
        "Paper",
        "Pencil",
        "Pencil sharpener",
        "Eraser gum",
        "Colored pencils, crayons, markers or watercolors"
    ],
    "text": " Standard Helicopter Draw the body and the tail boom. Start by drawing a slightly skewed trapezoid. Add a long triangular shape at the base. This will be your helicopter’s tail boom. Make sure that you are using a pencil for the draft sketch so you can erase it afterwards to make it neat. Add the cockpit. Draw an irregular egg-shaped figure. This will be your helicopter’s cockpit. Since helicopters come in different shapes and models, you can actually make this into a slightly different shape. In this figure, I used a slightly pointed oval. Add skids and defines body shape. To define the copter body shape; go back to the trapezoid you made on Step 1. Add some lines to make it look like a trapezoid-cube. For the skids, add two horizontal parallel lines below the cockpit. Add the tail and the rotor base. For the tail, add two thin right angles at each side of the end of the tail boom. The rotor base would be added at the top of the trapezoid cube. To make things easier, just make a really thick and wide lowercase “i”. Add the tail rotor and the main rotor. Add three (or four) straight lines on the rotor base. It doesn’t matter if the lines are the same length. Just keep in mind the angle of the view. Unknown to most people, helicopters also have tail rotors to help make manoeuvring easier. To do this, make two thin triangles. The triangles’ apex should meet in the middle. Add a small wing at the tail and add some windows and headlight. To draw the wing, just add a small rectangle on the narrow part of the tail boom. You can add windows at the side and the big window for the cockpit pilots. Also, don’t forget to add the headlight in front of the cockpit. Using a pen, draw on top of your sketch. Put in mind the overlapping lines and parts that should be hidden. the line art might not look perfect and crisp but it should look neat when the pencil is erased. Erase the pencil sketch and add details. you can add details like light bulbs, small windows and doors. you can also add screws and metal sheets for added rugged effect. Color your helicopter. Helicopters could go from boring gray or white to camouflage or even in bright colors. You may also want to add symbols or insignia to make your helicopters look more real. Transport Copter Draw a long rectangle. This will be your transport copter’s main body. It has to be huge because it needs to accommodate big objects like crates and trucks. Add two triangles at each end. The smaller triangle at one end will be the helicopter’s nose. The bigger triangle at one end would be the compartment gate. Add two rotor bases. for the rotor bases, add two rectangles at the top of the rectangle on each opposite side. The rear rectangle should be bigger than the one in front. Add circles and curved lines on the rectangles. Add two small circles at the lower base of the rectangle. These will be your copter’s wheels. One should be at the bottom part of the compartment and the other near the middle of the copter’s body. Add two downward curves at the top of the rotor bases you made earlier. Add the rotors. Add straight lines on top of the rotor bases. Depending on the angle of the view, you might need to add 2-3 lines per rotor base. Using a pen, draw on top of your sketch. Put in mind the overlapping lines and parts that should be hidden. The line art might not look perfect and crisp but it should look neat when the pencil is erased. Erase the pencil sketch and add details. You can add details like light bulbs, small windows and doors. You can also add screws and metal sheets for added rugged effect. Color your helicopter. Helicopters could go from boring gray or white to camouflage or even in bright colors. You may also want to add symbols or insignia to make your helicopters look more real.",
    "sentences": [
        " Standard Helicopter Draw the body and the tail boom.",
        "Start by drawing a slightly skewed trapezoid.",
        "Add a long triangular shape at the base.",
        "This will be your helicopter’s tail boom.",
        "Make sure that you are using a pencil for the draft sketch so you can erase it afterwards to make it neat.",
        "Add the cockpit.",
        "Draw an irregular egg-shaped figure.",
        "This will be your helicopter’s cockpit.",
        "Since helicopters come in different shapes and models, you can actually make this into a slightly different shape.",
        "In this figure, I used a slightly pointed oval.",
        "Add skids and defines body shape.",
        "To define the copter body shape; go back to the trapezoid you made on Step 1.",
        "Add some lines to make it look like a trapezoid-cube.",
        "For the skids, add two horizontal parallel lines below the cockpit.",
        "Add the tail and the rotor base.",
        "For the tail, add two thin right angles at each side of the end of the tail boom.",
        "The rotor base would be added at the top of the trapezoid cube.",
        "To make things easier, just make a really thick and wide lowercase “i”.",
        "Add the tail rotor and the main rotor.",
        "Add three (or four) straight lines on the rotor base.",
        "It doesn’t matter if the lines are the same length.",
        "Just keep in mind the angle of the view.",
        "Unknown to most people, helicopters also have tail rotors to help make manoeuvring easier.",
        "To do this, make two thin triangles.",
        "The triangles’ apex should meet in the middle.",
        "Add a small wing at the tail and add some windows and headlight.",
        "To draw the wing, just add a small rectangle on the narrow part of the tail boom.",
        "You can add windows at the side and the big window for the cockpit pilots.",
        "Also, don’t forget to add the headlight in front of the cockpit.",
        "Using a pen, draw on top of your sketch.",
        "Put in mind the overlapping lines and parts that should be hidden.",
        "the line art might not look perfect and crisp but it should look neat when the pencil is erased.",
        "Erase the pencil sketch and add details.",
        "you can add details like light bulbs, small windows and doors.",
        "you can also add screws and metal sheets for added rugged effect.",
        "Color your helicopter.",
        "Helicopters could go from boring gray or white to camouflage or even in bright colors.",
        "You may also want to add symbols or insignia to make your helicopters look more real.",
        "Transport Copter Draw a long rectangle.",
        "This will be your transport copter’s main body.",
        "It has to be huge because it needs to accommodate big objects like crates and trucks.",
        "Add two triangles at each end.",
        "The smaller triangle at one end will be the helicopter’s nose.",
        "The bigger triangle at one end would be the compartment gate.",
        "Add two rotor bases.",
        "for the rotor bases, add two rectangles at the top of the rectangle on each opposite side.",
        "The rear rectangle should be bigger than the one in front.",
        "Add circles and curved lines on the rectangles.",
        "Add two small circles at the lower base of the rectangle.",
        "These will be your copter’s wheels.",
        "One should be at the bottom part of the compartment and the other near the middle of the copter’s body.",
        "Add two downward curves at the top of the rotor bases you made earlier.",
        "Add the rotors.",
        "Add straight lines on top of the rotor bases.",
        "Depending on the angle of the view, you might need to add 2-3 lines per rotor base.",
        "Using a pen, draw on top of your sketch.",
        "Put in mind the overlapping lines and parts that should be hidden.",
        "The line art might not look perfect and crisp but it should look neat when the pencil is erased.",
        "Erase the pencil sketch and add details.",
        "You can add details like light bulbs, small windows and doors.",
        "You can also add screws and metal sheets for added rugged effect.",
        "Color your helicopter.",
        "Helicopters could go from boring gray or white to camouflage or even in bright colors.",
        "You may also want to add symbols or insignia to make your helicopters look more real."
    ]
}