{
    "title": "How to Help a Shedding Pet Reptile",
    "url": "https://www.wikihow.com/Help-a-Shedding-Pet-Reptile",
    "category_hierarchy": [
        "Pets and Animals",
        "Reptiles"
    ],
    "methods": [
        {
            "name": "Helping Turtles and Tortoises",
            "steps": [
                {
                    "headline": "Spray warm water on terrestrial turtles and tortoises with dry skin.",
                    "description": "When terrestrial turtles and tortoises have dry skin, it hangs off their body in small, rag-like pieces and waves in the wind as they walk. Give your reptile 1 quick spray of water to loosen up its old skin and make it easier for it to shed. Use water that's 77–82 °F (25–28 °C). Water that's too cold could interfere with your reptiles internal body temperature, while water that's too hot could burn its skin. Since aquatic turtles and tortoises spend most of their time in the water, you don't need to worry about applying additional moisture to their skin."
                },
                {
                    "headline": "Bathe terrestrial turtles and tortoises in water for 10-15 minutes daily.",
                    "description": "Start by pouring warm water that's 77–82 °F (25–28 °C) in a shallow dish that's large enough to accommodate your reptile. Afterward, put it in and let it soak for a bit. This will moisten its skin and help the shedding process. The water in the dish should be shallow enough that it doesn't overflow when you set your turtle or tortoise in it. Don't let species from arid climates—such as Russian tortoises—bathe in a shallow dish for more than 10-15 minutes. These species are not used to water and will often stay in the bath to the point of shell rot!"
                },
                {
                    "headline": "Dry your terrestrial turtle or tortoise with a towel or heat lamp after wetting it.",
                    "description": "Either cover it up with a towel or place it underneath its heat lamp. You can also place heating pads under its substrate or water dish. Purchase heat lamps and heating pads from pet stores. Never use any type of heating rock, as these can cause serious and sometimes fatal burns. Always place heating pads outside of your reptile's enclosure to avoid burns."
                }
            ]
        },
        {
            "name": "Caring for Lizards",
            "steps": [
                {
                    "headline": "Spray lizards regularly with warm water.",
                    "description": "Focus on bathing or spraying during the pre-shedding and shedding periods. Once lizards start shedding, they will begin to lose their head skin followed by their body, limbs, and tail skin—in that order. Start by filling a spray bottle with tap water and give your lizard 1 quick spray to loosen the layers of old skin and help the build-up of oily fluid between each layer. Spray your lizard with water that's 77–82 °F (25–28 °C). If the water is colder than that, it could affect your reptile's internal body temperature, and if it's hotter than that, it could burn your reptile's skin. Signs of the pre-shed period are duller and dimmer skin colors, and white or gray patches around the head and hands that progress to the back, arms, and then tail. Rub mineral oil onto problematic areas after removing them from their bath."
                },
                {
                    "headline": "Create a humidity retreat box for small lizards.",
                    "description": "If you notice your lizard has started to shed but isn't completing it, set up a humidity retreat box to moisten its dry skin and help the process along. You can purchase one from the pet store or create one from a plastic storage container by adding a humidity-holding substrate, such as Sphagnum moss. Afterward, use a pair of scissors to create a hole large enough for your lizard to enter and exit and place the box in its enclosure. Purchase a lizard enclosure with a permanent humidity retreat attached if you'd like."
                },
                {
                    "headline": "Bathe large lizards in a tub of water for 10-15 minutes daily.",
                    "description": "Create a shallow dish of warm water that's 77–82 °F (25–28 °C), and let your lizard bathe in it to loosen up its skin. You can also gently rub its skin after bathing it to help the shedding process. Make sure the water in the dish is shallow enough that it's not overflowing when you set your lizard in it."
                },
                {
                    "headline": "Wrap your lizard in a damp and dry towel if it's having trouble shedding.",
                    "description": "If the skin on your lizard's toes, tails, dewlaps, or dorsal crest spikes and fans still isn't coming off, wrap it in a warm, damp towel followed by a dry towel. Wait about 5 minutes and then expose a small area of the foot or crest and gently rub the problematic skin. Repeat this process whenever you notice problematic shedding."
                }
            ]
        },
        {
            "name": "Helping Snakes",
            "steps": [
                {
                    "headline": "Provide snakes up to 5 feet (1.5 m) in length with a humidity retreat box.",
                    "description": "Purchase a humidity retreat box from a pet store or make one from a plastic container—such as a storage container—and a humidity holding substrate like Sphagnum moss. Just make sure to cut a hole in your box so your reptile can get in and out! Lots of snakes defecate on the same day as they shed, so it's a good idea to put on gloves before removing shed skin from your snake's enclosure. Place your box into your snake's enclosure when it sheds or invest in an enclosure with a permanent humidity retreat connected to it. If you are at high risk for salmonellosis, exercise caution when contacting snakeskin shed."
                },
                {
                    "headline": "Bathe larger snakes in warm water daily after the pre-shed period.",
                    "description": "If your snake is longer than 5 feet (1.5 m), let it soak in water to help the shedding process. Just keep in mind that snakes eyes cloud up during the pre-shed period, and they might bite during this time since they can't see. Make sure you wait until your snake's eyes have cleared up before bathing it. Then, soak it for 10-15 minutes every day, and start rubbing it gently from head-to-tail to help its skin come off. Note if the eye caps are coming off—if they're not, don't force them just yet. Make sure you use water that's 77–82 °F (25–28 °C). If you use water that's any colder than that, it could negatively affect your snake's internal body temperature. If the water is hotter than that, it could burn your snake's skin. When you fill the dish with water, make sure it's shallow enough that it doesn't overflow when you put your snake in it."
                },
                {
                    "headline": "Remove eye caps manually if they're not coming off with other shed skin.",
                    "description": "If your snake's eye caps still aren't off once it's finished shedding the rest of its skin, dab them with mineral oil using a cotton swab and wait 24 hours. Afterward, check to see if they came off. If not, remove them by gently rocking a piece of Scotch tape across each eye. Exercise extreme caution when removing eye caps and be sure to rock the Scotch tape gently!"
                }
            ]
        },
        {
            "name": "Making the Shedding Process Easier",
            "steps": [
                {
                    "headline": "Respect your reptile's space during shedding at all times.",
                    "description": "Regardless of species, most reptiles get pretty cranky during the shedding period. Some might even become hissy and snappy, and sometimes they will object to being touched and held. Always respect their space and minimize handling as much as possible. The best way to avoid being snapped at or bitten is to handle your reptile as infrequently as possible when it's shedding. When you do have to handle your reptile, make sure you support its full body weight so it's as comfortable as possible, and try to use calm, smooth movements so you don't startle it."
                },
                {
                    "headline": "Never force your reptile to eat during the shedding period.",
                    "description": "You will probably notice that reptiles start to lose their appetite during the shedding period. If they reduce their food intake, don't force it on them. In some cases, snakes stop eating altogether—don't worry, this is normal. Keep providing your reptile with food but never force it on them."
                },
                {
                    "headline": "Give your reptile a rough object when it starts shedding to aid in skin removal.",
                    "description": "When reptiles shed their skins, not only does it get very tight, but it also gets very itchy. Giving it a rough object will help it relieve its itchy skin on its own. A rock, branch, stick, or rough-surfaced enclosure decorations are all great ideas. This is also very helpful for when they want to break the skin to shed from their bodies. Provide a few different items to let it choose its favorite. If it doesn't use it, try adding alternatives."
                },
                {
                    "headline": "Provide your reptile with multivitamins and mineral supplements daily.",
                    "description": "If a reptile isn't getting the proper care and nutrients, it will experience problems with the shedding process. Purchase powdered reptile multivitamins, calcium, and mineral supplements at any pet store or order them online. Afterward, sprinkle the recommended quantities onto your reptile's food every day. Be sure to add quantities listed for your particular species of reptile. Your reptile may not eat as much when it's shedding, so it's important that you're giving it multivitamins and mineral supplements every day before it even starts the shedding process. That way, when it's time for your reptile to shed, the process will be easier because it's healthy."
                }
            ]
        }
    ],
    "tyn": [
        "Helping Turtles and Tortoises",
        "Spray bottle",
        "Shallow dish",
        "Towel or heat lamp",
        "Caring for Lizards",
        "Humidity retreat box",
        "Plastic container (optional)",
        "Sphagnum moss (optional)",
        "Towel",
        "Helping Snakes",
        "Mineral oil",
        "Cotton swab"
    ],
    "text": " Helping Turtles and Tortoises Spray warm water on terrestrial turtles and tortoises with dry skin. When terrestrial turtles and tortoises have dry skin, it hangs off their body in small, rag-like pieces and waves in the wind as they walk. Give your reptile 1 quick spray of water to loosen up its old skin and make it easier for it to shed. Use water that's 77–82 °F (25–28 °C). Water that's too cold could interfere with your reptiles internal body temperature, while water that's too hot could burn its skin. Since aquatic turtles and tortoises spend most of their time in the water, you don't need to worry about applying additional moisture to their skin. Bathe terrestrial turtles and tortoises in water for 10-15 minutes daily. Start by pouring warm water that's 77–82 °F (25–28 °C) in a shallow dish that's large enough to accommodate your reptile. Afterward, put it in and let it soak for a bit. This will moisten its skin and help the shedding process. The water in the dish should be shallow enough that it doesn't overflow when you set your turtle or tortoise in it. Don't let species from arid climates—such as Russian tortoises—bathe in a shallow dish for more than 10-15 minutes. These species are not used to water and will often stay in the bath to the point of shell rot! Dry your terrestrial turtle or tortoise with a towel or heat lamp after wetting it. Either cover it up with a towel or place it underneath its heat lamp. You can also place heating pads under its substrate or water dish. Purchase heat lamps and heating pads from pet stores. Never use any type of heating rock, as these can cause serious and sometimes fatal burns. Always place heating pads outside of your reptile's enclosure to avoid burns. Caring for Lizards Spray lizards regularly with warm water. Focus on bathing or spraying during the pre-shedding and shedding periods. Once lizards start shedding, they will begin to lose their head skin followed by their body, limbs, and tail skin—in that order. Start by filling a spray bottle with tap water and give your lizard 1 quick spray to loosen the layers of old skin and help the build-up of oily fluid between each layer. Spray your lizard with water that's 77–82 °F (25–28 °C). If the water is colder than that, it could affect your reptile's internal body temperature, and if it's hotter than that, it could burn your reptile's skin. Signs of the pre-shed period are duller and dimmer skin colors, and white or gray patches around the head and hands that progress to the back, arms, and then tail. Rub mineral oil onto problematic areas after removing them from their bath. Create a humidity retreat box for small lizards. If you notice your lizard has started to shed but isn't completing it, set up a humidity retreat box to moisten its dry skin and help the process along. You can purchase one from the pet store or create one from a plastic storage container by adding a humidity-holding substrate, such as Sphagnum moss. Afterward, use a pair of scissors to create a hole large enough for your lizard to enter and exit and place the box in its enclosure. Purchase a lizard enclosure with a permanent humidity retreat attached if you'd like. Bathe large lizards in a tub of water for 10-15 minutes daily. Create a shallow dish of warm water that's 77–82 °F (25–28 °C), and let your lizard bathe in it to loosen up its skin. You can also gently rub its skin after bathing it to help the shedding process. Make sure the water in the dish is shallow enough that it's not overflowing when you set your lizard in it. Wrap your lizard in a damp and dry towel if it's having trouble shedding. If the skin on your lizard's toes, tails, dewlaps, or dorsal crest spikes and fans still isn't coming off, wrap it in a warm, damp towel followed by a dry towel. Wait about 5 minutes and then expose a small area of the foot or crest and gently rub the problematic skin. Repeat this process whenever you notice problematic shedding. Helping Snakes Provide snakes up to 5 feet (1.5 m) in length with a humidity retreat box. Purchase a humidity retreat box from a pet store or make one from a plastic container—such as a storage container—and a humidity holding substrate like Sphagnum moss. Just make sure to cut a hole in your box so your reptile can get in and out! Lots of snakes defecate on the same day as they shed, so it's a good idea to put on gloves before removing shed skin from your snake's enclosure. Place your box into your snake's enclosure when it sheds or invest in an enclosure with a permanent humidity retreat connected to it. If you are at high risk for salmonellosis, exercise caution when contacting snakeskin shed. Bathe larger snakes in warm water daily after the pre-shed period. If your snake is longer than 5 feet (1.5 m), let it soak in water to help the shedding process. Just keep in mind that snakes eyes cloud up during the pre-shed period, and they might bite during this time since they can't see. Make sure you wait until your snake's eyes have cleared up before bathing it. Then, soak it for 10-15 minutes every day, and start rubbing it gently from head-to-tail to help its skin come off. Note if the eye caps are coming off—if they're not, don't force them just yet. Make sure you use water that's 77–82 °F (25–28 °C). If you use water that's any colder than that, it could negatively affect your snake's internal body temperature. If the water is hotter than that, it could burn your snake's skin. When you fill the dish with water, make sure it's shallow enough that it doesn't overflow when you put your snake in it. Remove eye caps manually if they're not coming off with other shed skin. If your snake's eye caps still aren't off once it's finished shedding the rest of its skin, dab them with mineral oil using a cotton swab and wait 24 hours. Afterward, check to see if they came off. If not, remove them by gently rocking a piece of Scotch tape across each eye. Exercise extreme caution when removing eye caps and be sure to rock the Scotch tape gently! Making the Shedding Process Easier Respect your reptile's space during shedding at all times. Regardless of species, most reptiles get pretty cranky during the shedding period. Some might even become hissy and snappy, and sometimes they will object to being touched and held. Always respect their space and minimize handling as much as possible. The best way to avoid being snapped at or bitten is to handle your reptile as infrequently as possible when it's shedding. When you do have to handle your reptile, make sure you support its full body weight so it's as comfortable as possible, and try to use calm, smooth movements so you don't startle it. Never force your reptile to eat during the shedding period. You will probably notice that reptiles start to lose their appetite during the shedding period. If they reduce their food intake, don't force it on them. In some cases, snakes stop eating altogether—don't worry, this is normal. Keep providing your reptile with food but never force it on them. Give your reptile a rough object when it starts shedding to aid in skin removal. When reptiles shed their skins, not only does it get very tight, but it also gets very itchy. Giving it a rough object will help it relieve its itchy skin on its own. A rock, branch, stick, or rough-surfaced enclosure decorations are all great ideas. This is also very helpful for when they want to break the skin to shed from their bodies. Provide a few different items to let it choose its favorite. If it doesn't use it, try adding alternatives. Provide your reptile with multivitamins and mineral supplements daily. If a reptile isn't getting the proper care and nutrients, it will experience problems with the shedding process. Purchase powdered reptile multivitamins, calcium, and mineral supplements at any pet store or order them online. Afterward, sprinkle the recommended quantities onto your reptile's food every day. Be sure to add quantities listed for your particular species of reptile. Your reptile may not eat as much when it's shedding, so it's important that you're giving it multivitamins and mineral supplements every day before it even starts the shedding process. That way, when it's time for your reptile to shed, the process will be easier because it's healthy.",
    "sentences": [
        " Helping Turtles and Tortoises Spray warm water on terrestrial turtles and tortoises with dry skin.",
        "When terrestrial turtles and tortoises have dry skin, it hangs off their body in small, rag-like pieces and waves in the wind as they walk.",
        "Give your reptile 1 quick spray of water to loosen up its old skin and make it easier for it to shed.",
        "Use water that's 77–82 °F (25–28 °C).",
        "Water that's too cold could interfere with your reptiles internal body temperature, while water that's too hot could burn its skin.",
        "Since aquatic turtles and tortoises spend most of their time in the water, you don't need to worry about applying additional moisture to their skin.",
        "Bathe terrestrial turtles and tortoises in water for 10-15 minutes daily.",
        "Start by pouring warm water that's 77–82 °F (25–28 °C) in a shallow dish that's large enough to accommodate your reptile.",
        "Afterward, put it in and let it soak for a bit.",
        "This will moisten its skin and help the shedding process.",
        "The water in the dish should be shallow enough that it doesn't overflow when you set your turtle or tortoise in it.",
        "Don't let species from arid climates—such as Russian tortoises—bathe in a shallow dish for more than 10-15 minutes.",
        "These species are not used to water and will often stay in the bath to the point of shell rot!",
        "Dry your terrestrial turtle or tortoise with a towel or heat lamp after wetting it.",
        "Either cover it up with a towel or place it underneath its heat lamp.",
        "You can also place heating pads under its substrate or water dish.",
        "Purchase heat lamps and heating pads from pet stores.",
        "Never use any type of heating rock, as these can cause serious and sometimes fatal burns.",
        "Always place heating pads outside of your reptile's enclosure to avoid burns.",
        "Caring for Lizards Spray lizards regularly with warm water.",
        "Focus on bathing or spraying during the pre-shedding and shedding periods.",
        "Once lizards start shedding, they will begin to lose their head skin followed by their body, limbs, and tail skin—in that order.",
        "Start by filling a spray bottle with tap water and give your lizard 1 quick spray to loosen the layers of old skin and help the build-up of oily fluid between each layer.",
        "Spray your lizard with water that's 77–82 °F (25–28 °C).",
        "If the water is colder than that, it could affect your reptile's internal body temperature, and if it's hotter than that, it could burn your reptile's skin.",
        "Signs of the pre-shed period are duller and dimmer skin colors, and white or gray patches around the head and hands that progress to the back, arms, and then tail.",
        "Rub mineral oil onto problematic areas after removing them from their bath.",
        "Create a humidity retreat box for small lizards.",
        "If you notice your lizard has started to shed but isn't completing it, set up a humidity retreat box to moisten its dry skin and help the process along.",
        "You can purchase one from the pet store or create one from a plastic storage container by adding a humidity-holding substrate, such as Sphagnum moss.",
        "Afterward, use a pair of scissors to create a hole large enough for your lizard to enter and exit and place the box in its enclosure.",
        "Purchase a lizard enclosure with a permanent humidity retreat attached if you'd like.",
        "Bathe large lizards in a tub of water for 10-15 minutes daily.",
        "Create a shallow dish of warm water that's 77–82 °F (25–28 °C), and let your lizard bathe in it to loosen up its skin.",
        "You can also gently rub its skin after bathing it to help the shedding process.",
        "Make sure the water in the dish is shallow enough that it's not overflowing when you set your lizard in it.",
        "Wrap your lizard in a damp and dry towel if it's having trouble shedding.",
        "If the skin on your lizard's toes, tails, dewlaps, or dorsal crest spikes and fans still isn't coming off, wrap it in a warm, damp towel followed by a dry towel.",
        "Wait about 5 minutes and then expose a small area of the foot or crest and gently rub the problematic skin.",
        "Repeat this process whenever you notice problematic shedding.",
        "Helping Snakes Provide snakes up to 5 feet (1.5 m) in length with a humidity retreat box.",
        "Purchase a humidity retreat box from a pet store or make one from a plastic container—such as a storage container—and a humidity holding substrate like Sphagnum moss.",
        "Just make sure to cut a hole in your box so your reptile can get in and out!",
        "Lots of snakes defecate on the same day as they shed, so it's a good idea to put on gloves before removing shed skin from your snake's enclosure.",
        "Place your box into your snake's enclosure when it sheds or invest in an enclosure with a permanent humidity retreat connected to it.",
        "If you are at high risk for salmonellosis, exercise caution when contacting snakeskin shed.",
        "Bathe larger snakes in warm water daily after the pre-shed period.",
        "If your snake is longer than 5 feet (1.5 m), let it soak in water to help the shedding process.",
        "Just keep in mind that snakes eyes cloud up during the pre-shed period, and they might bite during this time since they can't see.",
        "Make sure you wait until your snake's eyes have cleared up before bathing it.",
        "Then, soak it for 10-15 minutes every day, and start rubbing it gently from head-to-tail to help its skin come off.",
        "Note if the eye caps are coming off—if they're not, don't force them just yet.",
        "Make sure you use water that's 77–82 °F (25–28 °C).",
        "If you use water that's any colder than that, it could negatively affect your snake's internal body temperature.",
        "If the water is hotter than that, it could burn your snake's skin.",
        "When you fill the dish with water, make sure it's shallow enough that it doesn't overflow when you put your snake in it.",
        "Remove eye caps manually if they're not coming off with other shed skin.",
        "If your snake's eye caps still aren't off once it's finished shedding the rest of its skin, dab them with mineral oil using a cotton swab and wait 24 hours.",
        "Afterward, check to see if they came off.",
        "If not, remove them by gently rocking a piece of Scotch tape across each eye.",
        "Exercise extreme caution when removing eye caps and be sure to rock the Scotch tape gently!",
        "Making the Shedding Process Easier Respect your reptile's space during shedding at all times.",
        "Regardless of species, most reptiles get pretty cranky during the shedding period.",
        "Some might even become hissy and snappy, and sometimes they will object to being touched and held.",
        "Always respect their space and minimize handling as much as possible.",
        "The best way to avoid being snapped at or bitten is to handle your reptile as infrequently as possible when it's shedding.",
        "When you do have to handle your reptile, make sure you support its full body weight so it's as comfortable as possible, and try to use calm, smooth movements so you don't startle it.",
        "Never force your reptile to eat during the shedding period.",
        "You will probably notice that reptiles start to lose their appetite during the shedding period.",
        "If they reduce their food intake, don't force it on them.",
        "In some cases, snakes stop eating altogether—don't worry, this is normal.",
        "Keep providing your reptile with food but never force it on them.",
        "Give your reptile a rough object when it starts shedding to aid in skin removal.",
        "When reptiles shed their skins, not only does it get very tight, but it also gets very itchy.",
        "Giving it a rough object will help it relieve its itchy skin on its own.",
        "A rock, branch, stick, or rough-surfaced enclosure decorations are all great ideas.",
        "This is also very helpful for when they want to break the skin to shed from their bodies.",
        "Provide a few different items to let it choose its favorite.",
        "If it doesn't use it, try adding alternatives.",
        "Provide your reptile with multivitamins and mineral supplements daily.",
        "If a reptile isn't getting the proper care and nutrients, it will experience problems with the shedding process.",
        "Purchase powdered reptile multivitamins, calcium, and mineral supplements at any pet store or order them online.",
        "Afterward, sprinkle the recommended quantities onto your reptile's food every day.",
        "Be sure to add quantities listed for your particular species of reptile.",
        "Your reptile may not eat as much when it's shedding, so it's important that you're giving it multivitamins and mineral supplements every day before it even starts the shedding process.",
        "That way, when it's time for your reptile to shed, the process will be easier because it's healthy."
    ]
}