{
    "title": "How to Write a Memo for Building Renovations",
    "url": "https://www.wikihow.com/Write-a-Memo-for-Building-Renovations",
    "category_hierarchy": [
        "Home and Garden",
        "Home Improvements",
        "Renovation Advice and Tips"
    ],
    "steps": [
        {
            "headline": "Request copies of previous memoranda.",
            "description": "You can get a feeling for the tone and formality of your organization by looking at examples of past notices. Ask your superior to only provide those samples that they have been pleased with."
        },
        {
            "headline": "Obtain copies of contact information for all those who are affected by this memo.",
            "description": "You will need to send each party a copy, and it can take a few days or weeks to obtain all the necessary addresses or emails."
        },
        {
            "headline": "Gather any facts that are necessary to prove the need for a building renovation.",
            "description": "If a housing or apartment board has passed a motion approving the renovations, ask for a copy of the motion, so that it can be requested or distributed. The larger the renovation, the more proof you will need."
        },
        {
            "headline": "Establish deadlines.",
            "description": "For major renovations, you may want to send the memo well in advance so they can make the necessary accommodations. If the renovation is last-minute, decide the date and time that it will occur, including time for people to make their accommodations."
        },
        {
            "headline": "Write an outline of your memo.",
            "description": "Any piece of business writing is used to convince the reader of something. Under headings, make a draft that includes the memo topic, the description, the deadlines and dates, the proof and the contact information for a follow up."
        },
        {
            "headline": "Structure your memo.",
            "description": "Use the company's logo and structure, if it will be a memo produced under the name of a company. The following are guidelines for formatting a memo:\nPlace the addressee name in the upper left hand corner of the word processing document. It can be a general or specific name, but it should be easily recognizable, so the person knows the building renovation memo relates to them. Next, type in the person, people or company who is writing the memo. If you are writing the memo for a department or company, you may need to request approval before sending the memo out under someone else's name. Place the date below. Memos should be produced fairly quickly, because they usually ask someone to take notice of something in a timely manner. Write the subject of the building renovation memo, using the best descriptive words possible. For example, instead of writing \"Subject: Building Renovations,\" write \"Elevator Repair, August 30 6am to 8am.\" Write the body of the message. Write the purpose, why the renovation is necessary, why the renovation benefits the reader and the necessary proof, such as the building code or safety issues. Be direct; try not to include writing that does not support your message."
        },
        {
            "headline": "Include bullet points or lists, if necessary.",
            "description": "People are more likely to read memos that are not blocks of text. Since memos are fairly informal, you can create bulleted lists or use bold text to highlight a certain section of the renovation deadline or purpose."
        },
        {
            "headline": "Edit your memo to 1 page.",
            "description": "If you are giving a memo to a lot of people, the best way to ensure they will read it is to keep it short. If it is too long and the purpose is not immediately clear, they may put it away until they have free time. This is not true of legal memorandum and some company memos that include building reports or board motions. Make sure you know what length your audience is expecting."
        },
        {
            "headline": "Proof your memo for spelling and grammar errors.",
            "description": "If your writing skills are not strong, give it to a superior or colleague who can edit it."
        },
        {
            "headline": "Sign the letter.",
            "description": "Once it is approved, you will want to sign and date it to make it official. Include your contact information, and the contact information of anyone they can direct questions to at the bottom of the memo."
        },
        {
            "headline": "Include necessary attachments.",
            "description": "Print out copies of the memo and attachments for each of your contacts. Staple them to the memo before delivering them."
        },
        {
            "headline": "Deliver your memo in a timely manner.",
            "description": "People will need time to make plans during renovations, so try to get the information out to them when it is announced."
        }
    ],
    "tyn": [
        "Word processing program",
        "Company guidelines",
        "Audience",
        "Deadline",
        "Printed copies",
        "Attachments",
        "Contact information",
        "Proofing/editing",
        "Signature"
    ],
    "text": " Request copies of previous memoranda. You can get a feeling for the tone and formality of your organization by looking at examples of past notices. Ask your superior to only provide those samples that they have been pleased with. Obtain copies of contact information for all those who are affected by this memo. You will need to send each party a copy, and it can take a few days or weeks to obtain all the necessary addresses or emails. Gather any facts that are necessary to prove the need for a building renovation. If a housing or apartment board has passed a motion approving the renovations, ask for a copy of the motion, so that it can be requested or distributed. The larger the renovation, the more proof you will need. Establish deadlines. For major renovations, you may want to send the memo well in advance so they can make the necessary accommodations. If the renovation is last-minute, decide the date and time that it will occur, including time for people to make their accommodations. Write an outline of your memo. Any piece of business writing is used to convince the reader of something. Under headings, make a draft that includes the memo topic, the description, the deadlines and dates, the proof and the contact information for a follow up. Structure your memo. Use the company's logo and structure, if it will be a memo produced under the name of a company. The following are guidelines for formatting a memo:\nPlace the addressee name in the upper left hand corner of the word processing document. It can be a general or specific name, but it should be easily recognizable, so the person knows the building renovation memo relates to them. Next, type in the person, people or company who is writing the memo. If you are writing the memo for a department or company, you may need to request approval before sending the memo out under someone else's name. Place the date below. Memos should be produced fairly quickly, because they usually ask someone to take notice of something in a timely manner. Write the subject of the building renovation memo, using the best descriptive words possible. For example, instead of writing \"Subject: Building Renovations,\" write \"Elevator Repair, August 30 6am to 8am.\" Write the body of the message. Write the purpose, why the renovation is necessary, why the renovation benefits the reader and the necessary proof, such as the building code or safety issues. Be direct; try not to include writing that does not support your message. Include bullet points or lists, if necessary. People are more likely to read memos that are not blocks of text. Since memos are fairly informal, you can create bulleted lists or use bold text to highlight a certain section of the renovation deadline or purpose. Edit your memo to 1 page. If you are giving a memo to a lot of people, the best way to ensure they will read it is to keep it short. If it is too long and the purpose is not immediately clear, they may put it away until they have free time. This is not true of legal memorandum and some company memos that include building reports or board motions. Make sure you know what length your audience is expecting. Proof your memo for spelling and grammar errors. If your writing skills are not strong, give it to a superior or colleague who can edit it. Sign the letter. Once it is approved, you will want to sign and date it to make it official. Include your contact information, and the contact information of anyone they can direct questions to at the bottom of the memo. Include necessary attachments. Print out copies of the memo and attachments for each of your contacts. Staple them to the memo before delivering them. Deliver your memo in a timely manner. People will need time to make plans during renovations, so try to get the information out to them when it is announced.",
    "sentences": [
        " Request copies of previous memoranda.",
        "You can get a feeling for the tone and formality of your organization by looking at examples of past notices.",
        "Ask your superior to only provide those samples that they have been pleased with.",
        "Obtain copies of contact information for all those who are affected by this memo.",
        "You will need to send each party a copy, and it can take a few days or weeks to obtain all the necessary addresses or emails.",
        "Gather any facts that are necessary to prove the need for a building renovation.",
        "If a housing or apartment board has passed a motion approving the renovations, ask for a copy of the motion, so that it can be requested or distributed.",
        "The larger the renovation, the more proof you will need.",
        "Establish deadlines.",
        "For major renovations, you may want to send the memo well in advance so they can make the necessary accommodations.",
        "If the renovation is last-minute, decide the date and time that it will occur, including time for people to make their accommodations.",
        "Write an outline of your memo.",
        "Any piece of business writing is used to convince the reader of something.",
        "Under headings, make a draft that includes the memo topic, the description, the deadlines and dates, the proof and the contact information for a follow up.",
        "Structure your memo.",
        "Use the company's logo and structure, if it will be a memo produced under the name of a company.",
        "The following are guidelines for formatting a memo:\nPlace the addressee name in the upper left hand corner of the word processing document.",
        "It can be a general or specific name, but it should be easily recognizable, so the person knows the building renovation memo relates to them.",
        "Next, type in the person, people or company who is writing the memo.",
        "If you are writing the memo for a department or company, you may need to request approval before sending the memo out under someone else's name.",
        "Place the date below.",
        "Memos should be produced fairly quickly, because they usually ask someone to take notice of something in a timely manner.",
        "Write the subject of the building renovation memo, using the best descriptive words possible.",
        "For example, instead of writing \"Subject: Building Renovations,\" write \"Elevator Repair, August 30 6am to 8am.\"",
        "Write the body of the message.",
        "Write the purpose, why the renovation is necessary, why the renovation benefits the reader and the necessary proof, such as the building code or safety issues.",
        "Be direct; try not to include writing that does not support your message.",
        "Include bullet points or lists, if necessary.",
        "People are more likely to read memos that are not blocks of text.",
        "Since memos are fairly informal, you can create bulleted lists or use bold text to highlight a certain section of the renovation deadline or purpose.",
        "Edit your memo to 1 page.",
        "If you are giving a memo to a lot of people, the best way to ensure they will read it is to keep it short.",
        "If it is too long and the purpose is not immediately clear, they may put it away until they have free time.",
        "This is not true of legal memorandum and some company memos that include building reports or board motions.",
        "Make sure you know what length your audience is expecting.",
        "Proof your memo for spelling and grammar errors.",
        "If your writing skills are not strong, give it to a superior or colleague who can edit it.",
        "Sign the letter.",
        "Once it is approved, you will want to sign and date it to make it official.",
        "Include your contact information, and the contact information of anyone they can direct questions to at the bottom of the memo.",
        "Include necessary attachments.",
        "Print out copies of the memo and attachments for each of your contacts.",
        "Staple them to the memo before delivering them.",
        "Deliver your memo in a timely manner.",
        "People will need time to make plans during renovations, so try to get the information out to them when it is announced."
    ]
}