{
    "title": "How to Travel from UK to the US by Boat",
    "url": "https://www.wikihow.com/Travel-from-UK-to-the-US-by-Boat",
    "category_hierarchy": [
        "Travel",
        "Destinations",
        "North America Travel",
        "United States Travel"
    ],
    "methods": [
        {
            "name": "Booking a Cruise",
            "steps": [
                {
                    "headline": "Budget to spend around £700-3000 per person to travel by cruise.",
                    "description": "Inside staterooms without windows cost between £650 and £900 per person. Suites can cost up to £4,000 per person per 7-night voyage. Traveling to the US by boat is often more expensive than flying. Every winter, cruise lines relocate from Europe to the Caribbean. You can save money by looking specifically for one of these positioning cruises leaving from London or Southampton."
                },
                {
                    "headline": "Go through a travel agency to compare different cruise lines.",
                    "description": "A travel agent will be familiar with the different offerings and options on board different cruise lines. Tell your travel agent what you are looking for in a transatlantic cruise, such as top-notch performances every night, lots of activities during the day, a family-friendly environment, or a romantic getaway. A travel agent will be able to find you a trip that fits with what you want. Some cruise lines that offer transatlantic trips include Royal Caribbean, Disney, Holland America, Princess, Celebrity, Norwegian, Silversea, Seabourn, and Crystal. You can also purchase a ticket directly from a cruise line, if you already have one in mind."
                },
                {
                    "headline": "Book a summer trip for the best weather.",
                    "description": "To take advantage of the outdoor facilities on a cruise ship, go for a summer cruise during the peak months of June-August. To save a little bit on the cost of your ticket, go for a spring or fall trip. Cruises are sometimes not available in winter between January and March. Check with the cruise line that you are interested in."
                },
                {
                    "headline": "Expect to spend extra for drinks and internet access.",
                    "description": "While some cruise lines will include WiFi and drinks in the cost of your ticket, these tickets are usually more expensive. Other cruise lines will charge you a daily rate for internet access or alcoholic drinks. Most cruises will offer drink packages, which you can purchase to drink wine, beer, and some cocktails over the course of your trip. Some cruise ships also have restaurants and shops."
                },
                {
                    "headline": "Plan to spend around 6-8 days on the crossing.",
                    "description": "Depending on the time of year and weather, an Atlantic crossing on a cruise ship will take around a week. Some cruises add in a few ports of call, which can extend the trip. Most transatlantic cruises take no longer than 2 weeks total. Cruises that combine an Atlantic crossing with an exploratory cruise experience can take as long as 3 weeks."
                },
                {
                    "headline": "Pack for changing weather and strict dress codes.",
                    "description": "No matter what season you travel in, you will see changing weather in a week or more at sea. Be prepared to layer up with sweaters, jackets, and scarves. Some cruise lines also have strict dress codes for dinner. Check into the requirements before you leave. Some cruise lines may even require a tux or gown for certain meals or events."
                },
                {
                    "headline": "Take advantage of activities on board.",
                    "description": "Most cruises offer an array of activities and entertainment. These can include lectures, performances, and games. You can also usually expect a pool, spa, and social events on offer daily. Use your time on board to try something new! If you book a cruise without a lot of entertainment on board, be sure to bring plenty of books or a portable hobby."
                },
                {
                    "headline": "Bring motion sickness medication with you if you get seasick.",
                    "description": "Cruise ships have stabilizers that make it feel like you aren't even at sea most of the time. However, sometimes rough seas are too much for a ship's stabilizers. If you think you might get seasick, bring a dimenhydrinate with you. Usually it is also available for purchase on board as well. Cruises will have doctors on board in case of emergency situations."
                }
            ]
        },
        {
            "name": "Traveling by Cargo Ship",
            "steps": [
                {
                    "headline": "Fit the age requirements to travel by cargo freighter.",
                    "description": "Usually, cargo ships require all travelers to be between ages 5-79. Travelers over the age of 65 also need a certificate from a physician stating that they are healthy enough for the journey. Pregnant women typically can't travel by cargo ship. These ships usually don't have a doctor on board, so high-risk passengers typically can't board."
                },
                {
                    "headline": "Book your travel at least 6 months in advance.",
                    "description": "Cargo ships have a limited number of rooms available to travelers. If there is a specific route you want to make sure you get on, book your place on board at least 6 months beforehand. Keep in mind that schedules can change. You will know the exact schedule of the crossing 5-10 days in advance. Sometimes, spaces open up on a ship and you can book travel last-minute at a reduced rate."
                },
                {
                    "headline": "Expect to spend around £1,300 on a one-way ticket.",
                    "description": "Cargo ship cruises typically charge a daily rate of about £130. A transatlantic crossing takes around 10 days. You will be charged based on the amount of time the voyage is expected to take. Companies typically don't refund you if the trip takes shorter than expected or charge you if the trip takes longer. The cost of your ticket usually also covers the price of your meals and port fees. If you shop around for tickets, you can sometimes find a rate as low as around £50/day."
                },
                {
                    "headline": "Plan to spend around 10 days at sea one way.",
                    "description": "A transatlantic journey can take around a week or up to 12 days, depending on the season, the weather, and how many stops the ship makes along the way to your destination. Have some flexibility in your schedule in case the trip takes longer than expected. Freighters make delivery stops, since their main duty is to deliver cargo. These stops can take twelve hours to a few days. You must be flexible with your schedule in order to travel this way."
                },
                {
                    "headline": "Book your travel through an agent that specializes in freighter ships.",
                    "description": "Unlike luxury cruises, cargo cruises typically aren't advertised through mainstream travel agencies. You can search for specialty agencies online that can help you find a suitable trip. You can also go directly to a freighter company's website and look for a contact email address to ask about passenger fares."
                },
                {
                    "headline": "Bring lots of books, music, and entertainment that doesn't require internet access.",
                    "description": "Most cargo ships don't have WiFi on board. Unlike a cruise, the purpose of the voyage is not to entertain passengers, so there usually aren't any planned activities besides meals. This gives you plenty of time to read, have conversations with others on board, or just soak in the views. You can buy alcohol, cigarettes, and basic toiletries on board, but don't expect a huge selection. Some ships have a pool, but don't count on it."
                },
                {
                    "headline": "Take motion sickness medication with you if you get seasick.",
                    "description": "Cargo ships don't have stabilizers like cruise ships do. While you probably won't even notice you are at sea on large cargo ships, smaller cargo ships can tip and pitch around. If you know that you are prone to seasickness, it's best to be prepared and bring medication with you. Dimenhydrinate pills or scopolamine patches work well for motion sickness."
                }
            ]
        }
    ],
    "tyn": [
        "Credit card",
        "Flexible schedule",
        "Passport",
        "$700 to $4,000"
    ],
    "text": " Booking a Cruise Budget to spend around £700-3000 per person to travel by cruise. Inside staterooms without windows cost between £650 and £900 per person. Suites can cost up to £4,000 per person per 7-night voyage. Traveling to the US by boat is often more expensive than flying. Every winter, cruise lines relocate from Europe to the Caribbean. You can save money by looking specifically for one of these positioning cruises leaving from London or Southampton. Go through a travel agency to compare different cruise lines. A travel agent will be familiar with the different offerings and options on board different cruise lines. Tell your travel agent what you are looking for in a transatlantic cruise, such as top-notch performances every night, lots of activities during the day, a family-friendly environment, or a romantic getaway. A travel agent will be able to find you a trip that fits with what you want. Some cruise lines that offer transatlantic trips include Royal Caribbean, Disney, Holland America, Princess, Celebrity, Norwegian, Silversea, Seabourn, and Crystal. You can also purchase a ticket directly from a cruise line, if you already have one in mind. Book a summer trip for the best weather. To take advantage of the outdoor facilities on a cruise ship, go for a summer cruise during the peak months of June-August. To save a little bit on the cost of your ticket, go for a spring or fall trip. Cruises are sometimes not available in winter between January and March. Check with the cruise line that you are interested in. Expect to spend extra for drinks and internet access. While some cruise lines will include WiFi and drinks in the cost of your ticket, these tickets are usually more expensive. Other cruise lines will charge you a daily rate for internet access or alcoholic drinks. Most cruises will offer drink packages, which you can purchase to drink wine, beer, and some cocktails over the course of your trip. Some cruise ships also have restaurants and shops. Plan to spend around 6-8 days on the crossing. Depending on the time of year and weather, an Atlantic crossing on a cruise ship will take around a week. Some cruises add in a few ports of call, which can extend the trip. Most transatlantic cruises take no longer than 2 weeks total. Cruises that combine an Atlantic crossing with an exploratory cruise experience can take as long as 3 weeks. Pack for changing weather and strict dress codes. No matter what season you travel in, you will see changing weather in a week or more at sea. Be prepared to layer up with sweaters, jackets, and scarves. Some cruise lines also have strict dress codes for dinner. Check into the requirements before you leave. Some cruise lines may even require a tux or gown for certain meals or events. Take advantage of activities on board. Most cruises offer an array of activities and entertainment. These can include lectures, performances, and games. You can also usually expect a pool, spa, and social events on offer daily. Use your time on board to try something new! If you book a cruise without a lot of entertainment on board, be sure to bring plenty of books or a portable hobby. Bring motion sickness medication with you if you get seasick. Cruise ships have stabilizers that make it feel like you aren't even at sea most of the time. However, sometimes rough seas are too much for a ship's stabilizers. If you think you might get seasick, bring a dimenhydrinate with you. Usually it is also available for purchase on board as well. Cruises will have doctors on board in case of emergency situations. Traveling by Cargo Ship Fit the age requirements to travel by cargo freighter. Usually, cargo ships require all travelers to be between ages 5-79. Travelers over the age of 65 also need a certificate from a physician stating that they are healthy enough for the journey. Pregnant women typically can't travel by cargo ship. These ships usually don't have a doctor on board, so high-risk passengers typically can't board. Book your travel at least 6 months in advance. Cargo ships have a limited number of rooms available to travelers. If there is a specific route you want to make sure you get on, book your place on board at least 6 months beforehand. Keep in mind that schedules can change. You will know the exact schedule of the crossing 5-10 days in advance. Sometimes, spaces open up on a ship and you can book travel last-minute at a reduced rate. Expect to spend around £1,300 on a one-way ticket. Cargo ship cruises typically charge a daily rate of about £130. A transatlantic crossing takes around 10 days. You will be charged based on the amount of time the voyage is expected to take. Companies typically don't refund you if the trip takes shorter than expected or charge you if the trip takes longer. The cost of your ticket usually also covers the price of your meals and port fees. If you shop around for tickets, you can sometimes find a rate as low as around £50/day. Plan to spend around 10 days at sea one way. A transatlantic journey can take around a week or up to 12 days, depending on the season, the weather, and how many stops the ship makes along the way to your destination. Have some flexibility in your schedule in case the trip takes longer than expected. Freighters make delivery stops, since their main duty is to deliver cargo. These stops can take twelve hours to a few days. You must be flexible with your schedule in order to travel this way. Book your travel through an agent that specializes in freighter ships. Unlike luxury cruises, cargo cruises typically aren't advertised through mainstream travel agencies. You can search for specialty agencies online that can help you find a suitable trip. You can also go directly to a freighter company's website and look for a contact email address to ask about passenger fares. Bring lots of books, music, and entertainment that doesn't require internet access. Most cargo ships don't have WiFi on board. Unlike a cruise, the purpose of the voyage is not to entertain passengers, so there usually aren't any planned activities besides meals. This gives you plenty of time to read, have conversations with others on board, or just soak in the views. You can buy alcohol, cigarettes, and basic toiletries on board, but don't expect a huge selection. Some ships have a pool, but don't count on it. Take motion sickness medication with you if you get seasick. Cargo ships don't have stabilizers like cruise ships do. While you probably won't even notice you are at sea on large cargo ships, smaller cargo ships can tip and pitch around. If you know that you are prone to seasickness, it's best to be prepared and bring medication with you. Dimenhydrinate pills or scopolamine patches work well for motion sickness.",
    "sentences": [
        " Booking a Cruise Budget to spend around £700-3000 per person to travel by cruise.",
        "Inside staterooms without windows cost between £650 and £900 per person.",
        "Suites can cost up to £4,000 per person per 7-night voyage.",
        "Traveling to the US by boat is often more expensive than flying.",
        "Every winter, cruise lines relocate from Europe to the Caribbean.",
        "You can save money by looking specifically for one of these positioning cruises leaving from London or Southampton.",
        "Go through a travel agency to compare different cruise lines.",
        "A travel agent will be familiar with the different offerings and options on board different cruise lines.",
        "Tell your travel agent what you are looking for in a transatlantic cruise, such as top-notch performances every night, lots of activities during the day, a family-friendly environment, or a romantic getaway.",
        "A travel agent will be able to find you a trip that fits with what you want.",
        "Some cruise lines that offer transatlantic trips include Royal Caribbean, Disney, Holland America, Princess, Celebrity, Norwegian, Silversea, Seabourn, and Crystal.",
        "You can also purchase a ticket directly from a cruise line, if you already have one in mind.",
        "Book a summer trip for the best weather.",
        "To take advantage of the outdoor facilities on a cruise ship, go for a summer cruise during the peak months of June-August.",
        "To save a little bit on the cost of your ticket, go for a spring or fall trip.",
        "Cruises are sometimes not available in winter between January and March.",
        "Check with the cruise line that you are interested in.",
        "Expect to spend extra for drinks and internet access.",
        "While some cruise lines will include WiFi and drinks in the cost of your ticket, these tickets are usually more expensive.",
        "Other cruise lines will charge you a daily rate for internet access or alcoholic drinks.",
        "Most cruises will offer drink packages, which you can purchase to drink wine, beer, and some cocktails over the course of your trip.",
        "Some cruise ships also have restaurants and shops.",
        "Plan to spend around 6-8 days on the crossing.",
        "Depending on the time of year and weather, an Atlantic crossing on a cruise ship will take around a week.",
        "Some cruises add in a few ports of call, which can extend the trip.",
        "Most transatlantic cruises take no longer than 2 weeks total.",
        "Cruises that combine an Atlantic crossing with an exploratory cruise experience can take as long as 3 weeks.",
        "Pack for changing weather and strict dress codes.",
        "No matter what season you travel in, you will see changing weather in a week or more at sea.",
        "Be prepared to layer up with sweaters, jackets, and scarves.",
        "Some cruise lines also have strict dress codes for dinner.",
        "Check into the requirements before you leave.",
        "Some cruise lines may even require a tux or gown for certain meals or events.",
        "Take advantage of activities on board.",
        "Most cruises offer an array of activities and entertainment.",
        "These can include lectures, performances, and games.",
        "You can also usually expect a pool, spa, and social events on offer daily.",
        "Use your time on board to try something new!",
        "If you book a cruise without a lot of entertainment on board, be sure to bring plenty of books or a portable hobby.",
        "Bring motion sickness medication with you if you get seasick.",
        "Cruise ships have stabilizers that make it feel like you aren't even at sea most of the time.",
        "However, sometimes rough seas are too much for a ship's stabilizers.",
        "If you think you might get seasick, bring a dimenhydrinate with you.",
        "Usually it is also available for purchase on board as well.",
        "Cruises will have doctors on board in case of emergency situations.",
        "Traveling by Cargo Ship Fit the age requirements to travel by cargo freighter.",
        "Usually, cargo ships require all travelers to be between ages 5-79.",
        "Travelers over the age of 65 also need a certificate from a physician stating that they are healthy enough for the journey.",
        "Pregnant women typically can't travel by cargo ship.",
        "These ships usually don't have a doctor on board, so high-risk passengers typically can't board.",
        "Book your travel at least 6 months in advance.",
        "Cargo ships have a limited number of rooms available to travelers.",
        "If there is a specific route you want to make sure you get on, book your place on board at least 6 months beforehand.",
        "Keep in mind that schedules can change.",
        "You will know the exact schedule of the crossing 5-10 days in advance.",
        "Sometimes, spaces open up on a ship and you can book travel last-minute at a reduced rate.",
        "Expect to spend around £1,300 on a one-way ticket.",
        "Cargo ship cruises typically charge a daily rate of about £130.",
        "A transatlantic crossing takes around 10 days.",
        "You will be charged based on the amount of time the voyage is expected to take.",
        "Companies typically don't refund you if the trip takes shorter than expected or charge you if the trip takes longer.",
        "The cost of your ticket usually also covers the price of your meals and port fees.",
        "If you shop around for tickets, you can sometimes find a rate as low as around £50/day.",
        "Plan to spend around 10 days at sea one way.",
        "A transatlantic journey can take around a week or up to 12 days, depending on the season, the weather, and how many stops the ship makes along the way to your destination.",
        "Have some flexibility in your schedule in case the trip takes longer than expected.",
        "Freighters make delivery stops, since their main duty is to deliver cargo.",
        "These stops can take twelve hours to a few days.",
        "You must be flexible with your schedule in order to travel this way.",
        "Book your travel through an agent that specializes in freighter ships.",
        "Unlike luxury cruises, cargo cruises typically aren't advertised through mainstream travel agencies.",
        "You can search for specialty agencies online that can help you find a suitable trip.",
        "You can also go directly to a freighter company's website and look for a contact email address to ask about passenger fares.",
        "Bring lots of books, music, and entertainment that doesn't require internet access.",
        "Most cargo ships don't have WiFi on board.",
        "Unlike a cruise, the purpose of the voyage is not to entertain passengers, so there usually aren't any planned activities besides meals.",
        "This gives you plenty of time to read, have conversations with others on board, or just soak in the views.",
        "You can buy alcohol, cigarettes, and basic toiletries on board, but don't expect a huge selection.",
        "Some ships have a pool, but don't count on it.",
        "Take motion sickness medication with you if you get seasick.",
        "Cargo ships don't have stabilizers like cruise ships do.",
        "While you probably won't even notice you are at sea on large cargo ships, smaller cargo ships can tip and pitch around.",
        "If you know that you are prone to seasickness, it's best to be prepared and bring medication with you.",
        "Dimenhydrinate pills or scopolamine patches work well for motion sickness."
    ]
}