{
    "title": "How to Cook Pork Tenderloin in the Oven",
    "url": "https://www.wikihow.com/Cook-Pork-Tenderloin-in-the-Oven",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Pork"
    ],
    "methods": [
        {
            "name": "Roasting the Tenderloin",
            "steps": [
                {
                    "headline": "Put an oven-safe skillet into the oven and turn the oven to 450 °F (232 °C).",
                    "description": "You can use a cast-iron skillet or any skillet that's safe to put into the oven. Then, preheat the oven while you prepare the tenderloin. Heating the skillet will help your tenderloin brown when you put it into the pan."
                },
                {
                    "headline": "Pat the pork tenderloin dry and remove silverskin if it's visible.",
                    "description": "Get out 1 to 1 ⁄2 pounds (0.45 to 0.68 kg) of pork tenderloin and take it out of the package. Pat every side of the tenderloin dry with a paper towel and look for a thin, silver membrane covering the meat. If you see silverskin, remove it or the meat will be tough.Tip: To remove the silverskin, slide the tip of a paring knife under the thin membrane to loosen it. Then, use your hands to pull off the membrane. Since pork tenderloins are usually smaller cuts of meat, there may be 2 small tenderloins packaged together."
                },
                {
                    "headline": "Sprinkle the tenderloin with salt and pepper.",
                    "description": "Scatter 1 teaspoon (5.5 g) of kosher salt and 1/2 teaspoon (0.5 g) of freshly ground black pepper over the surface of the tenderloin. Turn the tenderloin a few times so salt and pepper that fell sticks to the meat. If you're in a rush for time or want to keep the seasonings minimal, you don't need to season the tenderloin any more than this."
                },
                {
                    "headline": "Rub 1 to 2 tablespoons (6 to 12 g) of spice or seasoning mix over the tenderloin.",
                    "description": "If you're seasoning a small tenderloin that's around 1 pound (450 g), you might need less seasoning. You can use your favorite spice rub or seasoning mix, such as:\nDry BBQ rub\nCajun seasoning\nCurry powder or garam masala\nZa'atar\nChinese 5-spice blend"
                },
                {
                    "headline": "Take the pan out of the oven and swirl vegetable oil in the bottom.",
                    "description": "Put on oven mitts and remove the hot skillet from the preheated oven. Set it on the stove and pour in 1 teaspoon (4.9 ml) of vegetable oil. Then, carefully swirl the pan a little so the oil spreads across the skillet. The oil will prevent the tenderloin from sticking to the hot skillet."
                },
                {
                    "headline": "Put the tenderloin in the skillet and roast it for 20 to 25 minutes.",
                    "description": "Lay the seasoned tenderloin in the hot skillet and put it onto the middle rack of the oven. Carefully flip the tenderloin over and reduce the oven temperature to 400 °F (204 °C) once it's halfway through the cooking time. You may have to curl or bend the tenderloin so it fits in the skillet."
                },
                {
                    "headline": "Remove the pork when it reaches at least 145 °F (63 °C).",
                    "description": "Insert an instant-read meat thermometer into the thickest part of the tenderloin. Once it's reached at least 145 °F (63 °C), take the tenderloin out of the oven."
                },
                {
                    "headline": "Rest the pork tenderloin for 10 minutes.",
                    "description": "Cover the meat loosely with foil and let it rest for 10 minutes so it finishes cooking. The pork will continue to cook after you take it out of the oven and the juices will redistribute within the meat. The temperature of the meat will rise about 5 degrees as it rests."
                },
                {
                    "headline": "Slice the tenderloin into ⁄2 inch (1.3 cm) pieces before serving.",
                    "description": "Carefully lift back the foil and transfer the meat to a cutting board and use a serrated knife to carefully cut the tenderloin into thin slices. Serve the pork tenderloin with roasted vegetables, scalloped potatoes, or a garden salad. The meat should be much easier to handle since it's been resting for 10 minutes. Refrigerate the leftovers in an airtight container for up to 4 days. If you prefer, you can freeze the tenderloin for up to 3 months."
                }
            ]
        },
        {
            "name": "Trying Variations",
            "steps": [
                {
                    "headline": "Marinate the tenderloin for 3 hours to get more flavorful meat.",
                    "description": "If you have extra time, mix marinade ingredients in a resealable plastic bag. Add the pork tenderloin and seal the bag so the meat is coated in the marinade. Then, refrigerate the bag with the pork for at least 3 hours or up to overnight before you remove the pork and roast it in the oven. To make a lemon-herb marinade combine:Tip: If you don't have time to make your own marinade, use a bottle of your favorite oil-based salad dressing. For example, use Italian dressing, balsamic vinaigrette, or honey-Dijon dressing. Zest from 1/2 lemon\n\n⁄4 cup (59 ml) of olive oil\n\n⁄3 cup (160 ml) of freshly squeezed lemon juice\n1 tablespoon (8 g) of minced garlic\n2 teaspoons (3 g) of freshly minced rosemary leaves\n1/2 tablespoon (1 g) of fresh thyme leaves\n1 teaspoon (5 g) of Dijon mustard"
                },
                {
                    "headline": "Brine the pork tenderloin to make the meat more tender.",
                    "description": "Shake 1/4 cup (72 g) of salt in a large resealable bag with 4 cups (950 ml) of warm water until the salt dissolves. Add 2 tablespoons (30 ml) of apple cider vinegar, 2 tablespoons (24 g) of brown sugar, and 1 cup (140 g) of ice cubes. Then, add the pork tenderloin to the bag and refrigerate it for 20 minutes. When you're ready to bake the pork tenderloin, take it out of the marinade and rinse it. Then, pat it dry before you put it in the oven. Avoid brining the pork for more than 20 minutes or the meat will become mushy."
                },
                {
                    "headline": "Sear the tenderloin if you'd like the meat to have a caramelized crust.",
                    "description": "Once you've preheated the skillet, set it on the stove and turn the burner to high. Swirl the oil in the pan and add the pork. Let it cook for 1 to 2 minutes and use tongs to turn it. Then, sear it for another 1 to 2 minutes. Keep doing this until the entire surface of the tenderloin is browned. Put the tenderloin into a 400 °F (204 °C) oven and cook it for 10 to 12 minutes. Although you don't have to cook the outside of the pork tenderloin before tossing it in the oven, it will develop a deeper flavor and a golden exterior if you sear it first."
                },
                {
                    "headline": "Flavor the tenderloin with fresh herb butter just before serving.",
                    "description": "Mix 4 tablespoons (45 g) of softened butter with 1 handful of freshly chopped herbs, such as parsley, rosemary, or thyme. Spoon some of the softened butter over the sliced tenderloins just before serving. The butter will melt and create a light sauce. You can also stir in 2 minced garlic cloves if you like."
                }
            ]
        }
    ],
    "tyn": [
        "Knife and cutting board",
        "Oven-safe skillet",
        "Measuring cups and spoons",
        "Instant-read meat thermometer",
        "Aluminum foil"
    ],
    "text": " Roasting the Tenderloin Put an oven-safe skillet into the oven and turn the oven to 450 °F (232 °C). You can use a cast-iron skillet or any skillet that's safe to put into the oven. Then, preheat the oven while you prepare the tenderloin. Heating the skillet will help your tenderloin brown when you put it into the pan. Pat the pork tenderloin dry and remove silverskin if it's visible. Get out 1 to 1 ⁄2 pounds (0.45 to 0.68 kg) of pork tenderloin and take it out of the package. Pat every side of the tenderloin dry with a paper towel and look for a thin, silver membrane covering the meat. If you see silverskin, remove it or the meat will be tough.Tip: To remove the silverskin, slide the tip of a paring knife under the thin membrane to loosen it. Then, use your hands to pull off the membrane. Since pork tenderloins are usually smaller cuts of meat, there may be 2 small tenderloins packaged together. Sprinkle the tenderloin with salt and pepper. Scatter 1 teaspoon (5.5 g) of kosher salt and 1/2 teaspoon (0.5 g) of freshly ground black pepper over the surface of the tenderloin. Turn the tenderloin a few times so salt and pepper that fell sticks to the meat. If you're in a rush for time or want to keep the seasonings minimal, you don't need to season the tenderloin any more than this. Rub 1 to 2 tablespoons (6 to 12 g) of spice or seasoning mix over the tenderloin. If you're seasoning a small tenderloin that's around 1 pound (450 g), you might need less seasoning. You can use your favorite spice rub or seasoning mix, such as:\nDry BBQ rub\nCajun seasoning\nCurry powder or garam masala\nZa'atar\nChinese 5-spice blend Take the pan out of the oven and swirl vegetable oil in the bottom. Put on oven mitts and remove the hot skillet from the preheated oven. Set it on the stove and pour in 1 teaspoon (4.9 ml) of vegetable oil. Then, carefully swirl the pan a little so the oil spreads across the skillet. The oil will prevent the tenderloin from sticking to the hot skillet. Put the tenderloin in the skillet and roast it for 20 to 25 minutes. Lay the seasoned tenderloin in the hot skillet and put it onto the middle rack of the oven. Carefully flip the tenderloin over and reduce the oven temperature to 400 °F (204 °C) once it's halfway through the cooking time. You may have to curl or bend the tenderloin so it fits in the skillet. Remove the pork when it reaches at least 145 °F (63 °C). Insert an instant-read meat thermometer into the thickest part of the tenderloin. Once it's reached at least 145 °F (63 °C), take the tenderloin out of the oven. Rest the pork tenderloin for 10 minutes. Cover the meat loosely with foil and let it rest for 10 minutes so it finishes cooking. The pork will continue to cook after you take it out of the oven and the juices will redistribute within the meat. The temperature of the meat will rise about 5 degrees as it rests. Slice the tenderloin into ⁄2 inch (1.3 cm) pieces before serving. Carefully lift back the foil and transfer the meat to a cutting board and use a serrated knife to carefully cut the tenderloin into thin slices. Serve the pork tenderloin with roasted vegetables, scalloped potatoes, or a garden salad. The meat should be much easier to handle since it's been resting for 10 minutes. Refrigerate the leftovers in an airtight container for up to 4 days. If you prefer, you can freeze the tenderloin for up to 3 months. Trying Variations Marinate the tenderloin for 3 hours to get more flavorful meat. If you have extra time, mix marinade ingredients in a resealable plastic bag. Add the pork tenderloin and seal the bag so the meat is coated in the marinade. Then, refrigerate the bag with the pork for at least 3 hours or up to overnight before you remove the pork and roast it in the oven. To make a lemon-herb marinade combine:Tip: If you don't have time to make your own marinade, use a bottle of your favorite oil-based salad dressing. For example, use Italian dressing, balsamic vinaigrette, or honey-Dijon dressing. Zest from 1/2 lemon\n\n⁄4 cup (59 ml) of olive oil\n\n⁄3 cup (160 ml) of freshly squeezed lemon juice\n1 tablespoon (8 g) of minced garlic\n2 teaspoons (3 g) of freshly minced rosemary leaves\n1/2 tablespoon (1 g) of fresh thyme leaves\n1 teaspoon (5 g) of Dijon mustard Brine the pork tenderloin to make the meat more tender. Shake 1/4 cup (72 g) of salt in a large resealable bag with 4 cups (950 ml) of warm water until the salt dissolves. Add 2 tablespoons (30 ml) of apple cider vinegar, 2 tablespoons (24 g) of brown sugar, and 1 cup (140 g) of ice cubes. Then, add the pork tenderloin to the bag and refrigerate it for 20 minutes. When you're ready to bake the pork tenderloin, take it out of the marinade and rinse it. Then, pat it dry before you put it in the oven. Avoid brining the pork for more than 20 minutes or the meat will become mushy. Sear the tenderloin if you'd like the meat to have a caramelized crust. Once you've preheated the skillet, set it on the stove and turn the burner to high. Swirl the oil in the pan and add the pork. Let it cook for 1 to 2 minutes and use tongs to turn it. Then, sear it for another 1 to 2 minutes. Keep doing this until the entire surface of the tenderloin is browned. Put the tenderloin into a 400 °F (204 °C) oven and cook it for 10 to 12 minutes. Although you don't have to cook the outside of the pork tenderloin before tossing it in the oven, it will develop a deeper flavor and a golden exterior if you sear it first. Flavor the tenderloin with fresh herb butter just before serving. Mix 4 tablespoons (45 g) of softened butter with 1 handful of freshly chopped herbs, such as parsley, rosemary, or thyme. Spoon some of the softened butter over the sliced tenderloins just before serving. The butter will melt and create a light sauce. You can also stir in 2 minced garlic cloves if you like.",
    "sentences": [
        " Roasting the Tenderloin Put an oven-safe skillet into the oven and turn the oven to 450 °F (232 °C).",
        "You can use a cast-iron skillet or any skillet that's safe to put into the oven.",
        "Then, preheat the oven while you prepare the tenderloin.",
        "Heating the skillet will help your tenderloin brown when you put it into the pan.",
        "Pat the pork tenderloin dry and remove silverskin if it's visible.",
        "Get out 1 to 1 ⁄2 pounds (0.45 to 0.68 kg) of pork tenderloin and take it out of the package.",
        "Pat every side of the tenderloin dry with a paper towel and look for a thin, silver membrane covering the meat.",
        "If you see silverskin, remove it or the meat will be tough.Tip: To remove the silverskin, slide the tip of a paring knife under the thin membrane to loosen it.",
        "Then, use your hands to pull off the membrane.",
        "Since pork tenderloins are usually smaller cuts of meat, there may be 2 small tenderloins packaged together.",
        "Sprinkle the tenderloin with salt and pepper.",
        "Scatter 1 teaspoon (5.5 g) of kosher salt and 1/2 teaspoon (0.5 g) of freshly ground black pepper over the surface of the tenderloin.",
        "Turn the tenderloin a few times so salt and pepper that fell sticks to the meat.",
        "If you're in a rush for time or want to keep the seasonings minimal, you don't need to season the tenderloin any more than this.",
        "Rub 1 to 2 tablespoons (6 to 12 g) of spice or seasoning mix over the tenderloin.",
        "If you're seasoning a small tenderloin that's around 1 pound (450 g), you might need less seasoning.",
        "You can use your favorite spice rub or seasoning mix, such as:\nDry BBQ rub\nCajun seasoning\nCurry powder or garam masala\nZa'atar\nChinese 5-spice blend Take the pan out of the oven and swirl vegetable oil in the bottom.",
        "Put on oven mitts and remove the hot skillet from the preheated oven.",
        "Set it on the stove and pour in 1 teaspoon (4.9 ml) of vegetable oil.",
        "Then, carefully swirl the pan a little so the oil spreads across the skillet.",
        "The oil will prevent the tenderloin from sticking to the hot skillet.",
        "Put the tenderloin in the skillet and roast it for 20 to 25 minutes.",
        "Lay the seasoned tenderloin in the hot skillet and put it onto the middle rack of the oven.",
        "Carefully flip the tenderloin over and reduce the oven temperature to 400 °F (204 °C) once it's halfway through the cooking time.",
        "You may have to curl or bend the tenderloin so it fits in the skillet.",
        "Remove the pork when it reaches at least 145 °F (63 °C).",
        "Insert an instant-read meat thermometer into the thickest part of the tenderloin.",
        "Once it's reached at least 145 °F (63 °C), take the tenderloin out of the oven.",
        "Rest the pork tenderloin for 10 minutes.",
        "Cover the meat loosely with foil and let it rest for 10 minutes so it finishes cooking.",
        "The pork will continue to cook after you take it out of the oven and the juices will redistribute within the meat.",
        "The temperature of the meat will rise about 5 degrees as it rests.",
        "Slice the tenderloin into ⁄2 inch (1.3 cm) pieces before serving.",
        "Carefully lift back the foil and transfer the meat to a cutting board and use a serrated knife to carefully cut the tenderloin into thin slices.",
        "Serve the pork tenderloin with roasted vegetables, scalloped potatoes, or a garden salad.",
        "The meat should be much easier to handle since it's been resting for 10 minutes.",
        "Refrigerate the leftovers in an airtight container for up to 4 days.",
        "If you prefer, you can freeze the tenderloin for up to 3 months.",
        "Trying Variations Marinate the tenderloin for 3 hours to get more flavorful meat.",
        "If you have extra time, mix marinade ingredients in a resealable plastic bag.",
        "Add the pork tenderloin and seal the bag so the meat is coated in the marinade.",
        "Then, refrigerate the bag with the pork for at least 3 hours or up to overnight before you remove the pork and roast it in the oven.",
        "To make a lemon-herb marinade combine:Tip: If you don't have time to make your own marinade, use a bottle of your favorite oil-based salad dressing.",
        "For example, use Italian dressing, balsamic vinaigrette, or honey-Dijon dressing.",
        "Zest from 1/2 lemon\n\n⁄4 cup (59 ml) of olive oil\n\n⁄3 cup (160 ml) of freshly squeezed lemon juice\n1 tablespoon (8 g) of minced garlic\n2 teaspoons (3 g) of freshly minced rosemary leaves\n1/2 tablespoon (1 g) of fresh thyme leaves\n1 teaspoon (5 g) of Dijon mustard Brine the pork tenderloin to make the meat more tender.",
        "Shake 1/4 cup (72 g) of salt in a large resealable bag with 4 cups (950 ml) of warm water until the salt dissolves.",
        "Add 2 tablespoons (30 ml) of apple cider vinegar, 2 tablespoons (24 g) of brown sugar, and 1 cup (140 g) of ice cubes.",
        "Then, add the pork tenderloin to the bag and refrigerate it for 20 minutes.",
        "When you're ready to bake the pork tenderloin, take it out of the marinade and rinse it.",
        "Then, pat it dry before you put it in the oven.",
        "Avoid brining the pork for more than 20 minutes or the meat will become mushy.",
        "Sear the tenderloin if you'd like the meat to have a caramelized crust.",
        "Once you've preheated the skillet, set it on the stove and turn the burner to high.",
        "Swirl the oil in the pan and add the pork.",
        "Let it cook for 1 to 2 minutes and use tongs to turn it.",
        "Then, sear it for another 1 to 2 minutes.",
        "Keep doing this until the entire surface of the tenderloin is browned.",
        "Put the tenderloin into a 400 °F (204 °C) oven and cook it for 10 to 12 minutes.",
        "Although you don't have to cook the outside of the pork tenderloin before tossing it in the oven, it will develop a deeper flavor and a golden exterior if you sear it first.",
        "Flavor the tenderloin with fresh herb butter just before serving.",
        "Mix 4 tablespoons (45 g) of softened butter with 1 handful of freshly chopped herbs, such as parsley, rosemary, or thyme.",
        "Spoon some of the softened butter over the sliced tenderloins just before serving.",
        "The butter will melt and create a light sauce.",
        "You can also stir in 2 minced garlic cloves if you like."
    ]
}