{
    "title": "How to Jailbreak an iPod Touch",
    "url": "https://www.wikihow.com/Jailbreak-an-iPod-Touch",
    "category_hierarchy": [
        "Computers and Electronics",
        "Consumer Electronics",
        "Portable Media Players",
        "IPods",
        "IPod Touch"
    ],
    "methods": [
        {
            "name": "iOS 8.0 - 8.3",
            "steps": [
                {
                    "headline": "Download the TaiG jailbreaking utility.",
                    "description": "This utility is only available for Windows computers, but you can use it on Mac if you're running Windows in a virtual machine. You can download it from taig.com/en/. Some browsers may mark TaiG as malicious software, but this warning can be safely ignored as long as you downloaded TaiG directly from the developers."
                },
                {
                    "headline": "Connect your iPod Touch to your computer.",
                    "description": "Use the included USB cable to connect the iPod to your computer."
                },
                {
                    "headline": "Uninstall your version of iTunes.",
                    "description": "If you keep your iTunes up to date, you may have problems getting the jailbreak tool to work. The TaiG utility requires iTunes 12.1.1, which is a slightly older version. In order to downgrade to this version, you'll need to completely uninstall iTunes on your computer first. Open the Control Panel and select \"Programs and Features\" or \"Uninstall a program\". Select iTunes from the list and click Uninstall. Download and install the correct version of iTunes from support.apple.com/kb/DL1784."
                },
                {
                    "headline": "Disable the passcode on your iPod.",
                    "description": "If your iPod has a passcode to protect it, you'll need to disable it during the jailbreak process. Open the Settings app and select \"Passcode\". Enter your current passcode, and then toggle the passcode off. You can turn it back on after jailbreaking."
                },
                {
                    "headline": "Disable \"Find My iPod\".",
                    "description": "If you have this Apple tracking service enabled, you'll need to disable it during the jailbreaking process. Open the Settings app and select \"iCloud\". Toggle \"Find My iPod\" off and enter your Apple ID password to confirm. You can turn Find My iPod back on after jailbreaking."
                },
                {
                    "headline": "Backup your iPod.",
                    "description": "Use iTunes to create a backup of your iPod before starting. This will let you easily restore to your previous settings if something goes wrong during the jailbreaking process. Select your iPod in iTunes, select \"This computer\", and then click the Back Up Now button. This will create a backup of your device on your computer. Make sure backup encryption is not enabled. Uncheck the \"Encrypt iPhone backup\" box if it is checked. If your previous backup was encrypted, you'll need to make a new unencrypted one."
                },
                {
                    "headline": "Close iTunes and open the TaiG jailbreak program.",
                    "description": "Make sure that iTunes is closed before running TaiG."
                },
                {
                    "headline": "Uncheck the \"3K Assistant\" box.",
                    "description": "This is unnecessary software that TaiG tries to add. Make sure to keep the Cydia box checked."
                },
                {
                    "headline": "Click the green \"Start\" button.",
                    "description": "This will begin the jailbreaking process, which will take a few minutes to complete. Your device will reboot multiple times during the jailbreak process, and you can monitor the jailbreak progress in the TaiG window. Don't touch your device's screen or disconnect it during the jailbreak process."
                },
                {
                    "headline": "Launch Cydia.",
                    "description": "This is the jailbreak package manager, and can be found on one of your device's Home screens after jailbreaking. When you first launch Cydia, you'll see the \"Preparing Filesystem\" message. This process may take a few minutes to finish, but is essential for a working jailbreak. Cydia will automatically exit and reboot your device when its finished."
                },
                {
                    "headline": "Use your jailbroken iPod.",
                    "description": "Once TaiG is finished and Cydia has built its filesystem, your device will be jailbroken and you can start installing apps and tweaks from Cydia. Click here for tips on getting the most out of your jailbroken iOS device. After jailbreaking, you can safely re-enable your device's passcode and Find My iPhone."
                }
            ]
        },
        {
            "name": "iOS 7.1 - 7.1.2",
            "steps": [
                {
                    "headline": "Ensure that you have the latest version of iTunes installed.",
                    "description": "OS X - Click iTunes and select Check for Updates....\nWindows - Click Help and select Check for Updates...."
                },
                {
                    "headline": "Backup Your iPod.",
                    "description": "Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong. Backing up the iPod is a relatively quick process, depending on how much information you have. If you want to reset your iPod, don't backup."
                },
                {
                    "headline": "Disable your passcode.",
                    "description": "Tap Settings → Passcode → Turn Passcode Lock Off. The passcode can interfere with the jailbreak process."
                },
                {
                    "headline": "Download Pangu.",
                    "description": "This is the jailbreak software that you can use to jailbreak iOS 7.1, 7.1.1, or 7.1.2. Only download Pangu from http://en.7.pangu.io/."
                },
                {
                    "headline": "Connect your iPod to your computer.",
                    "description": "Close iTunes if it opens, and make sure no apps are running."
                },
                {
                    "headline": "Start Pangu.",
                    "description": "Click the black box to start jailbreaking."
                },
                {
                    "headline": "Follow the instructions in the Pangu program.",
                    "description": "You will be asked to set your iPod's date to June 2nd. Tap Settings → General → Date & Time to change the iPod's date."
                },
                {
                    "headline": "Tap the new Pangu app on your Home screen.",
                    "description": "Your iPad will reboot several times. After it is done rebooting, you will see the Cydia app on your Home screen."
                }
            ]
        },
        {
            "name": "iOS 7.0 - 7.0.6",
            "steps": [
                {
                    "headline": "Ensure that you have the latest version of iTunes installed.",
                    "description": "Close iTunes after updating it. OS X - Click iTunes and select Check for Updates....\nWindows - Click Help and select Check for Updates...."
                },
                {
                    "headline": "Backup Your iPod.",
                    "description": "Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong. Backing up the iPod is a relatively quick process, depending on how much information you have. If you want to reset your iPod, don't backup."
                },
                {
                    "headline": "Disable your passcode.",
                    "description": "Tap Settings → General → Passcode Lock → Turn Passcode Lock Off. The passcode can interfere with the jailbreak process."
                },
                {
                    "headline": "Download evasi0n7.",
                    "description": "This is the jailbreak software that allows you to jailbreak iOS 7.0-7.0.6. Make sure to download the software from evasi0n.com."
                },
                {
                    "headline": "Start the jailbreak.",
                    "description": "Ensure that your iPod is showing up in the evasi0n window, and then click Jailbreak."
                },
                {
                    "headline": "Wait for the jailbreak to complete.",
                    "description": "Most of the process is automated. Follow any prompts that appear in the evasi0n7 window."
                },
                {
                    "headline": "Launch Cydia.",
                    "description": "Once the jailbreak is complete, launch the Cydia app on your Home screen to finish setting up the new file system. Your iPod will restart."
                },
                {
                    "headline": "Open Cydia one more time.",
                    "description": "After resetting, open Cydia one last time to finish the setup process. Once the \"Reloading Data\" box appears and then disappears, you're good to go."
                }
            ]
        },
        {
            "name": "iOS 6.1.3 - 6.1.6",
            "steps": [
                {
                    "headline": "Backup Your iPod.",
                    "description": "Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong. Backing up the iPod is a relatively quick process, depending on how much information you have. If you want to reset your iPod, don't backup. This only works for the 4th and 5th generation iPod touch."
                },
                {
                    "headline": "Disable your passcode.",
                    "description": "Tap Settings → General → Passcode Lock → Turn Passcode Lock Off. The passcode can interfere with the jailbreak process."
                },
                {
                    "headline": "Download and extract p0sixspwn on your computer.",
                    "description": "This is the jailbreak program, and will need to be extracted from the ZIP file that it downloads in."
                },
                {
                    "headline": "Run p0sixspwn.",
                    "description": "If you are using Windows, right-click and select \"Run as Administrator\". If you are using Windows 8, right-click on the p0sixspwn file and select Properties. Click the Compatibility tab and opt to run the program in Windows 7 mode."
                },
                {
                    "headline": "Connect your iPod to your computer.",
                    "description": "You should see it detected in p0sixspwn."
                },
                {
                    "headline": "Start the jailbreak process.",
                    "description": "Click Jailbreak to start."
                },
                {
                    "headline": "Wait for the jailbreak process to complete.",
                    "description": "p0sixspwn handles everything automatically, and you can monitor the progress on your computer."
                }
            ]
        },
        {
            "name": "iOS 6.0.0 - 6.1.2",
            "steps": [
                {
                    "headline": "Backup Your iPod.",
                    "description": "Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong. Backing up the iPod is a relatively quick process, depending on how much information you have."
                },
                {
                    "headline": "Download the jailbreak program.",
                    "description": "To jailbreak version 6.0.0-6.1.2, download free jailbreak software. Evasi0n is currently the easiest and most pain-free way to jailbreak the newest versions of iOS. Do not pay for any jailbreak programs, as the software is freely available online directly from the developers. This is an untethered jailbreak. That means that once the jailbreak process is complete, your iPod will be permanently jailbroken, until you revert the process yourself or download an update from Apple that renders the jailbreak unusable. Be sure to download the correct version for your computer’s operating system. For a PC you will need at least Windows XP. For a Mac, you need OS X.6 or newer."
                },
                {
                    "headline": "Close any apps running on your iPod.",
                    "description": "Make sure that the iPod is showing your Home Screen and that it is still properly connected to your computer. You may lose data in apps that are running while you jailbreak, so be sure that you see the Home Screen before you start the jailbreak process."
                },
                {
                    "headline": "Run the evasi0n software.",
                    "description": "iTunes should not be running on your computer. Click the “Jailbreak” button. The jailbreak process will take several minutes. Don’t run any programs on your computer and don’t touch the iPod’s power button. Too many programs running on your computer can slow down the jailbreak process and corrupt the installation, forcing you to restart the process. Turning the power off during the jailbreaking process could render your phone inoperable."
                },
                {
                    "headline": "When prompted, run the Jailbreak app.",
                    "description": "This app will appear on the Home Screen of your iPod. Tap it and the jailbreak process will continue."
                },
                {
                    "headline": "Open Cydia.",
                    "description": "Once the iPod has finished the jailbreak process, an app called  Cydia will appear on your home screen. This is the alternative to Apple’s iTunes store, where you can access apps that do not conform to the terms of Apple’s store. Cydia will need to download some data before the jailbreak can be completed. The words “Reloading Data” will show up and then disappear."
                },
                {
                    "headline": "Install third-party apps.",
                    "description": "Your iPod is now jailbroken. Be sure to re-enable any passwords and locks. You can now install any third-party apps to your iPod."
                }
            ]
        },
        {
            "name": "iOS 5.1.1 or 5.0.1",
            "steps": [
                {
                    "headline": "Backup Your iPod.",
                    "description": "Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong. Backing up the iPod is a relatively quick process, depending on how much information you have."
                },
                {
                    "headline": "Download Absinthe 2, a free jailbreak firmware program.",
                    "description": "Absinthe is one of the easiest to use programs for iOS 5.1.1 jailbreaking. They also offer a 5.0.1 jailbreak that follows the same steps. Connect your iPod to your computer and run the program. Click the “Jailbreak” button. This is an untethered jailbreak. That means that once the jailbreak process is complete, your iPod will be permanently jailbroken, until you revert the process yourself or download an update from Apple that renders the jailbreak unusable."
                },
                {
                    "headline": "Your iPod will automatically begin the jailbreak process.",
                    "description": "Pay attention to any onscreen instructions that you may need to complete to get your iPod into  DFU mode. You may need to click “Jailbreak” again. After a short while, a “Complete” message will be displayed. The iPod will automatically reboot."
                },
                {
                    "headline": "Open the Loader app on your home screen.",
                    "description": "This will download and install Cydia. Cydia will be used to find and install apps that aren't normally permitted on Apple iPods."
                },
                {
                    "headline": "Reboot your iPod one more time.",
                    "description": "After this, your iPod is jailbroken and ready for use."
                }
            ]
        },
        {
            "name": "iOS 4.3.3 and Older",
            "steps": [
                {
                    "headline": "Backup Your iPod.",
                    "description": "Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong. Backing up the iPod is a relatively quick process, depending on how much information you have."
                },
                {
                    "headline": "Go to the JailbreakMe website on your iPod.",
                    "description": "You must access the site through your Safari browser, and not on your computer. The site will automatically detect whether your iPod is compatible with this method of jailbreaking. Jailbreak me only works on iOS 4.3.3 and below. Newer versions of iOS should use other methods in this guide."
                },
                {
                    "headline": "Select the \"Slide to Jailbreak\" button.",
                    "description": "Wait until your iPod downloads the application. How long this takes depends on how fast your connection is; the process can take up to five minutes. Once you see that the app \"Cydia\" is installed on your iPod, your iPod has been jailbroken. It will appear as a pop-up."
                },
                {
                    "headline": "Press OK. You will return to your home screen.",
                    "description": "Cydia will now be included alongside your other apps. You are now free to download unapproved apps and tweaks that aren’t allowed on the Apple store."
                },
                {
                    "headline": "Reboot your iPod.",
                    "description": "If you encounter any problems, a reboot should usually fix them. In the worst-case scenario, you can always restore your iPod and start the jailbreak process all over again."
                }
            ]
        }
    ],
    "tyn": [
        "A Mac or PC with internet access and the latest version of iTunes. (Recommended)",
        "An iPod Touch with cable",
        "Wi-Fi Access"
    ],
    "text": " iOS 8.0 - 8.3 Download the TaiG jailbreaking utility. This utility is only available for Windows computers, but you can use it on Mac if you're running Windows in a virtual machine. You can download it from taig.com/en/. Some browsers may mark TaiG as malicious software, but this warning can be safely ignored as long as you downloaded TaiG directly from the developers. Connect your iPod Touch to your computer. Use the included USB cable to connect the iPod to your computer. Uninstall your version of iTunes. If you keep your iTunes up to date, you may have problems getting the jailbreak tool to work. The TaiG utility requires iTunes 12.1.1, which is a slightly older version. In order to downgrade to this version, you'll need to completely uninstall iTunes on your computer first. Open the Control Panel and select \"Programs and Features\" or \"Uninstall a program\". Select iTunes from the list and click Uninstall. Download and install the correct version of iTunes from support.apple.com/kb/DL1784. Disable the passcode on your iPod. If your iPod has a passcode to protect it, you'll need to disable it during the jailbreak process. Open the Settings app and select \"Passcode\". Enter your current passcode, and then toggle the passcode off. You can turn it back on after jailbreaking. Disable \"Find My iPod\". If you have this Apple tracking service enabled, you'll need to disable it during the jailbreaking process. Open the Settings app and select \"iCloud\". Toggle \"Find My iPod\" off and enter your Apple ID password to confirm. You can turn Find My iPod back on after jailbreaking. Backup your iPod. Use iTunes to create a backup of your iPod before starting. This will let you easily restore to your previous settings if something goes wrong during the jailbreaking process. Select your iPod in iTunes, select \"This computer\", and then click the Back Up Now button. This will create a backup of your device on your computer. Make sure backup encryption is not enabled. Uncheck the \"Encrypt iPhone backup\" box if it is checked. If your previous backup was encrypted, you'll need to make a new unencrypted one. Close iTunes and open the TaiG jailbreak program. Make sure that iTunes is closed before running TaiG. Uncheck the \"3K Assistant\" box. This is unnecessary software that TaiG tries to add. Make sure to keep the Cydia box checked. Click the green \"Start\" button. This will begin the jailbreaking process, which will take a few minutes to complete. Your device will reboot multiple times during the jailbreak process, and you can monitor the jailbreak progress in the TaiG window. Don't touch your device's screen or disconnect it during the jailbreak process. Launch Cydia. This is the jailbreak package manager, and can be found on one of your device's Home screens after jailbreaking. When you first launch Cydia, you'll see the \"Preparing Filesystem\" message. This process may take a few minutes to finish, but is essential for a working jailbreak. Cydia will automatically exit and reboot your device when its finished. Use your jailbroken iPod. Once TaiG is finished and Cydia has built its filesystem, your device will be jailbroken and you can start installing apps and tweaks from Cydia. Click here for tips on getting the most out of your jailbroken iOS device. After jailbreaking, you can safely re-enable your device's passcode and Find My iPhone. iOS 7.1 - 7.1.2 Ensure that you have the latest version of iTunes installed. OS X - Click iTunes and select Check for Updates....\nWindows - Click Help and select Check for Updates.... Backup Your iPod. Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong. Backing up the iPod is a relatively quick process, depending on how much information you have. If you want to reset your iPod, don't backup. Disable your passcode. Tap Settings → Passcode → Turn Passcode Lock Off. The passcode can interfere with the jailbreak process. Download Pangu. This is the jailbreak software that you can use to jailbreak iOS 7.1, 7.1.1, or 7.1.2. Only download Pangu from http://en.7.pangu.io/. Connect your iPod to your computer. Close iTunes if it opens, and make sure no apps are running. Start Pangu. Click the black box to start jailbreaking. Follow the instructions in the Pangu program. You will be asked to set your iPod's date to June 2nd. Tap Settings → General → Date & Time to change the iPod's date. Tap the new Pangu app on your Home screen. Your iPad will reboot several times. After it is done rebooting, you will see the Cydia app on your Home screen. iOS 7.0 - 7.0.6 Ensure that you have the latest version of iTunes installed. Close iTunes after updating it. OS X - Click iTunes and select Check for Updates....\nWindows - Click Help and select Check for Updates.... Backup Your iPod. Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong. Backing up the iPod is a relatively quick process, depending on how much information you have. If you want to reset your iPod, don't backup. Disable your passcode. Tap Settings → General → Passcode Lock → Turn Passcode Lock Off. The passcode can interfere with the jailbreak process. Download evasi0n7. This is the jailbreak software that allows you to jailbreak iOS 7.0-7.0.6. Make sure to download the software from evasi0n.com. Start the jailbreak. Ensure that your iPod is showing up in the evasi0n window, and then click Jailbreak. Wait for the jailbreak to complete. Most of the process is automated. Follow any prompts that appear in the evasi0n7 window. Launch Cydia. Once the jailbreak is complete, launch the Cydia app on your Home screen to finish setting up the new file system. Your iPod will restart. Open Cydia one more time. After resetting, open Cydia one last time to finish the setup process. Once the \"Reloading Data\" box appears and then disappears, you're good to go. iOS 6.1.3 - 6.1.6 Backup Your iPod. Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong. Backing up the iPod is a relatively quick process, depending on how much information you have. If you want to reset your iPod, don't backup. This only works for the 4th and 5th generation iPod touch. Disable your passcode. Tap Settings → General → Passcode Lock → Turn Passcode Lock Off. The passcode can interfere with the jailbreak process. Download and extract p0sixspwn on your computer. This is the jailbreak program, and will need to be extracted from the ZIP file that it downloads in. Run p0sixspwn. If you are using Windows, right-click and select \"Run as Administrator\". If you are using Windows 8, right-click on the p0sixspwn file and select Properties. Click the Compatibility tab and opt to run the program in Windows 7 mode. Connect your iPod to your computer. You should see it detected in p0sixspwn. Start the jailbreak process. Click Jailbreak to start. Wait for the jailbreak process to complete. p0sixspwn handles everything automatically, and you can monitor the progress on your computer. iOS 6.0.0 - 6.1.2 Backup Your iPod. Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong. Backing up the iPod is a relatively quick process, depending on how much information you have. Download the jailbreak program. To jailbreak version 6.0.0-6.1.2, download free jailbreak software. Evasi0n is currently the easiest and most pain-free way to jailbreak the newest versions of iOS. Do not pay for any jailbreak programs, as the software is freely available online directly from the developers. This is an untethered jailbreak. That means that once the jailbreak process is complete, your iPod will be permanently jailbroken, until you revert the process yourself or download an update from Apple that renders the jailbreak unusable. Be sure to download the correct version for your computer’s operating system. For a PC you will need at least Windows XP. For a Mac, you need OS X.6 or newer. Close any apps running on your iPod. Make sure that the iPod is showing your Home Screen and that it is still properly connected to your computer. You may lose data in apps that are running while you jailbreak, so be sure that you see the Home Screen before you start the jailbreak process. Run the evasi0n software. iTunes should not be running on your computer. Click the “Jailbreak” button. The jailbreak process will take several minutes. Don’t run any programs on your computer and don’t touch the iPod’s power button. Too many programs running on your computer can slow down the jailbreak process and corrupt the installation, forcing you to restart the process. Turning the power off during the jailbreaking process could render your phone inoperable. When prompted, run the Jailbreak app. This app will appear on the Home Screen of your iPod. Tap it and the jailbreak process will continue. Open Cydia. Once the iPod has finished the jailbreak process, an app called  Cydia will appear on your home screen. This is the alternative to Apple’s iTunes store, where you can access apps that do not conform to the terms of Apple’s store. Cydia will need to download some data before the jailbreak can be completed. The words “Reloading Data” will show up and then disappear. Install third-party apps. Your iPod is now jailbroken. Be sure to re-enable any passwords and locks. You can now install any third-party apps to your iPod. iOS 5.1.1 or 5.0.1 Backup Your iPod. Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong. Backing up the iPod is a relatively quick process, depending on how much information you have. Download Absinthe 2, a free jailbreak firmware program. Absinthe is one of the easiest to use programs for iOS 5.1.1 jailbreaking. They also offer a 5.0.1 jailbreak that follows the same steps. Connect your iPod to your computer and run the program. Click the “Jailbreak” button. This is an untethered jailbreak. That means that once the jailbreak process is complete, your iPod will be permanently jailbroken, until you revert the process yourself or download an update from Apple that renders the jailbreak unusable. Your iPod will automatically begin the jailbreak process. Pay attention to any onscreen instructions that you may need to complete to get your iPod into  DFU mode. You may need to click “Jailbreak” again. After a short while, a “Complete” message will be displayed. The iPod will automatically reboot. Open the Loader app on your home screen. This will download and install Cydia. Cydia will be used to find and install apps that aren't normally permitted on Apple iPods. Reboot your iPod one more time. After this, your iPod is jailbroken and ready for use. iOS 4.3.3 and Older Backup Your iPod. Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong. Backing up the iPod is a relatively quick process, depending on how much information you have. Go to the JailbreakMe website on your iPod. You must access the site through your Safari browser, and not on your computer. The site will automatically detect whether your iPod is compatible with this method of jailbreaking. Jailbreak me only works on iOS 4.3.3 and below. Newer versions of iOS should use other methods in this guide. Select the \"Slide to Jailbreak\" button. Wait until your iPod downloads the application. How long this takes depends on how fast your connection is; the process can take up to five minutes. Once you see that the app \"Cydia\" is installed on your iPod, your iPod has been jailbroken. It will appear as a pop-up. Press OK. You will return to your home screen. Cydia will now be included alongside your other apps. You are now free to download unapproved apps and tweaks that aren’t allowed on the Apple store. Reboot your iPod. If you encounter any problems, a reboot should usually fix them. In the worst-case scenario, you can always restore your iPod and start the jailbreak process all over again.",
    "sentences": [
        " iOS 8.0 - 8.3 Download the TaiG jailbreaking utility.",
        "This utility is only available for Windows computers, but you can use it on Mac if you're running Windows in a virtual machine.",
        "You can download it from taig.com/en/.",
        "Some browsers may mark TaiG as malicious software, but this warning can be safely ignored as long as you downloaded TaiG directly from the developers.",
        "Connect your iPod Touch to your computer.",
        "Use the included USB cable to connect the iPod to your computer.",
        "Uninstall your version of iTunes.",
        "If you keep your iTunes up to date, you may have problems getting the jailbreak tool to work.",
        "The TaiG utility requires iTunes 12.1.1, which is a slightly older version.",
        "In order to downgrade to this version, you'll need to completely uninstall iTunes on your computer first.",
        "Open the Control Panel and select \"Programs and Features\" or \"Uninstall a program\".",
        "Select iTunes from the list and click Uninstall.",
        "Download and install the correct version of iTunes from support.apple.com/kb/DL1784.",
        "Disable the passcode on your iPod.",
        "If your iPod has a passcode to protect it, you'll need to disable it during the jailbreak process.",
        "Open the Settings app and select \"Passcode\".",
        "Enter your current passcode, and then toggle the passcode off.",
        "You can turn it back on after jailbreaking.",
        "Disable \"Find My iPod\".",
        "If you have this Apple tracking service enabled, you'll need to disable it during the jailbreaking process.",
        "Open the Settings app and select \"iCloud\".",
        "Toggle \"Find My iPod\" off and enter your Apple ID password to confirm.",
        "You can turn Find My iPod back on after jailbreaking.",
        "Backup your iPod.",
        "Use iTunes to create a backup of your iPod before starting.",
        "This will let you easily restore to your previous settings if something goes wrong during the jailbreaking process.",
        "Select your iPod in iTunes, select \"This computer\", and then click the Back Up Now button.",
        "This will create a backup of your device on your computer.",
        "Make sure backup encryption is not enabled.",
        "Uncheck the \"Encrypt iPhone backup\" box if it is checked.",
        "If your previous backup was encrypted, you'll need to make a new unencrypted one.",
        "Close iTunes and open the TaiG jailbreak program.",
        "Make sure that iTunes is closed before running TaiG.",
        "Uncheck the \"3K Assistant\" box.",
        "This is unnecessary software that TaiG tries to add.",
        "Make sure to keep the Cydia box checked.",
        "Click the green \"Start\" button.",
        "This will begin the jailbreaking process, which will take a few minutes to complete.",
        "Your device will reboot multiple times during the jailbreak process, and you can monitor the jailbreak progress in the TaiG window.",
        "Don't touch your device's screen or disconnect it during the jailbreak process.",
        "Launch Cydia.",
        "This is the jailbreak package manager, and can be found on one of your device's Home screens after jailbreaking.",
        "When you first launch Cydia, you'll see the \"Preparing Filesystem\" message.",
        "This process may take a few minutes to finish, but is essential for a working jailbreak.",
        "Cydia will automatically exit and reboot your device when its finished.",
        "Use your jailbroken iPod.",
        "Once TaiG is finished and Cydia has built its filesystem, your device will be jailbroken and you can start installing apps and tweaks from Cydia.",
        "Click here for tips on getting the most out of your jailbroken iOS device.",
        "After jailbreaking, you can safely re-enable your device's passcode and Find My iPhone.",
        "iOS 7.1 - 7.1.2 Ensure that you have the latest version of iTunes installed.",
        "OS X - Click iTunes and select Check for Updates....\nWindows - Click Help and select Check for Updates....",
        "Backup Your iPod.",
        "Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong.",
        "Backing up the iPod is a relatively quick process, depending on how much information you have.",
        "If you want to reset your iPod, don't backup.",
        "Disable your passcode.",
        "Tap Settings → Passcode → Turn Passcode Lock Off.",
        "The passcode can interfere with the jailbreak process.",
        "Download Pangu.",
        "This is the jailbreak software that you can use to jailbreak iOS 7.1, 7.1.1, or 7.1.2.",
        "Only download Pangu from http://en.7.pangu.io/.",
        "Connect your iPod to your computer.",
        "Close iTunes if it opens, and make sure no apps are running.",
        "Start Pangu.",
        "Click the black box to start jailbreaking.",
        "Follow the instructions in the Pangu program.",
        "You will be asked to set your iPod's date to June 2nd.",
        "Tap Settings → General → Date & Time to change the iPod's date.",
        "Tap the new Pangu app on your Home screen.",
        "Your iPad will reboot several times.",
        "After it is done rebooting, you will see the Cydia app on your Home screen.",
        "iOS 7.0 - 7.0.6 Ensure that you have the latest version of iTunes installed.",
        "Close iTunes after updating it.",
        "OS X - Click iTunes and select Check for Updates....\nWindows - Click Help and select Check for Updates....",
        "Backup Your iPod.",
        "Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong.",
        "Backing up the iPod is a relatively quick process, depending on how much information you have.",
        "If you want to reset your iPod, don't backup.",
        "Disable your passcode.",
        "Tap Settings → General → Passcode Lock → Turn Passcode Lock Off.",
        "The passcode can interfere with the jailbreak process.",
        "Download evasi0n7.",
        "This is the jailbreak software that allows you to jailbreak iOS 7.0-7.0.6.",
        "Make sure to download the software from evasi0n.com.",
        "Start the jailbreak.",
        "Ensure that your iPod is showing up in the evasi0n window, and then click Jailbreak.",
        "Wait for the jailbreak to complete.",
        "Most of the process is automated.",
        "Follow any prompts that appear in the evasi0n7 window.",
        "Launch Cydia.",
        "Once the jailbreak is complete, launch the Cydia app on your Home screen to finish setting up the new file system.",
        "Your iPod will restart.",
        "Open Cydia one more time.",
        "After resetting, open Cydia one last time to finish the setup process.",
        "Once the \"Reloading Data\" box appears and then disappears, you're good to go.",
        "iOS 6.1.3 - 6.1.6 Backup Your iPod.",
        "Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong.",
        "Backing up the iPod is a relatively quick process, depending on how much information you have.",
        "If you want to reset your iPod, don't backup.",
        "This only works for the 4th and 5th generation iPod touch.",
        "Disable your passcode.",
        "Tap Settings → General → Passcode Lock → Turn Passcode Lock Off.",
        "The passcode can interfere with the jailbreak process.",
        "Download and extract p0sixspwn on your computer.",
        "This is the jailbreak program, and will need to be extracted from the ZIP file that it downloads in.",
        "Run p0sixspwn.",
        "If you are using Windows, right-click and select \"Run as Administrator\".",
        "If you are using Windows 8, right-click on the p0sixspwn file and select Properties.",
        "Click the Compatibility tab and opt to run the program in Windows 7 mode.",
        "Connect your iPod to your computer.",
        "You should see it detected in p0sixspwn.",
        "Start the jailbreak process.",
        "Click Jailbreak to start.",
        "Wait for the jailbreak process to complete.",
        "p0sixspwn handles everything automatically, and you can monitor the progress on your computer.",
        "iOS 6.0.0 - 6.1.2 Backup Your iPod.",
        "Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong.",
        "Backing up the iPod is a relatively quick process, depending on how much information you have.",
        "Download the jailbreak program.",
        "To jailbreak version 6.0.0-6.1.2, download free jailbreak software.",
        "Evasi0n is currently the easiest and most pain-free way to jailbreak the newest versions of iOS.",
        "Do not pay for any jailbreak programs, as the software is freely available online directly from the developers.",
        "This is an untethered jailbreak.",
        "That means that once the jailbreak process is complete, your iPod will be permanently jailbroken, until you revert the process yourself or download an update from Apple that renders the jailbreak unusable.",
        "Be sure to download the correct version for your computer’s operating system.",
        "For a PC you will need at least Windows XP.",
        "For a Mac, you need OS X.6 or newer.",
        "Close any apps running on your iPod.",
        "Make sure that the iPod is showing your Home Screen and that it is still properly connected to your computer.",
        "You may lose data in apps that are running while you jailbreak, so be sure that you see the Home Screen before you start the jailbreak process.",
        "Run the evasi0n software.",
        "iTunes should not be running on your computer.",
        "Click the “Jailbreak” button.",
        "The jailbreak process will take several minutes.",
        "Don’t run any programs on your computer and don’t touch the iPod’s power button.",
        "Too many programs running on your computer can slow down the jailbreak process and corrupt the installation, forcing you to restart the process.",
        "Turning the power off during the jailbreaking process could render your phone inoperable.",
        "When prompted, run the Jailbreak app.",
        "This app will appear on the Home Screen of your iPod.",
        "Tap it and the jailbreak process will continue.",
        "Open Cydia.",
        "Once the iPod has finished the jailbreak process, an app called  Cydia will appear on your home screen.",
        "This is the alternative to Apple’s iTunes store, where you can access apps that do not conform to the terms of Apple’s store.",
        "Cydia will need to download some data before the jailbreak can be completed.",
        "The words “Reloading Data” will show up and then disappear.",
        "Install third-party apps.",
        "Your iPod is now jailbroken.",
        "Be sure to re-enable any passwords and locks.",
        "You can now install any third-party apps to your iPod.",
        "iOS 5.1.1 or 5.0.1 Backup Your iPod.",
        "Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong.",
        "Backing up the iPod is a relatively quick process, depending on how much information you have.",
        "Download Absinthe 2, a free jailbreak firmware program.",
        "Absinthe is one of the easiest to use programs for iOS 5.1.1 jailbreaking.",
        "They also offer a 5.0.1 jailbreak that follows the same steps.",
        "Connect your iPod to your computer and run the program.",
        "Click the “Jailbreak” button.",
        "This is an untethered jailbreak.",
        "That means that once the jailbreak process is complete, your iPod will be permanently jailbroken, until you revert the process yourself or download an update from Apple that renders the jailbreak unusable.",
        "Your iPod will automatically begin the jailbreak process.",
        "Pay attention to any onscreen instructions that you may need to complete to get your iPod into  DFU mode.",
        "You may need to click “Jailbreak” again.",
        "After a short while, a “Complete” message will be displayed.",
        "The iPod will automatically reboot.",
        "Open the Loader app on your home screen.",
        "This will download and install Cydia.",
        "Cydia will be used to find and install apps that aren't normally permitted on Apple iPods.",
        "Reboot your iPod one more time.",
        "After this, your iPod is jailbroken and ready for use.",
        "iOS 4.3.3 and Older Backup Your iPod.",
        "Before you begin jailbreaking, you should backup your iPod so that you don’t lose any important settings or files in case something goes wrong.",
        "Backing up the iPod is a relatively quick process, depending on how much information you have.",
        "Go to the JailbreakMe website on your iPod.",
        "You must access the site through your Safari browser, and not on your computer.",
        "The site will automatically detect whether your iPod is compatible with this method of jailbreaking.",
        "Jailbreak me only works on iOS 4.3.3 and below.",
        "Newer versions of iOS should use other methods in this guide.",
        "Select the \"Slide to Jailbreak\" button.",
        "Wait until your iPod downloads the application.",
        "How long this takes depends on how fast your connection is; the process can take up to five minutes.",
        "Once you see that the app \"Cydia\" is installed on your iPod, your iPod has been jailbroken.",
        "It will appear as a pop-up.",
        "Press OK. You will return to your home screen.",
        "Cydia will now be included alongside your other apps.",
        "You are now free to download unapproved apps and tweaks that aren’t allowed on the Apple store.",
        "Reboot your iPod.",
        "If you encounter any problems, a reboot should usually fix them.",
        "In the worst-case scenario, you can always restore your iPod and start the jailbreak process all over again."
    ]
}