{
    "title": "How to Double Tongue on Trumpet",
    "url": "https://www.wikihow.com/Double-Tongue-on-Trumpet",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music",
        "Musical Instruments",
        "Brass Musical Instruments",
        "Trumpet and Cornet"
    ],
    "steps": [
        {
            "headline": "You will need to know how to pronounce the word 'ticket'.",
            "description": "Say the word and concentrate on what your tongue is doing while you speak. A few alternatives to \"ticket\": \"Tukka\", \"Tugga\", \"Dugga\"."
        },
        {
            "headline": "Take a full breath, and exhale as fast as you can, saying the word as you do so.",
            "description": "Notice how there is tension in your air stream when you reach each syllable. Now all you have to do is put less exaggeration into the syllables so the air stream stays smooth throughout your exhalation. Practice this until it's smooth and comfortable."
        },
        {
            "headline": "Practice with your mouthpiece.",
            "description": "Practice single tonguing, then using the 'rebound' attack only (ka's, ga's, etc.)"
        },
        {
            "headline": "Try it on your horn!",
            "description": "Take it slowly, and read the tips below for further help."
        }
    ],
    "tyn": [
        "Trumpet"
    ],
    "text": " You will need to know how to pronounce the word 'ticket'. Say the word and concentrate on what your tongue is doing while you speak. A few alternatives to \"ticket\": \"Tukka\", \"Tugga\", \"Dugga\". Take a full breath, and exhale as fast as you can, saying the word as you do so. Notice how there is tension in your air stream when you reach each syllable. Now all you have to do is put less exaggeration into the syllables so the air stream stays smooth throughout your exhalation. Practice this until it's smooth and comfortable. Practice with your mouthpiece. Practice single tonguing, then using the 'rebound' attack only (ka's, ga's, etc.) Try it on your horn! Take it slowly, and read the tips below for further help.",
    "sentences": [
        " You will need to know how to pronounce the word 'ticket'.",
        "Say the word and concentrate on what your tongue is doing while you speak.",
        "A few alternatives to \"ticket\": \"Tukka\", \"Tugga\", \"Dugga\".",
        "Take a full breath, and exhale as fast as you can, saying the word as you do so.",
        "Notice how there is tension in your air stream when you reach each syllable.",
        "Now all you have to do is put less exaggeration into the syllables so the air stream stays smooth throughout your exhalation.",
        "Practice this until it's smooth and comfortable.",
        "Practice with your mouthpiece.",
        "Practice single tonguing, then using the 'rebound' attack only (ka's, ga's, etc.)",
        "Try it on your horn!",
        "Take it slowly, and read the tips below for further help."
    ]
}