{
    "title": "How to Draw a Man",
    "url": "https://www.wikihow.com/Draw-a-Man",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Drawing",
        "Drawing People"
    ],
    "methods": [
        {
            "name": "Draw a Standing Man",
            "steps": [
                {
                    "headline": "Sketch the wireframe of a male human figure.",
                    "description": ""
                },
                {
                    "headline": "Sketch the shapes needed to build the body.",
                    "description": ""
                },
                {
                    "headline": "Sketch the human figure using the previous steps as a guide.",
                    "description": ""
                },
                {
                    "headline": "Sketch the clothes, hair and facial details.",
                    "description": ""
                },
                {
                    "headline": "Draw the outline over the sketch.",
                    "description": ""
                },
                {
                    "headline": "Erase and remove the sketch marks.",
                    "description": ""
                },
                {
                    "headline": "Add color.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Draw a Man in a Pose",
            "steps": [
                {
                    "headline": "Sketch the wireframe into a pose to serve as a guide.",
                    "description": ""
                },
                {
                    "headline": "Sketch the shapes needed to build the body.",
                    "description": ""
                },
                {
                    "headline": "Sketch the clothes, hair and facial details.",
                    "description": ""
                },
                {
                    "headline": "Refine the artwork using a smaller tipped drawing tool.",
                    "description": ""
                },
                {
                    "headline": "Draw the outline over the sketch.",
                    "description": ""
                },
                {
                    "headline": "Erase and remove the sketch marks.",
                    "description": ""
                },
                {
                    "headline": "Add color.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Draw a Man",
            "steps": [
                {
                    "headline": "Draw a circle for the man’s head and an oblong for the trunk.",
                    "description": ""
                },
                {
                    "headline": "Add the limbs and two half circles for the feet.",
                    "description": ""
                },
                {
                    "headline": "After you finished drawing the outline, start with the face by sketching the eyes, nose, ears, and lips.",
                    "description": ""
                },
                {
                    "headline": "Add thick hair on the man’s head.",
                    "description": ""
                },
                {
                    "headline": "Using the outline, you can now easily sketch out the man’s clothes depending on your preference; here we are drawing a polo shirt and pants.",
                    "description": ""
                },
                {
                    "headline": "Add more refined details to the hand’s framework which you made earlier.",
                    "description": ""
                },
                {
                    "headline": "Erase all unnecessary lines.",
                    "description": ""
                },
                {
                    "headline": "Add color as desired.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Draw a Man in Manga Style",
            "steps": [
                {
                    "headline": "Draw a circle for the upper portion of the head.",
                    "description": "Add details of the jaw, emphasize the angled line to make it more masculine as compared to that of a female character. In drawing the shoulders, emphasize on the angles imitating the trapezius muscles and the collar bone."
                },
                {
                    "headline": "To help you draw the details of the face, draw a horizontal line across the area where you’ll be drawing the eyes; and also draw a vertical line across where you’ll position the nose.",
                    "description": ""
                },
                {
                    "headline": "Based on the outlines you made, draw the details of the man’s face, like the eyes, nose and lips.",
                    "description": "For added effect, you can also add a quick and easy slanted line for emphasis to the cheek bone."
                },
                {
                    "headline": "Draw soft, short lines on the head for the man’s hair.",
                    "description": "You can choose any hairstyle you want."
                },
                {
                    "headline": "Add details to the ear for a more realistic touch.",
                    "description": "Adding beard is optional."
                },
                {
                    "headline": "Draw the man’s clothing.",
                    "description": ""
                },
                {
                    "headline": "Erase unnecessary lines.",
                    "description": ""
                },
                {
                    "headline": "Color the drawing.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Paper",
        "Pencil",
        "Pencil sharpener",
        "Eraser",
        "Colored pencils, crayons, markers or watercolors"
    ],
    "text": " Draw a Standing Man Sketch the wireframe of a male human figure.  Sketch the shapes needed to build the body.  Sketch the human figure using the previous steps as a guide.  Sketch the clothes, hair and facial details.  Draw the outline over the sketch.  Erase and remove the sketch marks.  Add color.  Draw a Man in a Pose Sketch the wireframe into a pose to serve as a guide.  Sketch the shapes needed to build the body.  Sketch the clothes, hair and facial details.  Refine the artwork using a smaller tipped drawing tool.  Draw the outline over the sketch.  Erase and remove the sketch marks.  Add color.  Draw a Man Draw a circle for the man’s head and an oblong for the trunk.  Add the limbs and two half circles for the feet.  After you finished drawing the outline, start with the face by sketching the eyes, nose, ears, and lips.  Add thick hair on the man’s head.  Using the outline, you can now easily sketch out the man’s clothes depending on your preference; here we are drawing a polo shirt and pants.  Add more refined details to the hand’s framework which you made earlier.  Erase all unnecessary lines.  Add color as desired.  Draw a Man in Manga Style Draw a circle for the upper portion of the head. Add details of the jaw, emphasize the angled line to make it more masculine as compared to that of a female character. In drawing the shoulders, emphasize on the angles imitating the trapezius muscles and the collar bone. To help you draw the details of the face, draw a horizontal line across the area where you’ll be drawing the eyes; and also draw a vertical line across where you’ll position the nose.  Based on the outlines you made, draw the details of the man’s face, like the eyes, nose and lips. For added effect, you can also add a quick and easy slanted line for emphasis to the cheek bone. Draw soft, short lines on the head for the man’s hair. You can choose any hairstyle you want. Add details to the ear for a more realistic touch. Adding beard is optional. Draw the man’s clothing.  Erase unnecessary lines.  Color the drawing. ",
    "sentences": [
        " Draw a Standing Man Sketch the wireframe of a male human figure.",
        "Sketch the shapes needed to build the body.",
        "Sketch the human figure using the previous steps as a guide.",
        "Sketch the clothes, hair and facial details.",
        "Draw the outline over the sketch.",
        "Erase and remove the sketch marks.",
        "Add color.",
        "Draw a Man in a Pose Sketch the wireframe into a pose to serve as a guide.",
        "Sketch the shapes needed to build the body.",
        "Sketch the clothes, hair and facial details.",
        "Refine the artwork using a smaller tipped drawing tool.",
        "Draw the outline over the sketch.",
        "Erase and remove the sketch marks.",
        "Add color.",
        "Draw a Man Draw a circle for the man’s head and an oblong for the trunk.",
        "Add the limbs and two half circles for the feet.",
        "After you finished drawing the outline, start with the face by sketching the eyes, nose, ears, and lips.",
        "Add thick hair on the man’s head.",
        "Using the outline, you can now easily sketch out the man’s clothes depending on your preference; here we are drawing a polo shirt and pants.",
        "Add more refined details to the hand’s framework which you made earlier.",
        "Erase all unnecessary lines.",
        "Add color as desired.",
        "Draw a Man in Manga Style Draw a circle for the upper portion of the head.",
        "Add details of the jaw, emphasize the angled line to make it more masculine as compared to that of a female character.",
        "In drawing the shoulders, emphasize on the angles imitating the trapezius muscles and the collar bone.",
        "To help you draw the details of the face, draw a horizontal line across the area where you’ll be drawing the eyes; and also draw a vertical line across where you’ll position the nose.",
        "Based on the outlines you made, draw the details of the man’s face, like the eyes, nose and lips.",
        "For added effect, you can also add a quick and easy slanted line for emphasis to the cheek bone.",
        "Draw soft, short lines on the head for the man’s hair.",
        "You can choose any hairstyle you want.",
        "Add details to the ear for a more realistic touch.",
        "Adding beard is optional.",
        "Draw the man’s clothing.",
        "Erase unnecessary lines.",
        "Color the drawing."
    ]
}