{
    "title": "How to Care for a Foot Tattoo",
    "url": "https://www.wikihow.com/Care-for-a-Foot-Tattoo",
    "category_hierarchy": [
        "Personal Care and Style",
        "Tattoos and Piercing",
        "Care of Tattoos"
    ],
    "methods": [
        {
            "name": "Cleaning Your Tattoo Carefully",
            "steps": [
                {
                    "headline": "Removing your bandage.",
                    "description": "Your bandage should still be on your tattoo for at least two hours after you received it. Of course, that time varies and you should do as you were instructed by your tattoo artist. When you finally do remove your bandage, make sure to take it off with care. If your bandage is so tight that it sticks to your tattoo, then you should use running water to loosen the covering. Let the water drip gently upon the bandage until you feel the adhesive lose its grip. Once it is loose, gently take the bandage off."
                },
                {
                    "headline": "Do not pick scabs.",
                    "description": "Scabs develop over a tattoo in order to protect it from germs. Though they may irritate you, you should not pick at the scabs that cover your tattoo. If you pick at them, then you risk the chance of getting an infection. This is dangerous and can also ruin the tattoo's design. You might accidentally knock off one of your scabs. If it was just a small scab, you shouldn't worry too much because you probably haven't lost a lot of ink. If it's a bigger scab, then you might have to get it retouched in time."
                },
                {
                    "headline": "Wash your feet.",
                    "description": "Put a dab of cleaning solution or soap on your tattoo. Rub the area with your hand. After you do this, use water to rinse your tattoo. If you feel a slippery substance, then you probably are encountering plasma. Dried plasma will cause you discomfort, therefore you should rinse your tattoo until you remove all of it. After you have rinsed your tattoo, dab at it with a clean towel. Do not use soap with dyes or scents. A mild soap is best."
                },
                {
                    "headline": "Keep your tattoo dry.",
                    "description": "You may be tempted to dip your feet into a tub of warm water after your tattoo. Don’t do this. Soaking your feet will not only create the perfect situation for a bacterial infection, but it will also cause the ink to run. For the first three weeks, you should avoid swimming. If you swim regularly, you should try to avoid swimming for the time it takes your tattoo to heal."
                },
                {
                    "headline": "Moisturize your tattoo.",
                    "description": "Rub anti-bacterial ointment or lotion over the tattooed area. Use a paper towel to remove the excess ointment or lotion. You should use an unscented lotion such as Lubiderm or Aveeno. You do not need to use a foot-specific lotion. In fact, you should try to avoid specialty lotions and creams, they may not work as well as advertised when it comes to tattoo care. Do not use too much moisturizer. If you do this, then you run the risk of removing some of your tattoo’s ink. Do not use petroleum jelly. This will cause your tattoo to lose ink. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGrant Lubbock\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTattoo Artist & Co-Owner, Red Baron Ink\t\t\t\t\t\t\t\tGrant Lubbock is a Tattoo Artist and Co-Owner of Red Baron Ink, a tattoo salon based in New York City. Grant has over 10 years of tattoing experience and he specializes in neo-traditional, black/grey, and color tattoos. Red Baron Ink's main goal is for each tattoo coming out of their studio to be one of a kind custom pieces that will look good throughout a lifetime. Grant Lubbock\t\t\tTattoo Artist & Co-Owner, Red Baron Ink\t\t\t\tFollow your tattooer's aftercare instructions closely. Whenever you get a tattoo, it's important to follow your artist's instructions, because every artist tattoos a little differently. However, there are some basic rules of thumb on how to heal a tattoo: wash it twice a day, in the morning and at night, with antibacterial soap. Also, lightly hydrate the area with a tattoo ointment 3 or 4 times a day, and continue doing that for 7-10 days."
                }
            ]
        },
        {
            "name": "Monitoring Your Circulation",
            "steps": [
                {
                    "headline": "Elevate your feet.",
                    "description": "Bad circulation causes swelling. Therefore, try to stay off your feet if you can. When you lay down, make sure that you lift your feet up. You want your feet to go up as far as you can raise them. You can place a stool under your feet if it will help you keep them up."
                },
                {
                    "headline": "Drink water.",
                    "description": "Foot swelling after a tattoo is caused by your body storing excessive amounts of water. To keep this from happening, you should drink plenty of water. You want to drink enough so that your body will want to expel water instead of retaining it."
                },
                {
                    "headline": "Apply ice to swelling or bruising.",
                    "description": "Of course, you should not place ice directly on your tattoo. The best way to lessen swelling and keep your tattoo dry is to wrap ice in a piece of cloth and place it on your tattoo. Try doing this for thirty minutes to an hour every day you have swelling."
                },
                {
                    "headline": "Exercise.",
                    "description": "You need to maintain proper circulation in order to keep swelling down. Therefore, when you are lying down, try to do some exercises. They don’t need to be intense, just regular. Stretching, for example, would be beneficial. Try lifting your legs and arms at intervals."
                }
            ]
        },
        {
            "name": "Protecting Your Feet",
            "steps": [
                {
                    "headline": "Don’t wear shoes.",
                    "description": "Shoes, tight shoes especially, do not allow for your tattoo to breathe. Instead, they trap your foot in sweat. Shoes can also rub against your tattoo in a bothersome manner. This friction can cause irritation. Irritation and perspiration are not only uncomfortable, in tandem they can lead to a foot infection. So, at least for the first two weeks, try to avoid wearing shoes. If you wear socks regularly, then make sure you take them off for a few hours during the day. After these first few weeks, you can begin to wear shoes again. However, you should treat your feet as gently as possible. You should take your shoes off as soon as you get the chance, and then make sure to wash your feet thoroughly. If you have to wear footwear as part of your job, make sure that you take a break for the time that you need your feet to heal. If this is not possible, then you should consider wearing sandals."
                },
                {
                    "headline": "Keep your tattoo away from the sun.",
                    "description": "The sun can make your tattoo lose its luster. Therefore, it’s best to not expose your tattoo to the sun. When you can’t avoid the sun, make sure to apply sunscreen to your tattooed area."
                },
                {
                    "headline": "Give your feet time.",
                    "description": "Restoring your feet is a process. Your body generally takes about three months in order to replace the skin cells over your tattoo."
                },
                {
                    "headline": "Communicate with your doctor.",
                    "description": "Due to their location, foot tattoos have a high potential for infection. Therefore, make sure you keep an open line of communication with your doctor. Continuous pain, yellowing, and bleeding are all signs of an infection."
                }
            ]
        }
    ],
    "tyn": [
        "Antibacterial ointment",
        "Clean dry towel",
        "Paper towels",
        "Lotion"
    ],
    "text": " Cleaning Your Tattoo Carefully Removing your bandage. Your bandage should still be on your tattoo for at least two hours after you received it. Of course, that time varies and you should do as you were instructed by your tattoo artist. When you finally do remove your bandage, make sure to take it off with care. If your bandage is so tight that it sticks to your tattoo, then you should use running water to loosen the covering. Let the water drip gently upon the bandage until you feel the adhesive lose its grip. Once it is loose, gently take the bandage off. Do not pick scabs. Scabs develop over a tattoo in order to protect it from germs. Though they may irritate you, you should not pick at the scabs that cover your tattoo. If you pick at them, then you risk the chance of getting an infection. This is dangerous and can also ruin the tattoo's design. You might accidentally knock off one of your scabs. If it was just a small scab, you shouldn't worry too much because you probably haven't lost a lot of ink. If it's a bigger scab, then you might have to get it retouched in time. Wash your feet. Put a dab of cleaning solution or soap on your tattoo. Rub the area with your hand. After you do this, use water to rinse your tattoo. If you feel a slippery substance, then you probably are encountering plasma. Dried plasma will cause you discomfort, therefore you should rinse your tattoo until you remove all of it. After you have rinsed your tattoo, dab at it with a clean towel. Do not use soap with dyes or scents. A mild soap is best. Keep your tattoo dry. You may be tempted to dip your feet into a tub of warm water after your tattoo. Don’t do this. Soaking your feet will not only create the perfect situation for a bacterial infection, but it will also cause the ink to run. For the first three weeks, you should avoid swimming. If you swim regularly, you should try to avoid swimming for the time it takes your tattoo to heal. Moisturize your tattoo. Rub anti-bacterial ointment or lotion over the tattooed area. Use a paper towel to remove the excess ointment or lotion. You should use an unscented lotion such as Lubiderm or Aveeno. You do not need to use a foot-specific lotion. In fact, you should try to avoid specialty lotions and creams, they may not work as well as advertised when it comes to tattoo care. Do not use too much moisturizer. If you do this, then you run the risk of removing some of your tattoo’s ink. Do not use petroleum jelly. This will cause your tattoo to lose ink. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGrant Lubbock\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTattoo Artist & Co-Owner, Red Baron Ink\t\t\t\t\t\t\t\tGrant Lubbock is a Tattoo Artist and Co-Owner of Red Baron Ink, a tattoo salon based in New York City. Grant has over 10 years of tattoing experience and he specializes in neo-traditional, black/grey, and color tattoos. Red Baron Ink's main goal is for each tattoo coming out of their studio to be one of a kind custom pieces that will look good throughout a lifetime. Grant Lubbock\t\t\tTattoo Artist & Co-Owner, Red Baron Ink\t\t\t\tFollow your tattooer's aftercare instructions closely. Whenever you get a tattoo, it's important to follow your artist's instructions, because every artist tattoos a little differently. However, there are some basic rules of thumb on how to heal a tattoo: wash it twice a day, in the morning and at night, with antibacterial soap. Also, lightly hydrate the area with a tattoo ointment 3 or 4 times a day, and continue doing that for 7-10 days. Monitoring Your Circulation Elevate your feet. Bad circulation causes swelling. Therefore, try to stay off your feet if you can. When you lay down, make sure that you lift your feet up. You want your feet to go up as far as you can raise them. You can place a stool under your feet if it will help you keep them up. Drink water. Foot swelling after a tattoo is caused by your body storing excessive amounts of water. To keep this from happening, you should drink plenty of water. You want to drink enough so that your body will want to expel water instead of retaining it. Apply ice to swelling or bruising. Of course, you should not place ice directly on your tattoo. The best way to lessen swelling and keep your tattoo dry is to wrap ice in a piece of cloth and place it on your tattoo. Try doing this for thirty minutes to an hour every day you have swelling. Exercise. You need to maintain proper circulation in order to keep swelling down. Therefore, when you are lying down, try to do some exercises. They don’t need to be intense, just regular. Stretching, for example, would be beneficial. Try lifting your legs and arms at intervals. Protecting Your Feet Don’t wear shoes. Shoes, tight shoes especially, do not allow for your tattoo to breathe. Instead, they trap your foot in sweat. Shoes can also rub against your tattoo in a bothersome manner. This friction can cause irritation. Irritation and perspiration are not only uncomfortable, in tandem they can lead to a foot infection. So, at least for the first two weeks, try to avoid wearing shoes. If you wear socks regularly, then make sure you take them off for a few hours during the day. After these first few weeks, you can begin to wear shoes again. However, you should treat your feet as gently as possible. You should take your shoes off as soon as you get the chance, and then make sure to wash your feet thoroughly. If you have to wear footwear as part of your job, make sure that you take a break for the time that you need your feet to heal. If this is not possible, then you should consider wearing sandals. Keep your tattoo away from the sun. The sun can make your tattoo lose its luster. Therefore, it’s best to not expose your tattoo to the sun. When you can’t avoid the sun, make sure to apply sunscreen to your tattooed area. Give your feet time. Restoring your feet is a process. Your body generally takes about three months in order to replace the skin cells over your tattoo. Communicate with your doctor. Due to their location, foot tattoos have a high potential for infection. Therefore, make sure you keep an open line of communication with your doctor. Continuous pain, yellowing, and bleeding are all signs of an infection.",
    "sentences": [
        " Cleaning Your Tattoo Carefully Removing your bandage.",
        "Your bandage should still be on your tattoo for at least two hours after you received it.",
        "Of course, that time varies and you should do as you were instructed by your tattoo artist.",
        "When you finally do remove your bandage, make sure to take it off with care.",
        "If your bandage is so tight that it sticks to your tattoo, then you should use running water to loosen the covering.",
        "Let the water drip gently upon the bandage until you feel the adhesive lose its grip.",
        "Once it is loose, gently take the bandage off.",
        "Do not pick scabs.",
        "Scabs develop over a tattoo in order to protect it from germs.",
        "Though they may irritate you, you should not pick at the scabs that cover your tattoo.",
        "If you pick at them, then you risk the chance of getting an infection.",
        "This is dangerous and can also ruin the tattoo's design.",
        "You might accidentally knock off one of your scabs.",
        "If it was just a small scab, you shouldn't worry too much because you probably haven't lost a lot of ink.",
        "If it's a bigger scab, then you might have to get it retouched in time.",
        "Wash your feet.",
        "Put a dab of cleaning solution or soap on your tattoo.",
        "Rub the area with your hand.",
        "After you do this, use water to rinse your tattoo.",
        "If you feel a slippery substance, then you probably are encountering plasma.",
        "Dried plasma will cause you discomfort, therefore you should rinse your tattoo until you remove all of it.",
        "After you have rinsed your tattoo, dab at it with a clean towel.",
        "Do not use soap with dyes or scents.",
        "A mild soap is best.",
        "Keep your tattoo dry.",
        "You may be tempted to dip your feet into a tub of warm water after your tattoo.",
        "Don’t do this.",
        "Soaking your feet will not only create the perfect situation for a bacterial infection, but it will also cause the ink to run.",
        "For the first three weeks, you should avoid swimming.",
        "If you swim regularly, you should try to avoid swimming for the time it takes your tattoo to heal.",
        "Moisturize your tattoo.",
        "Rub anti-bacterial ointment or lotion over the tattooed area.",
        "Use a paper towel to remove the excess ointment or lotion.",
        "You should use an unscented lotion such as Lubiderm or Aveeno.",
        "You do not need to use a foot-specific lotion.",
        "In fact, you should try to avoid specialty lotions and creams, they may not work as well as advertised when it comes to tattoo care.",
        "Do not use too much moisturizer.",
        "If you do this, then you run the risk of removing some of your tattoo’s ink.",
        "Do not use petroleum jelly.",
        "This will cause your tattoo to lose ink.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGrant Lubbock\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTattoo Artist & Co-Owner, Red Baron Ink\t\t\t\t\t\t\t\tGrant Lubbock is a Tattoo Artist and Co-Owner of Red Baron Ink, a tattoo salon based in New York City.",
        "Grant has over 10 years of tattoing experience and he specializes in neo-traditional, black/grey, and color tattoos.",
        "Red Baron Ink's main goal is for each tattoo coming out of their studio to be one of a kind custom pieces that will look good throughout a lifetime.",
        "Grant Lubbock\t\t\tTattoo Artist & Co-Owner, Red Baron Ink\t\t\t\tFollow your tattooer's aftercare instructions closely.",
        "Whenever you get a tattoo, it's important to follow your artist's instructions, because every artist tattoos a little differently.",
        "However, there are some basic rules of thumb on how to heal a tattoo: wash it twice a day, in the morning and at night, with antibacterial soap.",
        "Also, lightly hydrate the area with a tattoo ointment 3 or 4 times a day, and continue doing that for 7-10 days.",
        "Monitoring Your Circulation Elevate your feet.",
        "Bad circulation causes swelling.",
        "Therefore, try to stay off your feet if you can.",
        "When you lay down, make sure that you lift your feet up.",
        "You want your feet to go up as far as you can raise them.",
        "You can place a stool under your feet if it will help you keep them up.",
        "Drink water.",
        "Foot swelling after a tattoo is caused by your body storing excessive amounts of water.",
        "To keep this from happening, you should drink plenty of water.",
        "You want to drink enough so that your body will want to expel water instead of retaining it.",
        "Apply ice to swelling or bruising.",
        "Of course, you should not place ice directly on your tattoo.",
        "The best way to lessen swelling and keep your tattoo dry is to wrap ice in a piece of cloth and place it on your tattoo.",
        "Try doing this for thirty minutes to an hour every day you have swelling.",
        "Exercise.",
        "You need to maintain proper circulation in order to keep swelling down.",
        "Therefore, when you are lying down, try to do some exercises.",
        "They don’t need to be intense, just regular.",
        "Stretching, for example, would be beneficial.",
        "Try lifting your legs and arms at intervals.",
        "Protecting Your Feet Don’t wear shoes.",
        "Shoes, tight shoes especially, do not allow for your tattoo to breathe.",
        "Instead, they trap your foot in sweat.",
        "Shoes can also rub against your tattoo in a bothersome manner.",
        "This friction can cause irritation.",
        "Irritation and perspiration are not only uncomfortable, in tandem they can lead to a foot infection.",
        "So, at least for the first two weeks, try to avoid wearing shoes.",
        "If you wear socks regularly, then make sure you take them off for a few hours during the day.",
        "After these first few weeks, you can begin to wear shoes again.",
        "However, you should treat your feet as gently as possible.",
        "You should take your shoes off as soon as you get the chance, and then make sure to wash your feet thoroughly.",
        "If you have to wear footwear as part of your job, make sure that you take a break for the time that you need your feet to heal.",
        "If this is not possible, then you should consider wearing sandals.",
        "Keep your tattoo away from the sun.",
        "The sun can make your tattoo lose its luster.",
        "Therefore, it’s best to not expose your tattoo to the sun.",
        "When you can’t avoid the sun, make sure to apply sunscreen to your tattooed area.",
        "Give your feet time.",
        "Restoring your feet is a process.",
        "Your body generally takes about three months in order to replace the skin cells over your tattoo.",
        "Communicate with your doctor.",
        "Due to their location, foot tattoos have a high potential for infection.",
        "Therefore, make sure you keep an open line of communication with your doctor.",
        "Continuous pain, yellowing, and bleeding are all signs of an infection."
    ]
}