{
    "title": "How to Store Chestnuts",
    "url": "https://www.wikihow.com/Store-Chestnuts",
    "category_hierarchy": [
        "Food and Entertaining"
    ],
    "steps": [
        {
            "headline": "Store freshly purchased or picked, unpeeled chestnuts at room temperature for up to one week only.",
            "description": "Keep them in a well-ventilated and dry place."
        },
        {
            "headline": "Store unpeeled chestnuts in the refrigerator.",
            "description": "To keep your chestnuts in top shape for a little longer, place them into a plastic bag and stick a few holes into the bag for airflow. Kept this way, the chestnuts should be fine in the fridge for two to three weeks. Place them in the vegetable storage bin of the fridge."
        },
        {
            "headline": "Be aware that once you have peeled the chestnuts and roasted them, they will not keep more than a few days in the fridge.",
            "description": "If you have chestnuts like this, wrap them in aluminium foil or other freezer-proof wrapping that is air-tight and place them in the freezer. They can be frozen for several months."
        }
    ],
    "tyn": [
        "Fridge - storage container",
        "Freezer - hermetically sealed storage container or wrap",
        "Bag with air holes"
    ],
    "text": " Store freshly purchased or picked, unpeeled chestnuts at room temperature for up to one week only. Keep them in a well-ventilated and dry place. Store unpeeled chestnuts in the refrigerator. To keep your chestnuts in top shape for a little longer, place them into a plastic bag and stick a few holes into the bag for airflow. Kept this way, the chestnuts should be fine in the fridge for two to three weeks. Place them in the vegetable storage bin of the fridge. Be aware that once you have peeled the chestnuts and roasted them, they will not keep more than a few days in the fridge. If you have chestnuts like this, wrap them in aluminium foil or other freezer-proof wrapping that is air-tight and place them in the freezer. They can be frozen for several months.",
    "sentences": [
        " Store freshly purchased or picked, unpeeled chestnuts at room temperature for up to one week only.",
        "Keep them in a well-ventilated and dry place.",
        "Store unpeeled chestnuts in the refrigerator.",
        "To keep your chestnuts in top shape for a little longer, place them into a plastic bag and stick a few holes into the bag for airflow.",
        "Kept this way, the chestnuts should be fine in the fridge for two to three weeks.",
        "Place them in the vegetable storage bin of the fridge.",
        "Be aware that once you have peeled the chestnuts and roasted them, they will not keep more than a few days in the fridge.",
        "If you have chestnuts like this, wrap them in aluminium foil or other freezer-proof wrapping that is air-tight and place them in the freezer.",
        "They can be frozen for several months."
    ]
}