{
    "title": "How to Make Comic Book High Heels",
    "url": "https://www.wikihow.com/Make-Comic-Book-High-Heels",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Movies",
        "Filmmaking",
        "Animation"
    ],
    "methods": [
        {
            "name": "Using Fabric",
            "steps": [
                {
                    "headline": "Get some comic-printed fabric.",
                    "description": "You can buy comic-printed fabric from the fabric store. You can also buy a comic-printed shirt or skirt, and use that instead; make sure that the fabric is cotton and non-stretch."
                },
                {
                    "headline": "Choose a pair of plain high heels.",
                    "description": "Fabric shoes would work best for this, because the glue will stick better. If your shoes are made out of patent leather, or a similar material, lightly buff them with fine-grit sandpaper or an emery board; this will give the glue something to grab on to. If there are any embellishments on your shoes, be sure to cut them off; you can always glue them back on later."
                },
                {
                    "headline": "Cut a piece of fabric big enough to cover one shoe.",
                    "description": "The easiest way to do this would be to lay the fabric on top of the shoe, and then to cut around it. This method is just for one shoe. You'll need to repeat it for your other shoe. It is easiest to work on one shoe at a time."
                },
                {
                    "headline": "Cut a slit down the middle of the fabric for the opening.",
                    "description": "Keep the fabric on top of the shoe and position your scissors just above the heel seam. Cut straight down the fabric until you are ½ inch (1.27 centimeters) away from the top of the opening (closest to the toe)."
                },
                {
                    "headline": "Use a foam brush to coat the toe area with a thick layer of fabric glue.",
                    "description": "You can also use a decoupage glue, such as Mod Podge, but make sure that it is waterproof."
                },
                {
                    "headline": "Smooth the fabric down onto the glue.",
                    "description": "Make sure that the fabric is stretched over the surface of the shoe, and that there aren't any puckers or wrinkles."
                },
                {
                    "headline": "Cover the sides of the shoe with more glue, and smooth the fabric down into the glue.",
                    "description": "Try your best to follow the curves of the heels. Don't worry about the top opening just yet. When you get close to the heel of the shoe, stop. You can leave the heels covered or uncovered. If you plan on covering them, skip over them for now; you will need to use a separate piece of fabric for that."
                },
                {
                    "headline": "Trim one side of the fabric down until it goes ½ inch (1.27 centimeters) past the back seam, and glue it down.",
                    "description": "Pat some glue onto the heel of your shoe first, then press the fabric down onto the glue, making sure to pull it nice and taut."
                },
                {
                    "headline": "Trim the other side of the fabric until it goes 1 inch (2.54 centimeters) past the seam.",
                    "description": "You are including this extra fabric so that you can fold it under itself and create a finished seam. Don't glue it down just yet, however."
                },
                {
                    "headline": "Fold the raw edge under itself, then glue the fabric down.",
                    "description": "For a more secure finish, coat the underside of the fabric with glue first, then fold the raw edge under itself by ½ inch (1.27 centimeters). Brush on some glue under the fabric, then press it down onto the shoe."
                },
                {
                    "headline": "Shape the top opening.",
                    "description": "Go back to where you cut the slit, and cut the opening out until it is ½ inch (1.27 centimeters) away from the edge of the shoe. Next, cut slits into the fabric. Make the slits further apart along the straight edges of the shoe, and closer together in the curved areas (such as the toe). This will help the fabric lay smoother inside your shoe, and prevent wrinkling and buckling, which might make your shoes uncomfortable to wear. If your heels are peep-toes, use a similar technique: trim the fabric down to ½ inch (1.27 centimeters), then cut slits into it."
                },
                {
                    "headline": "Glue the fabric inside your shoe.",
                    "description": "Many crafters find that the inside of shoes doesn't take glue well for some reason. To ensure that the fabric stays down, brush glue onto the shoe and the fabric, then press the fabric down. If the fabric still won't stay down, secure it with metal clips until the glue dries. If your shoes are peep-toes, use a similar technique: glue the fabric down, then secure it with clips until it dries."
                },
                {
                    "headline": "Trim the excess fabric away along the sole.",
                    "description": "The easiest way to do this would be to run a craft blade down the seam between your shoe and the sole. This may even tuck the fabric into the seam. If you have a lot of excess fabric, you can trim it away with a pair of scissors first."
                },
                {
                    "headline": "Seal the fabric along the sole for extra security.",
                    "description": "Run some fabric glue along the seam where the body of your shoe joins the sole. Next, run something blunt along the seam to tuck the raw edges in. You can use your fingernail, a butter knife, a skewer, or even a knitting needle to do this."
                },
                {
                    "headline": "Consider covering the heel area as well.",
                    "description": "Start by measuring the height and circumference of your heel. Next, add 1 inch (2.54 centimeters) to the height, and 1½ inches (3.81 centimeters) to the length. Cut the fabric out, then do the following:\nFold the bottom and one of the side edges down by ½ inch (1.27 centimeters). Cover the heel with glue. Wrap the fabric around it, starting with the raw edge and finishing with the folded edge. Keep the seam on the inside of the heel. Run a craft blade along the top seam of your heel to cut away any excess fabric. This should also tuck the raw top edges into the seam."
                },
                {
                    "headline": "Seal the fabric with Mod Podge, or another type of sealer, if desired.",
                    "description": "This may not be necessary if you used fabric glue, but it would be a good idea if you used Mod Podge. If your fabric has any glue \"stains\" on it, then coating it with Mod Podge or sealer would help hide them. Whatever you decide to use, make sure that it is waterproof. It might be an even better idea to add 2 to 3 coats of Mod Podge or sealer. Make sure that you let each coat dry before applying the next."
                },
                {
                    "headline": "Let your shoes dry completely before you wear them.",
                    "description": "Even though the glues and sealers you used are waterproof, it would be best to avoid getting these shoes wet. If you get them wet, the fabric may start to bubble and warp."
                }
            ]
        },
        {
            "name": "Using Comic Books",
            "steps": [
                {
                    "headline": "Get some comic books, preferably ones you don't mind cutting up.",
                    "description": "If you can't stand the idea of cutting up a comic book, consider using comic-printed scrapbook paper or comic-themed wrapping paper."
                },
                {
                    "headline": "Choose a pair of plain high heels.",
                    "description": "The best heels to use for this project are ones that are made out of fabric or suede becuase the Mod Podge will stick to them better. If your heels are made out of patent leather, or a similar shiny material, light buff them with fine-grit sand paper or an emery board instead; this will give the Mod Podge something to stick to. If there are any embellishments on your shoes, be sure to cut them off; you can always glue them back on later."
                },
                {
                    "headline": "Look for suitable panels and strips to cut.",
                    "description": "Go through your book, and look for various characters, scenes, sound effects, and speech bubbles that you want to put on your shoes. Many comic book shoes also have \"statement\" images. These are images that are a little larger than the rest, and are meant to stand out."
                },
                {
                    "headline": "Cut the images out.",
                    "description": "You can cut them down further into various shapes as well, such as squares, rectangles, and triangles. Make sure that you have some small and large shapes. This will make fitting them into the contours of your shoes a lot easier and reduce wrinkles. Make sure that the pieces you cut are no bigger than 1 inch (2.54 centimeters). If you are cutting out statement images, make sure that you follow their outlines. For example, if you want to cut out an image of Wonder Woman's head, make sure that you follow the outline of her hair, face, and neck. A craft blade or tiny pair of scissors would be best for this. Consider separating your shapes into groups based on size or color. This will make it easier to find the pieces you need for your design."
                },
                {
                    "headline": "Brush on some decoupage glue, such as Mod Podge, onto the back/heel area of your shoe.",
                    "description": "Only put down enough glue to apply 2 to 3 comic book scraps. Depending on the material you are working with, the may dry within minutes. Working in small patches at a time will prevent the glue from drying out too quickly. You can use any type of decoupage glue you want, but make sure that it is waterproof."
                },
                {
                    "headline": "Paint a thin coat of decoupage glue to the back of your comic book scrap.",
                    "description": "This will make the paper extra-damp and pliable. It will be easier to smooth the paper over the curves of your shoe."
                },
                {
                    "headline": "Place the comic book scrap onto your shoe, and smooth it down with another thin coat of decoupage glue.",
                    "description": "Make sure that you are placing your comic book scrap glue-side-down. You can also smooth it out with your fingers first before adding the glue on top. This will smooth down any wrinkles and loose edges."
                },
                {
                    "headline": "Continue gluing down your comic book scraps in a similar fashion.",
                    "description": "Use larger pieces of paper on the flat areas, and smaller pieces on the curved areas. When you get to the top edge, fold the paper over to the inside of the shoe. If the paper won't stay down, secure it with metal clips. You do not need to cover the entire shoe. For example, you can leave the heels and soles bare for a different look. If you are adding any \"statement\" images, don't glue them down yet; you'll be adding those at the very one, after everything has dried."
                },
                {
                    "headline": "Inspect your shoes, then clean them up, if needed.",
                    "description": "Take a close look at your shoe. If there are any imperfections, peel the paper off, and apply a new scrap. At this point, you can also run a craft blade along the seam where the shoe meets the sole, and peeling away any excess paper. If there is any glue left on the sole, use a damp towel to wipe it away."
                },
                {
                    "headline": "Add your statement images, if desired.",
                    "description": "Use the same technique as before: brush some decoupage glue onto your shoe and onto the back of the image, place the image on your shoe, and smooth it down with more glue. Once you have all of your statement images applies, give them a final coating of glue, making sure to go well past the edges to seal them."
                },
                {
                    "headline": "Add 2 to 3 more coats of decoupage glue.",
                    "description": "Let each coat of glue dry before you add the next one. You can use any type of finish you want: matte, satin, or glossy. Whichever finish you choose, make sure that it is waterproof. You can also use an acrylic sealer instead, as long as it is waterproof."
                },
                {
                    "headline": "Wear your shoes.",
                    "description": "If you cut off any embellishments earlier that you want to keep, glue them back onto your shoes using hot glue or an industrial-strength glue."
                }
            ]
        }
    ],
    "tyn": [
        "Using Fabric",
        "High heels",
        "Comic-printed fabric",
        "Fabric scissors",
        "Fabric glue or Mod Podge",
        "Foam/sponge brush",
        "Craft blade",
        "Using Comic Books",
        "Comic book, comic book scrapbook paper, or comic book wrapping paper",
        "Scissors",
        "Waterproof decoupage glue (ie: Mod Podge)"
    ],
    "text": " Using Fabric Get some comic-printed fabric. You can buy comic-printed fabric from the fabric store. You can also buy a comic-printed shirt or skirt, and use that instead; make sure that the fabric is cotton and non-stretch. Choose a pair of plain high heels. Fabric shoes would work best for this, because the glue will stick better. If your shoes are made out of patent leather, or a similar material, lightly buff them with fine-grit sandpaper or an emery board; this will give the glue something to grab on to. If there are any embellishments on your shoes, be sure to cut them off; you can always glue them back on later. Cut a piece of fabric big enough to cover one shoe. The easiest way to do this would be to lay the fabric on top of the shoe, and then to cut around it. This method is just for one shoe. You'll need to repeat it for your other shoe. It is easiest to work on one shoe at a time. Cut a slit down the middle of the fabric for the opening. Keep the fabric on top of the shoe and position your scissors just above the heel seam. Cut straight down the fabric until you are ½ inch (1.27 centimeters) away from the top of the opening (closest to the toe). Use a foam brush to coat the toe area with a thick layer of fabric glue. You can also use a decoupage glue, such as Mod Podge, but make sure that it is waterproof. Smooth the fabric down onto the glue. Make sure that the fabric is stretched over the surface of the shoe, and that there aren't any puckers or wrinkles. Cover the sides of the shoe with more glue, and smooth the fabric down into the glue. Try your best to follow the curves of the heels. Don't worry about the top opening just yet. When you get close to the heel of the shoe, stop. You can leave the heels covered or uncovered. If you plan on covering them, skip over them for now; you will need to use a separate piece of fabric for that. Trim one side of the fabric down until it goes ½ inch (1.27 centimeters) past the back seam, and glue it down. Pat some glue onto the heel of your shoe first, then press the fabric down onto the glue, making sure to pull it nice and taut. Trim the other side of the fabric until it goes 1 inch (2.54 centimeters) past the seam. You are including this extra fabric so that you can fold it under itself and create a finished seam. Don't glue it down just yet, however. Fold the raw edge under itself, then glue the fabric down. For a more secure finish, coat the underside of the fabric with glue first, then fold the raw edge under itself by ½ inch (1.27 centimeters). Brush on some glue under the fabric, then press it down onto the shoe. Shape the top opening. Go back to where you cut the slit, and cut the opening out until it is ½ inch (1.27 centimeters) away from the edge of the shoe. Next, cut slits into the fabric. Make the slits further apart along the straight edges of the shoe, and closer together in the curved areas (such as the toe). This will help the fabric lay smoother inside your shoe, and prevent wrinkling and buckling, which might make your shoes uncomfortable to wear. If your heels are peep-toes, use a similar technique: trim the fabric down to ½ inch (1.27 centimeters), then cut slits into it. Glue the fabric inside your shoe. Many crafters find that the inside of shoes doesn't take glue well for some reason. To ensure that the fabric stays down, brush glue onto the shoe and the fabric, then press the fabric down. If the fabric still won't stay down, secure it with metal clips until the glue dries. If your shoes are peep-toes, use a similar technique: glue the fabric down, then secure it with clips until it dries. Trim the excess fabric away along the sole. The easiest way to do this would be to run a craft blade down the seam between your shoe and the sole. This may even tuck the fabric into the seam. If you have a lot of excess fabric, you can trim it away with a pair of scissors first. Seal the fabric along the sole for extra security. Run some fabric glue along the seam where the body of your shoe joins the sole. Next, run something blunt along the seam to tuck the raw edges in. You can use your fingernail, a butter knife, a skewer, or even a knitting needle to do this. Consider covering the heel area as well. Start by measuring the height and circumference of your heel. Next, add 1 inch (2.54 centimeters) to the height, and 1½ inches (3.81 centimeters) to the length. Cut the fabric out, then do the following:\nFold the bottom and one of the side edges down by ½ inch (1.27 centimeters). Cover the heel with glue. Wrap the fabric around it, starting with the raw edge and finishing with the folded edge. Keep the seam on the inside of the heel. Run a craft blade along the top seam of your heel to cut away any excess fabric. This should also tuck the raw top edges into the seam. Seal the fabric with Mod Podge, or another type of sealer, if desired. This may not be necessary if you used fabric glue, but it would be a good idea if you used Mod Podge. If your fabric has any glue \"stains\" on it, then coating it with Mod Podge or sealer would help hide them. Whatever you decide to use, make sure that it is waterproof. It might be an even better idea to add 2 to 3 coats of Mod Podge or sealer. Make sure that you let each coat dry before applying the next. Let your shoes dry completely before you wear them. Even though the glues and sealers you used are waterproof, it would be best to avoid getting these shoes wet. If you get them wet, the fabric may start to bubble and warp. Using Comic Books Get some comic books, preferably ones you don't mind cutting up. If you can't stand the idea of cutting up a comic book, consider using comic-printed scrapbook paper or comic-themed wrapping paper. Choose a pair of plain high heels. The best heels to use for this project are ones that are made out of fabric or suede becuase the Mod Podge will stick to them better. If your heels are made out of patent leather, or a similar shiny material, light buff them with fine-grit sand paper or an emery board instead; this will give the Mod Podge something to stick to. If there are any embellishments on your shoes, be sure to cut them off; you can always glue them back on later. Look for suitable panels and strips to cut. Go through your book, and look for various characters, scenes, sound effects, and speech bubbles that you want to put on your shoes. Many comic book shoes also have \"statement\" images. These are images that are a little larger than the rest, and are meant to stand out. Cut the images out. You can cut them down further into various shapes as well, such as squares, rectangles, and triangles. Make sure that you have some small and large shapes. This will make fitting them into the contours of your shoes a lot easier and reduce wrinkles. Make sure that the pieces you cut are no bigger than 1 inch (2.54 centimeters). If you are cutting out statement images, make sure that you follow their outlines. For example, if you want to cut out an image of Wonder Woman's head, make sure that you follow the outline of her hair, face, and neck. A craft blade or tiny pair of scissors would be best for this. Consider separating your shapes into groups based on size or color. This will make it easier to find the pieces you need for your design. Brush on some decoupage glue, such as Mod Podge, onto the back/heel area of your shoe. Only put down enough glue to apply 2 to 3 comic book scraps. Depending on the material you are working with, the may dry within minutes. Working in small patches at a time will prevent the glue from drying out too quickly. You can use any type of decoupage glue you want, but make sure that it is waterproof. Paint a thin coat of decoupage glue to the back of your comic book scrap. This will make the paper extra-damp and pliable. It will be easier to smooth the paper over the curves of your shoe. Place the comic book scrap onto your shoe, and smooth it down with another thin coat of decoupage glue. Make sure that you are placing your comic book scrap glue-side-down. You can also smooth it out with your fingers first before adding the glue on top. This will smooth down any wrinkles and loose edges. Continue gluing down your comic book scraps in a similar fashion. Use larger pieces of paper on the flat areas, and smaller pieces on the curved areas. When you get to the top edge, fold the paper over to the inside of the shoe. If the paper won't stay down, secure it with metal clips. You do not need to cover the entire shoe. For example, you can leave the heels and soles bare for a different look. If you are adding any \"statement\" images, don't glue them down yet; you'll be adding those at the very one, after everything has dried. Inspect your shoes, then clean them up, if needed. Take a close look at your shoe. If there are any imperfections, peel the paper off, and apply a new scrap. At this point, you can also run a craft blade along the seam where the shoe meets the sole, and peeling away any excess paper. If there is any glue left on the sole, use a damp towel to wipe it away. Add your statement images, if desired. Use the same technique as before: brush some decoupage glue onto your shoe and onto the back of the image, place the image on your shoe, and smooth it down with more glue. Once you have all of your statement images applies, give them a final coating of glue, making sure to go well past the edges to seal them. Add 2 to 3 more coats of decoupage glue. Let each coat of glue dry before you add the next one. You can use any type of finish you want: matte, satin, or glossy. Whichever finish you choose, make sure that it is waterproof. You can also use an acrylic sealer instead, as long as it is waterproof. Wear your shoes. If you cut off any embellishments earlier that you want to keep, glue them back onto your shoes using hot glue or an industrial-strength glue.",
    "sentences": [
        " Using Fabric Get some comic-printed fabric.",
        "You can buy comic-printed fabric from the fabric store.",
        "You can also buy a comic-printed shirt or skirt, and use that instead; make sure that the fabric is cotton and non-stretch.",
        "Choose a pair of plain high heels.",
        "Fabric shoes would work best for this, because the glue will stick better.",
        "If your shoes are made out of patent leather, or a similar material, lightly buff them with fine-grit sandpaper or an emery board; this will give the glue something to grab on to.",
        "If there are any embellishments on your shoes, be sure to cut them off; you can always glue them back on later.",
        "Cut a piece of fabric big enough to cover one shoe.",
        "The easiest way to do this would be to lay the fabric on top of the shoe, and then to cut around it.",
        "This method is just for one shoe.",
        "You'll need to repeat it for your other shoe.",
        "It is easiest to work on one shoe at a time.",
        "Cut a slit down the middle of the fabric for the opening.",
        "Keep the fabric on top of the shoe and position your scissors just above the heel seam.",
        "Cut straight down the fabric until you are ½ inch (1.27 centimeters) away from the top of the opening (closest to the toe).",
        "Use a foam brush to coat the toe area with a thick layer of fabric glue.",
        "You can also use a decoupage glue, such as Mod Podge, but make sure that it is waterproof.",
        "Smooth the fabric down onto the glue.",
        "Make sure that the fabric is stretched over the surface of the shoe, and that there aren't any puckers or wrinkles.",
        "Cover the sides of the shoe with more glue, and smooth the fabric down into the glue.",
        "Try your best to follow the curves of the heels.",
        "Don't worry about the top opening just yet.",
        "When you get close to the heel of the shoe, stop.",
        "You can leave the heels covered or uncovered.",
        "If you plan on covering them, skip over them for now; you will need to use a separate piece of fabric for that.",
        "Trim one side of the fabric down until it goes ½ inch (1.27 centimeters) past the back seam, and glue it down.",
        "Pat some glue onto the heel of your shoe first, then press the fabric down onto the glue, making sure to pull it nice and taut.",
        "Trim the other side of the fabric until it goes 1 inch (2.54 centimeters) past the seam.",
        "You are including this extra fabric so that you can fold it under itself and create a finished seam.",
        "Don't glue it down just yet, however.",
        "Fold the raw edge under itself, then glue the fabric down.",
        "For a more secure finish, coat the underside of the fabric with glue first, then fold the raw edge under itself by ½ inch (1.27 centimeters).",
        "Brush on some glue under the fabric, then press it down onto the shoe.",
        "Shape the top opening.",
        "Go back to where you cut the slit, and cut the opening out until it is ½ inch (1.27 centimeters) away from the edge of the shoe.",
        "Next, cut slits into the fabric.",
        "Make the slits further apart along the straight edges of the shoe, and closer together in the curved areas (such as the toe).",
        "This will help the fabric lay smoother inside your shoe, and prevent wrinkling and buckling, which might make your shoes uncomfortable to wear.",
        "If your heels are peep-toes, use a similar technique: trim the fabric down to ½ inch (1.27 centimeters), then cut slits into it.",
        "Glue the fabric inside your shoe.",
        "Many crafters find that the inside of shoes doesn't take glue well for some reason.",
        "To ensure that the fabric stays down, brush glue onto the shoe and the fabric, then press the fabric down.",
        "If the fabric still won't stay down, secure it with metal clips until the glue dries.",
        "If your shoes are peep-toes, use a similar technique: glue the fabric down, then secure it with clips until it dries.",
        "Trim the excess fabric away along the sole.",
        "The easiest way to do this would be to run a craft blade down the seam between your shoe and the sole.",
        "This may even tuck the fabric into the seam.",
        "If you have a lot of excess fabric, you can trim it away with a pair of scissors first.",
        "Seal the fabric along the sole for extra security.",
        "Run some fabric glue along the seam where the body of your shoe joins the sole.",
        "Next, run something blunt along the seam to tuck the raw edges in.",
        "You can use your fingernail, a butter knife, a skewer, or even a knitting needle to do this.",
        "Consider covering the heel area as well.",
        "Start by measuring the height and circumference of your heel.",
        "Next, add 1 inch (2.54 centimeters) to the height, and 1½ inches (3.81 centimeters) to the length.",
        "Cut the fabric out, then do the following:\nFold the bottom and one of the side edges down by ½ inch (1.27 centimeters).",
        "Cover the heel with glue.",
        "Wrap the fabric around it, starting with the raw edge and finishing with the folded edge.",
        "Keep the seam on the inside of the heel.",
        "Run a craft blade along the top seam of your heel to cut away any excess fabric.",
        "This should also tuck the raw top edges into the seam.",
        "Seal the fabric with Mod Podge, or another type of sealer, if desired.",
        "This may not be necessary if you used fabric glue, but it would be a good idea if you used Mod Podge.",
        "If your fabric has any glue \"stains\" on it, then coating it with Mod Podge or sealer would help hide them.",
        "Whatever you decide to use, make sure that it is waterproof.",
        "It might be an even better idea to add 2 to 3 coats of Mod Podge or sealer.",
        "Make sure that you let each coat dry before applying the next.",
        "Let your shoes dry completely before you wear them.",
        "Even though the glues and sealers you used are waterproof, it would be best to avoid getting these shoes wet.",
        "If you get them wet, the fabric may start to bubble and warp.",
        "Using Comic Books Get some comic books, preferably ones you don't mind cutting up.",
        "If you can't stand the idea of cutting up a comic book, consider using comic-printed scrapbook paper or comic-themed wrapping paper.",
        "Choose a pair of plain high heels.",
        "The best heels to use for this project are ones that are made out of fabric or suede becuase the Mod Podge will stick to them better.",
        "If your heels are made out of patent leather, or a similar shiny material, light buff them with fine-grit sand paper or an emery board instead; this will give the Mod Podge something to stick to.",
        "If there are any embellishments on your shoes, be sure to cut them off; you can always glue them back on later.",
        "Look for suitable panels and strips to cut.",
        "Go through your book, and look for various characters, scenes, sound effects, and speech bubbles that you want to put on your shoes.",
        "Many comic book shoes also have \"statement\" images.",
        "These are images that are a little larger than the rest, and are meant to stand out.",
        "Cut the images out.",
        "You can cut them down further into various shapes as well, such as squares, rectangles, and triangles.",
        "Make sure that you have some small and large shapes.",
        "This will make fitting them into the contours of your shoes a lot easier and reduce wrinkles.",
        "Make sure that the pieces you cut are no bigger than 1 inch (2.54 centimeters).",
        "If you are cutting out statement images, make sure that you follow their outlines.",
        "For example, if you want to cut out an image of Wonder Woman's head, make sure that you follow the outline of her hair, face, and neck.",
        "A craft blade or tiny pair of scissors would be best for this.",
        "Consider separating your shapes into groups based on size or color.",
        "This will make it easier to find the pieces you need for your design.",
        "Brush on some decoupage glue, such as Mod Podge, onto the back/heel area of your shoe.",
        "Only put down enough glue to apply 2 to 3 comic book scraps.",
        "Depending on the material you are working with, the may dry within minutes.",
        "Working in small patches at a time will prevent the glue from drying out too quickly.",
        "You can use any type of decoupage glue you want, but make sure that it is waterproof.",
        "Paint a thin coat of decoupage glue to the back of your comic book scrap.",
        "This will make the paper extra-damp and pliable.",
        "It will be easier to smooth the paper over the curves of your shoe.",
        "Place the comic book scrap onto your shoe, and smooth it down with another thin coat of decoupage glue.",
        "Make sure that you are placing your comic book scrap glue-side-down.",
        "You can also smooth it out with your fingers first before adding the glue on top.",
        "This will smooth down any wrinkles and loose edges.",
        "Continue gluing down your comic book scraps in a similar fashion.",
        "Use larger pieces of paper on the flat areas, and smaller pieces on the curved areas.",
        "When you get to the top edge, fold the paper over to the inside of the shoe.",
        "If the paper won't stay down, secure it with metal clips.",
        "You do not need to cover the entire shoe.",
        "For example, you can leave the heels and soles bare for a different look.",
        "If you are adding any \"statement\" images, don't glue them down yet; you'll be adding those at the very one, after everything has dried.",
        "Inspect your shoes, then clean them up, if needed.",
        "Take a close look at your shoe.",
        "If there are any imperfections, peel the paper off, and apply a new scrap.",
        "At this point, you can also run a craft blade along the seam where the shoe meets the sole, and peeling away any excess paper.",
        "If there is any glue left on the sole, use a damp towel to wipe it away.",
        "Add your statement images, if desired.",
        "Use the same technique as before: brush some decoupage glue onto your shoe and onto the back of the image, place the image on your shoe, and smooth it down with more glue.",
        "Once you have all of your statement images applies, give them a final coating of glue, making sure to go well past the edges to seal them.",
        "Add 2 to 3 more coats of decoupage glue.",
        "Let each coat of glue dry before you add the next one.",
        "You can use any type of finish you want: matte, satin, or glossy.",
        "Whichever finish you choose, make sure that it is waterproof.",
        "You can also use an acrylic sealer instead, as long as it is waterproof.",
        "Wear your shoes.",
        "If you cut off any embellishments earlier that you want to keep, glue them back onto your shoes using hot glue or an industrial-strength glue."
    ]
}