{
    "title": "How to Pack Your Tote Bag (Teens)",
    "url": "https://www.wikihow.com/Pack-Your-Tote-Bag-(Teens)",
    "category_hierarchy": [
        "Personal Care and Style",
        "Bags",
        "Handbags and Purses"
    ],
    "steps": [
        {
            "headline": "Buy a cute tote bag.",
            "description": "If you live in America, you can buy one at Target, but many other shops do sell them."
        },
        {
            "headline": "Pack your school supplies.",
            "description": "Get a binder and some folders because they are lighter and slimmer. Put your planner, notebooks, etc."
        },
        {
            "headline": "Pack a pencil case.",
            "description": "But don't just put some pencils in. Be more organized. Put in a geometry set, some pencils, some mechanical pencils, pens (preferably at least black,blue,and red, but be unique! ), highlighters, an eraser, a ruler, box of leads, and a sharpener"
        },
        {
            "headline": "Get a cute bag for your makeup if you wear/want to wear it.",
            "description": "Again, you can get these from Target. Some things you can put in your makeup bag is concealer (if you feel like you need it), lip gloss or blush. But remember, don't be pressured into wearing makeup. Be you!"
        },
        {
            "headline": "Pack your wallet with your school ID, some lunch money, cards, receipts and some pics.",
            "description": ""
        },
        {
            "headline": "Pack your water bottle and a snack (granola bars or raisins).",
            "description": ""
        },
        {
            "headline": "Pack an \"emergency kit\" with things like pads and/or tampons and/or a diva cup (even if you haven't yet started your period), hair ties, bobby pins, perfume and hand sanitizers.",
            "description": ""
        },
        {
            "headline": "Put in a good book you're currently reading, in case you're bored.",
            "description": ""
        },
        {
            "headline": "Get some things you want to put in your bag in case you're in a boring class, like nail polish (if you're allowed in your school), nail file, etc.",
            "description": ""
        },
        {
            "headline": "Put your personal things like your locker key, car key, house key, etc.",
            "description": ""
        },
        {
            "headline": "Don't forget your cell phone, iPod and headphones.",
            "description": "Music rocks!"
        },
        {
            "headline": "Pack some breath mints, since gum isn't allowed in most schools.",
            "description": ""
        },
        {
            "headline": "If necessary, pack your contact lenses/glasses and their case.",
            "description": ""
        },
        {
            "headline": "A camera and a paperback dictionary is also a must",
            "description": ""
        },
        {
            "headline": "Sunglasses and an umbrella, you never know!",
            "description": ""
        },
        {
            "headline": "Have fun!",
            "description": ""
        }
    ],
    "tyn": [
        "Cell phone",
        "iPod and head phones",
        "Emergency kit",
        "Binders, folders",
        "Keys",
        "Wallet",
        "Pencil pouch",
        "Makeup bag",
        "Nail polish and filer",
        "Socks",
        "Contact case, glasses case",
        "Glasses",
        "Water bottle and a snack"
    ],
    "text": " Buy a cute tote bag. If you live in America, you can buy one at Target, but many other shops do sell them. Pack your school supplies. Get a binder and some folders because they are lighter and slimmer. Put your planner, notebooks, etc. Pack a pencil case. But don't just put some pencils in. Be more organized. Put in a geometry set, some pencils, some mechanical pencils, pens (preferably at least black,blue,and red, but be unique! ), highlighters, an eraser, a ruler, box of leads, and a sharpener Get a cute bag for your makeup if you wear/want to wear it. Again, you can get these from Target. Some things you can put in your makeup bag is concealer (if you feel like you need it), lip gloss or blush. But remember, don't be pressured into wearing makeup. Be you! Pack your wallet with your school ID, some lunch money, cards, receipts and some pics.  Pack your water bottle and a snack (granola bars or raisins).  Pack an \"emergency kit\" with things like pads and/or tampons and/or a diva cup (even if you haven't yet started your period), hair ties, bobby pins, perfume and hand sanitizers.  Put in a good book you're currently reading, in case you're bored.  Get some things you want to put in your bag in case you're in a boring class, like nail polish (if you're allowed in your school), nail file, etc.  Put your personal things like your locker key, car key, house key, etc.  Don't forget your cell phone, iPod and headphones. Music rocks! Pack some breath mints, since gum isn't allowed in most schools.  If necessary, pack your contact lenses/glasses and their case.  A camera and a paperback dictionary is also a must  Sunglasses and an umbrella, you never know!  Have fun! ",
    "sentences": [
        " Buy a cute tote bag.",
        "If you live in America, you can buy one at Target, but many other shops do sell them.",
        "Pack your school supplies.",
        "Get a binder and some folders because they are lighter and slimmer.",
        "Put your planner, notebooks, etc.",
        "Pack a pencil case.",
        "But don't just put some pencils in.",
        "Be more organized.",
        "Put in a geometry set, some pencils, some mechanical pencils, pens (preferably at least black,blue,and red, but be unique!",
        "), highlighters, an eraser, a ruler, box of leads, and a sharpener Get a cute bag for your makeup if you wear/want to wear it.",
        "Again, you can get these from Target.",
        "Some things you can put in your makeup bag is concealer (if you feel like you need it), lip gloss or blush.",
        "But remember, don't be pressured into wearing makeup.",
        "Be you!",
        "Pack your wallet with your school ID, some lunch money, cards, receipts and some pics.",
        "Pack your water bottle and a snack (granola bars or raisins).",
        "Pack an \"emergency kit\" with things like pads and/or tampons and/or a diva cup (even if you haven't yet started your period), hair ties, bobby pins, perfume and hand sanitizers.",
        "Put in a good book you're currently reading, in case you're bored.",
        "Get some things you want to put in your bag in case you're in a boring class, like nail polish (if you're allowed in your school), nail file, etc.",
        "Put your personal things like your locker key, car key, house key, etc.",
        "Don't forget your cell phone, iPod and headphones.",
        "Music rocks!",
        "Pack some breath mints, since gum isn't allowed in most schools.",
        "If necessary, pack your contact lenses/glasses and their case.",
        "A camera and a paperback dictionary is also a must  Sunglasses and an umbrella, you never know!",
        "Have fun!"
    ]
}