{
    "title": "How to Make a Galaxy Shirt",
    "url": "https://www.wikihow.com/Make-a-Galaxy-Shirt",
    "category_hierarchy": [
        "Personal Care and Style",
        "Fashion",
        "Fashion Styles",
        "Color in Fashion"
    ],
    "parts": [
        {
            "name": "Preparing Your Workspace",
            "steps": [
                {
                    "headline": "Pick a black cotton shirt so your galaxy shows up.",
                    "description": "Outer space is mostly black with specks of stars and planets. To make your galaxy shirt realistic, pick out a mostly cotton T-shirt that’s all black.If your shirt is a blend of fabrics, just make sure it’s mostly cotton so the bleach shows up well. You can also use a navy blue shirt or a really dark green one."
                },
                {
                    "headline": "Line the inside of your shirt with a sheet of cardboard.",
                    "description": "Cut out a piece of cardboard that’s about as wide as your shirt, then slide it in between the front and back of your T-shirt. This will protect the back of the shirt from getting bleach on it if it bleeds through.If you don’t have any cardboard, you can also use a sheet of plastic."
                },
                {
                    "headline": "Spread your shirt out on a plastic bag or drop cloth.",
                    "description": "Making a galaxy shirt can get kind of messy. Protect your surroundings with a plastic bag, drop cloth, or a tarp so you don’t get bleach or paint on anything. You may also want to wear old clothes that you don’t mind getting stained with bleach or paint."
                },
                {
                    "headline": "Mix 1 part bleach with 2 parts water in a spray bottle.",
                    "description": "Bleach on its own is a little too strong for a cotton shirt. Carefully pour 1 part bleach to 2 parts of water into a spray bottle and shake them together to mix them up.Warning: Put on gloves to protect your hands while using bleach. For example, if you are using ⁄2 cup (120 mL) of bleach, mix it with 1  c (240 mL) of water."
                }
            ]
        },
        {
            "name": "Spraying the Shirt with Bleach",
            "steps": [
                {
                    "headline": "Twist the middle of your shirt slightly to create a spiral pattern.",
                    "description": "With your shirt flat still, grab the center of the shirt and twist it clockwise to create a spiral in the center. This will create the shape of your galaxy that you can build upon with your design. You don’t have to twist your shirt in the front if you don’t want to, but it helps to center the design and make it more galaxy-like."
                },
                {
                    "headline": "Mist the front of the shirt with bleach spray in a random pattern.",
                    "description": "The bleach will show up as a slightly orange, light color. Make sure your spray bottle is on the “mist” setting and spray the front of your shirt in a thin layer. Make some sprays close together and others further apart. Try to keep the mist of bleach in a loose circle shape on the front of your shirt to make it more galaxy shaped.Spraying the bleach near other bleach spots will create the appearance of connected star clusters, while spraying them further apart helps to create the illusion of depth and distance by making it appear as though there are other star clusters in the distance."
                },
                {
                    "headline": "Dry your shirt for about 30 minutes.",
                    "description": "Before you move on, make sure the bleach on your shirt is completely dry. Leave your shirt spread flat for at least 30 minutes, or until it’s dry all the way through.Tip: You can speed up the drying process by pointing a hair dryer at your shirt. The bleach will turn a dark orange color as it dries."
                },
                {
                    "headline": "Wash and dry your shirt to stop the bleaching process.",
                    "description": "Run your shirt through a cold water cycle in your washer, then put it in the dryer to dry it completely. This will stop the bleach from lightening your shirt anymore so it stays the color that you want it to. You can also hand wash your shirt in cold water with a few drops of detergent. Then, you can either hang it to dry or put it in your dryer. If you don’t wash your shirt after bleaching it, the bleach could eventually eat through the material of the shirt."
                }
            ]
        },
        {
            "name": "Adding Stars and Colors",
            "steps": [
                {
                    "headline": "Sponge on purple, blue, pink, and orange fabric paint.",
                    "description": "Dip a sponge into some colorful fabric paint of your choosing. Gently dab the paint in random patterns all over your shirt to create the colors in the galaxy. Use your creativity here, and don’t be afraid to mix colors! You can pick any colors that you’d like to. Think about pictures of outer space that you’ve seen to think about what kind of color scheme you’re going for. For a more feminine look, you can use shades like magenta, deep purple, and lighter pink. If you don’t have any fabric paint, dilute some tie-dye with water and use that instead."
                },
                {
                    "headline": "Blend the colors together with a sponge or paper towel.",
                    "description": "A real galaxy has a fluid blend of all the colors it contains. Use a damp sponge or paper towel to blur the edges of your colors and mix a few of them together.You can lighten up some of the colors by dabbing more white paint on them to add more shades. The goal is to make your colors look like clouds, so the more blended they are, the better."
                },
                {
                    "headline": "Dab white fabric paint onto the shirt with a toothbrush.",
                    "description": "Dip the bristles of a dry toothbrush into some white fabric paint. Hold the toothbrush over the front of your shirt, then flick the bristles to create droplets of white paint. Use the paint to create stars all throughout your galaxy.Tip: You can practice this by aiming your toothbrush at a piece of paper before you try it on your shirt. The closer you hold the toothbrush to the shirt, the bigger the stars will be. Try to concentrate the flecks of paint around the bleached star clusters you created. A few stray stars are okay, but the majority should be near the bleached portion of the shirt rather than the empty portion."
                },
                {
                    "headline": "Leave your shirt out to dry overnight.",
                    "description": "You can keep your shirt spread out where you were working on it, or you can hang it on a clothesline outside. Once the paint is dry, you can show off your new galaxy shirt to your friends and family! You can always add more paint after the shirt is dry. You can wash your shirt in the washing machine using cold water. To make sure your shirt doesn’t fade, hang it up to dry instead of putting it in the dryer."
                }
            ]
        }
    ],
    "tyn": [
        "Black shirt",
        "Bleach",
        "Water",
        "Spray bottle",
        "Large plastic bags",
        "Plastic gloves",
        "Hair dryer",
        "White fabric paint",
        "Stiff paintbrush or toothbrush",
        "Acrylic paint in various colors",
        "Sponge brush or sponge"
    ],
    "text": " Preparing Your Workspace Pick a black cotton shirt so your galaxy shows up. Outer space is mostly black with specks of stars and planets. To make your galaxy shirt realistic, pick out a mostly cotton T-shirt that’s all black.If your shirt is a blend of fabrics, just make sure it’s mostly cotton so the bleach shows up well. You can also use a navy blue shirt or a really dark green one. Line the inside of your shirt with a sheet of cardboard. Cut out a piece of cardboard that’s about as wide as your shirt, then slide it in between the front and back of your T-shirt. This will protect the back of the shirt from getting bleach on it if it bleeds through.If you don’t have any cardboard, you can also use a sheet of plastic. Spread your shirt out on a plastic bag or drop cloth. Making a galaxy shirt can get kind of messy. Protect your surroundings with a plastic bag, drop cloth, or a tarp so you don’t get bleach or paint on anything. You may also want to wear old clothes that you don’t mind getting stained with bleach or paint. Mix 1 part bleach with 2 parts water in a spray bottle. Bleach on its own is a little too strong for a cotton shirt. Carefully pour 1 part bleach to 2 parts of water into a spray bottle and shake them together to mix them up.Warning: Put on gloves to protect your hands while using bleach. For example, if you are using ⁄2 cup (120 mL) of bleach, mix it with 1  c (240 mL) of water. Spraying the Shirt with Bleach Twist the middle of your shirt slightly to create a spiral pattern. With your shirt flat still, grab the center of the shirt and twist it clockwise to create a spiral in the center. This will create the shape of your galaxy that you can build upon with your design. You don’t have to twist your shirt in the front if you don’t want to, but it helps to center the design and make it more galaxy-like. Mist the front of the shirt with bleach spray in a random pattern. The bleach will show up as a slightly orange, light color. Make sure your spray bottle is on the “mist” setting and spray the front of your shirt in a thin layer. Make some sprays close together and others further apart. Try to keep the mist of bleach in a loose circle shape on the front of your shirt to make it more galaxy shaped.Spraying the bleach near other bleach spots will create the appearance of connected star clusters, while spraying them further apart helps to create the illusion of depth and distance by making it appear as though there are other star clusters in the distance. Dry your shirt for about 30 minutes. Before you move on, make sure the bleach on your shirt is completely dry. Leave your shirt spread flat for at least 30 minutes, or until it’s dry all the way through.Tip: You can speed up the drying process by pointing a hair dryer at your shirt. The bleach will turn a dark orange color as it dries. Wash and dry your shirt to stop the bleaching process. Run your shirt through a cold water cycle in your washer, then put it in the dryer to dry it completely. This will stop the bleach from lightening your shirt anymore so it stays the color that you want it to. You can also hand wash your shirt in cold water with a few drops of detergent. Then, you can either hang it to dry or put it in your dryer. If you don’t wash your shirt after bleaching it, the bleach could eventually eat through the material of the shirt. Adding Stars and Colors Sponge on purple, blue, pink, and orange fabric paint. Dip a sponge into some colorful fabric paint of your choosing. Gently dab the paint in random patterns all over your shirt to create the colors in the galaxy. Use your creativity here, and don’t be afraid to mix colors! You can pick any colors that you’d like to. Think about pictures of outer space that you’ve seen to think about what kind of color scheme you’re going for. For a more feminine look, you can use shades like magenta, deep purple, and lighter pink. If you don’t have any fabric paint, dilute some tie-dye with water and use that instead. Blend the colors together with a sponge or paper towel. A real galaxy has a fluid blend of all the colors it contains. Use a damp sponge or paper towel to blur the edges of your colors and mix a few of them together.You can lighten up some of the colors by dabbing more white paint on them to add more shades. The goal is to make your colors look like clouds, so the more blended they are, the better. Dab white fabric paint onto the shirt with a toothbrush. Dip the bristles of a dry toothbrush into some white fabric paint. Hold the toothbrush over the front of your shirt, then flick the bristles to create droplets of white paint. Use the paint to create stars all throughout your galaxy.Tip: You can practice this by aiming your toothbrush at a piece of paper before you try it on your shirt. The closer you hold the toothbrush to the shirt, the bigger the stars will be. Try to concentrate the flecks of paint around the bleached star clusters you created. A few stray stars are okay, but the majority should be near the bleached portion of the shirt rather than the empty portion. Leave your shirt out to dry overnight. You can keep your shirt spread out where you were working on it, or you can hang it on a clothesline outside. Once the paint is dry, you can show off your new galaxy shirt to your friends and family! You can always add more paint after the shirt is dry. You can wash your shirt in the washing machine using cold water. To make sure your shirt doesn’t fade, hang it up to dry instead of putting it in the dryer.",
    "sentences": [
        " Preparing Your Workspace Pick a black cotton shirt so your galaxy shows up.",
        "Outer space is mostly black with specks of stars and planets.",
        "To make your galaxy shirt realistic, pick out a mostly cotton T-shirt that’s all black.If your shirt is a blend of fabrics, just make sure it’s mostly cotton so the bleach shows up well.",
        "You can also use a navy blue shirt or a really dark green one.",
        "Line the inside of your shirt with a sheet of cardboard.",
        "Cut out a piece of cardboard that’s about as wide as your shirt, then slide it in between the front and back of your T-shirt.",
        "This will protect the back of the shirt from getting bleach on it if it bleeds through.If you don’t have any cardboard, you can also use a sheet of plastic.",
        "Spread your shirt out on a plastic bag or drop cloth.",
        "Making a galaxy shirt can get kind of messy.",
        "Protect your surroundings with a plastic bag, drop cloth, or a tarp so you don’t get bleach or paint on anything.",
        "You may also want to wear old clothes that you don’t mind getting stained with bleach or paint.",
        "Mix 1 part bleach with 2 parts water in a spray bottle.",
        "Bleach on its own is a little too strong for a cotton shirt.",
        "Carefully pour 1 part bleach to 2 parts of water into a spray bottle and shake them together to mix them up.Warning: Put on gloves to protect your hands while using bleach.",
        "For example, if you are using ⁄2 cup (120 mL) of bleach, mix it with 1  c (240 mL) of water.",
        "Spraying the Shirt with Bleach Twist the middle of your shirt slightly to create a spiral pattern.",
        "With your shirt flat still, grab the center of the shirt and twist it clockwise to create a spiral in the center.",
        "This will create the shape of your galaxy that you can build upon with your design.",
        "You don’t have to twist your shirt in the front if you don’t want to, but it helps to center the design and make it more galaxy-like.",
        "Mist the front of the shirt with bleach spray in a random pattern.",
        "The bleach will show up as a slightly orange, light color.",
        "Make sure your spray bottle is on the “mist” setting and spray the front of your shirt in a thin layer.",
        "Make some sprays close together and others further apart.",
        "Try to keep the mist of bleach in a loose circle shape on the front of your shirt to make it more galaxy shaped.Spraying the bleach near other bleach spots will create the appearance of connected star clusters, while spraying them further apart helps to create the illusion of depth and distance by making it appear as though there are other star clusters in the distance.",
        "Dry your shirt for about 30 minutes.",
        "Before you move on, make sure the bleach on your shirt is completely dry.",
        "Leave your shirt spread flat for at least 30 minutes, or until it’s dry all the way through.Tip: You can speed up the drying process by pointing a hair dryer at your shirt.",
        "The bleach will turn a dark orange color as it dries.",
        "Wash and dry your shirt to stop the bleaching process.",
        "Run your shirt through a cold water cycle in your washer, then put it in the dryer to dry it completely.",
        "This will stop the bleach from lightening your shirt anymore so it stays the color that you want it to.",
        "You can also hand wash your shirt in cold water with a few drops of detergent.",
        "Then, you can either hang it to dry or put it in your dryer.",
        "If you don’t wash your shirt after bleaching it, the bleach could eventually eat through the material of the shirt.",
        "Adding Stars and Colors Sponge on purple, blue, pink, and orange fabric paint.",
        "Dip a sponge into some colorful fabric paint of your choosing.",
        "Gently dab the paint in random patterns all over your shirt to create the colors in the galaxy.",
        "Use your creativity here, and don’t be afraid to mix colors!",
        "You can pick any colors that you’d like to.",
        "Think about pictures of outer space that you’ve seen to think about what kind of color scheme you’re going for.",
        "For a more feminine look, you can use shades like magenta, deep purple, and lighter pink.",
        "If you don’t have any fabric paint, dilute some tie-dye with water and use that instead.",
        "Blend the colors together with a sponge or paper towel.",
        "A real galaxy has a fluid blend of all the colors it contains.",
        "Use a damp sponge or paper towel to blur the edges of your colors and mix a few of them together.You can lighten up some of the colors by dabbing more white paint on them to add more shades.",
        "The goal is to make your colors look like clouds, so the more blended they are, the better.",
        "Dab white fabric paint onto the shirt with a toothbrush.",
        "Dip the bristles of a dry toothbrush into some white fabric paint.",
        "Hold the toothbrush over the front of your shirt, then flick the bristles to create droplets of white paint.",
        "Use the paint to create stars all throughout your galaxy.Tip: You can practice this by aiming your toothbrush at a piece of paper before you try it on your shirt.",
        "The closer you hold the toothbrush to the shirt, the bigger the stars will be.",
        "Try to concentrate the flecks of paint around the bleached star clusters you created.",
        "A few stray stars are okay, but the majority should be near the bleached portion of the shirt rather than the empty portion.",
        "Leave your shirt out to dry overnight.",
        "You can keep your shirt spread out where you were working on it, or you can hang it on a clothesline outside.",
        "Once the paint is dry, you can show off your new galaxy shirt to your friends and family!",
        "You can always add more paint after the shirt is dry.",
        "You can wash your shirt in the washing machine using cold water.",
        "To make sure your shirt doesn’t fade, hang it up to dry instead of putting it in the dryer."
    ]
}