{
    "title": "How to Make Sweet Hibiscus Flower Syrup",
    "url": "https://www.wikihow.com/Make-Sweet-Hibiscus-Flower-Syrup",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments",
        "Syrups"
    ],
    "steps": [
        {
            "headline": "Place the hibiscus flowers in the saucepan.",
            "description": "Pour in the water."
        },
        {
            "headline": "Bring to the boil.",
            "description": "Then remove from the heat immediately."
        },
        {
            "headline": "Set aside for the flavor to infuse for 15 minutes.",
            "description": ""
        },
        {
            "headline": "Strain the mixture to remove the hibiscus flowers.",
            "description": "Return the strained liquid back to the saucepan and add the sugar."
        },
        {
            "headline": "Slowly bring the mixture to a boil, all the while stirring to help the sugar dissolve.",
            "description": ""
        },
        {
            "headline": "Cook until it reduces to a syrup.",
            "description": "Remove from the heat and leave to cool down. Pour into a bottle for storing in the fridge if you're not using the syrup straight away."
        },
        {
            "headline": "To make a drink:",
            "description": "Pour a good serving of the syrup into a glass. Add soda water, lemonade, plain water or other liquid of choice."
        },
        {
            "headline": "Add ice and it's ready to enjoy.",
            "description": ""
        },
        {
            "headline": "Finished.",
            "description": ""
        }
    ],
    "tyn": [
        "Saucepan",
        "Stirring implement",
        "Strainer or sieve",
        "Bottle for keeping syrup in (optional)"
    ],
    "text": " Place the hibiscus flowers in the saucepan. Pour in the water. Bring to the boil. Then remove from the heat immediately. Set aside for the flavor to infuse for 15 minutes.  Strain the mixture to remove the hibiscus flowers. Return the strained liquid back to the saucepan and add the sugar. Slowly bring the mixture to a boil, all the while stirring to help the sugar dissolve.  Cook until it reduces to a syrup. Remove from the heat and leave to cool down. Pour into a bottle for storing in the fridge if you're not using the syrup straight away. To make a drink: Pour a good serving of the syrup into a glass. Add soda water, lemonade, plain water or other liquid of choice. Add ice and it's ready to enjoy.  Finished. ",
    "sentences": [
        " Place the hibiscus flowers in the saucepan.",
        "Pour in the water.",
        "Bring to the boil.",
        "Then remove from the heat immediately.",
        "Set aside for the flavor to infuse for 15 minutes.",
        "Strain the mixture to remove the hibiscus flowers.",
        "Return the strained liquid back to the saucepan and add the sugar.",
        "Slowly bring the mixture to a boil, all the while stirring to help the sugar dissolve.",
        "Cook until it reduces to a syrup.",
        "Remove from the heat and leave to cool down.",
        "Pour into a bottle for storing in the fridge if you're not using the syrup straight away.",
        "To make a drink: Pour a good serving of the syrup into a glass.",
        "Add soda water, lemonade, plain water or other liquid of choice.",
        "Add ice and it's ready to enjoy.",
        "Finished."
    ]
}