{
    "title": "How to Fix Your Computer when It Is Writing in All Caps",
    "url": "https://www.wikihow.com/Fix-Your-Computer-when-It-Is-Writing-in-All-Caps",
    "category_hierarchy": [
        "Computers and Electronics",
        "Computers",
        "Computer Troubleshooting"
    ],
    "steps": [
        {
            "headline": "Try pressing the Caps Lock button.",
            "description": "This solves many caps lock-related issues."
        },
        {
            "headline": "If this doesn't fix the problem, then on the left hand side of the keyboard or right in Europe, you will find a lot of buttons.",
            "description": "Go to the far left hand side and locate the key that reads Caps Lock. Caps Lock will be in between the Shift and Backspace button. \"sometimes Shift and Tab\""
        },
        {
            "headline": "In a firm motion, press the Caps Lock key again.",
            "description": "This should help, but in order to test open up an email message and begin typing hopefully all your words will come out coherently without the need for more capital letters."
        }
    ],
    "tyn": [
        "A broken PC"
    ],
    "text": " Try pressing the Caps Lock button. This solves many caps lock-related issues. If this doesn't fix the problem, then on the left hand side of the keyboard or right in Europe, you will find a lot of buttons. Go to the far left hand side and locate the key that reads Caps Lock. Caps Lock will be in between the Shift and Backspace button. \"sometimes Shift and Tab\" In a firm motion, press the Caps Lock key again. This should help, but in order to test open up an email message and begin typing hopefully all your words will come out coherently without the need for more capital letters.",
    "sentences": [
        " Try pressing the Caps Lock button.",
        "This solves many caps lock-related issues.",
        "If this doesn't fix the problem, then on the left hand side of the keyboard or right in Europe, you will find a lot of buttons.",
        "Go to the far left hand side and locate the key that reads Caps Lock.",
        "Caps Lock will be in between the Shift and Backspace button.",
        "\"sometimes Shift and Tab\" In a firm motion, press the Caps Lock key again.",
        "This should help, but in order to test open up an email message and begin typing hopefully all your words will come out coherently without the need for more capital letters."
    ]
}