{
    "title": "How to Cook Short Ribs",
    "url": "https://www.wikihow.com/Cook-Short-Ribs",
    "category_hierarchy": [
        "Food and Entertaining"
    ],
    "methods": [
        {
            "name": "Short Ribs with Carrots and Celery",
            "steps": [
                {
                    "headline": "Preheat the oven to 400 degrees F (204 degrees C).",
                    "description": "Place the short ribs on a baking sheet, season with salt and pepper, and roast in the oven for 15 minutes. Remove the ribs from the oven, and then reduce oven temperature to 300 degrees F (149 degrees C)."
                },
                {
                    "headline": "Heat olive oil in a large dutch oven.",
                    "description": "Add the onion, celery, fennel, leek, and carrots, and cook over medium-low heat for about 20 minutes, stirring occasionally."
                },
                {
                    "headline": "Add in the garlic and continue cooking the vegetables for 2 minutes.",
                    "description": "Pour the wine into the pot, bring the mixture to a boil, and cook under high heat for about 10 minutes. Liquid should be reduced by half."
                },
                {
                    "headline": "Place the roasted ribs into the pot along with rosemary, thyme, salt, and pepper.",
                    "description": "Add the beef stock and brown sugar, and bring to a simmer over high heat. Tie the rosemary and thyme together with kitchen string so that they can be easily removed later."
                },
                {
                    "headline": "Cover the pot and bake in the oven for 2 hours, or until meat is tender.",
                    "description": "Remove the ribs from the pot and set them aside. Remove the herbs and cook the vegetables over medium heat for 20 minutes. Place the ribs back into the pot and heat through."
                },
                {
                    "headline": "Serve the ribs with vegetables and sauce.",
                    "description": "If you are old enough, enjoy this meal with a glass of Cabernet Sauvignon or other red wine."
                }
            ]
        },
        {
            "name": "Braised Short Ribs",
            "steps": [
                {
                    "headline": "Season each short rib with salt and pepper.",
                    "description": "Coat a large pot with olive oil and place over high heat. Add the short ribs and cook for 2-3 minutes on each side, or until the meat is browned."
                },
                {
                    "headline": "Preheat the oven to 375 degrees F (190 degrees C).",
                    "description": "Place the vegetables and garlic in a food processor and puree until the mixture forms a thick paste."
                },
                {
                    "headline": "Remove the ribs from the pan and set aside.",
                    "description": "Drain the fat from the pan, and then coat the bottom of the pan with fresh oil. Add in the pureed vegetables, and cook for about 5-7 minutes, or until browned. Scrape the bottom of the pan with a spatula occasionally while vegetables cook."
                },
                {
                    "headline": "Add the tomato paste and cook until browned (about 4-5 minutes).",
                    "description": "Pour in the wine, scrape the bottom of the pan, and lower the heat. Cook under low heat until the liquid reduces by half."
                },
                {
                    "headline": "Place the short ribs in the pan and add 2 cups of water.",
                    "description": "The water should almost completely cover the meat. Add the thyme and bay leaves, cover the pan, and cook in the preheated oven for 3 hours. Check on the meat periodically, adding more water if necessary. Turn the ribs over halfway through."
                },
                {
                    "headline": "Remove the lid and allow the meat to cook uncovered for the last 20 minutes.",
                    "description": "This will allow the meat to brown and the sauce to reduce."
                },
                {
                    "headline": "Remove pot from the oven and serve immediately.",
                    "description": "Pour the braising liquid over the meat for added flavor and moisture. Garnish with parsley if desired, and pair with a glass of rich red wine if you are old enough."
                }
            ]
        },
        {
            "name": "Barbecued Short Ribs",
            "steps": [
                {
                    "headline": "Preheat the oven to 300 degrees F (149 degrees C).",
                    "description": "Season the ribs with salt and pepper and arrange them on a large baking sheet."
                },
                {
                    "headline": "Combine the sugar, paprika, garlic powder, vinegar, ketchup, mustard, Worcestershire sauce, and thyme in a small bowl.",
                    "description": "Stir the mixture together and then toss with the ribs, making sure that each piece is evenly coated."
                },
                {
                    "headline": "Cover the ribs with aluminum foil and roast for about 3 hours.",
                    "description": "Meat should be tender and fully cooked through."
                },
                {
                    "headline": "Remove the foil and allow meat to cook uncovered for the last 30 minutes.",
                    "description": "This will allow the tops to brown."
                },
                {
                    "headline": "Serve immediately.",
                    "description": "Consider serving with ranch dressing, ketchup, or other dipping sauce."
                }
            ]
        }
    ],
    "tyn": [
        "Short Ribs with Carrots and Celery",
        "Dutch oven",
        "Baking sheet",
        "Braised Short Ribs",
        "Large pot",
        "Food processor",
        "Barbecued Short Ribs",
        "Aluminum foil"
    ],
    "text": " Short Ribs with Carrots and Celery Preheat the oven to 400 degrees F (204 degrees C). Place the short ribs on a baking sheet, season with salt and pepper, and roast in the oven for 15 minutes. Remove the ribs from the oven, and then reduce oven temperature to 300 degrees F (149 degrees C). Heat olive oil in a large dutch oven. Add the onion, celery, fennel, leek, and carrots, and cook over medium-low heat for about 20 minutes, stirring occasionally. Add in the garlic and continue cooking the vegetables for 2 minutes. Pour the wine into the pot, bring the mixture to a boil, and cook under high heat for about 10 minutes. Liquid should be reduced by half. Place the roasted ribs into the pot along with rosemary, thyme, salt, and pepper. Add the beef stock and brown sugar, and bring to a simmer over high heat. Tie the rosemary and thyme together with kitchen string so that they can be easily removed later. Cover the pot and bake in the oven for 2 hours, or until meat is tender. Remove the ribs from the pot and set them aside. Remove the herbs and cook the vegetables over medium heat for 20 minutes. Place the ribs back into the pot and heat through. Serve the ribs with vegetables and sauce. If you are old enough, enjoy this meal with a glass of Cabernet Sauvignon or other red wine. Braised Short Ribs Season each short rib with salt and pepper. Coat a large pot with olive oil and place over high heat. Add the short ribs and cook for 2-3 minutes on each side, or until the meat is browned. Preheat the oven to 375 degrees F (190 degrees C). Place the vegetables and garlic in a food processor and puree until the mixture forms a thick paste. Remove the ribs from the pan and set aside. Drain the fat from the pan, and then coat the bottom of the pan with fresh oil. Add in the pureed vegetables, and cook for about 5-7 minutes, or until browned. Scrape the bottom of the pan with a spatula occasionally while vegetables cook. Add the tomato paste and cook until browned (about 4-5 minutes). Pour in the wine, scrape the bottom of the pan, and lower the heat. Cook under low heat until the liquid reduces by half. Place the short ribs in the pan and add 2 cups of water. The water should almost completely cover the meat. Add the thyme and bay leaves, cover the pan, and cook in the preheated oven for 3 hours. Check on the meat periodically, adding more water if necessary. Turn the ribs over halfway through. Remove the lid and allow the meat to cook uncovered for the last 20 minutes. This will allow the meat to brown and the sauce to reduce. Remove pot from the oven and serve immediately. Pour the braising liquid over the meat for added flavor and moisture. Garnish with parsley if desired, and pair with a glass of rich red wine if you are old enough. Barbecued Short Ribs Preheat the oven to 300 degrees F (149 degrees C). Season the ribs with salt and pepper and arrange them on a large baking sheet. Combine the sugar, paprika, garlic powder, vinegar, ketchup, mustard, Worcestershire sauce, and thyme in a small bowl. Stir the mixture together and then toss with the ribs, making sure that each piece is evenly coated. Cover the ribs with aluminum foil and roast for about 3 hours. Meat should be tender and fully cooked through. Remove the foil and allow meat to cook uncovered for the last 30 minutes. This will allow the tops to brown. Serve immediately. Consider serving with ranch dressing, ketchup, or other dipping sauce.",
    "sentences": [
        " Short Ribs with Carrots and Celery Preheat the oven to 400 degrees F (204 degrees C).",
        "Place the short ribs on a baking sheet, season with salt and pepper, and roast in the oven for 15 minutes.",
        "Remove the ribs from the oven, and then reduce oven temperature to 300 degrees F (149 degrees C).",
        "Heat olive oil in a large dutch oven.",
        "Add the onion, celery, fennel, leek, and carrots, and cook over medium-low heat for about 20 minutes, stirring occasionally.",
        "Add in the garlic and continue cooking the vegetables for 2 minutes.",
        "Pour the wine into the pot, bring the mixture to a boil, and cook under high heat for about 10 minutes.",
        "Liquid should be reduced by half.",
        "Place the roasted ribs into the pot along with rosemary, thyme, salt, and pepper.",
        "Add the beef stock and brown sugar, and bring to a simmer over high heat.",
        "Tie the rosemary and thyme together with kitchen string so that they can be easily removed later.",
        "Cover the pot and bake in the oven for 2 hours, or until meat is tender.",
        "Remove the ribs from the pot and set them aside.",
        "Remove the herbs and cook the vegetables over medium heat for 20 minutes.",
        "Place the ribs back into the pot and heat through.",
        "Serve the ribs with vegetables and sauce.",
        "If you are old enough, enjoy this meal with a glass of Cabernet Sauvignon or other red wine.",
        "Braised Short Ribs Season each short rib with salt and pepper.",
        "Coat a large pot with olive oil and place over high heat.",
        "Add the short ribs and cook for 2-3 minutes on each side, or until the meat is browned.",
        "Preheat the oven to 375 degrees F (190 degrees C).",
        "Place the vegetables and garlic in a food processor and puree until the mixture forms a thick paste.",
        "Remove the ribs from the pan and set aside.",
        "Drain the fat from the pan, and then coat the bottom of the pan with fresh oil.",
        "Add in the pureed vegetables, and cook for about 5-7 minutes, or until browned.",
        "Scrape the bottom of the pan with a spatula occasionally while vegetables cook.",
        "Add the tomato paste and cook until browned (about 4-5 minutes).",
        "Pour in the wine, scrape the bottom of the pan, and lower the heat.",
        "Cook under low heat until the liquid reduces by half.",
        "Place the short ribs in the pan and add 2 cups of water.",
        "The water should almost completely cover the meat.",
        "Add the thyme and bay leaves, cover the pan, and cook in the preheated oven for 3 hours.",
        "Check on the meat periodically, adding more water if necessary.",
        "Turn the ribs over halfway through.",
        "Remove the lid and allow the meat to cook uncovered for the last 20 minutes.",
        "This will allow the meat to brown and the sauce to reduce.",
        "Remove pot from the oven and serve immediately.",
        "Pour the braising liquid over the meat for added flavor and moisture.",
        "Garnish with parsley if desired, and pair with a glass of rich red wine if you are old enough.",
        "Barbecued Short Ribs Preheat the oven to 300 degrees F (149 degrees C).",
        "Season the ribs with salt and pepper and arrange them on a large baking sheet.",
        "Combine the sugar, paprika, garlic powder, vinegar, ketchup, mustard, Worcestershire sauce, and thyme in a small bowl.",
        "Stir the mixture together and then toss with the ribs, making sure that each piece is evenly coated.",
        "Cover the ribs with aluminum foil and roast for about 3 hours.",
        "Meat should be tender and fully cooked through.",
        "Remove the foil and allow meat to cook uncovered for the last 30 minutes.",
        "This will allow the tops to brown.",
        "Serve immediately.",
        "Consider serving with ranch dressing, ketchup, or other dipping sauce."
    ]
}