{
    "title": "How to Make Shrimp Alfredo",
    "url": "https://www.wikihow.com/Make-Shrimp-Alfredo",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fish and Seafood",
        "Prawns and Shrimp"
    ],
    "parts": [
        {
            "name": "De-vein the Shrimp[1]\n\tX\n\t\tResearch source",
            "steps": [
                {
                    "headline": "Keep the shrimp on ice.",
                    "description": "As you peel and de-vein the shrimp, you should keep them in a bowl of ice or ice water. Prior to being cooked, shrimp must be kept cold to reduce the risk of food-borne illness."
                },
                {
                    "headline": "Pull off the head and legs.",
                    "description": "These elements can be plucked off with your fingers. A knife should not be necessary. Note that some shrimp is sold without the head and legs attached. This is often the case with packaged shrimp, but shrimp sold fresh are more likely to come with the head and legs attached."
                },
                {
                    "headline": "Pull off the shell.",
                    "description": "Grasp the outer shell or skin with your fingers at the head end. Peel it all the way back to the tail end and rip or slice it off. The shell should be easy to distinguish from the meat of the shrimp at the head end once the head has been removed. The tail tip and last segment of the shell can be left on the shrimp for decorative purposes, but the they can also be removed. You should be able to pluck both off with your fingers, if desired. Otherwise, you can rip the shell off before the last segment with your fingers or cut it off with a knife. Place the shells in a resealable plastic bag. Close the bag and discard the shells or freeze them to make shellfish stock later."
                },
                {
                    "headline": "Cut open the back of the shrimp.",
                    "description": "Make a 1/4-inch (6.35-mm) incision along the back of the shrimp. Use a small, smooth paring knife to avoid cutting away too much of the shrimp and to create a smooth line. Cut from the head end to as close to the tail end as possible."
                },
                {
                    "headline": "Remove the vein from the newly exposed line lying under the surface of the back.",
                    "description": "You may need to use your paring knife to dig it out, but the vein can often be removed with your fingers. If you can't see a vein after cutting down the back, you do not need to worry about removing one. (Often on small shrimp.)"
                }
            ]
        },
        {
            "name": "Prepare the Alfredo Sauce",
            "steps": [
                {
                    "headline": "Mix the cornstarch and milk in a small bowl.",
                    "description": "Stir them together with a fork or spoon until smooth and set aside. The cornstarch may become clumpy as it sits, so you will need to stir the two together periodically as you prepare the rest of the sauce."
                },
                {
                    "headline": "Heat the butter in a saucepan.",
                    "description": "In a large saucepan over medium-high heat, heat the butter until it melts. You could also use a large, heavy frying pan with tall sides. Since all of the ingredients will eventually be piled into this pan, however, you need to make sure that it is large enough to accommodate the entire dish."
                },
                {
                    "headline": "Cook the garlic.",
                    "description": "Add the garlic to melted butter and cook on medium-high heat for 5 minutes, or until the garlic becomes fragrant and soft. Stir the garlic continually to prevent it burning. Instead of 3 cloves of garlic, you could also use 3 tsp (15 ml) of fresh bottled minced garlic, 1.5 tsp (7.5 ml) dried minced garlic, or 0.5 tsp (2.5 ml) garlic powder. If using dried minced garlic or garlic powder, however, you do not need to cook it first. Instead, add the garlic when adding the salt and pepper."
                },
                {
                    "headline": "Cook the shrimp.",
                    "description": "Add the shrimp to the hot pan and cook,stirring occasionally, until it turns pink. This should take about 1 to 2 minutes. Make sure to drain any ice water the shrimp might be sitting in prior to adding it to the pan."
                },
                {
                    "headline": "Add the half-and-half, salt, pepper, and Parmesan.",
                    "description": "Pour the half-and-half into the pan. Sprinkle with salt and pepper before gradually adding the Parmesan cheese. Sprinkle the cheese in 1 Tbsp (15 ml) at a time, stirring after each addition to incorporate it thoroughly."
                },
                {
                    "headline": "Mix in the milk and let thicken.",
                    "description": "Add the milk and cornstarch mix to the pan. Reduce the heat once you see bubbles forming, and stir until thickened. The sauce will take at least 2 minutes to thicken after it begins to bubble, if not longer. Give the milk and cornstarch a final stir before adding it to the rest of the sauce. This will re-combine the two ingredients if they separated while sitting. Set the sauce aside and keep warm."
                }
            ]
        },
        {
            "name": "Finishing the Dish",
            "steps": [
                {
                    "headline": "Boil two pots of water.",
                    "description": "You will need one large pot filled halfway with water for the pasta and a medium saucepan filled with 1 inch (2.5 cm) of water for the broccoli. If desired, you may lightly salt both pots of water as they come to a boil. Salt can help draw out the flavors of the pasta and broccoli."
                },
                {
                    "headline": "Cook and drain the pasta.",
                    "description": "Add the pasta to large pot of boiling water and cook 8 to 10 minutes. Drain the water. The pasta should be al dente when done. If the package directions for you pasta vary from this, follow the package directions."
                },
                {
                    "headline": "Cook and drain the broccoli.",
                    "description": "Add the broccoli to the other saucepan of water. Bring to a boil before reducing the heat to medium-low. Let simmer, covered, for 6 to 8 minutes. The broccoli should be tender enough to stick a fork through when done. Drain when completed. If the cooking directions on your bag of broccoli varies from these instructions, follow the package directions."
                },
                {
                    "headline": "Stir the pasta and broccoli into the sauce.",
                    "description": "Add the drained pasta and drained broccoli to the pot of shrimp alfredo sauce. Heat the whole thing over medium heat for a few minutes to warm everything up. Stir the ingredients as you heat them so that they are evenly distributed and evenly heated. Turn the heat down if you see the sauce start to bubble."
                },
                {
                    "headline": "Top with parsley, if desired.",
                    "description": "Transfer the hot shrimp alfredo to individual serving plates. If desired, you could also top the dish with extra Parmesan cheese or black pepper."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Bowl of ice",
        "Small paring knife",
        "Resealable plastic bag",
        "Small bowl",
        "Spoon or fork",
        "Two large saucepans",
        "Medium saucepan",
        "Wooden spoon",
        "Colander",
        "Serving dishes"
    ],
    "text": " De-vein the Shrimp[1]\n\tX\n\t\tResearch source Keep the shrimp on ice. As you peel and de-vein the shrimp, you should keep them in a bowl of ice or ice water. Prior to being cooked, shrimp must be kept cold to reduce the risk of food-borne illness. Pull off the head and legs. These elements can be plucked off with your fingers. A knife should not be necessary. Note that some shrimp is sold without the head and legs attached. This is often the case with packaged shrimp, but shrimp sold fresh are more likely to come with the head and legs attached. Pull off the shell. Grasp the outer shell or skin with your fingers at the head end. Peel it all the way back to the tail end and rip or slice it off. The shell should be easy to distinguish from the meat of the shrimp at the head end once the head has been removed. The tail tip and last segment of the shell can be left on the shrimp for decorative purposes, but the they can also be removed. You should be able to pluck both off with your fingers, if desired. Otherwise, you can rip the shell off before the last segment with your fingers or cut it off with a knife. Place the shells in a resealable plastic bag. Close the bag and discard the shells or freeze them to make shellfish stock later. Cut open the back of the shrimp. Make a 1/4-inch (6.35-mm) incision along the back of the shrimp. Use a small, smooth paring knife to avoid cutting away too much of the shrimp and to create a smooth line. Cut from the head end to as close to the tail end as possible. Remove the vein from the newly exposed line lying under the surface of the back. You may need to use your paring knife to dig it out, but the vein can often be removed with your fingers. If you can't see a vein after cutting down the back, you do not need to worry about removing one. (Often on small shrimp.) Prepare the Alfredo Sauce Mix the cornstarch and milk in a small bowl. Stir them together with a fork or spoon until smooth and set aside. The cornstarch may become clumpy as it sits, so you will need to stir the two together periodically as you prepare the rest of the sauce. Heat the butter in a saucepan. In a large saucepan over medium-high heat, heat the butter until it melts. You could also use a large, heavy frying pan with tall sides. Since all of the ingredients will eventually be piled into this pan, however, you need to make sure that it is large enough to accommodate the entire dish. Cook the garlic. Add the garlic to melted butter and cook on medium-high heat for 5 minutes, or until the garlic becomes fragrant and soft. Stir the garlic continually to prevent it burning. Instead of 3 cloves of garlic, you could also use 3 tsp (15 ml) of fresh bottled minced garlic, 1.5 tsp (7.5 ml) dried minced garlic, or 0.5 tsp (2.5 ml) garlic powder. If using dried minced garlic or garlic powder, however, you do not need to cook it first. Instead, add the garlic when adding the salt and pepper. Cook the shrimp. Add the shrimp to the hot pan and cook,stirring occasionally, until it turns pink. This should take about 1 to 2 minutes. Make sure to drain any ice water the shrimp might be sitting in prior to adding it to the pan. Add the half-and-half, salt, pepper, and Parmesan. Pour the half-and-half into the pan. Sprinkle with salt and pepper before gradually adding the Parmesan cheese. Sprinkle the cheese in 1 Tbsp (15 ml) at a time, stirring after each addition to incorporate it thoroughly. Mix in the milk and let thicken. Add the milk and cornstarch mix to the pan. Reduce the heat once you see bubbles forming, and stir until thickened. The sauce will take at least 2 minutes to thicken after it begins to bubble, if not longer. Give the milk and cornstarch a final stir before adding it to the rest of the sauce. This will re-combine the two ingredients if they separated while sitting. Set the sauce aside and keep warm. Finishing the Dish Boil two pots of water. You will need one large pot filled halfway with water for the pasta and a medium saucepan filled with 1 inch (2.5 cm) of water for the broccoli. If desired, you may lightly salt both pots of water as they come to a boil. Salt can help draw out the flavors of the pasta and broccoli. Cook and drain the pasta. Add the pasta to large pot of boiling water and cook 8 to 10 minutes. Drain the water. The pasta should be al dente when done. If the package directions for you pasta vary from this, follow the package directions. Cook and drain the broccoli. Add the broccoli to the other saucepan of water. Bring to a boil before reducing the heat to medium-low. Let simmer, covered, for 6 to 8 minutes. The broccoli should be tender enough to stick a fork through when done. Drain when completed. If the cooking directions on your bag of broccoli varies from these instructions, follow the package directions. Stir the pasta and broccoli into the sauce. Add the drained pasta and drained broccoli to the pot of shrimp alfredo sauce. Heat the whole thing over medium heat for a few minutes to warm everything up. Stir the ingredients as you heat them so that they are evenly distributed and evenly heated. Turn the heat down if you see the sauce start to bubble. Top with parsley, if desired. Transfer the hot shrimp alfredo to individual serving plates. If desired, you could also top the dish with extra Parmesan cheese or black pepper. Finished. ",
    "sentences": [
        " De-vein the Shrimp[1]\n\tX\n\t\tResearch source Keep the shrimp on ice.",
        "As you peel and de-vein the shrimp, you should keep them in a bowl of ice or ice water.",
        "Prior to being cooked, shrimp must be kept cold to reduce the risk of food-borne illness.",
        "Pull off the head and legs.",
        "These elements can be plucked off with your fingers.",
        "A knife should not be necessary.",
        "Note that some shrimp is sold without the head and legs attached.",
        "This is often the case with packaged shrimp, but shrimp sold fresh are more likely to come with the head and legs attached.",
        "Pull off the shell.",
        "Grasp the outer shell or skin with your fingers at the head end.",
        "Peel it all the way back to the tail end and rip or slice it off.",
        "The shell should be easy to distinguish from the meat of the shrimp at the head end once the head has been removed.",
        "The tail tip and last segment of the shell can be left on the shrimp for decorative purposes, but the they can also be removed.",
        "You should be able to pluck both off with your fingers, if desired.",
        "Otherwise, you can rip the shell off before the last segment with your fingers or cut it off with a knife.",
        "Place the shells in a resealable plastic bag.",
        "Close the bag and discard the shells or freeze them to make shellfish stock later.",
        "Cut open the back of the shrimp.",
        "Make a 1/4-inch (6.35-mm) incision along the back of the shrimp.",
        "Use a small, smooth paring knife to avoid cutting away too much of the shrimp and to create a smooth line.",
        "Cut from the head end to as close to the tail end as possible.",
        "Remove the vein from the newly exposed line lying under the surface of the back.",
        "You may need to use your paring knife to dig it out, but the vein can often be removed with your fingers.",
        "If you can't see a vein after cutting down the back, you do not need to worry about removing one.",
        "(Often on small shrimp.)",
        "Prepare the Alfredo Sauce Mix the cornstarch and milk in a small bowl.",
        "Stir them together with a fork or spoon until smooth and set aside.",
        "The cornstarch may become clumpy as it sits, so you will need to stir the two together periodically as you prepare the rest of the sauce.",
        "Heat the butter in a saucepan.",
        "In a large saucepan over medium-high heat, heat the butter until it melts.",
        "You could also use a large, heavy frying pan with tall sides.",
        "Since all of the ingredients will eventually be piled into this pan, however, you need to make sure that it is large enough to accommodate the entire dish.",
        "Cook the garlic.",
        "Add the garlic to melted butter and cook on medium-high heat for 5 minutes, or until the garlic becomes fragrant and soft.",
        "Stir the garlic continually to prevent it burning.",
        "Instead of 3 cloves of garlic, you could also use 3 tsp (15 ml) of fresh bottled minced garlic, 1.5 tsp (7.5 ml) dried minced garlic, or 0.5 tsp (2.5 ml) garlic powder.",
        "If using dried minced garlic or garlic powder, however, you do not need to cook it first.",
        "Instead, add the garlic when adding the salt and pepper.",
        "Cook the shrimp.",
        "Add the shrimp to the hot pan and cook,stirring occasionally, until it turns pink.",
        "This should take about 1 to 2 minutes.",
        "Make sure to drain any ice water the shrimp might be sitting in prior to adding it to the pan.",
        "Add the half-and-half, salt, pepper, and Parmesan.",
        "Pour the half-and-half into the pan.",
        "Sprinkle with salt and pepper before gradually adding the Parmesan cheese.",
        "Sprinkle the cheese in 1 Tbsp (15 ml) at a time, stirring after each addition to incorporate it thoroughly.",
        "Mix in the milk and let thicken.",
        "Add the milk and cornstarch mix to the pan.",
        "Reduce the heat once you see bubbles forming, and stir until thickened.",
        "The sauce will take at least 2 minutes to thicken after it begins to bubble, if not longer.",
        "Give the milk and cornstarch a final stir before adding it to the rest of the sauce.",
        "This will re-combine the two ingredients if they separated while sitting.",
        "Set the sauce aside and keep warm.",
        "Finishing the Dish Boil two pots of water.",
        "You will need one large pot filled halfway with water for the pasta and a medium saucepan filled with 1 inch (2.5 cm) of water for the broccoli.",
        "If desired, you may lightly salt both pots of water as they come to a boil.",
        "Salt can help draw out the flavors of the pasta and broccoli.",
        "Cook and drain the pasta.",
        "Add the pasta to large pot of boiling water and cook 8 to 10 minutes.",
        "Drain the water.",
        "The pasta should be al dente when done.",
        "If the package directions for you pasta vary from this, follow the package directions.",
        "Cook and drain the broccoli.",
        "Add the broccoli to the other saucepan of water.",
        "Bring to a boil before reducing the heat to medium-low.",
        "Let simmer, covered, for 6 to 8 minutes.",
        "The broccoli should be tender enough to stick a fork through when done.",
        "Drain when completed.",
        "If the cooking directions on your bag of broccoli varies from these instructions, follow the package directions.",
        "Stir the pasta and broccoli into the sauce.",
        "Add the drained pasta and drained broccoli to the pot of shrimp alfredo sauce.",
        "Heat the whole thing over medium heat for a few minutes to warm everything up.",
        "Stir the ingredients as you heat them so that they are evenly distributed and evenly heated.",
        "Turn the heat down if you see the sauce start to bubble.",
        "Top with parsley, if desired.",
        "Transfer the hot shrimp alfredo to individual serving plates.",
        "If desired, you could also top the dish with extra Parmesan cheese or black pepper.",
        "Finished."
    ]
}