{
    "title": "How to Steam Broccoli Without a Steamer",
    "url": "https://www.wikihow.com/Steam-Broccoli-Without-a-Steamer",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills",
        "Steaming Food"
    ],
    "methods": [
        {
            "name": "Using the Microwave",
            "steps": [
                {
                    "headline": "Clean the broccoli and cut it into bite-size pieces.",
                    "description": "Rinse the broccoli under running water and check the crowns for any hidden insects. Dry the head of broccoli with paper towels, then use a sharp kitchen knife to cut the florets into bite size pieces. Trim the stalks into 0.125 in (3.2 mm) thick discs, then cut the discs in half if they’re bigger than bite size. Even if you don’t plan to eat the stalks, cut them up so you can place them in the bottom of the bowl. This will keep the tender florets from boiling in the water in the bottom of the bowl. An average head of broccoli is roughly 1 lb (450 g) in weight."
                },
                {
                    "headline": "Put the broccoli in a microwave-safe bowl and add water.",
                    "description": "For instance, choose a large glass or ceramic bowl, or a smaller casserole dish. Add 2.5 Tbsp (37.5 ml) of water for 1 lb (450 g) of broccoli. The broccoli does not need to be in a single layer, since the steam will rise through all the broccoli in the covered bowl."
                },
                {
                    "headline": "Cover the bowl tightly to trap in the steam.",
                    "description": "If your microwave-safe bowl has a lid, secure it on snugly so that most of the steam cannot escape. If you do not have a lid for your dish, use microwave-safe plastic wrap instead. Alternatively, if you prefer not to use plastic wrap, place a microwave-safe plate over the top of the bowl. Make sure it makes a snug seal over the rim of the bowl."
                },
                {
                    "headline": "Microwave on high for 2.5 minutes, then check the broccoli every 30 seconds.",
                    "description": "After 2.5 minutes of cooking, carefully remove the hot bowl from the microwave and very carefully remove the lid or covering. If the broccoli is bright green in color and you can easily pierce it with a fork, it’s done. Otherwise, re-cover it and cook it for another 30 seconds. It may take up to 4 minutes in total to steam the broccoli to perfection. Keep checking every 30 seconds after the first 2.5 minutes, since broccoli can go from bright green and perfectly steamed to drab green and overcooked quickly! Always be cautious when uncovering a bowl of steaming veggies. The hot steam will escape quickly, and it could burn you if you are not careful. Open the bowl away from you to avoid exposing yourself to the steam."
                },
                {
                    "headline": "Season the broccoli as desired and serve it immediately.",
                    "description": "When the broccoli is steamed just right, add any desired seasonings—for instance, stir in 2 Tbsp (30 g) of butter and sprinkle on a pinch of salt. You can serve the broccoli directly from the microwave bowl, or transfer it to a serving dish. Try stirring in a splash or two of soy sauce to give the finished broccoli an enhanced flavor profile."
                }
            ]
        },
        {
            "name": "Steaming in a Skillet",
            "steps": [
                {
                    "headline": "Wash, dry, and chop up a 1 lb (450 g) head of broccoli.",
                    "description": "Rinse the broccoli head under the faucet and pat it dry with paper towels. Use a sharp kitchen knife to separate the florets from the stalks, cutting them into bite size pieces. “Bite size” means the florets should be cut into about 1 in (2.5 cm) pieces. Cut the thicker stalks in half crosswise, and chop all the whole and halved stalks into slices that are roughly 0.125 in (3.2 mm) thick. Cut the stalks even if you don’t intend to eat them—putting them in the bottom of the saucepan will elevate the delicate florets above the boiling water. Take a quick look through the head of broccoli after washing it to make sure there aren’t any bugs hiding out!"
                },
                {
                    "headline": "Add 3  fl oz (89 ml) of water to a medium saucepan.",
                    "description": "The saucepan should be large enough to hold 2.5–3 US qt (2.4–2.8 L) of liquid. Though you won’t be adding nearly that amount of water, this size of saucepan will be plenty large enough for 1 lb (450 g) of chopped broccoli. 3  fl oz (89 ml) also equals 6 Tbsp. Adding more water than this small amount will only cause the broccoli to boil. You need just enough water to create steam. Choose a saucepan with a lid that fits snugly. If necessary, you can use a heat-resistant dinner plate as a lid."
                },
                {
                    "headline": "Add the broccoli to the saucepan once the water comes to a boil.",
                    "description": "Place the saucepan over high heat and wait for the water to come to a full boil. Since there’s such a small amount of water in the saucepan, this won’t be a long wait! Place the thicker, tougher stalk pieces in the saucepan first, then pile the tender florets on top. Be careful not to splash any of the boiling water onto your skin."
                },
                {
                    "headline": "Cover the saucepan and keep it over high heat for 3 minutes.",
                    "description": "Don’t lift the lid, shake the pan, or anything else. Just wait 3 minutes! It is crucial that you cover the saucepan securely in order to trap the steam inside. A snug-fitting lid that matches the saucepan is your best option."
                },
                {
                    "headline": "Reduce the heat to low and steam the broccoli for 3 more minutes.",
                    "description": "Do not remove the lid to check the broccoli—you need to keep the steam trapped inside. This trapped steam  will continue to cook the broccoli without overcooking it."
                },
                {
                    "headline": "Add butter or seasonings, if desired, and serve the broccoli immediately.",
                    "description": "After 6 minutes total steaming time, carefully lift off the lid. Stir the broccoli, and stir in 2 Tbsp (30 g) of butter if you wish. Consider sprinkling on a pinch or two of salt as well. Remove the lid so that it acts as a shield to deflect the steam away from your face. Otherwise, you may get burned. Once finished, the broccoli should be bright green and tender-crisp. Mushy, drab green broccoli has been cooked too long. You can serve the broccoli from the saucepan, or transfer it to a serving dish."
                }
            ]
        },
        {
            "name": "Using a Colander as a Steaming Basket",
            "steps": [
                {
                    "headline": "Rinse and cut up a head of broccoli.",
                    "description": "Run the head of broccoli under clean water, check for any insects hiding in the florets, and dry it with paper towels. Use a sharp kitchen knife to cut the florets into bite size pieces, and slice the stalks into 0.125 in (3.2 mm) discs. If the stalks are especially thick, cut the discs in half. Aim to make the florets roughly similar in size—about 1 in (2.5 cm)—so that they cook evenly. The stalk pieces take longer to cook and should be cut smaller than this. Use an average size head of broccoli, which should weigh about 1 lb (450 g). You can discard the stalks if you like, but they’re quite tasty and tender when steamed properly!"
                },
                {
                    "headline": "Pick out a stock pot, lid, and metal colander that suit your needs.",
                    "description": "You’ll need a metal colander that’s large enough to hold all the chopped broccoli. At the same time, it needs to be the right size to nestle into the stock pot and rest on its rim so it doesn’t touch the bottom of the pot. The lid should fit over the colander and create a fairly tight seal to keep the steam in. If the colander doesn’t nestle in just right, it will either touch the bottom of the pot (which will result in some of the broccoli boiling instead of steaming) or will stick up too far above the rim of the pot (which will let the steam escape). If you don’t have the right combination of stock pot, lid, and metal colander, you’re better off either using an alternate steaming method or buying a steamer basket that fits your stock pot."
                },
                {
                    "headline": "Add 1–2 in (2.5–5.1 cm) of water to the stock pot.",
                    "description": "2 in (5.1 cm) is preferable, but don’t add that much if it causes the bottom of the colander to be submerged when you nestle it in the stock pot. Make sure you have at least 1 in (2.5 cm) of water in the pot, however. You need at least 1 in (2.5 cm) of water to build up enough steam to cook the broccoli."
                },
                {
                    "headline": "Bring the water to a boil over high heat.",
                    "description": "Since there’s a small amount of water in the stock pot, it won’t take more than a few minutes to come to a boil. Place the cut broccoli in the colander while you wait, if you haven’t done so already."
                },
                {
                    "headline": "Put the colander of broccoli in the stock pot and add the lid.",
                    "description": "Wait until the water is at a full boil before doing this. Move on to the next step—reducing the heat—as soon as you put the lid on. Make sure the lid is on snugly so the steam can’t escape."
                },
                {
                    "headline": "Reduce the heat to medium-low and check the broccoli after 5 minutes.",
                    "description": "Tender florets may be done after 5 minutes, but plan for 6-7 minutes in most cases. Put the lid back on if the broccoli isn’t bright green and easy to pierce with a fork after 5 minutes, then check again 1 minute later. Repeat once more if necessary. Steamed broccoli can turn drab green, mushy, and unappetizing quickly, so check every minute after the first 5 minutes of steaming."
                },
                {
                    "headline": "Season your broccoli to taste and serve it right away.",
                    "description": "Remove the colander from the stock pot and pour the broccoli into a serving dish. If desired, stir in 2 Tbsp (30 g) of butter and a pinch or two of salt. Try adding lemon juice, balsamic vinegar, or toasted almond slivers to your steamed broccoli. Some people even like their steamed broccoli with mayonnaise on the side!"
                }
            ]
        }
    ],
    "tyn": [
        "Microwave Method",
        "Microwave-safe dish",
        "Lid, plastic wrap, or heavy plate",
        "Skillet Method",
        "2.5–3 US qt (2.4–2.8 L) saucepan with lid",
        "Metal Colander Method",
        "Stock pot with lid",
        "Metal colander"
    ],
    "text": " Using the Microwave Clean the broccoli and cut it into bite-size pieces. Rinse the broccoli under running water and check the crowns for any hidden insects. Dry the head of broccoli with paper towels, then use a sharp kitchen knife to cut the florets into bite size pieces. Trim the stalks into 0.125 in (3.2 mm) thick discs, then cut the discs in half if they’re bigger than bite size. Even if you don’t plan to eat the stalks, cut them up so you can place them in the bottom of the bowl. This will keep the tender florets from boiling in the water in the bottom of the bowl. An average head of broccoli is roughly 1 lb (450 g) in weight. Put the broccoli in a microwave-safe bowl and add water. For instance, choose a large glass or ceramic bowl, or a smaller casserole dish. Add 2.5 Tbsp (37.5 ml) of water for 1 lb (450 g) of broccoli. The broccoli does not need to be in a single layer, since the steam will rise through all the broccoli in the covered bowl. Cover the bowl tightly to trap in the steam. If your microwave-safe bowl has a lid, secure it on snugly so that most of the steam cannot escape. If you do not have a lid for your dish, use microwave-safe plastic wrap instead. Alternatively, if you prefer not to use plastic wrap, place a microwave-safe plate over the top of the bowl. Make sure it makes a snug seal over the rim of the bowl. Microwave on high for 2.5 minutes, then check the broccoli every 30 seconds. After 2.5 minutes of cooking, carefully remove the hot bowl from the microwave and very carefully remove the lid or covering. If the broccoli is bright green in color and you can easily pierce it with a fork, it’s done. Otherwise, re-cover it and cook it for another 30 seconds. It may take up to 4 minutes in total to steam the broccoli to perfection. Keep checking every 30 seconds after the first 2.5 minutes, since broccoli can go from bright green and perfectly steamed to drab green and overcooked quickly! Always be cautious when uncovering a bowl of steaming veggies. The hot steam will escape quickly, and it could burn you if you are not careful. Open the bowl away from you to avoid exposing yourself to the steam. Season the broccoli as desired and serve it immediately. When the broccoli is steamed just right, add any desired seasonings—for instance, stir in 2 Tbsp (30 g) of butter and sprinkle on a pinch of salt. You can serve the broccoli directly from the microwave bowl, or transfer it to a serving dish. Try stirring in a splash or two of soy sauce to give the finished broccoli an enhanced flavor profile. Steaming in a Skillet Wash, dry, and chop up a 1 lb (450 g) head of broccoli. Rinse the broccoli head under the faucet and pat it dry with paper towels. Use a sharp kitchen knife to separate the florets from the stalks, cutting them into bite size pieces. “Bite size” means the florets should be cut into about 1 in (2.5 cm) pieces. Cut the thicker stalks in half crosswise, and chop all the whole and halved stalks into slices that are roughly 0.125 in (3.2 mm) thick. Cut the stalks even if you don’t intend to eat them—putting them in the bottom of the saucepan will elevate the delicate florets above the boiling water. Take a quick look through the head of broccoli after washing it to make sure there aren’t any bugs hiding out! Add 3  fl oz (89 ml) of water to a medium saucepan. The saucepan should be large enough to hold 2.5–3 US qt (2.4–2.8 L) of liquid. Though you won’t be adding nearly that amount of water, this size of saucepan will be plenty large enough for 1 lb (450 g) of chopped broccoli. 3  fl oz (89 ml) also equals 6 Tbsp. Adding more water than this small amount will only cause the broccoli to boil. You need just enough water to create steam. Choose a saucepan with a lid that fits snugly. If necessary, you can use a heat-resistant dinner plate as a lid. Add the broccoli to the saucepan once the water comes to a boil. Place the saucepan over high heat and wait for the water to come to a full boil. Since there’s such a small amount of water in the saucepan, this won’t be a long wait! Place the thicker, tougher stalk pieces in the saucepan first, then pile the tender florets on top. Be careful not to splash any of the boiling water onto your skin. Cover the saucepan and keep it over high heat for 3 minutes. Don’t lift the lid, shake the pan, or anything else. Just wait 3 minutes! It is crucial that you cover the saucepan securely in order to trap the steam inside. A snug-fitting lid that matches the saucepan is your best option. Reduce the heat to low and steam the broccoli for 3 more minutes. Do not remove the lid to check the broccoli—you need to keep the steam trapped inside. This trapped steam  will continue to cook the broccoli without overcooking it. Add butter or seasonings, if desired, and serve the broccoli immediately. After 6 minutes total steaming time, carefully lift off the lid. Stir the broccoli, and stir in 2 Tbsp (30 g) of butter if you wish. Consider sprinkling on a pinch or two of salt as well. Remove the lid so that it acts as a shield to deflect the steam away from your face. Otherwise, you may get burned. Once finished, the broccoli should be bright green and tender-crisp. Mushy, drab green broccoli has been cooked too long. You can serve the broccoli from the saucepan, or transfer it to a serving dish. Using a Colander as a Steaming Basket Rinse and cut up a head of broccoli. Run the head of broccoli under clean water, check for any insects hiding in the florets, and dry it with paper towels. Use a sharp kitchen knife to cut the florets into bite size pieces, and slice the stalks into 0.125 in (3.2 mm) discs. If the stalks are especially thick, cut the discs in half. Aim to make the florets roughly similar in size—about 1 in (2.5 cm)—so that they cook evenly. The stalk pieces take longer to cook and should be cut smaller than this. Use an average size head of broccoli, which should weigh about 1 lb (450 g). You can discard the stalks if you like, but they’re quite tasty and tender when steamed properly! Pick out a stock pot, lid, and metal colander that suit your needs. You’ll need a metal colander that’s large enough to hold all the chopped broccoli. At the same time, it needs to be the right size to nestle into the stock pot and rest on its rim so it doesn’t touch the bottom of the pot. The lid should fit over the colander and create a fairly tight seal to keep the steam in. If the colander doesn’t nestle in just right, it will either touch the bottom of the pot (which will result in some of the broccoli boiling instead of steaming) or will stick up too far above the rim of the pot (which will let the steam escape). If you don’t have the right combination of stock pot, lid, and metal colander, you’re better off either using an alternate steaming method or buying a steamer basket that fits your stock pot. Add 1–2 in (2.5–5.1 cm) of water to the stock pot. 2 in (5.1 cm) is preferable, but don’t add that much if it causes the bottom of the colander to be submerged when you nestle it in the stock pot. Make sure you have at least 1 in (2.5 cm) of water in the pot, however. You need at least 1 in (2.5 cm) of water to build up enough steam to cook the broccoli. Bring the water to a boil over high heat. Since there’s a small amount of water in the stock pot, it won’t take more than a few minutes to come to a boil. Place the cut broccoli in the colander while you wait, if you haven’t done so already. Put the colander of broccoli in the stock pot and add the lid. Wait until the water is at a full boil before doing this. Move on to the next step—reducing the heat—as soon as you put the lid on. Make sure the lid is on snugly so the steam can’t escape. Reduce the heat to medium-low and check the broccoli after 5 minutes. Tender florets may be done after 5 minutes, but plan for 6-7 minutes in most cases. Put the lid back on if the broccoli isn’t bright green and easy to pierce with a fork after 5 minutes, then check again 1 minute later. Repeat once more if necessary. Steamed broccoli can turn drab green, mushy, and unappetizing quickly, so check every minute after the first 5 minutes of steaming. Season your broccoli to taste and serve it right away. Remove the colander from the stock pot and pour the broccoli into a serving dish. If desired, stir in 2 Tbsp (30 g) of butter and a pinch or two of salt. Try adding lemon juice, balsamic vinegar, or toasted almond slivers to your steamed broccoli. Some people even like their steamed broccoli with mayonnaise on the side!",
    "sentences": [
        " Using the Microwave Clean the broccoli and cut it into bite-size pieces.",
        "Rinse the broccoli under running water and check the crowns for any hidden insects.",
        "Dry the head of broccoli with paper towels, then use a sharp kitchen knife to cut the florets into bite size pieces.",
        "Trim the stalks into 0.125 in (3.2 mm) thick discs, then cut the discs in half if they’re bigger than bite size.",
        "Even if you don’t plan to eat the stalks, cut them up so you can place them in the bottom of the bowl.",
        "This will keep the tender florets from boiling in the water in the bottom of the bowl.",
        "An average head of broccoli is roughly 1 lb (450 g) in weight.",
        "Put the broccoli in a microwave-safe bowl and add water.",
        "For instance, choose a large glass or ceramic bowl, or a smaller casserole dish.",
        "Add 2.5 Tbsp (37.5 ml) of water for 1 lb (450 g) of broccoli.",
        "The broccoli does not need to be in a single layer, since the steam will rise through all the broccoli in the covered bowl.",
        "Cover the bowl tightly to trap in the steam.",
        "If your microwave-safe bowl has a lid, secure it on snugly so that most of the steam cannot escape.",
        "If you do not have a lid for your dish, use microwave-safe plastic wrap instead.",
        "Alternatively, if you prefer not to use plastic wrap, place a microwave-safe plate over the top of the bowl.",
        "Make sure it makes a snug seal over the rim of the bowl.",
        "Microwave on high for 2.5 minutes, then check the broccoli every 30 seconds.",
        "After 2.5 minutes of cooking, carefully remove the hot bowl from the microwave and very carefully remove the lid or covering.",
        "If the broccoli is bright green in color and you can easily pierce it with a fork, it’s done.",
        "Otherwise, re-cover it and cook it for another 30 seconds.",
        "It may take up to 4 minutes in total to steam the broccoli to perfection.",
        "Keep checking every 30 seconds after the first 2.5 minutes, since broccoli can go from bright green and perfectly steamed to drab green and overcooked quickly!",
        "Always be cautious when uncovering a bowl of steaming veggies.",
        "The hot steam will escape quickly, and it could burn you if you are not careful.",
        "Open the bowl away from you to avoid exposing yourself to the steam.",
        "Season the broccoli as desired and serve it immediately.",
        "When the broccoli is steamed just right, add any desired seasonings—for instance, stir in 2 Tbsp (30 g) of butter and sprinkle on a pinch of salt.",
        "You can serve the broccoli directly from the microwave bowl, or transfer it to a serving dish.",
        "Try stirring in a splash or two of soy sauce to give the finished broccoli an enhanced flavor profile.",
        "Steaming in a Skillet Wash, dry, and chop up a 1 lb (450 g) head of broccoli.",
        "Rinse the broccoli head under the faucet and pat it dry with paper towels.",
        "Use a sharp kitchen knife to separate the florets from the stalks, cutting them into bite size pieces.",
        "“Bite size” means the florets should be cut into about 1 in (2.5 cm) pieces.",
        "Cut the thicker stalks in half crosswise, and chop all the whole and halved stalks into slices that are roughly 0.125 in (3.2 mm) thick.",
        "Cut the stalks even if you don’t intend to eat them—putting them in the bottom of the saucepan will elevate the delicate florets above the boiling water.",
        "Take a quick look through the head of broccoli after washing it to make sure there aren’t any bugs hiding out!",
        "Add 3  fl oz (89 ml) of water to a medium saucepan.",
        "The saucepan should be large enough to hold 2.5–3 US qt (2.4–2.8 L) of liquid.",
        "Though you won’t be adding nearly that amount of water, this size of saucepan will be plenty large enough for 1 lb (450 g) of chopped broccoli.",
        "3  fl oz (89 ml) also equals 6 Tbsp.",
        "Adding more water than this small amount will only cause the broccoli to boil.",
        "You need just enough water to create steam.",
        "Choose a saucepan with a lid that fits snugly.",
        "If necessary, you can use a heat-resistant dinner plate as a lid.",
        "Add the broccoli to the saucepan once the water comes to a boil.",
        "Place the saucepan over high heat and wait for the water to come to a full boil.",
        "Since there’s such a small amount of water in the saucepan, this won’t be a long wait!",
        "Place the thicker, tougher stalk pieces in the saucepan first, then pile the tender florets on top.",
        "Be careful not to splash any of the boiling water onto your skin.",
        "Cover the saucepan and keep it over high heat for 3 minutes.",
        "Don’t lift the lid, shake the pan, or anything else.",
        "Just wait 3 minutes!",
        "It is crucial that you cover the saucepan securely in order to trap the steam inside.",
        "A snug-fitting lid that matches the saucepan is your best option.",
        "Reduce the heat to low and steam the broccoli for 3 more minutes.",
        "Do not remove the lid to check the broccoli—you need to keep the steam trapped inside.",
        "This trapped steam  will continue to cook the broccoli without overcooking it.",
        "Add butter or seasonings, if desired, and serve the broccoli immediately.",
        "After 6 minutes total steaming time, carefully lift off the lid.",
        "Stir the broccoli, and stir in 2 Tbsp (30 g) of butter if you wish.",
        "Consider sprinkling on a pinch or two of salt as well.",
        "Remove the lid so that it acts as a shield to deflect the steam away from your face.",
        "Otherwise, you may get burned.",
        "Once finished, the broccoli should be bright green and tender-crisp.",
        "Mushy, drab green broccoli has been cooked too long.",
        "You can serve the broccoli from the saucepan, or transfer it to a serving dish.",
        "Using a Colander as a Steaming Basket Rinse and cut up a head of broccoli.",
        "Run the head of broccoli under clean water, check for any insects hiding in the florets, and dry it with paper towels.",
        "Use a sharp kitchen knife to cut the florets into bite size pieces, and slice the stalks into 0.125 in (3.2 mm) discs.",
        "If the stalks are especially thick, cut the discs in half.",
        "Aim to make the florets roughly similar in size—about 1 in (2.5 cm)—so that they cook evenly.",
        "The stalk pieces take longer to cook and should be cut smaller than this.",
        "Use an average size head of broccoli, which should weigh about 1 lb (450 g).",
        "You can discard the stalks if you like, but they’re quite tasty and tender when steamed properly!",
        "Pick out a stock pot, lid, and metal colander that suit your needs.",
        "You’ll need a metal colander that’s large enough to hold all the chopped broccoli.",
        "At the same time, it needs to be the right size to nestle into the stock pot and rest on its rim so it doesn’t touch the bottom of the pot.",
        "The lid should fit over the colander and create a fairly tight seal to keep the steam in.",
        "If the colander doesn’t nestle in just right, it will either touch the bottom of the pot (which will result in some of the broccoli boiling instead of steaming) or will stick up too far above the rim of the pot (which will let the steam escape).",
        "If you don’t have the right combination of stock pot, lid, and metal colander, you’re better off either using an alternate steaming method or buying a steamer basket that fits your stock pot.",
        "Add 1–2 in (2.5–5.1 cm) of water to the stock pot.",
        "2 in (5.1 cm) is preferable, but don’t add that much if it causes the bottom of the colander to be submerged when you nestle it in the stock pot.",
        "Make sure you have at least 1 in (2.5 cm) of water in the pot, however.",
        "You need at least 1 in (2.5 cm) of water to build up enough steam to cook the broccoli.",
        "Bring the water to a boil over high heat.",
        "Since there’s a small amount of water in the stock pot, it won’t take more than a few minutes to come to a boil.",
        "Place the cut broccoli in the colander while you wait, if you haven’t done so already.",
        "Put the colander of broccoli in the stock pot and add the lid.",
        "Wait until the water is at a full boil before doing this.",
        "Move on to the next step—reducing the heat—as soon as you put the lid on.",
        "Make sure the lid is on snugly so the steam can’t escape.",
        "Reduce the heat to medium-low and check the broccoli after 5 minutes.",
        "Tender florets may be done after 5 minutes, but plan for 6-7 minutes in most cases.",
        "Put the lid back on if the broccoli isn’t bright green and easy to pierce with a fork after 5 minutes, then check again 1 minute later.",
        "Repeat once more if necessary.",
        "Steamed broccoli can turn drab green, mushy, and unappetizing quickly, so check every minute after the first 5 minutes of steaming.",
        "Season your broccoli to taste and serve it right away.",
        "Remove the colander from the stock pot and pour the broccoli into a serving dish.",
        "If desired, stir in 2 Tbsp (30 g) of butter and a pinch or two of salt.",
        "Try adding lemon juice, balsamic vinegar, or toasted almond slivers to your steamed broccoli.",
        "Some people even like their steamed broccoli with mayonnaise on the side!"
    ]
}