{
    "title": "How to Write a Check With Cents",
    "url": "https://www.wikihow.com/Write-a-Check-With-Cents",
    "category_hierarchy": [
        "Finance and Business",
        "Banks and Financial Institutions",
        "Checks and Checkbooks"
    ],
    "parts": [
        {
            "name": "Formatting the Dollar and Cent Amounts",
            "steps": [
                {
                    "headline": "Fill in the “amount” box with a numeric amount.",
                    "description": "The amount box is located on the right side of the check, below the “Date” line and to the right of the “Pay to the Order Of” line. It has a symbol to the left of it indicating the currency — $ or £, for example. In this box, write out the amount of the check you want to write using numbers. Separate the dollar amount and the cent amount with a decimal point — 47.50, for example."
                },
                {
                    "headline": "Include the decimal and cent amount even if the amount is in even dollars.",
                    "description": "You may write a check in which there are no cents to be paid — for example, 47 even dollars. In this, case, you still need to indicate that there are “zero” cents to be paid. You do this by continuing to include the decimal point, but following it with two zeros: 47.00"
                },
                {
                    "headline": "Fill in the textual amount.",
                    "description": "Underneath the “Pay to the Order Of” line, you will see a second line that has the currency written out at the end of it. In America, for example, this blank line ends with the word “dollars.” On this line, you will write out the amount to be paid in words, rather than numbers. The dollar amount is always written out as words, and the cent amount written as a fraction out of 100. This is because there are 100 cents in a dollar, so if the check amount includes 45 cents, it is 45/100 of a dollar. While this is the basic rule, there are a few different ways to format the actual content of the line. Written dollar amount + “and” + fractional cent amount: forty-seven and 50/100. Written dollar amount + “dollars and” + fractional cent amount: forty-seven dollars and 50/100. Some people choose to draw a straight horizontal line after the fractional cent amount to fill out the line: forty-seven dollars and 50/100 —————. This prevents other people from adding to or changing the amount you write."
                },
                {
                    "headline": "Hyphenate compound numbers.",
                    "description": "Compound numbers do not fall evenly on decades (ten, twenty, thirty), centuries (one hundred, two hundred, etc.) and so on (one million, two billion, etc.) If you have a compound number like 47 (as opposed to 40), you should always place a hyphen between the two parts of the word when writing it out. Correct: forty-seven\nIncorrect: forty seven or fortyseven"
                },
                {
                    "headline": "Write out the textual amount even if it is very large.",
                    "description": "An amount for several hundred, thousand, or even million dollars should still be written out in words on the appropriate line. This might mean you have to write with very small script, so make sure you have enough room. Correct: two million, five hundred fifty-two thousand, eight hundred forty-seven dollars and 00/100 ——. Incorrect: 2,552,847 dollars and 00/100 ——————."
                }
            ]
        },
        {
            "name": "Filling out the Non-Monetary Fields",
            "steps": [
                {
                    "headline": "Write in the date.",
                    "description": "In the top right-hand corner of the check, you’ll see a short line that says the word “Date.” On this line, enter the appropriate abbreviation for the date on which you’re writing the check. In the United States, the abbreviation follows the order of month/date/year: January 11, 2015 is written as 1/11/15. However, in many other parts of the world, the month and date are switched to date/month/year: the same date would be written as 11/1/15. In some Eastern Asian countries, the date might be formatted as year/month/date: 2015/1/11. Note that using the wrong format can make a big difference — January to November. Be sure to use a format appropriate for the country in which you are banking."
                },
                {
                    "headline": "Post-date the check if necessary.",
                    "description": "For different reasons, you may not want the check to be cashed immediately. For example, you might need to write a check to a friend today for an amount larger than your available funds. In that case, you can “post-date” the check, meaning you enter a date in the future so that the check cannot be cashed until that date. This can be helpful if you need to wait until payday before a check amount can be withdrawn. Note that post-dating checks can be illegal if you manipulated the date with the intention of defrauding someone. However, if you post-date the check for legitimate reasons, the practice is perfectly legal."
                },
                {
                    "headline": "Fill in the “Pay to the Order Of” line.",
                    "description": "This line is right above the line where you filled in the textual amount of the check. Here, you will write the name of the person or company to whom you’re writing the check. Always use the full legal name of the person or company, as nicknames might cause problems when they try to deposit the check. For example, if your friend John Smith goes by the name “Buddy,” use the legal name rather than the nickname. To be safe, always ask who a check should be made out to. The person who will deposit the check will be able to give you the proper legal name."
                },
                {
                    "headline": "Include optional information on the “Memo” line.",
                    "description": "The Memo line is at the bottom left-hand side of the check, and it can be left empty unless you have specific information you’d like to share there. Often, people use this line to note the reason for the check: “Babysitting,” “Groceries,” or “Happy Birthday!” This will help you remember what the check was for if you need to account for it at a later date. However, you can also use the memo line to provide the person receiving the check with information they might need to file and process it. If you’re paying rent to a landlord with many renters, you might list your address in the memo to remind them which unit you rent. If you’re paying a utility bill, you can include your customer account number on the memo line. The memo line is optional, and can be left blank."
                },
                {
                    "headline": "Sign the check.",
                    "description": "The signature line is directly across from the memo line, at the bottom right-hand corner of the check. It’s very important that you provide your signature exactly as it looks on the signature card you provided the bank when you first opened your account. If you’ve changed your signature significantly since opening the account, you should let your bank know. Otherwise, the person trying to cash the check might run into problems cashing the check, or even be accused of trying to forge your signature. Never sign a blank check. If you lose it, anyone could pick it up, then fill in their name and a large amount of money. If the check has your signature on it, they could steal a lot of money from you!"
                }
            ]
        }
    ],
    "tyn": [
        "Check book",
        "Pen",
        "Payment information"
    ],
    "text": " Formatting the Dollar and Cent Amounts Fill in the “amount” box with a numeric amount. The amount box is located on the right side of the check, below the “Date” line and to the right of the “Pay to the Order Of” line. It has a symbol to the left of it indicating the currency — $ or £, for example. In this box, write out the amount of the check you want to write using numbers. Separate the dollar amount and the cent amount with a decimal point — 47.50, for example. Include the decimal and cent amount even if the amount is in even dollars. You may write a check in which there are no cents to be paid — for example, 47 even dollars. In this, case, you still need to indicate that there are “zero” cents to be paid. You do this by continuing to include the decimal point, but following it with two zeros: 47.00 Fill in the textual amount. Underneath the “Pay to the Order Of” line, you will see a second line that has the currency written out at the end of it. In America, for example, this blank line ends with the word “dollars.” On this line, you will write out the amount to be paid in words, rather than numbers. The dollar amount is always written out as words, and the cent amount written as a fraction out of 100. This is because there are 100 cents in a dollar, so if the check amount includes 45 cents, it is 45/100 of a dollar. While this is the basic rule, there are a few different ways to format the actual content of the line. Written dollar amount + “and” + fractional cent amount: forty-seven and 50/100. Written dollar amount + “dollars and” + fractional cent amount: forty-seven dollars and 50/100. Some people choose to draw a straight horizontal line after the fractional cent amount to fill out the line: forty-seven dollars and 50/100 —————. This prevents other people from adding to or changing the amount you write. Hyphenate compound numbers. Compound numbers do not fall evenly on decades (ten, twenty, thirty), centuries (one hundred, two hundred, etc.) and so on (one million, two billion, etc.) If you have a compound number like 47 (as opposed to 40), you should always place a hyphen between the two parts of the word when writing it out. Correct: forty-seven\nIncorrect: forty seven or fortyseven Write out the textual amount even if it is very large. An amount for several hundred, thousand, or even million dollars should still be written out in words on the appropriate line. This might mean you have to write with very small script, so make sure you have enough room. Correct: two million, five hundred fifty-two thousand, eight hundred forty-seven dollars and 00/100 ——. Incorrect: 2,552,847 dollars and 00/100 ——————. Filling out the Non-Monetary Fields Write in the date. In the top right-hand corner of the check, you’ll see a short line that says the word “Date.” On this line, enter the appropriate abbreviation for the date on which you’re writing the check. In the United States, the abbreviation follows the order of month/date/year: January 11, 2015 is written as 1/11/15. However, in many other parts of the world, the month and date are switched to date/month/year: the same date would be written as 11/1/15. In some Eastern Asian countries, the date might be formatted as year/month/date: 2015/1/11. Note that using the wrong format can make a big difference — January to November. Be sure to use a format appropriate for the country in which you are banking. Post-date the check if necessary. For different reasons, you may not want the check to be cashed immediately. For example, you might need to write a check to a friend today for an amount larger than your available funds. In that case, you can “post-date” the check, meaning you enter a date in the future so that the check cannot be cashed until that date. This can be helpful if you need to wait until payday before a check amount can be withdrawn. Note that post-dating checks can be illegal if you manipulated the date with the intention of defrauding someone. However, if you post-date the check for legitimate reasons, the practice is perfectly legal. Fill in the “Pay to the Order Of” line. This line is right above the line where you filled in the textual amount of the check. Here, you will write the name of the person or company to whom you’re writing the check. Always use the full legal name of the person or company, as nicknames might cause problems when they try to deposit the check. For example, if your friend John Smith goes by the name “Buddy,” use the legal name rather than the nickname. To be safe, always ask who a check should be made out to. The person who will deposit the check will be able to give you the proper legal name. Include optional information on the “Memo” line. The Memo line is at the bottom left-hand side of the check, and it can be left empty unless you have specific information you’d like to share there. Often, people use this line to note the reason for the check: “Babysitting,” “Groceries,” or “Happy Birthday!” This will help you remember what the check was for if you need to account for it at a later date. However, you can also use the memo line to provide the person receiving the check with information they might need to file and process it. If you’re paying rent to a landlord with many renters, you might list your address in the memo to remind them which unit you rent. If you’re paying a utility bill, you can include your customer account number on the memo line. The memo line is optional, and can be left blank. Sign the check. The signature line is directly across from the memo line, at the bottom right-hand corner of the check. It’s very important that you provide your signature exactly as it looks on the signature card you provided the bank when you first opened your account. If you’ve changed your signature significantly since opening the account, you should let your bank know. Otherwise, the person trying to cash the check might run into problems cashing the check, or even be accused of trying to forge your signature. Never sign a blank check. If you lose it, anyone could pick it up, then fill in their name and a large amount of money. If the check has your signature on it, they could steal a lot of money from you!",
    "sentences": [
        " Formatting the Dollar and Cent Amounts Fill in the “amount” box with a numeric amount.",
        "The amount box is located on the right side of the check, below the “Date” line and to the right of the “Pay to the Order Of” line.",
        "It has a symbol to the left of it indicating the currency — $ or £, for example.",
        "In this box, write out the amount of the check you want to write using numbers.",
        "Separate the dollar amount and the cent amount with a decimal point — 47.50, for example.",
        "Include the decimal and cent amount even if the amount is in even dollars.",
        "You may write a check in which there are no cents to be paid — for example, 47 even dollars.",
        "In this, case, you still need to indicate that there are “zero” cents to be paid.",
        "You do this by continuing to include the decimal point, but following it with two zeros: 47.00 Fill in the textual amount.",
        "Underneath the “Pay to the Order Of” line, you will see a second line that has the currency written out at the end of it.",
        "In America, for example, this blank line ends with the word “dollars.” On this line, you will write out the amount to be paid in words, rather than numbers.",
        "The dollar amount is always written out as words, and the cent amount written as a fraction out of 100.",
        "This is because there are 100 cents in a dollar, so if the check amount includes 45 cents, it is 45/100 of a dollar.",
        "While this is the basic rule, there are a few different ways to format the actual content of the line.",
        "Written dollar amount + “and” + fractional cent amount: forty-seven and 50/100.",
        "Written dollar amount + “dollars and” + fractional cent amount: forty-seven dollars and 50/100.",
        "Some people choose to draw a straight horizontal line after the fractional cent amount to fill out the line: forty-seven dollars and 50/100 —————.",
        "This prevents other people from adding to or changing the amount you write.",
        "Hyphenate compound numbers.",
        "Compound numbers do not fall evenly on decades (ten, twenty, thirty), centuries (one hundred, two hundred, etc.)",
        "and so on (one million, two billion, etc.)",
        "If you have a compound number like 47 (as opposed to 40), you should always place a hyphen between the two parts of the word when writing it out.",
        "Correct: forty-seven\nIncorrect: forty seven or fortyseven Write out the textual amount even if it is very large.",
        "An amount for several hundred, thousand, or even million dollars should still be written out in words on the appropriate line.",
        "This might mean you have to write with very small script, so make sure you have enough room.",
        "Correct: two million, five hundred fifty-two thousand, eight hundred forty-seven dollars and 00/100 ——.",
        "Incorrect: 2,552,847 dollars and 00/100 ——————.",
        "Filling out the Non-Monetary Fields Write in the date.",
        "In the top right-hand corner of the check, you’ll see a short line that says the word “Date.” On this line, enter the appropriate abbreviation for the date on which you’re writing the check.",
        "In the United States, the abbreviation follows the order of month/date/year: January 11, 2015 is written as 1/11/15.",
        "However, in many other parts of the world, the month and date are switched to date/month/year: the same date would be written as 11/1/15.",
        "In some Eastern Asian countries, the date might be formatted as year/month/date: 2015/1/11.",
        "Note that using the wrong format can make a big difference — January to November.",
        "Be sure to use a format appropriate for the country in which you are banking.",
        "Post-date the check if necessary.",
        "For different reasons, you may not want the check to be cashed immediately.",
        "For example, you might need to write a check to a friend today for an amount larger than your available funds.",
        "In that case, you can “post-date” the check, meaning you enter a date in the future so that the check cannot be cashed until that date.",
        "This can be helpful if you need to wait until payday before a check amount can be withdrawn.",
        "Note that post-dating checks can be illegal if you manipulated the date with the intention of defrauding someone.",
        "However, if you post-date the check for legitimate reasons, the practice is perfectly legal.",
        "Fill in the “Pay to the Order Of” line.",
        "This line is right above the line where you filled in the textual amount of the check.",
        "Here, you will write the name of the person or company to whom you’re writing the check.",
        "Always use the full legal name of the person or company, as nicknames might cause problems when they try to deposit the check.",
        "For example, if your friend John Smith goes by the name “Buddy,” use the legal name rather than the nickname.",
        "To be safe, always ask who a check should be made out to.",
        "The person who will deposit the check will be able to give you the proper legal name.",
        "Include optional information on the “Memo” line.",
        "The Memo line is at the bottom left-hand side of the check, and it can be left empty unless you have specific information you’d like to share there.",
        "Often, people use this line to note the reason for the check: “Babysitting,” “Groceries,” or “Happy Birthday!” This will help you remember what the check was for if you need to account for it at a later date.",
        "However, you can also use the memo line to provide the person receiving the check with information they might need to file and process it.",
        "If you’re paying rent to a landlord with many renters, you might list your address in the memo to remind them which unit you rent.",
        "If you’re paying a utility bill, you can include your customer account number on the memo line.",
        "The memo line is optional, and can be left blank.",
        "Sign the check.",
        "The signature line is directly across from the memo line, at the bottom right-hand corner of the check.",
        "It’s very important that you provide your signature exactly as it looks on the signature card you provided the bank when you first opened your account.",
        "If you’ve changed your signature significantly since opening the account, you should let your bank know.",
        "Otherwise, the person trying to cash the check might run into problems cashing the check, or even be accused of trying to forge your signature.",
        "Never sign a blank check.",
        "If you lose it, anyone could pick it up, then fill in their name and a large amount of money.",
        "If the check has your signature on it, they could steal a lot of money from you!"
    ]
}