{
    "title": "How to Make Breadcrumbs",
    "url": "https://www.wikihow.com/Make-Breadcrumbs",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills"
    ],
    "methods": [
        {
            "name": "Making Fresh Breadcrumbs",
            "steps": [
                {
                    "headline": "Tear the bread into pieces.",
                    "description": "Get out 4 slices of white bread. You can use bread that's a day or two stale or you can toast it a little in the oven or toaster. Take the bread and tear it into small pieces. Use your favorite kind of bread for the breadcrumbs. If you'd like white breadcrumbs, use white bread and trim off the crusts. For whole-wheat breadcrumbs, use a soft-whole wheat bread and leave the crusts on."
                },
                {
                    "headline": "Blitz the bread in a food processor.",
                    "description": "Place the pieces of bread into a food processor. Blitz the bread until you get coarse bread crumbs. Avoid processing the bread for too long or it may become gummy and clog up the processor. You can use the fresh breadcrumbs or store them in an airtight container. If you don't have a food processor, you can process the bread in a coffee or spice grinder. You can also freeze the slices of bread until they're hard and rub them against a grater to make fresh breadcrumbs."
                },
                {
                    "headline": "Use the fresh breadcrumbs.",
                    "description": "Fresh breadcrumbs absorb a lot of moisture, so they're great for baking. Consider using fresh breadcrumbs in recipes for meatballs, meatloaf, or seafood patties. You can also top casseroles or seafood with the fresh breadcrumbs. The breadcrumbs will become slightly crisp once the food bakes in the oven."
                }
            ]
        },
        {
            "name": "Making Dry Breadcrumbs From Fresh Breadcrumbs",
            "steps": [
                {
                    "headline": "Preheat the oven and spread the breadcrumbs on a sheet.",
                    "description": "Turn the oven on to 350 degrees F (180 degrees C). Get out a large, rimmed baking sheet and spread 2 cups (100 g) of fresh breadcrumbs on it."
                },
                {
                    "headline": "Bake the breadcrumbs for 3 to 5 minutes.",
                    "description": "Put the sheet in the preheated oven and bake the breadcrumbs until they become golden brown and dry. This should take about 3 to 5 minutes. Leave the breadcrumbs to cool completely before you use them. If your oven has a hot spot, you might want to stir the breadcrumbs halfway through the cooking time."
                },
                {
                    "headline": "Consider seasoning the breadcrumbs.",
                    "description": "You can add a little extra flavor to your toasted breadcrumbs. Just stir in 1 tablespoon (14 g) of extra-virgin olive oil and toss it with a seasoning like:\nLemon zest\nMinced fresh herbs\nCrushed red pepper flakes\nGrated Parmesan cheese\nDried herbs (like Italian seasoning)"
                },
                {
                    "headline": "Use the dry breadcrumbs.",
                    "description": "Dry breadcrumbs give a great crunch and texture to foods. Try sprinkling them over pasta, roasted vegetables, or thick soups. You can also coat foods with the breadcrumbs before you saute them for extra crispiness. Store leftover dry breadcrumbs in an airtight container at room temperature for up to 1 month."
                }
            ]
        },
        {
            "name": "Making Dry Breadcrumbs From Bread Slices",
            "steps": [
                {
                    "headline": "Preheat the oven and slice the bread.",
                    "description": "Turn the oven on to 250 degrees F (120 degrees C). Get out 1 loaf of bread and slice it into thick pieces. If you don't have a food processor, leave the bread in slices. If you do have one and want to process the bread, cut the slices into pieces."
                },
                {
                    "headline": "Arrange the bread on a baking sheet and bake it for 10 minutes.",
                    "description": "Lay the slices of bread in a single layer on a baking sheet or spread the pieces of bread evenly across the sheet. Put the bread in the preheated oven and bake it for 10 minutes. Let the bread cool completely before you process it. The bread should completely dry out. If the bread is really moist or it's humid out, add an extra couple of minutes to the baking time."
                },
                {
                    "headline": "Process or grate the breadcrumbs.",
                    "description": "If you have a food processor, place the pieces of toasted bread in it and blitz it until you've got fine breadcrumbs. Or you can hold a piece of the toasted bread and rub it against a grater to make the breadcrumbs. Continue doing this will all of the bread slices. You can also place the dried bread in a plastic bag and use a rolling pin to crush the bread into breadcrumbs."
                },
                {
                    "headline": "Cook with the dry breadcrumbs.",
                    "description": "For extra texture in your meals, scatter dry breadcrumbs over pasta, casseroles, grilled vegetables, or stews. Try sprinkling them over pasta, roasted vegetables, or thick soups. Store leftover dry breadcrumbs in an airtight container at room temperature for up to 1 month."
                }
            ]
        },
        {
            "name": "Making Skillet Toasted Breadcrumbs",
            "steps": [
                {
                    "headline": "Tear the bread into pieces.",
                    "description": "Get out a loaf of your favorite bread or rustic white bread. Cut off 1/4 of the loaf to use for the breadcrumbs. Tear or cut the bread so you get 2 cups (70 g) of cubed bread. You can remove the crust from the bread for completely white breadcrumbs. Use fresh or stale bread for the breadcrumbs."
                },
                {
                    "headline": "Process the bread to make fresh breadcrumbs.",
                    "description": "Transfer the cubes of bread to a food processor. Pulse the bread just until you have coarse breadcrumbs. If you process the bread for too long, it will become gummy and clog the food processor blade."
                },
                {
                    "headline": "Saute the breadcrumbs in oil.",
                    "description": "Pour 3 tablespoons (42 g) of olive oil into a skillet. Turn the heat on to medium-high and stir in the fresh breadcrumbs. Stir and cook the breadcrumbs for 5 minutes. They should become crisp and golden brown once they've finished toasting."
                },
                {
                    "headline": "Season and cool the breadcrumbs.",
                    "description": "Sprinkle kosher salt over the breadcrumbs according to your taste. Lay a paper towel on a plate and transfer the breadcrumbs to the paper towel to drain. Let the breadcrumbs cool completely before you use them. Store the toasted breadcrumbs in an airtight container at room temperature."
                }
            ]
        }
    ],
    "tyn": [
        "Cutting board and knife",
        "Grater",
        "Food processor",
        "Baking sheet",
        "Airtight storage container",
        "Paper towels",
        "Skillet",
        "Spoon"
    ],
    "text": " Making Fresh Breadcrumbs Tear the bread into pieces. Get out 4 slices of white bread. You can use bread that's a day or two stale or you can toast it a little in the oven or toaster. Take the bread and tear it into small pieces. Use your favorite kind of bread for the breadcrumbs. If you'd like white breadcrumbs, use white bread and trim off the crusts. For whole-wheat breadcrumbs, use a soft-whole wheat bread and leave the crusts on. Blitz the bread in a food processor. Place the pieces of bread into a food processor. Blitz the bread until you get coarse bread crumbs. Avoid processing the bread for too long or it may become gummy and clog up the processor. You can use the fresh breadcrumbs or store them in an airtight container. If you don't have a food processor, you can process the bread in a coffee or spice grinder. You can also freeze the slices of bread until they're hard and rub them against a grater to make fresh breadcrumbs. Use the fresh breadcrumbs. Fresh breadcrumbs absorb a lot of moisture, so they're great for baking. Consider using fresh breadcrumbs in recipes for meatballs, meatloaf, or seafood patties. You can also top casseroles or seafood with the fresh breadcrumbs. The breadcrumbs will become slightly crisp once the food bakes in the oven. Making Dry Breadcrumbs From Fresh Breadcrumbs Preheat the oven and spread the breadcrumbs on a sheet. Turn the oven on to 350 degrees F (180 degrees C). Get out a large, rimmed baking sheet and spread 2 cups (100 g) of fresh breadcrumbs on it. Bake the breadcrumbs for 3 to 5 minutes. Put the sheet in the preheated oven and bake the breadcrumbs until they become golden brown and dry. This should take about 3 to 5 minutes. Leave the breadcrumbs to cool completely before you use them. If your oven has a hot spot, you might want to stir the breadcrumbs halfway through the cooking time. Consider seasoning the breadcrumbs. You can add a little extra flavor to your toasted breadcrumbs. Just stir in 1 tablespoon (14 g) of extra-virgin olive oil and toss it with a seasoning like:\nLemon zest\nMinced fresh herbs\nCrushed red pepper flakes\nGrated Parmesan cheese\nDried herbs (like Italian seasoning) Use the dry breadcrumbs. Dry breadcrumbs give a great crunch and texture to foods. Try sprinkling them over pasta, roasted vegetables, or thick soups. You can also coat foods with the breadcrumbs before you saute them for extra crispiness. Store leftover dry breadcrumbs in an airtight container at room temperature for up to 1 month. Making Dry Breadcrumbs From Bread Slices Preheat the oven and slice the bread. Turn the oven on to 250 degrees F (120 degrees C). Get out 1 loaf of bread and slice it into thick pieces. If you don't have a food processor, leave the bread in slices. If you do have one and want to process the bread, cut the slices into pieces. Arrange the bread on a baking sheet and bake it for 10 minutes. Lay the slices of bread in a single layer on a baking sheet or spread the pieces of bread evenly across the sheet. Put the bread in the preheated oven and bake it for 10 minutes. Let the bread cool completely before you process it. The bread should completely dry out. If the bread is really moist or it's humid out, add an extra couple of minutes to the baking time. Process or grate the breadcrumbs. If you have a food processor, place the pieces of toasted bread in it and blitz it until you've got fine breadcrumbs. Or you can hold a piece of the toasted bread and rub it against a grater to make the breadcrumbs. Continue doing this will all of the bread slices. You can also place the dried bread in a plastic bag and use a rolling pin to crush the bread into breadcrumbs. Cook with the dry breadcrumbs. For extra texture in your meals, scatter dry breadcrumbs over pasta, casseroles, grilled vegetables, or stews. Try sprinkling them over pasta, roasted vegetables, or thick soups. Store leftover dry breadcrumbs in an airtight container at room temperature for up to 1 month. Making Skillet Toasted Breadcrumbs Tear the bread into pieces. Get out a loaf of your favorite bread or rustic white bread. Cut off 1/4 of the loaf to use for the breadcrumbs. Tear or cut the bread so you get 2 cups (70 g) of cubed bread. You can remove the crust from the bread for completely white breadcrumbs. Use fresh or stale bread for the breadcrumbs. Process the bread to make fresh breadcrumbs. Transfer the cubes of bread to a food processor. Pulse the bread just until you have coarse breadcrumbs. If you process the bread for too long, it will become gummy and clog the food processor blade. Saute the breadcrumbs in oil. Pour 3 tablespoons (42 g) of olive oil into a skillet. Turn the heat on to medium-high and stir in the fresh breadcrumbs. Stir and cook the breadcrumbs for 5 minutes. They should become crisp and golden brown once they've finished toasting. Season and cool the breadcrumbs. Sprinkle kosher salt over the breadcrumbs according to your taste. Lay a paper towel on a plate and transfer the breadcrumbs to the paper towel to drain. Let the breadcrumbs cool completely before you use them. Store the toasted breadcrumbs in an airtight container at room temperature.",
    "sentences": [
        " Making Fresh Breadcrumbs Tear the bread into pieces.",
        "Get out 4 slices of white bread.",
        "You can use bread that's a day or two stale or you can toast it a little in the oven or toaster.",
        "Take the bread and tear it into small pieces.",
        "Use your favorite kind of bread for the breadcrumbs.",
        "If you'd like white breadcrumbs, use white bread and trim off the crusts.",
        "For whole-wheat breadcrumbs, use a soft-whole wheat bread and leave the crusts on.",
        "Blitz the bread in a food processor.",
        "Place the pieces of bread into a food processor.",
        "Blitz the bread until you get coarse bread crumbs.",
        "Avoid processing the bread for too long or it may become gummy and clog up the processor.",
        "You can use the fresh breadcrumbs or store them in an airtight container.",
        "If you don't have a food processor, you can process the bread in a coffee or spice grinder.",
        "You can also freeze the slices of bread until they're hard and rub them against a grater to make fresh breadcrumbs.",
        "Use the fresh breadcrumbs.",
        "Fresh breadcrumbs absorb a lot of moisture, so they're great for baking.",
        "Consider using fresh breadcrumbs in recipes for meatballs, meatloaf, or seafood patties.",
        "You can also top casseroles or seafood with the fresh breadcrumbs.",
        "The breadcrumbs will become slightly crisp once the food bakes in the oven.",
        "Making Dry Breadcrumbs From Fresh Breadcrumbs Preheat the oven and spread the breadcrumbs on a sheet.",
        "Turn the oven on to 350 degrees F (180 degrees C).",
        "Get out a large, rimmed baking sheet and spread 2 cups (100 g) of fresh breadcrumbs on it.",
        "Bake the breadcrumbs for 3 to 5 minutes.",
        "Put the sheet in the preheated oven and bake the breadcrumbs until they become golden brown and dry.",
        "This should take about 3 to 5 minutes.",
        "Leave the breadcrumbs to cool completely before you use them.",
        "If your oven has a hot spot, you might want to stir the breadcrumbs halfway through the cooking time.",
        "Consider seasoning the breadcrumbs.",
        "You can add a little extra flavor to your toasted breadcrumbs.",
        "Just stir in 1 tablespoon (14 g) of extra-virgin olive oil and toss it with a seasoning like:\nLemon zest\nMinced fresh herbs\nCrushed red pepper flakes\nGrated Parmesan cheese\nDried herbs (like Italian seasoning) Use the dry breadcrumbs.",
        "Dry breadcrumbs give a great crunch and texture to foods.",
        "Try sprinkling them over pasta, roasted vegetables, or thick soups.",
        "You can also coat foods with the breadcrumbs before you saute them for extra crispiness.",
        "Store leftover dry breadcrumbs in an airtight container at room temperature for up to 1 month.",
        "Making Dry Breadcrumbs From Bread Slices Preheat the oven and slice the bread.",
        "Turn the oven on to 250 degrees F (120 degrees C).",
        "Get out 1 loaf of bread and slice it into thick pieces.",
        "If you don't have a food processor, leave the bread in slices.",
        "If you do have one and want to process the bread, cut the slices into pieces.",
        "Arrange the bread on a baking sheet and bake it for 10 minutes.",
        "Lay the slices of bread in a single layer on a baking sheet or spread the pieces of bread evenly across the sheet.",
        "Put the bread in the preheated oven and bake it for 10 minutes.",
        "Let the bread cool completely before you process it.",
        "The bread should completely dry out.",
        "If the bread is really moist or it's humid out, add an extra couple of minutes to the baking time.",
        "Process or grate the breadcrumbs.",
        "If you have a food processor, place the pieces of toasted bread in it and blitz it until you've got fine breadcrumbs.",
        "Or you can hold a piece of the toasted bread and rub it against a grater to make the breadcrumbs.",
        "Continue doing this will all of the bread slices.",
        "You can also place the dried bread in a plastic bag and use a rolling pin to crush the bread into breadcrumbs.",
        "Cook with the dry breadcrumbs.",
        "For extra texture in your meals, scatter dry breadcrumbs over pasta, casseroles, grilled vegetables, or stews.",
        "Try sprinkling them over pasta, roasted vegetables, or thick soups.",
        "Store leftover dry breadcrumbs in an airtight container at room temperature for up to 1 month.",
        "Making Skillet Toasted Breadcrumbs Tear the bread into pieces.",
        "Get out a loaf of your favorite bread or rustic white bread.",
        "Cut off 1/4 of the loaf to use for the breadcrumbs.",
        "Tear or cut the bread so you get 2 cups (70 g) of cubed bread.",
        "You can remove the crust from the bread for completely white breadcrumbs.",
        "Use fresh or stale bread for the breadcrumbs.",
        "Process the bread to make fresh breadcrumbs.",
        "Transfer the cubes of bread to a food processor.",
        "Pulse the bread just until you have coarse breadcrumbs.",
        "If you process the bread for too long, it will become gummy and clog the food processor blade.",
        "Saute the breadcrumbs in oil.",
        "Pour 3 tablespoons (42 g) of olive oil into a skillet.",
        "Turn the heat on to medium-high and stir in the fresh breadcrumbs.",
        "Stir and cook the breadcrumbs for 5 minutes.",
        "They should become crisp and golden brown once they've finished toasting.",
        "Season and cool the breadcrumbs.",
        "Sprinkle kosher salt over the breadcrumbs according to your taste.",
        "Lay a paper towel on a plate and transfer the breadcrumbs to the paper towel to drain.",
        "Let the breadcrumbs cool completely before you use them.",
        "Store the toasted breadcrumbs in an airtight container at room temperature."
    ]
}