{
    "title": "How to Plunge a Toilet",
    "url": "https://www.wikihow.com/Plunge-a-Toilet",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Home Repairs"
    ],
    "parts": [
        {
            "name": "Preventing Spills",
            "steps": [
                {
                    "headline": "Turn off the water to the toilet to prevent any overflow.",
                    "description": "Look for a metal or plastic valve on the wall behind your toilet that controls the water supply. Rotate the valve clockwise to shut off the water so the tank and bowl don’t fill up while you’re cleaning out the clog. Don’t flush the toilet while you’re working since there’s still water inside the tank. You don’t need to turn off the water to your toilet, but there’s more risk that the bowl will fill up."
                },
                {
                    "headline": "Push the flapper down inside the toilet tank to stop the bowl from filling.",
                    "description": "Take the lid off the back of your toilet and set it on top of a towel so it doesn’t damage your floors. Make sure the round rubber flapper at the bottom of the tank is completely sealed so water doesn’t drain from the tank into the bowl. If it’s still open, gently press it against the bottom of the tank to close it. The water in the toilet tank is clean, but you can wear rubber gloves if you don’t want to get your hands wet.Tip: If the flapper still drains when it’s covering the hole, then you may need to replace it."
                },
                {
                    "headline": "Lay rags or towels around the toilet to catch any spills.",
                    "description": "Fold the rags or towels 1–2 times so they’re more absorbent and prevent water from reaching your floor. Make sure the rags extend about 6 inches (15 cm) from the base of the toilet in case the water splashes out while you’re plunging the toilet. Overlap the rags slightly so there aren’t any gaps between them. Don’t use towels that you would normally use for bathing or showering since they could get very dirty. Once you’re finished plunging your toilet, wash the towels in a separate load right away so you don’t contaminate other items."
                },
                {
                    "headline": "Bail out water with a bucket if the toilet bowl is close to overflowing.",
                    "description": "If you tried flushing the toilet before, the water may have filled the bowl to the rim. Put on rubber gloves and dip a bucket into your toilet. Remove water from the toilet until it’s halfway full so it doesn’t overflow. Either pour the water into a different toilet or put it back in your toilet once it’s unclogged. You don’t have to remove any water if the bowl isn’t close to the rim. Wash your hands immediately after bailing water out."
                }
            ]
        },
        {
            "name": "Pushing out the Clog",
            "steps": [
                {
                    "headline": "Pour hot water and dish soap in your toilet to help loosen the clog.",
                    "description": "Fill a bucket or container with 4 cups (950 ml) of the hottest water from your tap. Squirt about 1 tablespoon (15 ml) of liquid dish soap in the container and mix it until it’s sudsy. Pour the soapy water directly into your toilet bowl and leave it for 5 minutes to soak. The soap will help break up any fats in the clog so it’s easier to remove. If you don’t have dish soap, you can use shampoo as a replacement. If there isn’t room to pour the water in the toilet bowl, use another bucket to remove some of the water from the bowl first."
                },
                {
                    "headline": "Use a flange plunger to get the best suction.",
                    "description": "A flange plunger has an extended edge sticking out from the cup and creates a better seal against the drain hole in your toilet. Look for a flange plunger that has a cup that covers the entire drain, or else it won’t have as strong of suction. Avoid using a standard plunger that only has a cup since it won’t seal around the drain completely. You can also use an accordion-style plunger to apply more pressure to the clog, which may help remove it easier. Many plungers come with a plastic base so you can keep it in your bathroom without contaminating your floor. If the plunger you have doesn’t have a base, set it inside an old coffee container or a plastic bag."
                },
                {
                    "headline": "Place the plunger in your toilet so the cup goes around the drain hole.",
                    "description": "Ease the plunger into the bowl so you don’t cause water to splash out. Guide the flange into the drain hole and press the cup against the bottom of the bowl. Position the handle so it’s straight above the drain to ensure you can get the best pressure and seal while you’re working. Don’t hold the handle at an angle to the drain hole since you won’t be able to make a perfect seal.Tip: If you can’t get a good seal around the drain with your plunger, try rubbing petroleum jelly around the plunger’s rim to get better suction."
                },
                {
                    "headline": "Move the plunger up and down for 10–20 seconds before removing it to clear the clog.",
                    "description": "Push down on the handle forcefully so the plunger’s cup collapses before slowly pulling it back up. Continue pushing and pulling the handle rapidly so the clog loosens inside the pipes and forces itself out. After 20 seconds, quickly pull the handle out to create a vacuum that pulls the clog out with it. Water may splash out of the toilet while you’re using your plunger. If the object causing the clog appears in the toilet bowl and it’s not meant to go down the drain, such as a toy or toothbrush, fish it out by hand or with a bucket so it doesn’t go back into your pipes. Throw the item away immediately to avoid contaminating anything in your bathroom. Spray the plunger with a disinfectant spray when you’re finished so it stays clean and doesn’t spread germs."
                },
                {
                    "headline": "Turn on the water so you can try flushing your toilet.",
                    "description": "Rotate the supply valve on the wall counterclockwise to turn the water back on for your toilet. Press down on the toilet handle to flush it and watch if the water drains normally. If you were able to remove the clog, the water should easily drain. If the toilet bowl keeps filling up and doesn’t drain, then you may need to break the clog. If your toilet looks like it’s about to overflow after flushing it, quickly press the flapper down inside the tank to prevent more water from coming in."
                }
            ]
        }
    ],
    "tyn": [
        "Rags or towels",
        "Bucket",
        "Rubber gloves",
        "Flange plunger",
        "Toilet auger"
    ],
    "text": " Preventing Spills Turn off the water to the toilet to prevent any overflow. Look for a metal or plastic valve on the wall behind your toilet that controls the water supply. Rotate the valve clockwise to shut off the water so the tank and bowl don’t fill up while you’re cleaning out the clog. Don’t flush the toilet while you’re working since there’s still water inside the tank. You don’t need to turn off the water to your toilet, but there’s more risk that the bowl will fill up. Push the flapper down inside the toilet tank to stop the bowl from filling. Take the lid off the back of your toilet and set it on top of a towel so it doesn’t damage your floors. Make sure the round rubber flapper at the bottom of the tank is completely sealed so water doesn’t drain from the tank into the bowl. If it’s still open, gently press it against the bottom of the tank to close it. The water in the toilet tank is clean, but you can wear rubber gloves if you don’t want to get your hands wet.Tip: If the flapper still drains when it’s covering the hole, then you may need to replace it. Lay rags or towels around the toilet to catch any spills. Fold the rags or towels 1–2 times so they’re more absorbent and prevent water from reaching your floor. Make sure the rags extend about 6 inches (15 cm) from the base of the toilet in case the water splashes out while you’re plunging the toilet. Overlap the rags slightly so there aren’t any gaps between them. Don’t use towels that you would normally use for bathing or showering since they could get very dirty. Once you’re finished plunging your toilet, wash the towels in a separate load right away so you don’t contaminate other items. Bail out water with a bucket if the toilet bowl is close to overflowing. If you tried flushing the toilet before, the water may have filled the bowl to the rim. Put on rubber gloves and dip a bucket into your toilet. Remove water from the toilet until it’s halfway full so it doesn’t overflow. Either pour the water into a different toilet or put it back in your toilet once it’s unclogged. You don’t have to remove any water if the bowl isn’t close to the rim. Wash your hands immediately after bailing water out. Pushing out the Clog Pour hot water and dish soap in your toilet to help loosen the clog. Fill a bucket or container with 4 cups (950 ml) of the hottest water from your tap. Squirt about 1 tablespoon (15 ml) of liquid dish soap in the container and mix it until it’s sudsy. Pour the soapy water directly into your toilet bowl and leave it for 5 minutes to soak. The soap will help break up any fats in the clog so it’s easier to remove. If you don’t have dish soap, you can use shampoo as a replacement. If there isn’t room to pour the water in the toilet bowl, use another bucket to remove some of the water from the bowl first. Use a flange plunger to get the best suction. A flange plunger has an extended edge sticking out from the cup and creates a better seal against the drain hole in your toilet. Look for a flange plunger that has a cup that covers the entire drain, or else it won’t have as strong of suction. Avoid using a standard plunger that only has a cup since it won’t seal around the drain completely. You can also use an accordion-style plunger to apply more pressure to the clog, which may help remove it easier. Many plungers come with a plastic base so you can keep it in your bathroom without contaminating your floor. If the plunger you have doesn’t have a base, set it inside an old coffee container or a plastic bag. Place the plunger in your toilet so the cup goes around the drain hole. Ease the plunger into the bowl so you don’t cause water to splash out. Guide the flange into the drain hole and press the cup against the bottom of the bowl. Position the handle so it’s straight above the drain to ensure you can get the best pressure and seal while you’re working. Don’t hold the handle at an angle to the drain hole since you won’t be able to make a perfect seal.Tip: If you can’t get a good seal around the drain with your plunger, try rubbing petroleum jelly around the plunger’s rim to get better suction. Move the plunger up and down for 10–20 seconds before removing it to clear the clog. Push down on the handle forcefully so the plunger’s cup collapses before slowly pulling it back up. Continue pushing and pulling the handle rapidly so the clog loosens inside the pipes and forces itself out. After 20 seconds, quickly pull the handle out to create a vacuum that pulls the clog out with it. Water may splash out of the toilet while you’re using your plunger. If the object causing the clog appears in the toilet bowl and it’s not meant to go down the drain, such as a toy or toothbrush, fish it out by hand or with a bucket so it doesn’t go back into your pipes. Throw the item away immediately to avoid contaminating anything in your bathroom. Spray the plunger with a disinfectant spray when you’re finished so it stays clean and doesn’t spread germs. Turn on the water so you can try flushing your toilet. Rotate the supply valve on the wall counterclockwise to turn the water back on for your toilet. Press down on the toilet handle to flush it and watch if the water drains normally. If you were able to remove the clog, the water should easily drain. If the toilet bowl keeps filling up and doesn’t drain, then you may need to break the clog. If your toilet looks like it’s about to overflow after flushing it, quickly press the flapper down inside the tank to prevent more water from coming in.",
    "sentences": [
        " Preventing Spills Turn off the water to the toilet to prevent any overflow.",
        "Look for a metal or plastic valve on the wall behind your toilet that controls the water supply.",
        "Rotate the valve clockwise to shut off the water so the tank and bowl don’t fill up while you’re cleaning out the clog.",
        "Don’t flush the toilet while you’re working since there’s still water inside the tank.",
        "You don’t need to turn off the water to your toilet, but there’s more risk that the bowl will fill up.",
        "Push the flapper down inside the toilet tank to stop the bowl from filling.",
        "Take the lid off the back of your toilet and set it on top of a towel so it doesn’t damage your floors.",
        "Make sure the round rubber flapper at the bottom of the tank is completely sealed so water doesn’t drain from the tank into the bowl.",
        "If it’s still open, gently press it against the bottom of the tank to close it.",
        "The water in the toilet tank is clean, but you can wear rubber gloves if you don’t want to get your hands wet.Tip: If the flapper still drains when it’s covering the hole, then you may need to replace it.",
        "Lay rags or towels around the toilet to catch any spills.",
        "Fold the rags or towels 1–2 times so they’re more absorbent and prevent water from reaching your floor.",
        "Make sure the rags extend about 6 inches (15 cm) from the base of the toilet in case the water splashes out while you’re plunging the toilet.",
        "Overlap the rags slightly so there aren’t any gaps between them.",
        "Don’t use towels that you would normally use for bathing or showering since they could get very dirty.",
        "Once you’re finished plunging your toilet, wash the towels in a separate load right away so you don’t contaminate other items.",
        "Bail out water with a bucket if the toilet bowl is close to overflowing.",
        "If you tried flushing the toilet before, the water may have filled the bowl to the rim.",
        "Put on rubber gloves and dip a bucket into your toilet.",
        "Remove water from the toilet until it’s halfway full so it doesn’t overflow.",
        "Either pour the water into a different toilet or put it back in your toilet once it’s unclogged.",
        "You don’t have to remove any water if the bowl isn’t close to the rim.",
        "Wash your hands immediately after bailing water out.",
        "Pushing out the Clog Pour hot water and dish soap in your toilet to help loosen the clog.",
        "Fill a bucket or container with 4 cups (950 ml) of the hottest water from your tap.",
        "Squirt about 1 tablespoon (15 ml) of liquid dish soap in the container and mix it until it’s sudsy.",
        "Pour the soapy water directly into your toilet bowl and leave it for 5 minutes to soak.",
        "The soap will help break up any fats in the clog so it’s easier to remove.",
        "If you don’t have dish soap, you can use shampoo as a replacement.",
        "If there isn’t room to pour the water in the toilet bowl, use another bucket to remove some of the water from the bowl first.",
        "Use a flange plunger to get the best suction.",
        "A flange plunger has an extended edge sticking out from the cup and creates a better seal against the drain hole in your toilet.",
        "Look for a flange plunger that has a cup that covers the entire drain, or else it won’t have as strong of suction.",
        "Avoid using a standard plunger that only has a cup since it won’t seal around the drain completely.",
        "You can also use an accordion-style plunger to apply more pressure to the clog, which may help remove it easier.",
        "Many plungers come with a plastic base so you can keep it in your bathroom without contaminating your floor.",
        "If the plunger you have doesn’t have a base, set it inside an old coffee container or a plastic bag.",
        "Place the plunger in your toilet so the cup goes around the drain hole.",
        "Ease the plunger into the bowl so you don’t cause water to splash out.",
        "Guide the flange into the drain hole and press the cup against the bottom of the bowl.",
        "Position the handle so it’s straight above the drain to ensure you can get the best pressure and seal while you’re working.",
        "Don’t hold the handle at an angle to the drain hole since you won’t be able to make a perfect seal.Tip: If you can’t get a good seal around the drain with your plunger, try rubbing petroleum jelly around the plunger’s rim to get better suction.",
        "Move the plunger up and down for 10–20 seconds before removing it to clear the clog.",
        "Push down on the handle forcefully so the plunger’s cup collapses before slowly pulling it back up.",
        "Continue pushing and pulling the handle rapidly so the clog loosens inside the pipes and forces itself out.",
        "After 20 seconds, quickly pull the handle out to create a vacuum that pulls the clog out with it.",
        "Water may splash out of the toilet while you’re using your plunger.",
        "If the object causing the clog appears in the toilet bowl and it’s not meant to go down the drain, such as a toy or toothbrush, fish it out by hand or with a bucket so it doesn’t go back into your pipes.",
        "Throw the item away immediately to avoid contaminating anything in your bathroom.",
        "Spray the plunger with a disinfectant spray when you’re finished so it stays clean and doesn’t spread germs.",
        "Turn on the water so you can try flushing your toilet.",
        "Rotate the supply valve on the wall counterclockwise to turn the water back on for your toilet.",
        "Press down on the toilet handle to flush it and watch if the water drains normally.",
        "If you were able to remove the clog, the water should easily drain.",
        "If the toilet bowl keeps filling up and doesn’t drain, then you may need to break the clog.",
        "If your toilet looks like it’s about to overflow after flushing it, quickly press the flapper down inside the tank to prevent more water from coming in."
    ]
}