{
    "title": "How to Remove Gel Nail Polish",
    "url": "https://www.wikihow.com/Remove-Gel-Nail-Polish",
    "category_hierarchy": [
        "Personal Care and Style",
        "Nail Care",
        "Nail Beauty Treatments",
        "Artificial Nails",
        "Removing Artificial Nails"
    ],
    "methods": [
        {
            "name": "Soaking Off the Gel Nails",
            "steps": [
                {
                    "headline": "Fill a bowl with acetone.",
                    "description": "Acetone is a chemical that reacts with the gel nail to loosen its adhesive and free it from your natural nail. Acetone is a common ingredient in nail polish remover, but in order to remove gels, you need a concentrated amount of pure acetone. Cover the bowl of acetone with plastic wrap or foil. Use a rubber band to hold the cover in place. Place the acetone in a larger bowl of warm water, so the acetone warms up. Let it sit for 3 to 5 minutes. Then remove the acetone from the outer bowl to prevent overheating. Be careful with this process, because acetone is flammable. Keep the acetone away from any direct heat sources, and warm only gently and with care."
                },
                {
                    "headline": "Protect the skin around your nails with petroleum jelly.",
                    "description": "Acetone can dry out and damage your skin, so its important to protect it with a layer of jelly. If you don't have plain petroleum jelly, use a lotion or balm that lists it as an ingredient. Dip a cotton swab in the petroleum jelly and use it to apply the petroleum jelly around the edges of your nails. Cover the skin on your fingers down just below your top knuckles. Don't get too much jelly on your nails, since the acetone needs to be able to dissolve the gel."
                },
                {
                    "headline": "Wrap your nails in acetone.",
                    "description": "Dip a cotton ball in acetone to completely saturate it, then hold it against your nail and wrap it in a strip of aluminum foil to fix it in place. Repeat with your remaining nails. Let your nails soak in acetone for 30 minutes. If acetone doesn't irritate your skin, you can dip your nails straight into the bowl instead of using cotton balls and aluminum foil. Make sure not to soak them like this for more than 30 minutes."
                },
                {
                    "headline": "Remove the foil and cotton balls.",
                    "description": "Remove the foil and cotton ball from one nail first. The gel should come right off when you swipe it with the cotton ball. If it does, repeat the process with your remaining nails. You may have to help the gel come off by peeling it back a bit. If the gel on your test nail is still firmly in place, replace the acetone-soaked cotton ball, wrap it up in foil, and let your nails sit for another 10 minutes before trying again, continuing until the adhesive is softened and the nails can be removed. If this method doesn't work within one hour, the adhesive is probably resistant to acetone and another method should be employed."
                },
                {
                    "headline": "Condition your nails.",
                    "description": "Rinse off the acetone and then  shape your natural nails with a nail file. Buff them with a nail buffer to remove rough edges. Moisturize your nails and hands with lotion or cosmetic oil. File only in one direction, so you don't damage your nails. Avoid using a sawing motion. The acetone may have dried out your nails. Treat them gently for the next few days. You might want to wait a week or so before applying another set of gels."
                }
            ]
        },
        {
            "name": "Filing Off the Nail Gels",
            "steps": [
                {
                    "headline": "Trim your nails.",
                    "description": "Use a nail clipper to clip off the part of the nail that extends past your finger. Trim them as short as possible. If they are too thick to cut with a nail clipper, use a course file to file them down."
                },
                {
                    "headline": "File down the surface of the nails.",
                    "description": "Use a coarse-grit file between 150 and 180 grit. File gently and in crosshatches to keep the work even, moving the file to different areas so that you don’t feel a burning sensation in one place. The filing process might take a long time. Resist the urge to work quickly or unevenly, which can damage the natural nail underneath. Wipe dust away frequently. This will allow you to clearly see how much more gel there is to go before you hit natural nail."
                },
                {
                    "headline": "Look for signs that you are close to the natural nail.",
                    "description": "You don't want to keep filing once you get down to the natural nail, since you could damage it. Signs that you're close to the natural nail include the following:\nA big reduction in dust that is produced from filing the gel. Visibility of the natural ridges in your nails."
                },
                {
                    "headline": "File the remaining gel with a finer-grit file.",
                    "description": "Work slowly and gently to make sure you don't file the surface of your natural nail. Though damage is hard to avoid when working with regular gel nails, working gently will minimize it. Continue until the gels have been completely filed away."
                },
                {
                    "headline": "Condition your nails.",
                    "description": "Use a buffer to smooth the surfaces of your nails, which may have become scratched from the filing process. Moisturize your nails and hands with lotion or oil, and keep them away from chemicals and other harsh substances for a few days. Wait a week before applying another set of gels."
                }
            ]
        },
        {
            "name": "Peeling Off the Nail Gels",
            "steps": [
                {
                    "headline": "Wait until the nails are mostly chipped away.",
                    "description": "Gels tend to chip off after a week or two, and its best to wait until they're mostly gone to start peeling them yourself, so you reduce damage to the surface of your nail."
                },
                {
                    "headline": "Insert a cuticle stick under the surface of a gel.",
                    "description": "Work it gently under the gel until the gel is slightly raised around the edge. Don't dig too hard under the gel, or you may damage your natural nail."
                },
                {
                    "headline": "Peel off the gel.",
                    "description": "Use your fingers or a pair of tweezers to grasp the edge of the gel and peel it back. Repeat with each finger until the gels have been completely removed. Don't rip off the gels. A layer of your natural nail will come up with them. If the gels are tough to peel, consider using another removal method."
                },
                {
                    "headline": "Condition your nails.",
                    "description": "Use a file to smooth out the edges, and use a nail buffer to smooth out the rough spots on the surface of your nails. Rub lotion or oil on your nails and hands. Wait a week before applying another set of gels."
                }
            ]
        }
    ],
    "tyn": [
        "Soaking",
        "Acetone",
        "Bowl",
        "Cotton balls or tissue",
        "Aluminum foil",
        "Nail file",
        "Nail buffer",
        "Lotion or oil",
        "Filing",
        "Course-grit nail file",
        "Fine-grit nail file",
        "Peeling",
        "Cuticle stick",
        "Tweezers"
    ],
    "text": " Soaking Off the Gel Nails Fill a bowl with acetone. Acetone is a chemical that reacts with the gel nail to loosen its adhesive and free it from your natural nail. Acetone is a common ingredient in nail polish remover, but in order to remove gels, you need a concentrated amount of pure acetone. Cover the bowl of acetone with plastic wrap or foil. Use a rubber band to hold the cover in place. Place the acetone in a larger bowl of warm water, so the acetone warms up. Let it sit for 3 to 5 minutes. Then remove the acetone from the outer bowl to prevent overheating. Be careful with this process, because acetone is flammable. Keep the acetone away from any direct heat sources, and warm only gently and with care. Protect the skin around your nails with petroleum jelly. Acetone can dry out and damage your skin, so its important to protect it with a layer of jelly. If you don't have plain petroleum jelly, use a lotion or balm that lists it as an ingredient. Dip a cotton swab in the petroleum jelly and use it to apply the petroleum jelly around the edges of your nails. Cover the skin on your fingers down just below your top knuckles. Don't get too much jelly on your nails, since the acetone needs to be able to dissolve the gel. Wrap your nails in acetone. Dip a cotton ball in acetone to completely saturate it, then hold it against your nail and wrap it in a strip of aluminum foil to fix it in place. Repeat with your remaining nails. Let your nails soak in acetone for 30 minutes. If acetone doesn't irritate your skin, you can dip your nails straight into the bowl instead of using cotton balls and aluminum foil. Make sure not to soak them like this for more than 30 minutes. Remove the foil and cotton balls. Remove the foil and cotton ball from one nail first. The gel should come right off when you swipe it with the cotton ball. If it does, repeat the process with your remaining nails. You may have to help the gel come off by peeling it back a bit. If the gel on your test nail is still firmly in place, replace the acetone-soaked cotton ball, wrap it up in foil, and let your nails sit for another 10 minutes before trying again, continuing until the adhesive is softened and the nails can be removed. If this method doesn't work within one hour, the adhesive is probably resistant to acetone and another method should be employed. Condition your nails. Rinse off the acetone and then  shape your natural nails with a nail file. Buff them with a nail buffer to remove rough edges. Moisturize your nails and hands with lotion or cosmetic oil. File only in one direction, so you don't damage your nails. Avoid using a sawing motion. The acetone may have dried out your nails. Treat them gently for the next few days. You might want to wait a week or so before applying another set of gels. Filing Off the Nail Gels Trim your nails. Use a nail clipper to clip off the part of the nail that extends past your finger. Trim them as short as possible. If they are too thick to cut with a nail clipper, use a course file to file them down. File down the surface of the nails. Use a coarse-grit file between 150 and 180 grit. File gently and in crosshatches to keep the work even, moving the file to different areas so that you don’t feel a burning sensation in one place. The filing process might take a long time. Resist the urge to work quickly or unevenly, which can damage the natural nail underneath. Wipe dust away frequently. This will allow you to clearly see how much more gel there is to go before you hit natural nail. Look for signs that you are close to the natural nail. You don't want to keep filing once you get down to the natural nail, since you could damage it. Signs that you're close to the natural nail include the following:\nA big reduction in dust that is produced from filing the gel. Visibility of the natural ridges in your nails. File the remaining gel with a finer-grit file. Work slowly and gently to make sure you don't file the surface of your natural nail. Though damage is hard to avoid when working with regular gel nails, working gently will minimize it. Continue until the gels have been completely filed away. Condition your nails. Use a buffer to smooth the surfaces of your nails, which may have become scratched from the filing process. Moisturize your nails and hands with lotion or oil, and keep them away from chemicals and other harsh substances for a few days. Wait a week before applying another set of gels. Peeling Off the Nail Gels Wait until the nails are mostly chipped away. Gels tend to chip off after a week or two, and its best to wait until they're mostly gone to start peeling them yourself, so you reduce damage to the surface of your nail. Insert a cuticle stick under the surface of a gel. Work it gently under the gel until the gel is slightly raised around the edge. Don't dig too hard under the gel, or you may damage your natural nail. Peel off the gel. Use your fingers or a pair of tweezers to grasp the edge of the gel and peel it back. Repeat with each finger until the gels have been completely removed. Don't rip off the gels. A layer of your natural nail will come up with them. If the gels are tough to peel, consider using another removal method. Condition your nails. Use a file to smooth out the edges, and use a nail buffer to smooth out the rough spots on the surface of your nails. Rub lotion or oil on your nails and hands. Wait a week before applying another set of gels.",
    "sentences": [
        " Soaking Off the Gel Nails Fill a bowl with acetone.",
        "Acetone is a chemical that reacts with the gel nail to loosen its adhesive and free it from your natural nail.",
        "Acetone is a common ingredient in nail polish remover, but in order to remove gels, you need a concentrated amount of pure acetone.",
        "Cover the bowl of acetone with plastic wrap or foil.",
        "Use a rubber band to hold the cover in place.",
        "Place the acetone in a larger bowl of warm water, so the acetone warms up.",
        "Let it sit for 3 to 5 minutes.",
        "Then remove the acetone from the outer bowl to prevent overheating.",
        "Be careful with this process, because acetone is flammable.",
        "Keep the acetone away from any direct heat sources, and warm only gently and with care.",
        "Protect the skin around your nails with petroleum jelly.",
        "Acetone can dry out and damage your skin, so its important to protect it with a layer of jelly.",
        "If you don't have plain petroleum jelly, use a lotion or balm that lists it as an ingredient.",
        "Dip a cotton swab in the petroleum jelly and use it to apply the petroleum jelly around the edges of your nails.",
        "Cover the skin on your fingers down just below your top knuckles.",
        "Don't get too much jelly on your nails, since the acetone needs to be able to dissolve the gel.",
        "Wrap your nails in acetone.",
        "Dip a cotton ball in acetone to completely saturate it, then hold it against your nail and wrap it in a strip of aluminum foil to fix it in place.",
        "Repeat with your remaining nails.",
        "Let your nails soak in acetone for 30 minutes.",
        "If acetone doesn't irritate your skin, you can dip your nails straight into the bowl instead of using cotton balls and aluminum foil.",
        "Make sure not to soak them like this for more than 30 minutes.",
        "Remove the foil and cotton balls.",
        "Remove the foil and cotton ball from one nail first.",
        "The gel should come right off when you swipe it with the cotton ball.",
        "If it does, repeat the process with your remaining nails.",
        "You may have to help the gel come off by peeling it back a bit.",
        "If the gel on your test nail is still firmly in place, replace the acetone-soaked cotton ball, wrap it up in foil, and let your nails sit for another 10 minutes before trying again, continuing until the adhesive is softened and the nails can be removed.",
        "If this method doesn't work within one hour, the adhesive is probably resistant to acetone and another method should be employed.",
        "Condition your nails.",
        "Rinse off the acetone and then  shape your natural nails with a nail file.",
        "Buff them with a nail buffer to remove rough edges.",
        "Moisturize your nails and hands with lotion or cosmetic oil.",
        "File only in one direction, so you don't damage your nails.",
        "Avoid using a sawing motion.",
        "The acetone may have dried out your nails.",
        "Treat them gently for the next few days.",
        "You might want to wait a week or so before applying another set of gels.",
        "Filing Off the Nail Gels Trim your nails.",
        "Use a nail clipper to clip off the part of the nail that extends past your finger.",
        "Trim them as short as possible.",
        "If they are too thick to cut with a nail clipper, use a course file to file them down.",
        "File down the surface of the nails.",
        "Use a coarse-grit file between 150 and 180 grit.",
        "File gently and in crosshatches to keep the work even, moving the file to different areas so that you don’t feel a burning sensation in one place.",
        "The filing process might take a long time.",
        "Resist the urge to work quickly or unevenly, which can damage the natural nail underneath.",
        "Wipe dust away frequently.",
        "This will allow you to clearly see how much more gel there is to go before you hit natural nail.",
        "Look for signs that you are close to the natural nail.",
        "You don't want to keep filing once you get down to the natural nail, since you could damage it.",
        "Signs that you're close to the natural nail include the following:\nA big reduction in dust that is produced from filing the gel.",
        "Visibility of the natural ridges in your nails.",
        "File the remaining gel with a finer-grit file.",
        "Work slowly and gently to make sure you don't file the surface of your natural nail.",
        "Though damage is hard to avoid when working with regular gel nails, working gently will minimize it.",
        "Continue until the gels have been completely filed away.",
        "Condition your nails.",
        "Use a buffer to smooth the surfaces of your nails, which may have become scratched from the filing process.",
        "Moisturize your nails and hands with lotion or oil, and keep them away from chemicals and other harsh substances for a few days.",
        "Wait a week before applying another set of gels.",
        "Peeling Off the Nail Gels Wait until the nails are mostly chipped away.",
        "Gels tend to chip off after a week or two, and its best to wait until they're mostly gone to start peeling them yourself, so you reduce damage to the surface of your nail.",
        "Insert a cuticle stick under the surface of a gel.",
        "Work it gently under the gel until the gel is slightly raised around the edge.",
        "Don't dig too hard under the gel, or you may damage your natural nail.",
        "Peel off the gel.",
        "Use your fingers or a pair of tweezers to grasp the edge of the gel and peel it back.",
        "Repeat with each finger until the gels have been completely removed.",
        "Don't rip off the gels.",
        "A layer of your natural nail will come up with them.",
        "If the gels are tough to peel, consider using another removal method.",
        "Condition your nails.",
        "Use a file to smooth out the edges, and use a nail buffer to smooth out the rough spots on the surface of your nails.",
        "Rub lotion or oil on your nails and hands.",
        "Wait a week before applying another set of gels."
    ]
}