{
    "title": "How to Make Your Own Pattern for Sewing a New Piece of Clothing",
    "url": "https://www.wikihow.com/Make-Your-Own-Pattern-for-Sewing-a-New-Piece-of-Clothing",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Sewing",
        "Sewing Skills",
        "Working with Sewing Patterns"
    ],
    "steps": [
        {
            "headline": "Gather supplies.",
            "description": "An old bed sheet works well for this project."
        },
        {
            "headline": "Take measurements.",
            "description": "Measure the general length and width for each pattern piece."
        },
        {
            "headline": "Cut the sheet.",
            "description": "Cut squares and rectangles for each pattern piece."
        },
        {
            "headline": "Fit your model.",
            "description": "Drape each pattern piece over your model."
        },
        {
            "headline": "Refine your pattern.",
            "description": "Cut and shape your pattern pieces. Pin or baste each pattern piece together along the seam-line. Leave a half-inch seam allowance on all sides of each pattern piece."
        },
        {
            "headline": "Refine your design.",
            "description": "Use tailor's chalk to mark certain areas. Create pleats, tucks or darts with common pins. Create gathers and hemlines with a basting stitch."
        },
        {
            "headline": "Remove the pattern from the model.",
            "description": "Use tailor's chalk to mark all pinned or basted areas, if needed."
        },
        {
            "headline": "Cut your fabric.",
            "description": "Using your new pattern, cut fabric for your actual garment."
        },
        {
            "headline": "Baste your garment together.",
            "description": "Baste all seams by hand or use the loosest stitch on  your sewing machine."
        },
        {
            "headline": "Refit your model.",
            "description": "Place the basted garment on your model and make final adjustments to your design. Remove the basting."
        },
        {
            "headline": "Stitch your garment together.",
            "description": "Use the sewing machine for seams. Hand-stitch hemlines for a nice finished look."
        }
    ],
    "tyn": [
        "Old sheet",
        "Tape measure",
        "Scissors",
        "Needle",
        "Matching thread",
        "Common pins",
        "Tailor's chalk",
        "Sewing Machine"
    ],
    "text": " Gather supplies. An old bed sheet works well for this project. Take measurements. Measure the general length and width for each pattern piece. Cut the sheet. Cut squares and rectangles for each pattern piece. Fit your model. Drape each pattern piece over your model. Refine your pattern. Cut and shape your pattern pieces. Pin or baste each pattern piece together along the seam-line. Leave a half-inch seam allowance on all sides of each pattern piece. Refine your design. Use tailor's chalk to mark certain areas. Create pleats, tucks or darts with common pins. Create gathers and hemlines with a basting stitch. Remove the pattern from the model. Use tailor's chalk to mark all pinned or basted areas, if needed. Cut your fabric. Using your new pattern, cut fabric for your actual garment. Baste your garment together. Baste all seams by hand or use the loosest stitch on  your sewing machine. Refit your model. Place the basted garment on your model and make final adjustments to your design. Remove the basting. Stitch your garment together. Use the sewing machine for seams. Hand-stitch hemlines for a nice finished look.",
    "sentences": [
        " Gather supplies.",
        "An old bed sheet works well for this project.",
        "Take measurements.",
        "Measure the general length and width for each pattern piece.",
        "Cut the sheet.",
        "Cut squares and rectangles for each pattern piece.",
        "Fit your model.",
        "Drape each pattern piece over your model.",
        "Refine your pattern.",
        "Cut and shape your pattern pieces.",
        "Pin or baste each pattern piece together along the seam-line.",
        "Leave a half-inch seam allowance on all sides of each pattern piece.",
        "Refine your design.",
        "Use tailor's chalk to mark certain areas.",
        "Create pleats, tucks or darts with common pins.",
        "Create gathers and hemlines with a basting stitch.",
        "Remove the pattern from the model.",
        "Use tailor's chalk to mark all pinned or basted areas, if needed.",
        "Cut your fabric.",
        "Using your new pattern, cut fabric for your actual garment.",
        "Baste your garment together.",
        "Baste all seams by hand or use the loosest stitch on  your sewing machine.",
        "Refit your model.",
        "Place the basted garment on your model and make final adjustments to your design.",
        "Remove the basting.",
        "Stitch your garment together.",
        "Use the sewing machine for seams.",
        "Hand-stitch hemlines for a nice finished look."
    ]
}