{
    "title": "How to Become a Social Worker",
    "url": "https://www.wikihow.com/Become-a-Social-Worker",
    "category_hierarchy": [
        "Health"
    ],
    "parts": [
        {
            "name": "Meeting the Education Requirements",
            "steps": [
                {
                    "headline": "Earn a high school diploma or equivalent.",
                    "description": "Complete your four years of high school. A high school education will help prepare you for the rigors of college course work needed to become a social worker. If you didn't graduate from high school, consider earning a GED."
                },
                {
                    "headline": "Get accepted to a college that has an accredited social work program.",
                    "description": "Not all colleges and universities have programs that are sanctioned by the Council on Social Work Education – an education and accrediting organization. Without a degree from an accredited institution, you may not be able to get a job and your state may not allow you to become licensed. If you live outside the United States, identify accrediting institutions in your country or region. CSWE degree accreditation is often required by insurance companies, state licensing boards, graduate programs, and many employers."
                },
                {
                    "headline": "Complete your coursework.",
                    "description": "To fulfill the requirements of your degree, you’ll have to complete a specific set of courses. These courses will provide you with the foundations and the specific information you’ll need to succeed in the career of social work. Pre-social work classes include: introduction to social work, introduction to psychology, and human biology. Core courses include: social welfare policy, human behavior, and social work practice. Third and fourth year courses include: social justice, cultural diversity, and social welfare programs, policies, and issues."
                },
                {
                    "headline": "Pick a specialization.",
                    "description": "Within the field of social work, there are a variety of areas you can choose to specialize in. Ultimately, specialization breaks down to the different social groups you can work with. Some areas include:\nGeriatric social workers, who help older adults adjust to the aging process. Child and family social workers, who help families access resources and deal with family conflicts. Medical social workers, who assist patients in adjusting to and accessing resources for health conditions. Hospice social workers, who assist people who are in their final stages of life. Substance abuse social workers. School social workers, who work with students struggling with emotional problems and accessing special education services."
                },
                {
                    "headline": "Fulfill your field work.",
                    "description": "In addition to course work, you’ll have to complete a certain amount of field work experience to fulfill the requirements of your degree. Your fieldwork will be like an internship. You’ll be placed at a non-profit or governmental organization near you. There, you will work under the supervision of licensed social workers. Many universities in the United States require 480 hours of practical field work. This is typically completed in 2 semesters during the 4th year of the degree. After you complete your coursework and your field work, you’ll be able to graduate."
                },
                {
                    "headline": "Enroll in a master’s program, if you want or are required to do so.",
                    "description": "After completing your undergraduate education, you may need to enroll in an accredited master’s program in social work. This is important, as some states like Pennsylvania require a master’s degree to gain a license. Master’s degree programs usually take 1 or 2 years to complete and have coursework and practical experience components. Many social work jobs in Western Europe require a masters degree as a prerequisite. While you can become a licensed social worker with just a bachelor’s, most states require you to hold a master’s degree to become a licensed clinical social worker."
                }
            ]
        },
        {
            "name": "Getting Licensed and Certified",
            "steps": [
                {
                    "headline": "Take the exam to become a licensed social worker.",
                    "description": "If you're in a state that only requires a bachelor's degree to be a social worker, you can apply to take the ASWB (Association of Social Work Boards) licensure exam. Once you have your degree, register with exam vendor for your area. After you pass your test, you’ll receive your license from the state. Many states and governmental bodies allow you to take the exam at least twice."
                },
                {
                    "headline": "Become a licensed master social worker (LMSW).",
                    "description": "The next step after becoming a licensed social worker is to become an LMSW. If you hold a master's degree in social work and pass the ASWB exam, you'll be eligible to apply for a LMSW license from your state. LMSW's tend to work in case management for children or people seeking public assistance. They also sometimes work under a licensed clinical social worker, psychiatrist, or a psychologist. Some states will only license social workers who hold a master's degree."
                },
                {
                    "headline": "Get 3,000 to 4,000 hours of clinical experience.",
                    "description": "If you want to move into a different career path, you can begin to transition to a licensed clinical social worker (LCSW) track. To gain a license as a LCSW, you'll have to hold a graduate degree in social work and have the number of clinical hours mandated by your state's licensing authority. As opposed to LMSWs who work in case management, LCSWs work one-on-one with patients to offer therapy and other clinical assistance."
                },
                {
                    "headline": "Take the ASWB LCSW exam.",
                    "description": "Once you've gained the experience you need to become an LCSW, take the LCSW ASWB exam. This exam is more geared toward the work and experience of a LCSW. It will test you on ethics, safety issues, clinical intervention, and more. When you pass the ASWB LCSW exam, you'll gain the title of licensed clinical social worker."
                }
            ]
        },
        {
            "name": "Getting a Job",
            "steps": [
                {
                    "headline": "Join professional organizations.",
                    "description": "Wherever you live, there are professional organizations that help unite and educate social workers, and set standards for social work as a profession. Identify the leading organizations in your country, and join them. The National Association of Social Work (NASW) is a leading American social work professional organization. It has a chapter in every state of the United States. Through the NASW, you’ll have access to continuing education and be able to attend annual and semiannual conferences. The British Association of Social Workers is much like the NASW. It holds yearly meetings and conferences. The Japanese Association of Certified Social Workers is similar to its American and British counterparts. Depending on your region, you may want to join other professional associations, too."
                },
                {
                    "headline": "Find employment with a governmental organization.",
                    "description": "The government is the primary source of employment for social workers. To find employment with the government, search job postings on local, state/provincial, and national websites. Visit usa.jobs.gov to search for social work jobs for the united states government. Visit your websites of your local and state/provincial government to look for social work jobs in your community."
                },
                {
                    "headline": "Work for a non-profit.",
                    "description": "Next to government jobs, non-profit organizations are the largest employers of social workers. While there are many opportunities to work for a non-profit, you’ll have to put in some time identifying those opportunities. Consider visiting popular online job websites, identify non-profits in your area, and look for jobs nationally.."
                },
                {
                    "headline": "Fulfill continuing education requirements every year or two.",
                    "description": "After you have your first job, you’ll need to research whether your state/provincial government requires continuing education to maintain your license. If so, you’ll need to enroll in continuing education classes every one or two years. Contact your licensing authority about continuing education requirements, as they vary."
                },
                {
                    "headline": "Apply for supervisory jobs after you've gained experience.",
                    "description": "Once you’ve held an entry-level position for several years, you should consider applying for supervisory or management jobs. While these positions require more responsibility, they’ll also provide a higher salary."
                }
            ]
        }
    ],
    "tyn": [
        "High school diploma/GED",
        "College entrance exams",
        "Bachelor's degree in social work",
        "Internships/work experience",
        "Master's degree in social work",
        "State license",
        "Social work credential/certification",
        "Continuing education credits"
    ],
    "text": " Meeting the Education Requirements Earn a high school diploma or equivalent. Complete your four years of high school. A high school education will help prepare you for the rigors of college course work needed to become a social worker. If you didn't graduate from high school, consider earning a GED. Get accepted to a college that has an accredited social work program. Not all colleges and universities have programs that are sanctioned by the Council on Social Work Education – an education and accrediting organization. Without a degree from an accredited institution, you may not be able to get a job and your state may not allow you to become licensed. If you live outside the United States, identify accrediting institutions in your country or region. CSWE degree accreditation is often required by insurance companies, state licensing boards, graduate programs, and many employers. Complete your coursework. To fulfill the requirements of your degree, you’ll have to complete a specific set of courses. These courses will provide you with the foundations and the specific information you’ll need to succeed in the career of social work. Pre-social work classes include: introduction to social work, introduction to psychology, and human biology. Core courses include: social welfare policy, human behavior, and social work practice. Third and fourth year courses include: social justice, cultural diversity, and social welfare programs, policies, and issues. Pick a specialization. Within the field of social work, there are a variety of areas you can choose to specialize in. Ultimately, specialization breaks down to the different social groups you can work with. Some areas include:\nGeriatric social workers, who help older adults adjust to the aging process. Child and family social workers, who help families access resources and deal with family conflicts. Medical social workers, who assist patients in adjusting to and accessing resources for health conditions. Hospice social workers, who assist people who are in their final stages of life. Substance abuse social workers. School social workers, who work with students struggling with emotional problems and accessing special education services. Fulfill your field work. In addition to course work, you’ll have to complete a certain amount of field work experience to fulfill the requirements of your degree. Your fieldwork will be like an internship. You’ll be placed at a non-profit or governmental organization near you. There, you will work under the supervision of licensed social workers. Many universities in the United States require 480 hours of practical field work. This is typically completed in 2 semesters during the 4th year of the degree. After you complete your coursework and your field work, you’ll be able to graduate. Enroll in a master’s program, if you want or are required to do so. After completing your undergraduate education, you may need to enroll in an accredited master’s program in social work. This is important, as some states like Pennsylvania require a master’s degree to gain a license. Master’s degree programs usually take 1 or 2 years to complete and have coursework and practical experience components. Many social work jobs in Western Europe require a masters degree as a prerequisite. While you can become a licensed social worker with just a bachelor’s, most states require you to hold a master’s degree to become a licensed clinical social worker. Getting Licensed and Certified Take the exam to become a licensed social worker. If you're in a state that only requires a bachelor's degree to be a social worker, you can apply to take the ASWB (Association of Social Work Boards) licensure exam. Once you have your degree, register with exam vendor for your area. After you pass your test, you’ll receive your license from the state. Many states and governmental bodies allow you to take the exam at least twice. Become a licensed master social worker (LMSW). The next step after becoming a licensed social worker is to become an LMSW. If you hold a master's degree in social work and pass the ASWB exam, you'll be eligible to apply for a LMSW license from your state. LMSW's tend to work in case management for children or people seeking public assistance. They also sometimes work under a licensed clinical social worker, psychiatrist, or a psychologist. Some states will only license social workers who hold a master's degree. Get 3,000 to 4,000 hours of clinical experience. If you want to move into a different career path, you can begin to transition to a licensed clinical social worker (LCSW) track. To gain a license as a LCSW, you'll have to hold a graduate degree in social work and have the number of clinical hours mandated by your state's licensing authority. As opposed to LMSWs who work in case management, LCSWs work one-on-one with patients to offer therapy and other clinical assistance. Take the ASWB LCSW exam. Once you've gained the experience you need to become an LCSW, take the LCSW ASWB exam. This exam is more geared toward the work and experience of a LCSW. It will test you on ethics, safety issues, clinical intervention, and more. When you pass the ASWB LCSW exam, you'll gain the title of licensed clinical social worker. Getting a Job Join professional organizations. Wherever you live, there are professional organizations that help unite and educate social workers, and set standards for social work as a profession. Identify the leading organizations in your country, and join them. The National Association of Social Work (NASW) is a leading American social work professional organization. It has a chapter in every state of the United States. Through the NASW, you’ll have access to continuing education and be able to attend annual and semiannual conferences. The British Association of Social Workers is much like the NASW. It holds yearly meetings and conferences. The Japanese Association of Certified Social Workers is similar to its American and British counterparts. Depending on your region, you may want to join other professional associations, too. Find employment with a governmental organization. The government is the primary source of employment for social workers. To find employment with the government, search job postings on local, state/provincial, and national websites. Visit usa.jobs.gov to search for social work jobs for the united states government. Visit your websites of your local and state/provincial government to look for social work jobs in your community. Work for a non-profit. Next to government jobs, non-profit organizations are the largest employers of social workers. While there are many opportunities to work for a non-profit, you’ll have to put in some time identifying those opportunities. Consider visiting popular online job websites, identify non-profits in your area, and look for jobs nationally.. Fulfill continuing education requirements every year or two. After you have your first job, you’ll need to research whether your state/provincial government requires continuing education to maintain your license. If so, you’ll need to enroll in continuing education classes every one or two years. Contact your licensing authority about continuing education requirements, as they vary. Apply for supervisory jobs after you've gained experience. Once you’ve held an entry-level position for several years, you should consider applying for supervisory or management jobs. While these positions require more responsibility, they’ll also provide a higher salary.",
    "sentences": [
        " Meeting the Education Requirements Earn a high school diploma or equivalent.",
        "Complete your four years of high school.",
        "A high school education will help prepare you for the rigors of college course work needed to become a social worker.",
        "If you didn't graduate from high school, consider earning a GED.",
        "Get accepted to a college that has an accredited social work program.",
        "Not all colleges and universities have programs that are sanctioned by the Council on Social Work Education – an education and accrediting organization.",
        "Without a degree from an accredited institution, you may not be able to get a job and your state may not allow you to become licensed.",
        "If you live outside the United States, identify accrediting institutions in your country or region.",
        "CSWE degree accreditation is often required by insurance companies, state licensing boards, graduate programs, and many employers.",
        "Complete your coursework.",
        "To fulfill the requirements of your degree, you’ll have to complete a specific set of courses.",
        "These courses will provide you with the foundations and the specific information you’ll need to succeed in the career of social work.",
        "Pre-social work classes include: introduction to social work, introduction to psychology, and human biology.",
        "Core courses include: social welfare policy, human behavior, and social work practice.",
        "Third and fourth year courses include: social justice, cultural diversity, and social welfare programs, policies, and issues.",
        "Pick a specialization.",
        "Within the field of social work, there are a variety of areas you can choose to specialize in.",
        "Ultimately, specialization breaks down to the different social groups you can work with.",
        "Some areas include:\nGeriatric social workers, who help older adults adjust to the aging process.",
        "Child and family social workers, who help families access resources and deal with family conflicts.",
        "Medical social workers, who assist patients in adjusting to and accessing resources for health conditions.",
        "Hospice social workers, who assist people who are in their final stages of life.",
        "Substance abuse social workers.",
        "School social workers, who work with students struggling with emotional problems and accessing special education services.",
        "Fulfill your field work.",
        "In addition to course work, you’ll have to complete a certain amount of field work experience to fulfill the requirements of your degree.",
        "Your fieldwork will be like an internship.",
        "You’ll be placed at a non-profit or governmental organization near you.",
        "There, you will work under the supervision of licensed social workers.",
        "Many universities in the United States require 480 hours of practical field work.",
        "This is typically completed in 2 semesters during the 4th year of the degree.",
        "After you complete your coursework and your field work, you’ll be able to graduate.",
        "Enroll in a master’s program, if you want or are required to do so.",
        "After completing your undergraduate education, you may need to enroll in an accredited master’s program in social work.",
        "This is important, as some states like Pennsylvania require a master’s degree to gain a license.",
        "Master’s degree programs usually take 1 or 2 years to complete and have coursework and practical experience components.",
        "Many social work jobs in Western Europe require a masters degree as a prerequisite.",
        "While you can become a licensed social worker with just a bachelor’s, most states require you to hold a master’s degree to become a licensed clinical social worker.",
        "Getting Licensed and Certified Take the exam to become a licensed social worker.",
        "If you're in a state that only requires a bachelor's degree to be a social worker, you can apply to take the ASWB (Association of Social Work Boards) licensure exam.",
        "Once you have your degree, register with exam vendor for your area.",
        "After you pass your test, you’ll receive your license from the state.",
        "Many states and governmental bodies allow you to take the exam at least twice.",
        "Become a licensed master social worker (LMSW).",
        "The next step after becoming a licensed social worker is to become an LMSW.",
        "If you hold a master's degree in social work and pass the ASWB exam, you'll be eligible to apply for a LMSW license from your state.",
        "LMSW's tend to work in case management for children or people seeking public assistance.",
        "They also sometimes work under a licensed clinical social worker, psychiatrist, or a psychologist.",
        "Some states will only license social workers who hold a master's degree.",
        "Get 3,000 to 4,000 hours of clinical experience.",
        "If you want to move into a different career path, you can begin to transition to a licensed clinical social worker (LCSW) track.",
        "To gain a license as a LCSW, you'll have to hold a graduate degree in social work and have the number of clinical hours mandated by your state's licensing authority.",
        "As opposed to LMSWs who work in case management, LCSWs work one-on-one with patients to offer therapy and other clinical assistance.",
        "Take the ASWB LCSW exam.",
        "Once you've gained the experience you need to become an LCSW, take the LCSW ASWB exam.",
        "This exam is more geared toward the work and experience of a LCSW.",
        "It will test you on ethics, safety issues, clinical intervention, and more.",
        "When you pass the ASWB LCSW exam, you'll gain the title of licensed clinical social worker.",
        "Getting a Job Join professional organizations.",
        "Wherever you live, there are professional organizations that help unite and educate social workers, and set standards for social work as a profession.",
        "Identify the leading organizations in your country, and join them.",
        "The National Association of Social Work (NASW) is a leading American social work professional organization.",
        "It has a chapter in every state of the United States.",
        "Through the NASW, you’ll have access to continuing education and be able to attend annual and semiannual conferences.",
        "The British Association of Social Workers is much like the NASW.",
        "It holds yearly meetings and conferences.",
        "The Japanese Association of Certified Social Workers is similar to its American and British counterparts.",
        "Depending on your region, you may want to join other professional associations, too.",
        "Find employment with a governmental organization.",
        "The government is the primary source of employment for social workers.",
        "To find employment with the government, search job postings on local, state/provincial, and national websites.",
        "Visit usa.jobs.gov to search for social work jobs for the united states government.",
        "Visit your websites of your local and state/provincial government to look for social work jobs in your community.",
        "Work for a non-profit.",
        "Next to government jobs, non-profit organizations are the largest employers of social workers.",
        "While there are many opportunities to work for a non-profit, you’ll have to put in some time identifying those opportunities.",
        "Consider visiting popular online job websites, identify non-profits in your area, and look for jobs nationally..",
        "Fulfill continuing education requirements every year or two.",
        "After you have your first job, you’ll need to research whether your state/provincial government requires continuing education to maintain your license.",
        "If so, you’ll need to enroll in continuing education classes every one or two years.",
        "Contact your licensing authority about continuing education requirements, as they vary.",
        "Apply for supervisory jobs after you've gained experience.",
        "Once you’ve held an entry-level position for several years, you should consider applying for supervisory or management jobs.",
        "While these positions require more responsibility, they’ll also provide a higher salary."
    ]
}