{
    "title": "How to Listen to Your Local Air Traffic Control",
    "url": "https://www.wikihow.com/Listen-to-Your-Local-Air-Traffic-Control",
    "category_hierarchy": [
        "Computers and Electronics",
        "Consumer Electronics",
        "Communications Monitoring"
    ],
    "parts": [
        {
            "name": "Finding an Aviation Frequency",
            "steps": [
                {
                    "headline": "Find live frequencies.",
                    "description": "Obtain a radio scanner that is capable of receiving frequencies between 118.0 and 136.975 MHz. Good brands to check out include Uniden, and Whistler. You can also find general coverage receivers from Icom, Yaesu, Grundig, Kenwood and others that will pick up air frequencies. You're better off selecting a good scanner instead of a general coverage unit, thanks to the scanner's ability to easily monitor multiple frequencies. Realize that in radio electronics, you get what you pay for. A scanner from one of the aforementioned brands will outperform a no-name brand that claims airline coverage. Most scanners pick up the entirety of the aircraft band. You can also listen to air traffic control facilities from around the world at websites including liveatc.net, globalair.com, airnav.com and radioreference.com."
                },
                {
                    "headline": "Memorize some of the basic frequencies.",
                    "description": "121.5 is the emergency frequency. If there is some sort of emergency, pilots will transmit on it. You could also hear an emergency locator beacon on this frequency if a plane crashes. 122.750 MHz is the frequency for general aviation air to air communications\n123.025 MHz is the frequency for helicopters air to air communications\n123.450 MHz is the \"unofficial\" frequency for air to air communications\nSearch 122.0-123.65 for Unicom (uncontrolled airports) and air to air communications. Search 128.825-132.000 MHz for ARINC frequencies (airlines, corporate aviation and general aviation calling ahead for fuel, parking, and other requests)."
                }
            ]
        },
        {
            "name": "Reading Aeronautical Sectional Charts",
            "steps": [
                {
                    "headline": "Find an aeronautical sectional chart.",
                    "description": "You most likely want to be looking for a chart of your local area from the closest airport. Older versions of these charts will usually work just fine. Online sectional charts for your local area are available on www.skyvector.com"
                },
                {
                    "headline": "Find the closest airport on the chart.",
                    "description": "Airports are denoted by blue or magenta circles, with lines inside representing runways. Next to the circle is a block of text with the airport name and information about that airport. The control tower frequency is denoted by CT - 000.0, where the following numbers indicate the frequency used by ATC. For example, the frequency for Wittman Regional airport in Oshkosh, WI is CT - 118.5."
                },
                {
                    "headline": "Understanding the lingo.",
                    "description": "If the airport is uncontrolled (no tower) or the tower operates part time, a C in a circle after a frequency number will be used to denote a Common Traffic Advisory Frequency (CTAF). A star will be after the tower frequency to denote that airport as having a part time tower. At this type of airport, pilots communicate directly with one another and tell each other their position and intentions."
                },
                {
                    "headline": "Identifying the airports.",
                    "description": "All controlled airports will be denoted by blue circles, while uncontrolled airports are magenta. Airports with runways over 8,000 feet (2,438.4 m) are not enclosed in circles and simply have a diagram depicting the runway layout, which is outlined in blue (controlled) or magenta (uncontrolled)."
                },
                {
                    "headline": "Listen to weather forecasts and airport information as you prepare to land.",
                    "description": "Some airports have AWOS (Automated Weather Observing System), ASOS (Automated Surface Observing System), or ATIS (Automated Terminal Information Service) frequencies listed on the chart. These are automated or repeating broadcasts that provide pilots with weather and airport information as they prepare to land or depart."
                },
                {
                    "headline": "Obtain a complete list of frequencies.",
                    "description": "If you have access to an airport/facility directory, you can find more frequencies than those available on the chart. At larger airports, pilots receive their flight plan clearances from a \"clearance delivery\" frequency, communicate on taxiways with a \"ground\" frequency, and get takeoff and landing clearance from the \"tower\" frequency. Once pilots are airborne, they will talk to an \"approach/departure\" frequency, and once in route, they might even talk to a \"center\" frequency. If you are lucky or live close enough to an airport, you might be able to receive several of these frequencies."
                }
            ]
        },
        {
            "name": "Learning Pilot Lingo",
            "steps": [
                {
                    "headline": "Understand that a pilot starts with the aircraft ID number.",
                    "description": "If a controller gives a pilot an instruction, he or she will prefix it with the aircraft's identification number. For commercial flights, this will just be the flight number, such as United 2311. A smaller aircraft is identified by the number on their tail."
                },
                {
                    "headline": "Listen for instructions from the control tower.",
                    "description": "After the flight number, the controller will give an instruction such as \"enter downwind.\" This instructs the pilot to enter the traffic pattern at a specific location. The pilot will then read back the instruction, so the controller can verify that it was understood correctly."
                },
                {
                    "headline": "Be prepared to change your radio frequency.",
                    "description": "Sometimes, controllers will \"hand off\" a pilot to another frequency. An example would be a controller saying,  \"November-12345, contact Approach on 124.32, good day.\" Once again, the pilot will read back the instruction."
                },
                {
                    "headline": "Landing at an uncontrolled airports.",
                    "description": "Operations at uncontrolled airports are much less formal. Most of the time, pilots will broadcast blind transmissions to anyone on the frequency, announcing their position or intentions. Words like \"upwind, crosswind, downwind, base, and final\" denote specific positions in the traffic pattern."
                },
                {
                    "headline": "Learn the phonetic alphabet.",
                    "description": "Pilots and controllers use it to communicate letters, since they can often be confused. You might also hear someone use \"niner\" to communicate \"nine,\" \"fife\" to communicate \"five,\" or \"tree\" to communicate \"three.\""
                }
            ]
        }
    ],
    "tyn": [
        "Scanner capable of receiving frequencies between 118.0 and 139.985 MHz",
        "Aeronautical Chart or Airport/Facility Directory of your area to find the local frequency used by ATC."
    ],
    "text": " Finding an Aviation Frequency Find live frequencies. Obtain a radio scanner that is capable of receiving frequencies between 118.0 and 136.975 MHz. Good brands to check out include Uniden, and Whistler. You can also find general coverage receivers from Icom, Yaesu, Grundig, Kenwood and others that will pick up air frequencies. You're better off selecting a good scanner instead of a general coverage unit, thanks to the scanner's ability to easily monitor multiple frequencies. Realize that in radio electronics, you get what you pay for. A scanner from one of the aforementioned brands will outperform a no-name brand that claims airline coverage. Most scanners pick up the entirety of the aircraft band. You can also listen to air traffic control facilities from around the world at websites including liveatc.net, globalair.com, airnav.com and radioreference.com. Memorize some of the basic frequencies. 121.5 is the emergency frequency. If there is some sort of emergency, pilots will transmit on it. You could also hear an emergency locator beacon on this frequency if a plane crashes. 122.750 MHz is the frequency for general aviation air to air communications\n123.025 MHz is the frequency for helicopters air to air communications\n123.450 MHz is the \"unofficial\" frequency for air to air communications\nSearch 122.0-123.65 for Unicom (uncontrolled airports) and air to air communications. Search 128.825-132.000 MHz for ARINC frequencies (airlines, corporate aviation and general aviation calling ahead for fuel, parking, and other requests). Reading Aeronautical Sectional Charts Find an aeronautical sectional chart. You most likely want to be looking for a chart of your local area from the closest airport. Older versions of these charts will usually work just fine. Online sectional charts for your local area are available on www.skyvector.com Find the closest airport on the chart. Airports are denoted by blue or magenta circles, with lines inside representing runways. Next to the circle is a block of text with the airport name and information about that airport. The control tower frequency is denoted by CT - 000.0, where the following numbers indicate the frequency used by ATC. For example, the frequency for Wittman Regional airport in Oshkosh, WI is CT - 118.5. Understanding the lingo. If the airport is uncontrolled (no tower) or the tower operates part time, a C in a circle after a frequency number will be used to denote a Common Traffic Advisory Frequency (CTAF). A star will be after the tower frequency to denote that airport as having a part time tower. At this type of airport, pilots communicate directly with one another and tell each other their position and intentions. Identifying the airports. All controlled airports will be denoted by blue circles, while uncontrolled airports are magenta. Airports with runways over 8,000 feet (2,438.4 m) are not enclosed in circles and simply have a diagram depicting the runway layout, which is outlined in blue (controlled) or magenta (uncontrolled). Listen to weather forecasts and airport information as you prepare to land. Some airports have AWOS (Automated Weather Observing System), ASOS (Automated Surface Observing System), or ATIS (Automated Terminal Information Service) frequencies listed on the chart. These are automated or repeating broadcasts that provide pilots with weather and airport information as they prepare to land or depart. Obtain a complete list of frequencies. If you have access to an airport/facility directory, you can find more frequencies than those available on the chart. At larger airports, pilots receive their flight plan clearances from a \"clearance delivery\" frequency, communicate on taxiways with a \"ground\" frequency, and get takeoff and landing clearance from the \"tower\" frequency. Once pilots are airborne, they will talk to an \"approach/departure\" frequency, and once in route, they might even talk to a \"center\" frequency. If you are lucky or live close enough to an airport, you might be able to receive several of these frequencies. Learning Pilot Lingo Understand that a pilot starts with the aircraft ID number. If a controller gives a pilot an instruction, he or she will prefix it with the aircraft's identification number. For commercial flights, this will just be the flight number, such as United 2311. A smaller aircraft is identified by the number on their tail. Listen for instructions from the control tower. After the flight number, the controller will give an instruction such as \"enter downwind.\" This instructs the pilot to enter the traffic pattern at a specific location. The pilot will then read back the instruction, so the controller can verify that it was understood correctly. Be prepared to change your radio frequency. Sometimes, controllers will \"hand off\" a pilot to another frequency. An example would be a controller saying,  \"November-12345, contact Approach on 124.32, good day.\" Once again, the pilot will read back the instruction. Landing at an uncontrolled airports. Operations at uncontrolled airports are much less formal. Most of the time, pilots will broadcast blind transmissions to anyone on the frequency, announcing their position or intentions. Words like \"upwind, crosswind, downwind, base, and final\" denote specific positions in the traffic pattern. Learn the phonetic alphabet. Pilots and controllers use it to communicate letters, since they can often be confused. You might also hear someone use \"niner\" to communicate \"nine,\" \"fife\" to communicate \"five,\" or \"tree\" to communicate \"three.\"",
    "sentences": [
        " Finding an Aviation Frequency Find live frequencies.",
        "Obtain a radio scanner that is capable of receiving frequencies between 118.0 and 136.975 MHz.",
        "Good brands to check out include Uniden, and Whistler.",
        "You can also find general coverage receivers from Icom, Yaesu, Grundig, Kenwood and others that will pick up air frequencies.",
        "You're better off selecting a good scanner instead of a general coverage unit, thanks to the scanner's ability to easily monitor multiple frequencies.",
        "Realize that in radio electronics, you get what you pay for.",
        "A scanner from one of the aforementioned brands will outperform a no-name brand that claims airline coverage.",
        "Most scanners pick up the entirety of the aircraft band.",
        "You can also listen to air traffic control facilities from around the world at websites including liveatc.net, globalair.com, airnav.com and radioreference.com.",
        "Memorize some of the basic frequencies.",
        "121.5 is the emergency frequency.",
        "If there is some sort of emergency, pilots will transmit on it.",
        "You could also hear an emergency locator beacon on this frequency if a plane crashes.",
        "122.750 MHz is the frequency for general aviation air to air communications\n123.025 MHz is the frequency for helicopters air to air communications\n123.450 MHz is the \"unofficial\" frequency for air to air communications\nSearch 122.0-123.65 for Unicom (uncontrolled airports) and air to air communications.",
        "Search 128.825-132.000 MHz for ARINC frequencies (airlines, corporate aviation and general aviation calling ahead for fuel, parking, and other requests).",
        "Reading Aeronautical Sectional Charts Find an aeronautical sectional chart.",
        "You most likely want to be looking for a chart of your local area from the closest airport.",
        "Older versions of these charts will usually work just fine.",
        "Online sectional charts for your local area are available on www.skyvector.com Find the closest airport on the chart.",
        "Airports are denoted by blue or magenta circles, with lines inside representing runways.",
        "Next to the circle is a block of text with the airport name and information about that airport.",
        "The control tower frequency is denoted by CT - 000.0, where the following numbers indicate the frequency used by ATC.",
        "For example, the frequency for Wittman Regional airport in Oshkosh, WI is CT - 118.5.",
        "Understanding the lingo.",
        "If the airport is uncontrolled (no tower) or the tower operates part time, a C in a circle after a frequency number will be used to denote a Common Traffic Advisory Frequency (CTAF).",
        "A star will be after the tower frequency to denote that airport as having a part time tower.",
        "At this type of airport, pilots communicate directly with one another and tell each other their position and intentions.",
        "Identifying the airports.",
        "All controlled airports will be denoted by blue circles, while uncontrolled airports are magenta.",
        "Airports with runways over 8,000 feet (2,438.4 m) are not enclosed in circles and simply have a diagram depicting the runway layout, which is outlined in blue (controlled) or magenta (uncontrolled).",
        "Listen to weather forecasts and airport information as you prepare to land.",
        "Some airports have AWOS (Automated Weather Observing System), ASOS (Automated Surface Observing System), or ATIS (Automated Terminal Information Service) frequencies listed on the chart.",
        "These are automated or repeating broadcasts that provide pilots with weather and airport information as they prepare to land or depart.",
        "Obtain a complete list of frequencies.",
        "If you have access to an airport/facility directory, you can find more frequencies than those available on the chart.",
        "At larger airports, pilots receive their flight plan clearances from a \"clearance delivery\" frequency, communicate on taxiways with a \"ground\" frequency, and get takeoff and landing clearance from the \"tower\" frequency.",
        "Once pilots are airborne, they will talk to an \"approach/departure\" frequency, and once in route, they might even talk to a \"center\" frequency.",
        "If you are lucky or live close enough to an airport, you might be able to receive several of these frequencies.",
        "Learning Pilot Lingo Understand that a pilot starts with the aircraft ID number.",
        "If a controller gives a pilot an instruction, he or she will prefix it with the aircraft's identification number.",
        "For commercial flights, this will just be the flight number, such as United 2311.",
        "A smaller aircraft is identified by the number on their tail.",
        "Listen for instructions from the control tower.",
        "After the flight number, the controller will give an instruction such as \"enter downwind.\"",
        "This instructs the pilot to enter the traffic pattern at a specific location.",
        "The pilot will then read back the instruction, so the controller can verify that it was understood correctly.",
        "Be prepared to change your radio frequency.",
        "Sometimes, controllers will \"hand off\" a pilot to another frequency.",
        "An example would be a controller saying,  \"November-12345, contact Approach on 124.32, good day.\"",
        "Once again, the pilot will read back the instruction.",
        "Landing at an uncontrolled airports.",
        "Operations at uncontrolled airports are much less formal.",
        "Most of the time, pilots will broadcast blind transmissions to anyone on the frequency, announcing their position or intentions.",
        "Words like \"upwind, crosswind, downwind, base, and final\" denote specific positions in the traffic pattern.",
        "Learn the phonetic alphabet.",
        "Pilots and controllers use it to communicate letters, since they can often be confused.",
        "You might also hear someone use \"niner\" to communicate \"nine,\" \"fife\" to communicate \"five,\" or \"tree\" to communicate \"three.\""
    ]
}