{
    "title": "How to Dress in the American 1980s Fashion",
    "url": "https://www.wikihow.com/Dress-in-the-American-1980s-Fashion",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Costumes",
        "Historical Costumes",
        "American History Costumes"
    ],
    "methods": [
        {
            "name": "For Women",
            "steps": [
                {
                    "headline": "Find a blouse or suit jacket with thick shoulder pads.",
                    "description": "Big shoulders became a hot fashion as more women found themselves entering the workplace. A square-cut suit jacket with heavy shoulder pads looks 1980s-professional, while a blouse or dress with thick shoulder pads works well for more casual looks."
                },
                {
                    "headline": "Try an oversized top.",
                    "description": "If shoulder pads aren't your thing, consider an oversized sweater, sweatshirt, or blouse. Look for one with a broad scoop neckline. Solid colors work best, but you may also consider a top with a gaudy geometric pattern."
                },
                {
                    "headline": "Wear a mini-skirt.",
                    "description": "Denim mini-skirts work especially well, but leather and knit materials may also look fine. If selecting a colored skirt, go with a hot pink or other bright, neon color."
                },
                {
                    "headline": "Throw on leggings or decorative stockings.",
                    "description": "These work especially well beneath mini-skirts and oversized sweaters that come down to the mid-thigh or lower. Look for solid colors or patterned tights with spots, stripes, textured lace, or other embroidered designs."
                },
                {
                    "headline": "Look for stirrup pants.",
                    "description": "These pants are made of a stretch knit fabric that tapers down toward the ankle. At the ankle, the pants have an elastic \"stirrup\" strap that fits under the heel. Choose a pair in any color or pattern, from black to neon orange."
                },
                {
                    "headline": "Consider acid-wash jeans.",
                    "description": "Look for an old pair with bleach marks or holes. Cut-offs with ragged edges also look appropriate for a classic 1980s look."
                },
                {
                    "headline": "Remember to wear your leg warmers.",
                    "description": "This trend was especially popular in the early to mid decade. In the 1980s, leg warmers could be found in wool, cotton, and synthetic fiber blends. They came in a variety of colors, with brighter colors favored over duller, neutral hues. Wear leg warmers with nearly any bottom, whether you choose a mini-skirt or skinny jeans."
                },
                {
                    "headline": "Wear “jellies.” Jellies, also called “jelly shoes,” were a type of brightly colored footwear made from PVC plastic.",
                    "description": "The shoes have a semi-transparent, glossy sheen, and were often infused with glitter. Most jellies were flats, but some had low heels."
                },
                {
                    "headline": "Wear the right heels.",
                    "description": "Adult women wore heels with the majority of their outfits, whether professional or casual. Select a pair of pointed toe sling-backs with a high, slender heel. Go with white or black for a versatile option, or consider a bright yellow or pink if you want to play on the loud, neon-colored reputation of American 1980s fashion."
                },
                {
                    "headline": "Wear sneakers or boots.",
                    "description": "In addition to heels and jellies, teenagers and young women also wore sneakers and boots with many of their outfits. Consider a pair of thick-soled, black lace-up boots. Wear the boots with nearly any bottom, from mini-skirts to acid wash-jeans."
                },
                {
                    "headline": "Throw on your largest pair of earrings.",
                    "description": "In general, popular jewelry during this decade was gaudy and large. Earrings were especially in vogue, however. Look for diamante or pearl earrings, preferably in gold. Dangle earrings that brush your shoulder or collar work best."
                },
                {
                    "headline": "Tease your hair.",
                    "description": "No American 1980s look would be complete without big, teased locks. Take a section of your hair by the crown of your head. Comb downward toward the scalp in short strokes. Spray hairspray near the roots of the section you just teased. Repeat the initial teasing process with a section of hair beneath the first section to give your hair a bump. Repeat the entire teasing process with the rest of your hair."
                },
                {
                    "headline": "Use make-up to accentuate your cheeks and eyes.",
                    "description": "Do not be afraid of over-applying. Cosmetics in the 1980s were notoriously noticeable. Trace around your entire eye with black eye liner. Apply mascara. Wear bright eye shadow. Choose a bold color and consider wearing contrasting shades at the same time. Apply heavy blush to your cheekbones."
                }
            ]
        },
        {
            "name": "For Men",
            "steps": [
                {
                    "headline": "Wear a sweater or shirt with a bold pattern.",
                    "description": "Think bold geometric designs for sweaters or Hawaiian print for shirts. Look for a thick sweater with a bulky, boxy cut."
                },
                {
                    "headline": "Throw on a Members Only jacket.",
                    "description": "Authentic jackets had a black tag over the breast pocket that read \"Members Only,\" but if you cannot find an authentic jacket, simply mimic the style. Look for a cotton-polyester jacket with a nylon lining, elastic waistband, elastic wrists, a zipper front, and snaps at the neck. Choose a coat in any color."
                },
                {
                    "headline": "Look for snug jeans.",
                    "description": "Light acid wash jeans work best. Find a style that fits snug around your legs, since men in tight jeans were more fashionable during this decade than those in baggy jeans."
                },
                {
                    "headline": "Consider a pair of parachute pants.",
                    "description": "In the early 1980s, these pants were tighter, but by the end of the decade, they were exceptionally baggy. Look for a pair of pants made from shiny synthetic material. If possible, find one with multiple zippers, since these were considered more stylish."
                },
                {
                    "headline": "Try on a pastel suit.",
                    "description": "If you want a more professional look, go for a conservative cut suit jacket in a pastel blue or other light color. Pair the jacket with white pants. This look is also known as the \"Miami Vice\" look."
                },
                {
                    "headline": "Wear loafers.",
                    "description": "Loafers work best when paired with pastel suit jackets and other conservative styles."
                },
                {
                    "headline": "Wear heavy sneakers or boots.",
                    "description": "If you decide to go with acid wash jeans or parachute pants, find a heavy pair of sneakers or boots. Consider thick-soled black boots that lace up."
                },
                {
                    "headline": "Add volume to your hair.",
                    "description": "Run a volume-enhancing hair product through your hair to give it a little extra lift. Keep your locks in place with hair gel or hairspray."
                }
            ]
        }
    ],
    "tyn": [
        "Shoulder padded jacket",
        "Oversized sweater",
        "Cotton-polyester jacket",
        "Pastel suit jacket",
        "Mini-skirt",
        "Leggings",
        "Stirrup pants",
        "Acid-wash jeans",
        "Parachute pants",
        "Leg warmers",
        "Jelly shoes",
        "Heels",
        "Boots",
        "Dangling earrings",
        "Hairspray",
        "Cosmetics"
    ],
    "text": " For Women Find a blouse or suit jacket with thick shoulder pads. Big shoulders became a hot fashion as more women found themselves entering the workplace. A square-cut suit jacket with heavy shoulder pads looks 1980s-professional, while a blouse or dress with thick shoulder pads works well for more casual looks. Try an oversized top. If shoulder pads aren't your thing, consider an oversized sweater, sweatshirt, or blouse. Look for one with a broad scoop neckline. Solid colors work best, but you may also consider a top with a gaudy geometric pattern. Wear a mini-skirt. Denim mini-skirts work especially well, but leather and knit materials may also look fine. If selecting a colored skirt, go with a hot pink or other bright, neon color. Throw on leggings or decorative stockings. These work especially well beneath mini-skirts and oversized sweaters that come down to the mid-thigh or lower. Look for solid colors or patterned tights with spots, stripes, textured lace, or other embroidered designs. Look for stirrup pants. These pants are made of a stretch knit fabric that tapers down toward the ankle. At the ankle, the pants have an elastic \"stirrup\" strap that fits under the heel. Choose a pair in any color or pattern, from black to neon orange. Consider acid-wash jeans. Look for an old pair with bleach marks or holes. Cut-offs with ragged edges also look appropriate for a classic 1980s look. Remember to wear your leg warmers. This trend was especially popular in the early to mid decade. In the 1980s, leg warmers could be found in wool, cotton, and synthetic fiber blends. They came in a variety of colors, with brighter colors favored over duller, neutral hues. Wear leg warmers with nearly any bottom, whether you choose a mini-skirt or skinny jeans. Wear “jellies.” Jellies, also called “jelly shoes,” were a type of brightly colored footwear made from PVC plastic. The shoes have a semi-transparent, glossy sheen, and were often infused with glitter. Most jellies were flats, but some had low heels. Wear the right heels. Adult women wore heels with the majority of their outfits, whether professional or casual. Select a pair of pointed toe sling-backs with a high, slender heel. Go with white or black for a versatile option, or consider a bright yellow or pink if you want to play on the loud, neon-colored reputation of American 1980s fashion. Wear sneakers or boots. In addition to heels and jellies, teenagers and young women also wore sneakers and boots with many of their outfits. Consider a pair of thick-soled, black lace-up boots. Wear the boots with nearly any bottom, from mini-skirts to acid wash-jeans. Throw on your largest pair of earrings. In general, popular jewelry during this decade was gaudy and large. Earrings were especially in vogue, however. Look for diamante or pearl earrings, preferably in gold. Dangle earrings that brush your shoulder or collar work best. Tease your hair. No American 1980s look would be complete without big, teased locks. Take a section of your hair by the crown of your head. Comb downward toward the scalp in short strokes. Spray hairspray near the roots of the section you just teased. Repeat the initial teasing process with a section of hair beneath the first section to give your hair a bump. Repeat the entire teasing process with the rest of your hair. Use make-up to accentuate your cheeks and eyes. Do not be afraid of over-applying. Cosmetics in the 1980s were notoriously noticeable. Trace around your entire eye with black eye liner. Apply mascara. Wear bright eye shadow. Choose a bold color and consider wearing contrasting shades at the same time. Apply heavy blush to your cheekbones. For Men Wear a sweater or shirt with a bold pattern. Think bold geometric designs for sweaters or Hawaiian print for shirts. Look for a thick sweater with a bulky, boxy cut. Throw on a Members Only jacket. Authentic jackets had a black tag over the breast pocket that read \"Members Only,\" but if you cannot find an authentic jacket, simply mimic the style. Look for a cotton-polyester jacket with a nylon lining, elastic waistband, elastic wrists, a zipper front, and snaps at the neck. Choose a coat in any color. Look for snug jeans. Light acid wash jeans work best. Find a style that fits snug around your legs, since men in tight jeans were more fashionable during this decade than those in baggy jeans. Consider a pair of parachute pants. In the early 1980s, these pants were tighter, but by the end of the decade, they were exceptionally baggy. Look for a pair of pants made from shiny synthetic material. If possible, find one with multiple zippers, since these were considered more stylish. Try on a pastel suit. If you want a more professional look, go for a conservative cut suit jacket in a pastel blue or other light color. Pair the jacket with white pants. This look is also known as the \"Miami Vice\" look. Wear loafers. Loafers work best when paired with pastel suit jackets and other conservative styles. Wear heavy sneakers or boots. If you decide to go with acid wash jeans or parachute pants, find a heavy pair of sneakers or boots. Consider thick-soled black boots that lace up. Add volume to your hair. Run a volume-enhancing hair product through your hair to give it a little extra lift. Keep your locks in place with hair gel or hairspray.",
    "sentences": [
        " For Women Find a blouse or suit jacket with thick shoulder pads.",
        "Big shoulders became a hot fashion as more women found themselves entering the workplace.",
        "A square-cut suit jacket with heavy shoulder pads looks 1980s-professional, while a blouse or dress with thick shoulder pads works well for more casual looks.",
        "Try an oversized top.",
        "If shoulder pads aren't your thing, consider an oversized sweater, sweatshirt, or blouse.",
        "Look for one with a broad scoop neckline.",
        "Solid colors work best, but you may also consider a top with a gaudy geometric pattern.",
        "Wear a mini-skirt.",
        "Denim mini-skirts work especially well, but leather and knit materials may also look fine.",
        "If selecting a colored skirt, go with a hot pink or other bright, neon color.",
        "Throw on leggings or decorative stockings.",
        "These work especially well beneath mini-skirts and oversized sweaters that come down to the mid-thigh or lower.",
        "Look for solid colors or patterned tights with spots, stripes, textured lace, or other embroidered designs.",
        "Look for stirrup pants.",
        "These pants are made of a stretch knit fabric that tapers down toward the ankle.",
        "At the ankle, the pants have an elastic \"stirrup\" strap that fits under the heel.",
        "Choose a pair in any color or pattern, from black to neon orange.",
        "Consider acid-wash jeans.",
        "Look for an old pair with bleach marks or holes.",
        "Cut-offs with ragged edges also look appropriate for a classic 1980s look.",
        "Remember to wear your leg warmers.",
        "This trend was especially popular in the early to mid decade.",
        "In the 1980s, leg warmers could be found in wool, cotton, and synthetic fiber blends.",
        "They came in a variety of colors, with brighter colors favored over duller, neutral hues.",
        "Wear leg warmers with nearly any bottom, whether you choose a mini-skirt or skinny jeans.",
        "Wear “jellies.” Jellies, also called “jelly shoes,” were a type of brightly colored footwear made from PVC plastic.",
        "The shoes have a semi-transparent, glossy sheen, and were often infused with glitter.",
        "Most jellies were flats, but some had low heels.",
        "Wear the right heels.",
        "Adult women wore heels with the majority of their outfits, whether professional or casual.",
        "Select a pair of pointed toe sling-backs with a high, slender heel.",
        "Go with white or black for a versatile option, or consider a bright yellow or pink if you want to play on the loud, neon-colored reputation of American 1980s fashion.",
        "Wear sneakers or boots.",
        "In addition to heels and jellies, teenagers and young women also wore sneakers and boots with many of their outfits.",
        "Consider a pair of thick-soled, black lace-up boots.",
        "Wear the boots with nearly any bottom, from mini-skirts to acid wash-jeans.",
        "Throw on your largest pair of earrings.",
        "In general, popular jewelry during this decade was gaudy and large.",
        "Earrings were especially in vogue, however.",
        "Look for diamante or pearl earrings, preferably in gold.",
        "Dangle earrings that brush your shoulder or collar work best.",
        "Tease your hair.",
        "No American 1980s look would be complete without big, teased locks.",
        "Take a section of your hair by the crown of your head.",
        "Comb downward toward the scalp in short strokes.",
        "Spray hairspray near the roots of the section you just teased.",
        "Repeat the initial teasing process with a section of hair beneath the first section to give your hair a bump.",
        "Repeat the entire teasing process with the rest of your hair.",
        "Use make-up to accentuate your cheeks and eyes.",
        "Do not be afraid of over-applying.",
        "Cosmetics in the 1980s were notoriously noticeable.",
        "Trace around your entire eye with black eye liner.",
        "Apply mascara.",
        "Wear bright eye shadow.",
        "Choose a bold color and consider wearing contrasting shades at the same time.",
        "Apply heavy blush to your cheekbones.",
        "For Men Wear a sweater or shirt with a bold pattern.",
        "Think bold geometric designs for sweaters or Hawaiian print for shirts.",
        "Look for a thick sweater with a bulky, boxy cut.",
        "Throw on a Members Only jacket.",
        "Authentic jackets had a black tag over the breast pocket that read \"Members Only,\" but if you cannot find an authentic jacket, simply mimic the style.",
        "Look for a cotton-polyester jacket with a nylon lining, elastic waistband, elastic wrists, a zipper front, and snaps at the neck.",
        "Choose a coat in any color.",
        "Look for snug jeans.",
        "Light acid wash jeans work best.",
        "Find a style that fits snug around your legs, since men in tight jeans were more fashionable during this decade than those in baggy jeans.",
        "Consider a pair of parachute pants.",
        "In the early 1980s, these pants were tighter, but by the end of the decade, they were exceptionally baggy.",
        "Look for a pair of pants made from shiny synthetic material.",
        "If possible, find one with multiple zippers, since these were considered more stylish.",
        "Try on a pastel suit.",
        "If you want a more professional look, go for a conservative cut suit jacket in a pastel blue or other light color.",
        "Pair the jacket with white pants.",
        "This look is also known as the \"Miami Vice\" look.",
        "Wear loafers.",
        "Loafers work best when paired with pastel suit jackets and other conservative styles.",
        "Wear heavy sneakers or boots.",
        "If you decide to go with acid wash jeans or parachute pants, find a heavy pair of sneakers or boots.",
        "Consider thick-soled black boots that lace up.",
        "Add volume to your hair.",
        "Run a volume-enhancing hair product through your hair to give it a little extra lift.",
        "Keep your locks in place with hair gel or hairspray."
    ]
}