{
    "title": "How to Make Folded Ribbon Roses",
    "url": "https://www.wikihow.com/Make-Folded-Ribbon-Roses",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening"
    ],
    "parts": [
        {
            "name": "Folding the Ribbon",
            "steps": [
                {
                    "headline": "Cut 11.8 inches (30 cm) of ribbon for each rose you plan to make.",
                    "description": "You can use any width of ribbon you’d like. 0.4 cm (4 mm) ribbon is standard, 0.7 cm (7mm) ribbon creates large roses, and 0.2 cm (2 mm) creates very small roses. Any color of ribbon is okay to use. Cut roughly 11.8 inches (30 cm) of ribbon for each rose. Cut multiple ribbons of the same length if you plan to create several roses."
                },
                {
                    "headline": "Hold the center of the ribbon.",
                    "description": "Then, fold the ribbon to form a V-shape. This will create a vertical angle. The tip of the V-shape should be pointing away from you."
                },
                {
                    "headline": "Fold the left side of the ribbon.",
                    "description": "Hold the left side of the ribbon, and fold it over the right side of the ribbon. This part of the ribbon will overlap the folded V-shaped part of the ribbon. The tip of the V-shape should be doubled over with the folded ribbon, and the two, longer sides should still be a single layer of ribbon."
                },
                {
                    "headline": "Fold the ribbon downwards.",
                    "description": "Hold and fold the tip of the ribbon downwards towards the end of the left side of the ribbon. Overlap the tip of the V-shape that already has layers. Continue to overlap down to the tip of the ribbon. Repeat until you’ve reached near the end of the ribbon. Then, fold again downwards towards the end of the right side of the ribbon."
                },
                {
                    "headline": "Hold the rose tightly by the end of the ribbon.",
                    "description": "Do this when you’ve neared the end of the ribbon. Then, gently pull the shortest ribbon left. Pull the ribbon until you a see a rose forming. Look down onto the ribbon to see if the shape resembles a rose. Unfold the ribbon and start again if you don’t get the desired result the first time."
                }
            ]
        },
        {
            "name": "Securing the Ribbon Rose",
            "steps": [
                {
                    "headline": "Tape the ribbon in place.",
                    "description": "Once your rose has been formed, you will need to secure it. A simple option is to tape the ribbon. Use a small piece of regular, clear tape. Attach the loose ribbon to the bottom of the rose. Make sure it is in place before letting go or you may lose the shape of the rose."
                },
                {
                    "headline": "Sew the ribbon in place.",
                    "description": "If you don’t think tape is strong enough, it’s also an option to sew the ribbon in place. Choose a color of thread that is close to the color of ribbon you’ve chosen. Sew the loose, remaining thread to the bottom of the rose."
                },
                {
                    "headline": "Glue the ribbon in place.",
                    "description": "An easy and secure option is to glue the ribbon in place. Choose a strong glue, like hot glue or super glue, that will dry clear. Then, add a small dab of glue to the underside of the loose ribbon. Attach the loose ribbon to the bottom of the rose. Hold the ribbon in place until dry."
                }
            ]
        },
        {
            "name": "Using the Ribbon Rose",
            "steps": [
                {
                    "headline": "Make a bouquet of ribbon roses.",
                    "description": "Real roses are beautiful but die very quickly. Create a lasting bouquet by using silk roses. Find fake stems at a hobby store, and glue a ribbon rose to each stem. Then, combine the roses. Tie them with a ribbon, or put them into a vase."
                },
                {
                    "headline": "Glue or pin the roses to an item of clothing.",
                    "description": "Add a floral touch to an item of clothing by adding a ribbon rose. One option is to use a rose as a brooch. You can also add a ribbon rose to accessories, such as hats and shoes. Be sure to attach the rose with a pin, and don’t attach with more permanent methods (such as glue or sewing) unless you want the ribbon rose to be a lasting decoration."
                },
                {
                    "headline": "Decorate a party with the roses.",
                    "description": "Ribbons roses would make a beautiful decoration for a party, such as a wedding, baby shower, or Easter gathering. You can put ribbon roses on top of tables, attach them to baskets, or sew them into a wreath. Making many ribbon roses could be time consuming, so it is ideal to have help if you’re making them for decorative purposes. You can use the roses as a permanent decoration in any room—such as the living room or your bedroom."
                },
                {
                    "headline": "Top a gift with the rose.",
                    "description": "Ribbons are often used to top gift boxes. A lovely use for your rose ribbon would be to use it to top a gift box. You can top the box with multiple ribbons if you made more than one. Just be sure that the rose is secured on the box with tape or glue."
                }
            ]
        }
    ],
    "tyn": [
        "A few ribbons",
        "Tape",
        "Glue",
        "Needle",
        "Thread"
    ],
    "text": " Folding the Ribbon Cut 11.8 inches (30 cm) of ribbon for each rose you plan to make. You can use any width of ribbon you’d like. 0.4 cm (4 mm) ribbon is standard, 0.7 cm (7mm) ribbon creates large roses, and 0.2 cm (2 mm) creates very small roses. Any color of ribbon is okay to use. Cut roughly 11.8 inches (30 cm) of ribbon for each rose. Cut multiple ribbons of the same length if you plan to create several roses. Hold the center of the ribbon. Then, fold the ribbon to form a V-shape. This will create a vertical angle. The tip of the V-shape should be pointing away from you. Fold the left side of the ribbon. Hold the left side of the ribbon, and fold it over the right side of the ribbon. This part of the ribbon will overlap the folded V-shaped part of the ribbon. The tip of the V-shape should be doubled over with the folded ribbon, and the two, longer sides should still be a single layer of ribbon. Fold the ribbon downwards. Hold and fold the tip of the ribbon downwards towards the end of the left side of the ribbon. Overlap the tip of the V-shape that already has layers. Continue to overlap down to the tip of the ribbon. Repeat until you’ve reached near the end of the ribbon. Then, fold again downwards towards the end of the right side of the ribbon. Hold the rose tightly by the end of the ribbon. Do this when you’ve neared the end of the ribbon. Then, gently pull the shortest ribbon left. Pull the ribbon until you a see a rose forming. Look down onto the ribbon to see if the shape resembles a rose. Unfold the ribbon and start again if you don’t get the desired result the first time. Securing the Ribbon Rose Tape the ribbon in place. Once your rose has been formed, you will need to secure it. A simple option is to tape the ribbon. Use a small piece of regular, clear tape. Attach the loose ribbon to the bottom of the rose. Make sure it is in place before letting go or you may lose the shape of the rose. Sew the ribbon in place. If you don’t think tape is strong enough, it’s also an option to sew the ribbon in place. Choose a color of thread that is close to the color of ribbon you’ve chosen. Sew the loose, remaining thread to the bottom of the rose. Glue the ribbon in place. An easy and secure option is to glue the ribbon in place. Choose a strong glue, like hot glue or super glue, that will dry clear. Then, add a small dab of glue to the underside of the loose ribbon. Attach the loose ribbon to the bottom of the rose. Hold the ribbon in place until dry. Using the Ribbon Rose Make a bouquet of ribbon roses. Real roses are beautiful but die very quickly. Create a lasting bouquet by using silk roses. Find fake stems at a hobby store, and glue a ribbon rose to each stem. Then, combine the roses. Tie them with a ribbon, or put them into a vase. Glue or pin the roses to an item of clothing. Add a floral touch to an item of clothing by adding a ribbon rose. One option is to use a rose as a brooch. You can also add a ribbon rose to accessories, such as hats and shoes. Be sure to attach the rose with a pin, and don’t attach with more permanent methods (such as glue or sewing) unless you want the ribbon rose to be a lasting decoration. Decorate a party with the roses. Ribbons roses would make a beautiful decoration for a party, such as a wedding, baby shower, or Easter gathering. You can put ribbon roses on top of tables, attach them to baskets, or sew them into a wreath. Making many ribbon roses could be time consuming, so it is ideal to have help if you’re making them for decorative purposes. You can use the roses as a permanent decoration in any room—such as the living room or your bedroom. Top a gift with the rose. Ribbons are often used to top gift boxes. A lovely use for your rose ribbon would be to use it to top a gift box. You can top the box with multiple ribbons if you made more than one. Just be sure that the rose is secured on the box with tape or glue.",
    "sentences": [
        " Folding the Ribbon Cut 11.8 inches (30 cm) of ribbon for each rose you plan to make.",
        "You can use any width of ribbon you’d like.",
        "0.4 cm (4 mm) ribbon is standard, 0.7 cm (7mm) ribbon creates large roses, and 0.2 cm (2 mm) creates very small roses.",
        "Any color of ribbon is okay to use.",
        "Cut roughly 11.8 inches (30 cm) of ribbon for each rose.",
        "Cut multiple ribbons of the same length if you plan to create several roses.",
        "Hold the center of the ribbon.",
        "Then, fold the ribbon to form a V-shape.",
        "This will create a vertical angle.",
        "The tip of the V-shape should be pointing away from you.",
        "Fold the left side of the ribbon.",
        "Hold the left side of the ribbon, and fold it over the right side of the ribbon.",
        "This part of the ribbon will overlap the folded V-shaped part of the ribbon.",
        "The tip of the V-shape should be doubled over with the folded ribbon, and the two, longer sides should still be a single layer of ribbon.",
        "Fold the ribbon downwards.",
        "Hold and fold the tip of the ribbon downwards towards the end of the left side of the ribbon.",
        "Overlap the tip of the V-shape that already has layers.",
        "Continue to overlap down to the tip of the ribbon.",
        "Repeat until you’ve reached near the end of the ribbon.",
        "Then, fold again downwards towards the end of the right side of the ribbon.",
        "Hold the rose tightly by the end of the ribbon.",
        "Do this when you’ve neared the end of the ribbon.",
        "Then, gently pull the shortest ribbon left.",
        "Pull the ribbon until you a see a rose forming.",
        "Look down onto the ribbon to see if the shape resembles a rose.",
        "Unfold the ribbon and start again if you don’t get the desired result the first time.",
        "Securing the Ribbon Rose Tape the ribbon in place.",
        "Once your rose has been formed, you will need to secure it.",
        "A simple option is to tape the ribbon.",
        "Use a small piece of regular, clear tape.",
        "Attach the loose ribbon to the bottom of the rose.",
        "Make sure it is in place before letting go or you may lose the shape of the rose.",
        "Sew the ribbon in place.",
        "If you don’t think tape is strong enough, it’s also an option to sew the ribbon in place.",
        "Choose a color of thread that is close to the color of ribbon you’ve chosen.",
        "Sew the loose, remaining thread to the bottom of the rose.",
        "Glue the ribbon in place.",
        "An easy and secure option is to glue the ribbon in place.",
        "Choose a strong glue, like hot glue or super glue, that will dry clear.",
        "Then, add a small dab of glue to the underside of the loose ribbon.",
        "Attach the loose ribbon to the bottom of the rose.",
        "Hold the ribbon in place until dry.",
        "Using the Ribbon Rose Make a bouquet of ribbon roses.",
        "Real roses are beautiful but die very quickly.",
        "Create a lasting bouquet by using silk roses.",
        "Find fake stems at a hobby store, and glue a ribbon rose to each stem.",
        "Then, combine the roses.",
        "Tie them with a ribbon, or put them into a vase.",
        "Glue or pin the roses to an item of clothing.",
        "Add a floral touch to an item of clothing by adding a ribbon rose.",
        "One option is to use a rose as a brooch.",
        "You can also add a ribbon rose to accessories, such as hats and shoes.",
        "Be sure to attach the rose with a pin, and don’t attach with more permanent methods (such as glue or sewing) unless you want the ribbon rose to be a lasting decoration.",
        "Decorate a party with the roses.",
        "Ribbons roses would make a beautiful decoration for a party, such as a wedding, baby shower, or Easter gathering.",
        "You can put ribbon roses on top of tables, attach them to baskets, or sew them into a wreath.",
        "Making many ribbon roses could be time consuming, so it is ideal to have help if you’re making them for decorative purposes.",
        "You can use the roses as a permanent decoration in any room—such as the living room or your bedroom.",
        "Top a gift with the rose.",
        "Ribbons are often used to top gift boxes.",
        "A lovely use for your rose ribbon would be to use it to top a gift box.",
        "You can top the box with multiple ribbons if you made more than one.",
        "Just be sure that the rose is secured on the box with tape or glue."
    ]
}