{
    "title": "How to Jog in Cold Weather",
    "url": "https://www.wikihow.com/Jog-in-Cold-Weather",
    "category_hierarchy": [
        "Sports and Fitness",
        "Personal Fitness"
    ],
    "parts": [
        {
            "name": "Preparing for the Cold",
            "steps": [
                {
                    "headline": "Protect your skin.",
                    "description": "Cold air is very drying, and sunlight reflects off snow, intensifying UV rays. Cover any exposed skin with a broad-spectrum moisturizing sunscreen and use lip balm, both with an SPF of at least 30. Wear body lotion to keep your skin hydrated."
                },
                {
                    "headline": "Wear reflective clothes.",
                    "description": "Pick running gear that makes it easier for drivers to spot you. There is less light during the winter, especially in the morning or evening, and when the sky is overcast. Wear reflective gear or add reflective tape, and choose outfits in bright colors."
                },
                {
                    "headline": "Wear three layers.",
                    "description": "These layers will help you stay dry and warm by wicking moisture away from your skin, providing insulation, and protecting you from the wind and snow or rain. The inner layer should wick sweat away and fit close to your skin. Opt for synthetics or silk. This layer should keep you dry and not feel scratchy against your skin. Avoid cotton because it will hold moisture, which will quickly turn chilly. A good example is a long sleeved tech shirt. The middle layer is to keep you warm. Pick a fabric that will keep heat against your body without holding moisture, such as a fleece jacket or vest. Experiment to determine how thick this layer should be, depending on the temperatures in your area. The outer layer should provide protection from wind and moisture. It should also be easy to unzip or remove if you get too warm. A lightweight windbreaker is a good choice, and if you need to take it off, you can tie it around your waist. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTyler Courville\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUltra & Mountain Runner\t\t\t\t\t\t\t\tTyler Courville is a brand ambassador for Salomon Running. He has run in 10 ultra and mountain races across the United States and Nepal, and won the 2018 Crystal Mountain Marathon. Tyler Courville\t\t\tUltra & Mountain Runner\t\t\t\tTyler Courville, ultra and mountain runner, adds: “I am a firm believer in the down vest. It works when its 40 degrees with a t-shirt under, and it works when its 5 degrees with a long-sleeve wool. If you put too much on you'll be drenched in sweat, and that will only make you colder later on.\""
                },
                {
                    "headline": "Keep your legs warm.",
                    "description": "For your legs, thermal running tights can provide all three layers of protection. Find a pair made of synthetic fibers that wick moisture but still retain heat and have an outer coating to repel water."
                },
                {
                    "headline": "Dress for warmer temperatures.",
                    "description": "You will warm up as you exercise, so if your outfit is comfortable when you step outside, you will soon be too hot. Dress for weather that is warmer by 20 degrees Fahrenheit (11 degrees Celsius) than it is outside."
                },
                {
                    "headline": "Choose waterproof shoes with good traction.",
                    "description": "Your shoes should provide extra traction for running in icy or wet conditions.Trail running shoes will have a deeper tread to give you more stability. If you’re running in a lot of snow and need more traction, add spikes that you can strap onto your shoes. Wear shoes with waterproof uppers to keep your feet dry in puddles or melting snow. They should also have breathable liners to wick away moisture."
                },
                {
                    "headline": "Protect your feet with thick, wicking socks.",
                    "description": "Wear socks that are thick and warm. Like all the layers against your skin, these need to be made of fibers that won’t hold moisture, such as a wool blend. Make sure they cover your ankles to keep them warm."
                },
                {
                    "headline": "Cover your hands and head.",
                    "description": "You lose a lot of heat from these areas, and fingers get cold and stiff quickly. Wear a headband to keep your ears warm. If that’s not enough warmth, add a fleece or knit hat. Gloves should be windproof and insulated. Add mittens on top of gloves if your hands are still cold. You can remove these layers if you get hot as you run."
                }
            ]
        },
        {
            "name": "Adjusting How You Run",
            "steps": [
                {
                    "headline": "Plan your workout for midday.",
                    "description": "Get going when the temperature and light are the best. This will give ice a chance to melt, but avoid dropping temperatures as the sun goes down. Make sure you’re visible to drivers by picking the best light of the day for your run."
                },
                {
                    "headline": "Warm up carefully.",
                    "description": "Start your warm up inside to get your body temperature up and your joints limber before you hit the cold. Spend five to ten minutes doing active stretches, such as lunges, squats, leg swings, and mountain climbers. When you’re ready to go outside, spend another five to ten minutes easing into your run slowly, to give your body time to adjust to the cold."
                },
                {
                    "headline": "Start your run facing the wind.",
                    "description": "Windchill will make you colder than the ambient air temperature, and running against the wind is more work. If you’re dealing with any significant wind, face into it for the first part of your run, when you're strongest and not yet sweating very much. For the second half, when you’re getting tired and sweaty, turn around so you will have the wind at your back. This will help you avoid getting chilled or over tired."
                },
                {
                    "headline": "Take short loops.",
                    "description": "Stay close to home, in case you get very tired or the weather gets bad. Run a shorter distance than you usually would, and add on as many of these loops as you need to get a full workout."
                },
                {
                    "headline": "Go around corners carefully.",
                    "description": "If the ground is icy or wet, cornering is when you’re most likely to slip. Watch closely for slippery surfaces, and take corners slower than usual."
                },
                {
                    "headline": "Moderate your effort level.",
                    "description": "Cold weather raises your heart rate, and running takes more effort when there’s snow on the ground. Don't push yourself as hard as you usually do, or you'll risk stressing your body too much. Keep your pace a little slower, and measure your goal in time, not distance."
                },
                {
                    "headline": "Take care of your skin as soon as you get home.",
                    "description": "Sweat will dry out your skin. Prevent skin irritation by getting sweaty gear off right away. Peel off those layers and take a shower, but keep the water lukewarm. Hot water is drying and going between temperature extremes can be irritating to your skin.Reapply body lotion after your shower."
                }
            ]
        },
        {
            "name": "Staying Safe",
            "steps": [
                {
                    "headline": "Recognize the signs of hypothermia.",
                    "description": "Pay attention if you or other runners around you experience dizziness, nausea, unusual tiredness, sleepiness, confusion, or odd behavior. These are symptoms of hypothermia. This can be very dangerous, so seek immediate help."
                },
                {
                    "headline": "Carry ID, a cell phone, and money.",
                    "description": "If something unexpected happens, like an injury, hypothermia, or sudden bad weather, make sure you're able to call for help. Whether you need emergency services or a cab to take you home, carry what you need to be safe."
                },
                {
                    "headline": "Hydrate!",
                    "description": "You may not be very sweaty or feel thirsty because of the cold, but your body still needs extra water when you exercise. Drink plenty of water before and after you work out."
                },
                {
                    "headline": "Consult your doctor about chronic medical conditions.",
                    "description": "Some conditions, such as exercise induced asthma, can be exacerbated by dry, cold conditions. Speak with your doctor to get all the information you need to stay fit."
                }
            ]
        }
    ],
    "tyn": [
        "scarf, \"hoodie\", or ski-mask",
        "wool hat",
        "t-shirt",
        "long-sleeve shirt",
        "sweat-shirt.",
        "sweat-pants",
        "long underwear",
        "running shoes with good traction",
        "Warm gloves or mittens"
    ],
    "text": " Preparing for the Cold Protect your skin. Cold air is very drying, and sunlight reflects off snow, intensifying UV rays. Cover any exposed skin with a broad-spectrum moisturizing sunscreen and use lip balm, both with an SPF of at least 30. Wear body lotion to keep your skin hydrated. Wear reflective clothes. Pick running gear that makes it easier for drivers to spot you. There is less light during the winter, especially in the morning or evening, and when the sky is overcast. Wear reflective gear or add reflective tape, and choose outfits in bright colors. Wear three layers. These layers will help you stay dry and warm by wicking moisture away from your skin, providing insulation, and protecting you from the wind and snow or rain. The inner layer should wick sweat away and fit close to your skin. Opt for synthetics or silk. This layer should keep you dry and not feel scratchy against your skin. Avoid cotton because it will hold moisture, which will quickly turn chilly. A good example is a long sleeved tech shirt. The middle layer is to keep you warm. Pick a fabric that will keep heat against your body without holding moisture, such as a fleece jacket or vest. Experiment to determine how thick this layer should be, depending on the temperatures in your area. The outer layer should provide protection from wind and moisture. It should also be easy to unzip or remove if you get too warm. A lightweight windbreaker is a good choice, and if you need to take it off, you can tie it around your waist. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTyler Courville\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUltra & Mountain Runner\t\t\t\t\t\t\t\tTyler Courville is a brand ambassador for Salomon Running. He has run in 10 ultra and mountain races across the United States and Nepal, and won the 2018 Crystal Mountain Marathon. Tyler Courville\t\t\tUltra & Mountain Runner\t\t\t\tTyler Courville, ultra and mountain runner, adds: “I am a firm believer in the down vest. It works when its 40 degrees with a t-shirt under, and it works when its 5 degrees with a long-sleeve wool. If you put too much on you'll be drenched in sweat, and that will only make you colder later on.\" Keep your legs warm. For your legs, thermal running tights can provide all three layers of protection. Find a pair made of synthetic fibers that wick moisture but still retain heat and have an outer coating to repel water. Dress for warmer temperatures. You will warm up as you exercise, so if your outfit is comfortable when you step outside, you will soon be too hot. Dress for weather that is warmer by 20 degrees Fahrenheit (11 degrees Celsius) than it is outside. Choose waterproof shoes with good traction. Your shoes should provide extra traction for running in icy or wet conditions.Trail running shoes will have a deeper tread to give you more stability. If you’re running in a lot of snow and need more traction, add spikes that you can strap onto your shoes. Wear shoes with waterproof uppers to keep your feet dry in puddles or melting snow. They should also have breathable liners to wick away moisture. Protect your feet with thick, wicking socks. Wear socks that are thick and warm. Like all the layers against your skin, these need to be made of fibers that won’t hold moisture, such as a wool blend. Make sure they cover your ankles to keep them warm. Cover your hands and head. You lose a lot of heat from these areas, and fingers get cold and stiff quickly. Wear a headband to keep your ears warm. If that’s not enough warmth, add a fleece or knit hat. Gloves should be windproof and insulated. Add mittens on top of gloves if your hands are still cold. You can remove these layers if you get hot as you run. Adjusting How You Run Plan your workout for midday. Get going when the temperature and light are the best. This will give ice a chance to melt, but avoid dropping temperatures as the sun goes down. Make sure you’re visible to drivers by picking the best light of the day for your run. Warm up carefully. Start your warm up inside to get your body temperature up and your joints limber before you hit the cold. Spend five to ten minutes doing active stretches, such as lunges, squats, leg swings, and mountain climbers. When you’re ready to go outside, spend another five to ten minutes easing into your run slowly, to give your body time to adjust to the cold. Start your run facing the wind. Windchill will make you colder than the ambient air temperature, and running against the wind is more work. If you’re dealing with any significant wind, face into it for the first part of your run, when you're strongest and not yet sweating very much. For the second half, when you’re getting tired and sweaty, turn around so you will have the wind at your back. This will help you avoid getting chilled or over tired. Take short loops. Stay close to home, in case you get very tired or the weather gets bad. Run a shorter distance than you usually would, and add on as many of these loops as you need to get a full workout. Go around corners carefully. If the ground is icy or wet, cornering is when you’re most likely to slip. Watch closely for slippery surfaces, and take corners slower than usual. Moderate your effort level. Cold weather raises your heart rate, and running takes more effort when there’s snow on the ground. Don't push yourself as hard as you usually do, or you'll risk stressing your body too much. Keep your pace a little slower, and measure your goal in time, not distance. Take care of your skin as soon as you get home. Sweat will dry out your skin. Prevent skin irritation by getting sweaty gear off right away. Peel off those layers and take a shower, but keep the water lukewarm. Hot water is drying and going between temperature extremes can be irritating to your skin.Reapply body lotion after your shower. Staying Safe Recognize the signs of hypothermia. Pay attention if you or other runners around you experience dizziness, nausea, unusual tiredness, sleepiness, confusion, or odd behavior. These are symptoms of hypothermia. This can be very dangerous, so seek immediate help. Carry ID, a cell phone, and money. If something unexpected happens, like an injury, hypothermia, or sudden bad weather, make sure you're able to call for help. Whether you need emergency services or a cab to take you home, carry what you need to be safe. Hydrate! You may not be very sweaty or feel thirsty because of the cold, but your body still needs extra water when you exercise. Drink plenty of water before and after you work out. Consult your doctor about chronic medical conditions. Some conditions, such as exercise induced asthma, can be exacerbated by dry, cold conditions. Speak with your doctor to get all the information you need to stay fit.",
    "sentences": [
        " Preparing for the Cold Protect your skin.",
        "Cold air is very drying, and sunlight reflects off snow, intensifying UV rays.",
        "Cover any exposed skin with a broad-spectrum moisturizing sunscreen and use lip balm, both with an SPF of at least 30.",
        "Wear body lotion to keep your skin hydrated.",
        "Wear reflective clothes.",
        "Pick running gear that makes it easier for drivers to spot you.",
        "There is less light during the winter, especially in the morning or evening, and when the sky is overcast.",
        "Wear reflective gear or add reflective tape, and choose outfits in bright colors.",
        "Wear three layers.",
        "These layers will help you stay dry and warm by wicking moisture away from your skin, providing insulation, and protecting you from the wind and snow or rain.",
        "The inner layer should wick sweat away and fit close to your skin.",
        "Opt for synthetics or silk.",
        "This layer should keep you dry and not feel scratchy against your skin.",
        "Avoid cotton because it will hold moisture, which will quickly turn chilly.",
        "A good example is a long sleeved tech shirt.",
        "The middle layer is to keep you warm.",
        "Pick a fabric that will keep heat against your body without holding moisture, such as a fleece jacket or vest.",
        "Experiment to determine how thick this layer should be, depending on the temperatures in your area.",
        "The outer layer should provide protection from wind and moisture.",
        "It should also be easy to unzip or remove if you get too warm.",
        "A lightweight windbreaker is a good choice, and if you need to take it off, you can tie it around your waist.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTyler Courville\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUltra & Mountain Runner\t\t\t\t\t\t\t\tTyler Courville is a brand ambassador for Salomon Running.",
        "He has run in 10 ultra and mountain races across the United States and Nepal, and won the 2018 Crystal Mountain Marathon.",
        "Tyler Courville\t\t\tUltra & Mountain Runner\t\t\t\tTyler Courville, ultra and mountain runner, adds: “I am a firm believer in the down vest.",
        "It works when its 40 degrees with a t-shirt under, and it works when its 5 degrees with a long-sleeve wool.",
        "If you put too much on you'll be drenched in sweat, and that will only make you colder later on.\"",
        "Keep your legs warm.",
        "For your legs, thermal running tights can provide all three layers of protection.",
        "Find a pair made of synthetic fibers that wick moisture but still retain heat and have an outer coating to repel water.",
        "Dress for warmer temperatures.",
        "You will warm up as you exercise, so if your outfit is comfortable when you step outside, you will soon be too hot.",
        "Dress for weather that is warmer by 20 degrees Fahrenheit (11 degrees Celsius) than it is outside.",
        "Choose waterproof shoes with good traction.",
        "Your shoes should provide extra traction for running in icy or wet conditions.Trail running shoes will have a deeper tread to give you more stability.",
        "If you’re running in a lot of snow and need more traction, add spikes that you can strap onto your shoes.",
        "Wear shoes with waterproof uppers to keep your feet dry in puddles or melting snow.",
        "They should also have breathable liners to wick away moisture.",
        "Protect your feet with thick, wicking socks.",
        "Wear socks that are thick and warm.",
        "Like all the layers against your skin, these need to be made of fibers that won’t hold moisture, such as a wool blend.",
        "Make sure they cover your ankles to keep them warm.",
        "Cover your hands and head.",
        "You lose a lot of heat from these areas, and fingers get cold and stiff quickly.",
        "Wear a headband to keep your ears warm.",
        "If that’s not enough warmth, add a fleece or knit hat.",
        "Gloves should be windproof and insulated.",
        "Add mittens on top of gloves if your hands are still cold.",
        "You can remove these layers if you get hot as you run.",
        "Adjusting How You Run Plan your workout for midday.",
        "Get going when the temperature and light are the best.",
        "This will give ice a chance to melt, but avoid dropping temperatures as the sun goes down.",
        "Make sure you’re visible to drivers by picking the best light of the day for your run.",
        "Warm up carefully.",
        "Start your warm up inside to get your body temperature up and your joints limber before you hit the cold.",
        "Spend five to ten minutes doing active stretches, such as lunges, squats, leg swings, and mountain climbers.",
        "When you’re ready to go outside, spend another five to ten minutes easing into your run slowly, to give your body time to adjust to the cold.",
        "Start your run facing the wind.",
        "Windchill will make you colder than the ambient air temperature, and running against the wind is more work.",
        "If you’re dealing with any significant wind, face into it for the first part of your run, when you're strongest and not yet sweating very much.",
        "For the second half, when you’re getting tired and sweaty, turn around so you will have the wind at your back.",
        "This will help you avoid getting chilled or over tired.",
        "Take short loops.",
        "Stay close to home, in case you get very tired or the weather gets bad.",
        "Run a shorter distance than you usually would, and add on as many of these loops as you need to get a full workout.",
        "Go around corners carefully.",
        "If the ground is icy or wet, cornering is when you’re most likely to slip.",
        "Watch closely for slippery surfaces, and take corners slower than usual.",
        "Moderate your effort level.",
        "Cold weather raises your heart rate, and running takes more effort when there’s snow on the ground.",
        "Don't push yourself as hard as you usually do, or you'll risk stressing your body too much.",
        "Keep your pace a little slower, and measure your goal in time, not distance.",
        "Take care of your skin as soon as you get home.",
        "Sweat will dry out your skin.",
        "Prevent skin irritation by getting sweaty gear off right away.",
        "Peel off those layers and take a shower, but keep the water lukewarm.",
        "Hot water is drying and going between temperature extremes can be irritating to your skin.Reapply body lotion after your shower.",
        "Staying Safe Recognize the signs of hypothermia.",
        "Pay attention if you or other runners around you experience dizziness, nausea, unusual tiredness, sleepiness, confusion, or odd behavior.",
        "These are symptoms of hypothermia.",
        "This can be very dangerous, so seek immediate help.",
        "Carry ID, a cell phone, and money.",
        "If something unexpected happens, like an injury, hypothermia, or sudden bad weather, make sure you're able to call for help.",
        "Whether you need emergency services or a cab to take you home, carry what you need to be safe.",
        "Hydrate!",
        "You may not be very sweaty or feel thirsty because of the cold, but your body still needs extra water when you exercise.",
        "Drink plenty of water before and after you work out.",
        "Consult your doctor about chronic medical conditions.",
        "Some conditions, such as exercise induced asthma, can be exacerbated by dry, cold conditions.",
        "Speak with your doctor to get all the information you need to stay fit."
    ]
}