{
    "title": "How to Cut a Doll's Hair",
    "url": "https://www.wikihow.com/Cut-a-Doll%27s-Hair",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Toys",
        "Dolls and Doll Houses",
        "Caring for Doll Hair"
    ],
    "methods": [
        {
            "name": "Cutting Your Doll's Hair",
            "steps": [
                {
                    "headline": "Wash the doll's hair.",
                    "description": "A doll's hair is much different than human or animal hair. They are usually made from a fiber commonly used in wigs, either Kanekalon or Saran fiber, and are prone to getting dirty. Washing your doll's hair will restore its shine and make it nice and smooth for cutting. Lie your doll in some sort of basin or bowl appropriate for the doll's size. Remove all of the doll's clothes to avoid getting them wet. Wet the hair and then apply a tiny dot of fabric softener. At this point you should try to detangle any knots in the hair using your fingers, and if needed a comb. After working in the fabric softener, let it sit for twenty minutes. Rinse out the fabric softener and let it air dry. If you do not have fabric softener, you can use shampoo or common dish soap. Avoid any harsh chemicals. Avoid using any sort of electric heat to dry the hair as this can be damaging. You may use cold or warm water. However, avoid water too hot because it can damage the hair."
                },
                {
                    "headline": "Brush the doll's hair.",
                    "description": "After the hair is dry, you'll want to get it as straight as possible. This will help so that you know exactly how long the hair is and have a better idea of where you want to cut. Start from the end of the hair and use short strokes with the brush to detangle the ends. Slowly move toward the scalp, replicating the downward brushing pattern until you have done the entire hair. If you brush upward, you'll leave heavy knots in the hair. Brushes and combs used for human hair may not be your best option. You can buy a special doll hair brush or use a brush especially designed for wigs found at any hair care store."
                },
                {
                    "headline": "Determine where you'll cut.",
                    "description": "Determine how long you want your doll's hair to be and how much you'll cut off. Take a small rubber band or hair tie and place it at the cut point, making sure it gathers all the hair. This will be where you make your cut. If you want to take an inch off the doll's hair, you'll place the rubber band or hair tie an inch from the bottom of the hair."
                }
            ]
        },
        {
            "name": "Making the Cut",
            "steps": [
                {
                    "headline": "Make the cut.",
                    "description": "Get a pair of scissors. It is best to use hairdressing scissors or thinning shears, but virtually any sharp scissor will work. Right above where you placed the rubber band or hair tie, make a cut. Any hair that was below where you marked off will be removed and the doll's hair will be that much shorter. Double check your cut and how much hair you want removed. Once you make the cut, there's no going back!"
                },
                {
                    "headline": "Give it a summer cut.",
                    "description": "You might want your doll's hair to be short in the summer much like people's. You can simply measure out a short hair cut for your doll, depending on how long you want it to be. It is best to cut long first and then slowly cut shorter since you cannot put hair back on."
                },
                {
                    "headline": "Cut bangs on your doll.",
                    "description": "Section off the part of the hair that you want cut into bangs using a rubber band or hair tie. Comb the bang area forward and then slide the rubber band over the head. Apply warm water to the hair, such as water warmed up in the microwave in a tea cup. Make sure it's not too hot. Let it dry and then cut the bangs along the upper eye level. It will appear shorter once you remove the rubber band, so make sure to cut it a little long at first. You can always touch up the bangs once the rubber band or hair tie is removed."
                },
                {
                    "headline": "Give your doll layers.",
                    "description": "Place the doll on its back, upside down so that the hair is against a flat surface. Separate out the top layer of their hair using a rubber band or hair tie. Then access the layers below and cut to shorter, varied lengths to give the doll's hair the impression of volume."
                }
            ]
        },
        {
            "name": "Deciding When to Cut Your Doll's Hair",
            "steps": [
                {
                    "headline": "Repair damaged hair.",
                    "description": "If you or your loved one play with a doll often, hair can get damaged due to heat, wear and tear or a variety of other reasons. Rather than buying a new doll, you may just want to cut off the damaged portion. If the hair is damaged too close to the doll's scalp, cutting may not be an option.You'll just want to wash the hair to see if you can salvage it rather than cutting the hair."
                },
                {
                    "headline": "Create a new hair style.",
                    "description": "Sometimes you can get tired of the same look but don't want to spend the money on a new doll. Dolls can hold a lot of sentimental value and cutting its hair can add a fresh new look to an old friend. Some examples of hairstyles that can be achieved through cutting include: time pieces (like a 1950's look), short summer looks, or really any customization you want. Once you decide on the lengths you'll need to achieve each look, you can place your rubber band or hair tie where you want trimmed."
                },
                {
                    "headline": "Learn a new a skill.",
                    "description": "Whether you, or a son or daughter, have an interest in hair styling, a doll can be a great way to practice. Buy hair shears used by hair stylists and practice common hair styles on dolls. This is a great activity for kids who have an interest in creative hairstyles."
                }
            ]
        }
    ],
    "tyn": [
        "Your doll",
        "Shampoo or fabric softener",
        "A doll brush",
        "Hairdressing scissors or any common household scissor",
        "A rubber band or hair accessory (accessory)",
        "Basin for hair washing"
    ],
    "text": " Cutting Your Doll's Hair Wash the doll's hair. A doll's hair is much different than human or animal hair. They are usually made from a fiber commonly used in wigs, either Kanekalon or Saran fiber, and are prone to getting dirty. Washing your doll's hair will restore its shine and make it nice and smooth for cutting. Lie your doll in some sort of basin or bowl appropriate for the doll's size. Remove all of the doll's clothes to avoid getting them wet. Wet the hair and then apply a tiny dot of fabric softener. At this point you should try to detangle any knots in the hair using your fingers, and if needed a comb. After working in the fabric softener, let it sit for twenty minutes. Rinse out the fabric softener and let it air dry. If you do not have fabric softener, you can use shampoo or common dish soap. Avoid any harsh chemicals. Avoid using any sort of electric heat to dry the hair as this can be damaging. You may use cold or warm water. However, avoid water too hot because it can damage the hair. Brush the doll's hair. After the hair is dry, you'll want to get it as straight as possible. This will help so that you know exactly how long the hair is and have a better idea of where you want to cut. Start from the end of the hair and use short strokes with the brush to detangle the ends. Slowly move toward the scalp, replicating the downward brushing pattern until you have done the entire hair. If you brush upward, you'll leave heavy knots in the hair. Brushes and combs used for human hair may not be your best option. You can buy a special doll hair brush or use a brush especially designed for wigs found at any hair care store. Determine where you'll cut. Determine how long you want your doll's hair to be and how much you'll cut off. Take a small rubber band or hair tie and place it at the cut point, making sure it gathers all the hair. This will be where you make your cut. If you want to take an inch off the doll's hair, you'll place the rubber band or hair tie an inch from the bottom of the hair. Making the Cut Make the cut. Get a pair of scissors. It is best to use hairdressing scissors or thinning shears, but virtually any sharp scissor will work. Right above where you placed the rubber band or hair tie, make a cut. Any hair that was below where you marked off will be removed and the doll's hair will be that much shorter. Double check your cut and how much hair you want removed. Once you make the cut, there's no going back! Give it a summer cut. You might want your doll's hair to be short in the summer much like people's. You can simply measure out a short hair cut for your doll, depending on how long you want it to be. It is best to cut long first and then slowly cut shorter since you cannot put hair back on. Cut bangs on your doll. Section off the part of the hair that you want cut into bangs using a rubber band or hair tie. Comb the bang area forward and then slide the rubber band over the head. Apply warm water to the hair, such as water warmed up in the microwave in a tea cup. Make sure it's not too hot. Let it dry and then cut the bangs along the upper eye level. It will appear shorter once you remove the rubber band, so make sure to cut it a little long at first. You can always touch up the bangs once the rubber band or hair tie is removed. Give your doll layers. Place the doll on its back, upside down so that the hair is against a flat surface. Separate out the top layer of their hair using a rubber band or hair tie. Then access the layers below and cut to shorter, varied lengths to give the doll's hair the impression of volume. Deciding When to Cut Your Doll's Hair Repair damaged hair. If you or your loved one play with a doll often, hair can get damaged due to heat, wear and tear or a variety of other reasons. Rather than buying a new doll, you may just want to cut off the damaged portion. If the hair is damaged too close to the doll's scalp, cutting may not be an option.You'll just want to wash the hair to see if you can salvage it rather than cutting the hair. Create a new hair style. Sometimes you can get tired of the same look but don't want to spend the money on a new doll. Dolls can hold a lot of sentimental value and cutting its hair can add a fresh new look to an old friend. Some examples of hairstyles that can be achieved through cutting include: time pieces (like a 1950's look), short summer looks, or really any customization you want. Once you decide on the lengths you'll need to achieve each look, you can place your rubber band or hair tie where you want trimmed. Learn a new a skill. Whether you, or a son or daughter, have an interest in hair styling, a doll can be a great way to practice. Buy hair shears used by hair stylists and practice common hair styles on dolls. This is a great activity for kids who have an interest in creative hairstyles.",
    "sentences": [
        " Cutting Your Doll's Hair Wash the doll's hair.",
        "A doll's hair is much different than human or animal hair.",
        "They are usually made from a fiber commonly used in wigs, either Kanekalon or Saran fiber, and are prone to getting dirty.",
        "Washing your doll's hair will restore its shine and make it nice and smooth for cutting.",
        "Lie your doll in some sort of basin or bowl appropriate for the doll's size.",
        "Remove all of the doll's clothes to avoid getting them wet.",
        "Wet the hair and then apply a tiny dot of fabric softener.",
        "At this point you should try to detangle any knots in the hair using your fingers, and if needed a comb.",
        "After working in the fabric softener, let it sit for twenty minutes.",
        "Rinse out the fabric softener and let it air dry.",
        "If you do not have fabric softener, you can use shampoo or common dish soap.",
        "Avoid any harsh chemicals.",
        "Avoid using any sort of electric heat to dry the hair as this can be damaging.",
        "You may use cold or warm water.",
        "However, avoid water too hot because it can damage the hair.",
        "Brush the doll's hair.",
        "After the hair is dry, you'll want to get it as straight as possible.",
        "This will help so that you know exactly how long the hair is and have a better idea of where you want to cut.",
        "Start from the end of the hair and use short strokes with the brush to detangle the ends.",
        "Slowly move toward the scalp, replicating the downward brushing pattern until you have done the entire hair.",
        "If you brush upward, you'll leave heavy knots in the hair.",
        "Brushes and combs used for human hair may not be your best option.",
        "You can buy a special doll hair brush or use a brush especially designed for wigs found at any hair care store.",
        "Determine where you'll cut.",
        "Determine how long you want your doll's hair to be and how much you'll cut off.",
        "Take a small rubber band or hair tie and place it at the cut point, making sure it gathers all the hair.",
        "This will be where you make your cut.",
        "If you want to take an inch off the doll's hair, you'll place the rubber band or hair tie an inch from the bottom of the hair.",
        "Making the Cut Make the cut.",
        "Get a pair of scissors.",
        "It is best to use hairdressing scissors or thinning shears, but virtually any sharp scissor will work.",
        "Right above where you placed the rubber band or hair tie, make a cut.",
        "Any hair that was below where you marked off will be removed and the doll's hair will be that much shorter.",
        "Double check your cut and how much hair you want removed.",
        "Once you make the cut, there's no going back!",
        "Give it a summer cut.",
        "You might want your doll's hair to be short in the summer much like people's.",
        "You can simply measure out a short hair cut for your doll, depending on how long you want it to be.",
        "It is best to cut long first and then slowly cut shorter since you cannot put hair back on.",
        "Cut bangs on your doll.",
        "Section off the part of the hair that you want cut into bangs using a rubber band or hair tie.",
        "Comb the bang area forward and then slide the rubber band over the head.",
        "Apply warm water to the hair, such as water warmed up in the microwave in a tea cup.",
        "Make sure it's not too hot.",
        "Let it dry and then cut the bangs along the upper eye level.",
        "It will appear shorter once you remove the rubber band, so make sure to cut it a little long at first.",
        "You can always touch up the bangs once the rubber band or hair tie is removed.",
        "Give your doll layers.",
        "Place the doll on its back, upside down so that the hair is against a flat surface.",
        "Separate out the top layer of their hair using a rubber band or hair tie.",
        "Then access the layers below and cut to shorter, varied lengths to give the doll's hair the impression of volume.",
        "Deciding When to Cut Your Doll's Hair Repair damaged hair.",
        "If you or your loved one play with a doll often, hair can get damaged due to heat, wear and tear or a variety of other reasons.",
        "Rather than buying a new doll, you may just want to cut off the damaged portion.",
        "If the hair is damaged too close to the doll's scalp, cutting may not be an option.You'll just want to wash the hair to see if you can salvage it rather than cutting the hair.",
        "Create a new hair style.",
        "Sometimes you can get tired of the same look but don't want to spend the money on a new doll.",
        "Dolls can hold a lot of sentimental value and cutting its hair can add a fresh new look to an old friend.",
        "Some examples of hairstyles that can be achieved through cutting include: time pieces (like a 1950's look), short summer looks, or really any customization you want.",
        "Once you decide on the lengths you'll need to achieve each look, you can place your rubber band or hair tie where you want trimmed.",
        "Learn a new a skill.",
        "Whether you, or a son or daughter, have an interest in hair styling, a doll can be a great way to practice.",
        "Buy hair shears used by hair stylists and practice common hair styles on dolls.",
        "This is a great activity for kids who have an interest in creative hairstyles."
    ]
}