{
    "title": "How to Ollie Big Stairs or Gaps on Your Skateboard",
    "url": "https://www.wikihow.com/Ollie-Big-Stairs-or-Gaps-on-Your-Skateboard",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Skateboarding",
        "Skateboarding Tricks",
        "Aerial Skateboarding Tricks",
        "Ollie and Nollie Tricks"
    ],
    "steps": [
        {
            "headline": "Find the set.",
            "description": "You don't want the spot you're doing to have too many cracks or too much security there."
        },
        {
            "headline": "Do not hesitate.",
            "description": "A few run-ups are fine, but not too many. If you do hesitate before you Ollie, it could be extremely painful (depending on the size of the set/gap)."
        },
        {
            "headline": "Go faster than you normally would.",
            "description": "It's better to go fast than slow with bigger gaps and sets."
        },
        {
            "headline": "Ollie.",
            "description": "Pop a good Ollie while you're going at a decent speed."
        },
        {
            "headline": "Stay with the board.",
            "description": "It may feel like the longest time you've ever spent in your life in the air on your skateboard, so don't freak out."
        },
        {
            "headline": "Bring your knees to your chest for better control.",
            "description": "When you are about to hit the ground extend your legs a little bit."
        },
        {
            "headline": "Compress your legs like shocks to take up the pressure when you're about ready to hit the ground.",
            "description": "If done right, it won't hurt."
        },
        {
            "headline": "After you compress, come back up and ride away.",
            "description": "Your friends will be impressed if you can do big stuff and they can't."
        }
    ],
    "tyn": [
        "A decent skateboard"
    ],
    "text": " Find the set. You don't want the spot you're doing to have too many cracks or too much security there. Do not hesitate. A few run-ups are fine, but not too many. If you do hesitate before you Ollie, it could be extremely painful (depending on the size of the set/gap). Go faster than you normally would. It's better to go fast than slow with bigger gaps and sets. Ollie. Pop a good Ollie while you're going at a decent speed. Stay with the board. It may feel like the longest time you've ever spent in your life in the air on your skateboard, so don't freak out. Bring your knees to your chest for better control. When you are about to hit the ground extend your legs a little bit. Compress your legs like shocks to take up the pressure when you're about ready to hit the ground. If done right, it won't hurt. After you compress, come back up and ride away. Your friends will be impressed if you can do big stuff and they can't.",
    "sentences": [
        " Find the set.",
        "You don't want the spot you're doing to have too many cracks or too much security there.",
        "Do not hesitate.",
        "A few run-ups are fine, but not too many.",
        "If you do hesitate before you Ollie, it could be extremely painful (depending on the size of the set/gap).",
        "Go faster than you normally would.",
        "It's better to go fast than slow with bigger gaps and sets.",
        "Ollie.",
        "Pop a good Ollie while you're going at a decent speed.",
        "Stay with the board.",
        "It may feel like the longest time you've ever spent in your life in the air on your skateboard, so don't freak out.",
        "Bring your knees to your chest for better control.",
        "When you are about to hit the ground extend your legs a little bit.",
        "Compress your legs like shocks to take up the pressure when you're about ready to hit the ground.",
        "If done right, it won't hurt.",
        "After you compress, come back up and ride away.",
        "Your friends will be impressed if you can do big stuff and they can't."
    ]
}