{
    "title": "How to Sing Like Kelly Clarkson",
    "url": "https://www.wikihow.com/Sing-Like-Kelly-Clarkson",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music"
    ],
    "steps": [
        {
            "headline": "Exercise your voice.",
            "description": "A way to do that is by holding a note for 10 seconds. Do that 5 times. That is a true test of the vocal chords, and the note you are holding should be VERY steady and VERY clear. If your vocal chords are well controlled, your note should ring at a steady pace. Listen to Kelly Clarkson's song, \"Behind These Hazel Eyes\" for an example."
        },
        {
            "headline": "Drink some water.",
            "description": "When you are singing, you should always have some type of cool drink beside you. This drink shouldn't be one that decreases saliva, like juice, or increases mucus. Lemon is good for decreasing mucus."
        },
        {
            "headline": "Stand up while singing, always.",
            "description": "This really helps you take in more air, it gives you confidence, and your voice is thus projected farther."
        },
        {
            "headline": "Learn to breathe the correct way.",
            "description": "Put your hand on your stomach, and breathe. Your rib cage should move slightly up and your stomach should pull in a little. This is the wrong way to breathe while singing. If you breathe like this while singing, you will damage your vocal chords. Now, lay on the ground with your chest facing the ground. Breathe. Your stomach should expand outwards, you should be lifted slightly off the ground, and your body will feel more strained. I know from personal experience that at first if you sing with this breathing technique, your sides will feel sore. Trust me on this, your singing will improve after practice!"
        },
        {
            "headline": "Try singing one of Kelly Clarkson's famous songs.",
            "description": "I'd suggest a more rock oriented type at first. Breakaway, Behind These Hazel Eyes, and Since U Been Gone are all great choices. Test out your voice, and see how high you can go without cracking your voice. NEVER SCREAM. It makes your voice hoarse and painfully damages your vocal chords. I must say, on the choruses on Breakaway, Behind These Hazel Eyes, and Since U Been Gone there are some extremely high notes. You probably won't be able to sing them right away, but try as hard as you can to get the correct pitch with loud volume, even though your voice will sound like squealing. Don't worry or be embarrassed. It'll be over soon enough."
        },
        {
            "headline": "Keep on practicing.",
            "description": "If you practice this for about a week for an hour every day, you will begin to see changes for the better. Your voice will echo more, it will not crack as often, and it will gradually become easier to sing high/low pitched songs."
        },
        {
            "headline": "After 1 month of practicing every day for an hour, see if you can afford a karaoke machine.",
            "description": "This way you can see how well you are getting the rhythm and you can sing with background music."
        },
        {
            "headline": "Make sure that you can sing for at least 1 hour every 3 days, no matter what.",
            "description": "Your vocal chords start to close again if you don't practice often. But once you get hold of a strong voice, you can't really lose it from lack of practice."
        },
        {
            "headline": "After 3 months of practicing every day for an hour, try singing on the street.",
            "description": "Just act natural. This will require a lot of confidence for most people, but you don't have to gather a group of people or anything. You could just be hanging out with your friends, and burst into song. If you are a good singer by then, people will probably glance by curiously. If you are a bad singer, people will scoff and whisper. If you are amazing, a small crowd might even form around you and clap their hands. If this happens, stay confident and strong. Just focus on the music, smile, sway, and clap your hands too. Of course, this is depending on where you live. If you live in New York City, the chances of these things happening are more likely than in a small rural area. But never lose faith!"
        },
        {
            "headline": "If you keep on receiving positive feedback on you voice, try auditioning for a talent search such as American Idol if you want to!",
            "description": ""
        }
    ],
    "tyn": [
        "Karaoke Machine (optional)",
        "Kelly Clarkson Songs (optional, but highly recommended)",
        "Water"
    ],
    "text": " Exercise your voice. A way to do that is by holding a note for 10 seconds. Do that 5 times. That is a true test of the vocal chords, and the note you are holding should be VERY steady and VERY clear. If your vocal chords are well controlled, your note should ring at a steady pace. Listen to Kelly Clarkson's song, \"Behind These Hazel Eyes\" for an example. Drink some water. When you are singing, you should always have some type of cool drink beside you. This drink shouldn't be one that decreases saliva, like juice, or increases mucus. Lemon is good for decreasing mucus. Stand up while singing, always. This really helps you take in more air, it gives you confidence, and your voice is thus projected farther. Learn to breathe the correct way. Put your hand on your stomach, and breathe. Your rib cage should move slightly up and your stomach should pull in a little. This is the wrong way to breathe while singing. If you breathe like this while singing, you will damage your vocal chords. Now, lay on the ground with your chest facing the ground. Breathe. Your stomach should expand outwards, you should be lifted slightly off the ground, and your body will feel more strained. I know from personal experience that at first if you sing with this breathing technique, your sides will feel sore. Trust me on this, your singing will improve after practice! Try singing one of Kelly Clarkson's famous songs. I'd suggest a more rock oriented type at first. Breakaway, Behind These Hazel Eyes, and Since U Been Gone are all great choices. Test out your voice, and see how high you can go without cracking your voice. NEVER SCREAM. It makes your voice hoarse and painfully damages your vocal chords. I must say, on the choruses on Breakaway, Behind These Hazel Eyes, and Since U Been Gone there are some extremely high notes. You probably won't be able to sing them right away, but try as hard as you can to get the correct pitch with loud volume, even though your voice will sound like squealing. Don't worry or be embarrassed. It'll be over soon enough. Keep on practicing. If you practice this for about a week for an hour every day, you will begin to see changes for the better. Your voice will echo more, it will not crack as often, and it will gradually become easier to sing high/low pitched songs. After 1 month of practicing every day for an hour, see if you can afford a karaoke machine. This way you can see how well you are getting the rhythm and you can sing with background music. Make sure that you can sing for at least 1 hour every 3 days, no matter what. Your vocal chords start to close again if you don't practice often. But once you get hold of a strong voice, you can't really lose it from lack of practice. After 3 months of practicing every day for an hour, try singing on the street. Just act natural. This will require a lot of confidence for most people, but you don't have to gather a group of people or anything. You could just be hanging out with your friends, and burst into song. If you are a good singer by then, people will probably glance by curiously. If you are a bad singer, people will scoff and whisper. If you are amazing, a small crowd might even form around you and clap their hands. If this happens, stay confident and strong. Just focus on the music, smile, sway, and clap your hands too. Of course, this is depending on where you live. If you live in New York City, the chances of these things happening are more likely than in a small rural area. But never lose faith! If you keep on receiving positive feedback on you voice, try auditioning for a talent search such as American Idol if you want to! ",
    "sentences": [
        " Exercise your voice.",
        "A way to do that is by holding a note for 10 seconds.",
        "Do that 5 times.",
        "That is a true test of the vocal chords, and the note you are holding should be VERY steady and VERY clear.",
        "If your vocal chords are well controlled, your note should ring at a steady pace.",
        "Listen to Kelly Clarkson's song, \"Behind These Hazel Eyes\" for an example.",
        "Drink some water.",
        "When you are singing, you should always have some type of cool drink beside you.",
        "This drink shouldn't be one that decreases saliva, like juice, or increases mucus.",
        "Lemon is good for decreasing mucus.",
        "Stand up while singing, always.",
        "This really helps you take in more air, it gives you confidence, and your voice is thus projected farther.",
        "Learn to breathe the correct way.",
        "Put your hand on your stomach, and breathe.",
        "Your rib cage should move slightly up and your stomach should pull in a little.",
        "This is the wrong way to breathe while singing.",
        "If you breathe like this while singing, you will damage your vocal chords.",
        "Now, lay on the ground with your chest facing the ground.",
        "Breathe.",
        "Your stomach should expand outwards, you should be lifted slightly off the ground, and your body will feel more strained.",
        "I know from personal experience that at first if you sing with this breathing technique, your sides will feel sore.",
        "Trust me on this, your singing will improve after practice!",
        "Try singing one of Kelly Clarkson's famous songs.",
        "I'd suggest a more rock oriented type at first.",
        "Breakaway, Behind These Hazel Eyes, and Since U Been Gone are all great choices.",
        "Test out your voice, and see how high you can go without cracking your voice.",
        "NEVER SCREAM.",
        "It makes your voice hoarse and painfully damages your vocal chords.",
        "I must say, on the choruses on Breakaway, Behind These Hazel Eyes, and Since U Been Gone there are some extremely high notes.",
        "You probably won't be able to sing them right away, but try as hard as you can to get the correct pitch with loud volume, even though your voice will sound like squealing.",
        "Don't worry or be embarrassed.",
        "It'll be over soon enough.",
        "Keep on practicing.",
        "If you practice this for about a week for an hour every day, you will begin to see changes for the better.",
        "Your voice will echo more, it will not crack as often, and it will gradually become easier to sing high/low pitched songs.",
        "After 1 month of practicing every day for an hour, see if you can afford a karaoke machine.",
        "This way you can see how well you are getting the rhythm and you can sing with background music.",
        "Make sure that you can sing for at least 1 hour every 3 days, no matter what.",
        "Your vocal chords start to close again if you don't practice often.",
        "But once you get hold of a strong voice, you can't really lose it from lack of practice.",
        "After 3 months of practicing every day for an hour, try singing on the street.",
        "Just act natural.",
        "This will require a lot of confidence for most people, but you don't have to gather a group of people or anything.",
        "You could just be hanging out with your friends, and burst into song.",
        "If you are a good singer by then, people will probably glance by curiously.",
        "If you are a bad singer, people will scoff and whisper.",
        "If you are amazing, a small crowd might even form around you and clap their hands.",
        "If this happens, stay confident and strong.",
        "Just focus on the music, smile, sway, and clap your hands too.",
        "Of course, this is depending on where you live.",
        "If you live in New York City, the chances of these things happening are more likely than in a small rural area.",
        "But never lose faith!",
        "If you keep on receiving positive feedback on you voice, try auditioning for a talent search such as American Idol if you want to!"
    ]
}