{
    "title": "How to Sew Up Holes",
    "url": "https://www.wikihow.com/Sew-Up-Holes",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Laundry"
    ],
    "methods": [
        {
            "name": "Choosing the Needle and Thread",
            "steps": [
                {
                    "headline": "Get a thread roll and a needle.",
                    "description": "If possible, use thread that matches the color of your clothing. If the stitch won't be visible from outside the garment, then the color of the thread does not matter. You may also choose to use a vibrantly-colored thread to complement or contrast with the fabric."
                },
                {
                    "headline": "Pick the right needle for the cloth.",
                    "description": "If the fabric is thick and tough (denim, leather, and multi-layered cloth), use a sharp, heavy needle so that you can pierce the cloth without too much effort. If the fabric is soft or thin, you may use any needle – though you might want to use a more delicate needle. Cotton, nylon, silk, jute, mixed fabric, and any other thin, soft fabric is better stitched with  a lighter needles. The needle can be as short as 1-2 inches, or longer as needed. If you use a thick needle—approximately 1 mm in thickness—it may leave visible holes in the fabric. You may use a finger cap to prevent being poked by the needle while stitching. Opt for a thicker needle to avoid breaking any needles. Use a solid board to push the needle through while stitching if your finger hurts. Some thick fabrics like denim need pushing against a hard surface."
                },
                {
                    "headline": "Make sure that you have enough thread.",
                    "description": "If unsure, try laying the thread over the torn area for reference. Take about 10 inches more than you think you'll need. The in-and-out sewing motion will take up a lot of thread, and you'll also need a bit more thread than the needle's length in order to tie the final knot. Remember: the thicker the fabric, the more thread you'll need. You may choose to take two times more thread if the fabric is thicker than 5mm."
                },
                {
                    "headline": "Thread the needle.",
                    "description": "Make sure that the tip of the thread is tight, not split. If the tip is frayed: wet it, then roll it with your fingers so that it goes easily through the eye of the needle. Try using a needle threader if you have trouble."
                },
                {
                    "headline": "Knot the thread.",
                    "description": "Hold both ends of the thread. Tie a small knot to keep the far tip (the one that you didn't thread through the eye of the needle) from slipping through the fabric after the needle. If you intend to make a stitch to a torn knit wear, then you must make a bigger effort. Knit wear or woolen clothes contain much bigger gaps than other fabrics. Here, to begin with, you must make a knot with the threaded needle so that your thread has something holding it in place."
                }
            ]
        },
        {
            "name": "Sewing a Split Seam",
            "steps": [
                {
                    "headline": "Identify a split seam.",
                    "description": "Compared to a larger hole, a split seam is fairly easy to deal with. This means: where two pieces of fabric were joined by stitching, the thread is broken or missing and the seam is now open, creating a \"hole.\" In most cases, you can simply sew the seam back together. This can be inside a pocket, causing all your change to drop through. It may also appear in a sleeve seam, causing your elbow to stick out."
                },
                {
                    "headline": "Turn the garment inside out.",
                    "description": "Expose the seam. You may wish to gently iron the garment on the appropriate heat setting for the fabric, and then pin the seams carefully back together."
                },
                {
                    "headline": "Sew along the seam line.",
                    "description": "Sew by hand (needle and thread) or machine along the original seam line with nice, small stitches for strength. Overlap the intact part of the original seam, and make sure to knot the thread well. Carefully clip any hanging threads to finish the job. Sometimes, you will need to deal with top-stitching rather than a seam: as in an applique or a patch pocket. In this case, you will want to exactly match the thread to the original, since it will be highly visible. Try to match the stitch length in making the repair."
                }
            ]
        },
        {
            "name": "Reinforcing a Hole",
            "steps": [
                {
                    "headline": "Measure the hole.",
                    "description": "If the hole is too big, you'll need some cloth. If the pockets were ripped too, you'll have to sew it. The patch needs to be the same color as the clothes, and it should also be big enough to sew up the hole."
                },
                {
                    "headline": "Evaluate the missing fabric.",
                    "description": "The most difficult type of hole to sew up is one where there is actually fabric missing – as in a worn-out hole in the knees of trousers, or in the elbow of a jacket. Do not try to sew the hole up without adding any additional fabric. This will only pucker the fabric together, tugging at the shape of the garment and creating a messy lump."
                },
                {
                    "headline": "Use a reinforcing patch.",
                    "description": "If the hole is frayed into the seam line or somewhere in the middle of the garment (other than a seam), then you will need to reinforce the area. Cut to size a small piece of fabric of the same weight and color of the garment. Lay the patching fabric under the hole, right side up. Then, bring the edges of the hole as close together as possible, without puckering the hole. Use a small zig zag stitch on the sewing machine to stitch around the edges of hole, catching as much fabric (patch and garment) as possible to make the patch hold. This isn't going to be a \"pretty fix,\" but it should be serviceable. If the garment is casual, you can buy extra fabric in a contrasting color or pattern and sew patches in several areas to make the hole patch look decorative. Do this patch from the outside of the garment, or use appliqués in the same manner to add a designer touch."
                },
                {
                    "headline": "Strengthen the torn ends.",
                    "description": "Start stitching about an inch before the torn area. This is especially important if an existing stitch was loosened or ripped. Stitching a little back from the ends will support the fabric and stop further tearing. Slip the needle through the cloth, and carefully weave the thread in and out of the cloth. For consistency, try to keep the distance between each stitch to about 2 mm. If the hole is especially frayed, try reinforcing with a liquid seam sealant before you start stitching. This can help make the fix more sustainable. If the cloth is too tight, a stitch may tear again once you wear the garment. Try adding another layer of a piece of a cloth beneath the hole, and then stitching that cloth for added strength. Try stitching a button to the area, if it goes with the fabric. Consider darning the hole so the space is filled with many interlacing stitches."
                },
                {
                    "headline": "Circle back next to the first stitch.",
                    "description": "Repeat until there is nothing left to sew. If the cloth is badly frayed, it may require an \"over-locking.\" Hold the cloth and stitch it so that the frayed end is folded inwards. Fold the cloth one or two times, then stitch it \"shut\" to prevent the cloth from tearing again."
                },
                {
                    "headline": "Finish the job.",
                    "description": "Stretch and press the cloth. Take care that the thread does not get tangled midway through the stitch. Press the stitched area between your fingers. Then, run through the stitch to remove air gaps or unevenness of the cloth. To finish the job, make a knot and snip the thread."
                }
            ]
        },
        {
            "name": "Patching a Hole",
            "steps": [
                {
                    "headline": "Try using an iron-on patch for heavier fabrics.",
                    "description": "You can simply lay the patch over the hole, then iron it flat with enough heat that the patch binds to the fabric. Make sure to reinforce an iron-on patch with stitching around the edges. Trim the square corners to a rounded shape before ironing them onto the garment. Both the stitching and the corner trimming will increase the useful life of the patch. Iron-on patches are suitable for heavier fabrics such as denim and canvas. However, they may distort the shape of thinner fabrics."
                },
                {
                    "headline": "Make the patch discreet.",
                    "description": "If the hole is in a visible part of the garment, prepare the self patch from the inside. If this isn't possible, purchase fabric as close in color to the garment as possible in a fabric with the same properties. Alternately, pick a patch that stands out. For some, patched clothing is a stylistic choice."
                },
                {
                    "headline": "Hand-sew a patch for thinner fabrics.",
                    "description": "First, trim the frayed threads and treat the hole's edges with seam sealant. Make two patches: one with any fabric for the bottom, and one with the matching/self fabric for the top patch. Treat the edges of the bottom patch with seam sealant. Then, turn a small amount of fabric at the edge of your top patch, and iron this folded edge in place. Use the free embroidery settings on your sewing machine. Place the bottom patch underneath the hole, and run the lines of stitching very close together to completely catch all edges of the hole onto the bottom patch. Sew the bottom patch into place. Stitch back and forth, and up and down, creating a \"fabric\" of stitching across the hole or tear. Sew in straight stitch all around the edges of the bottom patch to keep the hole reinforced. Cover with the top patch. Place the folded-edge side down onto the fabric so it completely covers all the machine stitching. Hand-sew with matching thread (applique style) onto the top of the garment. Work the thread around it several times for strength. If you prefer a \"rustic\" look, you can also embroider with blanket stitch around this patch."
                }
            ]
        }
    ],
    "tyn": [
        "Scissors",
        "Needle",
        "Thread",
        "Seam Ripper (Optional)",
        "Finger cap or thimble to protect your fingers from being poked repeatedly. (Optional)"
    ],
    "text": " Choosing the Needle and Thread Get a thread roll and a needle. If possible, use thread that matches the color of your clothing. If the stitch won't be visible from outside the garment, then the color of the thread does not matter. You may also choose to use a vibrantly-colored thread to complement or contrast with the fabric. Pick the right needle for the cloth. If the fabric is thick and tough (denim, leather, and multi-layered cloth), use a sharp, heavy needle so that you can pierce the cloth without too much effort. If the fabric is soft or thin, you may use any needle – though you might want to use a more delicate needle. Cotton, nylon, silk, jute, mixed fabric, and any other thin, soft fabric is better stitched with  a lighter needles. The needle can be as short as 1-2 inches, or longer as needed. If you use a thick needle—approximately 1 mm in thickness—it may leave visible holes in the fabric. You may use a finger cap to prevent being poked by the needle while stitching. Opt for a thicker needle to avoid breaking any needles. Use a solid board to push the needle through while stitching if your finger hurts. Some thick fabrics like denim need pushing against a hard surface. Make sure that you have enough thread. If unsure, try laying the thread over the torn area for reference. Take about 10 inches more than you think you'll need. The in-and-out sewing motion will take up a lot of thread, and you'll also need a bit more thread than the needle's length in order to tie the final knot. Remember: the thicker the fabric, the more thread you'll need. You may choose to take two times more thread if the fabric is thicker than 5mm. Thread the needle. Make sure that the tip of the thread is tight, not split. If the tip is frayed: wet it, then roll it with your fingers so that it goes easily through the eye of the needle. Try using a needle threader if you have trouble. Knot the thread. Hold both ends of the thread. Tie a small knot to keep the far tip (the one that you didn't thread through the eye of the needle) from slipping through the fabric after the needle. If you intend to make a stitch to a torn knit wear, then you must make a bigger effort. Knit wear or woolen clothes contain much bigger gaps than other fabrics. Here, to begin with, you must make a knot with the threaded needle so that your thread has something holding it in place. Sewing a Split Seam Identify a split seam. Compared to a larger hole, a split seam is fairly easy to deal with. This means: where two pieces of fabric were joined by stitching, the thread is broken or missing and the seam is now open, creating a \"hole.\" In most cases, you can simply sew the seam back together. This can be inside a pocket, causing all your change to drop through. It may also appear in a sleeve seam, causing your elbow to stick out. Turn the garment inside out. Expose the seam. You may wish to gently iron the garment on the appropriate heat setting for the fabric, and then pin the seams carefully back together. Sew along the seam line. Sew by hand (needle and thread) or machine along the original seam line with nice, small stitches for strength. Overlap the intact part of the original seam, and make sure to knot the thread well. Carefully clip any hanging threads to finish the job. Sometimes, you will need to deal with top-stitching rather than a seam: as in an applique or a patch pocket. In this case, you will want to exactly match the thread to the original, since it will be highly visible. Try to match the stitch length in making the repair. Reinforcing a Hole Measure the hole. If the hole is too big, you'll need some cloth. If the pockets were ripped too, you'll have to sew it. The patch needs to be the same color as the clothes, and it should also be big enough to sew up the hole. Evaluate the missing fabric. The most difficult type of hole to sew up is one where there is actually fabric missing – as in a worn-out hole in the knees of trousers, or in the elbow of a jacket. Do not try to sew the hole up without adding any additional fabric. This will only pucker the fabric together, tugging at the shape of the garment and creating a messy lump. Use a reinforcing patch. If the hole is frayed into the seam line or somewhere in the middle of the garment (other than a seam), then you will need to reinforce the area. Cut to size a small piece of fabric of the same weight and color of the garment. Lay the patching fabric under the hole, right side up. Then, bring the edges of the hole as close together as possible, without puckering the hole. Use a small zig zag stitch on the sewing machine to stitch around the edges of hole, catching as much fabric (patch and garment) as possible to make the patch hold. This isn't going to be a \"pretty fix,\" but it should be serviceable. If the garment is casual, you can buy extra fabric in a contrasting color or pattern and sew patches in several areas to make the hole patch look decorative. Do this patch from the outside of the garment, or use appliqués in the same manner to add a designer touch. Strengthen the torn ends. Start stitching about an inch before the torn area. This is especially important if an existing stitch was loosened or ripped. Stitching a little back from the ends will support the fabric and stop further tearing. Slip the needle through the cloth, and carefully weave the thread in and out of the cloth. For consistency, try to keep the distance between each stitch to about 2 mm. If the hole is especially frayed, try reinforcing with a liquid seam sealant before you start stitching. This can help make the fix more sustainable. If the cloth is too tight, a stitch may tear again once you wear the garment. Try adding another layer of a piece of a cloth beneath the hole, and then stitching that cloth for added strength. Try stitching a button to the area, if it goes with the fabric. Consider darning the hole so the space is filled with many interlacing stitches. Circle back next to the first stitch. Repeat until there is nothing left to sew. If the cloth is badly frayed, it may require an \"over-locking.\" Hold the cloth and stitch it so that the frayed end is folded inwards. Fold the cloth one or two times, then stitch it \"shut\" to prevent the cloth from tearing again. Finish the job. Stretch and press the cloth. Take care that the thread does not get tangled midway through the stitch. Press the stitched area between your fingers. Then, run through the stitch to remove air gaps or unevenness of the cloth. To finish the job, make a knot and snip the thread. Patching a Hole Try using an iron-on patch for heavier fabrics. You can simply lay the patch over the hole, then iron it flat with enough heat that the patch binds to the fabric. Make sure to reinforce an iron-on patch with stitching around the edges. Trim the square corners to a rounded shape before ironing them onto the garment. Both the stitching and the corner trimming will increase the useful life of the patch. Iron-on patches are suitable for heavier fabrics such as denim and canvas. However, they may distort the shape of thinner fabrics. Make the patch discreet. If the hole is in a visible part of the garment, prepare the self patch from the inside. If this isn't possible, purchase fabric as close in color to the garment as possible in a fabric with the same properties. Alternately, pick a patch that stands out. For some, patched clothing is a stylistic choice. Hand-sew a patch for thinner fabrics. First, trim the frayed threads and treat the hole's edges with seam sealant. Make two patches: one with any fabric for the bottom, and one with the matching/self fabric for the top patch. Treat the edges of the bottom patch with seam sealant. Then, turn a small amount of fabric at the edge of your top patch, and iron this folded edge in place. Use the free embroidery settings on your sewing machine. Place the bottom patch underneath the hole, and run the lines of stitching very close together to completely catch all edges of the hole onto the bottom patch. Sew the bottom patch into place. Stitch back and forth, and up and down, creating a \"fabric\" of stitching across the hole or tear. Sew in straight stitch all around the edges of the bottom patch to keep the hole reinforced. Cover with the top patch. Place the folded-edge side down onto the fabric so it completely covers all the machine stitching. Hand-sew with matching thread (applique style) onto the top of the garment. Work the thread around it several times for strength. If you prefer a \"rustic\" look, you can also embroider with blanket stitch around this patch.",
    "sentences": [
        " Choosing the Needle and Thread Get a thread roll and a needle.",
        "If possible, use thread that matches the color of your clothing.",
        "If the stitch won't be visible from outside the garment, then the color of the thread does not matter.",
        "You may also choose to use a vibrantly-colored thread to complement or contrast with the fabric.",
        "Pick the right needle for the cloth.",
        "If the fabric is thick and tough (denim, leather, and multi-layered cloth), use a sharp, heavy needle so that you can pierce the cloth without too much effort.",
        "If the fabric is soft or thin, you may use any needle – though you might want to use a more delicate needle.",
        "Cotton, nylon, silk, jute, mixed fabric, and any other thin, soft fabric is better stitched with  a lighter needles.",
        "The needle can be as short as 1-2 inches, or longer as needed.",
        "If you use a thick needle—approximately 1 mm in thickness—it may leave visible holes in the fabric.",
        "You may use a finger cap to prevent being poked by the needle while stitching.",
        "Opt for a thicker needle to avoid breaking any needles.",
        "Use a solid board to push the needle through while stitching if your finger hurts.",
        "Some thick fabrics like denim need pushing against a hard surface.",
        "Make sure that you have enough thread.",
        "If unsure, try laying the thread over the torn area for reference.",
        "Take about 10 inches more than you think you'll need.",
        "The in-and-out sewing motion will take up a lot of thread, and you'll also need a bit more thread than the needle's length in order to tie the final knot.",
        "Remember: the thicker the fabric, the more thread you'll need.",
        "You may choose to take two times more thread if the fabric is thicker than 5mm.",
        "Thread the needle.",
        "Make sure that the tip of the thread is tight, not split.",
        "If the tip is frayed: wet it, then roll it with your fingers so that it goes easily through the eye of the needle.",
        "Try using a needle threader if you have trouble.",
        "Knot the thread.",
        "Hold both ends of the thread.",
        "Tie a small knot to keep the far tip (the one that you didn't thread through the eye of the needle) from slipping through the fabric after the needle.",
        "If you intend to make a stitch to a torn knit wear, then you must make a bigger effort.",
        "Knit wear or woolen clothes contain much bigger gaps than other fabrics.",
        "Here, to begin with, you must make a knot with the threaded needle so that your thread has something holding it in place.",
        "Sewing a Split Seam Identify a split seam.",
        "Compared to a larger hole, a split seam is fairly easy to deal with.",
        "This means: where two pieces of fabric were joined by stitching, the thread is broken or missing and the seam is now open, creating a \"hole.\"",
        "In most cases, you can simply sew the seam back together.",
        "This can be inside a pocket, causing all your change to drop through.",
        "It may also appear in a sleeve seam, causing your elbow to stick out.",
        "Turn the garment inside out.",
        "Expose the seam.",
        "You may wish to gently iron the garment on the appropriate heat setting for the fabric, and then pin the seams carefully back together.",
        "Sew along the seam line.",
        "Sew by hand (needle and thread) or machine along the original seam line with nice, small stitches for strength.",
        "Overlap the intact part of the original seam, and make sure to knot the thread well.",
        "Carefully clip any hanging threads to finish the job.",
        "Sometimes, you will need to deal with top-stitching rather than a seam: as in an applique or a patch pocket.",
        "In this case, you will want to exactly match the thread to the original, since it will be highly visible.",
        "Try to match the stitch length in making the repair.",
        "Reinforcing a Hole Measure the hole.",
        "If the hole is too big, you'll need some cloth.",
        "If the pockets were ripped too, you'll have to sew it.",
        "The patch needs to be the same color as the clothes, and it should also be big enough to sew up the hole.",
        "Evaluate the missing fabric.",
        "The most difficult type of hole to sew up is one where there is actually fabric missing – as in a worn-out hole in the knees of trousers, or in the elbow of a jacket.",
        "Do not try to sew the hole up without adding any additional fabric.",
        "This will only pucker the fabric together, tugging at the shape of the garment and creating a messy lump.",
        "Use a reinforcing patch.",
        "If the hole is frayed into the seam line or somewhere in the middle of the garment (other than a seam), then you will need to reinforce the area.",
        "Cut to size a small piece of fabric of the same weight and color of the garment.",
        "Lay the patching fabric under the hole, right side up.",
        "Then, bring the edges of the hole as close together as possible, without puckering the hole.",
        "Use a small zig zag stitch on the sewing machine to stitch around the edges of hole, catching as much fabric (patch and garment) as possible to make the patch hold.",
        "This isn't going to be a \"pretty fix,\" but it should be serviceable.",
        "If the garment is casual, you can buy extra fabric in a contrasting color or pattern and sew patches in several areas to make the hole patch look decorative.",
        "Do this patch from the outside of the garment, or use appliqués in the same manner to add a designer touch.",
        "Strengthen the torn ends.",
        "Start stitching about an inch before the torn area.",
        "This is especially important if an existing stitch was loosened or ripped.",
        "Stitching a little back from the ends will support the fabric and stop further tearing.",
        "Slip the needle through the cloth, and carefully weave the thread in and out of the cloth.",
        "For consistency, try to keep the distance between each stitch to about 2 mm.",
        "If the hole is especially frayed, try reinforcing with a liquid seam sealant before you start stitching.",
        "This can help make the fix more sustainable.",
        "If the cloth is too tight, a stitch may tear again once you wear the garment.",
        "Try adding another layer of a piece of a cloth beneath the hole, and then stitching that cloth for added strength.",
        "Try stitching a button to the area, if it goes with the fabric.",
        "Consider darning the hole so the space is filled with many interlacing stitches.",
        "Circle back next to the first stitch.",
        "Repeat until there is nothing left to sew.",
        "If the cloth is badly frayed, it may require an \"over-locking.\"",
        "Hold the cloth and stitch it so that the frayed end is folded inwards.",
        "Fold the cloth one or two times, then stitch it \"shut\" to prevent the cloth from tearing again.",
        "Finish the job.",
        "Stretch and press the cloth.",
        "Take care that the thread does not get tangled midway through the stitch.",
        "Press the stitched area between your fingers.",
        "Then, run through the stitch to remove air gaps or unevenness of the cloth.",
        "To finish the job, make a knot and snip the thread.",
        "Patching a Hole Try using an iron-on patch for heavier fabrics.",
        "You can simply lay the patch over the hole, then iron it flat with enough heat that the patch binds to the fabric.",
        "Make sure to reinforce an iron-on patch with stitching around the edges.",
        "Trim the square corners to a rounded shape before ironing them onto the garment.",
        "Both the stitching and the corner trimming will increase the useful life of the patch.",
        "Iron-on patches are suitable for heavier fabrics such as denim and canvas.",
        "However, they may distort the shape of thinner fabrics.",
        "Make the patch discreet.",
        "If the hole is in a visible part of the garment, prepare the self patch from the inside.",
        "If this isn't possible, purchase fabric as close in color to the garment as possible in a fabric with the same properties.",
        "Alternately, pick a patch that stands out.",
        "For some, patched clothing is a stylistic choice.",
        "Hand-sew a patch for thinner fabrics.",
        "First, trim the frayed threads and treat the hole's edges with seam sealant.",
        "Make two patches: one with any fabric for the bottom, and one with the matching/self fabric for the top patch.",
        "Treat the edges of the bottom patch with seam sealant.",
        "Then, turn a small amount of fabric at the edge of your top patch, and iron this folded edge in place.",
        "Use the free embroidery settings on your sewing machine.",
        "Place the bottom patch underneath the hole, and run the lines of stitching very close together to completely catch all edges of the hole onto the bottom patch.",
        "Sew the bottom patch into place.",
        "Stitch back and forth, and up and down, creating a \"fabric\" of stitching across the hole or tear.",
        "Sew in straight stitch all around the edges of the bottom patch to keep the hole reinforced.",
        "Cover with the top patch.",
        "Place the folded-edge side down onto the fabric so it completely covers all the machine stitching.",
        "Hand-sew with matching thread (applique style) onto the top of the garment.",
        "Work the thread around it several times for strength.",
        "If you prefer a \"rustic\" look, you can also embroider with blanket stitch around this patch."
    ]
}