{
    "title": "How to Wash Your Hair Using Only Natural Ingredients",
    "url": "https://www.wikihow.com/Wash-Your-Hair-Using-Only-Natural-Ingredients",
    "category_hierarchy": [
        "Personal Care and Style",
        "Personal Hygiene"
    ],
    "methods": [
        {
            "name": "First Method",
            "steps": [
                {
                    "headline": "Dissolve about 1 tablespoon of baking soda in just enough water to make a paste.",
                    "description": "Apply this to your roots only; work it in and let it sit for a minute."
                },
                {
                    "headline": "In order to stimulate blood flow, clean your pores and get off built up grime, use your finger tips to scrub your scalp.",
                    "description": "Start by making a circle on the top of your head in the area you'd wear a crown. Focus on the back of this circle to begin with. Next, fill in the circle. This is where your part will be; grease here affects the way your hair looks. Trace while still scrubbing with your fingertips around the bottom edge of the circle. Keep making scrubbing circles underneath each one, drawing lines in circles around your head. Lastly, scrub the back of your skull and your temples/sideburns. This will result in less grease and more growth. After doing this, your scalp will feel alive. Many women swear their hair grows faster after a visit to the salon — it does, and this massage method is why."
                },
                {
                    "headline": "Next, pour about 2 tablespoons of apple cider vinegar into a cup and add water.",
                    "description": "(I keep two plastic 12-ounce cups in my shower and just mix when I get in.) After you rinse the baking soda out, pour the apple cider vinegar over the ends of your hair, let it sit for a minute and then rinse it out. That's all there is to it!"
                }
            ]
        },
        {
            "name": "Second Method (Using Soap Nuts)",
            "steps": [
                {
                    "headline": "Soak a handful of soap nuts (about 8-10 for medium-length hair) in about 300 ml of water overnight.",
                    "description": ""
                },
                {
                    "headline": "Next morning, squeeze and pulp the softened soap-nuts with your fingers.",
                    "description": "Discard the seeds."
                },
                {
                    "headline": "Use the resulting liquid just as you would use a shampoo, only more liberally.",
                    "description": ""
                },
                {
                    "headline": "Apply, leave it on for 2 minutes, and wash off.",
                    "description": "It's okay if some of the pulp gets into your hair - it'll all wash off. It will leave only a fresh clean feeling and a faint whiff of leaves."
                },
                {
                    "headline": "Use a natural conditioner if you find your hair too dry.",
                    "description": "You can use a beaten egg (leave it on for a few minutes,once you are ready in the shower), or coconut oil (applied and massaged into the hair 30 minutes in advance) before using the soap-nut solution."
                },
                {
                    "headline": "Discard any leftover liquid and all the pulp, as it can get smelly the next day.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "1 tablespoon of baking soda",
        "Apple cider vinegar",
        "3-4 Drops Of Your Favorite Essential Oil",
        "Lemon Juice",
        "Honey",
        "Virgin Unprocessed Coconut Oil",
        "Beeswax",
        "Second Method:",
        "Soap-nuts (called 'ritha' or 'areethhaa' in India, and available at most grocery shops)"
    ],
    "text": " First Method Dissolve about 1 tablespoon of baking soda in just enough water to make a paste. Apply this to your roots only; work it in and let it sit for a minute. In order to stimulate blood flow, clean your pores and get off built up grime, use your finger tips to scrub your scalp. Start by making a circle on the top of your head in the area you'd wear a crown. Focus on the back of this circle to begin with. Next, fill in the circle. This is where your part will be; grease here affects the way your hair looks. Trace while still scrubbing with your fingertips around the bottom edge of the circle. Keep making scrubbing circles underneath each one, drawing lines in circles around your head. Lastly, scrub the back of your skull and your temples/sideburns. This will result in less grease and more growth. After doing this, your scalp will feel alive. Many women swear their hair grows faster after a visit to the salon — it does, and this massage method is why. Next, pour about 2 tablespoons of apple cider vinegar into a cup and add water. (I keep two plastic 12-ounce cups in my shower and just mix when I get in.) After you rinse the baking soda out, pour the apple cider vinegar over the ends of your hair, let it sit for a minute and then rinse it out. That's all there is to it! Second Method (Using Soap Nuts) Soak a handful of soap nuts (about 8-10 for medium-length hair) in about 300 ml of water overnight.  Next morning, squeeze and pulp the softened soap-nuts with your fingers. Discard the seeds. Use the resulting liquid just as you would use a shampoo, only more liberally.  Apply, leave it on for 2 minutes, and wash off. It's okay if some of the pulp gets into your hair - it'll all wash off. It will leave only a fresh clean feeling and a faint whiff of leaves. Use a natural conditioner if you find your hair too dry. You can use a beaten egg (leave it on for a few minutes,once you are ready in the shower), or coconut oil (applied and massaged into the hair 30 minutes in advance) before using the soap-nut solution. Discard any leftover liquid and all the pulp, as it can get smelly the next day. ",
    "sentences": [
        " First Method Dissolve about 1 tablespoon of baking soda in just enough water to make a paste.",
        "Apply this to your roots only; work it in and let it sit for a minute.",
        "In order to stimulate blood flow, clean your pores and get off built up grime, use your finger tips to scrub your scalp.",
        "Start by making a circle on the top of your head in the area you'd wear a crown.",
        "Focus on the back of this circle to begin with.",
        "Next, fill in the circle.",
        "This is where your part will be; grease here affects the way your hair looks.",
        "Trace while still scrubbing with your fingertips around the bottom edge of the circle.",
        "Keep making scrubbing circles underneath each one, drawing lines in circles around your head.",
        "Lastly, scrub the back of your skull and your temples/sideburns.",
        "This will result in less grease and more growth.",
        "After doing this, your scalp will feel alive.",
        "Many women swear their hair grows faster after a visit to the salon — it does, and this massage method is why.",
        "Next, pour about 2 tablespoons of apple cider vinegar into a cup and add water.",
        "(I keep two plastic 12-ounce cups in my shower and just mix when I get in.)",
        "After you rinse the baking soda out, pour the apple cider vinegar over the ends of your hair, let it sit for a minute and then rinse it out.",
        "That's all there is to it!",
        "Second Method (Using Soap Nuts) Soak a handful of soap nuts (about 8-10 for medium-length hair) in about 300 ml of water overnight.",
        "Next morning, squeeze and pulp the softened soap-nuts with your fingers.",
        "Discard the seeds.",
        "Use the resulting liquid just as you would use a shampoo, only more liberally.",
        "Apply, leave it on for 2 minutes, and wash off.",
        "It's okay if some of the pulp gets into your hair - it'll all wash off.",
        "It will leave only a fresh clean feeling and a faint whiff of leaves.",
        "Use a natural conditioner if you find your hair too dry.",
        "You can use a beaten egg (leave it on for a few minutes,once you are ready in the shower), or coconut oil (applied and massaged into the hair 30 minutes in advance) before using the soap-nut solution.",
        "Discard any leftover liquid and all the pulp, as it can get smelly the next day."
    ]
}