{
    "title": "How to Repair a Snag in Berber Carpet",
    "url": "https://www.wikihow.com/Repair-a-Snag-in-Berber-Carpet",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Floors and Stairs",
        "Carpets and Rugs"
    ],
    "steps": [
        {
            "headline": "Look closely at the pulled loop of carpet.",
            "description": "Identify where the yarn is woven into the backing material and where it comes out to form the next loop. You may need to pull on the snagged loop to identify where the yarn goes next."
        },
        {
            "headline": "Place one knitting needle, screwdriver, or other long, thin tool through the snagged loop of carpet.",
            "description": "This will prevent you from pulling the loop all the way through the backing."
        },
        {
            "headline": "Using another knitting needle, screwdriver, or other long, thin tool, pull up the next loop in the carpet so that the snagged loop is pulled back down.",
            "description": "This may take some force. Leave the original snagged loop just slightly larger than the surrounding loops of carpet, so that the newly pulled-out loop is slightly smaller than the original snag."
        },
        {
            "headline": "Repeat this process, weaving the yarn through the backing, each time making the new pulled-out loop of carpet just a little smaller than the previous one.",
            "description": "Eventually you can work the snag back into the fabric of the carpet. The amount of time and number of loops this will take depends on how big the original snag is."
        },
        {
            "headline": "Alternately,If the Berber yarn has thrown more than a few loops, the row (s) can be cut and a new thread section can be re-adjusted in the area that needs repair.",
            "description": ""
        },
        {
            "headline": "Cut the area that needs repair.",
            "description": "This can be accomplished if you have some left-over berber from when the carpet was originally installed. If not, a small closet can be used for \"donor\" material."
        },
        {
            "headline": "Either way, use a new, sharp utility knife and cut out the backing of the area that needs repairing.",
            "description": "Cut close to the good rows of yarn without cutting into them. Take your donor carpet and match the pattern to the repair area. Cut a patch to fit the repair area, test fit, remove, put blob of hot glue in area of repair, place piece back into repair. Make sure repaired section is level with surrounding berber. If small snags are noted anywhere in berber, use sharp tool and gently press snag to where it is level with surrounding yarn."
        }
    ],
    "tyn": [
        "Two long, thin, stiff metal tools, such as knitting needles, ice pick or screwdrivers."
    ],
    "text": " Look closely at the pulled loop of carpet. Identify where the yarn is woven into the backing material and where it comes out to form the next loop. You may need to pull on the snagged loop to identify where the yarn goes next. Place one knitting needle, screwdriver, or other long, thin tool through the snagged loop of carpet. This will prevent you from pulling the loop all the way through the backing. Using another knitting needle, screwdriver, or other long, thin tool, pull up the next loop in the carpet so that the snagged loop is pulled back down. This may take some force. Leave the original snagged loop just slightly larger than the surrounding loops of carpet, so that the newly pulled-out loop is slightly smaller than the original snag. Repeat this process, weaving the yarn through the backing, each time making the new pulled-out loop of carpet just a little smaller than the previous one. Eventually you can work the snag back into the fabric of the carpet. The amount of time and number of loops this will take depends on how big the original snag is. Alternately,If the Berber yarn has thrown more than a few loops, the row (s) can be cut and a new thread section can be re-adjusted in the area that needs repair.  Cut the area that needs repair. This can be accomplished if you have some left-over berber from when the carpet was originally installed. If not, a small closet can be used for \"donor\" material. Either way, use a new, sharp utility knife and cut out the backing of the area that needs repairing. Cut close to the good rows of yarn without cutting into them. Take your donor carpet and match the pattern to the repair area. Cut a patch to fit the repair area, test fit, remove, put blob of hot glue in area of repair, place piece back into repair. Make sure repaired section is level with surrounding berber. If small snags are noted anywhere in berber, use sharp tool and gently press snag to where it is level with surrounding yarn.",
    "sentences": [
        " Look closely at the pulled loop of carpet.",
        "Identify where the yarn is woven into the backing material and where it comes out to form the next loop.",
        "You may need to pull on the snagged loop to identify where the yarn goes next.",
        "Place one knitting needle, screwdriver, or other long, thin tool through the snagged loop of carpet.",
        "This will prevent you from pulling the loop all the way through the backing.",
        "Using another knitting needle, screwdriver, or other long, thin tool, pull up the next loop in the carpet so that the snagged loop is pulled back down.",
        "This may take some force.",
        "Leave the original snagged loop just slightly larger than the surrounding loops of carpet, so that the newly pulled-out loop is slightly smaller than the original snag.",
        "Repeat this process, weaving the yarn through the backing, each time making the new pulled-out loop of carpet just a little smaller than the previous one.",
        "Eventually you can work the snag back into the fabric of the carpet.",
        "The amount of time and number of loops this will take depends on how big the original snag is.",
        "Alternately,If the Berber yarn has thrown more than a few loops, the row (s) can be cut and a new thread section can be re-adjusted in the area that needs repair.",
        "Cut the area that needs repair.",
        "This can be accomplished if you have some left-over berber from when the carpet was originally installed.",
        "If not, a small closet can be used for \"donor\" material.",
        "Either way, use a new, sharp utility knife and cut out the backing of the area that needs repairing.",
        "Cut close to the good rows of yarn without cutting into them.",
        "Take your donor carpet and match the pattern to the repair area.",
        "Cut a patch to fit the repair area, test fit, remove, put blob of hot glue in area of repair, place piece back into repair.",
        "Make sure repaired section is level with surrounding berber.",
        "If small snags are noted anywhere in berber, use sharp tool and gently press snag to where it is level with surrounding yarn."
    ]
}