{
    "title": "How to Replace a Blown Bike Tire Inner Tube",
    "url": "https://www.wikihow.com/Replace-a-Blown-Bike-Tire-Inner-Tube",
    "category_hierarchy": [
        "Cars & Other Vehicles"
    ],
    "steps": [
        {
            "headline": "Prepare a travel bag containing all of the tools and equipment necessary to replace a blown inner tube.",
            "description": "In order to assemble this bag, you must determine several things:\nThe size of inner tube that the tire requires. This is often printed on the side of the inner tube or on the side of the tire itself. If you cannot find the size of the inner tube, consult your owner’s manual or manufacturer’s website. The type of valve your tube uses. This is either a Schrader valve or a Presta valve. Schrader valves are found on less expensive or older bikes, while Presta valves are often found on high end racing bikes. A Schrader valve is wider, and looks like the valve found on a car tire, while the Presta valve is much skinnier. The easiest way to determine what valve your inner tube uses is to consult your owner’s manual or manufacturer’s website. If you cannot find this information, ask a local bike shop employee. This information is critical in selecting the bike pump you will bring, because if the valve of the pump does not correspond to the valve of the tire, it will be impossible to inflate the inner tube. The size of wrench that is used to loosen the 4 nuts that hold your bicycle wheel’s axle in the frame. The measurements of these nuts can be found in the owner’s manual or manufacturer’s website. If you cannot find this information, a simple solution is to test out wrenches on the bolt until you find a wrench that is a snug fit to the nut. It is recommended that you bring a set of wrenches, ensuring you will have the right tools for the job. Make sure that if your bike uses metric nuts, you bring a metric set of wrenches and vice versa. A wrench is not necessary if both wheels are equipped with quick release levers."
        },
        {
            "headline": "Detach the wheel with the blown inner tube using a wrench or your wheel’s quick release lever.",
            "description": "This is done easiest with the bike resting upside down, balanced on the seat and the handlebars."
        },
        {
            "headline": "Remove the tire from the rim once the wheel is detached from the bike using a tire lever.",
            "description": "This is done by pushing the narrow end of the tire lever between the tire and the rim, and then using the lever to lift the edge of the tire over the rim. Caution: Be sure to remove the dust cover from the valve stem, and use extra care when removing the valve stem from the rim."
        },
        {
            "headline": "Once the tire is off, the inner tube is easily removed from the interior from the tire.",
            "description": ""
        },
        {
            "headline": "Partially inflate the new inner tube just enough that the tube forms a circular shape.",
            "description": "This makes it easier to fit the tube into the tire."
        },
        {
            "headline": "Push the tire back into the rim, being sure to match the valve of the inner tube with the valve hole cut into the rim.",
            "description": "Without practice, this may be difficult to get the entire tire around the rim. Use the tire lever to assist you. If you are having a great deal of difficulty, ask a fellow biker, as having an extra set of hands can make this task much easier."
        },
        {
            "headline": "Reattach the wheel by tightening the nuts on the axle and ensuring that the wheel is secured to the frame.",
            "description": ""
        }
    ],
    "tyn": [
        "A bicycle inner tube of the correct size and with the correct valve (Presta or Schrader).",
        "A wrench or wrench set fitted to the 4 nuts that connect the axel of the bicycle wheels to the frame of the bike.",
        "Again, make sure that the valves of the air pump and the inner tube match. If they don’t, it will be impossible to inflate the inner tube.",
        "2 tire levers, which will be used to remove the tire from the inner tube."
    ],
    "text": " Prepare a travel bag containing all of the tools and equipment necessary to replace a blown inner tube. In order to assemble this bag, you must determine several things:\nThe size of inner tube that the tire requires. This is often printed on the side of the inner tube or on the side of the tire itself. If you cannot find the size of the inner tube, consult your owner’s manual or manufacturer’s website. The type of valve your tube uses. This is either a Schrader valve or a Presta valve. Schrader valves are found on less expensive or older bikes, while Presta valves are often found on high end racing bikes. A Schrader valve is wider, and looks like the valve found on a car tire, while the Presta valve is much skinnier. The easiest way to determine what valve your inner tube uses is to consult your owner’s manual or manufacturer’s website. If you cannot find this information, ask a local bike shop employee. This information is critical in selecting the bike pump you will bring, because if the valve of the pump does not correspond to the valve of the tire, it will be impossible to inflate the inner tube. The size of wrench that is used to loosen the 4 nuts that hold your bicycle wheel’s axle in the frame. The measurements of these nuts can be found in the owner’s manual or manufacturer’s website. If you cannot find this information, a simple solution is to test out wrenches on the bolt until you find a wrench that is a snug fit to the nut. It is recommended that you bring a set of wrenches, ensuring you will have the right tools for the job. Make sure that if your bike uses metric nuts, you bring a metric set of wrenches and vice versa. A wrench is not necessary if both wheels are equipped with quick release levers. Detach the wheel with the blown inner tube using a wrench or your wheel’s quick release lever. This is done easiest with the bike resting upside down, balanced on the seat and the handlebars. Remove the tire from the rim once the wheel is detached from the bike using a tire lever. This is done by pushing the narrow end of the tire lever between the tire and the rim, and then using the lever to lift the edge of the tire over the rim. Caution: Be sure to remove the dust cover from the valve stem, and use extra care when removing the valve stem from the rim. Once the tire is off, the inner tube is easily removed from the interior from the tire.  Partially inflate the new inner tube just enough that the tube forms a circular shape. This makes it easier to fit the tube into the tire. Push the tire back into the rim, being sure to match the valve of the inner tube with the valve hole cut into the rim. Without practice, this may be difficult to get the entire tire around the rim. Use the tire lever to assist you. If you are having a great deal of difficulty, ask a fellow biker, as having an extra set of hands can make this task much easier. Reattach the wheel by tightening the nuts on the axle and ensuring that the wheel is secured to the frame. ",
    "sentences": [
        " Prepare a travel bag containing all of the tools and equipment necessary to replace a blown inner tube.",
        "In order to assemble this bag, you must determine several things:\nThe size of inner tube that the tire requires.",
        "This is often printed on the side of the inner tube or on the side of the tire itself.",
        "If you cannot find the size of the inner tube, consult your owner’s manual or manufacturer’s website.",
        "The type of valve your tube uses.",
        "This is either a Schrader valve or a Presta valve.",
        "Schrader valves are found on less expensive or older bikes, while Presta valves are often found on high end racing bikes.",
        "A Schrader valve is wider, and looks like the valve found on a car tire, while the Presta valve is much skinnier.",
        "The easiest way to determine what valve your inner tube uses is to consult your owner’s manual or manufacturer’s website.",
        "If you cannot find this information, ask a local bike shop employee.",
        "This information is critical in selecting the bike pump you will bring, because if the valve of the pump does not correspond to the valve of the tire, it will be impossible to inflate the inner tube.",
        "The size of wrench that is used to loosen the 4 nuts that hold your bicycle wheel’s axle in the frame.",
        "The measurements of these nuts can be found in the owner’s manual or manufacturer’s website.",
        "If you cannot find this information, a simple solution is to test out wrenches on the bolt until you find a wrench that is a snug fit to the nut.",
        "It is recommended that you bring a set of wrenches, ensuring you will have the right tools for the job.",
        "Make sure that if your bike uses metric nuts, you bring a metric set of wrenches and vice versa.",
        "A wrench is not necessary if both wheels are equipped with quick release levers.",
        "Detach the wheel with the blown inner tube using a wrench or your wheel’s quick release lever.",
        "This is done easiest with the bike resting upside down, balanced on the seat and the handlebars.",
        "Remove the tire from the rim once the wheel is detached from the bike using a tire lever.",
        "This is done by pushing the narrow end of the tire lever between the tire and the rim, and then using the lever to lift the edge of the tire over the rim.",
        "Caution: Be sure to remove the dust cover from the valve stem, and use extra care when removing the valve stem from the rim.",
        "Once the tire is off, the inner tube is easily removed from the interior from the tire.",
        "Partially inflate the new inner tube just enough that the tube forms a circular shape.",
        "This makes it easier to fit the tube into the tire.",
        "Push the tire back into the rim, being sure to match the valve of the inner tube with the valve hole cut into the rim.",
        "Without practice, this may be difficult to get the entire tire around the rim.",
        "Use the tire lever to assist you.",
        "If you are having a great deal of difficulty, ask a fellow biker, as having an extra set of hands can make this task much easier.",
        "Reattach the wheel by tightening the nuts on the axle and ensuring that the wheel is secured to the frame."
    ]
}