{
    "title": "How to Make a Cup Anemometer",
    "url": "https://www.wikihow.com/Make-a-Cup-Anemometer",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science",
        "Meteorology"
    ],
    "parts": [
        {
            "name": "Cutting the Cups",
            "steps": [
                {
                    "headline": "Make one incision on four cups.",
                    "description": "Use plastic or paper cups. Use scissors to cut out a hole that is large enough to insert a straw or small stick. You should make the hole a little less than halfway down the cup. This is where your cup will connect to the center cup. Note to kids:  use scissors under adult supervision."
                },
                {
                    "headline": "Cut four holes under the lip of the center cup.",
                    "description": "Ideally, these holes will be evenly spaced around the top of the cup, just under the lip. This will help the anemometer stay balanced as it turns. The holes should be the same size as those you cut into the four outer cups."
                },
                {
                    "headline": "Cut a hole in the bottom of the center cup.",
                    "description": "Make this hole large enough to insert a pencil or other small pole. It should be exactly in the center of the cup’s base. This hole will allow you to set the center post in your anemometer."
                }
            ]
        },
        {
            "name": "Building the Anemometer",
            "steps": [
                {
                    "headline": "Staple a straw to two of the outer cups.",
                    "description": "Push the straw through the hole of the outer cup until it reaches the opposite edge. Then bend the end of the straw that is touching the opposite edge down against the inside edge of the cup. Staple the straw into place. Repeat this process for a second cup, but not for all four cups. The last two cups will be assembled differently. For children:  have a responsible adult present for stapling."
                },
                {
                    "headline": "Push two straws through the center cup.",
                    "description": "Each straw should enter at one side of the center cup and exit on the opposite side through two of the top holes. The straws should cross in the middle and form an “X” in the center of the cup. Be sure to center the straw so that there is the same length of straw on each side of the cup. These are the straws that are already attached to two outer cups. Don’t forget to account for the length of straw that is inside your two outer cups."
                },
                {
                    "headline": "Staple the last two outer cups onto the straws.",
                    "description": "First, slide the cups onto the straws. Make sure that the straw goes all the way to the opposite edge of the cup. Bend down the end of the straw like you did for the first two cups and staple it. Now all four cups should be identical and they should all be attached to the center cup at an equal distance and facing the same direction."
                },
                {
                    "headline": "Mark one cup.",
                    "description": "It doesn’t matter which cup you mark, Choose one and place an “X” on it. This will make it easier for you to count the number of turns your anemometer makes in the wind."
                },
                {
                    "headline": "Insert the center post.",
                    "description": "The center post can be made from a pencil or small pole. It should go up through the bottom hole of the center cup until it touches the straws. If you are using a pencil, make sure that the eraser is on top (touching the straws) and the sharp end is on the bottom. If you aren’t using a pencil, use a pole that is soft enough to push a pin through."
                },
                {
                    "headline": "Pin the straws to the center post.",
                    "description": "A small pin or tack should be used to fasten the straws to the center post. This will prevent the straws from moving side to side as the wind pushes on the outer cups. The pin should be pushed down from the top through both straws and into the center post. Push the pin down as securely as possible so that they don't move while you're using your anemometer."
                }
            ]
        },
        {
            "name": "Calibrating the Anemometer",
            "steps": [
                {
                    "headline": "Ask someone to take you for a slow ride in a car.",
                    "description": "Have them drive down a street that isn’t busy at ten miles per hour. This will create a steady and controlled amount of wind. Try to calibrate your anemometer on a day that is not very windy, as natural wind could alter the results. Do not attempt to drive and calibrate the anemometer alone."
                },
                {
                    "headline": "Hold your anemometer out the window.",
                    "description": "Grasping only the center post, hold the anemometer out the window. Make sure that there is plenty of clearance and that you will not hit your arm on something (e.g. another car). Be careful not to drop the anemometer."
                },
                {
                    "headline": "Count the number of revolutions.",
                    "description": "Watch the anemometer for fifteen seconds. Watch to see how many times the cup with the “X” passes you. This will be the number of revolutions that correspond to a ten miles per hour wind."
                },
                {
                    "headline": "Make a calibration chart.",
                    "description": "Calibrate your anemometer to several different speeds. Write down the number of rotations the anemometer makes in fifteen seconds at each speed. Put the speeds and their corresponding revolutions into a chart so that you can easily identify different wind speeds."
                },
                {
                    "headline": "Experiment with your anemometer by measuring wind speed.",
                    "description": "Take your anemometer outside. Set the timer on your phone for 1 minute or ask a friend or family member to watch a clock to time you. Count the number of revolutions that your anemometer makes in that minute. This is your revolutions per minute (RPM), which you can use to calculate the wind speed!Use this formula to calculate wind speed in miles per hour (MPH): RPM X 0.2142 = Wind Speed\nFor example, if your anemometer makes 5 revolutions in 1 minute, then you'd multiply 5 times 0.2142 to get 1.071. This means that your wind speed is 1 mph."
                }
            ]
        }
    ],
    "tyn": [
        "Five Cups",
        "Scissors",
        "Two Straws",
        "Stapler",
        "Pencil",
        "Pin"
    ],
    "text": " Cutting the Cups Make one incision on four cups. Use plastic or paper cups. Use scissors to cut out a hole that is large enough to insert a straw or small stick. You should make the hole a little less than halfway down the cup. This is where your cup will connect to the center cup. Note to kids:  use scissors under adult supervision. Cut four holes under the lip of the center cup. Ideally, these holes will be evenly spaced around the top of the cup, just under the lip. This will help the anemometer stay balanced as it turns. The holes should be the same size as those you cut into the four outer cups. Cut a hole in the bottom of the center cup. Make this hole large enough to insert a pencil or other small pole. It should be exactly in the center of the cup’s base. This hole will allow you to set the center post in your anemometer. Building the Anemometer Staple a straw to two of the outer cups. Push the straw through the hole of the outer cup until it reaches the opposite edge. Then bend the end of the straw that is touching the opposite edge down against the inside edge of the cup. Staple the straw into place. Repeat this process for a second cup, but not for all four cups. The last two cups will be assembled differently. For children:  have a responsible adult present for stapling. Push two straws through the center cup. Each straw should enter at one side of the center cup and exit on the opposite side through two of the top holes. The straws should cross in the middle and form an “X” in the center of the cup. Be sure to center the straw so that there is the same length of straw on each side of the cup. These are the straws that are already attached to two outer cups. Don’t forget to account for the length of straw that is inside your two outer cups. Staple the last two outer cups onto the straws. First, slide the cups onto the straws. Make sure that the straw goes all the way to the opposite edge of the cup. Bend down the end of the straw like you did for the first two cups and staple it. Now all four cups should be identical and they should all be attached to the center cup at an equal distance and facing the same direction. Mark one cup. It doesn’t matter which cup you mark, Choose one and place an “X” on it. This will make it easier for you to count the number of turns your anemometer makes in the wind. Insert the center post. The center post can be made from a pencil or small pole. It should go up through the bottom hole of the center cup until it touches the straws. If you are using a pencil, make sure that the eraser is on top (touching the straws) and the sharp end is on the bottom. If you aren’t using a pencil, use a pole that is soft enough to push a pin through. Pin the straws to the center post. A small pin or tack should be used to fasten the straws to the center post. This will prevent the straws from moving side to side as the wind pushes on the outer cups. The pin should be pushed down from the top through both straws and into the center post. Push the pin down as securely as possible so that they don't move while you're using your anemometer. Calibrating the Anemometer Ask someone to take you for a slow ride in a car. Have them drive down a street that isn’t busy at ten miles per hour. This will create a steady and controlled amount of wind. Try to calibrate your anemometer on a day that is not very windy, as natural wind could alter the results. Do not attempt to drive and calibrate the anemometer alone. Hold your anemometer out the window. Grasping only the center post, hold the anemometer out the window. Make sure that there is plenty of clearance and that you will not hit your arm on something (e.g. another car). Be careful not to drop the anemometer. Count the number of revolutions. Watch the anemometer for fifteen seconds. Watch to see how many times the cup with the “X” passes you. This will be the number of revolutions that correspond to a ten miles per hour wind. Make a calibration chart. Calibrate your anemometer to several different speeds. Write down the number of rotations the anemometer makes in fifteen seconds at each speed. Put the speeds and their corresponding revolutions into a chart so that you can easily identify different wind speeds. Experiment with your anemometer by measuring wind speed. Take your anemometer outside. Set the timer on your phone for 1 minute or ask a friend or family member to watch a clock to time you. Count the number of revolutions that your anemometer makes in that minute. This is your revolutions per minute (RPM), which you can use to calculate the wind speed!Use this formula to calculate wind speed in miles per hour (MPH): RPM X 0.2142 = Wind Speed\nFor example, if your anemometer makes 5 revolutions in 1 minute, then you'd multiply 5 times 0.2142 to get 1.071. This means that your wind speed is 1 mph.",
    "sentences": [
        " Cutting the Cups Make one incision on four cups.",
        "Use plastic or paper cups.",
        "Use scissors to cut out a hole that is large enough to insert a straw or small stick.",
        "You should make the hole a little less than halfway down the cup.",
        "This is where your cup will connect to the center cup.",
        "Note to kids:  use scissors under adult supervision.",
        "Cut four holes under the lip of the center cup.",
        "Ideally, these holes will be evenly spaced around the top of the cup, just under the lip.",
        "This will help the anemometer stay balanced as it turns.",
        "The holes should be the same size as those you cut into the four outer cups.",
        "Cut a hole in the bottom of the center cup.",
        "Make this hole large enough to insert a pencil or other small pole.",
        "It should be exactly in the center of the cup’s base.",
        "This hole will allow you to set the center post in your anemometer.",
        "Building the Anemometer Staple a straw to two of the outer cups.",
        "Push the straw through the hole of the outer cup until it reaches the opposite edge.",
        "Then bend the end of the straw that is touching the opposite edge down against the inside edge of the cup.",
        "Staple the straw into place.",
        "Repeat this process for a second cup, but not for all four cups.",
        "The last two cups will be assembled differently.",
        "For children:  have a responsible adult present for stapling.",
        "Push two straws through the center cup.",
        "Each straw should enter at one side of the center cup and exit on the opposite side through two of the top holes.",
        "The straws should cross in the middle and form an “X” in the center of the cup.",
        "Be sure to center the straw so that there is the same length of straw on each side of the cup.",
        "These are the straws that are already attached to two outer cups.",
        "Don’t forget to account for the length of straw that is inside your two outer cups.",
        "Staple the last two outer cups onto the straws.",
        "First, slide the cups onto the straws.",
        "Make sure that the straw goes all the way to the opposite edge of the cup.",
        "Bend down the end of the straw like you did for the first two cups and staple it.",
        "Now all four cups should be identical and they should all be attached to the center cup at an equal distance and facing the same direction.",
        "Mark one cup.",
        "It doesn’t matter which cup you mark, Choose one and place an “X” on it.",
        "This will make it easier for you to count the number of turns your anemometer makes in the wind.",
        "Insert the center post.",
        "The center post can be made from a pencil or small pole.",
        "It should go up through the bottom hole of the center cup until it touches the straws.",
        "If you are using a pencil, make sure that the eraser is on top (touching the straws) and the sharp end is on the bottom.",
        "If you aren’t using a pencil, use a pole that is soft enough to push a pin through.",
        "Pin the straws to the center post.",
        "A small pin or tack should be used to fasten the straws to the center post.",
        "This will prevent the straws from moving side to side as the wind pushes on the outer cups.",
        "The pin should be pushed down from the top through both straws and into the center post.",
        "Push the pin down as securely as possible so that they don't move while you're using your anemometer.",
        "Calibrating the Anemometer Ask someone to take you for a slow ride in a car.",
        "Have them drive down a street that isn’t busy at ten miles per hour.",
        "This will create a steady and controlled amount of wind.",
        "Try to calibrate your anemometer on a day that is not very windy, as natural wind could alter the results.",
        "Do not attempt to drive and calibrate the anemometer alone.",
        "Hold your anemometer out the window.",
        "Grasping only the center post, hold the anemometer out the window.",
        "Make sure that there is plenty of clearance and that you will not hit your arm on something (e.g.",
        "another car).",
        "Be careful not to drop the anemometer.",
        "Count the number of revolutions.",
        "Watch the anemometer for fifteen seconds.",
        "Watch to see how many times the cup with the “X” passes you.",
        "This will be the number of revolutions that correspond to a ten miles per hour wind.",
        "Make a calibration chart.",
        "Calibrate your anemometer to several different speeds.",
        "Write down the number of rotations the anemometer makes in fifteen seconds at each speed.",
        "Put the speeds and their corresponding revolutions into a chart so that you can easily identify different wind speeds.",
        "Experiment with your anemometer by measuring wind speed.",
        "Take your anemometer outside.",
        "Set the timer on your phone for 1 minute or ask a friend or family member to watch a clock to time you.",
        "Count the number of revolutions that your anemometer makes in that minute.",
        "This is your revolutions per minute (RPM), which you can use to calculate the wind speed!Use this formula to calculate wind speed in miles per hour (MPH): RPM X 0.2142 = Wind Speed\nFor example, if your anemometer makes 5 revolutions in 1 minute, then you'd multiply 5 times 0.2142 to get 1.071.",
        "This means that your wind speed is 1 mph."
    ]
}