{
    "title": "How to Stick a Pencil to the Ceiling",
    "url": "https://www.wikihow.com/Stick-a-Pencil-to-the-Ceiling",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Fun Activities",
        "Tricks",
        "Tricks with Objects",
        "Pencil Tricks"
    ],
    "steps": [
        {
            "headline": "Stab the flat end of the pencil (or end with eraser) into a school glue stick, about 1–2 centimeter (0.4–0.8 in) in (up to three quarters of an inch)",
            "description": ""
        },
        {
            "headline": "Take it out and see if there is a \"glob\" of glue on the end.",
            "description": "If there isn't, put it back in, and take it out on an angle to get some glue."
        },
        {
            "headline": "Move the glue onto the end of the pencil, make sure it is on tight and won't come off too easily.",
            "description": ""
        },
        {
            "headline": "Holding the sharpened end with the glue downwards, (preferably just below the height of a desk) check for a teacher, the best time to do this is when a teacher has left the room.",
            "description": ""
        },
        {
            "headline": "Fling the pencil up.",
            "description": "Just a quick flick will do."
        },
        {
            "headline": "Look for it moving on the ceiling.",
            "description": "If it is moving, it may come back down."
        },
        {
            "headline": "Another simpler version to complete this task is to sharpen your pencil, and flick it at the ceiling so that it goes in like an arrow.",
            "description": "Many classrooms have soft ceiling tiles, similar to the consistency of Styrofoam."
        }
    ],
    "tyn": [
        "Pencil",
        "School glue stick"
    ],
    "text": " Stab the flat end of the pencil (or end with eraser) into a school glue stick, about 1–2 centimeter (0.4–0.8 in) in (up to three quarters of an inch)  Take it out and see if there is a \"glob\" of glue on the end. If there isn't, put it back in, and take it out on an angle to get some glue. Move the glue onto the end of the pencil, make sure it is on tight and won't come off too easily.  Holding the sharpened end with the glue downwards, (preferably just below the height of a desk) check for a teacher, the best time to do this is when a teacher has left the room.  Fling the pencil up. Just a quick flick will do. Look for it moving on the ceiling. If it is moving, it may come back down. Another simpler version to complete this task is to sharpen your pencil, and flick it at the ceiling so that it goes in like an arrow. Many classrooms have soft ceiling tiles, similar to the consistency of Styrofoam.",
    "sentences": [
        " Stab the flat end of the pencil (or end with eraser) into a school glue stick, about 1–2 centimeter (0.4–0.8 in) in (up to three quarters of an inch)  Take it out and see if there is a \"glob\" of glue on the end.",
        "If there isn't, put it back in, and take it out on an angle to get some glue.",
        "Move the glue onto the end of the pencil, make sure it is on tight and won't come off too easily.",
        "Holding the sharpened end with the glue downwards, (preferably just below the height of a desk) check for a teacher, the best time to do this is when a teacher has left the room.",
        "Fling the pencil up.",
        "Just a quick flick will do.",
        "Look for it moving on the ceiling.",
        "If it is moving, it may come back down.",
        "Another simpler version to complete this task is to sharpen your pencil, and flick it at the ceiling so that it goes in like an arrow.",
        "Many classrooms have soft ceiling tiles, similar to the consistency of Styrofoam."
    ]
}