{
    "title": "How to Use a Flint Stick",
    "url": "https://www.wikihow.com/Use-a-Flint-Stick",
    "category_hierarchy": [
        "Home and Garden",
        "Heating and Cooling",
        "Fire",
        "Fire Making"
    ],
    "steps": [
        {
            "headline": "Put dried grass, leaves, or paper into a small pile that will be used as tinder.",
            "description": ""
        },
        {
            "headline": "Put the flint stick end near the edge of the pile.",
            "description": ""
        },
        {
            "headline": "Use the piece of steel to scrape the flint roughly, causing sparks to go into the pile.",
            "description": ""
        },
        {
            "headline": "Continue until the fire starts.",
            "description": "(If no fire is created from sparks alone, scrape some of the flint into filings on your tinder; then light these filings with sparks)"
        },
        {
            "headline": "To keep the fire going, add dry wood of gradually increasing size.",
            "description": ""
        }
    ],
    "tyn": [
        "A flint stick",
        "A piece of steel",
        "Dry leaves, grass, or paper",
        "Wood",
        "Water",
        "Stones"
    ],
    "text": " Put dried grass, leaves, or paper into a small pile that will be used as tinder.  Put the flint stick end near the edge of the pile.  Use the piece of steel to scrape the flint roughly, causing sparks to go into the pile.  Continue until the fire starts. (If no fire is created from sparks alone, scrape some of the flint into filings on your tinder; then light these filings with sparks) To keep the fire going, add dry wood of gradually increasing size. ",
    "sentences": [
        " Put dried grass, leaves, or paper into a small pile that will be used as tinder.",
        "Put the flint stick end near the edge of the pile.",
        "Use the piece of steel to scrape the flint roughly, causing sparks to go into the pile.",
        "Continue until the fire starts.",
        "(If no fire is created from sparks alone, scrape some of the flint into filings on your tinder; then light these filings with sparks) To keep the fire going, add dry wood of gradually increasing size."
    ]
}