{
    "title": "How to Make Natural Outdoor Fly Repellent with Essential Oils",
    "url": "https://www.wikihow.com/Make-Natural-Outdoor-Fly-Repellent-with-Essential-Oils",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Pest Control",
        "Fly Control"
    ],
    "methods": [
        {
            "name": "Making Fly Repellent for Outdoor Areas",
            "steps": [
                {
                    "headline": "Gather supplies.",
                    "description": "This outdoor fly repellent can be placed in the center of your patio table to repel flies throughout the day and evening. It's a simple mix of essential oils and a carrier oil that will help diffuse the scent into the air, naturally keeping flies away. Here's what you'll need:\nA small tin with a lid. A small coffee can, mint tin or cough drop tin would work. A clean piece of cloth or a dish sponge. 2 tablespoons vegetable oil. 2 tablespoons witch hazel (or vodka, if you don't have witch hazel). 100 drops essential oils."
                },
                {
                    "headline": "Make an essential oil blend.",
                    "description": "Several essential oils have properties that keep flies away. They also work well on mosquitoes and other pests. Essential oils can be found at health food stores or ordered in bulk online. You can use 100 drops of the same oil, or a blend of any of the following:\n\nLavender oil - lavender is considered to be particularly effective against flies. It has many other household uses as well. Citronella oil - this ingredient is commonly used in candles meant to keep flies and other bugs away. Eucalyptus oil - another great essential oil you can use around the house for all types of purposes. Peppermint oil - this is likely more effective against mosquitoes  but also considered to work against horse flies."
                },
                {
                    "headline": "Mix the essential oils with the vegetable oil and witch hazel (or vodka).",
                    "description": "Pour all of the ingredients together into a bowl, and stir until combined. Diluting the essential oils will keep them from immediately evaporating and help them diffuse into the air. All essential oils should be diluted before use; especially if you want to apply them directly to your skin. Use an extra 1/2 teaspoon of vodka in the mixture will help preserve it for a second use."
                },
                {
                    "headline": "Saturate the cloth or sponge with the mixture.",
                    "description": "Place the cloth in the tin and pour the mixture inside so that it completely saturates the cloth or sponge. Place the cloth in the tin and shut the lid. Allow to sit for 24 hours."
                },
                {
                    "headline": "Open the lid to use the repellent.",
                    "description": "Whenever you need to use the tin, remove the lid and place on the entertaining table. Make as many as you wish to put around the entertaining area to deter flies."
                },
                {
                    "headline": "Replenish the oil every few uses.",
                    "description": "Once open to the air, the strength weakens and needs to be topped up. Sprinkle more essential oils inside, or make another blend."
                }
            ]
        },
        {
            "name": "Making Fly Repellent Spray",
            "steps": [
                {
                    "headline": "Gather supplies.",
                    "description": "This fly repellent spray has been used for centuries to ward away bugs, and it really works. It has a strong smell when you first spray it on your body, but the smell will fade as the mixture dries. Here's what you need:\n1/2 cup witch hazel\n1/2 cup apple cider vinegar\n30-50 drops of essential oils. Choose any combination of citronella, clove, lemongrass, rosemary, tea tree, cajeput, eucalyptus, cedar, catnip, lavender, or mint."
                },
                {
                    "headline": "Pour the ingredients into an empty spray bottle.",
                    "description": "You can use an old one that has been cleaned out with soap and water, or buy a new one from the drugstore to reserve for this use."
                },
                {
                    "headline": "Spray the formula onto your skin.",
                    "description": "Shake the bottle and spray it on your hands, arms, legs, and other uncovered areas. Allow it to fully dry, and reapply when necessary. Avoid getting repellent in your eyes or mouth. You can use this formula on most clothing as well. Test on a small section first to make sure it won't discolor the fabric. Do not spray this on children or pets without verifying the safety of the oil involved. For example, tea tree oil is very toxic to cats. Remember, never apply undiluted essential oil to your skin. Make sure you mix it with a carrier liquid to dilute it first."
                }
            ]
        },
        {
            "name": "Making a Fly Repellent Oil Rub",
            "steps": [
                {
                    "headline": "Try tea tree, lavender or eucalyptus oil.",
                    "description": "These three oils are most effective against flies. To make an oil rub from these powerful oils, it's important to dilute them with a carrier oil. Make a 2% solution by adding 12 drops of your chosen essential oil per 1 fl. oz (30ml) of carrier oil, such as olive oil. Apply it to your wrists, neck and other pulse points to keep flies away. Keep extra oil in a small vial so you can apply it again when necessary. Applying undiluted essential oils directly onto skin (even lavender or tea tree oil) can result in sensitization, which means that you may become so sensitive to the oil that any contact will cause skin irritation."
                },
                {
                    "headline": "Try mint oil.",
                    "description": "Mint is another natural fly repellent, and it has that classic, sweet mint fragrance. Peppermint, spearmint, catnip are fantastic at shooing away unwanted flies and keeping you smelling great. Make a 2% solution by adding 12 drops of peppermint essential oil per 1 fl. oz (30ml) of carrier oil, such as olive oil. Rub it directly on your skin."
                },
                {
                    "headline": "Use basil oil.",
                    "description": "Basil is another strong-smelling herb that flies generally dislike, and basil is especially helpful against moths. Make a 2% solution by adding 12 drops of basil essential oil per 1 fl. oz (30ml) of carrier oil, such as olive oil. Rub it directly on your skin."
                }
            ]
        }
    ],
    "tyn": [
        "Small tin with lid; ideal tins include confectionery tins, cough drop tins, candle tins etc.",
        "Small piece of cloth, for example, calico, cotton, handkerchief etc.; or cut a piece of dish sponge down to size",
        "Carrier oil",
        "Witch hazel or vodka",
        "Essential oils",
        "Spray bottle",
        "Apple cider vinegar"
    ],
    "text": " Making Fly Repellent for Outdoor Areas Gather supplies. This outdoor fly repellent can be placed in the center of your patio table to repel flies throughout the day and evening. It's a simple mix of essential oils and a carrier oil that will help diffuse the scent into the air, naturally keeping flies away. Here's what you'll need:\nA small tin with a lid. A small coffee can, mint tin or cough drop tin would work. A clean piece of cloth or a dish sponge. 2 tablespoons vegetable oil. 2 tablespoons witch hazel (or vodka, if you don't have witch hazel). 100 drops essential oils. Make an essential oil blend. Several essential oils have properties that keep flies away. They also work well on mosquitoes and other pests. Essential oils can be found at health food stores or ordered in bulk online. You can use 100 drops of the same oil, or a blend of any of the following:\n\nLavender oil - lavender is considered to be particularly effective against flies. It has many other household uses as well. Citronella oil - this ingredient is commonly used in candles meant to keep flies and other bugs away. Eucalyptus oil - another great essential oil you can use around the house for all types of purposes. Peppermint oil - this is likely more effective against mosquitoes  but also considered to work against horse flies. Mix the essential oils with the vegetable oil and witch hazel (or vodka). Pour all of the ingredients together into a bowl, and stir until combined. Diluting the essential oils will keep them from immediately evaporating and help them diffuse into the air. All essential oils should be diluted before use; especially if you want to apply them directly to your skin. Use an extra 1/2 teaspoon of vodka in the mixture will help preserve it for a second use. Saturate the cloth or sponge with the mixture. Place the cloth in the tin and pour the mixture inside so that it completely saturates the cloth or sponge. Place the cloth in the tin and shut the lid. Allow to sit for 24 hours. Open the lid to use the repellent. Whenever you need to use the tin, remove the lid and place on the entertaining table. Make as many as you wish to put around the entertaining area to deter flies. Replenish the oil every few uses. Once open to the air, the strength weakens and needs to be topped up. Sprinkle more essential oils inside, or make another blend. Making Fly Repellent Spray Gather supplies. This fly repellent spray has been used for centuries to ward away bugs, and it really works. It has a strong smell when you first spray it on your body, but the smell will fade as the mixture dries. Here's what you need:\n1/2 cup witch hazel\n1/2 cup apple cider vinegar\n30-50 drops of essential oils. Choose any combination of citronella, clove, lemongrass, rosemary, tea tree, cajeput, eucalyptus, cedar, catnip, lavender, or mint. Pour the ingredients into an empty spray bottle. You can use an old one that has been cleaned out with soap and water, or buy a new one from the drugstore to reserve for this use. Spray the formula onto your skin. Shake the bottle and spray it on your hands, arms, legs, and other uncovered areas. Allow it to fully dry, and reapply when necessary. Avoid getting repellent in your eyes or mouth. You can use this formula on most clothing as well. Test on a small section first to make sure it won't discolor the fabric. Do not spray this on children or pets without verifying the safety of the oil involved. For example, tea tree oil is very toxic to cats. Remember, never apply undiluted essential oil to your skin. Make sure you mix it with a carrier liquid to dilute it first. Making a Fly Repellent Oil Rub Try tea tree, lavender or eucalyptus oil. These three oils are most effective against flies. To make an oil rub from these powerful oils, it's important to dilute them with a carrier oil. Make a 2% solution by adding 12 drops of your chosen essential oil per 1 fl. oz (30ml) of carrier oil, such as olive oil. Apply it to your wrists, neck and other pulse points to keep flies away. Keep extra oil in a small vial so you can apply it again when necessary. Applying undiluted essential oils directly onto skin (even lavender or tea tree oil) can result in sensitization, which means that you may become so sensitive to the oil that any contact will cause skin irritation. Try mint oil. Mint is another natural fly repellent, and it has that classic, sweet mint fragrance. Peppermint, spearmint, catnip are fantastic at shooing away unwanted flies and keeping you smelling great. Make a 2% solution by adding 12 drops of peppermint essential oil per 1 fl. oz (30ml) of carrier oil, such as olive oil. Rub it directly on your skin. Use basil oil. Basil is another strong-smelling herb that flies generally dislike, and basil is especially helpful against moths. Make a 2% solution by adding 12 drops of basil essential oil per 1 fl. oz (30ml) of carrier oil, such as olive oil. Rub it directly on your skin.",
    "sentences": [
        " Making Fly Repellent for Outdoor Areas Gather supplies.",
        "This outdoor fly repellent can be placed in the center of your patio table to repel flies throughout the day and evening.",
        "It's a simple mix of essential oils and a carrier oil that will help diffuse the scent into the air, naturally keeping flies away.",
        "Here's what you'll need:\nA small tin with a lid.",
        "A small coffee can, mint tin or cough drop tin would work.",
        "A clean piece of cloth or a dish sponge.",
        "2 tablespoons vegetable oil.",
        "2 tablespoons witch hazel (or vodka, if you don't have witch hazel).",
        "100 drops essential oils.",
        "Make an essential oil blend.",
        "Several essential oils have properties that keep flies away.",
        "They also work well on mosquitoes and other pests.",
        "Essential oils can be found at health food stores or ordered in bulk online.",
        "You can use 100 drops of the same oil, or a blend of any of the following:\n\nLavender oil - lavender is considered to be particularly effective against flies.",
        "It has many other household uses as well.",
        "Citronella oil - this ingredient is commonly used in candles meant to keep flies and other bugs away.",
        "Eucalyptus oil - another great essential oil you can use around the house for all types of purposes.",
        "Peppermint oil - this is likely more effective against mosquitoes  but also considered to work against horse flies.",
        "Mix the essential oils with the vegetable oil and witch hazel (or vodka).",
        "Pour all of the ingredients together into a bowl, and stir until combined.",
        "Diluting the essential oils will keep them from immediately evaporating and help them diffuse into the air.",
        "All essential oils should be diluted before use; especially if you want to apply them directly to your skin.",
        "Use an extra 1/2 teaspoon of vodka in the mixture will help preserve it for a second use.",
        "Saturate the cloth or sponge with the mixture.",
        "Place the cloth in the tin and pour the mixture inside so that it completely saturates the cloth or sponge.",
        "Place the cloth in the tin and shut the lid.",
        "Allow to sit for 24 hours.",
        "Open the lid to use the repellent.",
        "Whenever you need to use the tin, remove the lid and place on the entertaining table.",
        "Make as many as you wish to put around the entertaining area to deter flies.",
        "Replenish the oil every few uses.",
        "Once open to the air, the strength weakens and needs to be topped up.",
        "Sprinkle more essential oils inside, or make another blend.",
        "Making Fly Repellent Spray Gather supplies.",
        "This fly repellent spray has been used for centuries to ward away bugs, and it really works.",
        "It has a strong smell when you first spray it on your body, but the smell will fade as the mixture dries.",
        "Here's what you need:\n1/2 cup witch hazel\n1/2 cup apple cider vinegar\n30-50 drops of essential oils.",
        "Choose any combination of citronella, clove, lemongrass, rosemary, tea tree, cajeput, eucalyptus, cedar, catnip, lavender, or mint.",
        "Pour the ingredients into an empty spray bottle.",
        "You can use an old one that has been cleaned out with soap and water, or buy a new one from the drugstore to reserve for this use.",
        "Spray the formula onto your skin.",
        "Shake the bottle and spray it on your hands, arms, legs, and other uncovered areas.",
        "Allow it to fully dry, and reapply when necessary.",
        "Avoid getting repellent in your eyes or mouth.",
        "You can use this formula on most clothing as well.",
        "Test on a small section first to make sure it won't discolor the fabric.",
        "Do not spray this on children or pets without verifying the safety of the oil involved.",
        "For example, tea tree oil is very toxic to cats.",
        "Remember, never apply undiluted essential oil to your skin.",
        "Make sure you mix it with a carrier liquid to dilute it first.",
        "Making a Fly Repellent Oil Rub Try tea tree, lavender or eucalyptus oil.",
        "These three oils are most effective against flies.",
        "To make an oil rub from these powerful oils, it's important to dilute them with a carrier oil.",
        "Make a 2% solution by adding 12 drops of your chosen essential oil per 1 fl.",
        "oz (30ml) of carrier oil, such as olive oil.",
        "Apply it to your wrists, neck and other pulse points to keep flies away.",
        "Keep extra oil in a small vial so you can apply it again when necessary.",
        "Applying undiluted essential oils directly onto skin (even lavender or tea tree oil) can result in sensitization, which means that you may become so sensitive to the oil that any contact will cause skin irritation.",
        "Try mint oil.",
        "Mint is another natural fly repellent, and it has that classic, sweet mint fragrance.",
        "Peppermint, spearmint, catnip are fantastic at shooing away unwanted flies and keeping you smelling great.",
        "Make a 2% solution by adding 12 drops of peppermint essential oil per 1 fl.",
        "oz (30ml) of carrier oil, such as olive oil.",
        "Rub it directly on your skin.",
        "Use basil oil.",
        "Basil is another strong-smelling herb that flies generally dislike, and basil is especially helpful against moths.",
        "Make a 2% solution by adding 12 drops of basil essential oil per 1 fl.",
        "oz (30ml) of carrier oil, such as olive oil.",
        "Rub it directly on your skin."
    ]
}