{
    "title": "How to Make Fresh Breadcrumbs",
    "url": "https://www.wikihow.com/Make-Fresh-Breadcrumbs",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills"
    ],
    "methods": [
        {
            "name": "Grating or Processing Breadcrumbs",
            "steps": [
                {
                    "headline": "Select the appropriate type of bread.",
                    "description": "The best bread style to use for breadcrumbs is white or whole wheat breads without seeds, large grains, or other additions like raisins or berries. Avoid using bread that is very soft by nature, especially supermarket sliced breads aimed at the sandwich-making market. Some of the stronger white or whole wheat breads like French, or Italian style loaves tend to work well for making fresh breadcrumbs."
                },
                {
                    "headline": "Use a grater to make breadcrumbs.",
                    "description": "Handling the bread is easiest if you have a loaf of unsliced bread, but a slice of bread of works well too. To make fresh breadcrumbs with a grater:\nCut a large slice of unsliced bread that is comfortable to hold by hand, or pick out a slice of bread from a sliced loaf and cut off the crusts. Hold the sliced end against the grater. Choose a side with wider teeth holes. Grate the bread. The bread will begin to crumble against the teeth and fall down in uneven pieces. Continue grating until your fingers are near the grater. Stop grating before you injure your fingers. Simply discard the last portion of bread. Repeat with other large slices as needed."
                },
                {
                    "headline": "Use a processor to make breadcrumbs.",
                    "description": "A food processor is great for chopping soft foods up and grating them finely. Remove all crusts from the bread, using only the soft centre. Break the bread into small pieces. Even though a processor will do a good job, it will clog up quickly if there is too much bread to break down. Process in batches. Process until the crumbs look fine enough for your needs. Remove from the processor and use fresh."
                },
                {
                    "headline": "Refrigerate fresh breadcrumbs.",
                    "description": "If you want to store fresh breadcrumbs, keep them refrigerated and in an airtight container. Use by the date specified on the bread or within a few days of making. . Breadcrumbs can also be stored in the freezer. Use them within 3 months and thaw them in the refrigerator."
                }
            ]
        },
        {
            "name": "Making Breadcrumbs by Freezing",
            "steps": [
                {
                    "headline": "Select the appropriate type of bread.",
                    "description": "The best bread style to use for breadcrumbs is white or whole wheat breads without seeds, large grains, or other additions like raisins or berries. Avoid using bread that is very soft by nature, especially supermarket sliced breads aimed at the sandwich-making market. Some of the stronger white or whole wheat breads like French, or Italian style loaves tend to work well for making fresh breadcrumbs."
                },
                {
                    "headline": "Cut the crusts off.",
                    "description": "Select the number of bread slices you'd like to use and cut off the crusts of each slice. If you're using loaves of bread, dig out the soft centre of the bread. About 4 slices of regular-sized bread will make 1 cup of breadcrumbs."
                },
                {
                    "headline": "Place the bread in a freezer.",
                    "description": "Put your bread in a freezer bag or a plastic ziplock bag. Pop it in the freezer for at least an hour or until the bread is frozen solid. You can leave the bread in the freezer for up to 2 months after its expiration date."
                },
                {
                    "headline": "Grate the frozen slices.",
                    "description": "Grate each slice, one by one, on a metal grater. The crumbs will be visibly finer and even in texture than if you had grated the bread in room temperature. Your breadcrumbs will eventually thaw to room temperature and will have obtained its fresh taste due to it being frozen."
                }
            ]
        }
    ],
    "tyn": [
        "Bread",
        "Grater",
        "Food processor",
        "Freezer"
    ],
    "text": " Grating or Processing Breadcrumbs Select the appropriate type of bread. The best bread style to use for breadcrumbs is white or whole wheat breads without seeds, large grains, or other additions like raisins or berries. Avoid using bread that is very soft by nature, especially supermarket sliced breads aimed at the sandwich-making market. Some of the stronger white or whole wheat breads like French, or Italian style loaves tend to work well for making fresh breadcrumbs. Use a grater to make breadcrumbs. Handling the bread is easiest if you have a loaf of unsliced bread, but a slice of bread of works well too. To make fresh breadcrumbs with a grater:\nCut a large slice of unsliced bread that is comfortable to hold by hand, or pick out a slice of bread from a sliced loaf and cut off the crusts. Hold the sliced end against the grater. Choose a side with wider teeth holes. Grate the bread. The bread will begin to crumble against the teeth and fall down in uneven pieces. Continue grating until your fingers are near the grater. Stop grating before you injure your fingers. Simply discard the last portion of bread. Repeat with other large slices as needed. Use a processor to make breadcrumbs. A food processor is great for chopping soft foods up and grating them finely. Remove all crusts from the bread, using only the soft centre. Break the bread into small pieces. Even though a processor will do a good job, it will clog up quickly if there is too much bread to break down. Process in batches. Process until the crumbs look fine enough for your needs. Remove from the processor and use fresh. Refrigerate fresh breadcrumbs. If you want to store fresh breadcrumbs, keep them refrigerated and in an airtight container. Use by the date specified on the bread or within a few days of making. . Breadcrumbs can also be stored in the freezer. Use them within 3 months and thaw them in the refrigerator. Making Breadcrumbs by Freezing Select the appropriate type of bread. The best bread style to use for breadcrumbs is white or whole wheat breads without seeds, large grains, or other additions like raisins or berries. Avoid using bread that is very soft by nature, especially supermarket sliced breads aimed at the sandwich-making market. Some of the stronger white or whole wheat breads like French, or Italian style loaves tend to work well for making fresh breadcrumbs. Cut the crusts off. Select the number of bread slices you'd like to use and cut off the crusts of each slice. If you're using loaves of bread, dig out the soft centre of the bread. About 4 slices of regular-sized bread will make 1 cup of breadcrumbs. Place the bread in a freezer. Put your bread in a freezer bag or a plastic ziplock bag. Pop it in the freezer for at least an hour or until the bread is frozen solid. You can leave the bread in the freezer for up to 2 months after its expiration date. Grate the frozen slices. Grate each slice, one by one, on a metal grater. The crumbs will be visibly finer and even in texture than if you had grated the bread in room temperature. Your breadcrumbs will eventually thaw to room temperature and will have obtained its fresh taste due to it being frozen.",
    "sentences": [
        " Grating or Processing Breadcrumbs Select the appropriate type of bread.",
        "The best bread style to use for breadcrumbs is white or whole wheat breads without seeds, large grains, or other additions like raisins or berries.",
        "Avoid using bread that is very soft by nature, especially supermarket sliced breads aimed at the sandwich-making market.",
        "Some of the stronger white or whole wheat breads like French, or Italian style loaves tend to work well for making fresh breadcrumbs.",
        "Use a grater to make breadcrumbs.",
        "Handling the bread is easiest if you have a loaf of unsliced bread, but a slice of bread of works well too.",
        "To make fresh breadcrumbs with a grater:\nCut a large slice of unsliced bread that is comfortable to hold by hand, or pick out a slice of bread from a sliced loaf and cut off the crusts.",
        "Hold the sliced end against the grater.",
        "Choose a side with wider teeth holes.",
        "Grate the bread.",
        "The bread will begin to crumble against the teeth and fall down in uneven pieces.",
        "Continue grating until your fingers are near the grater.",
        "Stop grating before you injure your fingers.",
        "Simply discard the last portion of bread.",
        "Repeat with other large slices as needed.",
        "Use a processor to make breadcrumbs.",
        "A food processor is great for chopping soft foods up and grating them finely.",
        "Remove all crusts from the bread, using only the soft centre.",
        "Break the bread into small pieces.",
        "Even though a processor will do a good job, it will clog up quickly if there is too much bread to break down.",
        "Process in batches.",
        "Process until the crumbs look fine enough for your needs.",
        "Remove from the processor and use fresh.",
        "Refrigerate fresh breadcrumbs.",
        "If you want to store fresh breadcrumbs, keep them refrigerated and in an airtight container.",
        "Use by the date specified on the bread or within a few days of making.",
        ".",
        "Breadcrumbs can also be stored in the freezer.",
        "Use them within 3 months and thaw them in the refrigerator.",
        "Making Breadcrumbs by Freezing Select the appropriate type of bread.",
        "The best bread style to use for breadcrumbs is white or whole wheat breads without seeds, large grains, or other additions like raisins or berries.",
        "Avoid using bread that is very soft by nature, especially supermarket sliced breads aimed at the sandwich-making market.",
        "Some of the stronger white or whole wheat breads like French, or Italian style loaves tend to work well for making fresh breadcrumbs.",
        "Cut the crusts off.",
        "Select the number of bread slices you'd like to use and cut off the crusts of each slice.",
        "If you're using loaves of bread, dig out the soft centre of the bread.",
        "About 4 slices of regular-sized bread will make 1 cup of breadcrumbs.",
        "Place the bread in a freezer.",
        "Put your bread in a freezer bag or a plastic ziplock bag.",
        "Pop it in the freezer for at least an hour or until the bread is frozen solid.",
        "You can leave the bread in the freezer for up to 2 months after its expiration date.",
        "Grate the frozen slices.",
        "Grate each slice, one by one, on a metal grater.",
        "The crumbs will be visibly finer and even in texture than if you had grated the bread in room temperature.",
        "Your breadcrumbs will eventually thaw to room temperature and will have obtained its fresh taste due to it being frozen."
    ]
}