{
    "title": "How to Make a Sparkly Pencil",
    "url": "https://www.wikihow.com/Make-a-Sparkly-Pencil",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Craft for Kids"
    ],
    "methods": [
        {
            "name": "Coating a Pencil with Glitter and Glue",
            "steps": [
                {
                    "headline": "Set up your workstation.",
                    "description": "Fold a sheet of paper in half to make a crease, then unfold it. Set the paper down on top of your table with the pointed part of the crease facing down. Next, squirt some glue into a disposable cup or lid. You can use white school glue, tacky glue, or decoupage glue. Don't use clear school glue. It is not sticky enough."
                },
                {
                    "headline": "Use a paintbrush to apply glue over a pencil.",
                    "description": "Hold your pencil by the end where the eraser is. Dip a flat paintbrush into the glue, then wipe off any excess on the rim. Brush the glue over the entire pencil, except for the eraser and metal crimp. Unsharpened pencils will look the nicest, but you can use sharpened pencils too. If you want to use more than 1 color of glitter for an ombre effect, apply the glue only to where you want the first color to go."
                },
                {
                    "headline": "Sprinkle glitter onto the pencil, rotating it as you go.",
                    "description": "Hold a jar of glitter over the pencil. Shake the glitter onto the pencil as you twirl it between your fingers. The excess glitter will pile onto the creased paper. You can roll the pencil across the glitter to pick any excess up if you want to. Make sure that you use enough glitter so that you can't see the glue anymore. Hold the pencil horizontal and parallel to the table. This way you will be able to get more glitter on it."
                },
                {
                    "headline": "Tap the excess glitter off and funnel the rest into the jar.",
                    "description": "Gently tap the pencil against your finger to knock any excess off. Set the pencil aside, then use the creased paper to funnel the rest of the glitter back into its jar. If the glitter looks rough and \"fuzzy,\" press it into the glue with your fingers."
                },
                {
                    "headline": "Apply more glue and glitter if you are doing an ombre effect.",
                    "description": "If you left space for another color, now is the time to apply more glue and glitter. You can add as many colors as you want, just make sure to work 1 color at a time. Also, pour each color of glitter back into its jar as soon as you are done with it. If you applied the glitter thickly enough, then the other colors should not stick to the previous ones."
                },
                {
                    "headline": "Set the pencil aside to dry for at least 1 to 2 hours.",
                    "description": "Lean the eraser part of the pencil against something, like the disposable cup you poured the glue into. If you used a sharpened pencil, you can stick the pint into a ball of clay or play dough so that it stands upright. The glue may take at least 1 to 2 hours to dry, so be patient. Don't worry if your glitter looks cloudy or dull at first. It will become more sparkly once the glue dries. The glue must be completely dry before the next step, or the glitter may come off."
                },
                {
                    "headline": "Paint the glittered parts with glue nail polish to prevent shedding.",
                    "description": "If you don't have clear nail polish, use a clean, flat paintbrush to apply glossy decoupage glue or glossy acrylic sealer instead. You can use the brush that came with the bottle of nail polish, or you can use a new brush. Choose a brush with synthetic bristles, not camelhair. Do not use regular white school glue or tacky glue for this step. They are too matte and opaque and will dull the glitter down."
                },
                {
                    "headline": "Let the pencil dry completely before you use it.",
                    "description": "Lean the eraser part of an unsharpened pencil against something, or stick a sharpened pencil into a ball of clay or play dough. How long the pencil takes to dry depends on the type of sealer you used. Expect to wait at least 1 to 2 hours."
                }
            ]
        },
        {
            "name": "Wrapping a Pencil with Glitter Tape",
            "steps": [
                {
                    "headline": "Buy some rolls of glitter tape.",
                    "description": "You can use glitter washi tape or you can use glitter scotch tape. You can find them in the tape section and scrapbooking section of a craft store. For a more colorful pencil, buy more rolls in different colors."
                },
                {
                    "headline": "Wrap some glitter tape around the pencil, just below the eraser crimp.",
                    "description": "Use a pair of scissors to cut off the excess tape, then fold the end down. Try to get the tape to end exactly where it began. A 1 in (2.5 cm) overlap is okay, though. This completes your first row. Sharpened pencils work the best for this, but you can do it with unsharpened pencils too."
                },
                {
                    "headline": "Continue to wrap strips of tape around the pencil until you reach the other end.",
                    "description": "Place each row just beneath the previous one, so that the edges touch. Keep the overlaps on the same side of the pencil to create a nice seam. You can switch to a different color of glitter tape whenever you want to. If you are using a sharpened pencil, stop where the painted part ends, and the wooden part begins."
                },
                {
                    "headline": "Paint the pencil with decoupage glue to prevent peeling and shedding.",
                    "description": "Hold the pencil by the eraser. Dip a flat paintbrush or a foam brush into a jar of glossy decoupage glue (i.e. Mod Podge). Apply the glue to the glittery part of the pencil, from 1 end to the other. Make sure that you use decoupage glue with a glossy finish; otherwise, the glitter won't sparkle. If you can't find glossy decoupage glue, try glossy acrylic sealer or clear nail polish."
                },
                {
                    "headline": "Let the pencil dry before you use it.",
                    "description": "If you used a sharpened pencil, stick the sharpened end into a ball of play dough or clay. This will hold the pencil as it dries. If you used an unsharpened pencil, lean the eraser part against something so that the actual pencil does not touch the table. The pencil will need a few hours to dry. The decoupage glue will look dull at first, but then it will turn clear."
                },
                {
                    "headline": "Peel the tape away when you want to sharpen the pencil.",
                    "description": "Use your fingernail to peel away the first 1 to 2 rows of glitter tape. Stick the pencil into a pencil sharpener, and sharpen it. It is now ready to use! How many rows of tape you peel off depends on how wide the tape is. You want to peel enough so that it doesn't get caught in the pencil sharpener."
                }
            ]
        },
        {
            "name": "Painting a Pencil with Glitter Nail Polish",
            "steps": [
                {
                    "headline": "Paint a pencil using a metallic or glossy nail polish.",
                    "description": "Glitter nail polish is clear, so the pencil's original color will show through. Hold your pencil by the eraser, and paint it with glossy or metallic nail polish. Do not use glitter or matte nail polish for this step. Skip this step if you like the color of your pencil and don't mind it showing through the glitter. You can use acrylic paint for this step if you can't find any nail polish that you like."
                },
                {
                    "headline": "Let the pencil dry for 10 to 15 minutes.",
                    "description": "Stick the pointed end of a sharpened pencil into a ball of clay or play dough so that it stands upright. Lean an unsharpened pencil by the eraser against something, like a jar. Wait for 10 to 15 minutes for the nail polish or paint to dry."
                },
                {
                    "headline": "Add a second coat of metallic or glassy nail polish if needed.",
                    "description": "After about 10 minutes, check the pencil and see if you like the color. If the polish looks streaky, or if the pencil is showing through, you will need another coat. Hold the pencil by the eraser, and paint it again using the same color as before."
                },
                {
                    "headline": "Apply a coat of glitter nail polish or glitter paint.",
                    "description": "You can match the color of the glitter to the color of the polish, or you can use contrasting colors. For example, you can use gold glitter polish over a gold pencil, or red glitter polish over a red pencil. Here are some more ideas:\nGold glitter polish over a black pencil or green. Silver glitter polish over a white or light blue pencil. Iridescent glitter polish over a black or white pencil."
                },
                {
                    "headline": "Let the glitter polish dry, then add more coats, if desired.",
                    "description": "The more coats of glitter polish you add, the more glittery the pencil will become. Remember to let each coat of glitter polish dry for about 10 minutes before adding the next coat. About 2 to 3 coats will be plenty. Keep in mind that you probably won't be able to make it as glittery as in any of the other methods."
                },
                {
                    "headline": "Apply a coat of clear nail polish if you want to protect the glitter.",
                    "description": "Glitter nail polish is great in that it does not shed. It would not hurt to apply a coat of clear nail polish over it, however. This will protect the nail polish and keep it from rubbing off. Nail polish is very durable, so it should not chip off. Adding a coat of clear polish will help protect it, however, in case it does chip."
                },
                {
                    "headline": "Wait at least 1 hour before using the pencil.",
                    "description": "Just because nail polish feels dry does not mean that it is dry underneath. Wait at least 1 hour before checking on your pencil. If the pencil feels soft, or if you can make a dent in it with your fingernail, you need to wait longer."
                }
            ]
        }
    ],
    "tyn": [
        "Coating a Pencil with Glitter and Glue",
        "Pencil",
        "Glitter",
        "Paintbrush",
        "Glue",
        "Clear nail polish or glossy sealer",
        "Clay or play dough (for sharpened pencils)",
        "Wrapping a Pencil with Glitter Tape",
        "Glitter tape",
        "Scissors",
        "Clear nail polish or glossy sealer (recommended)",
        "Painting a Pencil with Glitter Nail Polish",
        "Regular nail polish (glossy or metallic)",
        "Glittery nail polish",
        "Clear nail polish"
    ],
    "text": " Coating a Pencil with Glitter and Glue Set up your workstation. Fold a sheet of paper in half to make a crease, then unfold it. Set the paper down on top of your table with the pointed part of the crease facing down. Next, squirt some glue into a disposable cup or lid. You can use white school glue, tacky glue, or decoupage glue. Don't use clear school glue. It is not sticky enough. Use a paintbrush to apply glue over a pencil. Hold your pencil by the end where the eraser is. Dip a flat paintbrush into the glue, then wipe off any excess on the rim. Brush the glue over the entire pencil, except for the eraser and metal crimp. Unsharpened pencils will look the nicest, but you can use sharpened pencils too. If you want to use more than 1 color of glitter for an ombre effect, apply the glue only to where you want the first color to go. Sprinkle glitter onto the pencil, rotating it as you go. Hold a jar of glitter over the pencil. Shake the glitter onto the pencil as you twirl it between your fingers. The excess glitter will pile onto the creased paper. You can roll the pencil across the glitter to pick any excess up if you want to. Make sure that you use enough glitter so that you can't see the glue anymore. Hold the pencil horizontal and parallel to the table. This way you will be able to get more glitter on it. Tap the excess glitter off and funnel the rest into the jar. Gently tap the pencil against your finger to knock any excess off. Set the pencil aside, then use the creased paper to funnel the rest of the glitter back into its jar. If the glitter looks rough and \"fuzzy,\" press it into the glue with your fingers. Apply more glue and glitter if you are doing an ombre effect. If you left space for another color, now is the time to apply more glue and glitter. You can add as many colors as you want, just make sure to work 1 color at a time. Also, pour each color of glitter back into its jar as soon as you are done with it. If you applied the glitter thickly enough, then the other colors should not stick to the previous ones. Set the pencil aside to dry for at least 1 to 2 hours. Lean the eraser part of the pencil against something, like the disposable cup you poured the glue into. If you used a sharpened pencil, you can stick the pint into a ball of clay or play dough so that it stands upright. The glue may take at least 1 to 2 hours to dry, so be patient. Don't worry if your glitter looks cloudy or dull at first. It will become more sparkly once the glue dries. The glue must be completely dry before the next step, or the glitter may come off. Paint the glittered parts with glue nail polish to prevent shedding. If you don't have clear nail polish, use a clean, flat paintbrush to apply glossy decoupage glue or glossy acrylic sealer instead. You can use the brush that came with the bottle of nail polish, or you can use a new brush. Choose a brush with synthetic bristles, not camelhair. Do not use regular white school glue or tacky glue for this step. They are too matte and opaque and will dull the glitter down. Let the pencil dry completely before you use it. Lean the eraser part of an unsharpened pencil against something, or stick a sharpened pencil into a ball of clay or play dough. How long the pencil takes to dry depends on the type of sealer you used. Expect to wait at least 1 to 2 hours. Wrapping a Pencil with Glitter Tape Buy some rolls of glitter tape. You can use glitter washi tape or you can use glitter scotch tape. You can find them in the tape section and scrapbooking section of a craft store. For a more colorful pencil, buy more rolls in different colors. Wrap some glitter tape around the pencil, just below the eraser crimp. Use a pair of scissors to cut off the excess tape, then fold the end down. Try to get the tape to end exactly where it began. A 1 in (2.5 cm) overlap is okay, though. This completes your first row. Sharpened pencils work the best for this, but you can do it with unsharpened pencils too. Continue to wrap strips of tape around the pencil until you reach the other end. Place each row just beneath the previous one, so that the edges touch. Keep the overlaps on the same side of the pencil to create a nice seam. You can switch to a different color of glitter tape whenever you want to. If you are using a sharpened pencil, stop where the painted part ends, and the wooden part begins. Paint the pencil with decoupage glue to prevent peeling and shedding. Hold the pencil by the eraser. Dip a flat paintbrush or a foam brush into a jar of glossy decoupage glue (i.e. Mod Podge). Apply the glue to the glittery part of the pencil, from 1 end to the other. Make sure that you use decoupage glue with a glossy finish; otherwise, the glitter won't sparkle. If you can't find glossy decoupage glue, try glossy acrylic sealer or clear nail polish. Let the pencil dry before you use it. If you used a sharpened pencil, stick the sharpened end into a ball of play dough or clay. This will hold the pencil as it dries. If you used an unsharpened pencil, lean the eraser part against something so that the actual pencil does not touch the table. The pencil will need a few hours to dry. The decoupage glue will look dull at first, but then it will turn clear. Peel the tape away when you want to sharpen the pencil. Use your fingernail to peel away the first 1 to 2 rows of glitter tape. Stick the pencil into a pencil sharpener, and sharpen it. It is now ready to use! How many rows of tape you peel off depends on how wide the tape is. You want to peel enough so that it doesn't get caught in the pencil sharpener. Painting a Pencil with Glitter Nail Polish Paint a pencil using a metallic or glossy nail polish. Glitter nail polish is clear, so the pencil's original color will show through. Hold your pencil by the eraser, and paint it with glossy or metallic nail polish. Do not use glitter or matte nail polish for this step. Skip this step if you like the color of your pencil and don't mind it showing through the glitter. You can use acrylic paint for this step if you can't find any nail polish that you like. Let the pencil dry for 10 to 15 minutes. Stick the pointed end of a sharpened pencil into a ball of clay or play dough so that it stands upright. Lean an unsharpened pencil by the eraser against something, like a jar. Wait for 10 to 15 minutes for the nail polish or paint to dry. Add a second coat of metallic or glassy nail polish if needed. After about 10 minutes, check the pencil and see if you like the color. If the polish looks streaky, or if the pencil is showing through, you will need another coat. Hold the pencil by the eraser, and paint it again using the same color as before. Apply a coat of glitter nail polish or glitter paint. You can match the color of the glitter to the color of the polish, or you can use contrasting colors. For example, you can use gold glitter polish over a gold pencil, or red glitter polish over a red pencil. Here are some more ideas:\nGold glitter polish over a black pencil or green. Silver glitter polish over a white or light blue pencil. Iridescent glitter polish over a black or white pencil. Let the glitter polish dry, then add more coats, if desired. The more coats of glitter polish you add, the more glittery the pencil will become. Remember to let each coat of glitter polish dry for about 10 minutes before adding the next coat. About 2 to 3 coats will be plenty. Keep in mind that you probably won't be able to make it as glittery as in any of the other methods. Apply a coat of clear nail polish if you want to protect the glitter. Glitter nail polish is great in that it does not shed. It would not hurt to apply a coat of clear nail polish over it, however. This will protect the nail polish and keep it from rubbing off. Nail polish is very durable, so it should not chip off. Adding a coat of clear polish will help protect it, however, in case it does chip. Wait at least 1 hour before using the pencil. Just because nail polish feels dry does not mean that it is dry underneath. Wait at least 1 hour before checking on your pencil. If the pencil feels soft, or if you can make a dent in it with your fingernail, you need to wait longer.",
    "sentences": [
        " Coating a Pencil with Glitter and Glue Set up your workstation.",
        "Fold a sheet of paper in half to make a crease, then unfold it.",
        "Set the paper down on top of your table with the pointed part of the crease facing down.",
        "Next, squirt some glue into a disposable cup or lid.",
        "You can use white school glue, tacky glue, or decoupage glue.",
        "Don't use clear school glue.",
        "It is not sticky enough.",
        "Use a paintbrush to apply glue over a pencil.",
        "Hold your pencil by the end where the eraser is.",
        "Dip a flat paintbrush into the glue, then wipe off any excess on the rim.",
        "Brush the glue over the entire pencil, except for the eraser and metal crimp.",
        "Unsharpened pencils will look the nicest, but you can use sharpened pencils too.",
        "If you want to use more than 1 color of glitter for an ombre effect, apply the glue only to where you want the first color to go.",
        "Sprinkle glitter onto the pencil, rotating it as you go.",
        "Hold a jar of glitter over the pencil.",
        "Shake the glitter onto the pencil as you twirl it between your fingers.",
        "The excess glitter will pile onto the creased paper.",
        "You can roll the pencil across the glitter to pick any excess up if you want to.",
        "Make sure that you use enough glitter so that you can't see the glue anymore.",
        "Hold the pencil horizontal and parallel to the table.",
        "This way you will be able to get more glitter on it.",
        "Tap the excess glitter off and funnel the rest into the jar.",
        "Gently tap the pencil against your finger to knock any excess off.",
        "Set the pencil aside, then use the creased paper to funnel the rest of the glitter back into its jar.",
        "If the glitter looks rough and \"fuzzy,\" press it into the glue with your fingers.",
        "Apply more glue and glitter if you are doing an ombre effect.",
        "If you left space for another color, now is the time to apply more glue and glitter.",
        "You can add as many colors as you want, just make sure to work 1 color at a time.",
        "Also, pour each color of glitter back into its jar as soon as you are done with it.",
        "If you applied the glitter thickly enough, then the other colors should not stick to the previous ones.",
        "Set the pencil aside to dry for at least 1 to 2 hours.",
        "Lean the eraser part of the pencil against something, like the disposable cup you poured the glue into.",
        "If you used a sharpened pencil, you can stick the pint into a ball of clay or play dough so that it stands upright.",
        "The glue may take at least 1 to 2 hours to dry, so be patient.",
        "Don't worry if your glitter looks cloudy or dull at first.",
        "It will become more sparkly once the glue dries.",
        "The glue must be completely dry before the next step, or the glitter may come off.",
        "Paint the glittered parts with glue nail polish to prevent shedding.",
        "If you don't have clear nail polish, use a clean, flat paintbrush to apply glossy decoupage glue or glossy acrylic sealer instead.",
        "You can use the brush that came with the bottle of nail polish, or you can use a new brush.",
        "Choose a brush with synthetic bristles, not camelhair.",
        "Do not use regular white school glue or tacky glue for this step.",
        "They are too matte and opaque and will dull the glitter down.",
        "Let the pencil dry completely before you use it.",
        "Lean the eraser part of an unsharpened pencil against something, or stick a sharpened pencil into a ball of clay or play dough.",
        "How long the pencil takes to dry depends on the type of sealer you used.",
        "Expect to wait at least 1 to 2 hours.",
        "Wrapping a Pencil with Glitter Tape Buy some rolls of glitter tape.",
        "You can use glitter washi tape or you can use glitter scotch tape.",
        "You can find them in the tape section and scrapbooking section of a craft store.",
        "For a more colorful pencil, buy more rolls in different colors.",
        "Wrap some glitter tape around the pencil, just below the eraser crimp.",
        "Use a pair of scissors to cut off the excess tape, then fold the end down.",
        "Try to get the tape to end exactly where it began.",
        "A 1 in (2.5 cm) overlap is okay, though.",
        "This completes your first row.",
        "Sharpened pencils work the best for this, but you can do it with unsharpened pencils too.",
        "Continue to wrap strips of tape around the pencil until you reach the other end.",
        "Place each row just beneath the previous one, so that the edges touch.",
        "Keep the overlaps on the same side of the pencil to create a nice seam.",
        "You can switch to a different color of glitter tape whenever you want to.",
        "If you are using a sharpened pencil, stop where the painted part ends, and the wooden part begins.",
        "Paint the pencil with decoupage glue to prevent peeling and shedding.",
        "Hold the pencil by the eraser.",
        "Dip a flat paintbrush or a foam brush into a jar of glossy decoupage glue (i.e.",
        "Mod Podge).",
        "Apply the glue to the glittery part of the pencil, from 1 end to the other.",
        "Make sure that you use decoupage glue with a glossy finish; otherwise, the glitter won't sparkle.",
        "If you can't find glossy decoupage glue, try glossy acrylic sealer or clear nail polish.",
        "Let the pencil dry before you use it.",
        "If you used a sharpened pencil, stick the sharpened end into a ball of play dough or clay.",
        "This will hold the pencil as it dries.",
        "If you used an unsharpened pencil, lean the eraser part against something so that the actual pencil does not touch the table.",
        "The pencil will need a few hours to dry.",
        "The decoupage glue will look dull at first, but then it will turn clear.",
        "Peel the tape away when you want to sharpen the pencil.",
        "Use your fingernail to peel away the first 1 to 2 rows of glitter tape.",
        "Stick the pencil into a pencil sharpener, and sharpen it.",
        "It is now ready to use!",
        "How many rows of tape you peel off depends on how wide the tape is.",
        "You want to peel enough so that it doesn't get caught in the pencil sharpener.",
        "Painting a Pencil with Glitter Nail Polish Paint a pencil using a metallic or glossy nail polish.",
        "Glitter nail polish is clear, so the pencil's original color will show through.",
        "Hold your pencil by the eraser, and paint it with glossy or metallic nail polish.",
        "Do not use glitter or matte nail polish for this step.",
        "Skip this step if you like the color of your pencil and don't mind it showing through the glitter.",
        "You can use acrylic paint for this step if you can't find any nail polish that you like.",
        "Let the pencil dry for 10 to 15 minutes.",
        "Stick the pointed end of a sharpened pencil into a ball of clay or play dough so that it stands upright.",
        "Lean an unsharpened pencil by the eraser against something, like a jar.",
        "Wait for 10 to 15 minutes for the nail polish or paint to dry.",
        "Add a second coat of metallic or glassy nail polish if needed.",
        "After about 10 minutes, check the pencil and see if you like the color.",
        "If the polish looks streaky, or if the pencil is showing through, you will need another coat.",
        "Hold the pencil by the eraser, and paint it again using the same color as before.",
        "Apply a coat of glitter nail polish or glitter paint.",
        "You can match the color of the glitter to the color of the polish, or you can use contrasting colors.",
        "For example, you can use gold glitter polish over a gold pencil, or red glitter polish over a red pencil.",
        "Here are some more ideas:\nGold glitter polish over a black pencil or green.",
        "Silver glitter polish over a white or light blue pencil.",
        "Iridescent glitter polish over a black or white pencil.",
        "Let the glitter polish dry, then add more coats, if desired.",
        "The more coats of glitter polish you add, the more glittery the pencil will become.",
        "Remember to let each coat of glitter polish dry for about 10 minutes before adding the next coat.",
        "About 2 to 3 coats will be plenty.",
        "Keep in mind that you probably won't be able to make it as glittery as in any of the other methods.",
        "Apply a coat of clear nail polish if you want to protect the glitter.",
        "Glitter nail polish is great in that it does not shed.",
        "It would not hurt to apply a coat of clear nail polish over it, however.",
        "This will protect the nail polish and keep it from rubbing off.",
        "Nail polish is very durable, so it should not chip off.",
        "Adding a coat of clear polish will help protect it, however, in case it does chip.",
        "Wait at least 1 hour before using the pencil.",
        "Just because nail polish feels dry does not mean that it is dry underneath.",
        "Wait at least 1 hour before checking on your pencil.",
        "If the pencil feels soft, or if you can make a dent in it with your fingernail, you need to wait longer."
    ]
}