{
    "title": "How to Swaddle a Baby",
    "url": "https://www.wikihow.com/Swaddle-a-Baby",
    "category_hierarchy": [
        "Family Life",
        "Parenting",
        "Development Stages",
        "Babies and Infants",
        "Calming a Baby"
    ],
    "methods": [
        {
            "name": "Doing a Basic Swaddle",
            "steps": [
                {
                    "headline": "Lay out the blanket on a flat surface.",
                    "description": "Spread the blanket out on a secure, flat surface, such as your bed or a padded floor. Arrange it in a diamond shape.Tip: For easy swaddling, you can purchase a specially designed swaddler with Velcro fasteners that hold the flaps in place. Make sure to choose one that’s appropriate for your baby’s size and age. The blanket should be at least 40 by 40 inches (100 cm × 100 cm). If you can buy a blanket specifically for swaddling, this is best. Ideally, the blanket should be made of a light, breathable material, such as muslin cotton. This will help prevent your baby from becoming overheated, especially if you live in a warm area."
                },
                {
                    "headline": "Fold down the top corner of the blanket.",
                    "description": "Once you’ve spread out the blanket, fold over the top corner. The folded corner should be on top of the blanket, not underneath it. The folded corner will help guide your placement of the baby. Your blanket should now resemble the outline of a cartoon drawing of a gem or the Superman symbol, with 3 corners on the sides and bottom and a flat area on top."
                },
                {
                    "headline": "Place the baby face-up on the blanket.",
                    "description": "Lay down the baby on the blanket on their back so that their head is above the folded top edge of the blanket. Try to keep the baby centered on the blanket. If your baby is very young, be sure their head and body are properly supported while you do this. It’s very important to keep your baby face-up and make sure they are positioned so that their face will not be covered by the blanket after you swaddle them."
                },
                {
                    "headline": "Place your baby’s left arm at their side.",
                    "description": "Take your baby’s left arm and carefully straighten it. Place it alongside the left side of their body and gently hold it in place. Alternatively, you can fold the arm across their chest, like they are in the womb. However, your baby may be able to wriggle free if their arms are bent."
                },
                {
                    "headline": "Pull the wrap around the baby’s body to the right side.",
                    "description": "Pull the corner of the blanket on the baby’s left side (your right) across their body, and tuck it under their back on their right side, just below their right armpit. The blanket should be tucked snugly enough to hold the baby's left arm in place at their side."
                },
                {
                    "headline": "Move the baby's right arm into position.",
                    "description": "Gently place the baby's right arm at their side and hold it in place, just like you did with the left arm. The corner of the blanket that you folded over will now be trapped between the right side of the baby’s body and their right arm. You can also fold their right arm across their chest if you wish, but remember that this will make it easier for the baby to break free of the swaddle."
                },
                {
                    "headline": "Tuck the other side of the blanket under the baby’s left side.",
                    "description": "Take the corner of the blanket on the baby’s right (your left) and pull it across their body. Tuck it underneath the baby’s body on their left side. Your baby’s entire upper body should now be gently but firmly wrapped, with both arms held securely in place. Make sure you can fit 2 or 3 fingers between the baby’s chest and the blanket. If not, you will need to undo the swaddle and rewrap it a little more loosely."
                },
                {
                    "headline": "Close the bottom of the swaddle.",
                    "description": "Loosely fold up or twist the bottom of the blanket to cover the baby’s feet. Take the loose end and tuck it underneath the baby’s legs on one side or the other. Alternatively, you can fold up the bottom corner of the blanket over the baby’s feet before you pull the other side of the blanket across the baby’s body. Important: Leave plenty of room for the baby's legs and feet to move within the swaddle. This will prevent overheating and, over the long term, hip dysplasia."
                }
            ]
        },
        {
            "name": "Swaddling Safely",
            "steps": [
                {
                    "headline": "Always place your baby on their back to sleep.",
                    "description": "Babies who sleep on their sides or stomachs are at greater risk of developing SIDS, or Sudden Infant Death Syndrome. It’s especially important to keep swaddled babies on their backs, since they are less mobile than un-swaddled babies and have a higher risk of suffocating if they are placed face-down. There’s no evidence that swaddling can prevent or reduce the risk of SIDS. However, if done correctly, this practice can be safe and beneficial for your baby."
                },
                {
                    "headline": "Stop swaddling your baby by 2 months of age.",
                    "description": "Once your baby is old enough to roll over on their own, it’s time to stop swaddling them. It can be very dangerous for your baby if they manage to roll over onto their stomach while swaddled.Warning: Even before babies are able to roll over intentionally, they can sometimes accidentally flip themselves over by arching their backs or flailing around when they are upset or excited. Never leave your baby unattended on an elevated surface, such as a changing table, even if you don’t think they’re able to roll over yet. Not all babies are able to roll over by the time they’re 2 months old, but it’s safest to stop swaddling before they develop that ability. If you notice that your baby is able to roll over before the age of 2 months, stop swaddling them right away. Once your baby is too old for swaddling, consider trying an alternative like a sleep sack (which loosely covers the legs but leaves the arms free) or footie pajamas."
                },
                {
                    "headline": "Avoid swaddling too tightly.",
                    "description": "If you swaddle the baby too tightly, especially if the baby is very young, they may have trouble filling their lungs with air. The swaddle should be tight enough to hold their arms in place, but you should still be able to fit 2-3 fingers between their chest and the blanket. Additionally, keep the wrapping around their legs loose enough so that the legs can bend up and out. If the swaddling is wrapped too tightly around the baby’s legs, it could prevent their hips from developing correctly. If the swaddle is wrapped too loosely, there’s a danger that it could come undone and cover the baby’s face, creating a risk of suffocation."
                },
                {
                    "headline": "Dress your baby lightly and choose a light blanket to prevent overheating.",
                    "description": "Overheating can also put your baby at risk of developing SIDS. Always choose a light, breathable blanket or wrap when swaddling your baby. If the weather is warm, dress your baby in light clothes or just a diaper under the swaddling wrap. Unwrap your baby if you see signs of overheating, such as:\nRapid breathing\nDamp hair or sweating\nFlushed skin\nA heat rash"
                },
                {
                    "headline": "Use a firm mattress in baby's crib to prevent suffocation.",
                    "description": "A mattress that is too soft can suffocate a baby if they do manage to end up face-down in the crib. A firm mattress will let your baby sleep and keep them safe. Cover the mattress with a fitted sheet that’s designed to fit the mattress. Make sure the mattress also fits well in your baby’s crib or bassinet. Check for any gaps between the mattress and the sides of the crib, since your baby could potentially roll into one of these and get stuck."
                },
                {
                    "headline": "Keep loose blankets, pillows, and stuffed animals out of the crib.",
                    "description": "Having a lot of loose items in the crib puts your baby at risk of suffocation. Don’t give your baby a pillow or a loose sheet or blanket. Keep them warm using a swaddle, sleep sack, or appropriate clothes. Most babies can start safely using a pillow by the time they’re 1 ½ years old. Your baby can probably start using loose blankets by the time they’re 1 year old. Check with your pediatrician if you’re not sure whether your child is ready."
                }
            ]
        }
    ],
    "tyn": [
        "Swaddling blanket"
    ],
    "text": " Doing a Basic Swaddle Lay out the blanket on a flat surface. Spread the blanket out on a secure, flat surface, such as your bed or a padded floor. Arrange it in a diamond shape.Tip: For easy swaddling, you can purchase a specially designed swaddler with Velcro fasteners that hold the flaps in place. Make sure to choose one that’s appropriate for your baby’s size and age. The blanket should be at least 40 by 40 inches (100 cm × 100 cm). If you can buy a blanket specifically for swaddling, this is best. Ideally, the blanket should be made of a light, breathable material, such as muslin cotton. This will help prevent your baby from becoming overheated, especially if you live in a warm area. Fold down the top corner of the blanket. Once you’ve spread out the blanket, fold over the top corner. The folded corner should be on top of the blanket, not underneath it. The folded corner will help guide your placement of the baby. Your blanket should now resemble the outline of a cartoon drawing of a gem or the Superman symbol, with 3 corners on the sides and bottom and a flat area on top. Place the baby face-up on the blanket. Lay down the baby on the blanket on their back so that their head is above the folded top edge of the blanket. Try to keep the baby centered on the blanket. If your baby is very young, be sure their head and body are properly supported while you do this. It’s very important to keep your baby face-up and make sure they are positioned so that their face will not be covered by the blanket after you swaddle them. Place your baby’s left arm at their side. Take your baby’s left arm and carefully straighten it. Place it alongside the left side of their body and gently hold it in place. Alternatively, you can fold the arm across their chest, like they are in the womb. However, your baby may be able to wriggle free if their arms are bent. Pull the wrap around the baby’s body to the right side. Pull the corner of the blanket on the baby’s left side (your right) across their body, and tuck it under their back on their right side, just below their right armpit. The blanket should be tucked snugly enough to hold the baby's left arm in place at their side. Move the baby's right arm into position. Gently place the baby's right arm at their side and hold it in place, just like you did with the left arm. The corner of the blanket that you folded over will now be trapped between the right side of the baby’s body and their right arm. You can also fold their right arm across their chest if you wish, but remember that this will make it easier for the baby to break free of the swaddle. Tuck the other side of the blanket under the baby’s left side. Take the corner of the blanket on the baby’s right (your left) and pull it across their body. Tuck it underneath the baby’s body on their left side. Your baby’s entire upper body should now be gently but firmly wrapped, with both arms held securely in place. Make sure you can fit 2 or 3 fingers between the baby’s chest and the blanket. If not, you will need to undo the swaddle and rewrap it a little more loosely. Close the bottom of the swaddle. Loosely fold up or twist the bottom of the blanket to cover the baby’s feet. Take the loose end and tuck it underneath the baby’s legs on one side or the other. Alternatively, you can fold up the bottom corner of the blanket over the baby’s feet before you pull the other side of the blanket across the baby’s body. Important: Leave plenty of room for the baby's legs and feet to move within the swaddle. This will prevent overheating and, over the long term, hip dysplasia. Swaddling Safely Always place your baby on their back to sleep. Babies who sleep on their sides or stomachs are at greater risk of developing SIDS, or Sudden Infant Death Syndrome. It’s especially important to keep swaddled babies on their backs, since they are less mobile than un-swaddled babies and have a higher risk of suffocating if they are placed face-down. There’s no evidence that swaddling can prevent or reduce the risk of SIDS. However, if done correctly, this practice can be safe and beneficial for your baby. Stop swaddling your baby by 2 months of age. Once your baby is old enough to roll over on their own, it’s time to stop swaddling them. It can be very dangerous for your baby if they manage to roll over onto their stomach while swaddled.Warning: Even before babies are able to roll over intentionally, they can sometimes accidentally flip themselves over by arching their backs or flailing around when they are upset or excited. Never leave your baby unattended on an elevated surface, such as a changing table, even if you don’t think they’re able to roll over yet. Not all babies are able to roll over by the time they’re 2 months old, but it’s safest to stop swaddling before they develop that ability. If you notice that your baby is able to roll over before the age of 2 months, stop swaddling them right away. Once your baby is too old for swaddling, consider trying an alternative like a sleep sack (which loosely covers the legs but leaves the arms free) or footie pajamas. Avoid swaddling too tightly. If you swaddle the baby too tightly, especially if the baby is very young, they may have trouble filling their lungs with air. The swaddle should be tight enough to hold their arms in place, but you should still be able to fit 2-3 fingers between their chest and the blanket. Additionally, keep the wrapping around their legs loose enough so that the legs can bend up and out. If the swaddling is wrapped too tightly around the baby’s legs, it could prevent their hips from developing correctly. If the swaddle is wrapped too loosely, there’s a danger that it could come undone and cover the baby’s face, creating a risk of suffocation. Dress your baby lightly and choose a light blanket to prevent overheating. Overheating can also put your baby at risk of developing SIDS. Always choose a light, breathable blanket or wrap when swaddling your baby. If the weather is warm, dress your baby in light clothes or just a diaper under the swaddling wrap. Unwrap your baby if you see signs of overheating, such as:\nRapid breathing\nDamp hair or sweating\nFlushed skin\nA heat rash Use a firm mattress in baby's crib to prevent suffocation. A mattress that is too soft can suffocate a baby if they do manage to end up face-down in the crib. A firm mattress will let your baby sleep and keep them safe. Cover the mattress with a fitted sheet that’s designed to fit the mattress. Make sure the mattress also fits well in your baby’s crib or bassinet. Check for any gaps between the mattress and the sides of the crib, since your baby could potentially roll into one of these and get stuck. Keep loose blankets, pillows, and stuffed animals out of the crib. Having a lot of loose items in the crib puts your baby at risk of suffocation. Don’t give your baby a pillow or a loose sheet or blanket. Keep them warm using a swaddle, sleep sack, or appropriate clothes. Most babies can start safely using a pillow by the time they’re 1 ½ years old. Your baby can probably start using loose blankets by the time they’re 1 year old. Check with your pediatrician if you’re not sure whether your child is ready.",
    "sentences": [
        " Doing a Basic Swaddle Lay out the blanket on a flat surface.",
        "Spread the blanket out on a secure, flat surface, such as your bed or a padded floor.",
        "Arrange it in a diamond shape.Tip: For easy swaddling, you can purchase a specially designed swaddler with Velcro fasteners that hold the flaps in place.",
        "Make sure to choose one that’s appropriate for your baby’s size and age.",
        "The blanket should be at least 40 by 40 inches (100 cm × 100 cm).",
        "If you can buy a blanket specifically for swaddling, this is best.",
        "Ideally, the blanket should be made of a light, breathable material, such as muslin cotton.",
        "This will help prevent your baby from becoming overheated, especially if you live in a warm area.",
        "Fold down the top corner of the blanket.",
        "Once you’ve spread out the blanket, fold over the top corner.",
        "The folded corner should be on top of the blanket, not underneath it.",
        "The folded corner will help guide your placement of the baby.",
        "Your blanket should now resemble the outline of a cartoon drawing of a gem or the Superman symbol, with 3 corners on the sides and bottom and a flat area on top.",
        "Place the baby face-up on the blanket.",
        "Lay down the baby on the blanket on their back so that their head is above the folded top edge of the blanket.",
        "Try to keep the baby centered on the blanket.",
        "If your baby is very young, be sure their head and body are properly supported while you do this.",
        "It’s very important to keep your baby face-up and make sure they are positioned so that their face will not be covered by the blanket after you swaddle them.",
        "Place your baby’s left arm at their side.",
        "Take your baby’s left arm and carefully straighten it.",
        "Place it alongside the left side of their body and gently hold it in place.",
        "Alternatively, you can fold the arm across their chest, like they are in the womb.",
        "However, your baby may be able to wriggle free if their arms are bent.",
        "Pull the wrap around the baby’s body to the right side.",
        "Pull the corner of the blanket on the baby’s left side (your right) across their body, and tuck it under their back on their right side, just below their right armpit.",
        "The blanket should be tucked snugly enough to hold the baby's left arm in place at their side.",
        "Move the baby's right arm into position.",
        "Gently place the baby's right arm at their side and hold it in place, just like you did with the left arm.",
        "The corner of the blanket that you folded over will now be trapped between the right side of the baby’s body and their right arm.",
        "You can also fold their right arm across their chest if you wish, but remember that this will make it easier for the baby to break free of the swaddle.",
        "Tuck the other side of the blanket under the baby’s left side.",
        "Take the corner of the blanket on the baby’s right (your left) and pull it across their body.",
        "Tuck it underneath the baby’s body on their left side.",
        "Your baby’s entire upper body should now be gently but firmly wrapped, with both arms held securely in place.",
        "Make sure you can fit 2 or 3 fingers between the baby’s chest and the blanket.",
        "If not, you will need to undo the swaddle and rewrap it a little more loosely.",
        "Close the bottom of the swaddle.",
        "Loosely fold up or twist the bottom of the blanket to cover the baby’s feet.",
        "Take the loose end and tuck it underneath the baby’s legs on one side or the other.",
        "Alternatively, you can fold up the bottom corner of the blanket over the baby’s feet before you pull the other side of the blanket across the baby’s body.",
        "Important: Leave plenty of room for the baby's legs and feet to move within the swaddle.",
        "This will prevent overheating and, over the long term, hip dysplasia.",
        "Swaddling Safely Always place your baby on their back to sleep.",
        "Babies who sleep on their sides or stomachs are at greater risk of developing SIDS, or Sudden Infant Death Syndrome.",
        "It’s especially important to keep swaddled babies on their backs, since they are less mobile than un-swaddled babies and have a higher risk of suffocating if they are placed face-down.",
        "There’s no evidence that swaddling can prevent or reduce the risk of SIDS.",
        "However, if done correctly, this practice can be safe and beneficial for your baby.",
        "Stop swaddling your baby by 2 months of age.",
        "Once your baby is old enough to roll over on their own, it’s time to stop swaddling them.",
        "It can be very dangerous for your baby if they manage to roll over onto their stomach while swaddled.Warning: Even before babies are able to roll over intentionally, they can sometimes accidentally flip themselves over by arching their backs or flailing around when they are upset or excited.",
        "Never leave your baby unattended on an elevated surface, such as a changing table, even if you don’t think they’re able to roll over yet.",
        "Not all babies are able to roll over by the time they’re 2 months old, but it’s safest to stop swaddling before they develop that ability.",
        "If you notice that your baby is able to roll over before the age of 2 months, stop swaddling them right away.",
        "Once your baby is too old for swaddling, consider trying an alternative like a sleep sack (which loosely covers the legs but leaves the arms free) or footie pajamas.",
        "Avoid swaddling too tightly.",
        "If you swaddle the baby too tightly, especially if the baby is very young, they may have trouble filling their lungs with air.",
        "The swaddle should be tight enough to hold their arms in place, but you should still be able to fit 2-3 fingers between their chest and the blanket.",
        "Additionally, keep the wrapping around their legs loose enough so that the legs can bend up and out.",
        "If the swaddling is wrapped too tightly around the baby’s legs, it could prevent their hips from developing correctly.",
        "If the swaddle is wrapped too loosely, there’s a danger that it could come undone and cover the baby’s face, creating a risk of suffocation.",
        "Dress your baby lightly and choose a light blanket to prevent overheating.",
        "Overheating can also put your baby at risk of developing SIDS.",
        "Always choose a light, breathable blanket or wrap when swaddling your baby.",
        "If the weather is warm, dress your baby in light clothes or just a diaper under the swaddling wrap.",
        "Unwrap your baby if you see signs of overheating, such as:\nRapid breathing\nDamp hair or sweating\nFlushed skin\nA heat rash Use a firm mattress in baby's crib to prevent suffocation.",
        "A mattress that is too soft can suffocate a baby if they do manage to end up face-down in the crib.",
        "A firm mattress will let your baby sleep and keep them safe.",
        "Cover the mattress with a fitted sheet that’s designed to fit the mattress.",
        "Make sure the mattress also fits well in your baby’s crib or bassinet.",
        "Check for any gaps between the mattress and the sides of the crib, since your baby could potentially roll into one of these and get stuck.",
        "Keep loose blankets, pillows, and stuffed animals out of the crib.",
        "Having a lot of loose items in the crib puts your baby at risk of suffocation.",
        "Don’t give your baby a pillow or a loose sheet or blanket.",
        "Keep them warm using a swaddle, sleep sack, or appropriate clothes.",
        "Most babies can start safely using a pillow by the time they’re 1 ½ years old.",
        "Your baby can probably start using loose blankets by the time they’re 1 year old.",
        "Check with your pediatrician if you’re not sure whether your child is ready."
    ]
}