{
    "title": "How to Separate Stuck Glasses",
    "url": "https://www.wikihow.com/Separate-Stuck-Glasses",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping"
    ],
    "methods": [
        {
            "name": "Using Heat",
            "steps": [
                {
                    "headline": "Understand how glass responds to heat.",
                    "description": "Most commonly, glasses get stuck together when they are stacked immediately after they are washed. Glass expands when heated, and contracts as it cools, and this is sufficient to stick glasses together in some cases. Never fear: you can use this to separate the glasses. You will need to cool the inner glass and heat the outer glass in order to free them from each other. To avoid this problem in the future, be more careful about stacking glasses. Let glasses cool before you stack them. If you wash with cold water, this should not be a problem."
                },
                {
                    "headline": "Heat the outer glass.",
                    "description": "This method carries some risk, so you should use it with care. Since the outer glass is the one that has shrunk around the inner glass, this one needs to expand to allow the inner glass to slip away. Gently heat the outer glass by running it under the hot tap for a minute or so. With any luck, the glasses should come unstuck. If not, you may wish to consider cooling the inner glass, by filling it from the cold tap. Avoid using ice or boiling water. The sudden change in temperature could cause one or both glasses to shatter violently, which could be very dangerous. The glass is already under compression, making the situation especially risky."
                },
                {
                    "headline": "Cool the inner glass.",
                    "description": "If you cannot free the glasses by simply heating the outer glass, try to cool the inner glass. The outer glass will expand, and the inner glass will contract."
                },
                {
                    "headline": "Try using a bowl of hot water.",
                    "description": "First, fill the top glass with cold water. Then, fill a shallow bowl with hot water and bathe the base of the bottom glass into the heat. Let the glasses sit like this for a few minutes, then try to pull them apart."
                },
                {
                    "headline": "Gently pull the glasses apart.",
                    "description": "The temperature difference should separate the glasses. Hold the glasses firmly, with one hand on the bottom of the bottom of the outer glass and one hand encircling the rim of the inner glass. Twist and tilt the glasses, and gently tug them apart. If the glasses won't come unstuck, try giving them more time to expand and contract. Leave the bottom glass to sit in the bowl of hot water. Try again a few minutes later."
                }
            ]
        },
        {
            "name": "Using Force",
            "steps": [
                {
                    "headline": "Try to twist or tilt the glasses apart.",
                    "description": "Any given glass is unlikely to be perfectly round, so the upper glass may only be \"pinched\" between two points in the lower glass. If there is movement when you tilt the glass, you're in luck, and detaching them will be far simpler."
                },
                {
                    "headline": "Be gentle.",
                    "description": "Remember not to apply excessive force. If you are too rough, you might shatter one or both of the glasses. If the glasses come unstuck unexpectedly, they might slip or shoot out of your hands. Make sure that you have a firm grip on each glass. Dry the glasses before you begin, and dry your hands. If your hands slip, the glass might fall and shatter!"
                },
                {
                    "headline": "Consider breaking one of the glasses.",
                    "description": "If you absolutely cannot get the glasses unstuck, breaking one may keep you from losing both. Place the glass on a solid, easy-to-clean surface, or hold the base carefully in your hand. Tap the outer glass gently with a hammer, on the rim, until it cracks. There is a risk that you might break both glasses – but this can be a great last-ditch effort. Afterward, be sure to gather all shards of broken glass. Safety first!"
                },
                {
                    "headline": "Try blowing air between the glasses.",
                    "description": "Sometimes, there is a thin layer of water between the glasses that keeps them stuck. Try squeezing a straw between the two glasses, then blowing in. A small amount of air should suffice. However try blowing in as much air as you can because the straw is being squeezed."
                }
            ]
        },
        {
            "name": "Lubricating the Glasses",
            "steps": [
                {
                    "headline": "Apply light lubrication.",
                    "description": "If the glasses are stubborn, and you're making no progress by simply tilting/twisting the glasses apart, the next step is to apply some light lubrication. A bit of olive or sunflower oil may do the trick. Try using soap. This is especially effective if the glasses are \"pinched\" together, rather than stuck fast. Consider using the oil method in conjunction with the heating method. This may be effective on especially stubborn glasses. Try using WD-40 oil as a last-ditch resort. Spray it between the glass. The oil should spread thoroughly by itself, and it should be relatively easy to pull the glasses away from each other. Make sure to wash the glasses thoroughly after doing this: WD-40 is toxic to humans."
                },
                {
                    "headline": "Pour the oil between the glasses.",
                    "description": "Work the oil into the pinch point by gently tilting the upper glass back and forth. As you rock the glasses, the oil may loosen them up enough that they come apart. Wet the glasses so spread the lubricant around. Try using some kind of thin drinking straw or a knife to push the liquid in thoroughly. Be gentle!"
                },
                {
                    "headline": "Twist the glasses apart.",
                    "description": "When you think they are lubricated enough, grab the inner glass with your dominant hand and the outer glass with your other hand. Twist the glasses in opposite directions to loosen the grip. At the same time, pull them apart with a lesser force. Focus on trying to twist it more than pulling it. If the twisting works, the glass should come off by itself. Don't try to pull the glasses straight off! The force needed to grip the glass could break the glass itself."
                }
            ]
        }
    ],
    "tyn": [
        "Warm and cold water",
        "Shallow bowl (optional)",
        "Oil (optional)"
    ],
    "text": " Using Heat Understand how glass responds to heat. Most commonly, glasses get stuck together when they are stacked immediately after they are washed. Glass expands when heated, and contracts as it cools, and this is sufficient to stick glasses together in some cases. Never fear: you can use this to separate the glasses. You will need to cool the inner glass and heat the outer glass in order to free them from each other. To avoid this problem in the future, be more careful about stacking glasses. Let glasses cool before you stack them. If you wash with cold water, this should not be a problem. Heat the outer glass. This method carries some risk, so you should use it with care. Since the outer glass is the one that has shrunk around the inner glass, this one needs to expand to allow the inner glass to slip away. Gently heat the outer glass by running it under the hot tap for a minute or so. With any luck, the glasses should come unstuck. If not, you may wish to consider cooling the inner glass, by filling it from the cold tap. Avoid using ice or boiling water. The sudden change in temperature could cause one or both glasses to shatter violently, which could be very dangerous. The glass is already under compression, making the situation especially risky. Cool the inner glass. If you cannot free the glasses by simply heating the outer glass, try to cool the inner glass. The outer glass will expand, and the inner glass will contract. Try using a bowl of hot water. First, fill the top glass with cold water. Then, fill a shallow bowl with hot water and bathe the base of the bottom glass into the heat. Let the glasses sit like this for a few minutes, then try to pull them apart. Gently pull the glasses apart. The temperature difference should separate the glasses. Hold the glasses firmly, with one hand on the bottom of the bottom of the outer glass and one hand encircling the rim of the inner glass. Twist and tilt the glasses, and gently tug them apart. If the glasses won't come unstuck, try giving them more time to expand and contract. Leave the bottom glass to sit in the bowl of hot water. Try again a few minutes later. Using Force Try to twist or tilt the glasses apart. Any given glass is unlikely to be perfectly round, so the upper glass may only be \"pinched\" between two points in the lower glass. If there is movement when you tilt the glass, you're in luck, and detaching them will be far simpler. Be gentle. Remember not to apply excessive force. If you are too rough, you might shatter one or both of the glasses. If the glasses come unstuck unexpectedly, they might slip or shoot out of your hands. Make sure that you have a firm grip on each glass. Dry the glasses before you begin, and dry your hands. If your hands slip, the glass might fall and shatter! Consider breaking one of the glasses. If you absolutely cannot get the glasses unstuck, breaking one may keep you from losing both. Place the glass on a solid, easy-to-clean surface, or hold the base carefully in your hand. Tap the outer glass gently with a hammer, on the rim, until it cracks. There is a risk that you might break both glasses – but this can be a great last-ditch effort. Afterward, be sure to gather all shards of broken glass. Safety first! Try blowing air between the glasses. Sometimes, there is a thin layer of water between the glasses that keeps them stuck. Try squeezing a straw between the two glasses, then blowing in. A small amount of air should suffice. However try blowing in as much air as you can because the straw is being squeezed. Lubricating the Glasses Apply light lubrication. If the glasses are stubborn, and you're making no progress by simply tilting/twisting the glasses apart, the next step is to apply some light lubrication. A bit of olive or sunflower oil may do the trick. Try using soap. This is especially effective if the glasses are \"pinched\" together, rather than stuck fast. Consider using the oil method in conjunction with the heating method. This may be effective on especially stubborn glasses. Try using WD-40 oil as a last-ditch resort. Spray it between the glass. The oil should spread thoroughly by itself, and it should be relatively easy to pull the glasses away from each other. Make sure to wash the glasses thoroughly after doing this: WD-40 is toxic to humans. Pour the oil between the glasses. Work the oil into the pinch point by gently tilting the upper glass back and forth. As you rock the glasses, the oil may loosen them up enough that they come apart. Wet the glasses so spread the lubricant around. Try using some kind of thin drinking straw or a knife to push the liquid in thoroughly. Be gentle! Twist the glasses apart. When you think they are lubricated enough, grab the inner glass with your dominant hand and the outer glass with your other hand. Twist the glasses in opposite directions to loosen the grip. At the same time, pull them apart with a lesser force. Focus on trying to twist it more than pulling it. If the twisting works, the glass should come off by itself. Don't try to pull the glasses straight off! The force needed to grip the glass could break the glass itself.",
    "sentences": [
        " Using Heat Understand how glass responds to heat.",
        "Most commonly, glasses get stuck together when they are stacked immediately after they are washed.",
        "Glass expands when heated, and contracts as it cools, and this is sufficient to stick glasses together in some cases.",
        "Never fear: you can use this to separate the glasses.",
        "You will need to cool the inner glass and heat the outer glass in order to free them from each other.",
        "To avoid this problem in the future, be more careful about stacking glasses.",
        "Let glasses cool before you stack them.",
        "If you wash with cold water, this should not be a problem.",
        "Heat the outer glass.",
        "This method carries some risk, so you should use it with care.",
        "Since the outer glass is the one that has shrunk around the inner glass, this one needs to expand to allow the inner glass to slip away.",
        "Gently heat the outer glass by running it under the hot tap for a minute or so.",
        "With any luck, the glasses should come unstuck.",
        "If not, you may wish to consider cooling the inner glass, by filling it from the cold tap.",
        "Avoid using ice or boiling water.",
        "The sudden change in temperature could cause one or both glasses to shatter violently, which could be very dangerous.",
        "The glass is already under compression, making the situation especially risky.",
        "Cool the inner glass.",
        "If you cannot free the glasses by simply heating the outer glass, try to cool the inner glass.",
        "The outer glass will expand, and the inner glass will contract.",
        "Try using a bowl of hot water.",
        "First, fill the top glass with cold water.",
        "Then, fill a shallow bowl with hot water and bathe the base of the bottom glass into the heat.",
        "Let the glasses sit like this for a few minutes, then try to pull them apart.",
        "Gently pull the glasses apart.",
        "The temperature difference should separate the glasses.",
        "Hold the glasses firmly, with one hand on the bottom of the bottom of the outer glass and one hand encircling the rim of the inner glass.",
        "Twist and tilt the glasses, and gently tug them apart.",
        "If the glasses won't come unstuck, try giving them more time to expand and contract.",
        "Leave the bottom glass to sit in the bowl of hot water.",
        "Try again a few minutes later.",
        "Using Force Try to twist or tilt the glasses apart.",
        "Any given glass is unlikely to be perfectly round, so the upper glass may only be \"pinched\" between two points in the lower glass.",
        "If there is movement when you tilt the glass, you're in luck, and detaching them will be far simpler.",
        "Be gentle.",
        "Remember not to apply excessive force.",
        "If you are too rough, you might shatter one or both of the glasses.",
        "If the glasses come unstuck unexpectedly, they might slip or shoot out of your hands.",
        "Make sure that you have a firm grip on each glass.",
        "Dry the glasses before you begin, and dry your hands.",
        "If your hands slip, the glass might fall and shatter!",
        "Consider breaking one of the glasses.",
        "If you absolutely cannot get the glasses unstuck, breaking one may keep you from losing both.",
        "Place the glass on a solid, easy-to-clean surface, or hold the base carefully in your hand.",
        "Tap the outer glass gently with a hammer, on the rim, until it cracks.",
        "There is a risk that you might break both glasses – but this can be a great last-ditch effort.",
        "Afterward, be sure to gather all shards of broken glass.",
        "Safety first!",
        "Try blowing air between the glasses.",
        "Sometimes, there is a thin layer of water between the glasses that keeps them stuck.",
        "Try squeezing a straw between the two glasses, then blowing in.",
        "A small amount of air should suffice.",
        "However try blowing in as much air as you can because the straw is being squeezed.",
        "Lubricating the Glasses Apply light lubrication.",
        "If the glasses are stubborn, and you're making no progress by simply tilting/twisting the glasses apart, the next step is to apply some light lubrication.",
        "A bit of olive or sunflower oil may do the trick.",
        "Try using soap.",
        "This is especially effective if the glasses are \"pinched\" together, rather than stuck fast.",
        "Consider using the oil method in conjunction with the heating method.",
        "This may be effective on especially stubborn glasses.",
        "Try using WD-40 oil as a last-ditch resort.",
        "Spray it between the glass.",
        "The oil should spread thoroughly by itself, and it should be relatively easy to pull the glasses away from each other.",
        "Make sure to wash the glasses thoroughly after doing this: WD-40 is toxic to humans.",
        "Pour the oil between the glasses.",
        "Work the oil into the pinch point by gently tilting the upper glass back and forth.",
        "As you rock the glasses, the oil may loosen them up enough that they come apart.",
        "Wet the glasses so spread the lubricant around.",
        "Try using some kind of thin drinking straw or a knife to push the liquid in thoroughly.",
        "Be gentle!",
        "Twist the glasses apart.",
        "When you think they are lubricated enough, grab the inner glass with your dominant hand and the outer glass with your other hand.",
        "Twist the glasses in opposite directions to loosen the grip.",
        "At the same time, pull them apart with a lesser force.",
        "Focus on trying to twist it more than pulling it.",
        "If the twisting works, the glass should come off by itself.",
        "Don't try to pull the glasses straight off!",
        "The force needed to grip the glass could break the glass itself."
    ]
}