{
    "title": "How to Create an Altar",
    "url": "https://www.wikihow.com/Create-an-Altar",
    "category_hierarchy": [
        "Philosophy and Religion",
        "Faith and Belief"
    ],
    "methods": [
        {
            "name": "Starting an Altar",
            "steps": [
                {
                    "headline": "Learn about altar traditions (optional).",
                    "description": "If you are constructing an altar for a specific purpose or holiday, you might want to look up details of that tradition online before you begin. Searching for photos and examples of similar altars is a great way to get started. Many people mix and match components of different religions, spiritual traditions, and cultures that have personal importance to them. Day of the Dead altars typically include pictures of saints and deceased relatives; candles; flowers, food, and drink. You can make a similar altar in homage of a deceased friend or relative, using food and toys that person would enjoy. St. Joseph's Day Altars are constructed in many places on March 19th. They are usually constructed in three tiers covered with food and decorations, surrounding a statue of St. Joseph. You can construct a similar altar to celebrate another holiday. After honoring the saint or holiday, eat the food with friends and family or give it to people in need of food."
                },
                {
                    "headline": "Choose a location.",
                    "description": "If you plan to quietly meditate or pray, select a quiet location out of the way of passers-by. If you wish to keep your altar as a central focus point or use it for group ceremonies, place it in a larger room. If space is limited and you travel a lot, consider making a portable altar. This can be a collapsible table, a tray, or even a cloth that can be packed in a suitcase along with a few altar decorations."
                },
                {
                    "headline": "Choose or construct an altar surface.",
                    "description": "Your altar may be located anywhere you choose for example it could be a stack of stones in your garden, on shelves on a glass-protected cabinet, on a cloth on the floor, on your kitchen table, in a designated room, or any place that you feel it should be. If you plan to use the altar for rituals that require table space, for instance grinding herbs or burning incense, make sure it is large and flat enough for that purpose."
                },
                {
                    "headline": "Add other furniture or shelves to the altar if necessary.",
                    "description": "Also, you may choose to place a cushion or chair in front of your altar for meditation or prayer. If there will be children or people shorter than you using the altar, consider whether you need to add an additional lower surface that everyone can reach."
                },
                {
                    "headline": "Ritually prepare the space (optional).",
                    "description": "You may wish to burn incense or ritually burn sage to prepare the space. Alternatively, recite a prayer or speak without preparation, asking the deity or power you worship to bless the altar."
                }
            ]
        },
        {
            "name": "Dedicating an Altar to a Person or Religious Figure",
            "steps": [
                {
                    "headline": "Decide who to dedicate the altar to.",
                    "description": "One common use of altars is to honor and remember a religious figure, or a deceased relative, friend, or historical figure. Some of these are dedicated to multiple people, such as a deceased friend and his patron saint. In some traditions, these are called shrines instead of altars."
                },
                {
                    "headline": "Include icons, figurines, photographs, or pictures.",
                    "description": "Unless you belong to a religious denomination that does not allow images of the divine, place an image of the person or people you are honoring in a prominent location on the altar, such as on a high stand at the back of the altar. You may wish to include several images, representing different sides of the honored person. For instance, a photograph of the person at her wedding and a photograph of her with her family."
                },
                {
                    "headline": "Include mementos or objects related to the subject.",
                    "description": "Display objects on the shrine that remind you of the person being honored. This can be gifts they gave you, objects they enjoyed in life, or objects that represent what they did in their profession, hobbies, or personal life. If you are honoring a religious figure, research what objects they are associated with online. Patron saints, deities of polytheist traditions (Greek, Hindu, Roman, Egyptian, etc. ), and most other religious figures have many objects or actions associated with their worship."
                },
                {
                    "headline": "Consider adding candles.",
                    "description": "Place candles around the edge of the altar so you can light them in memory of the person, or in honor of the religious figure. This is a common and simple ritual used in many places around the world."
                },
                {
                    "headline": "Decorate with flowers.",
                    "description": "You may wish to keep a bouquet of flowers on the altar, and think of the person every time you replace them with a fresh bouquet. Alternatively, grow flowers in a pot at the altar's base, or keep dried flowers as permanent decorations."
                },
                {
                    "headline": "Share food and drink with the honored person.",
                    "description": "Keep a plate and cup on the altar, and provide your deceased friend's favorite food and drink on holidays or important occasions. After leaving it on the altar for the length of the meal, you can share it among your friends or give it to those in need."
                },
                {
                    "headline": "Add any other decorations or ritual objects you think is appropriate.",
                    "description": "Change your altar however you wish to help you honor the person and live by his ideals. If that person belonged to a different religion than yours, consider adding a symbol of that religion as well. If the altar appears too somber for your needs, add brightly colored scarves or other objects to make it a happier place to remember your friend."
                }
            ]
        },
        {
            "name": "Creating an Altar for Another Purpose",
            "steps": [
                {
                    "headline": "Select a purpose or theme (optional).",
                    "description": "If you belong to a particular religion, you may wish to keep your altar decorated with figurines and holy objects related to it. Some make altars dedicated with a particular purpose, such as healing or meditation, and decorate it with objects that represent those from many cultures. As a simple, nondenominational example, you could build an altar representing the four classical elements: fire, air, water, and earth. For other specific examples, see Make a Taoist Altar, Create a Simple Buddhist Shrine, or Set up a Wiccan Samhain Altar."
                },
                {
                    "headline": "Lay down a decorative cloth.",
                    "description": "Many altars begin with a cloth to keep the altar surface clean and communicate the intent of the altar. For example, a simple white cloth can help you stay focused and contemplative. A bright, decorated cloth can help raise your spirits, while an outdoor altar could have a cloth with muted autumn colors that don't distract from nature. To continue the example of an altar dedicated to the four classical elements, you could choose four small cloths and lay them next to each other: red (fire), white or light blue (air), dark blue (water), and brown (earth)."
                },
                {
                    "headline": "Place texts on the altar for reading during use.",
                    "description": "If you belong to a religion with sacred texts, include a copy on the altar to read for inspiration. Otherwise, consider adding a different book, poem, or other text that is important to you, and will help you reach the mental, emotional, or spiritual state the altar is intended to provide."
                },
                {
                    "headline": "Include images related to the theme of the altar.",
                    "description": "Orthodox shrines commonly have icons of the saints or other religious figures. Hindu shrines may include figurines of the gods that are being honored. Even if you're not religious, think of artwork you could include that is related to your altar's purpose. Continuing the example of an elemental altar, you could include a charcoal drawing of flames (fire), calligraphy drawn with a bird's quill (air), a watercolor painting of a seascape (water), and a clay statuette (earth)."
                },
                {
                    "headline": "Include any objects you wish to use in rituals.",
                    "description": "These vary widely depending on the spiritual tradition and personal preference of the altar's builder. You may have many herbs, crystals, and specialized containers if you conduct many rituals. On the other hand, it's completely acceptable to simply include a candle which you light before you pray, or a journal in which you write your thoughts. An elemental altar might include a candle (fire), a fan (air), a glass of water (water), and a handful of soil (earth). You can hold each of these items in turn as you contemplate the element and what it represents, or invent a more elaborate ritual."
                },
                {
                    "headline": "Use any other decorations or ritual objects.",
                    "description": "Add to your altar however you like. You may wish to add flowers, decorative figurines, or other decorations. You may decide to put photographs of happy memories around the altar. You may prefer to keep the altar relatively bare. It's all up to you. Other related objects that could go on your elemental altar include seashells, rocks, feathers, partially burned wood, or anything else you think represents or complements the elements."
                }
            ]
        },
        {
            "name": "Using an Altar",
            "steps": [
                {
                    "headline": "Decide how to conduct yourself near the altar.",
                    "description": "When you approach the altar for worship, adopt a specific posture, make a habit of adopting a specific posture. You may stand, sit, kneel, or adopt any other posture that makes you feel attentive to the altar and what it represents. If you think it's important to adopt a celebratory or energetic mood, you could even dance around the altar."
                },
                {
                    "headline": "Pray.",
                    "description": "You do not need to be religious to pray, or need to address anyone or anything in particular. If you are religious, you may wish to learn traditional prayers. Alternatively, express yourself silently, quietly, or loudly as you feel comfortable. Commonly, people pray to ask for healing for themselves and their loved ones, to ask for forgiveness, or to request guidance in making a decision."
                },
                {
                    "headline": "Meditate.",
                    "description": "If you don't feel comfortable praying, or if you simply need to relax and calm yourself, meditation is a useful skill to learn and practice. Some people do not distinguish between meditation and prayer."
                },
                {
                    "headline": "Burn oil or another offering.",
                    "description": "Burning a candle, food, or another object is often considered an \"offering\" to another power. Most Christian and Jewish worshippers do not offer animal sacrifices, and sometimes consider it to be against their religion. Even if you belong to one of these religions, you may decide to make another offering, such as the small container of oil burned on Orthodox shrines. This can be interpreted as a literal offering (carried in the smoke), or as a symbolic act to show you are willing to make a sacrifice. It can also simply be a ritual you use to worship, without having to analyze its meaning."
                }
            ]
        }
    ],
    "tyn": [
        "A desk, table, flat stone, or other flat surface",
        "A cloth",
        "Candles",
        "Photos or pictures",
        "Incense",
        "Charms/figures",
        "Anything else you think fitting for your altar"
    ],
    "text": " Starting an Altar Learn about altar traditions (optional). If you are constructing an altar for a specific purpose or holiday, you might want to look up details of that tradition online before you begin. Searching for photos and examples of similar altars is a great way to get started. Many people mix and match components of different religions, spiritual traditions, and cultures that have personal importance to them. Day of the Dead altars typically include pictures of saints and deceased relatives; candles; flowers, food, and drink. You can make a similar altar in homage of a deceased friend or relative, using food and toys that person would enjoy. St. Joseph's Day Altars are constructed in many places on March 19th. They are usually constructed in three tiers covered with food and decorations, surrounding a statue of St. Joseph. You can construct a similar altar to celebrate another holiday. After honoring the saint or holiday, eat the food with friends and family or give it to people in need of food. Choose a location. If you plan to quietly meditate or pray, select a quiet location out of the way of passers-by. If you wish to keep your altar as a central focus point or use it for group ceremonies, place it in a larger room. If space is limited and you travel a lot, consider making a portable altar. This can be a collapsible table, a tray, or even a cloth that can be packed in a suitcase along with a few altar decorations. Choose or construct an altar surface. Your altar may be located anywhere you choose for example it could be a stack of stones in your garden, on shelves on a glass-protected cabinet, on a cloth on the floor, on your kitchen table, in a designated room, or any place that you feel it should be. If you plan to use the altar for rituals that require table space, for instance grinding herbs or burning incense, make sure it is large and flat enough for that purpose. Add other furniture or shelves to the altar if necessary. Also, you may choose to place a cushion or chair in front of your altar for meditation or prayer. If there will be children or people shorter than you using the altar, consider whether you need to add an additional lower surface that everyone can reach. Ritually prepare the space (optional). You may wish to burn incense or ritually burn sage to prepare the space. Alternatively, recite a prayer or speak without preparation, asking the deity or power you worship to bless the altar. Dedicating an Altar to a Person or Religious Figure Decide who to dedicate the altar to. One common use of altars is to honor and remember a religious figure, or a deceased relative, friend, or historical figure. Some of these are dedicated to multiple people, such as a deceased friend and his patron saint. In some traditions, these are called shrines instead of altars. Include icons, figurines, photographs, or pictures. Unless you belong to a religious denomination that does not allow images of the divine, place an image of the person or people you are honoring in a prominent location on the altar, such as on a high stand at the back of the altar. You may wish to include several images, representing different sides of the honored person. For instance, a photograph of the person at her wedding and a photograph of her with her family. Include mementos or objects related to the subject. Display objects on the shrine that remind you of the person being honored. This can be gifts they gave you, objects they enjoyed in life, or objects that represent what they did in their profession, hobbies, or personal life. If you are honoring a religious figure, research what objects they are associated with online. Patron saints, deities of polytheist traditions (Greek, Hindu, Roman, Egyptian, etc. ), and most other religious figures have many objects or actions associated with their worship. Consider adding candles. Place candles around the edge of the altar so you can light them in memory of the person, or in honor of the religious figure. This is a common and simple ritual used in many places around the world. Decorate with flowers. You may wish to keep a bouquet of flowers on the altar, and think of the person every time you replace them with a fresh bouquet. Alternatively, grow flowers in a pot at the altar's base, or keep dried flowers as permanent decorations. Share food and drink with the honored person. Keep a plate and cup on the altar, and provide your deceased friend's favorite food and drink on holidays or important occasions. After leaving it on the altar for the length of the meal, you can share it among your friends or give it to those in need. Add any other decorations or ritual objects you think is appropriate. Change your altar however you wish to help you honor the person and live by his ideals. If that person belonged to a different religion than yours, consider adding a symbol of that religion as well. If the altar appears too somber for your needs, add brightly colored scarves or other objects to make it a happier place to remember your friend. Creating an Altar for Another Purpose Select a purpose or theme (optional). If you belong to a particular religion, you may wish to keep your altar decorated with figurines and holy objects related to it. Some make altars dedicated with a particular purpose, such as healing or meditation, and decorate it with objects that represent those from many cultures. As a simple, nondenominational example, you could build an altar representing the four classical elements: fire, air, water, and earth. For other specific examples, see Make a Taoist Altar, Create a Simple Buddhist Shrine, or Set up a Wiccan Samhain Altar. Lay down a decorative cloth. Many altars begin with a cloth to keep the altar surface clean and communicate the intent of the altar. For example, a simple white cloth can help you stay focused and contemplative. A bright, decorated cloth can help raise your spirits, while an outdoor altar could have a cloth with muted autumn colors that don't distract from nature. To continue the example of an altar dedicated to the four classical elements, you could choose four small cloths and lay them next to each other: red (fire), white or light blue (air), dark blue (water), and brown (earth). Place texts on the altar for reading during use. If you belong to a religion with sacred texts, include a copy on the altar to read for inspiration. Otherwise, consider adding a different book, poem, or other text that is important to you, and will help you reach the mental, emotional, or spiritual state the altar is intended to provide. Include images related to the theme of the altar. Orthodox shrines commonly have icons of the saints or other religious figures. Hindu shrines may include figurines of the gods that are being honored. Even if you're not religious, think of artwork you could include that is related to your altar's purpose. Continuing the example of an elemental altar, you could include a charcoal drawing of flames (fire), calligraphy drawn with a bird's quill (air), a watercolor painting of a seascape (water), and a clay statuette (earth). Include any objects you wish to use in rituals. These vary widely depending on the spiritual tradition and personal preference of the altar's builder. You may have many herbs, crystals, and specialized containers if you conduct many rituals. On the other hand, it's completely acceptable to simply include a candle which you light before you pray, or a journal in which you write your thoughts. An elemental altar might include a candle (fire), a fan (air), a glass of water (water), and a handful of soil (earth). You can hold each of these items in turn as you contemplate the element and what it represents, or invent a more elaborate ritual. Use any other decorations or ritual objects. Add to your altar however you like. You may wish to add flowers, decorative figurines, or other decorations. You may decide to put photographs of happy memories around the altar. You may prefer to keep the altar relatively bare. It's all up to you. Other related objects that could go on your elemental altar include seashells, rocks, feathers, partially burned wood, or anything else you think represents or complements the elements. Using an Altar Decide how to conduct yourself near the altar. When you approach the altar for worship, adopt a specific posture, make a habit of adopting a specific posture. You may stand, sit, kneel, or adopt any other posture that makes you feel attentive to the altar and what it represents. If you think it's important to adopt a celebratory or energetic mood, you could even dance around the altar. Pray. You do not need to be religious to pray, or need to address anyone or anything in particular. If you are religious, you may wish to learn traditional prayers. Alternatively, express yourself silently, quietly, or loudly as you feel comfortable. Commonly, people pray to ask for healing for themselves and their loved ones, to ask for forgiveness, or to request guidance in making a decision. Meditate. If you don't feel comfortable praying, or if you simply need to relax and calm yourself, meditation is a useful skill to learn and practice. Some people do not distinguish between meditation and prayer. Burn oil or another offering. Burning a candle, food, or another object is often considered an \"offering\" to another power. Most Christian and Jewish worshippers do not offer animal sacrifices, and sometimes consider it to be against their religion. Even if you belong to one of these religions, you may decide to make another offering, such as the small container of oil burned on Orthodox shrines. This can be interpreted as a literal offering (carried in the smoke), or as a symbolic act to show you are willing to make a sacrifice. It can also simply be a ritual you use to worship, without having to analyze its meaning.",
    "sentences": [
        " Starting an Altar Learn about altar traditions (optional).",
        "If you are constructing an altar for a specific purpose or holiday, you might want to look up details of that tradition online before you begin.",
        "Searching for photos and examples of similar altars is a great way to get started.",
        "Many people mix and match components of different religions, spiritual traditions, and cultures that have personal importance to them.",
        "Day of the Dead altars typically include pictures of saints and deceased relatives; candles; flowers, food, and drink.",
        "You can make a similar altar in homage of a deceased friend or relative, using food and toys that person would enjoy.",
        "St. Joseph's Day Altars are constructed in many places on March 19th.",
        "They are usually constructed in three tiers covered with food and decorations, surrounding a statue of St. Joseph.",
        "You can construct a similar altar to celebrate another holiday.",
        "After honoring the saint or holiday, eat the food with friends and family or give it to people in need of food.",
        "Choose a location.",
        "If you plan to quietly meditate or pray, select a quiet location out of the way of passers-by.",
        "If you wish to keep your altar as a central focus point or use it for group ceremonies, place it in a larger room.",
        "If space is limited and you travel a lot, consider making a portable altar.",
        "This can be a collapsible table, a tray, or even a cloth that can be packed in a suitcase along with a few altar decorations.",
        "Choose or construct an altar surface.",
        "Your altar may be located anywhere you choose for example it could be a stack of stones in your garden, on shelves on a glass-protected cabinet, on a cloth on the floor, on your kitchen table, in a designated room, or any place that you feel it should be.",
        "If you plan to use the altar for rituals that require table space, for instance grinding herbs or burning incense, make sure it is large and flat enough for that purpose.",
        "Add other furniture or shelves to the altar if necessary.",
        "Also, you may choose to place a cushion or chair in front of your altar for meditation or prayer.",
        "If there will be children or people shorter than you using the altar, consider whether you need to add an additional lower surface that everyone can reach.",
        "Ritually prepare the space (optional).",
        "You may wish to burn incense or ritually burn sage to prepare the space.",
        "Alternatively, recite a prayer or speak without preparation, asking the deity or power you worship to bless the altar.",
        "Dedicating an Altar to a Person or Religious Figure Decide who to dedicate the altar to.",
        "One common use of altars is to honor and remember a religious figure, or a deceased relative, friend, or historical figure.",
        "Some of these are dedicated to multiple people, such as a deceased friend and his patron saint.",
        "In some traditions, these are called shrines instead of altars.",
        "Include icons, figurines, photographs, or pictures.",
        "Unless you belong to a religious denomination that does not allow images of the divine, place an image of the person or people you are honoring in a prominent location on the altar, such as on a high stand at the back of the altar.",
        "You may wish to include several images, representing different sides of the honored person.",
        "For instance, a photograph of the person at her wedding and a photograph of her with her family.",
        "Include mementos or objects related to the subject.",
        "Display objects on the shrine that remind you of the person being honored.",
        "This can be gifts they gave you, objects they enjoyed in life, or objects that represent what they did in their profession, hobbies, or personal life.",
        "If you are honoring a religious figure, research what objects they are associated with online.",
        "Patron saints, deities of polytheist traditions (Greek, Hindu, Roman, Egyptian, etc.",
        "), and most other religious figures have many objects or actions associated with their worship.",
        "Consider adding candles.",
        "Place candles around the edge of the altar so you can light them in memory of the person, or in honor of the religious figure.",
        "This is a common and simple ritual used in many places around the world.",
        "Decorate with flowers.",
        "You may wish to keep a bouquet of flowers on the altar, and think of the person every time you replace them with a fresh bouquet.",
        "Alternatively, grow flowers in a pot at the altar's base, or keep dried flowers as permanent decorations.",
        "Share food and drink with the honored person.",
        "Keep a plate and cup on the altar, and provide your deceased friend's favorite food and drink on holidays or important occasions.",
        "After leaving it on the altar for the length of the meal, you can share it among your friends or give it to those in need.",
        "Add any other decorations or ritual objects you think is appropriate.",
        "Change your altar however you wish to help you honor the person and live by his ideals.",
        "If that person belonged to a different religion than yours, consider adding a symbol of that religion as well.",
        "If the altar appears too somber for your needs, add brightly colored scarves or other objects to make it a happier place to remember your friend.",
        "Creating an Altar for Another Purpose Select a purpose or theme (optional).",
        "If you belong to a particular religion, you may wish to keep your altar decorated with figurines and holy objects related to it.",
        "Some make altars dedicated with a particular purpose, such as healing or meditation, and decorate it with objects that represent those from many cultures.",
        "As a simple, nondenominational example, you could build an altar representing the four classical elements: fire, air, water, and earth.",
        "For other specific examples, see Make a Taoist Altar, Create a Simple Buddhist Shrine, or Set up a Wiccan Samhain Altar.",
        "Lay down a decorative cloth.",
        "Many altars begin with a cloth to keep the altar surface clean and communicate the intent of the altar.",
        "For example, a simple white cloth can help you stay focused and contemplative.",
        "A bright, decorated cloth can help raise your spirits, while an outdoor altar could have a cloth with muted autumn colors that don't distract from nature.",
        "To continue the example of an altar dedicated to the four classical elements, you could choose four small cloths and lay them next to each other: red (fire), white or light blue (air), dark blue (water), and brown (earth).",
        "Place texts on the altar for reading during use.",
        "If you belong to a religion with sacred texts, include a copy on the altar to read for inspiration.",
        "Otherwise, consider adding a different book, poem, or other text that is important to you, and will help you reach the mental, emotional, or spiritual state the altar is intended to provide.",
        "Include images related to the theme of the altar.",
        "Orthodox shrines commonly have icons of the saints or other religious figures.",
        "Hindu shrines may include figurines of the gods that are being honored.",
        "Even if you're not religious, think of artwork you could include that is related to your altar's purpose.",
        "Continuing the example of an elemental altar, you could include a charcoal drawing of flames (fire), calligraphy drawn with a bird's quill (air), a watercolor painting of a seascape (water), and a clay statuette (earth).",
        "Include any objects you wish to use in rituals.",
        "These vary widely depending on the spiritual tradition and personal preference of the altar's builder.",
        "You may have many herbs, crystals, and specialized containers if you conduct many rituals.",
        "On the other hand, it's completely acceptable to simply include a candle which you light before you pray, or a journal in which you write your thoughts.",
        "An elemental altar might include a candle (fire), a fan (air), a glass of water (water), and a handful of soil (earth).",
        "You can hold each of these items in turn as you contemplate the element and what it represents, or invent a more elaborate ritual.",
        "Use any other decorations or ritual objects.",
        "Add to your altar however you like.",
        "You may wish to add flowers, decorative figurines, or other decorations.",
        "You may decide to put photographs of happy memories around the altar.",
        "You may prefer to keep the altar relatively bare.",
        "It's all up to you.",
        "Other related objects that could go on your elemental altar include seashells, rocks, feathers, partially burned wood, or anything else you think represents or complements the elements.",
        "Using an Altar Decide how to conduct yourself near the altar.",
        "When you approach the altar for worship, adopt a specific posture, make a habit of adopting a specific posture.",
        "You may stand, sit, kneel, or adopt any other posture that makes you feel attentive to the altar and what it represents.",
        "If you think it's important to adopt a celebratory or energetic mood, you could even dance around the altar.",
        "Pray.",
        "You do not need to be religious to pray, or need to address anyone or anything in particular.",
        "If you are religious, you may wish to learn traditional prayers.",
        "Alternatively, express yourself silently, quietly, or loudly as you feel comfortable.",
        "Commonly, people pray to ask for healing for themselves and their loved ones, to ask for forgiveness, or to request guidance in making a decision.",
        "Meditate.",
        "If you don't feel comfortable praying, or if you simply need to relax and calm yourself, meditation is a useful skill to learn and practice.",
        "Some people do not distinguish between meditation and prayer.",
        "Burn oil or another offering.",
        "Burning a candle, food, or another object is often considered an \"offering\" to another power.",
        "Most Christian and Jewish worshippers do not offer animal sacrifices, and sometimes consider it to be against their religion.",
        "Even if you belong to one of these religions, you may decide to make another offering, such as the small container of oil burned on Orthodox shrines.",
        "This can be interpreted as a literal offering (carried in the smoke), or as a symbolic act to show you are willing to make a sacrifice.",
        "It can also simply be a ritual you use to worship, without having to analyze its meaning."
    ]
}