{
    "title": "How to Defeat Black Elemental in Final Fantasy X 2",
    "url": "https://www.wikihow.com/Defeat-Black-Elemental-in-Final-Fantasy-X-2",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Video Games",
        "Multi Platform Games",
        "Final Fantasy"
    ],
    "steps": [
        {
            "headline": "Equip one girl in the Songstress dressphere and the other two in the Gunner dressphere.",
            "description": "Equip accessories bearing the Berserkproof ability. Start the battle."
        },
        {
            "headline": "Immediately have the Songstress use Magical Masque.",
            "description": "This move will make Black Elemental's magic attacks completely harmless for as long as the girl is dancing. Make sure to use it again when it wears off."
        },
        {
            "headline": "Have the Gunners use the ability Tableturner on Black Elemental.",
            "description": "It has a very high Defense and Magic Defense, so normal physical and magical attacks won't do much damage. Tableturner ignores Defense and does more damage on high defense enemies so use that."
        },
        {
            "headline": "Keep doing the following and you should beat Black Elemental.",
            "description": "He only has 9,999 HP. (If he's oversouled he has a little over 10,000 HP.)"
        }
    ],
    "tyn": [
        "Two girls with Gunner Dressphere with Tableturner learned.",
        "One girl with Songstress with Magical Masque learned.",
        "Berserkproof accessories."
    ],
    "text": " Equip one girl in the Songstress dressphere and the other two in the Gunner dressphere. Equip accessories bearing the Berserkproof ability. Start the battle. Immediately have the Songstress use Magical Masque. This move will make Black Elemental's magic attacks completely harmless for as long as the girl is dancing. Make sure to use it again when it wears off. Have the Gunners use the ability Tableturner on Black Elemental. It has a very high Defense and Magic Defense, so normal physical and magical attacks won't do much damage. Tableturner ignores Defense and does more damage on high defense enemies so use that. Keep doing the following and you should beat Black Elemental. He only has 9,999 HP. (If he's oversouled he has a little over 10,000 HP.)",
    "sentences": [
        " Equip one girl in the Songstress dressphere and the other two in the Gunner dressphere.",
        "Equip accessories bearing the Berserkproof ability.",
        "Start the battle.",
        "Immediately have the Songstress use Magical Masque.",
        "This move will make Black Elemental's magic attacks completely harmless for as long as the girl is dancing.",
        "Make sure to use it again when it wears off.",
        "Have the Gunners use the ability Tableturner on Black Elemental.",
        "It has a very high Defense and Magic Defense, so normal physical and magical attacks won't do much damage.",
        "Tableturner ignores Defense and does more damage on high defense enemies so use that.",
        "Keep doing the following and you should beat Black Elemental.",
        "He only has 9,999 HP.",
        "(If he's oversouled he has a little over 10,000 HP.)"
    ]
}