{
    "title": "How to Make Chicken Meatballs",
    "url": "https://www.wikihow.com/Make-Chicken-Meatballs",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Poultry Recipes",
        "Chicken"
    ],
    "methods": [
        {
            "name": "Making Fried Meatballs",
            "steps": [
                {
                    "headline": "Get some good-quality, white-meat, ground chicken.",
                    "description": "It's best to get it freshly ground at the butcher, but you can get it pre-packaged as well."
                },
                {
                    "headline": "Put all of the ingredients, except for the oil, into a large bowl, and mix them together.",
                    "description": "You can do this using a wooden spoon or a rubber spatula. Keep mixing until everything is evenly combined. Do not add the oil yet; save it for frying. To save dishes, beat the egg with a fork or mini whisk in the large bowl first, then add the rest of the ingredients (except for the oil, of course). For a twist, omit the garlic and oregano, and use 1 small, diced onion and ¼ cup (5 grams) of fresh, chopped parsley."
                },
                {
                    "headline": "Roll the mixture into 1-inch (2.54 centimeters) balls.",
                    "description": "Using your hands or a spoon, form the mixture into small balls, about 1-inch (2.54 centimeters) wide. Set them down on a smooth surface as you finish them so that they don't stick."
                },
                {
                    "headline": "Heat the olive oil in a large, non-stick skillet.",
                    "description": "If the skillet is not big enough to fit all of the meatballs, consider using only 1 tablespoon of olive oil for the first batch, and another tablespoon for the second batch. This way, you won't run into the risk of some meatballs being much oilier than others."
                },
                {
                    "headline": "Fry the meatballs until they are done, about 10 to 15 minutes.",
                    "description": "Place up to eight meatballs into the pan, and cook them until they are done. This will take about 10 to 15 minutes. Avoid cramming all of the meatballs into the pan, or they won't cook properly. To make the meatballs extra crispy, roll them in some all-purpose flour first."
                },
                {
                    "headline": "Remove the meatballs using a slotted spoon, and serve them immediately.",
                    "description": "You can serve them with some lemon wedges, tzatziki, or your favorite pasta and pasta sauce."
                }
            ]
        },
        {
            "name": "Making Baked Meatballs",
            "steps": [
                {
                    "headline": "Preheat your oven to 400°F (205°C).",
                    "description": "Make sure that the baking rack is in the upper third of your oven."
                },
                {
                    "headline": "Soak the bread in the milk for about 4 minutes, or until it is soft.",
                    "description": "Tear about 3 slices of bread into small chunks, enough to fill 1 cup (50 grams). Pour the milk into a bowl, then add the torn bread. Let the bread soak until it softens, about 4 minutes."
                },
                {
                    "headline": "Cook the pancetta, onion, and garlic in a large skillet with 1 tablespoon of olive oil, then let it cool slightly.",
                    "description": "Heat 1 tablespoon of olive oil in a large skillet over medium heat. Once the oil is hot and sizzling, add the pancetta, onion, and garlic. Season it with salt and pepper, then cook until the onion turns soft. This will take about 6 minutes. Set the mixture aside to cool when you're done. You can use Canadian bacon instead of pancetta. The best size skillet to work with is 10 inches (25.4 centimeters)."
                },
                {
                    "headline": "Take the bread out of the milk, and squeeze it.",
                    "description": "This will remove any excess milk. Pour the milk out when you are done, then set the bread aside."
                },
                {
                    "headline": "Combine the lightly-beaten with the ground chicken in a large bowl.",
                    "description": "To save mixing bowls, beat the egg with a fork or mini whisk in a large mixing bowl first, then add the chicken. It is best to use freshly-ground chicken (as the butcher at your grocery if he or she can do it for you)."
                },
                {
                    "headline": "Add 1 tablespoon of tomato paste, the onion mixture, the soaked bread, and the parsley.",
                    "description": "Stir the ingredients together using a rubber spatula or a wooden spoon until everything is evenly combined."
                },
                {
                    "headline": "Roll the mixture into 12, evenly-sized balls.",
                    "description": "Use a spoon to scoop out the meat, and your hands to roll it into a ball. This will help ensure that each ball is the same size."
                },
                {
                    "headline": "Arrange the meatballs on a baking sheet or in a roasting dish.",
                    "description": "A 9 by 13-inch (22.86 by 33.02 centimeters) size would be ideal. Make sure that the meatballs are not touching, or they won't cook properly."
                },
                {
                    "headline": "Mix the rest of the olive oil and tomato paste, then brush it over the meatballs.",
                    "description": "In a small bowl, briskly mix together 1 tablespoon of olive oil and 1 tablespoon of tomato paste. You can do this using a fork or a mini whisk. Don't worry if the two don't mix together perfectly. Once you are done, use a basting brush to coat each meatball with the mixture."
                },
                {
                    "headline": "Bake the meatballs for 15 to 20 minutes, or until they are cooked through.",
                    "description": "If they still need some cooking, bake them for another 5 minutes, then test them again. The meat must be completely cooked through; if it's still pink inside, you need to cook it longer."
                },
                {
                    "headline": "Serve the meatballs while they are still hot.",
                    "description": "You can serve them as they are with some sauce, or you can add them to your favorite pasta dish."
                }
            ]
        }
    ],
    "tyn": [
        "Making Fried Meatballs",
        "Large mixing bowl",
        "Fork or mini whisk",
        "Wooden spoon or rubber spatula",
        "Large skillet",
        "Slotted spoon",
        "Making Baked Meatballs",
        "Small mixing bowl",
        "Baking sheet or roasting pan"
    ],
    "text": " Making Fried Meatballs Get some good-quality, white-meat, ground chicken. It's best to get it freshly ground at the butcher, but you can get it pre-packaged as well. Put all of the ingredients, except for the oil, into a large bowl, and mix them together. You can do this using a wooden spoon or a rubber spatula. Keep mixing until everything is evenly combined. Do not add the oil yet; save it for frying. To save dishes, beat the egg with a fork or mini whisk in the large bowl first, then add the rest of the ingredients (except for the oil, of course). For a twist, omit the garlic and oregano, and use 1 small, diced onion and ¼ cup (5 grams) of fresh, chopped parsley. Roll the mixture into 1-inch (2.54 centimeters) balls. Using your hands or a spoon, form the mixture into small balls, about 1-inch (2.54 centimeters) wide. Set them down on a smooth surface as you finish them so that they don't stick. Heat the olive oil in a large, non-stick skillet. If the skillet is not big enough to fit all of the meatballs, consider using only 1 tablespoon of olive oil for the first batch, and another tablespoon for the second batch. This way, you won't run into the risk of some meatballs being much oilier than others. Fry the meatballs until they are done, about 10 to 15 minutes. Place up to eight meatballs into the pan, and cook them until they are done. This will take about 10 to 15 minutes. Avoid cramming all of the meatballs into the pan, or they won't cook properly. To make the meatballs extra crispy, roll them in some all-purpose flour first. Remove the meatballs using a slotted spoon, and serve them immediately. You can serve them with some lemon wedges, tzatziki, or your favorite pasta and pasta sauce. Making Baked Meatballs Preheat your oven to 400°F (205°C). Make sure that the baking rack is in the upper third of your oven. Soak the bread in the milk for about 4 minutes, or until it is soft. Tear about 3 slices of bread into small chunks, enough to fill 1 cup (50 grams). Pour the milk into a bowl, then add the torn bread. Let the bread soak until it softens, about 4 minutes. Cook the pancetta, onion, and garlic in a large skillet with 1 tablespoon of olive oil, then let it cool slightly. Heat 1 tablespoon of olive oil in a large skillet over medium heat. Once the oil is hot and sizzling, add the pancetta, onion, and garlic. Season it with salt and pepper, then cook until the onion turns soft. This will take about 6 minutes. Set the mixture aside to cool when you're done. You can use Canadian bacon instead of pancetta. The best size skillet to work with is 10 inches (25.4 centimeters). Take the bread out of the milk, and squeeze it. This will remove any excess milk. Pour the milk out when you are done, then set the bread aside. Combine the lightly-beaten with the ground chicken in a large bowl. To save mixing bowls, beat the egg with a fork or mini whisk in a large mixing bowl first, then add the chicken. It is best to use freshly-ground chicken (as the butcher at your grocery if he or she can do it for you). Add 1 tablespoon of tomato paste, the onion mixture, the soaked bread, and the parsley. Stir the ingredients together using a rubber spatula or a wooden spoon until everything is evenly combined. Roll the mixture into 12, evenly-sized balls. Use a spoon to scoop out the meat, and your hands to roll it into a ball. This will help ensure that each ball is the same size. Arrange the meatballs on a baking sheet or in a roasting dish. A 9 by 13-inch (22.86 by 33.02 centimeters) size would be ideal. Make sure that the meatballs are not touching, or they won't cook properly. Mix the rest of the olive oil and tomato paste, then brush it over the meatballs. In a small bowl, briskly mix together 1 tablespoon of olive oil and 1 tablespoon of tomato paste. You can do this using a fork or a mini whisk. Don't worry if the two don't mix together perfectly. Once you are done, use a basting brush to coat each meatball with the mixture. Bake the meatballs for 15 to 20 minutes, or until they are cooked through. If they still need some cooking, bake them for another 5 minutes, then test them again. The meat must be completely cooked through; if it's still pink inside, you need to cook it longer. Serve the meatballs while they are still hot. You can serve them as they are with some sauce, or you can add them to your favorite pasta dish.",
    "sentences": [
        " Making Fried Meatballs Get some good-quality, white-meat, ground chicken.",
        "It's best to get it freshly ground at the butcher, but you can get it pre-packaged as well.",
        "Put all of the ingredients, except for the oil, into a large bowl, and mix them together.",
        "You can do this using a wooden spoon or a rubber spatula.",
        "Keep mixing until everything is evenly combined.",
        "Do not add the oil yet; save it for frying.",
        "To save dishes, beat the egg with a fork or mini whisk in the large bowl first, then add the rest of the ingredients (except for the oil, of course).",
        "For a twist, omit the garlic and oregano, and use 1 small, diced onion and ¼ cup (5 grams) of fresh, chopped parsley.",
        "Roll the mixture into 1-inch (2.54 centimeters) balls.",
        "Using your hands or a spoon, form the mixture into small balls, about 1-inch (2.54 centimeters) wide.",
        "Set them down on a smooth surface as you finish them so that they don't stick.",
        "Heat the olive oil in a large, non-stick skillet.",
        "If the skillet is not big enough to fit all of the meatballs, consider using only 1 tablespoon of olive oil for the first batch, and another tablespoon for the second batch.",
        "This way, you won't run into the risk of some meatballs being much oilier than others.",
        "Fry the meatballs until they are done, about 10 to 15 minutes.",
        "Place up to eight meatballs into the pan, and cook them until they are done.",
        "This will take about 10 to 15 minutes.",
        "Avoid cramming all of the meatballs into the pan, or they won't cook properly.",
        "To make the meatballs extra crispy, roll them in some all-purpose flour first.",
        "Remove the meatballs using a slotted spoon, and serve them immediately.",
        "You can serve them with some lemon wedges, tzatziki, or your favorite pasta and pasta sauce.",
        "Making Baked Meatballs Preheat your oven to 400°F (205°C).",
        "Make sure that the baking rack is in the upper third of your oven.",
        "Soak the bread in the milk for about 4 minutes, or until it is soft.",
        "Tear about 3 slices of bread into small chunks, enough to fill 1 cup (50 grams).",
        "Pour the milk into a bowl, then add the torn bread.",
        "Let the bread soak until it softens, about 4 minutes.",
        "Cook the pancetta, onion, and garlic in a large skillet with 1 tablespoon of olive oil, then let it cool slightly.",
        "Heat 1 tablespoon of olive oil in a large skillet over medium heat.",
        "Once the oil is hot and sizzling, add the pancetta, onion, and garlic.",
        "Season it with salt and pepper, then cook until the onion turns soft.",
        "This will take about 6 minutes.",
        "Set the mixture aside to cool when you're done.",
        "You can use Canadian bacon instead of pancetta.",
        "The best size skillet to work with is 10 inches (25.4 centimeters).",
        "Take the bread out of the milk, and squeeze it.",
        "This will remove any excess milk.",
        "Pour the milk out when you are done, then set the bread aside.",
        "Combine the lightly-beaten with the ground chicken in a large bowl.",
        "To save mixing bowls, beat the egg with a fork or mini whisk in a large mixing bowl first, then add the chicken.",
        "It is best to use freshly-ground chicken (as the butcher at your grocery if he or she can do it for you).",
        "Add 1 tablespoon of tomato paste, the onion mixture, the soaked bread, and the parsley.",
        "Stir the ingredients together using a rubber spatula or a wooden spoon until everything is evenly combined.",
        "Roll the mixture into 12, evenly-sized balls.",
        "Use a spoon to scoop out the meat, and your hands to roll it into a ball.",
        "This will help ensure that each ball is the same size.",
        "Arrange the meatballs on a baking sheet or in a roasting dish.",
        "A 9 by 13-inch (22.86 by 33.02 centimeters) size would be ideal.",
        "Make sure that the meatballs are not touching, or they won't cook properly.",
        "Mix the rest of the olive oil and tomato paste, then brush it over the meatballs.",
        "In a small bowl, briskly mix together 1 tablespoon of olive oil and 1 tablespoon of tomato paste.",
        "You can do this using a fork or a mini whisk.",
        "Don't worry if the two don't mix together perfectly.",
        "Once you are done, use a basting brush to coat each meatball with the mixture.",
        "Bake the meatballs for 15 to 20 minutes, or until they are cooked through.",
        "If they still need some cooking, bake them for another 5 minutes, then test them again.",
        "The meat must be completely cooked through; if it's still pink inside, you need to cook it longer.",
        "Serve the meatballs while they are still hot.",
        "You can serve them as they are with some sauce, or you can add them to your favorite pasta dish."
    ]
}