{
    "title": "How to Make Spicy Mayo",
    "url": "https://www.wikihow.com/Make-Spicy-Mayo",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments"
    ],
    "methods": [
        {
            "name": "Making Easy Spicy Mayo",
            "steps": [
                {
                    "headline": "Whisk together the hot sauce and mayo.",
                    "description": "Put the prepared mayonnaise and hot sauce in a glass bowl and whisk together, vigorously, until evenly combined. One very popular spicy mayo is made with sriracha. Keep in mind, many people may find this chili sauce to be extremely spicy. Taste test after you mix your mayo up to determine if you should add more chili, or perhaps water it down by adding more mayo. Keep whisking until the ingredients are completely combined. There should be no streaks of hot sauce running through the mayo. Instead, the color should be completely uniform."
                },
                {
                    "headline": "Add lemon juice, if desired.",
                    "description": "Drizzle the lemon juice into the spicy mayo and whisk well to combine. Lemon juice is not necessary, but if you sample the spicy mayo and decide that it is too hot for your preference, adding a little lemon juice can help cut down on some of the heat. Since the lemon juice will be harder to see than the hot sauce, you will need to make a rough estimate about whether or not the juice has been completely mixed in. Do this by mixing it in for approximately as long as you mixed in the hot sauce."
                },
                {
                    "headline": "Refrigerate until ready to serve.",
                    "description": "Cover your new condiment with plastic wrap or a lid and leave it in your refrigerators until you are ready to use it. The finished mayo will be a little thinner than standard mayo. If using the spicy mayo for sushi, you can pipe it through a pastry bag or a plastic bag with a small hole in the bottom. Squeeze a thin drizzle or trail of spicy mayo over the dish to spread the heat."
                }
            ]
        },
        {
            "name": "Stirring Up Simply Chipotle Mayo",
            "steps": [
                {
                    "headline": "Purchase your specialty chilis in adobo sauce.",
                    "description": "Chilis in adobo sauce are an ingredient commonly used in Mexican and Asian cooking. To find them look in the Mexican aisle of your grocery store, near the canned jalapeños. The chipotle chilis are prepared by the drying and smoking of jalapeños."
                },
                {
                    "headline": "Prepare your chiles.",
                    "description": "After opening your can of chipotle chiles, fish out two. Using a glass cutting board to prevent any absorption of heat, finely dice and chop your chiles. If you’d prefer a very fine mix, grind your chiles with adobo sauce in a food processor. This will turn them into a paste."
                },
                {
                    "headline": "Whisk all three ingredients together and store.",
                    "description": "Mix your chiles, adobo sauce, and prepared mayo until an even, salmon-like color. Once completed, store in an airtight container. To jazz up the look of your mayo, try garnishing it with a finely chopped chile, or a sprinkle of cayenne powder."
                }
            ]
        },
        {
            "name": "Making Spicy Mayo from Scratch",
            "steps": [
                {
                    "headline": "Separate the egg yolk.",
                    "description": "Crack the egg open over a small bowl. Capture the egg yolk in the shell while letting the white drain into the bowl. Use the yolk for your spicy mayo and discard the egg white. You may need to gently toss the egg yolk back and forth between the two eggshell halves in order to separate it completely from the white. To make life easier, you could also use an egg separator. Crack the egg into the separator and let the utensil do the rest of the work. If desired, the egg whites can be saved and used in another recipe. Egg yolks contain lecithin, a natural emulsifier that binds the ingredients together and thickens the mayo."
                },
                {
                    "headline": "Combine the yolk, vinegar, and lemon juice.",
                    "description": "Transfer the three ingredients to a medium glass mixing bowl and whisk them together thoroughly until completely, evenly combined. The mixture should be a vibrant yellow. Lemon juice and vinegar add both acidity and flavor to the final product. If desired, you can also mix the mayo in a food processor instead of whisking the ingredients together by hand. Using a food processor can make the process easier, but whisking it together by hand will work just as well."
                },
                {
                    "headline": "Add the seasonings.",
                    "description": "Add the Wasabi paste, minced garlic, Dijon mustard, Tabasco sauce, and salt to your mayo mixture and whisk well to incorporate. If using peppers, you do not need to remove the seeds before adding them. The seeds contain a large portion of the pepper's heat, so removing them will cut down on the spiciness of the mayo. When using a food processor, add these ingredients to the contents of the machine through the hole at the top of the glass. Pulse until the solid ingredients, like garlic or peppers, have been finely minced and incorporated into the mayo."
                },
                {
                    "headline": "Gradually whisk in 1/3 of the oil.",
                    "description": "Add 1/4 cup (60 ml) of olive oil to the mixture 1/4 tsp (1.25 ml) at a time, whisking continuously. This should take about 4 minutes. If the bowl begins to move around as you whisk, place a kitchen towel beneath it to hold it steady. While whisking by hand will still work well, this is the point at which a food processor really comes in handy. If using a food processor or blender, add the oil through the hole at the top of the lid. Continue to hold the pulse button down to steadily and continuously blend in the oil."
                },
                {
                    "headline": "Add the remaining oil slowly.",
                    "description": "Add the remaining 1/2 cup (125 ml) of olive oil to the mayo mixture in a slow, thin stream. Continue whisking continually as you add the rest of the oil. This step should take roughly 8 minutes. The spicy mayonnaise should be fairly thick once you finish adding the oil. If using a food processor, add the remaining oil in through the hole at the top of the lid. Continue to hold down the pulse button so that the contents are continuously mixed together."
                },
                {
                    "headline": "Chill until ready to serve.",
                    "description": "Cover the dish with a lid or plastic wrap and leave the condiment in the refrigerator until you are ready to use it. You should use fresh mayonnaise within 5 days. To beautify your efforts, cut up a thin, red, thai chili and distribute in the middle of your mayo. This adds a fun color contrast and gives your mayo a professional look."
                }
            ]
        },
        {
            "name": "Whipping Up Vegan Spicy Mayo",
            "steps": [
                {
                    "headline": "Blend together the flax seeds and almond milk.",
                    "description": "Combine the two ingredients in a blender at high speed until the flax seeds are almost impossible to distinguish. This should take roughly 1 minute or so. The resulting mixture should be very frothy. Choose a milk with the most neutral taste and smoothest texture possible. Unsweetened almond milk and unflavored soy milk are recommended. Avoid hemp or oat milk. You could use a food processor instead of a blender for this recipe, if desired. Whisking the ingredients by hand could also work, but it will be much more difficult to fully incorporate the flax seeds into the almond milk if you mix it by hand. The flax seeds replace the eggs in this recipe and are responsible for binding and thickening the spicy vegan mayo. They must be well blended before this thickening ability is activated, though."
                },
                {
                    "headline": "Add the seasonings.",
                    "description": "Transfer the sugar, dry mustard, onion powder, salt, paprika, and hot sauce to the contents of the blender and blend for another 30 seconds or so on high speed. Make sure that the hot sauce you use is vegan-friendly. If desired, you could skip the hot sauce altogether and use 3 small chilli padi, chopped into fine pieces."
                },
                {
                    "headline": "Mix in the acidic ingredients.",
                    "description": "Add the lemon juice and vinegar to the mayo mixture in the blender. Blend for another few seconds on high speed until combined. As with traditional egg-based mayonnaise, the lemon juice and vinegar in this recipe add acidity and flavor to the mayo."
                },
                {
                    "headline": "Slowly add the oil.",
                    "description": "Add the grapeseed oil in 1 Tbsp (15 ml) batches. Blend for a full 30 seconds after adding each batch of oil. Alternatively, you can slowly add the oil to the mayo mixture through the hole in the top of the lid in a slow, steady, and continuous stream. The essential thing is that the oil must be added slowly and evenly. Otherwise, the texture will not be consistent. Pause the blender every now and then when it starts to get hot. Otherwise, it will cause the mayo to heat up along with it. The mayo should begin to thicken after you have added half the oil. After you have added 3/4 of the oil, it should be spreadable. The final addition will create a thick consistency."
                },
                {
                    "headline": "Refrigerate for several hours.",
                    "description": "Scoop the spicy vegan mayo into a glass container and cover with a tight lid or plastic wrap. Refrigerate it for a few hours to let it thicken and store in the refrigerator when not in use. This mayo has a very strong, potent flavor initially. Chilling it in the refrigerator will help the taste mellow down and blend more evenly. Use this version within a week."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Preparing Horseradish Spicy Mayo",
            "steps": [
                {
                    "headline": "Prepare your horseradish.",
                    "description": "If using pre-made horseradish, simply measure out your called amount. Fresh horseradish will be significantly more potent than pre-made, so caution is needed when chopping it. To prepare it, simply chop up your horseradish root. Pour it into a food processor, add a few drops of water, and grind it up. Now you’ll have a paste similar to pre-made horseradish. When using fresh, you may wish to lower the amount called for in your recipe by half or more. Always remember it is easier to make something more spicy, than it is to make something less spicy."
                },
                {
                    "headline": "Combine all your ingredients.",
                    "description": "Using a whisk, mix your mayonnaise, horseradish, chives, lemon juice and pepper. Whisk until the color of the mayonnaise is solid, and even. There should be no streaks. Use a metal or glass bowl when making horseradish mayo. Horseradish is significantly more pungent than onions or chilis, and making your mayo in a plastic dish can leave a smell or flavour that is less-than-desirable after removing the mayo."
                },
                {
                    "headline": "Cover and refrigerate until you wish to devour your spicy horseradish mayo.",
                    "description": "Your mayonnaise will improve in flavour, but also spiciness, with age. If you can, make it the night before it is needed so the flavours have time to blend together and become more full."
                }
            ]
        }
    ],
    "tyn": [
        "Mixing bowl",
        "Whisk",
        "Food processor or blender",
        "Resealable container",
        "Plastic wrap"
    ],
    "text": " Making Easy Spicy Mayo Whisk together the hot sauce and mayo. Put the prepared mayonnaise and hot sauce in a glass bowl and whisk together, vigorously, until evenly combined. One very popular spicy mayo is made with sriracha. Keep in mind, many people may find this chili sauce to be extremely spicy. Taste test after you mix your mayo up to determine if you should add more chili, or perhaps water it down by adding more mayo. Keep whisking until the ingredients are completely combined. There should be no streaks of hot sauce running through the mayo. Instead, the color should be completely uniform. Add lemon juice, if desired. Drizzle the lemon juice into the spicy mayo and whisk well to combine. Lemon juice is not necessary, but if you sample the spicy mayo and decide that it is too hot for your preference, adding a little lemon juice can help cut down on some of the heat. Since the lemon juice will be harder to see than the hot sauce, you will need to make a rough estimate about whether or not the juice has been completely mixed in. Do this by mixing it in for approximately as long as you mixed in the hot sauce. Refrigerate until ready to serve. Cover your new condiment with plastic wrap or a lid and leave it in your refrigerators until you are ready to use it. The finished mayo will be a little thinner than standard mayo. If using the spicy mayo for sushi, you can pipe it through a pastry bag or a plastic bag with a small hole in the bottom. Squeeze a thin drizzle or trail of spicy mayo over the dish to spread the heat. Stirring Up Simply Chipotle Mayo Purchase your specialty chilis in adobo sauce. Chilis in adobo sauce are an ingredient commonly used in Mexican and Asian cooking. To find them look in the Mexican aisle of your grocery store, near the canned jalapeños. The chipotle chilis are prepared by the drying and smoking of jalapeños. Prepare your chiles. After opening your can of chipotle chiles, fish out two. Using a glass cutting board to prevent any absorption of heat, finely dice and chop your chiles. If you’d prefer a very fine mix, grind your chiles with adobo sauce in a food processor. This will turn them into a paste. Whisk all three ingredients together and store. Mix your chiles, adobo sauce, and prepared mayo until an even, salmon-like color. Once completed, store in an airtight container. To jazz up the look of your mayo, try garnishing it with a finely chopped chile, or a sprinkle of cayenne powder. Making Spicy Mayo from Scratch Separate the egg yolk. Crack the egg open over a small bowl. Capture the egg yolk in the shell while letting the white drain into the bowl. Use the yolk for your spicy mayo and discard the egg white. You may need to gently toss the egg yolk back and forth between the two eggshell halves in order to separate it completely from the white. To make life easier, you could also use an egg separator. Crack the egg into the separator and let the utensil do the rest of the work. If desired, the egg whites can be saved and used in another recipe. Egg yolks contain lecithin, a natural emulsifier that binds the ingredients together and thickens the mayo. Combine the yolk, vinegar, and lemon juice. Transfer the three ingredients to a medium glass mixing bowl and whisk them together thoroughly until completely, evenly combined. The mixture should be a vibrant yellow. Lemon juice and vinegar add both acidity and flavor to the final product. If desired, you can also mix the mayo in a food processor instead of whisking the ingredients together by hand. Using a food processor can make the process easier, but whisking it together by hand will work just as well. Add the seasonings. Add the Wasabi paste, minced garlic, Dijon mustard, Tabasco sauce, and salt to your mayo mixture and whisk well to incorporate. If using peppers, you do not need to remove the seeds before adding them. The seeds contain a large portion of the pepper's heat, so removing them will cut down on the spiciness of the mayo. When using a food processor, add these ingredients to the contents of the machine through the hole at the top of the glass. Pulse until the solid ingredients, like garlic or peppers, have been finely minced and incorporated into the mayo. Gradually whisk in 1/3 of the oil. Add 1/4 cup (60 ml) of olive oil to the mixture 1/4 tsp (1.25 ml) at a time, whisking continuously. This should take about 4 minutes. If the bowl begins to move around as you whisk, place a kitchen towel beneath it to hold it steady. While whisking by hand will still work well, this is the point at which a food processor really comes in handy. If using a food processor or blender, add the oil through the hole at the top of the lid. Continue to hold the pulse button down to steadily and continuously blend in the oil. Add the remaining oil slowly. Add the remaining 1/2 cup (125 ml) of olive oil to the mayo mixture in a slow, thin stream. Continue whisking continually as you add the rest of the oil. This step should take roughly 8 minutes. The spicy mayonnaise should be fairly thick once you finish adding the oil. If using a food processor, add the remaining oil in through the hole at the top of the lid. Continue to hold down the pulse button so that the contents are continuously mixed together. Chill until ready to serve. Cover the dish with a lid or plastic wrap and leave the condiment in the refrigerator until you are ready to use it. You should use fresh mayonnaise within 5 days. To beautify your efforts, cut up a thin, red, thai chili and distribute in the middle of your mayo. This adds a fun color contrast and gives your mayo a professional look. Whipping Up Vegan Spicy Mayo Blend together the flax seeds and almond milk. Combine the two ingredients in a blender at high speed until the flax seeds are almost impossible to distinguish. This should take roughly 1 minute or so. The resulting mixture should be very frothy. Choose a milk with the most neutral taste and smoothest texture possible. Unsweetened almond milk and unflavored soy milk are recommended. Avoid hemp or oat milk. You could use a food processor instead of a blender for this recipe, if desired. Whisking the ingredients by hand could also work, but it will be much more difficult to fully incorporate the flax seeds into the almond milk if you mix it by hand. The flax seeds replace the eggs in this recipe and are responsible for binding and thickening the spicy vegan mayo. They must be well blended before this thickening ability is activated, though. Add the seasonings. Transfer the sugar, dry mustard, onion powder, salt, paprika, and hot sauce to the contents of the blender and blend for another 30 seconds or so on high speed. Make sure that the hot sauce you use is vegan-friendly. If desired, you could skip the hot sauce altogether and use 3 small chilli padi, chopped into fine pieces. Mix in the acidic ingredients. Add the lemon juice and vinegar to the mayo mixture in the blender. Blend for another few seconds on high speed until combined. As with traditional egg-based mayonnaise, the lemon juice and vinegar in this recipe add acidity and flavor to the mayo. Slowly add the oil. Add the grapeseed oil in 1 Tbsp (15 ml) batches. Blend for a full 30 seconds after adding each batch of oil. Alternatively, you can slowly add the oil to the mayo mixture through the hole in the top of the lid in a slow, steady, and continuous stream. The essential thing is that the oil must be added slowly and evenly. Otherwise, the texture will not be consistent. Pause the blender every now and then when it starts to get hot. Otherwise, it will cause the mayo to heat up along with it. The mayo should begin to thicken after you have added half the oil. After you have added 3/4 of the oil, it should be spreadable. The final addition will create a thick consistency. Refrigerate for several hours. Scoop the spicy vegan mayo into a glass container and cover with a tight lid or plastic wrap. Refrigerate it for a few hours to let it thicken and store in the refrigerator when not in use. This mayo has a very strong, potent flavor initially. Chilling it in the refrigerator will help the taste mellow down and blend more evenly. Use this version within a week. Finished.  Preparing Horseradish Spicy Mayo Prepare your horseradish. If using pre-made horseradish, simply measure out your called amount. Fresh horseradish will be significantly more potent than pre-made, so caution is needed when chopping it. To prepare it, simply chop up your horseradish root. Pour it into a food processor, add a few drops of water, and grind it up. Now you’ll have a paste similar to pre-made horseradish. When using fresh, you may wish to lower the amount called for in your recipe by half or more. Always remember it is easier to make something more spicy, than it is to make something less spicy. Combine all your ingredients. Using a whisk, mix your mayonnaise, horseradish, chives, lemon juice and pepper. Whisk until the color of the mayonnaise is solid, and even. There should be no streaks. Use a metal or glass bowl when making horseradish mayo. Horseradish is significantly more pungent than onions or chilis, and making your mayo in a plastic dish can leave a smell or flavour that is less-than-desirable after removing the mayo. Cover and refrigerate until you wish to devour your spicy horseradish mayo. Your mayonnaise will improve in flavour, but also spiciness, with age. If you can, make it the night before it is needed so the flavours have time to blend together and become more full.",
    "sentences": [
        " Making Easy Spicy Mayo Whisk together the hot sauce and mayo.",
        "Put the prepared mayonnaise and hot sauce in a glass bowl and whisk together, vigorously, until evenly combined.",
        "One very popular spicy mayo is made with sriracha.",
        "Keep in mind, many people may find this chili sauce to be extremely spicy.",
        "Taste test after you mix your mayo up to determine if you should add more chili, or perhaps water it down by adding more mayo.",
        "Keep whisking until the ingredients are completely combined.",
        "There should be no streaks of hot sauce running through the mayo.",
        "Instead, the color should be completely uniform.",
        "Add lemon juice, if desired.",
        "Drizzle the lemon juice into the spicy mayo and whisk well to combine.",
        "Lemon juice is not necessary, but if you sample the spicy mayo and decide that it is too hot for your preference, adding a little lemon juice can help cut down on some of the heat.",
        "Since the lemon juice will be harder to see than the hot sauce, you will need to make a rough estimate about whether or not the juice has been completely mixed in.",
        "Do this by mixing it in for approximately as long as you mixed in the hot sauce.",
        "Refrigerate until ready to serve.",
        "Cover your new condiment with plastic wrap or a lid and leave it in your refrigerators until you are ready to use it.",
        "The finished mayo will be a little thinner than standard mayo.",
        "If using the spicy mayo for sushi, you can pipe it through a pastry bag or a plastic bag with a small hole in the bottom.",
        "Squeeze a thin drizzle or trail of spicy mayo over the dish to spread the heat.",
        "Stirring Up Simply Chipotle Mayo Purchase your specialty chilis in adobo sauce.",
        "Chilis in adobo sauce are an ingredient commonly used in Mexican and Asian cooking.",
        "To find them look in the Mexican aisle of your grocery store, near the canned jalapeños.",
        "The chipotle chilis are prepared by the drying and smoking of jalapeños.",
        "Prepare your chiles.",
        "After opening your can of chipotle chiles, fish out two.",
        "Using a glass cutting board to prevent any absorption of heat, finely dice and chop your chiles.",
        "If you’d prefer a very fine mix, grind your chiles with adobo sauce in a food processor.",
        "This will turn them into a paste.",
        "Whisk all three ingredients together and store.",
        "Mix your chiles, adobo sauce, and prepared mayo until an even, salmon-like color.",
        "Once completed, store in an airtight container.",
        "To jazz up the look of your mayo, try garnishing it with a finely chopped chile, or a sprinkle of cayenne powder.",
        "Making Spicy Mayo from Scratch Separate the egg yolk.",
        "Crack the egg open over a small bowl.",
        "Capture the egg yolk in the shell while letting the white drain into the bowl.",
        "Use the yolk for your spicy mayo and discard the egg white.",
        "You may need to gently toss the egg yolk back and forth between the two eggshell halves in order to separate it completely from the white.",
        "To make life easier, you could also use an egg separator.",
        "Crack the egg into the separator and let the utensil do the rest of the work.",
        "If desired, the egg whites can be saved and used in another recipe.",
        "Egg yolks contain lecithin, a natural emulsifier that binds the ingredients together and thickens the mayo.",
        "Combine the yolk, vinegar, and lemon juice.",
        "Transfer the three ingredients to a medium glass mixing bowl and whisk them together thoroughly until completely, evenly combined.",
        "The mixture should be a vibrant yellow.",
        "Lemon juice and vinegar add both acidity and flavor to the final product.",
        "If desired, you can also mix the mayo in a food processor instead of whisking the ingredients together by hand.",
        "Using a food processor can make the process easier, but whisking it together by hand will work just as well.",
        "Add the seasonings.",
        "Add the Wasabi paste, minced garlic, Dijon mustard, Tabasco sauce, and salt to your mayo mixture and whisk well to incorporate.",
        "If using peppers, you do not need to remove the seeds before adding them.",
        "The seeds contain a large portion of the pepper's heat, so removing them will cut down on the spiciness of the mayo.",
        "When using a food processor, add these ingredients to the contents of the machine through the hole at the top of the glass.",
        "Pulse until the solid ingredients, like garlic or peppers, have been finely minced and incorporated into the mayo.",
        "Gradually whisk in 1/3 of the oil.",
        "Add 1/4 cup (60 ml) of olive oil to the mixture 1/4 tsp (1.25 ml) at a time, whisking continuously.",
        "This should take about 4 minutes.",
        "If the bowl begins to move around as you whisk, place a kitchen towel beneath it to hold it steady.",
        "While whisking by hand will still work well, this is the point at which a food processor really comes in handy.",
        "If using a food processor or blender, add the oil through the hole at the top of the lid.",
        "Continue to hold the pulse button down to steadily and continuously blend in the oil.",
        "Add the remaining oil slowly.",
        "Add the remaining 1/2 cup (125 ml) of olive oil to the mayo mixture in a slow, thin stream.",
        "Continue whisking continually as you add the rest of the oil.",
        "This step should take roughly 8 minutes.",
        "The spicy mayonnaise should be fairly thick once you finish adding the oil.",
        "If using a food processor, add the remaining oil in through the hole at the top of the lid.",
        "Continue to hold down the pulse button so that the contents are continuously mixed together.",
        "Chill until ready to serve.",
        "Cover the dish with a lid or plastic wrap and leave the condiment in the refrigerator until you are ready to use it.",
        "You should use fresh mayonnaise within 5 days.",
        "To beautify your efforts, cut up a thin, red, thai chili and distribute in the middle of your mayo.",
        "This adds a fun color contrast and gives your mayo a professional look.",
        "Whipping Up Vegan Spicy Mayo Blend together the flax seeds and almond milk.",
        "Combine the two ingredients in a blender at high speed until the flax seeds are almost impossible to distinguish.",
        "This should take roughly 1 minute or so.",
        "The resulting mixture should be very frothy.",
        "Choose a milk with the most neutral taste and smoothest texture possible.",
        "Unsweetened almond milk and unflavored soy milk are recommended.",
        "Avoid hemp or oat milk.",
        "You could use a food processor instead of a blender for this recipe, if desired.",
        "Whisking the ingredients by hand could also work, but it will be much more difficult to fully incorporate the flax seeds into the almond milk if you mix it by hand.",
        "The flax seeds replace the eggs in this recipe and are responsible for binding and thickening the spicy vegan mayo.",
        "They must be well blended before this thickening ability is activated, though.",
        "Add the seasonings.",
        "Transfer the sugar, dry mustard, onion powder, salt, paprika, and hot sauce to the contents of the blender and blend for another 30 seconds or so on high speed.",
        "Make sure that the hot sauce you use is vegan-friendly.",
        "If desired, you could skip the hot sauce altogether and use 3 small chilli padi, chopped into fine pieces.",
        "Mix in the acidic ingredients.",
        "Add the lemon juice and vinegar to the mayo mixture in the blender.",
        "Blend for another few seconds on high speed until combined.",
        "As with traditional egg-based mayonnaise, the lemon juice and vinegar in this recipe add acidity and flavor to the mayo.",
        "Slowly add the oil.",
        "Add the grapeseed oil in 1 Tbsp (15 ml) batches.",
        "Blend for a full 30 seconds after adding each batch of oil.",
        "Alternatively, you can slowly add the oil to the mayo mixture through the hole in the top of the lid in a slow, steady, and continuous stream.",
        "The essential thing is that the oil must be added slowly and evenly.",
        "Otherwise, the texture will not be consistent.",
        "Pause the blender every now and then when it starts to get hot.",
        "Otherwise, it will cause the mayo to heat up along with it.",
        "The mayo should begin to thicken after you have added half the oil.",
        "After you have added 3/4 of the oil, it should be spreadable.",
        "The final addition will create a thick consistency.",
        "Refrigerate for several hours.",
        "Scoop the spicy vegan mayo into a glass container and cover with a tight lid or plastic wrap.",
        "Refrigerate it for a few hours to let it thicken and store in the refrigerator when not in use.",
        "This mayo has a very strong, potent flavor initially.",
        "Chilling it in the refrigerator will help the taste mellow down and blend more evenly.",
        "Use this version within a week.",
        "Finished.",
        "Preparing Horseradish Spicy Mayo Prepare your horseradish.",
        "If using pre-made horseradish, simply measure out your called amount.",
        "Fresh horseradish will be significantly more potent than pre-made, so caution is needed when chopping it.",
        "To prepare it, simply chop up your horseradish root.",
        "Pour it into a food processor, add a few drops of water, and grind it up.",
        "Now you’ll have a paste similar to pre-made horseradish.",
        "When using fresh, you may wish to lower the amount called for in your recipe by half or more.",
        "Always remember it is easier to make something more spicy, than it is to make something less spicy.",
        "Combine all your ingredients.",
        "Using a whisk, mix your mayonnaise, horseradish, chives, lemon juice and pepper.",
        "Whisk until the color of the mayonnaise is solid, and even.",
        "There should be no streaks.",
        "Use a metal or glass bowl when making horseradish mayo.",
        "Horseradish is significantly more pungent than onions or chilis, and making your mayo in a plastic dish can leave a smell or flavour that is less-than-desirable after removing the mayo.",
        "Cover and refrigerate until you wish to devour your spicy horseradish mayo.",
        "Your mayonnaise will improve in flavour, but also spiciness, with age.",
        "If you can, make it the night before it is needed so the flavours have time to blend together and become more full."
    ]
}