{
    "title": "How to Make a Small Dumpling Coin Purse",
    "url": "https://www.wikihow.com/Make-a-Small-Dumpling-Coin-Purse",
    "category_hierarchy": [
        "Personal Care and Style",
        "Bags"
    ],
    "parts": [
        {
            "name": "Preparing the templates",
            "steps": [
                {
                    "headline": "Draw the basic shape for the purse onto pattern paper.",
                    "description": "Follow the black outline as shown in the image; the main outline on the outermost side of the purse shape is for the outer fabric for the purse, and its eventual inner lining (not the batting but the lining), while the two inner outlines are for the batting or felt rests of the purse (each of these pieces look a little like a basic crown shape). These drawings will form the template. Note that the size is dependent on the size you want the final purse to be, so adjust the template size according to your need. Incorporate a 1cm/2.5 inch seam allowance for the outer piece of fabric when finalizing the size. The inner pieces of batting or felt rests will sit as shown in the template image, so ensure that when drawing them to size, they are at an evenly spaced distance from the outer piece's edges on all sides, such as an even 2cm/5 inch distance from the edge, or whatever fits well with the dimensions you're applying (this width will vary depending on the size you've chosen for the purse)."
                },
                {
                    "headline": "Cut out the paper templates.",
                    "description": "You will reuse the outer fabric template for the lining as well, so use with care."
                }
            ]
        },
        {
            "name": "Cutting the fabric",
            "steps": [
                {
                    "headline": "Place the outer cotton fabric template on the outer fabric.",
                    "description": "Pin in place. Cut out the purse fabric in its entirety."
                },
                {
                    "headline": "Repeat for the cotton lining fabric.",
                    "description": "Lay the outer fabric template onto the lining fabric cotton and pin in place. Then cut out the shape."
                },
                {
                    "headline": "Place the batting or felt rest pieces on the lining fabric.",
                    "description": "Cut out the two batting or felt rest pieces."
                },
                {
                    "headline": "Attach the two batting or felt rest pieces to the wrong side of the outer fabric piece.",
                    "description": "Position them as shown in this step's image; these pieces will help hold the shape of the purse and buffer it from being squashed when in use. Use fabric glue to attach these two batting pieces. The fabric is now ready for sewing; see the image for what you should have in front of you now."
                }
            ]
        },
        {
            "name": "Making the dumpling purse",
            "steps": [
                {
                    "headline": "Fold the outer fabric in half.",
                    "description": "Have the wrong side facing outward. Sew the two side edges together, from the bottom up to the top. Leave the two curved edges at the top unsewn."
                },
                {
                    "headline": "Turn the purse inside out.",
                    "description": ""
                },
                {
                    "headline": "Fold the purse.",
                    "description": "See the image for points A and B. Using these points, fold the bag so as to bring points A and B to match together. Clip or pin these two sides together, to hold the purse shape in place, in readiness for sewing."
                },
                {
                    "headline": "Sew the two edges of one of the clipped sides together.",
                    "description": "The other side will be left open for the addition of the zipper shortly. Then sew in the zipper on the remaining open side. Use the image to guide you."
                },
                {
                    "headline": "Add the lining piece.",
                    "description": "Sew the cotton lining piece as for the outer piece, so that it forms the dumpling shape, without a zipper attached. Push this inside the purse and either clip or pin it in place, as shown in the image."
                },
                {
                    "headline": "Turn the purse inside out.",
                    "description": "Sew it onto the purse, around the edges. Neaten and adjust as you sew."
                },
                {
                    "headline": "Turn the purse the right side out.",
                    "description": "The dumpling-shaped purse is now done."
                }
            ]
        }
    ],
    "tyn": [
        "Paper and marker for making the template",
        "Cotton fabric for the purse outer",
        "Batting (thin) or felt for creating the protective inner layer",
        "Cotton lining for the pretty inner layer (this goes over the batting/protective pieces)",
        "Fabric glue",
        "Sewing threads",
        "Zipper",
        "Needle",
        "Scissors",
        "Clips or pins"
    ],
    "text": " Preparing the templates Draw the basic shape for the purse onto pattern paper. Follow the black outline as shown in the image; the main outline on the outermost side of the purse shape is for the outer fabric for the purse, and its eventual inner lining (not the batting but the lining), while the two inner outlines are for the batting or felt rests of the purse (each of these pieces look a little like a basic crown shape). These drawings will form the template. Note that the size is dependent on the size you want the final purse to be, so adjust the template size according to your need. Incorporate a 1cm/2.5 inch seam allowance for the outer piece of fabric when finalizing the size. The inner pieces of batting or felt rests will sit as shown in the template image, so ensure that when drawing them to size, they are at an evenly spaced distance from the outer piece's edges on all sides, such as an even 2cm/5 inch distance from the edge, or whatever fits well with the dimensions you're applying (this width will vary depending on the size you've chosen for the purse). Cut out the paper templates. You will reuse the outer fabric template for the lining as well, so use with care. Cutting the fabric Place the outer cotton fabric template on the outer fabric. Pin in place. Cut out the purse fabric in its entirety. Repeat for the cotton lining fabric. Lay the outer fabric template onto the lining fabric cotton and pin in place. Then cut out the shape. Place the batting or felt rest pieces on the lining fabric. Cut out the two batting or felt rest pieces. Attach the two batting or felt rest pieces to the wrong side of the outer fabric piece. Position them as shown in this step's image; these pieces will help hold the shape of the purse and buffer it from being squashed when in use. Use fabric glue to attach these two batting pieces. The fabric is now ready for sewing; see the image for what you should have in front of you now. Making the dumpling purse Fold the outer fabric in half. Have the wrong side facing outward. Sew the two side edges together, from the bottom up to the top. Leave the two curved edges at the top unsewn. Turn the purse inside out.  Fold the purse. See the image for points A and B. Using these points, fold the bag so as to bring points A and B to match together. Clip or pin these two sides together, to hold the purse shape in place, in readiness for sewing. Sew the two edges of one of the clipped sides together. The other side will be left open for the addition of the zipper shortly. Then sew in the zipper on the remaining open side. Use the image to guide you. Add the lining piece. Sew the cotton lining piece as for the outer piece, so that it forms the dumpling shape, without a zipper attached. Push this inside the purse and either clip or pin it in place, as shown in the image. Turn the purse inside out. Sew it onto the purse, around the edges. Neaten and adjust as you sew. Turn the purse the right side out. The dumpling-shaped purse is now done.",
    "sentences": [
        " Preparing the templates Draw the basic shape for the purse onto pattern paper.",
        "Follow the black outline as shown in the image; the main outline on the outermost side of the purse shape is for the outer fabric for the purse, and its eventual inner lining (not the batting but the lining), while the two inner outlines are for the batting or felt rests of the purse (each of these pieces look a little like a basic crown shape).",
        "These drawings will form the template.",
        "Note that the size is dependent on the size you want the final purse to be, so adjust the template size according to your need.",
        "Incorporate a 1cm/2.5 inch seam allowance for the outer piece of fabric when finalizing the size.",
        "The inner pieces of batting or felt rests will sit as shown in the template image, so ensure that when drawing them to size, they are at an evenly spaced distance from the outer piece's edges on all sides, such as an even 2cm/5 inch distance from the edge, or whatever fits well with the dimensions you're applying (this width will vary depending on the size you've chosen for the purse).",
        "Cut out the paper templates.",
        "You will reuse the outer fabric template for the lining as well, so use with care.",
        "Cutting the fabric Place the outer cotton fabric template on the outer fabric.",
        "Pin in place.",
        "Cut out the purse fabric in its entirety.",
        "Repeat for the cotton lining fabric.",
        "Lay the outer fabric template onto the lining fabric cotton and pin in place.",
        "Then cut out the shape.",
        "Place the batting or felt rest pieces on the lining fabric.",
        "Cut out the two batting or felt rest pieces.",
        "Attach the two batting or felt rest pieces to the wrong side of the outer fabric piece.",
        "Position them as shown in this step's image; these pieces will help hold the shape of the purse and buffer it from being squashed when in use.",
        "Use fabric glue to attach these two batting pieces.",
        "The fabric is now ready for sewing; see the image for what you should have in front of you now.",
        "Making the dumpling purse Fold the outer fabric in half.",
        "Have the wrong side facing outward.",
        "Sew the two side edges together, from the bottom up to the top.",
        "Leave the two curved edges at the top unsewn.",
        "Turn the purse inside out.",
        "Fold the purse.",
        "See the image for points A and B.",
        "Using these points, fold the bag so as to bring points A and B to match together.",
        "Clip or pin these two sides together, to hold the purse shape in place, in readiness for sewing.",
        "Sew the two edges of one of the clipped sides together.",
        "The other side will be left open for the addition of the zipper shortly.",
        "Then sew in the zipper on the remaining open side.",
        "Use the image to guide you.",
        "Add the lining piece.",
        "Sew the cotton lining piece as for the outer piece, so that it forms the dumpling shape, without a zipper attached.",
        "Push this inside the purse and either clip or pin it in place, as shown in the image.",
        "Turn the purse inside out.",
        "Sew it onto the purse, around the edges.",
        "Neaten and adjust as you sew.",
        "Turn the purse the right side out.",
        "The dumpling-shaped purse is now done."
    ]
}