{
    "title": "How to Make an Email Account",
    "url": "https://www.wikihow.com/Make-an-Email-Account",
    "category_hierarchy": [
        "Computers and Electronics",
        "Internet",
        "Online Communications",
        "Email"
    ],
    "methods": [
        {
            "name": "Making an Email Account",
            "steps": [
                {
                    "headline": "Visit a website that offers an email service.",
                    "description": "Notable ones are yahoo.com, google.com, and hotmail.com, all of which are free forever."
                },
                {
                    "headline": "Find where to sign up.",
                    "description": "Usually, there is a small link image or text that says \"register\" or \"sign up,\" although you may have to go to the login page to find this. Type in \"free email account\" and the website of your choice into a search engine. Click on the appropriate link, hopefully bringing you to the setup page for the desired email account."
                },
                {
                    "headline": "Follow all the instructions on the page, filling out all the needed details.",
                    "description": "In some cases, you may feel uncomfortable letting out certain information. Don't worry, most of the time email accounts do not need information such as telephone and street address, and you can skip these completely."
                },
                {
                    "headline": "Read over the service agreement and click the box saying that you agree to abide by the email system's rules.",
                    "description": "Once completed, click on the Submit or Enter button at the bottom of the screen."
                },
                {
                    "headline": "Congratulations!",
                    "description": "You have now created an email address. Continue on to import your contacts, message with friends, or write emails, plus much more."
                }
            ]
        },
        {
            "name": "Gathering Contacts",
            "steps": [
                {
                    "headline": "Tell your friends and family about your new email, gather their information and add them to your contacts list.",
                    "description": "Note that many email accounts nowadays save your contacts automatically when you send email to or receive email from a person or institution. To bring up contacts, find the contacts tab or simply type in the first or last name of the person you want to email, or the beginning of their email address. Their email address and contact information should automatically pop up. This often means you don't have to \"save\" someone as a contact in order to send them an email."
                },
                {
                    "headline": "Import your contacts if you're changing email accounts.",
                    "description": "Navigate to your Contacts tab, and find the import button; then follow any directions that follow. Usually it's as easy as dragging and dropping a .CSV file into your browser window."
                }
            ]
        },
        {
            "name": "Sending an Email",
            "steps": [
                {
                    "headline": "Find the \"Compose\" button once logged in to your email account.",
                    "description": "It shouldn't be too hard to find; often it's a different-colored button."
                },
                {
                    "headline": "Type in the email address of the person you want to send an email to.",
                    "description": "If you don't remember the person's email address but have previously sent them an email, your account might recognize the saved email address if you begin to type in their name. If you want to copy a person on the email, hit \"CC,\" which stands for \"carbon copy.\" If you want to copy a person on the email without the original recipient knowing that you've copied the email, hit \"BCC,\" which stands for \"blind carbon copy.\""
                },
                {
                    "headline": "Include a subject.",
                    "description": "This is what the email is about or concerning."
                },
                {
                    "headline": "Type the message, or body, of your email.",
                    "description": "This is your communication or what you want to explain to the other person."
                },
                {
                    "headline": "After double-checking for errors, click \"Send.\"",
                    "description": "Make sure your contact's email address is correct, and that your message contains no spelling mistakes or formatting errors. Send your email."
                }
            ]
        }
    ],
    "tyn": [
        "A computer.",
        "Internet access.",
        "An email service provider (e.g. Hotmail, Yahoo, GMail, Aim, AOL, etc.)"
    ],
    "text": " Making an Email Account Visit a website that offers an email service. Notable ones are yahoo.com, google.com, and hotmail.com, all of which are free forever. Find where to sign up. Usually, there is a small link image or text that says \"register\" or \"sign up,\" although you may have to go to the login page to find this. Type in \"free email account\" and the website of your choice into a search engine. Click on the appropriate link, hopefully bringing you to the setup page for the desired email account. Follow all the instructions on the page, filling out all the needed details. In some cases, you may feel uncomfortable letting out certain information. Don't worry, most of the time email accounts do not need information such as telephone and street address, and you can skip these completely. Read over the service agreement and click the box saying that you agree to abide by the email system's rules. Once completed, click on the Submit or Enter button at the bottom of the screen. Congratulations! You have now created an email address. Continue on to import your contacts, message with friends, or write emails, plus much more. Gathering Contacts Tell your friends and family about your new email, gather their information and add them to your contacts list. Note that many email accounts nowadays save your contacts automatically when you send email to or receive email from a person or institution. To bring up contacts, find the contacts tab or simply type in the first or last name of the person you want to email, or the beginning of their email address. Their email address and contact information should automatically pop up. This often means you don't have to \"save\" someone as a contact in order to send them an email. Import your contacts if you're changing email accounts. Navigate to your Contacts tab, and find the import button; then follow any directions that follow. Usually it's as easy as dragging and dropping a .CSV file into your browser window. Sending an Email Find the \"Compose\" button once logged in to your email account. It shouldn't be too hard to find; often it's a different-colored button. Type in the email address of the person you want to send an email to. If you don't remember the person's email address but have previously sent them an email, your account might recognize the saved email address if you begin to type in their name. If you want to copy a person on the email, hit \"CC,\" which stands for \"carbon copy.\" If you want to copy a person on the email without the original recipient knowing that you've copied the email, hit \"BCC,\" which stands for \"blind carbon copy.\" Include a subject. This is what the email is about or concerning. Type the message, or body, of your email. This is your communication or what you want to explain to the other person. After double-checking for errors, click \"Send.\" Make sure your contact's email address is correct, and that your message contains no spelling mistakes or formatting errors. Send your email.",
    "sentences": [
        " Making an Email Account Visit a website that offers an email service.",
        "Notable ones are yahoo.com, google.com, and hotmail.com, all of which are free forever.",
        "Find where to sign up.",
        "Usually, there is a small link image or text that says \"register\" or \"sign up,\" although you may have to go to the login page to find this.",
        "Type in \"free email account\" and the website of your choice into a search engine.",
        "Click on the appropriate link, hopefully bringing you to the setup page for the desired email account.",
        "Follow all the instructions on the page, filling out all the needed details.",
        "In some cases, you may feel uncomfortable letting out certain information.",
        "Don't worry, most of the time email accounts do not need information such as telephone and street address, and you can skip these completely.",
        "Read over the service agreement and click the box saying that you agree to abide by the email system's rules.",
        "Once completed, click on the Submit or Enter button at the bottom of the screen.",
        "Congratulations!",
        "You have now created an email address.",
        "Continue on to import your contacts, message with friends, or write emails, plus much more.",
        "Gathering Contacts Tell your friends and family about your new email, gather their information and add them to your contacts list.",
        "Note that many email accounts nowadays save your contacts automatically when you send email to or receive email from a person or institution.",
        "To bring up contacts, find the contacts tab or simply type in the first or last name of the person you want to email, or the beginning of their email address.",
        "Their email address and contact information should automatically pop up.",
        "This often means you don't have to \"save\" someone as a contact in order to send them an email.",
        "Import your contacts if you're changing email accounts.",
        "Navigate to your Contacts tab, and find the import button; then follow any directions that follow.",
        "Usually it's as easy as dragging and dropping a .CSV file into your browser window.",
        "Sending an Email Find the \"Compose\" button once logged in to your email account.",
        "It shouldn't be too hard to find; often it's a different-colored button.",
        "Type in the email address of the person you want to send an email to.",
        "If you don't remember the person's email address but have previously sent them an email, your account might recognize the saved email address if you begin to type in their name.",
        "If you want to copy a person on the email, hit \"CC,\" which stands for \"carbon copy.\"",
        "If you want to copy a person on the email without the original recipient knowing that you've copied the email, hit \"BCC,\" which stands for \"blind carbon copy.\"",
        "Include a subject.",
        "This is what the email is about or concerning.",
        "Type the message, or body, of your email.",
        "This is your communication or what you want to explain to the other person.",
        "After double-checking for errors, click \"Send.\"",
        "Make sure your contact's email address is correct, and that your message contains no spelling mistakes or formatting errors.",
        "Send your email."
    ]
}