{
    "title": "How to Become Closer to Nature",
    "url": "https://www.wikihow.com/Become-Closer-to-Nature",
    "category_hierarchy": [
        "Health",
        "Psychological Health",
        "Relaxation"
    ],
    "steps": [
        {
            "headline": "Go outside and sit down in your own front yard or backyard.",
            "description": "If you live in the city, head over to a local park or natural area. Bring a notebook with you and write down what you see, smell, hear and feel."
        },
        {
            "headline": "Observe the temperature and weather and the patterns of any animals nearby.",
            "description": "Note the season and the direction of the wind. Observe the sky and the ground and observe everything around you. Write down your observations in as extensive detail as possible. Make sure to stay relaxed."
        },
        {
            "headline": "Try to stay disconnected from any electronics that you do not absolutely need to be using once you get home.",
            "description": "Make yourself a cup of herbal tea and read a book if you'd like."
        },
        {
            "headline": "Take up meditation.",
            "description": "Try to meditate outside as much as possible, as this will help you focus your energies to the elements. In order to meditate, you do not need to chant \"om\" or use any special tools. Simply sit down on the ground, close your eyes and try to become aware of your surroundings. Focus on your breathing and relax yourself completely. You do not need to push out any thoughts or label any emotions or senses. Simply let thoughts come and go and observe the inner workings of your subconscious mind. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/51\\/Become-Closer-to-Nature-Step-4Bullet1.jpg\\/v4-460px-Become-Closer-to-Nature-Step-4Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/51\\/Become-Closer-to-Nature-Step-4Bullet1.jpg\\/v4-760px-Become-Closer-to-Nature-Step-4Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
            "headline": "Plant a garden.",
            "description": "It can be a flower garden, an herb garden, a vegetable garden or just a few potted plants on your windowsill. Make sure to take care of your plants and expose them  to sunlight and water them everyday. Growing a garden will help your mind understand the life within nature and will bring you closer to the earth, as well as helping to improve air quality."
        },
        {
            "headline": "Be kind to Mother Nature!",
            "description": "Recycle, eat organic fruits and vegetables, don't litter and don't waste water. Turn off lights when you're not using them. Don't hurt animals or plants. Consider becoming a vegetarian or vegan."
        },
        {
            "headline": "Just go outside and smell the roses!",
            "description": "To truly connect to nature, you need to go outside and experience it for yourself!"
        }
    ],
    "tyn": [
        "A notebook and a pen or pencil",
        "A backyard, front yard, park or other natural area to go to",
        "Herbal tea",
        "Space to plant a garden or pots",
        "Fertilizer/soil",
        "Plants (herbs, flowers or vegetables/fruits)",
        "Water"
    ],
    "text": " Go outside and sit down in your own front yard or backyard. If you live in the city, head over to a local park or natural area. Bring a notebook with you and write down what you see, smell, hear and feel. Observe the temperature and weather and the patterns of any animals nearby. Note the season and the direction of the wind. Observe the sky and the ground and observe everything around you. Write down your observations in as extensive detail as possible. Make sure to stay relaxed. Try to stay disconnected from any electronics that you do not absolutely need to be using once you get home. Make yourself a cup of herbal tea and read a book if you'd like. Take up meditation. Try to meditate outside as much as possible, as this will help you focus your energies to the elements. In order to meditate, you do not need to chant \"om\" or use any special tools. Simply sit down on the ground, close your eyes and try to become aware of your surroundings. Focus on your breathing and relax yourself completely. You do not need to push out any thoughts or label any emotions or senses. Simply let thoughts come and go and observe the inner workings of your subconscious mind. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/51\\/Become-Closer-to-Nature-Step-4Bullet1.jpg\\/v4-460px-Become-Closer-to-Nature-Step-4Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/51\\/Become-Closer-to-Nature-Step-4Bullet1.jpg\\/v4-760px-Become-Closer-to-Nature-Step-4Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Plant a garden. It can be a flower garden, an herb garden, a vegetable garden or just a few potted plants on your windowsill. Make sure to take care of your plants and expose them  to sunlight and water them everyday. Growing a garden will help your mind understand the life within nature and will bring you closer to the earth, as well as helping to improve air quality. Be kind to Mother Nature! Recycle, eat organic fruits and vegetables, don't litter and don't waste water. Turn off lights when you're not using them. Don't hurt animals or plants. Consider becoming a vegetarian or vegan. Just go outside and smell the roses! To truly connect to nature, you need to go outside and experience it for yourself!",
    "sentences": [
        " Go outside and sit down in your own front yard or backyard.",
        "If you live in the city, head over to a local park or natural area.",
        "Bring a notebook with you and write down what you see, smell, hear and feel.",
        "Observe the temperature and weather and the patterns of any animals nearby.",
        "Note the season and the direction of the wind.",
        "Observe the sky and the ground and observe everything around you.",
        "Write down your observations in as extensive detail as possible.",
        "Make sure to stay relaxed.",
        "Try to stay disconnected from any electronics that you do not absolutely need to be using once you get home.",
        "Make yourself a cup of herbal tea and read a book if you'd like.",
        "Take up meditation.",
        "Try to meditate outside as much as possible, as this will help you focus your energies to the elements.",
        "In order to meditate, you do not need to chant \"om\" or use any special tools.",
        "Simply sit down on the ground, close your eyes and try to become aware of your surroundings.",
        "Focus on your breathing and relax yourself completely.",
        "You do not need to push out any thoughts or label any emotions or senses.",
        "Simply let thoughts come and go and observe the inner workings of your subconscious mind.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/51\\/Become-Closer-to-Nature-Step-4Bullet1.jpg\\/v4-460px-Become-Closer-to-Nature-Step-4Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/51\\/Become-Closer-to-Nature-Step-4Bullet1.jpg\\/v4-760px-Become-Closer-to-Nature-Step-4Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Plant a garden.",
        "It can be a flower garden, an herb garden, a vegetable garden or just a few potted plants on your windowsill.",
        "Make sure to take care of your plants and expose them  to sunlight and water them everyday.",
        "Growing a garden will help your mind understand the life within nature and will bring you closer to the earth, as well as helping to improve air quality.",
        "Be kind to Mother Nature!",
        "Recycle, eat organic fruits and vegetables, don't litter and don't waste water.",
        "Turn off lights when you're not using them.",
        "Don't hurt animals or plants.",
        "Consider becoming a vegetarian or vegan.",
        "Just go outside and smell the roses!",
        "To truly connect to nature, you need to go outside and experience it for yourself!"
    ]
}