{
    "title": "How to Whiten Nails",
    "url": "https://www.wikihow.com/Whiten-Nails",
    "category_hierarchy": [
        "Personal Care and Style",
        "Nail Care"
    ],
    "methods": [
        {
            "name": "Soaking Your Nails",
            "steps": [
                {
                    "headline": "Pour hydrogen peroxide, vinegar, lemon juice, or denture cleaner into a bowl.",
                    "description": "There are several household products that can safely whiten your nails. Choose the option that works best for you, then add it to a clean glass or plastic bowl. Do 1 of the following:\nStir 3 to 4 US tbsp (44 to 59 mL) of hydrogen peroxide into .5  c (120 mL) of water. Squeeze the juice from 2 lemons into a bowl. Pour about .5  c (120 mL) of denture cleaner into a bowl for soaking. Measure about .5  c (120 mL) of white vinegar into a bowl."
                },
                {
                    "headline": "Soak your nails for up to 10 minutes to bleach them.",
                    "description": "Set a timer for 10 minutes. Then, dip your nails into the bowl and submerge your fingertips. Relax as your nails soak in the whitening solution. If you’re using hydrogen peroxide, you may see results after just 2 minutes. If your fingers start to feel irritated, remove them immediately."
                },
                {
                    "headline": "Rinse your nails off in warm water to remove the solution.",
                    "description": "After soaking your nails, wash your hands using mild soap and warm water. This will remove the whitening solution . Check your nails to see if they look white. If you’re not happy with the results, you can try another whitening treatment. However, it’s best to wait at least a day before you do so because your skin might get irritated.Tip: Apply hand lotion after you soak your nails to add moisture back to your skin."
                },
                {
                    "headline": "Soak your nails 2-3 times per week until they’re white.",
                    "description": "Sometimes deep set stains are hard to remove, so you might need to do several whitening treatments. For best results, repeat your treatments 2-3 times a week to get your nails white without damaging your skin. If you have an event coming up, you might be able to use whitening treatments every day for up to 3 days. However, this can dry out the skin on your fingertips and may cause redness and irritation."
                }
            ]
        },
        {
            "name": "Scrubbing Your Nails",
            "steps": [
                {
                    "headline": "Apply a whitening toothpaste to your nails and let it sit for 10 minutes.",
                    "description": "Coat your nails with toothpaste, then set a timer for 10 minutes. Next, use a nail brush or an old toothbrush to scrub the toothpaste into your nails for 1-2 minutes. Then, rinse your hands in warm water until all of the toothpaste is removed. It’s best to use a whitening toothpaste that contains hydrogen peroxide and baking soda. Your nails may be white after 1 treatment. If they aren’t, you can repeat this treatment once or twice a week until your nails are totally white."
                },
                {
                    "headline": "Make a baking soda paste and let it sit on your nails for 30 minutes.",
                    "description": "Mix equal parts baking soda and warm water to create a paste. Then, dip a nail brush or toothbrush into the paste and scrub it onto your fingernails. Let the paste sit for 30 minutes to treat your nails. Then, rinse it off using warm water and mild soap. You can make your paste thicker by using less water. This could help it stay on your nails better."
                },
                {
                    "headline": "Scrub a baking soda-lemon juice paste onto your nails and wait 10 minutes.",
                    "description": "Mix 1 US tbsp (15 mL) of lemon juice with 2 to 3 Tbsp (30 to 45 ml) of baking soda to create a paste. Then, apply the paste to the top of your nails and underneath the tips using a cotton swab. Let the paste sit on your nails for 10-15 minutes, then wash your hands with soap and warm water.Variation: You can replace the lemon juice with hydrogen peroxide. Mix hydrogen peroxide and baking soda to form a paste, then let it sit on your nails for 10 minutes."
                }
            ]
        },
        {
            "name": "Changing Your Manicure Habits",
            "steps": [
                {
                    "headline": "Wipe your nails down with nail polish remover for polish stains.",
                    "description": "Soak a cotton swab in nail polish remover, then hold it against your nail for 1-3 seconds. Next, wipe the cotton swab across your nail to remove any polish stains. Apply more nail polish remover and get a new cotton swab as needed. A nail polish remover that contains acetone may work better. However, you don’t have to use acetone if you’re avoiding it."
                },
                {
                    "headline": "Color your tips white with a whitening nail pencil for a quick fix.",
                    "description": "A whitening pencil hides nail discoloration and offers a fast, temporary solution. To use the pencil, moisten the tip of the pencil, then color underneath your nail tips. Reapply the pencil as necessary to keep your nails looking white. You may need to reapply the pencil after each time you wash your hands. You can find a whitening nail pencil at your local drug store or online. They’re typically sold in the nail care section. They look similar to eyeliner pencils."
                },
                {
                    "headline": "Use a base coat when painting your nails to prevent yellowing.",
                    "description": "Nail polish is a common cause of nail discoloration, but wearing a base coat can protect your nails. Always apply a base coat before you paint your nails to prevent the color from soaking into them. This will help keep your nails white so you don’t have to worry about stains. You can use any clear base coat to protect your nails. These are typically sold in the nail care section next to the nail polish."
                },
                {
                    "headline": "Choose lighter colors of nail polish instead of darker shades.",
                    "description": "The pigments in dark nail polishes can soak into your nails and stain them. While this can happen with lighter colors, they’re less likely to discolor your nails. If you wear nail polish, use lighter colors more often than darker shades. For instance, a pale pink shade is less likely to stain than a dark fuchsia color."
                }
            ]
        }
    ],
    "tyn": [
        "Soaking Your Nails",
        "Glass or plastic bowl",
        "Water",
        "Hydrogen peroxide (optional)",
        "2 lemons (optional)",
        "Denture cleaner (optional)",
        "Vinegar (optional)",
        "Timer",
        "Scrubbing Your Nails",
        "Spoon",
        "Cotton balls or swabs",
        "Whitening toothpaste (optional)",
        "Baking soda (optional)",
        "Lemon juice (optional)",
        "Changing Your Manicure Habits",
        "Nail polish remover",
        "Nail brush or toothbrush",
        "Whitening nail pencil (optional)",
        "Base coat (optional)",
        "Light nail polish (optional)"
    ],
    "text": " Soaking Your Nails Pour hydrogen peroxide, vinegar, lemon juice, or denture cleaner into a bowl. There are several household products that can safely whiten your nails. Choose the option that works best for you, then add it to a clean glass or plastic bowl. Do 1 of the following:\nStir 3 to 4 US tbsp (44 to 59 mL) of hydrogen peroxide into .5  c (120 mL) of water. Squeeze the juice from 2 lemons into a bowl. Pour about .5  c (120 mL) of denture cleaner into a bowl for soaking. Measure about .5  c (120 mL) of white vinegar into a bowl. Soak your nails for up to 10 minutes to bleach them. Set a timer for 10 minutes. Then, dip your nails into the bowl and submerge your fingertips. Relax as your nails soak in the whitening solution. If you’re using hydrogen peroxide, you may see results after just 2 minutes. If your fingers start to feel irritated, remove them immediately. Rinse your nails off in warm water to remove the solution. After soaking your nails, wash your hands using mild soap and warm water. This will remove the whitening solution . Check your nails to see if they look white. If you’re not happy with the results, you can try another whitening treatment. However, it’s best to wait at least a day before you do so because your skin might get irritated.Tip: Apply hand lotion after you soak your nails to add moisture back to your skin. Soak your nails 2-3 times per week until they’re white. Sometimes deep set stains are hard to remove, so you might need to do several whitening treatments. For best results, repeat your treatments 2-3 times a week to get your nails white without damaging your skin. If you have an event coming up, you might be able to use whitening treatments every day for up to 3 days. However, this can dry out the skin on your fingertips and may cause redness and irritation. Scrubbing Your Nails Apply a whitening toothpaste to your nails and let it sit for 10 minutes. Coat your nails with toothpaste, then set a timer for 10 minutes. Next, use a nail brush or an old toothbrush to scrub the toothpaste into your nails for 1-2 minutes. Then, rinse your hands in warm water until all of the toothpaste is removed. It’s best to use a whitening toothpaste that contains hydrogen peroxide and baking soda. Your nails may be white after 1 treatment. If they aren’t, you can repeat this treatment once or twice a week until your nails are totally white. Make a baking soda paste and let it sit on your nails for 30 minutes. Mix equal parts baking soda and warm water to create a paste. Then, dip a nail brush or toothbrush into the paste and scrub it onto your fingernails. Let the paste sit for 30 minutes to treat your nails. Then, rinse it off using warm water and mild soap. You can make your paste thicker by using less water. This could help it stay on your nails better. Scrub a baking soda-lemon juice paste onto your nails and wait 10 minutes. Mix 1 US tbsp (15 mL) of lemon juice with 2 to 3 Tbsp (30 to 45 ml) of baking soda to create a paste. Then, apply the paste to the top of your nails and underneath the tips using a cotton swab. Let the paste sit on your nails for 10-15 minutes, then wash your hands with soap and warm water.Variation: You can replace the lemon juice with hydrogen peroxide. Mix hydrogen peroxide and baking soda to form a paste, then let it sit on your nails for 10 minutes. Changing Your Manicure Habits Wipe your nails down with nail polish remover for polish stains. Soak a cotton swab in nail polish remover, then hold it against your nail for 1-3 seconds. Next, wipe the cotton swab across your nail to remove any polish stains. Apply more nail polish remover and get a new cotton swab as needed. A nail polish remover that contains acetone may work better. However, you don’t have to use acetone if you’re avoiding it. Color your tips white with a whitening nail pencil for a quick fix. A whitening pencil hides nail discoloration and offers a fast, temporary solution. To use the pencil, moisten the tip of the pencil, then color underneath your nail tips. Reapply the pencil as necessary to keep your nails looking white. You may need to reapply the pencil after each time you wash your hands. You can find a whitening nail pencil at your local drug store or online. They’re typically sold in the nail care section. They look similar to eyeliner pencils. Use a base coat when painting your nails to prevent yellowing. Nail polish is a common cause of nail discoloration, but wearing a base coat can protect your nails. Always apply a base coat before you paint your nails to prevent the color from soaking into them. This will help keep your nails white so you don’t have to worry about stains. You can use any clear base coat to protect your nails. These are typically sold in the nail care section next to the nail polish. Choose lighter colors of nail polish instead of darker shades. The pigments in dark nail polishes can soak into your nails and stain them. While this can happen with lighter colors, they’re less likely to discolor your nails. If you wear nail polish, use lighter colors more often than darker shades. For instance, a pale pink shade is less likely to stain than a dark fuchsia color.",
    "sentences": [
        " Soaking Your Nails Pour hydrogen peroxide, vinegar, lemon juice, or denture cleaner into a bowl.",
        "There are several household products that can safely whiten your nails.",
        "Choose the option that works best for you, then add it to a clean glass or plastic bowl.",
        "Do 1 of the following:\nStir 3 to 4 US tbsp (44 to 59 mL) of hydrogen peroxide into .5  c (120 mL) of water.",
        "Squeeze the juice from 2 lemons into a bowl.",
        "Pour about .5  c (120 mL) of denture cleaner into a bowl for soaking.",
        "Measure about .5  c (120 mL) of white vinegar into a bowl.",
        "Soak your nails for up to 10 minutes to bleach them.",
        "Set a timer for 10 minutes.",
        "Then, dip your nails into the bowl and submerge your fingertips.",
        "Relax as your nails soak in the whitening solution.",
        "If you’re using hydrogen peroxide, you may see results after just 2 minutes.",
        "If your fingers start to feel irritated, remove them immediately.",
        "Rinse your nails off in warm water to remove the solution.",
        "After soaking your nails, wash your hands using mild soap and warm water.",
        "This will remove the whitening solution .",
        "Check your nails to see if they look white.",
        "If you’re not happy with the results, you can try another whitening treatment.",
        "However, it’s best to wait at least a day before you do so because your skin might get irritated.Tip: Apply hand lotion after you soak your nails to add moisture back to your skin.",
        "Soak your nails 2-3 times per week until they’re white.",
        "Sometimes deep set stains are hard to remove, so you might need to do several whitening treatments.",
        "For best results, repeat your treatments 2-3 times a week to get your nails white without damaging your skin.",
        "If you have an event coming up, you might be able to use whitening treatments every day for up to 3 days.",
        "However, this can dry out the skin on your fingertips and may cause redness and irritation.",
        "Scrubbing Your Nails Apply a whitening toothpaste to your nails and let it sit for 10 minutes.",
        "Coat your nails with toothpaste, then set a timer for 10 minutes.",
        "Next, use a nail brush or an old toothbrush to scrub the toothpaste into your nails for 1-2 minutes.",
        "Then, rinse your hands in warm water until all of the toothpaste is removed.",
        "It’s best to use a whitening toothpaste that contains hydrogen peroxide and baking soda.",
        "Your nails may be white after 1 treatment.",
        "If they aren’t, you can repeat this treatment once or twice a week until your nails are totally white.",
        "Make a baking soda paste and let it sit on your nails for 30 minutes.",
        "Mix equal parts baking soda and warm water to create a paste.",
        "Then, dip a nail brush or toothbrush into the paste and scrub it onto your fingernails.",
        "Let the paste sit for 30 minutes to treat your nails.",
        "Then, rinse it off using warm water and mild soap.",
        "You can make your paste thicker by using less water.",
        "This could help it stay on your nails better.",
        "Scrub a baking soda-lemon juice paste onto your nails and wait 10 minutes.",
        "Mix 1 US tbsp (15 mL) of lemon juice with 2 to 3 Tbsp (30 to 45 ml) of baking soda to create a paste.",
        "Then, apply the paste to the top of your nails and underneath the tips using a cotton swab.",
        "Let the paste sit on your nails for 10-15 minutes, then wash your hands with soap and warm water.Variation: You can replace the lemon juice with hydrogen peroxide.",
        "Mix hydrogen peroxide and baking soda to form a paste, then let it sit on your nails for 10 minutes.",
        "Changing Your Manicure Habits Wipe your nails down with nail polish remover for polish stains.",
        "Soak a cotton swab in nail polish remover, then hold it against your nail for 1-3 seconds.",
        "Next, wipe the cotton swab across your nail to remove any polish stains.",
        "Apply more nail polish remover and get a new cotton swab as needed.",
        "A nail polish remover that contains acetone may work better.",
        "However, you don’t have to use acetone if you’re avoiding it.",
        "Color your tips white with a whitening nail pencil for a quick fix.",
        "A whitening pencil hides nail discoloration and offers a fast, temporary solution.",
        "To use the pencil, moisten the tip of the pencil, then color underneath your nail tips.",
        "Reapply the pencil as necessary to keep your nails looking white.",
        "You may need to reapply the pencil after each time you wash your hands.",
        "You can find a whitening nail pencil at your local drug store or online.",
        "They’re typically sold in the nail care section.",
        "They look similar to eyeliner pencils.",
        "Use a base coat when painting your nails to prevent yellowing.",
        "Nail polish is a common cause of nail discoloration, but wearing a base coat can protect your nails.",
        "Always apply a base coat before you paint your nails to prevent the color from soaking into them.",
        "This will help keep your nails white so you don’t have to worry about stains.",
        "You can use any clear base coat to protect your nails.",
        "These are typically sold in the nail care section next to the nail polish.",
        "Choose lighter colors of nail polish instead of darker shades.",
        "The pigments in dark nail polishes can soak into your nails and stain them.",
        "While this can happen with lighter colors, they’re less likely to discolor your nails.",
        "If you wear nail polish, use lighter colors more often than darker shades.",
        "For instance, a pale pink shade is less likely to stain than a dark fuchsia color."
    ]
}