{
    "title": "How to Pray the Rosary with a Child",
    "url": "https://www.wikihow.com/Pray-the-Rosary-with-a-Child",
    "category_hierarchy": [
        "Philosophy and Religion",
        "Faith and Belief",
        "Prayer"
    ],
    "steps": [
        {
            "headline": "Sit down in a comfortable place with the child.",
            "description": "Eg: A living room sofa, etc."
        },
        {
            "headline": "Begin by praying the prayer to Our Lady of Fatima, which is the introductory prayer to the Rosary.",
            "description": ""
        },
        {
            "headline": "Demonstrate to the child on how to make the Sign of the Cross, and ask the child to do the same.",
            "description": ""
        },
        {
            "headline": "Begin to recite the Apostles' Creed.",
            "description": "Invite the child to join in at \"and in Jesus Christ, His only begotten Son, and our Lord...\""
        },
        {
            "headline": "Pray the Lord's prayer.",
            "description": "Invite the child to join at \"Give us this day, our daily bread...\""
        },
        {
            "headline": "Pray the 3 'Hail Marys.'",
            "description": "Invite the child to join in at \"Holy Mary, Mother of God...\""
        },
        {
            "headline": "Pray the Gloria.",
            "description": ""
        },
        {
            "headline": "Pray the Fatima prayer, followed by \"Queen of the Holy Rosary, pray for us...\"",
            "description": ""
        },
        {
            "headline": "Recite the first mystery, and mentioned desired virtue.",
            "description": ""
        },
        {
            "headline": "Pray the Lord's prayer, and again invite the child to join at \"Give us this day, our daily bread...\"",
            "description": ""
        },
        {
            "headline": "Pray the 10 Hail Marys, and invite the child to join in at \"Holy Mary, Mother of God...\", each time.",
            "description": ""
        },
        {
            "headline": "Repeat with the second mystery onward.",
            "description": ""
        }
    ],
    "tyn": [
        "Rosary beads",
        "A rosary booklet"
    ],
    "text": " Sit down in a comfortable place with the child. Eg: A living room sofa, etc. Begin by praying the prayer to Our Lady of Fatima, which is the introductory prayer to the Rosary.  Demonstrate to the child on how to make the Sign of the Cross, and ask the child to do the same.  Begin to recite the Apostles' Creed. Invite the child to join in at \"and in Jesus Christ, His only begotten Son, and our Lord...\" Pray the Lord's prayer. Invite the child to join at \"Give us this day, our daily bread...\" Pray the 3 'Hail Marys.' Invite the child to join in at \"Holy Mary, Mother of God...\" Pray the Gloria.  Pray the Fatima prayer, followed by \"Queen of the Holy Rosary, pray for us...\"  Recite the first mystery, and mentioned desired virtue.  Pray the Lord's prayer, and again invite the child to join at \"Give us this day, our daily bread...\"  Pray the 10 Hail Marys, and invite the child to join in at \"Holy Mary, Mother of God...\", each time.  Repeat with the second mystery onward. ",
    "sentences": [
        " Sit down in a comfortable place with the child.",
        "Eg: A living room sofa, etc.",
        "Begin by praying the prayer to Our Lady of Fatima, which is the introductory prayer to the Rosary.",
        "Demonstrate to the child on how to make the Sign of the Cross, and ask the child to do the same.",
        "Begin to recite the Apostles' Creed.",
        "Invite the child to join in at \"and in Jesus Christ, His only begotten Son, and our Lord...\" Pray the Lord's prayer.",
        "Invite the child to join at \"Give us this day, our daily bread...\" Pray the 3 'Hail Marys.'",
        "Invite the child to join in at \"Holy Mary, Mother of God...\" Pray the Gloria.",
        "Pray the Fatima prayer, followed by \"Queen of the Holy Rosary, pray for us...\"  Recite the first mystery, and mentioned desired virtue.",
        "Pray the Lord's prayer, and again invite the child to join at \"Give us this day, our daily bread...\"  Pray the 10 Hail Marys, and invite the child to join in at \"Holy Mary, Mother of God...\", each time.",
        "Repeat with the second mystery onward."
    ]
}