{
    "title": "How to Apply False Eyelashes",
    "url": "https://www.wikihow.com/Apply-False-Eyelashes",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Body Hair",
        "Facial Hair",
        "Eyelashes",
        "False Eyelashes"
    ],
    "steps": [
        {
            "headline": "Size the lashes.",
            "description": "Before gluing the lashes on, you will need to make sure they are not too wide for your eye. Hold the lash strips up against your eyelid, and trim them down on the sides if necessary. If the lashes are too long for your personal taste, consider trimming the individual lashes down to achieve a more natural look. Lashes should be longer toward the outer corner of the eye."
        },
        {
            "headline": "Apply the lash glue to the outer seam of the eyelash strip with an applicator or small brush.",
            "description": "Allow the glue to dry for a moment before applying it to your lashes. Alternatively, you can squeeze a thin line of lash glue onto the back of your non-dominant hand. Then, gently run the outer seam of the eyelash strip along it."
        },
        {
            "headline": "Place the strip on your eyelid, positioning it as close as possible to your natural lashes.",
            "description": "Bring the strip down from above, not from the front. This is to ensure that you get as close as possible to your lashline."
        },
        {
            "headline": "Allow the glue to dry naturally.",
            "description": "Once the strip is in place, you do not need to press or hold it."
        },
        {
            "headline": "Apply mascara to your lashes.",
            "description": "This will help blend your natural lashes with the false ones, achieving a more natural look. You can use black, brown, or dark gray mascara."
        },
        {
            "headline": "Apply liquid eyeliner along your upper lids.",
            "description": "Be sure to fill in any gaps between the false lashes and your own to make them look more natural. Use black, brown, or dark gray liner."
        },
        {
            "headline": "Use makeup remover to remove false lashes.",
            "description": "Dip a q tip in eye makeup remover and gently rub it along your lash line. Allow the remover to sit for a minute, and gently pull off the strip."
        },
        {
            "headline": "Finished.",
            "description": ""
        }
    ],
    "tyn": [
        "False eyelashes",
        "False eyelash glue",
        "Mirror",
        "Mascara",
        "Eyelash Separator",
        "Make Up Remover Wipes"
    ],
    "text": " Size the lashes. Before gluing the lashes on, you will need to make sure they are not too wide for your eye. Hold the lash strips up against your eyelid, and trim them down on the sides if necessary. If the lashes are too long for your personal taste, consider trimming the individual lashes down to achieve a more natural look. Lashes should be longer toward the outer corner of the eye. Apply the lash glue to the outer seam of the eyelash strip with an applicator or small brush. Allow the glue to dry for a moment before applying it to your lashes. Alternatively, you can squeeze a thin line of lash glue onto the back of your non-dominant hand. Then, gently run the outer seam of the eyelash strip along it. Place the strip on your eyelid, positioning it as close as possible to your natural lashes. Bring the strip down from above, not from the front. This is to ensure that you get as close as possible to your lashline. Allow the glue to dry naturally. Once the strip is in place, you do not need to press or hold it. Apply mascara to your lashes. This will help blend your natural lashes with the false ones, achieving a more natural look. You can use black, brown, or dark gray mascara. Apply liquid eyeliner along your upper lids. Be sure to fill in any gaps between the false lashes and your own to make them look more natural. Use black, brown, or dark gray liner. Use makeup remover to remove false lashes. Dip a q tip in eye makeup remover and gently rub it along your lash line. Allow the remover to sit for a minute, and gently pull off the strip. Finished. ",
    "sentences": [
        " Size the lashes.",
        "Before gluing the lashes on, you will need to make sure they are not too wide for your eye.",
        "Hold the lash strips up against your eyelid, and trim them down on the sides if necessary.",
        "If the lashes are too long for your personal taste, consider trimming the individual lashes down to achieve a more natural look.",
        "Lashes should be longer toward the outer corner of the eye.",
        "Apply the lash glue to the outer seam of the eyelash strip with an applicator or small brush.",
        "Allow the glue to dry for a moment before applying it to your lashes.",
        "Alternatively, you can squeeze a thin line of lash glue onto the back of your non-dominant hand.",
        "Then, gently run the outer seam of the eyelash strip along it.",
        "Place the strip on your eyelid, positioning it as close as possible to your natural lashes.",
        "Bring the strip down from above, not from the front.",
        "This is to ensure that you get as close as possible to your lashline.",
        "Allow the glue to dry naturally.",
        "Once the strip is in place, you do not need to press or hold it.",
        "Apply mascara to your lashes.",
        "This will help blend your natural lashes with the false ones, achieving a more natural look.",
        "You can use black, brown, or dark gray mascara.",
        "Apply liquid eyeliner along your upper lids.",
        "Be sure to fill in any gaps between the false lashes and your own to make them look more natural.",
        "Use black, brown, or dark gray liner.",
        "Use makeup remover to remove false lashes.",
        "Dip a q tip in eye makeup remover and gently rub it along your lash line.",
        "Allow the remover to sit for a minute, and gently pull off the strip.",
        "Finished."
    ]
}