{
    "title": "How to Make Vegetarian Lasagna",
    "url": "https://www.wikihow.com/Make-Vegetarian-Lasagna",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Vegetarian",
        "Vegetarian Pasta"
    ],
    "parts": [
        {
            "name": "Cooking the Noodles and Veggies",
            "steps": [
                {
                    "headline": "Boil 16 oz (450 g) of lasagna noodles for 10 minutes.",
                    "description": "Bring a large pot of water to a boil and add the lasagna noodles. Set a timer for 10 minutes. When the time is up, put on oven mitts and pour the lasagna noodles into a colander in your sink to drain them. Be very careful when you drain the pasta! The pot, water, and steam will be very hot!"
                },
                {
                    "headline": "Chop 2 lb (0.91 kg) of veggies into 1 in (2.5 cm) pieces.",
                    "description": "Wash your veggies and place them onto a cutting board. Peel any veggies that require peeling, such as carrots. Then, chop the veggies. Chop the onion into a fine dice and cut the rest of the veggies into 1 in (2.5 cm) chunks. Use precut fresh or frozen veggies as a time saver! How to Choose Veggies for Your Lasagna\nSelect veggies that go well together, such as eggplant, peppers, and zucchini, or spinach, artichokes, and mushrooms. Opt for seasonal veggies, such as butternut squash in the fall, zucchini in the summer, or asparagus in the spring. Include sweet veggies, such as corn, yams, and red peppers, for a milder tasting lasagna. Add spicy veggies, such as a jalapeno or banana pepper, for a spicy lasagna."
                },
                {
                    "headline": "Add 1 tablespoon (15 mL) of olive oil and 1 chopped onion to a heated skillet.",
                    "description": "Turn your heat to medium-high and place a skillet onto the burner. Pour the olive oil into the skillet and tilt it slightly to distribute the oil over the surface of the pan. Then, add the onion and stir it with a metal or wooden spoon or spatula. Cook the onion in the oil uncovered for 5 minutes until it starts to look translucent. Watch the onion carefully to ensure that it does not burn! Stir it every few minutes. For a gourmet touch, use 2 shallots in place of the onion."
                },
                {
                    "headline": "Sauté the veggies for 10 more minutes and add the herbs and salt.",
                    "description": "Add the rest of your veggies to the skillet and stir them around. Cook the veggies on medium-high heat until they are tender and fully cooked. This will take about 10 minutes for most types of veggies, but it may take a little longer for others. Once the veggies are cooked and you can easily poke them with a fork, add 1 teaspoon (1.8 grams) of Italian seasoning and 1 teaspoon (6 grams) of salt. Stir the veggies and herbs every few minutes to ensure that they are cooking evenly. Watch the veggies closely to ensure that they do not burn!"
                },
                {
                    "headline": "Pour in 2 26  fl oz (770 mL) jars of pasta sauce or crushed tomatoes.",
                    "description": "Add both jars of pasta sauce or canned tomatoes to the veggie mixture and bring the sauce to a simmer (bubbling slightly). Simmer the sauce on low-medium heat uncovered for 15 minutes stirring occasionally. If you are using crushed tomatoes, add 1 extra teaspoon (1.8 grams) of Italian seasoning. Make sure to watch the sauce carefully while it simmers! If it starts boiling rapidly, then turn the heat down."
                }
            ]
        },
        {
            "name": "Assembling the Lasagna",
            "steps": [
                {
                    "headline": "Preheat the oven to 350 °F (177 °C) while you assemble the lasagna.",
                    "description": "Your oven needs to be fully heated. Set the oven to 350 °F (177 °C) and then start assembling your lasagna. If you have a digital temperature gauge on your oven, it should show the current temperature."
                },
                {
                    "headline": "Mix the ricotta with 2 eggs, and 16 oz (450 g) of mozzarella.",
                    "description": "In a large bowl, use a fork to combine the ricotta cheese with 2 eggs first. Then, add in the mozzarella and stir to combine everything together. Make sure that the egg yolks are broken and the egg is evenly distributed in the ricotta before you mix in the cheese."
                },
                {
                    "headline": "Coat a 9 by 13 in (23 by 33 cm) pan with non-stick cooking spray.",
                    "description": "This size pan is ideal for making lasagna. Spray the pan evenly with the non-stick cooking spray to coat it and then add 4 oz (110 g) of the veggies and sauce to the bottom of the pan. If desired, place a layer of parchment paper on the bottom of the pan and spray this with non-stick cooking spray. Parchment is a non-stick material and it will help to make cleanup easier."
                },
                {
                    "headline": "Line the bottom of the pan with 3 or more noodles.",
                    "description": "Cover the sauce with as many noodles as you can fit in the pan. Make sure the noodles are overlapping slightly and covering the bottom of the pan completely. 3 noodles may be all you need to fill the bottom of a 9 by 13 in (23 by 33 cm) pan. If you can fit more noodles, then add more."
                },
                {
                    "headline": "Spread ½ of the ricotta mixture over the noodles.",
                    "description": "Cover the noodles with a 0.25 in (0.64 cm) thick layer of the ricotta mixture. Use the back of a spoon or spatula to spread out the ricotta."
                },
                {
                    "headline": "Scoop 1/3 of the veggie and sauce mixture onto the ricotta.",
                    "description": "Spread the sauce and veggies around in an even layer. Use the back of a spoon or spatula to spread the veggies and sauce."
                },
                {
                    "headline": "Repeat the layers 1 more time.",
                    "description": "After you have finished layering the noodles, ricotta, and sauce and veggies 1 time, do this once more. Place 3 or more noodles on top of the last layer to cover it completely. Then, add the rest of the ricotta mixture on top of the noodles and 1/3 of the veggie mixture on top of the ricotta."
                },
                {
                    "headline": "Finish with a layer of noodles, sauce, and cheese.",
                    "description": "Top your lasagna with 1 more layer of noodles and cover them with the remaining sauce and veggies. Then, sprinkle the rest of the mozzarella cheese on top of the sauce. Try a Different Flavor Combination! Swap alfredo sauce for pasta sauce to make a white lasagna. Fill your lasagna layers with spinach, artichokes, mushrooms, or whatever veggies you like best! Make a pesto lasagna using fresh or jarred pesto in place of tomato sauce. Choose any veggies you like to complement the pesto! Create a Tex-Mex vegetable lasagna with salsa (in place of pasta sauce) cooked with peppers, onions, corn, and black beans. Top it with a shredded Mexican cheese blend instead of mozzarella."
                }
            ]
        },
        {
            "name": "Baking the Lasagna",
            "steps": [
                {
                    "headline": "Place the lasagna into the 350 °F (177 °C) oven.",
                    "description": "When the oven is ready, place the lasagna into the oven uncovered. Place it on the center rack of your oven. How to Save Time Preparing Lasagna\nChoose pre-cut fresh or frozen veggies, such as frozen green beans, corn, or a roasted veggie mix. Toss these into your pan and cook them until they are heated through. Opt for no-boil lasagna noodles. This allows you to skip the pasta cooking step and layer the dry noodles with your ricotta, veggies, and sauce. Then, bake the lasagna as usual and the noodles will cook right in the sauce! Assemble the lasagna in advance and keep it in your refrigerator until you are ready to bake it. This is a great, easy meal to have on hand! Put all of the components together, cover the pan with a few layers of tin foil and store it in the refrigerator for 1 to 2 days before you bake it."
                },
                {
                    "headline": "Bake the lasagna uncovered for 40 minutes.",
                    "description": "Set a timer so that you will know when to check the lasagna. After 40 minutes, look to see if the sauce is bubbling and the top layer of cheese is golden brown. If so, then the lasagna is done. Remove it from the oven. Make sure to wear oven mitts and place the pan onto a potholder or trivet. It will be very hot, so be careful!"
                },
                {
                    "headline": "Let the lasagna cool for 10 to 15 minutes before serving.",
                    "description": "The lasagna will be too hot to eat right away, so wait for about 10 to 15 minutes before you serve it. Then, cut a piece of the lasagna and put it on a plate or in a bowl. If desired, pair your lasagna with a side salad or a piece of crusty bread."
                }
            ]
        }
    ],
    "tyn": [
        "Large pot",
        "Colander",
        "Cutting board",
        "Knife",
        "Skillet",
        "Spatula",
        "Large casserole dish or lasagna pan",
        "Foil",
        "Oven mitts and potholders"
    ],
    "text": " Cooking the Noodles and Veggies Boil 16 oz (450 g) of lasagna noodles for 10 minutes. Bring a large pot of water to a boil and add the lasagna noodles. Set a timer for 10 minutes. When the time is up, put on oven mitts and pour the lasagna noodles into a colander in your sink to drain them. Be very careful when you drain the pasta! The pot, water, and steam will be very hot! Chop 2 lb (0.91 kg) of veggies into 1 in (2.5 cm) pieces. Wash your veggies and place them onto a cutting board. Peel any veggies that require peeling, such as carrots. Then, chop the veggies. Chop the onion into a fine dice and cut the rest of the veggies into 1 in (2.5 cm) chunks. Use precut fresh or frozen veggies as a time saver! How to Choose Veggies for Your Lasagna\nSelect veggies that go well together, such as eggplant, peppers, and zucchini, or spinach, artichokes, and mushrooms. Opt for seasonal veggies, such as butternut squash in the fall, zucchini in the summer, or asparagus in the spring. Include sweet veggies, such as corn, yams, and red peppers, for a milder tasting lasagna. Add spicy veggies, such as a jalapeno or banana pepper, for a spicy lasagna. Add 1 tablespoon (15 mL) of olive oil and 1 chopped onion to a heated skillet. Turn your heat to medium-high and place a skillet onto the burner. Pour the olive oil into the skillet and tilt it slightly to distribute the oil over the surface of the pan. Then, add the onion and stir it with a metal or wooden spoon or spatula. Cook the onion in the oil uncovered for 5 minutes until it starts to look translucent. Watch the onion carefully to ensure that it does not burn! Stir it every few minutes. For a gourmet touch, use 2 shallots in place of the onion. Sauté the veggies for 10 more minutes and add the herbs and salt. Add the rest of your veggies to the skillet and stir them around. Cook the veggies on medium-high heat until they are tender and fully cooked. This will take about 10 minutes for most types of veggies, but it may take a little longer for others. Once the veggies are cooked and you can easily poke them with a fork, add 1 teaspoon (1.8 grams) of Italian seasoning and 1 teaspoon (6 grams) of salt. Stir the veggies and herbs every few minutes to ensure that they are cooking evenly. Watch the veggies closely to ensure that they do not burn! Pour in 2 26  fl oz (770 mL) jars of pasta sauce or crushed tomatoes. Add both jars of pasta sauce or canned tomatoes to the veggie mixture and bring the sauce to a simmer (bubbling slightly). Simmer the sauce on low-medium heat uncovered for 15 minutes stirring occasionally. If you are using crushed tomatoes, add 1 extra teaspoon (1.8 grams) of Italian seasoning. Make sure to watch the sauce carefully while it simmers! If it starts boiling rapidly, then turn the heat down. Assembling the Lasagna Preheat the oven to 350 °F (177 °C) while you assemble the lasagna. Your oven needs to be fully heated. Set the oven to 350 °F (177 °C) and then start assembling your lasagna. If you have a digital temperature gauge on your oven, it should show the current temperature. Mix the ricotta with 2 eggs, and 16 oz (450 g) of mozzarella. In a large bowl, use a fork to combine the ricotta cheese with 2 eggs first. Then, add in the mozzarella and stir to combine everything together. Make sure that the egg yolks are broken and the egg is evenly distributed in the ricotta before you mix in the cheese. Coat a 9 by 13 in (23 by 33 cm) pan with non-stick cooking spray. This size pan is ideal for making lasagna. Spray the pan evenly with the non-stick cooking spray to coat it and then add 4 oz (110 g) of the veggies and sauce to the bottom of the pan. If desired, place a layer of parchment paper on the bottom of the pan and spray this with non-stick cooking spray. Parchment is a non-stick material and it will help to make cleanup easier. Line the bottom of the pan with 3 or more noodles. Cover the sauce with as many noodles as you can fit in the pan. Make sure the noodles are overlapping slightly and covering the bottom of the pan completely. 3 noodles may be all you need to fill the bottom of a 9 by 13 in (23 by 33 cm) pan. If you can fit more noodles, then add more. Spread ½ of the ricotta mixture over the noodles. Cover the noodles with a 0.25 in (0.64 cm) thick layer of the ricotta mixture. Use the back of a spoon or spatula to spread out the ricotta. Scoop 1/3 of the veggie and sauce mixture onto the ricotta. Spread the sauce and veggies around in an even layer. Use the back of a spoon or spatula to spread the veggies and sauce. Repeat the layers 1 more time. After you have finished layering the noodles, ricotta, and sauce and veggies 1 time, do this once more. Place 3 or more noodles on top of the last layer to cover it completely. Then, add the rest of the ricotta mixture on top of the noodles and 1/3 of the veggie mixture on top of the ricotta. Finish with a layer of noodles, sauce, and cheese. Top your lasagna with 1 more layer of noodles and cover them with the remaining sauce and veggies. Then, sprinkle the rest of the mozzarella cheese on top of the sauce. Try a Different Flavor Combination! Swap alfredo sauce for pasta sauce to make a white lasagna. Fill your lasagna layers with spinach, artichokes, mushrooms, or whatever veggies you like best! Make a pesto lasagna using fresh or jarred pesto in place of tomato sauce. Choose any veggies you like to complement the pesto! Create a Tex-Mex vegetable lasagna with salsa (in place of pasta sauce) cooked with peppers, onions, corn, and black beans. Top it with a shredded Mexican cheese blend instead of mozzarella. Baking the Lasagna Place the lasagna into the 350 °F (177 °C) oven. When the oven is ready, place the lasagna into the oven uncovered. Place it on the center rack of your oven. How to Save Time Preparing Lasagna\nChoose pre-cut fresh or frozen veggies, such as frozen green beans, corn, or a roasted veggie mix. Toss these into your pan and cook them until they are heated through. Opt for no-boil lasagna noodles. This allows you to skip the pasta cooking step and layer the dry noodles with your ricotta, veggies, and sauce. Then, bake the lasagna as usual and the noodles will cook right in the sauce! Assemble the lasagna in advance and keep it in your refrigerator until you are ready to bake it. This is a great, easy meal to have on hand! Put all of the components together, cover the pan with a few layers of tin foil and store it in the refrigerator for 1 to 2 days before you bake it. Bake the lasagna uncovered for 40 minutes. Set a timer so that you will know when to check the lasagna. After 40 minutes, look to see if the sauce is bubbling and the top layer of cheese is golden brown. If so, then the lasagna is done. Remove it from the oven. Make sure to wear oven mitts and place the pan onto a potholder or trivet. It will be very hot, so be careful! Let the lasagna cool for 10 to 15 minutes before serving. The lasagna will be too hot to eat right away, so wait for about 10 to 15 minutes before you serve it. Then, cut a piece of the lasagna and put it on a plate or in a bowl. If desired, pair your lasagna with a side salad or a piece of crusty bread.",
    "sentences": [
        " Cooking the Noodles and Veggies Boil 16 oz (450 g) of lasagna noodles for 10 minutes.",
        "Bring a large pot of water to a boil and add the lasagna noodles.",
        "Set a timer for 10 minutes.",
        "When the time is up, put on oven mitts and pour the lasagna noodles into a colander in your sink to drain them.",
        "Be very careful when you drain the pasta!",
        "The pot, water, and steam will be very hot!",
        "Chop 2 lb (0.91 kg) of veggies into 1 in (2.5 cm) pieces.",
        "Wash your veggies and place them onto a cutting board.",
        "Peel any veggies that require peeling, such as carrots.",
        "Then, chop the veggies.",
        "Chop the onion into a fine dice and cut the rest of the veggies into 1 in (2.5 cm) chunks.",
        "Use precut fresh or frozen veggies as a time saver!",
        "How to Choose Veggies for Your Lasagna\nSelect veggies that go well together, such as eggplant, peppers, and zucchini, or spinach, artichokes, and mushrooms.",
        "Opt for seasonal veggies, such as butternut squash in the fall, zucchini in the summer, or asparagus in the spring.",
        "Include sweet veggies, such as corn, yams, and red peppers, for a milder tasting lasagna.",
        "Add spicy veggies, such as a jalapeno or banana pepper, for a spicy lasagna.",
        "Add 1 tablespoon (15 mL) of olive oil and 1 chopped onion to a heated skillet.",
        "Turn your heat to medium-high and place a skillet onto the burner.",
        "Pour the olive oil into the skillet and tilt it slightly to distribute the oil over the surface of the pan.",
        "Then, add the onion and stir it with a metal or wooden spoon or spatula.",
        "Cook the onion in the oil uncovered for 5 minutes until it starts to look translucent.",
        "Watch the onion carefully to ensure that it does not burn!",
        "Stir it every few minutes.",
        "For a gourmet touch, use 2 shallots in place of the onion.",
        "Sauté the veggies for 10 more minutes and add the herbs and salt.",
        "Add the rest of your veggies to the skillet and stir them around.",
        "Cook the veggies on medium-high heat until they are tender and fully cooked.",
        "This will take about 10 minutes for most types of veggies, but it may take a little longer for others.",
        "Once the veggies are cooked and you can easily poke them with a fork, add 1 teaspoon (1.8 grams) of Italian seasoning and 1 teaspoon (6 grams) of salt.",
        "Stir the veggies and herbs every few minutes to ensure that they are cooking evenly.",
        "Watch the veggies closely to ensure that they do not burn!",
        "Pour in 2 26  fl oz (770 mL) jars of pasta sauce or crushed tomatoes.",
        "Add both jars of pasta sauce or canned tomatoes to the veggie mixture and bring the sauce to a simmer (bubbling slightly).",
        "Simmer the sauce on low-medium heat uncovered for 15 minutes stirring occasionally.",
        "If you are using crushed tomatoes, add 1 extra teaspoon (1.8 grams) of Italian seasoning.",
        "Make sure to watch the sauce carefully while it simmers!",
        "If it starts boiling rapidly, then turn the heat down.",
        "Assembling the Lasagna Preheat the oven to 350 °F (177 °C) while you assemble the lasagna.",
        "Your oven needs to be fully heated.",
        "Set the oven to 350 °F (177 °C) and then start assembling your lasagna.",
        "If you have a digital temperature gauge on your oven, it should show the current temperature.",
        "Mix the ricotta with 2 eggs, and 16 oz (450 g) of mozzarella.",
        "In a large bowl, use a fork to combine the ricotta cheese with 2 eggs first.",
        "Then, add in the mozzarella and stir to combine everything together.",
        "Make sure that the egg yolks are broken and the egg is evenly distributed in the ricotta before you mix in the cheese.",
        "Coat a 9 by 13 in (23 by 33 cm) pan with non-stick cooking spray.",
        "This size pan is ideal for making lasagna.",
        "Spray the pan evenly with the non-stick cooking spray to coat it and then add 4 oz (110 g) of the veggies and sauce to the bottom of the pan.",
        "If desired, place a layer of parchment paper on the bottom of the pan and spray this with non-stick cooking spray.",
        "Parchment is a non-stick material and it will help to make cleanup easier.",
        "Line the bottom of the pan with 3 or more noodles.",
        "Cover the sauce with as many noodles as you can fit in the pan.",
        "Make sure the noodles are overlapping slightly and covering the bottom of the pan completely.",
        "3 noodles may be all you need to fill the bottom of a 9 by 13 in (23 by 33 cm) pan.",
        "If you can fit more noodles, then add more.",
        "Spread ½ of the ricotta mixture over the noodles.",
        "Cover the noodles with a 0.25 in (0.64 cm) thick layer of the ricotta mixture.",
        "Use the back of a spoon or spatula to spread out the ricotta.",
        "Scoop 1/3 of the veggie and sauce mixture onto the ricotta.",
        "Spread the sauce and veggies around in an even layer.",
        "Use the back of a spoon or spatula to spread the veggies and sauce.",
        "Repeat the layers 1 more time.",
        "After you have finished layering the noodles, ricotta, and sauce and veggies 1 time, do this once more.",
        "Place 3 or more noodles on top of the last layer to cover it completely.",
        "Then, add the rest of the ricotta mixture on top of the noodles and 1/3 of the veggie mixture on top of the ricotta.",
        "Finish with a layer of noodles, sauce, and cheese.",
        "Top your lasagna with 1 more layer of noodles and cover them with the remaining sauce and veggies.",
        "Then, sprinkle the rest of the mozzarella cheese on top of the sauce.",
        "Try a Different Flavor Combination!",
        "Swap alfredo sauce for pasta sauce to make a white lasagna.",
        "Fill your lasagna layers with spinach, artichokes, mushrooms, or whatever veggies you like best!",
        "Make a pesto lasagna using fresh or jarred pesto in place of tomato sauce.",
        "Choose any veggies you like to complement the pesto!",
        "Create a Tex-Mex vegetable lasagna with salsa (in place of pasta sauce) cooked with peppers, onions, corn, and black beans.",
        "Top it with a shredded Mexican cheese blend instead of mozzarella.",
        "Baking the Lasagna Place the lasagna into the 350 °F (177 °C) oven.",
        "When the oven is ready, place the lasagna into the oven uncovered.",
        "Place it on the center rack of your oven.",
        "How to Save Time Preparing Lasagna\nChoose pre-cut fresh or frozen veggies, such as frozen green beans, corn, or a roasted veggie mix.",
        "Toss these into your pan and cook them until they are heated through.",
        "Opt for no-boil lasagna noodles.",
        "This allows you to skip the pasta cooking step and layer the dry noodles with your ricotta, veggies, and sauce.",
        "Then, bake the lasagna as usual and the noodles will cook right in the sauce!",
        "Assemble the lasagna in advance and keep it in your refrigerator until you are ready to bake it.",
        "This is a great, easy meal to have on hand!",
        "Put all of the components together, cover the pan with a few layers of tin foil and store it in the refrigerator for 1 to 2 days before you bake it.",
        "Bake the lasagna uncovered for 40 minutes.",
        "Set a timer so that you will know when to check the lasagna.",
        "After 40 minutes, look to see if the sauce is bubbling and the top layer of cheese is golden brown.",
        "If so, then the lasagna is done.",
        "Remove it from the oven.",
        "Make sure to wear oven mitts and place the pan onto a potholder or trivet.",
        "It will be very hot, so be careful!",
        "Let the lasagna cool for 10 to 15 minutes before serving.",
        "The lasagna will be too hot to eat right away, so wait for about 10 to 15 minutes before you serve it.",
        "Then, cut a piece of the lasagna and put it on a plate or in a bowl.",
        "If desired, pair your lasagna with a side salad or a piece of crusty bread."
    ]
}