{
    "title": "How to Change Gear Box Oil on a Vintage Vespa Scooter",
    "url": "https://www.wikihow.com/Change-Gear-Box-Oil-on-a-Vintage-Vespa-Scooter",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Scooters"
    ],
    "steps": [
        {
            "headline": "Do this after the engine has been run and is still warm, but avoid doing it directly after the scooter has been run and when it is still very warm or even hot.",
            "description": "Wait a good half hour or so."
        },
        {
            "headline": "Find the bolt.",
            "description": "There is a bolt on the bottom right hand side of the engine case (you'll have to get on your knees or even lay on the floor parallel to the scooter.)"
        },
        {
            "headline": "Once located, place some sort of drain pan under the bolt.",
            "description": "The bolt may say \"olio\" on it. Don't worry because this means \"oil\" in Italian so, you are in the right place. Undo the bolt, being cautious as the oil may still be warm or even hot  depending on hot long you warmed up the scooter."
        },
        {
            "headline": "Let it drain completely.",
            "description": "Also, almost directly above the drain bolt there is a screw on the side of the engine case for filling the oil. Remove this while draining to help aid the flow. You can introduce some new oil as it in draining to help clear a particles that may have settled in the gear box. A small bit of metal flakes may be present from the engine components but, anything over a dime size may indicate something more serious is going on."
        },
        {
            "headline": "Once the oil has completely drained, place the drain bolt back on the bottom of the case and be sure to use a new gasket if you have one here too.",
            "description": ""
        },
        {
            "headline": "To fill, go back up to the fill screw on the side of the case.",
            "description": "Use SAE 30 (non detergent) oil. Use a large syringe..  Also, an oil can or a turkey baster works well  too. Keep filling until you see a bit of oil coming out the the fill hole."
        },
        {
            "headline": "Now, let the oil drain out the fill hole for a good half hour to an hour.",
            "description": "Replace the fill screw ( use a new gasket here too if you have it)."
        },
        {
            "headline": "Kick it over and go for a ride because, you just changed you own gear box oil!#",
            "description": ""
        }
    ],
    "tyn": [
        "Drain pan",
        "Tools",
        "SAE 30 (non detergent) oil",
        "An oil can, large syringe, or a turkey baster"
    ],
    "text": " Do this after the engine has been run and is still warm, but avoid doing it directly after the scooter has been run and when it is still very warm or even hot. Wait a good half hour or so. Find the bolt. There is a bolt on the bottom right hand side of the engine case (you'll have to get on your knees or even lay on the floor parallel to the scooter.) Once located, place some sort of drain pan under the bolt. The bolt may say \"olio\" on it. Don't worry because this means \"oil\" in Italian so, you are in the right place. Undo the bolt, being cautious as the oil may still be warm or even hot  depending on hot long you warmed up the scooter. Let it drain completely. Also, almost directly above the drain bolt there is a screw on the side of the engine case for filling the oil. Remove this while draining to help aid the flow. You can introduce some new oil as it in draining to help clear a particles that may have settled in the gear box. A small bit of metal flakes may be present from the engine components but, anything over a dime size may indicate something more serious is going on. Once the oil has completely drained, place the drain bolt back on the bottom of the case and be sure to use a new gasket if you have one here too.  To fill, go back up to the fill screw on the side of the case. Use SAE 30 (non detergent) oil. Use a large syringe..  Also, an oil can or a turkey baster works well  too. Keep filling until you see a bit of oil coming out the the fill hole. Now, let the oil drain out the fill hole for a good half hour to an hour. Replace the fill screw ( use a new gasket here too if you have it). Kick it over and go for a ride because, you just changed you own gear box oil!# ",
    "sentences": [
        " Do this after the engine has been run and is still warm, but avoid doing it directly after the scooter has been run and when it is still very warm or even hot.",
        "Wait a good half hour or so.",
        "Find the bolt.",
        "There is a bolt on the bottom right hand side of the engine case (you'll have to get on your knees or even lay on the floor parallel to the scooter.)",
        "Once located, place some sort of drain pan under the bolt.",
        "The bolt may say \"olio\" on it.",
        "Don't worry because this means \"oil\" in Italian so, you are in the right place.",
        "Undo the bolt, being cautious as the oil may still be warm or even hot  depending on hot long you warmed up the scooter.",
        "Let it drain completely.",
        "Also, almost directly above the drain bolt there is a screw on the side of the engine case for filling the oil.",
        "Remove this while draining to help aid the flow.",
        "You can introduce some new oil as it in draining to help clear a particles that may have settled in the gear box.",
        "A small bit of metal flakes may be present from the engine components but, anything over a dime size may indicate something more serious is going on.",
        "Once the oil has completely drained, place the drain bolt back on the bottom of the case and be sure to use a new gasket if you have one here too.",
        "To fill, go back up to the fill screw on the side of the case.",
        "Use SAE 30 (non detergent) oil.",
        "Use a large syringe..  Also, an oil can or a turkey baster works well  too.",
        "Keep filling until you see a bit of oil coming out the the fill hole.",
        "Now, let the oil drain out the fill hole for a good half hour to an hour.",
        "Replace the fill screw ( use a new gasket here too if you have it).",
        "Kick it over and go for a ride because, you just changed you own gear box oil!#"
    ]
}