{
    "title": "How to Customize Your My Little Pony Using Sharpie Markers",
    "url": "https://www.wikihow.com/Customize-Your-My-Little-Pony-Using-Sharpie-Markers",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Toys",
        "Toy Figurines and Accessories",
        "Model Horses"
    ],
    "steps": [
        {
            "headline": "Get your pony.",
            "description": "You might want to use something basic. Consider using a Pinkie Pie, since she is an earth pony and doesn't have complex colors or is hard to find."
        },
        {
            "headline": "Decide what colors you would like to work with.",
            "description": "For example, this pony will have a red mane with a black streak. Color the mane with the desired Sharpie markers."
        },
        {
            "headline": "Get some paper.",
            "description": "Lay the mane down and start coloring it in."
        },
        {
            "headline": "Do the inside of the mane.",
            "description": "Add any streaks you want."
        },
        {
            "headline": "Use nail polish remover for removing the cutie mark.",
            "description": "Use a cotton bud for this."
        },
        {
            "headline": "Add in a new cutie mark.",
            "description": "You can use sequins, paint, or sharpies. But be careful with Sharpie markers."
        },
        {
            "headline": "Recolor the eyes with the sharpies.",
            "description": ""
        },
        {
            "headline": "Add any other designs or markings, like hoof markings, if you want.",
            "description": ""
        },
        {
            "headline": "Seal the body with paint sealer.",
            "description": ""
        },
        {
            "headline": "Enjoy!",
            "description": ""
        }
    ],
    "tyn": [
        "Sharpie marker pens",
        "My Little Pony for customizing",
        "Test pony toy (optional; get one from a thrift store for a trial run)",
        "Some type of paint seal"
    ],
    "text": " Get your pony. You might want to use something basic. Consider using a Pinkie Pie, since she is an earth pony and doesn't have complex colors or is hard to find. Decide what colors you would like to work with. For example, this pony will have a red mane with a black streak. Color the mane with the desired Sharpie markers. Get some paper. Lay the mane down and start coloring it in. Do the inside of the mane. Add any streaks you want. Use nail polish remover for removing the cutie mark. Use a cotton bud for this. Add in a new cutie mark. You can use sequins, paint, or sharpies. But be careful with Sharpie markers. Recolor the eyes with the sharpies.  Add any other designs or markings, like hoof markings, if you want.  Seal the body with paint sealer.  Enjoy! ",
    "sentences": [
        " Get your pony.",
        "You might want to use something basic.",
        "Consider using a Pinkie Pie, since she is an earth pony and doesn't have complex colors or is hard to find.",
        "Decide what colors you would like to work with.",
        "For example, this pony will have a red mane with a black streak.",
        "Color the mane with the desired Sharpie markers.",
        "Get some paper.",
        "Lay the mane down and start coloring it in.",
        "Do the inside of the mane.",
        "Add any streaks you want.",
        "Use nail polish remover for removing the cutie mark.",
        "Use a cotton bud for this.",
        "Add in a new cutie mark.",
        "You can use sequins, paint, or sharpies.",
        "But be careful with Sharpie markers.",
        "Recolor the eyes with the sharpies.",
        "Add any other designs or markings, like hoof markings, if you want.",
        "Seal the body with paint sealer.",
        "Enjoy!"
    ]
}