{
    "title": "How to Play Stepping Stones",
    "url": "https://www.wikihow.com/Play-Stepping-Stones",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Backyard Games",
        "Tag and Chasing Games"
    ],
    "parts": [
        {
            "name": "Setting Up the Game",
            "steps": [
                {
                    "headline": "Prepare the cardboard pieces.",
                    "description": "Cut two pieces of cardboard about 8\"/20 centimeter (7.9 in) square per player. Each piece needs to be large enough to stand on."
                },
                {
                    "headline": "Set out a course to be followed.",
                    "description": "Using a convenient form of markers, set out a course to be followed by the players across the room or lawn. Balls, flags, bricks etc. can all serve as markers."
                },
                {
                    "headline": "Place an object at every second marker.",
                    "description": "At least 3 objects should be a part of the game, requiring their retrieval as each player crosses the game area. These will need to be replaced after each player has moved through."
                }
            ]
        },
        {
            "name": "Playing the Game",
            "steps": [
                {
                    "headline": "Understand the game.",
                    "description": "The object of the game is for each player to cross the marked course in a certain time, only ever using the stepping stones (the pieces of cardboard) that they have been given. As they proceed, they must also capture the items along the way."
                },
                {
                    "headline": "Choose a suitable time allocation before the game.",
                    "description": "Make someone the timer."
                },
                {
                    "headline": "Play the game.",
                    "description": "Give each player his or her cardboard pieces (two each). To cross the course, each player must continuously put down and pick up their pieces of cardboard without ever leaving the cardboard. A player who stands on floor or grass  has to return to the beginning and start again. Call Ready, Set, Go and watch the players proceed. Time the race. It can be helpful to do a practice run without forcing it to end within a set time; once players are more familiar with the race, set a deadline by which to finish the course. Alternatively, an overall winner can be selected from the fastest out of several races, or if there isn't enough room for everyone to run the race at the same time, the fastest can be timed from each race and played against each other for a final race."
                },
                {
                    "headline": "Select the winner.",
                    "description": "The winner is the person who crosses the fastest (or within a pre-determined time allowance) and retrieves the most objects successfully. Depending on the amount of players, you might make it a best of 3 games or just have one game to be the decider."
                }
            ]
        }
    ],
    "tyn": [
        "Cardboard, enough to make stepping stones for each player.",
        "Scissors or craft knife",
        "Objects for retrieval; the size, weight and shape are up to your choice––consider the size, age and strength of the players in making your choices"
    ],
    "text": " Setting Up the Game Prepare the cardboard pieces. Cut two pieces of cardboard about 8\"/20 centimeter (7.9 in) square per player. Each piece needs to be large enough to stand on. Set out a course to be followed. Using a convenient form of markers, set out a course to be followed by the players across the room or lawn. Balls, flags, bricks etc. can all serve as markers. Place an object at every second marker. At least 3 objects should be a part of the game, requiring their retrieval as each player crosses the game area. These will need to be replaced after each player has moved through. Playing the Game Understand the game. The object of the game is for each player to cross the marked course in a certain time, only ever using the stepping stones (the pieces of cardboard) that they have been given. As they proceed, they must also capture the items along the way. Choose a suitable time allocation before the game. Make someone the timer. Play the game. Give each player his or her cardboard pieces (two each). To cross the course, each player must continuously put down and pick up their pieces of cardboard without ever leaving the cardboard. A player who stands on floor or grass  has to return to the beginning and start again. Call Ready, Set, Go and watch the players proceed. Time the race. It can be helpful to do a practice run without forcing it to end within a set time; once players are more familiar with the race, set a deadline by which to finish the course. Alternatively, an overall winner can be selected from the fastest out of several races, or if there isn't enough room for everyone to run the race at the same time, the fastest can be timed from each race and played against each other for a final race. Select the winner. The winner is the person who crosses the fastest (or within a pre-determined time allowance) and retrieves the most objects successfully. Depending on the amount of players, you might make it a best of 3 games or just have one game to be the decider.",
    "sentences": [
        " Setting Up the Game Prepare the cardboard pieces.",
        "Cut two pieces of cardboard about 8\"/20 centimeter (7.9 in) square per player.",
        "Each piece needs to be large enough to stand on.",
        "Set out a course to be followed.",
        "Using a convenient form of markers, set out a course to be followed by the players across the room or lawn.",
        "Balls, flags, bricks etc.",
        "can all serve as markers.",
        "Place an object at every second marker.",
        "At least 3 objects should be a part of the game, requiring their retrieval as each player crosses the game area.",
        "These will need to be replaced after each player has moved through.",
        "Playing the Game Understand the game.",
        "The object of the game is for each player to cross the marked course in a certain time, only ever using the stepping stones (the pieces of cardboard) that they have been given.",
        "As they proceed, they must also capture the items along the way.",
        "Choose a suitable time allocation before the game.",
        "Make someone the timer.",
        "Play the game.",
        "Give each player his or her cardboard pieces (two each).",
        "To cross the course, each player must continuously put down and pick up their pieces of cardboard without ever leaving the cardboard.",
        "A player who stands on floor or grass  has to return to the beginning and start again.",
        "Call Ready, Set, Go and watch the players proceed.",
        "Time the race.",
        "It can be helpful to do a practice run without forcing it to end within a set time; once players are more familiar with the race, set a deadline by which to finish the course.",
        "Alternatively, an overall winner can be selected from the fastest out of several races, or if there isn't enough room for everyone to run the race at the same time, the fastest can be timed from each race and played against each other for a final race.",
        "Select the winner.",
        "The winner is the person who crosses the fastest (or within a pre-determined time allowance) and retrieves the most objects successfully.",
        "Depending on the amount of players, you might make it a best of 3 games or just have one game to be the decider."
    ]
}