{
    "title": "How to Stay Up All Night (Preteen Girls)",
    "url": "https://www.wikihow.com/Stay-Up-All-Night-(Preteen-Girls)",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Fun Activities"
    ],
    "steps": [
        {
            "headline": "Get lots of sleep, and have 3 healthy meals, the day before your all-nighter.",
            "description": ""
        },
        {
            "headline": "Make a kit that will help you stay up.",
            "description": "Get a large purse or bag that will hold your things. Include a small handheld device, like an iPod or phone, lots of icy cold water, earbuds, salty snacks, candy and a gaming console like a D.S."
        },
        {
            "headline": "Wait until your parents are asleep before you do anything that's too loud.",
            "description": "While you wait, you can read, draw, play, listen to music with headphones or watch TV with a low volume. When you're sure your parents are asleep, you can be a little louder, but don't be too loud you can wake your parents up! At about midnight, your parents are probably fast asleep, so you can text or call friends who might be awake near midnight."
        },
        {
            "headline": "Get up and dance to a song with earbuds when you start to get drowsy.",
            "description": "This is a great way to get your heart pumping, but don't be too loud, dancing and stomping could awaken your parents!"
        },
        {
            "headline": "Dunk your head in a sink full of ice water.",
            "description": "This is another way to wake yourself up."
        },
        {
            "headline": "Eat snacks.",
            "description": "At about 2:00, you might start to get hungry. Salty snacks like goldfish or pretzels are suggested."
        },
        {
            "headline": "Watch funny shows like Good Luck Charlie, or some funny videos on YouTube.",
            "description": "You could also find some fun new youtubers! Having a laugh is a great way to stay awake."
        },
        {
            "headline": "Take a cold shower, brush your teeth and hair, and go down the stairs at 4:00 AM.",
            "description": "(This is basically morning.) If your parents ask why you are up early, say that you woke up because of a frightening dream, or you woke up and just couldn't fall back asleep. Have a healthy breakfast, and enjoy some morning cartoons. At five or six o'clock, you might be able to watch the sunrise!"
        },
        {
            "headline": "Fall asleep at nine o' clock.",
            "description": "Sleep for however long you need to, because no sleep over a long period of time can give you hallucinations."
        }
    ],
    "tyn": [
        "A TV, computer, phone, iPad, and/or any other electronic devices",
        "Toys",
        "Books",
        "Games, such as board and card games",
        "Drawing supplies",
        "Accounts on websites (optional)",
        "Snacks",
        "Earbuds",
        "Glasses if you have them (optional)"
    ],
    "text": " Get lots of sleep, and have 3 healthy meals, the day before your all-nighter.  Make a kit that will help you stay up. Get a large purse or bag that will hold your things. Include a small handheld device, like an iPod or phone, lots of icy cold water, earbuds, salty snacks, candy and a gaming console like a D.S. Wait until your parents are asleep before you do anything that's too loud. While you wait, you can read, draw, play, listen to music with headphones or watch TV with a low volume. When you're sure your parents are asleep, you can be a little louder, but don't be too loud you can wake your parents up! At about midnight, your parents are probably fast asleep, so you can text or call friends who might be awake near midnight. Get up and dance to a song with earbuds when you start to get drowsy. This is a great way to get your heart pumping, but don't be too loud, dancing and stomping could awaken your parents! Dunk your head in a sink full of ice water. This is another way to wake yourself up. Eat snacks. At about 2:00, you might start to get hungry. Salty snacks like goldfish or pretzels are suggested. Watch funny shows like Good Luck Charlie, or some funny videos on YouTube. You could also find some fun new youtubers! Having a laugh is a great way to stay awake. Take a cold shower, brush your teeth and hair, and go down the stairs at 4:00 AM. (This is basically morning.) If your parents ask why you are up early, say that you woke up because of a frightening dream, or you woke up and just couldn't fall back asleep. Have a healthy breakfast, and enjoy some morning cartoons. At five or six o'clock, you might be able to watch the sunrise! Fall asleep at nine o' clock. Sleep for however long you need to, because no sleep over a long period of time can give you hallucinations.",
    "sentences": [
        " Get lots of sleep, and have 3 healthy meals, the day before your all-nighter.",
        "Make a kit that will help you stay up.",
        "Get a large purse or bag that will hold your things.",
        "Include a small handheld device, like an iPod or phone, lots of icy cold water, earbuds, salty snacks, candy and a gaming console like a D.S.",
        "Wait until your parents are asleep before you do anything that's too loud.",
        "While you wait, you can read, draw, play, listen to music with headphones or watch TV with a low volume.",
        "When you're sure your parents are asleep, you can be a little louder, but don't be too loud you can wake your parents up!",
        "At about midnight, your parents are probably fast asleep, so you can text or call friends who might be awake near midnight.",
        "Get up and dance to a song with earbuds when you start to get drowsy.",
        "This is a great way to get your heart pumping, but don't be too loud, dancing and stomping could awaken your parents!",
        "Dunk your head in a sink full of ice water.",
        "This is another way to wake yourself up.",
        "Eat snacks.",
        "At about 2:00, you might start to get hungry.",
        "Salty snacks like goldfish or pretzels are suggested.",
        "Watch funny shows like Good Luck Charlie, or some funny videos on YouTube.",
        "You could also find some fun new youtubers!",
        "Having a laugh is a great way to stay awake.",
        "Take a cold shower, brush your teeth and hair, and go down the stairs at 4:00 AM.",
        "(This is basically morning.)",
        "If your parents ask why you are up early, say that you woke up because of a frightening dream, or you woke up and just couldn't fall back asleep.",
        "Have a healthy breakfast, and enjoy some morning cartoons.",
        "At five or six o'clock, you might be able to watch the sunrise!",
        "Fall asleep at nine o' clock.",
        "Sleep for however long you need to, because no sleep over a long period of time can give you hallucinations."
    ]
}