{
    "title": "How to Choose Fixatives for Making Potpourri",
    "url": "https://www.wikihow.com/Choose-Fixatives-for-Making-Potpourri",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Nature Crafts",
        "Potpourri"
    ],
    "steps": [
        {
            "headline": "Select a fixative to suit your potpourri type.",
            "description": "When deciding on a fixative for your potpourri, be guided by the scent and properties of the fixative, including whether you are keeping your potpourri exposed in a container or in a sachet. Powdered fixatives work better in sachets or bags where the powder can be evenly distributed and kept confined; finely chopped fixatives are better for container-held potpourri where it blends in well and does not fall the base of the potpourri as the powdered fixative would do. However, it can be harder to find the chopped or whole version of your fixative; if so, the powdered version will still work, albeit a little more messily. Naturally, availability and price will also impact on your choice."
        },
        {
            "headline": "Choose a fixative.",
            "description": "Examples of fixatives include:\nOrris root - this is a perennial favourite that has long been used to act as a fixative in potpourri. It comes from the Iris florentina Orris root can be found in many health food and herbal stores. Gum benzoin resin, ground\nSandalwood bark\nMyrrh\nFrankincense\nVetiver root\nTonquin/Tonka bean\nCostmary\nPatchouli, dried leaves\nCalamus root\nOakmoss\nCellulose fibre\nDry lavender, whole or ground\nClary sage leaves\nCinnamon stick, ground or broken\nNutmeg\nVanilla pods\nMyrtle leaves, dried"
        },
        {
            "headline": "Follow the instructions provided by your potpourri recipe.",
            "description": "If you wish to change the fixative over time, you can experiment to see which fixatives work best for your style of potpourri. It is likely that you will prefer some over others and this is a natural evolution in your own potpourri making."
        }
    ],
    "tyn": [
        "Fixative",
        "Potpourri recipe",
        "Container or sachet"
    ],
    "text": " Select a fixative to suit your potpourri type. When deciding on a fixative for your potpourri, be guided by the scent and properties of the fixative, including whether you are keeping your potpourri exposed in a container or in a sachet. Powdered fixatives work better in sachets or bags where the powder can be evenly distributed and kept confined; finely chopped fixatives are better for container-held potpourri where it blends in well and does not fall the base of the potpourri as the powdered fixative would do. However, it can be harder to find the chopped or whole version of your fixative; if so, the powdered version will still work, albeit a little more messily. Naturally, availability and price will also impact on your choice. Choose a fixative. Examples of fixatives include:\nOrris root - this is a perennial favourite that has long been used to act as a fixative in potpourri. It comes from the Iris florentina Orris root can be found in many health food and herbal stores. Gum benzoin resin, ground\nSandalwood bark\nMyrrh\nFrankincense\nVetiver root\nTonquin/Tonka bean\nCostmary\nPatchouli, dried leaves\nCalamus root\nOakmoss\nCellulose fibre\nDry lavender, whole or ground\nClary sage leaves\nCinnamon stick, ground or broken\nNutmeg\nVanilla pods\nMyrtle leaves, dried Follow the instructions provided by your potpourri recipe. If you wish to change the fixative over time, you can experiment to see which fixatives work best for your style of potpourri. It is likely that you will prefer some over others and this is a natural evolution in your own potpourri making.",
    "sentences": [
        " Select a fixative to suit your potpourri type.",
        "When deciding on a fixative for your potpourri, be guided by the scent and properties of the fixative, including whether you are keeping your potpourri exposed in a container or in a sachet.",
        "Powdered fixatives work better in sachets or bags where the powder can be evenly distributed and kept confined; finely chopped fixatives are better for container-held potpourri where it blends in well and does not fall the base of the potpourri as the powdered fixative would do.",
        "However, it can be harder to find the chopped or whole version of your fixative; if so, the powdered version will still work, albeit a little more messily.",
        "Naturally, availability and price will also impact on your choice.",
        "Choose a fixative.",
        "Examples of fixatives include:\nOrris root - this is a perennial favourite that has long been used to act as a fixative in potpourri.",
        "It comes from the Iris florentina Orris root can be found in many health food and herbal stores.",
        "Gum benzoin resin, ground\nSandalwood bark\nMyrrh\nFrankincense\nVetiver root\nTonquin/Tonka bean\nCostmary\nPatchouli, dried leaves\nCalamus root\nOakmoss\nCellulose fibre\nDry lavender, whole or ground\nClary sage leaves\nCinnamon stick, ground or broken\nNutmeg\nVanilla pods\nMyrtle leaves, dried Follow the instructions provided by your potpourri recipe.",
        "If you wish to change the fixative over time, you can experiment to see which fixatives work best for your style of potpourri.",
        "It is likely that you will prefer some over others and this is a natural evolution in your own potpourri making."
    ]
}