{
    "title": "How to Make Wine Bottle Accent Lights",
    "url": "https://www.wikihow.com/Make-Wine-Bottle-Accent-Lights",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Glass and Stained Glass Projects",
        "Glass Bottle Projects"
    ],
    "parts": [
        {
            "name": "Prepping The Wine Bottle Lights",
            "steps": [
                {
                    "headline": "Gather your wine bottles.",
                    "description": "The wine bottles you use can be different shapes, and sizes, but try to choose bottles that have distinctive, fun labels. You can choose to keep the labels on bottles, or you can remove the labels."
                },
                {
                    "headline": "Clean the wine bottles.",
                    "description": "Wash your bottles thoroughly with hot, soapy water and allow the bottles to dry completely. The hot, soapy water might cause the labels to peel off from the bottles. You can leave the labels on the bottles if you prefer, or peel them off for a sleeker look. If you decide to take the labels off the bottles, make sure to remove the label glue with some adhesive eliminating spray."
                },
                {
                    "headline": "Build a jig.",
                    "description": "While you wait for the wine bottles to dry, build a base (jig) where you can place the bottle, and hold it steady while you drill. Use a 2x8 piece of wood, and lay it lengthwise on a flat surface. Screw in a 12 inch (30.5 cm) piece of wood about a quarter of the way from the edge of the 2x8. This piece of wood is going to be used as a parting stop. Lay a bottle on the 2x8 piece of wood against the first piece of parting stop, and place another parting stop on the other side of the bottle. Hold that parting stop in place and take away the bottle. Then scoot the parting stop in a little bit closer to the already attached parting stop. Drill the second piece of parting stop like you did the first piece. The idea behind the jig is to hold the bottle securely, so it doesn’t roll away as you’re drilling into it."
                },
                {
                    "headline": "Drill a hole for the bottle stopper.",
                    "description": "Drill a hold in the center of the jig base to hold the bottle stopper. You want your hole to be able 1.25 inches deep. To get the right drill hole, consider using the Forstner drill bit. You want the hole to be deep tight enough so the stopper stays still as you drill it, but loose enough so you can easily remove the bottle stopper. This stopper will be used later to keep the string of lights secured in the bottle."
                },
                {
                    "headline": "Drill the stopper.",
                    "description": "Insert the stopper into the hole in the middle of the jig. Attach the 5/16 inch drill bit into the drill. Center the bit on the stopper, turn on the drill press, and drill through the stopper. You want to drill a hole completely through the stopper. When you are finished drilling, you will most likely have to twist off the stopper from the drill bit. Don’t try to drill the stopper without the jig holding it in place. You will most definitely hurt yourself trying to drill it by holding it with your hands."
                },
                {
                    "headline": "Cut the stopper.",
                    "description": "Pull the stopper from the jig, and use a box knife to slice the stopper from the top of the hole to the bottom, with the point of the knife right inside the stopper hole. The cut makes sure that once we are ready to secure the cord of lights, the lights can slide in the opening and be tightly secured by the stopper."
                }
            ]
        },
        {
            "name": "Making The Wine Bottle Lights",
            "steps": [
                {
                    "headline": "Mark your drilling spot on the bottle.",
                    "description": "Look to drill somewhere on the back of the bottle near the bottom. Consider applying a piece of masking tape to the spot you plan to drill. The tape will help keep the drill from slipping and help to prevent the glass bottle from splintering near the drill site."
                },
                {
                    "headline": "Make a lubricating water reservoir.",
                    "description": "Roll a piece of clay into a rope approximately 4 inches long and about ½ inch in width. Then connect the ends of the clay to form a circle. This circle will serve as a little water reservoir to lubricate the drilling hole and glass as you drill. Surround the area you decided to drill with the clay, and press it into the bottle to seal the reservoir. You might also consider making a pocket (a thick pancake shape) of plumber’s clay, and drilling through the clay you drill. If you decide to drill this way, you must slowly pour water onto the bottle as you drill your hole so the drill doesn’t over heat the bottle and cause it to splinter and crack."
                },
                {
                    "headline": "Prepare the drill lubricant.",
                    "description": "Fill up a squeeze bottle with some cold tap water. Squirt some water into the clay water reservoir. This cold water mitigates the heat created from drilling the glass. If any water starts to leak out from the water reservoir, seal it by pushing the clay harder onto the bottle. You will have to consistently pause drilling, add water to the reservoir, and continue on with the drilling process."
                },
                {
                    "headline": "Drill the hole in the bottle.",
                    "description": "Before you start drilling, put on your protective gloves and glasses. It’s also advisable to wear long sleeve shirts when drilling glass. Use a hand drill with a ½ inch diamond bit, or glass and tile bit, to drill your hole. Place the bottle onto the jig so it stays put while you drill the hole. Hold the drill vertically straight, and start the drill. Lower the drill until it just barely comes in contact with the surface of the bottle. As you start cutting the glass, glass dust will dust up the water reservoir, making it cloudy. Continue drilling, pushing down ever so slight onto the drill. Eventually (after about 20 or 30 seconds), the water in the reservoir will start to leak and drip into the inside of the bottle. This means that you are almost completely broken through the glass. Once you have drilled through the bottle, pull the drill out from the hole and turn off the drill..{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a8\\/Make-Wine-Bottle-Accent-Lights-Step-10-Version-3.jpg\\/v4-459px-Make-Wine-Bottle-Accent-Lights-Step-10-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a8\\/Make-Wine-Bottle-Accent-Lights-Step-10-Version-3.jpg\\/v4-759px-Make-Wine-Bottle-Accent-Lights-Step-10-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"}\n\nIt is very important that you don't force the drill through the glass. Too much downward pressure could make the bottle to crack."
                },
                {
                    "headline": "Check your drilling work.",
                    "description": "Look around the drill site for fractures in the bottle. If you see any cracks, you might want to discard the bottle, as it will be very fragile and potentially dangerous. Remove the clay lubricant reservoir and empty the contents of the bottle into the garbage. If the drilled out glass disc isn’t in the bottle, it’s probably stuck in the drill bit. If that’s the case, try to pry it out with a paperclip edge."
                },
                {
                    "headline": "Sand the drilled hole.",
                    "description": "Use sandpaper to file down the sharp edges created by drilling the hole into the bottle. Then rinse the bottle with water to wash out any glass bits, and allow the bottle to dry again. 150 grit paper will sufficiently smooth out the rough edges of the hole."
                },
                {
                    "headline": "Insert the lights into the bottle.",
                    "description": "Remove the decoration lights from the box, and pull the lights taut so they can lay straight. Check to make sure the string of lights work by plugging them into an outlet. If the lights light up and are working correctly, insert the first bulb on the string in through the hole that you drilled out. Continue inserting the lights one by one, being sure to keep the outlet plug remaining outside the bottle. To help fit the light bulbs through the hole more easily, push the light against the cord, and push both through at the same time. Be careful not to cut the lights cord on the edges of the hole. You might have to turn the bottle upside down in order to move the lights inside the bottom “up” to make room for the rest of the lights entering through the base of the bottle."
                },
                {
                    "headline": "Secure the lights with a stopper.",
                    "description": "Once you’ve finished feeding the lights into the bottle, wrap the stopper around the remaining strand hanging from the outside of the bottle, and insert the stopper into the hole. The stopper will protect the cord from being cut by the raw glass edges of the hole and keep the lights inside the bottle."
                },
                {
                    "headline": "Finished!",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Wine bottle(s) with cork(s)",
        "Hand-held drill or a drill press",
        "1/2-inch diamond hole saw",
        "5/16-inch drill bit",
        "7/16-inch Forstner bit or standard drill bit the same size (the Forstner bit will work best, because it drills a flat-bottomed hole)",
        "A 12-inch piece of 2x8 for the jig base",
        "2 12-inch pieces of parting stop or similar material",
        "A condiment bottle or other type of squeeze bottle",
        "A box knife",
        "Safety glasses",
        "Safety gloves",
        "6, 1 1/2 inch wood screws",
        "#00 rubber stopper",
        "Modeling clay",
        "Oil penetrating adhesive removal product",
        "Diamond Core Drill Bit",
        "LED Christmas lights"
    ],
    "text": " Prepping The Wine Bottle Lights Gather your wine bottles. The wine bottles you use can be different shapes, and sizes, but try to choose bottles that have distinctive, fun labels. You can choose to keep the labels on bottles, or you can remove the labels. Clean the wine bottles. Wash your bottles thoroughly with hot, soapy water and allow the bottles to dry completely. The hot, soapy water might cause the labels to peel off from the bottles. You can leave the labels on the bottles if you prefer, or peel them off for a sleeker look. If you decide to take the labels off the bottles, make sure to remove the label glue with some adhesive eliminating spray. Build a jig. While you wait for the wine bottles to dry, build a base (jig) where you can place the bottle, and hold it steady while you drill. Use a 2x8 piece of wood, and lay it lengthwise on a flat surface. Screw in a 12 inch (30.5 cm) piece of wood about a quarter of the way from the edge of the 2x8. This piece of wood is going to be used as a parting stop. Lay a bottle on the 2x8 piece of wood against the first piece of parting stop, and place another parting stop on the other side of the bottle. Hold that parting stop in place and take away the bottle. Then scoot the parting stop in a little bit closer to the already attached parting stop. Drill the second piece of parting stop like you did the first piece. The idea behind the jig is to hold the bottle securely, so it doesn’t roll away as you’re drilling into it. Drill a hole for the bottle stopper. Drill a hold in the center of the jig base to hold the bottle stopper. You want your hole to be able 1.25 inches deep. To get the right drill hole, consider using the Forstner drill bit. You want the hole to be deep tight enough so the stopper stays still as you drill it, but loose enough so you can easily remove the bottle stopper. This stopper will be used later to keep the string of lights secured in the bottle. Drill the stopper. Insert the stopper into the hole in the middle of the jig. Attach the 5/16 inch drill bit into the drill. Center the bit on the stopper, turn on the drill press, and drill through the stopper. You want to drill a hole completely through the stopper. When you are finished drilling, you will most likely have to twist off the stopper from the drill bit. Don’t try to drill the stopper without the jig holding it in place. You will most definitely hurt yourself trying to drill it by holding it with your hands. Cut the stopper. Pull the stopper from the jig, and use a box knife to slice the stopper from the top of the hole to the bottom, with the point of the knife right inside the stopper hole. The cut makes sure that once we are ready to secure the cord of lights, the lights can slide in the opening and be tightly secured by the stopper. Making The Wine Bottle Lights Mark your drilling spot on the bottle. Look to drill somewhere on the back of the bottle near the bottom. Consider applying a piece of masking tape to the spot you plan to drill. The tape will help keep the drill from slipping and help to prevent the glass bottle from splintering near the drill site. Make a lubricating water reservoir. Roll a piece of clay into a rope approximately 4 inches long and about ½ inch in width. Then connect the ends of the clay to form a circle. This circle will serve as a little water reservoir to lubricate the drilling hole and glass as you drill. Surround the area you decided to drill with the clay, and press it into the bottle to seal the reservoir. You might also consider making a pocket (a thick pancake shape) of plumber’s clay, and drilling through the clay you drill. If you decide to drill this way, you must slowly pour water onto the bottle as you drill your hole so the drill doesn’t over heat the bottle and cause it to splinter and crack. Prepare the drill lubricant. Fill up a squeeze bottle with some cold tap water. Squirt some water into the clay water reservoir. This cold water mitigates the heat created from drilling the glass. If any water starts to leak out from the water reservoir, seal it by pushing the clay harder onto the bottle. You will have to consistently pause drilling, add water to the reservoir, and continue on with the drilling process. Drill the hole in the bottle. Before you start drilling, put on your protective gloves and glasses. It’s also advisable to wear long sleeve shirts when drilling glass. Use a hand drill with a ½ inch diamond bit, or glass and tile bit, to drill your hole. Place the bottle onto the jig so it stays put while you drill the hole. Hold the drill vertically straight, and start the drill. Lower the drill until it just barely comes in contact with the surface of the bottle. As you start cutting the glass, glass dust will dust up the water reservoir, making it cloudy. Continue drilling, pushing down ever so slight onto the drill. Eventually (after about 20 or 30 seconds), the water in the reservoir will start to leak and drip into the inside of the bottle. This means that you are almost completely broken through the glass. Once you have drilled through the bottle, pull the drill out from the hole and turn off the drill..{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a8\\/Make-Wine-Bottle-Accent-Lights-Step-10-Version-3.jpg\\/v4-459px-Make-Wine-Bottle-Accent-Lights-Step-10-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a8\\/Make-Wine-Bottle-Accent-Lights-Step-10-Version-3.jpg\\/v4-759px-Make-Wine-Bottle-Accent-Lights-Step-10-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"}\n\nIt is very important that you don't force the drill through the glass. Too much downward pressure could make the bottle to crack. Check your drilling work. Look around the drill site for fractures in the bottle. If you see any cracks, you might want to discard the bottle, as it will be very fragile and potentially dangerous. Remove the clay lubricant reservoir and empty the contents of the bottle into the garbage. If the drilled out glass disc isn’t in the bottle, it’s probably stuck in the drill bit. If that’s the case, try to pry it out with a paperclip edge. Sand the drilled hole. Use sandpaper to file down the sharp edges created by drilling the hole into the bottle. Then rinse the bottle with water to wash out any glass bits, and allow the bottle to dry again. 150 grit paper will sufficiently smooth out the rough edges of the hole. Insert the lights into the bottle. Remove the decoration lights from the box, and pull the lights taut so they can lay straight. Check to make sure the string of lights work by plugging them into an outlet. If the lights light up and are working correctly, insert the first bulb on the string in through the hole that you drilled out. Continue inserting the lights one by one, being sure to keep the outlet plug remaining outside the bottle. To help fit the light bulbs through the hole more easily, push the light against the cord, and push both through at the same time. Be careful not to cut the lights cord on the edges of the hole. You might have to turn the bottle upside down in order to move the lights inside the bottom “up” to make room for the rest of the lights entering through the base of the bottle. Secure the lights with a stopper. Once you’ve finished feeding the lights into the bottle, wrap the stopper around the remaining strand hanging from the outside of the bottle, and insert the stopper into the hole. The stopper will protect the cord from being cut by the raw glass edges of the hole and keep the lights inside the bottle. Finished! ",
    "sentences": [
        " Prepping The Wine Bottle Lights Gather your wine bottles.",
        "The wine bottles you use can be different shapes, and sizes, but try to choose bottles that have distinctive, fun labels.",
        "You can choose to keep the labels on bottles, or you can remove the labels.",
        "Clean the wine bottles.",
        "Wash your bottles thoroughly with hot, soapy water and allow the bottles to dry completely.",
        "The hot, soapy water might cause the labels to peel off from the bottles.",
        "You can leave the labels on the bottles if you prefer, or peel them off for a sleeker look.",
        "If you decide to take the labels off the bottles, make sure to remove the label glue with some adhesive eliminating spray.",
        "Build a jig.",
        "While you wait for the wine bottles to dry, build a base (jig) where you can place the bottle, and hold it steady while you drill.",
        "Use a 2x8 piece of wood, and lay it lengthwise on a flat surface.",
        "Screw in a 12 inch (30.5 cm) piece of wood about a quarter of the way from the edge of the 2x8.",
        "This piece of wood is going to be used as a parting stop.",
        "Lay a bottle on the 2x8 piece of wood against the first piece of parting stop, and place another parting stop on the other side of the bottle.",
        "Hold that parting stop in place and take away the bottle.",
        "Then scoot the parting stop in a little bit closer to the already attached parting stop.",
        "Drill the second piece of parting stop like you did the first piece.",
        "The idea behind the jig is to hold the bottle securely, so it doesn’t roll away as you’re drilling into it.",
        "Drill a hole for the bottle stopper.",
        "Drill a hold in the center of the jig base to hold the bottle stopper.",
        "You want your hole to be able 1.25 inches deep.",
        "To get the right drill hole, consider using the Forstner drill bit.",
        "You want the hole to be deep tight enough so the stopper stays still as you drill it, but loose enough so you can easily remove the bottle stopper.",
        "This stopper will be used later to keep the string of lights secured in the bottle.",
        "Drill the stopper.",
        "Insert the stopper into the hole in the middle of the jig.",
        "Attach the 5/16 inch drill bit into the drill.",
        "Center the bit on the stopper, turn on the drill press, and drill through the stopper.",
        "You want to drill a hole completely through the stopper.",
        "When you are finished drilling, you will most likely have to twist off the stopper from the drill bit.",
        "Don’t try to drill the stopper without the jig holding it in place.",
        "You will most definitely hurt yourself trying to drill it by holding it with your hands.",
        "Cut the stopper.",
        "Pull the stopper from the jig, and use a box knife to slice the stopper from the top of the hole to the bottom, with the point of the knife right inside the stopper hole.",
        "The cut makes sure that once we are ready to secure the cord of lights, the lights can slide in the opening and be tightly secured by the stopper.",
        "Making The Wine Bottle Lights Mark your drilling spot on the bottle.",
        "Look to drill somewhere on the back of the bottle near the bottom.",
        "Consider applying a piece of masking tape to the spot you plan to drill.",
        "The tape will help keep the drill from slipping and help to prevent the glass bottle from splintering near the drill site.",
        "Make a lubricating water reservoir.",
        "Roll a piece of clay into a rope approximately 4 inches long and about ½ inch in width.",
        "Then connect the ends of the clay to form a circle.",
        "This circle will serve as a little water reservoir to lubricate the drilling hole and glass as you drill.",
        "Surround the area you decided to drill with the clay, and press it into the bottle to seal the reservoir.",
        "You might also consider making a pocket (a thick pancake shape) of plumber’s clay, and drilling through the clay you drill.",
        "If you decide to drill this way, you must slowly pour water onto the bottle as you drill your hole so the drill doesn’t over heat the bottle and cause it to splinter and crack.",
        "Prepare the drill lubricant.",
        "Fill up a squeeze bottle with some cold tap water.",
        "Squirt some water into the clay water reservoir.",
        "This cold water mitigates the heat created from drilling the glass.",
        "If any water starts to leak out from the water reservoir, seal it by pushing the clay harder onto the bottle.",
        "You will have to consistently pause drilling, add water to the reservoir, and continue on with the drilling process.",
        "Drill the hole in the bottle.",
        "Before you start drilling, put on your protective gloves and glasses.",
        "It’s also advisable to wear long sleeve shirts when drilling glass.",
        "Use a hand drill with a ½ inch diamond bit, or glass and tile bit, to drill your hole.",
        "Place the bottle onto the jig so it stays put while you drill the hole.",
        "Hold the drill vertically straight, and start the drill.",
        "Lower the drill until it just barely comes in contact with the surface of the bottle.",
        "As you start cutting the glass, glass dust will dust up the water reservoir, making it cloudy.",
        "Continue drilling, pushing down ever so slight onto the drill.",
        "Eventually (after about 20 or 30 seconds), the water in the reservoir will start to leak and drip into the inside of the bottle.",
        "This means that you are almost completely broken through the glass.",
        "Once you have drilled through the bottle, pull the drill out from the hole and turn off the drill..{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a8\\/Make-Wine-Bottle-Accent-Lights-Step-10-Version-3.jpg\\/v4-459px-Make-Wine-Bottle-Accent-Lights-Step-10-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a8\\/Make-Wine-Bottle-Accent-Lights-Step-10-Version-3.jpg\\/v4-759px-Make-Wine-Bottle-Accent-Lights-Step-10-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"}\n\nIt is very important that you don't force the drill through the glass.",
        "Too much downward pressure could make the bottle to crack.",
        "Check your drilling work.",
        "Look around the drill site for fractures in the bottle.",
        "If you see any cracks, you might want to discard the bottle, as it will be very fragile and potentially dangerous.",
        "Remove the clay lubricant reservoir and empty the contents of the bottle into the garbage.",
        "If the drilled out glass disc isn’t in the bottle, it’s probably stuck in the drill bit.",
        "If that’s the case, try to pry it out with a paperclip edge.",
        "Sand the drilled hole.",
        "Use sandpaper to file down the sharp edges created by drilling the hole into the bottle.",
        "Then rinse the bottle with water to wash out any glass bits, and allow the bottle to dry again.",
        "150 grit paper will sufficiently smooth out the rough edges of the hole.",
        "Insert the lights into the bottle.",
        "Remove the decoration lights from the box, and pull the lights taut so they can lay straight.",
        "Check to make sure the string of lights work by plugging them into an outlet.",
        "If the lights light up and are working correctly, insert the first bulb on the string in through the hole that you drilled out.",
        "Continue inserting the lights one by one, being sure to keep the outlet plug remaining outside the bottle.",
        "To help fit the light bulbs through the hole more easily, push the light against the cord, and push both through at the same time.",
        "Be careful not to cut the lights cord on the edges of the hole.",
        "You might have to turn the bottle upside down in order to move the lights inside the bottom “up” to make room for the rest of the lights entering through the base of the bottle.",
        "Secure the lights with a stopper.",
        "Once you’ve finished feeding the lights into the bottle, wrap the stopper around the remaining strand hanging from the outside of the bottle, and insert the stopper into the hole.",
        "The stopper will protect the cord from being cut by the raw glass edges of the hole and keep the lights inside the bottle.",
        "Finished!"
    ]
}