{
    "title": "How to Make a Poké Ball",
    "url": "https://www.wikihow.com/Make-a-Pok%C3%A9-Ball",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Card Games"
    ],
    "parts": [
        {
            "name": "Preparing Your Ball",
            "steps": [
                {
                    "headline": "Use any round ball.",
                    "description": "In order to make your Poké Ball, you must first find a ball to use. You can make it any size that you’d like, as long as you find a ball that’s perfectly round. Also, choose a ball with a smooth surface because they will be easier to paint. A lacrosse ball is a great ball to use."
                },
                {
                    "headline": "Prime your ball.",
                    "description": "If you’re using an old ball for your Poké Ball, there may be scuff marks, stick marks, dirt residue, or many other things on it. Even if you have a new ball, there might be dark logos on the surface of it. Use a white primer to prime your ball. Paint an even layer over the entire thing. The primer will also help your paint adhere to your Poké Ball. This will make it last longer than and age less quickly."
                },
                {
                    "headline": "Place rubber bands around the ball.",
                    "description": "Use two rubber bands to outline the center part of your Poké Ball. Place them around the ball so that they lay flat. You want the area between them to be just less than a third of the ball. To make sizing the outline for the black part of your ball easier, simply place the elastics to cut the ball in thirds. From there, slowly slide the bands toward the center of the ball. Once you’ve reached the desired size for the center black part of your Poké Ball, make sure the elastics are lying flat."
                },
                {
                    "headline": "Trace the inside of the bands.",
                    "description": "Take a pencil and trace along the inside of the elastic bands. Trace all the way around the ball to create the outline for the black part of the ball. Take your rubber bands off once you’ve done this."
                },
                {
                    "headline": "Use a washer.",
                    "description": "Take a rubber faucet washer that is just wider than the black part of your Poké Ball. Use one of your elastics to hold in in place. It should be centered between the two lines you’ve created. Trace around the washer, both the inner and outer circle."
                }
            ]
        },
        {
            "name": "Painting Your Ball",
            "steps": [
                {
                    "headline": "Paint the white part of your ball.",
                    "description": "You want to use your white paint first. If you happen to paint over the line with white, it is easy to cover up with darker paint. If you choose to do it the other way, you’ll have a very difficult time covering your mistake. Decide which part of the ball you want to make the bottom. Use the lower mark you made with your elastic and paint from there down. Also, paint the small inside circle from your washer white. Use two coats of paint for a bright white finish."
                },
                {
                    "headline": "Paint the red part of your ball.",
                    "description": "Next, paint the red part of your ball. This is the top. Paint from the upper line you made from tracing the elastic. Paint from this line up. Because black is darker than red, if you get some of the red over your line, you can still paint over it to correct it. Once again, use two coats of paint."
                },
                {
                    "headline": "Paint the black part of your ball.",
                    "description": "This is the center ring around your Poké Ball. Carefully paint the ring black, including the outline you created with your washer. If you wait for the red and white paint to dry, you can place your elastics around your ball once again at the outline of your black center part. Use these as a guideline and to protect your red and white paint from being ruined."
                },
                {
                    "headline": "Finish with a gloss.",
                    "description": "Poké Balls are shiny. Finishing with a top gloss will make your Poké Ball look more authentic. Once your paint has dried, use a shiny top gloss to paint over the entire ball. To avoid the gloss from smudging, paint your ball one half at a time so that you can safely rest it without ruining any wet paint."
                }
            ]
        }
    ],
    "tyn": [
        "A ball",
        "Two rubber bands",
        "A washer",
        "Red, white, and black acrylic paint",
        "Primer",
        "A paint brush"
    ],
    "text": " Preparing Your Ball Use any round ball. In order to make your Poké Ball, you must first find a ball to use. You can make it any size that you’d like, as long as you find a ball that’s perfectly round. Also, choose a ball with a smooth surface because they will be easier to paint. A lacrosse ball is a great ball to use. Prime your ball. If you’re using an old ball for your Poké Ball, there may be scuff marks, stick marks, dirt residue, or many other things on it. Even if you have a new ball, there might be dark logos on the surface of it. Use a white primer to prime your ball. Paint an even layer over the entire thing. The primer will also help your paint adhere to your Poké Ball. This will make it last longer than and age less quickly. Place rubber bands around the ball. Use two rubber bands to outline the center part of your Poké Ball. Place them around the ball so that they lay flat. You want the area between them to be just less than a third of the ball. To make sizing the outline for the black part of your ball easier, simply place the elastics to cut the ball in thirds. From there, slowly slide the bands toward the center of the ball. Once you’ve reached the desired size for the center black part of your Poké Ball, make sure the elastics are lying flat. Trace the inside of the bands. Take a pencil and trace along the inside of the elastic bands. Trace all the way around the ball to create the outline for the black part of the ball. Take your rubber bands off once you’ve done this. Use a washer. Take a rubber faucet washer that is just wider than the black part of your Poké Ball. Use one of your elastics to hold in in place. It should be centered between the two lines you’ve created. Trace around the washer, both the inner and outer circle. Painting Your Ball Paint the white part of your ball. You want to use your white paint first. If you happen to paint over the line with white, it is easy to cover up with darker paint. If you choose to do it the other way, you’ll have a very difficult time covering your mistake. Decide which part of the ball you want to make the bottom. Use the lower mark you made with your elastic and paint from there down. Also, paint the small inside circle from your washer white. Use two coats of paint for a bright white finish. Paint the red part of your ball. Next, paint the red part of your ball. This is the top. Paint from the upper line you made from tracing the elastic. Paint from this line up. Because black is darker than red, if you get some of the red over your line, you can still paint over it to correct it. Once again, use two coats of paint. Paint the black part of your ball. This is the center ring around your Poké Ball. Carefully paint the ring black, including the outline you created with your washer. If you wait for the red and white paint to dry, you can place your elastics around your ball once again at the outline of your black center part. Use these as a guideline and to protect your red and white paint from being ruined. Finish with a gloss. Poké Balls are shiny. Finishing with a top gloss will make your Poké Ball look more authentic. Once your paint has dried, use a shiny top gloss to paint over the entire ball. To avoid the gloss from smudging, paint your ball one half at a time so that you can safely rest it without ruining any wet paint.",
    "sentences": [
        " Preparing Your Ball Use any round ball.",
        "In order to make your Poké Ball, you must first find a ball to use.",
        "You can make it any size that you’d like, as long as you find a ball that’s perfectly round.",
        "Also, choose a ball with a smooth surface because they will be easier to paint.",
        "A lacrosse ball is a great ball to use.",
        "Prime your ball.",
        "If you’re using an old ball for your Poké Ball, there may be scuff marks, stick marks, dirt residue, or many other things on it.",
        "Even if you have a new ball, there might be dark logos on the surface of it.",
        "Use a white primer to prime your ball.",
        "Paint an even layer over the entire thing.",
        "The primer will also help your paint adhere to your Poké Ball.",
        "This will make it last longer than and age less quickly.",
        "Place rubber bands around the ball.",
        "Use two rubber bands to outline the center part of your Poké Ball.",
        "Place them around the ball so that they lay flat.",
        "You want the area between them to be just less than a third of the ball.",
        "To make sizing the outline for the black part of your ball easier, simply place the elastics to cut the ball in thirds.",
        "From there, slowly slide the bands toward the center of the ball.",
        "Once you’ve reached the desired size for the center black part of your Poké Ball, make sure the elastics are lying flat.",
        "Trace the inside of the bands.",
        "Take a pencil and trace along the inside of the elastic bands.",
        "Trace all the way around the ball to create the outline for the black part of the ball.",
        "Take your rubber bands off once you’ve done this.",
        "Use a washer.",
        "Take a rubber faucet washer that is just wider than the black part of your Poké Ball.",
        "Use one of your elastics to hold in in place.",
        "It should be centered between the two lines you’ve created.",
        "Trace around the washer, both the inner and outer circle.",
        "Painting Your Ball Paint the white part of your ball.",
        "You want to use your white paint first.",
        "If you happen to paint over the line with white, it is easy to cover up with darker paint.",
        "If you choose to do it the other way, you’ll have a very difficult time covering your mistake.",
        "Decide which part of the ball you want to make the bottom.",
        "Use the lower mark you made with your elastic and paint from there down.",
        "Also, paint the small inside circle from your washer white.",
        "Use two coats of paint for a bright white finish.",
        "Paint the red part of your ball.",
        "Next, paint the red part of your ball.",
        "This is the top.",
        "Paint from the upper line you made from tracing the elastic.",
        "Paint from this line up.",
        "Because black is darker than red, if you get some of the red over your line, you can still paint over it to correct it.",
        "Once again, use two coats of paint.",
        "Paint the black part of your ball.",
        "This is the center ring around your Poké Ball.",
        "Carefully paint the ring black, including the outline you created with your washer.",
        "If you wait for the red and white paint to dry, you can place your elastics around your ball once again at the outline of your black center part.",
        "Use these as a guideline and to protect your red and white paint from being ruined.",
        "Finish with a gloss.",
        "Poké Balls are shiny.",
        "Finishing with a top gloss will make your Poké Ball look more authentic.",
        "Once your paint has dried, use a shiny top gloss to paint over the entire ball.",
        "To avoid the gloss from smudging, paint your ball one half at a time so that you can safely rest it without ruining any wet paint."
    ]
}