{
    "title": "How to Clean a Pet Cage with a Fleece Bottom",
    "url": "https://www.wikihow.com/Clean-a-Pet-Cage-with-a-Fleece-Bottom",
    "category_hierarchy": [
        "Pets and Animals",
        "Rodents"
    ],
    "parts": [
        {
            "name": "Cleaning the Cage",
            "steps": [
                {
                    "headline": "Sweep away feces on a daily basis to keep the cage clean.",
                    "description": "With some types of bedding, feces will get sifted below the top layer, so you only have to clean it every few days. With fleece bedding, however, any debris will stay right on the surface, so you'll need to be committed to cleaning the cage every day. You can either pick up feces and spilled food by hand, or you can keep a small brush and dustpan near the cage, and simply sweep away the debris. Do this at least once every day."
                },
                {
                    "headline": "Clean the cage completely at least once a week.",
                    "description": "Fleece will wick away urine and other moisture, but it holds that moisture at the bottom of the cage. To keep your pet healthy and happy, you'll need to take everything out of the cage once a week, including the bedding, and wash it all thoroughly. As with any bedding, failure to clean the cage at least once a week can lead to a dangerous buildup of ammonia that can make your pets very sick."
                },
                {
                    "headline": "Remove your pet and put it in a holding cage.",
                    "description": "It will be very difficult, if not impossible, to clean your cage while your pet is present. It's best to have a separate holding cage where they'll feel safe and secure. This can be the carrying  cage you brought your pet home in, a small, ventilated box with a secure lid, or even an empty bathtub, as long as the drain is completely covered. Place fresh food and water and toys in the holding cage so your pet doesn't get too stressed out. Also, make sure the cage has a secure lid so they can't escape."
                },
                {
                    "headline": "Take everything else out of the cage once your pet is secured.",
                    "description": "After you've moved your pet to the holding cage, remove the animal's food and water dishes, any toys, houses, or exercise equipment, and the fleece. In order to ensure the cage is fully cleaned, you'll need to wash each element separately. It can be a good idea to put different toys in the cage each time you clean it. That way, your pet will always have something interesting to come back to. Then, the next time you clean the cage, you can just add the toys you replaced last time."
                },
                {
                    "headline": "Remove the fleece and either vacuum it or shake it out.",
                    "description": "Since hay, food, and feces can all cling to the surface of the fleece, it's best to make sure you remove any large debris that might clog up your washing machine. You can take the fleece outside and shake it off thoroughly, or you can use the hose attachment on your vacuum cleaner to suck away dirt and debris. For a deeper clean, shake the fleece off outside, then vacuum it."
                },
                {
                    "headline": "Wipe down the bottom of the cage with a washcloth or baby wipe.",
                    "description": "After you've taken everything out of the cage, wipe the cage down thoroughly with a wet cloth or a baby wipe. This will help keep ammonia from building up in the cage if urine soaked all the way through the fleece. Allow the cage to dry completely before you put anything back into the cage to prevent mold and mildew from growing. Avoid using harsh cleaners like bleach, even if you dilute it first. It can be hard to ensure you completely remove any chemical residue that might make your pets sick. Tip: For an all-natural, deeper clean, try wiping down your cage with vinegar."
                },
                {
                    "headline": "Wash any food bowls, toys, or other decorations with hot, soapy water.",
                    "description": "It won't do any good to put dirty items back into a clean cage. Use mild dish soap and hot water to wash the pet's food bowl, toys, hiding spots, exercise wheels, or anything else that goes into the cage, then rinse them thoroughly and let them air-dry. Make sure the items are completely dry before you put them back into the cage. Most small pets thrive in a low-moisture environment."
                }
            ]
        },
        {
            "name": "Washing the Fleece",
            "steps": [
                {
                    "headline": "Wash the fleece in hot water with unscented detergent.",
                    "description": "Cleaning fleece bedding is as simple as placing it in your washing machine on a hot cycle. Use unscented detergent to protect the fleece's wicking ability, and run the cycle as you normally would. To ensure the fleece gets completely clean, it's best to use a small load, rather than overcrowding the washing machine. If you'd prefer, you can also wash the fleece by hand in hot water."
                },
                {
                    "headline": "Do not use liquid fabric softener when you're washing the fleece.",
                    "description": "Liquid fabric softener can leave a film on fabrics that can affect its ability to repel moisture. Since it's essential that fleece bedding can wick away urine from your pet's living area, you should never use liquid fabric softeners when you're washing the bedding. However, you can add vinegar or a bacteria eliminator to the wash to fight odors, if you'd like."
                },
                {
                    "headline": "Tumble dry or air dry the fleece.",
                    "description": "Once the fleece is washed, either place it in the dryer on low heat or hang it up to air dry. To prevent your pet's cage from getting too damp and possibly developing mold or mildew, make sure the fleece bedding is completely dry before you put it back into the cage. Don't dry your fleece on high heat. If you do, it might shrink, and it may not properly cover the bottom of your cage. Tip: It can take a while for fleece to dry. To get your pet back in its cage as quickly as possible, it can be helpful to have a second piece of fleece that you can put in the cage after you finish cleaning. Then, you can wash the dirty fleece, dry it, and put it away to use the next time you clean the cage."
                },
                {
                    "headline": "Place the fleece in the cage on top of an absorbent material.",
                    "description": "Fleece will wick moisture away, but if you don't have anything absorbent in the bottom of the cage, the fleece will just stay wet. To avoid this, place something like an old towel or layers of newspaper in the bottom of the cage, then place the fleece on top of that. Change or clean this absorbent layer each time you clean the fleece. Since newspapers will get soggy when they're wet, a towel is typically easier to clean."
                },
                {
                    "headline": "Set the cage back up and place your pet back inside.",
                    "description": "After you've cleaned all of the components and replaced the fleece, you can start adding everything back to your pet's cage. Once everything is set up, carefully transfer your pet back to their clean, fresh cage! Don't forget to refill your pet's food and water before you put it back in the cage."
                }
            ]
        }
    ],
    "tyn": [
        "Holding cage for your pet",
        "Hot water",
        "Soap",
        "Washcloth or baby wipes",
        "Washing machine or sink",
        "Unscented laundry detergent",
        "Dryer or clothesline",
        "Vacuum (optional)",
        "Brush and dustpan (optional)",
        "Extra piece of fleece (optional)"
    ],
    "text": " Cleaning the Cage Sweep away feces on a daily basis to keep the cage clean. With some types of bedding, feces will get sifted below the top layer, so you only have to clean it every few days. With fleece bedding, however, any debris will stay right on the surface, so you'll need to be committed to cleaning the cage every day. You can either pick up feces and spilled food by hand, or you can keep a small brush and dustpan near the cage, and simply sweep away the debris. Do this at least once every day. Clean the cage completely at least once a week. Fleece will wick away urine and other moisture, but it holds that moisture at the bottom of the cage. To keep your pet healthy and happy, you'll need to take everything out of the cage once a week, including the bedding, and wash it all thoroughly. As with any bedding, failure to clean the cage at least once a week can lead to a dangerous buildup of ammonia that can make your pets very sick. Remove your pet and put it in a holding cage. It will be very difficult, if not impossible, to clean your cage while your pet is present. It's best to have a separate holding cage where they'll feel safe and secure. This can be the carrying  cage you brought your pet home in, a small, ventilated box with a secure lid, or even an empty bathtub, as long as the drain is completely covered. Place fresh food and water and toys in the holding cage so your pet doesn't get too stressed out. Also, make sure the cage has a secure lid so they can't escape. Take everything else out of the cage once your pet is secured. After you've moved your pet to the holding cage, remove the animal's food and water dishes, any toys, houses, or exercise equipment, and the fleece. In order to ensure the cage is fully cleaned, you'll need to wash each element separately. It can be a good idea to put different toys in the cage each time you clean it. That way, your pet will always have something interesting to come back to. Then, the next time you clean the cage, you can just add the toys you replaced last time. Remove the fleece and either vacuum it or shake it out. Since hay, food, and feces can all cling to the surface of the fleece, it's best to make sure you remove any large debris that might clog up your washing machine. You can take the fleece outside and shake it off thoroughly, or you can use the hose attachment on your vacuum cleaner to suck away dirt and debris. For a deeper clean, shake the fleece off outside, then vacuum it. Wipe down the bottom of the cage with a washcloth or baby wipe. After you've taken everything out of the cage, wipe the cage down thoroughly with a wet cloth or a baby wipe. This will help keep ammonia from building up in the cage if urine soaked all the way through the fleece. Allow the cage to dry completely before you put anything back into the cage to prevent mold and mildew from growing. Avoid using harsh cleaners like bleach, even if you dilute it first. It can be hard to ensure you completely remove any chemical residue that might make your pets sick. Tip: For an all-natural, deeper clean, try wiping down your cage with vinegar. Wash any food bowls, toys, or other decorations with hot, soapy water. It won't do any good to put dirty items back into a clean cage. Use mild dish soap and hot water to wash the pet's food bowl, toys, hiding spots, exercise wheels, or anything else that goes into the cage, then rinse them thoroughly and let them air-dry. Make sure the items are completely dry before you put them back into the cage. Most small pets thrive in a low-moisture environment. Washing the Fleece Wash the fleece in hot water with unscented detergent. Cleaning fleece bedding is as simple as placing it in your washing machine on a hot cycle. Use unscented detergent to protect the fleece's wicking ability, and run the cycle as you normally would. To ensure the fleece gets completely clean, it's best to use a small load, rather than overcrowding the washing machine. If you'd prefer, you can also wash the fleece by hand in hot water. Do not use liquid fabric softener when you're washing the fleece. Liquid fabric softener can leave a film on fabrics that can affect its ability to repel moisture. Since it's essential that fleece bedding can wick away urine from your pet's living area, you should never use liquid fabric softeners when you're washing the bedding. However, you can add vinegar or a bacteria eliminator to the wash to fight odors, if you'd like. Tumble dry or air dry the fleece. Once the fleece is washed, either place it in the dryer on low heat or hang it up to air dry. To prevent your pet's cage from getting too damp and possibly developing mold or mildew, make sure the fleece bedding is completely dry before you put it back into the cage. Don't dry your fleece on high heat. If you do, it might shrink, and it may not properly cover the bottom of your cage. Tip: It can take a while for fleece to dry. To get your pet back in its cage as quickly as possible, it can be helpful to have a second piece of fleece that you can put in the cage after you finish cleaning. Then, you can wash the dirty fleece, dry it, and put it away to use the next time you clean the cage. Place the fleece in the cage on top of an absorbent material. Fleece will wick moisture away, but if you don't have anything absorbent in the bottom of the cage, the fleece will just stay wet. To avoid this, place something like an old towel or layers of newspaper in the bottom of the cage, then place the fleece on top of that. Change or clean this absorbent layer each time you clean the fleece. Since newspapers will get soggy when they're wet, a towel is typically easier to clean. Set the cage back up and place your pet back inside. After you've cleaned all of the components and replaced the fleece, you can start adding everything back to your pet's cage. Once everything is set up, carefully transfer your pet back to their clean, fresh cage! Don't forget to refill your pet's food and water before you put it back in the cage.",
    "sentences": [
        " Cleaning the Cage Sweep away feces on a daily basis to keep the cage clean.",
        "With some types of bedding, feces will get sifted below the top layer, so you only have to clean it every few days.",
        "With fleece bedding, however, any debris will stay right on the surface, so you'll need to be committed to cleaning the cage every day.",
        "You can either pick up feces and spilled food by hand, or you can keep a small brush and dustpan near the cage, and simply sweep away the debris.",
        "Do this at least once every day.",
        "Clean the cage completely at least once a week.",
        "Fleece will wick away urine and other moisture, but it holds that moisture at the bottom of the cage.",
        "To keep your pet healthy and happy, you'll need to take everything out of the cage once a week, including the bedding, and wash it all thoroughly.",
        "As with any bedding, failure to clean the cage at least once a week can lead to a dangerous buildup of ammonia that can make your pets very sick.",
        "Remove your pet and put it in a holding cage.",
        "It will be very difficult, if not impossible, to clean your cage while your pet is present.",
        "It's best to have a separate holding cage where they'll feel safe and secure.",
        "This can be the carrying  cage you brought your pet home in, a small, ventilated box with a secure lid, or even an empty bathtub, as long as the drain is completely covered.",
        "Place fresh food and water and toys in the holding cage so your pet doesn't get too stressed out.",
        "Also, make sure the cage has a secure lid so they can't escape.",
        "Take everything else out of the cage once your pet is secured.",
        "After you've moved your pet to the holding cage, remove the animal's food and water dishes, any toys, houses, or exercise equipment, and the fleece.",
        "In order to ensure the cage is fully cleaned, you'll need to wash each element separately.",
        "It can be a good idea to put different toys in the cage each time you clean it.",
        "That way, your pet will always have something interesting to come back to.",
        "Then, the next time you clean the cage, you can just add the toys you replaced last time.",
        "Remove the fleece and either vacuum it or shake it out.",
        "Since hay, food, and feces can all cling to the surface of the fleece, it's best to make sure you remove any large debris that might clog up your washing machine.",
        "You can take the fleece outside and shake it off thoroughly, or you can use the hose attachment on your vacuum cleaner to suck away dirt and debris.",
        "For a deeper clean, shake the fleece off outside, then vacuum it.",
        "Wipe down the bottom of the cage with a washcloth or baby wipe.",
        "After you've taken everything out of the cage, wipe the cage down thoroughly with a wet cloth or a baby wipe.",
        "This will help keep ammonia from building up in the cage if urine soaked all the way through the fleece.",
        "Allow the cage to dry completely before you put anything back into the cage to prevent mold and mildew from growing.",
        "Avoid using harsh cleaners like bleach, even if you dilute it first.",
        "It can be hard to ensure you completely remove any chemical residue that might make your pets sick.",
        "Tip: For an all-natural, deeper clean, try wiping down your cage with vinegar.",
        "Wash any food bowls, toys, or other decorations with hot, soapy water.",
        "It won't do any good to put dirty items back into a clean cage.",
        "Use mild dish soap and hot water to wash the pet's food bowl, toys, hiding spots, exercise wheels, or anything else that goes into the cage, then rinse them thoroughly and let them air-dry.",
        "Make sure the items are completely dry before you put them back into the cage.",
        "Most small pets thrive in a low-moisture environment.",
        "Washing the Fleece Wash the fleece in hot water with unscented detergent.",
        "Cleaning fleece bedding is as simple as placing it in your washing machine on a hot cycle.",
        "Use unscented detergent to protect the fleece's wicking ability, and run the cycle as you normally would.",
        "To ensure the fleece gets completely clean, it's best to use a small load, rather than overcrowding the washing machine.",
        "If you'd prefer, you can also wash the fleece by hand in hot water.",
        "Do not use liquid fabric softener when you're washing the fleece.",
        "Liquid fabric softener can leave a film on fabrics that can affect its ability to repel moisture.",
        "Since it's essential that fleece bedding can wick away urine from your pet's living area, you should never use liquid fabric softeners when you're washing the bedding.",
        "However, you can add vinegar or a bacteria eliminator to the wash to fight odors, if you'd like.",
        "Tumble dry or air dry the fleece.",
        "Once the fleece is washed, either place it in the dryer on low heat or hang it up to air dry.",
        "To prevent your pet's cage from getting too damp and possibly developing mold or mildew, make sure the fleece bedding is completely dry before you put it back into the cage.",
        "Don't dry your fleece on high heat.",
        "If you do, it might shrink, and it may not properly cover the bottom of your cage.",
        "Tip: It can take a while for fleece to dry.",
        "To get your pet back in its cage as quickly as possible, it can be helpful to have a second piece of fleece that you can put in the cage after you finish cleaning.",
        "Then, you can wash the dirty fleece, dry it, and put it away to use the next time you clean the cage.",
        "Place the fleece in the cage on top of an absorbent material.",
        "Fleece will wick moisture away, but if you don't have anything absorbent in the bottom of the cage, the fleece will just stay wet.",
        "To avoid this, place something like an old towel or layers of newspaper in the bottom of the cage, then place the fleece on top of that.",
        "Change or clean this absorbent layer each time you clean the fleece.",
        "Since newspapers will get soggy when they're wet, a towel is typically easier to clean.",
        "Set the cage back up and place your pet back inside.",
        "After you've cleaned all of the components and replaced the fleece, you can start adding everything back to your pet's cage.",
        "Once everything is set up, carefully transfer your pet back to their clean, fresh cage!",
        "Don't forget to refill your pet's food and water before you put it back in the cage."
    ]
}