{
    "title": "How to Crochet a Star",
    "url": "https://www.wikihow.com/Crochet-a-Star",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Knitting and Crochet",
        "Crochet",
        "Crochet Stitches",
        "Crochet Shapes"
    ],
    "methods": [
        {
            "name": "Crocheting the First Round Around a Magic Ring",
            "steps": [
                {
                    "headline": "Make a double loop around your finger to begin the magic ring.",
                    "description": "A magic ring or magic circle is a basic adjustable loop of yarn that will serve as the central starting point for your star. To create one, form a double loop of yarn around the index finger on your non-dominant hand."
                },
                {
                    "headline": "Pull 1 of these loops under the other with your crochet hook.",
                    "description": "Using your dominant hand, insert the crochet hook under both loops on your index finger. Catch the working end of the yarn and pull it through to the front, going under the loop that’s been formed by the tail end of your yarn. Once you’ve completed this motion, your crochet hook will be sandwiched between the working yarn (above) and the tail end (below)."
                },
                {
                    "headline": "With the loop still around your finger, crochet 2 chain stitches.",
                    "description": "To create the first chain stitch, catch the working yarn with your hook and pull it through the single loop that’s on your hook. Repeat this process 1 more time until you have 2 complete chain stitches. You may need to pinch the loop of yarn with your thumb so it stays securely on your index finger. Note that these stitches don’t count as part of your first round of stitches, but serve as an important basis to start building your star around."
                },
                {
                    "headline": "Make 1 double crochet stitch to begin your first round.",
                    "description": "To make a double crochet stitch around the magic ring, catch the yarn with the hook and push the hook back into the ring. Catch the yarn with the hook again and pull it back through the ring. You should now have 3 loops on your crochet hook. Catch the yarn with the hook once again and pull this yarn through the first 2 loops on the crochet hook. Now, you will have 2 loops left on your crochet hook. To finish the double crochet, catch the yarn 1 more time and pull it back through both loops on your hook. You should be left with a single loop on your hook after you’ve finished a double crochet stitch. You can slide the loop off of your index finger. Hold it in your non-dominant hand while you work the double crochet stitch."
                },
                {
                    "headline": "Complete the first round by adding 9 more double crochet stitches.",
                    "description": "Continue adding double crochet stitches around the magic ring until you have 10 total. Go back and count to confirm that you have 10, since you’ll need exactly this many to make 5 star points. This completes your first round! When counting, don’t include the first 2 chain stitches you created earlier. Pull the tail end to close up the hole of the magic ring. If you prefer that your star has a hole in the middle, leave the magic ring open slightly."
                },
                {
                    "headline": "Connect the circle of double crochet stitches with a slip stitch.",
                    "description": "To make the slip stitch, push the hook into the top of the second chain stitch you created at the beginning. Hook the yarn and pull it back through the top of the chain stitch. You will now have 2 loops left on your hook. Pull the outside loop through the inside loop so that you’re left with 1 loop on your hook. The central foundation of your crocheted star is now complete and you’re ready to start working star points around it!"
                }
            ]
        },
        {
            "name": "Making a 5-Pointed Star",
            "steps": [
                {
                    "headline": "Work 10 double crochet stitches around a magic ring.",
                    "description": "To summarize this process, start with a magic ring (a double-loop of yarn wrapped around your index finger). Then make 2 chain stitches. Slide the loop off of your finger and complete 10 double crochet stitches around the ring. Then, close up the circle of double crochet stitches with a single slip stitch. This completes your first round."
                },
                {
                    "headline": "Begin the first star point with 2 chain stitches and 1 double crochet stitch.",
                    "description": "The star points will make up the second (and final) round for this project. Once you’ve completed your first round, make 2 chain stitches. Wrap the yarn around your hook once to begin a new double crochet stitch. To begin the double crochet stitch, insert the hook into both loops of the next stitch from the first round. Then, finish this double crochet stitch. The next stitch from the first round will be the first double crochet stitch you created."
                },
                {
                    "headline": "Continue the first star point with 3 chain stitches and 2 single crochet stitches.",
                    "description": "Make another 3 chain stitches. Then work 2 single crochet stitches around the vertical post of the previous double crochet stitch. This completes the first single crochet stitch; repeat this process so you have 2. When you’re working a single crochet stitch around the post of the previous stitch, push the hook into the gap of the double crochet stitch and catch the working yarn. You’ll have 2 loops on your hook. Catch the yarn again and pull it through both loops and you’ll be left with 1 loop on your hook. Once this is complete, you’ll be able to see that the single crochet stitches are wrapped around the vertical part of the double crochet stitch."
                },
                {
                    "headline": "Complete the first star point with a slip stitch.",
                    "description": "You should work this slip stitch into the next stitch from the first round. This completes the first start point! If you’re using a thin yarn, your star points will have an open texture. This can look very pretty and delicate. If you’re using thicker yarn, the star may be more closed-textured. Experiment with different yarns to see which look you like best."
                },
                {
                    "headline": "Repeat this stitch sequence to form 4 more star points (for 5 total).",
                    "description": "Form 4 more points using the same technique you used for the first point. To summarize the process, for each star point you’ll start by crocheting 2 chain stitches. In the next stitch, double crochet once. Make another 3 chain stitches. Work 2 single stitches around the post of the double crochet stitch. Slip stitch into the next stitch to complete each point."
                },
                {
                    "headline": "Finish the fifth star point by making a slip stitch.",
                    "description": "Work this slip stitch into the first stitch of your original round. This will anchor the final star point and will finalize the second (and final) round of stitches."
                },
                {
                    "headline": "Cut and secure the working yarn.",
                    "description": "At this stage, you will have 1 loop remaining on your crochet hook. Cut the working yarn and pull the loose end through that last loop. Pull it tightly to secure it."
                },
                {
                    "headline": "Weave in the loose ends of the yarn into the star with a darning needle.",
                    "description": "Use a darning needle to tuck both loose ends of the yarn over and under the stitches on the back side of the star. Trim both tails short to hide them from sight. With this, your star should be finished!"
                }
            ]
        },
        {
            "name": "Modifying the Star Pattern to Add More Points or Colors",
            "steps": [
                {
                    "headline": "Make a 6-pointed star by starting with 12 double crochet stitches.",
                    "description": "To create a 6-pointed star, you’ll follow the same instructions for the 5-pointed star. The only difference is that you’ll begin by working 12 double crochet stitches around the magic ring instead of 10. Then, when it’s time to make the star points, continue to create 6 points instead of 5. The key to this pattern is that you should have twice as many double crochet stitches forming the first round as the number of star points you want to create in the second round. If you’d like to try a 7-pointed star, begin with 14 double crochet stitches. For an 8-pointed star, start with 16 double crochet stitches."
                },
                {
                    "headline": "Use 1 color for the center and another color for the star points.",
                    "description": "Once you’ve decided which will be your main color and your secondary color, work the entire first round with the main color. Before making the first star point, cut the working end of your main color yarn and leave it loose. Catch the secondary color for the first stitch of the second round and use this for all of the star points. The first round is the series of 10 or more double chain stitches worked around a magic ring. Weave all the loose ends into the star with a darning needle when you’re finished."
                },
                {
                    "headline": "Work the star points in alternating or unique colors.",
                    "description": "To alternate the colors of each star point, change the color yarn after completing the slip stitch on the previous star point. Cut the main color yarn with a tail remaining. Bring the secondary color yarn onto your hook. Then catch the secondary color yarn when you create the first chain stitch of the next star point. Complete the rest of that star point and change the yarn again. When you’re finished crocheting all of the star points, use a darning needle to weave in all the loose ends. Trim away any remaining tails from your project\nFeel free to do alternating colors or use unique colors for each star point. Alternating colors look best on stars with an even number of points, such as a 6-pointed star. With an odd number of points, the same color will be repeated twice in a row. For example, you could work your star points to be blue-purple-blue-purple-blue-purple."
                }
            ]
        }
    ],
    "tyn": [
        "Yarn",
        "Crochet hook",
        "Darning needle",
        "Snips or scissors"
    ],
    "text": " Crocheting the First Round Around a Magic Ring Make a double loop around your finger to begin the magic ring. A magic ring or magic circle is a basic adjustable loop of yarn that will serve as the central starting point for your star. To create one, form a double loop of yarn around the index finger on your non-dominant hand. Pull 1 of these loops under the other with your crochet hook. Using your dominant hand, insert the crochet hook under both loops on your index finger. Catch the working end of the yarn and pull it through to the front, going under the loop that’s been formed by the tail end of your yarn. Once you’ve completed this motion, your crochet hook will be sandwiched between the working yarn (above) and the tail end (below). With the loop still around your finger, crochet 2 chain stitches. To create the first chain stitch, catch the working yarn with your hook and pull it through the single loop that’s on your hook. Repeat this process 1 more time until you have 2 complete chain stitches. You may need to pinch the loop of yarn with your thumb so it stays securely on your index finger. Note that these stitches don’t count as part of your first round of stitches, but serve as an important basis to start building your star around. Make 1 double crochet stitch to begin your first round. To make a double crochet stitch around the magic ring, catch the yarn with the hook and push the hook back into the ring. Catch the yarn with the hook again and pull it back through the ring. You should now have 3 loops on your crochet hook. Catch the yarn with the hook once again and pull this yarn through the first 2 loops on the crochet hook. Now, you will have 2 loops left on your crochet hook. To finish the double crochet, catch the yarn 1 more time and pull it back through both loops on your hook. You should be left with a single loop on your hook after you’ve finished a double crochet stitch. You can slide the loop off of your index finger. Hold it in your non-dominant hand while you work the double crochet stitch. Complete the first round by adding 9 more double crochet stitches. Continue adding double crochet stitches around the magic ring until you have 10 total. Go back and count to confirm that you have 10, since you’ll need exactly this many to make 5 star points. This completes your first round! When counting, don’t include the first 2 chain stitches you created earlier. Pull the tail end to close up the hole of the magic ring. If you prefer that your star has a hole in the middle, leave the magic ring open slightly. Connect the circle of double crochet stitches with a slip stitch. To make the slip stitch, push the hook into the top of the second chain stitch you created at the beginning. Hook the yarn and pull it back through the top of the chain stitch. You will now have 2 loops left on your hook. Pull the outside loop through the inside loop so that you’re left with 1 loop on your hook. The central foundation of your crocheted star is now complete and you’re ready to start working star points around it! Making a 5-Pointed Star Work 10 double crochet stitches around a magic ring. To summarize this process, start with a magic ring (a double-loop of yarn wrapped around your index finger). Then make 2 chain stitches. Slide the loop off of your finger and complete 10 double crochet stitches around the ring. Then, close up the circle of double crochet stitches with a single slip stitch. This completes your first round. Begin the first star point with 2 chain stitches and 1 double crochet stitch. The star points will make up the second (and final) round for this project. Once you’ve completed your first round, make 2 chain stitches. Wrap the yarn around your hook once to begin a new double crochet stitch. To begin the double crochet stitch, insert the hook into both loops of the next stitch from the first round. Then, finish this double crochet stitch. The next stitch from the first round will be the first double crochet stitch you created. Continue the first star point with 3 chain stitches and 2 single crochet stitches. Make another 3 chain stitches. Then work 2 single crochet stitches around the vertical post of the previous double crochet stitch. This completes the first single crochet stitch; repeat this process so you have 2. When you’re working a single crochet stitch around the post of the previous stitch, push the hook into the gap of the double crochet stitch and catch the working yarn. You’ll have 2 loops on your hook. Catch the yarn again and pull it through both loops and you’ll be left with 1 loop on your hook. Once this is complete, you’ll be able to see that the single crochet stitches are wrapped around the vertical part of the double crochet stitch. Complete the first star point with a slip stitch. You should work this slip stitch into the next stitch from the first round. This completes the first start point! If you’re using a thin yarn, your star points will have an open texture. This can look very pretty and delicate. If you’re using thicker yarn, the star may be more closed-textured. Experiment with different yarns to see which look you like best. Repeat this stitch sequence to form 4 more star points (for 5 total). Form 4 more points using the same technique you used for the first point. To summarize the process, for each star point you’ll start by crocheting 2 chain stitches. In the next stitch, double crochet once. Make another 3 chain stitches. Work 2 single stitches around the post of the double crochet stitch. Slip stitch into the next stitch to complete each point. Finish the fifth star point by making a slip stitch. Work this slip stitch into the first stitch of your original round. This will anchor the final star point and will finalize the second (and final) round of stitches. Cut and secure the working yarn. At this stage, you will have 1 loop remaining on your crochet hook. Cut the working yarn and pull the loose end through that last loop. Pull it tightly to secure it. Weave in the loose ends of the yarn into the star with a darning needle. Use a darning needle to tuck both loose ends of the yarn over and under the stitches on the back side of the star. Trim both tails short to hide them from sight. With this, your star should be finished! Modifying the Star Pattern to Add More Points or Colors Make a 6-pointed star by starting with 12 double crochet stitches. To create a 6-pointed star, you’ll follow the same instructions for the 5-pointed star. The only difference is that you’ll begin by working 12 double crochet stitches around the magic ring instead of 10. Then, when it’s time to make the star points, continue to create 6 points instead of 5. The key to this pattern is that you should have twice as many double crochet stitches forming the first round as the number of star points you want to create in the second round. If you’d like to try a 7-pointed star, begin with 14 double crochet stitches. For an 8-pointed star, start with 16 double crochet stitches. Use 1 color for the center and another color for the star points. Once you’ve decided which will be your main color and your secondary color, work the entire first round with the main color. Before making the first star point, cut the working end of your main color yarn and leave it loose. Catch the secondary color for the first stitch of the second round and use this for all of the star points. The first round is the series of 10 or more double chain stitches worked around a magic ring. Weave all the loose ends into the star with a darning needle when you’re finished. Work the star points in alternating or unique colors. To alternate the colors of each star point, change the color yarn after completing the slip stitch on the previous star point. Cut the main color yarn with a tail remaining. Bring the secondary color yarn onto your hook. Then catch the secondary color yarn when you create the first chain stitch of the next star point. Complete the rest of that star point and change the yarn again. When you’re finished crocheting all of the star points, use a darning needle to weave in all the loose ends. Trim away any remaining tails from your project\nFeel free to do alternating colors or use unique colors for each star point. Alternating colors look best on stars with an even number of points, such as a 6-pointed star. With an odd number of points, the same color will be repeated twice in a row. For example, you could work your star points to be blue-purple-blue-purple-blue-purple.",
    "sentences": [
        " Crocheting the First Round Around a Magic Ring Make a double loop around your finger to begin the magic ring.",
        "A magic ring or magic circle is a basic adjustable loop of yarn that will serve as the central starting point for your star.",
        "To create one, form a double loop of yarn around the index finger on your non-dominant hand.",
        "Pull 1 of these loops under the other with your crochet hook.",
        "Using your dominant hand, insert the crochet hook under both loops on your index finger.",
        "Catch the working end of the yarn and pull it through to the front, going under the loop that’s been formed by the tail end of your yarn.",
        "Once you’ve completed this motion, your crochet hook will be sandwiched between the working yarn (above) and the tail end (below).",
        "With the loop still around your finger, crochet 2 chain stitches.",
        "To create the first chain stitch, catch the working yarn with your hook and pull it through the single loop that’s on your hook.",
        "Repeat this process 1 more time until you have 2 complete chain stitches.",
        "You may need to pinch the loop of yarn with your thumb so it stays securely on your index finger.",
        "Note that these stitches don’t count as part of your first round of stitches, but serve as an important basis to start building your star around.",
        "Make 1 double crochet stitch to begin your first round.",
        "To make a double crochet stitch around the magic ring, catch the yarn with the hook and push the hook back into the ring.",
        "Catch the yarn with the hook again and pull it back through the ring.",
        "You should now have 3 loops on your crochet hook.",
        "Catch the yarn with the hook once again and pull this yarn through the first 2 loops on the crochet hook.",
        "Now, you will have 2 loops left on your crochet hook.",
        "To finish the double crochet, catch the yarn 1 more time and pull it back through both loops on your hook.",
        "You should be left with a single loop on your hook after you’ve finished a double crochet stitch.",
        "You can slide the loop off of your index finger.",
        "Hold it in your non-dominant hand while you work the double crochet stitch.",
        "Complete the first round by adding 9 more double crochet stitches.",
        "Continue adding double crochet stitches around the magic ring until you have 10 total.",
        "Go back and count to confirm that you have 10, since you’ll need exactly this many to make 5 star points.",
        "This completes your first round!",
        "When counting, don’t include the first 2 chain stitches you created earlier.",
        "Pull the tail end to close up the hole of the magic ring.",
        "If you prefer that your star has a hole in the middle, leave the magic ring open slightly.",
        "Connect the circle of double crochet stitches with a slip stitch.",
        "To make the slip stitch, push the hook into the top of the second chain stitch you created at the beginning.",
        "Hook the yarn and pull it back through the top of the chain stitch.",
        "You will now have 2 loops left on your hook.",
        "Pull the outside loop through the inside loop so that you’re left with 1 loop on your hook.",
        "The central foundation of your crocheted star is now complete and you’re ready to start working star points around it!",
        "Making a 5-Pointed Star Work 10 double crochet stitches around a magic ring.",
        "To summarize this process, start with a magic ring (a double-loop of yarn wrapped around your index finger).",
        "Then make 2 chain stitches.",
        "Slide the loop off of your finger and complete 10 double crochet stitches around the ring.",
        "Then, close up the circle of double crochet stitches with a single slip stitch.",
        "This completes your first round.",
        "Begin the first star point with 2 chain stitches and 1 double crochet stitch.",
        "The star points will make up the second (and final) round for this project.",
        "Once you’ve completed your first round, make 2 chain stitches.",
        "Wrap the yarn around your hook once to begin a new double crochet stitch.",
        "To begin the double crochet stitch, insert the hook into both loops of the next stitch from the first round.",
        "Then, finish this double crochet stitch.",
        "The next stitch from the first round will be the first double crochet stitch you created.",
        "Continue the first star point with 3 chain stitches and 2 single crochet stitches.",
        "Make another 3 chain stitches.",
        "Then work 2 single crochet stitches around the vertical post of the previous double crochet stitch.",
        "This completes the first single crochet stitch; repeat this process so you have 2.",
        "When you’re working a single crochet stitch around the post of the previous stitch, push the hook into the gap of the double crochet stitch and catch the working yarn.",
        "You’ll have 2 loops on your hook.",
        "Catch the yarn again and pull it through both loops and you’ll be left with 1 loop on your hook.",
        "Once this is complete, you’ll be able to see that the single crochet stitches are wrapped around the vertical part of the double crochet stitch.",
        "Complete the first star point with a slip stitch.",
        "You should work this slip stitch into the next stitch from the first round.",
        "This completes the first start point!",
        "If you’re using a thin yarn, your star points will have an open texture.",
        "This can look very pretty and delicate.",
        "If you’re using thicker yarn, the star may be more closed-textured.",
        "Experiment with different yarns to see which look you like best.",
        "Repeat this stitch sequence to form 4 more star points (for 5 total).",
        "Form 4 more points using the same technique you used for the first point.",
        "To summarize the process, for each star point you’ll start by crocheting 2 chain stitches.",
        "In the next stitch, double crochet once.",
        "Make another 3 chain stitches.",
        "Work 2 single stitches around the post of the double crochet stitch.",
        "Slip stitch into the next stitch to complete each point.",
        "Finish the fifth star point by making a slip stitch.",
        "Work this slip stitch into the first stitch of your original round.",
        "This will anchor the final star point and will finalize the second (and final) round of stitches.",
        "Cut and secure the working yarn.",
        "At this stage, you will have 1 loop remaining on your crochet hook.",
        "Cut the working yarn and pull the loose end through that last loop.",
        "Pull it tightly to secure it.",
        "Weave in the loose ends of the yarn into the star with a darning needle.",
        "Use a darning needle to tuck both loose ends of the yarn over and under the stitches on the back side of the star.",
        "Trim both tails short to hide them from sight.",
        "With this, your star should be finished!",
        "Modifying the Star Pattern to Add More Points or Colors Make a 6-pointed star by starting with 12 double crochet stitches.",
        "To create a 6-pointed star, you’ll follow the same instructions for the 5-pointed star.",
        "The only difference is that you’ll begin by working 12 double crochet stitches around the magic ring instead of 10.",
        "Then, when it’s time to make the star points, continue to create 6 points instead of 5.",
        "The key to this pattern is that you should have twice as many double crochet stitches forming the first round as the number of star points you want to create in the second round.",
        "If you’d like to try a 7-pointed star, begin with 14 double crochet stitches.",
        "For an 8-pointed star, start with 16 double crochet stitches.",
        "Use 1 color for the center and another color for the star points.",
        "Once you’ve decided which will be your main color and your secondary color, work the entire first round with the main color.",
        "Before making the first star point, cut the working end of your main color yarn and leave it loose.",
        "Catch the secondary color for the first stitch of the second round and use this for all of the star points.",
        "The first round is the series of 10 or more double chain stitches worked around a magic ring.",
        "Weave all the loose ends into the star with a darning needle when you’re finished.",
        "Work the star points in alternating or unique colors.",
        "To alternate the colors of each star point, change the color yarn after completing the slip stitch on the previous star point.",
        "Cut the main color yarn with a tail remaining.",
        "Bring the secondary color yarn onto your hook.",
        "Then catch the secondary color yarn when you create the first chain stitch of the next star point.",
        "Complete the rest of that star point and change the yarn again.",
        "When you’re finished crocheting all of the star points, use a darning needle to weave in all the loose ends.",
        "Trim away any remaining tails from your project\nFeel free to do alternating colors or use unique colors for each star point.",
        "Alternating colors look best on stars with an even number of points, such as a 6-pointed star.",
        "With an odd number of points, the same color will be repeated twice in a row.",
        "For example, you could work your star points to be blue-purple-blue-purple-blue-purple."
    ]
}