{
    "title": "How to Freeze Cilantro",
    "url": "https://www.wikihow.com/Freeze-Cilantro",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Food Preservation Techniques",
        "Freezing Food"
    ],
    "methods": [
        {
            "name": "Preparing Cilantro for Freezing",
            "steps": [
                {
                    "headline": "Choose fresh cilantro.",
                    "description": "Cilantro will wilt a little when you freeze it, so it is important to buy cilantro that is fresh. Look for crisp, bright green leaves. Avoid anything that looks wilted, crushed, or yellowed."
                },
                {
                    "headline": "Rinse the cilantro in a bowl of water.",
                    "description": "Hold the cilantro by the stems and swish it in a bowl of cool water. Keep doing this until the water becomes dirty. Repeat the process with fresh water each time until the water is clear. You may need to two to three water changes"
                },
                {
                    "headline": "Shake the water off the cilantro.",
                    "description": "Hold it by the stems, and give it a few, good shakes. It might be a good idea to do this over a sink, so that your kitchen does not become all wet."
                },
                {
                    "headline": "Pat the cilantro dry with a few paper towels.",
                    "description": "Place a few paper towels down on a flat surface, then set the cilantro down on top of them. Cover the cilantro with another paper towel and gently press down on it. The paper towels will absorb any excess moisture. Keep doing this with fresh, dry paper towels until there is no water left."
                },
                {
                    "headline": "Consider blanching the cilantro.",
                    "description": "You can do this by dipping the cilantro into a pot of boiling water for 15 to 30 seconds, then dunking them under ice cold water for a few more seconds. Do not leave the cilantro in the hot water for more than 30 seconds, and be sure to dry it off well. Blanching the cilantro will help preserve the vibrant color."
                }
            ]
        },
        {
            "name": "Freezing Cilantro in a Bag",
            "steps": [
                {
                    "headline": "Decide if you want to freeze the cilantro whole, or just freeze the leaves.",
                    "description": "If you want to freeze just the leaves, you will need to pinch them off, and discard the stems. You can also freeze the cilantro whole, and break off a few leaves whenever you need them."
                },
                {
                    "headline": "Consider tossing the cilantro with some olive oil.",
                    "description": "This will protect the delicate herb from the cold and keep it from going mushy. Simply place the herb into a bowl and toss it with a teaspoon to a tablespoon of olive oil. How much olive oil you use will depend on how much cilantro you are freezing; the more cilantro you have, the more oil you will need."
                },
                {
                    "headline": "Place the cilantro into a re-sealable freezer bag.",
                    "description": "Try to keep the cilantro spread out evenly in the bag. If you are using whole cilantro, try to keep the stems and leaves as straight as possible. You may need to use more than one bag. If you do not have any freezer bags, use regular re-sealable bags instead, one inside the other."
                },
                {
                    "headline": "Squeeze out as much air as possible before sealing the bag.",
                    "description": "Zip the bag close part way, then gently press down on the bag with your hands until it is flat. Close the bag the rest of the way. Be careful not to crush the cilantro."
                },
                {
                    "headline": "Use a permanent marker to write the date on the bag.",
                    "description": "If you are storing other types of herbs in the freezer, it might be a good idea to write down \"Cilantro\" on the bag as well."
                },
                {
                    "headline": "Place the bagged cilantro into the freezer.",
                    "description": "Try to place it so that the herbs are laying down flat and straight."
                }
            ]
        },
        {
            "name": "Freezing Cilantro in Oil",
            "steps": [
                {
                    "headline": "Chop the cilantro up coarsely.",
                    "description": "Lay the cilantro down on a cutting board and chop it up into inch (2.54 centimeter) long pieces. You can include the stems, or leave them out. This does not have to look neat, as you will be chopping the cilantro up further in a blender."
                },
                {
                    "headline": "Put the cilantro into a blender.",
                    "description": "If you do not have a blender, you can use a food processor instead."
                },
                {
                    "headline": "Pour 1/3 cup (80 milliliters) of olive oil per cup (50 grams) of chopped cilantro.",
                    "description": "If you want a more intense cilantro flavor, increase the cilantro to 2 cups (100 grams). Also, if the strong flavor of olive oil bothers you, try using another cooking oil, such as canola or vegetable."
                },
                {
                    "headline": "Turn the blender on and pulse for a few seconds.",
                    "description": "Make sure that the lid is secure and that there are no leaks. Keep blending until the oil turns green and the cilantro has broken up into smaller pieces. Do not blend it for too long; you still want to see bits of the herb."
                },
                {
                    "headline": "Spoon the puree into an ice cube tray.",
                    "description": "Fill each well about 3/4 of the way. Do not fill it all the way; the puree will expand when it freezes."
                },
                {
                    "headline": "Transfer the tray to the freezer.",
                    "description": "Set it down on a flat, stable surface. Leave it there for a few hours to overnight."
                },
                {
                    "headline": "Transfer the frozen cubes to a re-sealable freezer bag.",
                    "description": "This way, you will be able to reuse your ice cube tray. If you do not have any freezer bags, use two regular bags instead, one inside the other."
                },
                {
                    "headline": "Write the date on the bag using a permanent marker.",
                    "description": "If you are storing other kinds of herbs in the freezer as well, consider writing \"Cilantro\" on the bag as well."
                }
            ]
        },
        {
            "name": "Freezing Cilantro in Butter",
            "steps": [
                {
                    "headline": "Chop op some cilantro and toss it into a bowl.",
                    "description": "You will need about 1 to 3 tablespoons of chopped cilantro per stick of butter."
                },
                {
                    "headline": "Add in one stick softened, room temperature butter.",
                    "description": "It might help to cut the butter into smaller pieces."
                },
                {
                    "headline": "Consider adding in a few other ingredients.",
                    "description": "You can leave the cilantro butter as is, or you can add in a few other ingredients to make even tastier. Here are some ideas to get you started:\n1 clove garlic, minced\nSalt and pepper, to taste\n½ tablespoon of lime juice\nLime zest"
                },
                {
                    "headline": "Mix everything together until the cilantro is spread evenly throughout.",
                    "description": "You can use a spoon or spatula. Work quickly, so that the butter does not melt. Add more butter or cilantro if necessary."
                },
                {
                    "headline": "Roll the butter in some parchment paper or foil.",
                    "description": "Scoop the butter onto a sheet of parchment paper, making sure that it is close to the edge. Shape it into a rough log shape with a spoon or spatula. Roll it up in the parchment paper."
                },
                {
                    "headline": "Put the wrapped up butter into the refrigerator.",
                    "description": "Place the butter seam-side-down on a plate, and leave the place in the fridge until it hardens."
                },
                {
                    "headline": "Once it hardens, move the butter to the freezer.",
                    "description": "To keep your freezer clean, keep the butter wrapped in parchment paper, and put it into a re-sealable freezer bag or a plastic container."
                },
                {
                    "headline": "Be sure to write the date on the container or bag.",
                    "description": "This will help you remember when you made it, so that you can use it before it goes bad."
                }
            ]
        },
        {
            "name": "Using Frozen Cilantro",
            "steps": [
                {
                    "headline": "Use frozen cilantro in cilantro chutney or as a guacamole starter.",
                    "description": "If you froze cilantro just on its own, without any butter or oil, you can break off a few leaves, and add it to guacamole or cilantro chutney. You do not need to defrost it."
                },
                {
                    "headline": "Use cilantro frozen in oil to season soups, sauces, and other cooked dishes.",
                    "description": "You can also use it in salad dressings. Because it already contains oil, you will need to adjust your recipe and use less oil. A single cube of frozen cilantro will contain about a tablespoon of oil."
                },
                {
                    "headline": "Thaw frozen cilantro butter to room temperature before using it.",
                    "description": "It will take about 15 to 20 minutes for it to thaw. Once it thaws, you can spread it on bread or crackers."
                },
                {
                    "headline": "Avoid using frozen cilantro in salads and salsas.",
                    "description": "Once frozen, cilantro loses some of its crispness. When it becomes defrosted, it will appear wilted and mushy. This may detract from the appearance (and texture) of salsa and salad."
                },
                {
                    "headline": "Consider using fresh cilantro as garnish instead of frozen.",
                    "description": "Once frozen cilantro starts to thaw, it will begin to look wilted and mushy. If you need to garnish something, consider using fresh cilantro instead."
                },
                {
                    "headline": "Know by when to use your frozen cilantro.",
                    "description": "Frozen cilantro won't last forever, although it will certainly last longer than fresh cilantro. Here are some guidelines as to by when you should use your cilantro:\nUse frozen cilantro within two months. Use cilantro frozen in oil within three months. Use frozen cilantro butter within a month. If you thaw it and put it in the fridge, use it within five days."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Freezing Cilantro in a Bag",
        "Re-sealable freezer bag",
        "Freezing Cilantro in Oil",
        "Blender",
        "Ice cube trays",
        "Re-sealable freezer bag.",
        "Freezing Cilantro in Butter",
        "[12]",
        "X",
        "Research source",
        "Bow",
        "Spoon or spatula",
        "Parchment paper or foil",
        "Re-sealable freezer bag or plastic container (recommended)"
    ],
    "text": " Preparing Cilantro for Freezing Choose fresh cilantro. Cilantro will wilt a little when you freeze it, so it is important to buy cilantro that is fresh. Look for crisp, bright green leaves. Avoid anything that looks wilted, crushed, or yellowed. Rinse the cilantro in a bowl of water. Hold the cilantro by the stems and swish it in a bowl of cool water. Keep doing this until the water becomes dirty. Repeat the process with fresh water each time until the water is clear. You may need to two to three water changes Shake the water off the cilantro. Hold it by the stems, and give it a few, good shakes. It might be a good idea to do this over a sink, so that your kitchen does not become all wet. Pat the cilantro dry with a few paper towels. Place a few paper towels down on a flat surface, then set the cilantro down on top of them. Cover the cilantro with another paper towel and gently press down on it. The paper towels will absorb any excess moisture. Keep doing this with fresh, dry paper towels until there is no water left. Consider blanching the cilantro. You can do this by dipping the cilantro into a pot of boiling water for 15 to 30 seconds, then dunking them under ice cold water for a few more seconds. Do not leave the cilantro in the hot water for more than 30 seconds, and be sure to dry it off well. Blanching the cilantro will help preserve the vibrant color. Freezing Cilantro in a Bag Decide if you want to freeze the cilantro whole, or just freeze the leaves. If you want to freeze just the leaves, you will need to pinch them off, and discard the stems. You can also freeze the cilantro whole, and break off a few leaves whenever you need them. Consider tossing the cilantro with some olive oil. This will protect the delicate herb from the cold and keep it from going mushy. Simply place the herb into a bowl and toss it with a teaspoon to a tablespoon of olive oil. How much olive oil you use will depend on how much cilantro you are freezing; the more cilantro you have, the more oil you will need. Place the cilantro into a re-sealable freezer bag. Try to keep the cilantro spread out evenly in the bag. If you are using whole cilantro, try to keep the stems and leaves as straight as possible. You may need to use more than one bag. If you do not have any freezer bags, use regular re-sealable bags instead, one inside the other. Squeeze out as much air as possible before sealing the bag. Zip the bag close part way, then gently press down on the bag with your hands until it is flat. Close the bag the rest of the way. Be careful not to crush the cilantro. Use a permanent marker to write the date on the bag. If you are storing other types of herbs in the freezer, it might be a good idea to write down \"Cilantro\" on the bag as well. Place the bagged cilantro into the freezer. Try to place it so that the herbs are laying down flat and straight. Freezing Cilantro in Oil Chop the cilantro up coarsely. Lay the cilantro down on a cutting board and chop it up into inch (2.54 centimeter) long pieces. You can include the stems, or leave them out. This does not have to look neat, as you will be chopping the cilantro up further in a blender. Put the cilantro into a blender. If you do not have a blender, you can use a food processor instead. Pour 1/3 cup (80 milliliters) of olive oil per cup (50 grams) of chopped cilantro. If you want a more intense cilantro flavor, increase the cilantro to 2 cups (100 grams). Also, if the strong flavor of olive oil bothers you, try using another cooking oil, such as canola or vegetable. Turn the blender on and pulse for a few seconds. Make sure that the lid is secure and that there are no leaks. Keep blending until the oil turns green and the cilantro has broken up into smaller pieces. Do not blend it for too long; you still want to see bits of the herb. Spoon the puree into an ice cube tray. Fill each well about 3/4 of the way. Do not fill it all the way; the puree will expand when it freezes. Transfer the tray to the freezer. Set it down on a flat, stable surface. Leave it there for a few hours to overnight. Transfer the frozen cubes to a re-sealable freezer bag. This way, you will be able to reuse your ice cube tray. If you do not have any freezer bags, use two regular bags instead, one inside the other. Write the date on the bag using a permanent marker. If you are storing other kinds of herbs in the freezer as well, consider writing \"Cilantro\" on the bag as well. Freezing Cilantro in Butter Chop op some cilantro and toss it into a bowl. You will need about 1 to 3 tablespoons of chopped cilantro per stick of butter. Add in one stick softened, room temperature butter. It might help to cut the butter into smaller pieces. Consider adding in a few other ingredients. You can leave the cilantro butter as is, or you can add in a few other ingredients to make even tastier. Here are some ideas to get you started:\n1 clove garlic, minced\nSalt and pepper, to taste\n½ tablespoon of lime juice\nLime zest Mix everything together until the cilantro is spread evenly throughout. You can use a spoon or spatula. Work quickly, so that the butter does not melt. Add more butter or cilantro if necessary. Roll the butter in some parchment paper or foil. Scoop the butter onto a sheet of parchment paper, making sure that it is close to the edge. Shape it into a rough log shape with a spoon or spatula. Roll it up in the parchment paper. Put the wrapped up butter into the refrigerator. Place the butter seam-side-down on a plate, and leave the place in the fridge until it hardens. Once it hardens, move the butter to the freezer. To keep your freezer clean, keep the butter wrapped in parchment paper, and put it into a re-sealable freezer bag or a plastic container. Be sure to write the date on the container or bag. This will help you remember when you made it, so that you can use it before it goes bad. Using Frozen Cilantro Use frozen cilantro in cilantro chutney or as a guacamole starter. If you froze cilantro just on its own, without any butter or oil, you can break off a few leaves, and add it to guacamole or cilantro chutney. You do not need to defrost it. Use cilantro frozen in oil to season soups, sauces, and other cooked dishes. You can also use it in salad dressings. Because it already contains oil, you will need to adjust your recipe and use less oil. A single cube of frozen cilantro will contain about a tablespoon of oil. Thaw frozen cilantro butter to room temperature before using it. It will take about 15 to 20 minutes for it to thaw. Once it thaws, you can spread it on bread or crackers. Avoid using frozen cilantro in salads and salsas. Once frozen, cilantro loses some of its crispness. When it becomes defrosted, it will appear wilted and mushy. This may detract from the appearance (and texture) of salsa and salad. Consider using fresh cilantro as garnish instead of frozen. Once frozen cilantro starts to thaw, it will begin to look wilted and mushy. If you need to garnish something, consider using fresh cilantro instead. Know by when to use your frozen cilantro. Frozen cilantro won't last forever, although it will certainly last longer than fresh cilantro. Here are some guidelines as to by when you should use your cilantro:\nUse frozen cilantro within two months. Use cilantro frozen in oil within three months. Use frozen cilantro butter within a month. If you thaw it and put it in the fridge, use it within five days. Finished. ",
    "sentences": [
        " Preparing Cilantro for Freezing Choose fresh cilantro.",
        "Cilantro will wilt a little when you freeze it, so it is important to buy cilantro that is fresh.",
        "Look for crisp, bright green leaves.",
        "Avoid anything that looks wilted, crushed, or yellowed.",
        "Rinse the cilantro in a bowl of water.",
        "Hold the cilantro by the stems and swish it in a bowl of cool water.",
        "Keep doing this until the water becomes dirty.",
        "Repeat the process with fresh water each time until the water is clear.",
        "You may need to two to three water changes Shake the water off the cilantro.",
        "Hold it by the stems, and give it a few, good shakes.",
        "It might be a good idea to do this over a sink, so that your kitchen does not become all wet.",
        "Pat the cilantro dry with a few paper towels.",
        "Place a few paper towels down on a flat surface, then set the cilantro down on top of them.",
        "Cover the cilantro with another paper towel and gently press down on it.",
        "The paper towels will absorb any excess moisture.",
        "Keep doing this with fresh, dry paper towels until there is no water left.",
        "Consider blanching the cilantro.",
        "You can do this by dipping the cilantro into a pot of boiling water for 15 to 30 seconds, then dunking them under ice cold water for a few more seconds.",
        "Do not leave the cilantro in the hot water for more than 30 seconds, and be sure to dry it off well.",
        "Blanching the cilantro will help preserve the vibrant color.",
        "Freezing Cilantro in a Bag Decide if you want to freeze the cilantro whole, or just freeze the leaves.",
        "If you want to freeze just the leaves, you will need to pinch them off, and discard the stems.",
        "You can also freeze the cilantro whole, and break off a few leaves whenever you need them.",
        "Consider tossing the cilantro with some olive oil.",
        "This will protect the delicate herb from the cold and keep it from going mushy.",
        "Simply place the herb into a bowl and toss it with a teaspoon to a tablespoon of olive oil.",
        "How much olive oil you use will depend on how much cilantro you are freezing; the more cilantro you have, the more oil you will need.",
        "Place the cilantro into a re-sealable freezer bag.",
        "Try to keep the cilantro spread out evenly in the bag.",
        "If you are using whole cilantro, try to keep the stems and leaves as straight as possible.",
        "You may need to use more than one bag.",
        "If you do not have any freezer bags, use regular re-sealable bags instead, one inside the other.",
        "Squeeze out as much air as possible before sealing the bag.",
        "Zip the bag close part way, then gently press down on the bag with your hands until it is flat.",
        "Close the bag the rest of the way.",
        "Be careful not to crush the cilantro.",
        "Use a permanent marker to write the date on the bag.",
        "If you are storing other types of herbs in the freezer, it might be a good idea to write down \"Cilantro\" on the bag as well.",
        "Place the bagged cilantro into the freezer.",
        "Try to place it so that the herbs are laying down flat and straight.",
        "Freezing Cilantro in Oil Chop the cilantro up coarsely.",
        "Lay the cilantro down on a cutting board and chop it up into inch (2.54 centimeter) long pieces.",
        "You can include the stems, or leave them out.",
        "This does not have to look neat, as you will be chopping the cilantro up further in a blender.",
        "Put the cilantro into a blender.",
        "If you do not have a blender, you can use a food processor instead.",
        "Pour 1/3 cup (80 milliliters) of olive oil per cup (50 grams) of chopped cilantro.",
        "If you want a more intense cilantro flavor, increase the cilantro to 2 cups (100 grams).",
        "Also, if the strong flavor of olive oil bothers you, try using another cooking oil, such as canola or vegetable.",
        "Turn the blender on and pulse for a few seconds.",
        "Make sure that the lid is secure and that there are no leaks.",
        "Keep blending until the oil turns green and the cilantro has broken up into smaller pieces.",
        "Do not blend it for too long; you still want to see bits of the herb.",
        "Spoon the puree into an ice cube tray.",
        "Fill each well about 3/4 of the way.",
        "Do not fill it all the way; the puree will expand when it freezes.",
        "Transfer the tray to the freezer.",
        "Set it down on a flat, stable surface.",
        "Leave it there for a few hours to overnight.",
        "Transfer the frozen cubes to a re-sealable freezer bag.",
        "This way, you will be able to reuse your ice cube tray.",
        "If you do not have any freezer bags, use two regular bags instead, one inside the other.",
        "Write the date on the bag using a permanent marker.",
        "If you are storing other kinds of herbs in the freezer as well, consider writing \"Cilantro\" on the bag as well.",
        "Freezing Cilantro in Butter Chop op some cilantro and toss it into a bowl.",
        "You will need about 1 to 3 tablespoons of chopped cilantro per stick of butter.",
        "Add in one stick softened, room temperature butter.",
        "It might help to cut the butter into smaller pieces.",
        "Consider adding in a few other ingredients.",
        "You can leave the cilantro butter as is, or you can add in a few other ingredients to make even tastier.",
        "Here are some ideas to get you started:\n1 clove garlic, minced\nSalt and pepper, to taste\n½ tablespoon of lime juice\nLime zest Mix everything together until the cilantro is spread evenly throughout.",
        "You can use a spoon or spatula.",
        "Work quickly, so that the butter does not melt.",
        "Add more butter or cilantro if necessary.",
        "Roll the butter in some parchment paper or foil.",
        "Scoop the butter onto a sheet of parchment paper, making sure that it is close to the edge.",
        "Shape it into a rough log shape with a spoon or spatula.",
        "Roll it up in the parchment paper.",
        "Put the wrapped up butter into the refrigerator.",
        "Place the butter seam-side-down on a plate, and leave the place in the fridge until it hardens.",
        "Once it hardens, move the butter to the freezer.",
        "To keep your freezer clean, keep the butter wrapped in parchment paper, and put it into a re-sealable freezer bag or a plastic container.",
        "Be sure to write the date on the container or bag.",
        "This will help you remember when you made it, so that you can use it before it goes bad.",
        "Using Frozen Cilantro Use frozen cilantro in cilantro chutney or as a guacamole starter.",
        "If you froze cilantro just on its own, without any butter or oil, you can break off a few leaves, and add it to guacamole or cilantro chutney.",
        "You do not need to defrost it.",
        "Use cilantro frozen in oil to season soups, sauces, and other cooked dishes.",
        "You can also use it in salad dressings.",
        "Because it already contains oil, you will need to adjust your recipe and use less oil.",
        "A single cube of frozen cilantro will contain about a tablespoon of oil.",
        "Thaw frozen cilantro butter to room temperature before using it.",
        "It will take about 15 to 20 minutes for it to thaw.",
        "Once it thaws, you can spread it on bread or crackers.",
        "Avoid using frozen cilantro in salads and salsas.",
        "Once frozen, cilantro loses some of its crispness.",
        "When it becomes defrosted, it will appear wilted and mushy.",
        "This may detract from the appearance (and texture) of salsa and salad.",
        "Consider using fresh cilantro as garnish instead of frozen.",
        "Once frozen cilantro starts to thaw, it will begin to look wilted and mushy.",
        "If you need to garnish something, consider using fresh cilantro instead.",
        "Know by when to use your frozen cilantro.",
        "Frozen cilantro won't last forever, although it will certainly last longer than fresh cilantro.",
        "Here are some guidelines as to by when you should use your cilantro:\nUse frozen cilantro within two months.",
        "Use cilantro frozen in oil within three months.",
        "Use frozen cilantro butter within a month.",
        "If you thaw it and put it in the fridge, use it within five days.",
        "Finished."
    ]
}