{
    "title": "How to Make Mango Chutney",
    "url": "https://www.wikihow.com/Make-Mango-Chutney",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "Indian Cuisine",
        "Indian Style Condiments"
    ],
    "parts": [
        {
            "name": "Slicing and Salting the Mangoes",
            "steps": [
                {
                    "headline": "Peel the mangoes and remove the flesh from the pits.",
                    "description": "Use either a paring knife or a peeler to remove the skin from 4 mangoes. Once the skin has been removed, slice lengthwise into the mango until you feel resistance from the seed. Repeat this process on the other side of the mango, and then carve around the seed to remove as much of the mango meat at you can. The actual fruit of the mango will be really easy to cut, and your knife should slice through it easily. If you feel resistance or are struggling to cut through the mango, you’re most likely hitting the seed. If you eat mangoes often, you may want to invest in a mango pitter, which will cut around the pit for you all at once."
                },
                {
                    "headline": "Slice the mango meat into long, thin strips.",
                    "description": "On a clean cutting board, slice each chunk of mango meat into thin strips. It’s okay if they’re different lengths. Try to cut each slice so that they are each ⁄4 inch (0.64 cm) wide. If you find your fingers are getting too slippery from the mango juice, pat them dry with a paper towel from time to time so you can slice safely."
                },
                {
                    "headline": "Place the diced mango into a bowl and liberally sprinkle them with salt.",
                    "description": "Once the mangoes have been peeled and sliced, place them all into a clean, medium-sized bowl. Sprinkle them with about 1 tablespoon (17 grams) of salt. Toss the mangoes with a spoon so they’re all covered with some salt. The salt will draw out excess moisture from the mango slices."
                },
                {
                    "headline": "Leave the mango alone overnight or for a minimum of 8 hours.",
                    "description": "Cover the bowl with some paper towels or cling wrap, and set it to the side. It doesn’t need to be refrigerated. Let the salt draw out the moisture from the mango for at least 8 hours, though it’s okay if you leave it for longer. You don’t need to stir or do anything else to the mango during this time."
                },
                {
                    "headline": "Drain away the excess liquid and rinse off the mango the next morning.",
                    "description": "After the 8 hours have passed, gently pour the mango slices into a colander. Rinse them under a gentle, cool stream of water to get rid of the majority of the salt. You can leave the mango in the colander while you prepare the rest of the chutney recipe."
                }
            ]
        },
        {
            "name": "Preparing the Apples, Garlic, and Ginger",
            "steps": [
                {
                    "headline": "Peel the skin off of 2 apples using a paring knife or peeler.",
                    "description": "Wash your hands before you begin, then peel the skin off the apples and either throw it away or add it to a compost pile. To peel an apple, you simply swipe from stem to bottom and repeat that movement around the entire apple until the skin is gone. You can use any kind of apple for mango chutney. Green apples will make the chutney a little more tart, whereas red apples will contribute to the sweetness of the recipe."
                },
                {
                    "headline": "Remove the cores from the apples, and dice them into small pieces.",
                    "description": "Stand the apple up so it’s on its bottom, then slice down the middle, as close to the core as you can get. Trim away excess bits of the core that you missed. Dice the apples into ⁄2 inch (1.3 cm) pieces. Discard the cores and seeds of the apples."
                },
                {
                    "headline": "Mince 4 cloves of garlic.",
                    "description": "Peel off the skin from 4 cloves of garlic and set the cloves on a cutting board. Using the broad side of a kitchen knife, smash each clove. Then mince the cloves by cutting them lengthwise and then crosswise several times. If you use a lot of garlic, you may want to invest in a garlic press, which drastically speeds up the mincing process. If you don’t have fresh garlic cloves, you could also use prepared garlic, which can be found in the refrigerated section of the grocery store."
                },
                {
                    "headline": "Harvest 1 tablespoon (6 grams) of fresh root ginger.",
                    "description": "Use a spoon to scrape away the skin from the fresh ginger. Slice off a 1 inch (2.5 cm) piece of peeled ginger, and then use a knife to cut the ginger into rounds. From there, julienne the ginger rounds, and then cut them crosswise so you have minced ginger. A 1 inch (2.5 cm) piece of ginger root will yield about 1 tablespoon (6 grams) of ginger."
                }
            ]
        },
        {
            "name": "Cooking the Chutney",
            "steps": [
                {
                    "headline": "Combine all the ingredients, except the mango, in a saucepan.",
                    "description": "Put the minced garlic and ginger, diced apples, 1 pound (450 grams) of granulated sugar, 1 tablespoon (6 grams) of mustard powder, 600 millilitres (20  fl oz) of white wine vinegar, and 1 tablespoon (6 grams) of cayenne pepper into a medium-sized saucepan. Mix everything together with a large spoon. If you don’t have white wine vinegar, you could substitute it for the same amount of champagne or cider vinegar."
                },
                {
                    "headline": "Simmer the ingredients together until the sugar dissolves.",
                    "description": "Turn the heat to low and let the mixture come to a simmer. Stir the ingredients from time to time to help the sugar dissolve faster. This process takes about 15 minutes. Avoid turning the heat higher, as this could burn the chutney."
                },
                {
                    "headline": "Boil the mixture once the sugar is gone and add the mango slices.",
                    "description": "Once the sugar has dissolved, turn up the heat to medium-high so that the chutney comes to a boil. Once it’s boiling, gently add the mango slices to the mixture and stir everything together. If you drop the mango into the mixture, it may splash, so try to add it gently. You could even spoon the slices into the pan and submerge them that way."
                },
                {
                    "headline": "Reduce the heat to a simmer and cook the chutney for 30 minutes.",
                    "description": "After the mango has been added to the chutney, turn the meat to medium-low and let it simmer for about 30 minutes. Once the chutney has thickened and has a more syrupy texture, you can take it off the heat. If after 30 minutes, the mixture still seems too thin, turn the heat up a little bit and let it cook for an additional 10 minutes."
                },
                {
                    "headline": "Transfer the chutney into clean glass jars and store them in the fridge.",
                    "description": "Let the chutney cool on the stovetop for about 30 minutes before you transfer it. Keep the glass jars in the fridge, and use the chutney within 4 weeks. The chutney may still be good for longer than 4 weeks, but the flavor will be the best during that time period."
                }
            ]
        }
    ],
    "tyn": [
        "Cutting board",
        "Paring knife",
        "Kitchen knife",
        "Peeler",
        "Paper towels",
        "Bowl",
        "Small spoon",
        "Large spoon",
        "Measuring cups and spoons",
        "Cling wrap (optional)",
        "Colander",
        "Saucepan",
        "Glass jars with lids"
    ],
    "text": " Slicing and Salting the Mangoes Peel the mangoes and remove the flesh from the pits. Use either a paring knife or a peeler to remove the skin from 4 mangoes. Once the skin has been removed, slice lengthwise into the mango until you feel resistance from the seed. Repeat this process on the other side of the mango, and then carve around the seed to remove as much of the mango meat at you can. The actual fruit of the mango will be really easy to cut, and your knife should slice through it easily. If you feel resistance or are struggling to cut through the mango, you’re most likely hitting the seed. If you eat mangoes often, you may want to invest in a mango pitter, which will cut around the pit for you all at once. Slice the mango meat into long, thin strips. On a clean cutting board, slice each chunk of mango meat into thin strips. It’s okay if they’re different lengths. Try to cut each slice so that they are each ⁄4 inch (0.64 cm) wide. If you find your fingers are getting too slippery from the mango juice, pat them dry with a paper towel from time to time so you can slice safely. Place the diced mango into a bowl and liberally sprinkle them with salt. Once the mangoes have been peeled and sliced, place them all into a clean, medium-sized bowl. Sprinkle them with about 1 tablespoon (17 grams) of salt. Toss the mangoes with a spoon so they’re all covered with some salt. The salt will draw out excess moisture from the mango slices. Leave the mango alone overnight or for a minimum of 8 hours. Cover the bowl with some paper towels or cling wrap, and set it to the side. It doesn’t need to be refrigerated. Let the salt draw out the moisture from the mango for at least 8 hours, though it’s okay if you leave it for longer. You don’t need to stir or do anything else to the mango during this time. Drain away the excess liquid and rinse off the mango the next morning. After the 8 hours have passed, gently pour the mango slices into a colander. Rinse them under a gentle, cool stream of water to get rid of the majority of the salt. You can leave the mango in the colander while you prepare the rest of the chutney recipe. Preparing the Apples, Garlic, and Ginger Peel the skin off of 2 apples using a paring knife or peeler. Wash your hands before you begin, then peel the skin off the apples and either throw it away or add it to a compost pile. To peel an apple, you simply swipe from stem to bottom and repeat that movement around the entire apple until the skin is gone. You can use any kind of apple for mango chutney. Green apples will make the chutney a little more tart, whereas red apples will contribute to the sweetness of the recipe. Remove the cores from the apples, and dice them into small pieces. Stand the apple up so it’s on its bottom, then slice down the middle, as close to the core as you can get. Trim away excess bits of the core that you missed. Dice the apples into ⁄2 inch (1.3 cm) pieces. Discard the cores and seeds of the apples. Mince 4 cloves of garlic. Peel off the skin from 4 cloves of garlic and set the cloves on a cutting board. Using the broad side of a kitchen knife, smash each clove. Then mince the cloves by cutting them lengthwise and then crosswise several times. If you use a lot of garlic, you may want to invest in a garlic press, which drastically speeds up the mincing process. If you don’t have fresh garlic cloves, you could also use prepared garlic, which can be found in the refrigerated section of the grocery store. Harvest 1 tablespoon (6 grams) of fresh root ginger. Use a spoon to scrape away the skin from the fresh ginger. Slice off a 1 inch (2.5 cm) piece of peeled ginger, and then use a knife to cut the ginger into rounds. From there, julienne the ginger rounds, and then cut them crosswise so you have minced ginger. A 1 inch (2.5 cm) piece of ginger root will yield about 1 tablespoon (6 grams) of ginger. Cooking the Chutney Combine all the ingredients, except the mango, in a saucepan. Put the minced garlic and ginger, diced apples, 1 pound (450 grams) of granulated sugar, 1 tablespoon (6 grams) of mustard powder, 600 millilitres (20  fl oz) of white wine vinegar, and 1 tablespoon (6 grams) of cayenne pepper into a medium-sized saucepan. Mix everything together with a large spoon. If you don’t have white wine vinegar, you could substitute it for the same amount of champagne or cider vinegar. Simmer the ingredients together until the sugar dissolves. Turn the heat to low and let the mixture come to a simmer. Stir the ingredients from time to time to help the sugar dissolve faster. This process takes about 15 minutes. Avoid turning the heat higher, as this could burn the chutney. Boil the mixture once the sugar is gone and add the mango slices. Once the sugar has dissolved, turn up the heat to medium-high so that the chutney comes to a boil. Once it’s boiling, gently add the mango slices to the mixture and stir everything together. If you drop the mango into the mixture, it may splash, so try to add it gently. You could even spoon the slices into the pan and submerge them that way. Reduce the heat to a simmer and cook the chutney for 30 minutes. After the mango has been added to the chutney, turn the meat to medium-low and let it simmer for about 30 minutes. Once the chutney has thickened and has a more syrupy texture, you can take it off the heat. If after 30 minutes, the mixture still seems too thin, turn the heat up a little bit and let it cook for an additional 10 minutes. Transfer the chutney into clean glass jars and store them in the fridge. Let the chutney cool on the stovetop for about 30 minutes before you transfer it. Keep the glass jars in the fridge, and use the chutney within 4 weeks. The chutney may still be good for longer than 4 weeks, but the flavor will be the best during that time period.",
    "sentences": [
        " Slicing and Salting the Mangoes Peel the mangoes and remove the flesh from the pits.",
        "Use either a paring knife or a peeler to remove the skin from 4 mangoes.",
        "Once the skin has been removed, slice lengthwise into the mango until you feel resistance from the seed.",
        "Repeat this process on the other side of the mango, and then carve around the seed to remove as much of the mango meat at you can.",
        "The actual fruit of the mango will be really easy to cut, and your knife should slice through it easily.",
        "If you feel resistance or are struggling to cut through the mango, you’re most likely hitting the seed.",
        "If you eat mangoes often, you may want to invest in a mango pitter, which will cut around the pit for you all at once.",
        "Slice the mango meat into long, thin strips.",
        "On a clean cutting board, slice each chunk of mango meat into thin strips.",
        "It’s okay if they’re different lengths.",
        "Try to cut each slice so that they are each ⁄4 inch (0.64 cm) wide.",
        "If you find your fingers are getting too slippery from the mango juice, pat them dry with a paper towel from time to time so you can slice safely.",
        "Place the diced mango into a bowl and liberally sprinkle them with salt.",
        "Once the mangoes have been peeled and sliced, place them all into a clean, medium-sized bowl.",
        "Sprinkle them with about 1 tablespoon (17 grams) of salt.",
        "Toss the mangoes with a spoon so they’re all covered with some salt.",
        "The salt will draw out excess moisture from the mango slices.",
        "Leave the mango alone overnight or for a minimum of 8 hours.",
        "Cover the bowl with some paper towels or cling wrap, and set it to the side.",
        "It doesn’t need to be refrigerated.",
        "Let the salt draw out the moisture from the mango for at least 8 hours, though it’s okay if you leave it for longer.",
        "You don’t need to stir or do anything else to the mango during this time.",
        "Drain away the excess liquid and rinse off the mango the next morning.",
        "After the 8 hours have passed, gently pour the mango slices into a colander.",
        "Rinse them under a gentle, cool stream of water to get rid of the majority of the salt.",
        "You can leave the mango in the colander while you prepare the rest of the chutney recipe.",
        "Preparing the Apples, Garlic, and Ginger Peel the skin off of 2 apples using a paring knife or peeler.",
        "Wash your hands before you begin, then peel the skin off the apples and either throw it away or add it to a compost pile.",
        "To peel an apple, you simply swipe from stem to bottom and repeat that movement around the entire apple until the skin is gone.",
        "You can use any kind of apple for mango chutney.",
        "Green apples will make the chutney a little more tart, whereas red apples will contribute to the sweetness of the recipe.",
        "Remove the cores from the apples, and dice them into small pieces.",
        "Stand the apple up so it’s on its bottom, then slice down the middle, as close to the core as you can get.",
        "Trim away excess bits of the core that you missed.",
        "Dice the apples into ⁄2 inch (1.3 cm) pieces.",
        "Discard the cores and seeds of the apples.",
        "Mince 4 cloves of garlic.",
        "Peel off the skin from 4 cloves of garlic and set the cloves on a cutting board.",
        "Using the broad side of a kitchen knife, smash each clove.",
        "Then mince the cloves by cutting them lengthwise and then crosswise several times.",
        "If you use a lot of garlic, you may want to invest in a garlic press, which drastically speeds up the mincing process.",
        "If you don’t have fresh garlic cloves, you could also use prepared garlic, which can be found in the refrigerated section of the grocery store.",
        "Harvest 1 tablespoon (6 grams) of fresh root ginger.",
        "Use a spoon to scrape away the skin from the fresh ginger.",
        "Slice off a 1 inch (2.5 cm) piece of peeled ginger, and then use a knife to cut the ginger into rounds.",
        "From there, julienne the ginger rounds, and then cut them crosswise so you have minced ginger.",
        "A 1 inch (2.5 cm) piece of ginger root will yield about 1 tablespoon (6 grams) of ginger.",
        "Cooking the Chutney Combine all the ingredients, except the mango, in a saucepan.",
        "Put the minced garlic and ginger, diced apples, 1 pound (450 grams) of granulated sugar, 1 tablespoon (6 grams) of mustard powder, 600 millilitres (20  fl oz) of white wine vinegar, and 1 tablespoon (6 grams) of cayenne pepper into a medium-sized saucepan.",
        "Mix everything together with a large spoon.",
        "If you don’t have white wine vinegar, you could substitute it for the same amount of champagne or cider vinegar.",
        "Simmer the ingredients together until the sugar dissolves.",
        "Turn the heat to low and let the mixture come to a simmer.",
        "Stir the ingredients from time to time to help the sugar dissolve faster.",
        "This process takes about 15 minutes.",
        "Avoid turning the heat higher, as this could burn the chutney.",
        "Boil the mixture once the sugar is gone and add the mango slices.",
        "Once the sugar has dissolved, turn up the heat to medium-high so that the chutney comes to a boil.",
        "Once it’s boiling, gently add the mango slices to the mixture and stir everything together.",
        "If you drop the mango into the mixture, it may splash, so try to add it gently.",
        "You could even spoon the slices into the pan and submerge them that way.",
        "Reduce the heat to a simmer and cook the chutney for 30 minutes.",
        "After the mango has been added to the chutney, turn the meat to medium-low and let it simmer for about 30 minutes.",
        "Once the chutney has thickened and has a more syrupy texture, you can take it off the heat.",
        "If after 30 minutes, the mixture still seems too thin, turn the heat up a little bit and let it cook for an additional 10 minutes.",
        "Transfer the chutney into clean glass jars and store them in the fridge.",
        "Let the chutney cool on the stovetop for about 30 minutes before you transfer it.",
        "Keep the glass jars in the fridge, and use the chutney within 4 weeks.",
        "The chutney may still be good for longer than 4 weeks, but the flavor will be the best during that time period."
    ]
}