{
    "title": "How to Flavor Sugar",
    "url": "https://www.wikihow.com/Flavor-Sugar",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes"
    ],
    "methods": [
        {
            "name": "Flavoring Sugar with Ground Spices",
            "steps": [
                {
                    "headline": "Pick the right sugar.",
                    "description": "White sugar usually has a less complex flavor than other sugars, so it's a good base for adding new flavors. Brown sugar or raw sugar will also work, but be prepared for a less predictable flavor due to the higher molasses content."
                },
                {
                    "headline": "Pour one cup (240 mL) sugar into an airtight container.",
                    "description": "Pour the sugar into a zip locked bag, a Tupperware container, a jar, or any other clean, airtight container. Because this method uses dry, powdered spices, there will be no need for a blender or other tool. You can easily make a larger or smaller batch with these same instructions. Just remember to multiply the amount of spice used as well."
                },
                {
                    "headline": "Add 2 to 10 tsp (10–50 mL) spices.",
                    "description": "For this method, use a dry, ground or powdered spice (or grind the spice in a spice grinder or mortar). Different spices have different strengths, so feel free to experiment. The range given is a good starting point, from 2 tsp (10 mL) for a touch of flavor, up to 10 tsp (50 mL) for a strong flavor. Cinnamon, cardamom, ginger, and nutmeg are all commonly used in desserts, making them an obvious option to pair with sugar. These work well alone or in any combination with each other. Cayenne sugar is a flavor for the fearless, adding a bold garnish to a plate or cocktail. Unsweetened cocoa powder, instant coffee, or other flavorful powders can also be added using this method. Try using 1/4 cup (60 mL) instead, since these tend to have a less concentrated flavor than spices."
                },
                {
                    "headline": "Mix the ingredients thoroughly.",
                    "description": "Close the airtight container and mix the sugar and spices together by shaking. Alternatively, mix with a fork or other utensil, but make sure the ingredients are evenly distributed before closing the container."
                },
                {
                    "headline": "Let the sugar sit overnight or longer before using.",
                    "description": "The sugar will take time to absorb the surrounding flavors, becoming more potent over the course of the next few days. Since all the ingredients used in this method are dry, you may store this sugar in an ordinary shaker or sugar bowl."
                }
            ]
        },
        {
            "name": "Flavoring Sugar with Herbs or Citrus Zest",
            "steps": [
                {
                    "headline": "Choose a flavor.",
                    "description": "Any leafy herb or citrus zest can be added using this method. Here are a few ideas, along with estimated amounts to use for every 1 cup (240 mL) sugar:\n\nRosemary, dried rosebuds, or dried culinary lavender are all aromatic flavors. Lavender will produce an especially strong scent. Set aside about 3 tablespoons (45 mL) per cup (240 mL) sugar. Mint makes a sugar that works well in baking and cocktails. Try using 1/2 cup (120 mL) of loosely packed mint leaves. Basil is a more unusual flavor for sweets, and may pair well with lime. Use about 1.5 tbsp (22 mL). Lemon, lime, orange, or any other citrus fruit can be zest and added to sugar. Zest the fruit's colored outer rind, avoiding the white pith. Use the zest from two fruits for a moderate flavor, or several more for a stronger one."
                },
                {
                    "headline": "Dry any wet ingredients, then let cool.",
                    "description": "Fresh leaves and citrus rind should be dried before adding, to avoid clumping the sugar with moisture. There are several ways to accomplish this:\nLay them out on a layer of paper towels, without overlaps, and microwave in 30-second bursts. Check between each burst, and remove when the herbs are crisp. Turn an oven to the lowest setting, lay the herbs on a baking sheet, and warm for about 20 minutes, or until dry. Using an oven at a higher setting is not recommended, due to the risk of burning the herbs. Leave the herbs in a location with a light breeze, to dry for 8—24 hours. Direct sunlight may reduce the flavor."
                },
                {
                    "headline": "Grind the ingredients.",
                    "description": "Sugar will infuse much more quickly if the other ingredients are ground in a spice grinder or coffee grinder. This will also produce a more evenly colored and textured end product. A food processor might work, but it may not turn the ingredients fully into powder. If using dried lavender, you may prefer to leave the flowers in the sugar whole, and strain them out before using the sugar. The lavender flowers (or scoops of the lavender sugar) can then be used to infuse a couple more batches of sugar before they lose their potency."
                },
                {
                    "headline": "Mix the ingredients into one cup (240 mL) sugar.",
                    "description": "White granulated sugar is less likely to clump than most other sugars, making it a good choice for these moisture-containing ingredients. Feel free to experiment with other options if you prefer."
                },
                {
                    "headline": "Store the sugar in an airtight container.",
                    "description": "The sugar should infuse overnight, and continue to taste stronger over the course of the next few days. Store in a dry, airtight container to protect the sugar from humidity and microorganisms. Use citrus zest sugar within two weeks."
                }
            ]
        },
        {
            "name": "Flavoring Sugar with Other Ingredients",
            "steps": [
                {
                    "headline": "Use flavored extracts.",
                    "description": "Almond extract, vanilla extract, and fruit extracts are simple ways to flavor sugar. Start by adding just two to four drops of extract per cup (240 mL) of sugar, since these flavors are concentrated. Stir thoroughly until the color is even, using a spoon to mash apart clumps of moist sugar."
                },
                {
                    "headline": "Add a vanilla bean.",
                    "description": "Slice a vanilla bean pod lengthwise and scoop out as much of the sticky, inner seed material as you can. Stir or blend this sticky material thoroughly with 2–4 cups (480–960 mL) sugar, depending on how strong a flavor you desire. Add the bean pod itself to the sugar and store in an airtight container. Wait at least 48 hours before using, while the flavor infuses."
                },
                {
                    "headline": "Flavor with cocktail bitters.",
                    "description": "You'd never thought of alcoholic sugar before, but now you're interested. Cocktail bitters usually have a strong flavor, so start with two or three teaspoons (10–15 mL) per cup (240 mL) of sugar, and add more if necessary."
                },
                {
                    "headline": "Grind freeze-dried fruit.",
                    "description": "Freeze-dried fruit can be ground in a spice grinder or coffee grinder, then mixed into sugar by hand. This will also add color to the sugar bowl more than most other flavors."
                }
            ]
        },
        {
            "name": "Using the Flavored Sugar",
            "steps": [
                {
                    "headline": "Add the sugar to beverages.",
                    "description": "Stir vanilla sugar or cocoa sugar into hot milk. Use mint or citrus sugar in iced tea or mojitos. Almost any flavored sugar can be used as cocktail garnish. Rub the rim of the glass with a lemon wedge, then sprinkle the sugar crystals over it."
                },
                {
                    "headline": "Use it in desserts.",
                    "description": "Many spices and extracts used to flavor sugar are already used in desserts. Replace the ordinary sugar in a baking recipe, or make the flavor more obvious by topping muffins, rice pudding, or parfait. Use citrus sugar instead for a complementary sour tinge."
                },
                {
                    "headline": "Make sugar cubes or shapes.",
                    "description": "Granulated sugar can be formed into sugar cubes by adding about 1 tsp (5 mL) water for every 1/2 cup (120 mL) sugar. Add more water or sugar as necessary in tiny amounts, stirring thoroughly, until the sugar is slightly moist and crumbly. Press this into a miniature ice cube tray for a typical sugar cube, or into any silicone mold for more unusual shapes. Leave out at room temperature until hard (one to eight hours), then transfer to an airtight container. If you don't have molds, you can press the wet sugar flat on a wax paper-lined baking pan. Cut it into a grid pattern (or into any shapes), then let dry. You can combine this step with the flavoring by substituting half the water with extract or cocktail bitters."
                },
                {
                    "headline": "Make rock candy.",
                    "description": "Once it's had a couple days to infuse, turn your flavored sugar into a hard candy. Tie a string to a pencil, placed over a clean, glass jar. Heat the flavored sugar in a pot of water to make a simple syrup, then pour it into the jar. If you used any flavoring larger than a powder, you might want to strain the syrup through a mesh as you pour."
                },
                {
                    "headline": "Make cotton candy.",
                    "description": "It is possible to make cotton candy even without a machine, although the process is complicated. If you used wet flavor ingredients, give the sugar at least two weeks to dry before using it for cotton candy. You'll also need to strain the sugar through a fine mesh to remove all large ingredients."
                }
            ]
        }
    ],
    "tyn": [
        "Mixing bowl",
        "Spice grinder, coffee grinder, food processor, or blender",
        "Microwave or oven (optional)",
        "Spoon or whisk"
    ],
    "text": " Flavoring Sugar with Ground Spices Pick the right sugar. White sugar usually has a less complex flavor than other sugars, so it's a good base for adding new flavors. Brown sugar or raw sugar will also work, but be prepared for a less predictable flavor due to the higher molasses content. Pour one cup (240 mL) sugar into an airtight container. Pour the sugar into a zip locked bag, a Tupperware container, a jar, or any other clean, airtight container. Because this method uses dry, powdered spices, there will be no need for a blender or other tool. You can easily make a larger or smaller batch with these same instructions. Just remember to multiply the amount of spice used as well. Add 2 to 10 tsp (10–50 mL) spices. For this method, use a dry, ground or powdered spice (or grind the spice in a spice grinder or mortar). Different spices have different strengths, so feel free to experiment. The range given is a good starting point, from 2 tsp (10 mL) for a touch of flavor, up to 10 tsp (50 mL) for a strong flavor. Cinnamon, cardamom, ginger, and nutmeg are all commonly used in desserts, making them an obvious option to pair with sugar. These work well alone or in any combination with each other. Cayenne sugar is a flavor for the fearless, adding a bold garnish to a plate or cocktail. Unsweetened cocoa powder, instant coffee, or other flavorful powders can also be added using this method. Try using 1/4 cup (60 mL) instead, since these tend to have a less concentrated flavor than spices. Mix the ingredients thoroughly. Close the airtight container and mix the sugar and spices together by shaking. Alternatively, mix with a fork or other utensil, but make sure the ingredients are evenly distributed before closing the container. Let the sugar sit overnight or longer before using. The sugar will take time to absorb the surrounding flavors, becoming more potent over the course of the next few days. Since all the ingredients used in this method are dry, you may store this sugar in an ordinary shaker or sugar bowl. Flavoring Sugar with Herbs or Citrus Zest Choose a flavor. Any leafy herb or citrus zest can be added using this method. Here are a few ideas, along with estimated amounts to use for every 1 cup (240 mL) sugar:\n\nRosemary, dried rosebuds, or dried culinary lavender are all aromatic flavors. Lavender will produce an especially strong scent. Set aside about 3 tablespoons (45 mL) per cup (240 mL) sugar. Mint makes a sugar that works well in baking and cocktails. Try using 1/2 cup (120 mL) of loosely packed mint leaves. Basil is a more unusual flavor for sweets, and may pair well with lime. Use about 1.5 tbsp (22 mL). Lemon, lime, orange, or any other citrus fruit can be zest and added to sugar. Zest the fruit's colored outer rind, avoiding the white pith. Use the zest from two fruits for a moderate flavor, or several more for a stronger one. Dry any wet ingredients, then let cool. Fresh leaves and citrus rind should be dried before adding, to avoid clumping the sugar with moisture. There are several ways to accomplish this:\nLay them out on a layer of paper towels, without overlaps, and microwave in 30-second bursts. Check between each burst, and remove when the herbs are crisp. Turn an oven to the lowest setting, lay the herbs on a baking sheet, and warm for about 20 minutes, or until dry. Using an oven at a higher setting is not recommended, due to the risk of burning the herbs. Leave the herbs in a location with a light breeze, to dry for 8—24 hours. Direct sunlight may reduce the flavor. Grind the ingredients. Sugar will infuse much more quickly if the other ingredients are ground in a spice grinder or coffee grinder. This will also produce a more evenly colored and textured end product. A food processor might work, but it may not turn the ingredients fully into powder. If using dried lavender, you may prefer to leave the flowers in the sugar whole, and strain them out before using the sugar. The lavender flowers (or scoops of the lavender sugar) can then be used to infuse a couple more batches of sugar before they lose their potency. Mix the ingredients into one cup (240 mL) sugar. White granulated sugar is less likely to clump than most other sugars, making it a good choice for these moisture-containing ingredients. Feel free to experiment with other options if you prefer. Store the sugar in an airtight container. The sugar should infuse overnight, and continue to taste stronger over the course of the next few days. Store in a dry, airtight container to protect the sugar from humidity and microorganisms. Use citrus zest sugar within two weeks. Flavoring Sugar with Other Ingredients Use flavored extracts. Almond extract, vanilla extract, and fruit extracts are simple ways to flavor sugar. Start by adding just two to four drops of extract per cup (240 mL) of sugar, since these flavors are concentrated. Stir thoroughly until the color is even, using a spoon to mash apart clumps of moist sugar. Add a vanilla bean. Slice a vanilla bean pod lengthwise and scoop out as much of the sticky, inner seed material as you can. Stir or blend this sticky material thoroughly with 2–4 cups (480–960 mL) sugar, depending on how strong a flavor you desire. Add the bean pod itself to the sugar and store in an airtight container. Wait at least 48 hours before using, while the flavor infuses. Flavor with cocktail bitters. You'd never thought of alcoholic sugar before, but now you're interested. Cocktail bitters usually have a strong flavor, so start with two or three teaspoons (10–15 mL) per cup (240 mL) of sugar, and add more if necessary. Grind freeze-dried fruit. Freeze-dried fruit can be ground in a spice grinder or coffee grinder, then mixed into sugar by hand. This will also add color to the sugar bowl more than most other flavors. Using the Flavored Sugar Add the sugar to beverages. Stir vanilla sugar or cocoa sugar into hot milk. Use mint or citrus sugar in iced tea or mojitos. Almost any flavored sugar can be used as cocktail garnish. Rub the rim of the glass with a lemon wedge, then sprinkle the sugar crystals over it. Use it in desserts. Many spices and extracts used to flavor sugar are already used in desserts. Replace the ordinary sugar in a baking recipe, or make the flavor more obvious by topping muffins, rice pudding, or parfait. Use citrus sugar instead for a complementary sour tinge. Make sugar cubes or shapes. Granulated sugar can be formed into sugar cubes by adding about 1 tsp (5 mL) water for every 1/2 cup (120 mL) sugar. Add more water or sugar as necessary in tiny amounts, stirring thoroughly, until the sugar is slightly moist and crumbly. Press this into a miniature ice cube tray for a typical sugar cube, or into any silicone mold for more unusual shapes. Leave out at room temperature until hard (one to eight hours), then transfer to an airtight container. If you don't have molds, you can press the wet sugar flat on a wax paper-lined baking pan. Cut it into a grid pattern (or into any shapes), then let dry. You can combine this step with the flavoring by substituting half the water with extract or cocktail bitters. Make rock candy. Once it's had a couple days to infuse, turn your flavored sugar into a hard candy. Tie a string to a pencil, placed over a clean, glass jar. Heat the flavored sugar in a pot of water to make a simple syrup, then pour it into the jar. If you used any flavoring larger than a powder, you might want to strain the syrup through a mesh as you pour. Make cotton candy. It is possible to make cotton candy even without a machine, although the process is complicated. If you used wet flavor ingredients, give the sugar at least two weeks to dry before using it for cotton candy. You'll also need to strain the sugar through a fine mesh to remove all large ingredients.",
    "sentences": [
        " Flavoring Sugar with Ground Spices Pick the right sugar.",
        "White sugar usually has a less complex flavor than other sugars, so it's a good base for adding new flavors.",
        "Brown sugar or raw sugar will also work, but be prepared for a less predictable flavor due to the higher molasses content.",
        "Pour one cup (240 mL) sugar into an airtight container.",
        "Pour the sugar into a zip locked bag, a Tupperware container, a jar, or any other clean, airtight container.",
        "Because this method uses dry, powdered spices, there will be no need for a blender or other tool.",
        "You can easily make a larger or smaller batch with these same instructions.",
        "Just remember to multiply the amount of spice used as well.",
        "Add 2 to 10 tsp (10–50 mL) spices.",
        "For this method, use a dry, ground or powdered spice (or grind the spice in a spice grinder or mortar).",
        "Different spices have different strengths, so feel free to experiment.",
        "The range given is a good starting point, from 2 tsp (10 mL) for a touch of flavor, up to 10 tsp (50 mL) for a strong flavor.",
        "Cinnamon, cardamom, ginger, and nutmeg are all commonly used in desserts, making them an obvious option to pair with sugar.",
        "These work well alone or in any combination with each other.",
        "Cayenne sugar is a flavor for the fearless, adding a bold garnish to a plate or cocktail.",
        "Unsweetened cocoa powder, instant coffee, or other flavorful powders can also be added using this method.",
        "Try using 1/4 cup (60 mL) instead, since these tend to have a less concentrated flavor than spices.",
        "Mix the ingredients thoroughly.",
        "Close the airtight container and mix the sugar and spices together by shaking.",
        "Alternatively, mix with a fork or other utensil, but make sure the ingredients are evenly distributed before closing the container.",
        "Let the sugar sit overnight or longer before using.",
        "The sugar will take time to absorb the surrounding flavors, becoming more potent over the course of the next few days.",
        "Since all the ingredients used in this method are dry, you may store this sugar in an ordinary shaker or sugar bowl.",
        "Flavoring Sugar with Herbs or Citrus Zest Choose a flavor.",
        "Any leafy herb or citrus zest can be added using this method.",
        "Here are a few ideas, along with estimated amounts to use for every 1 cup (240 mL) sugar:\n\nRosemary, dried rosebuds, or dried culinary lavender are all aromatic flavors.",
        "Lavender will produce an especially strong scent.",
        "Set aside about 3 tablespoons (45 mL) per cup (240 mL) sugar.",
        "Mint makes a sugar that works well in baking and cocktails.",
        "Try using 1/2 cup (120 mL) of loosely packed mint leaves.",
        "Basil is a more unusual flavor for sweets, and may pair well with lime.",
        "Use about 1.5 tbsp (22 mL).",
        "Lemon, lime, orange, or any other citrus fruit can be zest and added to sugar.",
        "Zest the fruit's colored outer rind, avoiding the white pith.",
        "Use the zest from two fruits for a moderate flavor, or several more for a stronger one.",
        "Dry any wet ingredients, then let cool.",
        "Fresh leaves and citrus rind should be dried before adding, to avoid clumping the sugar with moisture.",
        "There are several ways to accomplish this:\nLay them out on a layer of paper towels, without overlaps, and microwave in 30-second bursts.",
        "Check between each burst, and remove when the herbs are crisp.",
        "Turn an oven to the lowest setting, lay the herbs on a baking sheet, and warm for about 20 minutes, or until dry.",
        "Using an oven at a higher setting is not recommended, due to the risk of burning the herbs.",
        "Leave the herbs in a location with a light breeze, to dry for 8—24 hours.",
        "Direct sunlight may reduce the flavor.",
        "Grind the ingredients.",
        "Sugar will infuse much more quickly if the other ingredients are ground in a spice grinder or coffee grinder.",
        "This will also produce a more evenly colored and textured end product.",
        "A food processor might work, but it may not turn the ingredients fully into powder.",
        "If using dried lavender, you may prefer to leave the flowers in the sugar whole, and strain them out before using the sugar.",
        "The lavender flowers (or scoops of the lavender sugar) can then be used to infuse a couple more batches of sugar before they lose their potency.",
        "Mix the ingredients into one cup (240 mL) sugar.",
        "White granulated sugar is less likely to clump than most other sugars, making it a good choice for these moisture-containing ingredients.",
        "Feel free to experiment with other options if you prefer.",
        "Store the sugar in an airtight container.",
        "The sugar should infuse overnight, and continue to taste stronger over the course of the next few days.",
        "Store in a dry, airtight container to protect the sugar from humidity and microorganisms.",
        "Use citrus zest sugar within two weeks.",
        "Flavoring Sugar with Other Ingredients Use flavored extracts.",
        "Almond extract, vanilla extract, and fruit extracts are simple ways to flavor sugar.",
        "Start by adding just two to four drops of extract per cup (240 mL) of sugar, since these flavors are concentrated.",
        "Stir thoroughly until the color is even, using a spoon to mash apart clumps of moist sugar.",
        "Add a vanilla bean.",
        "Slice a vanilla bean pod lengthwise and scoop out as much of the sticky, inner seed material as you can.",
        "Stir or blend this sticky material thoroughly with 2–4 cups (480–960 mL) sugar, depending on how strong a flavor you desire.",
        "Add the bean pod itself to the sugar and store in an airtight container.",
        "Wait at least 48 hours before using, while the flavor infuses.",
        "Flavor with cocktail bitters.",
        "You'd never thought of alcoholic sugar before, but now you're interested.",
        "Cocktail bitters usually have a strong flavor, so start with two or three teaspoons (10–15 mL) per cup (240 mL) of sugar, and add more if necessary.",
        "Grind freeze-dried fruit.",
        "Freeze-dried fruit can be ground in a spice grinder or coffee grinder, then mixed into sugar by hand.",
        "This will also add color to the sugar bowl more than most other flavors.",
        "Using the Flavored Sugar Add the sugar to beverages.",
        "Stir vanilla sugar or cocoa sugar into hot milk.",
        "Use mint or citrus sugar in iced tea or mojitos.",
        "Almost any flavored sugar can be used as cocktail garnish.",
        "Rub the rim of the glass with a lemon wedge, then sprinkle the sugar crystals over it.",
        "Use it in desserts.",
        "Many spices and extracts used to flavor sugar are already used in desserts.",
        "Replace the ordinary sugar in a baking recipe, or make the flavor more obvious by topping muffins, rice pudding, or parfait.",
        "Use citrus sugar instead for a complementary sour tinge.",
        "Make sugar cubes or shapes.",
        "Granulated sugar can be formed into sugar cubes by adding about 1 tsp (5 mL) water for every 1/2 cup (120 mL) sugar.",
        "Add more water or sugar as necessary in tiny amounts, stirring thoroughly, until the sugar is slightly moist and crumbly.",
        "Press this into a miniature ice cube tray for a typical sugar cube, or into any silicone mold for more unusual shapes.",
        "Leave out at room temperature until hard (one to eight hours), then transfer to an airtight container.",
        "If you don't have molds, you can press the wet sugar flat on a wax paper-lined baking pan.",
        "Cut it into a grid pattern (or into any shapes), then let dry.",
        "You can combine this step with the flavoring by substituting half the water with extract or cocktail bitters.",
        "Make rock candy.",
        "Once it's had a couple days to infuse, turn your flavored sugar into a hard candy.",
        "Tie a string to a pencil, placed over a clean, glass jar.",
        "Heat the flavored sugar in a pot of water to make a simple syrup, then pour it into the jar.",
        "If you used any flavoring larger than a powder, you might want to strain the syrup through a mesh as you pour.",
        "Make cotton candy.",
        "It is possible to make cotton candy even without a machine, although the process is complicated.",
        "If you used wet flavor ingredients, give the sugar at least two weeks to dry before using it for cotton candy.",
        "You'll also need to strain the sugar through a fine mesh to remove all large ingredients."
    ]
}