{
    "title": "How to Crochet a Button",
    "url": "https://www.wikihow.com/Crochet-a-Button",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Knitting and Crochet",
        "Crochet"
    ],
    "methods": [
        {
            "name": "Basic Crochet Button",
            "steps": [
                {
                    "headline": "Make a slip knot.",
                    "description": "Tie the yarn onto your crochet needle by making an adjustable slipknot near the tip."
                },
                {
                    "headline": "Chain two.",
                    "description": "Crochet two chain stitches from the loop on your hook."
                },
                {
                    "headline": "Make six single crochets.",
                    "description": "Work two single crochets into the second chain from the hook, which also happens to be the first chain stitch your crocheted. Use a slip stitch to join the last single crochet with the first. You should make a round with six stitches total."
                },
                {
                    "headline": "Chain one and work two single crochets in each stitch.",
                    "description": "Make one chain stitch from the loop on your hook to start a new round. Make two single crochets in each stitch from your previous round. Use a slip stitch to join the last and first stitches together. You should have a round with 12 stitches total."
                },
                {
                    "headline": "Chain one and make six sets of two single crochets.",
                    "description": "Make one chain stitch from the loop on your hook to start a new round. Single crochet into two stitches from the previous round, six times around. Join the final stitch with the first using a slip stitch. You should make a round with six stitches total."
                },
                {
                    "headline": "Weave the tail in.",
                    "description": "Weave the tail end into the stitches on the back of the button, using a darning needle if necessary. Use your hands to slightly flatten the button. As you stitch or weave in your tail end, weave it through the entire thickness to keep it secure."
                }
            ]
        },
        {
            "name": "Basic Crochet Button, Magic Ring Version",
            "steps": [
                {
                    "headline": "Make a magic ring.",
                    "description": "Create an adjustable ring, more commonly known as a \"magic ring,\" with your yarn. Make one chain stitch to secure the loop."
                },
                {
                    "headline": "Chain two and make eleven double crochets.",
                    "description": "Make two more chain stitches from the loop on your crochet hook. Work eleven double crochets into the loop of the magic ring. Gently tug on the ends of the magic ring to close it into a tight circle. Note that the initial set of two chain stitches will be counted as a single double crochet. Your circle should have 12 double crochet stitches in it, including your set of two chain stitches."
                },
                {
                    "headline": "Seal the end.",
                    "description": "Cut the yarn, leaving a long tail, and pull this tail through the loop on your hook to tie it off. The tail should be at least 8 inches (20.32 cm) long."
                },
                {
                    "headline": "Thread the yarn onto a darning needle.",
                    "description": "Insert the tail end of the yarn into the eye of a darning needle, loosely tying the end of the yarn onto the needle to hold it on. Alternatively, you could just hold the end of the yarn in place with your fingertip instead of tying it on."
                },
                {
                    "headline": "Close the circle.",
                    "description": "Insert the darning needle through the top of your first double crochet and back out through the back loop of the last stitch. Note that you need to weave it into your first actual double crochet, not through the starting set of two chains. This should create the appearance of an extra stitch and create a clean appearance with a round edge from the front."
                },
                {
                    "headline": "Weave the tail in.",
                    "description": "Use your darning needle to weave the tail end into the stitches along the back of the button, securing it while simultaneously hiding it."
                }
            ]
        },
        {
            "name": "Embellished Crochet Button",
            "steps": [
                {
                    "headline": "Make a basic crochet button.",
                    "description": "Each of these embellished crochet buttons start with one of the basic crochet buttons described above. Since the stitches are easier to see on the magic ring version, that is usually preferred, but you can experiment with either option."
                },
                {
                    "headline": "Create a ridge in a contrasting color.",
                    "description": "Use a crochet hook and darning needle to weave a contrasting color of yarn through the edges of your double stitches in a magic ring basic button. Insert your crochet hook through the top of one of your double stitches. Grab the contrasting yard from the other side and pull a loop through to the front. With the loop still on your hook, insert the hook in between the next double crochet stitch of your button, pulling a new, second loop onto your hook. Pull this second loop through the original loop on your hook. Continue in this manner, working counter-clockwise around the button and pulling up new loops in between all the double crochet stitches. When pulling the yarn through the last stitch, cut the yarn and thread the end through a darning needle. Insert the needle under both loops of your first contrasting color stitch and back through the back loop of your last stitch. Draw the yarn to the back of the button. Sew the end into the back of the button with your darning needle."
                },
                {
                    "headline": "Make a center star or snowflake.",
                    "description": "You can make a simple six-pointed star or snowflake by diagonally weaving roughly 12 inches (30.5 cm) of contrasting yarn through the double stitches of a magic ring simple button with a darning needle. Cut a piece of contrasting yarn measuring 12 inches (30.5 cm). Thread the end of this yarn through the eye of a darning needle. Insert the needle under two loops of one double crochet stitch in your button. Working over the top of the button, insert the needle into the button's center, pulling it back out through the back. From the back, insert the needle once more under two loops of the next double crochet stitch in your button. From the front, insert the needle into the button's center again. Continue in this manner, creating six lines extending from the center to the edge of the button. Weave the ends of the yarn through the stitches on the back of the button to secure everything in place."
                },
                {
                    "headline": "Embellish with a flower.",
                    "description": "A flower embellishment is a little more complex and requires one contrasting color yarn for the center and a second to use when making five petals. For the center of the flower:\nThread the yarn onto your darning needle. Pull the darning needle up through the center of the button. Weave it under one inner loop in the center of the button and back up through the other side. Loop it around the tip of the needle. Pull the length of the yarn through the two loops you just created. Repeat, working a similar stitch into each loop at the center of the button. Tie it off on the back of the button. For the petals:\nThread your yarn onto the darning needle. Pull the yarn up through the center of the button, from underneath the center of your flower. Do not pull it through the flower center. Insert the needle back into the center. Do not pull the loop it creates; instead, leave enough of the loop hanging to extend past the perimeter of the button. From the back of the button, insert the needle through the stitch at the edge of the button, pulling it up to the front and through the loop you created when working from the center. Pull to tighten the loop. One petal should be created. Weave the needle over the outer edge of the petal and back to the back of the button. From the back, repeat the same steps, creating four more petals. Tie off at the back when finished."
                }
            ]
        },
        {
            "name": "Crochet Button Cover[2]\n\tX\n\t\tResearch source",
            "steps": [
                {
                    "headline": "Make a magic ring.",
                    "description": "Form an adjustable ring with your yarn, more commonly referred to as a \"magic ring.\" At the end of the ring, make one chain stitch to secure the ring in place."
                },
                {
                    "headline": "Create ten single crochets.",
                    "description": "Work ten single crochets into the center of the magic ring. Join the final single crochet with the top of the first single crochet with a slip stitch. If necessary, tug on the ends of the magic ring to close it into a tight circle. This completes the first round."
                },
                {
                    "headline": "Chain one and work two single crochets into each stitch.",
                    "description": "Make one chain stitch to move onto the next round. Make two single crochets into each stitch of the previous round, joining the last and first at the top with another slip stitch. This creates an increase, thereby enlarging your circle. You should have a total of 20 crochet stitches in this second round. After you finish this round, compare it to the size of the button. If you are on the right track, you should need to make another front round still to cover the front of the button."
                },
                {
                    "headline": "Chain one and increase every other single crochet.",
                    "description": "Make one chain stitch to move onto the next round. Single crochet once in the first stitch of the previous round, then single crochet twice in the next stitch. Continue all the way around the button, joining the first and last single crochets of this round with another slip stitch. You should have 30 stitches in this round. By now, your button cover should be about the same size as your button. If it is slightly larger, that will work too, since the excess can wrap around the back of the button."
                },
                {
                    "headline": "Form the fourth round.",
                    "description": "Chain stitch once to move onto the next round. Single crochet once in the first five stitches of the previous round, then make a single crochet decrease over the next two stitches from the previous round. Repeat all the way around, joining the last and first single crochets with a slip stitch. You should have 26 stitches in this round. The piece should begin to curl under into the shape of a bowl."
                },
                {
                    "headline": "Add more decreases for the fifth round.",
                    "description": "Chain one to get into the next round. Single crochet once in each of the next two stitches. Single crochet decrease over the next two stitches after that. Continue all the way around, joining the last and first stitches with a slip stitch. There should be 20 stitches in this round."
                },
                {
                    "headline": "Decrease again for the sixth round.",
                    "description": "Chain one to get into the sixth round. Single crochet decrease over the next two stitches. Repeat all the way around, joining the last stitch and first stitch with a slip stitch. This should give you a round with 10 stitches in it. Slide the button into the crochet cover at this point. You might need to do this before making your final joining slip stitch, just to make sure that the button fits inside."
                },
                {
                    "headline": "Decrease again for the seventh round.",
                    "description": "Chain one to get into the seventh round. Single crochet decrease over the next two stitches, and repeat this pattern all the way around. Join the first and last stitches with a slip stitch. You should make a total of five stitches for this round. At this point, the entire back of your button should essentially be covered."
                },
                {
                    "headline": "Fasten off and weave in the ends.",
                    "description": "Cut the yarn, leaving a tail 8 inches (20.32 cm) long. Pull this tail through the loop on your hook to fasten it off, then weave the end back and forth across the last stitches to close the cover and secure the ends in place."
                }
            ]
        }
    ],
    "tyn": [
        "Yarn",
        "Crochet hook, in a size suitable for your yarn and button size, usually Size F (3.75 mm)",
        "Darning needle",
        "Scissors",
        "Yarn in a contrasting color (optional)",
        "1 3/8 inch (3.5 cm) diameter button (optional)"
    ],
    "text": " Basic Crochet Button Make a slip knot. Tie the yarn onto your crochet needle by making an adjustable slipknot near the tip. Chain two. Crochet two chain stitches from the loop on your hook. Make six single crochets. Work two single crochets into the second chain from the hook, which also happens to be the first chain stitch your crocheted. Use a slip stitch to join the last single crochet with the first. You should make a round with six stitches total. Chain one and work two single crochets in each stitch. Make one chain stitch from the loop on your hook to start a new round. Make two single crochets in each stitch from your previous round. Use a slip stitch to join the last and first stitches together. You should have a round with 12 stitches total. Chain one and make six sets of two single crochets. Make one chain stitch from the loop on your hook to start a new round. Single crochet into two stitches from the previous round, six times around. Join the final stitch with the first using a slip stitch. You should make a round with six stitches total. Weave the tail in. Weave the tail end into the stitches on the back of the button, using a darning needle if necessary. Use your hands to slightly flatten the button. As you stitch or weave in your tail end, weave it through the entire thickness to keep it secure. Basic Crochet Button, Magic Ring Version Make a magic ring. Create an adjustable ring, more commonly known as a \"magic ring,\" with your yarn. Make one chain stitch to secure the loop. Chain two and make eleven double crochets. Make two more chain stitches from the loop on your crochet hook. Work eleven double crochets into the loop of the magic ring. Gently tug on the ends of the magic ring to close it into a tight circle. Note that the initial set of two chain stitches will be counted as a single double crochet. Your circle should have 12 double crochet stitches in it, including your set of two chain stitches. Seal the end. Cut the yarn, leaving a long tail, and pull this tail through the loop on your hook to tie it off. The tail should be at least 8 inches (20.32 cm) long. Thread the yarn onto a darning needle. Insert the tail end of the yarn into the eye of a darning needle, loosely tying the end of the yarn onto the needle to hold it on. Alternatively, you could just hold the end of the yarn in place with your fingertip instead of tying it on. Close the circle. Insert the darning needle through the top of your first double crochet and back out through the back loop of the last stitch. Note that you need to weave it into your first actual double crochet, not through the starting set of two chains. This should create the appearance of an extra stitch and create a clean appearance with a round edge from the front. Weave the tail in. Use your darning needle to weave the tail end into the stitches along the back of the button, securing it while simultaneously hiding it. Embellished Crochet Button Make a basic crochet button. Each of these embellished crochet buttons start with one of the basic crochet buttons described above. Since the stitches are easier to see on the magic ring version, that is usually preferred, but you can experiment with either option. Create a ridge in a contrasting color. Use a crochet hook and darning needle to weave a contrasting color of yarn through the edges of your double stitches in a magic ring basic button. Insert your crochet hook through the top of one of your double stitches. Grab the contrasting yard from the other side and pull a loop through to the front. With the loop still on your hook, insert the hook in between the next double crochet stitch of your button, pulling a new, second loop onto your hook. Pull this second loop through the original loop on your hook. Continue in this manner, working counter-clockwise around the button and pulling up new loops in between all the double crochet stitches. When pulling the yarn through the last stitch, cut the yarn and thread the end through a darning needle. Insert the needle under both loops of your first contrasting color stitch and back through the back loop of your last stitch. Draw the yarn to the back of the button. Sew the end into the back of the button with your darning needle. Make a center star or snowflake. You can make a simple six-pointed star or snowflake by diagonally weaving roughly 12 inches (30.5 cm) of contrasting yarn through the double stitches of a magic ring simple button with a darning needle. Cut a piece of contrasting yarn measuring 12 inches (30.5 cm). Thread the end of this yarn through the eye of a darning needle. Insert the needle under two loops of one double crochet stitch in your button. Working over the top of the button, insert the needle into the button's center, pulling it back out through the back. From the back, insert the needle once more under two loops of the next double crochet stitch in your button. From the front, insert the needle into the button's center again. Continue in this manner, creating six lines extending from the center to the edge of the button. Weave the ends of the yarn through the stitches on the back of the button to secure everything in place. Embellish with a flower. A flower embellishment is a little more complex and requires one contrasting color yarn for the center and a second to use when making five petals. For the center of the flower:\nThread the yarn onto your darning needle. Pull the darning needle up through the center of the button. Weave it under one inner loop in the center of the button and back up through the other side. Loop it around the tip of the needle. Pull the length of the yarn through the two loops you just created. Repeat, working a similar stitch into each loop at the center of the button. Tie it off on the back of the button. For the petals:\nThread your yarn onto the darning needle. Pull the yarn up through the center of the button, from underneath the center of your flower. Do not pull it through the flower center. Insert the needle back into the center. Do not pull the loop it creates; instead, leave enough of the loop hanging to extend past the perimeter of the button. From the back of the button, insert the needle through the stitch at the edge of the button, pulling it up to the front and through the loop you created when working from the center. Pull to tighten the loop. One petal should be created. Weave the needle over the outer edge of the petal and back to the back of the button. From the back, repeat the same steps, creating four more petals. Tie off at the back when finished. Crochet Button Cover[2]\n\tX\n\t\tResearch source Make a magic ring. Form an adjustable ring with your yarn, more commonly referred to as a \"magic ring.\" At the end of the ring, make one chain stitch to secure the ring in place. Create ten single crochets. Work ten single crochets into the center of the magic ring. Join the final single crochet with the top of the first single crochet with a slip stitch. If necessary, tug on the ends of the magic ring to close it into a tight circle. This completes the first round. Chain one and work two single crochets into each stitch. Make one chain stitch to move onto the next round. Make two single crochets into each stitch of the previous round, joining the last and first at the top with another slip stitch. This creates an increase, thereby enlarging your circle. You should have a total of 20 crochet stitches in this second round. After you finish this round, compare it to the size of the button. If you are on the right track, you should need to make another front round still to cover the front of the button. Chain one and increase every other single crochet. Make one chain stitch to move onto the next round. Single crochet once in the first stitch of the previous round, then single crochet twice in the next stitch. Continue all the way around the button, joining the first and last single crochets of this round with another slip stitch. You should have 30 stitches in this round. By now, your button cover should be about the same size as your button. If it is slightly larger, that will work too, since the excess can wrap around the back of the button. Form the fourth round. Chain stitch once to move onto the next round. Single crochet once in the first five stitches of the previous round, then make a single crochet decrease over the next two stitches from the previous round. Repeat all the way around, joining the last and first single crochets with a slip stitch. You should have 26 stitches in this round. The piece should begin to curl under into the shape of a bowl. Add more decreases for the fifth round. Chain one to get into the next round. Single crochet once in each of the next two stitches. Single crochet decrease over the next two stitches after that. Continue all the way around, joining the last and first stitches with a slip stitch. There should be 20 stitches in this round. Decrease again for the sixth round. Chain one to get into the sixth round. Single crochet decrease over the next two stitches. Repeat all the way around, joining the last stitch and first stitch with a slip stitch. This should give you a round with 10 stitches in it. Slide the button into the crochet cover at this point. You might need to do this before making your final joining slip stitch, just to make sure that the button fits inside. Decrease again for the seventh round. Chain one to get into the seventh round. Single crochet decrease over the next two stitches, and repeat this pattern all the way around. Join the first and last stitches with a slip stitch. You should make a total of five stitches for this round. At this point, the entire back of your button should essentially be covered. Fasten off and weave in the ends. Cut the yarn, leaving a tail 8 inches (20.32 cm) long. Pull this tail through the loop on your hook to fasten it off, then weave the end back and forth across the last stitches to close the cover and secure the ends in place.",
    "sentences": [
        " Basic Crochet Button Make a slip knot.",
        "Tie the yarn onto your crochet needle by making an adjustable slipknot near the tip.",
        "Chain two.",
        "Crochet two chain stitches from the loop on your hook.",
        "Make six single crochets.",
        "Work two single crochets into the second chain from the hook, which also happens to be the first chain stitch your crocheted.",
        "Use a slip stitch to join the last single crochet with the first.",
        "You should make a round with six stitches total.",
        "Chain one and work two single crochets in each stitch.",
        "Make one chain stitch from the loop on your hook to start a new round.",
        "Make two single crochets in each stitch from your previous round.",
        "Use a slip stitch to join the last and first stitches together.",
        "You should have a round with 12 stitches total.",
        "Chain one and make six sets of two single crochets.",
        "Make one chain stitch from the loop on your hook to start a new round.",
        "Single crochet into two stitches from the previous round, six times around.",
        "Join the final stitch with the first using a slip stitch.",
        "You should make a round with six stitches total.",
        "Weave the tail in.",
        "Weave the tail end into the stitches on the back of the button, using a darning needle if necessary.",
        "Use your hands to slightly flatten the button.",
        "As you stitch or weave in your tail end, weave it through the entire thickness to keep it secure.",
        "Basic Crochet Button, Magic Ring Version Make a magic ring.",
        "Create an adjustable ring, more commonly known as a \"magic ring,\" with your yarn.",
        "Make one chain stitch to secure the loop.",
        "Chain two and make eleven double crochets.",
        "Make two more chain stitches from the loop on your crochet hook.",
        "Work eleven double crochets into the loop of the magic ring.",
        "Gently tug on the ends of the magic ring to close it into a tight circle.",
        "Note that the initial set of two chain stitches will be counted as a single double crochet.",
        "Your circle should have 12 double crochet stitches in it, including your set of two chain stitches.",
        "Seal the end.",
        "Cut the yarn, leaving a long tail, and pull this tail through the loop on your hook to tie it off.",
        "The tail should be at least 8 inches (20.32 cm) long.",
        "Thread the yarn onto a darning needle.",
        "Insert the tail end of the yarn into the eye of a darning needle, loosely tying the end of the yarn onto the needle to hold it on.",
        "Alternatively, you could just hold the end of the yarn in place with your fingertip instead of tying it on.",
        "Close the circle.",
        "Insert the darning needle through the top of your first double crochet and back out through the back loop of the last stitch.",
        "Note that you need to weave it into your first actual double crochet, not through the starting set of two chains.",
        "This should create the appearance of an extra stitch and create a clean appearance with a round edge from the front.",
        "Weave the tail in.",
        "Use your darning needle to weave the tail end into the stitches along the back of the button, securing it while simultaneously hiding it.",
        "Embellished Crochet Button Make a basic crochet button.",
        "Each of these embellished crochet buttons start with one of the basic crochet buttons described above.",
        "Since the stitches are easier to see on the magic ring version, that is usually preferred, but you can experiment with either option.",
        "Create a ridge in a contrasting color.",
        "Use a crochet hook and darning needle to weave a contrasting color of yarn through the edges of your double stitches in a magic ring basic button.",
        "Insert your crochet hook through the top of one of your double stitches.",
        "Grab the contrasting yard from the other side and pull a loop through to the front.",
        "With the loop still on your hook, insert the hook in between the next double crochet stitch of your button, pulling a new, second loop onto your hook.",
        "Pull this second loop through the original loop on your hook.",
        "Continue in this manner, working counter-clockwise around the button and pulling up new loops in between all the double crochet stitches.",
        "When pulling the yarn through the last stitch, cut the yarn and thread the end through a darning needle.",
        "Insert the needle under both loops of your first contrasting color stitch and back through the back loop of your last stitch.",
        "Draw the yarn to the back of the button.",
        "Sew the end into the back of the button with your darning needle.",
        "Make a center star or snowflake.",
        "You can make a simple six-pointed star or snowflake by diagonally weaving roughly 12 inches (30.5 cm) of contrasting yarn through the double stitches of a magic ring simple button with a darning needle.",
        "Cut a piece of contrasting yarn measuring 12 inches (30.5 cm).",
        "Thread the end of this yarn through the eye of a darning needle.",
        "Insert the needle under two loops of one double crochet stitch in your button.",
        "Working over the top of the button, insert the needle into the button's center, pulling it back out through the back.",
        "From the back, insert the needle once more under two loops of the next double crochet stitch in your button.",
        "From the front, insert the needle into the button's center again.",
        "Continue in this manner, creating six lines extending from the center to the edge of the button.",
        "Weave the ends of the yarn through the stitches on the back of the button to secure everything in place.",
        "Embellish with a flower.",
        "A flower embellishment is a little more complex and requires one contrasting color yarn for the center and a second to use when making five petals.",
        "For the center of the flower:\nThread the yarn onto your darning needle.",
        "Pull the darning needle up through the center of the button.",
        "Weave it under one inner loop in the center of the button and back up through the other side.",
        "Loop it around the tip of the needle.",
        "Pull the length of the yarn through the two loops you just created.",
        "Repeat, working a similar stitch into each loop at the center of the button.",
        "Tie it off on the back of the button.",
        "For the petals:\nThread your yarn onto the darning needle.",
        "Pull the yarn up through the center of the button, from underneath the center of your flower.",
        "Do not pull it through the flower center.",
        "Insert the needle back into the center.",
        "Do not pull the loop it creates; instead, leave enough of the loop hanging to extend past the perimeter of the button.",
        "From the back of the button, insert the needle through the stitch at the edge of the button, pulling it up to the front and through the loop you created when working from the center.",
        "Pull to tighten the loop.",
        "One petal should be created.",
        "Weave the needle over the outer edge of the petal and back to the back of the button.",
        "From the back, repeat the same steps, creating four more petals.",
        "Tie off at the back when finished.",
        "Crochet Button Cover[2]\n\tX\n\t\tResearch source Make a magic ring.",
        "Form an adjustable ring with your yarn, more commonly referred to as a \"magic ring.\"",
        "At the end of the ring, make one chain stitch to secure the ring in place.",
        "Create ten single crochets.",
        "Work ten single crochets into the center of the magic ring.",
        "Join the final single crochet with the top of the first single crochet with a slip stitch.",
        "If necessary, tug on the ends of the magic ring to close it into a tight circle.",
        "This completes the first round.",
        "Chain one and work two single crochets into each stitch.",
        "Make one chain stitch to move onto the next round.",
        "Make two single crochets into each stitch of the previous round, joining the last and first at the top with another slip stitch.",
        "This creates an increase, thereby enlarging your circle.",
        "You should have a total of 20 crochet stitches in this second round.",
        "After you finish this round, compare it to the size of the button.",
        "If you are on the right track, you should need to make another front round still to cover the front of the button.",
        "Chain one and increase every other single crochet.",
        "Make one chain stitch to move onto the next round.",
        "Single crochet once in the first stitch of the previous round, then single crochet twice in the next stitch.",
        "Continue all the way around the button, joining the first and last single crochets of this round with another slip stitch.",
        "You should have 30 stitches in this round.",
        "By now, your button cover should be about the same size as your button.",
        "If it is slightly larger, that will work too, since the excess can wrap around the back of the button.",
        "Form the fourth round.",
        "Chain stitch once to move onto the next round.",
        "Single crochet once in the first five stitches of the previous round, then make a single crochet decrease over the next two stitches from the previous round.",
        "Repeat all the way around, joining the last and first single crochets with a slip stitch.",
        "You should have 26 stitches in this round.",
        "The piece should begin to curl under into the shape of a bowl.",
        "Add more decreases for the fifth round.",
        "Chain one to get into the next round.",
        "Single crochet once in each of the next two stitches.",
        "Single crochet decrease over the next two stitches after that.",
        "Continue all the way around, joining the last and first stitches with a slip stitch.",
        "There should be 20 stitches in this round.",
        "Decrease again for the sixth round.",
        "Chain one to get into the sixth round.",
        "Single crochet decrease over the next two stitches.",
        "Repeat all the way around, joining the last stitch and first stitch with a slip stitch.",
        "This should give you a round with 10 stitches in it.",
        "Slide the button into the crochet cover at this point.",
        "You might need to do this before making your final joining slip stitch, just to make sure that the button fits inside.",
        "Decrease again for the seventh round.",
        "Chain one to get into the seventh round.",
        "Single crochet decrease over the next two stitches, and repeat this pattern all the way around.",
        "Join the first and last stitches with a slip stitch.",
        "You should make a total of five stitches for this round.",
        "At this point, the entire back of your button should essentially be covered.",
        "Fasten off and weave in the ends.",
        "Cut the yarn, leaving a tail 8 inches (20.32 cm) long.",
        "Pull this tail through the loop on your hook to fasten it off, then weave the end back and forth across the last stitches to close the cover and secure the ends in place."
    ]
}