{
    "title": "How to Convert Meters to Millimeters",
    "url": "https://www.wikihow.com/Convert-Meters-to-Millimeters",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Mathematics",
        "Conversion Aids"
    ],
    "methods": [
        {
            "name": "Converting Meters to Millimeters",
            "steps": [
                {
                    "headline": "Find the number of whole meters you need to convert to millimeters.",
                    "description": "If this measurement is not given to you, you will need to measure using a meter stick or tape measure. The length of one meter stick is equal to 1 meter. A meter stick is NOT the same as a yardstick. There are 3 feet in a yard, but there are about 3.28 feet in one meter. You will know a measurement is in meters because it will be labeled m{\\displaystyle m}. For example, if the length of a floor is 4 meter sticks long, it is 4m{\\displaystyle 4m} long."
                },
                {
                    "headline": "Find the number of partial meters you need to convert to millimeters.",
                    "description": "Often you will see meters stated in decimals. These means you have a partial meter to convert. If you are measuring, use the centimeter (cm{\\displaystyle cm}) or millimeter (mm{\\displaystyle mm}) units on the meter stick or tape measure. For example, if you measure something that is 4 meters long, plus 30 centimeters, it is 4.3 meters long, because there are 100 centimeters in 1 meter. If you measure something that is 4 meters long, plus 30 millimeters, it is 4.03 meters long, because there are 1000 millimeters in a meter."
                },
                {
                    "headline": "Write the number of meters, and place your pencil on the decimal point.",
                    "description": "To convert meters to millimeters you need to multiply. Since the metric system is based on multiples of ten, the easiest way to do this is by moving the decimal point to the right. For example, if you are converting 4.3m{\\displaystyle 4.3m}, write 4.3{\\displaystyle 4.3} and place your pencil on the decimal point."
                },
                {
                    "headline": "Move your pencil three places to the right.",
                    "description": "Since there are 1,000 millimeters per meter, you need to multiply by 1,000 to convert from meters to millimeters. For example, if your floor is 4.3m{\\displaystyle 4.3m} long, you would move your pencil three decimal places to the right, adding two zeros to the number. This gives you 4,300mm{\\displaystyle 4,300mm}. You could also use a calculator or use the standard multiplication algorithm to calculate 4.3×1,000{\\displaystyle 4.3\\times 1,000}."
                }
            ]
        },
        {
            "name": "Converting Millimeters to Meters",
            "steps": [
                {
                    "headline": "Find the number of millimeters you need to convert to meters.",
                    "description": "If this measurement is not given to you, you will need to measure using a ruler. On a standard American ruler, millimeters can be measured with the smallest lines on the metric (cm{\\displaystyle cm}) side. Make sure you measure millimeters (small lines) and not centimeters (numbered lines). You will know a measurement is in millimeters because it will be labeled mm{\\displaystyle mm}. For example, the length of a pencil might be 155mm{\\displaystyle 155mm} long."
                },
                {
                    "headline": "Write the number of meters, adding a decimal to the right of the last digit.",
                    "description": "Place your pencil on the decimal point. To convert millimeters to meters, you need to divide. Since the metric system is based on multiples of ten, the easiest way to do this is by moving the decimal point to the left. For example, if you are converting 155mm{\\displaystyle 155mm}, write 155.0{\\displaystyle 155.0} and place your pencil on the decimal point."
                },
                {
                    "headline": "Move your pencil three places to the left.",
                    "description": "Since there are 1,000 millimeters per meter, you need to divide by 1,000 to convert from millimeters to meters. For example, if your pencil is 155.0mm{\\displaystyle 155.0mm} long, you would move your pencil three decimal places to the left. This gives you .155m{\\displaystyle .155m}. You could also use a calculator or use the standard division algorithm to calculate 155÷1,000{\\displaystyle 155\\div 1,000}."
                }
            ]
        }
    ],
    "tyn": [
        "Calculator",
        "Pencil",
        "Paper",
        "Brain"
    ],
    "text": " Converting Meters to Millimeters Find the number of whole meters you need to convert to millimeters. If this measurement is not given to you, you will need to measure using a meter stick or tape measure. The length of one meter stick is equal to 1 meter. A meter stick is NOT the same as a yardstick. There are 3 feet in a yard, but there are about 3.28 feet in one meter. You will know a measurement is in meters because it will be labeled m{\\displaystyle m}. For example, if the length of a floor is 4 meter sticks long, it is 4m{\\displaystyle 4m} long. Find the number of partial meters you need to convert to millimeters. Often you will see meters stated in decimals. These means you have a partial meter to convert. If you are measuring, use the centimeter (cm{\\displaystyle cm}) or millimeter (mm{\\displaystyle mm}) units on the meter stick or tape measure. For example, if you measure something that is 4 meters long, plus 30 centimeters, it is 4.3 meters long, because there are 100 centimeters in 1 meter. If you measure something that is 4 meters long, plus 30 millimeters, it is 4.03 meters long, because there are 1000 millimeters in a meter. Write the number of meters, and place your pencil on the decimal point. To convert meters to millimeters you need to multiply. Since the metric system is based on multiples of ten, the easiest way to do this is by moving the decimal point to the right. For example, if you are converting 4.3m{\\displaystyle 4.3m}, write 4.3{\\displaystyle 4.3} and place your pencil on the decimal point. Move your pencil three places to the right. Since there are 1,000 millimeters per meter, you need to multiply by 1,000 to convert from meters to millimeters. For example, if your floor is 4.3m{\\displaystyle 4.3m} long, you would move your pencil three decimal places to the right, adding two zeros to the number. This gives you 4,300mm{\\displaystyle 4,300mm}. You could also use a calculator or use the standard multiplication algorithm to calculate 4.3×1,000{\\displaystyle 4.3\\times 1,000}. Converting Millimeters to Meters Find the number of millimeters you need to convert to meters. If this measurement is not given to you, you will need to measure using a ruler. On a standard American ruler, millimeters can be measured with the smallest lines on the metric (cm{\\displaystyle cm}) side. Make sure you measure millimeters (small lines) and not centimeters (numbered lines). You will know a measurement is in millimeters because it will be labeled mm{\\displaystyle mm}. For example, the length of a pencil might be 155mm{\\displaystyle 155mm} long. Write the number of meters, adding a decimal to the right of the last digit. Place your pencil on the decimal point. To convert millimeters to meters, you need to divide. Since the metric system is based on multiples of ten, the easiest way to do this is by moving the decimal point to the left. For example, if you are converting 155mm{\\displaystyle 155mm}, write 155.0{\\displaystyle 155.0} and place your pencil on the decimal point. Move your pencil three places to the left. Since there are 1,000 millimeters per meter, you need to divide by 1,000 to convert from millimeters to meters. For example, if your pencil is 155.0mm{\\displaystyle 155.0mm} long, you would move your pencil three decimal places to the left. This gives you .155m{\\displaystyle .155m}. You could also use a calculator or use the standard division algorithm to calculate 155÷1,000{\\displaystyle 155\\div 1,000}.",
    "sentences": [
        " Converting Meters to Millimeters Find the number of whole meters you need to convert to millimeters.",
        "If this measurement is not given to you, you will need to measure using a meter stick or tape measure.",
        "The length of one meter stick is equal to 1 meter.",
        "A meter stick is NOT the same as a yardstick.",
        "There are 3 feet in a yard, but there are about 3.28 feet in one meter.",
        "You will know a measurement is in meters because it will be labeled m{\\displaystyle m}.",
        "For example, if the length of a floor is 4 meter sticks long, it is 4m{\\displaystyle 4m} long.",
        "Find the number of partial meters you need to convert to millimeters.",
        "Often you will see meters stated in decimals.",
        "These means you have a partial meter to convert.",
        "If you are measuring, use the centimeter (cm{\\displaystyle cm}) or millimeter (mm{\\displaystyle mm}) units on the meter stick or tape measure.",
        "For example, if you measure something that is 4 meters long, plus 30 centimeters, it is 4.3 meters long, because there are 100 centimeters in 1 meter.",
        "If you measure something that is 4 meters long, plus 30 millimeters, it is 4.03 meters long, because there are 1000 millimeters in a meter.",
        "Write the number of meters, and place your pencil on the decimal point.",
        "To convert meters to millimeters you need to multiply.",
        "Since the metric system is based on multiples of ten, the easiest way to do this is by moving the decimal point to the right.",
        "For example, if you are converting 4.3m{\\displaystyle 4.3m}, write 4.3{\\displaystyle 4.3} and place your pencil on the decimal point.",
        "Move your pencil three places to the right.",
        "Since there are 1,000 millimeters per meter, you need to multiply by 1,000 to convert from meters to millimeters.",
        "For example, if your floor is 4.3m{\\displaystyle 4.3m} long, you would move your pencil three decimal places to the right, adding two zeros to the number.",
        "This gives you 4,300mm{\\displaystyle 4,300mm}.",
        "You could also use a calculator or use the standard multiplication algorithm to calculate 4.3×1,000{\\displaystyle 4.3\\times 1,000}.",
        "Converting Millimeters to Meters Find the number of millimeters you need to convert to meters.",
        "If this measurement is not given to you, you will need to measure using a ruler.",
        "On a standard American ruler, millimeters can be measured with the smallest lines on the metric (cm{\\displaystyle cm}) side.",
        "Make sure you measure millimeters (small lines) and not centimeters (numbered lines).",
        "You will know a measurement is in millimeters because it will be labeled mm{\\displaystyle mm}.",
        "For example, the length of a pencil might be 155mm{\\displaystyle 155mm} long.",
        "Write the number of meters, adding a decimal to the right of the last digit.",
        "Place your pencil on the decimal point.",
        "To convert millimeters to meters, you need to divide.",
        "Since the metric system is based on multiples of ten, the easiest way to do this is by moving the decimal point to the left.",
        "For example, if you are converting 155mm{\\displaystyle 155mm}, write 155.0{\\displaystyle 155.0} and place your pencil on the decimal point.",
        "Move your pencil three places to the left.",
        "Since there are 1,000 millimeters per meter, you need to divide by 1,000 to convert from millimeters to meters.",
        "For example, if your pencil is 155.0mm{\\displaystyle 155.0mm} long, you would move your pencil three decimal places to the left.",
        "This gives you .155m{\\displaystyle .155m}.",
        "You could also use a calculator or use the standard division algorithm to calculate 155÷1,000{\\displaystyle 155\\div 1,000}."
    ]
}