{
    "title": "How to Crochet a Ruffle Scarf",
    "url": "https://www.wikihow.com/Crochet-a-Ruffle-Scarf",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Knitting and Crochet",
        "Crochet"
    ],
    "methods": [
        {
            "name": "Using Single Crochet to Make Ruffles",
            "steps": [
                {
                    "headline": "Fold over the first five loops of the yarn.",
                    "description": "Take your sashay yarn and unfurl it so that it looks like a wide flat piece of ribbon. Then, find the loops at the top of the yarn. These will look like small rectangular spaces large enough to easily put your hook through. Count five of these loops and then fold you’re your yarn."
                },
                {
                    "headline": "Insert your hook through the first loop.",
                    "description": "With the folded over piece of yarn behind your working yarn, insert your hook through the first loop. For these first few stitches, you will be working through the folded over yarn as well, so you will really be going through two loops."
                },
                {
                    "headline": "Skip a loop and chain one.",
                    "description": "After getting the first two loops on your hook, skip over the next loop and then insert the hook through the one after that (make sure to get the front and back loop) and chain one. Repeat this four times. To  chain with sashay yarn, insert the hook through a loop and then through another. Then, pull the second loop through the first loop on your hook."
                },
                {
                    "headline": "Turn your work and single crochet into first stitch.",
                    "description": "After you finish four stitches, turn your work and then begin working single crochet stitches into the loops. Do your first single crochet stitch in the first chain stitch in your row. Single crochet every other stitch to the end of your row. To single crochet with sashay yarn, insert the crochet hook into the first stitch and then through a loop on your working yarn. Pull the loop through the first stitch. Then, insert the hook through another loop in your working yarn and pull through both of the other loops on your hook. Continue to turn and single crochet across every row until your scarf is the desired length. You can make a ruffle scarf with just one ball of sashay yarn, but you may make it longer if you prefer."
                },
                {
                    "headline": "Trim the yarn.",
                    "description": "Once you reach the end of the scarf, cut the yarn, leaving a 6-inch (15.25-cm) tail. Tuck this tail end in between the nearest two ruffles. Use a sewing needle and thread to tack the end in place, securing it and preventing the scarf from unraveling. This completes your ruffle scarf."
                }
            ]
        },
        {
            "name": "Gathering the Yarn Over to Make Ruffles",
            "steps": [
                {
                    "headline": "Fold over the edge of your sashay yarn.",
                    "description": "Start by folding over the edge of your sashay yarn to hide the unfinished edge. You can just fold over the first five stitches of your sashay yarn to start."
                },
                {
                    "headline": "Insert your hook through nine loops and pull through.",
                    "description": "To make your first gathered stitch, insert the hook through the first nine loops in your row. Then, skip the tenth loop and insert through the eleventh loop. Pull this loop through the other nine loops on your hook to make your first ruffle."
                },
                {
                    "headline": "Fold over the yarn again so that there are 11 loops.",
                    "description": "Next, fold you’re your yarn so that you have 11 loops lined up. Then, repeat the gathering stitch. Continue to fold over and gather all the way to the end of your ball of yarn. When you are finished, you will have a ruffle scarf."
                }
            ]
        },
        {
            "name": "Ensuring a Successful Project",
            "steps": [
                {
                    "headline": "Use sashay yarn.",
                    "description": "You will need to use a special kind of yarn to make a ruffle scarf. This yarn is called sashay yarn and it looks like a long strip of mesh when you unfurl it. Choose a sashay yarn in the color of your choice. You can use another type of yarn that is designed to create ruffles as well. For example, you could try using a ribbon yarn or a chiffon yarn."
                },
                {
                    "headline": "Choose an appropriate hook size.",
                    "description": "You will also need to use a crochet hook that is appropriate for your sashay yarn. Check the yarn label to see what size hook is recommended. A size J-10 (6mm) or K-10 (6.5mm) hook should work well for this project."
                },
                {
                    "headline": "Use stitch markers.",
                    "description": "Sashay yarn can be a little tricky to work with because of all of the loops. Placing stitch markers to indicate where you started working and where each of your rows begins and ends can help to make working with this yarn a little easier."
                }
            ]
        }
    ],
    "tyn": [
        "1 ball Sashay-style yarn (ribbon yarn or mesh yarn)",
        "Crochet hook in a size that is appropriate for the yarn. (Check the label.)",
        "Stitch markers (optional)",
        "Sewing needle",
        "Sewing thread",
        "Scissors"
    ],
    "text": " Using Single Crochet to Make Ruffles Fold over the first five loops of the yarn. Take your sashay yarn and unfurl it so that it looks like a wide flat piece of ribbon. Then, find the loops at the top of the yarn. These will look like small rectangular spaces large enough to easily put your hook through. Count five of these loops and then fold you’re your yarn. Insert your hook through the first loop. With the folded over piece of yarn behind your working yarn, insert your hook through the first loop. For these first few stitches, you will be working through the folded over yarn as well, so you will really be going through two loops. Skip a loop and chain one. After getting the first two loops on your hook, skip over the next loop and then insert the hook through the one after that (make sure to get the front and back loop) and chain one. Repeat this four times. To  chain with sashay yarn, insert the hook through a loop and then through another. Then, pull the second loop through the first loop on your hook. Turn your work and single crochet into first stitch. After you finish four stitches, turn your work and then begin working single crochet stitches into the loops. Do your first single crochet stitch in the first chain stitch in your row. Single crochet every other stitch to the end of your row. To single crochet with sashay yarn, insert the crochet hook into the first stitch and then through a loop on your working yarn. Pull the loop through the first stitch. Then, insert the hook through another loop in your working yarn and pull through both of the other loops on your hook. Continue to turn and single crochet across every row until your scarf is the desired length. You can make a ruffle scarf with just one ball of sashay yarn, but you may make it longer if you prefer. Trim the yarn. Once you reach the end of the scarf, cut the yarn, leaving a 6-inch (15.25-cm) tail. Tuck this tail end in between the nearest two ruffles. Use a sewing needle and thread to tack the end in place, securing it and preventing the scarf from unraveling. This completes your ruffle scarf. Gathering the Yarn Over to Make Ruffles Fold over the edge of your sashay yarn. Start by folding over the edge of your sashay yarn to hide the unfinished edge. You can just fold over the first five stitches of your sashay yarn to start. Insert your hook through nine loops and pull through. To make your first gathered stitch, insert the hook through the first nine loops in your row. Then, skip the tenth loop and insert through the eleventh loop. Pull this loop through the other nine loops on your hook to make your first ruffle. Fold over the yarn again so that there are 11 loops. Next, fold you’re your yarn so that you have 11 loops lined up. Then, repeat the gathering stitch. Continue to fold over and gather all the way to the end of your ball of yarn. When you are finished, you will have a ruffle scarf. Ensuring a Successful Project Use sashay yarn. You will need to use a special kind of yarn to make a ruffle scarf. This yarn is called sashay yarn and it looks like a long strip of mesh when you unfurl it. Choose a sashay yarn in the color of your choice. You can use another type of yarn that is designed to create ruffles as well. For example, you could try using a ribbon yarn or a chiffon yarn. Choose an appropriate hook size. You will also need to use a crochet hook that is appropriate for your sashay yarn. Check the yarn label to see what size hook is recommended. A size J-10 (6mm) or K-10 (6.5mm) hook should work well for this project. Use stitch markers. Sashay yarn can be a little tricky to work with because of all of the loops. Placing stitch markers to indicate where you started working and where each of your rows begins and ends can help to make working with this yarn a little easier.",
    "sentences": [
        " Using Single Crochet to Make Ruffles Fold over the first five loops of the yarn.",
        "Take your sashay yarn and unfurl it so that it looks like a wide flat piece of ribbon.",
        "Then, find the loops at the top of the yarn.",
        "These will look like small rectangular spaces large enough to easily put your hook through.",
        "Count five of these loops and then fold you’re your yarn.",
        "Insert your hook through the first loop.",
        "With the folded over piece of yarn behind your working yarn, insert your hook through the first loop.",
        "For these first few stitches, you will be working through the folded over yarn as well, so you will really be going through two loops.",
        "Skip a loop and chain one.",
        "After getting the first two loops on your hook, skip over the next loop and then insert the hook through the one after that (make sure to get the front and back loop) and chain one.",
        "Repeat this four times.",
        "To  chain with sashay yarn, insert the hook through a loop and then through another.",
        "Then, pull the second loop through the first loop on your hook.",
        "Turn your work and single crochet into first stitch.",
        "After you finish four stitches, turn your work and then begin working single crochet stitches into the loops.",
        "Do your first single crochet stitch in the first chain stitch in your row.",
        "Single crochet every other stitch to the end of your row.",
        "To single crochet with sashay yarn, insert the crochet hook into the first stitch and then through a loop on your working yarn.",
        "Pull the loop through the first stitch.",
        "Then, insert the hook through another loop in your working yarn and pull through both of the other loops on your hook.",
        "Continue to turn and single crochet across every row until your scarf is the desired length.",
        "You can make a ruffle scarf with just one ball of sashay yarn, but you may make it longer if you prefer.",
        "Trim the yarn.",
        "Once you reach the end of the scarf, cut the yarn, leaving a 6-inch (15.25-cm) tail.",
        "Tuck this tail end in between the nearest two ruffles.",
        "Use a sewing needle and thread to tack the end in place, securing it and preventing the scarf from unraveling.",
        "This completes your ruffle scarf.",
        "Gathering the Yarn Over to Make Ruffles Fold over the edge of your sashay yarn.",
        "Start by folding over the edge of your sashay yarn to hide the unfinished edge.",
        "You can just fold over the first five stitches of your sashay yarn to start.",
        "Insert your hook through nine loops and pull through.",
        "To make your first gathered stitch, insert the hook through the first nine loops in your row.",
        "Then, skip the tenth loop and insert through the eleventh loop.",
        "Pull this loop through the other nine loops on your hook to make your first ruffle.",
        "Fold over the yarn again so that there are 11 loops.",
        "Next, fold you’re your yarn so that you have 11 loops lined up.",
        "Then, repeat the gathering stitch.",
        "Continue to fold over and gather all the way to the end of your ball of yarn.",
        "When you are finished, you will have a ruffle scarf.",
        "Ensuring a Successful Project Use sashay yarn.",
        "You will need to use a special kind of yarn to make a ruffle scarf.",
        "This yarn is called sashay yarn and it looks like a long strip of mesh when you unfurl it.",
        "Choose a sashay yarn in the color of your choice.",
        "You can use another type of yarn that is designed to create ruffles as well.",
        "For example, you could try using a ribbon yarn or a chiffon yarn.",
        "Choose an appropriate hook size.",
        "You will also need to use a crochet hook that is appropriate for your sashay yarn.",
        "Check the yarn label to see what size hook is recommended.",
        "A size J-10 (6mm) or K-10 (6.5mm) hook should work well for this project.",
        "Use stitch markers.",
        "Sashay yarn can be a little tricky to work with because of all of the loops.",
        "Placing stitch markers to indicate where you started working and where each of your rows begins and ends can help to make working with this yarn a little easier."
    ]
}