{
    "title": "How to Do Tile Painting",
    "url": "https://www.wikihow.com/Do-Tile-Painting",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "parts": [
        {
            "name": "Gathering Materials",
            "steps": [
                {
                    "headline": "Purchase ceramic, epoxy, enamel, or latex paint.",
                    "description": "Using the right paint is very important. Water-based paint like acrylic, watercolors, or spray paint will not work at all, especially if you’re painting bathroom or kitchen tile. You can use commercial tile or ceramic paint, oil-based paint, colored epoxy, enamel, or latex paint."
                },
                {
                    "headline": "Choose the best brushes for your project.",
                    "description": "If you are painting an intricate scene or design on your tile, you'll most likely need several different sizes of brushes. If you are painting a large bathroom wall, for example, you can use a larger brush."
                },
                {
                    "headline": "Set up your supplies and protect your work area.",
                    "description": "Lay out cleaning supplies, sandpaper, and protective gear. You'll need to take a few precautions to prevent injury or paint spills in your work area. Lay a tarp down on the floor to prevent paint from dripping on it. Line the edges of your work area with painter's tape. Keep damp rags nearby in case you need to fix any mistakes. Open windows or bring a fan into the room for ventilation. Wear a painter's mask to avoid inhaling fumes. If you're working in the kitchen, move food to another area to prevent contamination."
                }
            ]
        },
        {
            "name": "Prepping Your Tile",
            "steps": [
                {
                    "headline": "Clean the tile with degreaser and tile cleaner.",
                    "description": "If your tile is brand new, you can just wipe off the surface. Older tile, especially flooring or bathroom tile, will need to be cleaned thoroughly. Start by using a degreaser, then wash the tile with tile cleaner or soap and water. It’s very important that your tile is perfectly clean, so don’t skip this step! Use bleach or hydrogen peroxide to remove any mold. Vinegar works well for removing soap scum and shower residue."
                },
                {
                    "headline": "Sand your tile with 1800-grit paper until it's no longer smooth.",
                    "description": "You won’t need to sand unglazed tile, but any ceramic that has already been glazed will need to be sanded to provide a rough surface for the paint to adhere to. Use 1800-grit sandpaper to smooth the tile and remove uneven gloss."
                },
                {
                    "headline": "Wipe off the dust with a damp rag.",
                    "description": "Sanding creates a lot of dust, and it will affect the look of your paint. Make sure all of the dust from sanding is gone by wiping the entire surface with a damp cloth. You can also vacuum away any accumulated dust."
                },
                {
                    "headline": "Apply an oil-based high adhesion primer to home surfaces.",
                    "description": "Oil primers are efficient at preventing stains and holding on to ceramic and/or oil-based paint, but you won’t need to use them for decorative art tiles that won’t be walked on or used. If you’re planning to paint in a high-traffic area, like the shower or the hallway floor, use two coats."
                },
                {
                    "headline": "Wait at least 24 hours for the primer to dry.",
                    "description": "Check the primer's label for a precise drying time. If you're working in an area with a lot of moisture, like the bathroom, you may want to wait 48 hours."
                }
            ]
        },
        {
            "name": "Painting Your Tile",
            "steps": [
                {
                    "headline": "Decide on your colors or design.",
                    "description": "If you are painting existing tile in your home, make sure that the colors you choose complement the rest of your design scheme. It is usually best to choose light colors when painting your tile, as dark or bright colors can overwhelm a room. If you’re painting a design, choose one that will be easy for you to do and will look good in your home."
                },
                {
                    "headline": "Create a painted design (optional).",
                    "description": "If you want to paint a design, try searching for inspiration in Spanish, Portuguese, or Chinese tile paintings. You could also try a geometric design, like a chevron pattern or checks."
                },
                {
                    "headline": "Transfer your design to the tile with a pencil.",
                    "description": "If you have an intricate design, draw it on the tile with pencil first. Be sure to press the pencil very lightly so that it is easy to hide with paint and/or erase if necessary. You can also practice on paper beforehand."
                },
                {
                    "headline": "Paint your tile.",
                    "description": "If you are painting a design, start with the lightest color first to avoid smudges, and let each color dry before starting a new one. If you’re painting a home surface in a solid color, apply the paint in multiple thin layers. It’s usually necessary to do at least 3 layers, especially if your paint color is lighter than the original color. Painting over the grout is much easier than trying to avoid it, and it isn’t noticeable if you choose a light color."
                },
                {
                    "headline": "Let the paint dry for at least 24 hours.",
                    "description": "For small art projects, 24 hours will be enough, but for larger home surfaces, wait for at least 48 hours. This is especially important for high-traffic areas like the bathroom or kitchen counter. If you’ve painted a ceramic bathtub, wait for several days before filling it with warm water."
                },
                {
                    "headline": "Coat with clear urethane to seal in the paint.",
                    "description": "You can buy urethane from any home supply store. It’s important to use a sealant like urethane that is made for ceramics, especially if you’re painting kitchen or bathroom tiles that get a lot of use and come into contact with moisture. Apply according to the package directions and let it dry thoroughly before touching your tile."
                }
            ]
        }
    ],
    "tyn": [
        "Ceramic tile",
        "Cleaning products to prep surface",
        "Orbital sander with 1800 grit sandpaper (if necessary)",
        "Safety goggles and a painter's mask",
        "Newspaper or drop cloth for covering workspace",
        "Water for cleaning brushes",
        "Non-water-based paint (tile paint, epoxy, enamel, oil-based paint)",
        "Paintbrush",
        "Clear urethane"
    ],
    "text": " Gathering Materials Purchase ceramic, epoxy, enamel, or latex paint. Using the right paint is very important. Water-based paint like acrylic, watercolors, or spray paint will not work at all, especially if you’re painting bathroom or kitchen tile. You can use commercial tile or ceramic paint, oil-based paint, colored epoxy, enamel, or latex paint. Choose the best brushes for your project. If you are painting an intricate scene or design on your tile, you'll most likely need several different sizes of brushes. If you are painting a large bathroom wall, for example, you can use a larger brush. Set up your supplies and protect your work area. Lay out cleaning supplies, sandpaper, and protective gear. You'll need to take a few precautions to prevent injury or paint spills in your work area. Lay a tarp down on the floor to prevent paint from dripping on it. Line the edges of your work area with painter's tape. Keep damp rags nearby in case you need to fix any mistakes. Open windows or bring a fan into the room for ventilation. Wear a painter's mask to avoid inhaling fumes. If you're working in the kitchen, move food to another area to prevent contamination. Prepping Your Tile Clean the tile with degreaser and tile cleaner. If your tile is brand new, you can just wipe off the surface. Older tile, especially flooring or bathroom tile, will need to be cleaned thoroughly. Start by using a degreaser, then wash the tile with tile cleaner or soap and water. It’s very important that your tile is perfectly clean, so don’t skip this step! Use bleach or hydrogen peroxide to remove any mold. Vinegar works well for removing soap scum and shower residue. Sand your tile with 1800-grit paper until it's no longer smooth. You won’t need to sand unglazed tile, but any ceramic that has already been glazed will need to be sanded to provide a rough surface for the paint to adhere to. Use 1800-grit sandpaper to smooth the tile and remove uneven gloss. Wipe off the dust with a damp rag. Sanding creates a lot of dust, and it will affect the look of your paint. Make sure all of the dust from sanding is gone by wiping the entire surface with a damp cloth. You can also vacuum away any accumulated dust. Apply an oil-based high adhesion primer to home surfaces. Oil primers are efficient at preventing stains and holding on to ceramic and/or oil-based paint, but you won’t need to use them for decorative art tiles that won’t be walked on or used. If you’re planning to paint in a high-traffic area, like the shower or the hallway floor, use two coats. Wait at least 24 hours for the primer to dry. Check the primer's label for a precise drying time. If you're working in an area with a lot of moisture, like the bathroom, you may want to wait 48 hours. Painting Your Tile Decide on your colors or design. If you are painting existing tile in your home, make sure that the colors you choose complement the rest of your design scheme. It is usually best to choose light colors when painting your tile, as dark or bright colors can overwhelm a room. If you’re painting a design, choose one that will be easy for you to do and will look good in your home. Create a painted design (optional). If you want to paint a design, try searching for inspiration in Spanish, Portuguese, or Chinese tile paintings. You could also try a geometric design, like a chevron pattern or checks. Transfer your design to the tile with a pencil. If you have an intricate design, draw it on the tile with pencil first. Be sure to press the pencil very lightly so that it is easy to hide with paint and/or erase if necessary. You can also practice on paper beforehand. Paint your tile. If you are painting a design, start with the lightest color first to avoid smudges, and let each color dry before starting a new one. If you’re painting a home surface in a solid color, apply the paint in multiple thin layers. It’s usually necessary to do at least 3 layers, especially if your paint color is lighter than the original color. Painting over the grout is much easier than trying to avoid it, and it isn’t noticeable if you choose a light color. Let the paint dry for at least 24 hours. For small art projects, 24 hours will be enough, but for larger home surfaces, wait for at least 48 hours. This is especially important for high-traffic areas like the bathroom or kitchen counter. If you’ve painted a ceramic bathtub, wait for several days before filling it with warm water. Coat with clear urethane to seal in the paint. You can buy urethane from any home supply store. It’s important to use a sealant like urethane that is made for ceramics, especially if you’re painting kitchen or bathroom tiles that get a lot of use and come into contact with moisture. Apply according to the package directions and let it dry thoroughly before touching your tile.",
    "sentences": [
        " Gathering Materials Purchase ceramic, epoxy, enamel, or latex paint.",
        "Using the right paint is very important.",
        "Water-based paint like acrylic, watercolors, or spray paint will not work at all, especially if you’re painting bathroom or kitchen tile.",
        "You can use commercial tile or ceramic paint, oil-based paint, colored epoxy, enamel, or latex paint.",
        "Choose the best brushes for your project.",
        "If you are painting an intricate scene or design on your tile, you'll most likely need several different sizes of brushes.",
        "If you are painting a large bathroom wall, for example, you can use a larger brush.",
        "Set up your supplies and protect your work area.",
        "Lay out cleaning supplies, sandpaper, and protective gear.",
        "You'll need to take a few precautions to prevent injury or paint spills in your work area.",
        "Lay a tarp down on the floor to prevent paint from dripping on it.",
        "Line the edges of your work area with painter's tape.",
        "Keep damp rags nearby in case you need to fix any mistakes.",
        "Open windows or bring a fan into the room for ventilation.",
        "Wear a painter's mask to avoid inhaling fumes.",
        "If you're working in the kitchen, move food to another area to prevent contamination.",
        "Prepping Your Tile Clean the tile with degreaser and tile cleaner.",
        "If your tile is brand new, you can just wipe off the surface.",
        "Older tile, especially flooring or bathroom tile, will need to be cleaned thoroughly.",
        "Start by using a degreaser, then wash the tile with tile cleaner or soap and water.",
        "It’s very important that your tile is perfectly clean, so don’t skip this step!",
        "Use bleach or hydrogen peroxide to remove any mold.",
        "Vinegar works well for removing soap scum and shower residue.",
        "Sand your tile with 1800-grit paper until it's no longer smooth.",
        "You won’t need to sand unglazed tile, but any ceramic that has already been glazed will need to be sanded to provide a rough surface for the paint to adhere to.",
        "Use 1800-grit sandpaper to smooth the tile and remove uneven gloss.",
        "Wipe off the dust with a damp rag.",
        "Sanding creates a lot of dust, and it will affect the look of your paint.",
        "Make sure all of the dust from sanding is gone by wiping the entire surface with a damp cloth.",
        "You can also vacuum away any accumulated dust.",
        "Apply an oil-based high adhesion primer to home surfaces.",
        "Oil primers are efficient at preventing stains and holding on to ceramic and/or oil-based paint, but you won’t need to use them for decorative art tiles that won’t be walked on or used.",
        "If you’re planning to paint in a high-traffic area, like the shower or the hallway floor, use two coats.",
        "Wait at least 24 hours for the primer to dry.",
        "Check the primer's label for a precise drying time.",
        "If you're working in an area with a lot of moisture, like the bathroom, you may want to wait 48 hours.",
        "Painting Your Tile Decide on your colors or design.",
        "If you are painting existing tile in your home, make sure that the colors you choose complement the rest of your design scheme.",
        "It is usually best to choose light colors when painting your tile, as dark or bright colors can overwhelm a room.",
        "If you’re painting a design, choose one that will be easy for you to do and will look good in your home.",
        "Create a painted design (optional).",
        "If you want to paint a design, try searching for inspiration in Spanish, Portuguese, or Chinese tile paintings.",
        "You could also try a geometric design, like a chevron pattern or checks.",
        "Transfer your design to the tile with a pencil.",
        "If you have an intricate design, draw it on the tile with pencil first.",
        "Be sure to press the pencil very lightly so that it is easy to hide with paint and/or erase if necessary.",
        "You can also practice on paper beforehand.",
        "Paint your tile.",
        "If you are painting a design, start with the lightest color first to avoid smudges, and let each color dry before starting a new one.",
        "If you’re painting a home surface in a solid color, apply the paint in multiple thin layers.",
        "It’s usually necessary to do at least 3 layers, especially if your paint color is lighter than the original color.",
        "Painting over the grout is much easier than trying to avoid it, and it isn’t noticeable if you choose a light color.",
        "Let the paint dry for at least 24 hours.",
        "For small art projects, 24 hours will be enough, but for larger home surfaces, wait for at least 48 hours.",
        "This is especially important for high-traffic areas like the bathroom or kitchen counter.",
        "If you’ve painted a ceramic bathtub, wait for several days before filling it with warm water.",
        "Coat with clear urethane to seal in the paint.",
        "You can buy urethane from any home supply store.",
        "It’s important to use a sealant like urethane that is made for ceramics, especially if you’re painting kitchen or bathroom tiles that get a lot of use and come into contact with moisture.",
        "Apply according to the package directions and let it dry thoroughly before touching your tile."
    ]
}