{
    "title": "How to Make Bubbles",
    "url": "https://www.wikihow.com/Make-Bubbles",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Craft for Kids"
    ],
    "parts": [
        {
            "name": "Choosing or Making a Bubble Solution",
            "steps": [
                {
                    "headline": "Buy a premixed bubble solution for an easy option.",
                    "description": "Most grocery and toy stores sell small, plastic bottles of bubble solution that are ready to use. Most bottles will include plastic bubble wands already attached to the bottle's lid. You can use that or make your own wand."
                },
                {
                    "headline": "Make your own basic bubble solution at home.",
                    "description": "If you have liquid dish soap, white sugar, and water, you can make your own bubble solution! Just mix 4 cups (950 ml) of warm water with 1/2 cup (120 g) of white sugar. Then, stir in ⁄2 cup (120 ml) of liquid dish soap to complete your solution.Keep leftover bubble solution in a glass or plastic container with a lid. Letting the solution sit for a few hours or overnight will result in stronger bubbles. If you can wait a week, that's even better!"
                },
                {
                    "headline": "Tweak your bubble solution to change the color or texture.",
                    "description": "Once you have a basic bubble solution mixed up, you can make it unique by adding ingredients that change the texture and color. For example:\nStir in ⁄4 cup (59 ml) of vegetable glycerin or 1/2 cup (60 g) of cornstarch to thicken the solution and create stronger bubbles. Add a few drops of food coloring to the solution to customize the hue. Use different colored liquid dish soaps to experiment with color."
                }
            ]
        },
        {
            "name": "Selecting a Bubble Wand",
            "steps": [
                {
                    "headline": "Buy a bubble wand from a grocery or toy store for a simple option.",
                    "description": "If you buy premixed bubble solution from the store, it will probably come with a small plastic wand attached to the lid. These bubble wands are usually a few inches in length, with a handle on one side and a plastic circle with a hole on the other. You can find wands in different shapes and sizes in toy stores, too. You can also buy a giant bubble-blowing kit. These come with a big wand with a net that is capable of making very large bubbles."
                },
                {
                    "headline": "Make your own bubble wand with a pipe cleaner for a quick solution.",
                    "description": "All you have to do is bend one end of a pipe cleaner into a circle shape to create a simple bubble wand. The bigger you make the circle, the bigger your bubbles will be!You can also experiment with different shapes by forming a heart, star, or square instead of a circle."
                },
                {
                    "headline": "Use a slotted spoon or a cookie cutter for a ready-made wand.",
                    "description": "The holes in a slotted spoon or the opening in a cookie cutter can easily create bubbles. A slotted spoon already has a handle, so it's ready to go. You can duct tape the cookie cutter to the end of a stick to create a handle for your wand.You can also experiment with other utensils from your kitchen, like plastic funnels, paper cones, and straws."
                },
                {
                    "headline": "Make a wand with a wire clothes hanger to create huge bubbles.",
                    "description": "Get an adult to help you cut the hooked end off of a wire coat hanger with wire cutters. Then, shape the hanger into a circle, star, heart, or any other shape you want. Attach your shape to a stick with duct tape to create a handle.You can tie feathers or wrap colored twine around the handle to jazz up your giant bubble wand!"
                }
            ]
        },
        {
            "name": "Creating Bubbles",
            "steps": [
                {
                    "headline": "Bring your wand and the bubble solution to an open space.",
                    "description": "Since bursting bubbles can make a mess and create slippery floors, it's best to set up somewhere outside, like your backyard or in a park. Plus, bubbles look so cool when the sun highlights their rainbow colors!"
                },
                {
                    "headline": "Pour the bubble solution into a jar or large container.",
                    "description": "No matter what kind of bubble wand you're using, you have to be able to dip the end of it all the way into the bubble solution to create bubbles with it. You may need to pour your solution into a large bowl, bucket, or potted plant tray with a wide mouth if you're using a pretty big wand. If your wand is small, a glass or plastic jar will work fine.If you have a kiddie pool and a hula hoop, you can pour bubble solution into the pool and use the hula hoop to make gigantic bubbles! If your wand and container are really big, you may need to make a double batch of bubble solution."
                },
                {
                    "headline": "Dip the end of your wand completely into the bubble solution.",
                    "description": "Make sure the shaped end of your wand is fully submerged. When you pull the wand out of the solution, the solution should look like a thin membrane stretched over the hole. The solution will look sort of like plastic wrap when it's correctly stretched over the wand and ready to go. If the end of the wand isn't properly coated after the first dip, submerge it again. You can do this as many times as you need to."
                },
                {
                    "headline": "Make small bubbles by blowing with your mouth.",
                    "description": "Hold the end of a smaller wand up to your mouth and gently blow. The membrane will form a bubble and detach from your wand to float away in the breeze. You can blow faster to make lots of tiny bubbles, or blow slower to make bigger bubbles!"
                },
                {
                    "headline": "Make giant bubbles by waving the wand through the air.",
                    "description": "When you're using a giant bubble wand, you won't be able to blow bubbles with your mouth. Instead, gently wave the wand through the air. The solution will stretch out behind the wand, separate, and form a giant, undulating bubble.Let the wind blow through the opening to see what kind of bubbles you get. Try walking or running with the wand to make an even bigger bubble. Twirl around in place to surround yourself with bubbles. Hold the wand high above your head so the bubble has more time to float around before it hits the ground and bursts."
                }
            ]
        }
    ],
    "tyn": [
        "Bubble solution",
        "Bubble wand",
        "Bowl or dish",
        "Slotted spoon (optional)",
        "Pipe cleaner (optional)",
        "Cookie cutter (optional)",
        "Wire clothes hanger (optional)"
    ],
    "text": " Choosing or Making a Bubble Solution Buy a premixed bubble solution for an easy option. Most grocery and toy stores sell small, plastic bottles of bubble solution that are ready to use. Most bottles will include plastic bubble wands already attached to the bottle's lid. You can use that or make your own wand. Make your own basic bubble solution at home. If you have liquid dish soap, white sugar, and water, you can make your own bubble solution! Just mix 4 cups (950 ml) of warm water with 1/2 cup (120 g) of white sugar. Then, stir in ⁄2 cup (120 ml) of liquid dish soap to complete your solution.Keep leftover bubble solution in a glass or plastic container with a lid. Letting the solution sit for a few hours or overnight will result in stronger bubbles. If you can wait a week, that's even better! Tweak your bubble solution to change the color or texture. Once you have a basic bubble solution mixed up, you can make it unique by adding ingredients that change the texture and color. For example:\nStir in ⁄4 cup (59 ml) of vegetable glycerin or 1/2 cup (60 g) of cornstarch to thicken the solution and create stronger bubbles. Add a few drops of food coloring to the solution to customize the hue. Use different colored liquid dish soaps to experiment with color. Selecting a Bubble Wand Buy a bubble wand from a grocery or toy store for a simple option. If you buy premixed bubble solution from the store, it will probably come with a small plastic wand attached to the lid. These bubble wands are usually a few inches in length, with a handle on one side and a plastic circle with a hole on the other. You can find wands in different shapes and sizes in toy stores, too. You can also buy a giant bubble-blowing kit. These come with a big wand with a net that is capable of making very large bubbles. Make your own bubble wand with a pipe cleaner for a quick solution. All you have to do is bend one end of a pipe cleaner into a circle shape to create a simple bubble wand. The bigger you make the circle, the bigger your bubbles will be!You can also experiment with different shapes by forming a heart, star, or square instead of a circle. Use a slotted spoon or a cookie cutter for a ready-made wand. The holes in a slotted spoon or the opening in a cookie cutter can easily create bubbles. A slotted spoon already has a handle, so it's ready to go. You can duct tape the cookie cutter to the end of a stick to create a handle for your wand.You can also experiment with other utensils from your kitchen, like plastic funnels, paper cones, and straws. Make a wand with a wire clothes hanger to create huge bubbles. Get an adult to help you cut the hooked end off of a wire coat hanger with wire cutters. Then, shape the hanger into a circle, star, heart, or any other shape you want. Attach your shape to a stick with duct tape to create a handle.You can tie feathers or wrap colored twine around the handle to jazz up your giant bubble wand! Creating Bubbles Bring your wand and the bubble solution to an open space. Since bursting bubbles can make a mess and create slippery floors, it's best to set up somewhere outside, like your backyard or in a park. Plus, bubbles look so cool when the sun highlights their rainbow colors! Pour the bubble solution into a jar or large container. No matter what kind of bubble wand you're using, you have to be able to dip the end of it all the way into the bubble solution to create bubbles with it. You may need to pour your solution into a large bowl, bucket, or potted plant tray with a wide mouth if you're using a pretty big wand. If your wand is small, a glass or plastic jar will work fine.If you have a kiddie pool and a hula hoop, you can pour bubble solution into the pool and use the hula hoop to make gigantic bubbles! If your wand and container are really big, you may need to make a double batch of bubble solution. Dip the end of your wand completely into the bubble solution. Make sure the shaped end of your wand is fully submerged. When you pull the wand out of the solution, the solution should look like a thin membrane stretched over the hole. The solution will look sort of like plastic wrap when it's correctly stretched over the wand and ready to go. If the end of the wand isn't properly coated after the first dip, submerge it again. You can do this as many times as you need to. Make small bubbles by blowing with your mouth. Hold the end of a smaller wand up to your mouth and gently blow. The membrane will form a bubble and detach from your wand to float away in the breeze. You can blow faster to make lots of tiny bubbles, or blow slower to make bigger bubbles! Make giant bubbles by waving the wand through the air. When you're using a giant bubble wand, you won't be able to blow bubbles with your mouth. Instead, gently wave the wand through the air. The solution will stretch out behind the wand, separate, and form a giant, undulating bubble.Let the wind blow through the opening to see what kind of bubbles you get. Try walking or running with the wand to make an even bigger bubble. Twirl around in place to surround yourself with bubbles. Hold the wand high above your head so the bubble has more time to float around before it hits the ground and bursts.",
    "sentences": [
        " Choosing or Making a Bubble Solution Buy a premixed bubble solution for an easy option.",
        "Most grocery and toy stores sell small, plastic bottles of bubble solution that are ready to use.",
        "Most bottles will include plastic bubble wands already attached to the bottle's lid.",
        "You can use that or make your own wand.",
        "Make your own basic bubble solution at home.",
        "If you have liquid dish soap, white sugar, and water, you can make your own bubble solution!",
        "Just mix 4 cups (950 ml) of warm water with 1/2 cup (120 g) of white sugar.",
        "Then, stir in ⁄2 cup (120 ml) of liquid dish soap to complete your solution.Keep leftover bubble solution in a glass or plastic container with a lid.",
        "Letting the solution sit for a few hours or overnight will result in stronger bubbles.",
        "If you can wait a week, that's even better!",
        "Tweak your bubble solution to change the color or texture.",
        "Once you have a basic bubble solution mixed up, you can make it unique by adding ingredients that change the texture and color.",
        "For example:\nStir in ⁄4 cup (59 ml) of vegetable glycerin or 1/2 cup (60 g) of cornstarch to thicken the solution and create stronger bubbles.",
        "Add a few drops of food coloring to the solution to customize the hue.",
        "Use different colored liquid dish soaps to experiment with color.",
        "Selecting a Bubble Wand Buy a bubble wand from a grocery or toy store for a simple option.",
        "If you buy premixed bubble solution from the store, it will probably come with a small plastic wand attached to the lid.",
        "These bubble wands are usually a few inches in length, with a handle on one side and a plastic circle with a hole on the other.",
        "You can find wands in different shapes and sizes in toy stores, too.",
        "You can also buy a giant bubble-blowing kit.",
        "These come with a big wand with a net that is capable of making very large bubbles.",
        "Make your own bubble wand with a pipe cleaner for a quick solution.",
        "All you have to do is bend one end of a pipe cleaner into a circle shape to create a simple bubble wand.",
        "The bigger you make the circle, the bigger your bubbles will be!You can also experiment with different shapes by forming a heart, star, or square instead of a circle.",
        "Use a slotted spoon or a cookie cutter for a ready-made wand.",
        "The holes in a slotted spoon or the opening in a cookie cutter can easily create bubbles.",
        "A slotted spoon already has a handle, so it's ready to go.",
        "You can duct tape the cookie cutter to the end of a stick to create a handle for your wand.You can also experiment with other utensils from your kitchen, like plastic funnels, paper cones, and straws.",
        "Make a wand with a wire clothes hanger to create huge bubbles.",
        "Get an adult to help you cut the hooked end off of a wire coat hanger with wire cutters.",
        "Then, shape the hanger into a circle, star, heart, or any other shape you want.",
        "Attach your shape to a stick with duct tape to create a handle.You can tie feathers or wrap colored twine around the handle to jazz up your giant bubble wand!",
        "Creating Bubbles Bring your wand and the bubble solution to an open space.",
        "Since bursting bubbles can make a mess and create slippery floors, it's best to set up somewhere outside, like your backyard or in a park.",
        "Plus, bubbles look so cool when the sun highlights their rainbow colors!",
        "Pour the bubble solution into a jar or large container.",
        "No matter what kind of bubble wand you're using, you have to be able to dip the end of it all the way into the bubble solution to create bubbles with it.",
        "You may need to pour your solution into a large bowl, bucket, or potted plant tray with a wide mouth if you're using a pretty big wand.",
        "If your wand is small, a glass or plastic jar will work fine.If you have a kiddie pool and a hula hoop, you can pour bubble solution into the pool and use the hula hoop to make gigantic bubbles!",
        "If your wand and container are really big, you may need to make a double batch of bubble solution.",
        "Dip the end of your wand completely into the bubble solution.",
        "Make sure the shaped end of your wand is fully submerged.",
        "When you pull the wand out of the solution, the solution should look like a thin membrane stretched over the hole.",
        "The solution will look sort of like plastic wrap when it's correctly stretched over the wand and ready to go.",
        "If the end of the wand isn't properly coated after the first dip, submerge it again.",
        "You can do this as many times as you need to.",
        "Make small bubbles by blowing with your mouth.",
        "Hold the end of a smaller wand up to your mouth and gently blow.",
        "The membrane will form a bubble and detach from your wand to float away in the breeze.",
        "You can blow faster to make lots of tiny bubbles, or blow slower to make bigger bubbles!",
        "Make giant bubbles by waving the wand through the air.",
        "When you're using a giant bubble wand, you won't be able to blow bubbles with your mouth.",
        "Instead, gently wave the wand through the air.",
        "The solution will stretch out behind the wand, separate, and form a giant, undulating bubble.Let the wind blow through the opening to see what kind of bubbles you get.",
        "Try walking or running with the wand to make an even bigger bubble.",
        "Twirl around in place to surround yourself with bubbles.",
        "Hold the wand high above your head so the bubble has more time to float around before it hits the ground and bursts."
    ]
}