{
    "title": "How to Draw the Predator",
    "url": "https://www.wikihow.com/Draw-the-Predator",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Drawing",
        "Fantasy Drawing",
        "Drawing Aliens"
    ],
    "methods": [
        {
            "name": "Predator (Close-Up)",
            "steps": [
                {
                    "headline": "Near the topmost center of the paper, draw a medium circle for his head.",
                    "description": ""
                },
                {
                    "headline": "Draw a vertical line across the center of the circle.",
                    "description": "Draw a pair of parallel horizontal line near the bottom of the circle. These will serve as guide lines for the Predator's face."
                },
                {
                    "headline": "Draw an irregular box-shape below the circle.",
                    "description": ""
                },
                {
                    "headline": "Draw a long horizontal rectangle by the bottom of the paper.",
                    "description": "On both sides and top corners of the rectangle, draw a diagonal line going downward and outside the rectangle."
                },
                {
                    "headline": "Using the horizontal-vertical line guides, start drawing its eyes, with wrinkle lines surrounding it and thick upper eye orbit (where eyebrows should be).",
                    "description": ""
                },
                {
                    "headline": "Using the irregular box shape below the eyes as a guide, draw the Predator's spider-like mouth (see illustration).",
                    "description": ""
                },
                {
                    "headline": "Trace the Predator's large forehead that would resemble a crab shell (see illustration).",
                    "description": "Draw little spikes coming out of where his eyebrows should be."
                },
                {
                    "headline": "On the sides of this large forehead, draw tentacle-like hair from it.",
                    "description": "By now, it should resemble like a man with dreadlocks."
                },
                {
                    "headline": "Draw his shoulder cannon on the right side.",
                    "description": ""
                },
                {
                    "headline": "Trace his chest and shoulders.",
                    "description": "Add details to his weapons."
                },
                {
                    "headline": "Add more clothing and accessory details.",
                    "description": ""
                },
                {
                    "headline": "Erase unnecessary lines.",
                    "description": ""
                },
                {
                    "headline": "Color the drawing as desired.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Predator (Full Body)",
            "steps": [
                {
                    "headline": "Near the topmost center of the paper, draw a circle for his head.",
                    "description": ""
                },
                {
                    "headline": "Below the circle, attach a tip-of-a-spade-like shape.",
                    "description": "This will serve as the outline for his chin and jaw. Draw a vertical line across the center of the circle going down to the chin-jaw part. Draw a horizontal line across the circle slightly below its center. Draw another horizontal line parallel to the first one, within and near the bottom of the circle. Let all these horizontal lines intersect the vertical line by their middle."
                },
                {
                    "headline": "As guide for the Predator's body, draw polygon patterns (see illustration).",
                    "description": ""
                },
                {
                    "headline": "Draw a pair of long polygons for his legs and feet.",
                    "description": ""
                },
                {
                    "headline": "Draw circles for the Predator's shoulders.",
                    "description": ""
                },
                {
                    "headline": "Attach long polygons for his arms and hands.",
                    "description": ""
                },
                {
                    "headline": "Attach the shoulders to the Predator's head.",
                    "description": ""
                },
                {
                    "headline": "Using the horizontal-vertical line guides, start drawing the Predator's eyes and mask.",
                    "description": ""
                },
                {
                    "headline": "Proceed in drawing the Predator's forehead and tentacle-like hair.",
                    "description": ""
                },
                {
                    "headline": "Using the polygons, trace the Predator's body and arms.",
                    "description": "Trace shoulder and hand details."
                },
                {
                    "headline": "Draw the belt and waist details.",
                    "description": ""
                },
                {
                    "headline": "Continue tracing the rest of the Predator's body and accessory details.",
                    "description": ""
                },
                {
                    "headline": "Draw netting pattern on the Predator's tights.",
                    "description": ""
                },
                {
                    "headline": "Erase unnecessary lines.",
                    "description": ""
                },
                {
                    "headline": "Color the drawing as desired.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Paper",
        "Pencil",
        "Pencil sharpener",
        "Eraser gum",
        "Colored pencils, crayons, markers or watercolors"
    ],
    "text": " Predator (Close-Up) Near the topmost center of the paper, draw a medium circle for his head.  Draw a vertical line across the center of the circle. Draw a pair of parallel horizontal line near the bottom of the circle. These will serve as guide lines for the Predator's face. Draw an irregular box-shape below the circle.  Draw a long horizontal rectangle by the bottom of the paper. On both sides and top corners of the rectangle, draw a diagonal line going downward and outside the rectangle. Using the horizontal-vertical line guides, start drawing its eyes, with wrinkle lines surrounding it and thick upper eye orbit (where eyebrows should be).  Using the irregular box shape below the eyes as a guide, draw the Predator's spider-like mouth (see illustration).  Trace the Predator's large forehead that would resemble a crab shell (see illustration). Draw little spikes coming out of where his eyebrows should be. On the sides of this large forehead, draw tentacle-like hair from it. By now, it should resemble like a man with dreadlocks. Draw his shoulder cannon on the right side.  Trace his chest and shoulders. Add details to his weapons. Add more clothing and accessory details.  Erase unnecessary lines.  Color the drawing as desired.  Predator (Full Body) Near the topmost center of the paper, draw a circle for his head.  Below the circle, attach a tip-of-a-spade-like shape. This will serve as the outline for his chin and jaw. Draw a vertical line across the center of the circle going down to the chin-jaw part. Draw a horizontal line across the circle slightly below its center. Draw another horizontal line parallel to the first one, within and near the bottom of the circle. Let all these horizontal lines intersect the vertical line by their middle. As guide for the Predator's body, draw polygon patterns (see illustration).  Draw a pair of long polygons for his legs and feet.  Draw circles for the Predator's shoulders.  Attach long polygons for his arms and hands.  Attach the shoulders to the Predator's head.  Using the horizontal-vertical line guides, start drawing the Predator's eyes and mask.  Proceed in drawing the Predator's forehead and tentacle-like hair.  Using the polygons, trace the Predator's body and arms. Trace shoulder and hand details. Draw the belt and waist details.  Continue tracing the rest of the Predator's body and accessory details.  Draw netting pattern on the Predator's tights.  Erase unnecessary lines.  Color the drawing as desired. ",
    "sentences": [
        " Predator (Close-Up) Near the topmost center of the paper, draw a medium circle for his head.",
        "Draw a vertical line across the center of the circle.",
        "Draw a pair of parallel horizontal line near the bottom of the circle.",
        "These will serve as guide lines for the Predator's face.",
        "Draw an irregular box-shape below the circle.",
        "Draw a long horizontal rectangle by the bottom of the paper.",
        "On both sides and top corners of the rectangle, draw a diagonal line going downward and outside the rectangle.",
        "Using the horizontal-vertical line guides, start drawing its eyes, with wrinkle lines surrounding it and thick upper eye orbit (where eyebrows should be).",
        "Using the irregular box shape below the eyes as a guide, draw the Predator's spider-like mouth (see illustration).",
        "Trace the Predator's large forehead that would resemble a crab shell (see illustration).",
        "Draw little spikes coming out of where his eyebrows should be.",
        "On the sides of this large forehead, draw tentacle-like hair from it.",
        "By now, it should resemble like a man with dreadlocks.",
        "Draw his shoulder cannon on the right side.",
        "Trace his chest and shoulders.",
        "Add details to his weapons.",
        "Add more clothing and accessory details.",
        "Erase unnecessary lines.",
        "Color the drawing as desired.",
        "Predator (Full Body) Near the topmost center of the paper, draw a circle for his head.",
        "Below the circle, attach a tip-of-a-spade-like shape.",
        "This will serve as the outline for his chin and jaw.",
        "Draw a vertical line across the center of the circle going down to the chin-jaw part.",
        "Draw a horizontal line across the circle slightly below its center.",
        "Draw another horizontal line parallel to the first one, within and near the bottom of the circle.",
        "Let all these horizontal lines intersect the vertical line by their middle.",
        "As guide for the Predator's body, draw polygon patterns (see illustration).",
        "Draw a pair of long polygons for his legs and feet.",
        "Draw circles for the Predator's shoulders.",
        "Attach long polygons for his arms and hands.",
        "Attach the shoulders to the Predator's head.",
        "Using the horizontal-vertical line guides, start drawing the Predator's eyes and mask.",
        "Proceed in drawing the Predator's forehead and tentacle-like hair.",
        "Using the polygons, trace the Predator's body and arms.",
        "Trace shoulder and hand details.",
        "Draw the belt and waist details.",
        "Continue tracing the rest of the Predator's body and accessory details.",
        "Draw netting pattern on the Predator's tights.",
        "Erase unnecessary lines.",
        "Color the drawing as desired."
    ]
}