{
    "title": "How to Highlight Blonde Hair",
    "url": "https://www.wikihow.com/Highlight-Blonde-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Natural Hair Colors"
    ],
    "parts": [
        {
            "name": "Preparing to Bleach",
            "steps": [
                {
                    "headline": "Start with healthy, dry, neatly-brushed hair.",
                    "description": "Even though you are only doing highlights, your hair should still be healthy. If your hair is feeling brittle and dry, consider deep-conditioning it first. You can help ensure that your hair is as healthy as possible by deep conditioning it once a week for a few weeks before bleaching. Brush your hair to remove any knots or tangles before you start. Make sure that your hair is dry. You should never apply bleach to wet or damp hair."
                },
                {
                    "headline": "Protect your skin, clothing, and workspace against staining.",
                    "description": "Put on an old shirt that you won't mind ruining, or drape an old towel across your shoulders. Coat your hairline with petroleum jelly, then pull on a pair of plastic dyeing gloves. Lastly, cover your workspace and floor with newspaper. If you don't have newspaper, you can use plastic bags instead. Choose a work area that is easy to clean, such as a bathroom counter."
                },
                {
                    "headline": "Mix 1/2 ounce (15 mL/g) of developer and bleach.",
                    "description": "Measure out 1/2 ounce (15 mL) of developer and 1/2 ounce (15 g) of bleach powder, then pour them into a plastic bowl. Stir them together with a plastic spoon until the texture is consistent. Use either a 10 or 20 volume developer. The higher the volume, the lighter your highlights will turn out, and the faster your hair will lighten. This is a good amount for shoulder-length hair. If your hair is longer than that, use more developer and bleach powder; keep the proportions the same."
                },
                {
                    "headline": "Decide what sort of look you want.",
                    "description": "You should always have some sort of idea of what you want your highlights to look like before diving in. This will affect the way you part your hair in the beginning as well as how you apply the bleach. For example:\nIf you want to apply highlights throughout your hair, you'll need to start at your nape and finish at your part. If you want partial highlights, you'll start applying them at about ear-level. For an ombre look, you'll only apply the bleach to the bottom half of each hair strand."
                }
            ]
        },
        {
            "name": "Adding the Highlights",
            "steps": [
                {
                    "headline": "Create a deep side part.",
                    "description": "Use the handle of a rat-tail comb or a tinting brush to create a deep side part. It does not matter which side of your head you do the side part on. You will repeat the entire process on the other side of your head. If you want to start the highlights lower, make the side part lower. Use plastic hair clips to pin the upper layer of hair out of the way."
                },
                {
                    "headline": "Grab a thin section from below the part and weave a rat-tail comb through it.",
                    "description": "Grab a thin, horizontal section from next to your face. Pull the section away from your head so that it becomes taut, then weave the handle of a rat-tail comb through it. Weaving the section, rather than slicing straight through it, will make your highlights appear more natural. Make the section about 2 to 4 inches (5.1 to 10.2 cm) wide. This will help separate the section into a top and bottom layer. You will only bleach the top layer."
                },
                {
                    "headline": "Separate the top layer from the bottom layer, then tuck foil beneath it.",
                    "description": "Slide the comb towards your scalp, then let go of the hair section. Grab the hair that is draped over the comb, then tuck a piece of aluminum foil under it. The foil needs to be at least ½ to ⅔ the length of your hair. It would be better if it is the same length, however."
                },
                {
                    "headline": "Use a tinting brush to apply the bleach to your hair, starting from the ends.",
                    "description": "How far up the hair shaft you go depends on what sort of look you want: a full highlight or an ombre highlight. Whichever style you choose, be sure to saturate the hair strands completely. Never apply bleach starting from your roots. When you reach the ends of your hair, curl your hair into the foil, then continue to apply the bleach."
                },
                {
                    "headline": "Fold the foil over the hair.",
                    "description": "Start by folding the bottom edge of the foil over your hair, as close to the roots as possible. Next, fold the left and right sides of the foil over your hair as well. When you are done, you will be left with a foil packet. The exact size of the foil packet does not matter. The goal is to cover your bleached hair with foil so that it doesn't get stained by the next section."
                },
                {
                    "headline": "Let down another thin section of hair and repeat the process.",
                    "description": "Use the handle of your rat-tail comb to create another horizontal section of hair. Weave the handle through that section, then separate the top layer from the bottom layer. Slide a piece of foil under the top layer of hair, then apply the bleach. Fold the foil over the hair. Keep going until you reach the top of your head. Always start applying the bleach to the bottom of the hair strand. For a subtler effect, let down a thin section of hair, leave it alone, then weave your brush through the next section of hair."
                },
                {
                    "headline": "Repeat the process for the other side and back of your head.",
                    "description": "Once you finish the first side of your head, do the other side. After that, you can do the back. Try to work quickly, otherwise the highlights may not come out even. To help keep your highlights even, try using a higher volume developer on the back of your head so that the hair in the back lightens more quickly. For example, if you used a volume 10 developer on the front half of your hair, use 30 volume on the back. When doing the back of your head, it may be helpful to clip your hair out of the way, or have someone help you."
                }
            ]
        },
        {
            "name": "Finishing the Job",
            "steps": [
                {
                    "headline": "Allow the bleach to process for about 5 to 10 minutes.",
                    "description": "How long this ends up taking depends on how light or dark you want your highlights to be. The longer you leave bleach in your hair, the lighter the highlights will be. Do not cover your head with a shower cap, or you will mess up the foil. Most bleach kits will have recommended times for highlights. Use these times as a guide; your own hair might process faster."
                },
                {
                    "headline": "Remove the foil pieces and rinse the bleach out.",
                    "description": "Once the processing time is up, remove the foil pieces. Step into the shower, and tilt your head back. Rinse your hair with cool water until all of the bleach comes out."
                },
                {
                    "headline": "Wash your hair with shampoo and conditioner.",
                    "description": "Wash your hair with shampoo first, then rinse it out with cool water. Next, apply a deep conditioner, and let it sit for 5 to 10 minutes, then rinse it out with cool water as well. If your highlights turned out yellow or brassy, use a purple shampoo to neutralize the yellow tones. Follow the directions on the bottle to determine how long to leave the shampoo on your hair before rinsing (usually 2-10 minutes). You can use regular conditioner instead of a deep conditioner, if you wish. In this case, you only need to let it sit for 2 to 3 minutes."
                },
                {
                    "headline": "Allow your hair to air dry, if possible.",
                    "description": "Bleach is harsh on your hair, even if it is just highlights. As such, you want to treat your hair as gently as possible. The safest drying method is to pat your hair with a towel to get rid of excess moisture, then let it dry on its own. If you must use a hairdryer, use a low-heat setting."
                }
            ]
        },
        {
            "name": "Maintaining Your Look",
            "steps": [
                {
                    "headline": "Touch up your look every 6 to 8 weeks.",
                    "description": "After about 6 to 8 weeks, your roots will start to show considerably, especially if you did full highlights."
                },
                {
                    "headline": "Wash your hair every other day at the most.",
                    "description": "The less often you wash your hair, the healthier your hair will be. If you wash your hair too often, it will start to turn dry. If you live in an area with hard water, consider getting a filter on your showerhead. This will help preserve your hair color. If your hair starts to feel gross between washes, consider using dry shampoo."
                },
                {
                    "headline": "Use a sulfate-free shampoo when you wash your hair.",
                    "description": "Sulfates are harsh cleaning agents found in many shampoos that can make your hair dry. This includes clarifying shampoos as well. Since bleach makes your hair dry, you shouldn't use products that will make it even more dry. If a clarifying shampoo is labeled for dry or chemical-treated hair, then it is okay to use. Double-check the ingredient label to ensure that it doesn't contain sulfates, however."
                },
                {
                    "headline": "Wash your hair with purple toning shampoo if it starts to look brassy.",
                    "description": "This is something that can happen to any blond hair type. Because each brand of purple shampoo is different, follow the instructions provided on the back of the bottle to determine how to use your shampoo properly. In most cases, you'll need to apply the shampoo to wet hair, wait 5 to 10 minutes, then rinse it out. Lighter, lavender-tinted shampoos are going to be gentler than the darker, deep-purple shampoos."
                }
            ]
        }
    ],
    "tyn": [
        "10 or 20 volume developer",
        "Hair bleach",
        "Plastic bowl",
        "Plastic spoon",
        "Tinting brush",
        "Rat-tail comb",
        "Old shirt or towel",
        "Plastic dyeing gloves",
        "Plastic hair clips (optional, if needed)"
    ],
    "text": " Preparing to Bleach Start with healthy, dry, neatly-brushed hair. Even though you are only doing highlights, your hair should still be healthy. If your hair is feeling brittle and dry, consider deep-conditioning it first. You can help ensure that your hair is as healthy as possible by deep conditioning it once a week for a few weeks before bleaching. Brush your hair to remove any knots or tangles before you start. Make sure that your hair is dry. You should never apply bleach to wet or damp hair. Protect your skin, clothing, and workspace against staining. Put on an old shirt that you won't mind ruining, or drape an old towel across your shoulders. Coat your hairline with petroleum jelly, then pull on a pair of plastic dyeing gloves. Lastly, cover your workspace and floor with newspaper. If you don't have newspaper, you can use plastic bags instead. Choose a work area that is easy to clean, such as a bathroom counter. Mix 1/2 ounce (15 mL/g) of developer and bleach. Measure out 1/2 ounce (15 mL) of developer and 1/2 ounce (15 g) of bleach powder, then pour them into a plastic bowl. Stir them together with a plastic spoon until the texture is consistent. Use either a 10 or 20 volume developer. The higher the volume, the lighter your highlights will turn out, and the faster your hair will lighten. This is a good amount for shoulder-length hair. If your hair is longer than that, use more developer and bleach powder; keep the proportions the same. Decide what sort of look you want. You should always have some sort of idea of what you want your highlights to look like before diving in. This will affect the way you part your hair in the beginning as well as how you apply the bleach. For example:\nIf you want to apply highlights throughout your hair, you'll need to start at your nape and finish at your part. If you want partial highlights, you'll start applying them at about ear-level. For an ombre look, you'll only apply the bleach to the bottom half of each hair strand. Adding the Highlights Create a deep side part. Use the handle of a rat-tail comb or a tinting brush to create a deep side part. It does not matter which side of your head you do the side part on. You will repeat the entire process on the other side of your head. If you want to start the highlights lower, make the side part lower. Use plastic hair clips to pin the upper layer of hair out of the way. Grab a thin section from below the part and weave a rat-tail comb through it. Grab a thin, horizontal section from next to your face. Pull the section away from your head so that it becomes taut, then weave the handle of a rat-tail comb through it. Weaving the section, rather than slicing straight through it, will make your highlights appear more natural. Make the section about 2 to 4 inches (5.1 to 10.2 cm) wide. This will help separate the section into a top and bottom layer. You will only bleach the top layer. Separate the top layer from the bottom layer, then tuck foil beneath it. Slide the comb towards your scalp, then let go of the hair section. Grab the hair that is draped over the comb, then tuck a piece of aluminum foil under it. The foil needs to be at least ½ to ⅔ the length of your hair. It would be better if it is the same length, however. Use a tinting brush to apply the bleach to your hair, starting from the ends. How far up the hair shaft you go depends on what sort of look you want: a full highlight or an ombre highlight. Whichever style you choose, be sure to saturate the hair strands completely. Never apply bleach starting from your roots. When you reach the ends of your hair, curl your hair into the foil, then continue to apply the bleach. Fold the foil over the hair. Start by folding the bottom edge of the foil over your hair, as close to the roots as possible. Next, fold the left and right sides of the foil over your hair as well. When you are done, you will be left with a foil packet. The exact size of the foil packet does not matter. The goal is to cover your bleached hair with foil so that it doesn't get stained by the next section. Let down another thin section of hair and repeat the process. Use the handle of your rat-tail comb to create another horizontal section of hair. Weave the handle through that section, then separate the top layer from the bottom layer. Slide a piece of foil under the top layer of hair, then apply the bleach. Fold the foil over the hair. Keep going until you reach the top of your head. Always start applying the bleach to the bottom of the hair strand. For a subtler effect, let down a thin section of hair, leave it alone, then weave your brush through the next section of hair. Repeat the process for the other side and back of your head. Once you finish the first side of your head, do the other side. After that, you can do the back. Try to work quickly, otherwise the highlights may not come out even. To help keep your highlights even, try using a higher volume developer on the back of your head so that the hair in the back lightens more quickly. For example, if you used a volume 10 developer on the front half of your hair, use 30 volume on the back. When doing the back of your head, it may be helpful to clip your hair out of the way, or have someone help you. Finishing the Job Allow the bleach to process for about 5 to 10 minutes. How long this ends up taking depends on how light or dark you want your highlights to be. The longer you leave bleach in your hair, the lighter the highlights will be. Do not cover your head with a shower cap, or you will mess up the foil. Most bleach kits will have recommended times for highlights. Use these times as a guide; your own hair might process faster. Remove the foil pieces and rinse the bleach out. Once the processing time is up, remove the foil pieces. Step into the shower, and tilt your head back. Rinse your hair with cool water until all of the bleach comes out. Wash your hair with shampoo and conditioner. Wash your hair with shampoo first, then rinse it out with cool water. Next, apply a deep conditioner, and let it sit for 5 to 10 minutes, then rinse it out with cool water as well. If your highlights turned out yellow or brassy, use a purple shampoo to neutralize the yellow tones. Follow the directions on the bottle to determine how long to leave the shampoo on your hair before rinsing (usually 2-10 minutes). You can use regular conditioner instead of a deep conditioner, if you wish. In this case, you only need to let it sit for 2 to 3 minutes. Allow your hair to air dry, if possible. Bleach is harsh on your hair, even if it is just highlights. As such, you want to treat your hair as gently as possible. The safest drying method is to pat your hair with a towel to get rid of excess moisture, then let it dry on its own. If you must use a hairdryer, use a low-heat setting. Maintaining Your Look Touch up your look every 6 to 8 weeks. After about 6 to 8 weeks, your roots will start to show considerably, especially if you did full highlights. Wash your hair every other day at the most. The less often you wash your hair, the healthier your hair will be. If you wash your hair too often, it will start to turn dry. If you live in an area with hard water, consider getting a filter on your showerhead. This will help preserve your hair color. If your hair starts to feel gross between washes, consider using dry shampoo. Use a sulfate-free shampoo when you wash your hair. Sulfates are harsh cleaning agents found in many shampoos that can make your hair dry. This includes clarifying shampoos as well. Since bleach makes your hair dry, you shouldn't use products that will make it even more dry. If a clarifying shampoo is labeled for dry or chemical-treated hair, then it is okay to use. Double-check the ingredient label to ensure that it doesn't contain sulfates, however. Wash your hair with purple toning shampoo if it starts to look brassy. This is something that can happen to any blond hair type. Because each brand of purple shampoo is different, follow the instructions provided on the back of the bottle to determine how to use your shampoo properly. In most cases, you'll need to apply the shampoo to wet hair, wait 5 to 10 minutes, then rinse it out. Lighter, lavender-tinted shampoos are going to be gentler than the darker, deep-purple shampoos.",
    "sentences": [
        " Preparing to Bleach Start with healthy, dry, neatly-brushed hair.",
        "Even though you are only doing highlights, your hair should still be healthy.",
        "If your hair is feeling brittle and dry, consider deep-conditioning it first.",
        "You can help ensure that your hair is as healthy as possible by deep conditioning it once a week for a few weeks before bleaching.",
        "Brush your hair to remove any knots or tangles before you start.",
        "Make sure that your hair is dry.",
        "You should never apply bleach to wet or damp hair.",
        "Protect your skin, clothing, and workspace against staining.",
        "Put on an old shirt that you won't mind ruining, or drape an old towel across your shoulders.",
        "Coat your hairline with petroleum jelly, then pull on a pair of plastic dyeing gloves.",
        "Lastly, cover your workspace and floor with newspaper.",
        "If you don't have newspaper, you can use plastic bags instead.",
        "Choose a work area that is easy to clean, such as a bathroom counter.",
        "Mix 1/2 ounce (15 mL/g) of developer and bleach.",
        "Measure out 1/2 ounce (15 mL) of developer and 1/2 ounce (15 g) of bleach powder, then pour them into a plastic bowl.",
        "Stir them together with a plastic spoon until the texture is consistent.",
        "Use either a 10 or 20 volume developer.",
        "The higher the volume, the lighter your highlights will turn out, and the faster your hair will lighten.",
        "This is a good amount for shoulder-length hair.",
        "If your hair is longer than that, use more developer and bleach powder; keep the proportions the same.",
        "Decide what sort of look you want.",
        "You should always have some sort of idea of what you want your highlights to look like before diving in.",
        "This will affect the way you part your hair in the beginning as well as how you apply the bleach.",
        "For example:\nIf you want to apply highlights throughout your hair, you'll need to start at your nape and finish at your part.",
        "If you want partial highlights, you'll start applying them at about ear-level.",
        "For an ombre look, you'll only apply the bleach to the bottom half of each hair strand.",
        "Adding the Highlights Create a deep side part.",
        "Use the handle of a rat-tail comb or a tinting brush to create a deep side part.",
        "It does not matter which side of your head you do the side part on.",
        "You will repeat the entire process on the other side of your head.",
        "If you want to start the highlights lower, make the side part lower.",
        "Use plastic hair clips to pin the upper layer of hair out of the way.",
        "Grab a thin section from below the part and weave a rat-tail comb through it.",
        "Grab a thin, horizontal section from next to your face.",
        "Pull the section away from your head so that it becomes taut, then weave the handle of a rat-tail comb through it.",
        "Weaving the section, rather than slicing straight through it, will make your highlights appear more natural.",
        "Make the section about 2 to 4 inches (5.1 to 10.2 cm) wide.",
        "This will help separate the section into a top and bottom layer.",
        "You will only bleach the top layer.",
        "Separate the top layer from the bottom layer, then tuck foil beneath it.",
        "Slide the comb towards your scalp, then let go of the hair section.",
        "Grab the hair that is draped over the comb, then tuck a piece of aluminum foil under it.",
        "The foil needs to be at least ½ to ⅔ the length of your hair.",
        "It would be better if it is the same length, however.",
        "Use a tinting brush to apply the bleach to your hair, starting from the ends.",
        "How far up the hair shaft you go depends on what sort of look you want: a full highlight or an ombre highlight.",
        "Whichever style you choose, be sure to saturate the hair strands completely.",
        "Never apply bleach starting from your roots.",
        "When you reach the ends of your hair, curl your hair into the foil, then continue to apply the bleach.",
        "Fold the foil over the hair.",
        "Start by folding the bottom edge of the foil over your hair, as close to the roots as possible.",
        "Next, fold the left and right sides of the foil over your hair as well.",
        "When you are done, you will be left with a foil packet.",
        "The exact size of the foil packet does not matter.",
        "The goal is to cover your bleached hair with foil so that it doesn't get stained by the next section.",
        "Let down another thin section of hair and repeat the process.",
        "Use the handle of your rat-tail comb to create another horizontal section of hair.",
        "Weave the handle through that section, then separate the top layer from the bottom layer.",
        "Slide a piece of foil under the top layer of hair, then apply the bleach.",
        "Fold the foil over the hair.",
        "Keep going until you reach the top of your head.",
        "Always start applying the bleach to the bottom of the hair strand.",
        "For a subtler effect, let down a thin section of hair, leave it alone, then weave your brush through the next section of hair.",
        "Repeat the process for the other side and back of your head.",
        "Once you finish the first side of your head, do the other side.",
        "After that, you can do the back.",
        "Try to work quickly, otherwise the highlights may not come out even.",
        "To help keep your highlights even, try using a higher volume developer on the back of your head so that the hair in the back lightens more quickly.",
        "For example, if you used a volume 10 developer on the front half of your hair, use 30 volume on the back.",
        "When doing the back of your head, it may be helpful to clip your hair out of the way, or have someone help you.",
        "Finishing the Job Allow the bleach to process for about 5 to 10 minutes.",
        "How long this ends up taking depends on how light or dark you want your highlights to be.",
        "The longer you leave bleach in your hair, the lighter the highlights will be.",
        "Do not cover your head with a shower cap, or you will mess up the foil.",
        "Most bleach kits will have recommended times for highlights.",
        "Use these times as a guide; your own hair might process faster.",
        "Remove the foil pieces and rinse the bleach out.",
        "Once the processing time is up, remove the foil pieces.",
        "Step into the shower, and tilt your head back.",
        "Rinse your hair with cool water until all of the bleach comes out.",
        "Wash your hair with shampoo and conditioner.",
        "Wash your hair with shampoo first, then rinse it out with cool water.",
        "Next, apply a deep conditioner, and let it sit for 5 to 10 minutes, then rinse it out with cool water as well.",
        "If your highlights turned out yellow or brassy, use a purple shampoo to neutralize the yellow tones.",
        "Follow the directions on the bottle to determine how long to leave the shampoo on your hair before rinsing (usually 2-10 minutes).",
        "You can use regular conditioner instead of a deep conditioner, if you wish.",
        "In this case, you only need to let it sit for 2 to 3 minutes.",
        "Allow your hair to air dry, if possible.",
        "Bleach is harsh on your hair, even if it is just highlights.",
        "As such, you want to treat your hair as gently as possible.",
        "The safest drying method is to pat your hair with a towel to get rid of excess moisture, then let it dry on its own.",
        "If you must use a hairdryer, use a low-heat setting.",
        "Maintaining Your Look Touch up your look every 6 to 8 weeks.",
        "After about 6 to 8 weeks, your roots will start to show considerably, especially if you did full highlights.",
        "Wash your hair every other day at the most.",
        "The less often you wash your hair, the healthier your hair will be.",
        "If you wash your hair too often, it will start to turn dry.",
        "If you live in an area with hard water, consider getting a filter on your showerhead.",
        "This will help preserve your hair color.",
        "If your hair starts to feel gross between washes, consider using dry shampoo.",
        "Use a sulfate-free shampoo when you wash your hair.",
        "Sulfates are harsh cleaning agents found in many shampoos that can make your hair dry.",
        "This includes clarifying shampoos as well.",
        "Since bleach makes your hair dry, you shouldn't use products that will make it even more dry.",
        "If a clarifying shampoo is labeled for dry or chemical-treated hair, then it is okay to use.",
        "Double-check the ingredient label to ensure that it doesn't contain sulfates, however.",
        "Wash your hair with purple toning shampoo if it starts to look brassy.",
        "This is something that can happen to any blond hair type.",
        "Because each brand of purple shampoo is different, follow the instructions provided on the back of the bottle to determine how to use your shampoo properly.",
        "In most cases, you'll need to apply the shampoo to wet hair, wait 5 to 10 minutes, then rinse it out.",
        "Lighter, lavender-tinted shampoos are going to be gentler than the darker, deep-purple shampoos."
    ]
}