{
    "title": "How to Plant a Rock Garden",
    "url": "https://www.wikihow.com/Plant-a-Rock-Garden",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Theme and Feature Gardens"
    ],
    "parts": [
        {
            "name": "Preparing a Location",
            "steps": [
                {
                    "headline": "Select a sunny location.",
                    "description": "Your rock garden will need lots of sun, so find an area of your yard that gets full sun. If you don’t have a full sun location, choose an area that gets a few hours of sustained sunshine."
                },
                {
                    "headline": "Avoid shade from trees and overhangs.",
                    "description": "On a day when you’re home, chart out where the shadows fall in your yard to make sure that your selected area does not fall under shade. You may find that during times you’re out of the house a large shadow covers your desired spot. If you live in a region that gets very cold, you also want to avoid areas susceptible to frost. Frost can destroy your rock garden, so choose a spot in your yard that is least likely to freeze over."
                },
                {
                    "headline": "Choose an area with good drainage.",
                    "description": "Rock gardens need to allow the water to drain off in order to thrive. The plants that work best for a rock garden are drought-resistant, so make sure that they won’t drown in poorly drained soil. If you don’t find an area with good drainage, then you can build a raised bed."
                },
                {
                    "headline": "Weed your plot.",
                    "description": "Protect your rock garden from competition by ensuring that it’s clear of weeds before you begin your planting. You can pull the weeds yourself or use a herbicide."
                },
                {
                    "headline": "Spread a base of broken rock or gravel.",
                    "description": "You should have about 6 inches (15 centimeters) of stone to support your rock garden. You will cover this stone with your topsoil, plants, and selected stones."
                },
                {
                    "headline": "Sketch out your plan.",
                    "description": "Include your rocks, the plants, and any shaded areas. If you are building a raised bed, factor that into your sketch. You can choose complementary plants, such as all flowers, or a layered design, which would include different types of plants with varying sizes. Great layering options include shrubs, flowers, mounded plants, and ground cover. Choosing different types of plants and rocks creates visual interest and more accurately portrays natural growth."
                }
            ]
        },
        {
            "name": "Placing Your Stones",
            "steps": [
                {
                    "headline": "Buy your stones.",
                    "description": "You can use any type of rock or stone, ranging from large boulders to gravel. For best results, choose a variety of sizes. Be sure to buy smaller rocks to support your large stones while also planning for stand-alone smaller rocks. Save money by recycling rocks and stones. Use varying sizes of stones for more visual interest."
                },
                {
                    "headline": "Outline your plot with sand.",
                    "description": "Use a light colored sand to recreate the designs from your sketch. The sand will help you place the heavier stones without risking having to move them."
                },
                {
                    "headline": "Dig a small inset for the large rocks.",
                    "description": "Use a shovel or trowel to create a small indention in the ground. Go beyond your base level of rock or gravel and into the dirt below so that your large stones will be stable. You only need to remove a few inches of dirt to create a resting place for your stones. The rock should fit in the ground about 1/3 of the way down. You can measure the rock if it helps you determine how deep to dig."
                },
                {
                    "headline": "Position small rocks near the inset.",
                    "description": "Before you move your large stones into place, put smaller stabilizing rocks near the indention you created. Some of the rocks may need to be moved into place after you place the larger rock."
                },
                {
                    "headline": "Place your large rocks.",
                    "description": "Use a shovel or crowbar to move the large rocks in your chosen locations. After you have your large stone in place, reposition the smaller stabilizing rocks to help support the larger stones."
                },
                {
                    "headline": "Position your remaining small stones.",
                    "description": "Based on the design you created, place the rest of your stones into your plot. Think about where you will be doing your planting."
                },
                {
                    "headline": "Apply a top soil.",
                    "description": "Choose a top quality topsoil that meets the needs of the plants you’ve chosen. Your soil should cover at least one-third of the rock so that your stones will be stable in their positions. Keep the soil between your stones loose so that you can easily add your plants."
                },
                {
                    "headline": "Add compost to the areas where you’ll plant.",
                    "description": "You can either purchase compost or make your own. Use it to enrich your rock garden before you add your plants."
                }
            ]
        },
        {
            "name": "Adding Vegetation",
            "steps": [
                {
                    "headline": "Choose perennials.",
                    "description": "Perennials will return year after year, making your rock garden resilient to the changing seasons. Popular perennials for rock gardens include rock cress, blanket flower, periwinkle, switchgrass, peonies, phlox, soapwort, coral bells, hardy hibiscus, oregano, and agave plants. If you really want the look of your favorite annuals, add them sparingly to your garden. Plan to replant those areas each year as the plants succumb to the seasons."
                },
                {
                    "headline": "Check your plant’s hardiness.",
                    "description": "Rock gardens usually include plants that can thrive in harsh conditions, such as alpine mountain environments. Make sure that the plants you want to include in your rock garden are strong enough to thrive. Your rock garden should be low maintenance, so choose plants that are drought-resistant. Use the USDA plant hardiness guide by visiting http://planthardiness.ars.usda.gov/phzmweb/interactivemap.aspx. For a world hardiness zone map, visit https://www.decodedplants.com/zone-five-usda-plant-hardiness-world-view/550."
                },
                {
                    "headline": "Purchase your plants.",
                    "description": "Buying the plants at one time will help you visualize how they will look together, but it is possible to plant it in sections if you are working on a large plot."
                },
                {
                    "headline": "Water the plants.",
                    "description": "Don’t remove the plants from their temporary pots. Use your garden hose, flower pail, or a cup to wet the dirt. Once your rock garden is planted, how often you need to water your plants depends on your climate and plant choices. Because rock gardens are meant to be drought-resistant, you should not need to water them much after you initially establish the garden."
                },
                {
                    "headline": "Position the plants before taking them out of the pots.",
                    "description": "Refer to your sketch and move the plants around until you are happy with the arrangement. Once you have your arrangement laid out, make sure that you aren’t creating a shady spot by putting a larger plant too close to a ground plant."
                },
                {
                    "headline": "Allow space for plant growth.",
                    "description": "Overtime, your plants will grow in height and width. Plan for this growth as you do your planting so that your garden will flourish. Each plant should come with an informational card with the plant dimensions at maturity. If you did not receive this information, then look up your plant online."
                },
                {
                    "headline": "Take the plants from the pots.",
                    "description": "Gently pull each plant out and shake the roots to untangle them to prepare the plant for transplant."
                },
                {
                    "headline": "Place your plants under the topsoil and recover them with compost.",
                    "description": "Pat the soil down around the plant to keep it stable."
                },
                {
                    "headline": "Apply gravel or grit on top of the topsoil.",
                    "description": "Finish your garden with a loose layer of gravel or grit. You can choose any small rock mixture that fits the aesthetic of your rock garden."
                }
            ]
        }
    ],
    "tyn": [
        "Stones or rocks of various sizes",
        "Plants",
        "Gravel or grit",
        "Topsoil",
        "Compost",
        "Base rocks or stones",
        "Water"
    ],
    "text": " Preparing a Location Select a sunny location. Your rock garden will need lots of sun, so find an area of your yard that gets full sun. If you don’t have a full sun location, choose an area that gets a few hours of sustained sunshine. Avoid shade from trees and overhangs. On a day when you’re home, chart out where the shadows fall in your yard to make sure that your selected area does not fall under shade. You may find that during times you’re out of the house a large shadow covers your desired spot. If you live in a region that gets very cold, you also want to avoid areas susceptible to frost. Frost can destroy your rock garden, so choose a spot in your yard that is least likely to freeze over. Choose an area with good drainage. Rock gardens need to allow the water to drain off in order to thrive. The plants that work best for a rock garden are drought-resistant, so make sure that they won’t drown in poorly drained soil. If you don’t find an area with good drainage, then you can build a raised bed. Weed your plot. Protect your rock garden from competition by ensuring that it’s clear of weeds before you begin your planting. You can pull the weeds yourself or use a herbicide. Spread a base of broken rock or gravel. You should have about 6 inches (15 centimeters) of stone to support your rock garden. You will cover this stone with your topsoil, plants, and selected stones. Sketch out your plan. Include your rocks, the plants, and any shaded areas. If you are building a raised bed, factor that into your sketch. You can choose complementary plants, such as all flowers, or a layered design, which would include different types of plants with varying sizes. Great layering options include shrubs, flowers, mounded plants, and ground cover. Choosing different types of plants and rocks creates visual interest and more accurately portrays natural growth. Placing Your Stones Buy your stones. You can use any type of rock or stone, ranging from large boulders to gravel. For best results, choose a variety of sizes. Be sure to buy smaller rocks to support your large stones while also planning for stand-alone smaller rocks. Save money by recycling rocks and stones. Use varying sizes of stones for more visual interest. Outline your plot with sand. Use a light colored sand to recreate the designs from your sketch. The sand will help you place the heavier stones without risking having to move them. Dig a small inset for the large rocks. Use a shovel or trowel to create a small indention in the ground. Go beyond your base level of rock or gravel and into the dirt below so that your large stones will be stable. You only need to remove a few inches of dirt to create a resting place for your stones. The rock should fit in the ground about 1/3 of the way down. You can measure the rock if it helps you determine how deep to dig. Position small rocks near the inset. Before you move your large stones into place, put smaller stabilizing rocks near the indention you created. Some of the rocks may need to be moved into place after you place the larger rock. Place your large rocks. Use a shovel or crowbar to move the large rocks in your chosen locations. After you have your large stone in place, reposition the smaller stabilizing rocks to help support the larger stones. Position your remaining small stones. Based on the design you created, place the rest of your stones into your plot. Think about where you will be doing your planting. Apply a top soil. Choose a top quality topsoil that meets the needs of the plants you’ve chosen. Your soil should cover at least one-third of the rock so that your stones will be stable in their positions. Keep the soil between your stones loose so that you can easily add your plants. Add compost to the areas where you’ll plant. You can either purchase compost or make your own. Use it to enrich your rock garden before you add your plants. Adding Vegetation Choose perennials. Perennials will return year after year, making your rock garden resilient to the changing seasons. Popular perennials for rock gardens include rock cress, blanket flower, periwinkle, switchgrass, peonies, phlox, soapwort, coral bells, hardy hibiscus, oregano, and agave plants. If you really want the look of your favorite annuals, add them sparingly to your garden. Plan to replant those areas each year as the plants succumb to the seasons. Check your plant’s hardiness. Rock gardens usually include plants that can thrive in harsh conditions, such as alpine mountain environments. Make sure that the plants you want to include in your rock garden are strong enough to thrive. Your rock garden should be low maintenance, so choose plants that are drought-resistant. Use the USDA plant hardiness guide by visiting http://planthardiness.ars.usda.gov/phzmweb/interactivemap.aspx. For a world hardiness zone map, visit https://www.decodedplants.com/zone-five-usda-plant-hardiness-world-view/550. Purchase your plants. Buying the plants at one time will help you visualize how they will look together, but it is possible to plant it in sections if you are working on a large plot. Water the plants. Don’t remove the plants from their temporary pots. Use your garden hose, flower pail, or a cup to wet the dirt. Once your rock garden is planted, how often you need to water your plants depends on your climate and plant choices. Because rock gardens are meant to be drought-resistant, you should not need to water them much after you initially establish the garden. Position the plants before taking them out of the pots. Refer to your sketch and move the plants around until you are happy with the arrangement. Once you have your arrangement laid out, make sure that you aren’t creating a shady spot by putting a larger plant too close to a ground plant. Allow space for plant growth. Overtime, your plants will grow in height and width. Plan for this growth as you do your planting so that your garden will flourish. Each plant should come with an informational card with the plant dimensions at maturity. If you did not receive this information, then look up your plant online. Take the plants from the pots. Gently pull each plant out and shake the roots to untangle them to prepare the plant for transplant. Place your plants under the topsoil and recover them with compost. Pat the soil down around the plant to keep it stable. Apply gravel or grit on top of the topsoil. Finish your garden with a loose layer of gravel or grit. You can choose any small rock mixture that fits the aesthetic of your rock garden.",
    "sentences": [
        " Preparing a Location Select a sunny location.",
        "Your rock garden will need lots of sun, so find an area of your yard that gets full sun.",
        "If you don’t have a full sun location, choose an area that gets a few hours of sustained sunshine.",
        "Avoid shade from trees and overhangs.",
        "On a day when you’re home, chart out where the shadows fall in your yard to make sure that your selected area does not fall under shade.",
        "You may find that during times you’re out of the house a large shadow covers your desired spot.",
        "If you live in a region that gets very cold, you also want to avoid areas susceptible to frost.",
        "Frost can destroy your rock garden, so choose a spot in your yard that is least likely to freeze over.",
        "Choose an area with good drainage.",
        "Rock gardens need to allow the water to drain off in order to thrive.",
        "The plants that work best for a rock garden are drought-resistant, so make sure that they won’t drown in poorly drained soil.",
        "If you don’t find an area with good drainage, then you can build a raised bed.",
        "Weed your plot.",
        "Protect your rock garden from competition by ensuring that it’s clear of weeds before you begin your planting.",
        "You can pull the weeds yourself or use a herbicide.",
        "Spread a base of broken rock or gravel.",
        "You should have about 6 inches (15 centimeters) of stone to support your rock garden.",
        "You will cover this stone with your topsoil, plants, and selected stones.",
        "Sketch out your plan.",
        "Include your rocks, the plants, and any shaded areas.",
        "If you are building a raised bed, factor that into your sketch.",
        "You can choose complementary plants, such as all flowers, or a layered design, which would include different types of plants with varying sizes.",
        "Great layering options include shrubs, flowers, mounded plants, and ground cover.",
        "Choosing different types of plants and rocks creates visual interest and more accurately portrays natural growth.",
        "Placing Your Stones Buy your stones.",
        "You can use any type of rock or stone, ranging from large boulders to gravel.",
        "For best results, choose a variety of sizes.",
        "Be sure to buy smaller rocks to support your large stones while also planning for stand-alone smaller rocks.",
        "Save money by recycling rocks and stones.",
        "Use varying sizes of stones for more visual interest.",
        "Outline your plot with sand.",
        "Use a light colored sand to recreate the designs from your sketch.",
        "The sand will help you place the heavier stones without risking having to move them.",
        "Dig a small inset for the large rocks.",
        "Use a shovel or trowel to create a small indention in the ground.",
        "Go beyond your base level of rock or gravel and into the dirt below so that your large stones will be stable.",
        "You only need to remove a few inches of dirt to create a resting place for your stones.",
        "The rock should fit in the ground about 1/3 of the way down.",
        "You can measure the rock if it helps you determine how deep to dig.",
        "Position small rocks near the inset.",
        "Before you move your large stones into place, put smaller stabilizing rocks near the indention you created.",
        "Some of the rocks may need to be moved into place after you place the larger rock.",
        "Place your large rocks.",
        "Use a shovel or crowbar to move the large rocks in your chosen locations.",
        "After you have your large stone in place, reposition the smaller stabilizing rocks to help support the larger stones.",
        "Position your remaining small stones.",
        "Based on the design you created, place the rest of your stones into your plot.",
        "Think about where you will be doing your planting.",
        "Apply a top soil.",
        "Choose a top quality topsoil that meets the needs of the plants you’ve chosen.",
        "Your soil should cover at least one-third of the rock so that your stones will be stable in their positions.",
        "Keep the soil between your stones loose so that you can easily add your plants.",
        "Add compost to the areas where you’ll plant.",
        "You can either purchase compost or make your own.",
        "Use it to enrich your rock garden before you add your plants.",
        "Adding Vegetation Choose perennials.",
        "Perennials will return year after year, making your rock garden resilient to the changing seasons.",
        "Popular perennials for rock gardens include rock cress, blanket flower, periwinkle, switchgrass, peonies, phlox, soapwort, coral bells, hardy hibiscus, oregano, and agave plants.",
        "If you really want the look of your favorite annuals, add them sparingly to your garden.",
        "Plan to replant those areas each year as the plants succumb to the seasons.",
        "Check your plant’s hardiness.",
        "Rock gardens usually include plants that can thrive in harsh conditions, such as alpine mountain environments.",
        "Make sure that the plants you want to include in your rock garden are strong enough to thrive.",
        "Your rock garden should be low maintenance, so choose plants that are drought-resistant.",
        "Use the USDA plant hardiness guide by visiting http://planthardiness.ars.usda.gov/phzmweb/interactivemap.aspx.",
        "For a world hardiness zone map, visit https://www.decodedplants.com/zone-five-usda-plant-hardiness-world-view/550.",
        "Purchase your plants.",
        "Buying the plants at one time will help you visualize how they will look together, but it is possible to plant it in sections if you are working on a large plot.",
        "Water the plants.",
        "Don’t remove the plants from their temporary pots.",
        "Use your garden hose, flower pail, or a cup to wet the dirt.",
        "Once your rock garden is planted, how often you need to water your plants depends on your climate and plant choices.",
        "Because rock gardens are meant to be drought-resistant, you should not need to water them much after you initially establish the garden.",
        "Position the plants before taking them out of the pots.",
        "Refer to your sketch and move the plants around until you are happy with the arrangement.",
        "Once you have your arrangement laid out, make sure that you aren’t creating a shady spot by putting a larger plant too close to a ground plant.",
        "Allow space for plant growth.",
        "Overtime, your plants will grow in height and width.",
        "Plan for this growth as you do your planting so that your garden will flourish.",
        "Each plant should come with an informational card with the plant dimensions at maturity.",
        "If you did not receive this information, then look up your plant online.",
        "Take the plants from the pots.",
        "Gently pull each plant out and shake the roots to untangle them to prepare the plant for transplant.",
        "Place your plants under the topsoil and recover them with compost.",
        "Pat the soil down around the plant to keep it stable.",
        "Apply gravel or grit on top of the topsoil.",
        "Finish your garden with a loose layer of gravel or grit.",
        "You can choose any small rock mixture that fits the aesthetic of your rock garden."
    ]
}