{
    "title": "How to Fake a Hickey",
    "url": "https://www.wikihow.com/Fake-a-Hickey",
    "category_hierarchy": [
        "Health",
        "Integumentary System Health",
        "Skin Health",
        "Skin Inflammation and Rashes"
    ],
    "methods": [
        {
            "name": "Faking a Hickey With a Bottle",
            "steps": [
                {
                    "headline": "Choose the location for the hickey.",
                    "description": "Most hickeys tend to be around the neck area, but hickey can also be found on all areas of the chest. If you decide to place the hickey on your neck, do so on the sides of the neck avoiding the area underneath your chin, and directly in the middle of your neck (on or surrounding your esophagus). A hickey located on the sides of the neck will help make it more believable."
                },
                {
                    "headline": "Obtain a 2-liter bottle.",
                    "description": "The bottle is the instrument you will use to make the hickey. Place the bottle in between your hands, and squeeze the midsection of the bottle. As you prepare to make your hickey, it helps to stand in front of a mirror so you can see what you’re doing."
                },
                {
                    "headline": "Place the bottle mouth on your body.",
                    "description": "Place the mouth of the squeezed bottle on the area you’ve decided to make your hickey. The mouth of the bottle must be flush with your skin in order to create suction. Hold the bottle in place for approximately 15 seconds. After 15 seconds, pull the bottle away to remove the bottle from your skin. Keep in mind that the less air there is in the bottle (the more you have squeezed the bottle), the more suction there will be on your skin. This increased suction will lead to a faster forming and more intense looking hickey."
                },
                {
                    "headline": "Consider widening the hickey.",
                    "description": "Since the mouth of the bottle is a perfect circle, consider moving the bottle over a centimeter or two, and making another hickey. This second hickey doesn’t need to be as intense as the first hickey made, so you can try squeezing the bottle less, or holding it on your skin for a shorter amount of time. Since mouths have more of an oval shape, widening the hickey will make the look of the hickey more realistic."
                }
            ]
        },
        {
            "name": "Faking a Hickey With Eye Shadow",
            "steps": [
                {
                    "headline": "Choose the location for the hickey.",
                    "description": "A hickey can be made anywhere on the body, but normally, hickeys tend to be located on either the neck or chest areas. If you decide to make your hickey on your neck, consider making the hickey on the sides of the neck. Avoid making a hickey in the center of your neck, near your throat, or the area underneath your chin."
                },
                {
                    "headline": "Obtain a large eye shadow palette.",
                    "description": "Get a large eye shadow palette that has an array of colors. The colors you need use will be a dark pink, dark purple, and dark blue. Use a small makeup brush to apply the eye shadow. Keep in mind, if you have a darker skin tone, you might need to use the darker eye shadow colors more heavily in order to have the hickey mark show up."
                },
                {
                    "headline": "Apply the pink eye shadow.",
                    "description": "Gently tap your makeup brush once or twice into the pink eye shadow. Stand in front of a mirror to apply the makeup. Bring the brush up to the area you’re making the hickey, and rub the brush in small, ½ - 1 inch sized ovals on your skin. Be sure you don’t add too much color to the brush. You need to build up the color for the hickey slowly and gradually."
                },
                {
                    "headline": "Add the purple eye shadow.",
                    "description": "Tap a corner of your makeup brush once in the purple eye shadow, and tap the shadow onto the middle area of the hickey. Lightly continue to use the whole brush to make small ovals to form the hickey. Use the brush to help blend the purple coloring out to the edges of the hickey. When in doubt, use less of the darker eye shadow colors. You can also add more, but it’s harder to take off the color once it’s added."
                },
                {
                    "headline": "Add the blue eye shadow.",
                    "description": "Again, tap a small corner of your makeup brush into the blue eye shadow and dab it in the middle area of the hickey. Rub the brush in small ovals, blending the blue out to the edges of the hickey. Since the hickey should already be taking form when you add the blue, you don’t need that much blue makeup. Consider tapping the brush on the side of your finger or the edge of a surface to knock off any excess blue shadow."
                },
                {
                    "headline": "Set the makeup.",
                    "description": "Spray a thin layer of hair spray or makeup setting spray to make the hickey last longer and avoid coming off on your clothes. This fake hickey will last until you wash it off."
                }
            ]
        },
        {
            "name": "Faking a Hickey With Alcohol Activated Paint",
            "steps": [
                {
                    "headline": "Choose the location for the hickey.",
                    "description": "You can create your hickey on any part of your body, but hickeys are usually found on the neck and chest areas."
                },
                {
                    "headline": "Obtain alcohol activated paint.",
                    "description": "Alcohol activated paint is used commonly for film and theatre use because they are sweat resistance and last a long time. Grease paints are an other option, but they have a tendency to not last as long and melt a bit, due to body heat."
                },
                {
                    "headline": "Add a small amount of alcohol onto a paint plate.",
                    "description": "Open a bottle of rubbing alcohol and apply a cotton ball to the open top. Tip the bottle upside for one second, then flip it back, right-side up. Squeeze the soaked cotton ball over the middle of a paint plate to create a small puddle of alcohol. This small pool of alcohol will be what you dip your applicator sponges in to moisten them, activating the paint."
                },
                {
                    "headline": "Tap a sponge into the alcohol.",
                    "description": "Tap the stippled edge of the applicator sponge in the alcohol. Then squeeze the stippled edge of the sponge to distribute the alcohol. Dab the stippled edge of the sponge on a paper towel to absorb any excess alcohol. Be sure to stand in front of a mirror as you get ready to create your hickey."
                },
                {
                    "headline": "Apply the first paint layer.",
                    "description": "Gently tap the dampened applicator sponge into the red paint color. Lightly dab a corner of the sponge on your skin to create a small oval approximately ½ inch long and ¼ wide. Stipple the coloring as much as you can. The stippled look will make the hickey look natural and authentic."
                },
                {
                    "headline": "Apply the second paint layer.",
                    "description": "With the same sponge applicator, dab the sponge into the dark blue color. The red from the previous application mixed with the blue will create a very bruise-like purple color. Dab the sponge into the center of the hickey very lightly to give the appearance of broken blood vessels. To help blend the colors together, you can tap the sponge into the alcohol, tap a paper towel to remove excess alcohol, and dab the hickey, allowing the colors to blend into each other."
                }
            ]
        }
    ],
    "tyn": [
        "2 liter soda bottle",
        "Eye shadow palette",
        "Makeup brush",
        "Mirror",
        "Hairspray/setting spray",
        "Alcohol activated paint",
        "Paint plate",
        "Makeup sponge applicators",
        "Paper towels"
    ],
    "text": " Faking a Hickey With a Bottle Choose the location for the hickey. Most hickeys tend to be around the neck area, but hickey can also be found on all areas of the chest. If you decide to place the hickey on your neck, do so on the sides of the neck avoiding the area underneath your chin, and directly in the middle of your neck (on or surrounding your esophagus). A hickey located on the sides of the neck will help make it more believable. Obtain a 2-liter bottle. The bottle is the instrument you will use to make the hickey. Place the bottle in between your hands, and squeeze the midsection of the bottle. As you prepare to make your hickey, it helps to stand in front of a mirror so you can see what you’re doing. Place the bottle mouth on your body. Place the mouth of the squeezed bottle on the area you’ve decided to make your hickey. The mouth of the bottle must be flush with your skin in order to create suction. Hold the bottle in place for approximately 15 seconds. After 15 seconds, pull the bottle away to remove the bottle from your skin. Keep in mind that the less air there is in the bottle (the more you have squeezed the bottle), the more suction there will be on your skin. This increased suction will lead to a faster forming and more intense looking hickey. Consider widening the hickey. Since the mouth of the bottle is a perfect circle, consider moving the bottle over a centimeter or two, and making another hickey. This second hickey doesn’t need to be as intense as the first hickey made, so you can try squeezing the bottle less, or holding it on your skin for a shorter amount of time. Since mouths have more of an oval shape, widening the hickey will make the look of the hickey more realistic. Faking a Hickey With Eye Shadow Choose the location for the hickey. A hickey can be made anywhere on the body, but normally, hickeys tend to be located on either the neck or chest areas. If you decide to make your hickey on your neck, consider making the hickey on the sides of the neck. Avoid making a hickey in the center of your neck, near your throat, or the area underneath your chin. Obtain a large eye shadow palette. Get a large eye shadow palette that has an array of colors. The colors you need use will be a dark pink, dark purple, and dark blue. Use a small makeup brush to apply the eye shadow. Keep in mind, if you have a darker skin tone, you might need to use the darker eye shadow colors more heavily in order to have the hickey mark show up. Apply the pink eye shadow. Gently tap your makeup brush once or twice into the pink eye shadow. Stand in front of a mirror to apply the makeup. Bring the brush up to the area you’re making the hickey, and rub the brush in small, ½ - 1 inch sized ovals on your skin. Be sure you don’t add too much color to the brush. You need to build up the color for the hickey slowly and gradually. Add the purple eye shadow. Tap a corner of your makeup brush once in the purple eye shadow, and tap the shadow onto the middle area of the hickey. Lightly continue to use the whole brush to make small ovals to form the hickey. Use the brush to help blend the purple coloring out to the edges of the hickey. When in doubt, use less of the darker eye shadow colors. You can also add more, but it’s harder to take off the color once it’s added. Add the blue eye shadow. Again, tap a small corner of your makeup brush into the blue eye shadow and dab it in the middle area of the hickey. Rub the brush in small ovals, blending the blue out to the edges of the hickey. Since the hickey should already be taking form when you add the blue, you don’t need that much blue makeup. Consider tapping the brush on the side of your finger or the edge of a surface to knock off any excess blue shadow. Set the makeup. Spray a thin layer of hair spray or makeup setting spray to make the hickey last longer and avoid coming off on your clothes. This fake hickey will last until you wash it off. Faking a Hickey With Alcohol Activated Paint Choose the location for the hickey. You can create your hickey on any part of your body, but hickeys are usually found on the neck and chest areas. Obtain alcohol activated paint. Alcohol activated paint is used commonly for film and theatre use because they are sweat resistance and last a long time. Grease paints are an other option, but they have a tendency to not last as long and melt a bit, due to body heat. Add a small amount of alcohol onto a paint plate. Open a bottle of rubbing alcohol and apply a cotton ball to the open top. Tip the bottle upside for one second, then flip it back, right-side up. Squeeze the soaked cotton ball over the middle of a paint plate to create a small puddle of alcohol. This small pool of alcohol will be what you dip your applicator sponges in to moisten them, activating the paint. Tap a sponge into the alcohol. Tap the stippled edge of the applicator sponge in the alcohol. Then squeeze the stippled edge of the sponge to distribute the alcohol. Dab the stippled edge of the sponge on a paper towel to absorb any excess alcohol. Be sure to stand in front of a mirror as you get ready to create your hickey. Apply the first paint layer. Gently tap the dampened applicator sponge into the red paint color. Lightly dab a corner of the sponge on your skin to create a small oval approximately ½ inch long and ¼ wide. Stipple the coloring as much as you can. The stippled look will make the hickey look natural and authentic. Apply the second paint layer. With the same sponge applicator, dab the sponge into the dark blue color. The red from the previous application mixed with the blue will create a very bruise-like purple color. Dab the sponge into the center of the hickey very lightly to give the appearance of broken blood vessels. To help blend the colors together, you can tap the sponge into the alcohol, tap a paper towel to remove excess alcohol, and dab the hickey, allowing the colors to blend into each other.",
    "sentences": [
        " Faking a Hickey With a Bottle Choose the location for the hickey.",
        "Most hickeys tend to be around the neck area, but hickey can also be found on all areas of the chest.",
        "If you decide to place the hickey on your neck, do so on the sides of the neck avoiding the area underneath your chin, and directly in the middle of your neck (on or surrounding your esophagus).",
        "A hickey located on the sides of the neck will help make it more believable.",
        "Obtain a 2-liter bottle.",
        "The bottle is the instrument you will use to make the hickey.",
        "Place the bottle in between your hands, and squeeze the midsection of the bottle.",
        "As you prepare to make your hickey, it helps to stand in front of a mirror so you can see what you’re doing.",
        "Place the bottle mouth on your body.",
        "Place the mouth of the squeezed bottle on the area you’ve decided to make your hickey.",
        "The mouth of the bottle must be flush with your skin in order to create suction.",
        "Hold the bottle in place for approximately 15 seconds.",
        "After 15 seconds, pull the bottle away to remove the bottle from your skin.",
        "Keep in mind that the less air there is in the bottle (the more you have squeezed the bottle), the more suction there will be on your skin.",
        "This increased suction will lead to a faster forming and more intense looking hickey.",
        "Consider widening the hickey.",
        "Since the mouth of the bottle is a perfect circle, consider moving the bottle over a centimeter or two, and making another hickey.",
        "This second hickey doesn’t need to be as intense as the first hickey made, so you can try squeezing the bottle less, or holding it on your skin for a shorter amount of time.",
        "Since mouths have more of an oval shape, widening the hickey will make the look of the hickey more realistic.",
        "Faking a Hickey With Eye Shadow Choose the location for the hickey.",
        "A hickey can be made anywhere on the body, but normally, hickeys tend to be located on either the neck or chest areas.",
        "If you decide to make your hickey on your neck, consider making the hickey on the sides of the neck.",
        "Avoid making a hickey in the center of your neck, near your throat, or the area underneath your chin.",
        "Obtain a large eye shadow palette.",
        "Get a large eye shadow palette that has an array of colors.",
        "The colors you need use will be a dark pink, dark purple, and dark blue.",
        "Use a small makeup brush to apply the eye shadow.",
        "Keep in mind, if you have a darker skin tone, you might need to use the darker eye shadow colors more heavily in order to have the hickey mark show up.",
        "Apply the pink eye shadow.",
        "Gently tap your makeup brush once or twice into the pink eye shadow.",
        "Stand in front of a mirror to apply the makeup.",
        "Bring the brush up to the area you’re making the hickey, and rub the brush in small, ½ - 1 inch sized ovals on your skin.",
        "Be sure you don’t add too much color to the brush.",
        "You need to build up the color for the hickey slowly and gradually.",
        "Add the purple eye shadow.",
        "Tap a corner of your makeup brush once in the purple eye shadow, and tap the shadow onto the middle area of the hickey.",
        "Lightly continue to use the whole brush to make small ovals to form the hickey.",
        "Use the brush to help blend the purple coloring out to the edges of the hickey.",
        "When in doubt, use less of the darker eye shadow colors.",
        "You can also add more, but it’s harder to take off the color once it’s added.",
        "Add the blue eye shadow.",
        "Again, tap a small corner of your makeup brush into the blue eye shadow and dab it in the middle area of the hickey.",
        "Rub the brush in small ovals, blending the blue out to the edges of the hickey.",
        "Since the hickey should already be taking form when you add the blue, you don’t need that much blue makeup.",
        "Consider tapping the brush on the side of your finger or the edge of a surface to knock off any excess blue shadow.",
        "Set the makeup.",
        "Spray a thin layer of hair spray or makeup setting spray to make the hickey last longer and avoid coming off on your clothes.",
        "This fake hickey will last until you wash it off.",
        "Faking a Hickey With Alcohol Activated Paint Choose the location for the hickey.",
        "You can create your hickey on any part of your body, but hickeys are usually found on the neck and chest areas.",
        "Obtain alcohol activated paint.",
        "Alcohol activated paint is used commonly for film and theatre use because they are sweat resistance and last a long time.",
        "Grease paints are an other option, but they have a tendency to not last as long and melt a bit, due to body heat.",
        "Add a small amount of alcohol onto a paint plate.",
        "Open a bottle of rubbing alcohol and apply a cotton ball to the open top.",
        "Tip the bottle upside for one second, then flip it back, right-side up.",
        "Squeeze the soaked cotton ball over the middle of a paint plate to create a small puddle of alcohol.",
        "This small pool of alcohol will be what you dip your applicator sponges in to moisten them, activating the paint.",
        "Tap a sponge into the alcohol.",
        "Tap the stippled edge of the applicator sponge in the alcohol.",
        "Then squeeze the stippled edge of the sponge to distribute the alcohol.",
        "Dab the stippled edge of the sponge on a paper towel to absorb any excess alcohol.",
        "Be sure to stand in front of a mirror as you get ready to create your hickey.",
        "Apply the first paint layer.",
        "Gently tap the dampened applicator sponge into the red paint color.",
        "Lightly dab a corner of the sponge on your skin to create a small oval approximately ½ inch long and ¼ wide.",
        "Stipple the coloring as much as you can.",
        "The stippled look will make the hickey look natural and authentic.",
        "Apply the second paint layer.",
        "With the same sponge applicator, dab the sponge into the dark blue color.",
        "The red from the previous application mixed with the blue will create a very bruise-like purple color.",
        "Dab the sponge into the center of the hickey very lightly to give the appearance of broken blood vessels.",
        "To help blend the colors together, you can tap the sponge into the alcohol, tap a paper towel to remove excess alcohol, and dab the hickey, allowing the colors to blend into each other."
    ]
}