{
    "title": "How to Make Mushroom Risotto",
    "url": "https://www.wikihow.com/Make-Mushroom-Risotto",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Rice and Beans",
        "Risotto"
    ],
    "parts": [
        {
            "name": "Making the Mushroom Base",
            "steps": [
                {
                    "headline": "Heat the chicken broth in a pot over low heat.",
                    "description": "Set a medium saucepan on the stove and pour in 8 cups (1,900 ml) of chicken broth. Turn the burner on low and let the broth heat up. Keep the heat on low while you begin the risotto. The broth should be about the same temperature as the rice in order to make the risotto creamy. This is why it's important to not add cold or boiling hot stock. If you'd like to make the risotto vegetarian, substitute vegetable stock for the chicken broth."
                },
                {
                    "headline": "Soak the dried mushrooms in 1 cup (240 ml) of the broth for 20 minutes.",
                    "description": "Remove 1 cup (240 ml) of the broth and pour it into a bowl. Add 1 ounce (28 g) of dried porcini mushrooms and stir them so they begin to absorb the hot broth. Leave the mushrooms to rehydrate for 20 minutes and then drain them. Keep soaking the mushrooms until they're soft."
                },
                {
                    "headline": "Sauté 1/2 of the onion and 1 clove of garlic for 5 minutes.",
                    "description": "Pour 1 tablespoon (15 ml) of the olive oil into a large skillet and turn the burner to medium. Once the oil shimmers, stir in 1/2 of the diced onion and 1 minced garlic clove. Stir and cook the mixture until the onion softens and becomes clear. Stir the onion and garlic frequently to prevent it from sticking and burning to the bottom of the skillet."
                },
                {
                    "headline": "Add the fresh mushrooms, bay, thyme, parsley, and butter.",
                    "description": "Slice 1 pound (450 g) of fresh portobello and crimini mushrooms into 1/2 in (1.3 cm) thick pieces. Add them to the skillet along with 2 bay leaves, 2 tablespoons (7 g) of chopped fresh thyme, 2 tablespoons (7.5 g) of fresh chopped Italian parsley, and 2 tablespoons (28 g) of butter. Use a mix of portobello and crimini. If you only have one type of mushroom, use a full pound (450 g) of whichever kind you have."
                },
                {
                    "headline": "Sauté the mushroom and onion mixture for 3 to 5 minutes.",
                    "description": "Keep the burner at medium heat and cook the vegetables and herbs until the mushrooms are lightly browned. Stir in a little salt and pepper to taste. If the mushrooms look like they're browning too quickly, you may need to adjust the burner."
                },
                {
                    "headline": "Add the truffle oil and rehydrated mushrooms.",
                    "description": "Pour 1 tablespoon (15 ml) of truffle oil into the skillet and stir in the rehydrated porcini mushrooms. Add more salt and pepper according to your taste and let the mixture cook for 1 minute. Turn off the burner and set the mushroom mixture aside. If you don't have truffle oil, you can leave it out since it's purely to add extra-mushroom flavor. Or, you can try making your own truffle oil."
                }
            ]
        },
        {
            "name": "Cooking the Risotto",
            "steps": [
                {
                    "headline": "Sauté the remaining onion and garlic in a separate saucepan.",
                    "description": "Get out another saucepan and heat the remaining 2 tablespoons (30 ml) of olive oil over medium heat. Once the oil shimmers, stir in the remaining 1/2 of a diced onion and minced clove of garlic. Stir and sauté the onions for about 5 minutes. The onions should soften and the garlic will become fragrant."
                },
                {
                    "headline": "Add the rice and cook it for 1 minute.",
                    "description": "Put 2 cups (394 g) of Arborio rice into the sautéd onions in the saucepan. Stir well and keep cooking the mixture over medium heat for 1 minute. The rice should be coated with the oil. This will prevent the rice from sticking together as it cooks."
                },
                {
                    "headline": "Pour in the wine and cook it for 3 to 5 minutes.",
                    "description": "Stir ⁄2 cup (120 ml) of dry white wine into the rice and cook it over medium heat. The wine should evaporate completely as the rice cooks. For a dry white wine, use pinot grigio, chardonnay, or sauvignon blanc."
                },
                {
                    "headline": "Stir 1 cup (240 ml) of the broth into the rice and stir until it's absorbed.",
                    "description": "Pour 1 cup (240 ml) of the hot broth into the saucepan and stir well. Stir constantly as the rice cooks and absorbs all of the broth. It's important to keep stirring the rice as it cooks so it doesn't clump or stick to the bottom of the pan."
                },
                {
                    "headline": "Stir in the remaining broth 1 cup (240 ml) at a time.",
                    "description": "Once the rice has absorbed the first cup of broth, stir in 1 cup (240 ml) more cup of the broth. Stir and cook the rice until it's absorbed the broth. Then add another cup of broth and continue to cook the rice. Take your time in adding the broth and cooking the rice. This will create a creamy risotto that will be slightly firm. You'll need to add a total of 6 cups (1.4 l) of broth."
                },
                {
                    "headline": "Stir the mushroom mixture and Parmesan into the rice.",
                    "description": "Scoop the reserved mushroom and onion mixture into the pan with the cooked rice. Add 1/2 cup (75 g) of freshly grated Parmesan cheese and cook the risotto until the cheese is melted."
                },
                {
                    "headline": "Garnish the risotto with oil and parsley.",
                    "description": "Turn off the burner and add a drizzle of truffle oil to the top of the risotto. Sprinkle freshly chopped Italian parsley and serve the risotto while it's still warm. Refrigerate the leftover risotto in an airtight container for up to 5 days."
                }
            ]
        }
    ],
    "tyn": [
        "Medium saucepan",
        "Measuring cups and spoons",
        "Knife and cutting board",
        "Large skillet",
        "Spoon",
        "Saucepan",
        "Bowl",
        "Fine mesh strainer"
    ],
    "text": " Making the Mushroom Base Heat the chicken broth in a pot over low heat. Set a medium saucepan on the stove and pour in 8 cups (1,900 ml) of chicken broth. Turn the burner on low and let the broth heat up. Keep the heat on low while you begin the risotto. The broth should be about the same temperature as the rice in order to make the risotto creamy. This is why it's important to not add cold or boiling hot stock. If you'd like to make the risotto vegetarian, substitute vegetable stock for the chicken broth. Soak the dried mushrooms in 1 cup (240 ml) of the broth for 20 minutes. Remove 1 cup (240 ml) of the broth and pour it into a bowl. Add 1 ounce (28 g) of dried porcini mushrooms and stir them so they begin to absorb the hot broth. Leave the mushrooms to rehydrate for 20 minutes and then drain them. Keep soaking the mushrooms until they're soft. Sauté 1/2 of the onion and 1 clove of garlic for 5 minutes. Pour 1 tablespoon (15 ml) of the olive oil into a large skillet and turn the burner to medium. Once the oil shimmers, stir in 1/2 of the diced onion and 1 minced garlic clove. Stir and cook the mixture until the onion softens and becomes clear. Stir the onion and garlic frequently to prevent it from sticking and burning to the bottom of the skillet. Add the fresh mushrooms, bay, thyme, parsley, and butter. Slice 1 pound (450 g) of fresh portobello and crimini mushrooms into 1/2 in (1.3 cm) thick pieces. Add them to the skillet along with 2 bay leaves, 2 tablespoons (7 g) of chopped fresh thyme, 2 tablespoons (7.5 g) of fresh chopped Italian parsley, and 2 tablespoons (28 g) of butter. Use a mix of portobello and crimini. If you only have one type of mushroom, use a full pound (450 g) of whichever kind you have. Sauté the mushroom and onion mixture for 3 to 5 minutes. Keep the burner at medium heat and cook the vegetables and herbs until the mushrooms are lightly browned. Stir in a little salt and pepper to taste. If the mushrooms look like they're browning too quickly, you may need to adjust the burner. Add the truffle oil and rehydrated mushrooms. Pour 1 tablespoon (15 ml) of truffle oil into the skillet and stir in the rehydrated porcini mushrooms. Add more salt and pepper according to your taste and let the mixture cook for 1 minute. Turn off the burner and set the mushroom mixture aside. If you don't have truffle oil, you can leave it out since it's purely to add extra-mushroom flavor. Or, you can try making your own truffle oil. Cooking the Risotto Sauté the remaining onion and garlic in a separate saucepan. Get out another saucepan and heat the remaining 2 tablespoons (30 ml) of olive oil over medium heat. Once the oil shimmers, stir in the remaining 1/2 of a diced onion and minced clove of garlic. Stir and sauté the onions for about 5 minutes. The onions should soften and the garlic will become fragrant. Add the rice and cook it for 1 minute. Put 2 cups (394 g) of Arborio rice into the sautéd onions in the saucepan. Stir well and keep cooking the mixture over medium heat for 1 minute. The rice should be coated with the oil. This will prevent the rice from sticking together as it cooks. Pour in the wine and cook it for 3 to 5 minutes. Stir ⁄2 cup (120 ml) of dry white wine into the rice and cook it over medium heat. The wine should evaporate completely as the rice cooks. For a dry white wine, use pinot grigio, chardonnay, or sauvignon blanc. Stir 1 cup (240 ml) of the broth into the rice and stir until it's absorbed. Pour 1 cup (240 ml) of the hot broth into the saucepan and stir well. Stir constantly as the rice cooks and absorbs all of the broth. It's important to keep stirring the rice as it cooks so it doesn't clump or stick to the bottom of the pan. Stir in the remaining broth 1 cup (240 ml) at a time. Once the rice has absorbed the first cup of broth, stir in 1 cup (240 ml) more cup of the broth. Stir and cook the rice until it's absorbed the broth. Then add another cup of broth and continue to cook the rice. Take your time in adding the broth and cooking the rice. This will create a creamy risotto that will be slightly firm. You'll need to add a total of 6 cups (1.4 l) of broth. Stir the mushroom mixture and Parmesan into the rice. Scoop the reserved mushroom and onion mixture into the pan with the cooked rice. Add 1/2 cup (75 g) of freshly grated Parmesan cheese and cook the risotto until the cheese is melted. Garnish the risotto with oil and parsley. Turn off the burner and add a drizzle of truffle oil to the top of the risotto. Sprinkle freshly chopped Italian parsley and serve the risotto while it's still warm. Refrigerate the leftover risotto in an airtight container for up to 5 days.",
    "sentences": [
        " Making the Mushroom Base Heat the chicken broth in a pot over low heat.",
        "Set a medium saucepan on the stove and pour in 8 cups (1,900 ml) of chicken broth.",
        "Turn the burner on low and let the broth heat up.",
        "Keep the heat on low while you begin the risotto.",
        "The broth should be about the same temperature as the rice in order to make the risotto creamy.",
        "This is why it's important to not add cold or boiling hot stock.",
        "If you'd like to make the risotto vegetarian, substitute vegetable stock for the chicken broth.",
        "Soak the dried mushrooms in 1 cup (240 ml) of the broth for 20 minutes.",
        "Remove 1 cup (240 ml) of the broth and pour it into a bowl.",
        "Add 1 ounce (28 g) of dried porcini mushrooms and stir them so they begin to absorb the hot broth.",
        "Leave the mushrooms to rehydrate for 20 minutes and then drain them.",
        "Keep soaking the mushrooms until they're soft.",
        "Sauté 1/2 of the onion and 1 clove of garlic for 5 minutes.",
        "Pour 1 tablespoon (15 ml) of the olive oil into a large skillet and turn the burner to medium.",
        "Once the oil shimmers, stir in 1/2 of the diced onion and 1 minced garlic clove.",
        "Stir and cook the mixture until the onion softens and becomes clear.",
        "Stir the onion and garlic frequently to prevent it from sticking and burning to the bottom of the skillet.",
        "Add the fresh mushrooms, bay, thyme, parsley, and butter.",
        "Slice 1 pound (450 g) of fresh portobello and crimini mushrooms into 1/2 in (1.3 cm) thick pieces.",
        "Add them to the skillet along with 2 bay leaves, 2 tablespoons (7 g) of chopped fresh thyme, 2 tablespoons (7.5 g) of fresh chopped Italian parsley, and 2 tablespoons (28 g) of butter.",
        "Use a mix of portobello and crimini.",
        "If you only have one type of mushroom, use a full pound (450 g) of whichever kind you have.",
        "Sauté the mushroom and onion mixture for 3 to 5 minutes.",
        "Keep the burner at medium heat and cook the vegetables and herbs until the mushrooms are lightly browned.",
        "Stir in a little salt and pepper to taste.",
        "If the mushrooms look like they're browning too quickly, you may need to adjust the burner.",
        "Add the truffle oil and rehydrated mushrooms.",
        "Pour 1 tablespoon (15 ml) of truffle oil into the skillet and stir in the rehydrated porcini mushrooms.",
        "Add more salt and pepper according to your taste and let the mixture cook for 1 minute.",
        "Turn off the burner and set the mushroom mixture aside.",
        "If you don't have truffle oil, you can leave it out since it's purely to add extra-mushroom flavor.",
        "Or, you can try making your own truffle oil.",
        "Cooking the Risotto Sauté the remaining onion and garlic in a separate saucepan.",
        "Get out another saucepan and heat the remaining 2 tablespoons (30 ml) of olive oil over medium heat.",
        "Once the oil shimmers, stir in the remaining 1/2 of a diced onion and minced clove of garlic.",
        "Stir and sauté the onions for about 5 minutes.",
        "The onions should soften and the garlic will become fragrant.",
        "Add the rice and cook it for 1 minute.",
        "Put 2 cups (394 g) of Arborio rice into the sautéd onions in the saucepan.",
        "Stir well and keep cooking the mixture over medium heat for 1 minute.",
        "The rice should be coated with the oil.",
        "This will prevent the rice from sticking together as it cooks.",
        "Pour in the wine and cook it for 3 to 5 minutes.",
        "Stir ⁄2 cup (120 ml) of dry white wine into the rice and cook it over medium heat.",
        "The wine should evaporate completely as the rice cooks.",
        "For a dry white wine, use pinot grigio, chardonnay, or sauvignon blanc.",
        "Stir 1 cup (240 ml) of the broth into the rice and stir until it's absorbed.",
        "Pour 1 cup (240 ml) of the hot broth into the saucepan and stir well.",
        "Stir constantly as the rice cooks and absorbs all of the broth.",
        "It's important to keep stirring the rice as it cooks so it doesn't clump or stick to the bottom of the pan.",
        "Stir in the remaining broth 1 cup (240 ml) at a time.",
        "Once the rice has absorbed the first cup of broth, stir in 1 cup (240 ml) more cup of the broth.",
        "Stir and cook the rice until it's absorbed the broth.",
        "Then add another cup of broth and continue to cook the rice.",
        "Take your time in adding the broth and cooking the rice.",
        "This will create a creamy risotto that will be slightly firm.",
        "You'll need to add a total of 6 cups (1.4 l) of broth.",
        "Stir the mushroom mixture and Parmesan into the rice.",
        "Scoop the reserved mushroom and onion mixture into the pan with the cooked rice.",
        "Add 1/2 cup (75 g) of freshly grated Parmesan cheese and cook the risotto until the cheese is melted.",
        "Garnish the risotto with oil and parsley.",
        "Turn off the burner and add a drizzle of truffle oil to the top of the risotto.",
        "Sprinkle freshly chopped Italian parsley and serve the risotto while it's still warm.",
        "Refrigerate the leftover risotto in an airtight container for up to 5 days."
    ]
}