{
    "title": "How to Make a Cheap Cake",
    "url": "https://www.wikihow.com/Make-a-Cheap-Cake",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking",
        "Cakes"
    ],
    "methods": [
        {
            "name": "Making Chocolate Cake",
            "steps": [
                {
                    "headline": "Preheat the oven to 350 degrees F/176 degrees C.",
                    "description": ""
                },
                {
                    "headline": "Grease a 9\" x 13\" baking pan.",
                    "description": "You could also use two 8-inch cake pans or a cupcake tin. Rub the pan with either butter or a light oil to keep the cake from sticking."
                },
                {
                    "headline": "Mix all the ingredients in a large bowl.",
                    "description": "Measure out the flour, sugar, baking soda, salt, cocoa, water, vegetable oil and vinegar into the same bowl. For this easy one-bowl recipe it's not necessary to separate the dry ingredients from the wet. The vegetable oil is a cheap ingredient that produces a very moist cake. If you prefer, you can substitute the same amount of butter. Use milk instead of water if you want a richer flavor."
                },
                {
                    "headline": "Beat the mixture until it forms a smooth batter.",
                    "description": "Use either a whisk or an electric mixer to beat the batter well."
                },
                {
                    "headline": "Pour the batter into the prepared pan.",
                    "description": "Use a spatula to scrape the batter from the sides of the bowl into the pan."
                },
                {
                    "headline": "Bake the cake for 25 to 30 minutes.",
                    "description": "After 25 minutes, test to see if the cake is done by poking a toothpick into the center. If it comes out clean, the cake is ready. If it's wet, bake the cake for another five minutes and test again."
                },
                {
                    "headline": "Cool the cake before frosting it.",
                    "description": "This chocolate cake would be great with a scoop of vanilla ice cream and any kind of frosting you like. Try one of the following cheap frosting recipes to create a delicious, inexpensive cake:\n Vanilla frosting\n Cream cheese frosting\n Chocolate chip frosting"
                }
            ]
        },
        {
            "name": "Making Yellow Cake",
            "steps": [
                {
                    "headline": "Preheat your oven to 375 degrees F/190 degrees C.",
                    "description": ""
                },
                {
                    "headline": "Grease a 9 x 13-inch baking pan.",
                    "description": "Use butter or a light vegetable oil to grease the bottom and sides of the pan to keep the cake from sticking. If you'd rather make a round layer cake, use two 8-inch cake pans instead of one larger rectangular pan. You could also use this recipe to make a dozen cupcakes."
                },
                {
                    "headline": "Mix the dry ingredients.",
                    "description": "Mix together the flour, baking powder, and salt in a small bowl. These inexpensive ingredients can all be found in the baking aisle of your grocery store. Use a fork or whisk to make sure they're well incorporated."
                },
                {
                    "headline": "Mix the sugar and butter in a separate bowl.",
                    "description": "Beat the mixture well, until the sugar and butter are completely combined. The mixture will look crumbly. Margarine may substituted for butter if you're looking for an even cheaper option. Or try replacing butter with the same amount of canola or vegetable oil."
                },
                {
                    "headline": "Beat 1/3 cup milk into the mix.",
                    "description": "Scrape the sides of the bowl and keep mixing."
                },
                {
                    "headline": "Add an egg and the vanilla.",
                    "description": "Beat the mixture until the ingredients are fully incorporated."
                },
                {
                    "headline": "Fold in the flour mixture.",
                    "description": "Use a spatula to gently stir the flour into the batter. Take care not to stir too vigorously at this stage to keep your cake tender. If you over mix the flour, the cake will turn out dense."
                },
                {
                    "headline": "Pour the batter into the greased 9 x 13-inch baking pan.",
                    "description": "Use a spatula to scrape the sides of the mixing bowl."
                },
                {
                    "headline": "Bake 25 to 30 minutes.",
                    "description": "After 25 minutes, insert a toothpick, wooden skewer or cake tester into the center of the cake. If it comes out clean or with only a few small crumbs on it, the cake is done. If it's wet, put the cake back in the oven for another 4-5 minutes."
                },
                {
                    "headline": "Cool the cake and frost as desired.",
                    "description": "Yellow cake makes a great snack on its own, but it's also nice to eat with frosting. Try one of the following inexpensive frosting recipes to finish your cake:\nSimple five minute frosting\n Chocolate frosting\n Strawberry frosting"
                },
                {
                    "headline": "Finished.",
                    "description": "You can also put whipped cream on the cake as a topping, it's up to you!"
                }
            ]
        },
        {
            "name": "Making Fruit Flavored Cake",
            "steps": [
                {
                    "headline": "Preheat the oven to 350 degrees F/176 degrees C.",
                    "description": ""
                },
                {
                    "headline": "Grease a 9\" cake pan.",
                    "description": "A round or square baking pan both work fine. You can also bake this cake in a deep cast iron skillet."
                },
                {
                    "headline": "Mix the flour, baking soda and salt in a small bowl.",
                    "description": "Use a whisk or a fork to make sure the ingredients are well incorporated."
                },
                {
                    "headline": "Cream the butter and sugar in a separate bowl.",
                    "description": "Place them in a mixing bowl and beat until the mixture is light and fluffy."
                },
                {
                    "headline": "Beat in the eggs and vanilla.",
                    "description": "Keep the mixer going until all of the wet ingredients are well incorporated."
                },
                {
                    "headline": "Stir in the flour mixture.",
                    "description": "Use a spatula to stir the flour mixture into the batter until you no longer see dry bits of flour. Be careful not to overmix."
                },
                {
                    "headline": "Stir in the fruit.",
                    "description": "Pour the fruit you're using, whether it's blueberries, blackberries, strawberries, or chopped apples, into the bowl. Stir it into the batter until just incorporated. Fresh fruit tastes great in this recipe, but frozen fruit is a great substitution that's often cheaper than fresh options. Or try using canned fruit; just make sure to drain the syrup it's packed in before using."
                },
                {
                    "headline": "Pour the batter into the prepared pan.",
                    "description": "Use a spatula to scrape the batter from the sides of the bowl."
                },
                {
                    "headline": "Bake the cake for 40 to 45 minutes.",
                    "description": "After 40 minutes, test to see if the cake is done by inserting a toothpick in the center. If it comes out clean, the cake is ready. If it's wet, bake the cake for five more minutes."
                },
                {
                    "headline": "Cool the cake for 10 minutes before serving.",
                    "description": "It's delicious with a scoop of vanilla ice cream or sprinkled with powdered sugar."
                }
            ]
        }
    ],
    "tyn": [
        "Mixer",
        "Mixing bowls",
        "Measuring cups and spoons"
    ],
    "text": " Making Chocolate Cake Preheat the oven to 350 degrees F/176 degrees C.  Grease a 9\" x 13\" baking pan. You could also use two 8-inch cake pans or a cupcake tin. Rub the pan with either butter or a light oil to keep the cake from sticking. Mix all the ingredients in a large bowl. Measure out the flour, sugar, baking soda, salt, cocoa, water, vegetable oil and vinegar into the same bowl. For this easy one-bowl recipe it's not necessary to separate the dry ingredients from the wet. The vegetable oil is a cheap ingredient that produces a very moist cake. If you prefer, you can substitute the same amount of butter. Use milk instead of water if you want a richer flavor. Beat the mixture until it forms a smooth batter. Use either a whisk or an electric mixer to beat the batter well. Pour the batter into the prepared pan. Use a spatula to scrape the batter from the sides of the bowl into the pan. Bake the cake for 25 to 30 minutes. After 25 minutes, test to see if the cake is done by poking a toothpick into the center. If it comes out clean, the cake is ready. If it's wet, bake the cake for another five minutes and test again. Cool the cake before frosting it. This chocolate cake would be great with a scoop of vanilla ice cream and any kind of frosting you like. Try one of the following cheap frosting recipes to create a delicious, inexpensive cake:\n Vanilla frosting\n Cream cheese frosting\n Chocolate chip frosting Making Yellow Cake Preheat your oven to 375 degrees F/190 degrees C.  Grease a 9 x 13-inch baking pan. Use butter or a light vegetable oil to grease the bottom and sides of the pan to keep the cake from sticking. If you'd rather make a round layer cake, use two 8-inch cake pans instead of one larger rectangular pan. You could also use this recipe to make a dozen cupcakes. Mix the dry ingredients. Mix together the flour, baking powder, and salt in a small bowl. These inexpensive ingredients can all be found in the baking aisle of your grocery store. Use a fork or whisk to make sure they're well incorporated. Mix the sugar and butter in a separate bowl. Beat the mixture well, until the sugar and butter are completely combined. The mixture will look crumbly. Margarine may substituted for butter if you're looking for an even cheaper option. Or try replacing butter with the same amount of canola or vegetable oil. Beat 1/3 cup milk into the mix. Scrape the sides of the bowl and keep mixing. Add an egg and the vanilla. Beat the mixture until the ingredients are fully incorporated. Fold in the flour mixture. Use a spatula to gently stir the flour into the batter. Take care not to stir too vigorously at this stage to keep your cake tender. If you over mix the flour, the cake will turn out dense. Pour the batter into the greased 9 x 13-inch baking pan. Use a spatula to scrape the sides of the mixing bowl. Bake 25 to 30 minutes. After 25 minutes, insert a toothpick, wooden skewer or cake tester into the center of the cake. If it comes out clean or with only a few small crumbs on it, the cake is done. If it's wet, put the cake back in the oven for another 4-5 minutes. Cool the cake and frost as desired. Yellow cake makes a great snack on its own, but it's also nice to eat with frosting. Try one of the following inexpensive frosting recipes to finish your cake:\nSimple five minute frosting\n Chocolate frosting\n Strawberry frosting Finished. You can also put whipped cream on the cake as a topping, it's up to you! Making Fruit Flavored Cake Preheat the oven to 350 degrees F/176 degrees C.  Grease a 9\" cake pan. A round or square baking pan both work fine. You can also bake this cake in a deep cast iron skillet. Mix the flour, baking soda and salt in a small bowl. Use a whisk or a fork to make sure the ingredients are well incorporated. Cream the butter and sugar in a separate bowl. Place them in a mixing bowl and beat until the mixture is light and fluffy. Beat in the eggs and vanilla. Keep the mixer going until all of the wet ingredients are well incorporated. Stir in the flour mixture. Use a spatula to stir the flour mixture into the batter until you no longer see dry bits of flour. Be careful not to overmix. Stir in the fruit. Pour the fruit you're using, whether it's blueberries, blackberries, strawberries, or chopped apples, into the bowl. Stir it into the batter until just incorporated. Fresh fruit tastes great in this recipe, but frozen fruit is a great substitution that's often cheaper than fresh options. Or try using canned fruit; just make sure to drain the syrup it's packed in before using. Pour the batter into the prepared pan. Use a spatula to scrape the batter from the sides of the bowl. Bake the cake for 40 to 45 minutes. After 40 minutes, test to see if the cake is done by inserting a toothpick in the center. If it comes out clean, the cake is ready. If it's wet, bake the cake for five more minutes. Cool the cake for 10 minutes before serving. It's delicious with a scoop of vanilla ice cream or sprinkled with powdered sugar.",
    "sentences": [
        " Making Chocolate Cake Preheat the oven to 350 degrees F/176 degrees C.  Grease a 9\" x 13\" baking pan.",
        "You could also use two 8-inch cake pans or a cupcake tin.",
        "Rub the pan with either butter or a light oil to keep the cake from sticking.",
        "Mix all the ingredients in a large bowl.",
        "Measure out the flour, sugar, baking soda, salt, cocoa, water, vegetable oil and vinegar into the same bowl.",
        "For this easy one-bowl recipe it's not necessary to separate the dry ingredients from the wet.",
        "The vegetable oil is a cheap ingredient that produces a very moist cake.",
        "If you prefer, you can substitute the same amount of butter.",
        "Use milk instead of water if you want a richer flavor.",
        "Beat the mixture until it forms a smooth batter.",
        "Use either a whisk or an electric mixer to beat the batter well.",
        "Pour the batter into the prepared pan.",
        "Use a spatula to scrape the batter from the sides of the bowl into the pan.",
        "Bake the cake for 25 to 30 minutes.",
        "After 25 minutes, test to see if the cake is done by poking a toothpick into the center.",
        "If it comes out clean, the cake is ready.",
        "If it's wet, bake the cake for another five minutes and test again.",
        "Cool the cake before frosting it.",
        "This chocolate cake would be great with a scoop of vanilla ice cream and any kind of frosting you like.",
        "Try one of the following cheap frosting recipes to create a delicious, inexpensive cake:\n Vanilla frosting\n Cream cheese frosting\n Chocolate chip frosting Making Yellow Cake Preheat your oven to 375 degrees F/190 degrees C.  Grease a 9 x 13-inch baking pan.",
        "Use butter or a light vegetable oil to grease the bottom and sides of the pan to keep the cake from sticking.",
        "If you'd rather make a round layer cake, use two 8-inch cake pans instead of one larger rectangular pan.",
        "You could also use this recipe to make a dozen cupcakes.",
        "Mix the dry ingredients.",
        "Mix together the flour, baking powder, and salt in a small bowl.",
        "These inexpensive ingredients can all be found in the baking aisle of your grocery store.",
        "Use a fork or whisk to make sure they're well incorporated.",
        "Mix the sugar and butter in a separate bowl.",
        "Beat the mixture well, until the sugar and butter are completely combined.",
        "The mixture will look crumbly.",
        "Margarine may substituted for butter if you're looking for an even cheaper option.",
        "Or try replacing butter with the same amount of canola or vegetable oil.",
        "Beat 1/3 cup milk into the mix.",
        "Scrape the sides of the bowl and keep mixing.",
        "Add an egg and the vanilla.",
        "Beat the mixture until the ingredients are fully incorporated.",
        "Fold in the flour mixture.",
        "Use a spatula to gently stir the flour into the batter.",
        "Take care not to stir too vigorously at this stage to keep your cake tender.",
        "If you over mix the flour, the cake will turn out dense.",
        "Pour the batter into the greased 9 x 13-inch baking pan.",
        "Use a spatula to scrape the sides of the mixing bowl.",
        "Bake 25 to 30 minutes.",
        "After 25 minutes, insert a toothpick, wooden skewer or cake tester into the center of the cake.",
        "If it comes out clean or with only a few small crumbs on it, the cake is done.",
        "If it's wet, put the cake back in the oven for another 4-5 minutes.",
        "Cool the cake and frost as desired.",
        "Yellow cake makes a great snack on its own, but it's also nice to eat with frosting.",
        "Try one of the following inexpensive frosting recipes to finish your cake:\nSimple five minute frosting\n Chocolate frosting\n Strawberry frosting Finished.",
        "You can also put whipped cream on the cake as a topping, it's up to you!",
        "Making Fruit Flavored Cake Preheat the oven to 350 degrees F/176 degrees C.  Grease a 9\" cake pan.",
        "A round or square baking pan both work fine.",
        "You can also bake this cake in a deep cast iron skillet.",
        "Mix the flour, baking soda and salt in a small bowl.",
        "Use a whisk or a fork to make sure the ingredients are well incorporated.",
        "Cream the butter and sugar in a separate bowl.",
        "Place them in a mixing bowl and beat until the mixture is light and fluffy.",
        "Beat in the eggs and vanilla.",
        "Keep the mixer going until all of the wet ingredients are well incorporated.",
        "Stir in the flour mixture.",
        "Use a spatula to stir the flour mixture into the batter until you no longer see dry bits of flour.",
        "Be careful not to overmix.",
        "Stir in the fruit.",
        "Pour the fruit you're using, whether it's blueberries, blackberries, strawberries, or chopped apples, into the bowl.",
        "Stir it into the batter until just incorporated.",
        "Fresh fruit tastes great in this recipe, but frozen fruit is a great substitution that's often cheaper than fresh options.",
        "Or try using canned fruit; just make sure to drain the syrup it's packed in before using.",
        "Pour the batter into the prepared pan.",
        "Use a spatula to scrape the batter from the sides of the bowl.",
        "Bake the cake for 40 to 45 minutes.",
        "After 40 minutes, test to see if the cake is done by inserting a toothpick in the center.",
        "If it comes out clean, the cake is ready.",
        "If it's wet, bake the cake for five more minutes.",
        "Cool the cake for 10 minutes before serving.",
        "It's delicious with a scoop of vanilla ice cream or sprinkled with powdered sugar."
    ]
}