{
    "title": "How to Make a Virgin Pina Colada",
    "url": "https://www.wikihow.com/Make-a-Virgin-Pina-Colada",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Mocktails"
    ],
    "methods": [
        {
            "name": "Classic Piña Colada",
            "steps": [
                {
                    "headline": "Put the cream of coconut, ice, and pineapple juice in a blender.",
                    "description": "This drink comes together quickly when you add all the ingredients at once. Reserve the pineapple slices, though - those are for the garnish."
                },
                {
                    "headline": "Blend until the ice is crushed.",
                    "description": "It might take several pulses to get the creamy texture of a classic piña colada."
                },
                {
                    "headline": "Pour it into two glasses.",
                    "description": "You can use hurricane glasses for a festive feel."
                },
                {
                    "headline": "Garnish with a pineapple slice and a maraschino cherry.",
                    "description": "Float the pineapple rings on top of the drinks and put the cherries in the middle of the rings."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Banana Piña Colada",
            "steps": [
                {
                    "headline": "Blend the ice, pineapple juice and coconut milk.",
                    "description": "Pulse the blender until the mixture is nice and smooth. Keep going until it's rich and creamy."
                },
                {
                    "headline": "Add the bananas and pineapple chunks.",
                    "description": "Pulse again to blend the mixture together until it has a smoothie-like texture."
                },
                {
                    "headline": "Pour it into two glasses.",
                    "description": "Since this banana piña colada is almost like a smoothie, you could pour it into two tall glasses. Add a couple of straws to make it easier to drink."
                },
                {
                    "headline": "Garnish with sliced pineapple.",
                    "description": "The drink will look more festive if you place a few pineapple rings on the edge of the glasses."
                }
            ]
        },
        {
            "name": "Berry Piña Colada",
            "steps": [
                {
                    "headline": "Blend the ice, coconut cream and pineapple juice.",
                    "description": "Keep pulsing until it's completely smooth and creamy."
                },
                {
                    "headline": "Add the berries.",
                    "description": "You can use strawberries, blueberries, blackberries, or a combination of all three! Blend the berries with the creamy base to create a colorful drink."
                },
                {
                    "headline": "Pour it into two glasses.",
                    "description": "Use clear glasses so you can appreciate the pretty color of your fruity piña colada."
                },
                {
                    "headline": "Garnish with a few sliced berries on top.",
                    "description": "Enjoy your drink with a straw."
                }
            ]
        }
    ],
    "tyn": [
        "Blender",
        "Can opener"
    ],
    "text": " Classic Piña Colada Put the cream of coconut, ice, and pineapple juice in a blender. This drink comes together quickly when you add all the ingredients at once. Reserve the pineapple slices, though - those are for the garnish. Blend until the ice is crushed. It might take several pulses to get the creamy texture of a classic piña colada. Pour it into two glasses. You can use hurricane glasses for a festive feel. Garnish with a pineapple slice and a maraschino cherry. Float the pineapple rings on top of the drinks and put the cherries in the middle of the rings. Finished.  Banana Piña Colada Blend the ice, pineapple juice and coconut milk. Pulse the blender until the mixture is nice and smooth. Keep going until it's rich and creamy. Add the bananas and pineapple chunks. Pulse again to blend the mixture together until it has a smoothie-like texture. Pour it into two glasses. Since this banana piña colada is almost like a smoothie, you could pour it into two tall glasses. Add a couple of straws to make it easier to drink. Garnish with sliced pineapple. The drink will look more festive if you place a few pineapple rings on the edge of the glasses. Berry Piña Colada Blend the ice, coconut cream and pineapple juice. Keep pulsing until it's completely smooth and creamy. Add the berries. You can use strawberries, blueberries, blackberries, or a combination of all three! Blend the berries with the creamy base to create a colorful drink. Pour it into two glasses. Use clear glasses so you can appreciate the pretty color of your fruity piña colada. Garnish with a few sliced berries on top. Enjoy your drink with a straw.",
    "sentences": [
        " Classic Piña Colada Put the cream of coconut, ice, and pineapple juice in a blender.",
        "This drink comes together quickly when you add all the ingredients at once.",
        "Reserve the pineapple slices, though - those are for the garnish.",
        "Blend until the ice is crushed.",
        "It might take several pulses to get the creamy texture of a classic piña colada.",
        "Pour it into two glasses.",
        "You can use hurricane glasses for a festive feel.",
        "Garnish with a pineapple slice and a maraschino cherry.",
        "Float the pineapple rings on top of the drinks and put the cherries in the middle of the rings.",
        "Finished.",
        "Banana Piña Colada Blend the ice, pineapple juice and coconut milk.",
        "Pulse the blender until the mixture is nice and smooth.",
        "Keep going until it's rich and creamy.",
        "Add the bananas and pineapple chunks.",
        "Pulse again to blend the mixture together until it has a smoothie-like texture.",
        "Pour it into two glasses.",
        "Since this banana piña colada is almost like a smoothie, you could pour it into two tall glasses.",
        "Add a couple of straws to make it easier to drink.",
        "Garnish with sliced pineapple.",
        "The drink will look more festive if you place a few pineapple rings on the edge of the glasses.",
        "Berry Piña Colada Blend the ice, coconut cream and pineapple juice.",
        "Keep pulsing until it's completely smooth and creamy.",
        "Add the berries.",
        "You can use strawberries, blueberries, blackberries, or a combination of all three!",
        "Blend the berries with the creamy base to create a colorful drink.",
        "Pour it into two glasses.",
        "Use clear glasses so you can appreciate the pretty color of your fruity piña colada.",
        "Garnish with a few sliced berries on top.",
        "Enjoy your drink with a straw."
    ]
}