{
    "title": "How to Cook Dal",
    "url": "https://www.wikihow.com/Cook-Dal",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Rice and Beans"
    ],
    "steps": [
        {
            "headline": "Prepare the lentils by washing under cold water in a large bowl.",
            "description": "Drain the water and repeat until the water runs clear."
        },
        {
            "headline": "Put the lentils in a deep pan or large pot and cover with 2 qt.",
            "description": "(2 L) of water. Bring the water to a boil and skim off any scum that rises to the surface with a wood spoon."
        },
        {
            "headline": "Add the garlic, ginger, turmeric, chopped chiles, and a pinch of salt to the lentils.",
            "description": "Reduce the heat and cover with a lid, leaving the lid slightly ajar to allow steam to escape."
        },
        {
            "headline": "Simmer gently on low heat for roughly 1 1/2 hours, stirring occasionally.",
            "description": "The lentils should be creamy and smooth by the end of the cooking process. Add small amounts of boiling water at the end if you would prefer a thinner texture for the dal."
        },
        {
            "headline": "Add the two whole chiles to the dal with a pinch of salt.",
            "description": "Simmer for an additional 15 minutes."
        },
        {
            "headline": "Heat the ghee or peanut oil in a frying pan over medium high heat and add the shallots.",
            "description": "Stir the shallots until they are golden brown and slightly crispy, then add the cumin, mustard seeds and crushed chili flakes. Stir the ingredients gently until the mustard seeds begin to pop."
        },
        {
            "headline": "Combine the cooked lentils to the shallots and spice mixture.",
            "description": "Stir all of the ingredients until they are well combined."
        },
        {
            "headline": "Top the finished dal with the cilantro leaves and serve.",
            "description": ""
        }
    ],
    "tyn": [
        "Large bowl",
        "Wooden spoon",
        "Large pot",
        "Frying pan",
        "Sharp knife",
        "Cutting board"
    ],
    "text": " Prepare the lentils by washing under cold water in a large bowl. Drain the water and repeat until the water runs clear. Put the lentils in a deep pan or large pot and cover with 2 qt. (2 L) of water. Bring the water to a boil and skim off any scum that rises to the surface with a wood spoon. Add the garlic, ginger, turmeric, chopped chiles, and a pinch of salt to the lentils. Reduce the heat and cover with a lid, leaving the lid slightly ajar to allow steam to escape. Simmer gently on low heat for roughly 1 1/2 hours, stirring occasionally. The lentils should be creamy and smooth by the end of the cooking process. Add small amounts of boiling water at the end if you would prefer a thinner texture for the dal. Add the two whole chiles to the dal with a pinch of salt. Simmer for an additional 15 minutes. Heat the ghee or peanut oil in a frying pan over medium high heat and add the shallots. Stir the shallots until they are golden brown and slightly crispy, then add the cumin, mustard seeds and crushed chili flakes. Stir the ingredients gently until the mustard seeds begin to pop. Combine the cooked lentils to the shallots and spice mixture. Stir all of the ingredients until they are well combined. Top the finished dal with the cilantro leaves and serve. ",
    "sentences": [
        " Prepare the lentils by washing under cold water in a large bowl.",
        "Drain the water and repeat until the water runs clear.",
        "Put the lentils in a deep pan or large pot and cover with 2 qt.",
        "(2 L) of water.",
        "Bring the water to a boil and skim off any scum that rises to the surface with a wood spoon.",
        "Add the garlic, ginger, turmeric, chopped chiles, and a pinch of salt to the lentils.",
        "Reduce the heat and cover with a lid, leaving the lid slightly ajar to allow steam to escape.",
        "Simmer gently on low heat for roughly 1 1/2 hours, stirring occasionally.",
        "The lentils should be creamy and smooth by the end of the cooking process.",
        "Add small amounts of boiling water at the end if you would prefer a thinner texture for the dal.",
        "Add the two whole chiles to the dal with a pinch of salt.",
        "Simmer for an additional 15 minutes.",
        "Heat the ghee or peanut oil in a frying pan over medium high heat and add the shallots.",
        "Stir the shallots until they are golden brown and slightly crispy, then add the cumin, mustard seeds and crushed chili flakes.",
        "Stir the ingredients gently until the mustard seeds begin to pop.",
        "Combine the cooked lentils to the shallots and spice mixture.",
        "Stir all of the ingredients until they are well combined.",
        "Top the finished dal with the cilantro leaves and serve."
    ]
}