{
    "title": "How to Make Vaseline",
    "url": "https://www.wikihow.com/Make-Vaseline",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Handmade Cosmetics"
    ],
    "methods": [
        {
            "name": "Preparing Simple Two-Ingredient \"Vaseline\"",
            "steps": [
                {
                    "headline": "Combine the beeswax and olive oil.",
                    "description": "Add 1 ounce (28 g) of beeswax and ½ cup (118 ml) of olive oil to a small sauce pan. There’s no need to stir the ingredients because they won’t combine until the beeswax begins to melt. It’s usually easier to use beeswax pellets instead of a block. They’re easier to measure and usually melt more quickly. Be sure to choose yellow beeswax pellets rather than white pellets. White pellets have undergone a refining process so many of their natural properties have been stripped away."
                },
                {
                    "headline": "Melt the mixture on the stove.",
                    "description": "Place the saucepan on the stove and turn the heat to low. Allow the mixture to heat until the beeswax melts completely, which should take approximately 5 to 10 minutes. As the beeswax starts to melt, stir the mixture occasionally to ensure that the ingredients combine fully."
                },
                {
                    "headline": "Pour the mixture into a container and let it cool.",
                    "description": "Once the beeswax has melted and combined with the olive oil, remove the pan from the heat. Carefully pour it into a glass jar or container, and allow it to cool for a couple of hours. That will allow the mixture to solidify slightly so it has the same texture as Vaseline. Choose a container for the mixture that has a lid so dust, dirt, and other debris don’t wind up in your \"Vaseline.\""
                }
            ]
        },
        {
            "name": "Whipping Up Highly Moisturizing \"Vaseline\"",
            "steps": [
                {
                    "headline": "Pour water into a pan and place a glass bowl in the pan.",
                    "description": "Fill a large saucepan approximately halfway with water. Next, place a glass bowl in the pan to create a double boiler."
                },
                {
                    "headline": "Add the coconut oil and wax and heat until they melt.",
                    "description": "When you’ve set up the double boiler, add ¼ cup (50 g) of coconut oil and 2 tablespoons (28 g) of beeswax to the bowl. Place the pan on the burner, and heat on medium-low until the ingredients melt completely, which should take approximately 5 minutes. The mixture will melt more quickly if you use beeswax pellets rather than a block of beeswax. Stir the mixture periodically as it’s melting to ensure that the coconut oil and beeswax combine completely."
                },
                {
                    "headline": "Take the pan off the heat and mix in the olive oil.",
                    "description": "Once the coconut oil and beeswax have melted, remove the pan from the heat. Stir the mixture again so it’s smooth. Next, stir in ⅛ cup (30 ml) of olive oil and whisk the ingredients until they are creamy but you can still pour them. If you want to give your \"Vaseline\" a pleasant scent, you can whisk in two to three drops of tea tree, peppermint, or another essential oil."
                },
                {
                    "headline": "Transfer the mixture to a container and allow it to cool.",
                    "description": "When you’ve finished whisking the \"Vaseline\" mixture, carefully pour it into a glass jar or container with a lid. Let the \"Vaseline\" cool for two to three hours so it has time to solidify before you start using it. The homemade \"Vaseline\" will stay fresh at room temperature for up to a year."
                }
            ]
        },
        {
            "name": "Creating Vegan \"Vaseline\"",
            "steps": [
                {
                    "headline": "Mix equal parts of the cocoa butter wafer and sunflower oil.",
                    "description": "To create a healthy, vegan \"Vaseline,\" you’ll need equal parts organic cocoa butter wafers and organic cold-pressed sunflower oil. Adjust the amounts based on how large a batch of \"Vaseline\" you want, and add them to a small or medium saucepan. For a small batch of the \"Vaseline,\" use approximately 1 tablespoon each of the cocoa butter wafers and the sunflower oil. For a larger batch of the \"Vaseline,\" use approximately ½ cup each of the cocoa butter wafers and the sunflower oil."
                },
                {
                    "headline": "Heat the mixture over low heat until it melts.",
                    "description": "Place the saucepan with the cocoa butter wafers and sunflower oil on the stove, and turn the heat to low. Let the mixture warm until the cocoa butter wafers melt completely, which should take 5 to 10 minutes. Stir the mixture periodically as it’s melting to ensure that the ingredients blend completely."
                },
                {
                    "headline": "Pour the mixture into a container and allow to cool.",
                    "description": "Once the cocoa butter wafers have melted completely, remove the saucepan from the heat. Carefully transfer the \"Vaseline\" mixture to a glass jar or bottle, and allow it to cool for two to three hours before using."
                }
            ]
        }
    ],
    "tyn": [
        "Simple Two-Ingredient \"Vaseline\"",
        "Small saucepan",
        "Spoon",
        "Glass container or jar",
        "Highly Moisturizing \"Vaseline\"",
        "Large saucepan",
        "Glass bowl",
        "Whisk",
        "Vegan \"Vaseline\"",
        "Small or medium saucepan",
        "Glass jar or container"
    ],
    "text": " Preparing Simple Two-Ingredient \"Vaseline\" Combine the beeswax and olive oil. Add 1 ounce (28 g) of beeswax and ½ cup (118 ml) of olive oil to a small sauce pan. There’s no need to stir the ingredients because they won’t combine until the beeswax begins to melt. It’s usually easier to use beeswax pellets instead of a block. They’re easier to measure and usually melt more quickly. Be sure to choose yellow beeswax pellets rather than white pellets. White pellets have undergone a refining process so many of their natural properties have been stripped away. Melt the mixture on the stove. Place the saucepan on the stove and turn the heat to low. Allow the mixture to heat until the beeswax melts completely, which should take approximately 5 to 10 minutes. As the beeswax starts to melt, stir the mixture occasionally to ensure that the ingredients combine fully. Pour the mixture into a container and let it cool. Once the beeswax has melted and combined with the olive oil, remove the pan from the heat. Carefully pour it into a glass jar or container, and allow it to cool for a couple of hours. That will allow the mixture to solidify slightly so it has the same texture as Vaseline. Choose a container for the mixture that has a lid so dust, dirt, and other debris don’t wind up in your \"Vaseline.\" Whipping Up Highly Moisturizing \"Vaseline\" Pour water into a pan and place a glass bowl in the pan. Fill a large saucepan approximately halfway with water. Next, place a glass bowl in the pan to create a double boiler. Add the coconut oil and wax and heat until they melt. When you’ve set up the double boiler, add ¼ cup (50 g) of coconut oil and 2 tablespoons (28 g) of beeswax to the bowl. Place the pan on the burner, and heat on medium-low until the ingredients melt completely, which should take approximately 5 minutes. The mixture will melt more quickly if you use beeswax pellets rather than a block of beeswax. Stir the mixture periodically as it’s melting to ensure that the coconut oil and beeswax combine completely. Take the pan off the heat and mix in the olive oil. Once the coconut oil and beeswax have melted, remove the pan from the heat. Stir the mixture again so it’s smooth. Next, stir in ⅛ cup (30 ml) of olive oil and whisk the ingredients until they are creamy but you can still pour them. If you want to give your \"Vaseline\" a pleasant scent, you can whisk in two to three drops of tea tree, peppermint, or another essential oil. Transfer the mixture to a container and allow it to cool. When you’ve finished whisking the \"Vaseline\" mixture, carefully pour it into a glass jar or container with a lid. Let the \"Vaseline\" cool for two to three hours so it has time to solidify before you start using it. The homemade \"Vaseline\" will stay fresh at room temperature for up to a year. Creating Vegan \"Vaseline\" Mix equal parts of the cocoa butter wafer and sunflower oil. To create a healthy, vegan \"Vaseline,\" you’ll need equal parts organic cocoa butter wafers and organic cold-pressed sunflower oil. Adjust the amounts based on how large a batch of \"Vaseline\" you want, and add them to a small or medium saucepan. For a small batch of the \"Vaseline,\" use approximately 1 tablespoon each of the cocoa butter wafers and the sunflower oil. For a larger batch of the \"Vaseline,\" use approximately ½ cup each of the cocoa butter wafers and the sunflower oil. Heat the mixture over low heat until it melts. Place the saucepan with the cocoa butter wafers and sunflower oil on the stove, and turn the heat to low. Let the mixture warm until the cocoa butter wafers melt completely, which should take 5 to 10 minutes. Stir the mixture periodically as it’s melting to ensure that the ingredients blend completely. Pour the mixture into a container and allow to cool. Once the cocoa butter wafers have melted completely, remove the saucepan from the heat. Carefully transfer the \"Vaseline\" mixture to a glass jar or bottle, and allow it to cool for two to three hours before using.",
    "sentences": [
        " Preparing Simple Two-Ingredient \"Vaseline\" Combine the beeswax and olive oil.",
        "Add 1 ounce (28 g) of beeswax and ½ cup (118 ml) of olive oil to a small sauce pan.",
        "There’s no need to stir the ingredients because they won’t combine until the beeswax begins to melt.",
        "It’s usually easier to use beeswax pellets instead of a block.",
        "They’re easier to measure and usually melt more quickly.",
        "Be sure to choose yellow beeswax pellets rather than white pellets.",
        "White pellets have undergone a refining process so many of their natural properties have been stripped away.",
        "Melt the mixture on the stove.",
        "Place the saucepan on the stove and turn the heat to low.",
        "Allow the mixture to heat until the beeswax melts completely, which should take approximately 5 to 10 minutes.",
        "As the beeswax starts to melt, stir the mixture occasionally to ensure that the ingredients combine fully.",
        "Pour the mixture into a container and let it cool.",
        "Once the beeswax has melted and combined with the olive oil, remove the pan from the heat.",
        "Carefully pour it into a glass jar or container, and allow it to cool for a couple of hours.",
        "That will allow the mixture to solidify slightly so it has the same texture as Vaseline.",
        "Choose a container for the mixture that has a lid so dust, dirt, and other debris don’t wind up in your \"Vaseline.\"",
        "Whipping Up Highly Moisturizing \"Vaseline\" Pour water into a pan and place a glass bowl in the pan.",
        "Fill a large saucepan approximately halfway with water.",
        "Next, place a glass bowl in the pan to create a double boiler.",
        "Add the coconut oil and wax and heat until they melt.",
        "When you’ve set up the double boiler, add ¼ cup (50 g) of coconut oil and 2 tablespoons (28 g) of beeswax to the bowl.",
        "Place the pan on the burner, and heat on medium-low until the ingredients melt completely, which should take approximately 5 minutes.",
        "The mixture will melt more quickly if you use beeswax pellets rather than a block of beeswax.",
        "Stir the mixture periodically as it’s melting to ensure that the coconut oil and beeswax combine completely.",
        "Take the pan off the heat and mix in the olive oil.",
        "Once the coconut oil and beeswax have melted, remove the pan from the heat.",
        "Stir the mixture again so it’s smooth.",
        "Next, stir in ⅛ cup (30 ml) of olive oil and whisk the ingredients until they are creamy but you can still pour them.",
        "If you want to give your \"Vaseline\" a pleasant scent, you can whisk in two to three drops of tea tree, peppermint, or another essential oil.",
        "Transfer the mixture to a container and allow it to cool.",
        "When you’ve finished whisking the \"Vaseline\" mixture, carefully pour it into a glass jar or container with a lid.",
        "Let the \"Vaseline\" cool for two to three hours so it has time to solidify before you start using it.",
        "The homemade \"Vaseline\" will stay fresh at room temperature for up to a year.",
        "Creating Vegan \"Vaseline\" Mix equal parts of the cocoa butter wafer and sunflower oil.",
        "To create a healthy, vegan \"Vaseline,\" you’ll need equal parts organic cocoa butter wafers and organic cold-pressed sunflower oil.",
        "Adjust the amounts based on how large a batch of \"Vaseline\" you want, and add them to a small or medium saucepan.",
        "For a small batch of the \"Vaseline,\" use approximately 1 tablespoon each of the cocoa butter wafers and the sunflower oil.",
        "For a larger batch of the \"Vaseline,\" use approximately ½ cup each of the cocoa butter wafers and the sunflower oil.",
        "Heat the mixture over low heat until it melts.",
        "Place the saucepan with the cocoa butter wafers and sunflower oil on the stove, and turn the heat to low.",
        "Let the mixture warm until the cocoa butter wafers melt completely, which should take 5 to 10 minutes.",
        "Stir the mixture periodically as it’s melting to ensure that the ingredients blend completely.",
        "Pour the mixture into a container and allow to cool.",
        "Once the cocoa butter wafers have melted completely, remove the saucepan from the heat.",
        "Carefully transfer the \"Vaseline\" mixture to a glass jar or bottle, and allow it to cool for two to three hours before using."
    ]
}