{
    "title": "How to Cut Your Own Hair (Men)",
    "url": "https://www.wikihow.com/Cut-Your-Own-Hair-(Men)",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Haircuts",
        "Men's Haircuts"
    ],
    "parts": [
        {
            "name": "Getting Your Hair Ready",
            "steps": [
                {
                    "headline": "Wash your hair before you cut it.",
                    "description": "Your hair will be easier to work with if it's clean and snarl-free. Get your hair wet under running water and use shampoo and conditioner, rinsing both out after you've worked them through your hair."
                },
                {
                    "headline": "Detangle your hair with a comb.",
                    "description": "Run the comb through your hair and work out any knots with the comb or with your fingers. Ridding your hair of tangles beforehand will result in a cleaner, more even cut. If your hair dries out while you comb it, spritz it with water until it's damp again. Use a detangling product or a natural remedy to tackle particularly stubborn snarls."
                },
                {
                    "headline": "Towel dry your hair.",
                    "description": "The best time to cut your hair is when it's damp, but not soaking wet. If your hair's still dripping, dry it off with a towel. Comb your hair again to get rid of any tangles made from drying it. If you cut your hair while it's still wet, it may not lay the same way it does while it's dry."
                },
                {
                    "headline": "Find a comfortable place to cut your hair.",
                    "description": "Cutting your hair can take up to several hours, especially if you've never done it before. Choose a spot where you can sit down and work without worrying about making a mess. The best place to cut hair is the bathroom, where you'll have access to running water and a mirror."
                },
                {
                    "headline": "Position yourself near a mirror.",
                    "description": "You’ll want to be able to see what you’re doing as much as possible. A large-sized mirror on your bathroom wall or medicine cabinet will help you see what you’re cutting in front or on the sides. If possible, set up a second mirror so you can see the back of your head, either hanging from the wall opposite or as a hand mirror held by someone else."
                },
                {
                    "headline": "Section your hair into parts.",
                    "description": "Run the comb back through your hair right about where your head curves, then comb the hair between the part and the ear down. Do this on both sides to section off both sides of your head. If your hair is long enough, you can use clips to hold the top section away from your sides."
                }
            ]
        },
        {
            "name": "Cutting the Back and Sides with Clippers",
            "steps": [
                {
                    "headline": "Use clippers on a small guard setting to cut the back and sides.",
                    "description": "Clippers are the best for the back and sides for beginners or those who want a basic haircut. Set your clippers' guard, which controls how much hair you can cut, to 1 or 2 to make conservative cuts while you work."
                },
                {
                    "headline": "Cut one side of the head at a time.",
                    "description": "Use a low clipper guard around sides and, with the blade's edge, trim from the bottom of the sides to the top. Tilt the clipper blade at an angle as you work to create an even fade with the rest of your hair. Then, repeat this process on the other side of your head before moving to the back, making sure to transition between lengths at the same point on both sides. Going against your hair's grain will result in a cleaner cut. Some clippers come with ear tapers, which help you cut above and around your ears. Use these, if available, to make cleaner cuts around the ears."
                },
                {
                    "headline": "Move to the back of your head.",
                    "description": "After cutting your sides, trim the back of your head from the bottom to the top as you did with the sides. To make sure you're cutting evenly, have a friend hold up a mirror or position a mirror behind you so you can check your progress as you cut. Use the same guard length on the back and sides of your hair when performing basic, at-home haircuts."
                },
                {
                    "headline": "Go over the lower half with a shorter setting.",
                    "description": "To even out fades between cuts, go over the lower half of your hair with your clippers set to a shorter setting. Lift your hair as you approach your temples and earlobes. Work slowly while using clippers to ensure as even of a fade as possible."
                }
            ]
        },
        {
            "name": "Using Scissors to Cut the Top",
            "steps": [
                {
                    "headline": "Use styling scissors on the top of your head.",
                    "description": "Using styling scissors instead of clippers will help you make more precise cuts and give your hair more texture. You can buy styling scissors online or at most hair care stores. Do not use household scissors to cut your hair, as they aren't sharp enough to properly cut hair so you're more likely to make mistakes."
                },
                {
                    "headline": "Trim the top in sections.",
                    "description": "Use your fingers or a comb to raise the hair from the top of your head. Work slowly and carefully in 1/4 in (about 6 mm) sections. These should be parallel to the front of your hairline. As you trim, pull a little of the previously cut section into the new section as a traveling guideline. Cuts to the hair on top of your head are more noticeable than cuts to the hair on the sides of your head. Always start with conservative cuts. Remember, you can always cut more, but you can't add back lost length. When you've finished with this area, you can check your guideline by holding up a section of hair that is perpendicular to your hairline. Your hair should be the same length across the entirety of this section. Be gentle on your head while cutting the crown, which is usually more tender than the rest of the head."
                },
                {
                    "headline": "Trim your bangs, if applicable, with styling scissors.",
                    "description": "If you have bangs, section it into small parts. Brush your comb through each section the amount you want to cut pokes through the end and trim it off with your scissors."
                }
            ]
        },
        {
            "name": "Making Finishing Touches",
            "steps": [
                {
                    "headline": "Even out the sides.",
                    "description": "Use a mirror to check your sides and make sure they are even. Comb your hair straight out and grab a horizontal section from about the same point on each side of your head. Check to see if these sections are the same length. If they are not, trim away any extra length and bumps, taking off small amounts at a time. Remember, it's always easier to cut a little and touch up more later."
                },
                {
                    "headline": "Cut your sideburns to your desired length.",
                    "description": "You can trim your sideburns with either a safety razor or with your clippers. If you want long sideburns, trim from the bottom of your ears. If shorter, you can use the depression below your cheekbone to determine where the bottoms of your sideburns should be. Place your fingers underneath each sideburn to check that they’re even after trimming."
                },
                {
                    "headline": "Blend your top with your sides.",
                    "description": "Comb the top of your hair down toward your sides. Holding your sheers vertically, cut into the corners to remove bulk."
                },
                {
                    "headline": "Taper your neckline.",
                    "description": "Use your clippers or a beard trimmer to cut the hair growing on the nape of your neck. Start with a grazing cut at the top of the neckline, then cut progressively closer as you work toward the nape of the neck. Use a handheld mirror to examine your neckline after tapering it to make sure it looks neat and even."
                },
                {
                    "headline": "Style your hair immediately after cutting it.",
                    "description": "After cutting your hair, rinse it in the shower to remove any strays. Towel dry, then, part it with a comb and style it as you usually would. Decide whether you're happy with your new style and, if not, either cut it again or visit a hairstylist to make extensive changes. If you notice any mistakes or uneven areas while styling, trim these areas again as needed."
                }
            ]
        }
    ],
    "tyn": [
        "Mirror",
        "Shampoo",
        "Conditioner",
        "Towel",
        "Clippers",
        "Styling scissors",
        "Detangling product (optional)"
    ],
    "text": " Getting Your Hair Ready Wash your hair before you cut it. Your hair will be easier to work with if it's clean and snarl-free. Get your hair wet under running water and use shampoo and conditioner, rinsing both out after you've worked them through your hair. Detangle your hair with a comb. Run the comb through your hair and work out any knots with the comb or with your fingers. Ridding your hair of tangles beforehand will result in a cleaner, more even cut. If your hair dries out while you comb it, spritz it with water until it's damp again. Use a detangling product or a natural remedy to tackle particularly stubborn snarls. Towel dry your hair. The best time to cut your hair is when it's damp, but not soaking wet. If your hair's still dripping, dry it off with a towel. Comb your hair again to get rid of any tangles made from drying it. If you cut your hair while it's still wet, it may not lay the same way it does while it's dry. Find a comfortable place to cut your hair. Cutting your hair can take up to several hours, especially if you've never done it before. Choose a spot where you can sit down and work without worrying about making a mess. The best place to cut hair is the bathroom, where you'll have access to running water and a mirror. Position yourself near a mirror. You’ll want to be able to see what you’re doing as much as possible. A large-sized mirror on your bathroom wall or medicine cabinet will help you see what you’re cutting in front or on the sides. If possible, set up a second mirror so you can see the back of your head, either hanging from the wall opposite or as a hand mirror held by someone else. Section your hair into parts. Run the comb back through your hair right about where your head curves, then comb the hair between the part and the ear down. Do this on both sides to section off both sides of your head. If your hair is long enough, you can use clips to hold the top section away from your sides. Cutting the Back and Sides with Clippers Use clippers on a small guard setting to cut the back and sides. Clippers are the best for the back and sides for beginners or those who want a basic haircut. Set your clippers' guard, which controls how much hair you can cut, to 1 or 2 to make conservative cuts while you work. Cut one side of the head at a time. Use a low clipper guard around sides and, with the blade's edge, trim from the bottom of the sides to the top. Tilt the clipper blade at an angle as you work to create an even fade with the rest of your hair. Then, repeat this process on the other side of your head before moving to the back, making sure to transition between lengths at the same point on both sides. Going against your hair's grain will result in a cleaner cut. Some clippers come with ear tapers, which help you cut above and around your ears. Use these, if available, to make cleaner cuts around the ears. Move to the back of your head. After cutting your sides, trim the back of your head from the bottom to the top as you did with the sides. To make sure you're cutting evenly, have a friend hold up a mirror or position a mirror behind you so you can check your progress as you cut. Use the same guard length on the back and sides of your hair when performing basic, at-home haircuts. Go over the lower half with a shorter setting. To even out fades between cuts, go over the lower half of your hair with your clippers set to a shorter setting. Lift your hair as you approach your temples and earlobes. Work slowly while using clippers to ensure as even of a fade as possible. Using Scissors to Cut the Top Use styling scissors on the top of your head. Using styling scissors instead of clippers will help you make more precise cuts and give your hair more texture. You can buy styling scissors online or at most hair care stores. Do not use household scissors to cut your hair, as they aren't sharp enough to properly cut hair so you're more likely to make mistakes. Trim the top in sections. Use your fingers or a comb to raise the hair from the top of your head. Work slowly and carefully in 1/4 in (about 6 mm) sections. These should be parallel to the front of your hairline. As you trim, pull a little of the previously cut section into the new section as a traveling guideline. Cuts to the hair on top of your head are more noticeable than cuts to the hair on the sides of your head. Always start with conservative cuts. Remember, you can always cut more, but you can't add back lost length. When you've finished with this area, you can check your guideline by holding up a section of hair that is perpendicular to your hairline. Your hair should be the same length across the entirety of this section. Be gentle on your head while cutting the crown, which is usually more tender than the rest of the head. Trim your bangs, if applicable, with styling scissors. If you have bangs, section it into small parts. Brush your comb through each section the amount you want to cut pokes through the end and trim it off with your scissors. Making Finishing Touches Even out the sides. Use a mirror to check your sides and make sure they are even. Comb your hair straight out and grab a horizontal section from about the same point on each side of your head. Check to see if these sections are the same length. If they are not, trim away any extra length and bumps, taking off small amounts at a time. Remember, it's always easier to cut a little and touch up more later. Cut your sideburns to your desired length. You can trim your sideburns with either a safety razor or with your clippers. If you want long sideburns, trim from the bottom of your ears. If shorter, you can use the depression below your cheekbone to determine where the bottoms of your sideburns should be. Place your fingers underneath each sideburn to check that they’re even after trimming. Blend your top with your sides. Comb the top of your hair down toward your sides. Holding your sheers vertically, cut into the corners to remove bulk. Taper your neckline. Use your clippers or a beard trimmer to cut the hair growing on the nape of your neck. Start with a grazing cut at the top of the neckline, then cut progressively closer as you work toward the nape of the neck. Use a handheld mirror to examine your neckline after tapering it to make sure it looks neat and even. Style your hair immediately after cutting it. After cutting your hair, rinse it in the shower to remove any strays. Towel dry, then, part it with a comb and style it as you usually would. Decide whether you're happy with your new style and, if not, either cut it again or visit a hairstylist to make extensive changes. If you notice any mistakes or uneven areas while styling, trim these areas again as needed.",
    "sentences": [
        " Getting Your Hair Ready Wash your hair before you cut it.",
        "Your hair will be easier to work with if it's clean and snarl-free.",
        "Get your hair wet under running water and use shampoo and conditioner, rinsing both out after you've worked them through your hair.",
        "Detangle your hair with a comb.",
        "Run the comb through your hair and work out any knots with the comb or with your fingers.",
        "Ridding your hair of tangles beforehand will result in a cleaner, more even cut.",
        "If your hair dries out while you comb it, spritz it with water until it's damp again.",
        "Use a detangling product or a natural remedy to tackle particularly stubborn snarls.",
        "Towel dry your hair.",
        "The best time to cut your hair is when it's damp, but not soaking wet.",
        "If your hair's still dripping, dry it off with a towel.",
        "Comb your hair again to get rid of any tangles made from drying it.",
        "If you cut your hair while it's still wet, it may not lay the same way it does while it's dry.",
        "Find a comfortable place to cut your hair.",
        "Cutting your hair can take up to several hours, especially if you've never done it before.",
        "Choose a spot where you can sit down and work without worrying about making a mess.",
        "The best place to cut hair is the bathroom, where you'll have access to running water and a mirror.",
        "Position yourself near a mirror.",
        "You’ll want to be able to see what you’re doing as much as possible.",
        "A large-sized mirror on your bathroom wall or medicine cabinet will help you see what you’re cutting in front or on the sides.",
        "If possible, set up a second mirror so you can see the back of your head, either hanging from the wall opposite or as a hand mirror held by someone else.",
        "Section your hair into parts.",
        "Run the comb back through your hair right about where your head curves, then comb the hair between the part and the ear down.",
        "Do this on both sides to section off both sides of your head.",
        "If your hair is long enough, you can use clips to hold the top section away from your sides.",
        "Cutting the Back and Sides with Clippers Use clippers on a small guard setting to cut the back and sides.",
        "Clippers are the best for the back and sides for beginners or those who want a basic haircut.",
        "Set your clippers' guard, which controls how much hair you can cut, to 1 or 2 to make conservative cuts while you work.",
        "Cut one side of the head at a time.",
        "Use a low clipper guard around sides and, with the blade's edge, trim from the bottom of the sides to the top.",
        "Tilt the clipper blade at an angle as you work to create an even fade with the rest of your hair.",
        "Then, repeat this process on the other side of your head before moving to the back, making sure to transition between lengths at the same point on both sides.",
        "Going against your hair's grain will result in a cleaner cut.",
        "Some clippers come with ear tapers, which help you cut above and around your ears.",
        "Use these, if available, to make cleaner cuts around the ears.",
        "Move to the back of your head.",
        "After cutting your sides, trim the back of your head from the bottom to the top as you did with the sides.",
        "To make sure you're cutting evenly, have a friend hold up a mirror or position a mirror behind you so you can check your progress as you cut.",
        "Use the same guard length on the back and sides of your hair when performing basic, at-home haircuts.",
        "Go over the lower half with a shorter setting.",
        "To even out fades between cuts, go over the lower half of your hair with your clippers set to a shorter setting.",
        "Lift your hair as you approach your temples and earlobes.",
        "Work slowly while using clippers to ensure as even of a fade as possible.",
        "Using Scissors to Cut the Top Use styling scissors on the top of your head.",
        "Using styling scissors instead of clippers will help you make more precise cuts and give your hair more texture.",
        "You can buy styling scissors online or at most hair care stores.",
        "Do not use household scissors to cut your hair, as they aren't sharp enough to properly cut hair so you're more likely to make mistakes.",
        "Trim the top in sections.",
        "Use your fingers or a comb to raise the hair from the top of your head.",
        "Work slowly and carefully in 1/4 in (about 6 mm) sections.",
        "These should be parallel to the front of your hairline.",
        "As you trim, pull a little of the previously cut section into the new section as a traveling guideline.",
        "Cuts to the hair on top of your head are more noticeable than cuts to the hair on the sides of your head.",
        "Always start with conservative cuts.",
        "Remember, you can always cut more, but you can't add back lost length.",
        "When you've finished with this area, you can check your guideline by holding up a section of hair that is perpendicular to your hairline.",
        "Your hair should be the same length across the entirety of this section.",
        "Be gentle on your head while cutting the crown, which is usually more tender than the rest of the head.",
        "Trim your bangs, if applicable, with styling scissors.",
        "If you have bangs, section it into small parts.",
        "Brush your comb through each section the amount you want to cut pokes through the end and trim it off with your scissors.",
        "Making Finishing Touches Even out the sides.",
        "Use a mirror to check your sides and make sure they are even.",
        "Comb your hair straight out and grab a horizontal section from about the same point on each side of your head.",
        "Check to see if these sections are the same length.",
        "If they are not, trim away any extra length and bumps, taking off small amounts at a time.",
        "Remember, it's always easier to cut a little and touch up more later.",
        "Cut your sideburns to your desired length.",
        "You can trim your sideburns with either a safety razor or with your clippers.",
        "If you want long sideburns, trim from the bottom of your ears.",
        "If shorter, you can use the depression below your cheekbone to determine where the bottoms of your sideburns should be.",
        "Place your fingers underneath each sideburn to check that they’re even after trimming.",
        "Blend your top with your sides.",
        "Comb the top of your hair down toward your sides.",
        "Holding your sheers vertically, cut into the corners to remove bulk.",
        "Taper your neckline.",
        "Use your clippers or a beard trimmer to cut the hair growing on the nape of your neck.",
        "Start with a grazing cut at the top of the neckline, then cut progressively closer as you work toward the nape of the neck.",
        "Use a handheld mirror to examine your neckline after tapering it to make sure it looks neat and even.",
        "Style your hair immediately after cutting it.",
        "After cutting your hair, rinse it in the shower to remove any strays.",
        "Towel dry, then, part it with a comb and style it as you usually would.",
        "Decide whether you're happy with your new style and, if not, either cut it again or visit a hairstylist to make extensive changes.",
        "If you notice any mistakes or uneven areas while styling, trim these areas again as needed."
    ]
}