{
    "title": "How to Make Chicken Ala King",
    "url": "https://www.wikihow.com/Make-Chicken-Ala-King",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Poultry Recipes",
        "Chicken"
    ],
    "methods": [
        {
            "name": "Cooking the Chicken",
            "steps": [
                {
                    "headline": "Preheat the oven and arrange the rack properly.",
                    "description": "To ensure that the oven is hot enough to roast the chicken, it’s important to preheat the oven. Set the temperature to 400 degrees Fahrenheit (200 degrees Celsius), and allow it to fully heat. Make sure that the oven rack is in the center position too. Keep an eye on your oven so you know when it’s fully preheated. It will probably beep or flash an indicator light when it’s ready."
                },
                {
                    "headline": "Rub the chicken with oil and season with salt and pepper.",
                    "description": "Take 3 ½ pounds (1.6 kg) of bone-in chicken breasts and whole chicken legs, and coat both sides of the chicken pieces with approximately 2 tablespoons (30 ml) of olive oil. Apply a generous amount of salt and pepper to both sides for seasoning as well. If you don’t have any olive oil on hand, you can substitute vegetable or canola oil. The taste will be slightly different, but you shouldn’t notice any other differences."
                },
                {
                    "headline": "Place the chicken on a baking sheet and cook for 45 to 50 minutes.",
                    "description": "Once the chicken is coated with oil and seasoned, set the pieces on a baking sheet. Roast it in the oven for approximately 45 to 50 minutes or until its internal temperature reaches 160 degrees Fahrenheit (71 degrees Celsius). Have an instant-read thermometer on hand so you can quickly and easily determine the chicken’s internal temperature. Make sure to test each piece because they can cook differently depending on their size and thickness."
                },
                {
                    "headline": "Allow the chicken to cool on a cutting board.",
                    "description": "When the chicken has finished roasting, remove it from the pan. Transfer it to a cutting board, and let the pieces to cool enough for handling. That typically takes approximately 20 minutes."
                }
            ]
        },
        {
            "name": "Preparing the Vegetables and Herbs",
            "steps": [
                {
                    "headline": "Soak the porcini mushrooms in boiling water.",
                    "description": "Place 1 cup (28 g) dried of porcini mushrooms in a medium-size bowl, and pour 1 cup (235 ml) of boiling water over them. Allow the mushrooms to soak in the water for about 20 minutes. Make sure that all of the mushrooms are covered by the water so they all soften."
                },
                {
                    "headline": "Chop the Italian parsley and tarragon.",
                    "description": "While the mushrooms soak, use a sharp knife to finely chop 5 sprigs of fresh Italian parsley and 1 bunch of fresh tarragon. You’ll need 1 tablespoon (15 g) of each when you’re finished chopping. Place the chopped herbs in a small bowl and set aside. The best way to chop herbs is to gather them up in a tight ball. Hold the ball with your non-knife hand, curling your fingers underneath to keep them safe, and balance the knife against the knuckles on your non-knife hand. Move the knife in a rocking motion to chop. You’ll need to go over the herbs several time to get a fine chop."
                },
                {
                    "headline": "Slice the cremini mushrooms and chop the shallots.",
                    "description": "Take 8 ounces (224 g) of cremini mushrooms that have been cleaned and trimmed, and chop them into ¼-inch (6 mm) thick pieces. Place them in a medium size bowl and set aside. Next, finely chop 2 medium shallots, and place them in a small bowl to set aside. You can substitute your favorite type of mushrooms for the cremini or use a mix of mushrooms if you prefer. For example, you might use shiitake or a mix of cremini and shiitake."
                },
                {
                    "headline": "Remove the porcini mushrooms from the water and chop.",
                    "description": "After the 20 minutes are up, take the porcini mushrooms out of the water. Set the water aside for later use. Transfer the mushrooms to a cutting board, and chop coarsely. Place them in a small bowl and set aside. It’s best to remove the mushrooms from the water with a slotted spoon. That ensures that you won’t lose any of the mushroom liquid."
                },
                {
                    "headline": "Pour the chicken stock into a bowl and add some of the mushroom liquid.",
                    "description": "Add 2 cups (470 ml) of low-sodium chicken stock or broth to a medium-size bowl. Take ½ cup of the mushroom soaking liquid, mix it into the chicken stock, and set aside. When you’re measuring the mushroom soaking liquid, make sure not to include any of the sediment that may be at the bottom of the bowl."
                }
            ]
        },
        {
            "name": "Sauteing the Mushrooms",
            "steps": [
                {
                    "headline": "Melt the butter in a large skillet.",
                    "description": "Set a large skillet on the stove, and add 4 tablespoons (57 g) of unsalted butter. Turn the heat to medium, and allow the butter to melt until it becomes foamy. The butter will melt more quickly if you cut it into pieces before placing it in the skillet."
                },
                {
                    "headline": "Cook the shallots in the pan for several minutes.",
                    "description": "Once the butter has melted completely, add the finely chopped shallots to the skillet. Cook them over medium heat until they are softened, which should take approximately 3 minutes. To ensure that the shallots cook evenly, use a wooden spoon to stir them occasionally as you heat them."
                },
                {
                    "headline": "Add the cremini mushrooms and cook them until softened.",
                    "description": "After the shallots have softened, mix in the sliced cremini mushrooms. Allow them to cook over medium heat until they have softened as well. Typically, that takes about 5 minutes. Remember to stir mushrooms occasionally as well, so they don’t burn."
                },
                {
                    "headline": "Stir in the salt, pepper, and porcini mushrooms.",
                    "description": "After the cremini mushrooms have cooked, mix 2 teaspoons (11 g) of kosher salt, ¼ teaspoon (2.5 g) of freshly ground black pepper, and the coarsely chopped porcini mushrooms to the skillet. Stir the mixture well to ensure that it’s well blended."
                }
            ]
        },
        {
            "name": "Making the Sauce",
            "steps": [
                {
                    "headline": "Spread the flour over the mushroom mixture and cook for several minutes.",
                    "description": "Slowly sprinkle 5 tablespoons (40 g) of all-purpose flour over the mushroom mixture and stir so it’s well incorporated. Allow the mixture to cook on medium heat for about 3 minutes to get rid of the raw flour taste. Stir the mixture occasionally so it cooks to avoid scorching."
                },
                {
                    "headline": "Mix in the chicken stock mixture.",
                    "description": "After you’ve gotten rid of the floury taste, slowly add the chicken stock and mushroom soaking liquid mixture to the skillet. Use a whisk to blend the liquid in as you pour so it’s well blended. Whisk the mixture slowly and steadily to prevent any lumps from forming."
                },
                {
                    "headline": "Add the milk and cream and bring to a boil.",
                    "description": "Once the chicken stock mixture is incorporated, add 1 cup (240 ml) of whole milk and ½ cup (120 ml) of heavy cream to the skillet. Raise the heat to medium high, and bring the mixture to a boil. To keep the sauce smooth, whisk it occasionally as you’re bringing it to a boil."
                },
                {
                    "headline": "Lower the heat and simmer the sauce until it thickens.",
                    "description": "After the sauce has a reached a boil, lower the heat to low and allow it to simmer until it becomes thick and smooth. Typically, that takes about 10 to 15 minutes. You should whisk the sauce every so often while it’s cooking to keep it smooth and lump-free."
                }
            ]
        },
        {
            "name": "Pulling the Dish Together",
            "steps": [
                {
                    "headline": "Cut the chicken away from the bone and into bite-size pieces.",
                    "description": "While you’re waiting for the sauce to cook down, remove all of the chicken meat from the bone. Use a knife or tear the meat with your fingers to create bite-size pieces. When you’re cutting the chicken away from the bone, be sure to discard the skin, cartilage, and fat."
                },
                {
                    "headline": "Stir the chicken, peas, sherry, and chopped tarragon and parsley into the sauce.",
                    "description": "When the sauce has thickened fully, mix the chicken, 1 cup (150 g) of frozen peas that have been thawed,1 tablespoon (15 ml) dry sherry, and the chopped tarragon and parsley into the skillet. Stir the mixture well to ensure that all of the ingredients are well blended and coated with sauce."
                },
                {
                    "headline": "Cook the dish until warmed through and season with salt and pepper for serving.",
                    "description": "After all of the ingredients are combined, allow the dish to cook on low heat for approximately 5 minutes or until it’s completely warmed through.Taste it, and season with salt and pepper as necessary. Serve immediately. Chicken a la King is often served over warm biscuits, toast, or puff pastry shells. However, you can serve it with pasta or rice if you prefer."
                }
            ]
        }
    ],
    "tyn": [
        "A baking sheet",
        "An instant-read thermometer",
        "A cutting board",
        "3 medium bowls",
        "3 small bowls",
        "A knife",
        "A large skillet",
        "A wooden spoon",
        "A whisk"
    ],
    "text": " Cooking the Chicken Preheat the oven and arrange the rack properly. To ensure that the oven is hot enough to roast the chicken, it’s important to preheat the oven. Set the temperature to 400 degrees Fahrenheit (200 degrees Celsius), and allow it to fully heat. Make sure that the oven rack is in the center position too. Keep an eye on your oven so you know when it’s fully preheated. It will probably beep or flash an indicator light when it’s ready. Rub the chicken with oil and season with salt and pepper. Take 3 ½ pounds (1.6 kg) of bone-in chicken breasts and whole chicken legs, and coat both sides of the chicken pieces with approximately 2 tablespoons (30 ml) of olive oil. Apply a generous amount of salt and pepper to both sides for seasoning as well. If you don’t have any olive oil on hand, you can substitute vegetable or canola oil. The taste will be slightly different, but you shouldn’t notice any other differences. Place the chicken on a baking sheet and cook for 45 to 50 minutes. Once the chicken is coated with oil and seasoned, set the pieces on a baking sheet. Roast it in the oven for approximately 45 to 50 minutes or until its internal temperature reaches 160 degrees Fahrenheit (71 degrees Celsius). Have an instant-read thermometer on hand so you can quickly and easily determine the chicken’s internal temperature. Make sure to test each piece because they can cook differently depending on their size and thickness. Allow the chicken to cool on a cutting board. When the chicken has finished roasting, remove it from the pan. Transfer it to a cutting board, and let the pieces to cool enough for handling. That typically takes approximately 20 minutes. Preparing the Vegetables and Herbs Soak the porcini mushrooms in boiling water. Place 1 cup (28 g) dried of porcini mushrooms in a medium-size bowl, and pour 1 cup (235 ml) of boiling water over them. Allow the mushrooms to soak in the water for about 20 minutes. Make sure that all of the mushrooms are covered by the water so they all soften. Chop the Italian parsley and tarragon. While the mushrooms soak, use a sharp knife to finely chop 5 sprigs of fresh Italian parsley and 1 bunch of fresh tarragon. You’ll need 1 tablespoon (15 g) of each when you’re finished chopping. Place the chopped herbs in a small bowl and set aside. The best way to chop herbs is to gather them up in a tight ball. Hold the ball with your non-knife hand, curling your fingers underneath to keep them safe, and balance the knife against the knuckles on your non-knife hand. Move the knife in a rocking motion to chop. You’ll need to go over the herbs several time to get a fine chop. Slice the cremini mushrooms and chop the shallots. Take 8 ounces (224 g) of cremini mushrooms that have been cleaned and trimmed, and chop them into ¼-inch (6 mm) thick pieces. Place them in a medium size bowl and set aside. Next, finely chop 2 medium shallots, and place them in a small bowl to set aside. You can substitute your favorite type of mushrooms for the cremini or use a mix of mushrooms if you prefer. For example, you might use shiitake or a mix of cremini and shiitake. Remove the porcini mushrooms from the water and chop. After the 20 minutes are up, take the porcini mushrooms out of the water. Set the water aside for later use. Transfer the mushrooms to a cutting board, and chop coarsely. Place them in a small bowl and set aside. It’s best to remove the mushrooms from the water with a slotted spoon. That ensures that you won’t lose any of the mushroom liquid. Pour the chicken stock into a bowl and add some of the mushroom liquid. Add 2 cups (470 ml) of low-sodium chicken stock or broth to a medium-size bowl. Take ½ cup of the mushroom soaking liquid, mix it into the chicken stock, and set aside. When you’re measuring the mushroom soaking liquid, make sure not to include any of the sediment that may be at the bottom of the bowl. Sauteing the Mushrooms Melt the butter in a large skillet. Set a large skillet on the stove, and add 4 tablespoons (57 g) of unsalted butter. Turn the heat to medium, and allow the butter to melt until it becomes foamy. The butter will melt more quickly if you cut it into pieces before placing it in the skillet. Cook the shallots in the pan for several minutes. Once the butter has melted completely, add the finely chopped shallots to the skillet. Cook them over medium heat until they are softened, which should take approximately 3 minutes. To ensure that the shallots cook evenly, use a wooden spoon to stir them occasionally as you heat them. Add the cremini mushrooms and cook them until softened. After the shallots have softened, mix in the sliced cremini mushrooms. Allow them to cook over medium heat until they have softened as well. Typically, that takes about 5 minutes. Remember to stir mushrooms occasionally as well, so they don’t burn. Stir in the salt, pepper, and porcini mushrooms. After the cremini mushrooms have cooked, mix 2 teaspoons (11 g) of kosher salt, ¼ teaspoon (2.5 g) of freshly ground black pepper, and the coarsely chopped porcini mushrooms to the skillet. Stir the mixture well to ensure that it’s well blended. Making the Sauce Spread the flour over the mushroom mixture and cook for several minutes. Slowly sprinkle 5 tablespoons (40 g) of all-purpose flour over the mushroom mixture and stir so it’s well incorporated. Allow the mixture to cook on medium heat for about 3 minutes to get rid of the raw flour taste. Stir the mixture occasionally so it cooks to avoid scorching. Mix in the chicken stock mixture. After you’ve gotten rid of the floury taste, slowly add the chicken stock and mushroom soaking liquid mixture to the skillet. Use a whisk to blend the liquid in as you pour so it’s well blended. Whisk the mixture slowly and steadily to prevent any lumps from forming. Add the milk and cream and bring to a boil. Once the chicken stock mixture is incorporated, add 1 cup (240 ml) of whole milk and ½ cup (120 ml) of heavy cream to the skillet. Raise the heat to medium high, and bring the mixture to a boil. To keep the sauce smooth, whisk it occasionally as you’re bringing it to a boil. Lower the heat and simmer the sauce until it thickens. After the sauce has a reached a boil, lower the heat to low and allow it to simmer until it becomes thick and smooth. Typically, that takes about 10 to 15 minutes. You should whisk the sauce every so often while it’s cooking to keep it smooth and lump-free. Pulling the Dish Together Cut the chicken away from the bone and into bite-size pieces. While you’re waiting for the sauce to cook down, remove all of the chicken meat from the bone. Use a knife or tear the meat with your fingers to create bite-size pieces. When you’re cutting the chicken away from the bone, be sure to discard the skin, cartilage, and fat. Stir the chicken, peas, sherry, and chopped tarragon and parsley into the sauce. When the sauce has thickened fully, mix the chicken, 1 cup (150 g) of frozen peas that have been thawed,1 tablespoon (15 ml) dry sherry, and the chopped tarragon and parsley into the skillet. Stir the mixture well to ensure that all of the ingredients are well blended and coated with sauce. Cook the dish until warmed through and season with salt and pepper for serving. After all of the ingredients are combined, allow the dish to cook on low heat for approximately 5 minutes or until it’s completely warmed through.Taste it, and season with salt and pepper as necessary. Serve immediately. Chicken a la King is often served over warm biscuits, toast, or puff pastry shells. However, you can serve it with pasta or rice if you prefer.",
    "sentences": [
        " Cooking the Chicken Preheat the oven and arrange the rack properly.",
        "To ensure that the oven is hot enough to roast the chicken, it’s important to preheat the oven.",
        "Set the temperature to 400 degrees Fahrenheit (200 degrees Celsius), and allow it to fully heat.",
        "Make sure that the oven rack is in the center position too.",
        "Keep an eye on your oven so you know when it’s fully preheated.",
        "It will probably beep or flash an indicator light when it’s ready.",
        "Rub the chicken with oil and season with salt and pepper.",
        "Take 3 ½ pounds (1.6 kg) of bone-in chicken breasts and whole chicken legs, and coat both sides of the chicken pieces with approximately 2 tablespoons (30 ml) of olive oil.",
        "Apply a generous amount of salt and pepper to both sides for seasoning as well.",
        "If you don’t have any olive oil on hand, you can substitute vegetable or canola oil.",
        "The taste will be slightly different, but you shouldn’t notice any other differences.",
        "Place the chicken on a baking sheet and cook for 45 to 50 minutes.",
        "Once the chicken is coated with oil and seasoned, set the pieces on a baking sheet.",
        "Roast it in the oven for approximately 45 to 50 minutes or until its internal temperature reaches 160 degrees Fahrenheit (71 degrees Celsius).",
        "Have an instant-read thermometer on hand so you can quickly and easily determine the chicken’s internal temperature.",
        "Make sure to test each piece because they can cook differently depending on their size and thickness.",
        "Allow the chicken to cool on a cutting board.",
        "When the chicken has finished roasting, remove it from the pan.",
        "Transfer it to a cutting board, and let the pieces to cool enough for handling.",
        "That typically takes approximately 20 minutes.",
        "Preparing the Vegetables and Herbs Soak the porcini mushrooms in boiling water.",
        "Place 1 cup (28 g) dried of porcini mushrooms in a medium-size bowl, and pour 1 cup (235 ml) of boiling water over them.",
        "Allow the mushrooms to soak in the water for about 20 minutes.",
        "Make sure that all of the mushrooms are covered by the water so they all soften.",
        "Chop the Italian parsley and tarragon.",
        "While the mushrooms soak, use a sharp knife to finely chop 5 sprigs of fresh Italian parsley and 1 bunch of fresh tarragon.",
        "You’ll need 1 tablespoon (15 g) of each when you’re finished chopping.",
        "Place the chopped herbs in a small bowl and set aside.",
        "The best way to chop herbs is to gather them up in a tight ball.",
        "Hold the ball with your non-knife hand, curling your fingers underneath to keep them safe, and balance the knife against the knuckles on your non-knife hand.",
        "Move the knife in a rocking motion to chop.",
        "You’ll need to go over the herbs several time to get a fine chop.",
        "Slice the cremini mushrooms and chop the shallots.",
        "Take 8 ounces (224 g) of cremini mushrooms that have been cleaned and trimmed, and chop them into ¼-inch (6 mm) thick pieces.",
        "Place them in a medium size bowl and set aside.",
        "Next, finely chop 2 medium shallots, and place them in a small bowl to set aside.",
        "You can substitute your favorite type of mushrooms for the cremini or use a mix of mushrooms if you prefer.",
        "For example, you might use shiitake or a mix of cremini and shiitake.",
        "Remove the porcini mushrooms from the water and chop.",
        "After the 20 minutes are up, take the porcini mushrooms out of the water.",
        "Set the water aside for later use.",
        "Transfer the mushrooms to a cutting board, and chop coarsely.",
        "Place them in a small bowl and set aside.",
        "It’s best to remove the mushrooms from the water with a slotted spoon.",
        "That ensures that you won’t lose any of the mushroom liquid.",
        "Pour the chicken stock into a bowl and add some of the mushroom liquid.",
        "Add 2 cups (470 ml) of low-sodium chicken stock or broth to a medium-size bowl.",
        "Take ½ cup of the mushroom soaking liquid, mix it into the chicken stock, and set aside.",
        "When you’re measuring the mushroom soaking liquid, make sure not to include any of the sediment that may be at the bottom of the bowl.",
        "Sauteing the Mushrooms Melt the butter in a large skillet.",
        "Set a large skillet on the stove, and add 4 tablespoons (57 g) of unsalted butter.",
        "Turn the heat to medium, and allow the butter to melt until it becomes foamy.",
        "The butter will melt more quickly if you cut it into pieces before placing it in the skillet.",
        "Cook the shallots in the pan for several minutes.",
        "Once the butter has melted completely, add the finely chopped shallots to the skillet.",
        "Cook them over medium heat until they are softened, which should take approximately 3 minutes.",
        "To ensure that the shallots cook evenly, use a wooden spoon to stir them occasionally as you heat them.",
        "Add the cremini mushrooms and cook them until softened.",
        "After the shallots have softened, mix in the sliced cremini mushrooms.",
        "Allow them to cook over medium heat until they have softened as well.",
        "Typically, that takes about 5 minutes.",
        "Remember to stir mushrooms occasionally as well, so they don’t burn.",
        "Stir in the salt, pepper, and porcini mushrooms.",
        "After the cremini mushrooms have cooked, mix 2 teaspoons (11 g) of kosher salt, ¼ teaspoon (2.5 g) of freshly ground black pepper, and the coarsely chopped porcini mushrooms to the skillet.",
        "Stir the mixture well to ensure that it’s well blended.",
        "Making the Sauce Spread the flour over the mushroom mixture and cook for several minutes.",
        "Slowly sprinkle 5 tablespoons (40 g) of all-purpose flour over the mushroom mixture and stir so it’s well incorporated.",
        "Allow the mixture to cook on medium heat for about 3 minutes to get rid of the raw flour taste.",
        "Stir the mixture occasionally so it cooks to avoid scorching.",
        "Mix in the chicken stock mixture.",
        "After you’ve gotten rid of the floury taste, slowly add the chicken stock and mushroom soaking liquid mixture to the skillet.",
        "Use a whisk to blend the liquid in as you pour so it’s well blended.",
        "Whisk the mixture slowly and steadily to prevent any lumps from forming.",
        "Add the milk and cream and bring to a boil.",
        "Once the chicken stock mixture is incorporated, add 1 cup (240 ml) of whole milk and ½ cup (120 ml) of heavy cream to the skillet.",
        "Raise the heat to medium high, and bring the mixture to a boil.",
        "To keep the sauce smooth, whisk it occasionally as you’re bringing it to a boil.",
        "Lower the heat and simmer the sauce until it thickens.",
        "After the sauce has a reached a boil, lower the heat to low and allow it to simmer until it becomes thick and smooth.",
        "Typically, that takes about 10 to 15 minutes.",
        "You should whisk the sauce every so often while it’s cooking to keep it smooth and lump-free.",
        "Pulling the Dish Together Cut the chicken away from the bone and into bite-size pieces.",
        "While you’re waiting for the sauce to cook down, remove all of the chicken meat from the bone.",
        "Use a knife or tear the meat with your fingers to create bite-size pieces.",
        "When you’re cutting the chicken away from the bone, be sure to discard the skin, cartilage, and fat.",
        "Stir the chicken, peas, sherry, and chopped tarragon and parsley into the sauce.",
        "When the sauce has thickened fully, mix the chicken, 1 cup (150 g) of frozen peas that have been thawed,1 tablespoon (15 ml) dry sherry, and the chopped tarragon and parsley into the skillet.",
        "Stir the mixture well to ensure that all of the ingredients are well blended and coated with sauce.",
        "Cook the dish until warmed through and season with salt and pepper for serving.",
        "After all of the ingredients are combined, allow the dish to cook on low heat for approximately 5 minutes or until it’s completely warmed through.Taste it, and season with salt and pepper as necessary.",
        "Serve immediately.",
        "Chicken a la King is often served over warm biscuits, toast, or puff pastry shells.",
        "However, you can serve it with pasta or rice if you prefer."
    ]
}