{
    "title": "How to Remove Old 3M Invisible Paint Protection Film (Clear Bra) from a Car",
    "url": "https://www.wikihow.com/Remove-Old-3M-Invisible-Paint-Protection-Film-(Clear-Bra)-from-a-Car",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Maintenance and Repair"
    ],
    "steps": [
        {
            "headline": "Test an area of the film with the scraper.",
            "description": "Be sure not to use a metal scraper as it could scratch the paint finish. You may use some auto trim tools  that are made of poly/nylon and are safe for the paint surface. Gently stick the edge of the scraper underneath the edge of the film and push against the film to see how easily it will come off ."
        },
        {
            "headline": "If you only get little tiny pieces at a time, then the best way is using heat gun, heat up a small section of the film.",
            "description": "Do not get the heat gun too close to the car, 8–12 inches (20.3–30.5 cm) will work best. Hold the heat gun on the section for about a minute or two. If the film comes off fairly easily and in large strips a heat gun may not be necessary but would help."
        },
        {
            "headline": "Using the scraper again, gently push underneath the film of the heated area and the film should now come up in bigger strips.",
            "description": "It is Okay and normal for to not get everything off in each pass. As long as you get the top layer of the film off the rest will come off easily with Goo Gone adhesive remover."
        },
        {
            "headline": "Work in small sections at a time repeating the process of heating then scraping.",
            "description": "You will know when you need to heat again as the strips being removed will get smaller. This process will take some time so patience is a must!"
        },
        {
            "headline": "Have adhesive left behind.",
            "description": "Grab a small microfiber towel and spray some Goo Gone onto it. Gently rub over the area on the car where the adhesive is. Work in small sections and spray more Goo Gone on the towel as needed. Rub over the areas until the adhesive has been removed. The plastic scraper can also help on this step."
        },
        {
            "headline": "Optional step:  If you wish to be very certain you have removed all the adhesive, or get tired of trying to get every little piece, a clay bar kit is the answer.",
            "description": "Spray down a small area, 2x2, and then rub the clay bar over it. The clay bar will pull up the rest of the particles that are left and make a nice smooth finish."
        },
        {
            "headline": "When all the adhesive has been removed, wipe the entire area down with another dry microfiber towel.",
            "description": ""
        },
        {
            "headline": "Using your car wax of choice, wax the entire area of the car where the invisible shield was.",
            "description": "So that it doesn't stand out, you may wish to wax the entire hood  or just go for the whole car!"
        },
        {
            "headline": "Sit back and enjoy your work!",
            "description": ""
        }
    ],
    "tyn": [
        "Plastic scraper",
        "Heat gun/blow dryer",
        "Goo Gone",
        "Wax",
        "Clay bar kit",
        "Freshly washed car needing an old invisible shield removed"
    ],
    "text": " Test an area of the film with the scraper. Be sure not to use a metal scraper as it could scratch the paint finish. You may use some auto trim tools  that are made of poly/nylon and are safe for the paint surface. Gently stick the edge of the scraper underneath the edge of the film and push against the film to see how easily it will come off . If you only get little tiny pieces at a time, then the best way is using heat gun, heat up a small section of the film. Do not get the heat gun too close to the car, 8–12 inches (20.3–30.5 cm) will work best. Hold the heat gun on the section for about a minute or two. If the film comes off fairly easily and in large strips a heat gun may not be necessary but would help. Using the scraper again, gently push underneath the film of the heated area and the film should now come up in bigger strips. It is Okay and normal for to not get everything off in each pass. As long as you get the top layer of the film off the rest will come off easily with Goo Gone adhesive remover. Work in small sections at a time repeating the process of heating then scraping. You will know when you need to heat again as the strips being removed will get smaller. This process will take some time so patience is a must! Have adhesive left behind. Grab a small microfiber towel and spray some Goo Gone onto it. Gently rub over the area on the car where the adhesive is. Work in small sections and spray more Goo Gone on the towel as needed. Rub over the areas until the adhesive has been removed. The plastic scraper can also help on this step. Optional step:  If you wish to be very certain you have removed all the adhesive, or get tired of trying to get every little piece, a clay bar kit is the answer. Spray down a small area, 2x2, and then rub the clay bar over it. The clay bar will pull up the rest of the particles that are left and make a nice smooth finish. When all the adhesive has been removed, wipe the entire area down with another dry microfiber towel.  Using your car wax of choice, wax the entire area of the car where the invisible shield was. So that it doesn't stand out, you may wish to wax the entire hood  or just go for the whole car! Sit back and enjoy your work! ",
    "sentences": [
        " Test an area of the film with the scraper.",
        "Be sure not to use a metal scraper as it could scratch the paint finish.",
        "You may use some auto trim tools  that are made of poly/nylon and are safe for the paint surface.",
        "Gently stick the edge of the scraper underneath the edge of the film and push against the film to see how easily it will come off .",
        "If you only get little tiny pieces at a time, then the best way is using heat gun, heat up a small section of the film.",
        "Do not get the heat gun too close to the car, 8–12 inches (20.3–30.5 cm) will work best.",
        "Hold the heat gun on the section for about a minute or two.",
        "If the film comes off fairly easily and in large strips a heat gun may not be necessary but would help.",
        "Using the scraper again, gently push underneath the film of the heated area and the film should now come up in bigger strips.",
        "It is Okay and normal for to not get everything off in each pass.",
        "As long as you get the top layer of the film off the rest will come off easily with Goo Gone adhesive remover.",
        "Work in small sections at a time repeating the process of heating then scraping.",
        "You will know when you need to heat again as the strips being removed will get smaller.",
        "This process will take some time so patience is a must!",
        "Have adhesive left behind.",
        "Grab a small microfiber towel and spray some Goo Gone onto it.",
        "Gently rub over the area on the car where the adhesive is.",
        "Work in small sections and spray more Goo Gone on the towel as needed.",
        "Rub over the areas until the adhesive has been removed.",
        "The plastic scraper can also help on this step.",
        "Optional step:  If you wish to be very certain you have removed all the adhesive, or get tired of trying to get every little piece, a clay bar kit is the answer.",
        "Spray down a small area, 2x2, and then rub the clay bar over it.",
        "The clay bar will pull up the rest of the particles that are left and make a nice smooth finish.",
        "When all the adhesive has been removed, wipe the entire area down with another dry microfiber towel.",
        "Using your car wax of choice, wax the entire area of the car where the invisible shield was.",
        "So that it doesn't stand out, you may wish to wax the entire hood  or just go for the whole car!",
        "Sit back and enjoy your work!"
    ]
}