{
    "title": "How to Make Ends Meet",
    "url": "https://www.wikihow.com/Make-Ends-Meet",
    "category_hierarchy": [
        "Finance and Business",
        "Managing Your Money",
        "Budgeting",
        "Managing and Paying Bills"
    ],
    "parts": [
        {
            "name": "Budgeting",
            "steps": [
                {
                    "headline": "Create a budget.",
                    "description": "Use a spreadsheet and list the types of expenses you in the first column. Write the months of the year in the rows. Include a title row in the first row. Your expenses should include categories like housing, transportation, groceries, phone/internet, healthcare, interest payments, eating out, clothing and entertainment. Plan the budget out for at least the next 12 months."
                },
                {
                    "headline": "Add a separate row for income and input your after-tax income.",
                    "description": "If you are married, include the income and expenses for the whole family. You are getting some economies of scale when you buy groceries for several people."
                },
                {
                    "headline": "Don’t spend another dime without recording it in your budget.",
                    "description": "First, gather your receipts, your credit card bill and your bank statement. Then, record your expenses last month. Every time you find a receipt that doesn’t fit into your expenses categories, add a new category. You need to create an accurate view of what you are spending your money on. Download the Mint app for your smart phone, or use it on your computer, if you use your device regularly. It has a budgeting feature, which also records expenses and adds them to your monthly total, so you can see if you are staying on budget."
                },
                {
                    "headline": "Subtract your expenses from your income.",
                    "description": "If the number is negative, you are going into debt and need to strategize about how to make ends meet."
                },
                {
                    "headline": "Review your expenses closely.",
                    "description": "Look for monthly expenses, such as eating out, travel or clothing that you can cut to make ends meet."
                }
            ]
        },
        {
            "name": "Reducing Expenses",
            "steps": [
                {
                    "headline": "Look at your transportation costs.",
                    "description": "Crunch the numbers for a carpool or bus to work. Replace gas and repair costs with a monthly bus pass if it will reduce the total in this category."
                },
                {
                    "headline": "Buy in bulk.",
                    "description": "If your grocery bills are high, make sure you don’t shop at a local bodega. Clip your coupons and stock your fridge, because it’s cheaper to eat at home."
                },
                {
                    "headline": "Refinance or move into a smaller rental if your housing costs are too high.",
                    "description": "Experts recommend that housing costs never rise above 30 percent of your income. If you are under the national poverty level, try applying for low-income housing. Go to  http://familiesusa.org/product/federal-poverty-guidelines to find National poverty levels."
                },
                {
                    "headline": "Apply for health care programs with sliding scales.",
                    "description": "Many cities have means-tested programs that allow you to submit your taxes to show you need help paying for health care. If you don’t have insurance, apply for the health insurance marketplace before March 31st of the year to get a tax credit to reduce your healthcare costs."
                },
                {
                    "headline": "Ask your boss if you can telecommute several days a week.",
                    "description": "This can save on gas and your transportation costs."
                },
                {
                    "headline": "Shop for clothing at the thrift store.",
                    "description": "You can find good quality clothes that look brand new, if you are willing to search closely at your town’s thrift stores. Re-sell clothes you don’t need to consignment stores."
                },
                {
                    "headline": "Rent movies, music and books at the local library.",
                    "description": "Most libraries have extensive media programs that you can use in place of Netflix or cable until your income increases. Rent exercise DVDs and cancel your gym membership."
                },
                {
                    "headline": "Call your creditors and ask them to work with you.",
                    "description": "Arrange a repayment schedule instead of waiting for interest bills to increase. Medical institutions, utility companies and other organizations may be willing to stop racking up interest if you pay a small amount each month. Living in a debt vacuum can make it impossible for you to get in the black, so don’t delay in asking for help if your interest payments or bank fees are a large part of your expenses."
                },
                {
                    "headline": "Apply for food stamps.",
                    "description": "This is another means-tested program that can save dozens or hundreds of dollars on grocery bills."
                }
            ]
        },
        {
            "name": "Increasing Income",
            "steps": [
                {
                    "headline": "Register for unemployment or cash in on unemployment insurance if you’ve just been laid off.",
                    "description": "If you don’t have state unemployment, apply for a free retraining program at the local Job Services office."
                },
                {
                    "headline": "Apply to work overtime.",
                    "description": "Your company may need someone to stay late or come in on the weekends. Be their go-to person."
                },
                {
                    "headline": "Turn your talents into money.",
                    "description": "Post an ad on Craigslist or Fiver.com saying your services are available to repair computers, move large items, cater, paint, rake leaves, dog walk or anything else. You may be surprised about how many people are looking for an extra hand."
                },
                {
                    "headline": "Join a dog sitting, baby-sitting or house-sitting site.",
                    "description": "These sites are notoriously strict about who they let in; however, once you get on their list, you may have a consistent weekend income."
                },
                {
                    "headline": "Sell your possessions on Craigslist or eBay.",
                    "description": "Go through your house with a fine-toothed comb. Plan to sell everything that isn’t essential to cover your expenses."
                },
                {
                    "headline": "Ask for a helping hand from friends.",
                    "description": "Don’t ask them to give you money, unless absolutely necessary. However, they might need a hand doing something or know of a part-time position that’s available."
                },
                {
                    "headline": "Look for work online.",
                    "description": "Transcription, marketing, survey taking, website editing and other jobs are available online with low overhead costs. Check that the job is legitimate before giving financial information."
                }
            ]
        }
    ],
    "tyn": [
        "Library card",
        "Food stamps"
    ],
    "text": " Budgeting Create a budget. Use a spreadsheet and list the types of expenses you in the first column. Write the months of the year in the rows. Include a title row in the first row. Your expenses should include categories like housing, transportation, groceries, phone/internet, healthcare, interest payments, eating out, clothing and entertainment. Plan the budget out for at least the next 12 months. Add a separate row for income and input your after-tax income. If you are married, include the income and expenses for the whole family. You are getting some economies of scale when you buy groceries for several people. Don’t spend another dime without recording it in your budget. First, gather your receipts, your credit card bill and your bank statement. Then, record your expenses last month. Every time you find a receipt that doesn’t fit into your expenses categories, add a new category. You need to create an accurate view of what you are spending your money on. Download the Mint app for your smart phone, or use it on your computer, if you use your device regularly. It has a budgeting feature, which also records expenses and adds them to your monthly total, so you can see if you are staying on budget. Subtract your expenses from your income. If the number is negative, you are going into debt and need to strategize about how to make ends meet. Review your expenses closely. Look for monthly expenses, such as eating out, travel or clothing that you can cut to make ends meet. Reducing Expenses Look at your transportation costs. Crunch the numbers for a carpool or bus to work. Replace gas and repair costs with a monthly bus pass if it will reduce the total in this category. Buy in bulk. If your grocery bills are high, make sure you don’t shop at a local bodega. Clip your coupons and stock your fridge, because it’s cheaper to eat at home. Refinance or move into a smaller rental if your housing costs are too high. Experts recommend that housing costs never rise above 30 percent of your income. If you are under the national poverty level, try applying for low-income housing. Go to  http://familiesusa.org/product/federal-poverty-guidelines to find National poverty levels. Apply for health care programs with sliding scales. Many cities have means-tested programs that allow you to submit your taxes to show you need help paying for health care. If you don’t have insurance, apply for the health insurance marketplace before March 31st of the year to get a tax credit to reduce your healthcare costs. Ask your boss if you can telecommute several days a week. This can save on gas and your transportation costs. Shop for clothing at the thrift store. You can find good quality clothes that look brand new, if you are willing to search closely at your town’s thrift stores. Re-sell clothes you don’t need to consignment stores. Rent movies, music and books at the local library. Most libraries have extensive media programs that you can use in place of Netflix or cable until your income increases. Rent exercise DVDs and cancel your gym membership. Call your creditors and ask them to work with you. Arrange a repayment schedule instead of waiting for interest bills to increase. Medical institutions, utility companies and other organizations may be willing to stop racking up interest if you pay a small amount each month. Living in a debt vacuum can make it impossible for you to get in the black, so don’t delay in asking for help if your interest payments or bank fees are a large part of your expenses. Apply for food stamps. This is another means-tested program that can save dozens or hundreds of dollars on grocery bills. Increasing Income Register for unemployment or cash in on unemployment insurance if you’ve just been laid off. If you don’t have state unemployment, apply for a free retraining program at the local Job Services office. Apply to work overtime. Your company may need someone to stay late or come in on the weekends. Be their go-to person. Turn your talents into money. Post an ad on Craigslist or Fiver.com saying your services are available to repair computers, move large items, cater, paint, rake leaves, dog walk or anything else. You may be surprised about how many people are looking for an extra hand. Join a dog sitting, baby-sitting or house-sitting site. These sites are notoriously strict about who they let in; however, once you get on their list, you may have a consistent weekend income. Sell your possessions on Craigslist or eBay. Go through your house with a fine-toothed comb. Plan to sell everything that isn’t essential to cover your expenses. Ask for a helping hand from friends. Don’t ask them to give you money, unless absolutely necessary. However, they might need a hand doing something or know of a part-time position that’s available. Look for work online. Transcription, marketing, survey taking, website editing and other jobs are available online with low overhead costs. Check that the job is legitimate before giving financial information.",
    "sentences": [
        " Budgeting Create a budget.",
        "Use a spreadsheet and list the types of expenses you in the first column.",
        "Write the months of the year in the rows.",
        "Include a title row in the first row.",
        "Your expenses should include categories like housing, transportation, groceries, phone/internet, healthcare, interest payments, eating out, clothing and entertainment.",
        "Plan the budget out for at least the next 12 months.",
        "Add a separate row for income and input your after-tax income.",
        "If you are married, include the income and expenses for the whole family.",
        "You are getting some economies of scale when you buy groceries for several people.",
        "Don’t spend another dime without recording it in your budget.",
        "First, gather your receipts, your credit card bill and your bank statement.",
        "Then, record your expenses last month.",
        "Every time you find a receipt that doesn’t fit into your expenses categories, add a new category.",
        "You need to create an accurate view of what you are spending your money on.",
        "Download the Mint app for your smart phone, or use it on your computer, if you use your device regularly.",
        "It has a budgeting feature, which also records expenses and adds them to your monthly total, so you can see if you are staying on budget.",
        "Subtract your expenses from your income.",
        "If the number is negative, you are going into debt and need to strategize about how to make ends meet.",
        "Review your expenses closely.",
        "Look for monthly expenses, such as eating out, travel or clothing that you can cut to make ends meet.",
        "Reducing Expenses Look at your transportation costs.",
        "Crunch the numbers for a carpool or bus to work.",
        "Replace gas and repair costs with a monthly bus pass if it will reduce the total in this category.",
        "Buy in bulk.",
        "If your grocery bills are high, make sure you don’t shop at a local bodega.",
        "Clip your coupons and stock your fridge, because it’s cheaper to eat at home.",
        "Refinance or move into a smaller rental if your housing costs are too high.",
        "Experts recommend that housing costs never rise above 30 percent of your income.",
        "If you are under the national poverty level, try applying for low-income housing.",
        "Go to  http://familiesusa.org/product/federal-poverty-guidelines to find National poverty levels.",
        "Apply for health care programs with sliding scales.",
        "Many cities have means-tested programs that allow you to submit your taxes to show you need help paying for health care.",
        "If you don’t have insurance, apply for the health insurance marketplace before March 31st of the year to get a tax credit to reduce your healthcare costs.",
        "Ask your boss if you can telecommute several days a week.",
        "This can save on gas and your transportation costs.",
        "Shop for clothing at the thrift store.",
        "You can find good quality clothes that look brand new, if you are willing to search closely at your town’s thrift stores.",
        "Re-sell clothes you don’t need to consignment stores.",
        "Rent movies, music and books at the local library.",
        "Most libraries have extensive media programs that you can use in place of Netflix or cable until your income increases.",
        "Rent exercise DVDs and cancel your gym membership.",
        "Call your creditors and ask them to work with you.",
        "Arrange a repayment schedule instead of waiting for interest bills to increase.",
        "Medical institutions, utility companies and other organizations may be willing to stop racking up interest if you pay a small amount each month.",
        "Living in a debt vacuum can make it impossible for you to get in the black, so don’t delay in asking for help if your interest payments or bank fees are a large part of your expenses.",
        "Apply for food stamps.",
        "This is another means-tested program that can save dozens or hundreds of dollars on grocery bills.",
        "Increasing Income Register for unemployment or cash in on unemployment insurance if you’ve just been laid off.",
        "If you don’t have state unemployment, apply for a free retraining program at the local Job Services office.",
        "Apply to work overtime.",
        "Your company may need someone to stay late or come in on the weekends.",
        "Be their go-to person.",
        "Turn your talents into money.",
        "Post an ad on Craigslist or Fiver.com saying your services are available to repair computers, move large items, cater, paint, rake leaves, dog walk or anything else.",
        "You may be surprised about how many people are looking for an extra hand.",
        "Join a dog sitting, baby-sitting or house-sitting site.",
        "These sites are notoriously strict about who they let in; however, once you get on their list, you may have a consistent weekend income.",
        "Sell your possessions on Craigslist or eBay.",
        "Go through your house with a fine-toothed comb.",
        "Plan to sell everything that isn’t essential to cover your expenses.",
        "Ask for a helping hand from friends.",
        "Don’t ask them to give you money, unless absolutely necessary.",
        "However, they might need a hand doing something or know of a part-time position that’s available.",
        "Look for work online.",
        "Transcription, marketing, survey taking, website editing and other jobs are available online with low overhead costs.",
        "Check that the job is legitimate before giving financial information."
    ]
}