{
    "title": "How to Make Laffy Taffy",
    "url": "https://www.wikihow.com/Make-Laffy-Taffy",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Chocolate and Candy"
    ],
    "parts": [
        {
            "name": "Cooking the Taffy",
            "steps": [
                {
                    "headline": "Butter two large baking sheets.",
                    "description": "Set them aside."
                },
                {
                    "headline": "Choose a fruit drink mix in your favorite flavor.",
                    "description": "The type of Kool-Aid you use will create the flavor of Laffy Taffy. For example, grape drink mix makes grape taffy. If you prefer to customize your flavor, opt to use a flavor extract, such as “watermelon” or “banana” instead of a packet of powdered drink mix."
                },
                {
                    "headline": "Place a large metal saucepan on your burner.",
                    "description": "Pour in the granulated sugar and cornstarch."
                },
                {
                    "headline": "Add the syrup, water, butter, and salt.",
                    "description": "Stir the mixture with a wooden spoon. Turn the burner to medium heat."
                },
                {
                    "headline": "Bring the mixture to a boil over medium heat.",
                    "description": "Attach the candy thermometer to the side of the pan. Cook your taffy while stirring until it reaches 250 degrees Fahrenheit (121 Celsius)."
                },
                {
                    "headline": "Remove the pan from the heat when it reaches 250 degrees.",
                    "description": "Stir in the extract or the drink mix packet. For a creamy taste, add 1/2 tsp. vanilla extract along with the flavoring."
                }
            ]
        },
        {
            "name": "Stretching the Taffy",
            "steps": [
                {
                    "headline": "Pour the hot taffy mixture into the baking trays.",
                    "description": "It should create a thin layer. Allow the mixture to sit for 15 minutes until it is cool enough to handle."
                },
                {
                    "headline": "Cut wax paper into squares for storing the taffy.",
                    "description": "The squares should be three inches (7.5cm) by three inches (7.5cm)."
                },
                {
                    "headline": "Ask a friend to help you stretch the taffy.",
                    "description": "Wash your hands. Then, butter them thoroughly. If possible, get two more people to stretch the other baking sheet filled with taffy at the same time."
                },
                {
                    "headline": "Grab the taffy on one baking sheet.",
                    "description": "Have your friend pull it away from you. Then, pull it back."
                },
                {
                    "headline": "Repeat the action of stretching the taffy until it becomes firmer and lighter in color.",
                    "description": "It will take about 15 minutes to stretch the taffy adequately."
                }
            ]
        },
        {
            "name": "Wrapping Laffy Taffy",
            "steps": [
                {
                    "headline": "Cut small pieces away from the stretched taffy with clean kitchen scissors.",
                    "description": ""
                },
                {
                    "headline": "Roll them between your buttered hands.",
                    "description": ""
                },
                {
                    "headline": "Place the rolled taffy in the center of a wax paper square.",
                    "description": "Fold the bottom down and the top up. Twist the sides of the paper."
                },
                {
                    "headline": "Store your wrapped taffy in an airtight container.",
                    "description": "Place it in a cool place to keep it from sweating."
                }
            ]
        }
    ],
    "tyn": [
        "Oven",
        "Saucepan",
        "Baking sheets",
        "Candy thermometer",
        "Wooden spoon",
        "Wax paper",
        "Scissor"
    ],
    "text": " Cooking the Taffy Butter two large baking sheets. Set them aside. Choose a fruit drink mix in your favorite flavor. The type of Kool-Aid you use will create the flavor of Laffy Taffy. For example, grape drink mix makes grape taffy. If you prefer to customize your flavor, opt to use a flavor extract, such as “watermelon” or “banana” instead of a packet of powdered drink mix. Place a large metal saucepan on your burner. Pour in the granulated sugar and cornstarch. Add the syrup, water, butter, and salt. Stir the mixture with a wooden spoon. Turn the burner to medium heat. Bring the mixture to a boil over medium heat. Attach the candy thermometer to the side of the pan. Cook your taffy while stirring until it reaches 250 degrees Fahrenheit (121 Celsius). Remove the pan from the heat when it reaches 250 degrees. Stir in the extract or the drink mix packet. For a creamy taste, add 1/2 tsp. vanilla extract along with the flavoring. Stretching the Taffy Pour the hot taffy mixture into the baking trays. It should create a thin layer. Allow the mixture to sit for 15 minutes until it is cool enough to handle. Cut wax paper into squares for storing the taffy. The squares should be three inches (7.5cm) by three inches (7.5cm). Ask a friend to help you stretch the taffy. Wash your hands. Then, butter them thoroughly. If possible, get two more people to stretch the other baking sheet filled with taffy at the same time. Grab the taffy on one baking sheet. Have your friend pull it away from you. Then, pull it back. Repeat the action of stretching the taffy until it becomes firmer and lighter in color. It will take about 15 minutes to stretch the taffy adequately. Wrapping Laffy Taffy Cut small pieces away from the stretched taffy with clean kitchen scissors.  Roll them between your buttered hands.  Place the rolled taffy in the center of a wax paper square. Fold the bottom down and the top up. Twist the sides of the paper. Store your wrapped taffy in an airtight container. Place it in a cool place to keep it from sweating.",
    "sentences": [
        " Cooking the Taffy Butter two large baking sheets.",
        "Set them aside.",
        "Choose a fruit drink mix in your favorite flavor.",
        "The type of Kool-Aid you use will create the flavor of Laffy Taffy.",
        "For example, grape drink mix makes grape taffy.",
        "If you prefer to customize your flavor, opt to use a flavor extract, such as “watermelon” or “banana” instead of a packet of powdered drink mix.",
        "Place a large metal saucepan on your burner.",
        "Pour in the granulated sugar and cornstarch.",
        "Add the syrup, water, butter, and salt.",
        "Stir the mixture with a wooden spoon.",
        "Turn the burner to medium heat.",
        "Bring the mixture to a boil over medium heat.",
        "Attach the candy thermometer to the side of the pan.",
        "Cook your taffy while stirring until it reaches 250 degrees Fahrenheit (121 Celsius).",
        "Remove the pan from the heat when it reaches 250 degrees.",
        "Stir in the extract or the drink mix packet.",
        "For a creamy taste, add 1/2 tsp.",
        "vanilla extract along with the flavoring.",
        "Stretching the Taffy Pour the hot taffy mixture into the baking trays.",
        "It should create a thin layer.",
        "Allow the mixture to sit for 15 minutes until it is cool enough to handle.",
        "Cut wax paper into squares for storing the taffy.",
        "The squares should be three inches (7.5cm) by three inches (7.5cm).",
        "Ask a friend to help you stretch the taffy.",
        "Wash your hands.",
        "Then, butter them thoroughly.",
        "If possible, get two more people to stretch the other baking sheet filled with taffy at the same time.",
        "Grab the taffy on one baking sheet.",
        "Have your friend pull it away from you.",
        "Then, pull it back.",
        "Repeat the action of stretching the taffy until it becomes firmer and lighter in color.",
        "It will take about 15 minutes to stretch the taffy adequately.",
        "Wrapping Laffy Taffy Cut small pieces away from the stretched taffy with clean kitchen scissors.",
        "Roll them between your buttered hands.",
        "Place the rolled taffy in the center of a wax paper square.",
        "Fold the bottom down and the top up.",
        "Twist the sides of the paper.",
        "Store your wrapped taffy in an airtight container.",
        "Place it in a cool place to keep it from sweating."
    ]
}