{
    "title": "How to Hide Cables",
    "url": "https://www.wikihow.com/Hide-Cables",
    "category_hierarchy": [
        "Computers and Electronics",
        "Computers"
    ],
    "methods": [
        {
            "name": "Hiding Device Cables",
            "steps": [
                {
                    "headline": "Purchase or make a charging station.",
                    "description": "They are usually boxes made to fit your room's décor. The box hides the cables beneath a false bottom, so that you can plug your devices into the top each night. Try box stores, Amazon or décor stores for attractive charging stations."
                },
                {
                    "headline": "Hide the cables behind your desk or media center with a piece of foam pipe.",
                    "description": "Cut the piece of foam pipe to the width of your desk. Cut slits into the insulation with a box cutter and run five to 10 cables through the center of the foam into the slit. Look for foam pipe insulation at most hardware and home improvement stores. If possible, purchase a color that matches your desk or media center. Place your computer or television in front of the pipe insulation."
                },
                {
                    "headline": "Buy cord reels for cords that you move around the home.",
                    "description": "Your cords can behave like a tape measure or a fishing pole with a 25-foot (7.6m) retractable reel. Purchase plastic or metal reels online or at home improvement stores."
                },
                {
                    "headline": "Look for cord management straps.",
                    "description": "Room and Board has a variety of cord concealing strips that can be applied across the back of a piece of furniture."
                },
                {
                    "headline": "Tack or tape the cord to the wall.",
                    "description": "Then, paint the cable to match the room color."
                }
            ]
        },
        {
            "name": "Hiding Wall Cables",
            "steps": [
                {
                    "headline": "Mount your devices on pegboard.",
                    "description": "People who require a lot of surge protectors, modems, hard drives and other computer devices can string them to a piece of pegboard cut to the size of your desk. Place the pegboard inside a closet or mount it behind your desk. Use plastic zip ties to keep all the devices secure. Zip ties come in white, grey, black or other colors that match flooring and walls. Make sure the pegboard gets plenty of air, so that your electronics don't overheat."
                },
                {
                    "headline": "Strap your cords together.",
                    "description": "Any cords that run the same length from the outlet to the device can be strapped into one solid cord with zip ties. This will allow you to pick up the cord bundle and clean behind it."
                },
                {
                    "headline": "Install wire molds between the outlet and the device.",
                    "description": "Home improvement stores sell corner, wall and floor molds that install over the cords and onto the wall. Paint the mold to match your wall color, so that it looks like part of the wall's molding."
                },
                {
                    "headline": "Run the cables along the floor with an overflow cord protector.",
                    "description": "Purchase a rubber or plastic protector that matches your flooring. Then, insert the cables into the bottom and stretch it along the wall or between rooms. The protector is designed to reduce tripping hazards. They are available in many colors and lengths."
                },
                {
                    "headline": "Make your own fabric cord covers to go over looped carpet.",
                    "description": "Measure the space that you need to cover between the outlet and the appliance. Cut a piece of durable material in a matching color to the exact length and a six-inch (15.2cm) width. Hem several lengths together for very long cord covers. Place double-sided tape on the edges of the fabric at the ends. Fold them over, and then stitch a seam with one-inch (2.5cm) stitches through the tape. Sew Velcro hook across the entire length of the cord protector on both sides. Make sure you sew on the topside of your protector. Attach double-sided tape to the back of the fabric. It should be applied along the entire length on both sides. Fold the Velcro inward, so that it is on the bottom side of the fabric. Sew a hem through the fabric about one inch (2.5cm) from the edge. Wrap the cover over the cords and press it down onto the looped carpet, where it will adhere until you want to remove it."
                },
                {
                    "headline": "Cover a floor with an area rug to disguise cords and reduce tripping hazards.",
                    "description": "Make sure it extends from the outlet to a piece of furniture against a wall, so that you can hide the cord completely."
                },
                {
                    "headline": "Consult with a contractor about cutting holes in the dry wall.",
                    "description": "In some places, you can cut a hole near the outlet and a hole near the device and loop your cables through the back of the wall. Don't knock holes into the wall until you are sure the structure isn't load-bearing or until you have the appropriate tools."
                }
            ]
        },
        {
            "name": "Storing Cables",
            "steps": [
                {
                    "headline": "Store your cables inside a paper towel tube.",
                    "description": "Loop them into a one to two foot length (30.5 to 70cm) . Pinch the center and thread them through the length of the cardboard tube. Stack your extra cables and extension cords in a drawer. Label the paper towel rolls to distinguish between cords."
                },
                {
                    "headline": "Wrap your earbuds around a piece of cereal box paper.",
                    "description": "Cut a three-inch (7.6cm) long and one and a half inch (3.8cm) wide rectangle from cardboard packaging. Cut slits into the ends and wrap your earbuds into the slits. Slide it into your pocket or a purse until you are ready to use them."
                }
            ]
        }
    ],
    "tyn": [
        "Charging station",
        "Cord management strips",
        "Box cutter",
        "Foam pipe insulation",
        "Paper towel tube",
        "Pegboard",
        "Zip ties",
        "Wall/desk mounting hardware",
        "Screwdriver",
        "Cord reel",
        "Fabric",
        "Sewing machine",
        "Double-sided tape",
        "Velcro hook",
        "Cereal box",
        "Scissors",
        "Wall paint",
        "Tacks",
        "Tape"
    ],
    "text": " Hiding Device Cables Purchase or make a charging station. They are usually boxes made to fit your room's décor. The box hides the cables beneath a false bottom, so that you can plug your devices into the top each night. Try box stores, Amazon or décor stores for attractive charging stations. Hide the cables behind your desk or media center with a piece of foam pipe. Cut the piece of foam pipe to the width of your desk. Cut slits into the insulation with a box cutter and run five to 10 cables through the center of the foam into the slit. Look for foam pipe insulation at most hardware and home improvement stores. If possible, purchase a color that matches your desk or media center. Place your computer or television in front of the pipe insulation. Buy cord reels for cords that you move around the home. Your cords can behave like a tape measure or a fishing pole with a 25-foot (7.6m) retractable reel. Purchase plastic or metal reels online or at home improvement stores. Look for cord management straps. Room and Board has a variety of cord concealing strips that can be applied across the back of a piece of furniture. Tack or tape the cord to the wall. Then, paint the cable to match the room color. Hiding Wall Cables Mount your devices on pegboard. People who require a lot of surge protectors, modems, hard drives and other computer devices can string them to a piece of pegboard cut to the size of your desk. Place the pegboard inside a closet or mount it behind your desk. Use plastic zip ties to keep all the devices secure. Zip ties come in white, grey, black or other colors that match flooring and walls. Make sure the pegboard gets plenty of air, so that your electronics don't overheat. Strap your cords together. Any cords that run the same length from the outlet to the device can be strapped into one solid cord with zip ties. This will allow you to pick up the cord bundle and clean behind it. Install wire molds between the outlet and the device. Home improvement stores sell corner, wall and floor molds that install over the cords and onto the wall. Paint the mold to match your wall color, so that it looks like part of the wall's molding. Run the cables along the floor with an overflow cord protector. Purchase a rubber or plastic protector that matches your flooring. Then, insert the cables into the bottom and stretch it along the wall or between rooms. The protector is designed to reduce tripping hazards. They are available in many colors and lengths. Make your own fabric cord covers to go over looped carpet. Measure the space that you need to cover between the outlet and the appliance. Cut a piece of durable material in a matching color to the exact length and a six-inch (15.2cm) width. Hem several lengths together for very long cord covers. Place double-sided tape on the edges of the fabric at the ends. Fold them over, and then stitch a seam with one-inch (2.5cm) stitches through the tape. Sew Velcro hook across the entire length of the cord protector on both sides. Make sure you sew on the topside of your protector. Attach double-sided tape to the back of the fabric. It should be applied along the entire length on both sides. Fold the Velcro inward, so that it is on the bottom side of the fabric. Sew a hem through the fabric about one inch (2.5cm) from the edge. Wrap the cover over the cords and press it down onto the looped carpet, where it will adhere until you want to remove it. Cover a floor with an area rug to disguise cords and reduce tripping hazards. Make sure it extends from the outlet to a piece of furniture against a wall, so that you can hide the cord completely. Consult with a contractor about cutting holes in the dry wall. In some places, you can cut a hole near the outlet and a hole near the device and loop your cables through the back of the wall. Don't knock holes into the wall until you are sure the structure isn't load-bearing or until you have the appropriate tools. Storing Cables Store your cables inside a paper towel tube. Loop them into a one to two foot length (30.5 to 70cm) . Pinch the center and thread them through the length of the cardboard tube. Stack your extra cables and extension cords in a drawer. Label the paper towel rolls to distinguish between cords. Wrap your earbuds around a piece of cereal box paper. Cut a three-inch (7.6cm) long and one and a half inch (3.8cm) wide rectangle from cardboard packaging. Cut slits into the ends and wrap your earbuds into the slits. Slide it into your pocket or a purse until you are ready to use them.",
    "sentences": [
        " Hiding Device Cables Purchase or make a charging station.",
        "They are usually boxes made to fit your room's décor.",
        "The box hides the cables beneath a false bottom, so that you can plug your devices into the top each night.",
        "Try box stores, Amazon or décor stores for attractive charging stations.",
        "Hide the cables behind your desk or media center with a piece of foam pipe.",
        "Cut the piece of foam pipe to the width of your desk.",
        "Cut slits into the insulation with a box cutter and run five to 10 cables through the center of the foam into the slit.",
        "Look for foam pipe insulation at most hardware and home improvement stores.",
        "If possible, purchase a color that matches your desk or media center.",
        "Place your computer or television in front of the pipe insulation.",
        "Buy cord reels for cords that you move around the home.",
        "Your cords can behave like a tape measure or a fishing pole with a 25-foot (7.6m) retractable reel.",
        "Purchase plastic or metal reels online or at home improvement stores.",
        "Look for cord management straps.",
        "Room and Board has a variety of cord concealing strips that can be applied across the back of a piece of furniture.",
        "Tack or tape the cord to the wall.",
        "Then, paint the cable to match the room color.",
        "Hiding Wall Cables Mount your devices on pegboard.",
        "People who require a lot of surge protectors, modems, hard drives and other computer devices can string them to a piece of pegboard cut to the size of your desk.",
        "Place the pegboard inside a closet or mount it behind your desk.",
        "Use plastic zip ties to keep all the devices secure.",
        "Zip ties come in white, grey, black or other colors that match flooring and walls.",
        "Make sure the pegboard gets plenty of air, so that your electronics don't overheat.",
        "Strap your cords together.",
        "Any cords that run the same length from the outlet to the device can be strapped into one solid cord with zip ties.",
        "This will allow you to pick up the cord bundle and clean behind it.",
        "Install wire molds between the outlet and the device.",
        "Home improvement stores sell corner, wall and floor molds that install over the cords and onto the wall.",
        "Paint the mold to match your wall color, so that it looks like part of the wall's molding.",
        "Run the cables along the floor with an overflow cord protector.",
        "Purchase a rubber or plastic protector that matches your flooring.",
        "Then, insert the cables into the bottom and stretch it along the wall or between rooms.",
        "The protector is designed to reduce tripping hazards.",
        "They are available in many colors and lengths.",
        "Make your own fabric cord covers to go over looped carpet.",
        "Measure the space that you need to cover between the outlet and the appliance.",
        "Cut a piece of durable material in a matching color to the exact length and a six-inch (15.2cm) width.",
        "Hem several lengths together for very long cord covers.",
        "Place double-sided tape on the edges of the fabric at the ends.",
        "Fold them over, and then stitch a seam with one-inch (2.5cm) stitches through the tape.",
        "Sew Velcro hook across the entire length of the cord protector on both sides.",
        "Make sure you sew on the topside of your protector.",
        "Attach double-sided tape to the back of the fabric.",
        "It should be applied along the entire length on both sides.",
        "Fold the Velcro inward, so that it is on the bottom side of the fabric.",
        "Sew a hem through the fabric about one inch (2.5cm) from the edge.",
        "Wrap the cover over the cords and press it down onto the looped carpet, where it will adhere until you want to remove it.",
        "Cover a floor with an area rug to disguise cords and reduce tripping hazards.",
        "Make sure it extends from the outlet to a piece of furniture against a wall, so that you can hide the cord completely.",
        "Consult with a contractor about cutting holes in the dry wall.",
        "In some places, you can cut a hole near the outlet and a hole near the device and loop your cables through the back of the wall.",
        "Don't knock holes into the wall until you are sure the structure isn't load-bearing or until you have the appropriate tools.",
        "Storing Cables Store your cables inside a paper towel tube.",
        "Loop them into a one to two foot length (30.5 to 70cm) .",
        "Pinch the center and thread them through the length of the cardboard tube.",
        "Stack your extra cables and extension cords in a drawer.",
        "Label the paper towel rolls to distinguish between cords.",
        "Wrap your earbuds around a piece of cereal box paper.",
        "Cut a three-inch (7.6cm) long and one and a half inch (3.8cm) wide rectangle from cardboard packaging.",
        "Cut slits into the ends and wrap your earbuds into the slits.",
        "Slide it into your pocket or a purse until you are ready to use them."
    ]
}