{
    "title": "How to Make a Quote Book",
    "url": "https://www.wikihow.com/Make-a-Quote-Book",
    "category_hierarchy": [
        "Arts and Entertainment"
    ],
    "steps": [
        {
            "headline": "Find a blank book to record your quotes in.",
            "description": "You can buy a nice journal from a store (lined pages are nice) or glitz up a composition book. Whatever works for you."
        },
        {
            "headline": "Find some quotes.",
            "description": "It's probably not the best idea to search for quotes on the internet and write down everyone you see. Not all will be the best quality, so be selective. You can discover quotes by watching movies, reading books, going through a friend's quote book, or using a daily quote feature online. You'll find that a lot of your favorites come to you unexpectedly though."
        },
        {
            "headline": "Decide how you want to write out quotes.",
            "description": "Do you want to include quotation marks? Do you want the quoted person on the line of quote or below? Decide on these things before hand to avoid discrepancies later."
        },
        {
            "headline": "Decorate it!",
            "description": "Write out the quotes with different colors, add some pictures, drawings, magazine clippings, whatever! Just make it your own."
        }
    ],
    "tyn": [
        "Empty journal or book",
        "Writing utensil"
    ],
    "text": " Find a blank book to record your quotes in. You can buy a nice journal from a store (lined pages are nice) or glitz up a composition book. Whatever works for you. Find some quotes. It's probably not the best idea to search for quotes on the internet and write down everyone you see. Not all will be the best quality, so be selective. You can discover quotes by watching movies, reading books, going through a friend's quote book, or using a daily quote feature online. You'll find that a lot of your favorites come to you unexpectedly though. Decide how you want to write out quotes. Do you want to include quotation marks? Do you want the quoted person on the line of quote or below? Decide on these things before hand to avoid discrepancies later. Decorate it! Write out the quotes with different colors, add some pictures, drawings, magazine clippings, whatever! Just make it your own.",
    "sentences": [
        " Find a blank book to record your quotes in.",
        "You can buy a nice journal from a store (lined pages are nice) or glitz up a composition book.",
        "Whatever works for you.",
        "Find some quotes.",
        "It's probably not the best idea to search for quotes on the internet and write down everyone you see.",
        "Not all will be the best quality, so be selective.",
        "You can discover quotes by watching movies, reading books, going through a friend's quote book, or using a daily quote feature online.",
        "You'll find that a lot of your favorites come to you unexpectedly though.",
        "Decide how you want to write out quotes.",
        "Do you want to include quotation marks?",
        "Do you want the quoted person on the line of quote or below?",
        "Decide on these things before hand to avoid discrepancies later.",
        "Decorate it!",
        "Write out the quotes with different colors, add some pictures, drawings, magazine clippings, whatever!",
        "Just make it your own."
    ]
}