{
    "title": "How to Dye White Roses with Food Coloring",
    "url": "https://www.wikihow.com/Dye-White-Roses-with-Food-Coloring",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening"
    ],
    "steps": [
        {
            "headline": "Gather the white roses, food coloring, and container.",
            "description": "Fresher roses work best, and they do not even have to be fully opened. Just don't get super tight buds that feel compact and solid when you gently squeeze them. If you choose closed buds, try to pick ones that you judge will open soon."
        },
        {
            "headline": "Measure approximately 30-60 mL (1-2 fl.oz.)",
            "description": "of water - enough to fill your container at least 10 cm (3\") deep."
        },
        {
            "headline": "Add 2-4 mL (⅓ to ⅔ tsp) of food coloring and let it disperse throughout the water until the color is nearly uniform.",
            "description": "You can use this opportunity to talk with your children about thermal motion and thermal transport mechanisms in fluids and gases. Let them guess what is going on and encourage them to think deeper. Hint: a driving force in the universe is entropy - the tendency to disorder, everything to be dispersed and anti-crystalline."
        },
        {
            "headline": "Remove all leaves from the roses.",
            "description": ""
        },
        {
            "headline": "Cut the rose stem(s) diagonally to expose as much fresh surface as possible.",
            "description": "Cut enough off to end up with about 12 in. of stem left. Ask the kids why you chose to cut the stem that way instead of straight across. Clue them in that florists and flower arrangers use this same cutting profile to help the flowers take up water better and, thereby, help their arrangements stay fresher longer. You can use this opportunity to explain the generalities of the healing or scabbing action whereby a plant seals its wounds to prevent infiltration of disease and pests and loss of food and water. Look up callus, cutin and suberin with the kids if you want to delve into pathogen protection schema of plants."
        },
        {
            "headline": "Place the rose(s) in the colored water for up to a week.",
            "description": "The water in the flower will continue to evaporate from the flower in a process called transpiration. As it does so, each water molecule moves to fill an adjacent lower pressure zone and pulls the nearby water molecules up the xylem (dead elongated cells that act like a bundle of drinking straws)."
        },
        {
            "headline": "Wait and watch as the rose edges become tinted by the food coloring more and more deeply.",
            "description": "After a while, you will see that the edges of the flower will change to the color of the food coloring being used."
        },
        {
            "headline": "Enjoy your colored rose!",
            "description": ""
        }
    ],
    "tyn": [
        "White roses",
        "A container—small diameter drinking glass, test tube and stand, graduated cylinder, or similar",
        "Food coloring"
    ],
    "text": " Gather the white roses, food coloring, and container. Fresher roses work best, and they do not even have to be fully opened. Just don't get super tight buds that feel compact and solid when you gently squeeze them. If you choose closed buds, try to pick ones that you judge will open soon. Measure approximately 30-60 mL (1-2 fl.oz.) of water - enough to fill your container at least 10 cm (3\") deep. Add 2-4 mL (⅓ to ⅔ tsp) of food coloring and let it disperse throughout the water until the color is nearly uniform. You can use this opportunity to talk with your children about thermal motion and thermal transport mechanisms in fluids and gases. Let them guess what is going on and encourage them to think deeper. Hint: a driving force in the universe is entropy - the tendency to disorder, everything to be dispersed and anti-crystalline. Remove all leaves from the roses.  Cut the rose stem(s) diagonally to expose as much fresh surface as possible. Cut enough off to end up with about 12 in. of stem left. Ask the kids why you chose to cut the stem that way instead of straight across. Clue them in that florists and flower arrangers use this same cutting profile to help the flowers take up water better and, thereby, help their arrangements stay fresher longer. You can use this opportunity to explain the generalities of the healing or scabbing action whereby a plant seals its wounds to prevent infiltration of disease and pests and loss of food and water. Look up callus, cutin and suberin with the kids if you want to delve into pathogen protection schema of plants. Place the rose(s) in the colored water for up to a week. The water in the flower will continue to evaporate from the flower in a process called transpiration. As it does so, each water molecule moves to fill an adjacent lower pressure zone and pulls the nearby water molecules up the xylem (dead elongated cells that act like a bundle of drinking straws). Wait and watch as the rose edges become tinted by the food coloring more and more deeply. After a while, you will see that the edges of the flower will change to the color of the food coloring being used. Enjoy your colored rose! ",
    "sentences": [
        " Gather the white roses, food coloring, and container.",
        "Fresher roses work best, and they do not even have to be fully opened.",
        "Just don't get super tight buds that feel compact and solid when you gently squeeze them.",
        "If you choose closed buds, try to pick ones that you judge will open soon.",
        "Measure approximately 30-60 mL (1-2 fl.oz.)",
        "of water - enough to fill your container at least 10 cm (3\") deep.",
        "Add 2-4 mL (⅓ to ⅔ tsp) of food coloring and let it disperse throughout the water until the color is nearly uniform.",
        "You can use this opportunity to talk with your children about thermal motion and thermal transport mechanisms in fluids and gases.",
        "Let them guess what is going on and encourage them to think deeper.",
        "Hint: a driving force in the universe is entropy - the tendency to disorder, everything to be dispersed and anti-crystalline.",
        "Remove all leaves from the roses.",
        "Cut the rose stem(s) diagonally to expose as much fresh surface as possible.",
        "Cut enough off to end up with about 12 in.",
        "of stem left.",
        "Ask the kids why you chose to cut the stem that way instead of straight across.",
        "Clue them in that florists and flower arrangers use this same cutting profile to help the flowers take up water better and, thereby, help their arrangements stay fresher longer.",
        "You can use this opportunity to explain the generalities of the healing or scabbing action whereby a plant seals its wounds to prevent infiltration of disease and pests and loss of food and water.",
        "Look up callus, cutin and suberin with the kids if you want to delve into pathogen protection schema of plants.",
        "Place the rose(s) in the colored water for up to a week.",
        "The water in the flower will continue to evaporate from the flower in a process called transpiration.",
        "As it does so, each water molecule moves to fill an adjacent lower pressure zone and pulls the nearby water molecules up the xylem (dead elongated cells that act like a bundle of drinking straws).",
        "Wait and watch as the rose edges become tinted by the food coloring more and more deeply.",
        "After a while, you will see that the edges of the flower will change to the color of the food coloring being used.",
        "Enjoy your colored rose!"
    ]
}