{
    "title": "How to Make a Network Cable",
    "url": "https://www.wikihow.com/Make-a-Network-Cable",
    "category_hierarchy": [
        "Computers and Electronics",
        "Computer Networking",
        "Networking Hardware",
        "Network Cabling"
    ],
    "steps": [
        {
            "headline": "Unroll the required length of network cable and add a little extra wire, just in case.",
            "description": "If a boot is to be fitted, do so before stripping away the sleeve and ensure the boot faces the correct way. Please note that the cable length should not be more that 100 meters to prevent attenuation (i.e. degradation of signal strength due to losses as signal travel down the length of the cable). Keeping the length within 100 meters from the access point (i.e. face plate) to the patch panel or network switch will ensure good signal strength/quality."
        },
        {
            "headline": "Carefully remove the outer jacket of the cable.",
            "description": "Be careful when stripping the jacket as to not nick or cut the internal wiring. One good way to do this is to cut lengthwise with snips or a knife along the side of the cable, away from yourself, about an inch toward the open end. This reduces the risk of nicking the wires' insulation. Locate the string inside with the wires, or if no string is found, use the wires themselves to unzip the sheath of the cable by holding the sheath in one hand and pulling sideways with the string or wire. Cut away the unzipped sheath and cut the twisted pairs about 1 1/4\" (30 mm). You will notice 8 wires twisted in 4 pairs. Each pair will have one wire of a certain color and another wire that is white with a colored stripe matching its partner (this wire is called a tracer)."
        },
        {
            "headline": "Inspect the newly revealed wires for any cuts or scrapes that expose the copper wire inside.",
            "description": "If you have breached the protective sheath of any wire, you will need to cut the entire segment of wires off and start over at step one. Exposed copper wire will lead to cross-talk, poor performance or no connectivity at all. It is important that the jacket for all network cables remains intact."
        },
        {
            "headline": "Untwist the pairs so they will lay flat between your fingers.",
            "description": "The white piece of thread can be cut off even with the jacket and disposed (see Warnings). For easier handling, cut the wires so that they are 3/4\" (19 mm) long from the base of the jacket and even in length."
        },
        {
            "headline": "Arrange the wires based on the wiring specifications you are following.",
            "description": "There are two methods set by the TIA, 568A and 568B. Which one you use will depend on what is being connected. A straight-through cable is used to connect two different-layer devices (e.g. a hub and a PC). Two like devices normally require a cross-over cable. The difference between the two is that a straight-through cable has both ends wired identically with 568B, while a cross-over cable has one end wired 568A and the other end wired 568B. For our demonstration in the following steps, we will use 568B, but the instructions can easily be adapted to 568A. 568B - Put the wires in the following order, from left to right:\nwhite orange\norange\nwhite green\nblue\nwhite blue\ngreen\nwhite brown\nbrown\n\n568A - from left to right:\nwhite/green\ngreen\nwhite/orange\nblue\nwhite/blue\norange\nwhite/brown\nbrown"
        },
        {
            "headline": "You can also use the mnemonic 1-2-3-6/3-6-1-2 to remember which wires are switched.",
            "description": ""
        },
        {
            "headline": "Press all the wires flat and parallel between your thumb and forefinger.",
            "description": "Verify the colors have remained in the correct order. Cut the top of the wires even with one another so that they are 1/2\" (12.5 mm) long from the base of the jacket, as the jacket needs to go into the 8P8C connector by about 1/8\", meaning that you only have a 1/2\" of room for the individual cables. Leaving more than 1/2\" untwisted can jeopardize connectivity and quality. Ensure that the cut leaves the wires even and clean; failure to do so may cause the wire not to make contact inside the jack and could lead to wrongly guided cores inside the plug."
        },
        {
            "headline": "Keep the wires flat and in order as you push them into the RJ-45 plug with the flat surface of the plug on top.",
            "description": "The white/orange wire should be on the left if you're looking down at the jack. You can tell if all the wires made it into the jack and maintain their positions by looking head-on at the plug. You should be able to see a wire located in each hole, as seen at the bottom right. You may have to use a little effort to push the pairs firmly into the plug. The cabling jacket should also enter the rear of the jack about 1/4\" (6 mm) to help secure the cable once the plug is crimped. You may need to stretch the sleeve to the proper length. Verify that the sequence is still correct before crimping."
        },
        {
            "headline": "Place the wired plug into the crimping tool.",
            "description": "Give the handle a firm squeeze. You should hear a ratcheting noise as you continue. Once you have completed the crimp, the handle will reset to the open position. To ensure all pins are set, some prefer to double-crimp by repeating this step."
        },
        {
            "headline": "Repeat all of the above steps with the other end of the cable.",
            "description": "The way you wire the other end (568A or 568B) will depend on whether you're making a straight-through, rollover, or cross-over cable (see Tips)."
        },
        {
            "headline": "Test the cable to ensure that it will function in the field.",
            "description": "Mis-wired and incomplete network cables could lead to headaches down the road. In addition, with power-over-Ethernet (PoE) making its way into the marketplace, crossed wire pairs could lead to physical damage of computers or phone system equipment, making it even more crucial that the pairs are in the correct order. A simple cable tester can quickly verify that information for you. Should you not have a network cable tester on hand, simply test connectivity pin to pin."
        }
    ],
    "tyn": [
        "Crimper - This is the most essential tool and critical to the cable making process. If you don't have a quality crimper, then your cable connections will be bad. Inferior crimpers will make it difficult and/or nearly impossible to achieve a tight connection between the wires. Many better quality crimpers also have a ratcheting controlled closure for precise crimping. Crimpers with a plastic body will be more likely to develop a sloppy hip joint and give consistently poor cramps; a metal crimper is much preferred, and very common.",
        "Tester (Optional) - Although not necessary for making cables, having a good cable tester can prevent and solve cable wiring configuration and installation problems. Most testers consist of two boxes (transmitter and receiver) you plug your patch cable into. The transmitter box tests the cable by sending test pulses down each individual wire, lighting up LED lights on the receiver box. Most testers will show you a result of the pass. Why do you want to test cables? Even if they are slightly damaged, network cables will work, but cause packet loss and data corruption to your hardware.",
        "RJ45 Connectors - Ensure your RJ45 connectors are designed for the type of cable you are using (solid/stranded), as they have different types of teeth for piercing between multiple strands or around a solid single strand. Note: if you ask in an electrical trades store for RJ45 connectors, you may be asked whether you want \"solid\", \"stranded\" or \"flat\". The \"flat\" choice relates to the old flat \"silver satin\" cables used in 10Base-T, and should not be used in new Ethernet deployments.",
        "Bulk Cable - Bulk cable can be found at computer stores, electrical stores, and home centers. You can obtain Category 5, Category 5e, and Category 6 cable, depending on your needs. For lengths shorter than 50' use a stranded/braided cable. For lengths greater than 50' use a solid cable.",
        "There are two types of wire (solid or stranded) and which one you choose should be based on where and how the patch cable is to be used. See warning above about PLENUM cable.  Stranded wire is best for a workstation patch as it can tolerate flexing without cracking the conductors; however, the trade off is that they're more susceptible to moisture penetration. Solid is best used in a wire closet or for a patch that will be moved very infrequently, as the conductor tends to crack if bent and/or flexed. Cracked conductor leads to \"reflections\" which make for chatter on the LAN connection, hampering speed and reliability.",
        "Boots (optional but preferred). It saves the cable in the long run and improves the looks. A boot is a molded piece of plastic that protects the connector from snagging, if it is pulled through the wall or conduit. It also provides strain relief on the cable, making it harder for the connector to be pulled off.",
        "Straight edge wire cutter. You may find ",
        "serrated",
        " snips work very nicely. Use something that gives an easy square cut; avoid diagonal pliers for this reason.  You will find that many quality crimpers have a straight edge cutter built in.",
        "Fish Tape - Fish tape is either a metal or plastic spool of guide wire. Strong enough not to buckle and bend while being pushed around, but flexible enough to be pushed past corners and bends, fish tape is a vital tool for some cable runs. Recommended conditions include: conduit, within walls, along structural beams and girders, in ducting, plenums, and dropped ceilings, or any situation where it's not physically possible to drag the cable along with you."
    ],
    "text": " Unroll the required length of network cable and add a little extra wire, just in case. If a boot is to be fitted, do so before stripping away the sleeve and ensure the boot faces the correct way. Please note that the cable length should not be more that 100 meters to prevent attenuation (i.e. degradation of signal strength due to losses as signal travel down the length of the cable). Keeping the length within 100 meters from the access point (i.e. face plate) to the patch panel or network switch will ensure good signal strength/quality. Carefully remove the outer jacket of the cable. Be careful when stripping the jacket as to not nick or cut the internal wiring. One good way to do this is to cut lengthwise with snips or a knife along the side of the cable, away from yourself, about an inch toward the open end. This reduces the risk of nicking the wires' insulation. Locate the string inside with the wires, or if no string is found, use the wires themselves to unzip the sheath of the cable by holding the sheath in one hand and pulling sideways with the string or wire. Cut away the unzipped sheath and cut the twisted pairs about 1 1/4\" (30 mm). You will notice 8 wires twisted in 4 pairs. Each pair will have one wire of a certain color and another wire that is white with a colored stripe matching its partner (this wire is called a tracer). Inspect the newly revealed wires for any cuts or scrapes that expose the copper wire inside. If you have breached the protective sheath of any wire, you will need to cut the entire segment of wires off and start over at step one. Exposed copper wire will lead to cross-talk, poor performance or no connectivity at all. It is important that the jacket for all network cables remains intact. Untwist the pairs so they will lay flat between your fingers. The white piece of thread can be cut off even with the jacket and disposed (see Warnings). For easier handling, cut the wires so that they are 3/4\" (19 mm) long from the base of the jacket and even in length. Arrange the wires based on the wiring specifications you are following. There are two methods set by the TIA, 568A and 568B. Which one you use will depend on what is being connected. A straight-through cable is used to connect two different-layer devices (e.g. a hub and a PC). Two like devices normally require a cross-over cable. The difference between the two is that a straight-through cable has both ends wired identically with 568B, while a cross-over cable has one end wired 568A and the other end wired 568B. For our demonstration in the following steps, we will use 568B, but the instructions can easily be adapted to 568A. 568B - Put the wires in the following order, from left to right:\nwhite orange\norange\nwhite green\nblue\nwhite blue\ngreen\nwhite brown\nbrown\n\n568A - from left to right:\nwhite/green\ngreen\nwhite/orange\nblue\nwhite/blue\norange\nwhite/brown\nbrown You can also use the mnemonic 1-2-3-6/3-6-1-2 to remember which wires are switched.  Press all the wires flat and parallel between your thumb and forefinger. Verify the colors have remained in the correct order. Cut the top of the wires even with one another so that they are 1/2\" (12.5 mm) long from the base of the jacket, as the jacket needs to go into the 8P8C connector by about 1/8\", meaning that you only have a 1/2\" of room for the individual cables. Leaving more than 1/2\" untwisted can jeopardize connectivity and quality. Ensure that the cut leaves the wires even and clean; failure to do so may cause the wire not to make contact inside the jack and could lead to wrongly guided cores inside the plug. Keep the wires flat and in order as you push them into the RJ-45 plug with the flat surface of the plug on top. The white/orange wire should be on the left if you're looking down at the jack. You can tell if all the wires made it into the jack and maintain their positions by looking head-on at the plug. You should be able to see a wire located in each hole, as seen at the bottom right. You may have to use a little effort to push the pairs firmly into the plug. The cabling jacket should also enter the rear of the jack about 1/4\" (6 mm) to help secure the cable once the plug is crimped. You may need to stretch the sleeve to the proper length. Verify that the sequence is still correct before crimping. Place the wired plug into the crimping tool. Give the handle a firm squeeze. You should hear a ratcheting noise as you continue. Once you have completed the crimp, the handle will reset to the open position. To ensure all pins are set, some prefer to double-crimp by repeating this step. Repeat all of the above steps with the other end of the cable. The way you wire the other end (568A or 568B) will depend on whether you're making a straight-through, rollover, or cross-over cable (see Tips). Test the cable to ensure that it will function in the field. Mis-wired and incomplete network cables could lead to headaches down the road. In addition, with power-over-Ethernet (PoE) making its way into the marketplace, crossed wire pairs could lead to physical damage of computers or phone system equipment, making it even more crucial that the pairs are in the correct order. A simple cable tester can quickly verify that information for you. Should you not have a network cable tester on hand, simply test connectivity pin to pin.",
    "sentences": [
        " Unroll the required length of network cable and add a little extra wire, just in case.",
        "If a boot is to be fitted, do so before stripping away the sleeve and ensure the boot faces the correct way.",
        "Please note that the cable length should not be more that 100 meters to prevent attenuation (i.e.",
        "degradation of signal strength due to losses as signal travel down the length of the cable).",
        "Keeping the length within 100 meters from the access point (i.e.",
        "face plate) to the patch panel or network switch will ensure good signal strength/quality.",
        "Carefully remove the outer jacket of the cable.",
        "Be careful when stripping the jacket as to not nick or cut the internal wiring.",
        "One good way to do this is to cut lengthwise with snips or a knife along the side of the cable, away from yourself, about an inch toward the open end.",
        "This reduces the risk of nicking the wires' insulation.",
        "Locate the string inside with the wires, or if no string is found, use the wires themselves to unzip the sheath of the cable by holding the sheath in one hand and pulling sideways with the string or wire.",
        "Cut away the unzipped sheath and cut the twisted pairs about 1 1/4\" (30 mm).",
        "You will notice 8 wires twisted in 4 pairs.",
        "Each pair will have one wire of a certain color and another wire that is white with a colored stripe matching its partner (this wire is called a tracer).",
        "Inspect the newly revealed wires for any cuts or scrapes that expose the copper wire inside.",
        "If you have breached the protective sheath of any wire, you will need to cut the entire segment of wires off and start over at step one.",
        "Exposed copper wire will lead to cross-talk, poor performance or no connectivity at all.",
        "It is important that the jacket for all network cables remains intact.",
        "Untwist the pairs so they will lay flat between your fingers.",
        "The white piece of thread can be cut off even with the jacket and disposed (see Warnings).",
        "For easier handling, cut the wires so that they are 3/4\" (19 mm) long from the base of the jacket and even in length.",
        "Arrange the wires based on the wiring specifications you are following.",
        "There are two methods set by the TIA, 568A and 568B.",
        "Which one you use will depend on what is being connected.",
        "A straight-through cable is used to connect two different-layer devices (e.g.",
        "a hub and a PC).",
        "Two like devices normally require a cross-over cable.",
        "The difference between the two is that a straight-through cable has both ends wired identically with 568B, while a cross-over cable has one end wired 568A and the other end wired 568B.",
        "For our demonstration in the following steps, we will use 568B, but the instructions can easily be adapted to 568A.",
        "568B - Put the wires in the following order, from left to right:\nwhite orange\norange\nwhite green\nblue\nwhite blue\ngreen\nwhite brown\nbrown\n\n568A - from left to right:\nwhite/green\ngreen\nwhite/orange\nblue\nwhite/blue\norange\nwhite/brown\nbrown You can also use the mnemonic 1-2-3-6/3-6-1-2 to remember which wires are switched.",
        "Press all the wires flat and parallel between your thumb and forefinger.",
        "Verify the colors have remained in the correct order.",
        "Cut the top of the wires even with one another so that they are 1/2\" (12.5 mm) long from the base of the jacket, as the jacket needs to go into the 8P8C connector by about 1/8\", meaning that you only have a 1/2\" of room for the individual cables.",
        "Leaving more than 1/2\" untwisted can jeopardize connectivity and quality.",
        "Ensure that the cut leaves the wires even and clean; failure to do so may cause the wire not to make contact inside the jack and could lead to wrongly guided cores inside the plug.",
        "Keep the wires flat and in order as you push them into the RJ-45 plug with the flat surface of the plug on top.",
        "The white/orange wire should be on the left if you're looking down at the jack.",
        "You can tell if all the wires made it into the jack and maintain their positions by looking head-on at the plug.",
        "You should be able to see a wire located in each hole, as seen at the bottom right.",
        "You may have to use a little effort to push the pairs firmly into the plug.",
        "The cabling jacket should also enter the rear of the jack about 1/4\" (6 mm) to help secure the cable once the plug is crimped.",
        "You may need to stretch the sleeve to the proper length.",
        "Verify that the sequence is still correct before crimping.",
        "Place the wired plug into the crimping tool.",
        "Give the handle a firm squeeze.",
        "You should hear a ratcheting noise as you continue.",
        "Once you have completed the crimp, the handle will reset to the open position.",
        "To ensure all pins are set, some prefer to double-crimp by repeating this step.",
        "Repeat all of the above steps with the other end of the cable.",
        "The way you wire the other end (568A or 568B) will depend on whether you're making a straight-through, rollover, or cross-over cable (see Tips).",
        "Test the cable to ensure that it will function in the field.",
        "Mis-wired and incomplete network cables could lead to headaches down the road.",
        "In addition, with power-over-Ethernet (PoE) making its way into the marketplace, crossed wire pairs could lead to physical damage of computers or phone system equipment, making it even more crucial that the pairs are in the correct order.",
        "A simple cable tester can quickly verify that information for you.",
        "Should you not have a network cable tester on hand, simply test connectivity pin to pin."
    ]
}