{
    "title": "How to Wrap a Cat",
    "url": "https://www.wikihow.com/Wrap-a-Cat",
    "category_hierarchy": [
        "Pets and Animals",
        "Cats",
        "Cat Behavior"
    ],
    "methods": [
        {
            "name": "Wrapping a Docile Cat",
            "steps": [
                {
                    "headline": "Before disturbing the cat, get a towel ready.",
                    "description": "To do this, shake the towel out and spread it evenly over a flat surface. A table is better than the floor as it's easier on your back and arms. A large towel is ideal, such as a beach towel or bed sheet. If necessary you could use a closed-weave blanket of a similar size. Open weave blankets offer little protection and are not suitable because the cat will catch her claws in the fabric."
                },
                {
                    "headline": "Speak calmly to the cat and pick her up with both hands, cradling her weight in your arms.",
                    "description": "A regular-sized towel has a longer length and narrower width. You will want to place the cat centrally on the towel, at a right-angle to the length, with her nose touching one edge. Let the cat rest on her belly in a natural crouching position, with her paws underneath. There should be an equal length of towel on either side of the cat’s body."
                },
                {
                    "headline": "Make the first fold.",
                    "description": "If you are right handed, use your left hand to grip her scruff and vice versa. This area of loose skin over the shoulders is where a mother cat holds her kittens to trigger a passive reaction. Although you may feel reticent about gripping your pet firmly, be assured you are not hurting, or harming her in any way. To make the first fold:\nWith your right hand, grasp the towel edge 8 to 10 inches (20 to 25 cm) from the cat. Apply firm tension to the fabric and fold it right-over-left across the cat’s back, and include the hand restraining the cat in the wrap. You will remove your hand after the next step. Gently lift the cat by the scruff, such that her body is raised at a 45 degree angle to the horizontal, with her bottom resting on the floor and her forequarters elevated. Feed the fold of towel lying across her back, under her left front paw. Then lower her paws back to the table top so that her body weight anchors this first wrap in place."
                },
                {
                    "headline": "Make the second fold.",
                    "description": "To make the second fold, do the following:\nWith your left hand still encased, grasp the towel on the left side of the cat. As before, apply firm tension as you cross the fabric left-to-right over the cat’s back. The cat is now enclosed in a towel cocoon with just her head sticking out. Now free your left hand. Let go of her scruff and wriggle your fingers free of the wrap. If you applied the correct tension to the towel, the cat’s limbs will remain firmly held against her body. Place your newly freed hand under her chest. Lift her front end up off the flat surface so that her body is angled at about 45 degrees horizontally. Now use your right hand to grasp the trailing edge of the second wrap. Feed it under the cat and pull it firmly so she is tightly swaddled. Continue to wrap the remaining length of towel around the cat until the free length is used up."
                },
                {
                    "headline": "Make the final fold.",
                    "description": "The cat is now rolled in a towel but, if she is determined, she could wriggle out backwards. The final, or \"burrito\" fold, involves tucking the width of the towel dangling behind her, under the body. This is as simple as it sounds:\nSimply lift up her wrapped rear end and tuck the dangling tail of fabric beneath her. Now when you lower her back end down, her body weight pins the towel beneath her and there is no backwards escape route."
                },
                {
                    "headline": "Examine your cat or give her medicine.",
                    "description": "After wrapping your cat, you can immediately give her medicine. Or you can examine a leg or paw by slowly pulling the desired body part out for examination, through the opening end of the towel or blanket. wikiHow's How to Give a Cat a Pill might come in handy right about now!"
                }
            ]
        },
        {
            "name": "Wrapping an Aggressive Cat",
            "steps": [
                {
                    "headline": "Try first to talk your way around the cat.",
                    "description": "Praise her and reassure her that no harm will be done. Act as normal as possible. If necessary, go about your day so she doesn't sense that something is going on. If you have another person with you, this will be a lot easier. Distract that cat yourself while the other person grabs the towel or blanket to wrap them with. Have them approach from behind."
                },
                {
                    "headline": "Get a thick and large towel or blanket.",
                    "description": "You want that's ideally three or four times the size of the cat. A large blanket, towel, or sheet is best. Avoid those that have a loose weave, as your cat could paw or claw her way out. You'll also need a towel or blanket resting smooth on a large, flat surface. The towel in your hands now is to cover her and to keep her from clawing you and escaping. The towel on the table will be the one she is wrapped in."
                },
                {
                    "headline": "Immediately throw it over the cat.",
                    "description": "Try to get the cat as centered in the towel as possible. Restrain her as necessary -- you won't hurt her if your aim is simply restraint. If you miss, you may be better off waiting for the shock to wear off. For the next hour or so, she'll probably be on high alert. Try again when she seems calmer."
                },
                {
                    "headline": "Immediately locate the scruff of the neck and grab it.",
                    "description": "This needs to happen while the cat is still inside the towel. Grab it using both of your hands, if necessary. If she's behaving, use your non-dominant hand. Your dominant hand will be used for wrapping. Being grabbed by the scruff of the neck won't hurt her. In fact, it's where mother cats grab their kittens. It signals to the kittens that they should be passive and docile."
                },
                {
                    "headline": "Place the cat on a table with a large thick towel already spread on it.",
                    "description": "Follow the same procedure as in wrapping a cat that is calm, only complete it as quickly as possible. When the wrapping is complete, you can then immediately medicate her or examine her as needed. The first method in this article outlines the three-move, or \"burrito,\" wrapping method. You'll be ready to start at step 3. If you do end up getting bitten or scratched by the cat, wash the area with warm, soapy water. If you have a weak immune system, see a doctor, as there is risk of bacterial infection."
                }
            ]
        }
    ],
    "tyn": [
        "A large towel, blanket, or sheet",
        "A flat surface"
    ],
    "text": " Wrapping a Docile Cat Before disturbing the cat, get a towel ready. To do this, shake the towel out and spread it evenly over a flat surface. A table is better than the floor as it's easier on your back and arms. A large towel is ideal, such as a beach towel or bed sheet. If necessary you could use a closed-weave blanket of a similar size. Open weave blankets offer little protection and are not suitable because the cat will catch her claws in the fabric. Speak calmly to the cat and pick her up with both hands, cradling her weight in your arms. A regular-sized towel has a longer length and narrower width. You will want to place the cat centrally on the towel, at a right-angle to the length, with her nose touching one edge. Let the cat rest on her belly in a natural crouching position, with her paws underneath. There should be an equal length of towel on either side of the cat’s body. Make the first fold. If you are right handed, use your left hand to grip her scruff and vice versa. This area of loose skin over the shoulders is where a mother cat holds her kittens to trigger a passive reaction. Although you may feel reticent about gripping your pet firmly, be assured you are not hurting, or harming her in any way. To make the first fold:\nWith your right hand, grasp the towel edge 8 to 10 inches (20 to 25 cm) from the cat. Apply firm tension to the fabric and fold it right-over-left across the cat’s back, and include the hand restraining the cat in the wrap. You will remove your hand after the next step. Gently lift the cat by the scruff, such that her body is raised at a 45 degree angle to the horizontal, with her bottom resting on the floor and her forequarters elevated. Feed the fold of towel lying across her back, under her left front paw. Then lower her paws back to the table top so that her body weight anchors this first wrap in place. Make the second fold. To make the second fold, do the following:\nWith your left hand still encased, grasp the towel on the left side of the cat. As before, apply firm tension as you cross the fabric left-to-right over the cat’s back. The cat is now enclosed in a towel cocoon with just her head sticking out. Now free your left hand. Let go of her scruff and wriggle your fingers free of the wrap. If you applied the correct tension to the towel, the cat’s limbs will remain firmly held against her body. Place your newly freed hand under her chest. Lift her front end up off the flat surface so that her body is angled at about 45 degrees horizontally. Now use your right hand to grasp the trailing edge of the second wrap. Feed it under the cat and pull it firmly so she is tightly swaddled. Continue to wrap the remaining length of towel around the cat until the free length is used up. Make the final fold. The cat is now rolled in a towel but, if she is determined, she could wriggle out backwards. The final, or \"burrito\" fold, involves tucking the width of the towel dangling behind her, under the body. This is as simple as it sounds:\nSimply lift up her wrapped rear end and tuck the dangling tail of fabric beneath her. Now when you lower her back end down, her body weight pins the towel beneath her and there is no backwards escape route. Examine your cat or give her medicine. After wrapping your cat, you can immediately give her medicine. Or you can examine a leg or paw by slowly pulling the desired body part out for examination, through the opening end of the towel or blanket. wikiHow's How to Give a Cat a Pill might come in handy right about now! Wrapping an Aggressive Cat Try first to talk your way around the cat. Praise her and reassure her that no harm will be done. Act as normal as possible. If necessary, go about your day so she doesn't sense that something is going on. If you have another person with you, this will be a lot easier. Distract that cat yourself while the other person grabs the towel or blanket to wrap them with. Have them approach from behind. Get a thick and large towel or blanket. You want that's ideally three or four times the size of the cat. A large blanket, towel, or sheet is best. Avoid those that have a loose weave, as your cat could paw or claw her way out. You'll also need a towel or blanket resting smooth on a large, flat surface. The towel in your hands now is to cover her and to keep her from clawing you and escaping. The towel on the table will be the one she is wrapped in. Immediately throw it over the cat. Try to get the cat as centered in the towel as possible. Restrain her as necessary -- you won't hurt her if your aim is simply restraint. If you miss, you may be better off waiting for the shock to wear off. For the next hour or so, she'll probably be on high alert. Try again when she seems calmer. Immediately locate the scruff of the neck and grab it. This needs to happen while the cat is still inside the towel. Grab it using both of your hands, if necessary. If she's behaving, use your non-dominant hand. Your dominant hand will be used for wrapping. Being grabbed by the scruff of the neck won't hurt her. In fact, it's where mother cats grab their kittens. It signals to the kittens that they should be passive and docile. Place the cat on a table with a large thick towel already spread on it. Follow the same procedure as in wrapping a cat that is calm, only complete it as quickly as possible. When the wrapping is complete, you can then immediately medicate her or examine her as needed. The first method in this article outlines the three-move, or \"burrito,\" wrapping method. You'll be ready to start at step 3. If you do end up getting bitten or scratched by the cat, wash the area with warm, soapy water. If you have a weak immune system, see a doctor, as there is risk of bacterial infection.",
    "sentences": [
        " Wrapping a Docile Cat Before disturbing the cat, get a towel ready.",
        "To do this, shake the towel out and spread it evenly over a flat surface.",
        "A table is better than the floor as it's easier on your back and arms.",
        "A large towel is ideal, such as a beach towel or bed sheet.",
        "If necessary you could use a closed-weave blanket of a similar size.",
        "Open weave blankets offer little protection and are not suitable because the cat will catch her claws in the fabric.",
        "Speak calmly to the cat and pick her up with both hands, cradling her weight in your arms.",
        "A regular-sized towel has a longer length and narrower width.",
        "You will want to place the cat centrally on the towel, at a right-angle to the length, with her nose touching one edge.",
        "Let the cat rest on her belly in a natural crouching position, with her paws underneath.",
        "There should be an equal length of towel on either side of the cat’s body.",
        "Make the first fold.",
        "If you are right handed, use your left hand to grip her scruff and vice versa.",
        "This area of loose skin over the shoulders is where a mother cat holds her kittens to trigger a passive reaction.",
        "Although you may feel reticent about gripping your pet firmly, be assured you are not hurting, or harming her in any way.",
        "To make the first fold:\nWith your right hand, grasp the towel edge 8 to 10 inches (20 to 25 cm) from the cat.",
        "Apply firm tension to the fabric and fold it right-over-left across the cat’s back, and include the hand restraining the cat in the wrap.",
        "You will remove your hand after the next step.",
        "Gently lift the cat by the scruff, such that her body is raised at a 45 degree angle to the horizontal, with her bottom resting on the floor and her forequarters elevated.",
        "Feed the fold of towel lying across her back, under her left front paw.",
        "Then lower her paws back to the table top so that her body weight anchors this first wrap in place.",
        "Make the second fold.",
        "To make the second fold, do the following:\nWith your left hand still encased, grasp the towel on the left side of the cat.",
        "As before, apply firm tension as you cross the fabric left-to-right over the cat’s back.",
        "The cat is now enclosed in a towel cocoon with just her head sticking out.",
        "Now free your left hand.",
        "Let go of her scruff and wriggle your fingers free of the wrap.",
        "If you applied the correct tension to the towel, the cat’s limbs will remain firmly held against her body.",
        "Place your newly freed hand under her chest.",
        "Lift her front end up off the flat surface so that her body is angled at about 45 degrees horizontally.",
        "Now use your right hand to grasp the trailing edge of the second wrap.",
        "Feed it under the cat and pull it firmly so she is tightly swaddled.",
        "Continue to wrap the remaining length of towel around the cat until the free length is used up.",
        "Make the final fold.",
        "The cat is now rolled in a towel but, if she is determined, she could wriggle out backwards.",
        "The final, or \"burrito\" fold, involves tucking the width of the towel dangling behind her, under the body.",
        "This is as simple as it sounds:\nSimply lift up her wrapped rear end and tuck the dangling tail of fabric beneath her.",
        "Now when you lower her back end down, her body weight pins the towel beneath her and there is no backwards escape route.",
        "Examine your cat or give her medicine.",
        "After wrapping your cat, you can immediately give her medicine.",
        "Or you can examine a leg or paw by slowly pulling the desired body part out for examination, through the opening end of the towel or blanket.",
        "wikiHow's How to Give a Cat a Pill might come in handy right about now!",
        "Wrapping an Aggressive Cat Try first to talk your way around the cat.",
        "Praise her and reassure her that no harm will be done.",
        "Act as normal as possible.",
        "If necessary, go about your day so she doesn't sense that something is going on.",
        "If you have another person with you, this will be a lot easier.",
        "Distract that cat yourself while the other person grabs the towel or blanket to wrap them with.",
        "Have them approach from behind.",
        "Get a thick and large towel or blanket.",
        "You want that's ideally three or four times the size of the cat.",
        "A large blanket, towel, or sheet is best.",
        "Avoid those that have a loose weave, as your cat could paw or claw her way out.",
        "You'll also need a towel or blanket resting smooth on a large, flat surface.",
        "The towel in your hands now is to cover her and to keep her from clawing you and escaping.",
        "The towel on the table will be the one she is wrapped in.",
        "Immediately throw it over the cat.",
        "Try to get the cat as centered in the towel as possible.",
        "Restrain her as necessary -- you won't hurt her if your aim is simply restraint.",
        "If you miss, you may be better off waiting for the shock to wear off.",
        "For the next hour or so, she'll probably be on high alert.",
        "Try again when she seems calmer.",
        "Immediately locate the scruff of the neck and grab it.",
        "This needs to happen while the cat is still inside the towel.",
        "Grab it using both of your hands, if necessary.",
        "If she's behaving, use your non-dominant hand.",
        "Your dominant hand will be used for wrapping.",
        "Being grabbed by the scruff of the neck won't hurt her.",
        "In fact, it's where mother cats grab their kittens.",
        "It signals to the kittens that they should be passive and docile.",
        "Place the cat on a table with a large thick towel already spread on it.",
        "Follow the same procedure as in wrapping a cat that is calm, only complete it as quickly as possible.",
        "When the wrapping is complete, you can then immediately medicate her or examine her as needed.",
        "The first method in this article outlines the three-move, or \"burrito,\" wrapping method.",
        "You'll be ready to start at step 3.",
        "If you do end up getting bitten or scratched by the cat, wash the area with warm, soapy water.",
        "If you have a weak immune system, see a doctor, as there is risk of bacterial infection."
    ]
}