{
    "title": "How to Transfer Rock Band 1 Songs Into Rock Band 2 on Xbox 360",
    "url": "https://www.wikihow.com/Transfer-Rock-Band-1-Songs-Into-Rock-Band-2-on-Xbox-360",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Video Games",
        "Xbox",
        "Xbox 360"
    ],
    "steps": [
        {
            "headline": "Put the Rock Band 1 game disc into your Xbox 360 and start it up.",
            "description": ""
        },
        {
            "headline": "If you haven't played it recently (since Rock Band 2 launched 9/14/08), it should show there is a small update to download.",
            "description": "This should only take a few seconds and then the game should start up."
        },
        {
            "headline": "Go to Options on the main menu and you should have a new choice, which is Export Songs.",
            "description": "Select it."
        },
        {
            "headline": "Once selected you should be prompted to enter a password, which is on a small piece of paper that comes inside the case for Rock Band 2.",
            "description": "Enter this password."
        },
        {
            "headline": "Look at the screen.",
            "description": "The screen should then show how much the fee for the transfer is (400 Microsoft Points, or $5), if you don't have 400 points or more tied to your account, you'll need to purchase them online with a credit/debit card or enter the code from a store purchased point card."
        },
        {
            "headline": "Select Confirm Download and a file will download, which should only take a few seconds.",
            "description": ""
        },
        {
            "headline": "Wait.",
            "description": "Once this is downloaded, it should begin the transfer process which takes about 10 minutes (and about 1.5GB of space on your hard drive)."
        },
        {
            "headline": "When this is complete you can take out Rock Band 1, put in Rock Band 2 and now have access to 55 of the 58 songs from Rock Band 1.",
            "description": "Add this to the 84 songs on Rock Band 2 and any downloaded songs you may have, and you have quite a set list."
        }
    ],
    "tyn": [
        "Xbox 360 with a Hard Drive (with at least 1.5GB free space)",
        "Rock Band 1",
        "Rock Band 2",
        "Xbox Live Account and a high-speed internet connection",
        "400 Microsoft Points (equivalent to $5)"
    ],
    "text": " Put the Rock Band 1 game disc into your Xbox 360 and start it up.  If you haven't played it recently (since Rock Band 2 launched 9/14/08), it should show there is a small update to download. This should only take a few seconds and then the game should start up. Go to Options on the main menu and you should have a new choice, which is Export Songs. Select it. Once selected you should be prompted to enter a password, which is on a small piece of paper that comes inside the case for Rock Band 2. Enter this password. Look at the screen. The screen should then show how much the fee for the transfer is (400 Microsoft Points, or $5), if you don't have 400 points or more tied to your account, you'll need to purchase them online with a credit/debit card or enter the code from a store purchased point card. Select Confirm Download and a file will download, which should only take a few seconds.  Wait. Once this is downloaded, it should begin the transfer process which takes about 10 minutes (and about 1.5GB of space on your hard drive). When this is complete you can take out Rock Band 1, put in Rock Band 2 and now have access to 55 of the 58 songs from Rock Band 1. Add this to the 84 songs on Rock Band 2 and any downloaded songs you may have, and you have quite a set list.",
    "sentences": [
        " Put the Rock Band 1 game disc into your Xbox 360 and start it up.",
        "If you haven't played it recently (since Rock Band 2 launched 9/14/08), it should show there is a small update to download.",
        "This should only take a few seconds and then the game should start up.",
        "Go to Options on the main menu and you should have a new choice, which is Export Songs.",
        "Select it.",
        "Once selected you should be prompted to enter a password, which is on a small piece of paper that comes inside the case for Rock Band 2.",
        "Enter this password.",
        "Look at the screen.",
        "The screen should then show how much the fee for the transfer is (400 Microsoft Points, or $5), if you don't have 400 points or more tied to your account, you'll need to purchase them online with a credit/debit card or enter the code from a store purchased point card.",
        "Select Confirm Download and a file will download, which should only take a few seconds.",
        "Wait.",
        "Once this is downloaded, it should begin the transfer process which takes about 10 minutes (and about 1.5GB of space on your hard drive).",
        "When this is complete you can take out Rock Band 1, put in Rock Band 2 and now have access to 55 of the 58 songs from Rock Band 1.",
        "Add this to the 84 songs on Rock Band 2 and any downloaded songs you may have, and you have quite a set list."
    ]
}