{
    "title": "How to Make Rice Water",
    "url": "https://www.wikihow.com/Make-Rice-Water",
    "category_hierarchy": [
        "Health",
        "Alternative Health"
    ],
    "methods": [
        {
            "name": "Making Horchata",
            "steps": [
                {
                    "headline": "Steep the rice, water, and cinnamon.",
                    "description": "Use a large saucepan. Pour in 2 quarts (2 l) of water. Add 1 cup (185 g) of long grain rice. Break one cinnamon stick into pieces and add that, too. Let them soak for three hours."
                },
                {
                    "headline": "Heat the saucepan.",
                    "description": "After the rice mixture has steeped for three hours, place the saucepan on your oven’s burner if you haven’t already done so. Set the heat to medium-high. Once the water starts to boil, lower the heat. Let it simmer for half an hour."
                },
                {
                    "headline": "Blend the contents.",
                    "description": "First, let the rice and water cool back down once it has simmered. Then either transfer the contents to a blender or use an immersion blender in the saucepan. Puree the rice until it combines with the water and creates a smooth texture."
                },
                {
                    "headline": "Strain the mixture.",
                    "description": "Place a fine sieve over a large container. Either pour or ladle the mixture into the sieve to strain the liquid into the container. Discard the residue left in the sieve."
                },
                {
                    "headline": "Flavor and chill the liquid.",
                    "description": "Stir in ½ cup (100 g) of white sugar to sweeten (or less, as desired). For extra flavor, add a teaspoon of vanilla. Refrigerate the container to cool the liquid. Serve over ice when ready."
                }
            ]
        },
        {
            "name": "Cold-Brewing for Topical Treatment",
            "steps": [
                {
                    "headline": "Rinse the rice.",
                    "description": "First, make sure the holes in your colander are small enough to prevent the grains of rice from slipping through. Then load your colander with ½ cup (97.5 g) of rice. Rinse with water to ensure a clean batch of rice water."
                },
                {
                    "headline": "Soak the rice.",
                    "description": "Transfer the rinsed rice to a medium-sized mixing bowl. Add two to three cups of water (473 ml to 710 ml). Let it sit for a half-hour."
                },
                {
                    "headline": "Stir the contents.",
                    "description": "Once the water has soaked into the rice, stir it up. Use your spoon or fingers to gently press the rice. Release the rice’s vitamin- and mineral-content into the water by doing so."
                },
                {
                    "headline": "Strain and store the water.",
                    "description": "Place a fine sieve over your storage container (or a bowl for immediate use). Strain the mixture through the sieve. Seal the liquid’s container and store in the refrigerator. When refrigerated, your rice water should keep for up to a week."
                }
            ]
        },
        {
            "name": "Fermenting a Cold Brew for Potency",
            "steps": [
                {
                    "headline": "Make a cold brew.",
                    "description": "If you already made one and stored it in the fridge, remove it so it can warm up to room temperature. If not, make a cold brew as described, but stop short of straining the liquid. Let the rice sit in the water instead and cover the bowl."
                },
                {
                    "headline": "Let the rice water sit at room temperature.",
                    "description": "Allow the rice water to ferment anywhere from 12 to 48 hours. Uncover and smell the contents periodically. Once it begins to smell sour, consider it fermented. Expect the time needed for this to vary depending on the exact temperature, plus whether or not the liquid has been strained. An unstrained mixture should ferment in 12 to 24 hours. Strained liquid will take between 24 and 48 hours. Higher room temperatures will reduce the amount of time needed."
                },
                {
                    "headline": "Boil the water.",
                    "description": "First, strain the liquid if you haven’t already done so. Transfer the liquid to a pot or saucepan. Raise the heat to medium-high. Bring the water to a boil to cease the fermentation. Boiling the water after fermentation is often recommended, but not strictly required."
                },
                {
                    "headline": "Use or store your rice water.",
                    "description": "If you intend to use it right away, allow the water to cool first to avoid scalding. Otherwise, transfer it to a sealable container. Store in the refrigerator. Expect fermented water to pack a punch. Dilute the fermented rice water with plain warm water as desired when you use it."
                }
            ]
        },
        {
            "name": "Using Rice Water",
            "steps": [
                {
                    "headline": "Drink for medicinal purposes.",
                    "description": "Relieve stomach cramps and inflammation by lining your stomach with a protective coating. Alleviate diarrhea and replenish fluids by drinking two or three cups a day. Cure and avert constipation by doing the same. For purely medicinal purposes (as opposed to a yummy beverage), the only ingredients you need are the rice and water. All others are strictly for flavor."
                },
                {
                    "headline": "Clean and tone your skin.",
                    "description": "Apply small dabs to your skin. Rub it gently in for a minute or two. Then move onto the next area. Do so as part of your regular daily routine. Rice water has been shown to:\nRelieve inflammations. Reduce age spots. Moisturize skin. Enhance blood circulation. Shrink pores."
                },
                {
                    "headline": "Rinse your hair.",
                    "description": "First, wash your hair with your regular shampoo. After rinsing that out, soak your hair with rice water. Softly rub it into your hair and scalp. Let it sit anywhere between four and twenty minutes before rinsing with plain, clean water. Rice water can build up in your hair, though, so limit yourself to one weekly application. Benefits include:\nReduces friction between hairs. Makes hair more elastic and smooth. Strengthens and protects hair even after rinsing. Increases volume and sheen."
                }
            ]
        }
    ],
    "tyn": [
        "Brewing Horchata:",
        "Measuring cups and spoons",
        "Large saucepan",
        "Large spoon for stirring",
        "Stovetop",
        "Blender",
        "Fine sieve",
        "Refrigerator",
        "Cold-Brewing for Skin & Hair:",
        "Colander",
        "Measuring cup",
        "Medium-sized mixing bowl (or other container)",
        "Sealable container",
        "Refrigerator (for storage)",
        "Fermenting a Cold Brew:",
        "Pot or saucepan"
    ],
    "text": " Making Horchata Steep the rice, water, and cinnamon. Use a large saucepan. Pour in 2 quarts (2 l) of water. Add 1 cup (185 g) of long grain rice. Break one cinnamon stick into pieces and add that, too. Let them soak for three hours. Heat the saucepan. After the rice mixture has steeped for three hours, place the saucepan on your oven’s burner if you haven’t already done so. Set the heat to medium-high. Once the water starts to boil, lower the heat. Let it simmer for half an hour. Blend the contents. First, let the rice and water cool back down once it has simmered. Then either transfer the contents to a blender or use an immersion blender in the saucepan. Puree the rice until it combines with the water and creates a smooth texture. Strain the mixture. Place a fine sieve over a large container. Either pour or ladle the mixture into the sieve to strain the liquid into the container. Discard the residue left in the sieve. Flavor and chill the liquid. Stir in ½ cup (100 g) of white sugar to sweeten (or less, as desired). For extra flavor, add a teaspoon of vanilla. Refrigerate the container to cool the liquid. Serve over ice when ready. Cold-Brewing for Topical Treatment Rinse the rice. First, make sure the holes in your colander are small enough to prevent the grains of rice from slipping through. Then load your colander with ½ cup (97.5 g) of rice. Rinse with water to ensure a clean batch of rice water. Soak the rice. Transfer the rinsed rice to a medium-sized mixing bowl. Add two to three cups of water (473 ml to 710 ml). Let it sit for a half-hour. Stir the contents. Once the water has soaked into the rice, stir it up. Use your spoon or fingers to gently press the rice. Release the rice’s vitamin- and mineral-content into the water by doing so. Strain and store the water. Place a fine sieve over your storage container (or a bowl for immediate use). Strain the mixture through the sieve. Seal the liquid’s container and store in the refrigerator. When refrigerated, your rice water should keep for up to a week. Fermenting a Cold Brew for Potency Make a cold brew. If you already made one and stored it in the fridge, remove it so it can warm up to room temperature. If not, make a cold brew as described, but stop short of straining the liquid. Let the rice sit in the water instead and cover the bowl. Let the rice water sit at room temperature. Allow the rice water to ferment anywhere from 12 to 48 hours. Uncover and smell the contents periodically. Once it begins to smell sour, consider it fermented. Expect the time needed for this to vary depending on the exact temperature, plus whether or not the liquid has been strained. An unstrained mixture should ferment in 12 to 24 hours. Strained liquid will take between 24 and 48 hours. Higher room temperatures will reduce the amount of time needed. Boil the water. First, strain the liquid if you haven’t already done so. Transfer the liquid to a pot or saucepan. Raise the heat to medium-high. Bring the water to a boil to cease the fermentation. Boiling the water after fermentation is often recommended, but not strictly required. Use or store your rice water. If you intend to use it right away, allow the water to cool first to avoid scalding. Otherwise, transfer it to a sealable container. Store in the refrigerator. Expect fermented water to pack a punch. Dilute the fermented rice water with plain warm water as desired when you use it. Using Rice Water Drink for medicinal purposes. Relieve stomach cramps and inflammation by lining your stomach with a protective coating. Alleviate diarrhea and replenish fluids by drinking two or three cups a day. Cure and avert constipation by doing the same. For purely medicinal purposes (as opposed to a yummy beverage), the only ingredients you need are the rice and water. All others are strictly for flavor. Clean and tone your skin. Apply small dabs to your skin. Rub it gently in for a minute or two. Then move onto the next area. Do so as part of your regular daily routine. Rice water has been shown to:\nRelieve inflammations. Reduce age spots. Moisturize skin. Enhance blood circulation. Shrink pores. Rinse your hair. First, wash your hair with your regular shampoo. After rinsing that out, soak your hair with rice water. Softly rub it into your hair and scalp. Let it sit anywhere between four and twenty minutes before rinsing with plain, clean water. Rice water can build up in your hair, though, so limit yourself to one weekly application. Benefits include:\nReduces friction between hairs. Makes hair more elastic and smooth. Strengthens and protects hair even after rinsing. Increases volume and sheen.",
    "sentences": [
        " Making Horchata Steep the rice, water, and cinnamon.",
        "Use a large saucepan.",
        "Pour in 2 quarts (2 l) of water.",
        "Add 1 cup (185 g) of long grain rice.",
        "Break one cinnamon stick into pieces and add that, too.",
        "Let them soak for three hours.",
        "Heat the saucepan.",
        "After the rice mixture has steeped for three hours, place the saucepan on your oven’s burner if you haven’t already done so.",
        "Set the heat to medium-high.",
        "Once the water starts to boil, lower the heat.",
        "Let it simmer for half an hour.",
        "Blend the contents.",
        "First, let the rice and water cool back down once it has simmered.",
        "Then either transfer the contents to a blender or use an immersion blender in the saucepan.",
        "Puree the rice until it combines with the water and creates a smooth texture.",
        "Strain the mixture.",
        "Place a fine sieve over a large container.",
        "Either pour or ladle the mixture into the sieve to strain the liquid into the container.",
        "Discard the residue left in the sieve.",
        "Flavor and chill the liquid.",
        "Stir in ½ cup (100 g) of white sugar to sweeten (or less, as desired).",
        "For extra flavor, add a teaspoon of vanilla.",
        "Refrigerate the container to cool the liquid.",
        "Serve over ice when ready.",
        "Cold-Brewing for Topical Treatment Rinse the rice.",
        "First, make sure the holes in your colander are small enough to prevent the grains of rice from slipping through.",
        "Then load your colander with ½ cup (97.5 g) of rice.",
        "Rinse with water to ensure a clean batch of rice water.",
        "Soak the rice.",
        "Transfer the rinsed rice to a medium-sized mixing bowl.",
        "Add two to three cups of water (473 ml to 710 ml).",
        "Let it sit for a half-hour.",
        "Stir the contents.",
        "Once the water has soaked into the rice, stir it up.",
        "Use your spoon or fingers to gently press the rice.",
        "Release the rice’s vitamin- and mineral-content into the water by doing so.",
        "Strain and store the water.",
        "Place a fine sieve over your storage container (or a bowl for immediate use).",
        "Strain the mixture through the sieve.",
        "Seal the liquid’s container and store in the refrigerator.",
        "When refrigerated, your rice water should keep for up to a week.",
        "Fermenting a Cold Brew for Potency Make a cold brew.",
        "If you already made one and stored it in the fridge, remove it so it can warm up to room temperature.",
        "If not, make a cold brew as described, but stop short of straining the liquid.",
        "Let the rice sit in the water instead and cover the bowl.",
        "Let the rice water sit at room temperature.",
        "Allow the rice water to ferment anywhere from 12 to 48 hours.",
        "Uncover and smell the contents periodically.",
        "Once it begins to smell sour, consider it fermented.",
        "Expect the time needed for this to vary depending on the exact temperature, plus whether or not the liquid has been strained.",
        "An unstrained mixture should ferment in 12 to 24 hours.",
        "Strained liquid will take between 24 and 48 hours.",
        "Higher room temperatures will reduce the amount of time needed.",
        "Boil the water.",
        "First, strain the liquid if you haven’t already done so.",
        "Transfer the liquid to a pot or saucepan.",
        "Raise the heat to medium-high.",
        "Bring the water to a boil to cease the fermentation.",
        "Boiling the water after fermentation is often recommended, but not strictly required.",
        "Use or store your rice water.",
        "If you intend to use it right away, allow the water to cool first to avoid scalding.",
        "Otherwise, transfer it to a sealable container.",
        "Store in the refrigerator.",
        "Expect fermented water to pack a punch.",
        "Dilute the fermented rice water with plain warm water as desired when you use it.",
        "Using Rice Water Drink for medicinal purposes.",
        "Relieve stomach cramps and inflammation by lining your stomach with a protective coating.",
        "Alleviate diarrhea and replenish fluids by drinking two or three cups a day.",
        "Cure and avert constipation by doing the same.",
        "For purely medicinal purposes (as opposed to a yummy beverage), the only ingredients you need are the rice and water.",
        "All others are strictly for flavor.",
        "Clean and tone your skin.",
        "Apply small dabs to your skin.",
        "Rub it gently in for a minute or two.",
        "Then move onto the next area.",
        "Do so as part of your regular daily routine.",
        "Rice water has been shown to:\nRelieve inflammations.",
        "Reduce age spots.",
        "Moisturize skin.",
        "Enhance blood circulation.",
        "Shrink pores.",
        "Rinse your hair.",
        "First, wash your hair with your regular shampoo.",
        "After rinsing that out, soak your hair with rice water.",
        "Softly rub it into your hair and scalp.",
        "Let it sit anywhere between four and twenty minutes before rinsing with plain, clean water.",
        "Rice water can build up in your hair, though, so limit yourself to one weekly application.",
        "Benefits include:\nReduces friction between hairs.",
        "Makes hair more elastic and smooth.",
        "Strengthens and protects hair even after rinsing.",
        "Increases volume and sheen."
    ]
}