{
    "title": "How to Sleep on the Floor",
    "url": "https://www.wikihow.com/Sleep-on-the-Floor",
    "category_hierarchy": [
        "Health",
        "Sleep Health",
        "Sleeping Environment"
    ],
    "parts": [
        {
            "name": "Setting up a Bed",
            "steps": [
                {
                    "headline": "Choose a carpeted spot if this is your first time sleeping on the ground.",
                    "description": "Soft carpeting and rugs feel warmer than other surfaces and provide more cushioning. Using these surfaces is somewhat similar to laying on a mattress. You will most likely have an easier time falling asleep and experience less stiffness when you wake up. Sleeping on a hard surface is possible if you don’t have any other choice. It isn’t very different from sleeping on carpeting, but take extra time to prepare your bedding."
                },
                {
                    "headline": "Lay a thick sheet or mat on the ground.",
                    "description": "Pick something that will give you a lot of cushioning, such as a quilt or sleeping back. If you don’t have anything thick enough, stack a couple of blankets together. Test your sleeping pad out to make sure it provides plenty of support for your back. In some parts of the world, people sleep on the ground using insulated mats. Tatami mats are great for repeated use, but massage mats, futons, and even yoga mats also work. EXPERT TIP\tIf you have pressure spots and you're constantly shifting, it will cause you to wake up during the night, so you won't get good sleep. Alex Dimitriu, MD\t\t\t\t\tSleep Medicine and Psychiatry Professional\t\t\t\t\t\t\t\tAlex Dimitriu, MD is the Owner of Menlo Park Psychiatry and Sleep Medicine, a clinic based in the San Francisco Bay Area with expertise in psychiatry, sleep, and transformational therapy. Alex earned his Doctor of Medicine from Stony Brook University in 2005 and graduated from the Stanford University School of Medicine's Sleep Medicine Residency Program in 2010. Professionally, Alex has dual board certification in psychiatry and sleep medicine. Alex Dimitriu, MDSleep Medicine and Psychiatry Professional"
                },
                {
                    "headline": "Place a thin, soft pillow at the end of the bed.",
                    "description": "You only need 1 good pillow. Choose a pillow that feels comfortable when you lay on it. Make sure it’s thin so it doesn’t lift your head too much. If it raises your head too much, it forces your neck and back out of alignment, which you will feel in the morning. Stacking pillows isn’t recommended since it has the same effect as using a thick pillow. Stack pillows only if doing so makes you feel more comfortable while you sleep. If you ever find yourself without a good pillow, your arm doubles as one. It isn’t the most comfortable position to be in, but it works in a pinch."
                },
                {
                    "headline": "Get a warm blanket to cover yourself at night.",
                    "description": "Once you have your base set up, complete your bed with some top layers. What you need depends on how warm you feel. Floors are often much colder than a mattress, so plan on having at least 1 warm blanket or thick comforter. Don’t underestimate sleeping bags. They are a source of warmth and comfort whether you’re out in the wilderness or at a sleepover."
                },
                {
                    "headline": "Bring a second pillow to cushion your joints from the ground.",
                    "description": "Now is when you bring in the thicker pillows. Identify any spots where you feel uncomfortable against the ground. The most common spots are the knees and hips. Slide the pillow underneath you for extra cushioning. Be careful not to lift your body too much. Slide the edge of the pillow underneath the part you need to cushion. Make sure your body is aligned with your head to protect your spine."
                }
            ]
        },
        {
            "name": "Getting into the Bed",
            "steps": [
                {
                    "headline": "Tuck the pillow in the crook between your head and shoulder.",
                    "description": "Lay down on your side with your head near the pillow. Pull the pillow towards you so it’s firmly against your shoulder. Then, place your head on the pillow, double-checking to see how your body feels. Make sure your head is lifted slightly off the ground with your spine curved naturally. This is a basic starting position. If you’re more of a back or stomach sleeper, turn over after you get settled."
                },
                {
                    "headline": "Drape your arm around the pillow to hold it in place.",
                    "description": "Sometimes the pillow or bedding slips out of place on bare floors. While you’re turned to 1 side, bring your arm up and around the pillow. Your arm provides some stability, allowing you to move without having to rearrange your bedding each time. Move your arms into a more comfortable position when you’re finished setting up. To sleep on your stomach, keep your arm in the same position. Bring your other arm up to the pillow’s other side. If you sleep on your back, bring your arms back down to your sides after you turn onto your back."
                },
                {
                    "headline": "Lie on your back to support the natural curve of your body.",
                    "description": "Lying on your back braces your spine against the floor, keeping your back, neck, and shoulders aligned. Because of this, it is often the easiest way to get comfortable. The downside is that the floor puts more pressure on your joints, which leads to pain sometimes. Reduce the possibility of soreness with pillows. In this position, you benefit from having a pillow underneath your knees. Sleeping position is a personal preference, so the back position isn’t for everyone. If you’re unsure how you should lie down, ask a doctor or sleep expert for advice."
                },
                {
                    "headline": "Go onto your side or stomach if you feel more comfortable there.",
                    "description": "Roll over and adjust your position so your body is straight, aligned with your head. Both the side and stomach positions lack some back support. With proper precautions, these positions sometimes reduce the amount of back pain you get from sleeping on the floor. For side sleeping, pull your knees up towards your chest a little. Place a pillow between them to separate them, then consider having another cushion underneath your waist. If you sleep on your stomach, plan on placing a cushion underneath your stomach."
                },
                {
                    "headline": "Place a second pillow underneath or between your knees.",
                    "description": "Use your free hand to move the pillow to where you need to brace your body the most. Settle most discomfort by giving your knees more support. Shift the pillow around until you feel comfortable enough to go to sleep. If you are on your side, slide the pillow between your knees to prevent them from touching. Bring the pillow’s other end up towards your chest. Use it to raise up your chest as needed. When you’re on your back or stomach, put the pillow underneath both your knees to prevent them from pressing against the ground. Doing this lifts your lower half up a little to keep your spine in alignment."
                }
            ]
        },
        {
            "name": "Preventing Soreness",
            "steps": [
                {
                    "headline": "Set small cushions under your joints to protect them.",
                    "description": "The most common spots of soreness you get while sleeping on the ground are joints like your tailbone, shoulder blades, and hips. Place a small pillow or folded towel wherever you feel uncomfortable. The additional cushioning often makes the difference between a good night’s sleep and an achy morning. Using extra cushioning is valuable when you’re used to sleeping on a mattress. Joint aches decrease the more you get accustomed to being on the floor."
                },
                {
                    "headline": "Add more layering underneath you to get more used to sleeping on the floor.",
                    "description": "If you plan on sleeping on the floor more than once, take it slow. Set out a few layers of blankets to make your body feel like it’s on a mattress. Put down as much cushioning as you need to get through the night. To get more used to sleeping on the floor, remove some of the blankets every few nights. Eventually, you will be able to sleep on the floor with the bare minimum in cushioning."
                },
                {
                    "headline": "Start on a mattress and move to the floor if you still feel sore.",
                    "description": "Get more accustomed to sleeping on the floor by gradually reducing your time on a mattress. Set an alarm for about 2 hours before you have to get up. Move to the floor when your alarm goes off. Most of the time, you will be so tired you fall asleep right away. It’s all about getting used to the experience. Sleeping on the floor feels different than sleeping on a soft mattress. Gradually spend more of the night on the floor to reduce the soreness."
                },
                {
                    "headline": "Practice sleeping on the floor for longer periods of time.",
                    "description": "Practice is the only way to get more comfortable with sleeping on the floor. You most likely will feel uncomfortable or even sore at first. The pain goes away the more you practice. If you have a big event, like a sleepover or camping trip, try practicing at home so you are better able to get through the night. Get the gear you plan on bringing to your event, such as a good blanket, your favorite pillow, or a sleeping bag."
                }
            ]
        }
    ],
    "tyn": [
        "Sleeping pad or mat",
        "Blankets",
        "Thin pillow",
        "Small pillows or folded blankets"
    ],
    "text": " Setting up a Bed Choose a carpeted spot if this is your first time sleeping on the ground. Soft carpeting and rugs feel warmer than other surfaces and provide more cushioning. Using these surfaces is somewhat similar to laying on a mattress. You will most likely have an easier time falling asleep and experience less stiffness when you wake up. Sleeping on a hard surface is possible if you don’t have any other choice. It isn’t very different from sleeping on carpeting, but take extra time to prepare your bedding. Lay a thick sheet or mat on the ground. Pick something that will give you a lot of cushioning, such as a quilt or sleeping back. If you don’t have anything thick enough, stack a couple of blankets together. Test your sleeping pad out to make sure it provides plenty of support for your back. In some parts of the world, people sleep on the ground using insulated mats. Tatami mats are great for repeated use, but massage mats, futons, and even yoga mats also work. EXPERT TIP\tIf you have pressure spots and you're constantly shifting, it will cause you to wake up during the night, so you won't get good sleep. Alex Dimitriu, MD\t\t\t\t\tSleep Medicine and Psychiatry Professional\t\t\t\t\t\t\t\tAlex Dimitriu, MD is the Owner of Menlo Park Psychiatry and Sleep Medicine, a clinic based in the San Francisco Bay Area with expertise in psychiatry, sleep, and transformational therapy. Alex earned his Doctor of Medicine from Stony Brook University in 2005 and graduated from the Stanford University School of Medicine's Sleep Medicine Residency Program in 2010. Professionally, Alex has dual board certification in psychiatry and sleep medicine. Alex Dimitriu, MDSleep Medicine and Psychiatry Professional Place a thin, soft pillow at the end of the bed. You only need 1 good pillow. Choose a pillow that feels comfortable when you lay on it. Make sure it’s thin so it doesn’t lift your head too much. If it raises your head too much, it forces your neck and back out of alignment, which you will feel in the morning. Stacking pillows isn’t recommended since it has the same effect as using a thick pillow. Stack pillows only if doing so makes you feel more comfortable while you sleep. If you ever find yourself without a good pillow, your arm doubles as one. It isn’t the most comfortable position to be in, but it works in a pinch. Get a warm blanket to cover yourself at night. Once you have your base set up, complete your bed with some top layers. What you need depends on how warm you feel. Floors are often much colder than a mattress, so plan on having at least 1 warm blanket or thick comforter. Don’t underestimate sleeping bags. They are a source of warmth and comfort whether you’re out in the wilderness or at a sleepover. Bring a second pillow to cushion your joints from the ground. Now is when you bring in the thicker pillows. Identify any spots where you feel uncomfortable against the ground. The most common spots are the knees and hips. Slide the pillow underneath you for extra cushioning. Be careful not to lift your body too much. Slide the edge of the pillow underneath the part you need to cushion. Make sure your body is aligned with your head to protect your spine. Getting into the Bed Tuck the pillow in the crook between your head and shoulder. Lay down on your side with your head near the pillow. Pull the pillow towards you so it’s firmly against your shoulder. Then, place your head on the pillow, double-checking to see how your body feels. Make sure your head is lifted slightly off the ground with your spine curved naturally. This is a basic starting position. If you’re more of a back or stomach sleeper, turn over after you get settled. Drape your arm around the pillow to hold it in place. Sometimes the pillow or bedding slips out of place on bare floors. While you’re turned to 1 side, bring your arm up and around the pillow. Your arm provides some stability, allowing you to move without having to rearrange your bedding each time. Move your arms into a more comfortable position when you’re finished setting up. To sleep on your stomach, keep your arm in the same position. Bring your other arm up to the pillow’s other side. If you sleep on your back, bring your arms back down to your sides after you turn onto your back. Lie on your back to support the natural curve of your body. Lying on your back braces your spine against the floor, keeping your back, neck, and shoulders aligned. Because of this, it is often the easiest way to get comfortable. The downside is that the floor puts more pressure on your joints, which leads to pain sometimes. Reduce the possibility of soreness with pillows. In this position, you benefit from having a pillow underneath your knees. Sleeping position is a personal preference, so the back position isn’t for everyone. If you’re unsure how you should lie down, ask a doctor or sleep expert for advice. Go onto your side or stomach if you feel more comfortable there. Roll over and adjust your position so your body is straight, aligned with your head. Both the side and stomach positions lack some back support. With proper precautions, these positions sometimes reduce the amount of back pain you get from sleeping on the floor. For side sleeping, pull your knees up towards your chest a little. Place a pillow between them to separate them, then consider having another cushion underneath your waist. If you sleep on your stomach, plan on placing a cushion underneath your stomach. Place a second pillow underneath or between your knees. Use your free hand to move the pillow to where you need to brace your body the most. Settle most discomfort by giving your knees more support. Shift the pillow around until you feel comfortable enough to go to sleep. If you are on your side, slide the pillow between your knees to prevent them from touching. Bring the pillow’s other end up towards your chest. Use it to raise up your chest as needed. When you’re on your back or stomach, put the pillow underneath both your knees to prevent them from pressing against the ground. Doing this lifts your lower half up a little to keep your spine in alignment. Preventing Soreness Set small cushions under your joints to protect them. The most common spots of soreness you get while sleeping on the ground are joints like your tailbone, shoulder blades, and hips. Place a small pillow or folded towel wherever you feel uncomfortable. The additional cushioning often makes the difference between a good night’s sleep and an achy morning. Using extra cushioning is valuable when you’re used to sleeping on a mattress. Joint aches decrease the more you get accustomed to being on the floor. Add more layering underneath you to get more used to sleeping on the floor. If you plan on sleeping on the floor more than once, take it slow. Set out a few layers of blankets to make your body feel like it’s on a mattress. Put down as much cushioning as you need to get through the night. To get more used to sleeping on the floor, remove some of the blankets every few nights. Eventually, you will be able to sleep on the floor with the bare minimum in cushioning. Start on a mattress and move to the floor if you still feel sore. Get more accustomed to sleeping on the floor by gradually reducing your time on a mattress. Set an alarm for about 2 hours before you have to get up. Move to the floor when your alarm goes off. Most of the time, you will be so tired you fall asleep right away. It’s all about getting used to the experience. Sleeping on the floor feels different than sleeping on a soft mattress. Gradually spend more of the night on the floor to reduce the soreness. Practice sleeping on the floor for longer periods of time. Practice is the only way to get more comfortable with sleeping on the floor. You most likely will feel uncomfortable or even sore at first. The pain goes away the more you practice. If you have a big event, like a sleepover or camping trip, try practicing at home so you are better able to get through the night. Get the gear you plan on bringing to your event, such as a good blanket, your favorite pillow, or a sleeping bag.",
    "sentences": [
        " Setting up a Bed Choose a carpeted spot if this is your first time sleeping on the ground.",
        "Soft carpeting and rugs feel warmer than other surfaces and provide more cushioning.",
        "Using these surfaces is somewhat similar to laying on a mattress.",
        "You will most likely have an easier time falling asleep and experience less stiffness when you wake up.",
        "Sleeping on a hard surface is possible if you don’t have any other choice.",
        "It isn’t very different from sleeping on carpeting, but take extra time to prepare your bedding.",
        "Lay a thick sheet or mat on the ground.",
        "Pick something that will give you a lot of cushioning, such as a quilt or sleeping back.",
        "If you don’t have anything thick enough, stack a couple of blankets together.",
        "Test your sleeping pad out to make sure it provides plenty of support for your back.",
        "In some parts of the world, people sleep on the ground using insulated mats.",
        "Tatami mats are great for repeated use, but massage mats, futons, and even yoga mats also work.",
        "EXPERT TIP\tIf you have pressure spots and you're constantly shifting, it will cause you to wake up during the night, so you won't get good sleep.",
        "Alex Dimitriu, MD\t\t\t\t\tSleep Medicine and Psychiatry Professional\t\t\t\t\t\t\t\tAlex Dimitriu, MD is the Owner of Menlo Park Psychiatry and Sleep Medicine, a clinic based in the San Francisco Bay Area with expertise in psychiatry, sleep, and transformational therapy.",
        "Alex earned his Doctor of Medicine from Stony Brook University in 2005 and graduated from the Stanford University School of Medicine's Sleep Medicine Residency Program in 2010.",
        "Professionally, Alex has dual board certification in psychiatry and sleep medicine.",
        "Alex Dimitriu, MDSleep Medicine and Psychiatry Professional Place a thin, soft pillow at the end of the bed.",
        "You only need 1 good pillow.",
        "Choose a pillow that feels comfortable when you lay on it.",
        "Make sure it’s thin so it doesn’t lift your head too much.",
        "If it raises your head too much, it forces your neck and back out of alignment, which you will feel in the morning.",
        "Stacking pillows isn’t recommended since it has the same effect as using a thick pillow.",
        "Stack pillows only if doing so makes you feel more comfortable while you sleep.",
        "If you ever find yourself without a good pillow, your arm doubles as one.",
        "It isn’t the most comfortable position to be in, but it works in a pinch.",
        "Get a warm blanket to cover yourself at night.",
        "Once you have your base set up, complete your bed with some top layers.",
        "What you need depends on how warm you feel.",
        "Floors are often much colder than a mattress, so plan on having at least 1 warm blanket or thick comforter.",
        "Don’t underestimate sleeping bags.",
        "They are a source of warmth and comfort whether you’re out in the wilderness or at a sleepover.",
        "Bring a second pillow to cushion your joints from the ground.",
        "Now is when you bring in the thicker pillows.",
        "Identify any spots where you feel uncomfortable against the ground.",
        "The most common spots are the knees and hips.",
        "Slide the pillow underneath you for extra cushioning.",
        "Be careful not to lift your body too much.",
        "Slide the edge of the pillow underneath the part you need to cushion.",
        "Make sure your body is aligned with your head to protect your spine.",
        "Getting into the Bed Tuck the pillow in the crook between your head and shoulder.",
        "Lay down on your side with your head near the pillow.",
        "Pull the pillow towards you so it’s firmly against your shoulder.",
        "Then, place your head on the pillow, double-checking to see how your body feels.",
        "Make sure your head is lifted slightly off the ground with your spine curved naturally.",
        "This is a basic starting position.",
        "If you’re more of a back or stomach sleeper, turn over after you get settled.",
        "Drape your arm around the pillow to hold it in place.",
        "Sometimes the pillow or bedding slips out of place on bare floors.",
        "While you’re turned to 1 side, bring your arm up and around the pillow.",
        "Your arm provides some stability, allowing you to move without having to rearrange your bedding each time.",
        "Move your arms into a more comfortable position when you’re finished setting up.",
        "To sleep on your stomach, keep your arm in the same position.",
        "Bring your other arm up to the pillow’s other side.",
        "If you sleep on your back, bring your arms back down to your sides after you turn onto your back.",
        "Lie on your back to support the natural curve of your body.",
        "Lying on your back braces your spine against the floor, keeping your back, neck, and shoulders aligned.",
        "Because of this, it is often the easiest way to get comfortable.",
        "The downside is that the floor puts more pressure on your joints, which leads to pain sometimes.",
        "Reduce the possibility of soreness with pillows.",
        "In this position, you benefit from having a pillow underneath your knees.",
        "Sleeping position is a personal preference, so the back position isn’t for everyone.",
        "If you’re unsure how you should lie down, ask a doctor or sleep expert for advice.",
        "Go onto your side or stomach if you feel more comfortable there.",
        "Roll over and adjust your position so your body is straight, aligned with your head.",
        "Both the side and stomach positions lack some back support.",
        "With proper precautions, these positions sometimes reduce the amount of back pain you get from sleeping on the floor.",
        "For side sleeping, pull your knees up towards your chest a little.",
        "Place a pillow between them to separate them, then consider having another cushion underneath your waist.",
        "If you sleep on your stomach, plan on placing a cushion underneath your stomach.",
        "Place a second pillow underneath or between your knees.",
        "Use your free hand to move the pillow to where you need to brace your body the most.",
        "Settle most discomfort by giving your knees more support.",
        "Shift the pillow around until you feel comfortable enough to go to sleep.",
        "If you are on your side, slide the pillow between your knees to prevent them from touching.",
        "Bring the pillow’s other end up towards your chest.",
        "Use it to raise up your chest as needed.",
        "When you’re on your back or stomach, put the pillow underneath both your knees to prevent them from pressing against the ground.",
        "Doing this lifts your lower half up a little to keep your spine in alignment.",
        "Preventing Soreness Set small cushions under your joints to protect them.",
        "The most common spots of soreness you get while sleeping on the ground are joints like your tailbone, shoulder blades, and hips.",
        "Place a small pillow or folded towel wherever you feel uncomfortable.",
        "The additional cushioning often makes the difference between a good night’s sleep and an achy morning.",
        "Using extra cushioning is valuable when you’re used to sleeping on a mattress.",
        "Joint aches decrease the more you get accustomed to being on the floor.",
        "Add more layering underneath you to get more used to sleeping on the floor.",
        "If you plan on sleeping on the floor more than once, take it slow.",
        "Set out a few layers of blankets to make your body feel like it’s on a mattress.",
        "Put down as much cushioning as you need to get through the night.",
        "To get more used to sleeping on the floor, remove some of the blankets every few nights.",
        "Eventually, you will be able to sleep on the floor with the bare minimum in cushioning.",
        "Start on a mattress and move to the floor if you still feel sore.",
        "Get more accustomed to sleeping on the floor by gradually reducing your time on a mattress.",
        "Set an alarm for about 2 hours before you have to get up.",
        "Move to the floor when your alarm goes off.",
        "Most of the time, you will be so tired you fall asleep right away.",
        "It’s all about getting used to the experience.",
        "Sleeping on the floor feels different than sleeping on a soft mattress.",
        "Gradually spend more of the night on the floor to reduce the soreness.",
        "Practice sleeping on the floor for longer periods of time.",
        "Practice is the only way to get more comfortable with sleeping on the floor.",
        "You most likely will feel uncomfortable or even sore at first.",
        "The pain goes away the more you practice.",
        "If you have a big event, like a sleepover or camping trip, try practicing at home so you are better able to get through the night.",
        "Get the gear you plan on bringing to your event, such as a good blanket, your favorite pillow, or a sleeping bag."
    ]
}