{
    "title": "How to Re Fuse a Power Supply",
    "url": "https://www.wikihow.com/Re-Fuse-a-Power-Supply",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Electrical Maintenance",
        "Electrical Wiring and Safety Switches"
    ],
    "steps": [
        {
            "headline": "Unplug the Power Supply.",
            "description": "Switch off the socket that is connected to the power supply. Unplug the line voltage power cord from the socket."
        },
        {
            "headline": "Open and Unplug the CPU: Use a torx screwdriver to remove the torx screws of the CPU.",
            "description": "Remove the CPU casing. Unplug the low voltage cables that are connected to the drives and motherboard. Remove any CPU cards that may obstruct your view of the power supply."
        },
        {
            "headline": "Unscrew the Power Supply.",
            "description": "Generally, the power supply is held in place by 4 torx screws. Unscrew them using the torx screwdriver and remove the power supply from the CPU."
        },
        {
            "headline": "Check the Warranty.",
            "description": "The warranty is a stamped sticker that is on one of the edges of the power supply. It consists of the warranty date, a bar code and a ‘pass’ stamp. If the warranty has expired, cut across the sticker safety seal and open the power supply case."
        },
        {
            "headline": "Examine the Fuse.",
            "description": "The fuse is usually located on one corner of the power supply. Use an ohm meter to check the fuse. If the ohm meter is showing readings below 0.1 ohms, or if there is resistance on the meter, then you will know that the fuse has blown."
        },
        {
            "headline": "Charge the Soldering Iron.",
            "description": "Plug in the soldering iron and heat it to about 700 degrees. Touch the tip of the soldering iron to the tin wires on either side of the fuse. As the solder softens, gently push the fuse away from the circuit board. Once the soldering is complete, you can remove the fuse."
        },
        {
            "headline": "Solder New Pins to the New Fuse.",
            "description": "Buff each end of the fuse with emery paper to dull the plating. Take the six inch long stripped 24 gauge wire with flux and tin it with resin solder. Tin the ends of the fuse, after which you can solder the wires to the ends."
        },
        {
            "headline": "Trim the Wires and Circuit Board Pins.",
            "description": "Use the wire cutter to remove any excess pins from the board. Also, cut the gauge wire with only an inch of space from the fuse joint."
        },
        {
            "headline": "Solder the New Fuse.",
            "description": "Place the new fuse onto the circuit board and solder it into place with the soldering iron. Once this has been completed, use the ohmmeter to test the fuse."
        },
        {
            "headline": "Reinstall the CPU.",
            "description": "Once the fuse is showing good readings on the ohmmeter, close the power supply case. Keep it back into the CPU and screw it in. Replace the CPU casing and plug it in for use."
        }
    ],
    "tyn": [
        "Torx screwdriver",
        "Ohmmeter",
        "Soldering iron",
        "Emery paper",
        "24 gauge wire",
        "Resin solder",
        "Wire cutter"
    ],
    "text": " Unplug the Power Supply. Switch off the socket that is connected to the power supply. Unplug the line voltage power cord from the socket. Open and Unplug the CPU: Use a torx screwdriver to remove the torx screws of the CPU. Remove the CPU casing. Unplug the low voltage cables that are connected to the drives and motherboard. Remove any CPU cards that may obstruct your view of the power supply. Unscrew the Power Supply. Generally, the power supply is held in place by 4 torx screws. Unscrew them using the torx screwdriver and remove the power supply from the CPU. Check the Warranty. The warranty is a stamped sticker that is on one of the edges of the power supply. It consists of the warranty date, a bar code and a ‘pass’ stamp. If the warranty has expired, cut across the sticker safety seal and open the power supply case. Examine the Fuse. The fuse is usually located on one corner of the power supply. Use an ohm meter to check the fuse. If the ohm meter is showing readings below 0.1 ohms, or if there is resistance on the meter, then you will know that the fuse has blown. Charge the Soldering Iron. Plug in the soldering iron and heat it to about 700 degrees. Touch the tip of the soldering iron to the tin wires on either side of the fuse. As the solder softens, gently push the fuse away from the circuit board. Once the soldering is complete, you can remove the fuse. Solder New Pins to the New Fuse. Buff each end of the fuse with emery paper to dull the plating. Take the six inch long stripped 24 gauge wire with flux and tin it with resin solder. Tin the ends of the fuse, after which you can solder the wires to the ends. Trim the Wires and Circuit Board Pins. Use the wire cutter to remove any excess pins from the board. Also, cut the gauge wire with only an inch of space from the fuse joint. Solder the New Fuse. Place the new fuse onto the circuit board and solder it into place with the soldering iron. Once this has been completed, use the ohmmeter to test the fuse. Reinstall the CPU. Once the fuse is showing good readings on the ohmmeter, close the power supply case. Keep it back into the CPU and screw it in. Replace the CPU casing and plug it in for use.",
    "sentences": [
        " Unplug the Power Supply.",
        "Switch off the socket that is connected to the power supply.",
        "Unplug the line voltage power cord from the socket.",
        "Open and Unplug the CPU: Use a torx screwdriver to remove the torx screws of the CPU.",
        "Remove the CPU casing.",
        "Unplug the low voltage cables that are connected to the drives and motherboard.",
        "Remove any CPU cards that may obstruct your view of the power supply.",
        "Unscrew the Power Supply.",
        "Generally, the power supply is held in place by 4 torx screws.",
        "Unscrew them using the torx screwdriver and remove the power supply from the CPU.",
        "Check the Warranty.",
        "The warranty is a stamped sticker that is on one of the edges of the power supply.",
        "It consists of the warranty date, a bar code and a ‘pass’ stamp.",
        "If the warranty has expired, cut across the sticker safety seal and open the power supply case.",
        "Examine the Fuse.",
        "The fuse is usually located on one corner of the power supply.",
        "Use an ohm meter to check the fuse.",
        "If the ohm meter is showing readings below 0.1 ohms, or if there is resistance on the meter, then you will know that the fuse has blown.",
        "Charge the Soldering Iron.",
        "Plug in the soldering iron and heat it to about 700 degrees.",
        "Touch the tip of the soldering iron to the tin wires on either side of the fuse.",
        "As the solder softens, gently push the fuse away from the circuit board.",
        "Once the soldering is complete, you can remove the fuse.",
        "Solder New Pins to the New Fuse.",
        "Buff each end of the fuse with emery paper to dull the plating.",
        "Take the six inch long stripped 24 gauge wire with flux and tin it with resin solder.",
        "Tin the ends of the fuse, after which you can solder the wires to the ends.",
        "Trim the Wires and Circuit Board Pins.",
        "Use the wire cutter to remove any excess pins from the board.",
        "Also, cut the gauge wire with only an inch of space from the fuse joint.",
        "Solder the New Fuse.",
        "Place the new fuse onto the circuit board and solder it into place with the soldering iron.",
        "Once this has been completed, use the ohmmeter to test the fuse.",
        "Reinstall the CPU.",
        "Once the fuse is showing good readings on the ohmmeter, close the power supply case.",
        "Keep it back into the CPU and screw it in.",
        "Replace the CPU casing and plug it in for use."
    ]
}