{
    "title": "How to Make Multi Colored Candles Using Crayons",
    "url": "https://www.wikihow.com/Make-Multi-Colored-Candles-Using-Crayons",
    "category_hierarchy": [
        "Home and Garden",
        "Lighting",
        "Candles"
    ],
    "steps": [
        {
            "headline": "Pour 1 tbsp.",
            "description": "of wax into Dixie cup. Microwave cup for approximately 15 seconds and stir to integrate and melt wax."
        },
        {
            "headline": "Pour a small amount of wax into the glass jar.",
            "description": "Place the votive on the bottom of the jar and add wick. Hold in place until wax hardens (should take only a few minutes)."
        },
        {
            "headline": "Remove paper from crayons and break into pieces.",
            "description": "Bundle same color crayons together. For smaller votives, you will only need one crayon per jar."
        },
        {
            "headline": "Fill Dixie cup 2/3 way with wax and broken with crayon (same color).",
            "description": "Microwave for approximately 2 minutes. Remove cup, stir and re-heat for up to 2 minutes or until wax is melted."
        },
        {
            "headline": "Pour first color of wax into jar(s) and allow to cool for up to 30 minutes.",
            "description": "Make sure you don’t over pour so you leave enough room for other colors."
        },
        {
            "headline": "Melt and combine wax and new crayon color for next layer.",
            "description": "As the wax/crayon dries, prepare the next layer. Consider waiting until the layer is nearly dry so your wax is melted and ready to go."
        },
        {
            "headline": "Depending on how many colors you'd like in your candle, keep adding layers of wax.",
            "description": ""
        },
        {
            "headline": "Add the last/final color.",
            "description": "This will provide your candle with a flat, even top. Allow at least an hour for dry time and then trim wick before lighting."
        },
        {
            "headline": "Finished.",
            "description": ""
        }
    ],
    "tyn": [
        "Several of the same colored crayons",
        "Scented soy wax",
        "Long wick(s)",
        "Votives (aluminum bottoms)",
        "Dixie cups",
        "Glass jars",
        "Plate or cookbook stand"
    ],
    "text": " Pour 1 tbsp. of wax into Dixie cup. Microwave cup for approximately 15 seconds and stir to integrate and melt wax. Pour a small amount of wax into the glass jar. Place the votive on the bottom of the jar and add wick. Hold in place until wax hardens (should take only a few minutes). Remove paper from crayons and break into pieces. Bundle same color crayons together. For smaller votives, you will only need one crayon per jar. Fill Dixie cup 2/3 way with wax and broken with crayon (same color). Microwave for approximately 2 minutes. Remove cup, stir and re-heat for up to 2 minutes or until wax is melted. Pour first color of wax into jar(s) and allow to cool for up to 30 minutes. Make sure you don’t over pour so you leave enough room for other colors. Melt and combine wax and new crayon color for next layer. As the wax/crayon dries, prepare the next layer. Consider waiting until the layer is nearly dry so your wax is melted and ready to go. Depending on how many colors you'd like in your candle, keep adding layers of wax.  Add the last/final color. This will provide your candle with a flat, even top. Allow at least an hour for dry time and then trim wick before lighting. Finished. ",
    "sentences": [
        " Pour 1 tbsp.",
        "of wax into Dixie cup.",
        "Microwave cup for approximately 15 seconds and stir to integrate and melt wax.",
        "Pour a small amount of wax into the glass jar.",
        "Place the votive on the bottom of the jar and add wick.",
        "Hold in place until wax hardens (should take only a few minutes).",
        "Remove paper from crayons and break into pieces.",
        "Bundle same color crayons together.",
        "For smaller votives, you will only need one crayon per jar.",
        "Fill Dixie cup 2/3 way with wax and broken with crayon (same color).",
        "Microwave for approximately 2 minutes.",
        "Remove cup, stir and re-heat for up to 2 minutes or until wax is melted.",
        "Pour first color of wax into jar(s) and allow to cool for up to 30 minutes.",
        "Make sure you don’t over pour so you leave enough room for other colors.",
        "Melt and combine wax and new crayon color for next layer.",
        "As the wax/crayon dries, prepare the next layer.",
        "Consider waiting until the layer is nearly dry so your wax is melted and ready to go.",
        "Depending on how many colors you'd like in your candle, keep adding layers of wax.",
        "Add the last/final color.",
        "This will provide your candle with a flat, even top.",
        "Allow at least an hour for dry time and then trim wick before lighting.",
        "Finished."
    ]
}