{
    "title": "How to Embroider on Crochet",
    "url": "https://www.wikihow.com/Embroider-on-Crochet",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Embroidery"
    ],
    "methods": [
        {
            "name": "Method One: Surface Slip Stitch[1]\n\tX\n\t\tResearch source\n\t\t\n[2]\n\tX\n\t\tResearch source",
            "steps": [
                {
                    "headline": "Knot the yarn onto a crochet hook.",
                    "description": "Attach the yarn you want to use for your embroidery to a crochet hook using a standard slipknot. The crochet hook should be approximately the same size hook used to make the crochet work you are embroidering into. To make a slipknot:\nForm a loop by crossing the loose end of the yarn under the attached end. Grab the attached side and pull it up through the loop, creating a second loop in the process. Tighten the first loop around the second. Insert the hook into the second loop and tighten the second loop onto the hook."
                },
                {
                    "headline": "Pull the loop to the front of the work.",
                    "description": "Carefully remove the slipknot from the hook. Place the loop behind the crochet piece, then insert the hook into the nearest gap and grab onto the loop. Pull the loop of the slipknot through the front of the work. The knot itself must stay at the back of the project. The point at which you work here should be the same point at which you want the embroidery to start."
                },
                {
                    "headline": "Insert the hook into the work from the front.",
                    "description": "With the slipknot loop still on your hook, insert the hook through the gap lying after the adjacent stitch. This can be the next stitch to the right, left, top, or bottom. It could even be a stitch situated diagonally from your current space. The \"next\" stitch is simply the nearest stitch you need to complete your embroidery design. This step starts one surface slip stitch."
                },
                {
                    "headline": "Pull a loop through to the front.",
                    "description": "At the back of the work, wrap the yarn around the hook in a counterclockwise motion. Pull this loop of yarn back through to the front of the project. This step continues the slip stitch process but does not end it."
                },
                {
                    "headline": "Pull the second loop through the first.",
                    "description": "Pull the new loop you just created through the original slipknot loop, letting the slipknot loop drop off the hook in the process. The new loop should now be the only loop on your hook. This step completes one surface slip stitch. Consider holding the knot or base of the slipknot in place at the back of the piece as you create this first slip stitch. Doing so can help keep the stitch straight, neat, and tight."
                },
                {
                    "headline": "Slip stitch into the next stitch.",
                    "description": "Create a second slip stitch using the same technique used to work the first. Insert the hook into the gap after the next stitch in the pattern, keeping the loop on the hook as you work. Yarn over the hook from the back of the work, wrapping counterclockwise. Pull this yarn-over back through the to the front of  the work and through the loop on your hook. The previous loop should drop off and a new loop should be left on your hook."
                },
                {
                    "headline": "Repeat this slip stitch as needed.",
                    "description": "Continue making slip stitches in the same manner until you complete your desired embroidery pattern."
                },
                {
                    "headline": "Insert the hook from the back.",
                    "description": "After making the last stitch of your design, carefully remove the hook from the working loop. Re-insert the hook from the back of the work, picking up the working loop in the process and drawing it to the back. Make sure that the working loop stays open when you remove the hook."
                },
                {
                    "headline": "Fasten off the yarn.",
                    "description": "Cut the yarn, leaving a tail roughly 3 inches (7.6 cm) long. Pull this tail through the working loop on your hook, dropping the loop in the process and securing the yarn. Weave the excess tail into the back of the work, hiding it behind the surface slip stitch embroidery at the front. Doing so makes the embroidery more secure and hides the excess yarn."
                }
            ]
        },
        {
            "name": "Method Two: Running Stitch[3]\n\tX\n\t\tResearch source",
            "steps": [
                {
                    "headline": "Thread the yarn needle.",
                    "description": "Weave one end of the yarn through the eye of a large yarn needle. Do not knot the yarn onto the needle. Instead of knotting the yarn in place, you should pull a tail approximately 4 inches (10 cm) through the eye. Press this tail against the eye of the needle as you work to hold the yarn steady and in place. If the yarn starts working its way out of the needle as you embroider, simply pull it back through and continue working."
                },
                {
                    "headline": "Knot the other end of the yarn.",
                    "description": "Cut a length of yarn long enough for your project. Tie a large knot at the newly cut, unattached end of the yarn. The yarn should be a little longer than the total length of the finished embroidery design. You do not need to use a slipknot. A standard overhand knot will work just fine. Make sure that the knot you tie is larger than the gaps in between your crochet stitches. A large knot will help prevent the embroidery from unraveling."
                },
                {
                    "headline": "Bring the yarn up from the back.",
                    "description": "Poke the needle through the first space at the start of your pattern, drawing it from the back to the front of the project. Pull the needle all the way through until the knot lies flat against the back of the project."
                },
                {
                    "headline": "Stitch down in another location.",
                    "description": "Pass the needle over one full stitch in your crochet piece, then insert it into the gap lying at the opposite side of that stitch. Draw the needle all the way through to the back of the fabric. Keep pulling it down until the yarn of your embroidery stitch lies flat against the material. If desired, you could make the stitch length longer by passing the needle over more than one stitch before inserting it back into the fabric. This completes one running stitch."
                },
                {
                    "headline": "Draw the yarn back up.",
                    "description": "Pass the yarn over another full stitch from the back, then poke into the gap on the other side of that stitch. Pull the needle up through to the front, bringing the yarn with it. Doing this starts another stitch. Make sure that the yarn at the back of the fabric is flat against the material when you stop pulling your needle. If desired, you can alter the space between stitches by skipping over more than one stitch."
                },
                {
                    "headline": "Repeat as needed.",
                    "description": "Continue this same pattern until you reach the end of your design. Pass over one full stitch from the front, then insert the needle down into the fabric. Pass over one full stitch from the back, then insert the needle up into the fabric."
                },
                {
                    "headline": "Consider making a second line of running stitch.",
                    "description": "Left alone, the running stitch will create a dashed line, giving the embroidery a \"sewn\" look. If you want to create a more continuous line, however, pass over your first line with a second one. Essentially, you're working your way backwards and reversing your embroidery stitches. When you reach a stitch that shows through the top of the fabric, make a stitch that shows at the bottom. For each stitch that shows at the bottom of the material, make a stitch that shows at the top."
                },
                {
                    "headline": "Knot the end.",
                    "description": "When you reach the end of your embroidery design, insert the needle into the fabric from the front and draw it all the way through to the back. Tie a large knot to complete the embroidery. Again, a standard overhand knot will suffice here. Just make sure that the knot is too large to fit though the gaps in the material. You can trim any excess yarn or weave it into the back of the material. Just make sure that it is no longer visible from the front."
                }
            ]
        },
        {
            "name": "Method Three: French Knot[4]\n\tX\n\t\tResearch source\n\t\t\n[5]\n\tX\n\t\tResearch source",
            "steps": [
                {
                    "headline": "Thread and knot the yarn.",
                    "description": "Cut a length of yarn approximately 10 inches (25.4 cm) long. Knot one end, then weave the other end through the eye of a large yarn needle. Pull about 4 inches (10 cm) of yarn through the eye of the needle to help prevent the yarn from slipping back out as you work. A standard overhand knot should work for this step. Do not use a slipknot. The knot must be larger than the gaps in your crochet work to prevent it from popping out as you embroider."
                },
                {
                    "headline": "Bring the needle up from the back.",
                    "description": "Poke the needle into the back of the material at the point where you want the French knot. Pull the needle and the yarn completely through to the front. Ideally, you should position the needle in between to stitches/strands in your original crochet piece. Continue pulling the yarn through until the overhand knot at the end of your strand lies flat against the back of the work"
                },
                {
                    "headline": "Pinch the yarn and straighten the needle.",
                    "description": "With the index finger and thumb of your non-dominant hand, pinch the yarn 3 or 4 inches (7.6 or 10 cm) above the surface of the material. Lay the side of the needle against the yarn, positioning it in between your pinched fingers and the surface of the material."
                },
                {
                    "headline": "Wrap the yarn around the needle.",
                    "description": "Using your non-dominant hand, wrap the yarn around the needle two to four times. Continue pinching the yarn as you do this. You'll need to maintain a good amount of tension to prevent the yarn from unwinding. The number of times you wind the knot will alter the thickness of the French knot. The more you wind the yarn, the larger the French knot will be."
                },
                {
                    "headline": "Insert the tip of the needle back into the fabric.",
                    "description": "Choose a point directly next to the exit point, but do not use the same exact spot. An adjacent stitch gap should be fine. Do not push the needle all the way through the material yet. Do not use the same exact hole. If you do, the knot will likely pop out through the back of the fabric when you finish."
                },
                {
                    "headline": "Tighten the coil.",
                    "description": "Use your non-dominant hand to gently tug the yarn downward, causing the coils to tighten. Continue tugging until the coils wind themselves into a tight bunch, snug against the top of the crochet material."
                },
                {
                    "headline": "Push your needle all the way through.",
                    "description": "Finish pushing the yarn needle through the fabric. The needle and the tail hanging off it should run through the center of the bundled coils, tightening them into a decorative knot."
                },
                {
                    "headline": "Knot the yarn from the back.",
                    "description": "Tie another large overhand knot at the back of the material to secure the French knot from the other side. Trim the rest of the tail, if desired, or weave the tail through the back side of the crochet work to hide it."
                }
            ]
        }
    ],
    "tyn": [
        "A crocheted project",
        "Yarn or embroidery floss",
        "Embroidery or tapestry needle",
        "Scissors",
        "Crochet hook, optional"
    ],
    "text": " Method One: Surface Slip Stitch[1]\n\tX\n\t\tResearch source\n\t\t\n[2]\n\tX\n\t\tResearch source Knot the yarn onto a crochet hook. Attach the yarn you want to use for your embroidery to a crochet hook using a standard slipknot. The crochet hook should be approximately the same size hook used to make the crochet work you are embroidering into. To make a slipknot:\nForm a loop by crossing the loose end of the yarn under the attached end. Grab the attached side and pull it up through the loop, creating a second loop in the process. Tighten the first loop around the second. Insert the hook into the second loop and tighten the second loop onto the hook. Pull the loop to the front of the work. Carefully remove the slipknot from the hook. Place the loop behind the crochet piece, then insert the hook into the nearest gap and grab onto the loop. Pull the loop of the slipknot through the front of the work. The knot itself must stay at the back of the project. The point at which you work here should be the same point at which you want the embroidery to start. Insert the hook into the work from the front. With the slipknot loop still on your hook, insert the hook through the gap lying after the adjacent stitch. This can be the next stitch to the right, left, top, or bottom. It could even be a stitch situated diagonally from your current space. The \"next\" stitch is simply the nearest stitch you need to complete your embroidery design. This step starts one surface slip stitch. Pull a loop through to the front. At the back of the work, wrap the yarn around the hook in a counterclockwise motion. Pull this loop of yarn back through to the front of the project. This step continues the slip stitch process but does not end it. Pull the second loop through the first. Pull the new loop you just created through the original slipknot loop, letting the slipknot loop drop off the hook in the process. The new loop should now be the only loop on your hook. This step completes one surface slip stitch. Consider holding the knot or base of the slipknot in place at the back of the piece as you create this first slip stitch. Doing so can help keep the stitch straight, neat, and tight. Slip stitch into the next stitch. Create a second slip stitch using the same technique used to work the first. Insert the hook into the gap after the next stitch in the pattern, keeping the loop on the hook as you work. Yarn over the hook from the back of the work, wrapping counterclockwise. Pull this yarn-over back through the to the front of  the work and through the loop on your hook. The previous loop should drop off and a new loop should be left on your hook. Repeat this slip stitch as needed. Continue making slip stitches in the same manner until you complete your desired embroidery pattern. Insert the hook from the back. After making the last stitch of your design, carefully remove the hook from the working loop. Re-insert the hook from the back of the work, picking up the working loop in the process and drawing it to the back. Make sure that the working loop stays open when you remove the hook. Fasten off the yarn. Cut the yarn, leaving a tail roughly 3 inches (7.6 cm) long. Pull this tail through the working loop on your hook, dropping the loop in the process and securing the yarn. Weave the excess tail into the back of the work, hiding it behind the surface slip stitch embroidery at the front. Doing so makes the embroidery more secure and hides the excess yarn. Method Two: Running Stitch[3]\n\tX\n\t\tResearch source Thread the yarn needle. Weave one end of the yarn through the eye of a large yarn needle. Do not knot the yarn onto the needle. Instead of knotting the yarn in place, you should pull a tail approximately 4 inches (10 cm) through the eye. Press this tail against the eye of the needle as you work to hold the yarn steady and in place. If the yarn starts working its way out of the needle as you embroider, simply pull it back through and continue working. Knot the other end of the yarn. Cut a length of yarn long enough for your project. Tie a large knot at the newly cut, unattached end of the yarn. The yarn should be a little longer than the total length of the finished embroidery design. You do not need to use a slipknot. A standard overhand knot will work just fine. Make sure that the knot you tie is larger than the gaps in between your crochet stitches. A large knot will help prevent the embroidery from unraveling. Bring the yarn up from the back. Poke the needle through the first space at the start of your pattern, drawing it from the back to the front of the project. Pull the needle all the way through until the knot lies flat against the back of the project. Stitch down in another location. Pass the needle over one full stitch in your crochet piece, then insert it into the gap lying at the opposite side of that stitch. Draw the needle all the way through to the back of the fabric. Keep pulling it down until the yarn of your embroidery stitch lies flat against the material. If desired, you could make the stitch length longer by passing the needle over more than one stitch before inserting it back into the fabric. This completes one running stitch. Draw the yarn back up. Pass the yarn over another full stitch from the back, then poke into the gap on the other side of that stitch. Pull the needle up through to the front, bringing the yarn with it. Doing this starts another stitch. Make sure that the yarn at the back of the fabric is flat against the material when you stop pulling your needle. If desired, you can alter the space between stitches by skipping over more than one stitch. Repeat as needed. Continue this same pattern until you reach the end of your design. Pass over one full stitch from the front, then insert the needle down into the fabric. Pass over one full stitch from the back, then insert the needle up into the fabric. Consider making a second line of running stitch. Left alone, the running stitch will create a dashed line, giving the embroidery a \"sewn\" look. If you want to create a more continuous line, however, pass over your first line with a second one. Essentially, you're working your way backwards and reversing your embroidery stitches. When you reach a stitch that shows through the top of the fabric, make a stitch that shows at the bottom. For each stitch that shows at the bottom of the material, make a stitch that shows at the top. Knot the end. When you reach the end of your embroidery design, insert the needle into the fabric from the front and draw it all the way through to the back. Tie a large knot to complete the embroidery. Again, a standard overhand knot will suffice here. Just make sure that the knot is too large to fit though the gaps in the material. You can trim any excess yarn or weave it into the back of the material. Just make sure that it is no longer visible from the front. Method Three: French Knot[4]\n\tX\n\t\tResearch source\n\t\t\n[5]\n\tX\n\t\tResearch source Thread and knot the yarn. Cut a length of yarn approximately 10 inches (25.4 cm) long. Knot one end, then weave the other end through the eye of a large yarn needle. Pull about 4 inches (10 cm) of yarn through the eye of the needle to help prevent the yarn from slipping back out as you work. A standard overhand knot should work for this step. Do not use a slipknot. The knot must be larger than the gaps in your crochet work to prevent it from popping out as you embroider. Bring the needle up from the back. Poke the needle into the back of the material at the point where you want the French knot. Pull the needle and the yarn completely through to the front. Ideally, you should position the needle in between to stitches/strands in your original crochet piece. Continue pulling the yarn through until the overhand knot at the end of your strand lies flat against the back of the work Pinch the yarn and straighten the needle. With the index finger and thumb of your non-dominant hand, pinch the yarn 3 or 4 inches (7.6 or 10 cm) above the surface of the material. Lay the side of the needle against the yarn, positioning it in between your pinched fingers and the surface of the material. Wrap the yarn around the needle. Using your non-dominant hand, wrap the yarn around the needle two to four times. Continue pinching the yarn as you do this. You'll need to maintain a good amount of tension to prevent the yarn from unwinding. The number of times you wind the knot will alter the thickness of the French knot. The more you wind the yarn, the larger the French knot will be. Insert the tip of the needle back into the fabric. Choose a point directly next to the exit point, but do not use the same exact spot. An adjacent stitch gap should be fine. Do not push the needle all the way through the material yet. Do not use the same exact hole. If you do, the knot will likely pop out through the back of the fabric when you finish. Tighten the coil. Use your non-dominant hand to gently tug the yarn downward, causing the coils to tighten. Continue tugging until the coils wind themselves into a tight bunch, snug against the top of the crochet material. Push your needle all the way through. Finish pushing the yarn needle through the fabric. The needle and the tail hanging off it should run through the center of the bundled coils, tightening them into a decorative knot. Knot the yarn from the back. Tie another large overhand knot at the back of the material to secure the French knot from the other side. Trim the rest of the tail, if desired, or weave the tail through the back side of the crochet work to hide it.",
    "sentences": [
        " Method One: Surface Slip Stitch[1]\n\tX\n\t\tResearch source\n\t\t\n[2]\n\tX\n\t\tResearch source Knot the yarn onto a crochet hook.",
        "Attach the yarn you want to use for your embroidery to a crochet hook using a standard slipknot.",
        "The crochet hook should be approximately the same size hook used to make the crochet work you are embroidering into.",
        "To make a slipknot:\nForm a loop by crossing the loose end of the yarn under the attached end.",
        "Grab the attached side and pull it up through the loop, creating a second loop in the process.",
        "Tighten the first loop around the second.",
        "Insert the hook into the second loop and tighten the second loop onto the hook.",
        "Pull the loop to the front of the work.",
        "Carefully remove the slipknot from the hook.",
        "Place the loop behind the crochet piece, then insert the hook into the nearest gap and grab onto the loop.",
        "Pull the loop of the slipknot through the front of the work.",
        "The knot itself must stay at the back of the project.",
        "The point at which you work here should be the same point at which you want the embroidery to start.",
        "Insert the hook into the work from the front.",
        "With the slipknot loop still on your hook, insert the hook through the gap lying after the adjacent stitch.",
        "This can be the next stitch to the right, left, top, or bottom.",
        "It could even be a stitch situated diagonally from your current space.",
        "The \"next\" stitch is simply the nearest stitch you need to complete your embroidery design.",
        "This step starts one surface slip stitch.",
        "Pull a loop through to the front.",
        "At the back of the work, wrap the yarn around the hook in a counterclockwise motion.",
        "Pull this loop of yarn back through to the front of the project.",
        "This step continues the slip stitch process but does not end it.",
        "Pull the second loop through the first.",
        "Pull the new loop you just created through the original slipknot loop, letting the slipknot loop drop off the hook in the process.",
        "The new loop should now be the only loop on your hook.",
        "This step completes one surface slip stitch.",
        "Consider holding the knot or base of the slipknot in place at the back of the piece as you create this first slip stitch.",
        "Doing so can help keep the stitch straight, neat, and tight.",
        "Slip stitch into the next stitch.",
        "Create a second slip stitch using the same technique used to work the first.",
        "Insert the hook into the gap after the next stitch in the pattern, keeping the loop on the hook as you work.",
        "Yarn over the hook from the back of the work, wrapping counterclockwise.",
        "Pull this yarn-over back through the to the front of  the work and through the loop on your hook.",
        "The previous loop should drop off and a new loop should be left on your hook.",
        "Repeat this slip stitch as needed.",
        "Continue making slip stitches in the same manner until you complete your desired embroidery pattern.",
        "Insert the hook from the back.",
        "After making the last stitch of your design, carefully remove the hook from the working loop.",
        "Re-insert the hook from the back of the work, picking up the working loop in the process and drawing it to the back.",
        "Make sure that the working loop stays open when you remove the hook.",
        "Fasten off the yarn.",
        "Cut the yarn, leaving a tail roughly 3 inches (7.6 cm) long.",
        "Pull this tail through the working loop on your hook, dropping the loop in the process and securing the yarn.",
        "Weave the excess tail into the back of the work, hiding it behind the surface slip stitch embroidery at the front.",
        "Doing so makes the embroidery more secure and hides the excess yarn.",
        "Method Two: Running Stitch[3]\n\tX\n\t\tResearch source Thread the yarn needle.",
        "Weave one end of the yarn through the eye of a large yarn needle.",
        "Do not knot the yarn onto the needle.",
        "Instead of knotting the yarn in place, you should pull a tail approximately 4 inches (10 cm) through the eye.",
        "Press this tail against the eye of the needle as you work to hold the yarn steady and in place.",
        "If the yarn starts working its way out of the needle as you embroider, simply pull it back through and continue working.",
        "Knot the other end of the yarn.",
        "Cut a length of yarn long enough for your project.",
        "Tie a large knot at the newly cut, unattached end of the yarn.",
        "The yarn should be a little longer than the total length of the finished embroidery design.",
        "You do not need to use a slipknot.",
        "A standard overhand knot will work just fine.",
        "Make sure that the knot you tie is larger than the gaps in between your crochet stitches.",
        "A large knot will help prevent the embroidery from unraveling.",
        "Bring the yarn up from the back.",
        "Poke the needle through the first space at the start of your pattern, drawing it from the back to the front of the project.",
        "Pull the needle all the way through until the knot lies flat against the back of the project.",
        "Stitch down in another location.",
        "Pass the needle over one full stitch in your crochet piece, then insert it into the gap lying at the opposite side of that stitch.",
        "Draw the needle all the way through to the back of the fabric.",
        "Keep pulling it down until the yarn of your embroidery stitch lies flat against the material.",
        "If desired, you could make the stitch length longer by passing the needle over more than one stitch before inserting it back into the fabric.",
        "This completes one running stitch.",
        "Draw the yarn back up.",
        "Pass the yarn over another full stitch from the back, then poke into the gap on the other side of that stitch.",
        "Pull the needle up through to the front, bringing the yarn with it.",
        "Doing this starts another stitch.",
        "Make sure that the yarn at the back of the fabric is flat against the material when you stop pulling your needle.",
        "If desired, you can alter the space between stitches by skipping over more than one stitch.",
        "Repeat as needed.",
        "Continue this same pattern until you reach the end of your design.",
        "Pass over one full stitch from the front, then insert the needle down into the fabric.",
        "Pass over one full stitch from the back, then insert the needle up into the fabric.",
        "Consider making a second line of running stitch.",
        "Left alone, the running stitch will create a dashed line, giving the embroidery a \"sewn\" look.",
        "If you want to create a more continuous line, however, pass over your first line with a second one.",
        "Essentially, you're working your way backwards and reversing your embroidery stitches.",
        "When you reach a stitch that shows through the top of the fabric, make a stitch that shows at the bottom.",
        "For each stitch that shows at the bottom of the material, make a stitch that shows at the top.",
        "Knot the end.",
        "When you reach the end of your embroidery design, insert the needle into the fabric from the front and draw it all the way through to the back.",
        "Tie a large knot to complete the embroidery.",
        "Again, a standard overhand knot will suffice here.",
        "Just make sure that the knot is too large to fit though the gaps in the material.",
        "You can trim any excess yarn or weave it into the back of the material.",
        "Just make sure that it is no longer visible from the front.",
        "Method Three: French Knot[4]\n\tX\n\t\tResearch source\n\t\t\n[5]\n\tX\n\t\tResearch source Thread and knot the yarn.",
        "Cut a length of yarn approximately 10 inches (25.4 cm) long.",
        "Knot one end, then weave the other end through the eye of a large yarn needle.",
        "Pull about 4 inches (10 cm) of yarn through the eye of the needle to help prevent the yarn from slipping back out as you work.",
        "A standard overhand knot should work for this step.",
        "Do not use a slipknot.",
        "The knot must be larger than the gaps in your crochet work to prevent it from popping out as you embroider.",
        "Bring the needle up from the back.",
        "Poke the needle into the back of the material at the point where you want the French knot.",
        "Pull the needle and the yarn completely through to the front.",
        "Ideally, you should position the needle in between to stitches/strands in your original crochet piece.",
        "Continue pulling the yarn through until the overhand knot at the end of your strand lies flat against the back of the work Pinch the yarn and straighten the needle.",
        "With the index finger and thumb of your non-dominant hand, pinch the yarn 3 or 4 inches (7.6 or 10 cm) above the surface of the material.",
        "Lay the side of the needle against the yarn, positioning it in between your pinched fingers and the surface of the material.",
        "Wrap the yarn around the needle.",
        "Using your non-dominant hand, wrap the yarn around the needle two to four times.",
        "Continue pinching the yarn as you do this.",
        "You'll need to maintain a good amount of tension to prevent the yarn from unwinding.",
        "The number of times you wind the knot will alter the thickness of the French knot.",
        "The more you wind the yarn, the larger the French knot will be.",
        "Insert the tip of the needle back into the fabric.",
        "Choose a point directly next to the exit point, but do not use the same exact spot.",
        "An adjacent stitch gap should be fine.",
        "Do not push the needle all the way through the material yet.",
        "Do not use the same exact hole.",
        "If you do, the knot will likely pop out through the back of the fabric when you finish.",
        "Tighten the coil.",
        "Use your non-dominant hand to gently tug the yarn downward, causing the coils to tighten.",
        "Continue tugging until the coils wind themselves into a tight bunch, snug against the top of the crochet material.",
        "Push your needle all the way through.",
        "Finish pushing the yarn needle through the fabric.",
        "The needle and the tail hanging off it should run through the center of the bundled coils, tightening them into a decorative knot.",
        "Knot the yarn from the back.",
        "Tie another large overhand knot at the back of the material to secure the French knot from the other side.",
        "Trim the rest of the tail, if desired, or weave the tail through the back side of the crochet work to hide it."
    ]
}