{
    "title": "How to Select Broccoli",
    "url": "https://www.wikihow.com/Select-Broccoli",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Food Selection and Storage"
    ],
    "steps": [
        {
            "headline": "Look for broccoli with bright green heads.",
            "description": ""
        },
        {
            "headline": "Prefer compact clusters of the broccoli florets.",
            "description": "The more open the florets, the older and closer to flowering the florets are."
        },
        {
            "headline": "Choose firm, strong stems and stalks.",
            "description": "If the stem seems woody, do not buy it."
        },
        {
            "headline": "Avoid purchasing broccoli with yellow flowers.",
            "description": "It has gone past the stage of desirable texture. However, if your own broccoli has flowered, it will still work in soup or as stock flavouring."
        },
        {
            "headline": "Store broccoli in the refrigerator and keep it dry.",
            "description": "Use within 7 days, or earlier if you notice any wilting commencing."
        }
    ],
    "tyn": [
        "Quality fruit and vegetable supplier"
    ],
    "text": " Look for broccoli with bright green heads.  Prefer compact clusters of the broccoli florets. The more open the florets, the older and closer to flowering the florets are. Choose firm, strong stems and stalks. If the stem seems woody, do not buy it. Avoid purchasing broccoli with yellow flowers. It has gone past the stage of desirable texture. However, if your own broccoli has flowered, it will still work in soup or as stock flavouring. Store broccoli in the refrigerator and keep it dry. Use within 7 days, or earlier if you notice any wilting commencing.",
    "sentences": [
        " Look for broccoli with bright green heads.",
        "Prefer compact clusters of the broccoli florets.",
        "The more open the florets, the older and closer to flowering the florets are.",
        "Choose firm, strong stems and stalks.",
        "If the stem seems woody, do not buy it.",
        "Avoid purchasing broccoli with yellow flowers.",
        "It has gone past the stage of desirable texture.",
        "However, if your own broccoli has flowered, it will still work in soup or as stock flavouring.",
        "Store broccoli in the refrigerator and keep it dry.",
        "Use within 7 days, or earlier if you notice any wilting commencing."
    ]
}