{
    "title": "How to Become a Self Taught Gymnast",
    "url": "https://www.wikihow.com/Become-a-Self-Taught-Gymnast",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Gymnastics"
    ],
    "parts": [
        {
            "name": "Preparing to Start Doing Gymnastics",
            "steps": [
                {
                    "headline": "Search YouTube for tips and tutorials.",
                    "description": "Search specific skills by writing \"How to do a (skill)\". Use common terms, and don't type in things like \"For a nine-year-old,\" or \"For someone who has done gymnastics before.\" Once you find a video, watch it thoroughly. Do not start trying until you have watched the whole thing. If you can't find any videos on YouTube (or they aren't very helpful), search wikiHow for more help."
                },
                {
                    "headline": "Stretch daily.",
                    "description": "One of the most important attributes of a gymnast is flexibility. To become proficient in gymnastics, you must have at least one forward split down, but splits are not the only thing gymnasts need to be flexible in. Stretch your back, shoulders, pike, toes and wrists."
                },
                {
                    "headline": "Eat a balanced diet.",
                    "description": "A gymnast doesn't eat McDonald's everyday, nor do they eat fat-free everything. Eat a well-balanced diet daily."
                },
                {
                    "headline": "Practice every day.",
                    "description": "You cannot learn gymnastics in a day. You must start small, and work your way up."
                },
                {
                    "headline": "Acquire gymnastics clothing and equipment.",
                    "description": "You do not need a $60 leotard, but you do need some comfortable clothes, such as leggings and a t-shirt. Also, attain mats. Though this is not mandatory, it will help you enormously if you have even a single mat. You may also (though this is more expensive) find gymnastics beams or junior kip bars. If you are unable to acquire mats, find an open gym near you."
                }
            ]
        },
        {
            "name": "Starting with Simpler Moves",
            "steps": [
                {
                    "headline": "Learn how to do a forward roll and backward roll.",
                    "description": "This can lead up to front and back tucks eventually."
                },
                {
                    "headline": "Learn how to do a handstand.",
                    "description": "Arguably the most important skill in gymnastics is the handstand. It is the building block of nearly all gymnastics skills.."
                },
                {
                    "headline": "Learn how to do a cartwheel.",
                    "description": "One of the most basic moves in gymnastics, the cartwheel is almost as important as the handstand, because after a cartwheel comes the most important skill in tumbling: the roundoff."
                }
            ]
        },
        {
            "name": "Working into More Difficult Moves",
            "steps": [
                {
                    "headline": "Learn how to do a bridge.",
                    "description": "This stretches your back and is the position for a backhandspring and back walkover."
                },
                {
                    "headline": "Learn how to do a roundoff.",
                    "description": "As mentioned above, this is one of the most important skills on floor for tumbling."
                },
                {
                    "headline": "Learn how to do a scorpion.",
                    "description": "This is a very flashy move that is easy to master if you stretch every day."
                },
                {
                    "headline": "Learn how to do a chin stand.",
                    "description": "A chin stand is a move that requires a very flexible back, but if you are flexible, you should be able to do it with practice."
                }
            ]
        },
        {
            "name": "Performing Advanced Moves",
            "steps": [
                {
                    "headline": "Learn how to do a back walkover and front walkover.",
                    "description": "These are the skills working up to front and back handsprings."
                },
                {
                    "headline": "Learn how to do a backhandspring.",
                    "description": "Doing a back handspring is every beginner's dream, but be very cautious. Master all previous steps before attempting and make sure you have a spot on your first time."
                },
                {
                    "headline": "Learn how to do a back tuck.",
                    "description": "The ultimate self-taught gymnast's achievement, learning to do a back tuck is a very exciting skill, and fun to show off. However, this is the most dangerous of the skills you can learn at home. Go outside, or into a huge open space. Get a spotter to help you. If you have a trampoline, try it first and master it there."
                },
                {
                    "headline": "Pat yourself on the back.",
                    "description": "You are now a self-taught gymnast!"
                }
            ]
        }
    ],
    "tyn": [
        "fitting but comfortable clothes",
        "Soft surfaces like a mat or carpet"
    ],
    "text": " Preparing to Start Doing Gymnastics Search YouTube for tips and tutorials. Search specific skills by writing \"How to do a (skill)\". Use common terms, and don't type in things like \"For a nine-year-old,\" or \"For someone who has done gymnastics before.\" Once you find a video, watch it thoroughly. Do not start trying until you have watched the whole thing. If you can't find any videos on YouTube (or they aren't very helpful), search wikiHow for more help. Stretch daily. One of the most important attributes of a gymnast is flexibility. To become proficient in gymnastics, you must have at least one forward split down, but splits are not the only thing gymnasts need to be flexible in. Stretch your back, shoulders, pike, toes and wrists. Eat a balanced diet. A gymnast doesn't eat McDonald's everyday, nor do they eat fat-free everything. Eat a well-balanced diet daily. Practice every day. You cannot learn gymnastics in a day. You must start small, and work your way up. Acquire gymnastics clothing and equipment. You do not need a $60 leotard, but you do need some comfortable clothes, such as leggings and a t-shirt. Also, attain mats. Though this is not mandatory, it will help you enormously if you have even a single mat. You may also (though this is more expensive) find gymnastics beams or junior kip bars. If you are unable to acquire mats, find an open gym near you. Starting with Simpler Moves Learn how to do a forward roll and backward roll. This can lead up to front and back tucks eventually. Learn how to do a handstand. Arguably the most important skill in gymnastics is the handstand. It is the building block of nearly all gymnastics skills.. Learn how to do a cartwheel. One of the most basic moves in gymnastics, the cartwheel is almost as important as the handstand, because after a cartwheel comes the most important skill in tumbling: the roundoff. Working into More Difficult Moves Learn how to do a bridge. This stretches your back and is the position for a backhandspring and back walkover. Learn how to do a roundoff. As mentioned above, this is one of the most important skills on floor for tumbling. Learn how to do a scorpion. This is a very flashy move that is easy to master if you stretch every day. Learn how to do a chin stand. A chin stand is a move that requires a very flexible back, but if you are flexible, you should be able to do it with practice. Performing Advanced Moves Learn how to do a back walkover and front walkover. These are the skills working up to front and back handsprings. Learn how to do a backhandspring. Doing a back handspring is every beginner's dream, but be very cautious. Master all previous steps before attempting and make sure you have a spot on your first time. Learn how to do a back tuck. The ultimate self-taught gymnast's achievement, learning to do a back tuck is a very exciting skill, and fun to show off. However, this is the most dangerous of the skills you can learn at home. Go outside, or into a huge open space. Get a spotter to help you. If you have a trampoline, try it first and master it there. Pat yourself on the back. You are now a self-taught gymnast!",
    "sentences": [
        " Preparing to Start Doing Gymnastics Search YouTube for tips and tutorials.",
        "Search specific skills by writing \"How to do a (skill)\".",
        "Use common terms, and don't type in things like \"For a nine-year-old,\" or \"For someone who has done gymnastics before.\"",
        "Once you find a video, watch it thoroughly.",
        "Do not start trying until you have watched the whole thing.",
        "If you can't find any videos on YouTube (or they aren't very helpful), search wikiHow for more help.",
        "Stretch daily.",
        "One of the most important attributes of a gymnast is flexibility.",
        "To become proficient in gymnastics, you must have at least one forward split down, but splits are not the only thing gymnasts need to be flexible in.",
        "Stretch your back, shoulders, pike, toes and wrists.",
        "Eat a balanced diet.",
        "A gymnast doesn't eat McDonald's everyday, nor do they eat fat-free everything.",
        "Eat a well-balanced diet daily.",
        "Practice every day.",
        "You cannot learn gymnastics in a day.",
        "You must start small, and work your way up.",
        "Acquire gymnastics clothing and equipment.",
        "You do not need a $60 leotard, but you do need some comfortable clothes, such as leggings and a t-shirt.",
        "Also, attain mats.",
        "Though this is not mandatory, it will help you enormously if you have even a single mat.",
        "You may also (though this is more expensive) find gymnastics beams or junior kip bars.",
        "If you are unable to acquire mats, find an open gym near you.",
        "Starting with Simpler Moves Learn how to do a forward roll and backward roll.",
        "This can lead up to front and back tucks eventually.",
        "Learn how to do a handstand.",
        "Arguably the most important skill in gymnastics is the handstand.",
        "It is the building block of nearly all gymnastics skills..",
        "Learn how to do a cartwheel.",
        "One of the most basic moves in gymnastics, the cartwheel is almost as important as the handstand, because after a cartwheel comes the most important skill in tumbling: the roundoff.",
        "Working into More Difficult Moves Learn how to do a bridge.",
        "This stretches your back and is the position for a backhandspring and back walkover.",
        "Learn how to do a roundoff.",
        "As mentioned above, this is one of the most important skills on floor for tumbling.",
        "Learn how to do a scorpion.",
        "This is a very flashy move that is easy to master if you stretch every day.",
        "Learn how to do a chin stand.",
        "A chin stand is a move that requires a very flexible back, but if you are flexible, you should be able to do it with practice.",
        "Performing Advanced Moves Learn how to do a back walkover and front walkover.",
        "These are the skills working up to front and back handsprings.",
        "Learn how to do a backhandspring.",
        "Doing a back handspring is every beginner's dream, but be very cautious.",
        "Master all previous steps before attempting and make sure you have a spot on your first time.",
        "Learn how to do a back tuck.",
        "The ultimate self-taught gymnast's achievement, learning to do a back tuck is a very exciting skill, and fun to show off.",
        "However, this is the most dangerous of the skills you can learn at home.",
        "Go outside, or into a huge open space.",
        "Get a spotter to help you.",
        "If you have a trampoline, try it first and master it there.",
        "Pat yourself on the back.",
        "You are now a self-taught gymnast!"
    ]
}