{
    "title": "How to Make Seasoned Pepper",
    "url": "https://www.wikihow.com/Make-Seasoned-Pepper",
    "category_hierarchy": [
        "Food and Entertaining",
        "Herbs and Spices",
        "Salt and Pepper"
    ],
    "methods": [
        {
            "name": "Black and white pepper mix",
            "steps": [
                {
                    "headline": "Place all of the ingredients into a mixing bowl.",
                    "description": "Mix together well."
                },
                {
                    "headline": "Tip into a storage container.",
                    "description": "An airtight glass spice bottle is a great choice."
                },
                {
                    "headline": "Use as needed.",
                    "description": "Add to dishes to spice them up. Use within 3 to 6 months, for the best flavor."
                }
            ]
        },
        {
            "name": "Lemon pepper",
            "steps": [
                {
                    "headline": "Wash the lemons to remove grime.",
                    "description": "Peel the lemons with a microplane or zester."
                },
                {
                    "headline": "Spread the peel pieces across a baking sheet.",
                    "description": "Place in the oven, middle rack, and heat at the lowest level it has."
                },
                {
                    "headline": "Bake at this low temperature until the zest feels dry when you touch it.",
                    "description": "Check the dryness every half hour or so."
                },
                {
                    "headline": "Crack the peppercorns using a pepper mill, grinder or mortar and pestle.",
                    "description": "Make enough for 2 teaspoons."
                },
                {
                    "headline": "Grind or powder 1 tablespoon (14.8 ml) of dried lemon zest.",
                    "description": "Use the grinder or mortar. Don't make it too powdered; it needs to have some texture."
                },
                {
                    "headline": "Mix the ingredients together.",
                    "description": "Add the cracked black pepper, ground lemon zest, sea salt, granulated or powdered garlic and onion powder to a mixing bowl. Stir to combine."
                },
                {
                    "headline": "Transfer to a shaker container.",
                    "description": "Store airtight. Use within 3 to 6 months."
                }
            ]
        },
        {
            "name": "Pepper flakes seasoned pepper",
            "steps": [
                {
                    "headline": "Add the ingredients to a blender or food processor.",
                    "description": ""
                },
                {
                    "headline": "Blend or process into a coarse powder.",
                    "description": ""
                },
                {
                    "headline": "Transfer to an airtight container with a sprinkle lid.",
                    "description": "Use within 3 to 6 months."
                }
            ]
        }
    ],
    "tyn": [
        "Bowl for mixing",
        "Mixing implement",
        "Glass spice container with airtight lid or similar storage container",
        "Microplane or zester",
        "Baking sheet",
        "Oven mitts",
        "Pepper mill, grinder or mortar and pestle",
        "Mixing bowl",
        "Shaker container (airtight)"
    ],
    "text": " Black and white pepper mix Place all of the ingredients into a mixing bowl. Mix together well. Tip into a storage container. An airtight glass spice bottle is a great choice. Use as needed. Add to dishes to spice them up. Use within 3 to 6 months, for the best flavor. Lemon pepper Wash the lemons to remove grime. Peel the lemons with a microplane or zester. Spread the peel pieces across a baking sheet. Place in the oven, middle rack, and heat at the lowest level it has. Bake at this low temperature until the zest feels dry when you touch it. Check the dryness every half hour or so. Crack the peppercorns using a pepper mill, grinder or mortar and pestle. Make enough for 2 teaspoons. Grind or powder 1 tablespoon (14.8 ml) of dried lemon zest. Use the grinder or mortar. Don't make it too powdered; it needs to have some texture. Mix the ingredients together. Add the cracked black pepper, ground lemon zest, sea salt, granulated or powdered garlic and onion powder to a mixing bowl. Stir to combine. Transfer to a shaker container. Store airtight. Use within 3 to 6 months. Pepper flakes seasoned pepper Add the ingredients to a blender or food processor.  Blend or process into a coarse powder.  Transfer to an airtight container with a sprinkle lid. Use within 3 to 6 months.",
    "sentences": [
        " Black and white pepper mix Place all of the ingredients into a mixing bowl.",
        "Mix together well.",
        "Tip into a storage container.",
        "An airtight glass spice bottle is a great choice.",
        "Use as needed.",
        "Add to dishes to spice them up.",
        "Use within 3 to 6 months, for the best flavor.",
        "Lemon pepper Wash the lemons to remove grime.",
        "Peel the lemons with a microplane or zester.",
        "Spread the peel pieces across a baking sheet.",
        "Place in the oven, middle rack, and heat at the lowest level it has.",
        "Bake at this low temperature until the zest feels dry when you touch it.",
        "Check the dryness every half hour or so.",
        "Crack the peppercorns using a pepper mill, grinder or mortar and pestle.",
        "Make enough for 2 teaspoons.",
        "Grind or powder 1 tablespoon (14.8 ml) of dried lemon zest.",
        "Use the grinder or mortar.",
        "Don't make it too powdered; it needs to have some texture.",
        "Mix the ingredients together.",
        "Add the cracked black pepper, ground lemon zest, sea salt, granulated or powdered garlic and onion powder to a mixing bowl.",
        "Stir to combine.",
        "Transfer to a shaker container.",
        "Store airtight.",
        "Use within 3 to 6 months.",
        "Pepper flakes seasoned pepper Add the ingredients to a blender or food processor.",
        "Blend or process into a coarse powder.",
        "Transfer to an airtight container with a sprinkle lid.",
        "Use within 3 to 6 months."
    ]
}