{
    "title": "How to Recharge LeapPad2",
    "url": "https://www.wikihow.com/Recharge-LeapPad2",
    "category_hierarchy": [
        "Computers and Electronics",
        "Software"
    ],
    "methods": [
        {
            "name": "Replacing\\/Recharging Batteries",
            "steps": [
                {
                    "headline": "Purchase a pack of four fresh AA batteries.",
                    "description": "Open the two battery compartments at the back of your LeapPad2. Install the batteries; making sure the symbol on the battery corresponds with the symbol in the battery compartment."
                },
                {
                    "headline": "Use batteries of the same type.",
                    "description": "You should also only install four fully charged batteries at once, instead of mixing partially charged batteries with fully charged batteries."
                },
                {
                    "headline": "Opt to use rechargeable batteries made of nickel metal-hydride.",
                    "description": "200mAH or higher is recommended. Purchase at least eight batteries, so that you can recharge a set while another is in use. It is a good idea to purchase rechargeable batteries and a battery charger at once so that you can guarantee compatibility. You can also move on to the next method to buy a LeapPad2 brand recharger kit."
                },
                {
                    "headline": "Power down your LeapPad2 when your child stops using it to conserve battery life.",
                    "description": "Rechargeable batteries will deplete slowly even when not in use."
                }
            ]
        },
        {
            "name": "Using a Recharging Pack",
            "steps": [
                {
                    "headline": "Purchase the special LeapPad2 Recharger Kit from a box store, online retailer or toy store.",
                    "description": "These kits can vary from $28 to $50."
                },
                {
                    "headline": "Attach the two rechargeable batteries together and plug them into the AC Adaptor to charge them when they are empty.",
                    "description": ""
                },
                {
                    "headline": "Separate the batteries and install them in the battery slots, where you would normally put AA batteries.",
                    "description": ""
                },
                {
                    "headline": "Repeat every nine to 10 hours.",
                    "description": "You can also plug in the AC adaptor directly to the LeapPad2 if your batteries aren’t recharged."
                },
                {
                    "headline": "Buy another Recharger kit to have extra batteries on hand.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Using an AC Adaptor",
            "steps": [
                {
                    "headline": "Use the AC adaptor that came with the LeapPad2 Recharger kit.",
                    "description": "You can also purchase a Leapster or Didj AC adaptor."
                },
                {
                    "headline": "Insert the adaptor into an electrical outlet in your wall.",
                    "description": "It is best to use one at a low level, near a chair or table. Your child will be able to use the device when it is plugged in to the wall."
                },
                {
                    "headline": "Keep the AC adaptor plugged into the wall at night if you are using the LeapPad2 recharger kit.",
                    "description": "Remove the recharger kit batteries and attach them to the charger kit. Then, allow the batteries to charge all night."
                },
                {
                    "headline": "Reinstall the batteries in the morning.",
                    "description": "Batteries will allow the child more flexibility and mobility when using the LeapPad2 than the AC adaptor."
                }
            ]
        }
    ],
    "tyn": [
        "Four AA batteries",
        "Rechargeable AA batteries",
        "Battery charger",
        "LeapPad2 Recharger pack",
        "AC adaptor",
        "Child-safe electric outlet"
    ],
    "text": " Replacing\\/Recharging Batteries Purchase a pack of four fresh AA batteries. Open the two battery compartments at the back of your LeapPad2. Install the batteries; making sure the symbol on the battery corresponds with the symbol in the battery compartment. Use batteries of the same type. You should also only install four fully charged batteries at once, instead of mixing partially charged batteries with fully charged batteries. Opt to use rechargeable batteries made of nickel metal-hydride. 200mAH or higher is recommended. Purchase at least eight batteries, so that you can recharge a set while another is in use. It is a good idea to purchase rechargeable batteries and a battery charger at once so that you can guarantee compatibility. You can also move on to the next method to buy a LeapPad2 brand recharger kit. Power down your LeapPad2 when your child stops using it to conserve battery life. Rechargeable batteries will deplete slowly even when not in use. Using a Recharging Pack Purchase the special LeapPad2 Recharger Kit from a box store, online retailer or toy store. These kits can vary from $28 to $50. Attach the two rechargeable batteries together and plug them into the AC Adaptor to charge them when they are empty.  Separate the batteries and install them in the battery slots, where you would normally put AA batteries.  Repeat every nine to 10 hours. You can also plug in the AC adaptor directly to the LeapPad2 if your batteries aren’t recharged. Buy another Recharger kit to have extra batteries on hand.  Using an AC Adaptor Use the AC adaptor that came with the LeapPad2 Recharger kit. You can also purchase a Leapster or Didj AC adaptor. Insert the adaptor into an electrical outlet in your wall. It is best to use one at a low level, near a chair or table. Your child will be able to use the device when it is plugged in to the wall. Keep the AC adaptor plugged into the wall at night if you are using the LeapPad2 recharger kit. Remove the recharger kit batteries and attach them to the charger kit. Then, allow the batteries to charge all night. Reinstall the batteries in the morning. Batteries will allow the child more flexibility and mobility when using the LeapPad2 than the AC adaptor.",
    "sentences": [
        " Replacing\\/Recharging Batteries Purchase a pack of four fresh AA batteries.",
        "Open the two battery compartments at the back of your LeapPad2.",
        "Install the batteries; making sure the symbol on the battery corresponds with the symbol in the battery compartment.",
        "Use batteries of the same type.",
        "You should also only install four fully charged batteries at once, instead of mixing partially charged batteries with fully charged batteries.",
        "Opt to use rechargeable batteries made of nickel metal-hydride.",
        "200mAH or higher is recommended.",
        "Purchase at least eight batteries, so that you can recharge a set while another is in use.",
        "It is a good idea to purchase rechargeable batteries and a battery charger at once so that you can guarantee compatibility.",
        "You can also move on to the next method to buy a LeapPad2 brand recharger kit.",
        "Power down your LeapPad2 when your child stops using it to conserve battery life.",
        "Rechargeable batteries will deplete slowly even when not in use.",
        "Using a Recharging Pack Purchase the special LeapPad2 Recharger Kit from a box store, online retailer or toy store.",
        "These kits can vary from $28 to $50.",
        "Attach the two rechargeable batteries together and plug them into the AC Adaptor to charge them when they are empty.",
        "Separate the batteries and install them in the battery slots, where you would normally put AA batteries.",
        "Repeat every nine to 10 hours.",
        "You can also plug in the AC adaptor directly to the LeapPad2 if your batteries aren’t recharged.",
        "Buy another Recharger kit to have extra batteries on hand.",
        "Using an AC Adaptor Use the AC adaptor that came with the LeapPad2 Recharger kit.",
        "You can also purchase a Leapster or Didj AC adaptor.",
        "Insert the adaptor into an electrical outlet in your wall.",
        "It is best to use one at a low level, near a chair or table.",
        "Your child will be able to use the device when it is plugged in to the wall.",
        "Keep the AC adaptor plugged into the wall at night if you are using the LeapPad2 recharger kit.",
        "Remove the recharger kit batteries and attach them to the charger kit.",
        "Then, allow the batteries to charge all night.",
        "Reinstall the batteries in the morning.",
        "Batteries will allow the child more flexibility and mobility when using the LeapPad2 than the AC adaptor."
    ]
}