{
    "title": "How to Make a Vodka and Tonic",
    "url": "https://www.wikihow.com/Make-a-Vodka-and-Tonic",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Alcoholic Drinks",
        "Spirits and Liqueurs"
    ],
    "parts": [
        {
            "name": "Preparing the Supplies",
            "steps": [
                {
                    "headline": "Make sure your vodka is ice cold.",
                    "description": "Before making a vodka tonic, chill the vodka in the fridge overnight or at least for a few hours. Vodka drinks taste best with ice cold vodka."
                },
                {
                    "headline": "Use a highball glass.",
                    "description": "A pint glass will be far too large for a vodka tonic and can water the drink down as you fill the glass with ice. Ideally, a highball glass should be used for a vodka tonic. If you don't have a highball glass, opt for another short, squat glass."
                },
                {
                    "headline": "Fill the glass with ice cubes.",
                    "description": "Go for solid, large ice cubes over ice chips. Chips melt quicker and water down the drink. Fill the glass to the brim with ice cubes."
                }
            ]
        },
        {
            "name": "Mixing the Drink",
            "steps": [
                {
                    "headline": "Add your vodka.",
                    "description": "Measure out your vodka using a shot glass. Pour the vodka into the drink first. Most shot glasses are about 1.5 ounces."
                },
                {
                    "headline": "Top your vodka with soda.",
                    "description": "Measure out about five ounces of tonic water, again using a shot glass. Top off your drink with tonic water. The glass should be filled to near the brim."
                },
                {
                    "headline": "Stir lightly.",
                    "description": "Vodka tonics do not have to be stirred much, as this can kill the carbonation. Do some light stirring with a spoon or similar device."
                }
            ]
        },
        {
            "name": "Adding Flavor",
            "steps": [
                {
                    "headline": "Add fresh cranberries.",
                    "description": "Cranberries can add a nice, fruity flavor to a vodka tonic. Add a few fresh cranberries to the top of your glass. You can also add a splash of cranberry juice instead if you prefer."
                },
                {
                    "headline": "Mix in lemon or lime juice.",
                    "description": "Use a fresh lemon or lime if you go this route. Cut the lemon or lime into wedges and squeeze the juice into the drink. You can also place a lemon or lime wedge on the edge of a glass."
                },
                {
                    "headline": "Try mint leaves.",
                    "description": "Mint leaves can give your drink a nice, minty flavor. If you want to add some extra taste, garnish your drink with a few fresh mint leaves."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Highball glass",
        "Vodka",
        "Tonic water (for example, Schweppes, Indian Tonic Water)",
        "Ice cubes",
        "A lime and/or a lemon (optional)",
        "Cranberries (optional)"
    ],
    "text": " Preparing the Supplies Make sure your vodka is ice cold. Before making a vodka tonic, chill the vodka in the fridge overnight or at least for a few hours. Vodka drinks taste best with ice cold vodka. Use a highball glass. A pint glass will be far too large for a vodka tonic and can water the drink down as you fill the glass with ice. Ideally, a highball glass should be used for a vodka tonic. If you don't have a highball glass, opt for another short, squat glass. Fill the glass with ice cubes. Go for solid, large ice cubes over ice chips. Chips melt quicker and water down the drink. Fill the glass to the brim with ice cubes. Mixing the Drink Add your vodka. Measure out your vodka using a shot glass. Pour the vodka into the drink first. Most shot glasses are about 1.5 ounces. Top your vodka with soda. Measure out about five ounces of tonic water, again using a shot glass. Top off your drink with tonic water. The glass should be filled to near the brim. Stir lightly. Vodka tonics do not have to be stirred much, as this can kill the carbonation. Do some light stirring with a spoon or similar device. Adding Flavor Add fresh cranberries. Cranberries can add a nice, fruity flavor to a vodka tonic. Add a few fresh cranberries to the top of your glass. You can also add a splash of cranberry juice instead if you prefer. Mix in lemon or lime juice. Use a fresh lemon or lime if you go this route. Cut the lemon or lime into wedges and squeeze the juice into the drink. You can also place a lemon or lime wedge on the edge of a glass. Try mint leaves. Mint leaves can give your drink a nice, minty flavor. If you want to add some extra taste, garnish your drink with a few fresh mint leaves. Finished. ",
    "sentences": [
        " Preparing the Supplies Make sure your vodka is ice cold.",
        "Before making a vodka tonic, chill the vodka in the fridge overnight or at least for a few hours.",
        "Vodka drinks taste best with ice cold vodka.",
        "Use a highball glass.",
        "A pint glass will be far too large for a vodka tonic and can water the drink down as you fill the glass with ice.",
        "Ideally, a highball glass should be used for a vodka tonic.",
        "If you don't have a highball glass, opt for another short, squat glass.",
        "Fill the glass with ice cubes.",
        "Go for solid, large ice cubes over ice chips.",
        "Chips melt quicker and water down the drink.",
        "Fill the glass to the brim with ice cubes.",
        "Mixing the Drink Add your vodka.",
        "Measure out your vodka using a shot glass.",
        "Pour the vodka into the drink first.",
        "Most shot glasses are about 1.5 ounces.",
        "Top your vodka with soda.",
        "Measure out about five ounces of tonic water, again using a shot glass.",
        "Top off your drink with tonic water.",
        "The glass should be filled to near the brim.",
        "Stir lightly.",
        "Vodka tonics do not have to be stirred much, as this can kill the carbonation.",
        "Do some light stirring with a spoon or similar device.",
        "Adding Flavor Add fresh cranberries.",
        "Cranberries can add a nice, fruity flavor to a vodka tonic.",
        "Add a few fresh cranberries to the top of your glass.",
        "You can also add a splash of cranberry juice instead if you prefer.",
        "Mix in lemon or lime juice.",
        "Use a fresh lemon or lime if you go this route.",
        "Cut the lemon or lime into wedges and squeeze the juice into the drink.",
        "You can also place a lemon or lime wedge on the edge of a glass.",
        "Try mint leaves.",
        "Mint leaves can give your drink a nice, minty flavor.",
        "If you want to add some extra taste, garnish your drink with a few fresh mint leaves.",
        "Finished."
    ]
}