{
    "title": "How to Thank Your Teachers",
    "url": "https://www.wikihow.com/Thank-Your-Teachers",
    "category_hierarchy": [
        "Relationships",
        "Social Interactions",
        "Etiquette"
    ],
    "methods": [
        {
            "name": "Writing Them a Thank You Note",
            "steps": [
                {
                    "headline": "Deliver or send a handwritten note.",
                    "description": "A physical card is much nicer than only sending an email to say thank you. It’s a more personal gesture and it is more meaningful than an ecard or email. It will also give your teacher a physical keepsake to remember their old students by. If you aren’t sure of your teacher’s mailing address, then you might need to do some investigating. Some options to try for locating the address include contacting the school directly or contacting the alumni or local teacher's associations. If the teacher you’re thanking is a high school teacher, then you can simply address the card to your teacher at the school’s address, which will be available on the main page of the school’s website. If you’re thanking a former college professor, then things get a little trickier. You’ll need to either call the office of the department in which your professor teaches to find out their specific mailing address or search the school’s website to find out the address of a particular department. For example, if you want to thank your former Political Science professor, then you will need to call or search the website of that department to find the correct mailing address for your professor. Do not send the card to the general university mailing address, as that is for school administrators, not faculty. College faculty are often very mobile, more so than K-12 teachers, so they might not still be teaching at the school where they taught you. If this is the case, you can contact the department office and ask for a forwarding address for them."
                },
                {
                    "headline": "Make or purchase a thank you card.",
                    "description": "When you go shopping for a thank you card, keep in mind what you want to convey with your card. Do you want it to be serious or would you prefer a more playful message and design? Make sure the tone of your thank you card is appropriate for the relationship you have with your teacher. If you’re unsure, err on the side of caution. You’ll be personalizing the card, so pictures on the card are less important. A handmade card is also a wonderful gesture! It shows a little more effort on your part and is easy to create. You can simply fold a piece of paper in half widthwise and include a combination of illustrations and words on both the inside and outside."
                },
                {
                    "headline": "Address them properly.",
                    "description": "Your card should begin with \"Dear [teacher's name].\" To ensure that your thank you note doesn't feel stiff or sound strange, address your teacher the way you addressed them in class. For example, use \"Ms. Smith,\" \"Dr. Jones,\" or \"Amy,\" depending on how you referred to them in class. Likewise, if your college professor has their doctorate, use “Dr.” and not “Mr.” or “Mrs.” If you’re unsure of their proper title, this will require some research on your part. Check out the university department’s website. There is usually a faculty page with brief biographies and resumes that will let you know whether “Dr.” is the right title to use."
                },
                {
                    "headline": "Specify why you appreciate them.",
                    "description": "Teachers love to get positive feedback from their students, so you should let them know specifically what they did that endeared them to you. For example, did they stay after class to help you understand some course material better? Did they make an ordinary lecture interesting or inspiring? Were they flexible or understanding when you had personal issues during the school year? Be sure to say thank you, but also make sure to include specifics."
                },
                {
                    "headline": "Keep it professional.",
                    "description": "Begin your letter with “Dear [Name]” and make sure that you use proper grammar and punctuation throughout. Avoid using “hey” as your greeting because that’s not a respectful, professional greeting. If you’re worried you’ll make a mistake while writing, try writing your message on a separate piece of paper and then transcribing it onto the card. This way you can avoid having to scribble out or white-out over mistakes."
                }
            ]
        },
        {
            "name": "Giving Them a Gift",
            "steps": [
                {
                    "headline": "Consider giving a homemade gift.",
                    "description": "You don’t need to feel like your gift needs to be expensive or extravagant. Giving a gift to your teacher to say thank you is already going above and beyond, so think about giving a handmade gift. Gifts that represent an inside joke or are from a favorite local business are great choices. Think about what would be easiest for you to give. If you’re good at baking, try making cookies or cupcakes for them. Or, if you are creative and had them for a year long high school class, you might make a scrapbook or a photobook of your time in their class."
                },
                {
                    "headline": "Avoid gifting personal items.",
                    "description": "Even if you feel like you bonded with your teacher, don’t gift them personal items like perfumes or bath products. This can turn the gift from thoughtful to awkward quickly. Also avoid scented items like candles, as those are extremely taste-specific, and you might guess wrong, leaving your teacher with a scented candle they can't use."
                },
                {
                    "headline": "Donate to their classroom.",
                    "description": "If you can, a good way to show your appreciation to a K-12 teacher is to donate something back to their classroom. This doesn’t have to be monetary. You can donate some classroom supplies or you can donate your time. Volunteering to help them clean out their classroom or to help them with student projects is a great way to show your appreciation."
                },
                {
                    "headline": "Consider a gift card if you’re not sure what to give.",
                    "description": "If you aren’t close enough to your teacher or professor to know exactly what to give them, a gift card of a small amount to somewhere like Amazon, Starbucks, or a local shop or restaurant is always a safe bet. Don’t give a huge amount because that’s inappropriate for a gesture of thanks for a teacher. Giving your teacher a gift as a way of saying thank you is definitely a situation where the old saying “it’s the thought that counts” applies. The fact that you even made the effort is what they’ll remember, not the precise dollar amount of your gift or gift card. Shoot for $20 or less as a general rule, and even a $5 gift card would be appreciated."
                }
            ]
        },
        {
            "name": "Thinking Outside the Box",
            "steps": [
                {
                    "headline": "Give your teacher a positive evaluation.",
                    "description": "In college courses, teacher evaluations carry a lot of weight toward professors winning awards, receiving tenure, or simply feeling that they do a good job. An anonymous but impactful way to thank your teacher is to leave them a detailed positive evaluation specifying exactly what you loved about their course and what their dedication meant to you."
                },
                {
                    "headline": "Nominate them for a student-voted award.",
                    "description": "Many schools have superlative awards like \"Favorite Teacher\" or \"Best Art Teacher.\" Colleges have similar awards that are partially student voted or nominated like “Outstanding Physics Department Faculty” or \"Outstanding Adjunct Faculty.\" Do some investigative work if your teacher really went above and beyond and nominate them for an award. This will mean a lot to them and is a great way to thank them."
                },
                {
                    "headline": "Recommend them to others.",
                    "description": "If you loved a particular teacher or course, let others know! High enrollments in classes are often due to positive word of mouth, and this tells your teacher that they are doing something right. Even though this is an indirect thank you, student interest in classes matters to teachers at the high school and college levels. Spreading the word that they’re a great teacher will help them in this area and is a great way to show your appreciation."
                },
                {
                    "headline": "Stay in touch with them.",
                    "description": "Put some effort into maintaining a relationship with teachers you admire and learned a lot from. Send them an email on occasion or even stop by their classroom or office to see if they have a minute to chat. Staying in touch demonstrates the effect they had on you and your learning."
                },
                {
                    "headline": "Dedicate an accomplishment to them.",
                    "description": "This is especially applicable in college where you’re likely to have a major project or paper as part of your curriculum. Usually you can dedicate these to someone of your choice. If you had a teacher who influenced your choice of major, specialization, or direction in college, then you might want to consider dedicating a college accomplishment to them. For example, if you had a History teacher, high school or college, who really got you interested in the Battle of Gettysburg and you end up writing your senior thesis or Master’s thesis on that subject, then it would be appropriate (but not required!) for you to dedicate that project to them. This is a great way to show your teacher not only that you appreciate them, but also that what you learned in their class stuck with you over the years."
                }
            ]
        }
    ],
    "tyn": [
        "Thank you card",
        "Stamps",
        "A gift"
    ],
    "text": " Writing Them a Thank You Note Deliver or send a handwritten note. A physical card is much nicer than only sending an email to say thank you. It’s a more personal gesture and it is more meaningful than an ecard or email. It will also give your teacher a physical keepsake to remember their old students by. If you aren’t sure of your teacher’s mailing address, then you might need to do some investigating. Some options to try for locating the address include contacting the school directly or contacting the alumni or local teacher's associations. If the teacher you’re thanking is a high school teacher, then you can simply address the card to your teacher at the school’s address, which will be available on the main page of the school’s website. If you’re thanking a former college professor, then things get a little trickier. You’ll need to either call the office of the department in which your professor teaches to find out their specific mailing address or search the school’s website to find out the address of a particular department. For example, if you want to thank your former Political Science professor, then you will need to call or search the website of that department to find the correct mailing address for your professor. Do not send the card to the general university mailing address, as that is for school administrators, not faculty. College faculty are often very mobile, more so than K-12 teachers, so they might not still be teaching at the school where they taught you. If this is the case, you can contact the department office and ask for a forwarding address for them. Make or purchase a thank you card. When you go shopping for a thank you card, keep in mind what you want to convey with your card. Do you want it to be serious or would you prefer a more playful message and design? Make sure the tone of your thank you card is appropriate for the relationship you have with your teacher. If you’re unsure, err on the side of caution. You’ll be personalizing the card, so pictures on the card are less important. A handmade card is also a wonderful gesture! It shows a little more effort on your part and is easy to create. You can simply fold a piece of paper in half widthwise and include a combination of illustrations and words on both the inside and outside. Address them properly. Your card should begin with \"Dear [teacher's name].\" To ensure that your thank you note doesn't feel stiff or sound strange, address your teacher the way you addressed them in class. For example, use \"Ms. Smith,\" \"Dr. Jones,\" or \"Amy,\" depending on how you referred to them in class. Likewise, if your college professor has their doctorate, use “Dr.” and not “Mr.” or “Mrs.” If you’re unsure of their proper title, this will require some research on your part. Check out the university department’s website. There is usually a faculty page with brief biographies and resumes that will let you know whether “Dr.” is the right title to use. Specify why you appreciate them. Teachers love to get positive feedback from their students, so you should let them know specifically what they did that endeared them to you. For example, did they stay after class to help you understand some course material better? Did they make an ordinary lecture interesting or inspiring? Were they flexible or understanding when you had personal issues during the school year? Be sure to say thank you, but also make sure to include specifics. Keep it professional. Begin your letter with “Dear [Name]” and make sure that you use proper grammar and punctuation throughout. Avoid using “hey” as your greeting because that’s not a respectful, professional greeting. If you’re worried you’ll make a mistake while writing, try writing your message on a separate piece of paper and then transcribing it onto the card. This way you can avoid having to scribble out or white-out over mistakes. Giving Them a Gift Consider giving a homemade gift. You don’t need to feel like your gift needs to be expensive or extravagant. Giving a gift to your teacher to say thank you is already going above and beyond, so think about giving a handmade gift. Gifts that represent an inside joke or are from a favorite local business are great choices. Think about what would be easiest for you to give. If you’re good at baking, try making cookies or cupcakes for them. Or, if you are creative and had them for a year long high school class, you might make a scrapbook or a photobook of your time in their class. Avoid gifting personal items. Even if you feel like you bonded with your teacher, don’t gift them personal items like perfumes or bath products. This can turn the gift from thoughtful to awkward quickly. Also avoid scented items like candles, as those are extremely taste-specific, and you might guess wrong, leaving your teacher with a scented candle they can't use. Donate to their classroom. If you can, a good way to show your appreciation to a K-12 teacher is to donate something back to their classroom. This doesn’t have to be monetary. You can donate some classroom supplies or you can donate your time. Volunteering to help them clean out their classroom or to help them with student projects is a great way to show your appreciation. Consider a gift card if you’re not sure what to give. If you aren’t close enough to your teacher or professor to know exactly what to give them, a gift card of a small amount to somewhere like Amazon, Starbucks, or a local shop or restaurant is always a safe bet. Don’t give a huge amount because that’s inappropriate for a gesture of thanks for a teacher. Giving your teacher a gift as a way of saying thank you is definitely a situation where the old saying “it’s the thought that counts” applies. The fact that you even made the effort is what they’ll remember, not the precise dollar amount of your gift or gift card. Shoot for $20 or less as a general rule, and even a $5 gift card would be appreciated. Thinking Outside the Box Give your teacher a positive evaluation. In college courses, teacher evaluations carry a lot of weight toward professors winning awards, receiving tenure, or simply feeling that they do a good job. An anonymous but impactful way to thank your teacher is to leave them a detailed positive evaluation specifying exactly what you loved about their course and what their dedication meant to you. Nominate them for a student-voted award. Many schools have superlative awards like \"Favorite Teacher\" or \"Best Art Teacher.\" Colleges have similar awards that are partially student voted or nominated like “Outstanding Physics Department Faculty” or \"Outstanding Adjunct Faculty.\" Do some investigative work if your teacher really went above and beyond and nominate them for an award. This will mean a lot to them and is a great way to thank them. Recommend them to others. If you loved a particular teacher or course, let others know! High enrollments in classes are often due to positive word of mouth, and this tells your teacher that they are doing something right. Even though this is an indirect thank you, student interest in classes matters to teachers at the high school and college levels. Spreading the word that they’re a great teacher will help them in this area and is a great way to show your appreciation. Stay in touch with them. Put some effort into maintaining a relationship with teachers you admire and learned a lot from. Send them an email on occasion or even stop by their classroom or office to see if they have a minute to chat. Staying in touch demonstrates the effect they had on you and your learning. Dedicate an accomplishment to them. This is especially applicable in college where you’re likely to have a major project or paper as part of your curriculum. Usually you can dedicate these to someone of your choice. If you had a teacher who influenced your choice of major, specialization, or direction in college, then you might want to consider dedicating a college accomplishment to them. For example, if you had a History teacher, high school or college, who really got you interested in the Battle of Gettysburg and you end up writing your senior thesis or Master’s thesis on that subject, then it would be appropriate (but not required!) for you to dedicate that project to them. This is a great way to show your teacher not only that you appreciate them, but also that what you learned in their class stuck with you over the years.",
    "sentences": [
        " Writing Them a Thank You Note Deliver or send a handwritten note.",
        "A physical card is much nicer than only sending an email to say thank you.",
        "It’s a more personal gesture and it is more meaningful than an ecard or email.",
        "It will also give your teacher a physical keepsake to remember their old students by.",
        "If you aren’t sure of your teacher’s mailing address, then you might need to do some investigating.",
        "Some options to try for locating the address include contacting the school directly or contacting the alumni or local teacher's associations.",
        "If the teacher you’re thanking is a high school teacher, then you can simply address the card to your teacher at the school’s address, which will be available on the main page of the school’s website.",
        "If you’re thanking a former college professor, then things get a little trickier.",
        "You’ll need to either call the office of the department in which your professor teaches to find out their specific mailing address or search the school’s website to find out the address of a particular department.",
        "For example, if you want to thank your former Political Science professor, then you will need to call or search the website of that department to find the correct mailing address for your professor.",
        "Do not send the card to the general university mailing address, as that is for school administrators, not faculty.",
        "College faculty are often very mobile, more so than K-12 teachers, so they might not still be teaching at the school where they taught you.",
        "If this is the case, you can contact the department office and ask for a forwarding address for them.",
        "Make or purchase a thank you card.",
        "When you go shopping for a thank you card, keep in mind what you want to convey with your card.",
        "Do you want it to be serious or would you prefer a more playful message and design?",
        "Make sure the tone of your thank you card is appropriate for the relationship you have with your teacher.",
        "If you’re unsure, err on the side of caution.",
        "You’ll be personalizing the card, so pictures on the card are less important.",
        "A handmade card is also a wonderful gesture!",
        "It shows a little more effort on your part and is easy to create.",
        "You can simply fold a piece of paper in half widthwise and include a combination of illustrations and words on both the inside and outside.",
        "Address them properly.",
        "Your card should begin with \"Dear [teacher's name].\"",
        "To ensure that your thank you note doesn't feel stiff or sound strange, address your teacher the way you addressed them in class.",
        "For example, use \"Ms. Smith,\" \"Dr. Jones,\" or \"Amy,\" depending on how you referred to them in class.",
        "Likewise, if your college professor has their doctorate, use “Dr.” and not “Mr.” or “Mrs.” If you’re unsure of their proper title, this will require some research on your part.",
        "Check out the university department’s website.",
        "There is usually a faculty page with brief biographies and resumes that will let you know whether “Dr.” is the right title to use.",
        "Specify why you appreciate them.",
        "Teachers love to get positive feedback from their students, so you should let them know specifically what they did that endeared them to you.",
        "For example, did they stay after class to help you understand some course material better?",
        "Did they make an ordinary lecture interesting or inspiring?",
        "Were they flexible or understanding when you had personal issues during the school year?",
        "Be sure to say thank you, but also make sure to include specifics.",
        "Keep it professional.",
        "Begin your letter with “Dear [Name]” and make sure that you use proper grammar and punctuation throughout.",
        "Avoid using “hey” as your greeting because that’s not a respectful, professional greeting.",
        "If you’re worried you’ll make a mistake while writing, try writing your message on a separate piece of paper and then transcribing it onto the card.",
        "This way you can avoid having to scribble out or white-out over mistakes.",
        "Giving Them a Gift Consider giving a homemade gift.",
        "You don’t need to feel like your gift needs to be expensive or extravagant.",
        "Giving a gift to your teacher to say thank you is already going above and beyond, so think about giving a handmade gift.",
        "Gifts that represent an inside joke or are from a favorite local business are great choices.",
        "Think about what would be easiest for you to give.",
        "If you’re good at baking, try making cookies or cupcakes for them.",
        "Or, if you are creative and had them for a year long high school class, you might make a scrapbook or a photobook of your time in their class.",
        "Avoid gifting personal items.",
        "Even if you feel like you bonded with your teacher, don’t gift them personal items like perfumes or bath products.",
        "This can turn the gift from thoughtful to awkward quickly.",
        "Also avoid scented items like candles, as those are extremely taste-specific, and you might guess wrong, leaving your teacher with a scented candle they can't use.",
        "Donate to their classroom.",
        "If you can, a good way to show your appreciation to a K-12 teacher is to donate something back to their classroom.",
        "This doesn’t have to be monetary.",
        "You can donate some classroom supplies or you can donate your time.",
        "Volunteering to help them clean out their classroom or to help them with student projects is a great way to show your appreciation.",
        "Consider a gift card if you’re not sure what to give.",
        "If you aren’t close enough to your teacher or professor to know exactly what to give them, a gift card of a small amount to somewhere like Amazon, Starbucks, or a local shop or restaurant is always a safe bet.",
        "Don’t give a huge amount because that’s inappropriate for a gesture of thanks for a teacher.",
        "Giving your teacher a gift as a way of saying thank you is definitely a situation where the old saying “it’s the thought that counts” applies.",
        "The fact that you even made the effort is what they’ll remember, not the precise dollar amount of your gift or gift card.",
        "Shoot for $20 or less as a general rule, and even a $5 gift card would be appreciated.",
        "Thinking Outside the Box Give your teacher a positive evaluation.",
        "In college courses, teacher evaluations carry a lot of weight toward professors winning awards, receiving tenure, or simply feeling that they do a good job.",
        "An anonymous but impactful way to thank your teacher is to leave them a detailed positive evaluation specifying exactly what you loved about their course and what their dedication meant to you.",
        "Nominate them for a student-voted award.",
        "Many schools have superlative awards like \"Favorite Teacher\" or \"Best Art Teacher.\"",
        "Colleges have similar awards that are partially student voted or nominated like “Outstanding Physics Department Faculty” or \"Outstanding Adjunct Faculty.\"",
        "Do some investigative work if your teacher really went above and beyond and nominate them for an award.",
        "This will mean a lot to them and is a great way to thank them.",
        "Recommend them to others.",
        "If you loved a particular teacher or course, let others know!",
        "High enrollments in classes are often due to positive word of mouth, and this tells your teacher that they are doing something right.",
        "Even though this is an indirect thank you, student interest in classes matters to teachers at the high school and college levels.",
        "Spreading the word that they’re a great teacher will help them in this area and is a great way to show your appreciation.",
        "Stay in touch with them.",
        "Put some effort into maintaining a relationship with teachers you admire and learned a lot from.",
        "Send them an email on occasion or even stop by their classroom or office to see if they have a minute to chat.",
        "Staying in touch demonstrates the effect they had on you and your learning.",
        "Dedicate an accomplishment to them.",
        "This is especially applicable in college where you’re likely to have a major project or paper as part of your curriculum.",
        "Usually you can dedicate these to someone of your choice.",
        "If you had a teacher who influenced your choice of major, specialization, or direction in college, then you might want to consider dedicating a college accomplishment to them.",
        "For example, if you had a History teacher, high school or college, who really got you interested in the Battle of Gettysburg and you end up writing your senior thesis or Master’s thesis on that subject, then it would be appropriate (but not required!)",
        "for you to dedicate that project to them.",
        "This is a great way to show your teacher not only that you appreciate them, but also that what you learned in their class stuck with you over the years."
    ]
}