{
    "title": "How to Change Teen Diapers",
    "url": "https://www.wikihow.com/Change-Teen-Diapers",
    "category_hierarchy": [
        "Health",
        "Health for Older Adults",
        "Aging Associated Health Conditions"
    ],
    "parts": [
        {
            "name": "Getting Ready",
            "steps": [
                {
                    "headline": "Look for signs.",
                    "description": "Watch for indications that they need a diaper change. In case of soiling accidents, it is usually easy to smell and you may have noticed they were standing in an easily discoverable \"soiling\" position and even heard them farting loud. How often this occurs will depends on a number of factors (health of the person, etc.). Plan on changing (or assisting if needed) a teen diaper about five to eight times each day, however. If possible, remind them to change themselves if they are able to do so. Create a changing schedule and adjust it as necessary for additional dirty diapers."
                },
                {
                    "headline": "Do a discreet verbal or physical check.",
                    "description": "With more independent teens, you can ask them if they need help with a diaper change. If they are less independent, you may need to do a visual check. Quickly peek inside the back and front of the diaper to see if it is wet or soiled. They may resist your need to check if they need a diaper change, so be sensitive to their feelings. Respect their privacy and dignity as you check. Consider developing a code phrase, such as: “Do you need a break?” or \"It doesn't smell like roses here - do you need to get some fresh air?\" Prepare to change or have them change the diaper as soon as possible. Delays in a cheaper diaper can contribute to the development of a urinary tract infections, skin irritation, and rashes."
                },
                {
                    "headline": "Go to a changing area.",
                    "description": "If you are in a home setting, head into the restroom area or a room with extra space. If you are “out and about” it gets a bit more challenging. Go to a public restroom and head into an extra-large stall, a handicapped stall or a separate family restroom, if one is available. It is important that the space is big enough for the both of you and that it is clean. Sometimes you may find a restroom with an extra large changing table. If you're around other people, simply say, “Excuse us for a moment, we’ll be right back,” and leave it at that. If you have options, choose the bathroom stall with extra handrails and/or purse shelves (for changing supplies)."
                },
                {
                    "headline": "Maintain privacy.",
                    "description": "Always lock the bathroom door behind you. If there are people standing outside of the bathroom area, feel free to ask them to give you some space as well. Likewise, if you are in a public space, use hushed tones when completing the change. Do not complain aloud or you will further frazzle and embarrass the teenager."
                },
                {
                    "headline": "Set up the supplies.",
                    "description": "If you are out, you should carry a sturdy diaper bag that contains the following: diapers, disposable underpads, wipes, barrier skin cream, a pair of gloves, and hand sanitizer. Unpack these items and place them nearby for the changing process. If the teenager is able, you might ask them to assist by holding the wipes or the fresh diaper. A disposable underpad is just one of many options to provide a barrier between the teen and the changing surface. You can also use a folded shower curtain, a waterproof picnic blanket, or a homemade padded changing mattress covered in soft vinyl. It's easy to forget or run out of a necessary item. Do a quick inventory of your diaper bag before heading out to ensure you have everything you need. If you're in a public restroom and can't set out the items, leave them in the bag and pull them out as needed. The fewer supplies that are contaminated with germs, the better."
                },
                {
                    "headline": "Make any room adjustments.",
                    "description": "If you need to move something to make additional room on the floor in a room, do so. Pay attention to the temperature as well. You do not want the room to be too hot or too cold as it will make the changing process all the more uncomfortable. Adjust the thermostat if you can and if it is necessary."
                },
                {
                    "headline": "Prepare for the changing position.",
                    "description": "How do you this depends on how mobile your teen is. Standing would be the easiest, but if your teen is unable to stand up, or has soiled the diaper heavily, then you will need to set up the room for a laying down change. For a laying down change, place an underpad on the ground or bed. If a changing table is available, clean the plastic cover with a disinfecting wipe. For a seated change, place the underpad on a chair seat or bench. For a standing change, place the underpad on the ground with reach access to a wall, if needed for support."
                }
            ]
        },
        {
            "name": "Removing the Soiled Diaper",
            "steps": [
                {
                    "headline": "Wash your hands or use hand sanitizer.",
                    "description": "Many people will also prefer to put on latex gloves at this point. The goal is to prevent the spreading of germs from you to the teen and vice versa."
                },
                {
                    "headline": "Change in a standing position.",
                    "description": "This is generally the best option for teens as it is the least stressful and usually the quickest. This position also requires very little space, making it a good choice for small restrooms and other cramped areas. Start by putting an underpad on the ground, ask the teen to stand on the underpad, then pull down their pants until they are bunched around their ankles. Release the diaper side-tabs while holding the diaper in place. Use your other hand to wipe the area clean, starting at the back. Once it's clean, pull down the diaper, wipe the front area clean with a fresh wipe, then dispose of the soiled diaper and wipes. If the teen needs support standing, they can grab a handrail (if available), use a walker, touch the wall or grip your shoulders for balance. If you think the diaper is heavily soiled, use caution in this position as it will be easier to get clothing dirty or make a mess in general."
                },
                {
                    "headline": "Change in a sitting position.",
                    "description": "This is a changing option in areas where seating is provided (e.g. family restroom benches) or in situations where the teen can lift themselves up from a seated position (in a wheelchair, for example), but are not fully capable of standing independently. Start by having the teen sit on a pre-placed underpad. If they are already seated, have them lift up briefly and scoot it under them. Have them raise up again to remove all lower clothing. Have them stay seated as you release the diaper side tabs. Ask them to lift up, then pull the diaper down. Wipe the back area, then the front. Pull out the diaper from under them and dispose of it, along with the wipes. Be aware that sitting position requires a degree of upper-body control on the part of the teen. They can rest seated directly on the underpad between movements, if needed, however."
                },
                {
                    "headline": "Change in a lying down position.",
                    "description": "This option can make teens feel very vulnerable and potentially embarrassed because they are diapered just like a baby in that position. However, for those teens with severely limited mobility or in case of soiling accidents, this is the best option - and also some teens prefer to be changed laying down because they are used from early childhood to have their diaper changed in this position. Starting by helping the teen to the floor, to the changing table (if available) or to the bed (if changing in a room), where they will lay upon the underpad. Remove their lower clothes completely - including plastic pants if they wear those for extra protection. Release the diaper tapes, pulling it loose, but not off. Gently push the teen’s knees chest-ward by applying pressure with your forearm behind the knees. Wipe them clean from front to back, placing used wipes in the diaper. When done, pull the soiled diaper out. When removing clothes, look for signs that the diaper has leaked. If they got wet or soiled, replace them with clean ones. This includes dirty plastic pants which you can also change. Put all wet or dirty clothes in a plastic bag."
                }
            ]
        },
        {
            "name": "Putting on a New Diaper",
            "steps": [
                {
                    "headline": "Be sure the teen's bottom is clean.",
                    "description": "Regardless of position, use as many wipes as you need to in order to make them completely clean. If possible, have them help with their own cleaning needs. Use wipes that are free of alcohol or added fragrances to reduce skin irritation. When you are done with cleaning, place the soiled wipes within the soiled diaper and fold it up for disposal. Make sure to wipe the teen from front to back. This prevents the spread of fecal bacteria and is especially important when changing teen girls and transgender boys."
                },
                {
                    "headline": "Apply skin cream.",
                    "description": "After you have finished cleaning, rub a zinc-based skin cream around the skin covered by the diaper. This will prevent chafing and rashes, especially in those teens who always wear diapers. This is an especially intimate step, so teens who are able may want to do this themselves. You can buy diaper cream in the form of an aerosol can. Your teen may prefer this option since you would not need to use your hands to apply the cream. If you see a diaper rash that is dark red or heavily raised, seek medical advice. Long-term rashes can get infected and lead to other health problems."
                },
                {
                    "headline": "Put on the new diaper and clothing.",
                    "description": "Grab and unfold the fresh diaper and pull it up between their legs, securing it at both sides by fastening the tapes. Make sure that it's form-fitting without any gaps around the legs or waist, and that it doesn't impede movement. When you're done, put their lower garments back on. In the standing position, you'll need to use one hand to hold the diaper in place and another to secure the tabs. In the sitting position, you will need to have the teen raise up in order to place the fresh diaper between their legs and secure it. In the laying down position, you will want to keep their knees bent as you place the diaper, releasing them after it is in place, then you secure the tabs."
                },
                {
                    "headline": "Dispose of anything soiled.",
                    "description": "Place the soiled diaper in the trash or in a diaper bin. Dispose of any wipes that may have fallen on the floor or elsewhere during the process. Look over the area to make sure that it appears the same as it did when you arrived."
                },
                {
                    "headline": "Wash your hands again.",
                    "description": "When you are finished it is even more important to wash your hands or use hand sanitizer, even if you were wearing gloves. It is also a good idea to ask the teen to wash their hands as well."
                },
                {
                    "headline": "Pack up your supplies.",
                    "description": "Make sure that you packed everything back up into the diaper bag if you are out in public. It is very easy to forget wipes, for example, in a rush to get out of the restroom. Ask the teen to help you look around by saying, “Do you see anything I’ve missed-are we good to go?”"
                }
            ]
        },
        {
            "name": "Managing Any Challenges",
            "steps": [
                {
                    "headline": "Stay calm.",
                    "description": "To relax you both, you might say, “Stay calm, it will all be okay.” Or, “Trust me, we’ve done this many times before.” If a teen refuses to leave for a diaper change, it may also help to set a time limit on resistance, such as, “Okay, I see that you are busy, so we can wait for a bit, but come see me in five minutes.”\nIf you feel the need to lash out or say something negative, take a deep breath and count to five."
                },
                {
                    "headline": "Empathize.",
                    "description": "Recognize that your teen may be embarrassed by the diapering process. You can lessen some of these social issues by changing your teen only in private spaces, such as bathrooms. Don’t talk openly about your teen’s diapering needs and be tactful about telling your teen that it is time for a change. Ask the teen for suggestions on how to improve the process and lessen their anxiety or embarrassment."
                },
                {
                    "headline": "Counter physical resistance.",
                    "description": "A teenager might resist the entire diapering process. If so, be prepared for this challenge by reminding yourself to stay calm and in control. Resist the desire to physically restrain them, or to spank, as it will only cause more problems in the future. Channel the teen’s aggression into the diapering process by asking them to assist with preparing the supplies or the room. You could say, “Look how strong you are, could you use some of your strength to help me do this? It will go much faster.”\nTell the teen that you're only trying to help them and that it's not okay for them to hurt you in the process. You might say, “I understand that you're frustrated, but hitting me is wrong and you need to stop.”\nIf you feel physically in danger, stop the diapering process and try again after a 15-minute cooldown period."
                },
                {
                    "headline": "Offer positive reinforcement.",
                    "description": "If a teen usually resists changing, be sure to offer praise if everything goes smoothly. At the end of the change, you might observe, “Thank you so much for helping out! Did you notice how quickly that went?”\nOffer an incentive for cooperative behavior in the future. For example, say, “If we have a week with no arguments over diaper changes, we'll go out to your favorite restaurant.”\nChange it into a positive situation for both you and your teen. Use the time to talk about everything else than the diaper change."
                },
                {
                    "headline": "Ask for help.",
                    "description": "You may not be able to complete the changing process on your own, especially if your teen physically resists. If this happens, ask your teen for help and then reach out to others, if necessary. For example, when changing at home you may call-out to other family members. Choose someone your teen trusts, or ask them who they want to help, if possible. This should be a last resort, as it may violate the teen's privacy."
                }
            ]
        }
    ],
    "tyn": [
        "Diapers",
        "Barrier skin cream",
        "Underpad or other waterproof pad",
        "Diaper bag",
        "Wipes",
        "Latex gloves",
        "Hand sanitizer"
    ],
    "text": " Getting Ready Look for signs. Watch for indications that they need a diaper change. In case of soiling accidents, it is usually easy to smell and you may have noticed they were standing in an easily discoverable \"soiling\" position and even heard them farting loud. How often this occurs will depends on a number of factors (health of the person, etc.). Plan on changing (or assisting if needed) a teen diaper about five to eight times each day, however. If possible, remind them to change themselves if they are able to do so. Create a changing schedule and adjust it as necessary for additional dirty diapers. Do a discreet verbal or physical check. With more independent teens, you can ask them if they need help with a diaper change. If they are less independent, you may need to do a visual check. Quickly peek inside the back and front of the diaper to see if it is wet or soiled. They may resist your need to check if they need a diaper change, so be sensitive to their feelings. Respect their privacy and dignity as you check. Consider developing a code phrase, such as: “Do you need a break?” or \"It doesn't smell like roses here - do you need to get some fresh air?\" Prepare to change or have them change the diaper as soon as possible. Delays in a cheaper diaper can contribute to the development of a urinary tract infections, skin irritation, and rashes. Go to a changing area. If you are in a home setting, head into the restroom area or a room with extra space. If you are “out and about” it gets a bit more challenging. Go to a public restroom and head into an extra-large stall, a handicapped stall or a separate family restroom, if one is available. It is important that the space is big enough for the both of you and that it is clean. Sometimes you may find a restroom with an extra large changing table. If you're around other people, simply say, “Excuse us for a moment, we’ll be right back,” and leave it at that. If you have options, choose the bathroom stall with extra handrails and/or purse shelves (for changing supplies). Maintain privacy. Always lock the bathroom door behind you. If there are people standing outside of the bathroom area, feel free to ask them to give you some space as well. Likewise, if you are in a public space, use hushed tones when completing the change. Do not complain aloud or you will further frazzle and embarrass the teenager. Set up the supplies. If you are out, you should carry a sturdy diaper bag that contains the following: diapers, disposable underpads, wipes, barrier skin cream, a pair of gloves, and hand sanitizer. Unpack these items and place them nearby for the changing process. If the teenager is able, you might ask them to assist by holding the wipes or the fresh diaper. A disposable underpad is just one of many options to provide a barrier between the teen and the changing surface. You can also use a folded shower curtain, a waterproof picnic blanket, or a homemade padded changing mattress covered in soft vinyl. It's easy to forget or run out of a necessary item. Do a quick inventory of your diaper bag before heading out to ensure you have everything you need. If you're in a public restroom and can't set out the items, leave them in the bag and pull them out as needed. The fewer supplies that are contaminated with germs, the better. Make any room adjustments. If you need to move something to make additional room on the floor in a room, do so. Pay attention to the temperature as well. You do not want the room to be too hot or too cold as it will make the changing process all the more uncomfortable. Adjust the thermostat if you can and if it is necessary. Prepare for the changing position. How do you this depends on how mobile your teen is. Standing would be the easiest, but if your teen is unable to stand up, or has soiled the diaper heavily, then you will need to set up the room for a laying down change. For a laying down change, place an underpad on the ground or bed. If a changing table is available, clean the plastic cover with a disinfecting wipe. For a seated change, place the underpad on a chair seat or bench. For a standing change, place the underpad on the ground with reach access to a wall, if needed for support. Removing the Soiled Diaper Wash your hands or use hand sanitizer. Many people will also prefer to put on latex gloves at this point. The goal is to prevent the spreading of germs from you to the teen and vice versa. Change in a standing position. This is generally the best option for teens as it is the least stressful and usually the quickest. This position also requires very little space, making it a good choice for small restrooms and other cramped areas. Start by putting an underpad on the ground, ask the teen to stand on the underpad, then pull down their pants until they are bunched around their ankles. Release the diaper side-tabs while holding the diaper in place. Use your other hand to wipe the area clean, starting at the back. Once it's clean, pull down the diaper, wipe the front area clean with a fresh wipe, then dispose of the soiled diaper and wipes. If the teen needs support standing, they can grab a handrail (if available), use a walker, touch the wall or grip your shoulders for balance. If you think the diaper is heavily soiled, use caution in this position as it will be easier to get clothing dirty or make a mess in general. Change in a sitting position. This is a changing option in areas where seating is provided (e.g. family restroom benches) or in situations where the teen can lift themselves up from a seated position (in a wheelchair, for example), but are not fully capable of standing independently. Start by having the teen sit on a pre-placed underpad. If they are already seated, have them lift up briefly and scoot it under them. Have them raise up again to remove all lower clothing. Have them stay seated as you release the diaper side tabs. Ask them to lift up, then pull the diaper down. Wipe the back area, then the front. Pull out the diaper from under them and dispose of it, along with the wipes. Be aware that sitting position requires a degree of upper-body control on the part of the teen. They can rest seated directly on the underpad between movements, if needed, however. Change in a lying down position. This option can make teens feel very vulnerable and potentially embarrassed because they are diapered just like a baby in that position. However, for those teens with severely limited mobility or in case of soiling accidents, this is the best option - and also some teens prefer to be changed laying down because they are used from early childhood to have their diaper changed in this position. Starting by helping the teen to the floor, to the changing table (if available) or to the bed (if changing in a room), where they will lay upon the underpad. Remove their lower clothes completely - including plastic pants if they wear those for extra protection. Release the diaper tapes, pulling it loose, but not off. Gently push the teen’s knees chest-ward by applying pressure with your forearm behind the knees. Wipe them clean from front to back, placing used wipes in the diaper. When done, pull the soiled diaper out. When removing clothes, look for signs that the diaper has leaked. If they got wet or soiled, replace them with clean ones. This includes dirty plastic pants which you can also change. Put all wet or dirty clothes in a plastic bag. Putting on a New Diaper Be sure the teen's bottom is clean. Regardless of position, use as many wipes as you need to in order to make them completely clean. If possible, have them help with their own cleaning needs. Use wipes that are free of alcohol or added fragrances to reduce skin irritation. When you are done with cleaning, place the soiled wipes within the soiled diaper and fold it up for disposal. Make sure to wipe the teen from front to back. This prevents the spread of fecal bacteria and is especially important when changing teen girls and transgender boys. Apply skin cream. After you have finished cleaning, rub a zinc-based skin cream around the skin covered by the diaper. This will prevent chafing and rashes, especially in those teens who always wear diapers. This is an especially intimate step, so teens who are able may want to do this themselves. You can buy diaper cream in the form of an aerosol can. Your teen may prefer this option since you would not need to use your hands to apply the cream. If you see a diaper rash that is dark red or heavily raised, seek medical advice. Long-term rashes can get infected and lead to other health problems. Put on the new diaper and clothing. Grab and unfold the fresh diaper and pull it up between their legs, securing it at both sides by fastening the tapes. Make sure that it's form-fitting without any gaps around the legs or waist, and that it doesn't impede movement. When you're done, put their lower garments back on. In the standing position, you'll need to use one hand to hold the diaper in place and another to secure the tabs. In the sitting position, you will need to have the teen raise up in order to place the fresh diaper between their legs and secure it. In the laying down position, you will want to keep their knees bent as you place the diaper, releasing them after it is in place, then you secure the tabs. Dispose of anything soiled. Place the soiled diaper in the trash or in a diaper bin. Dispose of any wipes that may have fallen on the floor or elsewhere during the process. Look over the area to make sure that it appears the same as it did when you arrived. Wash your hands again. When you are finished it is even more important to wash your hands or use hand sanitizer, even if you were wearing gloves. It is also a good idea to ask the teen to wash their hands as well. Pack up your supplies. Make sure that you packed everything back up into the diaper bag if you are out in public. It is very easy to forget wipes, for example, in a rush to get out of the restroom. Ask the teen to help you look around by saying, “Do you see anything I’ve missed-are we good to go?” Managing Any Challenges Stay calm. To relax you both, you might say, “Stay calm, it will all be okay.” Or, “Trust me, we’ve done this many times before.” If a teen refuses to leave for a diaper change, it may also help to set a time limit on resistance, such as, “Okay, I see that you are busy, so we can wait for a bit, but come see me in five minutes.”\nIf you feel the need to lash out or say something negative, take a deep breath and count to five. Empathize. Recognize that your teen may be embarrassed by the diapering process. You can lessen some of these social issues by changing your teen only in private spaces, such as bathrooms. Don’t talk openly about your teen’s diapering needs and be tactful about telling your teen that it is time for a change. Ask the teen for suggestions on how to improve the process and lessen their anxiety or embarrassment. Counter physical resistance. A teenager might resist the entire diapering process. If so, be prepared for this challenge by reminding yourself to stay calm and in control. Resist the desire to physically restrain them, or to spank, as it will only cause more problems in the future. Channel the teen’s aggression into the diapering process by asking them to assist with preparing the supplies or the room. You could say, “Look how strong you are, could you use some of your strength to help me do this? It will go much faster.”\nTell the teen that you're only trying to help them and that it's not okay for them to hurt you in the process. You might say, “I understand that you're frustrated, but hitting me is wrong and you need to stop.”\nIf you feel physically in danger, stop the diapering process and try again after a 15-minute cooldown period. Offer positive reinforcement. If a teen usually resists changing, be sure to offer praise if everything goes smoothly. At the end of the change, you might observe, “Thank you so much for helping out! Did you notice how quickly that went?”\nOffer an incentive for cooperative behavior in the future. For example, say, “If we have a week with no arguments over diaper changes, we'll go out to your favorite restaurant.”\nChange it into a positive situation for both you and your teen. Use the time to talk about everything else than the diaper change. Ask for help. You may not be able to complete the changing process on your own, especially if your teen physically resists. If this happens, ask your teen for help and then reach out to others, if necessary. For example, when changing at home you may call-out to other family members. Choose someone your teen trusts, or ask them who they want to help, if possible. This should be a last resort, as it may violate the teen's privacy.",
    "sentences": [
        " Getting Ready Look for signs.",
        "Watch for indications that they need a diaper change.",
        "In case of soiling accidents, it is usually easy to smell and you may have noticed they were standing in an easily discoverable \"soiling\" position and even heard them farting loud.",
        "How often this occurs will depends on a number of factors (health of the person, etc.).",
        "Plan on changing (or assisting if needed) a teen diaper about five to eight times each day, however.",
        "If possible, remind them to change themselves if they are able to do so.",
        "Create a changing schedule and adjust it as necessary for additional dirty diapers.",
        "Do a discreet verbal or physical check.",
        "With more independent teens, you can ask them if they need help with a diaper change.",
        "If they are less independent, you may need to do a visual check.",
        "Quickly peek inside the back and front of the diaper to see if it is wet or soiled.",
        "They may resist your need to check if they need a diaper change, so be sensitive to their feelings.",
        "Respect their privacy and dignity as you check.",
        "Consider developing a code phrase, such as: “Do you need a break?” or \"It doesn't smell like roses here - do you need to get some fresh air?\"",
        "Prepare to change or have them change the diaper as soon as possible.",
        "Delays in a cheaper diaper can contribute to the development of a urinary tract infections, skin irritation, and rashes.",
        "Go to a changing area.",
        "If you are in a home setting, head into the restroom area or a room with extra space.",
        "If you are “out and about” it gets a bit more challenging.",
        "Go to a public restroom and head into an extra-large stall, a handicapped stall or a separate family restroom, if one is available.",
        "It is important that the space is big enough for the both of you and that it is clean.",
        "Sometimes you may find a restroom with an extra large changing table.",
        "If you're around other people, simply say, “Excuse us for a moment, we’ll be right back,” and leave it at that.",
        "If you have options, choose the bathroom stall with extra handrails and/or purse shelves (for changing supplies).",
        "Maintain privacy.",
        "Always lock the bathroom door behind you.",
        "If there are people standing outside of the bathroom area, feel free to ask them to give you some space as well.",
        "Likewise, if you are in a public space, use hushed tones when completing the change.",
        "Do not complain aloud or you will further frazzle and embarrass the teenager.",
        "Set up the supplies.",
        "If you are out, you should carry a sturdy diaper bag that contains the following: diapers, disposable underpads, wipes, barrier skin cream, a pair of gloves, and hand sanitizer.",
        "Unpack these items and place them nearby for the changing process.",
        "If the teenager is able, you might ask them to assist by holding the wipes or the fresh diaper.",
        "A disposable underpad is just one of many options to provide a barrier between the teen and the changing surface.",
        "You can also use a folded shower curtain, a waterproof picnic blanket, or a homemade padded changing mattress covered in soft vinyl.",
        "It's easy to forget or run out of a necessary item.",
        "Do a quick inventory of your diaper bag before heading out to ensure you have everything you need.",
        "If you're in a public restroom and can't set out the items, leave them in the bag and pull them out as needed.",
        "The fewer supplies that are contaminated with germs, the better.",
        "Make any room adjustments.",
        "If you need to move something to make additional room on the floor in a room, do so.",
        "Pay attention to the temperature as well.",
        "You do not want the room to be too hot or too cold as it will make the changing process all the more uncomfortable.",
        "Adjust the thermostat if you can and if it is necessary.",
        "Prepare for the changing position.",
        "How do you this depends on how mobile your teen is.",
        "Standing would be the easiest, but if your teen is unable to stand up, or has soiled the diaper heavily, then you will need to set up the room for a laying down change.",
        "For a laying down change, place an underpad on the ground or bed.",
        "If a changing table is available, clean the plastic cover with a disinfecting wipe.",
        "For a seated change, place the underpad on a chair seat or bench.",
        "For a standing change, place the underpad on the ground with reach access to a wall, if needed for support.",
        "Removing the Soiled Diaper Wash your hands or use hand sanitizer.",
        "Many people will also prefer to put on latex gloves at this point.",
        "The goal is to prevent the spreading of germs from you to the teen and vice versa.",
        "Change in a standing position.",
        "This is generally the best option for teens as it is the least stressful and usually the quickest.",
        "This position also requires very little space, making it a good choice for small restrooms and other cramped areas.",
        "Start by putting an underpad on the ground, ask the teen to stand on the underpad, then pull down their pants until they are bunched around their ankles.",
        "Release the diaper side-tabs while holding the diaper in place.",
        "Use your other hand to wipe the area clean, starting at the back.",
        "Once it's clean, pull down the diaper, wipe the front area clean with a fresh wipe, then dispose of the soiled diaper and wipes.",
        "If the teen needs support standing, they can grab a handrail (if available), use a walker, touch the wall or grip your shoulders for balance.",
        "If you think the diaper is heavily soiled, use caution in this position as it will be easier to get clothing dirty or make a mess in general.",
        "Change in a sitting position.",
        "This is a changing option in areas where seating is provided (e.g.",
        "family restroom benches) or in situations where the teen can lift themselves up from a seated position (in a wheelchair, for example), but are not fully capable of standing independently.",
        "Start by having the teen sit on a pre-placed underpad.",
        "If they are already seated, have them lift up briefly and scoot it under them.",
        "Have them raise up again to remove all lower clothing.",
        "Have them stay seated as you release the diaper side tabs.",
        "Ask them to lift up, then pull the diaper down.",
        "Wipe the back area, then the front.",
        "Pull out the diaper from under them and dispose of it, along with the wipes.",
        "Be aware that sitting position requires a degree of upper-body control on the part of the teen.",
        "They can rest seated directly on the underpad between movements, if needed, however.",
        "Change in a lying down position.",
        "This option can make teens feel very vulnerable and potentially embarrassed because they are diapered just like a baby in that position.",
        "However, for those teens with severely limited mobility or in case of soiling accidents, this is the best option - and also some teens prefer to be changed laying down because they are used from early childhood to have their diaper changed in this position.",
        "Starting by helping the teen to the floor, to the changing table (if available) or to the bed (if changing in a room), where they will lay upon the underpad.",
        "Remove their lower clothes completely - including plastic pants if they wear those for extra protection.",
        "Release the diaper tapes, pulling it loose, but not off.",
        "Gently push the teen’s knees chest-ward by applying pressure with your forearm behind the knees.",
        "Wipe them clean from front to back, placing used wipes in the diaper.",
        "When done, pull the soiled diaper out.",
        "When removing clothes, look for signs that the diaper has leaked.",
        "If they got wet or soiled, replace them with clean ones.",
        "This includes dirty plastic pants which you can also change.",
        "Put all wet or dirty clothes in a plastic bag.",
        "Putting on a New Diaper Be sure the teen's bottom is clean.",
        "Regardless of position, use as many wipes as you need to in order to make them completely clean.",
        "If possible, have them help with their own cleaning needs.",
        "Use wipes that are free of alcohol or added fragrances to reduce skin irritation.",
        "When you are done with cleaning, place the soiled wipes within the soiled diaper and fold it up for disposal.",
        "Make sure to wipe the teen from front to back.",
        "This prevents the spread of fecal bacteria and is especially important when changing teen girls and transgender boys.",
        "Apply skin cream.",
        "After you have finished cleaning, rub a zinc-based skin cream around the skin covered by the diaper.",
        "This will prevent chafing and rashes, especially in those teens who always wear diapers.",
        "This is an especially intimate step, so teens who are able may want to do this themselves.",
        "You can buy diaper cream in the form of an aerosol can.",
        "Your teen may prefer this option since you would not need to use your hands to apply the cream.",
        "If you see a diaper rash that is dark red or heavily raised, seek medical advice.",
        "Long-term rashes can get infected and lead to other health problems.",
        "Put on the new diaper and clothing.",
        "Grab and unfold the fresh diaper and pull it up between their legs, securing it at both sides by fastening the tapes.",
        "Make sure that it's form-fitting without any gaps around the legs or waist, and that it doesn't impede movement.",
        "When you're done, put their lower garments back on.",
        "In the standing position, you'll need to use one hand to hold the diaper in place and another to secure the tabs.",
        "In the sitting position, you will need to have the teen raise up in order to place the fresh diaper between their legs and secure it.",
        "In the laying down position, you will want to keep their knees bent as you place the diaper, releasing them after it is in place, then you secure the tabs.",
        "Dispose of anything soiled.",
        "Place the soiled diaper in the trash or in a diaper bin.",
        "Dispose of any wipes that may have fallen on the floor or elsewhere during the process.",
        "Look over the area to make sure that it appears the same as it did when you arrived.",
        "Wash your hands again.",
        "When you are finished it is even more important to wash your hands or use hand sanitizer, even if you were wearing gloves.",
        "It is also a good idea to ask the teen to wash their hands as well.",
        "Pack up your supplies.",
        "Make sure that you packed everything back up into the diaper bag if you are out in public.",
        "It is very easy to forget wipes, for example, in a rush to get out of the restroom.",
        "Ask the teen to help you look around by saying, “Do you see anything I’ve missed-are we good to go?” Managing Any Challenges Stay calm.",
        "To relax you both, you might say, “Stay calm, it will all be okay.” Or, “Trust me, we’ve done this many times before.” If a teen refuses to leave for a diaper change, it may also help to set a time limit on resistance, such as, “Okay, I see that you are busy, so we can wait for a bit, but come see me in five minutes.”\nIf you feel the need to lash out or say something negative, take a deep breath and count to five.",
        "Empathize.",
        "Recognize that your teen may be embarrassed by the diapering process.",
        "You can lessen some of these social issues by changing your teen only in private spaces, such as bathrooms.",
        "Don’t talk openly about your teen’s diapering needs and be tactful about telling your teen that it is time for a change.",
        "Ask the teen for suggestions on how to improve the process and lessen their anxiety or embarrassment.",
        "Counter physical resistance.",
        "A teenager might resist the entire diapering process.",
        "If so, be prepared for this challenge by reminding yourself to stay calm and in control.",
        "Resist the desire to physically restrain them, or to spank, as it will only cause more problems in the future.",
        "Channel the teen’s aggression into the diapering process by asking them to assist with preparing the supplies or the room.",
        "You could say, “Look how strong you are, could you use some of your strength to help me do this?",
        "It will go much faster.”\nTell the teen that you're only trying to help them and that it's not okay for them to hurt you in the process.",
        "You might say, “I understand that you're frustrated, but hitting me is wrong and you need to stop.”\nIf you feel physically in danger, stop the diapering process and try again after a 15-minute cooldown period.",
        "Offer positive reinforcement.",
        "If a teen usually resists changing, be sure to offer praise if everything goes smoothly.",
        "At the end of the change, you might observe, “Thank you so much for helping out!",
        "Did you notice how quickly that went?”\nOffer an incentive for cooperative behavior in the future.",
        "For example, say, “If we have a week with no arguments over diaper changes, we'll go out to your favorite restaurant.”\nChange it into a positive situation for both you and your teen.",
        "Use the time to talk about everything else than the diaper change.",
        "Ask for help.",
        "You may not be able to complete the changing process on your own, especially if your teen physically resists.",
        "If this happens, ask your teen for help and then reach out to others, if necessary.",
        "For example, when changing at home you may call-out to other family members.",
        "Choose someone your teen trusts, or ask them who they want to help, if possible.",
        "This should be a last resort, as it may violate the teen's privacy."
    ]
}