{
    "title": "How to Make Colored Salt",
    "url": "https://www.wikihow.com/Make-Colored-Salt",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "methods": [
        {
            "name": "Coloring Salt with Paint",
            "steps": [
                {
                    "headline": "Fill a container with salt.",
                    "description": "A jug or pitcher, a deep bowl, a plastic food container, etc. will all suffice."
                },
                {
                    "headline": "Squeeze a little tempera paint into the salt.",
                    "description": ""
                },
                {
                    "headline": "Mix with a spoon or other item.",
                    "description": "Stir until the paint is evenly distributed through the salt."
                },
                {
                    "headline": "Let stand overnight to dry.",
                    "description": "Make as many more colors as you need for your project. That way, they'll all be ready at the same time."
                },
                {
                    "headline": "Test before using.",
                    "description": "Check that the salt has dried before using in your craft, rangoli, teaching, etc. projects."
                }
            ]
        },
        {
            "name": "Coloring Salt with Liquid Food Coloring",
            "steps": [
                {
                    "headline": "Use liquid food coloring for this method.",
                    "description": "Choose a color or colors that you wish to work with."
                },
                {
                    "headline": "Tip the salt into a resealable bag.",
                    "description": ""
                },
                {
                    "headline": "Add the liquid food coloring to the salt.",
                    "description": "It's recommended that you do this gradually, a drop at a time, so that you can intensify the color as needed and stop when you're happy with it. The more drops added, the more intense the color."
                },
                {
                    "headline": "Carefully press the air from the resealable bag without losing the salt.",
                    "description": "Seal. Wait for around a minute before proceeding, to give the salt time to settle."
                },
                {
                    "headline": "Press down on the bag again and again.",
                    "description": "This will move the coloring around all of the salt. Knead until you can see that the color has permeated all of the salt in the plastic bag."
                },
                {
                    "headline": "Done.",
                    "description": "The salt is now ready for use. If you see any salt that is damp, let it dry before use, by allowing air into the bag and waiting a few hours more. If not using it straight away, you can leave it stored in the sealed bag. Repeat the process for as many colors as desired."
                }
            ]
        },
        {
            "name": "Coloring Salt with Gel Food Coloring",
            "steps": [
                {
                    "headline": "For this method, use gel-based food coloring.",
                    "description": "You should find it dries instantly and won't leave any liquid, which may be the case with liquid food coloring."
                },
                {
                    "headline": "Tip the salt into a resealable bag.",
                    "description": ""
                },
                {
                    "headline": "Add the gel food coloring.",
                    "description": "Transfer the gel using an implement such as a wooden or metallic skewer tip, the end of a butter knife or a toothpick. Only use a small amount at a time, adding a little more if you're not yet satisfied with the color. Gel coloring is fairly vibrant with just a little amount, so you don't want to overdo it."
                },
                {
                    "headline": "Carefully press down on the bag to remove excess air.",
                    "description": "Seal tightly."
                },
                {
                    "headline": "Shake or knead the color throughout the bag.",
                    "description": "Ensure that all of the salt is evenly colored."
                },
                {
                    "headline": "Done.",
                    "description": "Given that this is gel, the colored salt should be ready to use immediately. If not using it straight away, you can leave it stored in the sealed bag. Repeat the process for as many colors as desired."
                }
            ]
        },
        {
            "name": "Coloring Salt with Chalk",
            "steps": [
                {
                    "headline": "Choose a chalk color that you wish to use.",
                    "description": "Chalks come in a range of pastel and bright colors, depending on where you buy them from. Check art, craft or upmarket toy stores for a wider variety than you might find in traditional stationery or dollar stores."
                },
                {
                    "headline": "Cover the workspace with a large sheet of paper.",
                    "description": ""
                },
                {
                    "headline": "Pour the salt onto the paper.",
                    "description": "The amount of salt depends on the amount you need."
                },
                {
                    "headline": "Place the piece of chalk on its side, on the salt.",
                    "description": "Roll the chalk back and forth over the salt on the paper. As you do this, the color from the chalk will color the salt. Keep rolling until you're happy with the color."
                },
                {
                    "headline": "Using the paper as a funnel, pour the chalk-colored salt into a resealable bag or a storage container.",
                    "description": ""
                },
                {
                    "headline": "Done.",
                    "description": "The colored salt is now ready to use, or you can store it until needed. Repeat the process for as many colors as desired."
                }
            ]
        }
    ],
    "tyn": [
        "Salt (sea salt, rock salt, table salt, Epsom salts, etc. are all fine to use)",
        "Container for holding salt or a resealable bag",
        "Colorant",
        "Stirring implement (such as a spoon, a skewer, a chopstick, etc.)",
        "Storage container (if relevant)"
    ],
    "text": " Coloring Salt with Paint Fill a container with salt. A jug or pitcher, a deep bowl, a plastic food container, etc. will all suffice. Squeeze a little tempera paint into the salt.  Mix with a spoon or other item. Stir until the paint is evenly distributed through the salt. Let stand overnight to dry. Make as many more colors as you need for your project. That way, they'll all be ready at the same time. Test before using. Check that the salt has dried before using in your craft, rangoli, teaching, etc. projects. Coloring Salt with Liquid Food Coloring Use liquid food coloring for this method. Choose a color or colors that you wish to work with. Tip the salt into a resealable bag.  Add the liquid food coloring to the salt. It's recommended that you do this gradually, a drop at a time, so that you can intensify the color as needed and stop when you're happy with it. The more drops added, the more intense the color. Carefully press the air from the resealable bag without losing the salt. Seal. Wait for around a minute before proceeding, to give the salt time to settle. Press down on the bag again and again. This will move the coloring around all of the salt. Knead until you can see that the color has permeated all of the salt in the plastic bag. Done. The salt is now ready for use. If you see any salt that is damp, let it dry before use, by allowing air into the bag and waiting a few hours more. If not using it straight away, you can leave it stored in the sealed bag. Repeat the process for as many colors as desired. Coloring Salt with Gel Food Coloring For this method, use gel-based food coloring. You should find it dries instantly and won't leave any liquid, which may be the case with liquid food coloring. Tip the salt into a resealable bag.  Add the gel food coloring. Transfer the gel using an implement such as a wooden or metallic skewer tip, the end of a butter knife or a toothpick. Only use a small amount at a time, adding a little more if you're not yet satisfied with the color. Gel coloring is fairly vibrant with just a little amount, so you don't want to overdo it. Carefully press down on the bag to remove excess air. Seal tightly. Shake or knead the color throughout the bag. Ensure that all of the salt is evenly colored. Done. Given that this is gel, the colored salt should be ready to use immediately. If not using it straight away, you can leave it stored in the sealed bag. Repeat the process for as many colors as desired. Coloring Salt with Chalk Choose a chalk color that you wish to use. Chalks come in a range of pastel and bright colors, depending on where you buy them from. Check art, craft or upmarket toy stores for a wider variety than you might find in traditional stationery or dollar stores. Cover the workspace with a large sheet of paper.  Pour the salt onto the paper. The amount of salt depends on the amount you need. Place the piece of chalk on its side, on the salt. Roll the chalk back and forth over the salt on the paper. As you do this, the color from the chalk will color the salt. Keep rolling until you're happy with the color. Using the paper as a funnel, pour the chalk-colored salt into a resealable bag or a storage container.  Done. The colored salt is now ready to use, or you can store it until needed. Repeat the process for as many colors as desired.",
    "sentences": [
        " Coloring Salt with Paint Fill a container with salt.",
        "A jug or pitcher, a deep bowl, a plastic food container, etc.",
        "will all suffice.",
        "Squeeze a little tempera paint into the salt.",
        "Mix with a spoon or other item.",
        "Stir until the paint is evenly distributed through the salt.",
        "Let stand overnight to dry.",
        "Make as many more colors as you need for your project.",
        "That way, they'll all be ready at the same time.",
        "Test before using.",
        "Check that the salt has dried before using in your craft, rangoli, teaching, etc.",
        "projects.",
        "Coloring Salt with Liquid Food Coloring Use liquid food coloring for this method.",
        "Choose a color or colors that you wish to work with.",
        "Tip the salt into a resealable bag.",
        "Add the liquid food coloring to the salt.",
        "It's recommended that you do this gradually, a drop at a time, so that you can intensify the color as needed and stop when you're happy with it.",
        "The more drops added, the more intense the color.",
        "Carefully press the air from the resealable bag without losing the salt.",
        "Seal.",
        "Wait for around a minute before proceeding, to give the salt time to settle.",
        "Press down on the bag again and again.",
        "This will move the coloring around all of the salt.",
        "Knead until you can see that the color has permeated all of the salt in the plastic bag.",
        "Done.",
        "The salt is now ready for use.",
        "If you see any salt that is damp, let it dry before use, by allowing air into the bag and waiting a few hours more.",
        "If not using it straight away, you can leave it stored in the sealed bag.",
        "Repeat the process for as many colors as desired.",
        "Coloring Salt with Gel Food Coloring For this method, use gel-based food coloring.",
        "You should find it dries instantly and won't leave any liquid, which may be the case with liquid food coloring.",
        "Tip the salt into a resealable bag.",
        "Add the gel food coloring.",
        "Transfer the gel using an implement such as a wooden or metallic skewer tip, the end of a butter knife or a toothpick.",
        "Only use a small amount at a time, adding a little more if you're not yet satisfied with the color.",
        "Gel coloring is fairly vibrant with just a little amount, so you don't want to overdo it.",
        "Carefully press down on the bag to remove excess air.",
        "Seal tightly.",
        "Shake or knead the color throughout the bag.",
        "Ensure that all of the salt is evenly colored.",
        "Done.",
        "Given that this is gel, the colored salt should be ready to use immediately.",
        "If not using it straight away, you can leave it stored in the sealed bag.",
        "Repeat the process for as many colors as desired.",
        "Coloring Salt with Chalk Choose a chalk color that you wish to use.",
        "Chalks come in a range of pastel and bright colors, depending on where you buy them from.",
        "Check art, craft or upmarket toy stores for a wider variety than you might find in traditional stationery or dollar stores.",
        "Cover the workspace with a large sheet of paper.",
        "Pour the salt onto the paper.",
        "The amount of salt depends on the amount you need.",
        "Place the piece of chalk on its side, on the salt.",
        "Roll the chalk back and forth over the salt on the paper.",
        "As you do this, the color from the chalk will color the salt.",
        "Keep rolling until you're happy with the color.",
        "Using the paper as a funnel, pour the chalk-colored salt into a resealable bag or a storage container.",
        "Done.",
        "The colored salt is now ready to use, or you can store it until needed.",
        "Repeat the process for as many colors as desired."
    ]
}