{
    "title": "How to Draw a Minecraft Sword",
    "url": "https://www.wikihow.com/Draw-a-Minecraft-Sword",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Drawing",
        "Games Drawing"
    ],
    "methods": [
        {
            "name": "Drawing in the Stye of the Game",
            "steps": [
                {
                    "headline": "Choose which variant of sword you want to draw, you may like to do:",
                    "description": "Wooden Stone Iron Gold Diamond You may also wish to make your own colors and even shapes just by modifying the steps, for example an emerald sword or a lapis sword!"
                },
                {
                    "headline": "Add guidelines.",
                    "description": "Start by lightly drawing (or creating in a separate layer) a 16x16 grid of squares as a guideline (that will be removed later)."
                },
                {
                    "headline": "Outline.",
                    "description": "Draw the outline of the sword using the grid as a help to make the best symmetry and neatness. You may wish to use a line tool, or just freehand"
                },
                {
                    "headline": "Add detail outlines, if desired.",
                    "description": "If using a drawing software, draw the inner details of the sword with a very fine line before removing grid. If your using pen and paper you still may wish to use the detail lines but it may look messy"
                },
                {
                    "headline": "Color.",
                    "description": "Most of the default swords use different shades of the same 2 colors, but if you wish to be creative, go ahead."
                },
                {
                    "headline": "Add shadows.",
                    "description": "You may wish to draw a shadow as the sword is floating in midair and try different angles"
                },
                {
                    "headline": "Add edges (3D).",
                    "description": "You may also want to include 'edges' to add some perspective to the drawing."
                },
                {
                    "headline": "Incorporate a background.",
                    "description": "For a finishing touch you can add a themed background."
                }
            ]
        },
        {
            "name": "Drawing an Artistic Interpretation",
            "steps": [
                {
                    "headline": "Start with a game drawing as a template.",
                    "description": ""
                },
                {
                    "headline": "Get a basic outline of the shape you want.",
                    "description": ""
                },
                {
                    "headline": "Add details to the outline.",
                    "description": "You may want to add and change such things as:\nThe blade\nThe 'hand guard'\nThe handle\nThe hilt\nAny other parts of the sword you wish to modify or add"
                },
                {
                    "headline": "Color.",
                    "description": "This is not a game drawing, so color however you want! You may wish to use similar colors to the default swords but go with any design you desire! However, if you want it to still look 'Minecraft-y' it's better to go with default colors."
                },
                {
                    "headline": "Add shadows.",
                    "description": "You can draw a shadow of the sword floating in midair and try different angles of light."
                },
                {
                    "headline": "Add a background.",
                    "description": "You may also like to add a themed background to the image"
                },
                {
                    "headline": "Shade it.",
                    "description": "If you have some more time and patience you can try to shade the bottom and top of the shapes with different shades. For each colored shape in the add more black and/or less saturation to the color, and color a rounded shape in the bottom corners; vice versa shades for the top corners."
                },
                {
                    "headline": "Add light 'glints' and 'sparkles'.",
                    "description": "For a very small but effective final touch you may like to add a little reflection 'glint'. They can be as simple or as advanced as you want from an easy 5 point star to a complicated pointed shape."
                }
            ]
        }
    ],
    "tyn": [
        "computer",
        "drawing software (eg. Photoshop, PaintTool SAI, Sketchbook, etc.)",
        "drawing tablet (optional)",
        "paper/other medium (eg. canvas, wood, etc)",
        "pencils/pens/paint"
    ],
    "text": " Drawing in the Stye of the Game Choose which variant of sword you want to draw, you may like to do: Wooden Stone Iron Gold Diamond You may also wish to make your own colors and even shapes just by modifying the steps, for example an emerald sword or a lapis sword! Add guidelines. Start by lightly drawing (or creating in a separate layer) a 16x16 grid of squares as a guideline (that will be removed later). Outline. Draw the outline of the sword using the grid as a help to make the best symmetry and neatness. You may wish to use a line tool, or just freehand Add detail outlines, if desired. If using a drawing software, draw the inner details of the sword with a very fine line before removing grid. If your using pen and paper you still may wish to use the detail lines but it may look messy Color. Most of the default swords use different shades of the same 2 colors, but if you wish to be creative, go ahead. Add shadows. You may wish to draw a shadow as the sword is floating in midair and try different angles Add edges (3D). You may also want to include 'edges' to add some perspective to the drawing. Incorporate a background. For a finishing touch you can add a themed background. Drawing an Artistic Interpretation Start with a game drawing as a template.  Get a basic outline of the shape you want.  Add details to the outline. You may want to add and change such things as:\nThe blade\nThe 'hand guard'\nThe handle\nThe hilt\nAny other parts of the sword you wish to modify or add Color. This is not a game drawing, so color however you want! You may wish to use similar colors to the default swords but go with any design you desire! However, if you want it to still look 'Minecraft-y' it's better to go with default colors. Add shadows. You can draw a shadow of the sword floating in midair and try different angles of light. Add a background. You may also like to add a themed background to the image Shade it. If you have some more time and patience you can try to shade the bottom and top of the shapes with different shades. For each colored shape in the add more black and/or less saturation to the color, and color a rounded shape in the bottom corners; vice versa shades for the top corners. Add light 'glints' and 'sparkles'. For a very small but effective final touch you may like to add a little reflection 'glint'. They can be as simple or as advanced as you want from an easy 5 point star to a complicated pointed shape.",
    "sentences": [
        " Drawing in the Stye of the Game Choose which variant of sword you want to draw, you may like to do: Wooden Stone Iron Gold Diamond You may also wish to make your own colors and even shapes just by modifying the steps, for example an emerald sword or a lapis sword!",
        "Add guidelines.",
        "Start by lightly drawing (or creating in a separate layer) a 16x16 grid of squares as a guideline (that will be removed later).",
        "Outline.",
        "Draw the outline of the sword using the grid as a help to make the best symmetry and neatness.",
        "You may wish to use a line tool, or just freehand Add detail outlines, if desired.",
        "If using a drawing software, draw the inner details of the sword with a very fine line before removing grid.",
        "If your using pen and paper you still may wish to use the detail lines but it may look messy Color.",
        "Most of the default swords use different shades of the same 2 colors, but if you wish to be creative, go ahead.",
        "Add shadows.",
        "You may wish to draw a shadow as the sword is floating in midair and try different angles Add edges (3D).",
        "You may also want to include 'edges' to add some perspective to the drawing.",
        "Incorporate a background.",
        "For a finishing touch you can add a themed background.",
        "Drawing an Artistic Interpretation Start with a game drawing as a template.",
        "Get a basic outline of the shape you want.",
        "Add details to the outline.",
        "You may want to add and change such things as:\nThe blade\nThe 'hand guard'\nThe handle\nThe hilt\nAny other parts of the sword you wish to modify or add Color.",
        "This is not a game drawing, so color however you want!",
        "You may wish to use similar colors to the default swords but go with any design you desire!",
        "However, if you want it to still look 'Minecraft-y' it's better to go with default colors.",
        "Add shadows.",
        "You can draw a shadow of the sword floating in midair and try different angles of light.",
        "Add a background.",
        "You may also like to add a themed background to the image Shade it.",
        "If you have some more time and patience you can try to shade the bottom and top of the shapes with different shades.",
        "For each colored shape in the add more black and/or less saturation to the color, and color a rounded shape in the bottom corners; vice versa shades for the top corners.",
        "Add light 'glints' and 'sparkles'.",
        "For a very small but effective final touch you may like to add a little reflection 'glint'.",
        "They can be as simple or as advanced as you want from an easy 5 point star to a complicated pointed shape."
    ]
}