{
    "title": "How to Make Magic Mud",
    "url": "https://www.wikihow.com/Make-Magic-Mud",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science",
        "Science for Kids"
    ],
    "methods": [
        {
            "name": "Making Magic Mud with Cornstarch",
            "steps": [
                {
                    "headline": "Gather your materials.",
                    "description": "You will need two cups of cornstarch, one cup of water, and food coloring to create the magic mud. You will also need a bowl in order to mix all of the ingredients. You may also want a spoon for mixing; however, this is not necessary. Use a medium or large size bowl. It should be big enough to hold the two cups of cornstarch and one cup of water. Be sure to allow room for mixing. You can use any color of food coloring."
                },
                {
                    "headline": "Add the ingredients to the bowl.",
                    "description": "Start with the two cups of cornstarch. Then, add one cup of water. Finally, add several drops of food coloring. There is no correct amount of food coloring. Just add drops until you have reached your desired color."
                },
                {
                    "headline": "Mix the ingredients.",
                    "description": "The best way to mix the ingredients is with your hands. If you are not interested in getting your hands messy, you may use a spoon to mix the ingredients. Be sure to thoroughly mix all of the ingredients together. You can add more food coloring to reach your desired color of magic mud."
                },
                {
                    "headline": "Play with the magic mud.",
                    "description": "You will notice that the mud seems to have both solid and liquid properties. Experiment with the magic mud by dropping something on the surface of the mud. Try to roll the mud into a ball. Try squeezing the mud."
                }
            ]
        },
        {
            "name": "Using Real Mud",
            "steps": [
                {
                    "headline": "Gather your materials.",
                    "description": "You will need dirt, water, baking soda, white vinegar, and powdered tempera paint. You will also need a bowl to mix the materials. You might want to also gather additional bowls and a spoon to transfer the final product into multiple containers. Start by using equal parts of dirt and water. Use whatever color tempera paint that you desire. You can even use multiple colors."
                },
                {
                    "headline": "Mix together some ingredients.",
                    "description": "In a large bowl combine dirt, water, and baking soda. Start by using equal parts dirt and water. Add more water or dirt to make the mud the consistency that you desire. Add two tablespoons of baking soda to the mud. Mix the ingredients with your hand or a large spoon. Leave enough room in the bowl to mix the ingredients."
                },
                {
                    "headline": "Add the powdered tempera paint.",
                    "description": "If you want to distribute the mud into multiple containers, do it before adding the paint. Then, toss some paint on top of the mud. Watch as the mud starts to change colors. Consider using muffin tins or pie pans to make different shapes with your magic mud."
                },
                {
                    "headline": "Add white vinegar.",
                    "description": "Start with a cup of vinegar, and pour some of it onto the top of the magic mud. Watch as the vinegar reacts with the baking soda. You can continue to add more vinegar to your mud until it no longer reacts with the baking soda. Notice how different colored mud creates different colored bubbles."
                }
            ]
        },
        {
            "name": "Making Magic Mud from Potatoes",
            "steps": [
                {
                    "headline": "Gather your materials.",
                    "description": "To make magic mud from potatoes you will need a bag of potatoes and water. You will also need a food processor (or knife), two bowls, a strainer, a saucepan (or kettle), and a jar. If you are using a knife instead of a food processor you will need a cutting board or a surface that is safe for cutting. You may use any type of potato."
                },
                {
                    "headline": "Chop up the potatoes.",
                    "description": "You will want to use several potatoes in order to make enough magic mud. However, there is not set amount of potatoes that need to be used. Use the food processor to chop the potatoes into very small pieces. If a food processor is not available, use a knife to cut the potatoes into very small pieces. Make sure that an adult is available to help with the chopping. The potatoes may be peeled or unpeeled. Either way will work."
                },
                {
                    "headline": "Heat up the water.",
                    "description": "Using the saucepan or kettle, heat up about six cups of water. Make sure that it is enough water to cover the potatoes that you just chopped. You can add more water later if necessary."
                },
                {
                    "headline": "Pour the water over the chopped potatoes.",
                    "description": "Using a large spoon, stir the potatoes around in the water. You will notice that the water starts to change colors. Stir the potatoes for about two minutes."
                },
                {
                    "headline": "Strain the potatoes.",
                    "description": "Place the strainer over another large mixing bowl. Pour the potato water mixture into the strainer. The water will fall into the bowl below the strainer and the potatoes will remain in the strainer. Let the water set for ten minutes. You can now discard the potatoes, or better yet, use them in a recipe. You will notice that the water will start to separate into a white layer on the bottom and a water layer on top."
                },
                {
                    "headline": "Get rid of the water layer.",
                    "description": "You can discard this water into the sink or the dirty mixing bowl. You will be left with the white layer in the mixing bowl. You can repeat this rinsing process by adding fresh water to the white goop, letting it set for ten minutes, and then discarding the water from the top of the white goop."
                },
                {
                    "headline": "Play with your magic mud.",
                    "description": "The white goop that you are left with is potato starch. It acts a lot like the cornstarch mixture. Potato starch will feel firm when you try to mold it but will turn into a liquid when you apply pressure. Potato starch becomes magic mud because it doesn't dissolve in water. Instead, it's suspended in water. It's resistance to flow, which is called viscosity, changes when pressure is applied. This means it's a non-Newtonian fluid, which means that it has characteristics of both a liquid and a solid."
                }
            ]
        },
        {
            "name": "Playing It Safe",
            "steps": [
                {
                    "headline": "Avoid eating the magic mud.",
                    "description": "Even though some recipes use kitchen ingredients, they are not being prepared for consumption. Magic mud is meant to be used as an experiment and a toy, not a snack. Supervise young children so that they do not consume the magic mud."
                },
                {
                    "headline": "Designate a space for magic mud.",
                    "description": "Ideally, you will do these experiments outside. Magic mud can get rather messy. If doing the experiment outside isn't an option, lay down a piece of plastic or cardboard to do the experiment on. This will make cleanup much easier."
                },
                {
                    "headline": "Use all tools cautiously.",
                    "description": "When cutting potatoes, be cautious. Knives and food processors are both dangerous if they aren't used properly. Let an adult do the cutting, or do the cutting under the supervision of an adult."
                }
            ]
        }
    ],
    "tyn": [
        "Cornstarch",
        "Water",
        "Food coloring",
        "A bowl",
        "A spoon (optional)",
        "Dirt",
        "Baking soda",
        "Powdered tempera paint",
        "White vinegar",
        "Bag of potatoes",
        "Food processor (optional)",
        "Knife (optional)",
        "Saucepan or kettle",
        "Two bowls",
        "A large spoon",
        "Strainer",
        "Jar"
    ],
    "text": " Making Magic Mud with Cornstarch Gather your materials. You will need two cups of cornstarch, one cup of water, and food coloring to create the magic mud. You will also need a bowl in order to mix all of the ingredients. You may also want a spoon for mixing; however, this is not necessary. Use a medium or large size bowl. It should be big enough to hold the two cups of cornstarch and one cup of water. Be sure to allow room for mixing. You can use any color of food coloring. Add the ingredients to the bowl. Start with the two cups of cornstarch. Then, add one cup of water. Finally, add several drops of food coloring. There is no correct amount of food coloring. Just add drops until you have reached your desired color. Mix the ingredients. The best way to mix the ingredients is with your hands. If you are not interested in getting your hands messy, you may use a spoon to mix the ingredients. Be sure to thoroughly mix all of the ingredients together. You can add more food coloring to reach your desired color of magic mud. Play with the magic mud. You will notice that the mud seems to have both solid and liquid properties. Experiment with the magic mud by dropping something on the surface of the mud. Try to roll the mud into a ball. Try squeezing the mud. Using Real Mud Gather your materials. You will need dirt, water, baking soda, white vinegar, and powdered tempera paint. You will also need a bowl to mix the materials. You might want to also gather additional bowls and a spoon to transfer the final product into multiple containers. Start by using equal parts of dirt and water. Use whatever color tempera paint that you desire. You can even use multiple colors. Mix together some ingredients. In a large bowl combine dirt, water, and baking soda. Start by using equal parts dirt and water. Add more water or dirt to make the mud the consistency that you desire. Add two tablespoons of baking soda to the mud. Mix the ingredients with your hand or a large spoon. Leave enough room in the bowl to mix the ingredients. Add the powdered tempera paint. If you want to distribute the mud into multiple containers, do it before adding the paint. Then, toss some paint on top of the mud. Watch as the mud starts to change colors. Consider using muffin tins or pie pans to make different shapes with your magic mud. Add white vinegar. Start with a cup of vinegar, and pour some of it onto the top of the magic mud. Watch as the vinegar reacts with the baking soda. You can continue to add more vinegar to your mud until it no longer reacts with the baking soda. Notice how different colored mud creates different colored bubbles. Making Magic Mud from Potatoes Gather your materials. To make magic mud from potatoes you will need a bag of potatoes and water. You will also need a food processor (or knife), two bowls, a strainer, a saucepan (or kettle), and a jar. If you are using a knife instead of a food processor you will need a cutting board or a surface that is safe for cutting. You may use any type of potato. Chop up the potatoes. You will want to use several potatoes in order to make enough magic mud. However, there is not set amount of potatoes that need to be used. Use the food processor to chop the potatoes into very small pieces. If a food processor is not available, use a knife to cut the potatoes into very small pieces. Make sure that an adult is available to help with the chopping. The potatoes may be peeled or unpeeled. Either way will work. Heat up the water. Using the saucepan or kettle, heat up about six cups of water. Make sure that it is enough water to cover the potatoes that you just chopped. You can add more water later if necessary. Pour the water over the chopped potatoes. Using a large spoon, stir the potatoes around in the water. You will notice that the water starts to change colors. Stir the potatoes for about two minutes. Strain the potatoes. Place the strainer over another large mixing bowl. Pour the potato water mixture into the strainer. The water will fall into the bowl below the strainer and the potatoes will remain in the strainer. Let the water set for ten minutes. You can now discard the potatoes, or better yet, use them in a recipe. You will notice that the water will start to separate into a white layer on the bottom and a water layer on top. Get rid of the water layer. You can discard this water into the sink or the dirty mixing bowl. You will be left with the white layer in the mixing bowl. You can repeat this rinsing process by adding fresh water to the white goop, letting it set for ten minutes, and then discarding the water from the top of the white goop. Play with your magic mud. The white goop that you are left with is potato starch. It acts a lot like the cornstarch mixture. Potato starch will feel firm when you try to mold it but will turn into a liquid when you apply pressure. Potato starch becomes magic mud because it doesn't dissolve in water. Instead, it's suspended in water. It's resistance to flow, which is called viscosity, changes when pressure is applied. This means it's a non-Newtonian fluid, which means that it has characteristics of both a liquid and a solid. Playing It Safe Avoid eating the magic mud. Even though some recipes use kitchen ingredients, they are not being prepared for consumption. Magic mud is meant to be used as an experiment and a toy, not a snack. Supervise young children so that they do not consume the magic mud. Designate a space for magic mud. Ideally, you will do these experiments outside. Magic mud can get rather messy. If doing the experiment outside isn't an option, lay down a piece of plastic or cardboard to do the experiment on. This will make cleanup much easier. Use all tools cautiously. When cutting potatoes, be cautious. Knives and food processors are both dangerous if they aren't used properly. Let an adult do the cutting, or do the cutting under the supervision of an adult.",
    "sentences": [
        " Making Magic Mud with Cornstarch Gather your materials.",
        "You will need two cups of cornstarch, one cup of water, and food coloring to create the magic mud.",
        "You will also need a bowl in order to mix all of the ingredients.",
        "You may also want a spoon for mixing; however, this is not necessary.",
        "Use a medium or large size bowl.",
        "It should be big enough to hold the two cups of cornstarch and one cup of water.",
        "Be sure to allow room for mixing.",
        "You can use any color of food coloring.",
        "Add the ingredients to the bowl.",
        "Start with the two cups of cornstarch.",
        "Then, add one cup of water.",
        "Finally, add several drops of food coloring.",
        "There is no correct amount of food coloring.",
        "Just add drops until you have reached your desired color.",
        "Mix the ingredients.",
        "The best way to mix the ingredients is with your hands.",
        "If you are not interested in getting your hands messy, you may use a spoon to mix the ingredients.",
        "Be sure to thoroughly mix all of the ingredients together.",
        "You can add more food coloring to reach your desired color of magic mud.",
        "Play with the magic mud.",
        "You will notice that the mud seems to have both solid and liquid properties.",
        "Experiment with the magic mud by dropping something on the surface of the mud.",
        "Try to roll the mud into a ball.",
        "Try squeezing the mud.",
        "Using Real Mud Gather your materials.",
        "You will need dirt, water, baking soda, white vinegar, and powdered tempera paint.",
        "You will also need a bowl to mix the materials.",
        "You might want to also gather additional bowls and a spoon to transfer the final product into multiple containers.",
        "Start by using equal parts of dirt and water.",
        "Use whatever color tempera paint that you desire.",
        "You can even use multiple colors.",
        "Mix together some ingredients.",
        "In a large bowl combine dirt, water, and baking soda.",
        "Start by using equal parts dirt and water.",
        "Add more water or dirt to make the mud the consistency that you desire.",
        "Add two tablespoons of baking soda to the mud.",
        "Mix the ingredients with your hand or a large spoon.",
        "Leave enough room in the bowl to mix the ingredients.",
        "Add the powdered tempera paint.",
        "If you want to distribute the mud into multiple containers, do it before adding the paint.",
        "Then, toss some paint on top of the mud.",
        "Watch as the mud starts to change colors.",
        "Consider using muffin tins or pie pans to make different shapes with your magic mud.",
        "Add white vinegar.",
        "Start with a cup of vinegar, and pour some of it onto the top of the magic mud.",
        "Watch as the vinegar reacts with the baking soda.",
        "You can continue to add more vinegar to your mud until it no longer reacts with the baking soda.",
        "Notice how different colored mud creates different colored bubbles.",
        "Making Magic Mud from Potatoes Gather your materials.",
        "To make magic mud from potatoes you will need a bag of potatoes and water.",
        "You will also need a food processor (or knife), two bowls, a strainer, a saucepan (or kettle), and a jar.",
        "If you are using a knife instead of a food processor you will need a cutting board or a surface that is safe for cutting.",
        "You may use any type of potato.",
        "Chop up the potatoes.",
        "You will want to use several potatoes in order to make enough magic mud.",
        "However, there is not set amount of potatoes that need to be used.",
        "Use the food processor to chop the potatoes into very small pieces.",
        "If a food processor is not available, use a knife to cut the potatoes into very small pieces.",
        "Make sure that an adult is available to help with the chopping.",
        "The potatoes may be peeled or unpeeled.",
        "Either way will work.",
        "Heat up the water.",
        "Using the saucepan or kettle, heat up about six cups of water.",
        "Make sure that it is enough water to cover the potatoes that you just chopped.",
        "You can add more water later if necessary.",
        "Pour the water over the chopped potatoes.",
        "Using a large spoon, stir the potatoes around in the water.",
        "You will notice that the water starts to change colors.",
        "Stir the potatoes for about two minutes.",
        "Strain the potatoes.",
        "Place the strainer over another large mixing bowl.",
        "Pour the potato water mixture into the strainer.",
        "The water will fall into the bowl below the strainer and the potatoes will remain in the strainer.",
        "Let the water set for ten minutes.",
        "You can now discard the potatoes, or better yet, use them in a recipe.",
        "You will notice that the water will start to separate into a white layer on the bottom and a water layer on top.",
        "Get rid of the water layer.",
        "You can discard this water into the sink or the dirty mixing bowl.",
        "You will be left with the white layer in the mixing bowl.",
        "You can repeat this rinsing process by adding fresh water to the white goop, letting it set for ten minutes, and then discarding the water from the top of the white goop.",
        "Play with your magic mud.",
        "The white goop that you are left with is potato starch.",
        "It acts a lot like the cornstarch mixture.",
        "Potato starch will feel firm when you try to mold it but will turn into a liquid when you apply pressure.",
        "Potato starch becomes magic mud because it doesn't dissolve in water.",
        "Instead, it's suspended in water.",
        "It's resistance to flow, which is called viscosity, changes when pressure is applied.",
        "This means it's a non-Newtonian fluid, which means that it has characteristics of both a liquid and a solid.",
        "Playing It Safe Avoid eating the magic mud.",
        "Even though some recipes use kitchen ingredients, they are not being prepared for consumption.",
        "Magic mud is meant to be used as an experiment and a toy, not a snack.",
        "Supervise young children so that they do not consume the magic mud.",
        "Designate a space for magic mud.",
        "Ideally, you will do these experiments outside.",
        "Magic mud can get rather messy.",
        "If doing the experiment outside isn't an option, lay down a piece of plastic or cardboard to do the experiment on.",
        "This will make cleanup much easier.",
        "Use all tools cautiously.",
        "When cutting potatoes, be cautious.",
        "Knives and food processors are both dangerous if they aren't used properly.",
        "Let an adult do the cutting, or do the cutting under the supervision of an adult."
    ]
}