{
    "title": "How to Clean An Oscillating Round Fan",
    "url": "https://www.wikihow.com/Clean-An-Oscillating-Round-Fan",
    "category_hierarchy": [
        "Health",
        "Environmental Health",
        "Air Quality and Health"
    ],
    "steps": [
        {
            "headline": "Unplug your oscillating round fan from the wall.",
            "description": ""
        },
        {
            "headline": "Either use a Philips head screwdriver to unscrew the front grille from the back grille; or, push grille clips off front grille, depending on your oscillating round fan, and take it off.",
            "description": ""
        },
        {
            "headline": "Unscrew the blade cap from the blade and take it off.",
            "description": ""
        },
        {
            "headline": "Slide the fan blade off.",
            "description": ""
        },
        {
            "headline": "Unscrew the back grille nut from the back grille and take it off.",
            "description": ""
        },
        {
            "headline": "Slide the back grille off.",
            "description": ""
        },
        {
            "headline": "Use a bottle of liquid hand soap and warm water on each fan part to clean it or run fan parts through a dishwasher.",
            "description": ""
        },
        {
            "headline": "Set each cleaned part on a hand towel and allow about 10 minutes for each fan part to dry.",
            "description": ""
        },
        {
            "headline": "Follow the disassemble instructions given above in reverse to reassemble the fan.",
            "description": ""
        },
        {
            "headline": "Plug your cleaned oscillating round fan in and turn it on.",
            "description": "It should be quieter and cleaner than before. If it is not, try the steps above again until totally clean."
        },
        {
            "headline": "Finished.",
            "description": ""
        }
    ],
    "tyn": [
        "An Oscillating Round Fan",
        "A Bottle Of Hand Soap",
        "A Philips Head Screwdriver",
        "A Hand Towel",
        "10 Minutes Allowed for each fan part to dry"
    ],
    "text": " Unplug your oscillating round fan from the wall.  Either use a Philips head screwdriver to unscrew the front grille from the back grille; or, push grille clips off front grille, depending on your oscillating round fan, and take it off.  Unscrew the blade cap from the blade and take it off.  Slide the fan blade off.  Unscrew the back grille nut from the back grille and take it off.  Slide the back grille off.  Use a bottle of liquid hand soap and warm water on each fan part to clean it or run fan parts through a dishwasher.  Set each cleaned part on a hand towel and allow about 10 minutes for each fan part to dry.  Follow the disassemble instructions given above in reverse to reassemble the fan.  Plug your cleaned oscillating round fan in and turn it on. It should be quieter and cleaner than before. If it is not, try the steps above again until totally clean. Finished. ",
    "sentences": [
        " Unplug your oscillating round fan from the wall.",
        "Either use a Philips head screwdriver to unscrew the front grille from the back grille; or, push grille clips off front grille, depending on your oscillating round fan, and take it off.",
        "Unscrew the blade cap from the blade and take it off.",
        "Slide the fan blade off.",
        "Unscrew the back grille nut from the back grille and take it off.",
        "Slide the back grille off.",
        "Use a bottle of liquid hand soap and warm water on each fan part to clean it or run fan parts through a dishwasher.",
        "Set each cleaned part on a hand towel and allow about 10 minutes for each fan part to dry.",
        "Follow the disassemble instructions given above in reverse to reassemble the fan.",
        "Plug your cleaned oscillating round fan in and turn it on.",
        "It should be quieter and cleaner than before.",
        "If it is not, try the steps above again until totally clean.",
        "Finished."
    ]
}