{
    "title": "How to Cook Beef Flanken",
    "url": "https://www.wikihow.com/Cook-Beef-Flanken",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Beef and Lamb",
        "Steak Dishes"
    ],
    "methods": [
        {
            "name": "Braising Beef Flanken Ribs",
            "steps": [
                {
                    "headline": "Defrost the ribs for a day in the refrigerator.",
                    "description": "Make sure they have enough time to defrost. You don't want to defrost tougher pieces of meat, like this, in the microwave."
                },
                {
                    "headline": "Mix a marinade.",
                    "description": "There are several marinades that work well with short ribs, including red wine, dark beer and Asian-style ribs. If you're using the red wine marinade above, mix together the red wine, beef broth, garlic, tomatoes, bay leaves, black pepper and thyme."
                },
                {
                    "headline": "Pour the marinade into a sealable plastic sack.",
                    "description": "Place your defrosted beef flanken ribs in the bag. Seal it and flip the bag several times to coat the meat."
                },
                {
                    "headline": "Place the bag in the refrigerator for four hours.",
                    "description": "The longer they marinate, the more intensely flavored they will be."
                },
                {
                    "headline": "Remove the ribs from the refrigerator and the plastic bag.",
                    "description": "Pat them dry with some paper towels. Reserve the marinade. Dry beef will brown better."
                },
                {
                    "headline": "Heat two tbsp.",
                    "description": "of olive oil in a Dutch oven on medium heat. Place the flanken into the heated pan to brown. Brown for three minutes on each side."
                },
                {
                    "headline": "Remove the ribs from the Dutch oven and place them on a platter.",
                    "description": "Remove all but two tbsp. of oil from the pan."
                },
                {
                    "headline": "Dice an onion, two large carrots and two celery stalks.",
                    "description": "Toss them in the Dutch oven and sauté them in the oil until browned. Loosen any brown bits with your wooden spoon."
                },
                {
                    "headline": "Place the ribs inside the Dutch oven.",
                    "description": "Pour in the reserved marinade. Heat until boiling."
                },
                {
                    "headline": "Secure the lid on the top of the Dutch oven.",
                    "description": "Reduce the heat to a simmer. Cook at this low temperature for one and a half hours to two hours."
                },
                {
                    "headline": "Remove the ribs from the pot.",
                    "description": "Set them aside and keep them warm."
                },
                {
                    "headline": "Bring the remaining juice to a boil and reduce it by half.",
                    "description": "Separate the fat if possible, or use the full-fat reduction as sauce. Serve immediately."
                }
            ]
        },
        {
            "name": "Oven-Cooked Ribs",
            "steps": [
                {
                    "headline": "Defrost six lbs.",
                    "description": "(2.7kg) of flanken beef ribs for at least one day in the refrigerator. It may take two days to fully defrost."
                },
                {
                    "headline": "Cut the ribs into five to six inch strips, if they aren't already cut in this manner.",
                    "description": ""
                },
                {
                    "headline": "Pat the ribs dry with a paper towel.",
                    "description": ""
                },
                {
                    "headline": "Mix the dry rub as listed above.",
                    "description": "If you have half a recipe, mix half the dry rub ingredients."
                },
                {
                    "headline": "Rub the mixture all over the ribs.",
                    "description": "Cover them in plastic wrap and let them sit on the counter at room temperature for one to two hours."
                },
                {
                    "headline": "Preheat your oven to 300 °F (149 °C) (149 Celsius) near the end of the one to two hour period.",
                    "description": ""
                },
                {
                    "headline": "Place the ribs fat side up in an oven safe dish or a roasting pan.",
                    "description": "Cover the pan securely with aluminum foil."
                },
                {
                    "headline": "Place the pan in the oven for two and a half hours.",
                    "description": ""
                },
                {
                    "headline": "Remove the ribs from the oven and discard the aluminum foil.",
                    "description": "Turn the oven temperature up to 425 degrees Fahrenheit (218 Celsius)."
                },
                {
                    "headline": "Brush the surface of the ribs with one-half cup of liquid honey.",
                    "description": "Place the ribs back into the oven uncovered. Cook for an additional 10 to 15 minutes to glaze them."
                },
                {
                    "headline": "Serve them immediately.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Plastic bag",
        "Marinade",
        "Beef flanken ribs",
        "Refrigerator",
        "Paper towels",
        "Olive oil for browning",
        "Tongs",
        "Dutch Oven",
        "Carrots",
        "Celery",
        "Onion",
        "Stovetop",
        "Measuring spoons and cups",
        "Oven",
        "Wooden spoon",
        "Knife",
        "Cutting board",
        "Plastic wrap",
        "Aluminum foil",
        "Honey",
        "Marinade brush"
    ],
    "text": " Braising Beef Flanken Ribs Defrost the ribs for a day in the refrigerator. Make sure they have enough time to defrost. You don't want to defrost tougher pieces of meat, like this, in the microwave. Mix a marinade. There are several marinades that work well with short ribs, including red wine, dark beer and Asian-style ribs. If you're using the red wine marinade above, mix together the red wine, beef broth, garlic, tomatoes, bay leaves, black pepper and thyme. Pour the marinade into a sealable plastic sack. Place your defrosted beef flanken ribs in the bag. Seal it and flip the bag several times to coat the meat. Place the bag in the refrigerator for four hours. The longer they marinate, the more intensely flavored they will be. Remove the ribs from the refrigerator and the plastic bag. Pat them dry with some paper towels. Reserve the marinade. Dry beef will brown better. Heat two tbsp. of olive oil in a Dutch oven on medium heat. Place the flanken into the heated pan to brown. Brown for three minutes on each side. Remove the ribs from the Dutch oven and place them on a platter. Remove all but two tbsp. of oil from the pan. Dice an onion, two large carrots and two celery stalks. Toss them in the Dutch oven and sauté them in the oil until browned. Loosen any brown bits with your wooden spoon. Place the ribs inside the Dutch oven. Pour in the reserved marinade. Heat until boiling. Secure the lid on the top of the Dutch oven. Reduce the heat to a simmer. Cook at this low temperature for one and a half hours to two hours. Remove the ribs from the pot. Set them aside and keep them warm. Bring the remaining juice to a boil and reduce it by half. Separate the fat if possible, or use the full-fat reduction as sauce. Serve immediately. Oven-Cooked Ribs Defrost six lbs. (2.7kg) of flanken beef ribs for at least one day in the refrigerator. It may take two days to fully defrost. Cut the ribs into five to six inch strips, if they aren't already cut in this manner.  Pat the ribs dry with a paper towel.  Mix the dry rub as listed above. If you have half a recipe, mix half the dry rub ingredients. Rub the mixture all over the ribs. Cover them in plastic wrap and let them sit on the counter at room temperature for one to two hours. Preheat your oven to 300 °F (149 °C) (149 Celsius) near the end of the one to two hour period.  Place the ribs fat side up in an oven safe dish or a roasting pan. Cover the pan securely with aluminum foil. Place the pan in the oven for two and a half hours.  Remove the ribs from the oven and discard the aluminum foil. Turn the oven temperature up to 425 degrees Fahrenheit (218 Celsius). Brush the surface of the ribs with one-half cup of liquid honey. Place the ribs back into the oven uncovered. Cook for an additional 10 to 15 minutes to glaze them. Serve them immediately. ",
    "sentences": [
        " Braising Beef Flanken Ribs Defrost the ribs for a day in the refrigerator.",
        "Make sure they have enough time to defrost.",
        "You don't want to defrost tougher pieces of meat, like this, in the microwave.",
        "Mix a marinade.",
        "There are several marinades that work well with short ribs, including red wine, dark beer and Asian-style ribs.",
        "If you're using the red wine marinade above, mix together the red wine, beef broth, garlic, tomatoes, bay leaves, black pepper and thyme.",
        "Pour the marinade into a sealable plastic sack.",
        "Place your defrosted beef flanken ribs in the bag.",
        "Seal it and flip the bag several times to coat the meat.",
        "Place the bag in the refrigerator for four hours.",
        "The longer they marinate, the more intensely flavored they will be.",
        "Remove the ribs from the refrigerator and the plastic bag.",
        "Pat them dry with some paper towels.",
        "Reserve the marinade.",
        "Dry beef will brown better.",
        "Heat two tbsp.",
        "of olive oil in a Dutch oven on medium heat.",
        "Place the flanken into the heated pan to brown.",
        "Brown for three minutes on each side.",
        "Remove the ribs from the Dutch oven and place them on a platter.",
        "Remove all but two tbsp.",
        "of oil from the pan.",
        "Dice an onion, two large carrots and two celery stalks.",
        "Toss them in the Dutch oven and sauté them in the oil until browned.",
        "Loosen any brown bits with your wooden spoon.",
        "Place the ribs inside the Dutch oven.",
        "Pour in the reserved marinade.",
        "Heat until boiling.",
        "Secure the lid on the top of the Dutch oven.",
        "Reduce the heat to a simmer.",
        "Cook at this low temperature for one and a half hours to two hours.",
        "Remove the ribs from the pot.",
        "Set them aside and keep them warm.",
        "Bring the remaining juice to a boil and reduce it by half.",
        "Separate the fat if possible, or use the full-fat reduction as sauce.",
        "Serve immediately.",
        "Oven-Cooked Ribs Defrost six lbs.",
        "(2.7kg) of flanken beef ribs for at least one day in the refrigerator.",
        "It may take two days to fully defrost.",
        "Cut the ribs into five to six inch strips, if they aren't already cut in this manner.",
        "Pat the ribs dry with a paper towel.",
        "Mix the dry rub as listed above.",
        "If you have half a recipe, mix half the dry rub ingredients.",
        "Rub the mixture all over the ribs.",
        "Cover them in plastic wrap and let them sit on the counter at room temperature for one to two hours.",
        "Preheat your oven to 300 °F (149 °C) (149 Celsius) near the end of the one to two hour period.",
        "Place the ribs fat side up in an oven safe dish or a roasting pan.",
        "Cover the pan securely with aluminum foil.",
        "Place the pan in the oven for two and a half hours.",
        "Remove the ribs from the oven and discard the aluminum foil.",
        "Turn the oven temperature up to 425 degrees Fahrenheit (218 Celsius).",
        "Brush the surface of the ribs with one-half cup of liquid honey.",
        "Place the ribs back into the oven uncovered.",
        "Cook for an additional 10 to 15 minutes to glaze them.",
        "Serve them immediately."
    ]
}