{
    "title": "How to Make a Flat White Coffee",
    "url": "https://www.wikihow.com/Make-a-Flat-White-Coffee",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Coffee"
    ],
    "parts": [
        {
            "name": "Making the Espresso",
            "steps": [
                {
                    "headline": "Heat a 6 to 7  fl oz (180 to 210 ml) cup while you prepare the espresso.",
                    "description": "Get out a small serving cup and fill it with hot water. Leave the cup to heat while you prepare the espresso grounds and your machine. A flat white is served in a smaller cup than a latte or cappuccino because it's made with less milk."
                },
                {
                    "headline": "Add water to the espresso machine and turn it on.",
                    "description": "Depending on your machine, you may have to fill the water tank and heat the machine before making your espresso. Follow the manufacturer's instructions and heat the machine for as long as directed. For example, you might need to pour about 40 fluid ounces (1,200 ml) of water into a tank near the top of the machine and heat the machine for 15 minutes."
                },
                {
                    "headline": "Dose espresso grounds into a portafilter.",
                    "description": "Use a scale to weigh 18 to 20 grams of espresso grounds into a clean and dry portafilter. Try to use freshly ground espresso for the best flavor. You can use any style of roast, but it's important that the coffee is ground for an espresso machine."
                },
                {
                    "headline": "Tamp down on the grounds while you apply pressure.",
                    "description": "Set the portafilter on a clean, flat surface and use a tamper to push down firmly on the grounds. Try to apply even pressure so the espresso is level in the portafilter. Packing the espresso into the portafilter will help the water from the machine flow evenly through the grounds as the shot pulls."
                },
                {
                    "headline": "Put the portafilter in the machine and turn it on.",
                    "description": "Turn on the grouphead for a second to remove any old coffee grounds before you insert the portafilter. Then, put the portafilter into the grouphead and turn it so it's secure. Immediately turn the espresso machine on so the hot water can begin moving through the grounds. It's important to turn the machine on right away so the heat from the grouphead doesn't burn the espresso grounds. You might have to insert your portafilter a little differently depending on your machine."
                },
                {
                    "headline": "Pull a double shot of espresso into your preheated cup.",
                    "description": "Pour the hot water out of your preheated cup and place it below the spout of the portafilter. Then, let the shot run for about 20 to 30 seconds so the double espresso falls directly into the cup.Variation: If you don't have an espresso machine or prefer the ease of a single-serve brewing system, such as Keurig or Nespresso, just put an espresso pod in your machine and make a double shot. Stop the shot as soon as it begins to look pale and thin."
                }
            ]
        },
        {
            "name": "Steaming and Pouring the Milk",
            "steps": [
                {
                    "headline": "Pour about ⁄2 cup (120 ml) of milk into a steaming pitcher.",
                    "description": "For the creamiest flat white with the best microfoam, use whole milk. If you prefer, you can use lower fat milk or alternative milk, such as soy or almond milk. Keep in mind that the milk will double in volume once it's steamed, so don't fill a small pitcher more than half full. If you're using alternative milk, it will probably steam faster than whole milk, so be careful not to over steam it."
                },
                {
                    "headline": "Purge the steam wand for about 2 seconds.",
                    "description": "To purge the steam wand of any moisture trapped at the end, quickly turn it on so steam sprays out. Keep the wand on for a couple of seconds to ensure the wand is clear. You should purge the wand before you insert it into the pitcher of milk. This is because trapped moisture in the wand could get into your milk and make it taste bad."
                },
                {
                    "headline": "Put the wand into the milk and turn on the steam immediately.",
                    "description": "Position the pitcher so the tip of the steam wand is about 1 inch (2.5 cm) below the surface of the milk. As soon as the wand is submerged, turn it on.Tip: Angle the steam wand so it meets the milk at a 15-degree angle. This will help the milk move properly in the pitcher as it steams. If you put the wand into the milk and wait before turning on the steam, milk will get into the steam wand."
                },
                {
                    "headline": "Steam the milk until it's between 130 and 140 °F (54 and 60 °C).",
                    "description": "Keep the steam wand in the milk so the milk swirls in the pitcher and doubles in volume. You should see delicate foam on the surface instead of large bubbles if you keep the wand properly submerged. To test if the milk is hot enough, use a thermometer or hold the side of the pitcher as you steam. Turn off the steam once the pitcher is too hot to touch.Variation: If you don't have a steam wand, fill a small microwave-safe jar half full of milk and screw the lid on tightly. Shake the jar for 30 to 60 seconds and take off the lid. Microwave the jar of milk for 30 seconds so it foams and then assemble your flat white immediately. Since you can't make microfoam by whisking hot milk, avoid preparing the milk on the stove. The texture and color of the milk should look glossy, almost like latex paint."
                },
                {
                    "headline": "Tap the pitcher to remove bubbles.",
                    "description": "Once you've turned off the steam wand, move it off to the side and carefully set the pitcher of milk on the counter. Tap it gently once or twice to pop large bubbles that might be on the surface. Swirl the milk a little to keep it moving until you're ready to pour it over the espresso.Tip: Keep your steam wand in great shape by purging it after you've steamed milk. Then, wipe the wand clean with a damp cloth. If you tap too hard, milk may splash out of the pitcher."
                },
                {
                    "headline": "Pour the milk into the espresso to create a flat white.",
                    "description": "Bring the pitcher to your cup with espresso and tilt it carefully so the microfoam flows into the espresso. As you get close to the top of the cup, tilt even more so more of the foam floats to the top. Try to work as quickly so the steamed milk doesn't lose its volume. With enough practice, you can create designs by wiggling your wrist as you pour the milk into the espresso."
                }
            ]
        }
    ],
    "tyn": [
        "Serving cup",
        "Espresso machine with a steam wand",
        "Steaming pitcher",
        "Thermometer, optional"
    ],
    "text": " Making the Espresso Heat a 6 to 7  fl oz (180 to 210 ml) cup while you prepare the espresso. Get out a small serving cup and fill it with hot water. Leave the cup to heat while you prepare the espresso grounds and your machine. A flat white is served in a smaller cup than a latte or cappuccino because it's made with less milk. Add water to the espresso machine and turn it on. Depending on your machine, you may have to fill the water tank and heat the machine before making your espresso. Follow the manufacturer's instructions and heat the machine for as long as directed. For example, you might need to pour about 40 fluid ounces (1,200 ml) of water into a tank near the top of the machine and heat the machine for 15 minutes. Dose espresso grounds into a portafilter. Use a scale to weigh 18 to 20 grams of espresso grounds into a clean and dry portafilter. Try to use freshly ground espresso for the best flavor. You can use any style of roast, but it's important that the coffee is ground for an espresso machine. Tamp down on the grounds while you apply pressure. Set the portafilter on a clean, flat surface and use a tamper to push down firmly on the grounds. Try to apply even pressure so the espresso is level in the portafilter. Packing the espresso into the portafilter will help the water from the machine flow evenly through the grounds as the shot pulls. Put the portafilter in the machine and turn it on. Turn on the grouphead for a second to remove any old coffee grounds before you insert the portafilter. Then, put the portafilter into the grouphead and turn it so it's secure. Immediately turn the espresso machine on so the hot water can begin moving through the grounds. It's important to turn the machine on right away so the heat from the grouphead doesn't burn the espresso grounds. You might have to insert your portafilter a little differently depending on your machine. Pull a double shot of espresso into your preheated cup. Pour the hot water out of your preheated cup and place it below the spout of the portafilter. Then, let the shot run for about 20 to 30 seconds so the double espresso falls directly into the cup.Variation: If you don't have an espresso machine or prefer the ease of a single-serve brewing system, such as Keurig or Nespresso, just put an espresso pod in your machine and make a double shot. Stop the shot as soon as it begins to look pale and thin. Steaming and Pouring the Milk Pour about ⁄2 cup (120 ml) of milk into a steaming pitcher. For the creamiest flat white with the best microfoam, use whole milk. If you prefer, you can use lower fat milk or alternative milk, such as soy or almond milk. Keep in mind that the milk will double in volume once it's steamed, so don't fill a small pitcher more than half full. If you're using alternative milk, it will probably steam faster than whole milk, so be careful not to over steam it. Purge the steam wand for about 2 seconds. To purge the steam wand of any moisture trapped at the end, quickly turn it on so steam sprays out. Keep the wand on for a couple of seconds to ensure the wand is clear. You should purge the wand before you insert it into the pitcher of milk. This is because trapped moisture in the wand could get into your milk and make it taste bad. Put the wand into the milk and turn on the steam immediately. Position the pitcher so the tip of the steam wand is about 1 inch (2.5 cm) below the surface of the milk. As soon as the wand is submerged, turn it on.Tip: Angle the steam wand so it meets the milk at a 15-degree angle. This will help the milk move properly in the pitcher as it steams. If you put the wand into the milk and wait before turning on the steam, milk will get into the steam wand. Steam the milk until it's between 130 and 140 °F (54 and 60 °C). Keep the steam wand in the milk so the milk swirls in the pitcher and doubles in volume. You should see delicate foam on the surface instead of large bubbles if you keep the wand properly submerged. To test if the milk is hot enough, use a thermometer or hold the side of the pitcher as you steam. Turn off the steam once the pitcher is too hot to touch.Variation: If you don't have a steam wand, fill a small microwave-safe jar half full of milk and screw the lid on tightly. Shake the jar for 30 to 60 seconds and take off the lid. Microwave the jar of milk for 30 seconds so it foams and then assemble your flat white immediately. Since you can't make microfoam by whisking hot milk, avoid preparing the milk on the stove. The texture and color of the milk should look glossy, almost like latex paint. Tap the pitcher to remove bubbles. Once you've turned off the steam wand, move it off to the side and carefully set the pitcher of milk on the counter. Tap it gently once or twice to pop large bubbles that might be on the surface. Swirl the milk a little to keep it moving until you're ready to pour it over the espresso.Tip: Keep your steam wand in great shape by purging it after you've steamed milk. Then, wipe the wand clean with a damp cloth. If you tap too hard, milk may splash out of the pitcher. Pour the milk into the espresso to create a flat white. Bring the pitcher to your cup with espresso and tilt it carefully so the microfoam flows into the espresso. As you get close to the top of the cup, tilt even more so more of the foam floats to the top. Try to work as quickly so the steamed milk doesn't lose its volume. With enough practice, you can create designs by wiggling your wrist as you pour the milk into the espresso.",
    "sentences": [
        " Making the Espresso Heat a 6 to 7  fl oz (180 to 210 ml) cup while you prepare the espresso.",
        "Get out a small serving cup and fill it with hot water.",
        "Leave the cup to heat while you prepare the espresso grounds and your machine.",
        "A flat white is served in a smaller cup than a latte or cappuccino because it's made with less milk.",
        "Add water to the espresso machine and turn it on.",
        "Depending on your machine, you may have to fill the water tank and heat the machine before making your espresso.",
        "Follow the manufacturer's instructions and heat the machine for as long as directed.",
        "For example, you might need to pour about 40 fluid ounces (1,200 ml) of water into a tank near the top of the machine and heat the machine for 15 minutes.",
        "Dose espresso grounds into a portafilter.",
        "Use a scale to weigh 18 to 20 grams of espresso grounds into a clean and dry portafilter.",
        "Try to use freshly ground espresso for the best flavor.",
        "You can use any style of roast, but it's important that the coffee is ground for an espresso machine.",
        "Tamp down on the grounds while you apply pressure.",
        "Set the portafilter on a clean, flat surface and use a tamper to push down firmly on the grounds.",
        "Try to apply even pressure so the espresso is level in the portafilter.",
        "Packing the espresso into the portafilter will help the water from the machine flow evenly through the grounds as the shot pulls.",
        "Put the portafilter in the machine and turn it on.",
        "Turn on the grouphead for a second to remove any old coffee grounds before you insert the portafilter.",
        "Then, put the portafilter into the grouphead and turn it so it's secure.",
        "Immediately turn the espresso machine on so the hot water can begin moving through the grounds.",
        "It's important to turn the machine on right away so the heat from the grouphead doesn't burn the espresso grounds.",
        "You might have to insert your portafilter a little differently depending on your machine.",
        "Pull a double shot of espresso into your preheated cup.",
        "Pour the hot water out of your preheated cup and place it below the spout of the portafilter.",
        "Then, let the shot run for about 20 to 30 seconds so the double espresso falls directly into the cup.Variation: If you don't have an espresso machine or prefer the ease of a single-serve brewing system, such as Keurig or Nespresso, just put an espresso pod in your machine and make a double shot.",
        "Stop the shot as soon as it begins to look pale and thin.",
        "Steaming and Pouring the Milk Pour about ⁄2 cup (120 ml) of milk into a steaming pitcher.",
        "For the creamiest flat white with the best microfoam, use whole milk.",
        "If you prefer, you can use lower fat milk or alternative milk, such as soy or almond milk.",
        "Keep in mind that the milk will double in volume once it's steamed, so don't fill a small pitcher more than half full.",
        "If you're using alternative milk, it will probably steam faster than whole milk, so be careful not to over steam it.",
        "Purge the steam wand for about 2 seconds.",
        "To purge the steam wand of any moisture trapped at the end, quickly turn it on so steam sprays out.",
        "Keep the wand on for a couple of seconds to ensure the wand is clear.",
        "You should purge the wand before you insert it into the pitcher of milk.",
        "This is because trapped moisture in the wand could get into your milk and make it taste bad.",
        "Put the wand into the milk and turn on the steam immediately.",
        "Position the pitcher so the tip of the steam wand is about 1 inch (2.5 cm) below the surface of the milk.",
        "As soon as the wand is submerged, turn it on.Tip: Angle the steam wand so it meets the milk at a 15-degree angle.",
        "This will help the milk move properly in the pitcher as it steams.",
        "If you put the wand into the milk and wait before turning on the steam, milk will get into the steam wand.",
        "Steam the milk until it's between 130 and 140 °F (54 and 60 °C).",
        "Keep the steam wand in the milk so the milk swirls in the pitcher and doubles in volume.",
        "You should see delicate foam on the surface instead of large bubbles if you keep the wand properly submerged.",
        "To test if the milk is hot enough, use a thermometer or hold the side of the pitcher as you steam.",
        "Turn off the steam once the pitcher is too hot to touch.Variation: If you don't have a steam wand, fill a small microwave-safe jar half full of milk and screw the lid on tightly.",
        "Shake the jar for 30 to 60 seconds and take off the lid.",
        "Microwave the jar of milk for 30 seconds so it foams and then assemble your flat white immediately.",
        "Since you can't make microfoam by whisking hot milk, avoid preparing the milk on the stove.",
        "The texture and color of the milk should look glossy, almost like latex paint.",
        "Tap the pitcher to remove bubbles.",
        "Once you've turned off the steam wand, move it off to the side and carefully set the pitcher of milk on the counter.",
        "Tap it gently once or twice to pop large bubbles that might be on the surface.",
        "Swirl the milk a little to keep it moving until you're ready to pour it over the espresso.Tip: Keep your steam wand in great shape by purging it after you've steamed milk.",
        "Then, wipe the wand clean with a damp cloth.",
        "If you tap too hard, milk may splash out of the pitcher.",
        "Pour the milk into the espresso to create a flat white.",
        "Bring the pitcher to your cup with espresso and tilt it carefully so the microfoam flows into the espresso.",
        "As you get close to the top of the cup, tilt even more so more of the foam floats to the top.",
        "Try to work as quickly so the steamed milk doesn't lose its volume.",
        "With enough practice, you can create designs by wiggling your wrist as you pour the milk into the espresso."
    ]
}