{
    "title": "How to Cook Bone Marrow",
    "url": "https://www.wikihow.com/Cook-Bone-Marrow",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat"
    ],
    "methods": [
        {
            "name": "Roasting Bone Marrow",
            "steps": [
                {
                    "headline": "Preheat the oven to 450 °F (232 °C).",
                    "description": "Adjust your oven rack so it's in the center of the oven."
                },
                {
                    "headline": "Arrange 2 to 3 pounds (0.9 to 1.4 kg) of marrow bones on a sheet.",
                    "description": "Get out beef marrow bones and place them on a rimmed baking sheet such as a jellyroll pan. Spread the bones in a single layer."
                },
                {
                    "headline": "Season and roast the marrow bones for 20 minutes.",
                    "description": "Sprinkle salt and pepper to taste over the bones. Put the baking sheet in the preheated oven and cook the marrow bones until they turn light brown. You don't need to turn the bones while they cook. It's fine if some of the fat melts out of the bones as they roast."
                },
                {
                    "headline": "Toast the bread.",
                    "description": "Get out a few slices of your favorite type of bread. Toast them in a bread toaster, toaster oven, or under a broiler until they're crisp and browned. Set these on a serving plate just before you're ready to take the bones out of the oven. For example, use sourdough or country-style bread."
                },
                {
                    "headline": "Remove and serve the marrow.",
                    "description": "Turn off the oven and remove the baking sheet. Transfer the bones to a serving platter and set out pieces of toast. Because the marrow is exposed and will be soft after roasting, dip a fork or spoon into it and spread it on the toast. You can also serve the marrow with a green side salad. Avoid making the bone marrow in advance or storing leftovers."
                }
            ]
        },
        {
            "name": "Grilling Bone Marrow",
            "steps": [
                {
                    "headline": "Sprinkle marrow bones with salt and pepper.",
                    "description": "Get out 2 center-cut beef or veal bones. They should each be about 6 in (15 cm) in size. Ask the butcher to cut the bones in half vertically."
                },
                {
                    "headline": "Heat a gas or charcoal grill to medium.",
                    "description": "If you're using a gas grill, turn the burners to medium. If you're using a charcoal grill, fill a chimney half full with charcoal and light the briquettes. When the charcoal is hot and lightly ashy, pour the coals onto 1 side of the grill. This will create the hot side of a 2-zone fire. The side without the coals will be the cooler side."
                },
                {
                    "headline": "Spread 1/2 cup (65 g) of soaked wood chips on the coals.",
                    "description": "Drain the wood chips after they've soaked for 10 minutes and sprinkle them over the hot coals. If you're using a gas grill, put the soaked wood chips in the small smoker box inside the grill. If you don't have a smoker box, you can skip this step."
                },
                {
                    "headline": "Put the bones on the grill and cook them for 15 to 20 minutes.",
                    "description": "Lay the bones on the side of the grill that doesn't have the coals. Cover the grill and let the bones grill until they turn brown and begin to sizzle. There's no need to turn the bones as they grill."
                },
                {
                    "headline": "Remove the grilled marrow bones and serve them.",
                    "description": "Use tongs to transfer the bones from the grill to a serving plate. Squeeze a little fresh lemon juice over the bones and set out toast points. Dip a fork or knife into the exposed and softened marrow. Then spread the marrow on toast and enjoy. Don't store leftover bones or grill them in advance."
                }
            ]
        },
        {
            "name": "Cooking Bone Marrow Soup",
            "steps": [
                {
                    "headline": "Turn the oven to 450 °F (232 °C) and cut the carrots, leek, onion, and garlic.",
                    "description": "Take 1 medium onion and peel it. Cut it into quarters and place it on a rimmed baking sheet. Cut 1 peeled head of garlic in half and put it on the sheet. Leave 2 carrots unpeeled and cut them into 2 in (5 cm) pieces. Add these to the sheet with 1 trimmed leek that you've cut into 2 in (5 cm) pieces as well."
                },
                {
                    "headline": "Add 4 pounds (1.8 kg) of beef marrow bones to the sheet.",
                    "description": "Get out a mix of marrow bones and arrange them on the sheet with the vegetables. The vegetables and bones should be in a single layer so they roast evenly. It's fine to use a mix of marrow bones and bones that have some meat on them. For example, use knuckle bones, short ribs, or oxtails."
                },
                {
                    "headline": "Roast the vegetables with the beef bones for 40 minutes.",
                    "description": "Put the baking sheet in the preheated oven and cook them for 20 minutes. Then remove the pan and carefully stir the mixture. Return the pan to the oven and cook the mixture for 20 more minutes. The vegetables and bones should turn dark brown."
                },
                {
                    "headline": "Fill a pot with water, celery, bay leaves, pepper, and vinegar.",
                    "description": "Set a large stockpot on the stove and pour 12 cups (2,800 ml) of water into it. Cut 2 stalks of celery into 2 in (5 cm) pieces and add them to the pot along with 2 bay leaves, 2 tablespoons (17 g) of black peppercorns, and 1 tablespoon (15 ml) of cider vinegar."
                },
                {
                    "headline": "Stir the roasted bones and vegetables into the pot.",
                    "description": "Remove the baking sheet from the oven and scoop the bones and vegetables into the stockpot. Pour in any juices from the roasting sheet as well. If the bones and vegetables aren't covered with water, pour in enough to cover them."
                },
                {
                    "headline": "Cover and simmer the broth for 8 to 24 hours.",
                    "description": "Put a lid on the stockpot and turn the heat to high. Once the water begins to boil turn the burner down to low. Let the broth bubble very gently with the lid cracked. The longer the broth simmers, the more flavorful it will be. If you notice foam on the top, just skim it off. There's no need to stir the broth as it simmers. Never leave the simmering broth unattended. If you want, you can turn it off and cool the broth. Then put it back on the stove the next day."
                },
                {
                    "headline": "Cool and strain the bone broth.",
                    "description": "Turn off the burner and let the broth cool until it's a little easier to handle. Set a large pot in the sink and place a fine mesh sieve or strainer over the pot. Carefully pour the broth through the strainer to separate the bones and vegetables. Discard the bones and vegetables."
                },
                {
                    "headline": "Cool the broth to room temperature and refrigerate it.",
                    "description": "Leave the broth to cool for about 1 hour so it's at room temperature and then divide the broth into smaller airtight containers. Refrigerate the containers of broth until you're ready to use them. You may want to scoop away the layer of fat that forms at the top of the chilled broth. Refrigerate the broth up to 5 days or freeze it for up to 6 months."
                }
            ]
        }
    ],
    "tyn": [
        "Roasted Bone Marrow",
        "Large rimmed baking sheet such as a jellyroll pan",
        "Serving plate",
        "Toaster",
        "Spoon or knife",
        "Grilled Bone Marrow",
        "Gas or charcoal grill",
        "1/2 cup wood chips",
        "Tongs",
        "Bone Marrow Broth",
        "Rimmed baking sheet",
        "Knife and cutting board",
        "Large stockpot",
        "Large pot",
        "Fine mesh strainer or sieve",
        "Storage containers",
        "Spoon"
    ],
    "text": " Roasting Bone Marrow Preheat the oven to 450 °F (232 °C). Adjust your oven rack so it's in the center of the oven. Arrange 2 to 3 pounds (0.9 to 1.4 kg) of marrow bones on a sheet. Get out beef marrow bones and place them on a rimmed baking sheet such as a jellyroll pan. Spread the bones in a single layer. Season and roast the marrow bones for 20 minutes. Sprinkle salt and pepper to taste over the bones. Put the baking sheet in the preheated oven and cook the marrow bones until they turn light brown. You don't need to turn the bones while they cook. It's fine if some of the fat melts out of the bones as they roast. Toast the bread. Get out a few slices of your favorite type of bread. Toast them in a bread toaster, toaster oven, or under a broiler until they're crisp and browned. Set these on a serving plate just before you're ready to take the bones out of the oven. For example, use sourdough or country-style bread. Remove and serve the marrow. Turn off the oven and remove the baking sheet. Transfer the bones to a serving platter and set out pieces of toast. Because the marrow is exposed and will be soft after roasting, dip a fork or spoon into it and spread it on the toast. You can also serve the marrow with a green side salad. Avoid making the bone marrow in advance or storing leftovers. Grilling Bone Marrow Sprinkle marrow bones with salt and pepper. Get out 2 center-cut beef or veal bones. They should each be about 6 in (15 cm) in size. Ask the butcher to cut the bones in half vertically. Heat a gas or charcoal grill to medium. If you're using a gas grill, turn the burners to medium. If you're using a charcoal grill, fill a chimney half full with charcoal and light the briquettes. When the charcoal is hot and lightly ashy, pour the coals onto 1 side of the grill. This will create the hot side of a 2-zone fire. The side without the coals will be the cooler side. Spread 1/2 cup (65 g) of soaked wood chips on the coals. Drain the wood chips after they've soaked for 10 minutes and sprinkle them over the hot coals. If you're using a gas grill, put the soaked wood chips in the small smoker box inside the grill. If you don't have a smoker box, you can skip this step. Put the bones on the grill and cook them for 15 to 20 minutes. Lay the bones on the side of the grill that doesn't have the coals. Cover the grill and let the bones grill until they turn brown and begin to sizzle. There's no need to turn the bones as they grill. Remove the grilled marrow bones and serve them. Use tongs to transfer the bones from the grill to a serving plate. Squeeze a little fresh lemon juice over the bones and set out toast points. Dip a fork or knife into the exposed and softened marrow. Then spread the marrow on toast and enjoy. Don't store leftover bones or grill them in advance. Cooking Bone Marrow Soup Turn the oven to 450 °F (232 °C) and cut the carrots, leek, onion, and garlic. Take 1 medium onion and peel it. Cut it into quarters and place it on a rimmed baking sheet. Cut 1 peeled head of garlic in half and put it on the sheet. Leave 2 carrots unpeeled and cut them into 2 in (5 cm) pieces. Add these to the sheet with 1 trimmed leek that you've cut into 2 in (5 cm) pieces as well. Add 4 pounds (1.8 kg) of beef marrow bones to the sheet. Get out a mix of marrow bones and arrange them on the sheet with the vegetables. The vegetables and bones should be in a single layer so they roast evenly. It's fine to use a mix of marrow bones and bones that have some meat on them. For example, use knuckle bones, short ribs, or oxtails. Roast the vegetables with the beef bones for 40 minutes. Put the baking sheet in the preheated oven and cook them for 20 minutes. Then remove the pan and carefully stir the mixture. Return the pan to the oven and cook the mixture for 20 more minutes. The vegetables and bones should turn dark brown. Fill a pot with water, celery, bay leaves, pepper, and vinegar. Set a large stockpot on the stove and pour 12 cups (2,800 ml) of water into it. Cut 2 stalks of celery into 2 in (5 cm) pieces and add them to the pot along with 2 bay leaves, 2 tablespoons (17 g) of black peppercorns, and 1 tablespoon (15 ml) of cider vinegar. Stir the roasted bones and vegetables into the pot. Remove the baking sheet from the oven and scoop the bones and vegetables into the stockpot. Pour in any juices from the roasting sheet as well. If the bones and vegetables aren't covered with water, pour in enough to cover them. Cover and simmer the broth for 8 to 24 hours. Put a lid on the stockpot and turn the heat to high. Once the water begins to boil turn the burner down to low. Let the broth bubble very gently with the lid cracked. The longer the broth simmers, the more flavorful it will be. If you notice foam on the top, just skim it off. There's no need to stir the broth as it simmers. Never leave the simmering broth unattended. If you want, you can turn it off and cool the broth. Then put it back on the stove the next day. Cool and strain the bone broth. Turn off the burner and let the broth cool until it's a little easier to handle. Set a large pot in the sink and place a fine mesh sieve or strainer over the pot. Carefully pour the broth through the strainer to separate the bones and vegetables. Discard the bones and vegetables. Cool the broth to room temperature and refrigerate it. Leave the broth to cool for about 1 hour so it's at room temperature and then divide the broth into smaller airtight containers. Refrigerate the containers of broth until you're ready to use them. You may want to scoop away the layer of fat that forms at the top of the chilled broth. Refrigerate the broth up to 5 days or freeze it for up to 6 months.",
    "sentences": [
        " Roasting Bone Marrow Preheat the oven to 450 °F (232 °C).",
        "Adjust your oven rack so it's in the center of the oven.",
        "Arrange 2 to 3 pounds (0.9 to 1.4 kg) of marrow bones on a sheet.",
        "Get out beef marrow bones and place them on a rimmed baking sheet such as a jellyroll pan.",
        "Spread the bones in a single layer.",
        "Season and roast the marrow bones for 20 minutes.",
        "Sprinkle salt and pepper to taste over the bones.",
        "Put the baking sheet in the preheated oven and cook the marrow bones until they turn light brown.",
        "You don't need to turn the bones while they cook.",
        "It's fine if some of the fat melts out of the bones as they roast.",
        "Toast the bread.",
        "Get out a few slices of your favorite type of bread.",
        "Toast them in a bread toaster, toaster oven, or under a broiler until they're crisp and browned.",
        "Set these on a serving plate just before you're ready to take the bones out of the oven.",
        "For example, use sourdough or country-style bread.",
        "Remove and serve the marrow.",
        "Turn off the oven and remove the baking sheet.",
        "Transfer the bones to a serving platter and set out pieces of toast.",
        "Because the marrow is exposed and will be soft after roasting, dip a fork or spoon into it and spread it on the toast.",
        "You can also serve the marrow with a green side salad.",
        "Avoid making the bone marrow in advance or storing leftovers.",
        "Grilling Bone Marrow Sprinkle marrow bones with salt and pepper.",
        "Get out 2 center-cut beef or veal bones.",
        "They should each be about 6 in (15 cm) in size.",
        "Ask the butcher to cut the bones in half vertically.",
        "Heat a gas or charcoal grill to medium.",
        "If you're using a gas grill, turn the burners to medium.",
        "If you're using a charcoal grill, fill a chimney half full with charcoal and light the briquettes.",
        "When the charcoal is hot and lightly ashy, pour the coals onto 1 side of the grill.",
        "This will create the hot side of a 2-zone fire.",
        "The side without the coals will be the cooler side.",
        "Spread 1/2 cup (65 g) of soaked wood chips on the coals.",
        "Drain the wood chips after they've soaked for 10 minutes and sprinkle them over the hot coals.",
        "If you're using a gas grill, put the soaked wood chips in the small smoker box inside the grill.",
        "If you don't have a smoker box, you can skip this step.",
        "Put the bones on the grill and cook them for 15 to 20 minutes.",
        "Lay the bones on the side of the grill that doesn't have the coals.",
        "Cover the grill and let the bones grill until they turn brown and begin to sizzle.",
        "There's no need to turn the bones as they grill.",
        "Remove the grilled marrow bones and serve them.",
        "Use tongs to transfer the bones from the grill to a serving plate.",
        "Squeeze a little fresh lemon juice over the bones and set out toast points.",
        "Dip a fork or knife into the exposed and softened marrow.",
        "Then spread the marrow on toast and enjoy.",
        "Don't store leftover bones or grill them in advance.",
        "Cooking Bone Marrow Soup Turn the oven to 450 °F (232 °C) and cut the carrots, leek, onion, and garlic.",
        "Take 1 medium onion and peel it.",
        "Cut it into quarters and place it on a rimmed baking sheet.",
        "Cut 1 peeled head of garlic in half and put it on the sheet.",
        "Leave 2 carrots unpeeled and cut them into 2 in (5 cm) pieces.",
        "Add these to the sheet with 1 trimmed leek that you've cut into 2 in (5 cm) pieces as well.",
        "Add 4 pounds (1.8 kg) of beef marrow bones to the sheet.",
        "Get out a mix of marrow bones and arrange them on the sheet with the vegetables.",
        "The vegetables and bones should be in a single layer so they roast evenly.",
        "It's fine to use a mix of marrow bones and bones that have some meat on them.",
        "For example, use knuckle bones, short ribs, or oxtails.",
        "Roast the vegetables with the beef bones for 40 minutes.",
        "Put the baking sheet in the preheated oven and cook them for 20 minutes.",
        "Then remove the pan and carefully stir the mixture.",
        "Return the pan to the oven and cook the mixture for 20 more minutes.",
        "The vegetables and bones should turn dark brown.",
        "Fill a pot with water, celery, bay leaves, pepper, and vinegar.",
        "Set a large stockpot on the stove and pour 12 cups (2,800 ml) of water into it.",
        "Cut 2 stalks of celery into 2 in (5 cm) pieces and add them to the pot along with 2 bay leaves, 2 tablespoons (17 g) of black peppercorns, and 1 tablespoon (15 ml) of cider vinegar.",
        "Stir the roasted bones and vegetables into the pot.",
        "Remove the baking sheet from the oven and scoop the bones and vegetables into the stockpot.",
        "Pour in any juices from the roasting sheet as well.",
        "If the bones and vegetables aren't covered with water, pour in enough to cover them.",
        "Cover and simmer the broth for 8 to 24 hours.",
        "Put a lid on the stockpot and turn the heat to high.",
        "Once the water begins to boil turn the burner down to low.",
        "Let the broth bubble very gently with the lid cracked.",
        "The longer the broth simmers, the more flavorful it will be.",
        "If you notice foam on the top, just skim it off.",
        "There's no need to stir the broth as it simmers.",
        "Never leave the simmering broth unattended.",
        "If you want, you can turn it off and cool the broth.",
        "Then put it back on the stove the next day.",
        "Cool and strain the bone broth.",
        "Turn off the burner and let the broth cool until it's a little easier to handle.",
        "Set a large pot in the sink and place a fine mesh sieve or strainer over the pot.",
        "Carefully pour the broth through the strainer to separate the bones and vegetables.",
        "Discard the bones and vegetables.",
        "Cool the broth to room temperature and refrigerate it.",
        "Leave the broth to cool for about 1 hour so it's at room temperature and then divide the broth into smaller airtight containers.",
        "Refrigerate the containers of broth until you're ready to use them.",
        "You may want to scoop away the layer of fat that forms at the top of the chilled broth.",
        "Refrigerate the broth up to 5 days or freeze it for up to 6 months."
    ]
}