{
    "title": "How to Cook West African Food Okra and Fufu Soup",
    "url": "https://www.wikihow.com/Cook-West-African-Food-Okra-and-Fufu-Soup",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables",
        "Okra"
    ],
    "parts": [
        {
            "name": "Cooking the Meat",
            "steps": [
                {
                    "headline": "Season the meat with salt, garlic, pepper and onion.",
                    "description": "Feel absolutely free to add any other type of seasoning that you believe will give the meat a much better flavor."
                },
                {
                    "headline": "Once you are done seasoning the meat, add water to the meat.",
                    "description": "Use your own judgment as to how much water you think is needed. Cook the meat on low heat for 10 to 15 minutes; this will allow all the different flavors of the seasonings to blend in with the meat, giving it a delicious flavor and a great smell."
                },
                {
                    "headline": "After cooking the meat on low heat for 10 to 15 minutes, continue to cook it but just turn the heat on medium.",
                    "description": "Cook it for another 30 to 40 minutes. Always remember to stir the food every now and then until you are done cooking."
                }
            ]
        },
        {
            "name": "Making the Soup",
            "steps": [
                {
                    "headline": "Combine the defrosted and chopped okra, seasoning sauce and chicken cube.",
                    "description": ""
                },
                {
                    "headline": "Add oil and onions in a separate pot.",
                    "description": "Put the pot on the stove, and cook until the oil is really hot. Once the oil is hot and ready for use, take the already seasoned okra and dump it into the hot boiling oil. Fry the seasoned okra in the oil on a medium heat for about 10 minutes. Stir the food frequently, otherwise it will burn. Make sure not to fry the okra to the point where it becomes crispy."
                },
                {
                    "headline": "Add the earlier cooked meat and broth that the meat is in to the cooked okra pieces.",
                    "description": "Let this cook together for another 15 to 30 minutes. You will know when the okra soup is ready because only the okra, meat and oil will remain in the pot; this is the signal of knowing that the soup is fully ready."
                }
            ]
        },
        {
            "name": "Making the Fufu",
            "steps": [
                {
                    "headline": "Cook the fufu.",
                    "description": "Put warm water into the pot and set it on the stove. Wait for it to boil."
                },
                {
                    "headline": "Once you notice the water boiling, lower the heat and put either plantain flour, yam flour or garri flour in the hot boiling water.",
                    "description": "Stir constantly. Every 2-3 minutes, add more water, as needed. Sometimes you may find that it is difficult to stir the fufu while it is still on the stove. If this is the case, you have the option of taking it off the stove and putting it down on a lower surface area where you have better access to stir it."
                },
                {
                    "headline": "Keep stirring.",
                    "description": "There will be some knot in the dish; this means is that it is not yet ready and it needs to be stirred even more. Continue to cook the plantain, yam, or garri flour until all the knot disappears. Add water as needed, make sure that it is thick."
                },
                {
                    "headline": "Test to see when the fufu is ready.",
                    "description": "The only way of knowing one hundred percent that the fufu is ready is to cut a piece of it from the pot and try it. You will know if it is ready or not. When it is ready, it should resemble stiffly mashed potatoes."
                },
                {
                    "headline": "Put the fufu on a wet plate using a wet wooden spoon, regular spoon, or you can even use your hands if you can handle the heat.",
                    "description": "Shape it into a round ball for each person."
                }
            ]
        },
        {
            "name": "Serving the Okra and Fufu Soup",
            "steps": [
                {
                    "headline": "Pour the okra soup into soup bowls.",
                    "description": "Serve hot."
                },
                {
                    "headline": "Serve the fufu on a side plate with the okra soup.",
                    "description": "To eat the fufu, cut it into a bite size piece, dip it in the okra soup, chew and swallow it."
                }
            ]
        }
    ],
    "tyn": [
        "2 large pots",
        "Stirring implement",
        "Soup bowls",
        "Side plates",
        "Butter knife and soup spoons for serving"
    ],
    "text": " Cooking the Meat Season the meat with salt, garlic, pepper and onion. Feel absolutely free to add any other type of seasoning that you believe will give the meat a much better flavor. Once you are done seasoning the meat, add water to the meat. Use your own judgment as to how much water you think is needed. Cook the meat on low heat for 10 to 15 minutes; this will allow all the different flavors of the seasonings to blend in with the meat, giving it a delicious flavor and a great smell. After cooking the meat on low heat for 10 to 15 minutes, continue to cook it but just turn the heat on medium. Cook it for another 30 to 40 minutes. Always remember to stir the food every now and then until you are done cooking. Making the Soup Combine the defrosted and chopped okra, seasoning sauce and chicken cube.  Add oil and onions in a separate pot. Put the pot on the stove, and cook until the oil is really hot. Once the oil is hot and ready for use, take the already seasoned okra and dump it into the hot boiling oil. Fry the seasoned okra in the oil on a medium heat for about 10 minutes. Stir the food frequently, otherwise it will burn. Make sure not to fry the okra to the point where it becomes crispy. Add the earlier cooked meat and broth that the meat is in to the cooked okra pieces. Let this cook together for another 15 to 30 minutes. You will know when the okra soup is ready because only the okra, meat and oil will remain in the pot; this is the signal of knowing that the soup is fully ready. Making the Fufu Cook the fufu. Put warm water into the pot and set it on the stove. Wait for it to boil. Once you notice the water boiling, lower the heat and put either plantain flour, yam flour or garri flour in the hot boiling water. Stir constantly. Every 2-3 minutes, add more water, as needed. Sometimes you may find that it is difficult to stir the fufu while it is still on the stove. If this is the case, you have the option of taking it off the stove and putting it down on a lower surface area where you have better access to stir it. Keep stirring. There will be some knot in the dish; this means is that it is not yet ready and it needs to be stirred even more. Continue to cook the plantain, yam, or garri flour until all the knot disappears. Add water as needed, make sure that it is thick. Test to see when the fufu is ready. The only way of knowing one hundred percent that the fufu is ready is to cut a piece of it from the pot and try it. You will know if it is ready or not. When it is ready, it should resemble stiffly mashed potatoes. Put the fufu on a wet plate using a wet wooden spoon, regular spoon, or you can even use your hands if you can handle the heat. Shape it into a round ball for each person. Serving the Okra and Fufu Soup Pour the okra soup into soup bowls. Serve hot. Serve the fufu on a side plate with the okra soup. To eat the fufu, cut it into a bite size piece, dip it in the okra soup, chew and swallow it.",
    "sentences": [
        " Cooking the Meat Season the meat with salt, garlic, pepper and onion.",
        "Feel absolutely free to add any other type of seasoning that you believe will give the meat a much better flavor.",
        "Once you are done seasoning the meat, add water to the meat.",
        "Use your own judgment as to how much water you think is needed.",
        "Cook the meat on low heat for 10 to 15 minutes; this will allow all the different flavors of the seasonings to blend in with the meat, giving it a delicious flavor and a great smell.",
        "After cooking the meat on low heat for 10 to 15 minutes, continue to cook it but just turn the heat on medium.",
        "Cook it for another 30 to 40 minutes.",
        "Always remember to stir the food every now and then until you are done cooking.",
        "Making the Soup Combine the defrosted and chopped okra, seasoning sauce and chicken cube.",
        "Add oil and onions in a separate pot.",
        "Put the pot on the stove, and cook until the oil is really hot.",
        "Once the oil is hot and ready for use, take the already seasoned okra and dump it into the hot boiling oil.",
        "Fry the seasoned okra in the oil on a medium heat for about 10 minutes.",
        "Stir the food frequently, otherwise it will burn.",
        "Make sure not to fry the okra to the point where it becomes crispy.",
        "Add the earlier cooked meat and broth that the meat is in to the cooked okra pieces.",
        "Let this cook together for another 15 to 30 minutes.",
        "You will know when the okra soup is ready because only the okra, meat and oil will remain in the pot; this is the signal of knowing that the soup is fully ready.",
        "Making the Fufu Cook the fufu.",
        "Put warm water into the pot and set it on the stove.",
        "Wait for it to boil.",
        "Once you notice the water boiling, lower the heat and put either plantain flour, yam flour or garri flour in the hot boiling water.",
        "Stir constantly.",
        "Every 2-3 minutes, add more water, as needed.",
        "Sometimes you may find that it is difficult to stir the fufu while it is still on the stove.",
        "If this is the case, you have the option of taking it off the stove and putting it down on a lower surface area where you have better access to stir it.",
        "Keep stirring.",
        "There will be some knot in the dish; this means is that it is not yet ready and it needs to be stirred even more.",
        "Continue to cook the plantain, yam, or garri flour until all the knot disappears.",
        "Add water as needed, make sure that it is thick.",
        "Test to see when the fufu is ready.",
        "The only way of knowing one hundred percent that the fufu is ready is to cut a piece of it from the pot and try it.",
        "You will know if it is ready or not.",
        "When it is ready, it should resemble stiffly mashed potatoes.",
        "Put the fufu on a wet plate using a wet wooden spoon, regular spoon, or you can even use your hands if you can handle the heat.",
        "Shape it into a round ball for each person.",
        "Serving the Okra and Fufu Soup Pour the okra soup into soup bowls.",
        "Serve hot.",
        "Serve the fufu on a side plate with the okra soup.",
        "To eat the fufu, cut it into a bite size piece, dip it in the okra soup, chew and swallow it."
    ]
}