{
    "title": "How to Call a Satellite Phone Number",
    "url": "https://www.wikihow.com/Call-a-Satellite-Phone-Number",
    "category_hierarchy": [
        "Education and Communications",
        "Communication Skills"
    ],
    "methods": [
        {
            "name": "Calling Satellite Phones",
            "steps": [
                {
                    "headline": "Look for a 14 or 15-digit number that indicates it is a satellite phone number.",
                    "description": "This number usually starts with “011”, the US exit code. In many countries the exit code is “00” or “001.”\nFind your country’s exit code at  http://www.howtocallabroad.com/codes.html"
                },
                {
                    "headline": "Enter the prefix associated with the type of phone.",
                    "description": "The most common satellite phone companies are Iridium, Inmarsat and UPT. Each company has a three-digit code associated with it. The prefix for an Iridium phone is 881. The prefix for an Inmarsat phone is usually 870. It can also be 871, 873 or 874. The prefix for the UPT phone is 878. The prefix for other networks are usually 882 and 883."
                },
                {
                    "headline": "Dial the nine-digit number.",
                    "description": "The number may be listed with or without dashes. Complete your call and wait for it to go through."
                }
            ]
        },
        {
            "name": "Calling Satellite Phones Collect",
            "steps": [
                {
                    "headline": "Ask the satellite phone user whether they have a collect calling program.",
                    "description": "These programs assign a terrestrial phone number to the satellite number. Then, the recipient of the call takes the charges, usually part of a monthly plan. The most common of these plans are Iridium’s 1+Access service and Inmarsat’s SatCollect service."
                },
                {
                    "headline": "Make sure they have assigned a number to a country you can call without being charged equal prices.",
                    "description": "Many satellite phone users register a number that corresponds with the country where their family or company is based."
                },
                {
                    "headline": "Dial the number 1 and the nine-digit number associated with the phone.",
                    "description": "It will go through on your end as if you are dialing a local number. If the collect phone number is still in a foreign country, you will need to dial your exit code and then the nine-digit number."
                }
            ]
        }
    ],
    "tyn": [
        "Phone"
    ],
    "text": " Calling Satellite Phones Look for a 14 or 15-digit number that indicates it is a satellite phone number. This number usually starts with “011”, the US exit code. In many countries the exit code is “00” or “001.”\nFind your country’s exit code at  http://www.howtocallabroad.com/codes.html Enter the prefix associated with the type of phone. The most common satellite phone companies are Iridium, Inmarsat and UPT. Each company has a three-digit code associated with it. The prefix for an Iridium phone is 881. The prefix for an Inmarsat phone is usually 870. It can also be 871, 873 or 874. The prefix for the UPT phone is 878. The prefix for other networks are usually 882 and 883. Dial the nine-digit number. The number may be listed with or without dashes. Complete your call and wait for it to go through. Calling Satellite Phones Collect Ask the satellite phone user whether they have a collect calling program. These programs assign a terrestrial phone number to the satellite number. Then, the recipient of the call takes the charges, usually part of a monthly plan. The most common of these plans are Iridium’s 1+Access service and Inmarsat’s SatCollect service. Make sure they have assigned a number to a country you can call without being charged equal prices. Many satellite phone users register a number that corresponds with the country where their family or company is based. Dial the number 1 and the nine-digit number associated with the phone. It will go through on your end as if you are dialing a local number. If the collect phone number is still in a foreign country, you will need to dial your exit code and then the nine-digit number.",
    "sentences": [
        " Calling Satellite Phones Look for a 14 or 15-digit number that indicates it is a satellite phone number.",
        "This number usually starts with “011”, the US exit code.",
        "In many countries the exit code is “00” or “001.”\nFind your country’s exit code at  http://www.howtocallabroad.com/codes.html Enter the prefix associated with the type of phone.",
        "The most common satellite phone companies are Iridium, Inmarsat and UPT.",
        "Each company has a three-digit code associated with it.",
        "The prefix for an Iridium phone is 881.",
        "The prefix for an Inmarsat phone is usually 870.",
        "It can also be 871, 873 or 874.",
        "The prefix for the UPT phone is 878.",
        "The prefix for other networks are usually 882 and 883.",
        "Dial the nine-digit number.",
        "The number may be listed with or without dashes.",
        "Complete your call and wait for it to go through.",
        "Calling Satellite Phones Collect Ask the satellite phone user whether they have a collect calling program.",
        "These programs assign a terrestrial phone number to the satellite number.",
        "Then, the recipient of the call takes the charges, usually part of a monthly plan.",
        "The most common of these plans are Iridium’s 1+Access service and Inmarsat’s SatCollect service.",
        "Make sure they have assigned a number to a country you can call without being charged equal prices.",
        "Many satellite phone users register a number that corresponds with the country where their family or company is based.",
        "Dial the number 1 and the nine-digit number associated with the phone.",
        "It will go through on your end as if you are dialing a local number.",
        "If the collect phone number is still in a foreign country, you will need to dial your exit code and then the nine-digit number."
    ]
}