{
    "title": "How to Measure Gun Barrel",
    "url": "https://www.wikihow.com/Measure-Gun-Barrel",
    "category_hierarchy": [
        "Sports and Fitness",
        "Outdoor Recreation",
        "Guns and Shooting"
    ],
    "methods": [
        {
            "name": "Method One: Revolvers",
            "steps": [
                {
                    "headline": "Unload the gun.",
                    "description": "Open the cylinder and remove any cartridges that are still inside. Point the gun in a safe direction and cup your left hand around the gun, keeping your fingers clear and away from the muzzle. Push or pull the cylinder release latch on the left side of the gun with your right thumb. Swing the cylinder out to the side of the gun. Slip the middle and ring finger of your left hand through the open frame. Turn the gun so that the muzzle faces up. Close your left thumb and fingers around the cylinder. Strike the ejector rod with the base of your palm one time. That should loosen the ammo sufficiently. Allow gravity to take over and drop the cartridges from inside the cylinder. Check all compartments of the cylinder to verify that the gun is unloaded."
                },
                {
                    "headline": "Insert a dowel rod into the muzzle.",
                    "description": "Slide the dowel rod into the barrel of the gun until it touches the face or front of the cartridge cylinder. Use a dowel rod that with a diameter that is smaller than the diameter of the revolver barrel. Do not force the dowel rod into the barrel since doing so can potentially cause damage to the gun. The front face of the cylinder rests just behind the frame of the gun and is the actual start of the barrel. Note that the cylinder is not included in the length of the barrel. When you are unable to push the dowel rod any further into the barrel, it has reached the face of the cartridge cylinder."
                },
                {
                    "headline": "Mark the dowel rod.",
                    "description": "Once the dowel rod is as deep as it will go, draw a line on the side of the dowel rod at the point where the dowel rod first extends out of the muzzle of the barrel. Use a pen, pencil, or marker to draw this line. Make the line as close to the muzzle as possible. Lie the gun down flat on your working surface as you do this."
                },
                {
                    "headline": "Remove the dowel rod.",
                    "description": "Carefully slide the dowel rod out of the gun barrel. Lay the gun aside and place the dowel on a flat working surface. When setting the gun aside, make sure that the muzzle points away from you and away from anyone else. Even though you already unloaded the gun, you should always treat a firearm as though it is loaded."
                },
                {
                    "headline": "Measure the dowel rod.",
                    "description": "Use a measuring stick or measuring stick to measure the dowel rod from the marked point to the end previously inserted into the gun barrel. This measurement is the length of your gun barrel."
                }
            ]
        },
        {
            "name": "Method Two: Semiautomatic Pistols",
            "steps": [
                {
                    "headline": "Unload the gun.",
                    "description": "Eject the magazine and remove any cartridges that are still inside. Hold the gun in your dominant hand and point it in a safe direction. Use your non-dominant hand to press the magazine catch/release latch at the side of the gun. Slide the magazine off with your non-dominant hand or carefully tilt the muzzle of the gun upward until the magazine drops out with the support of gravity."
                },
                {
                    "headline": "Open and close the slide.",
                    "description": "Grab the slide with your non-dominant hand and glide it completely to the rear of the gun. Release the slide and allow it to move forward on its own. Repeat the step two or three times. During the last time, pull the slide to the rear and hold it in place. Use the thumb of your dominant hand to push on the slide catch before letting go of the slide. The slide should be locked open and to the rear. Look into the ejection port and down into the magazine well. Make sure that there is no ammo or debris in the magazine well or the chamber. Sweep away any obstructions with one finger. Push the slide forward to close the breech face again."
                },
                {
                    "headline": "Insert a dowel rod into the muzzle.",
                    "description": "Slide the dowel rod into the muzzle. Continue sliding it into the barrel until it comes to a stop at the breech face. Always use a dowel rod with a diameter that is smaller than the diameter of the barrel. Do not force the dowel rod into the barrel. Note that the breech face is where the cartridge meets the chamber. The chamber of the gun is included in the barrel measurement, which makes this measurement a little different from that of a revolver. You need to make sure that the dowel rod can reach into both the barrel and the chamber, stopping at the point where the cartridge head seats, where you will normally see the firing pin."
                },
                {
                    "headline": "Mark the end of the dowel.",
                    "description": "Draw a line on the dowel rod where it first emerges from the muzzle of the gun. Make the mark as close to the barrel as possible. Use a pencil, pen, or marker to draw it. It might be easiest to do this with the gun lying flat on your work surface."
                },
                {
                    "headline": "Remove the dowel rod.",
                    "description": "Gently remove the dowel from the barrel by sliding it back out through the muzzle. Set the gun aside in a safe spot. Lay the dowel rod down on a flat working surface."
                },
                {
                    "headline": "Measure the dowel rod.",
                    "description": "Measure the distance between the mark you just drew and the end of the dowel rod you just removed from the barrel of the gun. You can use either a measuring stick or measuring tape to do so. The distance between the two points equals the length of the gun barrel."
                }
            ]
        },
        {
            "name": "Method Three: Single Barrel and Side-by-Side Shotgun",
            "steps": [
                {
                    "headline": "Remove any ammo.",
                    "description": "Even if you believe the gun to be unloaded, you should still go through the unloading process to verify that no ammo is inside the shotgun as you measure the barrel. Point the gun in a safe direction and turn it over. Look for a lever that moves up and down at the receiver. This lever is known as an elevator. Flip the elevator up with your dominant hand while pushing back on the slide with your non-dominant hand. This should eject any round inside the magazine from the bottom of the receiver."
                },
                {
                    "headline": "Insert a dowel rod into the barrel.",
                    "description": "Slide a dowel rod into the muzzle of the shotgun, pushing it into the barrel until it hits and stops at the breech face. Always use a dowel rod with a diameter that is smaller than the diameter of the gun barrel to prevent accidental damage to the gun barrel. Never force the dowel rod into the barrel. The point at which the cartridge and chamber meet is referred to as the breech face. The cartridge is not included in the barrel measurement, but the chamber will be."
                },
                {
                    "headline": "Make a mark.",
                    "description": "Use a pen to mark a line around the circumference of the dowel rod, just above the point where it comes out of the muzzle. Make the mark as close to the muzzle as possible for the most accurate measurement. You may need to keep the gun flat on your working surface as you do this. A pencil or marker could be used instead of a marker."
                },
                {
                    "headline": "Slide the dowel rod out.",
                    "description": "Gently slide the dowel rod back out of the barrel. Set the dowel rod flat on your working surface. Carefully set the gun aside, as well. Make sure that the gun points away from you and from any other living being."
                },
                {
                    "headline": "Take a measurement.",
                    "description": "Grab a measuring stick or tape measure and measure the distance between the mark you created and the end of the dowel rod previously inserted into the gun barrel. The distance between these two points is the length of your gun barrel."
                }
            ]
        },
        {
            "name": "Method Four: Pump and Semi-Automatic Shotguns",
            "steps": [
                {
                    "headline": "Empty the gun.",
                    "description": "Go through the unloading process as usual, even if you believe the gun to be empty already. With the gun pointing in a safe direction, turn it over and look for the elevator--a lever that moves up and down, located at the receiver. Use your dominant hand to hold the elevator in the up position. Use your non-dominant hand to simultaneously push back on the slide. Any round inside the magazine should naturally eject from the gun through the bottom of the receiver."
                },
                {
                    "headline": "Close the bolt or breech face.",
                    "description": "Make sure that the bolt of the shotgun or the breech face of the gun is closed before you try to measure it. The length of the barrel for this type of gun does not include the length of the entire barrel piece. Instead, the length is a measurement of the distance between the muzzle end of the barrel and the face of the bolt or breech face when that portion of the gun is closed. Close a bolt by pushing it forward and down. Close a non-bolt breech face by pushing the slide forward."
                },
                {
                    "headline": "Slide an appropriate dowel rod into the barrel.",
                    "description": "Insert a dowel into the muzzle end of the barrel, pushing it down into the barrel until it stops against the bolt or breech face. Use a dowel rod with a diameter that is smaller than the diameter of the barrel. If the barrel has a permanent choke tube attached, include that in your length measurement. If it has a removable choke tube attached, remove the choke tube before sliding the dowel into the barrel and do not include the choke tube in your measurement."
                },
                {
                    "headline": "Make a mark just above the muzzle.",
                    "description": "Draw a line on the dowel rod, placing it just above the muzzle of the gun. You can use a pencil, pen, or marker to do this. Regardless of the instrument you use, keep the line as close to the muzzle as possible. If the gun is not already lying flat on a working surface, you should lay it down while marking the dowel rod. Doing so will likely make the process easier and safer."
                },
                {
                    "headline": "Carefully remove the dowel rod.",
                    "description": "Slide the dowel back out of the barrel. Set it down in front of you on your work surface. Set the gun aside. Make sure that it is pointed in a safe direction."
                },
                {
                    "headline": "Measure the correct distance.",
                    "description": "Measure the distance between the line on your dowel rod and the end of the dowel rod previously inside the shotgun barrel. This distance is the length of your gun barrel."
                }
            ]
        },
        {
            "name": "Method Five: Rifles",
            "steps": [
                {
                    "headline": "Verify that the gun is unloaded.",
                    "description": "Regardless of whether or not you believe the rifle to be unloaded, you should go through the unloading process before attempting to measure the barrel. Note that the measuring process is essentially the same for all rifles, including both bolt-action and semi-automatic rifles. There can be some differences in the unloading process, however. For a bolt-action rifle:Point the gun in a safe direction, supporting the barrel with your dominant hand. Click the bolt upward and back to open it, using your non-dominant hand. Look down into the chamber and into the magazine. If there is any ammo in the gun, carefully slide the bolt into the magazine until it ejects the cartridges. For a semi-automatic rifle:Point the gun in a safe direction. Locate the magazine release latch at the rear of the magazine cover. Pull the latch back to drop the magazine open. The  cartridges inside the magazine should drop out of the bottom."
                },
                {
                    "headline": "Close any bolts or breech faces.",
                    "description": "The length of the barrel spans between the muzzle and the face of the bolt or breech face. Do not measure any portion of the barrel that extends behind the bolt or breech face. Close the bolt by sliding it forward and down. Close the breech face by pushing the slide back and allowing it to snap back forward."
                },
                {
                    "headline": "Slip a dowel rod into the barrel.",
                    "description": "Insert an appropriately sized dowel rod into the muzzle. Slide it into the barrel until it comes to a stop at the face of the bolt or the breech face. The diameter of the dowel should be smaller than the diameter of the gun barrel."
                },
                {
                    "headline": "Mark the dowel rod at the correct point.",
                    "description": "Draw a line just above the muzzle, keeping your writing instrument as close to the muzzle as possible for a more accurate reading. Use a pencil, pen, or permanent marker for best results."
                },
                {
                    "headline": "Remove the dowel rod.",
                    "description": "Slide the dowel out of the barrel. Place the dowel in front of you and set the gun aside. When setting the gun aside, make sure that it is pointing in a safe direction."
                },
                {
                    "headline": "Measure the length.",
                    "description": "Using a tape measure or measuring stick, measure the distance between the line and the end of the dowel previously inside the barrel. The length of this section is the length of the gun barrel."
                }
            ]
        }
    ],
    "tyn": [
        "Dowel rod ",
        "OR",
        " cleaning rod",
        "Measuring tape or measuring stick",
        "Pencil, pen, or marker",
        "Masking tape (optional)"
    ],
    "text": " Method One: Revolvers Unload the gun. Open the cylinder and remove any cartridges that are still inside. Point the gun in a safe direction and cup your left hand around the gun, keeping your fingers clear and away from the muzzle. Push or pull the cylinder release latch on the left side of the gun with your right thumb. Swing the cylinder out to the side of the gun. Slip the middle and ring finger of your left hand through the open frame. Turn the gun so that the muzzle faces up. Close your left thumb and fingers around the cylinder. Strike the ejector rod with the base of your palm one time. That should loosen the ammo sufficiently. Allow gravity to take over and drop the cartridges from inside the cylinder. Check all compartments of the cylinder to verify that the gun is unloaded. Insert a dowel rod into the muzzle. Slide the dowel rod into the barrel of the gun until it touches the face or front of the cartridge cylinder. Use a dowel rod that with a diameter that is smaller than the diameter of the revolver barrel. Do not force the dowel rod into the barrel since doing so can potentially cause damage to the gun. The front face of the cylinder rests just behind the frame of the gun and is the actual start of the barrel. Note that the cylinder is not included in the length of the barrel. When you are unable to push the dowel rod any further into the barrel, it has reached the face of the cartridge cylinder. Mark the dowel rod. Once the dowel rod is as deep as it will go, draw a line on the side of the dowel rod at the point where the dowel rod first extends out of the muzzle of the barrel. Use a pen, pencil, or marker to draw this line. Make the line as close to the muzzle as possible. Lie the gun down flat on your working surface as you do this. Remove the dowel rod. Carefully slide the dowel rod out of the gun barrel. Lay the gun aside and place the dowel on a flat working surface. When setting the gun aside, make sure that the muzzle points away from you and away from anyone else. Even though you already unloaded the gun, you should always treat a firearm as though it is loaded. Measure the dowel rod. Use a measuring stick or measuring stick to measure the dowel rod from the marked point to the end previously inserted into the gun barrel. This measurement is the length of your gun barrel. Method Two: Semiautomatic Pistols Unload the gun. Eject the magazine and remove any cartridges that are still inside. Hold the gun in your dominant hand and point it in a safe direction. Use your non-dominant hand to press the magazine catch/release latch at the side of the gun. Slide the magazine off with your non-dominant hand or carefully tilt the muzzle of the gun upward until the magazine drops out with the support of gravity. Open and close the slide. Grab the slide with your non-dominant hand and glide it completely to the rear of the gun. Release the slide and allow it to move forward on its own. Repeat the step two or three times. During the last time, pull the slide to the rear and hold it in place. Use the thumb of your dominant hand to push on the slide catch before letting go of the slide. The slide should be locked open and to the rear. Look into the ejection port and down into the magazine well. Make sure that there is no ammo or debris in the magazine well or the chamber. Sweep away any obstructions with one finger. Push the slide forward to close the breech face again. Insert a dowel rod into the muzzle. Slide the dowel rod into the muzzle. Continue sliding it into the barrel until it comes to a stop at the breech face. Always use a dowel rod with a diameter that is smaller than the diameter of the barrel. Do not force the dowel rod into the barrel. Note that the breech face is where the cartridge meets the chamber. The chamber of the gun is included in the barrel measurement, which makes this measurement a little different from that of a revolver. You need to make sure that the dowel rod can reach into both the barrel and the chamber, stopping at the point where the cartridge head seats, where you will normally see the firing pin. Mark the end of the dowel. Draw a line on the dowel rod where it first emerges from the muzzle of the gun. Make the mark as close to the barrel as possible. Use a pencil, pen, or marker to draw it. It might be easiest to do this with the gun lying flat on your work surface. Remove the dowel rod. Gently remove the dowel from the barrel by sliding it back out through the muzzle. Set the gun aside in a safe spot. Lay the dowel rod down on a flat working surface. Measure the dowel rod. Measure the distance between the mark you just drew and the end of the dowel rod you just removed from the barrel of the gun. You can use either a measuring stick or measuring tape to do so. The distance between the two points equals the length of the gun barrel. Method Three: Single Barrel and Side-by-Side Shotgun Remove any ammo. Even if you believe the gun to be unloaded, you should still go through the unloading process to verify that no ammo is inside the shotgun as you measure the barrel. Point the gun in a safe direction and turn it over. Look for a lever that moves up and down at the receiver. This lever is known as an elevator. Flip the elevator up with your dominant hand while pushing back on the slide with your non-dominant hand. This should eject any round inside the magazine from the bottom of the receiver. Insert a dowel rod into the barrel. Slide a dowel rod into the muzzle of the shotgun, pushing it into the barrel until it hits and stops at the breech face. Always use a dowel rod with a diameter that is smaller than the diameter of the gun barrel to prevent accidental damage to the gun barrel. Never force the dowel rod into the barrel. The point at which the cartridge and chamber meet is referred to as the breech face. The cartridge is not included in the barrel measurement, but the chamber will be. Make a mark. Use a pen to mark a line around the circumference of the dowel rod, just above the point where it comes out of the muzzle. Make the mark as close to the muzzle as possible for the most accurate measurement. You may need to keep the gun flat on your working surface as you do this. A pencil or marker could be used instead of a marker. Slide the dowel rod out. Gently slide the dowel rod back out of the barrel. Set the dowel rod flat on your working surface. Carefully set the gun aside, as well. Make sure that the gun points away from you and from any other living being. Take a measurement. Grab a measuring stick or tape measure and measure the distance between the mark you created and the end of the dowel rod previously inserted into the gun barrel. The distance between these two points is the length of your gun barrel. Method Four: Pump and Semi-Automatic Shotguns Empty the gun. Go through the unloading process as usual, even if you believe the gun to be empty already. With the gun pointing in a safe direction, turn it over and look for the elevator--a lever that moves up and down, located at the receiver. Use your dominant hand to hold the elevator in the up position. Use your non-dominant hand to simultaneously push back on the slide. Any round inside the magazine should naturally eject from the gun through the bottom of the receiver. Close the bolt or breech face. Make sure that the bolt of the shotgun or the breech face of the gun is closed before you try to measure it. The length of the barrel for this type of gun does not include the length of the entire barrel piece. Instead, the length is a measurement of the distance between the muzzle end of the barrel and the face of the bolt or breech face when that portion of the gun is closed. Close a bolt by pushing it forward and down. Close a non-bolt breech face by pushing the slide forward. Slide an appropriate dowel rod into the barrel. Insert a dowel into the muzzle end of the barrel, pushing it down into the barrel until it stops against the bolt or breech face. Use a dowel rod with a diameter that is smaller than the diameter of the barrel. If the barrel has a permanent choke tube attached, include that in your length measurement. If it has a removable choke tube attached, remove the choke tube before sliding the dowel into the barrel and do not include the choke tube in your measurement. Make a mark just above the muzzle. Draw a line on the dowel rod, placing it just above the muzzle of the gun. You can use a pencil, pen, or marker to do this. Regardless of the instrument you use, keep the line as close to the muzzle as possible. If the gun is not already lying flat on a working surface, you should lay it down while marking the dowel rod. Doing so will likely make the process easier and safer. Carefully remove the dowel rod. Slide the dowel back out of the barrel. Set it down in front of you on your work surface. Set the gun aside. Make sure that it is pointed in a safe direction. Measure the correct distance. Measure the distance between the line on your dowel rod and the end of the dowel rod previously inside the shotgun barrel. This distance is the length of your gun barrel. Method Five: Rifles Verify that the gun is unloaded. Regardless of whether or not you believe the rifle to be unloaded, you should go through the unloading process before attempting to measure the barrel. Note that the measuring process is essentially the same for all rifles, including both bolt-action and semi-automatic rifles. There can be some differences in the unloading process, however. For a bolt-action rifle:Point the gun in a safe direction, supporting the barrel with your dominant hand. Click the bolt upward and back to open it, using your non-dominant hand. Look down into the chamber and into the magazine. If there is any ammo in the gun, carefully slide the bolt into the magazine until it ejects the cartridges. For a semi-automatic rifle:Point the gun in a safe direction. Locate the magazine release latch at the rear of the magazine cover. Pull the latch back to drop the magazine open. The  cartridges inside the magazine should drop out of the bottom. Close any bolts or breech faces. The length of the barrel spans between the muzzle and the face of the bolt or breech face. Do not measure any portion of the barrel that extends behind the bolt or breech face. Close the bolt by sliding it forward and down. Close the breech face by pushing the slide back and allowing it to snap back forward. Slip a dowel rod into the barrel. Insert an appropriately sized dowel rod into the muzzle. Slide it into the barrel until it comes to a stop at the face of the bolt or the breech face. The diameter of the dowel should be smaller than the diameter of the gun barrel. Mark the dowel rod at the correct point. Draw a line just above the muzzle, keeping your writing instrument as close to the muzzle as possible for a more accurate reading. Use a pencil, pen, or permanent marker for best results. Remove the dowel rod. Slide the dowel out of the barrel. Place the dowel in front of you and set the gun aside. When setting the gun aside, make sure that it is pointing in a safe direction. Measure the length. Using a tape measure or measuring stick, measure the distance between the line and the end of the dowel previously inside the barrel. The length of this section is the length of the gun barrel.",
    "sentences": [
        " Method One: Revolvers Unload the gun.",
        "Open the cylinder and remove any cartridges that are still inside.",
        "Point the gun in a safe direction and cup your left hand around the gun, keeping your fingers clear and away from the muzzle.",
        "Push or pull the cylinder release latch on the left side of the gun with your right thumb.",
        "Swing the cylinder out to the side of the gun.",
        "Slip the middle and ring finger of your left hand through the open frame.",
        "Turn the gun so that the muzzle faces up.",
        "Close your left thumb and fingers around the cylinder.",
        "Strike the ejector rod with the base of your palm one time.",
        "That should loosen the ammo sufficiently.",
        "Allow gravity to take over and drop the cartridges from inside the cylinder.",
        "Check all compartments of the cylinder to verify that the gun is unloaded.",
        "Insert a dowel rod into the muzzle.",
        "Slide the dowel rod into the barrel of the gun until it touches the face or front of the cartridge cylinder.",
        "Use a dowel rod that with a diameter that is smaller than the diameter of the revolver barrel.",
        "Do not force the dowel rod into the barrel since doing so can potentially cause damage to the gun.",
        "The front face of the cylinder rests just behind the frame of the gun and is the actual start of the barrel.",
        "Note that the cylinder is not included in the length of the barrel.",
        "When you are unable to push the dowel rod any further into the barrel, it has reached the face of the cartridge cylinder.",
        "Mark the dowel rod.",
        "Once the dowel rod is as deep as it will go, draw a line on the side of the dowel rod at the point where the dowel rod first extends out of the muzzle of the barrel.",
        "Use a pen, pencil, or marker to draw this line.",
        "Make the line as close to the muzzle as possible.",
        "Lie the gun down flat on your working surface as you do this.",
        "Remove the dowel rod.",
        "Carefully slide the dowel rod out of the gun barrel.",
        "Lay the gun aside and place the dowel on a flat working surface.",
        "When setting the gun aside, make sure that the muzzle points away from you and away from anyone else.",
        "Even though you already unloaded the gun, you should always treat a firearm as though it is loaded.",
        "Measure the dowel rod.",
        "Use a measuring stick or measuring stick to measure the dowel rod from the marked point to the end previously inserted into the gun barrel.",
        "This measurement is the length of your gun barrel.",
        "Method Two: Semiautomatic Pistols Unload the gun.",
        "Eject the magazine and remove any cartridges that are still inside.",
        "Hold the gun in your dominant hand and point it in a safe direction.",
        "Use your non-dominant hand to press the magazine catch/release latch at the side of the gun.",
        "Slide the magazine off with your non-dominant hand or carefully tilt the muzzle of the gun upward until the magazine drops out with the support of gravity.",
        "Open and close the slide.",
        "Grab the slide with your non-dominant hand and glide it completely to the rear of the gun.",
        "Release the slide and allow it to move forward on its own.",
        "Repeat the step two or three times.",
        "During the last time, pull the slide to the rear and hold it in place.",
        "Use the thumb of your dominant hand to push on the slide catch before letting go of the slide.",
        "The slide should be locked open and to the rear.",
        "Look into the ejection port and down into the magazine well.",
        "Make sure that there is no ammo or debris in the magazine well or the chamber.",
        "Sweep away any obstructions with one finger.",
        "Push the slide forward to close the breech face again.",
        "Insert a dowel rod into the muzzle.",
        "Slide the dowel rod into the muzzle.",
        "Continue sliding it into the barrel until it comes to a stop at the breech face.",
        "Always use a dowel rod with a diameter that is smaller than the diameter of the barrel.",
        "Do not force the dowel rod into the barrel.",
        "Note that the breech face is where the cartridge meets the chamber.",
        "The chamber of the gun is included in the barrel measurement, which makes this measurement a little different from that of a revolver.",
        "You need to make sure that the dowel rod can reach into both the barrel and the chamber, stopping at the point where the cartridge head seats, where you will normally see the firing pin.",
        "Mark the end of the dowel.",
        "Draw a line on the dowel rod where it first emerges from the muzzle of the gun.",
        "Make the mark as close to the barrel as possible.",
        "Use a pencil, pen, or marker to draw it.",
        "It might be easiest to do this with the gun lying flat on your work surface.",
        "Remove the dowel rod.",
        "Gently remove the dowel from the barrel by sliding it back out through the muzzle.",
        "Set the gun aside in a safe spot.",
        "Lay the dowel rod down on a flat working surface.",
        "Measure the dowel rod.",
        "Measure the distance between the mark you just drew and the end of the dowel rod you just removed from the barrel of the gun.",
        "You can use either a measuring stick or measuring tape to do so.",
        "The distance between the two points equals the length of the gun barrel.",
        "Method Three: Single Barrel and Side-by-Side Shotgun Remove any ammo.",
        "Even if you believe the gun to be unloaded, you should still go through the unloading process to verify that no ammo is inside the shotgun as you measure the barrel.",
        "Point the gun in a safe direction and turn it over.",
        "Look for a lever that moves up and down at the receiver.",
        "This lever is known as an elevator.",
        "Flip the elevator up with your dominant hand while pushing back on the slide with your non-dominant hand.",
        "This should eject any round inside the magazine from the bottom of the receiver.",
        "Insert a dowel rod into the barrel.",
        "Slide a dowel rod into the muzzle of the shotgun, pushing it into the barrel until it hits and stops at the breech face.",
        "Always use a dowel rod with a diameter that is smaller than the diameter of the gun barrel to prevent accidental damage to the gun barrel.",
        "Never force the dowel rod into the barrel.",
        "The point at which the cartridge and chamber meet is referred to as the breech face.",
        "The cartridge is not included in the barrel measurement, but the chamber will be.",
        "Make a mark.",
        "Use a pen to mark a line around the circumference of the dowel rod, just above the point where it comes out of the muzzle.",
        "Make the mark as close to the muzzle as possible for the most accurate measurement.",
        "You may need to keep the gun flat on your working surface as you do this.",
        "A pencil or marker could be used instead of a marker.",
        "Slide the dowel rod out.",
        "Gently slide the dowel rod back out of the barrel.",
        "Set the dowel rod flat on your working surface.",
        "Carefully set the gun aside, as well.",
        "Make sure that the gun points away from you and from any other living being.",
        "Take a measurement.",
        "Grab a measuring stick or tape measure and measure the distance between the mark you created and the end of the dowel rod previously inserted into the gun barrel.",
        "The distance between these two points is the length of your gun barrel.",
        "Method Four: Pump and Semi-Automatic Shotguns Empty the gun.",
        "Go through the unloading process as usual, even if you believe the gun to be empty already.",
        "With the gun pointing in a safe direction, turn it over and look for the elevator--a lever that moves up and down, located at the receiver.",
        "Use your dominant hand to hold the elevator in the up position.",
        "Use your non-dominant hand to simultaneously push back on the slide.",
        "Any round inside the magazine should naturally eject from the gun through the bottom of the receiver.",
        "Close the bolt or breech face.",
        "Make sure that the bolt of the shotgun or the breech face of the gun is closed before you try to measure it.",
        "The length of the barrel for this type of gun does not include the length of the entire barrel piece.",
        "Instead, the length is a measurement of the distance between the muzzle end of the barrel and the face of the bolt or breech face when that portion of the gun is closed.",
        "Close a bolt by pushing it forward and down.",
        "Close a non-bolt breech face by pushing the slide forward.",
        "Slide an appropriate dowel rod into the barrel.",
        "Insert a dowel into the muzzle end of the barrel, pushing it down into the barrel until it stops against the bolt or breech face.",
        "Use a dowel rod with a diameter that is smaller than the diameter of the barrel.",
        "If the barrel has a permanent choke tube attached, include that in your length measurement.",
        "If it has a removable choke tube attached, remove the choke tube before sliding the dowel into the barrel and do not include the choke tube in your measurement.",
        "Make a mark just above the muzzle.",
        "Draw a line on the dowel rod, placing it just above the muzzle of the gun.",
        "You can use a pencil, pen, or marker to do this.",
        "Regardless of the instrument you use, keep the line as close to the muzzle as possible.",
        "If the gun is not already lying flat on a working surface, you should lay it down while marking the dowel rod.",
        "Doing so will likely make the process easier and safer.",
        "Carefully remove the dowel rod.",
        "Slide the dowel back out of the barrel.",
        "Set it down in front of you on your work surface.",
        "Set the gun aside.",
        "Make sure that it is pointed in a safe direction.",
        "Measure the correct distance.",
        "Measure the distance between the line on your dowel rod and the end of the dowel rod previously inside the shotgun barrel.",
        "This distance is the length of your gun barrel.",
        "Method Five: Rifles Verify that the gun is unloaded.",
        "Regardless of whether or not you believe the rifle to be unloaded, you should go through the unloading process before attempting to measure the barrel.",
        "Note that the measuring process is essentially the same for all rifles, including both bolt-action and semi-automatic rifles.",
        "There can be some differences in the unloading process, however.",
        "For a bolt-action rifle:Point the gun in a safe direction, supporting the barrel with your dominant hand.",
        "Click the bolt upward and back to open it, using your non-dominant hand.",
        "Look down into the chamber and into the magazine.",
        "If there is any ammo in the gun, carefully slide the bolt into the magazine until it ejects the cartridges.",
        "For a semi-automatic rifle:Point the gun in a safe direction.",
        "Locate the magazine release latch at the rear of the magazine cover.",
        "Pull the latch back to drop the magazine open.",
        "The  cartridges inside the magazine should drop out of the bottom.",
        "Close any bolts or breech faces.",
        "The length of the barrel spans between the muzzle and the face of the bolt or breech face.",
        "Do not measure any portion of the barrel that extends behind the bolt or breech face.",
        "Close the bolt by sliding it forward and down.",
        "Close the breech face by pushing the slide back and allowing it to snap back forward.",
        "Slip a dowel rod into the barrel.",
        "Insert an appropriately sized dowel rod into the muzzle.",
        "Slide it into the barrel until it comes to a stop at the face of the bolt or the breech face.",
        "The diameter of the dowel should be smaller than the diameter of the gun barrel.",
        "Mark the dowel rod at the correct point.",
        "Draw a line just above the muzzle, keeping your writing instrument as close to the muzzle as possible for a more accurate reading.",
        "Use a pencil, pen, or permanent marker for best results.",
        "Remove the dowel rod.",
        "Slide the dowel out of the barrel.",
        "Place the dowel in front of you and set the gun aside.",
        "When setting the gun aside, make sure that it is pointing in a safe direction.",
        "Measure the length.",
        "Using a tape measure or measuring stick, measure the distance between the line and the end of the dowel previously inside the barrel.",
        "The length of this section is the length of the gun barrel."
    ]
}