{
    "title": "How to Prevent Mosquito Breeding in Rain Barrels",
    "url": "https://www.wikihow.com/Prevent-Mosquito-Breeding-in-Rain-Barrels",
    "category_hierarchy": [
        "Health",
        "Infectious Diseases",
        "Animal to Human Infections (Zoonoses)",
        "Insect Borne Diseases"
    ],
    "methods": [
        {
            "name": "Using Mosquito Deterrents",
            "steps": [
                {
                    "headline": "Cover openings with a double layer of window screen material.",
                    "description": "Mosquitos will get into your rain barrel and breed if there is nothing covering the openings. To prevent this, place a double layer over the top of the rain barrel and over any openings on the side, such as over the overflow port. You can also purchase mosquito-proof screen material in a hardware store, which is a special type of screen that is only ⁄16 in (0.16 cm) thick. If the rain water barrel is filled by a downspout coming from a roof, make sure to cover the top of the down spout with window screen material. Mosquitos can enter here as well."
                },
                {
                    "headline": "Pour 1 to 2 cups (240 to 470 mL) of cooking oil into the water.",
                    "description": "Cooking oil will coat the top of the water and prevent any larvae that get into the barrel from getting oxygen. This will suffocate them and cause them to die. A thin layer of vegetable oil will not have a negative effect on any plants you water with the rain water either. You will only need ⁄8 in (0.32 cm) of oil at the top of the barrel for this to be effective."
                },
                {
                    "headline": "Add mosquito dunk to the rain water to prevent larvae from hatching.",
                    "description": "Mosquito dunk, or Bacillus thuringiensis israelensis (Bti), is a commercially available product that you can add to your rain water barrel. This product is safe to use in rain barrels. It’s made from a naturally occurring soil bacteria that kills any larvae that end up in the water. Make sure to follow the manufacturer’s instructions for how much of the product to add to your rain water barrel and how often to use it. Warning: Rain water is not safe for human consumption, so do not drink the rain water even if it is free from mosquitos."
                }
            ]
        },
        {
            "name": "Maintaining a Mosquito-Free Barrel",
            "steps": [
                {
                    "headline": "Use the collected rain water as soon as possible.",
                    "description": "Don’t allow the water to sit for more than 1 week after it rains. This is the average amount of time that it takes for eggs to develop into mosquitos in warm weather, and once this happens it can be very difficult to control the mosquitos. If you need to store the rain water for longer than 72 hours, cover the barrel with a tight-fitting lid. You may also want to use another deterrent to prevent mosquitos from breeding if you cannot use the water right away, such as mosquito dunk or vegetable oil. Tip: Some rain water barrels have decorative tops where water may pool. Dump this water immediately to prevent mosquitos from breeding in it."
                },
                {
                    "headline": "Scoop water out of the barrel with a white cup to check for larva daily.",
                    "description": "Mosquito larvae will be easily visible against a white backdrop so scoop a cup of the water out of the barrel daily and inspect it. You will see black or brown squiggly lines if larva are present or C-shaped brown or black shapes if there are pupae in the water. Repeat this once per day after collecting water in the rain barrel."
                },
                {
                    "headline": "Dump all of the water out of the barrel if you find mosquito larvae.",
                    "description": "If the barrel is infested, dump it immediately or the mosquitos will continue to grow and breed. Do not allow animals to drink this water or use it to water a vegetable garden. Dump it into a field or other space away from where humans and animals are present. Try using the water on a patch of well-draining soil well away from your home, people, and animals."
                },
                {
                    "headline": "Make repairs to the barrel right away if needed.",
                    "description": "If any of the fittings are loose or broken, fix them immediately. These loose fittings could serve as entry points for mosquitos. Tighten any loose screws or replace fittings completely if they are not fixable. Make sure to check the screen for any cuts, holes, or tears where mosquitos might enter the rain barrel and repair the screen right away. You can patch smaller holes with extra screen material, but larger tears might require a totally new piece of screen."
                }
            ]
        },
        {
            "name": "Cleaning and Storing the Barrel",
            "steps": [
                {
                    "headline": "Scrub out the barrel with warm, soapy water once per month.",
                    "description": "Pour 2 to 3 US gal (7.6 to 11.4 L) of warm water and ⁄4  c (59 mL) of dish soap into the rain water barrel after you empty it. Then, scrub the inside of the barrel with an abrasive sponge and rinse the barrel thoroughly with clean water. This will remove any mosquito eggs that may be attached to the sides of the barrel. Try to clean the barrel this way at least once per month while your rain water barrel is in use or any time you detect an infestation."
                },
                {
                    "headline": "Sanitize the barrel with a diluted bleach solution after you wash it.",
                    "description": "Combine ⁄4  c (59 mL) of bleach with 1 US gal (3.8 L) of water and swish it around inside the rain water barrel. Ensure that the bleach solution gets over all of the surfaces inside of the barrel and then dump out the excess. This will disinfect the barrel and help to kill any bacteria that mosquitos or their larvae might feed on. Sanitize the inside of the rain water barrel in this way every time after scrubbing out the inside of it."
                },
                {
                    "headline": "Store the barrel upside down indoors when not in use.",
                    "description": "After you have thoroughly cleaned and sanitized the barrel and you no longer need it for collecting rain water, turn it upside down. Store the barrel in a shed, garage, or other indoor location until you need it again. This will prevent mosquitos from getting into the barrel and infesting it while it is not in use. Tip: Make sure that you close any valves on the rain water barrel while it is not in use. This will also help to prevent mosquitos from getting into the barrel."
                }
            ]
        }
    ],
    "tyn": [
        "Using Mosquito Deterrents",
        "Window screen material",
        "Tools for repairing rain barrel",
        "Vegetable oil",
        "Mosquito dunk",
        "Maintaining a Mosquito-Free Barrel",
        "White cup",
        "Cleaning and Storing the Barrel",
        "Abrasive sponge or scrub brush",
        "Dish soap",
        "Bleach",
        "Water",
        "Bucket",
        "Measuring cups"
    ],
    "text": " Using Mosquito Deterrents Cover openings with a double layer of window screen material. Mosquitos will get into your rain barrel and breed if there is nothing covering the openings. To prevent this, place a double layer over the top of the rain barrel and over any openings on the side, such as over the overflow port. You can also purchase mosquito-proof screen material in a hardware store, which is a special type of screen that is only ⁄16 in (0.16 cm) thick. If the rain water barrel is filled by a downspout coming from a roof, make sure to cover the top of the down spout with window screen material. Mosquitos can enter here as well. Pour 1 to 2 cups (240 to 470 mL) of cooking oil into the water. Cooking oil will coat the top of the water and prevent any larvae that get into the barrel from getting oxygen. This will suffocate them and cause them to die. A thin layer of vegetable oil will not have a negative effect on any plants you water with the rain water either. You will only need ⁄8 in (0.32 cm) of oil at the top of the barrel for this to be effective. Add mosquito dunk to the rain water to prevent larvae from hatching. Mosquito dunk, or Bacillus thuringiensis israelensis (Bti), is a commercially available product that you can add to your rain water barrel. This product is safe to use in rain barrels. It’s made from a naturally occurring soil bacteria that kills any larvae that end up in the water. Make sure to follow the manufacturer’s instructions for how much of the product to add to your rain water barrel and how often to use it. Warning: Rain water is not safe for human consumption, so do not drink the rain water even if it is free from mosquitos. Maintaining a Mosquito-Free Barrel Use the collected rain water as soon as possible. Don’t allow the water to sit for more than 1 week after it rains. This is the average amount of time that it takes for eggs to develop into mosquitos in warm weather, and once this happens it can be very difficult to control the mosquitos. If you need to store the rain water for longer than 72 hours, cover the barrel with a tight-fitting lid. You may also want to use another deterrent to prevent mosquitos from breeding if you cannot use the water right away, such as mosquito dunk or vegetable oil. Tip: Some rain water barrels have decorative tops where water may pool. Dump this water immediately to prevent mosquitos from breeding in it. Scoop water out of the barrel with a white cup to check for larva daily. Mosquito larvae will be easily visible against a white backdrop so scoop a cup of the water out of the barrel daily and inspect it. You will see black or brown squiggly lines if larva are present or C-shaped brown or black shapes if there are pupae in the water. Repeat this once per day after collecting water in the rain barrel. Dump all of the water out of the barrel if you find mosquito larvae. If the barrel is infested, dump it immediately or the mosquitos will continue to grow and breed. Do not allow animals to drink this water or use it to water a vegetable garden. Dump it into a field or other space away from where humans and animals are present. Try using the water on a patch of well-draining soil well away from your home, people, and animals. Make repairs to the barrel right away if needed. If any of the fittings are loose or broken, fix them immediately. These loose fittings could serve as entry points for mosquitos. Tighten any loose screws or replace fittings completely if they are not fixable. Make sure to check the screen for any cuts, holes, or tears where mosquitos might enter the rain barrel and repair the screen right away. You can patch smaller holes with extra screen material, but larger tears might require a totally new piece of screen. Cleaning and Storing the Barrel Scrub out the barrel with warm, soapy water once per month. Pour 2 to 3 US gal (7.6 to 11.4 L) of warm water and ⁄4  c (59 mL) of dish soap into the rain water barrel after you empty it. Then, scrub the inside of the barrel with an abrasive sponge and rinse the barrel thoroughly with clean water. This will remove any mosquito eggs that may be attached to the sides of the barrel. Try to clean the barrel this way at least once per month while your rain water barrel is in use or any time you detect an infestation. Sanitize the barrel with a diluted bleach solution after you wash it. Combine ⁄4  c (59 mL) of bleach with 1 US gal (3.8 L) of water and swish it around inside the rain water barrel. Ensure that the bleach solution gets over all of the surfaces inside of the barrel and then dump out the excess. This will disinfect the barrel and help to kill any bacteria that mosquitos or their larvae might feed on. Sanitize the inside of the rain water barrel in this way every time after scrubbing out the inside of it. Store the barrel upside down indoors when not in use. After you have thoroughly cleaned and sanitized the barrel and you no longer need it for collecting rain water, turn it upside down. Store the barrel in a shed, garage, or other indoor location until you need it again. This will prevent mosquitos from getting into the barrel and infesting it while it is not in use. Tip: Make sure that you close any valves on the rain water barrel while it is not in use. This will also help to prevent mosquitos from getting into the barrel.",
    "sentences": [
        " Using Mosquito Deterrents Cover openings with a double layer of window screen material.",
        "Mosquitos will get into your rain barrel and breed if there is nothing covering the openings.",
        "To prevent this, place a double layer over the top of the rain barrel and over any openings on the side, such as over the overflow port.",
        "You can also purchase mosquito-proof screen material in a hardware store, which is a special type of screen that is only ⁄16 in (0.16 cm) thick.",
        "If the rain water barrel is filled by a downspout coming from a roof, make sure to cover the top of the down spout with window screen material.",
        "Mosquitos can enter here as well.",
        "Pour 1 to 2 cups (240 to 470 mL) of cooking oil into the water.",
        "Cooking oil will coat the top of the water and prevent any larvae that get into the barrel from getting oxygen.",
        "This will suffocate them and cause them to die.",
        "A thin layer of vegetable oil will not have a negative effect on any plants you water with the rain water either.",
        "You will only need ⁄8 in (0.32 cm) of oil at the top of the barrel for this to be effective.",
        "Add mosquito dunk to the rain water to prevent larvae from hatching.",
        "Mosquito dunk, or Bacillus thuringiensis israelensis (Bti), is a commercially available product that you can add to your rain water barrel.",
        "This product is safe to use in rain barrels.",
        "It’s made from a naturally occurring soil bacteria that kills any larvae that end up in the water.",
        "Make sure to follow the manufacturer’s instructions for how much of the product to add to your rain water barrel and how often to use it.",
        "Warning: Rain water is not safe for human consumption, so do not drink the rain water even if it is free from mosquitos.",
        "Maintaining a Mosquito-Free Barrel Use the collected rain water as soon as possible.",
        "Don’t allow the water to sit for more than 1 week after it rains.",
        "This is the average amount of time that it takes for eggs to develop into mosquitos in warm weather, and once this happens it can be very difficult to control the mosquitos.",
        "If you need to store the rain water for longer than 72 hours, cover the barrel with a tight-fitting lid.",
        "You may also want to use another deterrent to prevent mosquitos from breeding if you cannot use the water right away, such as mosquito dunk or vegetable oil.",
        "Tip: Some rain water barrels have decorative tops where water may pool.",
        "Dump this water immediately to prevent mosquitos from breeding in it.",
        "Scoop water out of the barrel with a white cup to check for larva daily.",
        "Mosquito larvae will be easily visible against a white backdrop so scoop a cup of the water out of the barrel daily and inspect it.",
        "You will see black or brown squiggly lines if larva are present or C-shaped brown or black shapes if there are pupae in the water.",
        "Repeat this once per day after collecting water in the rain barrel.",
        "Dump all of the water out of the barrel if you find mosquito larvae.",
        "If the barrel is infested, dump it immediately or the mosquitos will continue to grow and breed.",
        "Do not allow animals to drink this water or use it to water a vegetable garden.",
        "Dump it into a field or other space away from where humans and animals are present.",
        "Try using the water on a patch of well-draining soil well away from your home, people, and animals.",
        "Make repairs to the barrel right away if needed.",
        "If any of the fittings are loose or broken, fix them immediately.",
        "These loose fittings could serve as entry points for mosquitos.",
        "Tighten any loose screws or replace fittings completely if they are not fixable.",
        "Make sure to check the screen for any cuts, holes, or tears where mosquitos might enter the rain barrel and repair the screen right away.",
        "You can patch smaller holes with extra screen material, but larger tears might require a totally new piece of screen.",
        "Cleaning and Storing the Barrel Scrub out the barrel with warm, soapy water once per month.",
        "Pour 2 to 3 US gal (7.6 to 11.4 L) of warm water and ⁄4  c (59 mL) of dish soap into the rain water barrel after you empty it.",
        "Then, scrub the inside of the barrel with an abrasive sponge and rinse the barrel thoroughly with clean water.",
        "This will remove any mosquito eggs that may be attached to the sides of the barrel.",
        "Try to clean the barrel this way at least once per month while your rain water barrel is in use or any time you detect an infestation.",
        "Sanitize the barrel with a diluted bleach solution after you wash it.",
        "Combine ⁄4  c (59 mL) of bleach with 1 US gal (3.8 L) of water and swish it around inside the rain water barrel.",
        "Ensure that the bleach solution gets over all of the surfaces inside of the barrel and then dump out the excess.",
        "This will disinfect the barrel and help to kill any bacteria that mosquitos or their larvae might feed on.",
        "Sanitize the inside of the rain water barrel in this way every time after scrubbing out the inside of it.",
        "Store the barrel upside down indoors when not in use.",
        "After you have thoroughly cleaned and sanitized the barrel and you no longer need it for collecting rain water, turn it upside down.",
        "Store the barrel in a shed, garage, or other indoor location until you need it again.",
        "This will prevent mosquitos from getting into the barrel and infesting it while it is not in use.",
        "Tip: Make sure that you close any valves on the rain water barrel while it is not in use.",
        "This will also help to prevent mosquitos from getting into the barrel."
    ]
}